{"id":1007,"date":"2013-09-07T22:16:20","date_gmt":"2013-09-07T21:16:20","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1007"},"modified":"2024-07-04T05:26:11","modified_gmt":"2024-07-04T05:26:11","slug":"imam-al-aajurriy-on-the-characteristics-of-the-people-of-the-quran","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/imam-al-aajurriy-on-the-characteristics-of-the-people-of-the-quran\/","title":{"rendered":"Imam Al-Aajurriy on the Characteristics of the People of the Qur&#8217;an"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1007?action=genpdf&amp;id=1007\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salaatu Was Salaamu &#8216;Alaa Rasoolillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>From the many people who claim to call to the Qur&#8217;aan and implementing it in these times, few are those whos call is in accordance with that which we saw the Salaf of this Ummah upon, in regards to following it and &#8216;truly&#8217; adorning oneself with its <!--more-->characteristics and making manifest the mannerisms of its carriers. Contrast between the words of this great Imaam and then the words and actions of those who couple their call to the Qur&#8217;aan with play and amusement and entertainment and innovation and self-aggrandizement and who give more importance to the &#8216;sing-song&#8217; of annaasheed than they do the Book of Allah! Wallahul Musta&#8217;aan<\/p>\n<p>The following is beautiful advice in that regard from the great Imaam and advisor of this Ummah and the people of Sunnah Al Immamul Aajurry.<\/p>\n<p>Al Imaamul Aajurry states concerning the people of the Qur&#8217;aan:<\/p>\n<p><em>&#8220;..It is befitting that he makes the Qur&#8217;aan the spring of his heart (As occurs in an authentic dua, and the meaning of &#8216;spring of our hearts&#8217; is just as the season of spring brings life to dead earth through rain etc and is a season that generally brings happiness then here one supplicates that Allah makes the Qur&#8217;aan bring life and happiness to his heart as shaikhul Islaam and others mention see Majmoo&#8217; Al Fataawaa 15\/156), with it he brings life to that which is ruined from his heart. He adorns himself with the mannerisms of the Qur&#8217;aan and he manifests noble character the like of which makes him distinguished from those who do not read the Qur&#8217;aan.<\/em><\/p>\n<p>The first of the things that he should do:<\/p>\n<p>1. He implements the fear of Allah &#8211; Azza Wa Jall &#8211; secretly and in public. That is by observing piety in that which he eats and that which he drinks, that which he wears, and how he earns his wealth. He is one that has clear-sightedness in regards to the time in which he lives, and the (forms) of corruption present among its people. He is cautious of them, in preservation of his religion. He proceeds for its cause while being concerned with rectifying that which is damaged from it. He guards his tongue and clearly distinguishes his speech.<\/p>\n<p>If he speaks he speaks with knowledge, if he sees that it is right to speak. And if he remains silent he does so upon knowledge, if it is right to remain silent. He rarely concerns himself with that which is of no concern to him. He fears his tongue more than he fears his own enemy. He imprisons his own tongue the way he would restrain his enemy, in order to be secure from its evil and the evil outcome that ensues from that.<\/p>\n<p>He laughs little about that which the people laugh, due to the bad outcome of (blameworthy) laughter. If he is pleased about something that agrees with the truth he smiles. He dislikes joking, fearing he will fall into (blameworthy) frolic. If he jokes, he speaks the truth. He is pleasant-faced, and his speech is good.<\/p>\n<p>He does not praise himself for what he possesses, (if that is the case) then what about what he does not possess. He is cautious not to let the desires of his soul overcome him and due to that fall into what displeases his patron lord (Allah). He doesn&#8217;t backbite anyone neither does he belittle anyone, he doesn&#8217;t curse anyone, neither does he use Peoples calamities to dispraise them. He doesn&#8217;t transgress against an individual, he doesn&#8217;t envy him, nor does he harbour bad suspicions about him unless he deserves that. (If he envies) he envies based upon knowledge, (if he has suspicion) he has it based upon knowledge, he speaks about Peoples errors with knowledge, and he remains silent about the<br>\n<!--more--><br>\nrealities of (some) people based upon knowledge.<\/p>\n<p>He makes the Qur&#8217;aan<\/p>\n<blockquote><p>and<\/p><\/blockquote>\n<p>the Sunnah and correct understanding his evidence for every noble and beautiful mannerism. He preserves his limbs from what he has been prohibited from. He doesn&#8217;t act ignorantly, and if someone acts ignorantly with him he is clement and forbearing. He doesn&#8217;t oppress, and if he is oppressed he pardons. He doesn&#8217;t transgress against anyone, and if someone transgresses against him, he is patient. He suppresses his anger in order to please his lord and infuriate his enemy. He himself is humble, if the truth is said to him he accepts it, whether it comes from one young or old.<\/p>\n<p>He seeks only that his station be raised by Allah not anyone in creation. He hates pride, and fears for himself from it. He does not eat by way of the Qur&#8217;aan, neither does he like that his needs be fulfilled for him due to it. He doesn&#8217;t hasten towards the children of kings with it (i.e. in order to seek station with them), nor does he sit among the wealthy with it in order that they may show generosity to him.<\/p>\n<p>If the people aquire abundance from the dunya without fiqh or clear-sightedness, he may earn (just) a little but with fiqh and knowledge. If the people adorn themselves with soft and magnificent (garments), he wears, from that which is halaal, what will cover his aura. If he receives (from sustenance) that which is more abundant he (possibly) expands. If his sustenance is restricted he holds back. He is satisfied with little and it suffices him and he is cautious of the dunya that it doesn&#8217;t cause him to transgress.<\/p>\n<p>He follows the affairs that are compulsory in the Qur&#8217;aan and the Sunnah, he eats his food <strong>with knowledge<\/strong>,he drinks <strong>with knowledge<\/strong>, he adorns himself <strong>with knowledge<\/strong> and he sleeps <strong>with knowledge<\/strong>. He has relations with his wife <strong>with knowledge <\/strong>and he accompanies his brothers <strong>with knowledge<\/strong>. He visits them <strong>with knowledge<\/strong>, he seeks permission to enter upon them <strong>with knowledge <\/strong>and he lives besides his neighbour <strong>with knowledge<\/strong>&#8230;&#8217;<\/p>\n<p>he continues..<\/p>\n<p>&#8216;..He accompanies the believer <strong>with knowledge<\/strong>, and he sits with them <strong>with knowledge<\/strong>. Whoever accompanies him, he benefits them. He is a good companion to those he sits with. If he teaches someone, he is gentle with them. He is not harsh with the one who makes a mistake nor does he embarass him, clement with his affairs, patient while teaching people good. The student enjoys his company and he makes the one who sits with him happy. Sitting with him brings about good, for he implements the manners of the Qur&#8217;aan and the Sunnah with those he sits with..&#8217;<\/p>\n<p>(Akhlaaqu Hamalatil Qur&#8217;aan P27)<\/p>\n<p>Look at how Imaam Al Aajurry concentrates upon the carrier of the Qur&#8217;aan acting with knowledge and not ignorance or emotion, which is without doubt the characteristic of the Sunni. He acts or abandons acting based upon knowledge. We also see the emphasis upon observing knowledge with how one sits. The person of Sunnah does so <strong>with knowledge <\/strong>and he may leave sitting with individuals based upon knowledge with a view to preserving his deen and his heart.<\/p>\n<p>Wafaqallahul Jamee&#8217;<\/p>\n<p>Abu Hakeem<\/p>\n\n\n<p> @abuhakeembilal <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how knowledge and action based on the Qur&#8217;an shape the character of a true believer, as explained by Imam Al-Aajurriy.<\/p>\n","protected":false},"author":1,"featured_media":8903,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[12,13,22],"tags":[],"class_list":["post-1007","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-manhaj","category-miscellaneous","category-worship"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/09\/Imam-Al-Aajurriy-on-the-Characteristics-of-the-People-of-the-Quran.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1007","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1007"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1007\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8903"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1007"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1007"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1007"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}