{"id":1022,"date":"2013-09-18T14:14:53","date_gmt":"2013-09-18T13:14:53","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1022"},"modified":"2024-07-04T04:55:37","modified_gmt":"2024-07-04T04:55:37","slug":"hadith-grading-authenticity-a-beginners-guide","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/hadith-grading-authenticity-a-beginners-guide\/","title":{"rendered":"Hadith Grading &amp; Authenticity: A Beginner&#8217;s Guide"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1022?action=genpdf&amp;id=1022\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salaatu Was Salaamu &#8216;Alaa Rasoolillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>The Messenger of Allah &#8211; Sallallahu Alaihi Was Salam said in a popular hadeeth that was collected by Haakim (4\/449) and Abu Daawood At Tayaalisi and Ad Daarimi (2\/213) and declared &#8216;Saheeh&#8217; By Shaikh Albaani in &#8216;As Silsilah As Saheehah (1956) upon the authority of Umar and others:<!--more--><\/p>\n<p>&#8220;<strong><em>There will not cease to be a group from among my Ummah manifest upon the truth until the hour is established&#8221; and there occurs in a variant version &#8220;..not being harmed by those who forsake them or those who oppose them<\/em><\/strong>..&#8221;<\/p>\n<p>Imaam Ahmad &#8211; Rahimahullah (and likewise Yazeed Ibn Haroon) said &#8220;<em>If they are not the people of Hadeeth then I don&#8217;t know who they are<\/em>!&#8221;<\/p>\n<p>Due to their defense of the deen and particularly the Sunnah of the Messenger of Allah and its correct understanding they are those who the Messenger of Allah described as being &#8220;..<strong><em>Manifest Upon the truth<\/em><\/strong>..&#8221;<\/p>\n<p>In the path of protecting and defending the Sunnah the scholars of Hadeeth developed a science taken from, and based upon the texts of the book and the Sunnah and the understanding of the Salaf of this Ummah that would later be known as &#8216;Mustalahul Hadeeth&#8217; (مصطلح الحديث) or &#8216;Uloomil Hadeeth (علوم الحديث) &#8216;The Science of Hadeeth&#8217;<\/p>\n<p>When this Science was developed to protect the Sunnah of the Messenger of Allah &#8211; Sallallahu alaihi Was Salam, it is befitting that the people of Sunnah in every time have knowledge of this most important Science and its areas of application in our time, particularly during periods of wherein the propagation of innovations has increased. It indeed is manifest error to believe that the application of this science is restricted to the era in which it was developed.<\/p>\n<p>Imaam Haakim An Naisaaboori mentions in the introduction of one of the most important works in this field &#8216;Ma&#8217;rifatul &#8216;Uloomil Hadeeth&#8217; discussing the reasons for his authorship:<\/p>\n<p>&#8220;<em>Amma ba&#8217;d: Indeed when I observed innovations in our time becoming widespread, and the people s knowledge of the fundamentals of the Sunnah depleting, alongside the fact that the people have become absorbed in writing narrations and (the fact that) there is an abundance of those who seek it (sadly) upon negligence and heedlessness, I was inspired by this to author a concise book comprising the categories of the knowledge of hadeeth, the like of which the seeker of hadeeth and those who persevere in seeking it will need<\/em>&#8230;&#8221;<\/p>\n<p>(Ma&#8217;riful &#8216;Uloomil Hadeeth p 35)<\/p>\n<p>Shaikh Uthaimeen clarifies that one of the important branches of the science of hadeeth known as &#8216;Al Jarh Wat Ta&#8217;deel&#8217; (The Science of criticizing or praising individuals which was done in order to ascertain whether or not their narration should be accepted or rejected,is not dead as some people claim.<\/p>\n<p>The questioner asked &#8216;Has the sunnah of &#8216;Al Jarh Wat Ta&#8217;deel died? and what is the ruling on speaking about the one who opposes (the Sunnah), that is, ignoring (the issue of) his personality.<\/p>\n<p>He repied: &#8220;<em>I fear that this is a statement of truth by which falsehood is intended. Al-Jarh wal-Ta&#8217;deel has not died and nor has it been buried, and nor has it become ill, and all praise is due to Allaah. It is established, al-Jarh wal-Ta&#8217;deel occurs with respect to witnesses with the judge, it is possible that they are disparaging a disputant and they are requested for evidence, and it also occurs in reports (riwaayah) and we have heard the recitation of our imaam [referring to the prayer that had just finished in which the Imaam recited the verse], &#8220;<strong><em>O you who believe, when a faasiq comes to you with news, then verify it<\/em><\/strong>&#8221; (49:6).<br>\nSo al-Jarh wal-Ta&#8217;deel has never ceased to remain, as long as something from humanity remains, as long as something from humanity remains, then al-Jarh wal-Ta&#8217;deel remains. However, I fear that a person might say, &#8220;This person is disparaged&#8221; but he is not disparaged, and hence this fatwa is taken as a means to spread the faults of the creation. <\/em><\/p>\n<p>For this reason, I say: When there is a fault in a person, if the best interest, or need, or necessity requires for it to be explained, then there is no harm in that, there is no harm in it being explained (to the people), however it is better for it to be said, &#8220;Some people do such and such, and some people say such and such&#8221; for two reasons. The first reason is that avoids the issue of specifying (names) and the second reason is that this ruling incorporates (the person intended) and others (to whom it would also apply).<\/p>\n<p>Except that when we see a specific person by which the people have been put to trial, and he is calling to his innovation or to misguidance, then there is no escape from specifying (his person) so that the people are not put to trial by him.<\/p>\n<p>Shaikh Rabee answered a similar question by saying:<\/p>\n<p>&#8220;<em>This, I swear by Allah is mockery, this from the things that make you laugh and make you cry, that speech such as this should be said. When the bid&#8217;ah increases and the disbelief increases and the Secularists, the Communist, the Rafida, the Sufis and the misguided groups increase, they hinder Islam and the people are given free rein to do as the like and they can say whatever they like and there is no one to say this is wrong or this is evil nor anyone to say this one is a trouble maker and this one is a doer of good? This is a loss and a lack of understanding in the religion of Allah the Mighty and Majestic. So the Salaf (Pious Predecessors) authored books in Aqeedah and in these books they criticized the people of innovation and misguidance and the called them by name, the individuals and the groups; so has this ended also? And we say; verily the innovators that were present during the time of the Salaf, they were contested and criticized and their misguidance was made clear, and now it&#8217;s not permissible, it&#8217;s haram, now speaking against the people of bida is haram and speech against the secularist is haram and speech against the heretics and speech against the Rafidah is haram and speech against the Sufis is haram? Masha Allah, is this a call to uniting the religions or what? We seek Allah&#8217;s forgiveness and repent to Him, this is misguidance<\/em>..&#8221;<\/p>\n<p>Thus when we find ourselves in similar times I present this concise series discussing some of the principles relating to the science of Hadeeth and something from its application and relevance to the manhaj that perhaps it will bring light to the path trodden by the people of Sunnah in these trying times, Wallahul Musta&#8217;aan<\/p>\n<p>We begin then with some necessary basics:<\/p>\n<p><strong>The Scholars of Hadeeth used to say (and still hold) that<\/strong>:<\/p>\n<p>1.The Hadeeth of the Messenger is defined as:<\/p>\n<p><strong><em>&#8216;That which has been reported from the Messenger &#8211; Sallallahu Alahi Was Salam from his statements, his actions, his silent approvals and his Physical attributes and his character&#8217;<\/em><\/strong><\/p>\n<p>2. That the levels of hadeeth in relation to authenticity or its absence are three: 1. Saheeh (Authentic) 2. Hasan (Good) 3. Dha&#8217;eef (Weak)<\/p>\n<p>3. That each of these three levels are of two types:<\/p>\n<p>A. Saheeh is categorised into A. Saheeh li Dhaatihi (Authentic by itself) B. Saheeh li Ghairihi (Authentic due to support)<\/p>\n<p>B. Hasan is categorised into A. Hasan li Dhaatihi (Hasan By Itself) and B. Hasan li Ghairihi (Hasan due to support)<\/p>\n<p>C. Dha&#8217;eef is categorised into that which has A. Dha&#8217;fun Yaseer (mild weakness) and Dha&#8217;fun Shadeed (Severe weakness)<\/p>\n<p>4. That the authentic Hadeeth must fulfill five conditions: One of these conditions relates to the chain of transmission, two relate to the characteristics of the narrators and two relate to defects in the hadeeth<\/p>\n<p>1.Ittisaalus Sanad (that the chain of transmission is unbroken)<\/p>\n<p>2 That the narrators possess: Adaalah (Religious Integrity)and;<\/p>\n<p>3. Dhabt: (precision in Narration)<\/p>\n<p>4. That the narration is not &#8216;Shaadh&#8217; (which is when a trustworthy Narrator, narrates that which other trustworthy narrators oppose in versions of the narration)<\/p>\n<p>5. That it does not have an Illah (harmful hidden defect)<\/p>\n<p>know, that the many categories of weak hadeeth exist due to one of these five conditions being violated.<\/p>\n<p>6. They used to hold that من أسند لك فقد أحالك، &#8216;Whosoever mentions their chain of narration to you then indeed they have refered you&#8217; (i.e referred you to their source of information) because the isnaad is from the deen<\/p>\n<p>Imaam Abdullah ibn al Mubarak said:<\/p>\n<p>&#8220;<em>Isnad is part of religion (deen), and if it was not for Isnad, one would have said whatever one desired<\/em>&#8220;<\/p>\n<p>(See the introduction of Saheeh Muslim (32))<\/p>\n<p>Abdullah ibn al Mubarak stated:<\/p>\n<p>&#8220;<em>The one who seeks matters of his deen without an Isnad is similar to the one who attempts to climb a roof without a ladder<\/em>&#8220;<\/p>\n<p>Sufyan al-Thawri said:<\/p>\n<p>&#8220;<em>Isnad is the weapon of a believer. if he does not possess a weapon, then with what will he fight<\/em>?&#8221;<\/p>\n<p>Reflections:<\/p>\n<p>1. They would give narrations different grades of strength depending on who brought it to them. They wouldn&#8217;t accept a narration merely on the basis that &#8216;It is being said&#8217;<\/p>\n<p>2. That they would consider the religious integrity and precision of an individual before they accepted from him<\/p>\n<p>3. That it therefore follows that the narration of &#8216;Unknowns&#8217; would not be accepted regardless of how convincing he (or she as the case may be) sounds, and regardless of how eloquent they are.<\/p>\n<p>4. That they considered &#8216;Chains of narration&#8217; (i.e such and such narrated from such and such who narrated from&#8230;) and would not suffice with statements such as &#8216;It is well known!&#8217;<\/p>\n<p>5. That breaks in those chains of transmission would cause the narrations to be rejected (or at least not accepted until established)<\/p>\n<p>6. That even the narrations of the trustworthy would be rejected if they opposed those who were more trustworthy than them<\/p>\n<p>7. That a narration would be rejected if a hidden defect is discovered in it (i.e like it being mentioned that such and such a narrator saw such and such a thing but historically the occurance happen before he was born. Or like it being mentioned that he witnessed such and such a thing in such and such place he has nevered travelled to. It would be clear from this that the narration is defective)<\/p>\n<p>8. Dhabt (or the precision of a narrator) is of two types: 1. Dhabtus Sadr (his precision in that which he memorises by heart) and 2. Dhabtul Kitaab (the precision of his book ie the book he writes his hadeeth in and his method of protecting it and what it contains) thus the narration of the one who has bad memory and doesnt take notes is not relyed upon and may cause the hadeeth to be rejected merely because of his presence in the chain of transmission<\/p>\n<p>Wallahu A&#8217;lam<\/p>\n\n\n<p> @abuhakeembilal <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn the basics of Hadith grading and how to identify authentic narrations. This article explores the importance of Isnad (chain of transmission) and the principles used by Hadith scholars.<\/p>\n","protected":false},"author":1,"featured_media":8886,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[118],"tags":[],"class_list":["post-1022","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-science-of-hadeeth-hadeeth"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/09\/Hadith-Grading-Authenticity.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1022","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1022"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1022\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8886"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1022"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1022"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1022"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}