{"id":10241,"date":"2025-02-26T02:05:52","date_gmt":"2025-02-26T02:05:52","guid":{"rendered":"https:\/\/abuhakeem.com\/?p=10241"},"modified":"2025-03-06T23:33:13","modified_gmt":"2025-03-06T23:33:13","slug":"focus-on-allah","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/focus-on-allah\/","title":{"rendered":"Focus on Allah!"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10241?action=genpdf&amp;id=10241\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img fetchpriority=\"high\" decoding=\"async\" width=\"1200\" height=\"240\" src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2025\/02\/pngegg.webp\" alt=\"Pngegg\" class=\"wp-image-10233\" style=\"width:490px;height:auto\" srcset=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2025\/02\/pngegg.webp 1200w, https:\/\/abuhakeem.com\/wp-content\/uploads\/2025\/02\/pngegg-768x154.webp 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/figure><\/div>\n\n\n<p>By the leave of Allah, he has blessed us to reach another Ramadhan. As we look upon its tail end, this is a time to focus upon our lord. It may be that with the swift passage of time we have reached this late stage in Ramadhan and may not have taken as much benefit from the month as we feel we could have, there are still a number of days remaining, <strong>focus on Allah<\/strong>!<\/p>\n\n\n\n<p>He it is who has granted us this great blessing of hidiyah to Islam and then to the Sunnah, <strong>focus on Allah<\/strong>!<\/p>\n\n\n\n<p>It is Him who created us and given us everything we need to survive this dunya, and has promised to continue to do so until we meet him, <strong>focus on Allah<\/strong>!<\/p>\n\n\n\n<p>When the trials of the dunya become heavy and we are tested and overcome by the shayaateen of mankind and the Jinn, and we fear we may have failed a test or trial, <strong>focus on Allah<\/strong>!<\/p>\n\n\n\n<p>Al Hakam Ibn Amr Al Ghifaari said: “<em>I sware by Allah! If the heavens and the earth were wrapped around a slave of Allah and he feared Allah, then He will make a path of exit for him from between them!<\/em>” (Siyar A’laamin Nubalaa 2\/475)<\/p>\n\n\n\n<p>learn from this trial and solidify yourself for the next!<\/p>\n\n\n\n<p><strong><u>Focus on Allah!<\/u><\/strong><\/p>\n\n\n\n<p>أَمَّنْ خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءًۭ فَأَنۢبَتْنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهْجَةٍۢ مَّا كَانَ لَكُمْ أَن تُنۢبِتُوا۟ شَجَرَهَآ ۗ أَءِلَـٰهٌۭ مَّعَ ٱللَّهِ ۚ بَلْ هُمْ قَوْمٌۭ يَعْدِلُونَ{ ٦٠<\/p>\n\n\n\n<p>&#8220;<del> <\/del><strong><em>[More precisely], is He [not best] who created the heavens and the earth and sent down for you rain from the sky, causing to grow thereby gardens of joyful beauty which you could not [otherwise] have grown the trees thereof? Is there a deity with Allāh?<sup>1<\/sup>&nbsp;[No], but they are a people who ascribe equals [to Him]<\/em><\/strong>.<ins>”<\/ins><del> <\/del>&nbsp;(Suratul Naml Vs 60)<\/p>\n\n\n\n<p><strong><u>Focus on Allah!<\/u><\/strong><\/p>\n\n\n\n<p>أَمَّن جَعَلَ ٱلْأَرْضَ قَرَارًۭا وَجَعَلَ خِلَـٰلَهَآ أَنْهَـٰرًۭا وَجَعَلَ لَهَا رَوَٰسِىَ وَجَعَلَ بَيْنَ ٱلْبَحْرَيْنِ حَاجِزًا ۗ أَءِلَـٰهٌۭ مَّعَ ٱللَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ ٦١<\/p>\n\n\n\n<p>“<strong><em>Is He [not best] who made the earth a stable ground and placed within it rivers and made for it firmly set mountains and placed between the two seas a barrier? Is there a deity with Allāh? [No], but most of them do not know<\/em><\/strong>.<ins>”<\/ins> (Suratun Naml Vs 61)<\/p>\n\n\n\n<p><strong><u>Focus on Allah!<\/u><\/strong><\/p>\n\n\n\n<p>Throughout the performance of these acts of worship, such as fasting, concentrate on keeping the action sincerely for his sake, if it is a naafilah, keep it between you and your Lord<\/p>\n\n\n\n<p>Masrooq informed us that Abdullah Ibn Mas’ood said: “<em>If you see your morning fasting, then oil yourselfs (i.e. don’t maintain the appearance of one suffering from thirst or heat due to fasting)<\/em><\/p>\n\n\n\n<p><strong><u>Focus on Allah!<\/u><\/strong><\/p>\n\n\n\n<p>Learn to evaluate yourself, the believer knows when his imaan is high and he knows when it is low and is in need of resuscitation, <strong>focus on Allah<\/strong><\/p>\n\n\n\n<p>Abu Dardaa said:<\/p>\n\n\n\n<p>“<em>Indeed from the Fiqh (understanding) of a servant is that he knows what has increased of his imaan and what from it has depleted. From the Fiqh of a servant is that he is acquainted with whether or not it is (currently) increasing or (currently) depleting. And from the fiqh of a servant is that he is familiar with when the prodding of shaytaan come to him<\/em>”<\/p>\n\n\n\n<p>(Collected by Al Khalaal in ‘As Sunnah’ 1585)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<p>Whatever the people are doing, and whichever direction they are facing, blindly follow no one, focus on Allah!<\/p>\n\n\n\n<p>Abdullah Ibn Ma’sood said:<\/p>\n\n\n\n<p>“<em>let no man among you blindly follow another man, If he believes then he will follow suit, and if he were to disbelieve he (too) would disbelieve, if he must blindly follow anyone then let him follow those who have passed away and leave the living, for certainly the living are not safe from trial<\/em>”<\/p>\n\n\n\n<p>(Collected by Al Baihaqi in ‘As Sunan Al Kubraa’: 20349)<\/p>\n\n\n\n<p>Regardless of the plots devised against you, He is above all plots, <strong>focus on Allah,<\/strong><\/p>\n\n\n\n<p>Allah says:<\/p>\n\n\n\n<p>{ٱسْتِكْبَارًۭا فِى ٱلْأَرْضِ وَمَكْرَ ٱلسَّيِّئِ ۚ وَلَا يَحِيقُ ٱلْمَكْرُ ٱلسَّيِّئُ إِلَّا بِأَهْلِهِۦ ۚ}<\/p>\n\n\n\n<p>“<strong><em>[Due to] arrogance in the land and plotting of evil; but the evil plot does not encompass except the one who devises it.” <\/em><\/strong>(Suratul Faatir vs 43)<\/p>\n\n\n\n<p>Imaam Ibnul Qayyim mentions:<\/p>\n\n\n\n<p>“<em>Then he (the prophet) would say (as in the well-known dua) “<strong>My forelock is in your hand<\/strong>”..when the servant recognises that his forelock and the forelocks of all of his slave (and all creaton) is in The Hand of Allah alone, and He does with them as He pleases, he (the slave) will never fear them, nor place his hopes in them, nor will he place them in the position of a possessor of anything, rather in the position of subdued dependant slaves, controlled by someone else, their affairs determined by someone external to them. When he puts himself in this position, the constant dire need for his lord becomes an inseparable characteristic of his, when he sees the people he knows he has no need for them, neither does he place his hopes and desires in them, thus his tawheed, reliance and servitude is rectified<\/em>.”<\/p>\n\n\n\n<p>(Al Fawaa’id)<\/p>\n\n\n\n<p><strong><u>Focus on Allah!<\/u><\/strong><\/p>\n\n\n\n<p>When people conjecture and come to rudimentary conclusions about your true inner being, a reality only truly known by Allah, <strong>Focus on Allah<\/strong>!<\/p>\n\n\n\n<p>Alhamdullillah! It is truly a blessing that your judgement on that day will not be at the behest of people, the one who <em>will<\/em> judge you has said to you:<\/p>\n\n\n\n<p>“Say, “<strong><em>O My servants who have transgressed against themselves (by sinning), do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the forgiving, the Merciful<\/em><\/strong>” (Suratuz Zumar Vs 53)<\/p>\n\n\n\n<p>The Most Just Judge, The owner of majesty, might and grandeur<\/p>\n\n\n\n<p>Abu Moosa Al Ash’ari said Prophet ﷺ stood on an occasion and mentioned five affairs, he said: “<strong><em>Indeed Allah does not sleep, and it does not befit him to sleep, He raises the scales of justice and lowers it, the actions of the night ascend to him before the actions of the day, and the actions of the day ascend to him before the actions of the night, His veil is light, if He were to lift it, the brilliant radiance of His Face would incinerate (and destroy) everything that His sight falls upon (i.e. all of existence)<\/em><\/strong>” (Muslim:179)<\/p>\n\n\n\n<p><strong><u>Focus on Allah<\/u><\/strong>!<\/p>\n\n\n\n<p>As we draw closer to the hour and the turmoil within the dunya intensifies, <strong>focus on Allah<\/strong>!<\/p>\n\n\n\n<p>When the peoples concern is to raise themselves and orchestrate their own ascension, <strong>focus on Allah!<\/strong><\/p>\n\n\n\n<p>If you wish for the mercy of Allah, then be far from being cold-hearted, merciless, unempathetic, judgemental and presumptuous with the people of Sunnah.<\/p>\n\n\n\n<p>Mercilessness is not strength.<\/p>\n\n\n\n<p>Upon the authority of Abdullah Ibn Amr Ibn Aas who said that the prophet ﷺ said: “<strong><em>Ar Rahmaan (The Most Beneficent) will show mercy to the mercy-givers, show mercy to those on earth and He who is above the heavens will show mercy to you<\/em><\/strong>!”<\/p>\n\n\n\n<p>Or the statement of the prophet to the individual who said he never kisses his children: “<strong><em>What can I do for you if Allah has stripped mercy from your heart?<\/em><\/strong><em>” (Bukhaari: 5998)<\/em><\/p>\n\n\n\n<p>Every night in this blessed month Allah has individuals that he frees from the fire, concentrate on trying to be from them, <strong>Focus on Allah<\/strong>!<\/p>\n\n\n\n<p>وصلى الله على نبينا محمد وعلى آله وصحبه أجمعين<\/p>\n\n\n\n<p>@abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By the leave of Allah, he has blessed us to reach another Ramadhan. As we look upon its tail end, this is a time to focus upon our lord. It may be that with the swift passage of time we have reached this late stage in Ramadhan and may not have taken as much benefit [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":10309,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[30],"tags":[],"class_list":["post-10241","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-general"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2025\/02\/Allah-with-light.webp","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10241","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=10241"}],"version-history":[{"count":5,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10241\/revisions"}],"predecessor-version":[{"id":10350,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10241\/revisions\/10350"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/10309"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=10241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=10241"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=10241"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}