{"id":10255,"date":"2025-02-26T23:43:42","date_gmt":"2025-02-26T23:43:42","guid":{"rendered":"https:\/\/abuhakeem.com\/?p=10255"},"modified":"2025-05-29T15:50:23","modified_gmt":"2025-05-29T15:50:23","slug":"life-principles-2-be-just-or-you-will-harm-no-one-but-yourself","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/life-principles-2-be-just-or-you-will-harm-no-one-but-yourself\/","title":{"rendered":"Life Principles 2: Be Just! Or you will Harm No one but Yourself!"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10255?action=genpdf&amp;id=10255\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div>\n<p><strong>Imaam Ibnil Qayyim <\/strong>Mentions:<\/p>\n\n\n\n<p>“<em>Allah has commanded with the establishment of Qist (Fairness and equity) and this is a reference to Justice. &nbsp;It is a command to establish it with regards to every individual, whether an enemy or an ally. The greatest thing one establishes justice in are the statements, opinions and positions one takes. Since this is connected to the command of Allah and that which He informs us of. Thus, establishing this justice is the duty of the successors of the messenger in this ummah, and the trustworthy ones from his followers. The title of being trustworthy is not deserved by the one who does not establish these things with pure justice and naseehah, to Allah and his book and his messenger towards his servants, these are the inheritors of the prophets in truth! Not the one who makes his companions, his way and his position, the standard and measure of the truth and its scales, showing enmity to those who oppose it and allegiance to those who agree with it, purely based on agreement or disagreement (with him). Where is this compared to the establishment of Qist that Allah has made compulsory upon every individual and it (Justice) in this regard, is of the greatest compulsion and mandatory nature<\/em>” (Ar Risaalah At Tabookiyah: P34)<\/p>\n\n\n\n<p><strong>The heavens and the Earth were established upon Justice.<\/strong><\/p>\n\n\n\n<p>In a similar vein <strong>Shaikhul Islaam<\/strong> mentioned:<\/p>\n\n\n\n<p>&#8220;<em>The affairs of people in this world are set right with justice, even if that involves various types of sin, more than they are set right with injustice in rights, even if no sin is involved. This is why it is said: &#8216;Allah upholds a just state, even if it is disbelieving, but He does not uphold an oppressive state, even if it is Muslim.&#8217; It is also said: &#8216;The world endures with justice and disbelief, but it does not endure with injustice and Islam.&#8217; The Prophet ﷺ  said: &#8216;No sin is punished more swiftly in this world than oppression and severing family ties.&#8217; Thus, the oppressor is brought down in this world, even if he is forgiven and shown mercy in the Hereafter. This is because justice is the foundation of everything. If the affairs of the world are established with justice, they will thrive, even if their ruler has no share in the Hereafter. But if they are not established with justice, they will not thrive, even if their ruler has faith that will be rewarded in the Hereafter.<\/em>&#8220;<\/p>\n\n\n\n<p>(Majmoo’ ul Fataawaa 28\/146)<\/p>\n\n\n\n<p><strong>Due to the establishment of this justice the prophet prohibited the testimony of certain individuals against certain others:<\/strong><\/p>\n\n\n\n<p>&nbsp;On the authority of Abdullah ibn Amr (may Allah be pleased with them both), he said: The Messenger of Allah ﷺ said:<\/p>\n\n\n\n<p><em>&#8220;The testimony of a treacherous man or woman is not accepted, nor that of one who harbours enmity against his brother, nor the testimony of someone who is dependent) on the household (such as a servant or someone paid for services).&#8221;<\/em><\/p>\n\n\n\n<p>Narrated by <strong>Ahmad (2\/204, 225-226) and Abu Dawud<\/strong> (3600) – classified as <strong>Hasan (sound)<\/strong> by <strong>Al-Albani<\/strong> in <em>Al-Irwa&#8217; (8\/284).<\/em><\/p>\n\n\n\n<p>Each of these individuals cannot be witnesses due to there being a factor affecting the just nature of their testimony.<\/p>\n\n\n\n<p><strong>The Salaf and Justice<\/strong><\/p>\n\n\n\n<p>• ودخل عثمان بن عفان على غلام له يعلف ناقة، فرأى في علفها (شيئا كرهه)، فأخذ بأذن غلامه فعركها، ثم ندم فقال له: خذ بأذني فاعركها، فأبى الغلام، فلم يدعه (حتى أخذ) بأذنه، فجعل عثمان يقول له: شد، شد، حتى ظن أنه قد بلغ منه مثل ما بلغ منه، قال عثمان: واها (٢) لقصاص الدنيا قبل قصاص الآخرة. [موسوعة ابن أبي الدنيا ٦\/ ٢٥٠].<\/p>\n\n\n\n<p><strong>Uthman ibn Affan<\/strong> (may Allah be pleased with him) once entered upon a servant of his who was feeding a camel. He noticed something in the camel&#8217;s feed that displeased him, so he grabbed the servant&#8217;s ear and twisted it. Later, he regretted his action and said to the servant, &#8220;Take hold of my ear and twist it.&#8221; The servant refused, but Uthman insisted until the servant took hold of his ear. Uthman then said to him, &#8220;Pull harder, pull harder,&#8221; until he felt that the servant had done to him what he had done to the servant. Uthman then said, &#8220;Ah! How good it is to face retribution in this world rather than in the Hereafter.&#8221;<br>—&nbsp;<em>[Mawsu&#8217;at Ibn Abi al-Dunya, 6\/250]<\/em>.<\/p>\n\n\n\n<p>قال أبو الدرداء رضي الله تعالى عنه: إن أبغض الناس إلي أن أظلمه من لا يستعين علي إلا بالله. [الحلية (تهذيبه) ١\/ ١٧٧].<\/p>\n\n\n\n<p><strong>Abu Dardaa <\/strong>– Radhiyallahu ‘Anhu mentioned: &#8220;Among the people I hate to oppress the most, is the one who will not seek aid against me except with Allah.&#8221; [Al-Hilya (abridged), 1\/177].<\/p>\n\n\n\n<p>This makes clear how Abu al-Dardaa considered the importance of maintaining justice, and his aversion to oppressing others, especially those who are vulnerable and rely solely on Allah for help.<\/p>\n\n\n\n<p><strong>Reflect upon the Justice of our Mother Aisha – Radhiyallahu ‘Anhaa<\/strong><\/p>\n\n\n\n<p><strong>Abd al-Rahman ibn Shimaasah<\/strong> said, &#8220;I went to <strong>Aisha<\/strong> to ask her about something. She asked, &#8216;Where are you from?&#8217; I replied, &#8216;A man from the people of Egypt.&#8217; She asked, &#8216;How was your leader to you in your military campaigns?<a id=\"_ftnref1\" href=\"#_ftn1\"><sup>[1]<\/sup><\/a>&#8216; I said, &#8216;We had no complaints against him. If a camel of one of us died, he would give him a camel. And if a slave, he would give him a slave. And if someone was in need of provisions, he would provide for them.&#8217; Aisha then said, &#8216;What he did to Muhammad ibn Abi Bakr, my brother, does not prevent me from telling you what I heard from the Messenger of Allah ﷺ say in this house of mine: <strong><em>&#8216;O Allah! Whoever takes charge of any of the affairs of my Ummah and is hard on them, be hard on him. And whoever takes charge of any of the affairs of my Ummah and is kind to them, be kind to him<\/em><\/strong>.'&#8221;<br><\/p>\n\n\n\n<p>قال الشافعي: بئسَ الزادُ إلى المَعَادِ العدوانُ على العباد. [السير (تهذيبه) ٢\/ ٨٤٩].<\/p>\n\n\n\n<p><strong>Imam al-Shafi&#8217;i,<\/strong> may Allah have mercy on him:<\/p>\n\n\n\n<p>&#8220;The worst provision for the journey to the hereafter is oppressive transgression against the servants (of Allah).&#8221; [Al-Siyar (abridged), 2\/849].<\/p>\n\n\n\n<p><strong>The Oppressive one harms no one but himself!<\/strong><\/p>\n\n\n\n<p>عن يحيى الشيباني قال: مكتوب في التوراة: كما تدين تدان، وبالكأس الذي تسقي به تشرب وزيادة، لأن البادي لا بد أن يزاد. [الحلية (تهذيبه) ٢\/ ٢٧٦].<\/p>\n\n\n\n<p>Yahya al-Shaibani (may Allah have mercy on him) said:<\/p>\n\n\n\n<p><strong>&#8220;It is written in the Torah: &#8216;As you judge, so shall you be judged. And from the cup you pour out to others, you shall drink—and more. For the one who initiates [an action] will surely face an increase [in recompense].'&#8221;<\/strong><br>—&nbsp;<em>[Hilyat al-Awliya (Tahdhib), 2\/276]<\/em>.<\/p>\n\n\n\n<p>عن ضَمْرةَ، قال: كتب عُمرُ بنُ عبد العزيز: إلى بعض عماله: أمَّا بعدُ، فإذا دَعَتْكَ قُدْرَتُك على النَّاس إلى ظُلمِهمْ، فاذكر قدرة الله تعالى عليك، ونَفَادَ ما تَأتِي إليهم، وبَقَاء ما يأَتُونَ إليك. [السير (تهذيبه) ٢\/ ٥٨٩].<\/p>\n\n\n\n<p>Upon the authority of <strong>Damrah<\/strong>, Rahimahullah who reported:<\/p>\n\n\n\n<p><strong>&#8220;Umar ibn Abd al-Aziz <\/strong>(may Allah have mercy on him) wrote to one of his governors: &#8216;To proceed, if your power over people tempts you to oppress them, then remember Allah’s power over you, the fleeting nature of what you do to them, and the lasting consequences of what they will bring to you<strong>.'&#8221;<\/strong><br>—&nbsp;<em>[Al-Siyar (Tahdhib), 2\/589]<\/em>.<\/p>\n\n\n\n<p><strong>Muhammad Ibn Ka’b Al Quradhi<\/strong> said: <\/p>\n\n\n\n<p>“There are three characteristics which if someone possesses them they fall back upon him, <\/p>\n\n\n\n<p>1. Oppressive Transgression, <\/p>\n\n\n\n<p>2. Breaking a pact and &nbsp;agreement and <\/p>\n\n\n\n<p>3. evil plotting and scheming.<\/p>\n\n\n\n<p>     Then he read (three verses): <\/p>\n\n\n\n<p>1. “<strong><em>The evil plot does not encompass except the one who devises it<\/em><\/strong>..” (Faatir : 43)<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><\/li>\n<\/ol>\n\n\n\n<p class=\"has-text-align-left\">    2. “<strong><em>O Mankind Indeed your oppressive transgressions are against yourselves<\/em><\/strong>” (Yunus: 23)&nbsp; <\/p>\n\n\n\n<p>    3. “<strong><em>Then whosoever breaks his pledge breaks it only to his own detriment<\/em><\/strong>” (Fath: 10)<\/p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"\/>\n\n\n\n<p><a href=\"#_ftnref1\" id=\"_ftn1\">[1]<\/a> referring to Mu’awiyah Ibn Khadeej the governor set over Egypt by Mu’awiayh ibn Abi Sufyaan who killed the previous governor her brother Muhammad Ibn Abi Bakr<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Imaam Ibnil Qayyim Mentions: “Allah has commanded with the establishment of Qist (Fairness and equity) and this is a reference to Justice. &nbsp;It is a command to establish it with regards to every individual, whether an enemy or an ally. The greatest thing one establishes justice in are the statements, opinions and positions one takes. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":10260,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[146,30,59],"tags":[],"class_list":["post-10255","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-character-and-mannerisms","category-general","category-statements-of-the-salaf"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2025\/02\/a-photo-of-the-scales-of-justice-the-sca_phezPxR9SDC59z08u3m0_A_ogTFoUxLR-KL7d96rqk-g-e1748532446736.webp","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10255","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=10255"}],"version-history":[{"count":4,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10255\/revisions"}],"predecessor-version":[{"id":10396,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/10255\/revisions\/10396"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/10260"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=10255"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=10255"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=10255"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}