{"id":1034,"date":"2013-09-19T22:50:32","date_gmt":"2013-09-19T21:50:32","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1034"},"modified":"2024-07-04T05:02:32","modified_gmt":"2024-07-04T05:02:32","slug":"hadith-grading-explained-authentic-vs-weak-narrations","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/hadith-grading-explained-authentic-vs-weak-narrations\/","title":{"rendered":"Hadith Grading Explained: Authentic vs. Weak Narrations"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1034?action=genpdf&amp;id=1034\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salaatu Was Salaamu ‘Alaa Rasoolillahi<\/p>\n<p>Ammaa Ba’d:<\/p>\n<p>The Scholars of Hadeeth used to say (and still hold) that:<!--more--><\/p>\n<p><strong>7.<\/strong> The Hadeeth that is <strong>&#8216;Saheeh li Dhaatihi&#8217;<\/strong> (صحيح لذاته) (Saheeh of its own merit), is the hadeeth that fulfills the five conditions of the authentic hadeeth (namely):<\/p>\n<p><strong>1.<\/strong> <strong>Ittisaalus Sanad<\/strong> (اتصال السند) (that the chain of transmission is unbroken)<\/p>\n<p><strong>2.<\/strong> That the narrators possess: <strong>Adaalah<\/strong> (العدالة) (Religious Integrity)and;<\/p>\n<p><strong>3.<\/strong> <strong>Dhabt<\/strong> (الضبط): (precision in Narration)<\/p>\n<p><strong>4<\/strong>. That the narration is not ‘<strong>Shaadh<\/strong>’ (الشاذ) (which is when a trustworthy narrator, opposes those who are more trustworthy than him in their versions of the narration. When this occurs it does not affect his station but it is said that though he is trustworthy his opposition of those more trustworthy indicates he is mistaken)<\/p>\n<p><strong>5<\/strong>. That it does not have an &#8216;<strong>Illah<\/strong> (علة) (harmful hidden defect)<\/p>\n<p><strong>8<\/strong>. The hadeeth that is <strong>Hasan li Dhaatihi <\/strong>(حسن لذاته) (Hasan (Good) of its own merit) is the hadeeth that fulfills the conditions of the hadeeth As-Saheeh except that one or more of its narrators has a lesser level of Dhabt (Precision in Narration) than that of the hadeeth As-Saheeh<\/p>\n<p><strong>9<\/strong>. The Hadeeth that is <strong>Saheeh li Ghairihi <\/strong>(صحيح لغيره) (Saheeh due to support) is actually in its origin a hadeeth that is hasan li dhaatihi that has more than one chain of its like. When we have more than one chain of narration for the same hadeeth both of them being hasanun li dhaatihi, then these chains support each other and &#8216;bolster&#8217; the strength of the hadeeth bringing it to the level of &#8216;Saheeh&#8217; due to this support.<\/p>\n<p><strong>10<\/strong>. The Hadeeth that is <strong>Hasan li Ghairihi <\/strong>(حسن لغيره) (Hasan due to support) is actually in its origin a hadeeth that is Dha&#8217;eef (Weak) but its weakness is not severe and it has more than one chain of its like. When we have more than one chain of narration for the same hadeeth, both of them being &#8216;mildly&#8217; weak, then these chains support each other and &#8216;bolster&#8217; the strength of the hadeeth bringing it to the level of Hasan due to this support.<\/p>\n<p>These Ahaadeeth are considered &#8216;Acceptable&#8217; and authentic though they vary in levels of strength of authenticity<\/p>\n<p><strong>11<\/strong>. The Hadeeth that is <strong>Dha&#8217;eef<\/strong> (ضعيف) (Weak) is considered so, due to the absence of one or more of the conditions of the authentic Hadeeth and have numerous categories relative to the conditions of the authentic Hadeeth:<\/p>\n<p><strong>Categories of Weak Hadeeth<\/strong><\/p>\n<p><strong>1. Categories of weakness relative to the first condition of authenticity <strong>&#8216;Ittisaal As Sanad&#8217; <\/strong>(An Unbroken Chain of transmission):<\/strong><\/p>\n<ul>\n<li><strong>1.<\/strong> <strong>AL Mursal(المرسل)<\/strong>: That which a taabi&#8217;ee (Successor of the Companions) attributes to the Messenger &#8211; Sallallahu Alaihi Was Salam from his statements, his actions, his silent approvals and his Physical attributes and his character. The problem with the Mursal is that since the Taabi&#8217;e did not meet the Messenger we have a break in the chain of transmission that affects authenticity.If it is only the companion that is missing from its chain, and we are able to be certain that it is only the companion that is missing, then that does not pose a threat to authenticity since all of the companions are considered upright. The problem is that the taabi&#8217;een often narrate from other taabi&#8217;een. Al Haafidh Ibn Hajr mentions in Nuzhatun Nadhar that there are examples of there being up to nine of the taabi&#8217;een narrating one from another after the companion in one chain<\/li>\n<li><strong>2.<\/strong> <strong>Al Munqati&#8217; (المنقطع)<\/strong>: That which has a break in its chain after the level the companion.<\/li>\n<li><strong>3.<\/strong> <strong>Al Mu&#8217;dhal (المعضل)<\/strong>: That which has two or more narrators missing from its chain consecutively. As far as the hadeeth that has two or more narrators missing from its chain in various places consecutively then it is considered Munqati&#8217;<\/li>\n<li><strong>4.<\/strong> <strong>Al Mu&#8217;alaq (المعلق)<\/strong>: That which has a narrator or more missing from its chain from the beginning of the isnaad (i.e the end of the chain furthest from the Messenger -Sallallahu alahi was Salam) the missing narrators may possibly extend to the end of its chain (i.e if Imaamul Bukhaari said &#8216;Anas Ibn Maalik said..&#8217; with out mentioning the narrators between him and Anas &#8211; Radhiyallahu anhu the hadeeth is considered &#8216;Mu&#8217;alaq&#8217;<\/li>\n<li><strong>5.<\/strong> <strong>Al Mudalis (المُدلس)<\/strong>: It is that a narrator narrates from a shaikh he met and is known to have narrated from, but he narrates in this instance, that which he didnt hear from him directly using wording that gives one the impression that he did hear this from him directly (such as &#8216;Upon the authority of Such and such&#8217;. If the narrator is not known for this practice (of Tadlees) then such wording is acceptable and the chain is considered unbroken), this type of Tadlees is known as &#8216;Tadleesul Isnaad&#8217;. From the most well known (and the worst) types of tadlees is &#8216;Tadleesu Taswiyah&#8217; and it is that a narrator removes someone other than his shaikh from the chain of transmission when he narrates, due to the removed narrator being weak or young or accused of something. This is done in order to give the impression that the chain is sound. Tadlees is of a number of types (From them Tadlees As shuyookh, Tadleesul Bilaad, Tadleesul &#8216;Atf but this category is relative to the discussion related to problems related to broken chains of transmission)<\/li>\n<\/ul>\n<p><strong>2. Weakness due to a narrator being discredited for problems in his Adaalah (His religious integrity)<\/strong><\/p>\n<p>Al Imaam ibn Katheer Mentions that which affirms a persons adaalah, he says:<\/p>\n<p>&#8220;<em>The adaalah of a narrator is affirmed with him being well known (i.e with the people of Sunnah) for Khair (good) and them giving him beautiful praise. Alternatively by way of the praise of the Imaams (i.e of Hadeeth) or two of them for him or (even) one of them in the (most) correct position..<\/em>&#8221; Shaikh Muqbil &#8211; Rahimahullah mentions in his commentary of the book of Ibn Katheer at this point: &#8220;<em>No, What is correct is that if one (scholar) praises him that is accepted, but as far as if he narrates from that person and then declares him trustworthy, one would exercise caution, as it maybe that the narrator is trustworthy as far as he is concerned but weak in the opinion of others<\/em>..&#8221; (As Saiyrul Hatheeth sharhu Ikhtisaari &#8216;Uloomil Hadeeth p 181)<\/p>\n<p>The issues that are related to problems in &#8216;Adaalah usually occur due to four main reasons:<\/p>\n<ul>\n<li><strong>1.<\/strong> <strong>Lying<\/strong>: If a narrator in the chain is a Kadhaab Liar, or is known for fabrication of hadeeth, the hadeeth is declared &#8216;Maudhoo&#8217; (Or if it opposes clear-cut sharee&#8217;ah principles, ie such as it promoting shirk or kufr or abandonment of acts of worship such as Salaah) (Fabricated)<\/li>\n<li><strong>2.<\/strong> <strong>Him being &#8216;accused&#8217; of being a liar<\/strong>: If a narrator is &#8216;accused&#8217; of being a liar (by the people of Sunnah) then the hadeeth is declared &#8216;Matrook&#8217; (abandoned) and that is exactly what is done with it (i.e it is abandoned!)<\/li>\n<li><strong>3.<\/strong> <strong>Al Jahaalah <\/strong>(<strong>Him being unknown<\/strong>) Jahaalah is of two types: 1. Jahaalatul Ain (That the individual himself is unknown) This is the case with the one who only one person has narrated from, and none of the scholars have made &#8216;jarh or ta&#8217;deel&#8217; of him (have disparaged or praised the individual and spoken good or bad about him) 2. Jahaalatul Haal (That the individual is known but his state is unknown). This is that more than one person has narrated from him, but no one has made &#8216;Jarh or ta&#8217;deel&#8217; of him. The hadeeth of the &#8216;Unknown&#8217; individual, regardless of the type of jahaalah he is upon, is rejected<\/li>\n<li><strong>4.<\/strong> <strong>Innovation<\/strong>: As far as the innovator, then the position of the salaf regarding abandoning sitting with them is well-known. The salaf would warn against sitting with them with harsh well-known warnings. But as far as &#8216;accepting&#8217; hadeeth from them then there are a few issues: 1. There is consensus of the scholars that the hadeeth of the innovator whose bid&#8217;ah has reached the level of Kufr is rejected and not accepted. 2. That the scholars would possibly accept their narration of the one whose bid&#8217;ah is does not reach the level of kufr (Ghair Mukafirah) if they were known to be truthful (the intent here being the individual, not the sect) and that the narration did not support their bid&#8217;ah, and that they were not known to be callers to their bid&#8217;ah. 3. If the narration supported their bid&#8217;ah and sole reliance was upon this individual (whether caller or not) in the narration (i.e no one from the people of sunnah narrated the hadeeth other than him) then it would not be accepted<\/li>\n<\/ul>\n<p><strong><em>Practical Reflections<\/em><\/strong><\/p>\n<p>1.Not all narrations are the same in terms of levels of acceptability<\/p>\n<p>2. That the people of hadeeth do not rely upon narrations that have broken chains of transmission<\/p>\n<p>3. The importance of the Muslim maintaining his Adaalah which the scholars of hadeeth define as refraining from major sins and avoiding persistence upon minor sins, and that he distances himself from the &#8216;Khawaarim Al Muroo&#8217;ah&#8217; (Those acts that may not be haraam but blemish his nobility and character)<\/p>\n<p>4. The importance of precision in narration as much as is possible<\/p>\n<p>5. The effect of Kadhib Upon the character of the Muslim and the importance of hastily rebutting false accusations of kadhib (lying)<\/p>\n<p>6. The effect of innovation upon the Muslim<\/p>\n<p>7. The Justice of Ahlus Sunnah with the people of innovation<\/p>\n<p>8. The difference between The general stance of Ahlus Sunnah with the people of Innovation and the position of the scholars of Hadeeth with regards to the permissibility of &#8216;accepting&#8217; the narration of the person of innovation. Their narration are only accepted when they meet the&nbsp; conditions of acceptance.<\/p>\n<p>9. Leaving the affair of taking the narrations of the people of innovation&nbsp;within the confines that the scholars of Hadeeth mention, and not&nbsp;going beyond&nbsp;the boundaries set by the scholars of Hadeeth. Thus one does not now sit with them&nbsp;unreservedly&nbsp;and take from them because &#8216;the Scholars of hadeeth allow it!&#8217;. Rather we understand&nbsp;they only allow it in very restricted circumstances.<\/p>\n<p>10. Refraining from the people of Innovation unless absolutely necessary<\/p>\n<p>11. The stance of the people of hadeeth with respect to taking knowledge from the one who is majhool (unknown)<\/p>\n<p>12. The fact that a person is seen to convey knowledge, that does not remove him from the realms of being considered unknown<\/p>\n<p>13. The irrelevance of the opinion of the people of innovation regarding the people of sunnah<\/p>\n<p>14. The importance of being known for seeking knowledge, while maintaining sincerity<\/p>\n<p>15. The importance of being known by the people of knowledge for seeking knowledge<\/p>\n<p>16. The importance of being known with the people of Sunnah for khair(Good)<\/p>\n<p>17. Not every case of tadlees is considered malicious, some of the greatest of the Imaams of Hadeeth were known to practice it for varying reason, thus it does not affect them being considered precise and upright.<\/p>\n<p>18. The difference between tadlees and lying<\/p>\n<p>Wallahu A&#8217;lam<\/p>\n<p>Bilal Ibn Ahmad<\/p>\n\n\n<p> @abuhakeembilal <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how scholars categorize Hadith as Sahih (authentic), Hasan (good), or Da&#8217;if (weak) based on narrator strength and transmission chains. Part 2 explores different categories of weak Hadith.<\/p>\n","protected":false},"author":1,"featured_media":8889,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4,11,12,16,18],"tags":[],"class_list":["post-1034","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-bidah","category-hadeeth","category-manhaj","category-sects-and-groups","category-the-scholars"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/09\/Authentic-vs.-Weak-Narrations.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1034","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1034"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1034\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8889"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1034"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1034"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1034"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}