{"id":1217,"date":"2015-07-15T15:05:58","date_gmt":"2015-07-15T14:05:58","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1217"},"modified":"2025-06-14T19:59:47","modified_gmt":"2025-06-14T19:59:47","slug":"the-salaf-and-wisaal-continuous-fasting-understanding-the-different-positions","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-salaf-and-wisaal-continuous-fasting-understanding-the-different-positions\/","title":{"rendered":"The Salaf and Wisaal (Continuous Fasting): Understanding the Different Positions"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1217?action=genpdf&amp;id=1217\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi wal hamdullillah was salaatu was salaamu ‘alaa rasoolillahi<\/p>\n<p>Ammaa ba’d:<\/p>\n<p>From the issues related to fasting that arises often is a question connected to the affair of Al Wisaal (Continuous fasting). Wisaal is that a person continues to fast past maghrib. It may continue in some instances for two days and in some accounts from certain individuals from the salaf that they did so for three day continuously. The messenger&nbsp;&#8211; Sallallahu alaihi Was Salam&nbsp;prohibited the practice as occurs in the hadeeth of Abdullah Ibn Umar – Radhiyallahu ‘anhu who said that the prophet&nbsp;&#8211; Sallallahu alaihi Was Salam prohibited Al Wisaal so the companions said: “but you practice wisaal” So he said: “<strong>I am not like you, indeed I am fed by my lord and given drink,&nbsp;so carry out actions you are able to perform!<\/strong>” (Agree upon)<!--more--><\/p>\n<p>Anyone who is familiar with the biographies of the Salaf will know that it is mentioned in the biographies of many of them that they would practice Wisaal, thus the question arises why did they do so if it has been prohibited?<\/p>\n<p>The people of Knowledge of the past had three positions concerning the issue:<\/p>\n<ol>\n<li>The position of the majority who held that it is haram and they use as an evidence the aforementioned hadeeth of Ibn Umar prohibiting wisaal, also the hadeeth “<strong>If the night approaches from here <\/strong>(and he pointed towards the east) <strong>and the day dissipates from here<\/strong> (and he pointed towards the west) <strong>and the sun has set, then fasting person has broken his fast<\/strong> (i.e. it is waajib upon him to break the fast)<\/li>\n<li>The second position of the people of knowledge is that it is permissible. They use as evidence the fact that the prophet&nbsp;&#8211; Sallallahu alaihi Was Salam&nbsp;practiced it with his companions. They argue if it were outright prohibited he would not have done so with them. They also use a version of the hadeeth of prohibition that has the additional wording “..<strong>he did so<\/strong> (i.e. prohibited them from it) <strong>out of mercy for them<\/strong>” Therefore they understood that if it was done out of mercy for the ummah if someone within the Ummah has the ability to do so then they held one can do it.They argue that we know of the reason for the prohibition therefore- they argue that the reason for the prohibition is known and&nbsp;it revolves around difficulty and hardship upon the worshippers, thus if one does not find it difficult, it is permissible. Though they may have practiced it they wouldn’t call to it since ease and difficulty is relative.<\/li>\n<\/ol>\n<p>In the explanation of the book of fasting in Saheeh Muslim Imaam An Nawwawi under the chapter ‘The prohibition against Wisaal in fasting’ he mentions after explaining that the majority hold it to be prohibited:<\/p>\n<p>“..Al Qaadi ‘Iyaadh said: “<em>The scholars have differed concerning the ahaadeeth around Wisaal, some say: ‘It is prohibited as a mercy and a lightening of the burden (from the ummah), thus whosoever has the ability then there is no harm, and a number of the salaf practiced wisaal for days<\/em>..”<\/p>\n<p>Thus their position and practice revolves around an understanding they had of the hadeeth and that is that they saw the prohibition was out of fearing hardship upon the ummah and if one feels able then there is no harm.<\/p>\n<p>3. The third position is that it is permissible to practice wisaal until the time known as sahar (which is the time of suhoor). This was the position of Imaam Ahmad, Ishaq (Ibn Raahawaya) and Ibn Wahb, Ibnil Mundhir and Ibn Khuzaima among others. This position is based upon the hadeeth in saheeh Al Bukhaari “<strong>Do not practice wisaal, but whosoever from you intends to practice wisaal then let him do so until the time of sahar<\/strong>”<\/p>\n<p>This third position is a strong evidence based position and was held by a number of the scholars of hadeeth. The one who practices this type of wisaal has not fallen into the prohibited type of wisaal since it is only wisaal until later that same day&nbsp;but it is best left.<\/p>\n<p>Therefore we conclude that:<\/p>\n<ol>\n<li>The majority prohibit it<\/li>\n<li>Some of the Salaf held it to be permissible due to the hadeeth ‘it was prohibited out of mercy for them’ and due to the messenger&nbsp;&#8211; Sallallahu alaihi Was Salam&nbsp;practicing it with his companions.<\/li>\n<li>Many of the scholars of hadeeth held it to be permissible until the time of Suhoor due to the hadeeth “..<strong>but whosoever from you intends to practice wisaal then let him do so until the time of sahar<\/strong>”<\/li>\n<\/ol>\n<p>Concerning the affair Shaikh Uthaimeen said while discussing the issue of the Messenger&nbsp;&#8211; Sallallahu alaihi Was Salam&nbsp;fearing harm upon his Ummah:<\/p>\n<p>“ and another example of this is that which Aisha &#8211; Radhiyallahu anhaa – narrated concerning him prohibiting them from Al Wisaal out of mercy for them, that is he prohibited the Sahaabah from Wisaal. Wisaal is that a person fasts continuously for two days or more without breaking the fast. He fasts night and day for two days or more. The prophet&nbsp;&#8211; Sallallahu alaihi Was Salam&nbsp; prohibited them from that, but they understood that he prohibited them out of mercy and not out of dislike for the action (itself). So they continued wisaal until the month of shawaal came (the month following ramadhaan) so he ﷺsaid if the moon had been delayed I would have continued with you! (Bukhaari: 1965). Meaning I would have let you continue practicing wisaal as a disciplinary&nbsp;measure for you, so they would know the pain of hunger and thirst and refrain from wisaal themselves. In conclusion he prohibited them from wisaal out of mercy for them. They said to him ‘<em>Indeed you practice wisaal and we wish to emulate you!<\/em>’ so he said: “<strong>I am not like you indeed I am fed by my lord and given drink<\/strong>..”<\/p>\n<p>(Explanation of Riyaadhus Saaliheen 3\/558-559)<\/p>\n<p>Wallahu A’lam<\/p>\n\n\n<p> @abuhakeembilal <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Did the Prophet (ﷺ) prohibit continuous fasting (Wisaal)? This article explores Hadith regarding Wisaal and the different positions of Islamic scholars on its permissibility. We delve into the practices of the Salaf (early Muslims) and the reasoning behind the varying opinions. Learn the wisdom behind the Prophet&#8217;s (ﷺ) teachings and the importance of following them.<\/p>\n","protected":false},"author":1,"featured_media":8855,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[10,22],"tags":[],"class_list":["post-1217","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fiqh","category-worship"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2015\/07\/The-Salaf-and-Wisaal-Continuous-Fasting.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1217","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1217"}],"version-history":[{"count":1,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1217\/revisions"}],"predecessor-version":[{"id":10414,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1217\/revisions\/10414"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8855"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}