{"id":1227,"date":"2015-08-30T20:27:32","date_gmt":"2015-08-30T19:27:32","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1227"},"modified":"2024-07-03T07:00:54","modified_gmt":"2024-07-03T07:00:54","slug":"a-word-on-the-miracles-of-the-quraan-lecture-clarifying-scientific-references","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/a-word-on-the-miracles-of-the-quraan-lecture-clarifying-scientific-references\/","title":{"rendered":"A Word on the &#8216;Miracles of the Qur&#8217;aan&#8217; Lecture: Clarifying Scientific References"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1227?action=genpdf&amp;id=1227\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal hamdullillah was salaatu was salaamu &#8216;alaa Rasoolillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>I was recently approached by a brother outside the masjid seeking further clarity concerning some issues related to the &#8216;Miracles of the qur&#8217;aan lecture I delivered not long ago.<\/p>\n<p>The lecture focused upon some of the verses in the qur’aan, the issues mentioned within them, and the fact that the Prophet could not have been acquainted with these issues and thus they are a proof of the prophethood of the Messenger Sallallahu alaihi wa Salam and the miraculous nature of the Qur&#8217;aan.<!--more--><\/p>\n<p>There were some issues that perhaps were not made clear in the lecture itself (due to time constraints and my desire to discuss as much of the material as possible) so I mention and\/or re-iterate these issues here.<\/p>\n<p>Firstly, I make it clear that the lecture was not intended to be a ‘scientific tafseer’ of verses of the qur’aan and I am familiar with the statements of the people of knowledge concerning that. We do not hold that the qur’aan must be in conformity with science for it to be considered true or to be accepted, rather scientific discovery (and\/or theory) must be in conformity with the Qur&#8217;aan in order for that theory to be considered correct and sound. If that theory is in accordance with the book of Allah it is correct, if its proponents later change it and consequently opposes the book, then that <em>new<\/em> theory is baatil and falsehood.<\/p>\n<p>Whenever I mention scientific theory in the lecture I mention statements that make it clear that it is ‘what scientists believe’ and not what &#8216;I&#8217; maintain. I use terms and statements such as ‘<em>They say<\/em>..’ ‘<em>their theory is<\/em>..’ ‘<em>they can’t explain it so they say<\/em>…’ which is quite explicit in indicating that these are not <em><u>my<\/u> <\/em>beliefs but ‘theirs’<\/p>\n<p>The verses quoted have in them the mention of aspects of creation the prophet Sallallahu alaihi wa salam couldn’t know about except through revelation thus the theme throughout the lecture is ‘<em>How would Muhammad know?<\/em>’<\/p>\n<p>Therefore the issue here is not ‘The qur’aan agrees with science so it is correct’ but rather how would the prophet have known these things about the complexities of the heavens and the earth.<\/p>\n<p>I do not believe in the big bang theory as argued by atheist scientists and its connection to the theory of evolution (their discoveries concerning the movements of the galaxies gave the atheist among them joy, since these discoveries oppose the biblical version of the beginnings of creation, but not so as it relates to the Qur&#8217;aan), I do however believe that there is an <em>aspect<\/em> of the theory that is based on some ‘observation’ and not pure conjecture and conforms with the verse in suratul Anbiyaa Vs 30 as understood and explained by a number of the salaf (one of a few opinions)<\/p>\n<p><strong><em>Have those who disbelieved not considered that the heavens and the earth were a joined entity, and We separated them and made from water every living thing? Then will they not believe?<\/em><\/strong><\/p>\n<p>(Suratul Anbiyaa Vs 30)<\/p>\n<p>Imaam Ibn Katheer mentions: “<em>Meaning All parts were connected together, piled upon itself and gathered together in the very beginning, then this (part) was split from that (part), then the heavens were made seven and the earths (were made) seven and the lowest heaven and the earth were separated by air, the sky sent down rain and the earth grew vegetation<\/em>…” (Tafseer Ibn Katheer 5\/355 Dar Tayibah print)<\/p>\n<p>Imaamus Shaukaani mentions: “ <em>The term <strong>(we split)” the two of them<\/strong><\/em>..” was used because the heavens was one heaven and likewise the earths..(then after discussing the word used for splitting he says: “<em>meaning that the two of them were one connected entity and he separated between them..we then raised the heavens and kept the earth in its place and we created from water everything that lives<\/em>..”<\/p>\n<p>(Fathul Qadeer 3\/478 Daar ibn katheer print)<\/p>\n<p>Imaam Baghawi mentions: “Ibn Abaas, ‘Ataa and Qataadah (all) said: “<em>They were both one joined entity<\/em> “..<strong><em>and we split them<\/em><\/strong>” i.e. <em>we caused a separation between them with air<\/em>”..Ka’b said: “<em>Allah created the heavens and the earth joined one on top of the other then he created air and placed it between them and separated them and created an opening between them with it<\/em>”<\/p>\n<p>Thus our agreeing with the aspect of ‘their theory’ that discusses one united entity splitting and becoming heavens and earth (for the one who holds this opinion of the salaf) is not acceptance of the kufr element of the theory that excludes our creator and returns the affair back to evolution. Rather it is to say that there is an aspect of the theory that agrees somewhat with the truth and that doesn’t necessitate acceptance of the theory in totality. The reality though, is that they recognise that what they have observed must have had something that brought it into existence and so in order to flee from affirming a creator, they claim there is what they call &#8216;Higgs Boson&#8217; (which thay are still trying to find!) which is something they refer to as the &#8216;God particle&#8217; which, they say, was responsible for giving mass to other particles, in a constant attempt to deny a creator .<\/p>\n<p>Incidently experts don&#8217;t actually believe there was an &#8216;explosion&#8217; even though the title of the theory (&#8216;The Big Bang&#8217;) would appear to suggest that, rather they believe the universe began to expand after being one highly dense unit.<\/p>\n<p>I do not believe in dark energy. In the lecture I mention that they cannot explain their observations concerning the cosmos apparently moving in an outwardly direction, they don’t know what it is so <strong><em>they<\/em><\/strong> call it Dark Energy, again &#8216;them&#8217; and not me.<\/p>\n<p>Concerning the verse<\/p>\n<p><strong>&#8220;And the heaven We constructed with strength, and indeed, We are [its] expander&#8221;<\/strong><\/p>\n<p>Some of the salaf held that this was in reference to sustenance.. that is, we expand sustenance to the inhabitants of the heavens, while others held that it is a reference to the heavens themselves expanding.<\/p>\n<p>Al ‘Izz Ibn Abdis salaam mentions: “We (are able) to create a heavens like it or able to expand it past the heavens (current) expanse”<\/p>\n<p>(Tafseer Al’Izz Ibn Abdis salaam 3\/234)<\/p>\n<p>Imaam Ibn Katheer mentions: “We have made it extensively expansive and have raised it without pillars until it has become the way it is”<\/p>\n<p>(Tafseer Ibn Katheer 7\/424)<\/p>\n<p>Imaam Maawardi said: “ There are five manners (of understanding this): 1. (We expand) sustenance with rain, this was the position of Hasan (Al Basri) 2. (We expand) the sky (itself) this was the position of Abu Zaid 3. That we are able to grant expanse greater than the expanse of the heavens 4. That we expand it by creating a heaven like it, this was the position of Mujaahid. 5. We possess expanse (that is) no one is able to restrict that which we wish.<\/p>\n<p>(Tafseer Al Maawardi &#8211; Daar Al Kutub Al ilmiyah 5\/374)<\/p>\n<p>The verse therefore carries from its meaning that which they are unable to explain thus ‘they’ name this entity unknown to them, dark energy. The point here is that there are some issues scientists have observed and struggle to understand, but the verses in the qur’aan (as understood by the salaf) brings clarity to that which they can’t fathom.<\/p>\n<p>If tomorrow they change their theory it does not affect that which we believe in one iota.<\/p>\n<p>When we site for example scientific research around the benefits of raw milk, or raw honey we do so because it is based upon what we consider credible research and more importantly that it is in accordance with that which in the book and the Sunnah. The scientific detail they (scientists) mention is however not present in our texts, neither do we have anything from our Salaf mentioning that level of detail but there isn’t an issue since it is in accordance with the general indications of the qur’an and sunnah concerning those things. If they change their statements tomorrow and claim raw milk and honey is now considered harmful and dangerous that does not affect our opinion since our opinion is not ‘based’ upon their research.<\/p>\n<p>We reject explanations that do not stem from the people of knowledge and we do not advocate the permissibility of explaining the qur’aan with opinion, whether scientific or otherwise.<\/p>\n<p>Hopefully this brings some clarity.<\/p>\n<p>Was Sallallahu &#8216;Alaa Nabiyinaa Muhammad<\/p>\n<p>www.twitter.com\/abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Explore insights from the &#8216;Miracles of the Qur&#8217;aan&#8217; lecture, focusing on Qur&#8217;anic verses and their alignment with scientific theories. Understand the approach to scientific references in light of Islamic teachings and scholarly interpretation.<\/p>\n","protected":false},"author":1,"featured_media":8812,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[122,1],"tags":[],"class_list":["post-1227","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-the-quraan","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2015\/08\/Miracles-of-the-Quraan.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1227","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1227"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1227\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8812"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1227"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1227"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1227"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}