{"id":1346,"date":"2017-02-18T16:21:21","date_gmt":"2017-02-18T16:21:21","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1346"},"modified":"2024-07-09T00:24:45","modified_gmt":"2024-07-09T00:24:45","slug":"the-myth-of-darwinian-evolution-part-1-introduction","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-myth-of-darwinian-evolution-part-1-introduction\/","title":{"rendered":"The Myth of Darwinian Evolution (Part 1): Introduction"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1346?action=genpdf&amp;id=1346\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salātu Was Salāmu &#8216;alā rasoolillahi<\/p>\n<p>Ammā Ba&#8217;d:<\/p>\n<p>It is an established trait from the traits of those who rejected the call of the prophets and the messengers of the past that they would use various conjecture based claims to stand against the prophet and his followers.<\/p>\n<p>The affair was no different at the time of prophet Muhammad, the pagan tribe of Quraish who stood against him would forge lies upon him while at the same time they themselves were proponents of belief systems based upon conjecture and falsehood.<\/p>\n<p>Allah the most high mentions in the Qur&#8217;ān:<\/p>\n<h3 style=\"text-align: center;\">أَفَرَأَيْتُمُ اللَّاتَ وَالْعُزَّىٰ<\/h3>\n<p style=\"text-align: center;\">Have you then considered Al-Lat, and Al-&#8216;Uzza (two idols of the pagan Arabs).<\/p>\n<h3 style=\"text-align: center;\">وَمَنَاةَ الثَّالِثَةَ الْأُخْرَىٰ<\/h3>\n<p style=\"text-align: center;\">And Manat (another idol of the pagan Arabs), the third? {Suratun Najm: 19-20}<\/p>\n<p style=\"text-align: center;\">Allah then goes on to say a few verses later:<\/p>\n<h3 style=\"text-align: center;\">إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنتُمْ وَآبَاؤُكُم مَّا أَنزَلَ اللَّهُ بِهَا مِن سُلْطَانٍ ۚ إِن يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنفُسُ ۖ وَلَقَدْ جَاءَهُم مِّن رَّبِّهِمُ الْهُدَىٰ<\/h3>\n<p style=\"text-align: center;\">They are not but [mere] names you have named them &#8211; you and your forefathers &#8211; for which Allah has sent down no authority. They follow not except assumption and what [their] souls desire, and there has already come to them from their Lord guidance. {Suratun Najm: 23}<\/p>\n<p style=\"text-align: left;\">Thus rejection of the prophets has historically been based in conjecture. In our era, the affair remains the same. But rather than rejection of the oneness of the creator, and his sole right to be worshipped alone, due to blind bigotry towards an idol, we have in our era blind faith of another kind. A concept masked in the guise of &#8216;established fact&#8217; and &#8216;well known undisputed truth&#8217; and &#8216;compelling evidence&#8217;, while the reality is, it is as much a &#8216;belief&#8217; as any other man-made religion is and that is the belief in the theory of Darwinism.<\/p>\n<p style=\"text-align: left;\"><span style=\"text-decoration: underline;\">Who was Charles Darwin?<\/span><\/p>\n<p><b>Charles Robert Darwin<\/b> (12 February 1809– 19 April 1882) was an English naturalist and geologist<span style=\"font-size: 12.5px;\">.<\/span> He was born in Shrewsbury, England. He is famous for his theory of evolution.<\/p>\n<p>Charles Darwin&#8217;s views about common descent (the belief that all living beings, share a single common ancestor), as expressed in his book &#8216;<em>On the Origin of Species&#8217;<\/em>, were that he argued that there was only one ancestor for all life forms<\/p>\n<p>His book <i>&#8216;On the Origin of Species&#8217;<\/i> (1859) did two things. First, it provided what Darwinist consider evidence that evolution has taken place (even though latter day Darwinists added to the body of &#8216;evidence&#8217; presented by darwin, without furthering his plight one iota). Second, it proposed a theory to explain <i>how<\/i> evolution works. That theory is known as <em>Natural Selection<\/em>. Evolution by natural selection is one of the key concepts within Darwinist belief. They hold that it explains the presence and diversity of life on Earth. Therefore belief in a &#8216;Creator&#8217; is a fallacy, since science explains why and how we exist.<\/p>\n<p><strong><u>Natural Selection (Or &#8216;Survival of the fittest&#8217;)<\/u><\/strong><\/p>\n<p>Darwin believed that living beings have been modified primarily by ‘<em>natural selection’<\/em> acting on ‘<em>random variations’ <\/em>or in other words ‘Survival of the fittest’<\/p>\n<p>He wrote:<\/p>\n<p>“<em>I am convinced that natural selection has been the most important, but not the exclusive means of modification<\/em>”<\/p>\n<p>He argued that lifeforms, all returned back to one common ancestor. This one common ancestor changed into different species and types through random mutations, that occurred within that one species. Those mutations brought about stronger forms of the same being, that were better able to survive their environment, causing the previous &#8216;weaker&#8217; life forms, to remain unchanged or ultimately die out. They then went on to breed with other randomly &#8216;mutated&#8217; beings like themselves, over generations. Eventually, they became a separate species that was unable to mate with it predecessor. Thus we had the creation of a new &#8216;species&#8217; of animal.This, he believed, was the process that brought fish, reptiles, birds, amphibians and mammals into existence, not to mention the varying types of animal within each animal &#8216;group&#8217;.<\/p>\n<p>Therefore he argues that, all the organic beings which have ever lived on this earth have descended from one primitive origin, into which life was first breathed<\/p>\n<p>Jerry A. Coyne is a professor in the Department of Ecology and Evolution at The University of Chicago. In <em>Why Evolution is True<\/em>, he summarizes Darwinism—the modern theory of evolution—as follows: “Life on earth evolved gradually beginning with one primitive species—perhaps a self-replicating molecule—that lived more than 3.5 billion years ago; it then branched out over time, throwing off many new and diverse species; and the mechanism for most (but not all) of evolutionary change is natural selection.”<\/p>\n<p>(Jerry A. Coyne, Why Evolution Is True (New York: Viking, 2009), p. 3.)<\/p>\n<p>Coyne further explains that evolution “simply means that a species undergoes genetic change over time. That is, over many generations, a species can evolve into something quite different, and those differences are based on changes in the DNA, which originate as mutations. The species of animals and plants living today weren’t around in the past, but are descended from those that lived earlier.”<\/p>\n<p>(Coyne, Why Evolution Is True, pp. 3-4)<\/p>\n<p>According to Coyne, however, “if evolution meant only gradual genetic change within a species, we’d have only one species today—a single highly evolved descendant of the first species. Yet we have many… How does this diversity arise from one ancestral form?” It arises because of “splitting, or, more accurately, speciation (pronounced &#8216;spee-see-ay-tion),” which “simply means the evolution of different groups that can’t interbreed.”<\/p>\n<p>(Coyne, Why Evolution Is True, pp. 5-6)<\/p>\n<p><strong><u>Important definitions<\/u><\/strong><\/p>\n<p>The following are some essential definitions we should be acquainted with early on in our discussion.<\/p>\n<p><strong><u>Evolution<\/u><\/strong><\/p>\n<p>Evolution has many meanings. In its most general sense, it means change over time. The present is different from the past. No sane person rejects evolution in this sense.<\/p>\n<p>Not all change is considered Darwinian evolution, therefore the type of evolution we are referring to is ‘cumulative (i.e. increasing, growing) change over time’. The fact that things change over time is also not controversial. Biologists refer to evolution specifically as ‘a change in &#8216;gene frequencies&#8217; (&#8216;mutations&#8217; for short) over generations’. Similarly, evolution in this sense is still uncontroversial. One person&#8217;s genes differ from the genes of his parents, and theirs, differ from the genes of their parents, and so on.<\/p>\n<p><strong><u>Descent with Modification<\/u><\/strong><\/p>\n<p>Darwin&#8217;s term for evolution was: ‘Descent with modification (i.e. Descent with change)’ this definition of his, upon first hearing it doesn’t sound particularly problematic either, as it could well include the differing in genes between parent and child we mentioned earlier. Animal breeders have used decent with modification for years, but <u>within a specific species<\/u> (make a note of this as it is important to our discussion)<\/p>\n<p>The same occurs in the wild, but again <u>only within a specific existing species.<\/u><\/p>\n<p>Thus far, these understandings of evolution are not problematic.<\/p>\n<p>Charles Darwin claimed far more than any of these things though. In ‘The Origin Of Species’ he set out to explain the origin of <em>all <\/em>species of living creatures, that is, all the diversity of life on earth. Thus our discussion is, in truth, around Darwinism and not merely evolution in the general aforementioned sense.<\/p>\n<p><strong><u>Darwinism<\/u><\/strong><\/p>\n<p><u>Summary of the theory<\/u><\/p>\n<p>Darwin&#8217;s theory of evolution, therefore, revolves around the concept that, organisms in nature, typically produce more offspring than can survive and reproduce, given the constraints of food, space, and other resources in the environment. But they may have random mutations that give the life form, an advantage over its weaker counterpart. These differences that occur, due to random genetic mutations within DNA, may be passed on to their offspring. If competing offspring, have traits that give them an advantage in a given environment, they will survive and pass those traits on. As these differences accumulate over generations, populations of organisms diverge and differ, from their ancestors. This process has led the earliest organisms on earth to diversify into all animals and microorganisms that exist today.<\/p>\n<p>Thus the theory applies to living beings.<\/p>\n<p>Darwinism, therefore,  consists of the following claims:<\/p>\n<ol>\n<li>All living things are modified descendants of one common ancestor<\/li>\n<li>The principle mechanism of modification has been <em>natural selection<\/em> (survival of the fittest) acting on undirected random variations that originate in DNA (gene) mutations, and,<\/li>\n<li>Unguided random processes are sufficient to explain all features of living things, so whatever may appear to be ‘design’ is just an illusion.<\/li>\n<\/ol>\n<p>This is Darwinism.<\/p>\n<p>Darwin wrote in ‘The Origins Of Species’:<\/p>\n<p>“<em>I view all beings not as special creations, but as the lineal descendants of some few beings that lived in the distant past<\/em>”<\/p>\n<p><strong>A note on the term ‘Intelligent Design’<\/strong><\/p>\n<p>Intelligent design refers to the use of empirical evidence (i.e. verifiable by observation or experience rather than theory or pure logic)  to indicate that some features of the natural world are best explained by an intelligent cause, it is not always used, however, to refer to belief in god. There exists a body of atheist scientists who believe in Intelligent Design, but do not believe in God (for example the well know atheist philosopher Antony Flew &#8211; 1 February 1923 – 8 April 2010. After being a well-known atheist for many years, he converted to &#8216;deism&#8217; in 2004. Though when arguing that he believes in Intelligent design, he advocated an Aristotelian philosophical god and not the god of Christians and Muslims). The ID movement, as it is sometimes called, is a relatively new one, gaining popularity in the 1980’s. Therefore, while some may use the term in a general way intending by that, belief in god, it is important to know that this is not always intended by all who use it. In short, all belief in God is belief in Intelligent Design, but not all belief in Intelligent Design is belief in God. The issue here is, one must be sure to ascertain the intent of the one who uses this term.<\/p>\n<p>In rejection of intelligent design, Darwin strikes an example of a house built from rock, found at the base of a mountain. He argued that while the rocks are important to the architect, their relationship with the house he has built, is similar to the relation of the variations of each organic being, and the varying forms of their descendants. So even though the rocks were used to build something beautiful, the rocks themselves are just random accidental structures.<\/p>\n<p>In this parable of his, the architect (as far as Darwin was concerned) is natural selection. While this parable may sound convincing, the correct parable, in relation to his theory, would be like the same architect closing his eyes, then throwing those rocks in any direction or even (for arguments sake) in one direction, if he throws enough rocks eventually they accidentally fall in just the right sequence so as to produce, a beautiful, two storey home, with winding staircase, living room, kitchen, a number of bedrooms, fireplace, a beautiful chimney and high wall surrounding it. What then is the likelihood of that occurring? A parable that, I&#8217;m sure you’ll agree requires rethinking!<\/p>\n<p><span style=\"text-decoration: underline;\">Secondly<\/span>, if a stranger were to stumble across the house, what is he most likely to conclude, that it was the work of an intelligent architect, building with open eyes or the work of a random individual throwing rocks randomly with both eyes shut tight? And for what reason would that stranger reject the first suggestion, and fight and argue vehemently for the second?<\/p>\n<p>But the reality of what he is suggesting with his theory doesn&#8217;t stop there, supposing he goes on to postulate that the same thing occurred with the house next door, then the houses on the whole street, and then all of the real estate within the city!? This, in essence, is what he suggests, and more.<\/p>\n<p><span style=\"text-decoration: underline;\">And thirdly<\/span>, would he dare reject the fact that this was the work of an architect? and go further to deny his existence claiming there is no evidence proving he exists because he had never personally seen him?<\/p>\n<p><span style=\"text-decoration: underline;\">Fourthly<\/span>, the parable is, in essence, a refutation against his theory since the house he suggests is based on the work of an ‘Intelligent designer’ (in this case the architect) something he rejects!<\/p>\n<p>Darwin and Darwinists have struggled to find and compile evidences for the theory. There is not a single established evidence for the &#8216;belief&#8217; yet they are bold enough to refer to the theory as ‘fact’ and not theory. Upon analysis, we see they are unable able to substantiate their claim with a single firmly established undisputed argument. Thus Darwinism is considered by many in the scientific world, much less among believers in God, to be nothing more than a set of ‘beliefs’ or simply put, another man-made ‘religion’ with ‘Natural Selection’  and ‘Decent with modification’ as it as its deity.<\/p>\n<p><span style=\"text-decoration: underline;\">The ‘evidences’ for the theory?<\/span><\/p>\n<p>Any theory that purports to be ‘scientific’ must somehow, at some point, be substantiated through observation and\/or experiment.<\/p>\n<p>Theories that survive repeated testing may be tentatively regarded as true statements.<\/p>\n<p>But if there is a consistent conflict between theory and evidence, the former must submit to the latter.<\/p>\n<p>If this occurs, it is no longer science, but a myth.<\/p>\n<p>Testing must also be made public, so as to be examined by experts, which is known in the science world as ‘<span style=\"text-decoration: underline;\"><em>Peer Review<\/em><\/span>’<\/p>\n<p>Darwinists have a number of ‘so-called’ evidence they believe substantiates the theory.<\/p>\n<p>These evidences are regularly used in science texts book and quoted by lecturers as undisputed fact.<\/p>\n<p>As a young, biomedical Science University student in the early 90’s, I remember being taught some of this evidence very early on in the degree. They are taught as fundamental building blocks essential to every science student, particularly the science of biology. And I am sure the same applies to other universities teaching similar degrees.<\/p>\n<p>These oft-quoted evidences then, are:<\/p>\n<ol>\n<li>The Theory of Natural Selection<\/li>\n<li>The Miller\/Urey experiment: A laboratory simulation of the earth’s primitive atmosphere in which it is claimed electric sparks produced the building blocks of living cells (The Operin\/Holdane hypothesis supported by the resultant Miller\/Urey experiment)<\/li>\n<li>The fossil records: An analysis of a growing body of fossil and molecular evidence reconstructing the evolutionary ‘Tree of Life’<\/li>\n<li>Pictures of similarities in early embryos showing that amphibians, reptiles, birds, and human beings are all descended from a fish like creature<\/li>\n<li>Similar bone structures in a bat&#8217;s wing, a porpoise&#8217;s flipper, a horse&#8217;s leg and a human hand that indicate their evolutionary origin in a common ancestor<\/li>\n<li>Archaeopteryx (pronounced Ar-ke-op-ter-ix, sometimes referred to as Urvogel (meaning original bird). A fossil bird with teeth in its jaws and claws on its wings, the missing link (it is claimed) between ancient reptiles and modern birds<\/li>\n<li>Darwin’s Finches: 13 species of finch Darwin found on the Galapagos islands that diverge from one, it is said this is what inspired Darwin to formulate his ‘theory of evolution’<\/li>\n<li>Fruit flies with an extra pair of wings showing that genetic mutations can provide the raw materials for evolution. And finally ;<\/li>\n<li>Drawings of ape like animals evolving into humans, showing that our existence is merely a by-product of purposeless natural causes<\/li>\n<\/ol>\n<p>In the following parts of this series we will look at these &#8216;evidences&#8217; one by one inshallah.<\/p>\n<p>Wa Sallallāhu &#8216;alā nabiyinā Muhammad<\/p>\n<p>@abuhakeembilal<\/p>\n<p><a href=\"http:\/\/ah-sp.com\/2017\/02\/21\/the-myth-of-darwinian-evolution-part-2-natural-selection\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\"><span style=\"text-decoration: underline;\">Part 2: Natural Selection<\/span><\/a><\/p>\n<p style=\"text-align: center;\">\n","protected":false},"excerpt":{"rendered":"<p>This first part of a 5-part series examines core tenets of Darwinian Evolution, contrasting them with Islamic beliefs about creation. It explores the concept of blind faith in scientific theories and the importance of proper explanation alongside quoted hadiths.<\/p>\n","protected":false},"author":1,"featured_media":9119,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,5,8,13,16],"tags":[],"class_list":["post-1346","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-children","category-family-related","category-miscellaneous","category-sects-and-groups"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/02\/The-Myth-of-Darwinian-Evolution-Part-1.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1346","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1346"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1346\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9119"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1346"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1346"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1346"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}