{"id":1643,"date":"2017-02-21T17:57:52","date_gmt":"2017-02-21T17:57:52","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1643"},"modified":"2024-07-09T01:59:27","modified_gmt":"2024-07-09T01:59:27","slug":"the-myth-of-darwinian-evolution-part-2-examining-natural-selection","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-myth-of-darwinian-evolution-part-2-examining-natural-selection\/","title":{"rendered":"The Myth of Darwinian Evolution (Part 2): Examining Natural Selection"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1643?action=genpdf&amp;id=1643\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salātu Was Salāmu &#8216;alā rasoolillahi<\/p>\n<p>Ammā Ba&#8217;d<\/p>\n<p><span style=\"text-decoration: underline;\">The Myth of Darwinian Evolution (Part 2) &#8211; Natural Selection<\/span><\/p>\n<p>We begin this section by mentioning that the issue of <em>Natural Selection<\/em> is perhaps the most  fundamental, key issue Darwin&#8217;s theory of Evolution is based upon. Darwin first proposed his theory of evolution, then sought evidence to substantiate the theory, this is important to note. It explains why Darwin and scientist believers in his theory, have struggled desperately to establish the evidence to confirm it.<\/p>\n<p>In his book <em>The origin of species<\/em> Darwin presented three main arguments:<\/p>\n<ol>\n<li>That species are not immutable (lit: Fixed, unchangeable), that is to say, new species of living beings have appeared during earths long history, through a process he named <em>decent through modification<\/em> (Random, undirected, mutations in the organisms DNA, leading to the development of an advanced version of the same creature, and this process continued until we have a completely new ‘species’ of animal that is unable to breed with its pre-species)<\/li>\n<li>That this process accounts for all diversity of life<\/li>\n<li>That this process was guided by <em>Natural selection<\/em> (survival of the fittest, the weaker inferior creature was surpassed by the new ‘mutant’ creature and thus it survived and the previous lifeform didn’t)<\/li>\n<\/ol>\n<p>This third issue of <u>natural selection<\/u> is the topic at hand here,<\/p>\n<p>As mentioned previously, Darwins theory of natural selection is based upon decent through modification. Darwin claimed that all species of animal after the first lifeform, are <em>descended with modification<\/em> from some other species. <u>Therefore, everything in Darwin’s theory revolves around his argument that, the origin of all and any new species of animal, stem from existing species<\/u>, what evolutionary biologist call <u>speciation <\/u>(spee-see-ay-shun). Proving changes within <em>existing<\/em> species are beside the point. Darwin called his book ‘<em>on the origin of species’<\/em> since he was fully conscious of the fact that the change from one species to another was the most fundamental <em>problem<\/em> of his evolution theory. Thus the issue at hand is not change &#8216;within&#8217; a species, but one species becoming another.<\/p>\n<p>So speciation is Darwinism’s most fundamental problem, the starting point for everything else in evolutionary theory. It is not an issue for believers in intelligent design though, those who believe in an ever-living  most-knowledgeable, Most-wise creator, do not have any issues here.<\/p>\n<p>Speciation is not an issue for them, since every organism that exists, points clearly and categorically towards design. The creator of those organisms has also informed, in his revelation, of how he created. Revelation tallies with everything observed, just as we concluded in our previous house parable,  the observed house could only be the work of an architect.<\/p>\n<p><u>‘Observed’ speciation<\/u><\/p>\n<p>As a purely scientific matter however, it is reasonable to ask, has speciation, the most fundamental process in Darwinism, ever been <u>observed<\/u>.<\/p>\n<p>This <em>on-going<\/em> process, that has accounted for the development of all species, of fish, reptile, amphibian and mammal <em>should, <\/em>in order to be a consistent theory, still be observed!<\/p>\n<p>The argument is:  that through speciation, all kinds of animal have developed. Due to decent with modification, gradual changes through mutations, all species have developed. Due to fitness, some have survived and others have just not developed or have died out.<\/p>\n<p><u>Mutation<\/u><\/p>\n<p>Mutations are randomly occurring genetic changes, which are nearly always harmful when they produce effects within the organism large enough to be visible. The theory of evolution depends heavily upon mutations. Of course, mutations are genetic ‘errors’ that may occur within the DNA of a cell on rare occasions. While Darwin evolutionists agree that mutations are errors, they argue that those errors may occasionally improve the organisms ability to survive and reproduce. Organisms generally produce more offspring than can survive to maturity. In addition, offspring that have an advantage of this kind, can be expected to go on to produce more descendants themselves, than less advantaged members of the species.<\/p>\n<p>The theory supposes that given enough time, and sufficient mutations of the right sort, enormously complex organs and patterns of adaptive behaviour, can eventually be produced in tiny cumulative steps, without the need for the existence of some pre-existing intelligence.<\/p>\n<p>This is natural selection in a nutshell<\/p>\n<p><span style=\"text-decoration: underline;\">Important note:<\/span><\/p>\n<p>Before the selection process can begin, there has to be something to &#8220;select.&#8221; And that something is genes. If evolution can be thought of as manufacturing process whose product is increasingly complex organisms, then genes are its raw materials.<\/p>\n<p>Genes are regions of DNA that consist of thousands to hundreds of thousands of base molecules arranged in a precise sequence. Needless to say, producing such a highly organized structure from a random, undirected process is a tall order. In fact, the chance of getting the correct sequence of molecules by happenstance is about one in ten to the thousandth power 10<sup>1000<\/sup> (that is ten with 1000 zeros!), even for the smallest gene!<\/p>\n<p><u>Macro mutation Vs Micro mutation <\/u><\/p>\n<p>Mutations are of two main types:<\/p>\n<ol>\n<li><u>Macro mutations (Also known as saltation)<\/u>: A macro mutation is a major mutation that occurs within the gene structure of a cell, having a profound effect upon changing the nature of the cell and thus the organism itself.<\/li>\n<li><u>Micro mutations<\/u>: A micro mutation, is a minor, small-scale or highly localized mutation, one involving alteration at a single gene locus (the position of a gene within a chromosome)<\/li>\n<\/ol>\n<p>Darwin argued, in essence, that evolution was based in macro evolution. That there would be major mutations that bring about major changes in an organism that would lead, in time, to the mutated organism surviving and changing. Over time it would be unable to breed with its like, but would breed with another similarly mutated organism, and they would go on to become a species.<\/p>\n<p>It must also be born in mind, that DNA has amazing &#8216;proof reading, self repairing abilities. Chemical damage to DNA occurs naturally as well, and cells use DNA repair mechanisms to repair mismatches and breaks in DNA—nevertheless, the repair sometimes fails to return the DNA to its original sequence. So the theory therefore, is dependant upon waiting for mutations within a cell that would ordinarily repair itself, to fail to repair itself, and for resultant mutation to be &#8216;beneficial&#8217;!<\/p>\n<p>Saltations (or systemic macromutations, as they are often called today) are believed to be theoretically impossible by most scientists, and for good reason. Living creatures are extremely intricate assemblies of interrelated parts, and the parts themselves are also complex. It is impossible to imagine how the parts could change in unison as a result of chance mutation. In a word (Darwin&#8217;s word), a saltation is equivalent to a miracle. Though he still maintained it &#8216;could&#8217; happen.<\/p>\n<p>Many organs require an intricate combination of complex parts to perform their functions. The eye and the wing are the most common illustrations, but it would be misleading to give the impression that either is a special case; human and animal bodies are literally packed with similar marvels.<\/p>\n<p>Darwin wrote in <em>The origin of Species<\/em>:<\/p>\n<p>&#8220;Natural selection can act only by the preservation and accumulation of infinitesimally small inherited variations, each profitable to the preserved being&#8221;<\/p>\n<p>How can such things be built up by &#8220;<em>infinitesimally small inherited variations, each profitable to the preserved being<\/em>?&#8221; The first step towards a new function- such as vision or ability to fly- would not necessarily provide any advantage unless the other parts required for the function appeared at the same time. As an analogy, imagine a medieval ironsmith producing by chance a silicon microchip; in the absence of supporting computer technology the prodigious invention would be useless and he would throw it away.<\/p>\n<p>The animal that developed the first mutated wing for example would probably have an awkward time climbing or grasping long before they became useful for gliding, thus placing the hypothetical creature at a serious disadvantage. Which, by the standard set in the theory based in ’survival of the fittest’, should cause this mutant creature to die out.<\/p>\n<p>The number of vertebrae has to be changed in whole units, and to accomplish this you need to do more than just &#8216;shove in&#8217; an extra bone, because each vertebra has associated with it a set of nerves, blood vessels, muscles, and so on. These complicated parts would all have to appear together for the extra vertebrae to make any biological sense<\/p>\n<p>Stephen Jay Gould asked himself &#8220;the excellent question, What good is 5 per cent of an eye?,&#8221; and speculated that the first eye parts might have been useful for something other than sight. Richard Dawkins responded that &#8211; &#8220;An ancient animal with 5 per cent of an eye might indeed have used it for something other than sight, but it seems to me as likely that it used it for 5 per cent vision. And actually I don&#8217;t think it is an excellent question. Vision that is 5 per cent as good as yours or mine is very much worth having in comparison with no vision at all. So is 1 per cent vision better than total blindness. And 6 per cent is better than 5, 7 per cent better than 6, and so on up the gradual, continuous series.&#8221;<\/p>\n<p>The fallacy in that argument is that <u>&#8220;5 per cent of an eye&#8221; is not the same thing as &#8220;5 per cent of normal vision.&#8221;<\/u> For an animal to have any useful vision at all, many complex parts must be working together. Even a complete eye is useless unless it belongs to a creature with the mental and neural capacity to make use of the information by doing something that furthers survival or reproduction. What we have to imagine is a chance mutation that provides this complex capacity all at once, at a level of utility sufficient to give the creature an advantage in producing offspring.<\/p>\n<p>(It is also worth noting that is it well known among biolologists, that animals with gene related deformities have generally been found to be sterile)<\/p>\n<p>Bird and bat wings appear in the fossil records already developed, and no one has ever confirmed by experiment that the gradual evolution of wings and eyes is possible.<\/p>\n<p>Thus the issue remains a conundrum for evolutionist. They will continue to defend their position by saying “examples of macro mutation and gradual change in organisms, just haven’t yet been discovered in the fossil records”<\/p>\n<p>Since that is the case it is safe to say it is a theory Darwin thought up and then attempted to seek evidence for. A theory that is thus far, baseless.<\/p>\n<p>Darwin could not point to impressive examples of natural selection in action, so he relied heavily upon an argument by analogy.<\/p>\n<p>Douglas J Futuyma stated:<\/p>\n<p>“When Darwin wrote the origin of species he could offer no good cases for natural selection because no one had looked for them. He drew instead an analogy with the artificial selection that animal and plant breeders use to improve domesticated varieties of animals and plants. By breeding only from the woolliest sheep, the most fertile chickens, and so on. Breeders have been spectacularly successful at altering almost every imaginable characteristic of our domesticated animals and plants, to the point where most of them differ from their wild ancestors, far more than related species differ from them<em>&#8220;<\/em>.<\/p>\n<p>The analogy to artificial selection is misleading. Plant and animal breeders employ intelligence, and specialised knowledge to select breeding stock and to protect them from natural dangers.<\/p>\n<p>The point of Darwin’s theory was to establish that senseless, purposeless, natural processes can substitute for intelligent design.<\/p>\n<p>The fact that he defended his point using examples and accomplishments of intelligent designers, only proves that his audience was highly uncritical of him!<\/p>\n<p>Artificial selection is <em>not<\/em> basically the same sort of thing as natural selection, but fundamentally different.<\/p>\n<p>Human breeders produce variations in pigeons or chickens or sheep for purposes absent in nature.  When domesticated animals return to the wild, they revert quickly to their wild state, the most highly specialised breeds quickly perish.<\/p>\n<p>Additionally breeders have created no new &#8216;species&#8217;. For example all dogs are of a single species because they are chemically capable of interbreeding. They are dogs. Differences in size may make mating with some breeds impractical. But they remain dogs!<\/p>\n<p>The late French zoologist and evolutionist Pierre-P. Grassé concluded: “The results of artificial breeding provides powerful testimony <em>against<\/em> darwins theory, in spite of the intense pressure generated by artificial selection, eliminating any parent not answering the criteria of choice, over a whole millennia, no new species are born”<\/p>\n<p>The fact is that selection gives tangible form to, and gathers together, all the varieties a genome (the genetic material of an organism consisting of DNA) is capable of producing but does not constitute and innovative evolutionary process.<\/p>\n<p>In other words the reason dogs don’t become as big as elephants much less change into elephants, is not that we just haven’t been breeding them long enough, dogs do not have the genetic capacity for that degree of change. They stop getting bigger when their genetic limit is reached.<\/p>\n<p>Darwinists disagree with this and they have points to make. They point with pride to laboratory experiments with fruit flies, which has not produced anything but fruit flies! though it may have changed some of their characteristics.<\/p>\n<p>As far as animals are concerned darwinists return the inability to produce new species to a lack of sufficient time. The time available has to be taken into account in evaluating breeding experiments but it is also possible that the greater time available to nature is more than counterbalanced by the power of intelligent purpose, which is brought to bear in artificial selection. With respect to the fruit fly experiment for example Pierre-P. Grassé noted that the fruit fly, seems not to have changed since the remotest times. Nature has had plenty of time but it just hadn’t been doing what the experimenters have been doing.<\/p>\n<p>Whether selection has ever accomplished speciation, that is, the production of a new species, is not the point. A biological species is simply a group capable of interbreeding. Success in dividing fruit flies into two or more populations that cannot inter breed, <em>does not<\/em> constitute evidence that a similar process could in time produce a fruit fly from a bacterium.<\/p>\n<p>Thus if breeders where able to produce dogs that could only breed with itself and not other dogs they would have only made the tinest step towards proving darwins claims. Since only a part of his theory and definition of new species revolved around the new species being unable to breed with the pre-species.<\/p>\n<p>Thus more evidence is needed.<\/p>\n<p><u>Natural selection is a tautology (a way of saying the same thing twice)<\/u><\/p>\n<p>The sum total of the concept is that the species that is strong enough to produce the most offspring…will produce the most offspring!<\/p>\n<p>The famous philosopher of science karl popper (28 July 1902 – 17 September 1994) wrote:<\/p>\n<p>“Darwinism is not really a scientific theory, because natural selection is an all-purpose explanation which can account for anything, and which therefore explains nothing!”<\/p>\n<p>A tautology does not explain anything. When I want to know how a fish can become a man I am not enlightened by being told that the organisms that leave the most offspring…leave the most offspring.<\/p>\n<p>The reality of the theory of natural selection is that we are told that the fittest beings remained in a given environment. Characteristics that give offspring an advantage differ from time and place and circumstance. That which may be an advantage in one place may not be so in another. The development of wings on a beetle may be an advantage in one place but if they are close to the sea, for example it could cause them to be light and easy to be blown away to sea, in which case it is a disadvantage. Therefore the characteristic that is considered advantageous to a creature, is that which helps him to survive. When he survives, he leaves the most offspring as a result of his survival. Therefore natural selection in actuality only states the obvious, that the organism that leaves the most offspring…will leave the most offspring!<\/p>\n<p><span style=\"text-decoration: underline;\">Natural selection as a deductive argument<\/span><\/p>\n<p>Natural selection may be presented in the form of a deductive argument.<\/p>\n<p>For example:<\/p>\n<ol>\n<li>All organisms must reproduce<\/li>\n<li>All organisms exhibit hereditary variations<\/li>\n<li>Hereditary variations differ in their effects on reproduction<\/li>\n<li>Therefore variations with favourable effects on reproduction will succeed, those with unfavourable effects will fail, and organisms will change<\/li>\n<\/ol>\n<p>From this stand point we see the only thing it establishes, is that some natural selection will occur and not that it is an explanation for evolution. Actually it does not even establish that organisms will change. In any population some animals will leave more offspring than others even if the population is headed for extinction.<\/p>\n<p><span style=\"text-decoration: underline;\">Natural selection as a scientific hypothesis<\/span><\/p>\n<p>Scientists will insist that Darwinist natural selection is a hypothesis (a supposition or proposed explanation made on the basis of limited evidence as a starting point for further investigation), that has been so thoroughly and rigorously tested and confirmed by evidence that is should be accepted  by reasonable persons as a presumptively adequate explanation for the evolution of complex life forms.<\/p>\n<p>Therefore natural selection in combination with mutation is an innovative revolutionary process with is capable of producing new kinds of organs and organisms.<\/p>\n<p>So the critical question is: What evidence confirms that the hypothesis is true?<\/p>\n<p><span style=\"text-decoration: underline;\">Where are the ‘in-between’ species?<\/span><\/p>\n<p>The development of species required very ‘gradual’ steps over many, many years. So surely we must have <em>some<\/em> evidence of at least <em>some<\/em> of these many gradual developmental changes…but not one!?<\/p>\n<p>In response we will inevitably hear natural selection (survival of the fittest) necessitated, that they died out!<\/p>\n<p>The general hypothesis is that man (and all other creatures for that matter) began as a single cell amoeba and developed into more complex cells which then went on to become a fish, then an amphibian, then a reptilian lizard, then a tree dwelling mammal, then apes, then several stages of ape-man type creatures and then mankind. Of course this is a very general version of the proposed theory.<\/p>\n<p>This presents a number of questions:<\/p>\n<p>If man evolved from apes, why are the apes still here?<\/p>\n<p>If lizards evolved into birds, why are lizards and birds both still here?<\/p>\n<p>Evolutionists will answer this is because we have had evolution ‘cycles’ due to more than one ice age or because all species have common ancestries.<\/p>\n<p>That still does not explain what we only have the presence of huge jumps from one species to another and no sign of the ‘in-between’ species. Bear in mind evolution is proposed to have taken millions of years (another issue that requires discussion). In utter desperation the evolutionist resorts to saying that the ‘missing link’ just has not yet been discovered in the fossil records. Some claim they have already found proof of the missing link, but upon investigation they have all found to be hoaxes. We will look at that under the issue of the fossil records. The reality is though that the missing link is not just one, but thousands of missing links indicative of our gradual development. That is if were looking at the missing link between monkey and man. What of the thousands of missing links between amoeba and fish? Similarly fish to amphibian, then amphibian to reptile.<\/p>\n<p>All species between fish and reptiles died out? Why then did the original species for instance fish survive?<\/p>\n<p>If there were many gradual steps between monkey and man, then why do we have hundreds of species of monkey, the original type, still living but none of the in-between?<\/p>\n<p>The claim is that modern man has been around for 1 million years (yet another &#8216;claim&#8217;)which would necessitate that it would have taken some 100 million years of more for man to develop from Monkey to man. If we said (for the sake of argument) that it took only 10 million years for modern man to develop. That would mean at the rate of significant change there would be perhaps some 200 stages (probably far far more)  from ape to man. The original monkey survived, in fact various breeds of monkey and ape, but not one of the 200 variations in between?&#8230;not one!?<\/p>\n<p>The question is where are all these varying developmental stages we should see on the planet, since both ends of the spectrum still exist, but not one of the many stages in between, not even a legitimate fossil!<\/p>\n<p>Where are the 10% man 90% ape? Or the 20% man 80% ape etc. Likewise among the other species. Why do so many pre-species, with their varying types, exist alongside their advanced species, and none of the species in-between. Could it possibly be because we actually don’t have perpetual evolution taking place?<\/p>\n<p>Another issue is, why did the evolutionary process of ape to man, stop at man? And if the argument is, it hasn’t stopped with man (i.e. man is still mutating) then why is he the only one evolving.<\/p>\n<p>The point is, evolution is not the ‘easy to accept, highly logical explanation for the origin of all things it is proposed to be, except when we leave these questions out and smooth the theory over.<\/p>\n<p><span style=\"text-decoration: underline;\">The language of the evolutionist<\/span><\/p>\n<p>Another important issue to note is the language of the evolutionist. It is commonplace to hear (or read) an evolutionist describing how evolution ‘selected’ a species, or caused a certain species to adapt. Or perhaps that evolution ‘fixed’ a particular problem or &#8216;left&#8217; something since it didn’t need fixing etc. This language points to something that has the powers of reason and design, though they will not refer to it in these terms. It is as though they perceive evolution as some sort of ‘impersonal intelligent force’ that exists, making decisions on how the species needs to evolve.<\/p>\n<p>This is clearly acknowledgement of the need for intelligent design while trying to flee from it as it will be tantamount to acknowledging a ‘creator’ but of course that cannot be done since we have an inability to establish a creator through scientific process.<\/p>\n<p>Not only do we have the magnificent creatures that exist on earth but the ideal food chain to support them. An ecology that is perfect to support life with the ideal gasses, such as oxygen and CO2 etc<\/p>\n<p>Perfection in the seasons and temperatures and the universe. There is beauty and fragrance in the flowers, birds, butterflies etc that for practical purposes should not be here.<\/p>\n<p>Wouldn’t it be fair to say that to postulate that this has come about by chance is a tad far-fetched?<\/p>\n<p>In light of all of this, even atheists like Sir Fred Hoyle have admitted,<\/p>\n<p>“<em>The idea that life originated by the random shuffling of molecules is as ridiculous and improbable as proposing that a tornado blowing through a junkyard would cause the assembly of a 747<\/em>!”<\/p>\n<p>Hoyle is among many who now concede that the universe is neither old enough nor large enough to produce even the most elemental gene. And without genes, evolution is like a factory assembly line without anything on the conveyor belt.<\/p>\n<p>Conclusion<\/p>\n<p>We are able to say in summary:<\/p>\n<ol>\n<li>That the concept of natural selection is nothing but a statement of the obvious, that is in any given circumstance, the strongest organism that has best ability to leave more offspring&#8230;will leave more offspring! and thus survive.<\/li>\n<li>That Darwins intent was that random unguided mutations, was all that was needed to bring about new species of animal.<\/li>\n<li>That through this process, man developed from a single cell organism to where he is today<\/li>\n<li>That natural selection conjectures about survival of the fittest but does not discuss the &#8216;arrival&#8217; of the fittest<\/li>\n<li>That decent with modification is until now unproven, thus ironically, believers in natural selection (when we really understands the far-fetched nature of what they assert) require far more &#8216;faith&#8217; and &#8216;belief&#8217; in it than to have faith in an Intelligent Creator.<\/li>\n<\/ol>\n<p>If this is the strongest of the evidence presented by the evolutionist and we can see its fragility, the evolutionist retorts &#8216;but there is clear evidence in fossil records!&#8217; therefore will look at that next.<\/p>\n<p>Wa Sallallahu &#8216;alā Nabiyinā Muhammad<\/p>\n<p>@abuhakeembilal<\/p>\n<p>www.ah-sp.com<\/p>\n<p><span style=\"text-decoration: underline;\"><a href=\"http:\/\/ah-sp.com\/2017\/03\/02\/the-myth-of-darwinian-evolution-part-3-the-fossil-records-refute-darwin\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Part 3 &#8211; The Fossil Records Refute Darwinism!<\/a><\/span><\/p>\n<h1 class=\"post-title\"><\/h1>\n","protected":false},"excerpt":{"rendered":"<p>This part of a series critiques Darwinian Evolution&#8217;s concept of Natural Selection. It argues that Natural Selection is a tautology and highlights the lack of transitional fossils in the fossil record.<\/p>\n","protected":false},"author":1,"featured_media":9120,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,6,8,13,23],"tags":[],"class_list":["post-1643","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-dawah","category-family-related","category-miscellaneous","category-youth-related"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/02\/Examining-Natural-Selection.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1643","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1643"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1643\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9120"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1643"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1643"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1643"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}