{"id":1824,"date":"2017-03-02T12:46:57","date_gmt":"2017-03-02T12:46:57","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1824"},"modified":"2024-07-09T00:25:13","modified_gmt":"2024-07-09T00:25:13","slug":"the-myth-of-darwinian-evolution-part-3-examining-the-fossil-record","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-myth-of-darwinian-evolution-part-3-examining-the-fossil-record\/","title":{"rendered":"The Myth of Darwinian Evolution (Part 3): Examining the Fossil Record"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1824?action=genpdf&amp;id=1824\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salātu Was Salāmu &#8216;alā rasoolillahi<\/p>\n<p>Ammā Ba&#8217;d:<\/p>\n<p>Another most important piece of evidence for Darwinian evolution is that of the fossil records. Since the theory revolves around decent with modification, and the earliest life forms changing very gradually in incremental stages, it should follow, that the best way to trace those changes is by studying the fossil records that exist for life on earth. Of course, if the theory is correct, the fossil records should be abundant with evidence of the varying life forms that have mutated and gradually became various species of animal. We should also witness some of the mutated animals that have died out, and their fitter, stronger successors.<\/p>\n<p>It is a fact that Darwin had a hard time trying to get acceptance for his theory, but most people are unaware that Darwin&#8217;s most formidable opponents were not clergymen, but fossil experts.<\/p>\n<p>Jerry A. Coyne is a professor in the Department of Ecology and Evolution at The University of Chicago and a leading evolutionist.<\/p>\n<p>According to Coyne, “if evolution meant only gradual genetic change within a species, we’d have only one species today—a single highly evolved descendant of the first species. Yet we have many… How does this diversity arise from one ancestral form?” It arises because of “splitting, or, more accurately, speciation,” which “simply means the evolution of different groups that can’t interbreed.”<\/p>\n<p>If Darwinian theory were true, “we should be able to find some cases of speciation in the fossil record, with one line of descent dividing into two or more. And we should be able to find new species forming in the wild.” Furthermore, “we should be able to find examples of species that link together major groups suspected to have common ancestry, like birds with reptiles and fish with amphibians.”<\/p>\n<p>Coyne turns first to the fossil record. “We should be able,” he writes, “to find some evidence for evolutionary change in the fossil record. The deepest (and oldest) layers of rock would contain the fossils of more primitive species, and some fossils should become more complex as the layers of rock become younger, with organisms resembling present-day species found in the most recent layers. And we should be able to see some species changing over time, forming lineages showing ‘descent with modification’ (adaptation).” In particular, “later species should have traits that make them look like the descendants of earlier ones.” (Coyne, Why Evolution Is True, pp. 17-18, 25)<\/p>\n<p>This issue is one that evolutionist past and present acknowledge. They accept that the fossil records <u>should<\/u> be the greatest testimony to Darwin&#8217;s theory. But it isn’t.<\/p>\n<p>As Coyne writes “We <em>should<\/em> be able to find some evidence for evolutionary change in the fossil record…” but we don’t! this of course is a catastrophic problem for the theory.<\/p>\n<p>In <em>The Origin of Species<\/em>, Charles Darwin acknowledged that the fossil record presented difficulties for his theory.<\/p>\n<p>Darwin knew that the major animal groups—which modern biologists call “phyla”—appeared fully formed in what were at the time the earliest known fossil-bearing rocks, deposited during a geological period known as the Cambrian.<\/p>\n<p><strong><u>The ‘Cambrian Explosion’ <\/u><\/strong><\/p>\n<p>The oldest of all fossil records at the time of Darwin were the Cambrian fossil records.<\/p>\n<p>This discovery, found in Cumbria, south Wales is possibly the greatest and most popular breakthrough fossil discovery.<\/p>\n<p>This phenomenon is so dramatic that is it known as the Cambrian Explosion (referred to as such, because most of the major animal phyla or groups, appear within it, all of a sudden) hence biologists refer to it as biology’s &#8216;big bang&#8217; (not a reference to an actual explosion).<\/p>\n<p>But the fossil record doesn’t have within it, a few species that diverged gradually over millions of years into genera then families then orders then classes then phyla.<\/p>\n<p>In the Cambrian it was discovered that there were over 50 body plans &#8212; simple to complex &#8212; appearing suddenly in the fossil record without any trace of gradual modification.<\/p>\n<p>Thus most of the major animal phyla and the major classes within it appear together …fully formed!  Darwin could not explain it except with conjecture.<\/p>\n<p>He considered this a “serious” difficulty for his theory, since “if the theory be true, it is indisputable that before the lowest Cambrian stratum was deposited long periods elapsed… and that during these vast periods the world swarmed with living creatures.” And “<strong>to the question why we do not find rich fossiliferous deposits belonging to these assumed earliest periods prior to the Cambrian system, I can give no satisfactory answer<\/strong>.” So “<strong>the case at present must remain inexplicable; and may be truly urged as a valid argument against the views here entertained<\/strong>”<\/p>\n<p>(Charles Darwin, The Origin of Species, Sixth Edition (London: John Murray, 1872), Chapter X, pp. 266, 285-288.)<\/p>\n<p>Charles Darwin plainly stated, &#8220;<strong>If it could be demonstrated that any complex organ existed which could not possibly have been produced by numerous, successive slight modifications, my theory would absolutely break down<\/strong>.&#8221;<\/p>\n<p>Darwinian evolution requires geological time periods, making the fossil record a vital ally in the corner of scientific materialism. Unfortunately for Darwin and his advocates, the fossil record has some major problems. First, the fossil record offers little to no evidence of transitional forms &#8212; those intermediary life forms bridging the gaps between known species.<\/p>\n<p>One might therefore suppose, that geologists would be continually uncovering fossil evidence of transitional forms. This, however, was clearly not the case. What geologists did discover was species, and groups of species, which appeared suddenly rather than at the end of a chain of evolutionary links. Darwin conceded that the state of the fossil evidence was &#8220;<strong>the most obvious and gravest objection which can be urged against my theory<\/strong>,&#8221;<\/p>\n<p>According to Steven Stanley, the Bighorn Basin in Wyoming contains a continuous local record of fossil deposits for about five million years, during an early period in the age of mammals. Because this record is so complete, paleontologists assumed that certain populations of the basin could be linked together to illustrate continuous evolution. On the contrary, species that were once thought to have turned into others turn out to overlap in time with their alleged descendants, and &#8220;the fossil record does not convincingly document a single transition from one species to another.&#8221; In addition, species remain fundamentally unchanged for an average of more than one million years before disappearing from the record.<\/p>\n<p><strong><span style=\"text-decoration: underline;\">The Maths of the theory<\/span><\/strong><\/p>\n<p>There are some issues related to the theory that do not add up. Bare in mind, the theory revolves around gradual change over time. To demonstrate the problem, paleontologist Stephen Stanley uses the example of the bat and the whale, which are supposed to have evolved from a common mammalian ancestor in little more than ten million years, to illustrate the unsolvable problem that fossil stasis poses for Darwinian gradualism: Let us suppose that we wish, hypothetically, to form a bat or a whale by a process of gradual transformation of established species. If an average chronospecies (fossil lifespan of a species lasts nearly a million years, or even longer, and we have at our disposal only ten million years, then we have only ten or fifteen chronospecies to align, end-to-end, to form a continuous lineage connecting our primitive little mammal with a bat or a whale. This is clearly preposterous. Chronospecies, by definition, grade into each other, and each one encompasses very little change. A chain of ten or fifteen of these might move us from one small rodent like form to a slightly different one, perhaps representing a new genus, but not to a bat or a whale!<\/p>\n<p>The other issue at hand is <em>proving<\/em> decent through modification. If we were to suppose that we had two fossils of animals that resemble one another that according to our dating seemed to precede each other. How exactly do we establish that one has ‘evolved’ from the other except through conjecture as overwhelming as it may well be.<\/p>\n<p>The late evolutionist Stephen Jay Gould acknowledged this as &#8220;the trade secret of paleontology.&#8221; He went on to admit, &#8220;<strong>The evolutionary trees that adorn our textbooks have data only at the tips and nodes of their branches; the rest is inference, however reasonable, not the evidence of fossils<\/strong>.&#8221; This is a reference to the well-known ‘tree of evolution’ that we find in our biology textbooks. The only thing that we have concrete evidence for it that which exists at the tips of the branches of the tree, everything that exists in those drawing lower down in the tree have been added based upon ‘belief’ and conjecture and not evidence.<\/p>\n<p>Other Darwinists have suggested that the absence of fossils is a problem with the fossil record itself rather than with evolutionary theory. That is to say even though we don’t have evidence for the theory in fossil records, it is because the fossil records are deficient and we will eventually discover fossil that will prove it. Again we see proof of the fact that the theory was thought up first and then evidence was sought for it! Even though evidence does not exist, evolutionists still postulate that the theory is ‘established’ even in the absence of categorical proof. And it is with this ‘blind faith’ we see believers in the theory debate.<\/p>\n<p>The history of most fossil species includes two features particularly inconsistent with gradualism:<\/p>\n<ol>\n<li><u>Stasis<\/u>. Most species exhibit no directional change during their time on earth. They appear in the fossil record, looking pretty much the same as when they disappear; morphological change is usually limited and directionless.<\/li>\n<li><u>Sudden appearance<\/u>. In any local area, a species does not arise gradually by the steady transformation of its ancestors; it appears all at once and &#8220;fully formed.&#8221;<\/li>\n<\/ol>\n<p>In short, if evolution means the gradual change of one kind of organism into another kind (a process considered by later-day darwinists (or neo-darwinists) to have occurred through genetic mutations), the outstanding characteristic of the fossil record is the absence of evidence for evolution. Darwinists explain away the sudden appearance of new species by saying that perhaps the transitional intermediates were for some reason not fossilized, and that perhaps the soft frames of the creatures caused them to dissappear and not be fossilised! But stasis- the consistent absence of fundamental directional change- is positively documented. It is also the norm and not the exception.<\/p>\n<p>Next, there is the problem of interpretation. As Ian Tattersall, Curator of the American Museum of Natural History, confesses, &#8220;The patterns we perceive are as likely to result from our unconscious mind-sets as from the evidence itself.&#8221; Richard Leakey admitted as much when he disclosed the tendency of his father (palaeontologist Louis Leakey) to arrange fossils and alter their criteria to fit into a line of human descent. That is to say, the fossils that do exist are ‘re-arranged’ to fit with evolutionist theory and not left  in the manner in which they were discovered.<\/p>\n<p>But most damaging to the integrity of the fossil record is the cloud of fraud that hangs over it. As reported in the February 2003 issue of <em>Discover<\/em>, “Such so-called missing links as Java man, Nebraska man, Piltdown man, and Peking man were eventually shown to be outright fabrications. &#8230;Today there are scores of fake fossils out there and they have cast a dark shadow over the whole field &#8230; there is a fake fossil factory in north-eastern China&#8230;. The Chinese fossil trade has become a big business.&#8221;<\/p>\n<p>For 150 years the fossil record has &#8216;refused&#8217; to affirm gradualism and, with it, Darwin’s theory of evolution<\/p>\n<p>Stephen J. Gould said:<\/p>\n<p>“<em>The absence of fossil evidence for intermediary stages between major transitions…has been a persistent and nagging problem for gradualistic accounts of evolution<\/em>”<\/p>\n<p>(Evolution Now P.140)<\/p>\n<p><u><\/u>Darwinists claim they have found the missing link between land mammals and whales but they admit none could have been an ancestor of the other, it is impossible in principle to show that any two fossils are genealogically related.<\/p>\n<p>In 1998 and 1999 the Us national academy of sciences published two booklets defending darwins theory of evolution. According to the 1998 booklet fossils provide the first of several &#8216;<em>compelling<\/em>&#8216; lines of evidence that &#8216;<em>demonstrate beyond any reasonable doubt<\/em>&#8216; that all living things are modified decendants of a common ancestor’<\/p>\n<p>The 1999 booklet claims that the theory has been ‘thoroughly tested and confirmed’ by several categories of evidence. First of all the fossil record which provides consistent evidence of systematic change through time, and decent with modification. Most biology texts books take the same deceptive line.<\/p>\n<p>Darwinism is the theory of gradualism from common descent: the slow process whereby complex life forms emerge from simpler ones that have accumulated modifications through the mechanisms of variation and natural selection. This should be recorded in fossil history.<\/p>\n<p>Fossils certainly prove that the earth was once populated by creatures that are no longer with us. The fossil record also provides evidence that the history of life has passed through several stages, only the most recent of which includes us.<\/p>\n<p><strong><u>Darwins ‘Tree of Life’<\/u><\/strong><\/p>\n<p>Imagine having a chronoscope that would enable you to peer back in time to the origin of the first animal. Perhaps a primitive sponge. The sponge makes more sponges like itself and if darwins theory is true, after thousands of generations this sponge population splits into two different kinds of sponges which are called separate species. After millions more generations and the origin of a few more species some species become so different from each other that we split them into two genera (plural of genus) after countless more generations the differences are so great within those genera that we divide them into two families. As differences continue to accumulate, we eventually group the splitting of those families into two of more ‘orders’ and various orders into two or more ‘classes’ despite all the generations and the differences however we might still have only sponges. Then another major type of animal emerges perhaps jellyfish. This animal would be so radically different from the others that we wouldn’t just class it as another sponge. Rather it is an entirely new category, a phylum (plural of phyla).<\/p>\n<p>This pattern of gradual divergence from a common ancestor with major differences occurring only after a long accumulation of minor differences, is how Darwin envisioned evolution.<\/p>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"alignnone size-full wp-image-1876\" src=\"https:\/\/ahspdotnet.files.wordpress.com\/2017\/03\/darwins-tree-of-life-2.jpg\" alt=\"darwins-tree-of-life-2\" width=\"560\" height=\"863\" srcset=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/darwins-tree-of-life-2.jpg 560w, https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/darwins-tree-of-life-2-195x300.jpg 195w\" sizes=\"(max-width: 560px) 100vw, 560px\" \/><\/p>\n<p>These transitional links present here would create a branching pattern Darwin called the great tree of life he demonstrated this with a sketch in the origin of species. It the bottom of the tree graph were the primitive sponge from which all other animals decended, then most of the branches above it would be sponges, the major differences, the phyla would appear only at the top after a long history of branching due to the accumulation of minor differences.<\/p>\n<p>Biologists recognise several dozen animal phyla based upon major differences in body plans. There are over a dozen phyla of worms alone. There are even more striking differences between worms and mollusc’s, (clams and octopuses), Echinoderms (starfish and sea urchins), arthropods (lobsters and insects) and vertebrates (fish, amphibians, reptiles, birds and mammals)<\/p>\n<p>If Darwin&#8217;s theory were true then these major differences should only make their appearance at the top of his great tree of life…but the fossil records shows exactly the opposite, they appear in the lower levels of the Cambrian discovery !<\/p>\n<p>Each of the divisions of the biological world (kingdoms, phyla, classes, orders), it was noted, conformed to a basic structural plan, with very few intermediate types. Where were the links between these discontinuous groups? The absence of transitional intermediates was troubling even to Darwin&#8217;s loyal supporter T. H. Huxley, who warned Darwin repeatedly in private that a theory consistent with the evidence would have to allow for some big jumps (since there is no evidence for the incremental gradual changes).<\/p>\n<p>Darwin posed the question himself, asking why, if species have descended from other species by insensibly fine gradations, do we not everywhere see innumerable transitional forms?<\/p>\n<p>Why is not all nature in confusion instead of the species being, as we see them, well defined?<\/p>\n<p>He answered with a theory of extinction which was the logical counterpart of &#8220;the survival of the fittest.<\/p>\n<p>In 1978, Gareth Nelson of the American Museum of Natural History wrote: “The idea that one can go to the fossil record and expect to empirically recover an ancestor-descendant sequence, be it of species, genera, families, or whatever, has been, and continues to be, a pernicious illusion.”<\/p>\n<p>( “Presentation to the American Museum of Natural History (1969),” in David M. Williams &amp; Malte C. Ebach, “The reform of palaeontology and the rise of biogeography—25 years after &#8216;ontogeny, phylogeny, palaeontology and the biogenetic law&#8217; (Nelson, 1978),” Journal of Biogeography 31 (2004): 685-712)<\/p>\n<p>Therefore the issue remains the same, the claim of &#8216;evidence&#8217; is still an unestablished myth. Evolution is still a &#8216;belief&#8217;. The issue is intensified though, by &#8216;hidden&#8217; fossil discoveries, that have been intentionally concealed and we will look into that in the following part inshaa&#8217;allah.<\/p>\n<p>Wa Sallallahu &#8216;alā Nabiyinā Muhammad<\/p>\n<p>@abuhakeembilal<\/p>\n<p>www.ah-sp.com<\/p>\n<p><a href=\"http:\/\/ah-sp.com\/2017\/03\/08\/the-myth-of-darwinian-evolution-part-4-hidden-archeology\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Part 4 &#8211; Hidden Archeology<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This part argues that the fossil record contradicts Darwinian Evolution by lacking transitional fossils and instead showing sudden appearances of complex life forms. It criticizes the incompleteness of the fossil record and the subjectivity of fossil interpretation.<\/p>\n","protected":false},"author":1,"featured_media":9121,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,5,6,12,13,23],"tags":[],"class_list":["post-1824","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-children","category-dawah","category-manhaj","category-miscellaneous","category-youth-related"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/Examining-the-Fossil-Record.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1824","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1824"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1824\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9121"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1824"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1824"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1824"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}