{"id":1924,"date":"2017-03-08T19:18:10","date_gmt":"2017-03-08T19:18:10","guid":{"rendered":"http:\/\/ah-sp.com\/?p=1924"},"modified":"2024-07-09T00:25:16","modified_gmt":"2024-07-09T00:25:16","slug":"the-myth-of-darwinian-evolution-part-4-hidden-archaeology-and-suppressed-evidence","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-myth-of-darwinian-evolution-part-4-hidden-archaeology-and-suppressed-evidence\/","title":{"rendered":"The Myth of Darwinian Evolution (Part 4): Hidden Archaeology and Suppressed Evidence"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1924?action=genpdf&amp;id=1924\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salātu Was Salāmu &#8216;alā Rasoolillahi<\/p>\n<p>Ammā Ba&#8217;d:<\/p>\n<p>I mentioned in a previous part of this series, that one of the well known, consistent features of any human fossil evidence that has been claimed to be evidence of the evolution of man, is that they have either been forgeries or animal bones (usually apes or pigs) conjectured to be human (The Piltdown Man and The Nebraska Man being two examples).<\/p>\n<p>There is another issue related to human archeological findings and that is the well-known concealment of findings that oppose the theory of evolution.<\/p>\n<p>In each of these cases, the fossils have been found to date back to a period evolutionist claim mankind was still &#8216;evolving&#8217; and thus these discoveries have created major problems for evolutionists.<\/p>\n<p>Any scientist that &#8216;shames the devil&#8217; and decides to argue in favour of what these discoveries indicate, will very quickly find himself (or herself) witch-hunted and find their careers ending and reputations demolished.<\/p>\n<p>Evolutionists claim, mankind as we know them (Homo sapiens) have existed for no more than approximately 200,000 years (some argue 100,000). Prior to this period we were &#8216;evolving&#8217;. This evolution took place, they claim, over a period of approximately 2 million years! It occurred initially in Africa and developing man began to spread in neighbouring regions.<\/p>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"size-full wp-image-1961 alignleft\" src=\"https:\/\/ahspdotnet.files.wordpress.com\/2017\/03\/human_evolution_chart-en-svg.png\" alt=\"Human_evolution_chart-en.svg\" width=\"325\" height=\"358\" srcset=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/human_evolution_chart-en-svg.png 325w, https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/human_evolution_chart-en-svg-272x300.png 272w\" sizes=\"(max-width: 325px) 100vw, 325px\" \/><\/p>\n<p><u>A word on Carbon Dating<\/u><\/p>\n<p>An issue to be noted concerning scientific dating is the presence of wild inaccuracies found in samples dated using carbon dating:<\/p>\n<p>The following are a few examples of wild dating inaccuracies:<\/p>\n<ul>\n<li>Shells from <em>living<\/em> snails were carbon dated as being 27,000 years old. (Science vol. 224, 1984, pp. 58-61)<\/li>\n<li>Living mollusc shells were dated up to 2,300 years old. (Science vol. 141, 1963, pp. 634-637)<\/li>\n<li>A freshly killed seal was carbon dated as having died 1,300 years ago. (Antarctic Journal vol. 6, Sept-Oct. 1971, p. 211)<\/li>\n<li>“One part of the Vollosovitch mammoth carbon dated at 29,500 years and another part at 44,000.” (Troy L. Pewe, “Quaternary Stratigraphic Nomenclature in Unglaciated Central Alaska,” Geologic Survey Professional Paper 862 (U.S. Gov. Printing Office, 1975) p. 30)<\/li>\n<li>Material from layers where dinosaurs are found carbon dated at 34,000 years old. (Reginald Daly, Earth’s Most Challenging Mysteries, 1972, p. 280)<\/li>\n<\/ul>\n<p>Thus if inaccuracies are present to the extreme extent, that a living snails shell has been dated at 27,000 years, then imagine the possible inaccuracies present in the estimation of the time man has been present on earth!.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Examples of such findings<\/strong><\/span><\/p>\n<p>In June of 2016 The new York times announced that: ‘Scientists have found the fossilized remains of a petite hominin (a small predecessor to modern man) due to the height of the fossil (just 3 ½  foot tall) that lived 700,000 years ago.’ (even though they were discovered over ten years earlier)<\/p>\n<p>Doubts that the remains constitute a new species were soon voiced by the Indonesian anthropologist Teuku Jacob, who suggested that the skull of the fossil (referred to as LB1) was a microcephalic modern human (<b>Microcephaly<\/b> is a medical condition in which the brain does not develop properly resulting in a smaller than normal head. Microcephaly may be present at birth or it may develop in the first few years of life ).<\/p>\n<p>Thus Teuku Jacob a reputable anthropologist from the region of the discovery, rejected the claim that it was a Hominin and argued that it was a fully formed Human. He did so after taking the sample from Soejono&#8217;s institution, Jakarta&#8217;s National Research Centre of Archaeology, for his own research. Of course, doctor Jacob was thereafter chastised and referred to as &#8216;irresponsible&#8217;. Subsequently, access to the cave where the discovery was found was made forbidden and excavations were no longer possible until fairly recently.<\/p>\n<p>The discovery was barely mentioned in the media, possible due to the fact that the period the fossil is dated to, is a time wherein humans were supposed to still be evolving. It would therefore constitute a clear refutation of the theory that man evolved from ape.<\/p>\n<p>Yet it is hardly mentioned!<\/p>\n<p>It is not the only case. There has been a number of discoveries similar to it that are covered up due to the fact that the fossils are dated to a period wherin humans are not yet (according to evolutionists) supposed to be humans.<\/p>\n<ul>\n<li>A particularly striking example In this category Is a shell displaying a crude yet recognizably human face carved on its outer surface. Reported by geologist H. Stopes to the British Association for the Advancement of Science in 1881, this shell, from the Pliocene ( a stage in the Neogene Period in geologic time) Red Crag formation in England, is over 2 million years old. According to standard views, humans capable of this level of artistry did not arrive in Europe until about 30,000 or 40,000 years ago. Furthermore, they supposedly did not arise in their African homeland until about 100,000 years ago.<\/li>\n<li><img decoding=\"async\" class=\"alignnone size-full wp-image-2053\" src=\"https:\/\/ahspdotnet.files.wordpress.com\/2017\/03\/neogene-period-scale.jpg\" alt=\"Neogene Period scale\" width=\"360\" height=\"460\" srcset=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/neogene-period-scale.jpg 360w, https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/neogene-period-scale-235x300.jpg 235w\" sizes=\"(max-width: 360px) 100vw, 360px\" \/><\/li>\n<li>In the late nineteenth century. Benjamin Harrison, an amateur archeologist, found eoliths (The most rudimentary stone tools, the eoliths are also known as &#8220;Dawn stones&#8221;) on the Kent Plateau In southeastern England. Geological evidence suggests that the eoliths were manufactured in the Middle or Late Pliocene, about 2 &#8211; 4 million ago. Among the supporters of Harrison&#8217;s eoliths were Alfred Russell Wallace. Co-founder with Darwin of the theory of evolution by natural selection; Sir John Prestwich, one of England&#8217;s most eminent geologists: and Ray E. Lankester, a director of the British Museum (Natural History).<\/li>\n<\/ul>\n<ul>\n<li>In the 1950s, Louis Leakey found stone tools over 200,000 years old at Calico in southern California. According to standard views, humans did not enter the subarctic regions of the New World until about 12,000 years ago. Mainstream scientists responded to the Calico discoveries with predictable claims that the objects found there were natural products or that they were not really 200,000 years old. But there is sufficient reason to conclude that the Calico finds are genuinely old human artifacts. Although most of the Calico implements are crude, some, including a beaked graver, are more advanced.<\/li>\n<\/ul>\n<ul>\n<li>Fiorentino Ameghino, a respected Argentine paleontologist, found stone tools, signs of fire, broken mammal bones, and a human vertebra in a Pliocene formation at Monte Hermoso, Argentina. Ameghino made numerous similar discoveries in Argentina, attracting the attention of scientists around the world. Despite Ameghino&#8217;s unique theories about a South American origin for the hominids, his actual discoveries are still worth considering. In 1912, Ales Hrdlicka, of the Smithsonian Institution, published a lengthy, but not very reasonable, attack on Ameghino&#8217;s work. Hrdlicka asserted that all of Ameghino&#8217; s finds were from recent Indian settlements. In response, Carlos Ameghino, brother of Florentino Ameghino, carried out new Investigations at Miramar, on the Argentine coast south of Buenos Aires. There he found a series of stone implements, including bolas, and signs of fire. A commission of geologists confirmed the implements&#8217; position in the Chapadmalalan formation, which modern geologists say is 3-5 million years old. Carlos Ameghino also found at Miramar a stone arrowhead firmly embedded In the femur of a Pliocene species of <em>Toxodon,<\/em> an extinct South American mammal.<\/li>\n<\/ul>\n<ul>\n<li>In the 1960s, anthropologists uncovered advanced stone tools at Hueyatlaco, Mexico. Geologist Virginia Steen-Mclntyre and other members of a U.S. Geological Survey team obtained an age of about 250,000 years for the site&#8217;s implement-bearing layers. This challenged not only standard views of New World anthropology but also the whole standard picture of human origins. Humans capable of making the kind of tools found at Hueyatlaco are not thought to have come into existence until around 100,000 years ago in Africa.<\/li>\n<li>In 1880. J D. Whitney, the state geologist of California, published a lengthy review of advanced stone tools found In California gold mines. The Implements including spear points and stone mortars and pestles, were found deep in mine shafts, underneath thick, undisturbed layers of lava, In formations that geologists now say are from 9 million to over 55 million years old. W. H. Holmes of the Smithsonian Institution, one of the most vocal nineteenth-century critics of the California finds, wrote; &#8220;Perhaps if Professor Whitney had fully appreciated the story of human evolution as it is understood today, he would have hesitated to announce the conclusions formulated [that humans existed in very ancient times in North Ametica], notwithstanding the imposing array of testimony with which he was confronted. In other words, if the facts do not agree with the favored theory, then such facts, even an imposing array of them, must be discarded.<\/li>\n<\/ul>\n<ul>\n<li>In relation to old skeletal remains of the anatomically modern human type, perhaps the most interesting case is that of Castenedolo, Italy, where in the 1880s, G. Ragazzoni, a geologist, found fossil bones of several <em>Homo sapiens sapiens<\/em> individuals in layers of Pliocene sediment 3 to 4 million years old. Critics typically respond that the bones must have been placed into these Pliocene layers fairly recently by human burial. But Ragazzoni was alert to this possibility and carefully inspected the overlying layers. He found them undisturbed, with absolutely no sign of burial.<\/li>\n<\/ul>\n<ul>\n<li>With the discovery of Java man, now classified as Homo erectus, the long-awaited missing link turned up in the Middle Pleistocene. As the Java man find won acceptance among evolutionists, the body of evidence for a human presence in more ancient times gradually slid into disrepute. This evidence was not conclusively invalidated. Instead, at a certain point, scientists stopped talking and writing about it. It was incompatible with the idea that ape-like Java man was a genuine human ancestor. As an example of how the Java man discovery was used to suppress evidence for a human presence in the Pliocene and earlier, the following statement made by W. H. Holmes about the California finds reported by J D. Whitney is instructive. After asserting that Whitney&#8217;s evidence &#8220;stands absolutely alone, &#8221; Holmes complained that it implies a human race older by at least one-half than Pithecanthropus erectus, which may be regarded as an incipient form of human creature only. &#8221; Therefore, despite the good quality of Whitney&#8217; s evidence, it had to be dismissed. Interestingly enough, modern researchers have reinterpreted the original Java Homo erectus fossils. The famous bones reported by Dubois were a skullcap and femur (thigh bone). Although the two bones were found over 45 feet apart, In a deposit filled with bones of many other species. Dubois said they belonged to the same individual. But in 1973, M. H. Day and T. r. Molleson determined that the femur found by Dubois is different from other Homo erectus femurs and is in fact indistinguishable from anatomically modern human femurs (i.e. it was that of a modern human thigh). This caused Day and Molleson to propose that the femur was not connected with the Java man skull. As far as we can see, this means that we now have an anatomically modern human femur and a Homo erectus skull in a Middle Pleistocene stratum that is considered to be 800,000 years old. This provides further evidence that anatomically modern humans coexisted with more ape-like creatures in unexpectedly remote times.<\/li>\n<\/ul>\n<p>(See &#8216;Forbidden Archeology &#8211; The Hidden History of the Human Race of Michael A. Cremo: P22-29)<\/p>\n<p>The last example indicates, that normal modern man existed alongside the apes whose bones have been used to claim we evolved. But of course, these examples must be dismissed, otherwise, the theory will be harmed.<\/p>\n<p>Concerning this Michael A. Cremo wrote in his book <em>Forbidden Archeology<\/em> P25:<\/p>\n<p>&#8220;This supports the primary point we are trying to make in <em>Forbidden Archeology<\/em>, namely, that there exists in the scientific community a knowledge filter that screens out unwelcome evidence. This process of knowledge filtration has been going on for well over a century and continues right up to the present day.&#8221;<\/p>\n<p>These are a few examples of well-known cover-ups in the archeological community.<\/p>\n<p>The point to be made here is, while we do not agree with the given dates, we see there is an on-going pattern of rejection of anything that would disturb the &#8216;equilibrium&#8217; of the theory, even when it come from their own scientific community!<\/p>\n<p>We see then an on-going pattern of fraud and knowledge filtration, in an attempt to have the world accept Darwinism as the only viable, acceptable explanation for our existence.<\/p>\n<p>Wa Sallallahu &#8216;alā Nabiyinā Muhammad<\/p>\n<p>@abuhakeembilal<\/p>\n<p>www.ah-sp.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article argues against Darwinian Evolution by citing archaeological finds allegedly hidden due to contradicting the theory. It criticizes the dating methods and explores findings of human-like tools and remains from periods exceeding established human existence.<\/p>\n","protected":false},"author":1,"featured_media":9122,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,5,6,8,13,23],"tags":[],"class_list":["post-1924","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-children","category-dawah","category-family-related","category-miscellaneous","category-youth-related"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/03\/Hidden-Archaeology-and-Suppressed-Evidence.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1924","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=1924"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/1924\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9122"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=1924"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=1924"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=1924"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}