{"id":2116,"date":"2021-07-14T21:54:22","date_gmt":"2021-07-14T21:54:22","guid":{"rendered":"http:\/\/ah-sp.com\/?p=2116"},"modified":"2024-07-09T00:25:19","modified_gmt":"2024-07-09T00:25:19","slug":"the-myth-of-darwinian-evolution-part-5-the-miller-urey-experiment-and-the-primordial-soup","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-myth-of-darwinian-evolution-part-5-the-miller-urey-experiment-and-the-primordial-soup\/","title":{"rendered":"The Myth of Darwinian Evolution (Part 5): The Miller-Urey Experiment and the Primordial Soup"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2116?action=genpdf&amp;id=2116\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Another argument used by evolutionists, to justify Darwinism, is that of a theory developed in the 1920&#8217;s that was followed in the 1950&#8217;s by an experiment that would make history among evolutionists known as the Operin\/Holdane Hypothesis<\/p>\n<p><strong>The Operin\/Haldane hypothesis<\/strong><\/p>\n<div class=\"paragraph\">\n<div class=\"paragraph\">In the 1920s, Russian scientist <em>Aleksandr Oparin<\/em> and English scientist <em>J. B. S. Haldane<\/em> both separately proposed what is now called the <strong>Oparin-Haldane hypothesis<\/strong>: that life on Earth could have arisen step-by-step from non-living matter through a process of “gradual chemical evolution.”<\/div>\n<div class=\"paragraph\"><\/div>\n<\/div>\n<div class=\"paragraph\">\n<div class=\"paragraph\">Oparin and Haldane thought that the early Earth had a <em>reducing<\/em> atmosphere, (meaning an oxygen-poor atmosphere in which molecules tend to donate electrons.) Under these conditions, they suggested that:<\/div>\n<\/div>\n<div class=\"paragraph\">\n<ul>\n<li>\n<div class=\"paragraph\">Simple inorganic molecules could have reacted (with energy from lightning or the sun) to form building blocks like amino acids and nucleotides, which could have accumulated in the oceans, making a &#8220;primordial soup.&#8221;<\/div>\n<\/li>\n<li>\n<div class=\"paragraph\">The building blocks could have combined in further reactions, they claim, forming larger, more complex molecules (polymers) like proteins and nucleic acids, perhaps in pools at the water&#8217;s edge.<\/div>\n<\/li>\n<li>\n<div class=\"paragraph\">The polymers &#8216;could have&#8217; assembled into units or structures that were capable of sustaining and replicating themselves. Oparin thought these might have been “colonies” of proteins clustered together to carry out metabolism, while Haldane suggested that macromolecules became enclosed in membranes to make cell-like structures.<\/div>\n<\/li>\n<\/ul>\n<p>This was the theory.  (It will become clearer as we go along)<\/p>\n<\/div>\n<div class=\"paragraph\"><\/div>\n<div class=\"paragraph\">Based upon the <strong>Oparin-Haldane hypothesis,  in the 1950&#8217;s, a<\/strong>n American scientist, Stanley Miller, conducted an experiment that would go down in scientific history with evolutionists:<\/div>\n<div class=\"paragraph\"><\/div>\n<p><span style=\"text-decoration: underline;\"><b>The Miller-Urey Experiment.<\/b><\/span>  In the 1950&#8217;s, Stanley Miller, an American graduate student and his Phd advisor Harold Urey, produced what he believed to be some of the chemical building blocks of life, by sending an electric spark through a mixture of gasses they thought simulated earth&#8217;s primitive atmosphere. The 1953 Miller\/Urey experiment, generated enormous excitement in the scientific community and soon found its way into every science textbook as &#8216;evidence&#8217; that scientists had demonstrated the first step in the &#8216;origin of life&#8217;. It is still featured in textbooks, magazines, and documentaries as &#8216;proof of evolution&#8217;<\/p>\n<p>Though, for more than a decade, most geochemists have been convinced that the experiment failed to simulate conditions on earth and thus has little to do with the origin of life at all.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>The Experiment<\/strong><\/span><\/p>\n<p>Miller&#8217;s professor, Harold Urey, had been lecturing about how the earth could have had a different atmosphere, and that perhaps life formed because of that atmosphere. Miller investigated the idea in the laboratory. A diagram of his apparatus is shown below. He generated water flow around a glass loop by heating it until vapors were given off and then, ultimately, cooling it. To the water vapor he added ammonia, methane, and hydrogen, and electrically sparked this gaseous mixture (Oxygen had to be excluded from the experiment, so as to mimic what they thought earth&#8217;s early atmosphere was comprised of, otherwise it would have exploded!). One product of the resulting reaction was a yellowish mixture that coated the glass.<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/ka-perseus-images.s3.amazonaws.com\/4b9718213893e89409963552af13bdeccc17966e.png\" alt=\"\" \/><\/p>\n<p>When he removed a sample from the water at the bottom of the loop and examined it, Miller found another product: amino acids. Amino acids are found in our bodies, and are the building blocks for other more complex organic materials. Some interpreted this experiment as supporting Oparin&#8217;s idea of the chemical emergence of life. It appeared that Miller had shown the first step in Oparin&#8217;s &#8217;emergence&#8217; theory, which went from chemicals to simple organics. Now in one sense, that&#8217;s not so earthshaking because, beginning in 1828 with Friedrich Wohler, chemists had been synthesizing organic compounds from inorganics. In this sense, all Miller did was to synthesize an organic compound &#8211; there was nothing sensational about that. However, what is unique is the claim made for this experiment, that it supports Oparin&#8217;s theory.<\/p>\n<p>That was back in 1953. A lot has happened since then in the science world, and it hasn&#8217;t been good for the naturalistic origins story.<\/p>\n<p>Scientists as early as 1960 began to doubt that the elements in the test tube were the actual elements on the earth at the time of the origin of life. Even if the elements were correct, all it did was create a small number out of the many amino acids required for life. That is still light years away from creating a protein. Hundreds of various proteins are required in order for even a single cell to exist! Surely, with the developments in science, we should by now have been able to move the experiment past the stage Miller took it to? Also if we bear in mind Miller used a man made laboratory and man made settings, wouldn&#8217;t this then be a stronger argument for creation and intelligent design rather than evolution?<\/p>\n<p><strong>Weaknesses of the Miller Experiment<\/strong><\/p>\n<p>Initially, the Miller experiment gained acceptance because of the strengths mentioned above. As research continued, however, weaknesses arose.<\/p>\n<ul>\n<li><span style=\"text-decoration: underline;\"><strong>Firstly<\/strong><\/span>, no one could come up with a good naturalistic explanation for the &#8216;tap&#8217; where Miller removed the amino acids from the loop, what would it represent in the real world. If someone does not tap off the amino acids they flow back around the loop to the spark, which then destroys them. Miller could not leave the amino acids in the loop; the rate of destruction in the spark is greater than the rate of formation, and the organics would never accumulate. He had to remove them; but what is the analog in nature for this?<\/li>\n<li><span style=\"text-decoration: underline;\"><strong>Secondly<\/strong><\/span>, bigger weakness is the assumption that the early atmosphere consisted of hydrogen, methane, ammonia, and water. There&#8217;s no proof of that. As a matter of fact, what evidence that does exist (oxidized rocks, for example) indicates that the early earth had an oxygen atmosphere. This fact is bad news for the naturalistic scenario because if there is oxygen in Miller&#8217;s loop, the experiment does not work at all. Oxygen stops it cold. Even though we need oxygen to live today, oxygen in the past (according to scientists) would have prevented the formation of amino acids. Also, atmospheric oxygen today forms the protective ozone layer. If there was no oxygen in the early earth&#8217;s atmosphere, then there would have been no ozone layer, scientists agree, and ultraviolet rays would have poured in, destroying any life that did exist.<\/li>\n<li><span style=\"text-decoration: underline;\"><strong>Thirdly,<\/strong><\/span> Another weakness of the Miller experiment is that hydrogen is the lightest molecule and therefore has a high diffusion capability. According to scientists (who believe in the existence of gravity), the earth&#8217;s gravitational field is not strong enough to hold hydrogen and it would have diffused easily out of our atmosphere. So it (Hydrogen) would not have been around (according to them) to help form amino acids.  Additionally, ammonia and methane in the atmosphere would not have lasted. In a few thousand years they would have been destroyed by chemical reaction caused by sunlight. So they would not have been around to form the hypothesized organic &#8216;soup&#8217; either. Sunlight in the hypothesized Miller-type atmosphere is like a bull in a china shop &#8211; there is a lot of energy there, but most of it is destructive.<\/li>\n<li><span style=\"text-decoration: underline;\"><strong>Fourthly,<\/strong><\/span> If there were an organic soup, then the next weakness would be the extremely low probability of the formation of DNA (deoxyribonucleic acid) and other large, complex molecules from the soup.  In more than 60 years, further experiments have not shown that amino acids naturally form anything more complex.<\/li>\n<li><span style=\"text-decoration: underline;\"><strong>Fifthly, <\/strong><\/span>Associated with this formation of complex molecules is the information content in our DNA. Another major problem for neo-Darwinists who believe in the concept of evolution through genetic mutation, is, where did the genetic codes come from that generate us? Also, this genetic code operates only in the presence of ribosomes, activating enzymes, transfer RNA (ribonucleic acid), etc. How all this happened naturalistically is a major unsolved problem.<\/li>\n<li><span style=\"text-decoration: underline;\"><strong>Sixthly,<\/strong><\/span> One of the greatest weaknesses of the Miller experiment (and other naturalistic explanations) is that it does not explain the fact that only L-amino acid is found in our bodies. Most amino acids can appear in two different forms, &#8220;L&#8221; and &#8220;D.&#8221; There is a left-handed form of an amino acid, &#8220;L&#8221;, and a right-handed one, &#8220;D.&#8221; One form rotates polarized light left, the other rotates it right. They are mirror images of each other. If you look in the mirror and raise your right hand, the image in the mirror raises its left hand. It is you in the mirror, but there is a difference &#8211; there is a &#8220;handedness&#8221; to our mirror images. It is the same thing with these amino acids. Of the twenty commonly occurring amino acids, nineteen have this mirror image capability: They are called optical isomers. The exception is glycine &#8211; it&#8217;s symmetrical no matter which way you look at it, mirror image or straight on.<\/li>\n<\/ul>\n<p>As mentioned, our bodies don&#8217;t have the D-amino acids. This is true for all living beings. The only exception is the exoskeleton of insects, which have &#8220;D&#8221; in them. Otherwise, all living things have &#8220;L.&#8221; The claim for the Miller experiment and similar naturalistic ideas is that they offer an analogy of how life could have occurred. But the Miller experiment gives D- and L-amino acids in roughly a 50-50 ratio. As a matter of fact, anyway that we synthesize amino acids gives a 50-50 ratio. If we went into a lab and started mixing chemicals together, we would get a 50-50 mixture. The analogy breaks down.<\/p>\n<p>Amino acids have been found in some meteorites. A good question to ask would be about the L- and D-amino acids in these meteorites. What&#8217;s the ratio of the L to D in them, as far as amino acids are concerned? The answer is roughly 50-50.<sup>(1)<\/sup><\/p>\n<p>No one has come up with a good explanation of why we have only the &#8220;L&#8221; form in us when naturally occurring amino acids have roughly equal amounts of left-handed and right-handed amino acids. <span style=\"text-decoration: underline;\">A possible one is that polarized light in the Orion nebula could have created L-amino acids. (See <\/span><span style=\"text-decoration: underline;\"><em>Science<\/em><\/span><span style=\"text-decoration: underline;\">, 31 July 1998.) <\/span><span style=\"text-decoration: underline;\"><sup>(2)<\/sup><\/span><span style=\"text-decoration: underline;\"> One problem with this scenario is that huge amounts would have to be made for the earth to get enough. Another is exactly how this light makes &#8220;L&#8221;-amino acids only. Of course this extraterrestrial explanation undercuts the Miller experiment and any other terrestrial hypotheses.<\/span><span style=\"text-decoration: underline;\"><sup>(3)<\/sup><\/span><\/p>\n<ul>\n<li><span style=\"text-decoration: underline;\"><strong>Sevently,<\/strong><\/span> The last and most formidable weakness of the Miller experiment is Miller himself. He designed the experiment, hoping to produce amino acids, but the first run did not generate any. It was back to the drawing board. He changed certain experimental parameters and the second run did provide the desired results. Now, a supposed strength of the experiment is that it is supposed to be a possible naturalistic explanation of the origin of life. The methane, ammonia, water, and hydrogen in the Miller experiment, even though of an artificially high purity, is said to be the earth&#8217;s early atmosphere. The electric spark is said to be analogous to lightning, and the liquid water, the oceans. If so, then what is the analogy for Miller, the designer and modifier of the experiment? The answer is an intelligence &#8211; a designer, a creator, is needed for life to occur. If one thought the earlier inferences from the Miller experiment was scientific, then one has to concede that this inference of a powerful intelligent &#8216;creating&#8217; being is also &#8216;scientific&#8217;.<\/li>\n<\/ul>\n<p>The basic idea behind the chemical origin of life is that simple molecules became more complex molecules which eventually allowed the first auto-catalytic self-reproducing molecule to exist. Many would define the chemical origin of life as the existence of a single molecule that was not only able to replicate on its own, but <span style=\"text-decoration: underline;\">could produce any molecules necessary to facilitate that replication<\/span>. According to Stanley Miller, the chain of events looked something like this:<sup>14<\/sup><\/p>\n<p><img fetchpriority=\"high\" decoding=\"async\" src=\"http:\/\/www.ideacenter.org\/stuff\/contentmgr\/files\/e27b080d92450837e43d44bf73780847\/misc\/image2.gif\" alt=\"misc\" width=\"485\" height=\"134\" border=\"0\" \/><\/p>\n<p>The touted sequence of events leading from a &#8220;random&#8221; explosion of matter and energy to DNA-based life. Please note, emboldened terms will be discussed in the text.<\/p>\n<p>Most origin of life researchers would generally agree with such a diagram, although some add &#8220;extraterrestrial input&#8221; in varying amounts somewhere along the line. For example, Stanley Miller believes extraterrestrial input (i.e. comets, asteroids, and random dust particles) contributed about 5% of the pre-biotic organic molecules on earth.<sup>( Statements made by Stanley Miller at a talk given by him for a UCSD Origins of Life seminar class on January 19, 1999)<\/sup><\/p>\n<p><b>Step 1: Pre-Biotic Synthesis and the &#8220;primordial soup&#8221;<br \/>\n<\/b>In order to bake a cake, you first need all the ingredients. Pre-biotic synthesis is the means by which sufficient quantities of all the ingredients thought to be necessary for life&#8217;s natural origin were formed. Many have called this collection of chemicals the &#8220;primordial soup&#8221;. We will ask 2 questions regarding this &#8220;soup:&#8221;<\/p>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>Could the soup have even been produced?<\/li>\n<li>Is there any geological evidence that the soup existed?<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p><b><i>1. Could the soup have ever been produced?<br \/>\n<\/i><\/b><span style=\"text-decoration: underline;\">As noted, in the 1950’s, Stanley Miller appeared to have found a way to make some of the ingredients of the primordial soup by &#8220;zapping&#8221; a mixture of H<\/span><span style=\"text-decoration: underline;\"><sub>2 (Hydrogen)<\/sub><\/span><span style=\"text-decoration: underline;\">, HCN (Hydrogen cyanide), H<\/span><span style=\"text-decoration: underline;\"><sub>2<\/sub><\/span><span style=\"text-decoration: underline;\">O (Water), CH<\/span><span style=\"text-decoration: underline;\"><sub>4  (Methane)<\/sub><\/span><span style=\"text-decoration: underline;\">, CHO (Carbohydrate), and NH<\/span><span style=\"text-decoration: underline;\"><sub>3 (Ammonia) <\/sub><\/span><span style=\"text-decoration: underline;\">gasses with an electric spark. The first time Miller got nothing but brown tar but after more experiments, he obtained (albeit often in very small amounts) at least 19 of the 20 amino acids upon which life is built. Furthermore, it has been found that comets and carbonaceous asteroids, which are thought to have been constantly bombarding the earth early in its history, can contain appreciable amounts of organic molecules. All this looks promising at first when trying to build up an ancient storehouse of pre-biotic organic chemicals.<\/span><\/p>\n<p><span style=\"text-decoration: underline;\">However,<\/span> the cake-baking analogy from above analogy now holds quite true! Just as a baker <em>adds<\/em> the proper ingredients to bake a cake, so the researchers <em>designed<\/em> their pre-biotic synthesis experiments in such a way as to get the sought-after organic molecules. Methane (CH<sub>4<\/sub>) and ammonia (NH<sub>3<\/sub>), were chosen not because they were actually thought to be a part of the early atmosphere but rather because they are essential to the production of the proper amino acids and gave the desired results. As noted, Stanley Miller admits that he <em>assumed<\/em> that the atmosphere had methane and ammonia—he did not test that hypothesis. In other words, they created the atmosphere they knew was necessary to obtain the results they were seeking! they had no concrete evidence for that particular combination of gases. They just wanted to see if they could produce the right molecules using various contrived mixtures of gasses. Given the simple molecules they were trying to synthesize, these experiments are little more than simple exercises in organic chemistry and literally say nothing about the chemical origin of life. Though at the time, Miller’s experiment was promoted as supporting the hypothesis that life arose out of a primordial soup, subsequent research has enumerated problems with the hypothesis:<\/p>\n<p>1. As previously noted, Miller’s experiment requires a &#8216;reducing&#8217; methane and ammonia atmosphere, however geochemical evidence says the atmosphere was hydrogen, water, and carbon dioxide (non-reducing).<sup>15, 16<\/sup> The only amino acid produced in a such an atmosphere is glycine (and only when the hydrogen content is unreasonably high), which could not form the necessary building blocks of life.<sup>11<\/sup><\/p>\n<p>2. These &#8220;pre-biotic chemicals&#8221; are formed only in very small amounts and degrade quickly into a tar-like substance.<sup>17, 18<\/sup> Not only would UV radiation destroy any molecules that were made, but their own short lifespans would also greatly limit their numbers. For example, at 100ºC (boiling point of water), the half lives of the nucleic acids Adenine and Guanine are 1 year, uracil is 12 years, and cytozine is 19 days<sup>20<\/sup> (nucleic acids and other important proteins such as chlorophyll and hemoglobin have never been synthesized in origin-of-life type experiments<sup>19<\/sup>). Such short-lived molecules could never be stockpiled, even if they could be produced naturally. Even though even at that low-temperature, Ribose, a sugar which helps build DNA, has a short half-life of 44 years,<sup>14<\/sup> and cytozine a relatively short half-life of 17,000 years.<sup>20<\/sup> Either way the rate of degradation is too high to accumulate enough pre-biotic organics to form a soup. But models for earth&#8217;s formation indicate the earth was hot, meaning degradation would occur even faster! If it were that the earth had been cold, this would also work against the origin-of-life theory by slowing the chemical reactions that supposedly allowed life to form, increasing the time needed for the origin-of-life.<\/p>\n<p>3. Catch-22 situation: We know ozone in the upper atmosphere protects life from harmful UV radiation. However, ozone is composed of oxygen which is the very gas that Stanley Miller-type experiments avoided, for it prevents the synthesis of organic molecules like the ones obtained from the experiments! Pre-biotic synthesis is in a &#8220;damned if you do, damned if you don&#8217;t&#8221; scenario. The chemistry does not work if there is oxygen because the atmosphere would be non-reducing, but if there is no UV-light-blocking oxygen (i.e. ozone &#8211; O<sub>3<\/sub>) in the atmosphere, the amino acids would be quickly destroyed by extremely high amounts of UV light (which would have been 100 times stronger than today on the early earth).<sup>20, 21, 22 <\/sup>This radiation could destroy methane within a few tens of years,<sup>23<\/sup> and atmospheric ammonia within 30,000 years.<sup>15<\/sup><\/p>\n<p>4. At best the processes would likely create a dilute &#8220;thin soup,&#8221;<sup>24 <\/sup>destroyed by meteorite impacts every 10 million years.<sup>20, 25 <\/sup>This severely limits the time available to create pre-biotic chemicals and allow for the OOL.<\/p>\n<p><b><i>2. Is there any geochemical evidence that the soup ever existed?<\/i><\/b><br \/>\nThere is no geological evidence left in the rocks that a primordial soup ever existed. If there was ever a soup, the earliest Precambrian rocks should contain high levels of non-biological carbon, for biologically produced carbon contains an excess of &#8220;isotopically light&#8221; carbon. Ancient sedimentary rocks, however, do not reveal this signature,<sup>29<\/sup> and thus there is no positive evidence for this soup. If these processes produced a soup, they should have left a significant (1-10 meter thick) layer of tar encircling the earth, but there is no geochemical evidence of such a layer<sup>30<\/sup> nor any published geochemical evidence of a primordial soup.<sup>31<i> <\/i><\/sup>Had there been a soup, then the rocks thought to be from that time period ought to contain an &#8220;unusually large proportion of carbon or organic chemicals&#8221; which they do not.<sup>15<\/sup><\/p>\n<p>So drastic is the evidence against pre-biotic synthesis, that in 1990 the Space Studies Board of the National Research Council recommended to scientists a &#8220;reexamination of biological monomer synthesis under primitive Earthlike environments, as revealed in current models of the early Earth.&#8221;<sup>23<\/sup><\/p>\n<p>Many speculate that given a primordial soup, the chemical origin of life does not seem so improbable. However, it would appear that the existence of the primordial soup itself may have been greatly improbable. For a second, let&#8217;s reason like the scientists do: The primordial soup &#8216;seems&#8217; necessary for life&#8217;s natural origin, life evolved naturally, therefore the primordial soup must have existed! <span style=\"text-decoration: underline;\">But<\/span>, the opposite is also true. If the primordial soup is necessary for life&#8217;s &#8216;natural&#8217; origin, but the soup<span style=\"text-decoration: underline;\"><em> didn&#8217;t<\/em><\/span> exist (and we have no concrete evidence that  it did), then life didn&#8217;t arise &#8216;naturally&#8217; (i.e. through a process of evolution). Assuming, for a second, that the primordial soup did come to exist, we are now ready to analyze the second major step in the chemical origin of life: could the molecules in the soup have come together to make larger, more complex molecules.<\/p>\n<p><b>Step 2: Polymerization<br \/>\n<\/b>Polymerization is the process by which &#8220;monomers&#8221; (simple organic molecules) form covalent bonds with one another to produce &#8220;polymers&#8221; (complex organic molecules). Monomers are thought to be the constituents of the pre-biotic soup (amino acids, sugars, lipids, simple carbohydrates, nucleic acids), but polymers are chains&#8211;often very long chains&#8211;of monomers (peptides, phospholipids, RNA, DNA?). This step is basically the method by which you get bigger molecules from the smallest molecules.<\/p>\n<p>To help, here&#8217;s a little analogy which might give some understanding of the types of structures we&#8217;re dealing with here: If we imagine a living organism as a book, Monomers are like the letters, polymers are the words, biochemical pathways are the sentences, cells are the paragraphs, biological systems are the chapters, and the organism is the whole book! The only difference? Polymers are like words which are thousands of letters long.<\/p>\n<p>During polymerization, two monomers combine, forming a polymer and a water molecule:<\/p>\n<p><img decoding=\"async\" src=\"http:\/\/www.ideacenter.org\/stuff\/contentmgr\/files\/e27b080d92450837e43d44bf73780847\/misc\/polymerization.gif\" alt=\"Polymerization Reaction\" width=\"272\" height=\"32\" border=\"0\" \/><\/p>\n<p>If the origin of life took place in the pre-biotic soup, then it took place in an aqueous (i.e. water-based) solution of pre-biotic monomers. According to Le Chateliers Principle, one of the basic laws of chemistry, the presence of a product (in this case, water) will slow the reaction. If one tries to polymerize monomers into polymers in an aqueous solution (one where water is the solvent), it is not possible to obtain any appreciable amount. The bottom line, the polymerization step in the chemical origin of life could never take place in water—this step is impossible in the primordial soup.<\/p>\n<p>&#8220;Polymerization&#8221; thus requires &#8220;dehydration synthesis.&#8221; Many have proposed alternatives to get around this stumbling block. Since polymerization reactions also require an input of energy, heating and drying has been theorized to input energy, and remove the water. However, this heating and drying has to take place in such a way as to not wipeout the created polymers. Some theorized locations for this reaction have been intertidal pools or volcanic ridges where repeated cycles of heating and drying can take place. The problem is that all the water must be removed, but you don’t want to over-cook the polymers you are creating. Organic molecules tend to break down rapidly (i.e. cook) in the presence of heat. This would have to be <span style=\"text-decoration: underline;\">a very fine balancing act<\/span> that would also requires rapid input of organic material to overcome the rate at which the heat would destroy the molecules. A successful scenario is very difficult to imagine. Even under ideal laboratory conditions using pure monomers and carefully measured heating and drying cycles, only small amounts of polymers have been created.<\/p>\n<table border=\"1\" width=\"716\" rules=\"ALL\" cellspacing=\"0\" cellpadding=\"5\">\n<tbody>\n<tr>\n<td colspan=\"2\" valign=\"TOP\"><b>Quick Summary of Problems with Various Locations for the Origin of Life<\/b><\/td>\n<\/tr>\n<tr>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><b>1. Deep sea thermal vents<\/b><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"83%\">This would be under water and could not allow for polymerization through dehydration synthesis. Furthermore, organic compounds would quickly decompose if exposed to the high heat of deep sea thermal vents.<\/td>\n<\/tr>\n<tr>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><b>2. Tide pools (or somewhere in the intertidal zone)<\/b><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"83%\">Organic material would still exposed to water, inhibiting polymerization (dehydration-synthesis). Experiments which have mimicked optimal heating and drying conditions near tide pools have only created small to modest amounts of polymers.<\/td>\n<\/tr>\n<tr>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><b>3. Anywhere in the ocean<\/b><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"83%\">Water prevents polymerization because polymerization cannot take place in the presence of water. According to Le Chateliers principle, chemical reactions do not take place in the presence of large quantities of the product. Plus, the ocean would dilute the chemicals necessary for life.<\/td>\n<\/tr>\n<tr>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><b>4. Volcanic Ridges<\/b><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"83%\">This scenario encounters the same problems as the tide-pools—it must dry out the ‘soup’ through volcanic heat to allow polymerization. But even if dry monomers could exist in high concentrations under perfect temperature conditions (as occurs only in experiments), experiments suggests the resulting polymers are still too small to allow for the next steps in the origin of life. One reason that the primordial soup was hypothesized is because in such an aqueous environment, there would be a high rate of random chemical interaction. In other words, molecules would always be bumping into new neighbors, increasing the odds that many chemical reactions could take place. Even if the necessary polymers could be produced, here they are outside of water and there will not be a high rate of random chemical interactions to further form complex molecules. However, since the polymerization step can&#8217;t take place in water, the number of random chemical interactions would be almost infinitely reduced. Instead of trying to make life in a liquid environment, you&#8217;re now trying to make it in a more solid goo, which is much less congenial to random chemical interactions. How could life originate if the proper molecules have such a small chance of even finding each other? Furthermore, volcanic ridges also face the same problems as deep sea thermal vents as they are very hot and would destroy organic molecules.<\/td>\n<\/tr>\n<tr>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><b>5. Clay surfaces<\/b><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"83%\">This theory was first proposed about 1400 B.C. by Moses in the book of Genesis. Moses proposed that God created man out of dust, or clay. The theory has also enjoyed a new twist in the 20th century as A. Graham Cairns-Smith, hypothesized that clay crystals could have acted as a template which could allow for the continued creation and replication of organic material. Hypothetically this scenario could create a wide variety of organic molecules, however it lacks any experimental evidence. As there are no experiments, there are no results to judge and no practical problems encountered.<\/td>\n<\/tr>\n<tr>\n<td align=\"LEFT\" valign=\"TOP\" width=\"17%\"><b>6. Extra-terrestrial Origin<\/b><\/td>\n<td align=\"LEFT\" valign=\"TOP\" width=\"83%\">See our <a href=\"http:\/\/www.ideacenter.org\/contentmgr\/showdetails.php\/id\/849\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Problems with Panspermia or Extraterrestrial Origin of Life Scenarios page<\/a> page.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Step 3: Pre-RNA World: Getting A Sufficient Self-Replicating Molecule<\/p>\n<p>Though the OOL appears to be dead in the water, because of the lack of evidence for a &#8220;primordial soup&#8221; and the problems facing polymerization, let’s assume that those hurdles could be overcome. What would happen next? Many researchers have hypothesized that once polymers somehow formed, some of them came together to form the first self-replicating molecules. Somewhere within this step&#8211;the Pre-RNA world&#8211;the true origin-of-life occurred. However, nothing even close to a complete scenario by which polymers can naturally form a self-replicating molecule has ever been put forth. Chemists can artificially synthesize some self-replicating molecules in the lab, but they are not synthesized under conditions resembling the early Earth. Essentially, this is an appeal to a miracle.<\/p>\n<p>Stanley Miller once said, &#8220;making compounds and making life are two different things.&#8221;<sup>14<\/sup> This is quite true, for life, by definition, must have the ability to self-replicate&#8211;a process requiring many enzymes and genetic biochemical molecules. According to Joyce (2002), molecules like RNA or DNA are too complex to have arisen out the soup (assuming it existed) so there must have been some other more simple precursor to RNA or DNA.<\/p>\n<p>A few self-replicating molecules have been created in the lab (i.e. in thoughtful and carefully-designed experiments). None have yet yielded candidates which could be stable replicators in an early earthlike environment that have the capacity to evolve into a more complex form. But is this anything more than rife speculation fueled by naturalistic thought? Consider these words by Arthur Shapiro:<\/p>\n<p><i>&#8220;Another evolutionary principle is therefore needed to take us across the gap from mixtures of simple natural chemicals to the first effective replicator. This principle has not yet been described in detail or demonstrated, but it is anticipated, and given names such as chemical evolution and self-organization of matter. The existence of the principle is taken for granted in the philosophy of dialectical materialism, as applied to the origin of life by Alexander Oparin.&#8221;<\/i><sup>37<\/sup>One commentator noted that these self replicating molecules contain vastly less information compared to what is necessary for even the most primitive cell:<\/p>\n<p><i>&#8220;This system carries very little information, in contrast to even the simplest cell. Mycoplasma gentalium has the smallest known genome of any living organism, which contains 482 genes comprising 580,000 bases. This organism is an obligate parasite. A free-living organism would need many more genes.&#8221;<\/i><sup>19<\/sup>Life (at least today through the molecule DNA) contains huge amounts of information. As previously noted, the Darwinian mechanism requires replication, or reproduction. Prior to the origin of replication, life could only rely upon the basic laws of chemistry. But how could the basic laws of chemistry and physics create the information present in life? The origin of this information that is key to understanding the origin of life. As B. O. Küppers wrote, &#8220;the problem of the origin of life is clearly basically equivalent to the problem of the origin of biological information.&#8221;<sup>50<\/sup> Yet, there are no known chemical laws that determine the order of the nucleotide bases in DNA (or any other self-replicating molecule). Küppers notes, &#8220;the properties of nucleic acids indicate that all the combinatorially possible nucleotide patterns are, from a chemical point of view, equivalent.&#8221;<sup>48<\/sup> Hubert Yockey writes that the sequence of the DNA is not affected by any physical or chemical law:<\/p>\n<p><i>Informational macromolecules can code genetic messages and therefore can carry information because the sequence of bases or residues is affected very little, if at all, by [self-organizing] physico-chemical factors.<\/i><sup>49<\/sup>The first self-replicating molecule is not said to be DNA. But it is said to have been similar to DNA in that it carried the information needed for life. If there are no known chemical or physical laws which can create this complex and specified information needed for a self-replicating molecule, then this stage of the origin of life faces severe hurdles.<\/p>\n<p><b>Step 4: RNA World<br \/>\n<\/b>Some time after the first &#8220;self-replicating&#8221; molecule formed, according to the story, RNA came along. Today, RNA is a genetic molecule in all cells, similar to DNA, but more versatile within the cell. The &#8220;RNA World&#8221; is essentially a hypothetical stage of life between the first replicating molecule and the highly complicated DNA-protein-based life. The chief problem facing an RNA world is that RNA cannot perform all of the functions of DNA adequately to allow for replication and transcription of proteins. OOL theorist Leslie Orgel notes that an &#8220;RNA World&#8221; could only form the basis for life, &#8220;if prebiotic RNA had two properties not evident today: a capacity to replicate without the help of proteins and an ability to catalyze every step of protein synthesis.&#8221;<sup>41<\/sup> The RNA world is thus a hypothetical system behind which there is little positive evidence, and much materialist philosophy:<\/p>\n<p><i>&#8220;The precise events giving rise to the RNA world remain unclear … investigators have proposed many hypotheses, but evidence in favor of each of them is fragmentary at best. The full details of how the RNA world, and life, emerged may not be revealed in the near future.&#8221;<\/i><sup>41<\/sup>The best claimed evidence of an &#8220;RNA World&#8221; includes the fact that there are RNA enzymes and genomes, and that cells use RNA to convert the DNA code into proteins.<sup>42<\/sup> However, RNA plays only a supporting role in the cell, and there is no known biochemical system completely composed of RNA.<sup>42<\/sup><\/p>\n<p>RNA experts have created a variety of RNA molecules which can perform biochemical functions through what is commonly termed &#8220;test tube evolution.&#8221; However, &#8220;test tube evolution&#8221; is just a description for what is in reality nothing more than chemical engineering in the laboratory employing Darwinian principles; that does not imply that there is some known pathway through which these molecules could arise naturally.<\/p>\n<p>The most interesting RNA molecule synthesized is perhaps an RNA &#8220;polymerase&#8221; which can replicate 14 base pairs of RNA.<sup>42<\/sup> Yet, the polymerase itself is 200 pairs long.<sup>42<\/sup> As Gerald Joyce noted, OOL theorists are thus 14 \/ 200 towards achieving a possible model molecule for the RNA World.<sup> $2<\/sup> However, Joyce also noted that the replication accuracy of this molecule is too poor to allow for it to persist as a functional form of life.<sup>42<\/sup><\/p>\n<p>These purely speculative scenarios aren&#8217;t bad on their own merits, but they are just another reminder of the philosophical presupposition driving this research in the first place: naturalism. Only when scientists assume there must be a natural explanation do they turn to completely unfalsifiable unverifiable and incomplete speculatory hypotheses.<\/p>\n<p>The theory then says that some unknown precursor of RNA turned into RNA through an unknown process. This &#8220;RNA-world hypothesis&#8221; states that life then arose from a population of self-replicating RNA molecules. RNA is a sister molecule to DNA, used when DNA breaks up to create proteins or replicate. Like a copy from the library, RNA has a complementary code to DNA and goes out to do the dirty work. A few types of RNA have been known to have auto-catalytic self-replicating abilities, however this scenario inevitably encounters a chicken and egg problem18.<\/p>\n<p>But these molecules must be encapsulated within a &#8220;cell wall structure&#8221; or a small protective enclosure from the outside world. But, the protective cell requires replicating genetic machinery to be created. Thus, we now have a &#8220;chicken and egg scenario&#8221;&#8211;which came first? the self-replicating machinery (which needs a cell to operate), or the cell itself, which protects (and is created by) the cellular machinery? The answer is neither came first for both are required for self-replication. How could self-replicating RNA arise naturally when it essentially is an irreducibly complex system that cannot functionally replicate without other distinct components.<\/p>\n<p><b>Step 5: DNA\/Protein World.<br \/>\n<\/b>Scientists sometimes bluff that they have the OOL understood. For example, the National Academy of Sciences writes:<\/p>\n<p><i>&#8220;[T]he question is no longer whether life could have originated by chemical processes… The question has become which of many pathways might have been followed to produce the first cell.&#8221;<\/i><sup>6<\/sup>A more accurate statement would be to admit that there is currently no known chemical pathway for many steps in the OOL including how an &#8220;RNA world&#8221; could transform into a &#8220;DNA\/protein world.&#8221; Somewhere along the line, RNA is then said to have turned into DNA, which is main genetic molecule in all life today. How did this happen? The answer is that nobody has a clue. Problems with such a scenario are put well by biologists John Maynard Smith and Eors Szathmary:<\/p>\n<p>&#8220;<i>The origin of the [DNA] code is perhaps the most perplexing problem in evolutionary biology. The existing translational machinery is at the same time so complex, so universal) and so essential that it is hard to see how it could have come into existences or how life could have existed without it. The discovery of ribozymes has made it easier to imagine an answer to the second of these questions, but the transformation of an &#8216;RNA world&#8217; into one in which catalysis is performed by proteins, and nucleic acids specialize in the transmission of information [a DNA world], remains a formidable problem.<\/i>&#8220;<sup>44<\/sup><br \/>\nFurthermore, this transition presents an example of the infamous &#8220;chicken and egg problem&#8221;:<sup>43<\/sup><\/p>\n<p>Which came first? DNA needs enzymes to replicate, but the enzymes are encoded by DNA. DNA needs protection of the cell wall, but the cell wall is also encoded by the DNA. The answer is that neither came first for all are required in DNA-based life. These fundamental components form an irreducibly complex system in which all components must have been present from the start. Biologist Frank Salisbury described the problem as one which essentially requires the extreme difficulty of overcoming the hurdle of building an irreducibly complexity:<\/p>\n<p>&#8220;<i>It&#8217;s nice to talk about replicating DNA molecules arising in a soupy sea, but in modern cells this replication requires the presence of suitable enzymes. Furthermore, DNA by itself accomplishes nothing. Its only reason for existence is the information that it carries and that is used in the production of a protein enzyme. At the moment, the link between DNA and the enzyme is a highly complex one, involving RNA and an enzyme for its synthesis on a DNA template; ribosomes; enyzmes to activate the amino acids; and transfer-RNA molecules. … How, in the absence of the final enzyme, could selection act upon DNA and all the mechanisms for replicating it? It&#8217;s as though everything must happen at once: the entire system must come into being as one unit, or it is worthless. There may well be ways out of this dilemma, but I don&#8217;t see them at the moment.<\/i>&#8220;<sup>51<\/sup><\/p>\n<table border=\"1\" rules=\"NONE\" cellspacing=\"0\" cellpadding=\"3\" align=\"CENTER\">\n<tbody>\n<tr>\n<td align=\"LEFT\"><img decoding=\"async\" src=\"http:\/\/www.ideacenter.org\/stuff\/contentmgr\/files\/e27b080d92450837e43d44bf73780847\/misc\/image7.gif\" alt=\"misc\" width=\"583\" height=\"253\" align=\"right\" border=\"0\" \/><br \/>\n<b>The Irreducible Complexity of the Transcription-Translation Process:<\/b>The transcription &#8211; translation process is the means by which the information in the DNA code creates protein&#8211;the molecules which do things in the cell. In part a, DNA in the cell nucleus is “transcribed” into mRNA, which is then transported out of the nucleus to the ribosome. In part b, free-floating pieces of DNA, called tRNA, bind to the mRNA at the ribosome. All tRNA have amino acids attached to them. When the tRNA binds to the mRNA, the amino acids are linked into a protein. Part c is an expansion of the area in the red box of part b. Each tRNA has a “codon” and each type of codon always carries a particular amino acid. A “codon” is a small piece of DNA with 3 nucleotide bases. In DNA, there are 4 types of nucleotide bases. An “A” (Adenine) only bonds with a “T” (Thymine) and a “C” (Cytozine) matches only with a “G” (Guanine). Thus, the codon on the tRNA can only match specific codons on the mRNA. This forms the basis of the language in the DNA, allowing the amino acids to be strung together in the sequence specified by the DNA.Another level of complexity in this process is how the tRNA get assigned to the right amino acids. For the DNA language to be translated properly, each tRNA codon must be attached to the correct amino acid. If this crucial step in DNA replication is not functional, then the language of DNA breaks down. Special enzymes called aminoacyl &#8211; tRNA synthetases (aaRSs) ensure that the proper amino acid is attached to a tRNA with the correct codon through a chemical reaction called &#8220;aminoacylation.&#8221;<sup>52<\/sup> Accurate translation requires not only that each tRNA be assigned the correct amino acid, but also that it not be aminoacylated by any of the aaRS molecules for the other 19 amino acids. Amazingly, these aaRSs themselves are coded for by the DNA: this forms the essence of an irreducibly-complex chicken-egg problem. The enzymes themselves help perform the very task which constructs them! This is an irreducibly &#8220;all or nothing system&#8221; whose evolution seems impossible!<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>The origin of this system presents a challenge to the step-by-step evolution required by Darwin’s theory, or any other theory of the origin of life:<\/p>\n<p><b>Step 6: Making Proto-cells<br \/>\n<\/b>Leaving the &#8220;chicken-egg&#8221; problem aside for a moment, how would we get the first cell-walls for these early replicating sets of molecules? According to one major biology textbook:<\/p>\n<p>&#8220;<i>One of the earliest episodes in the evolution of life may have been the formation of a membrane that could enclose a solution of different composition from the surrounding solution, while still permitting the selective uptake of nutrients and elimination of waste products. This ability of the cell to discriminate in its chemical exchanges with the environment is fundamental to life, and it is the plasma membrane that makes this selectivity possible.<\/i>&#8220;<sup>46<\/sup>A proto-cell would need the protective cell wall to keep out harmful substances in the environment. But such a cell wall must also be able to let in useful and beneficial substances. Some OOL researchers have created very small &#8220;soap-bubble&#8221; like structures which they call &#8220;protenoid microspheres.&#8221; These &#8220;protenoid microspheres&#8221; however would not make adequate cell walls for early self-replicating molecules: there is no known mechanism by which the molecules would find their way into the &#8220;protenoid microspheres&#8221; and once inside, there would be no mechanism for metabolic growth. More importantly, these &#8220;protenoid microspheres&#8221; would not be &#8220;alive&#8221; or biologically connected to the molecules—and they would lack the ability to &#8220;discriminate&#8221; between nutrients and waste products:<\/p>\n<table border=\"1\" rules=\"NONE\" cellspacing=\"0\" cellpadding=\"3\" align=\"CENTER\">\n<tbody>\n<tr>\n<td align=\"LEFT\"><img loading=\"lazy\" decoding=\"async\" src=\"http:\/\/www.ideacenter.org\/stuff\/contentmgr\/files\/e27b080d92450837e43d44bf73780847\/misc\/glycoprotein.jpg\" alt=\"Cell Membrane showing Glycoproteins\" width=\"571\" height=\"301\" border=\"1\" \/>Cells today have complex and specified “glycoproteins” which can recognize and “discriminate” between harmful and beneficial substances. This is part of what gives a modern cell wall the special ability to act as a living filter for the interior of the cell. But a protenoid microsphere would just be like a little “soap-bubble” like entity without any “fundamental” properties needed to discriminate between inviting beneficial molecules into the cell, and excluding harmful substances from the cell. Picture from Reference 53.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><b>What about intelligent design?<br \/>\n<\/b>In 1988, Klaus Dose said the following about the state of OOL research:<\/p>\n<p>&#8220;<i>More than 30 years of experimentation on the origin of life in the fields of chemical and molecular evolution have led to a better perception of the immensity of the problem of the origin of life on Earth rather than to its solution. At present all discussions on principal theories and experiments in the field either end in stalemate or in a confession of ignorance. New lines of thinking and experimentation must be tried.<\/i>&#8220;<sup>47<\/sup><\/p>\n<p>If naturalistic theories are not bearing fruit for science, perhaps we feel justified looking outside the reigning paradigm for an answer to the origin of life. Intelligent design theory begins with the observation that intelligent agents tend to produce large amounts of information when they create objects. If life is designed, one might expect that life will contain large amounts of information. This is exactly what is found in the cell. Consider this statement by famous Oxford evolutionary biologist, Richard Dawkins:<\/p>\n<p>&#8220;<i>Physics books may be complicated, but…the objects and phenomena that a physics book describes are simpler than a single cell in the body of its author. And the author consists of trillions of those cells, many of them different from each other, organized with intricate architecture and precision-engineering into a working machine capable of writing a book.…Each nucleus…contains a digitally coded database larger, in information content, than all 30 volumes of the Encylopaedia Brittanica put together.<\/i>&#8220;<sup>45<\/sup>The simplest known single-celled life forms contain over 400 genes,<sup>31<\/sup> and are much more complex than any hypothetical pre-RNA world. To merely exist, life requires an incredible amount of complexity, which is perhaps why Dawkins also wrote:<\/p>\n<p>&#8220;<i>Biology is the study of complicated things that give the appearance of having been designed for a purpose.<\/i>&#8220;<sup>45<\/sup>After seeing difficulties faced by the origin of life, perhaps this is why over 20 years ago, the noted scientist who discovered the structure of DNA, Francis Crick, said:<\/p>\n<p>&#8220;<i>The origin of life appears to be almost a miracle, so many are the conditions which would have had to be satisfied to get it going.<\/i>&#8220;<b>:<\/b><\/p>\n<p><span style=\"text-decoration: underline;\"><b>Haeckel&#8217;s Embryos.<\/b><\/span> This is a reference to pictures of similarities in early embryos showing that amphibians, reptiles, birds, and human beings are all descended from a fish like creature. This has been a known fake for 100 years and yet we can’t get rid of it. In the picture above is Haeckel&#8217;s fakes on the first line and the actual embryo on the middle line<\/p>\n<p><span style=\"text-decoration: underline;\"><b>Homology in Vertebrate Limbs.<\/b><\/span> Similar bone structures in a bat&#8217;s wing, a porpoise&#8217;s flipper, a horse&#8217;s leg and a human hand that indicate their evolutionary origin in a common ancestor. The combinations of bones of various animals seem to be similar and used similarly, this supposedly proves they all descended from a common ancestor. This is obviously a logical fallacy and doesn’t prove anything about ancestry. Cars looks similar but they don’t reproduce, they are created by intelligence. Bats and whales have the same ability of echolocation, but do they come from the same ancestors? No one thinks that.<\/p>\n<p><span style=\"text-decoration: underline;\"><b>Archaeopteryx-The Missing Link. <\/b><\/span>Archaeopteryx (pronounced Ar-ke-op-ter-ix, sometimes referred to as Urvogel (meaning original bird). A fossil bird with teeth in its jaws and claws on its wings, the missing link (it is claimed) between ancient reptiles and modern birds fossil was first discovered in 1861 and was touted as the missing link between reptiles and birds, thus proving evolution. There should be millions of missing links but people were satisfied enough to believe in evolution once they could point to this one fossil. Actually a total of 8 of them were found, parts of them anyway, and they were even called “holy relics” and “unimpeachable evidence” by evolutionists. Most paleontologists today, however, do not believe it is the ancestor of any modern birds. There went the missing link<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Darwin’s Finches<\/strong><\/span><span style=\"text-decoration: underline;\">:<\/span> This is a reference to 13 species of finch, Darwin found on the Galapagos islands that diverge from one, it is said this is what inspired Darwin to formulate his ‘theory of evolution’ his journey to the Galapagos Islands, Charles Darwin observed that the beak size of finches increased after a drought. Darwin theorised that the drought reduced the number of small seeds in comparison to those of the large variety, such that only those finches with larger, stronger beaks were sufficiently equipped to eat larger seeds and survive. In a follow-up on Darwin&#8217;s study, a Princeton research team estimated that if a drought occurred once every ten years, a new species of finch would evolve in only 200 years.<\/p>\n<p>What the research team failed to note was that the beak size of Darwin&#8217;s finches returned to normal within a few years after the drought, resulting in no directional change of the species. Yet, even had a directional change occurred, it would not have demonstrated how a finch could one day become a falcon, any more than it would show how a primordial recipe of chemicals could become a finch.<\/p>\n<p>That is not to suggest that genetic alterations have not occurred due to environmental stresses. Indeed they have. Radiation experimentation on the much-studied fruit fly is a case in point. Nevertheless, after countless fruit fly generations, nothing other than malformed flies have ever been produced.<\/p>\n<p>The differences Darwin observed in the Galapagos finches is an example of &#8220;micro-evolution&#8221;: The in-built process of genetic variation and inheritance that enables species to adapt, within pre-defined limitations, to changing environmental pressures. Micro-evolution explains why dogs, for example, come in all sizes, shapes, colors, and abilities, yet are forever distinguishable from other life forms by their unique gene pool.<\/p>\n<p>Even with thousands of years of <em>intelligent <\/em>intervention (dog breeding), dogs have always remained dogs, with improvements in their stock more than offset by increased susceptibility to disease and shortened longevity which has tended to make them, from a Darwinian viewpoint, less, not more, &#8220;fit.&#8221; The long history of animal breeding strongly suggests a terminal point of evolutionary progress, bounded by in-built genetic limitations<\/p>\n<p><b>Darwin&#8217;s Finches.<\/b> The beaks of finches got bigger in dry seasons when food was less plentiful. This supposedly showed evolution, but it doesn’t because when the rains return, the beaks return to a smaller size. Even if there were permanent change, they are still finches. That’s not evolution<\/p>\n<p><span style=\"text-decoration: underline;\"><b>Four-Winged Fruit Flies.<\/b><\/span> Fruit flies with an extra pair of wings showing that genetic mutations can provide the raw materials for evolution. Scientists in a laboratory bred fruit flies so two small appendages grew into the size of extra wings. You can’t prove evolution by applying intelligent breeding. Fruit flies in the wild never develop extra wings. Even for the ones in the lab, the wings were useless and would have been selected out by natural selection as a disadvantage<\/p>\n<p><span style=\"text-decoration: underline;\"><b>From Ape to Human: The Ultimate Icon.<\/b><\/span> this is a reference to drawings of ape like animals evolving into humans, showing that our existence is merely a by-product of purposeless natural causes. This drawing\/icon is especially caught up in the minds of people for several generations. There is no scientific evidence behind this drawing at all. My Proof #1 Male and Female [4] is all about the impossibility of this drawing because it does not show women evolving simultaneously. My Proof #64 on Missing Links [5] goes into the fact that there is no fossil evidence for anything between the chimpanzee and the man.<\/p>\n<p>If the Theory of Evolution rests on these icons for its evidence, it should have been in the dust bin of history already 50 years ago. They are just pictures and drawings. There is no science here.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article challenges the Miller-Urey Experiment, a supposed foundation for the theory of life arising from a primordial soup. It argues that the experiment&#8217;s conditions were unrealistic and highlights the unlikelihood of amino acids forming naturally.<\/p>\n","protected":false},"author":1,"featured_media":9125,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-2116","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2021\/07\/Miller-Urey-Experiment.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2116","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=2116"}],"version-history":[{"count":1,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2116\/revisions"}],"predecessor-version":[{"id":10367,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2116\/revisions\/10367"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9125"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=2116"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=2116"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=2116"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}