{"id":2555,"date":"2017-08-19T14:05:53","date_gmt":"2017-08-19T14:05:53","guid":{"rendered":"http:\/\/ah-sp.com\/?p=2555"},"modified":"2024-07-04T01:44:03","modified_gmt":"2024-07-04T01:44:03","slug":"responding-to-doubts-against-dawah-salafiyyah-part-1","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/responding-to-doubts-against-dawah-salafiyyah-part-1\/","title":{"rendered":"Responding to Doubts against Da&#8217;wah Salafiyyah (Part 1)"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2555?action=genpdf&amp;id=2555\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salātu Was Salāmu ‘alā Rasoolillahi<\/p>\n<p>Ammā Ba’d:<\/p>\n<p>Indeed from the blessing of Allah upon the people of Sunnah and Hadīth in every age, is that their methodology is based upon principles extrapolated from the book, and the Sunnah and the consensus of the Sahabah.<\/p>\n<p>They (Ahlus Sunnah) know, that opposing this consensus constitutes opposition of the methodology (known in Arabic as منهج  &#8211; Manhaj) of this ummah. Evidence in any issue with them, returns back to that which is indicated by these sources, and opposition of the methodology revolves around opposition of this.<\/p>\n<p>Many seem to consider the book and the sunnah as the <i><b>only<\/b><\/i> evidence in our Deen and neglect the evidence of the concensus of the Salaf and their principles? Is this not what makes us Salafi?<\/p>\n<p>Our duty then, is to learn what they (the Salaf) were upon and cling to it. And to know that the principles of our methodology stem from this.<\/p>\n<p>This is Salafiyah.<\/p>\n<p>He who opposes these well known foundations and learns of his own error, must correct it, or Ahlus Sunnah will correct it for him (if the mistake was private, correction is done in private, if it was public (i.e. a public lecture or article) then his correction must likewise be public), in accordance with giving sincere advice to the Muslims in general.<\/p>\n<p>One of the problems we have in this time, is the distance many have from these foundations, either they ignore them after knowing them, or they are ignorant of their application, or they are ignorant of them in totality.<\/p>\n<p>Our Shaikh Rabee&#8217; Ibn Hādi Al Madkhali used to say often, that the problem with many people is that they are detached from the books of the Salaf. If they were connected, they would be clear about the positions of the Salaf they claim to ascribe to and follow.<\/p>\n<p>What I intend with this simple series is to highlight some of these principles of the salaf and the manner in which some of those who have weak implimentation of these principles (known as the Mumayyi’ah) oppose these principles, or create principles of their own, and attempt to attribute them to the methodology. But certainly, from the blessings of Allah upon this Ummah, is that Allah establishes for this ummah individuals who defend these principles and detect when they are being opposed, regardless of how cunningly the proponents of this deviation defend and spread their misguidance.<\/p>\n<p>This methodology is inherited from those who possess it (i.e. the people of knowledge), it is not based upon guesswork or conjecture, nor acting upon what we deem to be &#8216;obvious&#8217;. Neither should it be presumed that everyone referred to as an ‘Ālim’ must, by necessity be knowledgeable concerning it. Such that if one ‘took from the scholars’ they too must be knowledgeable and aware of it.<\/p>\n<p>This was an affair well-known.<\/p>\n<p><u>Ibn Wahb (d.197H)<\/u> &#8211; رحمه الله &#8211; mentioned:<\/p>\n<p>“<strong><em>I met three<\/em><\/strong><strong><em> hundred and sixty scholars, but had it not bee<\/em><\/strong><strong><em>n for M<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>lik Ibn Anas and Al Laith Ibnus Sa’d, I would have gone astray in relation to the affair of knowledge<\/em><\/strong>” (Dhamul Kalām P876)<\/p>\n<p><u>Abu Thowr (d.240H)<\/u> &#8211; رحمه الله &#8211; mentioned:<\/p>\n<p>“<strong><em>Ish<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>q Ibn R<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>huy, Hussain Al Kar<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>b<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>si and I, did not leave our innovation until we met (Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m) Ash Sh<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>fi’i<\/em><\/strong>” (Al Hilyah 9\/103)<\/p>\n<p><u>Im<\/u><u>ā<\/u><u>m Al Humaidi (Abdullah Ibn Az Zubair (d. 219H))<\/u> &#8211; رحمه الله &#8211; mentions:<\/p>\n<p>“<strong><em>We used to wish to refute the people of philosophical rhetoric, but we were not proficient at doing so, until (Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m) Ash-Shafi’i came to us, and thus he opened it up to us<\/em><\/strong>.” (Manāqib Ash-Shāfi’i P42)<\/p>\n<p>Even though <strong><em>Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m Ash-Shafi’i <\/em><\/strong>said about him: &#8220;<em><strong>I havent seen an individual suffering from phlegm, greater in memory than Al Humaidi<\/strong><\/em>!&#8221;<\/p>\n<p><u>Amr Ibnil Abb<\/u><u>ā<\/u><u>s Al Bāhili<\/u> (d. 235H) &#8211; رحمه الله &#8211;  said:<\/p>\n<p>“<em>Abdullah ibn Dāwood al Kharībi<\/em> said to <em>Abdur Rahmān Ibn Mahdi (d. 198H)<\/em>:<\/p>\n<p>“Are you Qadari?”<\/p>\n<p>He replied:<\/p>\n<p>“<strong><em>My teachers were Ham<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>d Ibn Zaid and Yaz<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>d Ibn Zurai’, from which of the two of them would I have taken (the bid’ah of) Qadr from!?” <\/em><\/strong>(Al Kāmil” 1\/203)<\/p>\n<p>Thus seeking knowledge does not necessitate that a person will gain correct <b><i>detailed<\/i><\/b> knowledge of the methodology of the salaf, just as being from the people of knowledge does not, by default, necessitate that this scholar is skilled in the field of the intricasies of the methodology, since being knowledgable concerning good, does not automatically necessitate detailed knowledge of evil.<\/p>\n<p>Hudhaifah &#8211; رضى الله عنه &#8211; mentioned &#8220;<b><i>the people used to ask about the good but I used to ask about evil, fearing it will befall me<\/i><\/b>..&#8221; therefore Hudhaifa would have had knowledge of evil that may not have been possessed by others.<\/p>\n<p><em>Imām Ibn Abi Hātim<\/em> mentions with his chain of narration going back to <em>Abdur rahmān Ibn Mahdi<\/em> (d. 198H) who said:<\/p>\n<p>“<strong><em>The people (scholars) are of types:<\/em><\/strong><\/p>\n<p><strong><em>From them is he who is an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in the Sunnah (i.e. knowledge of the methodology) and an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in Had<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>th (i.e. knowledge of had<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>th, its sciences, its men etc). From them is he who is an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in the Sunnah but not an Imam in had<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>th. From them is he who is an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in Had<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>th and not an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in Sunnah. As for he who is an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in the Sunnah and an Im<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>m in had<\/em><\/strong><strong><em>ī<\/em><\/strong><strong><em>th, then that is the likes of Sufy<\/em><\/strong><strong><em>ā<\/em><\/strong><strong><em>n At Thawri<\/em><\/strong>” (Jarh wat Ta’dīl 1\/118)<\/p>\n<p><em>Imām Mālik<\/em> has also been referred to elsewhere as an Imām in both fields, while Awzā’i has been refered to as an Imām in Sunnah not an Imām in hadīth.<\/p>\n<p>This narration gives us a number of benefits:<\/p>\n<ol>\n<li>The fact that the Salaf had a usage for the term ‘Sunnah’ other than the general meaning of hadīth<\/li>\n<li>The fact that not all scholars are the same in terms of knowledge of the methodology<\/li>\n<li>The fact that knowledge of hadīth DOES NOT necessitate knowledge of the methodology even if he is an Imām<\/li>\n<li>If this was the case with &#8216;Imāms&#8217; of the past, it goes without saying it is applicable to scholars of the present<\/li>\n<li>If this is the case with an ‘Imām’ of the past, then it goes without saying this will likewise apply to the student of knowledge, by necessity (i.e. strength or weakness in knowledge of the methodology of the Salaf.)<\/li>\n<li>We should not understand from this that Ar Radd alal Mukhālif (refutation of the one who opposes the principles of the religion) does not fall under the Hadeeth science of jarh wa ta&#8217;deel (disparaging and\/or praising the narrators of hadīth). The people of innovation are the first of the people who this science is applied upon.<\/li>\n<\/ol>\n<p>The doubts we will discuss in this series th<strong>e<\/strong>n, are doubts raised by those who have little true knowledge of the methodology of the Salaf. Hence they oppose the manhaj in various ways and then request ‘evidence’ that their opposition is incorrect. Opposition is opposition; the only thing that must be known, is that such and such a person actually said or wrote the statement. It is sufficient, as <i>evidence<\/i> of his error, for us to know, that he has opposed agreed upon principles of our Salaf. But he who is ignorant of them&#8230;is ignorant of them! While he who is aquainted with these principles, only has to hear of the opposition to know the individual has strayed from the path of the Salaf. Either he makes taubah and rectifys himself, or he persists upon error without change.<\/p>\n<p style=\"direction: ltr;\">These doubts are not new, but regurgitated doubts reoccurring from time to time. In our era, there are a number of individuals also attributed to knowledge, who have promoted these doubts in our communities over the years, in the guise of &#8216;principles&#8217;. At the head of them <i>Ali Hasan Al Halabi<\/i> and <i>Abul Hasan Al Maribi Al Misri<\/i> among others. To the extent, that the one who is ignorant of the realities of the <i><b>true<\/b><\/i> manhaj of the Salaf, opposes it, and vehemently despises it, believes the aforementioned principles to be <b>true<\/b> Salafiyah, and to oppose these principles of theirs, is to oppose true Salafiyah, and is &#8216;destroying our communities&#8217;, while the truth of the matter is, these <i>principles<\/i> are destroying our communities, splitting our ranks and creating small pockets of individuals who feel &#8216;disenfranchised&#8217; in fringe groups, displeased with the Salafi &#8216;state of affairs&#8217;, this is where the problem lies, not with the manhaj or the true methodology of the Salaf of this Ummah.<\/p>\n<p style=\"direction: ltr;\">When people gather around this falsehood we have division in our ranks.<\/p>\n<p>Thus we will mention, in as simple a manner as possible, these doubts, and the responses of the people of knowledge to them. At the head of those scholars, the responses of the vanguard of the manhaj in our era, our Shaikh Al &#8216;Alāmah Rabee&#8217; Ibn Hādi Al Madkhali, may Allah preserve him.<\/p>\n<p>Since in reality, their issue is actually with these scholars, they are the real target, they are the ones our real grievience is with, they are the real problem, attention must be turned away from them, the students in the west are but a intermediary annoyance. May Allah preserve us, our scholars, and the people of Sunnah in every land.<\/p>\n<p>Wa Sallallahu &#8216;alaa nabiyyinaa Muhammad<\/p>\n<p>@abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Explore the foundational principles of Salafiyah and their relevance today in this insightful series. Discover how contemporary challenges are addressed by scholars like Al &#8216;Alāmah Rabee&#8217; Ibn Hādi Al Madkhali, offering clarity on misconceptions and affirming the true essence of Salafiyah.<\/p>\n","protected":false},"author":1,"featured_media":8841,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[12],"tags":[],"class_list":["post-2555","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-manhaj"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/08\/Responding-to-Doubts-against-Dawah-Salafiyyah-Part-1.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2555","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=2555"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2555\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8841"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=2555"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=2555"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=2555"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}