{"id":2653,"date":"2017-08-22T17:27:45","date_gmt":"2017-08-22T17:27:45","guid":{"rendered":"http:\/\/ah-sp.com\/?p=2653"},"modified":"2024-07-04T01:43:58","modified_gmt":"2024-07-04T01:43:58","slug":"responding-to-doubts-against-dawah-salafiyyah-part-2","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/responding-to-doubts-against-dawah-salafiyyah-part-2\/","title":{"rendered":"Responding to Doubts against Da&#8217;wah Salafiyyah (Part 2)"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2653?action=genpdf&amp;id=2653\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p><u>Doubts around the Da’wah Part 2<\/u><\/p>\n<p>Bismillahi Wal Hamdullillah Was Salātu Was Salāmu ‘alā Rasoolillahi<\/p>\n<p>Ammā Ba’d:<\/p>\n<p>Introduction<\/p>\n<p>Ahlus Sunnah in the west face a resurfacing trial, one that isn&#8217;t new to them.<\/p>\n<p>The trial of a people who are displeased with the <em><strong>true<\/strong> <\/em>methodology of ahlil hadīth.<\/p>\n<p>A people who are upset with the fact Ahlus Sunnah are distinguished from other than them, and wish to turn Salafiyah into a melting pot that accepts everyone and excludes no one, except its true proponents.<\/p>\n<p>A people who accuse the people of Sunnah and hadīth of being harsh and extreme, due to their correct implementation of the methodology of Ahlul hadīth.<\/p>\n<p>A people who attempt to paint Ahlus Sunnah as a people who do not believe in softness, gentleness and clemency and its application, as though they are not very familiar with those texts.<\/p>\n<p>A people who call to Tamyī’ (watering the true methodology down) and attempt to make that fair seeming.<\/p>\n<p>A people who throw out a &#8216;lifeline&#8217; to those who seeks to destroy true Salafiyah with false misconstrued principles.<\/p>\n<p>A people who have no concern except to attack the people of Sunnah and hadīth, and defend their methodology, while the true people of innovation are safe from their tongues, their writings and their videos.<\/p>\n<p>A people who spread confusion and misguidance in the name of ‘justice’.<\/p>\n<p>A people who are guilty of doing with Ahlus Sunnah, what they accuse Ahlus Sunnah of.<\/p>\n<p>A people who accuse the callers to the Sunnah of being ignorant, while <strong><em>they<\/em><\/strong> are the true paupers in knowledge and are a people unknown.<\/p>\n<p>A people who bring joy to the hearts of the people of misguidance for their ignorant defence of them, when they attempt to weaken the solid framework of Ahlul hadĪth.<\/p>\n<p>Who accuse the defenders of the methodology of the companions and their successors of extremism, oppression and injustice, either by way of them using innovated principles or misusing established ones, but despite their (daily) efforts and striving, Ahlus Sunnah are not affected.<\/p>\n<p>The Prophet -صلى الله علي سلم &#8211; said (as occurs in the hadeeth of Mugheerah Ibn Shu&#8217;bah:<\/p>\n<p>“ <strong><em>There will never cease to be a group from my Ummah manifest upon the truth, not being harmed by those who oppose them, nor those who forsake them until the affair of Allah comes and they are upon that<\/em><\/strong>”<\/p>\n<p>(Bukhāri: 7311 Muslim: 156)<\/p>\n<p>Neither are their attempts new to Ahlus Sunnah, they (Ahlus Sunnah) are very familiar with them!<\/p>\n<p>He also said (as occurs in the hadeeth of Ibrāheem Ibn Abdur Rahmān Al &#8216;Udhri):<\/p>\n<p>“<strong><em>This knowledge is carried in every generation by the trustworthy ones, they repel from it the distortions of those who go beyond bounds, the fabrications of those who fabricate, and the false interpretations of the ignorant<\/em><\/strong>’”<\/p>\n<p>(Baihaqi: (10\/209 hadeeth no#: 20700)<\/p>\n<p>But as some of the Salaf used to say:<\/p>\n<p>“<strong><em>The ignoramus is his own enemy, how then will he be anyones friend?<\/em><\/strong>”<\/p>\n<p><em>Shaikhul Islām Ibn Taimiyah narrates the statement of  <u>Imām Mālik<\/u> who<\/em> said:<\/p>\n<p>“<strong><em>When knowledge is meagre, disaffection and aversion becomes manifest, and when narrations (of the Salaf) are meagre, desires become plentiful<\/em><\/strong>”<\/p>\n<p>(Al Fat<em>ā<\/em>w<em>ā<\/em> 17\/308)<\/p>\n<p><em><u>Abu bakr Al khawārizmi (d. 383H)<\/u><\/em> said:<\/p>\n<p>“<strong><em>Allah has refused to let anyone fall into a ditch except he who has dug it, for indeed the evil plot does not encompass except he who devises it<\/em><\/strong>!”<\/p>\n<p>(Yateemiyatud Dahr: 4\/226)<\/p>\n<p>Thus he who is unhappy with the methodology of the Salaf, and speaks against it, and against those who defend and implement it, does nothing but harm himself, the methodology is Allah’s methodology, for it is his deen, and the one who seeks to please the people by speaking against it, earns the anger and wrath of Allah, regardless of the good he thinks he is doing.<\/p>\n<p>The Prophet -صلى الله علي سلم &#8211; said (as occurs in the hadeeth of Aisha &#8211; رضي الله عنها )<\/p>\n<p>“<strong><em>Whoever seeks to please Allah, by way of that which displeases the people, Allah will be pleased with him and will make the people pleased with him. And whosoever seeks to please the people through the displeasure of Allah, Allah will be displeased with him, and will make the people displeased with him&#8221;<\/em><\/strong><\/p>\n<p>(Collected by Ibn Hibbān 1\/510 and declared &#8216;Sahīh&#8217; by Shaikh Albāni Sahih Targhīb 2\/547)<\/p>\n<p>Unfortunately, those who claim islāh (rectification) with their speech, do nothing but cause ifsād (corruption) through their ignorance (if we even accept they are being sincere)<\/p>\n<p>The members of the <em><span style=\"text-decoration: underline;\">F<\/span><u>atwā Committee of Saudi Arabia<\/u><\/em> mention in refutation of <em>Muraad Shukri<\/em> who fell into negligence in Takfeer and followed the path of the murji&#8217;ah:<\/p>\n<p>“<strong><em>It is upon the one whose feet are not firm upon knowledge; to refrain from entering into these affairs, <span style=\"text-decoration: underline;\">so there does not come from him harm and corruption in aqĪdah far greater than the rectification they were hoping to achieve<\/span><\/em><\/strong>&#8230;”<\/p>\n<p>(Fatāwā Al lejnatid Dā&#8217;imah: Fatwa no# 20212 &#8211; 2\/135)<\/p>\n<p>This individual (who I know personally and who came to my home in Madinah) thought he was doing well &#8216;<em>defending the balanced position<\/em>&#8216; but fell into negligence and had a group of individuals defending this &#8216;balanced&#8217; position of his, in various countries! Therefore when individuals speak ‘<em>In defense’ of the deen<\/em>, we must attempt to perceive the goal and intent. What is the goal? What will the outcome of this speech be? What do they intend by their statements ultimately?<\/p>\n<p><span style=\"text-decoration: underline;\">Imām Al Barbahāri<\/span> mentioned:<\/p>\n<p>“<strong><em>look!, May Allah show you mercy, to the speech of anyone you hear speaking in your time specifically and don’t be hasty, and don’t enter into anything from it until you ask, is it some thing the companions of the messenger used to say? Or any of the Ulamā? So if you find a narration then do not go past it for anything, and don’t choose anything over it and thus fall into the fire<\/em><\/strong>!”<\/p>\n<p>(Sharhus Sunnah p23 &#8211; Point 5)<\/p>\n<p>Pay attention to the statement of the Imām &#8220;..<strong><em>the speech of anyone you hear speaking <span style=\"text-decoration: underline;\">in your time specifically<\/span>&#8221; <\/em><\/strong>This is a clear indication that this manhaj was not restricted  to the period of the Salaf as some would have us believe, rather for every time!<\/p>\n<p><span style=\"text-decoration: underline;\">Imām Ahmad<\/span> mentions in describing the people of innovation:<\/p>\n<p><strong><em>“..They utter ambiguous statements, and they begile the ignorant people by way of the ambiguity they present to them, so we seek refuge from the fitan of the people of misguidance!”<\/em><\/strong><\/p>\n<p><strong><em>C<\/em><\/strong>oncerning this tremendous statement <em><u>Shaikhul Islām<\/u><\/em> mentions in <em>Minhājus Sunnah:<\/em><\/p>\n<p><strong><em>“The intent here is that they corrupt the textual evidences through that which they attribute to them from Qarmatah (definition will follow below) and distorting words from their places, just as they have corrupted intellectual evidences, and reversed the nature of perceived affairs from their reality, and by changing the Fitra that Allah has created things upon. Therefore they use general ambiguous speech, because that is better for purposes of delusion and misrepresentation” <\/em><\/strong><\/p>\n<p>(Minhājus Sunnah: 1\/187)<\/p>\n<p><em><span style=\"text-decoration: underline;\">Shaikh Abdur Rahmān Ibn Nāsir As S&#8217;adi<\/span><\/em> said: &#8221; <em>Al Qarmatah<\/em> (is a term used) in regard to textual evidence and safsatah (is a term used) in regard to intellectual evidence. they both come together in that they(these two terms) refer to rejection of what is not to be rejected, rejection of basic things, things known by necessity&#8230;(he goes on to mention)..Because evidence is of two types: <em>Textual<\/em> and <em>Intellectual<\/em>, thus textual evidence, if it is authentic and its indications are clear, then whosoever distorts its clear indications then (it is said) he has Qarmatah (fell into rejection of what is crystal clear) an attribution to the (deviant) Qarāmitah Bātiniyah (sect) those who explain text that are known by necessity to everyone with distortion, the like of which is recognized by the Aalim and the ignorant..&#8221;<\/p>\n<p>(Al Ajwibatun Nāfi&#8217;ah 291-294)<\/p>\n<h2><u>Doubt 1<\/u>: <u>‘We do not accept the warnings of the scholars except with proof, because <strong>‘We are people of evidence’<\/strong><\/u><\/h2>\n<p>We start with this doubt, because this claim, though it appears fair seeming, the real intent behind it is an evil one. It seeks is to destroy the status of the people of knowledge, their statements and their guidance. This doubt has been used throughout time to cunningly belittle the people of knowledge in the mind of the unsuspecting innocent layperson, and to replace the people of knowledge with these individuals, who present themselves as people skilled in the knowledge of understanding strong or weak evidences. Thus reliance falls upon them.<\/p>\n<p>By way of this statement of theirs, the statements of the people of knowledge have little worth, rather true worth is in the hands of this individual who will dictate who and what is to be taken from and who and what is to be rejected. This is particularly when it come to the affair of their statements against the people of deviation. As though the people of knowledge do not speak from a standpoint of taqwa and fear of Allah, but desire. As if the people of knowledge are fickle individuals who speak against people upon a whim. The Salaf of this Ummah would <em><strong>truly<\/strong><\/em> value the statements of the people of knowledge. Not so these unknowns.<\/p>\n<p>Then they will use, in order to slight the statements of the Ulamā, statements of the Imaams that where mentioned in relation to affairs of rulings of the shariah, connected  to actions, dealings and ijtihād.<\/p>\n<p>Such as the statement of <span style=\"text-decoration: underline;\"><em>Abu Hanīfah:<\/em><\/span><\/p>\n<p>“<strong><em>I<\/em><em>t is not permissible to take from my statements unless you know where I took<\/em><\/strong>”<\/p>\n<p>Or the statement of <span style=\"text-decoration: underline;\"><em>Imām Ash shāfi&#8217;i<\/em><\/span>  “<em><strong>I<\/strong><strong>f you find my statement going against the book or the Sunnah throw my statements against the wall<\/strong><\/em>”<\/p>\n<p>These individuals regularly use statements and principles out of place or to oppose specific issues of methodology. it is well known that a principle in fiqh may not necessarily be a principle in aqidah and vice versa.<\/p>\n<p>These aforementioned statements, are true statements that were mentioned to emphasise the importance of holding on to evidence in issues of shariah. But they are used by these individuals, to put doubt upon the statements, verdicts and advises of the Scholars, because when the scholars speak against someone and warns, often times the general person may not be acquainted with the reasons for the warning, and may not even understand the gravity of the issue, even if it were explained to them!<\/p>\n<p>As <em><u>Al Hasan Al Basri<\/u><\/em> mentioned:<\/p>\n<p>“<strong><em>The fitna, when it appears, it is known by the Ulamā, and when its tail end appears (i.e. when it is over) it is known by every general person<\/em><\/strong>”<\/p>\n<p>That is to say when fitna arises it is spotted, detected and understood by the people of knowledge, how will the ignorant one perceive it, if it is intricate?<\/p>\n<p>Based upon the statements of these ignoramuses, we should leave the general people to get engrossed in these issues, relying upon their own weak deficient understanding, possibly becoming unsatisfied with the evidence presented by those scholars, (since he (the layman) may be ignorant of the foundation that has been opposed) and thus go astray!<\/p>\n<p>Knowledge of the men is in the hands of the people of Knowledge!<\/p>\n<h2><u>The Methodology of Criticism with the Salaf<\/u><\/h2>\n<p>It is established with the people of Sunnah and Hadīth, that the people of knowledge have a methodology related to criticism well known. This methodology is connected to the strong position they have against innovations in the religion, and is connected to the precise science of Jarh and ta’deel (Criticism or praise of the Narrators). None of that which we hear from the ignorant ones, about the ‘correct’ salafi position&#8217; concerning deviant individuals, takes this science into consideration. Rather we hear the Ummah being referred back to the principles of the Ikhwaan Al Muslimīn repackaged as ‘<strong><em>True Salafiyah’<\/em><\/strong>!. Perhaps the reason for this is the fact that our communitites in the west have been strongly influenced by the da’wah of the Ikhwaan Al Muslimīn for decades (we will discuss this later inshallah), so the ignorant one refers back to this as ‘<em><strong>True Balanced Islām’<\/strong> <\/em>and ‘<em><strong>Just Salafiyah’<\/strong> <\/em>while it is nothing but ‘<strong>True Misguidance<\/strong>’.<\/p>\n<p>The one who has knowledge of the method of criticism with the Salaf, their attitude towards it, and the statements of the people of Sunnah will be upon clarity<\/p>\n<p><strong><span style=\"text-decoration: underline;\">Sufyān Ath Thowri said<\/span>:<\/strong><\/p>\n<p>“<strong><em>When a man who dies is mentioned then do not look towards the statements of the general people (i.e. praise or dispraise) rather look to the statements of the people of knowledge and intellect (in determining how he was)<\/em><\/strong>”<\/p>\n<p>(Al Hilyah: 7\/26)<\/p>\n<p><strong>I<span style=\"text-decoration: underline;\">brāhīm ibn Shamās<\/span><\/strong><span style=\"text-decoration: underline;\"><strong> said<\/strong><\/span><\/p>\n<p><strong><em>We asked Wakī&#8217; <\/em><\/strong><strong><em> (d. 196H or 197H) about Khārijah ibn Mus’ab (d. 168H a weak narrator of hadīth) and why he does not take from him, he replied:” I will not narrate from him, Ahmad Ibn Hanbal prohibited me from narrating from him”<\/em><\/strong><\/p>\n<p>(Tabaqāt Al Hanābilah: 1\/392)<\/p>\n<p>He did not mention here anything to do with the reason, just the warning!<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Abu Moosā Muhammad Ibnil Muthanā<\/strong><\/span> (d. 252H) said “<strong><em>I saw in the lap of Abdur Rahmān Ibn Mahdi <\/em><\/strong>(d. 198H)<strong><em> a book wherein he had crossed out (the name of) a man so I said Oh Abu Sa’īd why have you crossed his hadīth out? He responded: Yahya Ibn Sa’īd <\/em><\/strong>(Al Qattaan: d. 198H)<strong><em> informed me that he has been <u>accused<\/u> of being upon the opinion of Jahm (ibn Safwān, the innovator) so I crossed his hadīth out<\/em><\/strong>”<\/p>\n<p>(Al Hilyah: 9\/6)<\/p>\n<p>In this narration this great Im<em>ā<\/em>m in knowledge, piety and taqwa, did not take from a man due to an accusation, was this great Imām in Hadeeth pathetic and unjust?!<\/p>\n<p>It was said to <strong>Ibn &#8216;Aun  <\/strong>(d. 150H) ‘<strong><em>Why don’t you narrate from such and such? He responded: &#8220;Because Abu Bustām Shu’bah <\/em><\/strong>(d. 160H)<strong><em> left him&#8221;<\/em><\/strong><\/p>\n<p>(Taarikh Baghdaad: 9\/260)<\/p>\n<p>Was this typical ‘<em><strong>C<\/strong><strong>ultish behaviour<\/strong><\/em>’ from <em><strong>Ibn Aun<\/strong><\/em>? Did he ‘oppress’ the one he refused to take from?<\/p>\n<p>In this narration we see that these great scholars of the Salaf did not take knowledge from the aforementioned individuals and criticised their integrity, citing as their reason that the people of Hadīth and Sunnah did not take from them, people of Sunnah who were familiar with the man as his affair. Not once do we see them saying “..So I went to speak to him myself to verify” or “..but I will continue to take from them until the evidence is shown to me” or “did they advise him?” because they knew The People of Hadīth are most knowledgable concerning advice and nasīhah and that their speech is based upon them fearing Allah and knowing they will have to stand before Allah with what they say!<\/p>\n<p>In fact even when individuals denyed with their own mouths what had been attributed to them, the people of Sunnah would not reject what was established with the people of Sunnah concerning the individual, since it is well known that the people of innovation are cunning, tricky and deceptive.<\/p>\n<p><strong><span style=\"text-decoration: underline;\">Imām Khateeb Al Baghdādi<\/span><\/strong> (d. 463H) mentions the statement of Sālih the son of Imām Ahmad who inform his father that some one had come to see him who said his name was daawūd (Dawūd ibn Ali Adh Dhāhiri) his father aid : &#8220;<strong>From where<\/strong>? He replied &#8220;<strong>Asbahān<\/strong>&#8221; he said: &#8220;<strong>what does he do<\/strong>? and Sālih did not do well to define who he was Abu Abdillah (Imam Ahmad) did not cease asking until he realised who he was. He said: <em><strong>Him! Muhammad Ibn Yahyā An Naisābūri wrote to me informing me that he holds that the qurān is created<\/strong><\/em>&#8221; so his son said: <em><strong>He negates and rejects that<\/strong><\/em>! He replied &#8220;<strong><em>Muhammad Ibn Yahyā <span style=\"text-decoration: underline;\">is more trustworthy that him<\/span>! do not give him permission to come to me<\/em><\/strong>!<\/p>\n<p>(Collected by Khateeb Al Baghdādi in Tarīkh Al Baghdād 8\/374)<\/p>\n<p>Was this more &#8216;<span style=\"text-decoration: underline;\"><em><strong>C<\/strong><\/em><em><strong>liche-ish<\/strong><\/em><\/span>&#8216; &#8216;<span style=\"text-decoration: underline;\"><em><strong>C<\/strong><\/em><em><strong>ultish<\/strong><\/em><\/span>&#8216;, &#8216;<span style=\"text-decoration: underline;\"><strong><em>C<\/em><\/strong><em><strong>ringeworthy<\/strong><\/em><\/span>&#8216; behavior from Imām Ahmad? did Imām Ahmad wrong him by not accepting from him his denial? should he have &#8216;<span style=\"text-decoration: underline;\"><em><strong>been more of a man&#8217; and talk to him<\/strong><\/em><\/span>? Perhaps give him an interview..let him have his say! Or was this a methodology <span style=\"text-decoration: underline;\"><strong>Well-Known<\/strong><\/span>?<\/p>\n<p><strong>Hamād ibn zaid<\/strong> (d. 179H b. 98) said <strong><em>Hamād ibn Abi Sulaimān <\/em><\/strong>(d.120H)<strong><em> the Shaikh of Abu Hanīfah came to us in Basrah and Ayoob (As Sikhiyaani: d. 131H b. 66) didn’t go to see him, so neither did we, for if Ayoob didn’t go to see someone we too would not go. Laith Ibn Abi Sulaim came to Us and Ayoob went to see him so we too went&#8221;<\/em><\/strong><\/p>\n<p>(Tabaqāt Ibn Sa&#8217;d: 7\/286)<\/p>\n<p>Bear in mind that <strong><em>Hamād ibn Abi Sulaimān <\/em><\/strong>was a taabi&#8217;i who had taken from<strong><em> Anas Ibn Maalik! a<\/em><\/strong>nd<strong><em> Ibraaheem An Nakhai&#8217; <\/em><\/strong>and that<em> <strong>Hamād<\/strong><\/em><strong><em> Ibn Zaid was born in the year 98H. <\/em><\/strong>That would mean that if we were to say<strong><em> Hamād ibn Abi Sulaimān <\/em><\/strong>visited basra just before he died<strong><em>, Hamād Ibn Zaid <\/em><\/strong>wouldnt have been more than 18 years old! Shouldn&#8217;t Imaam Ayoob be teaching these young students the etiquette of visiting and taking from the people of knowledge? particularly this elderly man who was a student of the companion <strong><em>Anas Ibn Maalik? <\/em><\/strong>but though he was praised by some, he was accused of irjaa, thus<strong><em> Ayoob <\/em><\/strong>did not go to see him, neither did his many students. From his students were <strong><em>Sufyaan Ibn Uyainah, Sufyaan at Thawri, Hamād Ibn Salamah, Hamād Ibn zaid, Shu&#8217;bah, Ma&#8217;mar Ibn Raashid, Ismaa&#8217;il Ibn Ulaiyah <\/em><\/strong>to name but a few<strong><em>! <\/em><\/strong>And none of them went?!<\/p>\n<p>No doubt the ignoramuses of our time would deem this ‘<em><strong>C<\/strong><strong>ultish<\/strong><\/em>’ behaviour of the highest order!<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Al Hasan Ibn Īsā<\/strong> <\/span>said I asked (Abdullah) Ibn Mubārak (d. 181) about Asbāt (Ibn Muhammad (d. 200H)) and Muhammad Ibn Fudhail Ibn Ghazawān (d. 194H or 195H accused of the bid&#8217;ah of Tashayu&#8217; (early Shi&#8217;ism)) and he remained silent. <strong><em>After a number of days he saw me and said “Oh Hasan your two companions (i.e. the two you asked me about) our companions (i.e. the people of Sunnah) are not pleased with them<\/em><\/strong>”<\/p>\n<p>(Dhu&#8217;afaa ul &#8220;Uqaili: 1\/119)<\/p>\n<p>Al Hasan did not follow this statement up with “well what was their evidence??” so did they fall short in relation to giving the muslim his right? Or was it because this an affair well known!<\/p>\n<p><em><strong><span style=\"text-decoration: underline;\">Abdullah Ibn Umar As Sarkhasi<\/span><\/strong><\/em> said &#8220;<em><strong>I ate with a person of innovation once, and that reached Abdullah ibn Mubārak and he said: &#8220;I will not speak to him for thirty days!&#8221;<\/strong><\/em><\/p>\n<p>(Collected by Al lillakā&#8217;i in &#8216;Sharh I&#8217;tiqād Ahlis Sunnah: 1\/139)<\/p>\n<p>Did Abdullah Ibn Umar As Sarkhasi respond with: &#8220;Well why doesn&#8217;t he ask me what happened?&#8221; or &#8220;Subhanallah I could have had a number of reasons&#8221; or other similar arguments we hear from the ignorant ones! Was this &#8216;childish&#8217; &#8216;cultish&#8217; behavior from Ibnil Mubārak ?<\/p>\n<p>If the Salaf held onto the principles these people claim, imagine the state the Ahādeeth of the Messenger of Allah would be in today!?<\/p>\n<p>Statement such as &#8220;<em>akhi just take benefit<\/em>&#8221; or &#8220;<em>dont listen to those brothers<\/em>&#8221; or &#8221; <em>the shaikh is just a man with an opinion akhi<\/em>!&#8221; or &#8220;<em>What is the shaikhs evidence akhi<\/em>&#8221; would have destroyed the Sunnah!<\/p>\n<p>Certainly we will hear (from them) that these narrations are not acted upon correctly, or are not to be acted upon in this way (as though they are just some historical record!) or were for a particular time or or or&#8230;<\/p>\n<p>Just as we hear these people quoting principles we have been teaching for over a quarter of a century, since the early nineties, as our teachers, the Ulamaa of Madinah, taught us, (from them Shaikhanā Hamād Al Ansāri (and his Son), Shaikhanā Umar Falāta, Shaihanā Abdul Muhsin Al &#8216;Abād (and his son), Shaikhanā Ali Nāsir Al Faqīhi, Shaikhanā Rabee&#8217; Ibn Hādi, Shaikhanā Ubaid Al Jābiri, Shaikhanā Muhammad Ibn Hādi, Shaikhanā Abdullah al Bukhāri, Shaikhanā Ahmad An Najmi to name but a few. Or those who taught us the book of Allah. Such Shaikhanā Ubaidallah Al Afghāni or Abdullah Al Juhani among others. Or those who were our study companions who we benefited greatly from upon the path, such as Shaikh Usāma Al &#8216;Amri, Shaikh Fu&#8217;ād Al &#8216;Amri Shaikh Khālid Adh dhafeeri or Shaikh Nizār Hāshim Abbās among others, people we actually spent time and <em><strong>studied<\/strong><\/em> with, not odd visits)<\/p>\n<p>Do these previously mentioned narrations mean we are calling to abandonment of evidence? Of course not but we must first understand what evidence (particularly in issue of jarh (disparagement)) is!<\/p>\n<p>In response to this common doubt and in refutation of Abul Hasan Al Ma’ribi Our <span style=\"text-decoration: underline;\">Shaikh Rabī Ibn Hādi<\/span> mentions: (and pay close attention to this!):<\/p>\n<ul>\n<li>“From the fundamental principles of Ahlis Sunnah is: ‘<em><strong>Know the truth, and you will know the men and the fact that the truth is not known because of the men<\/strong><\/em> (i.e. because it is held by certain individuals.<\/li>\n<li>And from the fundamental principles of Ahlis Sunnah is: ‘<strong><em>Evidence is sought to substantiate positions held by individuals, they themselves are not the evidence<\/em><\/strong>.<\/li>\n<li>And from the fundamental principles that Ahlus Sunnah have united upon is: ‘<em><strong>Whosoever the Sunnah of the messenger of Allah has become clear to, it is not permissible for him to leave it for anyone&#8217;<\/strong><\/em> as <span style=\"text-decoration: underline;\"><em>Imām Ash Shāfi’ī<\/em><\/span> has said<\/li>\n<\/ul>\n<p>These fundamentals or evidences have been neglected, destroyed and wasted by Abul Hasan Al Ma&#8217;ribi and his supporters, he created a smokescreen of claims, that him and his followers reiterate, claiming to the people that they are Ahlus Sunnah and they are the <em><strong>&#8216;people of evidence&#8217; and that they do not accept statements except with daleel (evidence) <\/strong><\/em>and that they are people of <strong><em>principles<\/em><\/strong> and other than them are <em>unstable<\/em> and fear the mention of fundamentals and principles, and that &#8216; <em><strong>they do not make taqleed of anyone<\/strong><\/em>&#8216; and that such and such (people of knowledge and Sunnah) are not infallible, and that <strong><em>we are not bound to accept the statement of such and such nor such and such, <\/em><\/strong>and other such statements, the like of which, when incidents transpire, we see the statement of the guided khalifah Ali &#8211; Radhiyallahu anhu &#8211; concerning the khawaarij, being true of them. When they used to repeat their statement &#8220;<strong><em>Indeed rule is but for Allah<\/em><\/strong>!&#8221; so he said: &#8221; <em><strong>A statement of truth, but what is intended by it is falsehood<\/strong><\/em>!&#8221; (Muslim:1066)<\/p>\n<p>We recognise and understand, what they repeat and regurgitate from their great claims of:<\/p>\n<p><em><strong>&#8216;Fundamentals&#8217;<\/strong><\/em> and &#8216;<em><strong>principles&#8217;<\/strong><\/em> and the &#8216;<strong><em>seeking of proofs&#8217;<\/em><\/strong> and the &#8216;<strong><em>clinging to evidence&#8217;<\/em><\/strong> and &#8216;<em><strong>fighting against taqleed&#8217;<\/strong><\/em>, and that &#8216;<em><strong>W<\/strong><strong>e don&#8217;t have popes or religious chiefs or custodians&#8217;<\/strong><\/em>.<\/p>\n<p>We recognise and understand, that the apparent statement is truth, but they intend by way of it great falsehood, <span style=\"text-decoration: underline;\"><em><strong>they intend by way of it agitation and wreaking havoc and fitan with the people of Haq and Sunnah<\/strong><\/em><\/span>.<\/p>\n<p>So Ahlus Sunnah engaged them and confronted them, with the book and the Sunnah and with the Manhaj of the Salaf us Saalih and with their sound, guided principles, and they (Ahlus Sunnah) exposed these principles of theirs and stripped them of the &#8216;weapons&#8217; they had the cheek and insolence to present, of &#8216;<strong><em>Fundamentals<\/em><\/strong>&#8216; and &#8216;<strong><em>Principles<\/em><\/strong>&#8216; and &#8216;<em><strong>proofs<\/strong><\/em>&#8216; and &#8216;<em><strong>evidences<\/strong><\/em>&#8216;. So then <em><strong>they<\/strong><\/em> resorted to blind following, and clinging to &#8216;<strong><em>such and such said<\/em><\/strong>&#8216; and &#8216;<strong><em>such and such said<\/em><\/strong>&#8216; (such as that which we observe from them now in the west, &#8220;<b>S<\/b><strong><em>haikh such and such said about those brothers<\/em><\/strong>&#8221; (someone who knows nothing about them)! without a shred of evidence! Just claims (but that is accepted without question or &#8216;evidence&#8217;..How ironic!). Additionally (even) this wasn&#8217;t sufficient for them, so they resorted to what was worse than that, they resorted to attacking the text (or the book and the sunnah) through deception, severing (parts of evidence) and concealing (text)&#8221;<\/p>\n<p>(Majmoo&#8217; Ash Shaikh Rabī&#8217; 13\/175-176)<\/p>\n<p>Bear in mind, Our Shaikh wrote these words in refutation of Abul Hasan 15 years ago!<\/p>\n<p>As the Arab parable goes ما أشبه الليلة بالبارحة &#8216;<em>How much tonight resembles last night<\/em>!&#8217; perhaps now it becomes clearer to some of us, why Shaikh Rabī sought from certain individuals to free themselves from Abul Hasan Al Ma&#8217;ribi, is it a coincidence then, that today we see them championing the very same rhetoric!<\/p>\n<p>May Allah save us from being self-conceited, arrogant, vain-glorious individuals concerned only with promoting ourselves and our &#8216;achievements&#8217; and grant us Knowledge of the &#8216;<em><strong>True<\/strong><\/em>&#8216; Manhaj of the Salaf of this Ummah.<\/p>\n<p>Was Sallallahu &#8216;alaa Nabiyinaa Muhammad<\/p>\n<p>@abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Explore deep insights into the challenges faced by Ahlus Sunnah in the West, their adherence to Salafiyah principles, and the criticism they encounter. Delve into the scholarly methodologies of criticism and validation, highlighting historical precedents and their relevance today.<\/p>\n","protected":false},"author":1,"featured_media":8843,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6,12],"tags":[],"class_list":["post-2653","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-dawah","category-manhaj"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2017\/08\/Responding-to-Doubts-against-Dawah-Salafiyyah-Part-2.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2653","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=2653"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/2653\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8843"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=2653"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=2653"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=2653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}