{"id":299,"date":"2011-12-21T16:56:46","date_gmt":"2011-12-21T15:56:46","guid":{"rendered":"http:\/\/ah-sp.com\/?p=299"},"modified":"2024-07-08T12:43:49","modified_gmt":"2024-07-08T12:43:49","slug":"was-imam-abu-hanifah-weak-in-hadith-examining-scholarly-opinions","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/was-imam-abu-hanifah-weak-in-hadith-examining-scholarly-opinions\/","title":{"rendered":"Was Imam Abu Hanifah Weak in Hadith? Examining Scholarly Opinions"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/299?action=genpdf&amp;id=299\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah was Salaatu Was Salaamu &#8216;alaa Rasoolillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>A few articles ago i discussed an issue related to the four rak&#8217;aahs after ishaa carrying the reward of lailatul Qadr and a weak hadeeth was mentioned. Shaikh Al Albaani clarified that the reason for its weakness was the presence of Imaam Abu Haneefah in its chain of narration. A question that arose after that was: &#8216;But is Abu Haneefah weak in Hadeeth?!&#8217;<\/p>\n<p>In order to clarify the issue i quote here the research of Shaikh Al Albaani concerning the affair:<\/p>\n<p><strong>Shaikh Al Albaani mentions rahimahullah<\/strong> :<\/p>\n<p>“I mentioned back there (Under hadeeth 397) that Abu Haneefah has been declared weak (by the scholars of Hadeeth ) in Hadeeth. In order to bring clarity to this I say:<\/p>\n<p>I mentioned there that Abu Haneefah – Rahimahullah – was declared weak due to his memory by <strong>(Imaam) Al Bukhaari (Imaam) Muslim, (Imaam) Nasaa’I and Ibn ‘Adi<\/strong> and others from the Imaams of Hadeeth. So I will mention here the quotes from the Imaams (of Hadeeth) i have indicated and others from whom this statement has authentically come. That the reader may be upon clarity in the affair and so that none can claim about what we mentioned there (i.e that he is weak in hadeeth) that this is Ijtihaad (i.e. his personal conclusion based upon his own analysis) from me, rather it is itibaa’ (pure following) of the people of knowledge, understanding and specialism. Allah the Mighty and Exalted has stated “<\/p>\n<p><em><strong>&#8220;Ask the people of Knowledge if you do not know” (Suratul Nahl Vs 43)<\/strong><\/em><\/p>\n<p>And he has said:<\/p>\n<p><em><strong>“Ask of it one who is well aquainted”  (Suratul Furqaan Vs 59)<\/strong><\/em><\/p>\n<ol>\n<li><strong>Imaamul Bukhaari<\/strong> said in ‘Taareekhul Kabeer’ (4\/2\/81) ‘<em>Sakatoo ‘Anhu’<\/em> (this statement of Imaamul Bukhaari literally means: ‘they remained quiet about him’ That is in reference to the Imaams of Hadeeth. But this statement if it comes from Imaam Bukhaari then it means that they left narrating from him since Imaam al Bukhaari was well known to be subtle in his statements of Jarh. <strong>Imaam Ibn Katheer<\/strong> mentions: “<em>If Imaamul Bukhaari says about a narrator ‘Sakatoo ‘anhu’ or ‘Feehi Nadhr’ (Lit: his affair is dubious) then he (the narrator) is at the lowest level ( of trustworthiness) as far as he is concerned, due to the fact that he was subtle with his disparaging statements<\/em>” ikhtisaar ‘Uloomil Hadeeth p89. AH)<\/li>\n<li><strong>Imaam Muslim<\/strong> mentioned in &#8216;Al Kunaa Wal Asmaa&#8217; (1\/31ق) &#8220;<em>He is unstable (Mudtarib) in hadeeth and doesnt have many Authentic hadeeth<\/em>&#8220;<\/li>\n<li><strong>Imaam An Nasaa&#8217;ie<\/strong> mentions at the end of &#8216;Ad-Du&#8217;afaa&#8217; Wal Matrookeen&#8217; (p57): &#8220;<em>He is not strong in hadeeth and he makes many mistakes even though his narrations are few<\/em>&#8220;<\/li>\n<li><strong>Imaam Ibn &#8216;Adee<\/strong> in &#8216;Al Kaamil&#8217; (2\/403):&#8221;<em>He has some sound hadeeth but the majority of what he narrates are erroneous narrations, with mistakes in wording and additions in their chains of narration and their texts. He (also) makes Mistakes when quoting the names of the narrators and the majority of that which he narrates is like this. None of his narrations are authentic other than a little more the ten, while he actually narrates some three hundred hadeeth, some of them popular, while some are strange narrations but they are all narrated in this fashion. This is because he is not from Ahlul Hadeeth (the people of hadeeth), thus one should not transmit from an individual of this description in hadeeth&#8221;<\/em>.<\/li>\n<li><strong>Imaam Ibn S&#8217;ad<\/strong> mentions in his &#8216;Tabaqaat&#8217; (6\/256): &#8220;<em>He was &#8216;Dae&#8217;eef (weak) in hadeeth<\/em>&#8220;<\/li>\n<li><strong>Imaam Al Uqailee<\/strong> mentions in &#8216;Ad Du&#8217;afaa&#8217; (The weak Narrators): &#8220;<em>It was narrated to me from Abdullah ibn Ahmad who said:&#8221;I heard my father (Imaam Ahmad) say: &#8221; The Hadeeth of Abu Haneefah are weak<\/em>&#8220;<\/li>\n<li><strong>Imaam Ibn Abee Haatim<\/strong> mentioned in &#8216;Al Jarh Wat Ta&#8217;deel&#8217; (4\/1\/450): &#8220;<em>It was narrated to me from Hajaaj ibn Hamzah who said we were informed by &#8216;abdaan ibn Uthmaan who said i heard Ibn Al Mubaarak say: &#8220;Abu Haneefah was &#8216;Miskeen&#8217; (A pauper) in hadeeth<\/em>&#8220;<\/li>\n<li><strong>Imaam Abu Hafs Ibn Shaaheen<\/strong> said:&#8221; <em>As for abu haneefah then he possesed in the knowledge of fiqh that which can not be denied, though he was not pleasing in Hadeeth&#8230;&#8221;<\/em><\/li>\n<li><strong>Imaam Ibn Hibbaan<\/strong> stated: &#8220;<em>He was a man who used to debate (ie in issues of knowledge) and he was apparently pious, though hadeeth was not his fortḗ. He narrated some one hundred and thirty hadeeth with isnaad (chains of narration), he has no other hadeeth in the dunya but them and he erred in one hundred and twenty of them! He either reversed the chain of narration or he changed the text of the hadeeth to the extent that the hadeeth was not recognisable. So since his errors have overcome his instances of correctness, one should leave relying upon him in narration&#8221;<\/em>.<\/li>\n<li><strong>Imaam Ad Daaraqutni <\/strong>mentions in his &#8216;Sunan&#8217; a narration from Abu Haneefah who narrates from Moosaa ibn abee Aa&#8217;isha who narrates upon the authority of Abdullah ibn Shadaadf rom Jaabir &#8211; Radhiyallahu anhu who attribute to the Messenger &#8211; Sallallahu Alaihi wa Salam (the statement): &#8220;<strong><em>Whoever has an Imaam then the recitation of the Imaam is recitation for him<\/em><\/strong>&#8221; then Imaam Ad Daaraqtni states after it (P 123): &#8221; <em>No one narrates it from Moosaa ibn Abee Aa&#8217;isha other than Abu Haneefah and Al Hasan ibn &#8216;Umaarah and they are both weak&#8221;<\/em>.<\/li>\n<li>He was mentioned by<strong> Imaam Haakim<\/strong> in &#8216;Ma&#8217;rifatu &#8216;Uloomil Hadeeth&#8217; (Imaam Haakim&#8217;s book concerning the Science of Hadeeth) alongside a group of Narrators from the era of the Atbaa&#8217;ut Taabi&#8217;een (Successors of the Successors of the Companions) and the period after them, whose ahadeeth were not used in the Books of Authentic Hadeeth, he then sealed that with his statement (P256): &#8221; <em>Everyone we have mentioned here is well known as a narrator, but they are not considered among the precise, trustworthy memorisors&#8221;<\/em>.<\/li>\n<li><strong>Al Haafidh Abdul Haq Al Ashbeeli<\/strong> mentions in &#8216;Al Ahkaam&#8217; (2\/12ق) the hadeeth of Khaalid ibn Alqama from Abdu Khairin from Ali concerning his wudhoo (salaallahu alaihi wa Salam: &#8220;<strong><em>He wiped his head once<\/em><\/strong>&#8221; then he states at the end of it: &#8221; <em>This is how the trustworty memorisors have narrated it from Khaalid. It has also been narrated from Khaalid by Abu Haneefah who narrates<\/em>: &#8220;<em><strong>then he wiped his head three times<\/strong><\/em>&#8221; <em>but Abu Haneefa is not relied upon due to his weakness in Hadeeth<\/em>&#8220;<\/li>\n<li><strong>Ibnil Jawzi<\/strong> mentions him in his book &#8216;Ad Du&#8217;afaa wal Matrookeen&#8217; (the Weak and abandoned Narrators)(3\/163) and he narrates the statements of Imaam An Nasaa&#8217;ie and others who have previously been mentioned declaring him weak. He also narrates from At Thowri (Imaam sufyaan Ath Thowri) that he said: &#8220;<em>He is not Trustworthy<\/em>&#8221; and from An Nadhr ibn Shameel who said: &#8220;<em>He is abandoned in Hadeeth<\/em>&#8220;<\/li>\n<li><strong>Imaamudh Dhahabee<\/strong> mentions in &#8216;Dewaan Ad Dhu&#8217;afaa'(1-2\/215ق): &#8221; <em>An Nu&#8217;maan Al Imaam &#8211; Rahimahullah Ibn Adee said: The majority of that which he narrates is an error or has in it incorrect alterations of words or has incorrect additions in them, though he does have some good ahaadeeth. Imaamun Nasaa&#8217;ee said: &#8220;He is not strong in Hadeeth and he makes many errors and mistakes even though his narrations are few&#8221; Imaam Ibn Ma&#8217;een said: &#8220;Do not pen down his hadeeth&#8221;. This narration from Ibn Ma&#8217;een means that with him Abu Haneefah is considered among the weak narrators, which explains that the statement that has come from Al Haafidh (ibn Hajr) in &#8216;Tahdheeb&#8217; wherein Ibn Hajr narrates that Ibn Ma&#8217;een declares him trustworthy, is not the only statement that Ibn ma&#8217;een has made concerning him. The reality is that the opinions of Ibn Ma&#8217;een about the imaam are at variance. On occasions he declares him trustworthy and on other occasions he declares him weak as in this narration. On other occasions he says in that which ibn Muhriz narrates from him in &#8216;Ma&#8217;rifatur Rijaal (1\/6\/1): &#8220;Abu Haneefah was &#8216;Laa Ba&#8217;sa bihi&#8217; (This is a term used by the scholars of hadeeth to refer to one whos ahaadeeth may be written down for the purpose of analysis and comparison with the ahaadeeth of the other Imaams not sole reliance upon them) and he did not used to lie&#8221; and he said on another occasion: &#8221; Abu Haneefah as far as we are concerned is from the people of truthfulness, he was not accused of lying&#8221; (Shaikh Albaani continues): &#8220;There is no doubt with us that Abu Haneefah is from the people of truthfulness! but that is not sufficient for us to rely upon his hadeeth until (the state of) his precision, integrity and memory is added to that, and this is what is not established for him &#8211; Rahimahullah rather that which is established is the opposite, as is seen from the testimonies of the aforementioned Imaams. And they are those who one will not go astray if he holds on to their testimonies and follows their statements. This though, does not affect in any way the station of Abu Haneefah &#8211; Rahimahullah in his deen and his piety and his fiqh as some of his staunch followers wrongly presume (and misunderstand). For how many a Jurist, Judge or righteous, upright individual has been criticised by the scholars of Hadeeth in that which concerns their memory or them not being precise, but that does not affect their deen or known uprightness, and this is an affair that is not hidden from those who busy themselves studying the biographies of the narrators&#8230;&#8221;<\/em><\/li>\n<\/ol>\n<p>(See Silsilatul Ahaadeeth Ad Dha&#8217;eefah: 1\/661-666)<\/p>\n<p>Wallahu ta&#8217;aalaa A&#8217;lam<\/p>\n<p><a href=\"http:\/\/www.twitter.com\/abuhakeembilal\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">www.twitter.com\/abuhakeembilal<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article explores the scholarly views on Imam Abu Hanifah&#8217;s status as a Hadith narrator. It delves into quotes from prominent scholars and clarifies the distinction between his knowledge of jurisprudence and Hadith transmission.<\/p>\n","protected":false},"author":1,"featured_media":9027,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[11,18],"tags":[],"class_list":["post-299","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hadeeth","category-the-scholars"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2011\/12\/Was-Imam-Abu-Hanifah-Weak-in-Hadith.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/299","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=299"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/299\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9027"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=299"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=299"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=299"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}