{"id":3345,"date":"2019-02-21T13:52:56","date_gmt":"2019-02-21T13:52:56","guid":{"rendered":"http:\/\/ah-sp.com\/?p=3345"},"modified":"2024-07-09T00:50:51","modified_gmt":"2024-07-09T00:50:51","slug":"mutual-consultation-in-the-path-of-ahlus-sunnah","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/mutual-consultation-in-the-path-of-ahlus-sunnah\/","title":{"rendered":"Mutual Consultation in the Path of Ahlus Sunnah!"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/3345?action=genpdf&amp;id=3345\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p><img decoding=\"async\" class=\"aligncenter wp-image-3346\" src=\"https:\/\/ahspdotnet.files.wordpress.com\/2019\/02\/bismillah-png-20.png\" alt=\"bismillah-png-20\" width=\"365\" height=\"72\" \/><\/p>\n<p style=\"text-align: center;\">Mutual Consultation is from the path of Ahlus Sunnah!<\/p>\n<p style=\"text-align: center;\">الحمد لله، والصلاة والسلام على من لا نبي بعده. وبعد:<\/p>\n<p>There is no true person of Sunnah in this era, that will have heard of the recent statement made by the Egyptian Khālid Abdur Rahmān concerning Imām Rabī’ Ibn Hādi Al Madkhali, except that he will be amazed and bewildered at his foul claim that our shaikh and father has fallen into a foundation from the principles of the khawārij, due to news reaching him that Shaikh Rabī’ and other scholars come together privately to consult regarding issues that are of concern to the Ummah.<\/p>\n<p>Who in this era, has uncovered the falsehood of the khawārij of this time, and their spiritual Leaders, Sayyid Qutb, Al Maudūdi, Al ‘Azām and their students, and exposed what is in their writings of the foundations of the khawārij and their principles more thoroughly than Imām Rabī’?!<\/p>\n<p>And where are the defences of those who claim love for the people of knowledge and hate the ‘Evil Sa’āfiqah’ who have ‘wronged our scholars’, those individuals who claim ‘Wallahi we love Shaikh Rabī’ he is our father! It is only the ‘Sa’āfiqah’ we hate and must expose!’ While they only expose themselves with their silence.<\/p>\n<p>Or worse still, they spread the speech of the one who defends this insolent ignorance, while claiming to be upon a Nahj (path) that is Wādhih (clear)!<\/p>\n<p>The only thing that is wādhih is their long-festering reality, since these evil statements and stances are not born overnight! Let every Sāhib Sunnah take note.<\/p>\n<p>From the established fundamentals with the people of Sunnah is as Allah has said:<\/p>\n<p style=\"text-align: center;\"><strong>{وَأَمْرُهُمْ شُورَى بَيْنَهُمْ<\/strong>}<\/p>\n<p style=\"text-align: center;\"><strong>“their affairs are by mutual consultation”<\/strong><\/p>\n<p style=\"text-align: center;\"><strong>Suratush Shūrā Vs 38<\/strong><\/p>\n<p>Concerning this verse Imām Ibn Kathīr mentions:<\/p>\n<p style=\"text-align: center;\">وَقَوْلُهُ: {<strong>وَالَّذِينَ اسْتَجَابُوا لِرَبِّهِمْ<\/strong>} أَيِ: اتَّبَعُوا رُسُلَهُ وَأَطَاعُوا أَمْرَهُ، وَاجْتَنَبُوا زَجْرَهُ، {<strong>وَأَقَامُوا الصَّلاةَ<\/strong>} وَهِيَ أَعْظَمُ الْعِبَادَاتِ لِلَّهِ عَزَّ وَجَلَّ، <strong>{وَأَمْرُهُمْ شُورَى بَيْنَهُمْ<\/strong>} أَيْ: لَا يُبْرِمُونَ أَمْرًا حَتَّى يَتَشَاوَرُوا فِيهِ، لِيَتَسَاعَدُوا بِآرَائِهِمْ فِي مِثْلِ الْحُرُوبِ وَمَا جَرَى مَجْرَاهَا 7\/211<\/p>\n<p style=\"text-align: left;\">As for his statement “<strong>Those who responded to their lord<\/strong>” meaning: They followed their Messenger, and obeyed his command, and refrained from that which he prohibited.  And His statement: <strong>“..And established the Salaah<\/strong>..” as it is the greatest of the acts of worship one performs for Allah the mighty and majestic. And His statement: “<strong>and who conduct their affairs by mutual consultation<\/strong>” Meaning they do not become impatient and embark upon any affair until they consult among themselves concerning it, so as to seek aid in their (sound) opinions regarding wars and their likes” (Tafsīr Ibn Kathīr 7\/211)<\/p>\n<p>Ash Shaikh Abdur Rahmān Ibn Nāsir As Sa’di mentions concerning the verse:<\/p>\n<p style=\"text-align: center;\">{<strong>وَأَمْرُهُمْ<\/strong>} الديني والدنيوي {<strong>شُورَى بَيْنَهُمْ<\/strong>} أي: لا يستبد أحد منهم برأيه في أمر من الأمور المشتركة بينهم، وهذا لا يكون إلا فرعا عن اجتماعهم وتوالفهم وتواددهم وتحاببهم وكمال عقولهم، أنهم إذا أرادوا أمرا من الأمور التي تحتاج إلى إعمال الفكر والرأي فيها، اجتمعوا لها وتشاوروا وبحثوا فيها، حتى إذا تبينت لهم المصلحة، انتهزوها وبادروها، وذلك كالرأي في الغزو والجهاد، وتولية الموظفين لإمارة أو قضاء، أو غيره، وكالبحث في المسائل الدينية عموما، فإنها من الأمور المشتركة، والبحث فيها لبيان الصواب مما يحبه الله، وهو داخل في هذه الآية.<\/p>\n<p style=\"text-align: left;\">Concerning the statement “<strong>And who conduct their affairs<\/strong> –the affairs of their deen and dunya- through <strong>mutual consultation between them<\/strong>” that is to say, no single individual among them proceeds upon his own opinion regarding issues that are of general concern to them all. <strong>This stems from the unity, conformity, affection and love that is between them, and (is due to) their complete and sound intellects, that whenever they intend a matter from the affairs that require reflection and (sound) opinion, they come together, consult and mutually research concerning it, such that when the greater good becomes clear to them regarding it they proceed and seize the opportunity<\/strong>. <strong>That is such as their opinions concerning warfare and Jihād<\/strong>, or putting someone in a position of leadership or judgement or other than that. Similarly the religious affairs generally, as they are from the communal common issues, thus (mutual) exploration and enquiry regarding them, in order to reach that which is sound and correct, is from that which Allah loves and enters into the meanings of this verse&#8230;”<\/p>\n<p>There is a clear difference between our scholars mutual consultation and sharing of opinions for the greater good of the Ummah, and the secret plotting and conspiring of the khawārij!<\/p>\n<p>May Allah preserve our Shaikh from those who intend to harm him but do nothing but bark at a mountain!<\/p>\n<p>Wallahu A’lam<\/p>\n\n\n<p>@abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this era, any true adherent of the Sunnah who has heard the recent statements made by the Egyptian caller Khalid Abdur Rahman regarding Imam Rabi&#8217; Ibn Hadi Al Madkhali cannot help but be astonished.<\/p>\n","protected":false},"author":1,"featured_media":8835,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-3345","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2019\/02\/Mutual-Consultation-in-the-Path-of-Ahlus-Sunnah.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/3345","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=3345"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/3345\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8835"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=3345"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=3345"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=3345"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}