{"id":352,"date":"2011-12-29T22:22:18","date_gmt":"2011-12-29T21:22:18","guid":{"rendered":"http:\/\/ah-sp.com\/?p=352"},"modified":"2024-07-08T12:42:04","modified_gmt":"2024-07-08T12:42:04","slug":"the-day-of-mazeed-increase-a-hadith-on-jumuah-and-the-hereafter","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/the-day-of-mazeed-increase-a-hadith-on-jumuah-and-the-hereafter\/","title":{"rendered":"The Day of Mazeed (Increase): A Hadith on Jumu&#8217;ah and the Hereafter"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/352?action=genpdf&amp;id=352\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salaatu wa Salaamu &#8216;alaa Rasoolillahi Ammaa Ba&#8217;d:<\/p>\n<p>One of the brothers yesterday (27\/12\/2011) asked me about the authenticity of a beautiful hadeeth that he had come across in the book &#8216;Al Nihaaya&#8217; (The Book of the end) page 702 &#8211; 704 (Daarus Salaam print) and asked whether I knew of its authenticity. It brought me joy when I discovered, after looking in the various sources of the hadeeth and sifting through the statements of the scholars of hadeeth, that Shaikh Al Albaani declared the hadeeth to be &#8216;Hasan li Ghairihi&#8217;, for it is a hadeeth that brings tears to the eyes, so I share the hadeeth with my brothers and sisters and I mention some observations upon the translation found in the daarus salaam version of the book:<\/p>\n<p>Upon the authority of Anas ibn Maalik who said: that the Messenger of Allah &#8211; Sallallahu &#8216;Alaiihi wa Salam &#8211; &#8220;<em><b>Jibreel &#8211; Alaihi Salaam &#8211; came to me and in his hand was a white mirror, upon it there was a black spot. I said what is this (referring to the mirror) Oh Jibreel? He said this is (the day of) Jumu&#8217;ah your lord presents it to you that it may be an eid for you and your people after you. You will be the first (i.e. you and your nation will be the first to have their day of eid during the week) and the Jews and the Christians will follow you (that is the following day is sabbath for the Jews on Saturday and the Christians day being Sunday). He (the prophet) said: What is there for us in it? He said: In it is Good for you! In it there is an hour if one supplicates to his lord for good that has been allotted to him, he will receive it, or (supplicates for) something that has not been allotted to him, except that he will have preserved for him that which is greater than it. Or if he seeks refuge upon it from evil that was written to afflict him, then he is granted refuge. Or he seeks refuge from something that was not written for him, then he is granted refuge from an affair greater than it. So i said what is this black spot? He said: This is the hour (i.e the day of judgement) it will be established on a Jumu&#8217;ah. It is the leader of all the days with us, in the hereafter we will call it, &#8216;The day of &#8216;Mazeed&#8217; (The increase) So i said: Why do you call it the day of &#8216;Mazeed&#8217;? he said: &#8216;Indeed your lord has taken a vast valley in Jannah made of white musk (In one version &#8216;Dunes of white musk&#8217;). On the day of Jumu&#8217;ah he descends from above the seven heavens until he is over the Kursee. He surrounds his Kursee with pulpits of light, then the prophets come and sit upon them. Then the pulpits are surrounded with chairs of gold and the martyrs and the truthful come and sit upon them. Then the People of Jannah will come and sit upon the dunes (of white musk), then their lord &#8211; Blessed and exalted be he &#8211; reveals himself to them and they look at his face. Then he says to them: &#8220;I am he who has been truthful in my promise to you, and perfected my favours upon you, This is the place of my ennoblement! Ask of me! So they ask him for his good pleasure, He says to them &#8220;It is My good pleasure that has caused you to enter my abode! and caused you to attain my ennoblement! So ask of me! So they ask of him until their desires are fulfilled. Then he opens up for them at that point what no eye has seen or ear has heard, and has not occurred to the heart of any human being (this will continue) until the time that people turn away after jumu&#8217;ah. Then the Lord &#8211; Blessed and exalted be he &#8211; ascends over his Kursee and the prophets and the martyrs ascend with him) then the narrator mentions) I think he said: &#8220;And the Inhabitants (of Jannah) will return to their abodes which are made of unbroken pure white pearl having no taint or (made of) red ruby or green emerald. Their rooms and doors are made from it, its (Jannah) rivers flow within it continuously and its fruits hang low, they have within it their spouses and their servants. And they have no desire for anything more than they do the day of Jumu&#8217;ah, that they may increace in his ennoblement and that they may increase in looking at his face &#8211; Blessed and exalted be he &#8211; and for that reason it is called the day of &#8216;Mazeed&#8217; (The Increase)<\/b><\/em><\/p>\n<p>(Collected by Al Bazaar in Kashful Astaar (1\/254) and At Tabaraani in Al Awsat (2\/314) Abu Nu&#8217;aym in &#8216;Siffatul Jannah&#8217; (1\/499) and Imaamul Aajurry in &#8216;Ash Sharee&#8217;ah (1\/254) and declared &#8216;Hasan Li Ghairihi&#8217; in &#8216;Saheeh targheeb&#8217; (3761)<\/p>\n<p>A tremendous hadeeth that speaks of a tremendous gathering on a great day! As mentioned earlier this hadeeth is mentioned alongside another version of the hadeeth in the book An Nihaayah of Ibn Katheer. The second version mentions that the seats of the martyrs and the truthful have rubies and emeralds upon them and it also mentions that the friday is the day that Allah created Adam and qiyaamah will be established upon it (this no doubt occurs in an authentic narration in Muslim that establishes that).<\/p>\n<p>This second version of the hadeeth is collected by Imaamush shaafi&#8217;ee in his musnad with A very weak chain of narration. In its chain of narration are two problematic narrators, 1. <em>Ibraheem ibn Muhammad<\/em> who is declared &#8216;Matrook&#8217; (Abandoned by the scholars of Hadeeth) 2. <em>Musaa ibn Ubaida Ar Rabdhee<\/em> who was declared &#8216;<em>Dhaeef<\/em>&#8216; by the scholars of hadeeth<\/p>\n<p><em><strong>Observations with the translation in the daarus salaam print<\/strong><\/em><\/p>\n<p>There is an issue in the translation of the hadeeth in the English book that should be pointed out and that is that the translator mentions towards the end of the Hadeeth: &#8220;&#8230; then Allah Subhaanahu wa ta&#8217;alaa will acsend <strong><em>onto<\/em><\/strong> his kursee..&#8221; This statement has in it the implication that Allah ascends<em><strong> upon<\/strong><\/em> his kursee and not <em><strong>above<\/strong><\/em> his kursee which without doubt is an erroneous insinuation. Whether the translator intended that or not, due care and attention should be exercised in translating the likes of these ahaadeeth since this type of mistake has aqeedah related implications. Secondly he quoted the hadeeth upon the authority of Umair from Anas, while in actuality the Hadeeth was related by Ubaidullah Ibn Umair Thirdly there are a few places in the translation where parts of the hadeeth are missing or the translator writes (&#8230;) which I presume he does to indicate he didn&#8217;t understand the words or the context in that segment of the hadeeth. These dots are usually used when there are parts missing from original manuscripts and are used usually to indicate &#8216;bayaadh&#8217; or parts of an original manuscript that is unreadable or blank. Thus it would have been more befitting for the translator to mention that he didn&#8217;t understand some words here or something to that effect rather than leaving the reader with the impression that something was missing from the hadeeth. In any case may Allah bless the brother that turned my attention to this tremendous narration and our great scholars of hadeeth who have serviced the sunnah of the messenger of Allah -Sallallahu alaihi was Sallam<\/p>\n<p>Wallahu A&#8217;lam Abu Hakeem Bilaal Ibn Ahmad Davis<\/p>\n<p>Www.twitter.com\/abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article explores a beautiful Hadith describing the Day of Mazeed (Increase) &#8211; a special Friday in Jannah (Paradise) where believers receive blessings and see Allah. It also discusses the authenticity of the Hadith and translation considerations.<\/p>\n","protected":false},"author":1,"featured_media":9022,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,11,13],"tags":[],"class_list":["post-352","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-hadeeth","category-miscellaneous"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2011\/12\/The-Day-of-Mazeed-Increase.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/352","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=352"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/352\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9022"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=352"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}