{"id":3591,"date":"2019-11-09T18:00:32","date_gmt":"2019-11-09T18:00:32","guid":{"rendered":"http:\/\/ah-sp.com\/?p=3356"},"modified":"2024-07-09T00:34:57","modified_gmt":"2024-07-09T00:34:57","slug":"responding-to-10-common-justifications-for-celebrating-the-prophets-birthday-mawlid","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/responding-to-10-common-justifications-for-celebrating-the-prophets-birthday-mawlid\/","title":{"rendered":"Responding to 10 Common Justifications for Celebrating the Prophet&#8217;s Birthday (Mawlid)"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/3591?action=genpdf&amp;id=3591\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p><u>10 Popular Doubts used to justify celebrating The birthday of The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; (Eid Mawlidun Nabi)<\/u><\/p>\n<p style=\"text-align: right;\">الحمد لله رب العالمين، والصلاة والسلام على نبينا محمد، وعلى آله وصحبه أجمعين.<\/p>\n<p style=\"text-align: right;\">أما بعد:<\/p>\n<p>With the advent of the yearly celebration of the birthday of the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; Muhammad, in this brief article we clarify the correct Islamic position concerning this practice, namely the fact it is not a legislated practice in Islam. It was not practiced by the first three noble generations of the Muslim at all. Rather it was innovated in the 4<sup>th<\/sup> century by the Fātimids who were known as the Ubaidiyūn and they were Bātiniyah Ismā&#8217;iliyah Shia, and not people of Sunnah. They not only innovated the celebration of the mawlid of the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam -, they also innovated alongside it, the celebration of the mawlid of Fātimah, Ali, Hasan, and Hussain – Radhiyallahu &#8216;Anhum. In its practice, is resemblance of the people of the book in celebrating the birth of Jesus, a practice that was not carried out by the disciples of Jesus. Thus here we present, 10 popular arguments used by those who carry the practice out, and brief responses to their arguments.<\/p>\n<p>Wa Billahit Tawfīq.<\/p>\n<ol>\n<li>&#8220;The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211;  used to fast on Mondays, when asked why he said: &#8220;<strong>That was the day I was born upon, and it was the day revelation (first) came down to me&#8221; {Muslim:1162 upon the authority of Abu Qatadah}<\/strong>…thus he celebrated the day he was born!<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: We do not reject the desirable nature of fasting on Mondays and its virtue, similarly fasting on Thursdays but we say, firstly, that the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; performed this throughout the year, every Monday and Thursday, and it goes without saying, that his day of birth was not <em>every<\/em> Monday of the year. Secondly, The Messenger and his companions performed this as an act of worship not celebration. Thirdly, this, in actuality, an evidence against you, since the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; prohibited that one should fast on the day of Eid! A clear proof that this is not an eid for the Muslims! If we were truly following them, we would fast as they did!.<\/p>\n<ol start=\"2\">\n<li>Our celebration of Eid Milādun Nabi shows our love for Allah and his Messenger!<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: Allah has responded to this claim in one verse of the Qur&#8217;ān:<\/p>\n<p style=\"text-align: right;\">قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ<\/p>\n<p>&#8220;<strong>Say (O Muhammad SAW to mankind): &#8220;If you (really) love Allah then follow me, Allah will love you and forgive you of your sins. And Allah is Oft-Forgiving, Most Merciful<\/strong>.&#8221; {Surah Āli &#8216;Imrān vs 31}<\/p>\n<p>So we ask you, do you love him more than his own companions? Some of them knowing and loving him even before he became a Messenger? Do you love him more than Abu Bakr, Umar, Uthmān and Ali? If they did it, we would follow them, but if they did not (and they did not) then what is sufficient for them is sufficient for us!<\/p>\n<ol start=\"3\">\n<li>True! The companions and their successors (The Tābi&#8217;īn) did not celebrate Milādun Nabi, but that was due to the close proximity (in time and locality) they had with him. We were not afforded that opportunity, so this is how we show love and gratitude.<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: Allah has informed us that our success lies in following them and their practice of the religion, and destruction lies in opposing them.<\/p>\n<p>Allah Says:<\/p>\n<p style=\"text-align: right;\">وَمَن يُشَاقِقِ الرَّسُولَ مِن بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّىٰ وَنُصْلِهِ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا<\/p>\n<p>&#8220;<strong>And whoever contradicts and opposes the Messenger (Muhammad SAW) after the right path has been shown clearly to him, and follows other than the believers&#8217; way. We shall keep him in the path he has chosen, and burn him in Hell &#8211; what an evil destination<\/strong>&#8221; {Nisaa:115}<\/p>\n<p>So once again, if they did it we do it, if they didn’t we don’t!<\/p>\n<ol start=\"4\">\n<li>Millions of Muslims practice it! So are they all wrong and you few are right!<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: Truth is not known or recognized due to the numbers of people that practice it. If that were the case Hindus and Christians would be upon the Haq! Allah has never praised majorities in the Qur&#8217;ān, rather majorities have been dispraised in the Qur&#8217;ān!<\/p>\n<p>Allah said:<\/p>\n<p style=\"text-align: right;\">وَإِن تُطِعْ أَكْثَرَ مَن فِي الْأَرْضِ يُضِلُّوكَ عَن سَبِيلِ اللَّهِ ۚ إِن يَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ<\/p>\n<p>&#8220;<strong>And if you obey <u>most<\/u> of those on earth, they will mislead you far away from Allah&#8217;s Path<\/strong> &#8220;{An&#8217;aam:116}<\/p>\n<p>and he said:<\/p>\n<p style=\"text-align: right;\">وَمَا أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ<\/p>\n<p>&#8220;<strong>And <u>most<\/u> of mankind will not believe even if you desire it eagerly<\/strong>&#8221; {Yusuf:103}<\/p>\n<p>and Allah has said:<\/p>\n<p style=\"text-align: right;\">وَإِنَّ كَثِيرًا مِّنَ الْخُلَطَاءِ لَيَبْغِي بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَّا هُمْ ۗ<\/p>\n<p>&#8220;<strong>And, verily, <u>many<\/u> partners oppress one another, except those who believe and do righteous good deeds, and they are few<\/strong>.&#8221;{Saad:24}<\/p>\n<ol start=\"5\">\n<li>Blessings must be thanked! When The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; came to Madinah he found the Jews fasting the day of &#8216; Āshūrā, he asked <strong><em>what is this day you are fasting<\/em><\/strong>? They responded: &#8220;<em>This is the day Allah saved Mūsā and his people and drowned pharaoh and his people, so Mūsā gave thanks by fasting and thus we too fast<\/em>&#8221; so The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; said: &#8220;<strong>We have more right to Mūsā than you<\/strong>&#8221; so he fasted it and commanded that it should be fasted {Bukhāri: 1189 Muslim: 3397}. The birth of The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; is from the greatest of blessings upon us, therefore we give thanks and celebrate this blessing.<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: It is True that blessings are to be thanked, and truly the greatest blessing upon this Ummah is the <strong><u>sending<\/u><\/strong> of the Messenger of Allah &#8211; Sallallahu Alaihi Was Salam as a Messenger, not only the fact that he was born. Thus we see the Qur&#8217;ān speaks of, and stresses, the sending of the Messenger and mentions nothing of his birth!<\/p>\n<p>Allah says:<\/p>\n<p style=\"text-align: right;\">لَقَدْ مَنَّ اللَّهُ عَلَى الْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولًا مِّنْ أَنفُسِهِمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِن كَانُوا مِن قَبْلُ لَفِي ضَلَالٍ مُّبِينٍ<\/p>\n<p>&#8220;<strong>Indeed Allah conferred a great favour on the believers when He <u>sent<\/u> among them a Messenger (Muhammad) from among themselves, reciting unto them His Verses (the Qur&#8217;ān), and purifying them (from sins by their following him), and instructing them (in) the Book (the Qur&#8217;ān) and Al-Hikmah [the wisdom and the Sunnah of the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; SAW (i.e. his legal ways, statements, acts of worship, etc.)], while before that they had been in manifest error<\/strong>. {Imran 164}<\/p>\n<p>and he also says:<\/p>\n<p style=\"text-align: right;\">هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِن كَانُوا مِن قَبْلُ لَفِي ضَلَالٍ مُّبِينٍ<\/p>\n<p>&#8220;<strong>It is He who has <u>sent<\/u> among the unlettered a Messenger from themselves reciting to them His verses and purifying them and teaching them the Book and wisdom &#8211; although they were before in clear error&#8221; <\/strong>{Jumu&#8217;ah 2}<\/p>\n<p>As was the case with all of the previous Prophets, their being sent to their nations was the blessing upon that nation.<\/p>\n<p style=\"text-align: right;\">كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِين<\/p>\n<p>&#8220;<strong>Mankind were one community and Allah <u>sent<\/u> Prophets with glad tidings and warnings&#8221;<\/strong> {baqarah 213}<\/p>\n<p>Allah – The Most high says:<\/p>\n<p style=\"text-align: right;\">وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولًا أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ<\/p>\n<p>&#8220;<strong>And We certainly <u>sent<\/u> into every nation a messenger, [saying], &#8220;Worship Allah and avoid Taghūt&#8221; <\/strong>{An Nahl 36}<\/p>\n<p>Thus if this celebration were prescribed and permissible it would have been for his being sent as a prophet over and above his birth! Yet it is not prescribed for any of the two.<\/p>\n<ol start=\"6\">\n<li>You people say it is a bid&#8217;ah as though all bid&#8217;ah is bad! It may be a bid&#8217;ah But it is a bid&#8217;ah hasanah (A good bid&#8217;ah). The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; said: <strong>&#8220;Whosoever brings about in Islam a good Sunnah then he has the reward for it, and the reward of all who act upon it without their reward being diminished in any way<\/strong>&#8221; {Muslim: 1017}<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: There are no bid&#8217;ah hasanah! The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; said &#8220;<strong>EVERY bid&#8217;ah is misguidance<\/strong>..&#8221; The Intent behind the hadeeth is whoever practices an established Sunnah that had been left, or neglected, he revives it, and due to him this Sunnah is practiced. It does not refer to there being innovations that are considered good! The clearest proof of this, is present in the hadeeth itself! The reason The Messenger -Sallallahu Alaihi was Salam- made the statement, was because some poor people had come to the Messenger of Allah -Sallallahu Alaihi was Salam- and he requested from his companions to give charity to them. Some were slow to do so, and so one of the companions seeing this, hastened and gave charity. The rest of them then hastened to give charity, and so The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; said: <strong>&#8220;Whosoever brings about in Islam a good Sunnah..<\/strong>&#8221; Thus the question that has to be asked is, was the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; speaking of innovation or a sunnah that was already established? Of course giving in Charity was and is, an established Sunnah, therefore there is no evidence in this hadeeth for the statement.<\/p>\n<ol start=\"7\">\n<li>People have brought about actions that have been accepted by the Muslims for generations. For example Umar gathered the people in congregation for salātul Tarāwīh and he made three pronouncements of divorce made in one sitting be considered as three, while that was not the case at the time of The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam -. Likewise Uthmān gather the qur&#8217;ān together in one book, this was not done before. This is proof that not everything new thing must be rejected, if it is a good thing.<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: As far as the Tarāwīh issue, then the response to this is similar to point 6, it was something practiced by The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211;  but he left it on the third night, after practicing it for two nights, fearing it would be made compulsory upon the ummah. Umar only revived the practice. As far as the Talaq issue and the gathering of the Qur&#8217;ān then this falls under &#8220;The Sunnah of the Rightly Guided Caliphs that The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; commanded us to hold onto with our molar teeth in his statement<\/p>\n<p><strong>&#8220;Cling to my Sunnah and the Sunnah of the rightly guided caliphs, cling to it and hold onto it with your molar teeth..&#8221; {Abu Dawood: 4607 Declared Sahīh By Shaikh Albāni in Sahīhul Jāmi 2549}<\/strong><\/p>\n<p>Therefore this does not fall under blameworthy innovation especially since there was an established overall good in that which they legislated.<\/p>\n<ol start=\"8\">\n<li>The word كل (every) does not always mean all. Therefore there are some exceptions to the rule like mawlid<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: The origin with the words of Allah and his messenger is that words are held upon their apparent meanings except if there is textual evidence indicating otherwise. Thus كل means &#8216;every&#8217; wherever it occurs, unless there is clear textual evidence indicating the contrary. This does not exist here. In fact, the statement has a strong precursor of warning, emphasizing the fact that what is intended is <em>every<\/em> and <em>all<\/em> newly invented affairs in the religion. The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; said: &#8220;<strong>Beware of newly invented affairs, for indeed <u>ALL<\/u> newly invented matters are innovation and all innovations are in the fire<\/strong>&#8220;. So where is the evidence that &#8216;ALL&#8217; is not absolute?<\/p>\n<ol start=\"9\">\n<li>Abu Lahab was seen in a dream. It was said to him what is your state? He said: &#8220;<em>I am in the hellfire, but my punishment is lightened every Monday night due to my happiness with the birth of The Messenger, and due to me freeing Thuwaibah (the wet nurse of the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam)<\/em> &#8220;If this is the case with one of the worst of the kufār that ever lived, then what about when the believer rejoices his happiness at the birth of the Prophet &#8211; Sallallahu alaihi was Salam!<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: The authentic version of the hadeeth occurs in Bukhāri (5201) The hadīth mentions that Abu Lahab was seen in a dream by one of his relatives, so he said to him what is your state? He replied &#8220;<em>I am in a wretched state but I am (occasionally) given something to drink through a hole like this (and he pointed to a small crevice between his thumb and index finger) because of my freeing Thuwaibah<\/em>&#8220;. Thus the authentic version of the hadeeth has no mention of his &#8216;Happiness with the birth of The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam. Secondly it doesn’t occur in any of the sound sources of hadīth. Thirdly even if it were authentic (for argument sake), then the narrator of the dream is unknown, we do not know if he or she was Muslim or an unbeliever. Fourthly, apart from the dreams of The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; or the dreams of individuals that The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211;  affirmed were true dreams (Like the dream of Abdullah Ibn Zaid when he heard the adhān before its legislation and the Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam &#8211; affirmed it was a true dream) peoples dreams are not a source of legislation!<\/p>\n<ol start=\"10\">\n<li>Do you prevent the remembrance of Allah and reciting the life of The Prophet &#8211; Sallallahu &#8216;Alaihi Was Salam?!<\/li>\n<\/ol>\n<p><strong><u>The Response<\/u><\/strong>: No we do not! But we are against legislating a religious practice that is carried out on a particular day without evidence specifying its legislation.<\/p>\n<p>Wa Sallallahu &#8216;Alaa Nabiyinaa Muhammad<\/p>\n<p>@AbuHakeemBilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Discover the Islamic stance on celebrating the Prophet Muhammad&#8217;s birthday. This article addresses 10 popular arguments in favor of Eid Milad-un-Nabi and provides evidence-based responses highlighting why it is not a prescribed practice in Islam.<\/p>\n","protected":false},"author":1,"featured_media":8787,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-3591","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2019\/11\/10-Common-Justifications-for-Celebrating-the-Prophets-Birthday-Eid-Milad-un-Nabi-and-Their-Responses.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/3591","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=3591"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/3591\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8787"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=3591"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=3591"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=3591"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}