{"id":607,"date":"2012-04-23T22:07:39","date_gmt":"2012-04-23T22:07:39","guid":{"rendered":"http:\/\/ah-sp.com\/?p=607"},"modified":"2024-07-08T10:02:43","modified_gmt":"2024-07-08T10:02:43","slug":"st-george-the-dragon-islamic-parallels-food-for-thought","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/st-george-the-dragon-islamic-parallels-food-for-thought\/","title":{"rendered":"St. George &amp; the Dragon: Islamic Parallels &amp; Food for Thought"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/607?action=genpdf&amp;id=607\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salaatu Was Salaamu &#8216;Alaa Rasoolillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>Much Historical scepticism exists concerning the origins of the &#8216;legend&#8217; of George and the Dragon.&nbsp; Though every British citizen, I&#8217;m sure, is well acquainted with the story, since he is considered the &#8216;Patron Saint of England&#8217;<\/p>\n<p>Many though, grew with the belief that Saint George was an Englishman, (Possibly a king&#8217;s Knight) who was responsible for slaying a (Probably English) dragon (as &#8216;legend&#8217; tells) and this is particularly re-iterated on the likes of today, St Georges day .<\/p>\n<p>But anyone who looks into what has been mentioned concerning the story by western historians will find a slightly different narrative.<\/p>\n<p>In actuality many historians hold that he was an Arab (possibly from Libya or Palestine) while the majority hold that he was Turkish in origin, (which is ironic since it is his emblem (white flag with red cross) we see painted on the faces of the EDL during their marches)<\/p>\n<p>There are some details western historians often mention concerning him:<\/p>\n<ol>\n<li>That he was born in Turkey (Though some hold he was from north Africa)<\/li>\n<li>That his parents were Christian<\/li>\n<li>That he lived in the 3rd century C.E<\/li>\n<li>That he lived for a period in Palestine<\/li>\n<li>That he grew to become a soldier of the Roman Empire<\/li>\n<li>That he met, befriended, and stayed with a &#8216;Hermit&#8217; in Libya<\/li>\n<li>That he became a believer<\/li>\n<li>That he slayed a Beast (said to be a dragon) that the hermit informed him had been ravaging the country<\/li>\n<li>That prior to slaying the beast he proclaimed that the people of the township should become believers (and some mention be &#8216;baptised&#8217;), after the slaying it is claimed that 15,000 men became believers and were baptised<\/li>\n<li>That he protested against persecution of Believers<\/li>\n<li>That he was imprisoned<\/li>\n<li>That he was tortured by the Ruler but didn&#8217;t abandon his belief<\/li>\n<li>That he was ultimately beheaded in Palestine.<\/li>\n<\/ol>\n<p>Naturally as Muslims we are unable to confirm the authenticity of the story but it does closely resembles an authentic narration and story the Messenger of Allah &#8211; Sallallahu Alahi Was Salam informed us of:<\/p>\n<p><strong>The story of the Boy and the King<\/strong><\/p>\n<p>Narrated Suhaib [radhiyAllahu &#8216;anhu]: (Who said) that Allah&#8217;s Messenger [sallallahu alaihi was sallam] said:<\/p>\n<p>&#8220;<em>Among the people before you, there was a king who had a sorcerer. When the sorcerer became old, he said to the king: &#8216;I have now become an old man, get me a boy so that I may teach him sorcery.&#8217; So the king sent him a boy to teach him sorcery. Whenever the boy proceeded to the sorcerer, he sat with a monk who was on the way, he would listen to his speech and it would impress him. So when he went to the sorcerer, he passed by the monk and sat there with him. Upon arriving at the sorcerer, he would beat him (for his lateness). So the boy complained about that to the monk. The monk said to him: Whenever you are afraid of the sorcerer, say to him: &#8216;My family kept me busy&#8217;; and whenever you are afraid of your people, say to them: &#8216;The sorcerer kept me busy.&#8217; So the boy carried on like that (for a period). &#8220;There came (on the main road) a huge creature (animal), and the people were unable to pass by. The boy said: &#8216;Today I will know whether the sorcerer is better or the monk&#8217;. So he took a stone and said: &#8216;O Allah! If the affair of the monk is more beloved to you&nbsp; than that of the sorcerer, then kill this creature so that the people can cross (the road).&#8217; Then he struck (it) with the stone, and it was killed and the people passed (the road). The boy came to the monk and informed him about it. The monk said to him: &#8216;O my son! Today you are better than I; you have achieved what I see! And you will be put to trial. And if you are put to trial, do not inform (them) about me.&#8217; The boy used to treat the people suffering from born-blindness, leprosy, and other diseases.<\/em><\/p>\n<p><em>A blind courtier of the king heard about the boy. He came and brought a number of gifts for the boy and said: &#8216;All these gifts are for you on condition that you cure me.&#8217; The boy said: &#8216;I do not cure anybody; it is only Allah (Alone) Who cures (people). So if you believe in Allah, and invoke Allah, He will cure you.&#8217; He then believed in Allah, and Allah cured him. Later the courtier came to the king, and sat at the place where he used to sit before. The king asked him: &#8216;Who has given you your sight back?&#8217; The courtier replied: &#8216;My Lord (Allah)!&#8217; The king said: &#8216;Have you got another lord than I?&#8217; The courtier said: &#8216;My Lord and your Lord is Allah!&#8217; The king got hold of him and continued to torture him till he informed him about the boy. So the boy was brought. The king said to the boy: &#8216;O boy! Has your (knowledge of) sorcery reached to the extent that you cure those born-blinds, and the leper, and do such and such?&#8217; The boy replied: &#8216;I do not cure anybody; it is only Allah (Alone) Who cures&#8217;. Then the king got hold of him, and continued to torture him till he informed him about the monk. And the monk was brought, and it was said to him: &#8216;Give up your religion (turn apostate)!&#8217; The monk refused to turn apostate. Then the king ordered a saw (to be brought), and it was put in the middle of his scalp and was sawn till he fell, cut in two pieces. Then that courtier was brought, and it was said to him: &#8216;Give up your religion (turn apostate)!&#8217; The courtier refused to turn apostate. So the saw was put in the middle of his scalp, and was sawn till he fell, cut in two pieces. Then the boy was brought, and it was said to him: &#8216;Give up your religion (turn apostate)!&#8217; The boy refused to turn apostate. So the king ordered some of his courtiers to take the boy to such and such a mountain saying, &#8216;Then ascend up the mountain with him till you reach its top, and see if he turns apostate (from his religion, well and good), otherwise throw him down from its top.&#8217;<\/em><\/p>\n<p><em>They took him, ascended up the mountain, and the boy said: &#8216;O Allah! Save me from them by whatsoever You wish!&#8217; So the mountain shook and all of them fell down, and the boy came walking to the king. The king asked him: &#8216;What happened with those who accompanied you?&#8217; The boy said: &#8216;Allah has saved me from them.&#8217; The king then ordered some of his courtiers to take the boy on board a boat into the middle of the sea, saying, &#8216;Then if he turns apostate (from his religion, well and good), otherwise cast him into the sea.&#8217; So they took him, and he said: &#8216;O Allah! Save me from them by whatsoever You wish.&#8217; So the boat capsized, and (all the accompanying courtiers) were drowned. The boy then came walking to the king. The king said: &#8216;What happened with those who accompanied you?&#8217; The boy replied: &#8216;Allah saved me from them&#8217;, and he further said to the king: &#8216;You cannot kill me till you do what I command!&#8217; The king said: &#8216;What is that (command of yours)?&#8217; The boy said: &#8216;Gather all the people in an upland place, and fasten me to the trunk (of a tree); then take an arrow from my quiver and fix it in the bow, and say: In the Name of Allâh, the Lord of the boy, and shoot (me). If you do that, you will kill me.&#8217; So the king gathered the people in an upland place, and fastened the boy to the trunk, took an arrow from his quiver, fixed it in the bow, and said: &#8216;In the Name of Allah, the Lord of the boy&#8217;, and shot the arrow. The arrow hit the temporal region of the skull of the boy, and the boy put his hand over the temporal region of his skull at the point where the arrow hit, and then died. The people proclaimed: &#8216;We have believed in the Lord of the boy! We have believed in the Lord of the boy! We have believed in the Lord of the boy!&#8217; The king came, and it was said to him: &#8216;That is the thing which you were afraid of. By Allah! The thing which you were afraid of, has fallen upon you, the people have believed (in Allah).&#8217; So he ordered (deep) ditches to be dug at the entrances of the roads, and it was done, then fire was kindled in those ditches, and the king ordered that whoever did not turn apostate (from his religion) be cast into the ditches, and it was done. Then there came a woman with her baby. She was close to retreating from the ditch when the baby said (speaking to its mother): &#8216;O Mother! Be patient, For indeed you are upon the Truth<\/em>.&#8221;<\/p>\n<p>(<strong>Saheeh Muslim, Hadeeth No. 7703<\/strong>)<\/p>\n<p>It is (the authentic narration that is) without doubt a fine story and example of firm faith and Imaan, honour, bravery and gallantry and da&#8217;wah to tawheed.<\/p>\n<p>There are indeed many resemblant issues in this authentic hadeeth and that which is mentioned concerning George and the Dragon (and issues that differ with the popular narrative), the question that arises is, was it this the Messenger &#8211; Sallallahu alaihi was Salam was speaking about?, it is not possible for us to say, but in it there certainly is food for thought.<\/p>\n<p>Wallahu A&#8217;lam<\/p>\n<p>Was Sallallahu Alaa Nabiyinaa Muhammad<\/p>\n<p><a href=\"http:\/\/www.twitter.com\/abuhakeembilal\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">www.twitter.com\/abuhakeembilal<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>While the legend of St. George is familiar, explore a similar story from an Islamic perspective. Discover a Hadith about a boy confronting a tyrannical king, testing faith and courage. Food for thought for believers.<\/p>\n","protected":false},"author":1,"featured_media":8973,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-607","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2012\/04\/St.-George-the-Dragon.jpg","jetpack_sharing_enabled":false,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/607","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=607"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/607\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8973"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=607"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=607"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=607"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}