{"id":753,"date":"2012-07-31T14:31:25","date_gmt":"2012-07-31T13:31:25","guid":{"rendered":"http:\/\/ah-sp.com\/?p=753"},"modified":"2024-07-08T08:41:07","modified_gmt":"2024-07-08T08:41:07","slug":"shaikh-rabees-words-will-abu-usaama-and-his-followers-reflect","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/shaikh-rabees-words-will-abu-usaama-and-his-followers-reflect\/","title":{"rendered":"Shaikh Rabee&#8217;s Words: Will Abu Usaama and His Followers Reflect?"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/753?action=genpdf&amp;id=753\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah was Salaatu Was Salaamu &#8216;Alaa Rasoolillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>One of our noble brothers recently posted this introduction to the book &#8216;Fasaad Bayaanil Mi&#8217;yaar&#8217; of the Waalid, our Shaikh and teacher, Rabee&#8217; Ibnu Haadi Al Madkhalee &#8211; Hafidhahullah. It discusses quite aptly, some of the false and&nbsp;deceptive&nbsp;methods employed&nbsp;by the likes of Abu Usaama Adhahabee and those who share his orientation, whose war isn&#8217;t, in actuality against &#8216;Salafi publications&#8217; per se,&nbsp;but rather the Salafi methodology upheld by the scholars of this manhaj in our time. Since &#8216;Salafi Publications&#8217; is a vehicle disseminating that methodology in the English language, it feels the brunt of their attacks, their &#8216;true&#8217; goal though, be clear,&nbsp;is other than Salafi Publications.<\/p>\n<p>Thus I mention&nbsp;his words here for reflection, but is there any that will take admonition?<\/p>\n<p><span style=\"text-decoration:underline;\"><strong>Shaikh Rabee Bin Haadee Al-Madkhalee<\/strong> <\/span>(may Allaah preserve him) stated:<\/p>\n<p>&#8220;<em>Indeed, from the severest of afflictions and trials upon Islaam and the Muslims in this era, is the appearance of a group claiming to be upon the methodology of Ahlus Sunnah Wal-Jamaa-ah, but unfortunately this group does not act except in opposition to this methodology and its people, openly at times and behind veils at other times.<\/em><\/p>\n<p><em>And indeed this group has placed a heavy burden upon its (own)&nbsp;shoulders, and that is its defence of the people of innovation and misguidance. They author books in this regard and decorate&nbsp;articles due to it, and they spread&nbsp;their defence&nbsp;around the world under the&nbsp;banner of &#8216;justice and equity&#8217; or (under) the methodology of Al&nbsp;Muwaazanaat (a methodology that revolves around the belief that justice is in mentioning the good characteristics of the one being refuted alongside the refutation, which is a methodology&nbsp;in opposition to the true methodology of Ahlus Sunnah).<\/em><\/p>\n<p><em>They exceed the limits in the affair of Fiqul Waaqi (knowledge of current affairs) and speak ill of the scholars of the Salafi Methodology as a result of that;&nbsp;In fact&nbsp;they&nbsp;belittle and discredit&nbsp;the methodology of the scholars due to&nbsp;this, and (further) increase in ill speech against the Salafi Methodology and its people.&nbsp;Yet one sees no&nbsp;effect of their&nbsp;methodology of &#8216;justice and equity&#8217;&nbsp;when they debate&nbsp;the people of the Salafi methodology!. Nor (is it seen)&nbsp;in their praises and exaltations for the people of innovation (i.e they are not just or balanced in that regard).<\/em><\/p>\n<p><em>Additionally, although one sees them&nbsp;concealing themselves&nbsp;under the banner of the&nbsp; &#8216;Salafi Methodology&#8217;, you will not see them giving it any importance, except with respect to what they utilize to deceive those who are deceived by them and their&nbsp;(false) garment, in order that they may bring them over&nbsp;to their corrupt partisanship organization, and&nbsp;so as&nbsp;to kill off their love for the (true)&nbsp;Salafi Methodology, the call to it, defence of it, traversing on it upon the methodology of the pious predecessors with the (correct) love and hate (for the sake of Allaah), and warning against the people of innovation.<\/em><\/p>\n<p><em>So they divert a&nbsp;generation of&nbsp;individuals&nbsp;from the true methodology and having true allegiance to&nbsp;it; and they&nbsp;(direct them) towards&nbsp;a&nbsp;&#8216;heated&#8217; allegiance to the people of innovation and defence of them and&nbsp;their innovations and falsehoods. Or they&nbsp;trivialise the affair of their&nbsp;innovations to the extent that it leads them to the station of the extreme murji-a (i.e those who held that sinful actions have no effect upon Imaan) with regards to how they view the major innovations and these great oppositions to the true religion of Allaah.<\/em><\/p>\n<p><em>Meanwhile, on the opposite end of the spectrum, their&nbsp;hatred&nbsp;for&nbsp;the carriers of the Sunnah and the (true) Salafi Methodology has led them to blow their minor errors<em> out of proportion<\/em>, errors the likes of which a Sunni or (even) an innovator amongst those who ascribe themselves to Islaam should not&nbsp;be criticised for. They present these mistakes as mighty affairs of blunder and destruction;&nbsp;in fact&nbsp;they (go as far as to)&nbsp;make the virtues and merits of Ahlus Sunnah (i.e such as their&nbsp;praiseworthy position regarding the people of innovation)&nbsp;to be repugnant and disdainful. Not to mention&nbsp;the many&nbsp;fabrications they accuse them (the people of sunnah) of. <\/em><\/p>\n<p><em>So they are, due to these lowly, despicable acts&nbsp;perpetrated by them, from the worst and most severe of the people waging war against the Salafi Methodology and its people, the severest in preventing and blocking people from them both (i.e the salafi methodology and its people); and&nbsp;the most intense in their defence of the groups of innovation and fitan, their claimants and their&nbsp;methodologies. And they have authorships in this regard, and from them are the many authorships of Shaikh Abdur-Rahmaan Abdul Khaaliq who carries the responsibility&nbsp;for this destructive orientation<\/em>&#8230;&#8221;<\/p>\n<p>And we ask Allah the most high to cause the &#8216;Just Aaqil&#8217; (person of intelligence) to reflect upon this!<\/p>\n<p>Wallahu a&#8217;lam<\/p>\n<p>Abu Hakeem<\/p>\n<p><a href=\"http:\/\/www.twitter.com\/abuhakeembilal\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">www.twitter.com\/abuhakeembilal<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A prominent scholar raises concerns about attacks on the Salafi methodology. Is there a misrepresentation of Salafi principles? Learn more about the accusations and the scholar&#8217;s call for reflection.<\/p>\n","protected":false},"author":1,"featured_media":8927,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4,7,12,18,23],"tags":[],"class_list":["post-753","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-bidah","category-extremism","category-manhaj","category-the-scholars","category-youth-related"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2012\/07\/Shaikh-Rabees-Words.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/753","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=753"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/753\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8927"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=753"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=753"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=753"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}