{"id":860,"date":"2013-03-15T18:59:28","date_gmt":"2013-03-15T18:59:28","guid":{"rendered":"http:\/\/ah-sp.com\/?p=860"},"modified":"2024-07-04T05:33:34","modified_gmt":"2024-07-04T05:33:34","slug":"hold-onto-the-book-with-firm-strength-lessons-from-the-command-to-prophet-yahyaa","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/hold-onto-the-book-with-firm-strength-lessons-from-the-command-to-prophet-yahyaa\/","title":{"rendered":"&#8220;Hold Onto the Book with Firm Strength&#8221;: Lessons from the Command to Prophet Yahyaa"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/860?action=genpdf&amp;id=860\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>“Oh Yahyaa! Hold onto the book with firm strength (i.e. Hold fast to it)” (Suratul Maryam Vs 13)<\/p>\n<p>Bismillahi Wal Hamdullillah Was salaatu Was Salaamu ‘Alaa Rasoolillahi<\/p>\n<p>‘Ammaa Ba’d:<\/p>\n<p>There is no doubt that success lies in following the book and the sunnah, clinging to the two of them and holding fast to them both. And this was Allah’s command to the prophets and the Messengers.<\/p>\n<p>Allah The most high says addressing the prophet of Allah Yahyaa &#8211; &#8216;Alahis Salaam:<\/p>\n<p>“Oh yahyaa! &nbsp;Hold on to the book with strength, and we gave him ‘Hukm’ while yet a child”<\/p>\n<p>Imaam At Tabari – Rahimahullah mentions in his tafseer (18\/155) quoting the statement of Ibn Zaid &#8211; Rahimahullah:<\/p>\n<p>“(The statement of Allah) ‘..with strength’&nbsp; “This is that he carries out what Allah has commanded him and avoids his prohibitions”<\/p>\n<p>Imaam Baghawi states in his tafseer (3\/190):<\/p>\n<p>(Speaking concerning the statement of Allah:<\/p>\n<p>“And we gave him ‘Hukm’ while yet a child”)<\/p>\n<p>‘It has been said (i.e. by the scholars of tafseer) that which is intended by ‘Hukm’ is understanding”<\/p>\n<p>He previously mentioned that the command for Yahyaa &#8211; &#8216;Alaihis Salaam to hold onto the book was a command to hold onto the Taurah<\/p>\n<p>Thus Allah praised him for that which he possessed not only of the book (i.e. knowledge of its words) but that he had understanding of that which he possessed from it, then he was further commanded to hold onto it firmly.<\/p>\n<p>Thus that which we understand from the verse is the praiseworthy nature of having knowledge of the book (i.e. memorizing it) and ‘understanding’ that which it contains with ‘correct’ understanding, then clinging to it.<\/p>\n<p>How then would one who observes how Allah raises the mention of the book and those who understand it revile and speak ill of those who carry it and understand it correctly?!<\/p>\n<p>Allah the most high mentions:<\/p>\n<p>“But those among them who are firmly grounded in knowledge and the believers, believe in what has been sent down to you and what was sent down before you,and those who perform the salaah and give zakaah and believe in Allah and the last day. It is they to whom we will give a great reward (Suratun Nisaa Vs 162)<\/p>\n<p>And Allah the most high says:<\/p>\n<p>&#8220;Allah will exalt in degree those who of you believe and those who have been given knowledge&#8221;<\/p>\n<p>This no doubt is one of the deviations that Yahyaa Al Hajoori – May Allah Guide him has fallen into (among many other things) that has caused the recent clarification from our sheikh, the waalid, defender of the Sunnah and its people in our time in truth Shaikh Rabee ibn Haadi Al Madkhali – Hafidhahullah<\/p>\n<p>This &#8211; By Allah &#8211; grieves our hearts<\/p>\n<p>Though in reality this speech of the Shaikh is not new to us, since we have known of the Shaikhs displeasure with that which is taking in Dammaj for a good while, but being the perfect example of a patient Aalim of the Sunnah that he is, he advised and gave more than sufficient time for reflection and rectification but alas to no avail.<\/p>\n<p>When we spoke and expressed that the Mashaikh of Ahlus Sunnah are not pleased with that which is occurring there, and the manner in which the students there are being taught and nurtured to disrespect and dishonor the scholars of the sunnah and their students and that no one is safe from the tongue of Al Hajoori we were dubbed liars, lying upon Shaikh Rabee’ and the other scholars. In fact, i recall my speech was promptly sent to Dammaj for swift analysis, dissection and refutation! Which one of the students of Al Hajoori did not fail to satisfy those infactuated with Al Hajoori and the &#8216;cult-like&#8217; partisanship we have observed over the years. Thus the &#8216;hold no prisoners, take no captives, kill everything in sight&#8217; manner in which they defend the one that dares to speak unfavourably about the &#8216;Imaamuth Thaqalain&#8217; (Imaam and leader of Mankind and the Jinn! – A title the followers of Al Hajoori give to him!), or the &#8216;goings on&#8217; in the camp, is a far cry from the patient perseverance of Shaikhunaa Rabee&#8217; &#8211; Hafidhahullah<\/p>\n<p>But no doubt the Salafi fears not the blame of the blamers in advising with the truth, for the Messenger – Sallallahu Alaihi Was Sallam gave a bequest to Abi dharr – Radhiyallahu anhu to ‘Speak the truth even if it is bitter!’ and that, unfortunately, is exactly how our advise has been taken, with bitter rejection!<\/p>\n<p>On more than one occasion I have known that some their supporters here in the Uk, have secretly recorded me (though they, admittedly, are not so good at secret recordings since I have caught them doing so every time!) possibly with a view to getting my speech sent to the ‘Camp’ for rebuttal.<\/p>\n<p>All of that has never stopped us from advising with the advise of our Mashaikh, not proceeding except upon their wise instruction.<\/p>\n<p>Now that Sheikh Rabee’ &#8211; may Allah preserve him, has publicly made his position clear, (which to my recollection was the only thing many an individual claimed they were waiting for) we ask Allah to make it easy for them to drop this fitnah and take onboard the advice of the people of knowledge who have not remained silent throughout this trial, just as we ask him to make it a means for Al Hajoori and his followers to return from this fitna and to stop splitting the ranks of the people of Sunnah across the globe.<\/p>\n<p>Reminding them of the statement of &nbsp;Abul Aaliyah and Mujaahid from the salaf who both said:<\/p>\n<p>“<em>I do not know which of the two blessing is greater, that Allah guided me to Islaam or that he saved me from following desires<\/em>” (Collected by Ad Daarimi in the muqadima of his sunan and like wise Imaamul Harawee in ‘Dhamul Kalaam (4\/319)<\/p>\n<p>or the statement of &nbsp;Imaam Abu Bakr ibn Abi Iyaash who, when a man asked him who is the Sunni? He responded: “<em>He is the one who when desires are mentioned he doesn’t show partisan fanaticism to any of it<\/em>!”<\/p>\n<p>(Collected by Imaam Al Lilakaa&#8217;ee in &#8216;Sharh Usool &#8216;I&#8217;tiqaad Ahlis Sunnati Wal Jamaa&#8217;ah&#8217; (1\/65)<\/p>\n<p>So the sunni’s concern is being upon the Haq and Salafiyah, he is not one to get emotional for any group, party or individual<\/p>\n<p>The saddest thing is that we see ignoramuses now seeking to explain the speech of the sheikh, ‘he doesn’t mean and he doesn’t intend, and and and’ making ‘tafseer’ of his intent while the Shaikh is alive and breathing and it is possible to return to him for an explanation of his own intent.<\/p>\n<p>We ask Allah to make seeing the haq easy and to unite the hearts of Ahlus Sunnah under our ‘<span style=\"text-decoration:underline;\">Ulamaa<\/span>’ wherever they may be, and Allah&#8217;s aid is sought.<\/p>\n<p>Was Sallallahu ‘ala Nabiyinaa Muhammad Wa ‘Alaa Aalihi Wa Sahbihi Ajma’een<\/p>\n<p>Abu Hakeem<\/p>\n\n\n<p> @abuhakeembilal <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how the story of Prophet Yahya ( عليه السلام) teaches us to hold fast to the scripture while maintaining respect for scholars and avoiding divisions within the Muslim community.<\/p>\n","protected":false},"author":1,"featured_media":8784,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-860","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/03\/Hold-Onto-the-Book-with-Firm-Strength.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/860","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=860"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/860\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8784"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=860"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=860"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=860"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}