{"id":873,"date":"2013-04-03T22:24:40","date_gmt":"2013-04-03T22:24:40","guid":{"rendered":"http:\/\/ah-sp.com\/?p=873"},"modified":"2024-07-03T06:47:25","modified_gmt":"2024-07-03T06:47:25","slug":"a-word-on-easter","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/a-word-on-easter\/","title":{"rendered":"A Word on Easter: A Benefit from Ibn Katheer"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/873?action=genpdf&amp;id=873\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdullillah Was Salaatu Was Salaamu ‘Alaa Rasoolillahi<\/p>\n<p>Ammaa Ba’d:<\/p>\n<p>Since this is the easter season and much is being said about the significance of easter and its claimed origins. It is well known that easter and the customary practices within this season have, in truth, no connection to Jesus the son of Mary, but in fact have paganistic origins (The term &#8216;Easter&#8217; is in actuality a reference to the Persian goddess of fertility &#8216;Ishtar&#8217; who was worshipped at this time of year. The Easter bunny and Easter egg (symbolic of fertility) are likewise paganistic in origin, thus these traditions were &#8216;imported&#8217; into Christianity. We mention here then, a benefit related to the significance of Easter and clarification concerning a misconception.<\/p>\n<p>The Christian narrative suggests that Eesaa had travelled to Jerusalem to celebrate the Passover (which was that which took place prior to the day that Allah saved Moosa and his followers from pharaoh and his army, the day of Aashooraa. The biblical story suggests that it had been decreed that the firstborn sons of the people of Egypt would be killed as a punishment for rejection of Moosaa except the households of the believers, who were commanded to smear lambs blood around their doors which would cause the angel of death to ‘passover’ that household.) The following week he (Jesus) learnt that his time to go was near, thus he had a ‘Last Supper’ with his disciples on a day which is referred to as maunday Thursday and then washed their feet. On Friday he was crucified and then on Sunday, Christians believe, he was raised from the dead and that is celebrated on easter Sunday.<\/p>\n<p>It is established in the book of Allah, that it was not Eesaa who was taken and crucifed in fact it was someone Allah made to resemble him (based upon one of the positions of the scholars of tafseer) and he was taken in his place.<\/p>\n<p>Allah the most high states (concerning the reasons of disbelief of the Jews):<\/p>\n<p>“<strong><em>and because of their saying (in boast) “We killed the Messiah Eesaa, son of Mary the Messenger of Allah, but they didn’t kill him, neither did they crucify him but rather a resemblance was made<\/em><\/strong>..&#8221;<\/p>\n<p>When the Christian version of the story is mentioned many conclude that the incident of the last supper is the same as that mentioned in Suratul Maa’idah Vs 112-115:<\/p>\n<p><i>“<strong>(Remember) when the disciples said: “O Eesaa, Son of Maryam! Can your lord send to us a table spread with food from the heavens? Eesaa said: “Fear Allah if you are indeed believers” They said: “We wish to eat thereof and to satisfy our hearts and know that you have indeed spoken the truth to us and that we may be witnesses thereof. Eesaa son of Maryam said: “Oh Allah Our Lord send us from the heavens a table spread that it may be a feast for us, the first of us and the last of us and a sign from thee and give us sustenance for though art the best of sustainers. Allah said: ‘I am going to send it down unto you, but if any of you disbelieves , then I will punish him with a torment such as I have never inflicted upon anyone among all the aalameen (Mankind and the Jinn)<\/strong><\/i><\/p>\n<p>It should be mentioned that this incident is NOT the same incident as the last supper, as is commonly misunderstood, in fact this incident has NO mention in the bible at all.<\/p>\n<p>Imaam Ibn Katheer mentions in tafseer of the verse:<\/p>\n<p>&#8220;The story of the table spread (descending from the heavens) is not mentioned in the Injeel, it is not known by the christians except by way of the Muslims, and Allah knows best.&#8221;<\/p>\n<p>Imaam Ibn Katheer mentions a number of narrations (much of them unconfirmed) that are linked to this story.<\/p>\n<p>Some of those narrations mention that Eesaa had commanded his followers to fast for thirty days after which they made the request for the table since they were in need of eating and they were for the most part poor and needy.<\/p>\n<p>One narration states that when they made the request Eesaa became upset with them and mentioned the fact that the people of &#8216;Aad were destroyed because they asked their prophet for a sign and due to how they received and responded to the sign Allah sent to them, they earned the anger of Allah and were destroyed.<\/p>\n<p>Some narrations would appear to liken the occurrence to the popular &#8216;feeding of the five thousand&#8217; incident, since some narrations mention four thousand individuals were present while other narrations mention that the meal consisted of fish and bread which is similar to the food mentioned in the feeding of the five thousand incident in the bible, is it a reference to the same occurrance? No doubt there are similarities.<\/p>\n<p>In any case, that which is established, is that the affair of the table descending from the sky is not mentioned in any christian source, as is the case with that which is mentioned in the Qur&#8217;aan concerning the story of the birth of Eesaa and him speaking in the cradle, and other affairs that have no mention in the Bible. This establishes then the falsehood of those who claim that the Messenger ‏‏ (ﷺ)wrote the Qur&#8217;aan after being inspired by some of the people of the book he had sat with, and he then modelled his book upon christian scripture!<\/p>\n<p>Some of the scholars of tafseer held that in fact the table did NOT descend because they say that when Allah said:<\/p>\n<p>&#8220;..<i><strong>but if any of you disbelieves , then I will punish him with a torment such as I have never inflicted upon anyone among all the aalameen (Mankind and the Jinn)<\/strong>&#8220;<\/i><\/p>\n<p>They (Jesus&#8217; disciples) responded by saying:<\/p>\n<p>&#8220;Then we have no need for it!&#8221; and it didn&#8217;t descend. This was held by Mujaahid and Al Hasan (Al Basri) and Ibn Katheer declared the chains of narration going back to these statements of these two Imaams of the Salaf to be &#8216;Saheeh&#8217;<\/p>\n<p>He then goes on to mention that this may be one of the reasons it does not occur in their sources, for if it had occurred then the narrations from them would have been plentiful.<\/p>\n<p>But then he ultimately concludes that the majority of the scholars of tafseer hold that it DID occur, and this is the choice of Imaam Ibn Jareer At Tabari, because Allah affirms that he sent it down with his statement:<\/p>\n<p>&#8220;..<i>‘<strong>I am going to send it down unto you<\/strong>, but if any of you disbelieves , then I will punish him&#8230;&#8221;<\/i><\/p>\n<p>It is for this reason some narrations mention that Eesaa disliked the request, but that which highlights the virtue of Muhammad &#8211; Sallallahu alaihi was Salam, is that when a similar request was made to him he responded to the request differently.<\/p>\n<p>Upon the authority of Ibn Abbaas &#8211; Radhiyallahu anhu who said: &#8221; (Individuals from The tribe of) Quraish approached the Prophet &#8211; Sallallahu Alaihi Wa Salam and said: &#8220;<em>Make Dua to your lord for us to that he turn Mount Safaa into gold! and then we will believe in you!<\/em> So He said: &#8220;<strong><em>And will you do so<\/em><\/strong>? they said: &#8220;Yes! so the Messenger of Allah supplicated to Allah and he was approached by Jibreel who said to him: &#8220;Indeed your lord conveys Salaam to you and says: &#8220;I<strong><em>f you wish I will turn Safaa into gold but whosoever disbelieves after that I will punish him with a punishment I have not inflicted upon anyone in creation, or if you wish I will open for them the door of repentance and mercy<\/em><\/strong>&#8221; so he said: &#8220;<strong><em>Then the doors of repentance and mercy<\/em><\/strong>&#8221;<\/p>\n<p>(Collected by Imaam Ahmad in his &#8216;Musnad 4\/60 and Al Faakihi In &#8216;Akhbaar Makkah 4\/12 and declared &#8216;Saheeh&#8217; by Shaikh Al Albaani in &#8216;As Saheehah 9\/174)<\/p>\n<p>Highlighting the mercy the Messenger -Sallallahu alaihi was Salam &#8211; had and his desire to see people guided to the Haq even though many of them were arrogant and steeped in rejection.<\/p>\n<p>Was Sallallahu &#8216;Alaa Nabiyyinaa Muhammad<\/p>\n<p>www.twitter.com\/abuhakeembilal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Explore the true origins of Easter and its customs, debunking misconceptions with insights from Islamic teachings. Learn about the biblical narratives and their interpretations in light of Islamic beliefs.<\/p>\n","protected":false},"author":1,"featured_media":8805,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,13,17,1],"tags":[],"class_list":["post-873","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-miscellaneous","category-tafseer","category-uncategorized"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/04\/A-Word-on-Easter.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/873","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=873"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/873\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8805"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=873"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=873"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=873"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}