{"id":940,"date":"2013-07-01T22:08:43","date_gmt":"2013-07-01T22:08:43","guid":{"rendered":"http:\/\/ah-sp.com\/?p=940"},"modified":"2024-07-03T06:22:23","modified_gmt":"2024-07-03T06:22:23","slug":"100-points-of-criticism-against-yahya-al-hajoori","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/100-points-of-criticism-against-yahya-al-hajoori\/","title":{"rendered":"100+ Points of Criticism Against Yahya Al Hajoori"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/940?action=genpdf&amp;id=940\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal Hamdulillah Was Salaatu Was Salaamu Was Salaaamu &#8216;Alaa Rasoolillah<\/p>\n<p>Ammaa ba&#8217;d:<\/p>\n<p>As promised in the end of our dawra in Birmingham yesterday (30\/6\/2013), here are the 100 (or more) points and observations the people of knowledge have against Yahya Al Hajoori, collectively gathered from the writings and audio of the people of knowledge against him, I will mention them twenty at a time so as to make them easier to digest and they are of course simply listed since the intent here is not to mention them with their quotations and references, (that can be done at a later date) but simply to mention the issues in a bullet point for those who wish to be acquainted with the affair<\/p>\n<p>Wa billahit Tawfeeq<\/p>\n<p>1. His claim that the Messenger erred in regards to the means of giving da’wah (Wasaa&#8217;ilud Da&#8217;wah)<\/p>\n<p>2. His belief that not all of the sunnah is revelation<\/p>\n<p>3. His establishing that the statements of the Messenger – Sallallahu ‘Alaihi was Salam are not accepted except with evidence<\/p>\n<p>4. His belittling some of the affairs of the religion that we have been commanded with (like his statement about Shaikh Muhammad Al Imaam, who gave a lecture during the period of the attack of the Hoothi shi&#8217;ites upon Ahlus Sunnah and he mentioned &#8220;Ahlus Sunnah will die from hunger and Killing and this one doesn&#8217;t even mention it! instead he speaks of the Hijaab and whether a woman should cover or not!&#8221;)<\/p>\n<p>5. His holding that some of the people of hypocrisy (Munaafiqoon) were students of the Messenger – Sallallahu ‘alaihi was Salam<\/p>\n<p>6. His claim that the deviation known as ‘Irjaa’ (the belief that imaan is in the heart alone (or the heart and tongue as some used to hold) and it doesn’t rise and fall, and that actions are not from Imaan) started with the Sahaabah and that the first the speak with it was Qudaama Ibn Madh’oon – Radhiyallahu ‘Anhu<\/p>\n<p>7. His attack upon the rightly guided Khalifah Uthmaan – Radhiyallahu ‘Anhu<\/p>\n<p>8. His claim that The Companions at the battle of Badr disobeyed Allah twice and so Allah made a calamity overcome them (this he claims, is the meaning of the verse 165 in Suratu Aali Imraam (&#8220;you smote your enemies with one (i.e a disaster) twice as great&#8221;..(Refering to their victory in the Battle of Badr) he claims the verse means they commited two sins in the battle of Badr!<\/p>\n<p>9. His method of enumerating the errors of the companions similar to the raafidhah<\/p>\n<p>10. His view that the Sahaabah participated in the killing Uthmaan<\/p>\n<p>11. His view that whosoever curses all of the companions, then he doesn’t disbelieve until he intends by way of that to reject the whole religion or to disparage it<\/p>\n<p>12. His claim that the companions forsook uthmaan – Radhiyallahu ‘Anhum<\/p>\n<p>13. His claim that if Allah punished all of his slaves without them having sinned or committed a crime, then he wouldn’t have oppressed them, which is the belief of the Jahmiyah and the Ash’arees (The belief of Ahlus Sunnah is that Allah would never do such a thing rather he only punishes due to actions committed and Ahlus Sunnah do not even make the suggestion since it opposses the attribute of Justice) &#8211; A note on point 13<\/p>\n<p>14. His claim that whosoever doesn’t know the truth (I.e From the people of knowledge) after researching, then that is due to his negligence, for if he had researched correctly then he would have found it. This is the belief of the Qadariyah and the Mu’tazilah. Ahlus Sunnah Hold that the Mujtahid who strives to come to the truth and exerts all his efforts doing so then he is rewarded for his efforts and is not punished or considered negligent<\/p>\n<p>15. His claim that Pharoah and the Kuffaar called to Tawheed Ar Ruboobiyah<\/p>\n<p>16. His view that Ahlus Sunnah is the &#8216;closest&#8217; of the groups to the truth<\/p>\n<p>17. His claim that there is no difference between innovators who call to their innovation and those who do not call and thus he claims that the speech of the Salaf in that regard is false empty speech<\/p>\n<p>18. His declaring someone an innovator due to sin (like him declaring on the tape &#8216;Tubayin Al Kadhib&#8217; when asked about a man that leads people in Salaah but he is homosexual he responded &#8216;A homosexual is not from Ahlus Sunnah!&#8217; what is a Sunni?! Is he merely the one who affirm the names and attributes?!)<\/p>\n<p>19. Him not making a difference between At-Tawwali (To show love and alliegence to the Kuffaar, and to love to see them and their religion aided and victorious over the Muslims) and Al Muwaalaat (as for Muwaalaat, then it resembles At Tawali in the affair of aiding and supporting but on occasions it is done for reasons related to deen and on occasions it is done for worldly purposes which is a sin but not considered Kufr)<\/p>\n<p>20. He declares the son of Adam Qaabil (Kane) a Kaafir! And he passes the verdict of apostasy upon him! (Shaikh Ibn Baaz Mentions in Majmoo&#8217; Al Fataawaa (3\/117): &#8220;Indeed Qaabil (Kane) was sinful and killed his brother Haabil (Abel) without right but they were both upon Islaam!&#8221;)<\/p>\n<p>21. <strong>Him holding assassination of foreigners permissible<\/strong> (In the tape ‘As’ilatu Ashaab Hais’ he was asked about a Christian woman living in a region known as Abs who was teaching women to play football in a specific place so he responded by saying “<em>Allahul Musta’aan wallahi this is fitna! The call to Christianity is fitna! I ask Allah to make it easy for someone to assassinate her! Yes True! I ask Allah to make it easy for someone to Assassinate her<\/em>!&#8230;)<\/p>\n<p>22. From the evidence of his weakness in Aqeedah:<\/p>\n<p>• His statement in Al Mabaadee Al Mufeedah (a book he authored wherein he poses questions related to aqeedah then he answers them himself) p 25: Q: What do you believe concerning the Qur’aan that is in the Mushaf? Then say: “ I believe It is the book of Allah – Azza Wa Jal – and it isn’t created” End quote.<\/p>\n<p>Ahlus Sunnah do not restrict their belief in the Qur’aan being the speech of Allah to that which is in the Mushaf alone, whether it is in the Mushaf, recited, listened to or written. We do not restrict it to that which is in the Mushaf alone as Al Hajoori does here. Which is an issue that could easily be misunderstood by the beginner, the like of whom this book was written for.<\/p>\n<p>23. His affirmation of the statement of Al Busairi: ‘Oh most Noble of creation I have none that I resort to other than you! When comes the appearance of general calamities…” He responded by saying “ ‘<em>Oh most noble of creation’ <strong>This is correct<\/strong><\/em>!..There is no doubt that the Messenger IS the Most Noble of creation but when this statement is connected to the statement of shirk that follows it is not correct.<\/p>\n<p>24. Him holding onto the deviated principle of Abul Hasan that: “<strong>General speech should he held in the light of that which is specific<\/strong>” He mentions in Al Kanzuth Thameen (4\/461): “<em> If the origin with that scholar is (that he is upon) the Sunnah and (known for) defending it, but there came from him some statements in some places (i.e. in his speech or books) that opposes what he believes, then this statement of his that opposes the correct clear believe of his is understood in the light of his correct belief<\/em>..” this is a false principle, rather the correct position is that the one who errs in statement or action then it is said to him you have made a mistake even if he is from Ahlus Sunnah and we do not view his incorrect statement in the light of that which we know from his correct belief.<\/p>\n<p>25. Instances of him opposing the Qur’aan:<\/p>\n<p>From the statements that have come from him in opposition to the Qur’aan:<\/p>\n<p>He mentions in ‘Al Arba’een Al Hisaan li tanbeeh al Anaam ilaa fadhlil Ijtimaa’ ‘alat Ta’aam’ P6: “<em>Indeed while upon a journey I undertook to Britain for da’wah, I met some callers who I consider people of Sunnah and Itibaa’ and we had gather for Dinner. The host then began presenting each person with individual plates as is the culture of the Kufaar over there, a man and his household and his guests all eat separately, they gather around the food individually, each person sitting away from the other not calling anyone else to participate with him. This is a blameworthy custom, and evil western cultural practice<\/em>.”<\/p>\n<p>Here he describes it as being:<br \/>\n1. From the culture of the Kufaar<br \/>\n2. Blameworthy and evil cultural practice<br \/>\n3. He speaks ill of it<\/p>\n<p>And this is in opposition to the Qur’aan. Allah the most high says:<\/p>\n<p>“There is no sin upon you whether you eat together or apart” (Suratun Nur Vs 61)<\/p>\n<p>Ibn Katheer mentions concerning the verse:<\/p>\n<p>“<em>In this is an allowance from Allah for a man to eat by himself or with a group even though eating together is better and more blessed<\/em>” (Tafseer Ibn Katheer 6\/86)<\/p>\n<p>Shaikh Abdur Rahmaan Ibn Naasir As Sa’dee mentions:<\/p>\n<p>“<em>All of this is permissible, that the people of a household eat together or that each individual eats by himself, and in this is removal of harm<\/em>..” (Tafseer Sa’dee P575)<\/p>\n<p>(Note: The reference here is to a gathering with Shaikh Abdur Razaaq Ibn Abdul Muhsin Al Abaad, I had accompanied Al Hajoori to the dinner so I remember it well, since his manner of correcting what he &#8216;thought&#8217; was evil was terrible and in all honesty extremely embarrassing!)<\/p>\n<p>26. From the statements that have come from him in opposition to the Qur’aan:<\/p>\n<p>He mentions in the tape: “tahdheeru Ahlil Yemen” – “<em>Indeed the people of Saalih, when they were <strong>ALL UNITED <\/strong>upon rejecting him, Allah destroyed them ALL<\/em>”<\/p>\n<p>This is in opposition to that which is in the Qur’aan:<\/p>\n<p>Allah the the most high says:<\/p>\n<p>“<strong><em>Indeed we sent to Thamood their brother Saalih saying ‘Worship Allah! Then Lo! They became two parties (believers and disbelievers) quarrelling with each other<\/em><\/strong>” (Suratun Naml Vs 45)<\/p>\n<p>Ibn Katheer mentions in his Tafseer (10 \/414):<\/p>\n<p>“..Mujaahid said (about the verse) “<em>Believer and disbeliever<\/em>”<\/p>\n<p>Allah the most high likewise mentions:<\/p>\n<p>“<strong><em>So when our command came we saved Saalih and those who were with him by a mercy from us and from the disgrace of that day. Verily your lord he is the All strong the All mighty. And the Awful Cry of punishment overtook the wrongdoers, so they lay dead prostrate in their homes<\/em><\/strong>” (Suratul Hood Vs 66-67)<\/p>\n<p>27. Al Hajoori mentions in the tape: An Nahy ‘Anil Fasaad: “<em>It is not befitting that we are heedless about any affair from the affairs of the deen regardless of how the people consider it from the simple affairs, or regardless of whether it is as a simple affair in their view. For indeed Allah destroyed a nation from the nations due to weights and measures and them slighting people in regards to weights and measures. A(nother) nation Allah destroyed due to homosexuality and a nation Allah destroyed due to a She-Camel<\/em>”<\/p>\n<p>This statement is in opposition to that which is clear in the Qur’aan since Allah mentions:<\/p>\n<p>“<em><strong>The Ashaabul Ayka rejected the Messengers<\/strong><\/em>” (Suratush Shu’araa Vs 176)<\/p>\n<p>And Allah says: “<strong><em>The people of Loot rejected the Messengers<\/em><\/strong>” (Suratush Shu’araa Vs 160)<\/p>\n<p>And Allah says:<\/p>\n<p>“<strong><em>The people of Thamood rejected the Messengers<\/em><\/strong>” (Suratush Shu’araa vs 141)<\/p>\n<p>These then, were not the main reasons for their destruction, rather their committing shirk, Kufr and rejection of the Messengers.<\/p>\n<p>28. Al Hajoori mentions in the tape ‘Meeraathul Anbiyaa’ The Messenger inherited from those who came before him and Abu Bakr and Umar inherited from the Messenger – Sallallahu alaihi Was salam”<\/p>\n<p>Allah the most high says:<\/p>\n<p>“<strong><em>Neither did you (Oh Muhammad ) read any book before it (the Qur’aan) nor did you write any book (whatsoever) with your right hand. In that case the followers of falsehood might have doubted<\/em><\/strong>” (Suratul Ankaboot Vs 48)<\/p>\n<p>29. His applying verses concerning killing and waging war against Allah and his messenger upon one who commits Gheebah (backbiting) and Nameemah (Talecarrying):<\/p>\n<p>He mentions in his lecture &#8216;An Nahyu &#8216;Anil Fasaad&#8217; (The Prohibition against causing corruption):<\/p>\n<p>&#8220;Yes Indeed the one who traverses through the earth causing corruption between the people, with any type of corruption of Fasaad then it is as though he has killed them! Allah, The Might and Majestic has informed us of this in the story of Bani Israa&#8217;eel and concerning their affair He says:<\/p>\n<p>&#8220;Because of that We ordained for the children of Israel that if anyone killed a person not in retaliation of murder, or (and) due to spreading mischief in the land, then it would be as if he had killed all mankind. and if anyone saved a life it would be as if he saved the life of all of Mankind..&#8221;(Suratul Maa&#8217;idah Vs 32) (He continues) for this reason Allah multiplied the punishment upon those who cause corruption upon the earth.<\/p>\n<p>(Allah says):<\/p>\n<p>&#8220;The recompense of those who wage war against Allah and his Messenger and do mischief in the land is that they shall be killed or crucified of their hands and their feet cut off from opposite sides, or be exiled from the land. That is their disgrace in this world and a great torment is theirs in the hereafter&#8221; (Suratul Maa&#8217;idah Vs 33) then he continues: &#8220;..Yes! for them is disgrace in the life of this world, for indeed there is nothing more disgraceful than one who traverses among people backbiting and spreading false tales. Backbiting, Talecarrying and lieing! Gathering between various types of sin in the same instance! there is nothing more disgraceful than these types (of individuals)!<\/p>\n<p>While the great Imaam of tafseer Ibn Jareer At Tabari has mentioned in his tafseer (10\/321-323):<\/p>\n<p>&#8220;.. The meaning of this statement then is due to the transgression of the son of adam (Kane) who killed his brother (Abel), we passed a verdict upon the Children of Israel, that whosoever kills a soul oppresively, without another soul being killed, then he will be killed in retribution due to that. (As for the statement of Allah) &#8220;Or due to (it) spreading mischief in the land&#8221; ..that is whosoever kills a soul without that soul having caused corruption in the earth thus warranting that it be killed due to that. A soul causes corruption in the earth by waging war against Allah and his Messenger and causing fear to be struck upon the pathways (i.e stripping them of safety and security). And that which we have mentioned here concerning this is what scholars of interpetation of the Qur&#8217;aan say&#8221;<\/p>\n<p>Thus the only thing the verse indicates is that a life may be taken (as dictacted by the laws of corporal punishment administered by the governor of an Islamic State), if that individual had murdered or caused corruption in the earth. It does not indicate that one who causes fitna due to backbiting and talecarrying then his action is as enormous as or like unto taking a life!<\/p>\n<p>30. He says in a lecture entitled: &#8216;Naseehatun lil Jawaasees Was Sahafiyeen&#8217; &#8220;The one who killed the She-Camel (of Saalih &#8211; alahis Salaam) was one person, THE REST OF THEM WERE ALL SILENT, however they were pleased with his action..&#8221; End quote<\/p>\n<p>Allah &#8211; Jalla Jalaalahu said: &#8220;But they called their comrade and he took a knife and he killed her&#8221; (Suratul Qamar Vs 29)<\/p>\n<p>Imaamut Tabari mentions in his tafseer (22\/593):<\/p>\n<p>&#8220;The (correct) interpretation concerning the statement of the most high: &#8220;..But they called their comrade..&#8221; is that he, the most high, mentions that Thamood called their companion, the one who killed the She-Camel, Qidaar Ibn Saalif, to kill the She-Camel WHILE THEY ALL ENCOURAGED HIM TO DO SO. the statement:<\/p>\n<p>&#8220;..and he took a knife and he killed her&#8221;<\/p>\n<p>He mention that he took the camel with his hands and killed her..&#8221;<\/p>\n<p>31.His statement concerning female soldiers He says in ‘Hasdul Adillah’ P75<\/p>\n<p>“I don’t know where the jealousy of the guardians of these women is, or maybe they are just a bunch of abandoned children, women who are the result of free mixing in universities, thus the fruit of this is what is indicated by the statement of the messenger &#8211; Sallallahu &#8216;Alaihi Was Salam – “The child of fornication is the worst of the three” … he goes on to mention on page 79<br \/>\n“<strong>and it is known that if a woman becomes a soldier then what stems from that is that she will be alone with soldiers because it is a must that she obeys her superior …and perhaps he will command her to lay down and sprawl out on the floor and crawl upon her hands and knees, and he may strip her of her clothes and she may have to shower with cold water on a cold night<\/strong>…so what do you think the outcome will be Oh guardian with this miskeenah! …<strong>what is to be expected of you daughter or your sister with this &#8216;absolute obedience&#8217;?? He may even lock her in a concealed room…so what do you expect Oh Pimp! When your daughter has to go out to carry out her &#8216;duties&#8217; with the auxiliaries<\/strong>! Or other than her, with that man who would have likely followed her around on the streets much less have his hunted game come to him in his pen, this would be considered easy prey! So what do you expect Oh pimp!“<\/p>\n<p>32.He mentions in the lecture ‘Asillatu Ahli Yareem when he was asked about working in The Office of criminal research in the investigations department:<\/p>\n<p>“<strong>For you to come out of a sewer of urine and faeces is lighter than for you to come out of this department! To be soiled in urine and faeces from you head to your toes is lighter than to be soiled by this lowly despicable job<\/strong>! Investigators are from the greatest liars among the people! For that reason many in authority do not trust these investigators! It turns people into spies! Spies who have spies over them! And over those spies are spies! Because they all know they are liars!.. The spy comes to every person in their form! He comes for example to the one who sell tomatoes in the form of a tomato seller and to the one who sell potatoes in the form of a potato seller and among the student of knowledge as a student of knowledge, <strong>and among homosexuals as an effeminate Gay! Wallahi to this level! And in order to be a spy he must let them do what they wish to him! So that he may report that people are carrying out Homosexual acts<\/strong>!<\/p>\n<p>Is this the speech of the Aalim?<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Examples of his lies<\/strong><\/span><\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Shaikh Ubaid Al Jaabiri<\/strong><\/span><\/p>\n<p>He claims in the lecture ‘Asilatu Ashaabul Luhaj’<\/p>\n<p>33. “<strong>He (Shaikh Ubaid) sees that Abul Hasan is not an innovator<\/strong>” !!<\/p>\n<p>Shaikh Ubaid mentions in The lecture ‘Maraahilunaa ma’ Abil Hasan’: “<em>Indeed the man is not from Ahlus Sunnah in his manhaj His Manhaj is corrupt, that which I am certain of is that he is a pure Ikhwaani, plotter who plays games a plant amongst the scholars of Ahlus Sunnah and the students of knowledge in Yemen in order to split their ranks and to make them groups and parties<\/em>!”<\/p>\n<p>34. “<strong>He sees that Qutb is not an innovator! Qutb himself is not an innovator!? Qutb!? He (Shaikh Ubaid) says: ‘I don’t declare him an innovator but he is misguided!(Here) He contradicts himself! This is what is widespread from him<\/strong>!<\/p>\n<p>While shaikh Ubaid In ‘Al eedaah Wal Bayaan ‘an haali Muhammad Hassaan’: “<em>Sayyid Qutb is the carrier of the banner of takfeer in this era without doubt<\/em>!”<\/p>\n<p>He likewise said in ‘Ar Radd ‘alaa badhi qawaa’idi ‘Ali Al Halabi Al Faasidah’: “<em>Our older brother Ash Shaikh Rabee’ has precedence in exposing the Imaams of misguidance and unearthing their corrupt Aqeedah and methodology and from them the Egyptian Ibn Qutb<\/em>!”<\/p>\n<p>35. <span style=\"text-decoration: underline;\"><strong>His lies false oaths<\/strong><\/span><\/p>\n<p>Like his statement concerning abdur Rahmaan Al Adani:<\/p>\n<p>“<strong>Wallahi he will never become an Aalim! I swear by my lord! He himself has no concern for knowledge<\/strong>!<\/p>\n<p>Or like his statement about the markaz of fuyoosh:<\/p>\n<p>“<strong>Wallahi there is no da’wah in Fuyoosh that is beneficial to Islam and the Muslims in Fuyoosh! I swear by my lord<\/strong>!<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>His statements against the people of knowledge<\/strong><\/span><\/p>\n<p><span style=\"text-decoration: underline;\"><strong>36. His statement against Imaam Al Barbahaari!<\/strong><\/span><\/p>\n<p>He states in the lecture ‘Al Qawl Al Jalee’<\/p>\n<p>“<em><strong>I know that Al Barbahaari has a takfeeri Inclination<\/strong><\/em>!”<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>37. His statement concerning the Imaamul Mujadid Muhammad Ibn Abdil Wahaab<\/strong><\/span><\/p>\n<p>“He is a Mujadid – May Allah have mercy upon him – even though this is the case, <strong>he had no concern for declaring Ahaadeeth authentic or weak<\/strong>. Either because he was busy with affairs or because he just wasn’t strong in hadeeth…as for hadeeth then he didn’t have much knowledge or experience in it – May Allah have mercy upon him, the one who reads his books will have no doubt about that, <strong>whoever wants to be bigoted towards him then let him do so<\/strong>!”<\/p>\n<p>Shaikh Abdul Muhsin Al ‘Abaad mentioned in defense of Shaikh Muhammad Ibn Abdil Wahaab against the claim that he had no knowledge in Hadeeth:<\/p>\n<p>“<em>His striving in the knowledge of Hadeeth and his concern with it is clear, one of the clearest evidences of that is this collection (of his) of four thousand six hundred hadeeth, wherein he mentions the speech of the scholars (of hadeeth) and mentions those who have collected the hadeeth, and the statements of the scholars concerning the verdict upon the hadeeth and similarly his other books (ie bear witness to this) all of this indicates his concern with hadeeth…Many of the Ulamaa are acquainted with many Ahaadeeth and ignorant of many but that doesn’t affect their knowledge and this is known through the ages… The early scholars wrote books and from the scholars were those who passed the verdict upon some of that with authenticity and upon some with weakness. Al Mundhiree and his books ‘At Targheeb Wat Tarheeb has many Ahaadeeth, the majority is authentic while in it are ahaadeeth that are weak, thus if there are ahaadeeth that are weak found in the works of As Shaikh Muhammad Ibn Abdil Wahaab that doesn’t mean that he wasn’t an ‘Aalim in Hadeeth<\/em>…”<\/p>\n<p>38. <span style=\"text-decoration: underline;\"><strong>Him statement concerning the permanent fatwa committee of Saudi Arabia<\/strong><\/span><\/p>\n<p>He says in the lecture ‘Tabyeen Al Kadhib Wal Meen<\/p>\n<p>“I say to my brothers indeed ‘Fathul Baari’ in our opinion is vaster and is considered a treasure… but we are ardent about evidence! You will come across ‘Fathul Baari’ and find the issue with its evidence, <strong>then you come across the fatwa of the Ulamaa, the companions of the committee (i.e the fatwa committee of Saudi Arabia) and they may say: “No! This is not sound! Or this is sound or they may possibly say such and such hastily (!) or such and such, thus you are in need of evidence<\/strong>. Al Haafidh (Ibn Hajr) is a stronger scholar of Hadeeth! No one from the companions of the committee will dispute that…”<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>39.His statements about the land of the Two Harams<\/strong><\/span><\/p>\n<p>He states:<\/p>\n<p>“..<strong>so Hizbiyah has overcome the two Haram and other than the two Harams in Saudi! Hizbiyah is dominant in that land<\/strong>&#8230;”<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>40. His statement concerning the Islamic University of Madina<\/strong><\/span><\/p>\n<p>“ Our brother Abdullah Al Ashmoori they made things difficult for him to the extent they expelled him from the University, they made things hard for him because he was Salafi speaking the truth! (Note: Abdullah Ashmoori was a classmate of mine in the faculty of Hadeeth and was very shy and quiet and not outspoken at all! AH) he wrote books and by Allah they made things difficult for him and expelled him they used various means against him! And til this day if a clear salafi goes there and they see he is salafi they try to make things difficult for him. It is not possible to enter the Hizbi Islamic University, the Islamic University is purely Hizbi! Yes there are Salafis but they are strangers!<\/p>\n<p>(Note: While yes there are people of hizbiyah in the University (just as in Daamaaj Historically there have been Hizbiyoon teaching!) to refer to it as a ‘Hizbi University is oppression)<\/p>\n<p>He also said: “<strong>We do not advise with studying in it<\/strong>&#8230;”<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>41. His statement concerning shortening the prayers without observing a particular time period for doing so<\/strong><\/span><\/p>\n<p>In the lecture Al Kadhib Wal Meen’:<\/p>\n<p>“<strong>This is this is the school of thought of Iblees! this is the school of thought of shaytaan, Iblees<\/strong>”<\/p>\n<p>Even though there are a number of Imaams who hold the position from them Shaikh Ibn Uthaimeen!<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>His Ill, evil statements against the scholars of the Sunnah<\/strong><\/span><\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Shaikh Rabee’<\/strong><\/span><\/p>\n<p>In the lecture &#8216;asilatu shabaabi Masjidil Istiqaamah fil Hudaidah’ he mentions concerning the Shaikh:<\/p>\n<p><strong>42. He accuses the Shaikh of splitting the salafis of Yemen into Salafis of the North and Salafis of the South<\/strong><\/p>\n<p><strong>43.He accuses him of being an opponent of the people of Haq and biased towards and in favour of the people of falsehood and that he encourages the people of falsehood against the da’wah<\/strong><\/p>\n<p>If someone comes to him from Dammaaj he leaps at them like a lion, he makes them tremble and his face changes and his lips tremor from his severe anger<\/p>\n<p><strong>44.He accuses him of being one who plots<\/strong><\/p>\n<p><strong>45.He claims that anyone who visits the shaikh then he returns afflicted and under trial and wavering and unstable<\/strong><\/p>\n<p><strong>46.His alienation and obstruction of Dammaaj will not benefit him in the Dunya or the hereafter<\/strong><\/p>\n<p><strong>47.That he and As Shaikh Muhammad Ibn Abdul Wahaab intend nothing but to keep the majority with them<\/strong><\/p>\n<p>48.In the book of Hasan Ar Raimi ‘At Tawdeeh limaa yashtamiluhu Kalimatu Muhammad Al Imaam minat Tasreeh’ a book that he advises should be spread and circulated it mentions on Page 5:<\/p>\n<p>‘<strong>It is upon our Shaikh Rabee’ to fear Allah and hasten to make taubah from these ugly actions<\/strong>!’<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Shaikh Ubaid <\/strong><\/span>(there are more than 30 statement of evil against this scholar of the Sunnah! from them):<\/p>\n<p>49. <strong>Hizbi<\/strong><br \/>\n50. <strong>Faajir (evil Sinner)<br \/>\n<\/strong>51. <strong>Upon him are the signs of hypocrisy<\/strong><br \/>\n52. <strong>A lying Hizbi<\/strong><br \/>\n53. <strong>A Dajaal from the Dajaajilah<\/strong><br \/>\n54. <strong>Misguided deviant<br \/>\n<\/strong>55. <strong>A man who causes corruption<\/strong><br \/>\n56. <strong>An enemy of the Sunnah<br \/>\n<\/strong>57. <strong>Abandoned<\/strong><br \/>\n58. <strong>A fool<\/strong><br \/>\n59. <strong>An Idiot<\/strong><br \/>\n60. <strong>blind in sight and foresight<\/strong><br \/>\n61. <strong>An empty individual<br \/>\n<\/strong>62. <strong>An Unknown Individual<\/strong><br \/>\n63. <strong>His speech is like an old woman breaking wind <\/strong>(!)<br \/>\n64. <strong>One splitting the ranks of the da’wah Salafiyah<\/strong><br \/>\n65. <strong>Confused, resembling one deranged<\/strong><br \/>\n66. <strong>Armour for the people of Hizbiyah<\/strong><br \/>\n67. <strong>Allah has placed no barakah in his life<\/strong>!<br \/>\n68. <strong>A lost individual!<br \/>\n<\/strong>69. <strong>One causing corruption<\/strong><br \/>\n70. <strong>Heresy is feared for him<\/strong><br \/>\n71. <strong>He became misguided in his old age<\/strong><br \/>\n72. <strong>May Allah disgrace Ubaid the way he disgraced Shaytaan<\/strong>!! (and other statements!)<\/p>\n<p>When Shaikh Rabee’ The carrier of the Banner of Jarh Wa ta’deel (disparaging and praising individuals, as Shaikh Al Albaani referred to him) was asked about shaikh Ubaid and whether his is an ‘Aalim or student of Knowledge alone he said:<\/p>\n<p>“<em>Wallahi the one who dispraises him and says “he is Jaahil (Ignorant) this individual follows the path of the Shayaateen, and the way of the people of Hizbiyah in dispraising the scholars of the Sunnah Shaikh Ubaid is from the most Noble of the scholars of the Salafis well known for piety, abstention from the Dunya and speaking the truth Baarakallahu Feekum and no man who seeks the face of Allah speaks ill of him! This way (of speaking) we have observed it from the people of Hizbiyah<\/em>!”<\/p>\n<p>(A lecture he delivered to the brothers of Manchester (ninth of Dhul Hijjah 1425)<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>His statements concerning (His teacher) Shaikh Muhammad Ibn Abdil Wahaab Al Wasaabi – Hafidhahullah<\/strong><\/span><br \/>\nShaikh Muhammad Ibn Abdil Wahhaab Al Wasaabi – Hafidhahullah was the first of the scholars to declare Al Hajoori an innovator<\/p>\n<p>Shaikh Muqbil said concerning him<\/p>\n<p>“<em>Muhammad Ibn Abdil Wahhaab is the shaikh of tawheed and hadeeth and fiqh and noble character and abstention from the dunya and piety and he is a merciful cultivator and one who calls to the unity of the Muslims, one who warns against evil hizbiyah, the one who is patient upon poverty and difficulty. He is wise in his da’wah and loves the salaf of this Ummah and hates the people of bid’ah in accordance to his bid’ah<\/em>….”<\/p>\n<p>Shaikh Muhammad Al Imaam said about him in his lecture ‘Da’watu Ahlis Sunnah in Yemen’:<\/p>\n<p>“<em>As far as our father The Shaikh Muhammad Ibn Abdil Wahhaab – Hafidhahullah then I knew him as a shaikh before I even began seeking knowledge! I knew of him as a scholar calling to Allah facing and confronting fitan warning against misguidance, fictitious falsehood and forms of shirk<\/em>&#8230;”<\/p>\n<p>Al Hajoori himself said about him in his book ‘Tabaqaat’<\/p>\n<p>“<em>The Shaikh The Noble one, The firmly established, the one who practices abstention from the dunya, The patient, the Aalim, the respected and revered<\/em>..”<\/p>\n<p>(Note: I remember hearing in the 90’s from the misguided extreme Faalih Al Harbi – May Allah guide him (prior to him being refuted by the scholars) bearing in mind that he was one that rarely praised anyone! “If there is a true Aalim in Yemen after Shaikh Muqbil then it is Shaikh Muhammad Ibn Abdil Wahaab!”)<\/p>\n<p>But when he criticized Al Hajoori we saw the many ill statements against him, from them:<\/p>\n<p>73. <strong>Shaikh Muhammad is a Kadhaab (liar)<br \/>\n<\/strong>74. <strong>Shaikh Muhammad Ibn Abdil Wahaab is Abdur Rahmaan Adanee’s boy<\/strong>!<br \/>\n75. <strong>Deviant!<br \/>\n<\/strong>76. <strong>Shaikh Muhammad – May Allah guide him &#8211; has become a toy in the hands of the empty ones<\/strong><br \/>\n77. <strong>Dajaal!<\/strong><br \/>\n78. <strong>One who harms the da’wah As Salafiyah<\/strong><br \/>\n79. <strong>Opening a door of evil upon himself<\/strong><br \/>\n80. <strong>Is from the people of Falsehood<\/strong><br \/>\n81. <strong>Shaikh Muqbil renewed (i.e. the affairs of the deen) while this one (Shaikh Muhammad) he has destroyed everything he built<\/strong>!<br \/>\n82. <strong>Muhammad Ibn Abdil Wahaab Brothers Wallahi he wants Ahlus Sunnah to be like soofis<\/strong>!<br \/>\n83. <strong>He wishes to put the light of Allah out<\/strong>!<br \/>\n84. <strong>One who opposes the da’wah As Salafiyah<br \/>\n<\/strong>85. <strong>His saliva has poured out all over the dunya<\/strong>!<br \/>\n86. <strong>He has a doctorate in Provocation <\/strong><br \/>\n87. <strong>He is adamant about causing fitna<\/strong><br \/>\n88. <strong>It is as though he is a student of Abdullah ibn ubay Ibn Salool (The leader of the hypocrites at the time of the prophet Sallallahu Alaihi was Salam!)<br \/>\n89. A carrier of the banner of Shaytaan90. The older he gets the greater his fitna becomes!<\/strong><br \/>\n91. <strong>We know your weakness in knowledge in your writings, in your lectures and in your da’wah<\/strong>!<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>His statement concerning Shaikh Muhammad Ibn Haadi<\/strong><\/span><\/p>\n<p>92. <strong>The Man is jealous!<\/strong><br \/>\n93. <strong>Transgressor <\/strong><br \/>\n94. <strong>A liar<br \/>\n<\/strong>95. <strong>His doctorate could have been authored by our small students of knowledge<\/strong><br \/>\n96. <strong>The people know you people are bigoted and people who cause fitna within the da’wah As Salafiyah in Yemen, May Allah kill you!<\/strong><br \/>\n97. <strong>He says about me that I am a fool! As though I am one that follows prostitutes in the street! You are the fools you are the evil liars! You are the transgressors, you are the oppressors, you are the one who have split the da’wah, and the supplication of the righteous shall reach you Oh evil doers! You are the ones that have arrogance and haughtiness<\/strong> (See ‘Mushaahadaati fee Damaaj P19-20)<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>His speech concerning Ash Shaikh Abdullah Al Bukhaari<\/strong><\/span> (As is in the lecture ‘Naseehah li Abdullah Al Bukhaari)<\/p>\n<p>98. <strong>His speech is like unto the speech of the deranged one<br \/>\n<\/strong>99. <strong>Coward<\/strong><br \/>\n100. <strong>Juwaihil<\/strong> (Little ignorant one)<br \/>\n101. <strong>Fool<\/strong><br \/>\n102. <strong>Insolent\/ Shameless<\/strong><br \/>\n103. <strong>Bukhaari has ‘Tabakkhar, Tabakkhar (i.e. has become vapour or smoke!)<br \/>\n<\/strong>104. <strong>Bukhaari is the tail of Ubaid!<\/strong><br \/>\n105. <strong>Slap Bukhaari! Slap him! (Iltamoo Bukhaari Iltamoohu!)<\/strong><br \/>\n106. <strong>May you perish Oh Bukhaari as the hands of Abu Lahab perished!<\/strong><\/p>\n<p>From the scholars he has spoken ill of:<\/p>\n<p>As Shaikh Abdul Azeez Aali Shaikh the Mufti of Saudi Arabia (And referred as one who doesn’t know who is around him from the people of Hizbiyah<\/p>\n<p>Ash Shaikh Saalih Aali As Shaikh describing him as being upon the way Of Ikhwaanil Muslimeen and that he has torn away from the Salafis and that he is a blind follower of Qardaawi!<\/p>\n<p>He spoke ill of Shaikh Ahmad An Najmi<\/p>\n<p>He spoke ill of Shaikh Muhammad Farkoos of Algeria<\/p>\n<p>And Allah&#8217;s aid is sought!<\/p>\n<p>Wallahu A&#8217;lam<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Discover the collective concerns and critical observations from esteemed scholars regarding Yahya Al Hajoori. Explore over 100 points addressing his beliefs, statements, and methodologies, meticulously gathered from various writings and audio recordings.<\/p>\n","protected":false},"author":1,"featured_media":8794,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,10,12,18,23],"tags":[],"class_list":["post-940","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-fiqh","category-manhaj","category-the-scholars","category-youth-related"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/07\/100-Points-of-Criticism-Against-Yahya-Al-Hajoori.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/940","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=940"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/940\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/8794"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=940"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=940"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=940"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}