{"id":946,"date":"2013-07-04T17:21:55","date_gmt":"2013-07-04T17:21:55","guid":{"rendered":"http:\/\/ah-sp.com\/?p=946"},"modified":"2024-07-09T00:24:39","modified_gmt":"2024-07-09T00:24:39","slug":"100-observations-against-al-hajoori-point-13-examining-hadith-justice-of-allah-and-al-hajooris-errors","status":"publish","type":"post","link":"https:\/\/abuhakeem.com\/100-observations-against-al-hajoori-point-13-examining-hadith-justice-of-allah-and-al-hajooris-errors\/","title":{"rendered":"100 Observations Against Al Hajoori &#8211; Point 13: Examining Hadith, Justice of Allah, and Al-Hajoori&#8217;s Errors"},"content":{"rendered":"<div style=\"display:flex; gap:10px;justify-content:flex-start\" class=\"wps-pgfw-pdf-generate-icon__wrapper-frontend\">\n\t\t<a  href=\"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/946?action=genpdf&amp;id=946\" class=\"pgfw-single-pdf-download-button\" target=_blank><img src=\"https:\/\/abuhakeem.com\/wp-content\/uploads\/2024\/04\/free-pdf-download-icon-2617-thumb.png\" title=\"Generate PDF\" style=\"width:auto; height:45px;\"><\/a>\n\t\t<\/div><p>Bismillahi Wal hamdullillah Was Salaatu Was Salaamu &#8216;alaa Rasooliillahi<\/p>\n<p>Ammaa Ba&#8217;d:<\/p>\n<p>As mentioned in the beginning of this post the intent behind this post is only to mention the issues and not to discuss the issues with any detail<\/p>\n<p>It has reached me that one of the Hajoori fanatics has criticized part one of this post (which, of course was what I was expecting!) saying that in point 13 you mentioned:<\/p>\n<p>13. His claim that if Allah punished all of his slaves then he wouldn’t have oppressed them, which is the belief of the Jahmiyah and the Ash’arees (The belief of Ahlus Sunnah is that Allah would never do such a thing rather he only punishes due to actions committed and Ahlus Sunnah do not even make the suggestion since it opposses the attribute of Justice)<\/p>\n<p><em>The individual states:<\/em><\/p>\n<p><em><br \/>\n<\/em><em>Abu Hakeem has falsely accused Shaikh Yahya (may Allaah preserve him) of having the aqeedah of the Jahmiyah and the Ash’arees. Abu Hakeem said,<\/em><br \/>\n“13. His claim that if Allah punished all of his slaves then he wouldn’t have oppressed them, which is the belief of the Jahmiyah and the Ash’arees…”<\/p>\n<p><em>Here B. Davis makes a terrible mistake. Why is this such a huge mistake? Because the meaning of the speech of Shaikh Yahya comes in a hadeeth which Shaikh Muqbil brings in his Al-Jaamee As-Saheeh.<\/em><\/p>\n<p>وقال الإمام أحمد رحمه الله أيضا(5\/185)<br \/>\nحَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا سِنَانٍ يُحَدِّثُعَنْ وَهْبِ بْنِ خَالِدٍ الْحِمْصِيِّ عَنِ ابْنِ الدَّيْلَمِيِّ قَالَ وَقَعَ فِي نَفْسِي شَيْءٌمِنْ الْقَدَرِ فَأَتَيْتُ زَيْدَ بْنَ ثَابِتٍ فَسَأَلْتُهُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِوَسَلَّمَ يَقُولُ لَوْ أَنَّ اللَّهَ عَذَّبَ أَهْلَ سَمَاوَاتِهِ وَأَهْلَأَرْضِهِ لَعَذَّبَهُمْ غَيْرَ ظَالِمٍ لَهُمْ وَلَوْرَحِمَهُمْ كَانَتْ رَحْمَتُهُ لَهُمْ خَيْرًا مِنْ أَعْمَالِهِمْ وَلَوْ كَانَلَكَ جَبَلُ أُحُدٍ أَوْ مِثْلُ جَبَلِ أُحُدٍ ذَهَبًا أَنْفَقْتَهُ فِي سَبِيلِاللَّهِ مَا قَبِلَهُ اللَّهُ مِنْكَ حَتَّى تُؤْمِنَ بِالْقَدَرِ وَتَعْلَمَأَنَّ مَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ وَأَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْلِيُصِيبَكَ وَأَنَّكَ إِنْ مِتَّ عَلَى غَيْرِ هَذَا دَخَلْتَ النَّارَ.<\/p>\n<p>“So he (Zaid ibn Thaabit) said, I heard the Messenger of the Allaah (praise and peace be upon him) say, “If verily Allaah punished the companions of His heavens and the companions of His earth, He would punish them and would not be an Oppressor to them…” (Al-Hadeeth)<\/p>\n<p><em>So we see that Shaikh Yahya did not add anything to the hadeeth. So we ask B. Davis, “Do you accuse the Prophet (praise and peace be upon him) of being Jahmee or Ash’aree?” Now, we wait for your reply or your tawba!..&#8221;<\/em><\/p>\n<p>Here we see a typical example of the problem at hand, the tarbiyah Ilmiyah they recieve, and the smug attitude of one pleased with himself and his skanty understanding. Not forgetting the close to humourous &#8216;confidence&#8217; many of their ignorant chests are filled with!<\/p>\n<p>His statement: &#8220;..Now, we wait for your reply or your tawba!..&#8221; is actually an invitation to play &#8216;Ping-Pong&#8217; with them which is something i refuse to do! But i will say this..<\/p>\n<p>He accuses me of ignorance in the affairs of the adeedah as is their normal practice (though i have been aquainted with this hadeeth for more than 15 years since studying the explanation of Al Aqeedatut Tahaawiyah of Ibn Abil &#8216;Izz Al Hanafi with our Shaikh Ali Naasir Al faqeehi in Madina in the mid ninties!)<\/p>\n<p>But this ‘Defense’ of theirs is nothing but more evidence of their Jahl!<\/p>\n<p>For your information, this hadeeth has been discussed and used by three sets of people. It has been discussed by the Qadariyah, it has been used by the Jabariyah and it has been used ‘correctly’ by Ahlus Sunnah. Each of them UNDERSTAND the hadeeth in accordance with their belief.<\/p>\n<p>Al Haafidh Ibn Hajr mentions in ‘Fathul Baari (18\/284)<\/p>\n<p>“قَالَ وَهَذَا فَصْل الْخِطَاب مَعَ الْجَبْرِيَّة الَّذِينَ أَنْكَرُوا أَنْ تَكُون الْأَعْمَال سَبَبًا فِي دُخُول الْجَنَّة مِنْ كُلّ وَجْه ، وَالْقَدَرِيَّة الَّذِينَ زَعَمُوا أَنَّ الْجَنَّة عِوَضُ الْعَمَل وَأَنَّهَا ثَمَنه وَأَنَّ دُخُولهَا بِمَحْضِ الْأَعْمَال ، وَالْحَدِيث يُبْطِل دَعْوَى الطَّائِفَتَيْنِ وَاَللَّه أَعْلَم<\/p>\n<p><em>This is the determining factor between the belief of the Jabariyah those who reject the fact that ones actions may be a cause for an individual entering Jannah, and between the Qadariyah who claim that Jannah is granted to a person in exchange for his actions, but this hadeeth (actually) nullifies the claim of both parties<\/em>..”<\/p>\n<p>The Jabariyah then, hold that ones actions are not a cause for one entering jannah (since they believe that we are taken by predecree like feathers are taken by wind and our actions have no effect upon our final destination).<\/p>\n<p>Since this is their belief they use the hadeeth in question to establish that Allah does with us that which he wills (i.e. without our actions coming into play and having any effect upon our outcome) therefore this hadeeth is from the strongest of that which they use to substantiate their belief.<\/p>\n<p>Particularly the statement of the Messenger Saw “<strong><em>If Allah were to punish the inhabitants of the heaven and the inhabitants of earth he would punish them without oppressing them<\/em><\/strong>..”<\/p>\n<p>They hold that this hadeeth establishes their belief that we are like feathers in the wind<\/p>\n<p>After mentioning the Hadeeth Ibn Abil ‘Izz Al Hanafi mentions in his explanation of Al Aqeedah At Tahaawiyah<\/p>\n<p>&#8220;<em><strong>This Hadeeth is from that which the Jabariyyah use as evidence (i.e. for their belief)..&#8221; <\/strong><\/em><\/p>\n<p><em>As for the Qadariyah then it is not relevant to their false principles so they either receive it with rejection or interpretation. The best of the people in its regard are Ahlus Sunnah<\/em>..”<\/p>\n<p>(Sharhul Aqeedatit Tahaawiyah)<\/p>\n<p>So do we now say as Al Hajooris defenders say “Oh the Jabariyah were only quoting the hadeeth!!”<\/p>\n<p>Ibnil Qayyim Mentions concerning the Hadeeth in ‘Miftaahu Daaris Sa’aadah:<\/p>\n<p><em><em>“Thus his mercy is not an exchange for their actions, neither is it a fruit of their actions, rather it is greater than their actions as occurs in the same hadeeth “<strong>If he were to be merciful to them then his mercy would be better for them than their actions<\/strong><\/em><\/em>..”<\/p>\n<p><em>So he gathered between both affairs in the hadeeth that is (the clarification of the fact that) if he punished them he would punish them DUE TO THEM BEING DESERVED OF THAT and he would not have oppressed them. And if he had mercy upon them then that would be purely due to virtue from him and benevolence not because of their actions<\/em>..”<\/p>\n<p>Thus Ahlus Sunnah understand that the hadeeth is held to mean that if Allah were to punish all of the inhabitants of the heavens and the earth he would do so because THEY WERE DESERVED OF PUNISHMENT hence he would not have wronged them.<\/p>\n<p>The problem with the speech of Al Hajoori is that his speech is connected to an earlier statement (as we mentioned in the beginning of the article these were merely bullet points and was not meant to be a breakdown of the issues)<\/p>\n<p>Al Hajoori mentions in ‘Al Minnatul Ilaahiyah bi Sharhil Aqeedatus Safaareeniyah P153) quoting one of the mistakes of Imaam Safaareeni who said in some lines of poetry:<\/p>\n<p>“<em><strong>And it is possible for our patron (Allah) to punish his creation * <strong>WITHOUT THEM HAVING SINNED OR COMMITED ANY CRIME<\/strong><\/strong><\/em>!”<\/p>\n<p>This statement of Safaareeni is the exact statement of the Jabariyah those who say that Allah does with us as he wills and our actions play no part in our outcome! Instead of doing that which all of the scholars who explain it do which is to hasten to highlight the error of this statement. And that it is in accordance to the belief of the Jabariyyah and that Ahlus Sunnah hold such and such.<\/p>\n<p>Instead he says:<\/p>\n<p>&#8220;What is <strong>EVEN BETTER<\/strong>(!) (Ahsan Min Haadhaa) than this, is the statement of Imaam At Tahaawi:<\/p>\n<p>“<em>He guides who he wills and he protects and pardons from his virtue. He misguides who he wills and he forsakes them and tests them from his justice, all of them revolve around his will, between his virtue and his justice<\/em>”<\/p>\n<p>then he says:<\/p>\n<p>Allah says: “ <strong><em>He will not be asked about what he does but they will be asked<\/em><\/strong>”(Suratul Anbiyaa 23)<\/p>\n<p>Allah pardons and is benevolent.<\/p>\n<p>He says: “<strong><em>If it were not for the virtue of Allah upon you then none of you would be purified ever but indeed Allah purifies whosoever he wills<\/em><\/strong>” (Suratun Noor Vs 21)<\/p>\n<p>Then he quotes: “<strong>So Virtue is for Allah before and after if Allah were to punish All of his worshippers he would not have oppressed them, and if he is merciful to them then it would be due to his virtue, his favour and his generosity<\/strong>..”<\/p>\n<p>So as you can see the statement is devoid of the necessary explanation of the correct position of Ahlus Sunnah. And even though the statement of Imaam Tahaawi that he quotes is correct it does not sufficiently clarify the error or clarify the position of Ahlus Sunnah in regards to the Justice of Allah.<\/p>\n<p>So I ask you, what will the reader walk away with?<\/p>\n<p>Would he walk away correctly understanding the aqeedah of Ahlis Sunnah in relation to the justice of Allah and being clear about the error of As Safaarini or will he walk away with the aqeedah of the Jahmiyah (who are Jabariyah in regards to Qadr)?<\/p>\n<p>Where is the clarification that we would expect from a small student of knowledge much less ‘An Naasihul Ameen!!<\/p>\n<p>So the issue is not an issue of quotation of Hadeeth alone! If that were the case then the people of bid’ah would be correct in that which they say or hold since many of them just ‘quote the hadeeth!’<\/p>\n<p>Wallahu A&#8217;lam<\/p>\n<p>On hajoori: http:\/\/ah-sp.com\/2013\/03\/15\/oh-yahyaa-hold-onto-the-book-with-firm-strength-i-e-hold-fast-to-it-suratul-maryam-vs-13\/<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article responds to criticisms regarding a previous post on the beliefs of Al-Hajoori. It clarifies the importance of proper explanation alongside quoted hadiths and the dangers of misleading interpretations concerning the justice of Allah.<\/p>\n","protected":false},"author":1,"featured_media":9118,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3,4,6,11,12,16,17,18],"tags":[],"class_list":["post-946","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-aqeedah","category-bidah","category-dawah","category-hadeeth","category-manhaj","category-sects-and-groups","category-tafseer","category-the-scholars"],"aioseo_notices":[],"jetpack_featured_media_url":"https:\/\/abuhakeem.com\/wp-content\/uploads\/2013\/07\/100-Observations-Against-Al-Hajoori-Point-13.jpg","jetpack_sharing_enabled":true,"jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/946","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/comments?post=946"}],"version-history":[{"count":0,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/posts\/946\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media\/9118"}],"wp:attachment":[{"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/media?parent=946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/categories?post=946"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abuhakeem.com\/wp-json\/wp\/v2\/tags?post=946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}