{"id":34784,"date":"2020-12-24T11:12:23","date_gmt":"2020-12-24T07:12:23","guid":{"rendered":"https:\/\/abuaminaelias.com\/dailyhadithonline\/?p=34784"},"modified":"2020-12-24T12:21:40","modified_gmt":"2020-12-24T08:21:40","slug":"prophets-astonishing-dream","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/24\/prophets-astonishing-dream\/","title":{"rendered":"Hadith on Akhirah: The Prophet’s astonishing dream of the Hereafter"},"content":{"rendered":"<p>Abdur Rahman ibn Samurah reported: The Messenger of Allah, peace and blessings be upon him, came out to us and he said, “<strong>Verily, I saw something wondrous last night. I saw a man of my nation as angels were holding him back, and his ablution came to save him from that. I saw a man of my nation surrounded by devils, and the remembrance of Allah came to free him from them. I saw a man of my nation suffering from extreme thirst, and his fasting in Ramadan came to give him drink. I saw a man of my nation with darkness before him, darkness behind him, darkness to his right, darkness to his left, darkness above him, and darkness below him, and his pilgrimages came to bring him out of darkness. I saw a man of my nation to whom the angel of death came to take his soul, and his righteousness to his parents came and turned the angel back. I saw a man of my nation to whom the believers would not speak, and his maintenance of family ties came and it said, ‘Verily, he is one who has maintained family ties, so speak to him,’ and he became one of them. I saw a man of my nation come to people sitting in circles and every circle he came to drove him away, and his ritual bath from major impurity led him by the hand and seated him next to them. I saw a man of my nation shielding his face from the heat of the Hellfire, and his charity came to give him shade and cover his face. I saw a man of my nation to whom the angels of punishment came, and his enjoining good and forbidding evil came to save him from that. I saw a man of my nation falling into the Hellfire, and the tears which he shed for reverence of Allah came to pull him out of the Fire. I saw a man of my nation whose scroll fell into his left hand, and his fear of Allah came to place his scroll in his right hand. I saw a man of my nation swaying in the wind like a palm tree, and his good thoughts of Allah came to calm his shaking. I saw a man of my nation crawling across the bridge over Hell, at times kneeling, at times clinging to it, and his blessings over me came to take him by the hand and stand him up upon the bridge until he passed over it. I saw a man of my nation who was stopped at the gates of Paradise and every gate was locked for him, and his testimony that there is no God but Allah came to take him by the hand and lead him into Paradise.<\/strong>”<\/p>\n<p>Source: al-Mu’jam al-Kabīr 39<\/p>\n<p>Grade: <strong><em>Sahih li ghayrihi<\/em><\/strong> (authentic due to external evidence) according to Ibn Taymiyyah<\/p>\n<p style=\"text-align: right;\">عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ <strong>إِنِّي رَأَيْتُ الْبَارِحَةَ عَجَبًا رَأَيْتُ رَجُلًا مِنْ أُمَّتِي قَدِ احْتَوَشَتْهُ مَلَائِكَةٌ فَجَاءَهُ وُضُوؤُهُ فَاسْتَنْقَذَهُ مِنْ ذَلِكَ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي قَدِ احْتَوَشَتْهُ الشَّيَاطِينُ فَجَاءَهُ ذِكْرُ اللَّهِ فَخَلَّصَهُ مِنْهُمْ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَلْهَثُ عَطَشًا مِنَ الْعَطَشِ فَجَاءَهُ صِيَامُ رَمَضَانَ فَسَقَاهُ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي بَيْنَ يَدَيْهِ ظُلْمَةٌ وَمِنْ خَلْفِهِ ظُلْمَةٌ وَعَنْ يَمِينِهِ ظُلْمَةٌ وَعَنْ شِمَالِهِ ظُلْمَةٌ وَمِنْ فَوْقِهِ ظُلْمَةٌ وَمِنْ تَحْتِهِ ظُلْمَةٌ فَجَاءَهُ حَجُّهُ وَعُمْرَتُهُ فَاسْتَخْرَجَاهُ مِنَ الظُّلْمَةِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي جَاءَهُ مَلَكُ الْمَوْتِ يَقْبِضُ رُوحَهُ فَجَاءَهُ بِرُّهُ بِوَالِدَيْهِ فَرَدَّهُ عَنْهُ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يُكَلِّمُ الْمُؤْمِنِينَ وَلَا يُكَلِّمُوهُ فَجَاءَتْهُ صِلَةُ الرَّحِمِ فَقَالَتْ إِنَّ هَذَا وَاصِلٌ كَانَ وَاصِلًا لِرَحِمِهِ فَكَلَّمَهُمْ وَكَلَّمُوهُ وَصَارَ مَعَهُمْ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَأْتِي النَّاسَ وَهُمْ حِلَقٌ فَكُلَّمَا أَتَى عَلَى حَلْقَةٍ طُرِدَ فَجَاءَهُ اغْتِسَالُهُ مِنَ الْجَنَابَةِ فَأَخَذَهُ بِيَدِهِ فَأَجْلَسَهُ مَعَهُمْ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَتَّقِي وَهَجَ النَّارِ بِيَدَيْهِ عَنْ وَجْهِهِ فَجَاءَتْهُ صَدَقَتُهُ وَصَارَتْ ظِلًّا عَلَى رَأْسِهِ وَسِتْرًا عَلَى وَجْهِهِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي جَاءَتْهُ زَبَانِيَةُ الْعَذَابِ فَجَاءَهُ أَمْرُهُ بِالْمَعْرُوفِ وَنَهْيُهُ عَنِ الْمُنْكَرِ فَاسْتَنْقَذَهُ مِنْ ذَلِكَ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي هَوَى فِي النَّارِ فَجَاءَتْهُ دُمُوعُهُ الَّتِي بَكَى مِنْ خَشْيَةِ اللَّهِ فَأَخْرَجَتْهُ مِنَ النَّارِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي قَدْ هَوَتْ صَحِيفَتُهُ إِلَى شِمَالِهِ فَجَاءَهُ خَوْفُهُ مِنَ اللَّهِ فَأَخَذَ صَحِيفَتَهُ فَجَعَلَهَا فِي يَمِينِهِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَرْعَدُ كَمَا تَرْعَدُ السَّعَفَةُ فَجَاءَهُ حُسْنُ ظَنِّهِ بِاللَّهِ فَسَكَّنَ رِعْدَتَهُ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَزْحَفُ عَلَى الصِّرَاطِ مَرَّةً وَيَجْثُو مَرَّةً وَيَتَعَلَّقُ مَرَّةً فَجَاءَتْهُ صَلَاتُهُ عَلَيَّ فَأَخَذَتْ بِيَدِهِ فَأَقَامَتْهُ عَلَى الصِّرَاطِ حَتَّى جَاوَزَ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي انْتَهَى إِلَى أَبْوَابِ الْجَنَّةِ فَغُلِّقَتِ الْأَبْوَابُ دُونَهُ فَجَاءَتْهُ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَأَخَذَتْهُ بِيَدِهِ فَأَدْخَلَتْهُ الْجَنَّةَ<\/strong><\/p>\n<p style=\"text-align: right;\">39 المعجم الكبير الأحاديث الطوال حديث عبد الرحمن بن سمرة<\/p>\n<p style=\"text-align: right;\">113 المحدث ابن تيمية خلاصة حكم المحدث شواهد الصحية عليه في الوابل الصيب<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Abdur Rahman ibn Samurah reported: The Messenger of Allah, peace and blessings be upon him, came out to us and he said, “Verily, I saw something wondrous last night. I [&hellip;]<\/p>\n","protected":false},"author":3712,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[3],"tags":[171,93,333,367,254,8,336,10,168,243,181,11,12,357,366,100,465,736,57,141,159,127,724,29,40,37,20,105,317,92,363,273,64,468,314,555,537,774,472,30,331,362],"class_list":["post-34784","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-ablution-wudu","tag-angels-malaikah","tag-bathing-ghusl","tag-bridge-over-hell-sirat","tag-calmness-al-sakinah","tag-charity-al-sadaqah","tag-cleanliness-al-taharah","tag-day-of-resurrection","tag-death-mawt","tag-dreams-al-ruyaa","tag-enjoining-good","tag-family-ties-silat-rahim","tag-fasting-al-siyam","tag-fear-al-khawf","tag-gates-of-paradise-abwab-jannah","tag-god-fearing-taqwa","tag-good-deeds-hasanat","tag-good-expectations-husn-al-dhann","tag-pilgrimage-hajj","tag-hellfire-nar-jahannam","tag-hereafter-akhirah","tag-intercession-al-shifaa","tag-major-impurity-al-junub","tag-monotheism-tawhid","tag-paradise-jannah","tag-parents-walidayn","tag-prayer-al-salat","tag-ramadan","tag-records","tag-remembrance-al-dhikr","tag-reverence-al-khushu","tag-reward-al-ajr","tag-satan-shaytan","tag-self-al-nafs","tag-shade-al-thill","tag-spirit-ar-ruh","tag-trees","tag-al-ummah","tag-lesser-pilgrimage-umrah","tag-unseen-al-ghayb","tag-water-al-maa","tag-weeping-al-baka"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p95VHY-932","jetpack_sharing_enabled":true,"jetpack-related-posts":[{"id":6568,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/hajj-umrah-rewarded-forgiveness\/","url_meta":{"origin":34784,"position":0},"title":"Hadith on Umrah: Two pilgrimages rewarded with forgiveness","author":"Abu Amina Elias","date":"September 17, 2012","format":false,"excerpt":"Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said, “The 'Umrah pilgrimage to the following 'Umrah will expiate whatever sins were committed between them, and the blessed Hajj pilgrimage has no reward other than Paradise.” Source: Ṣaḥīḥ al-Bukhārī 1773, Ṣaḥīḥ Muslim 1349 Grade: Muttafaqun Alayhi…","rel":"","context":"In &quot;Sin الإثم&quot;","block_context":{"text":"Sin الإثم","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/sin-al-ithm\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":9969,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/25\/hajj-mabrur-umrah-sadaqah\/","url_meta":{"origin":34784,"position":1},"title":"Hadith on Hajj: Speak kind words, feed poor in pilgrimage","author":"Abu Amina Elias","date":"November 25, 2012","format":false,"excerpt":"Jabir ibn Abdullah reported: The Prophet, peace and blessings be upon him, said, “The righteous Hajj pilgrimage has no reward but Paradise.” Jabir said, “What is its righteousness?” The Prophet said, “To feed the poor and speak kind words.” Source: al-Mu’jam al-Awsaṭ 8629 Grade: Sahih li ghayrihi (authentic due to external…","rel":"","context":"In &quot;Faith الايمان&quot;","block_context":{"text":"Faith الايمان","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":38371,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/10\/24\/hajj-purifies-sin\/","url_meta":{"origin":34784,"position":2},"title":"Hadith on Hajj: Pilgrimage purifies from sins and poverty","author":"Abu Amina Elias","date":"October 24, 2022","format":false,"excerpt":"Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said, “Perform the Hajj and ‘Umrah pilgrimages, one after another, for they both erase poverty and sins just as the furnace removes impurity from iron, gold, and silver. There is no reward for an accepted Hajj…","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":38039,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/07\/29\/ask-allah-firdaus\/","url_meta":{"origin":34784,"position":3},"title":"Hadith on Firdaws: One hundred levels in Paradise beneath the Throne","author":"Abu Amina Elias","date":"July 29, 2022","format":false,"excerpt":"Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said, “Whoever fasts the month of Ramadan, performs the prayers, and makes the Hajj pilgrimage to the House, it is a duty upon Allah to forgive him whether he emigrates in the path of Allah or…","rel":"","context":"In &quot;Faith الايمان&quot;","block_context":{"text":"Faith الايمان","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":33186,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/13\/talbiyah-raised-voice\/","url_meta":{"origin":34784,"position":4},"title":"Hadith on Talbiyah: Raising voice in answering call to pilgrimage","author":"Abu Amina Elias","date":"August 13, 2019","format":false,"excerpt":"Abu Huraira reported: The Prophet, peace and blessings be upon him, said, “A pilgrim never raises his voice answering the call to Allah but that he is given glad tidings, and a pilgrim never raises his voice in exalting Allah but that he is given glad tidings.” It was said, “O…","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":33950,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/01\/27\/five-deeds-to-enter-jannah\/","url_meta":{"origin":34784,"position":5},"title":"Hadith on Jannah: Five deeds for the faithful to enter Paradise","author":"Abu Amina Elias","date":"January 27, 2020","format":false,"excerpt":"Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said, “Whoever comes with five deeds, along with faith, will enter Paradise: one who preserves the five prayers, their ablution, their bowings, their prostrations, and their timings, who fasts the month of Ramadan, who performs Hajj pilgrimage…","rel":"","context":"In &quot;Faith الايمان&quot;","block_context":{"text":"Faith الايمان","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts\/34784","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/users\/3712"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/comments?post=34784"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts\/34784\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/media?parent=34784"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/categories?post=34784"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/tags?post=34784"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}