{"id":35199,"date":"2021-02-11T10:55:47","date_gmt":"2021-02-11T06:55:47","guid":{"rendered":"https:\/\/abuaminaelias.com\/dailyhadithonline\/?p=35199"},"modified":"2021-02-11T10:55:47","modified_gmt":"2021-02-11T06:55:47","slug":"three-men-cave","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/02\/11\/three-men-cave\/","title":{"rendered":"Hadith on Tawassul: Story of three men in the cave"},"content":{"rendered":"<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said, “<strong>While three men were walking, they were overcome by rain and took refuge in a cave in a mountain. A boulder fell over the mouth of their cave, blocking them inside. One of them said to the others, ‘Look at the good deeds you have done for Allah that you may call upon Allah Almighty by them, for perhaps He will relieve you.’ One of them said, ‘O Allah, I had two old parents with my wife and young child. I tended to a flock and when evening came, I milked them and served my parents first before my child. One day I went in search of fodder and I did not come back until it was evening. I found them both sleeping, so I milked as I had done before. I brought the milk and stood by their heads, for I hated to disrupt their sleep or to serve my child before both of them. My child was crying at my feet, yet I continued standing over them until the approach of dawn. If You know I had done that seeking Your countenance, then relieve us of this distress that we might see the sky!’ Allah shifted the boulder until they could see the sky. Another man said, ‘O Allah, I had a cousin whom I loved more than any man could love women. I presented myself to her and she refused unless I could give her one hundred coins. I worked hard until I gathered one hundred coins and brought them to her. When I prepared myself between her legs, she said: O servant of Allah, fear Allah and do not break the hymen without right to do so! I stood and left her. If You know I had done that seeking your Face, then relieve us of this distress!’ The boulder was again shifted for them. The last man said, ‘O Allah, I employed a worker for a portion of rice. When he finished his work, he said: Give me what I deserve! I offered his share to him but he did not accept it. I continued planting his share until I had amassed cows and flocks. Then he came to me and he said: Fear Allah and do not violate my rights! I said: Go to this cow and its flocks and take them. He said: Fear Allah and do not mock me! I said: I do not mock you, take that cow and its flocks. So he took them and he left. If You know I had done that seeking Your face, then relieve us of what remains!’ Then Allah relieved them of what remained.<\/strong>”<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3465, Ṣaḥīḥ Muslim 2473<\/p>\n<p>Grade: <strong><em>Muttafaqun Alayhi<\/em><\/strong> (authenticity agreed upon) according to Al-Bukhari and Muslim<\/p>\n<p style=\"text-align: right;\">عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ<strong> بَيْنَمَا ثَلَاثَةُ نَفَرٍ يَتَمَشَّوْنَ أَخَذَهُمْ الْمَطَرُ فَأَوَوْا إِلَى غَارٍ فِي جَبَلٍ فَانْحَطَّتْ عَلَى فَمِ غَارِهِمْ صَخْرَةٌ مِنْ الْجَبَلِ فَانْطَبَقَتْ عَلَيْهِمْ فَقَالَ بَعْضُهُمْ لِبَعْضٍ انْظُرُوا أَعْمَالًا عَمِلْتُمُوهَا صَالِحَةً لِلَّهِ فَادْعُوا اللَّهَ تَعَالَى بِهَا لَعَلَّ اللَّهَ يَفْرُجُهَا عَنْكُمْ فَقَالَ أَحَدُهُمْ اللَّهُمَّ إِنَّهُ كَانَ لِي وَالِدَانِ شَيْخَانِ كَبِيرَانِ وَامْرَأَتِي وَلِي صِبْيَةٌ صِغَارٌ أَرْعَى عَلَيْهِمْ فَإِذَا أَرَحْتُ عَلَيْهِمْ حَلَبْتُ فَبَدَأْتُ بِوَالِدَيَّ فَسَقَيْتُهُمَا قَبْلَ بَنِيَّ وَأَنَّهُ نَأَى بِي ذَاتَ يَوْمٍ الشَّجَرُ فَلَمْ آتِ حَتَّى أَمْسَيْتُ فَوَجَدْتُهُمَا قَدْ نَامَا فَحَلَبْتُ كَمَا كُنْتُ أَحْلُبُ فَجِئْتُ بِالْحِلَابِ فَقُمْتُ عِنْدَ رُءُوسِهِمَا أَكْرَهُ أَنْ أُوقِظَهُمَا مِنْ نَوْمِهِمَا وَأَكْرَهُ أَنْ أَسْقِيَ الصِّبْيَةَ قَبْلَهُمَا وَالصِّبْيَةُ يَتَضَاغَوْنَ عِنْدَ قَدَمَيَّ فَلَمْ يَزَلْ ذَلِكَ دَأْبِي وَدَأْبَهُمْ حَتَّى طَلَعَ الْفَجْرُ فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ لَنَا مِنْهَا فُرْجَةً نَرَى مِنْهَا السَّمَاءَ فَفَرَجَ اللَّهُ مِنْهَا فُرْجَةً فَرَأَوْا مِنْهَا السَّمَاءَ وَقَالَ الْآخَرُ اللَّهُمَّ إِنَّهُ كَانَتْ لِيَ ابْنَةُ عَمٍّ أَحْبَبْتُهَا كَأَشَدِّ مَا يُحِبُّ الرِّجَالُ النِّسَاءَ وَطَلَبْتُ إِلَيْهَا نَفْسَهَا فَأَبَتْ حَتَّى آتِيَهَا بِمِائَةِ دِينَارٍ فَتَعِبْتُ حَتَّى جَمَعْتُ مِائَةَ دِينَارٍ فَجِئْتُهَا بِهَا فَلَمَّا وَقَعْتُ بَيْنَ رِجْلَيْهَا قَالَتْ يَا عَبْدَ اللَّهِ اتَّقِ اللَّهَ وَلَا تَفْتَحْ الْخَاتَمَ إِلَّا بِحَقِّهِ فَقُمْتُ عَنْهَا فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ لَنَا مِنْهَا فُرْجَةً فَفَرَجَ لَهُمْ وَقَالَ الْآخَرُ اللَّهُمَّ إِنِّي كُنْتُ اسْتَأْجَرْتُ أَجِيرًا بِفَرَقِ أَرُزٍّ فَلَمَّا قَضَى عَمَلَهُ قَالَ أَعْطِنِي حَقِّي فَعَرَضْتُ عَلَيْهِ فَرَقَهُ فَرَغِبَ عَنْهُ فَلَمْ أَزَلْ أَزْرَعُهُ حَتَّى جَمَعْتُ مِنْهُ بَقَرًا وَرِعَاءَهَا فَجَاءَنِي فَقَالَ اتَّقِ اللَّهَ وَلَا تَظْلِمْنِي حَقِّي قُلْتُ اذْهَبْ إِلَى تِلْكَ الْبَقَرِ وَرِعَائِهَا فَخُذْهَا فَقَالَ اتَّقِ اللَّهَ وَلَا تَسْتَهْزِئْ بِي فَقُلْتُ إِنِّي لَا أَسْتَهْزِئُ بِكَ خُذْ ذَلِكَ الْبَقَرَ وَرِعَاءَهَا فَأَخَذَهُ فَذَهَبَ بِهِ فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ لَنَا مَا بَقِيَ فَفَرَجَ اللَّهُ مَا بَقِيَ<\/strong><\/p>\n<p style=\"text-align: right;\">3465 صحيح البخاري كتاب أحاديث الأنبياء باب حديث الغار<\/p>\n<p style=\"text-align: right;\">2473 صحيح مسلم كتاب الرقاق باب قصة أصحاب الغار الثلاثة والتوسل بصالح الأعمال<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said, “While three men were walking, they were overcome by rain and took refuge in a [&hellip;]<\/p>\n","protected":false},"author":3712,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[175,416,308,153,438,263,100,465,398,46,383,335,541,458,37,539,287,25,533,115,304,28,822,214,19],"class_list":["post-35199","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adultery-zina","tag-agreed-upon-muttafaqun-alayhi","tag-chastity-al-husn","tag-children-al-awlad","tag-face-of-allah","tag-food-al-taam","tag-god-fearing-taqwa","tag-good-deeds-hasanat","tag-israelites-banu-israeel","tag-love-al-mahabbah","tag-lusts-shahawat","tag-milk-al-laban","tag-mockery-al-sakhriyyah","tag-mountains","tag-parents-walidayn","tag-planting-al-zara","tag-rain-al-matr","tag-rights-al-huquq","tag-sheep-al-ghanam","tag-sincerity-al-ikhlas","tag-sleep-al-nawm","tag-supplication-al-dua","tag-al-tawassul","tag-trade-al-tijarah","tag-wrongdoing-al-thulm"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p95VHY-99J","jetpack_sharing_enabled":true,"jetpack-related-posts":[{"id":6544,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/tawassul-call-upon-prophet\/","url_meta":{"origin":35199,"position":0},"title":"Hadith on Tawassul: Not calling on the Prophet after his death","author":"Abu Amina Elias","date":"September 17, 2012","format":false,"excerpt":"Anas ibn Malik reported: If a drought became threatening, Umar ibn al-Khattab, may Allah be pleased with him, would ask Al-'Abbas ibn Abdul Muttalib to supplicate for Allah to send rain. Umar would say, “O Allah, we used to ask our Prophet, peace and blessings be upon him, to supplicate…","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/wisdom-al-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":33283,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/22\/tawassul-prophet-dua-in-life\/","url_meta":{"origin":35199,"position":1},"title":"Hadith on Tawassul: Seeking the Prophet’s supplication in his lifetime","author":"Abu Amina Elias","date":"August 22, 2019","format":false,"excerpt":"Uthman ibn Hunayf reported: A blind man came to the Prophet, peace and blessings be upon him, and he said, “Supplicate for Allah to heal me.” The Prophet said, “I will supplicate for you if you wish, or it is better for you to be patient if you wish.” The…","rel":"","context":"In &quot;Faith الايمان&quot;","block_context":{"text":"Faith الايمان","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":37176,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/19\/muawiyah-istisqa\/","url_meta":{"origin":35199,"position":2},"title":"Mu’awiyah on Tawassul: Supplications of living righteous people","author":"Abu Amina Elias","date":"October 19, 2021","format":false,"excerpt":"Sulaym ibn ‘Amir reported: The sky withheld rain, so Mu’awiyah ibn Abi Sufyan and the people of Damascus sought prayers for rain. When Mu’awiyah sat upon the pulpit, he said, “Where is Yazid ibn al-Aswad al-Jurashi?” Then, the people called for him and he came forward cutting through the crowd.…","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/wisdom-al-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":37139,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/14\/umar-grave-daniel\/","url_meta":{"origin":35199,"position":3},"title":"Umar on Idolatry: The Caliph hides the grave of Prophet Daniel","author":"Abu Amina Elias","date":"October 14, 2021","format":false,"excerpt":"Anas reported: When they liberated Tustar, they found a man with a long nose in a coffin. The people were seeking victory and seeking rain through him. Abu Musa wrote to Umar ibn al-Khattab, may Allah be pleased with him, about that. Umar wrote back, saying, “Indeed, this man is…","rel":"","context":"In &quot;Scholars العلماء&quot;","block_context":{"text":"Scholars العلماء","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/scholars-ulema\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2921,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/16\/prophet-abu-bakr-cave-hijrah\/","url_meta":{"origin":35199,"position":4},"title":"Hadith on Tawakkul: The Prophet and Abu Bakr trust Allah in the cave","author":"Abu Amina Elias","date":"April 16, 2012","format":false,"excerpt":"Abu Bakr reported: I saw the feet of the idolaters over our heads while we were hiding in the cave, fleeing to Medina. I said, “O Messenger of Allah, if one of them only looked under his feet, he would see us!” The Messenger of Allah, peace and blessings be…","rel":"","context":"In &quot;Faith الايمان&quot;","block_context":{"text":"Faith الايمان","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":7672,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/dua-prophet-rain-miracle\/","url_meta":{"origin":35199,"position":5},"title":"Hadith on Miracles: The Prophet prays for rain, it rains","author":"Abu Amina Elias","date":"October 5, 2012","format":false,"excerpt":"Anas ibn Malik reported: A man came to the Prophet, peace and blessings be upon him, on Friday while he was delivering a sermon in Medina. The man said, “There is no rain, so please call upon your Lord to bless us with rain.” The Prophet looked at the sky…","rel":"","context":"In &quot;Faith الايمان&quot;","block_context":{"text":"Faith الايمان","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts\/35199","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/users\/3712"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/comments?post=35199"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts\/35199\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/media?parent=35199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/categories?post=35199"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/tags?post=35199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}