{"id":37666,"date":"2022-01-21T10:29:32","date_gmt":"2022-01-21T06:29:32","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/?p=37666"},"modified":"2022-01-21T10:29:32","modified_gmt":"2022-01-21T06:29:32","slug":"malik-bin-dinar-alcohol","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/01\/21\/malik-bin-dinar-alcohol\/","title":{"rendered":"Malik on Tawbah: Malik ibn Dinar’s story of repentance"},"content":{"rendered":"<p>Ibn Qudamah reported: Malik ibn Dinar, may Allah have mercy on him, was asked about the reason for his repentance and he said: I was an officer and I was given to drinking wine. When half the night had passed in the month of Sha’ban, which was Friday night, I became drunk from wine and I failed to perform the last evening prayer. I saw in a dream as if the Resurrection had begun, the trumpet was blown, the graves were overturned, and the creatures were gathered, and I was among them. I heard a sound behind me and I turned around to behold a great dragon, nothing more dark and blue, its mouth open and rushing towards me. I passed in front of it, fleeing in panic and terror, then an old man passed by my way. He had pure, clean clothes and a wonderful fragrance. I greeted him with peace and he returned it. I said, “Old man! Protect me from this dragon! I adjure you by Allah!” The old man wept and he said to me, “I am weak and this dragon is stronger than me. I have no power over it, but you must keep running, for perhaps Allah will grant you what can save you from it.” Then, I continued to flee in the other direction and I ascended the cliffs of the Resurrection until I came upon the plains of fire. I looked upon its horrors and I nearly passed away from the terror of the dragon. A voice called out, “Get back, for you are not one of its people!” I was put at rest by this voice and I turned back. The dragon turned back to pursue me and the old man came to me again. I said, “Old man! I asked you to protect me from this dragon and you were unable.” The old man wept and he said, “I am weak but retreat to this mountain, for within it are the lodgings of the Muslims. If it is for you, within it is a lodging and you will be helped.” I looked to the mountain and it was covered in silver, within which were open niches, curtains hanging upon every alley, and skylights fitted with red gold, separated by rubies, the constellation of each skylight was draped with pure silk. When I looked upon the mountain, I turned fleeing towards it and the dragon chased me from behind, until he came close to me and the voice of some angels cried out, “Pull aside the drapes, open the windows, and go inside! Perhaps for this danger among you is a lodging to protect one from his enemy!” Behold, the curtains were lifted, the windows were opened, and children emerged from these niches with faces like moons. The dragon drew closer to me and I was disheartened by my affair. Some of the children called out, “Woe to you! Enter, all of you, for one’s enemy is approaching him!” They entered, group after group, and I beheld my daughter who had died. She entered along with them. When she saw me, she wept and she said, “My father, by Allah!” She darted to me upon a cradle of light until she appeared before me. She reached with her left hand towards my right hand and held onto it, then she stretched forth her right hand towards the dragon and he turned to flee. Then, she gave me a seat and sat upon my lap. She struck my beard with her right hand and she said, “O father, is it not time for those with faith that their hearts be humbled by the remembrance of Allah?” (57:16). I wept and I said, “O my daughter, all of you know the Quran too?” She said, “O father, we know it better than you!” I said, “Tell me about the dragon that wanted to destroy me.” She said, “That was the strength of your evil deeds, so it wanted to consume you in the fire of Hell.” I said, “Tell me about the old man who passed by me.” She said, “O father, that was your righteous deeds, which had been weakened until they could no longer overpower your evil deeds.” I said, “O my daughter, what do you do in this mountain?” She said, “We are the children of the Muslims. We have settled therein until the Hour is established, waiting for it to come to pass such that we intercede for you.” I took this frightening experience to heart and I awoke sober, I broke my vessels, and I repented to Allah Almighty. That is the reason for my repentance.<\/p>\n<p>Source: al-Tawābīn li-Ibn Qudāmah 1\/124<\/p>\n<p style=\"text-align: right;\">عن ابن قدامة عن مالك بن دينار رحمه الله أنه سئل عن سبب توبته فقال كنت شرطيا وكنت منهمكا على شرب الخمر فلما كانت ليلة النصف من شعبان وكانت ليلة الجمعة بت ثملا من الخمر ولم أصل فيها عشاء الآخرة فرأيت فيما يرى النائم كأن القيامة قد قامت ونفخ في الصور وبعثرت القبور وحشر الخلائق وأنا معهم فسمعت حسا من ورائي فالتفت فإذا أنا بتنين أعظم ما يكون أسود أزرق قد فتح فاه مسرعا نحوي فمررت بين يديه هاربا فزعا مرعوبا فمررت في طريقي بشيخ نقي الثوب طيب الرائحة فسلمت عليه فرد السلام فقلت أيها الشيخ أجرني من هذا التنين أجارك الله فبكى الشيخ وقال لي أنا ضعيف وهذا أقوى مني وما أقدر عليه ولكن مر وأسرع فلعل الله أن يتيح لك ما ينجيك منه فوليت هاربا على وجهي فصعدت على شرف من شرف القيامة فأشرفت على طبقات النيران فنظرت إلى هولها وكدت أهوي فيها من فزع التنين فصاح بي صائح ارجع فلست من أهلها فاطمأننت إلى قوله ورجعت ورجع التنين في طلبي فأتيت الشيخ فقلت يا شيخ سألتك أن تجيرني من هذا التنين فلم تفعل فبكى الشيخ وقال أنا ضعيف ولكن سر إلى هذا الجبل فإن فيه ودائع المسلمين فإن كان لك فيه وديعة فستنصرك قال فنظرت إلى جبل مستدير من فضة وفيه كوى مخرمة وستور معلقة على كل خوخة وكوة مصراعان من الذهب الأحمر مفصلة باليواقيت مكوكبة بالدر على كل مصراع ستر من الحرير فلما نظرت إلى الجبل وليت إليه هاربا والتنين من ورائي حتى إذا قربت منه صاح بعض الملائكة ارفعوا الستور وافتحوا المصاريع وأشرفوا فلعل لهذا البائس فيكم وديعة تجيره من عدوه فإذا الستور قد رفعت والمصاريع قد فتحت فأشرف علي من تلك المخرمات أطفال بوجوه كالأقمار وقرب التنين مني فتحيرت في أمري فصاح بعض الأطفال ويحكم أشرفوا كلكم فقد قرب منه عدوه فأشرفوا فوجا بعد فوج وإذا أنا بابنتي التي ماتت قد أشرفت علي معهم فلما رأتني بكت وقالت أبي والله ثم وثبت في كفة من نور كرمية السهم حتى مثلت بين يدي فمدت يدها الشمال إلى يدي اليمنى فتعلقت بها ومدت يدها اليمنى إلى التنين فولى هاربا ثم أجلستني وقعدت في حجري وضربت بيدها اليمنى إلى لحيتي وقالت يا أبت أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ فبكيت وقلت يا بنية وأنتم تعرفون القرآن فقالت يا أبت نحن أعرف به منكم قلت فأخبريني عن التنين الذي أراد أن يهلكني قالت ذلك عملك السوء قويته فأراد أن يغرقك في نار جهنم قلت فأخبريني عن الشيخ الذي مررت به في طريقي قالت يا أبت ذلك عملك الصالح أضعفته حتى لم يكن له طاقة بعملك السوء قلت يا بنية وما تصنعون في هذا الجبل قالت نحن أطفال المسلمين قد أسكنا فيه إلى أن تقوم الساعة ننتظركم تقدمون علينا فنشفع لكم قال مالك فانتبهت فزعا وأصبحت فأرقت المسكر وكسرت الآنية وتبت إلى الله عز وجل وهذا كان سبب توبتي<\/p>\n<p style=\"text-align: right;\">1\/124 التوابين لابن قدامة<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ibn Qudamah reported: Malik ibn Dinar, may Allah have mercy on him, was asked about the reason for his repentance and he said: I was an officer and I was [&hellip;]<\/p>\n","protected":false},"author":3712,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[216],"tags":[467,153,10,243,357,347,465,51,141,159,50,127,313,301,458,92,23,363,348,304,865,345,238],"class_list":["post-37666","post","type-post","status-publish","format-standard","hentry","category-scholars-ulema","tag-bad-deeds-al-sayyiat","tag-children-al-awlad","tag-day-of-resurrection","tag-dreams-al-ruyaa","tag-fear-al-khawf","tag-gold-al-dhahab","tag-good-deeds-hasanat","tag-hearts-al-qulub","tag-hellfire-nar-jahannam","tag-hereafter-akhirah","tag-humility-al-tawadu","tag-intercession-al-shifaa","tag-light-al-nur-noor","tag-moon-qamar","tag-mountains","tag-remembrance-al-dhikr","tag-repentance-al-tawbah","tag-reverence-al-khushu","tag-silver-al-fiddah","tag-sleep-al-nawm","tag-surah-al-hadeed","tag-warning-al-nudhr","tag-wine-al-khamr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p95VHY-9Nw","jetpack_sharing_enabled":true,"jetpack-related-posts":[{"id":35420,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/03\/23\/malik-weeping\/","url_meta":{"origin":37666,"position":0},"title":"Malik on Tawbah: Crying in repentance removes sins like wind","author":"Abu Amina Elias","date":"March 23, 2021","format":false,"excerpt":"Khazim ibn Husayn reported: Malik ibn Dinar, may Allah have mercy on him, said, “To weep over a mistake will dispel sins just as the wind dispels dry leaves.” Source: al-Riqqah wal-Bukā' li-Ibn Abī al-Dunyā 25 عَنَ خَازِمِ بْنِ حُسَيْنٍ عَنْ مَالِكِ بْنِ دِينَارٍ رحمه الله قَالَ الْبُكَاءُ عَلَى الْخَطِيئَةِ…","rel":"","context":"In &quot;Scholars العلماء&quot;","block_context":{"text":"Scholars العلماء","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/scholars-ulema\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17669,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/20\/best-sinners-repentance\/","url_meta":{"origin":37666,"position":1},"title":"Hadith on Tawbah: Best sinners are those who repent","author":"Abu Amina Elias","date":"January 20, 2014","format":false,"excerpt":"Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said, “All of the children of Adam are sinners, and the best sinners are those who repent.” Source: Sunan al-Tirmidhī 2499 Grade: Qawi (strong) according to Ibn Hajar عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ…","rel":"","context":"In &quot;Sin الإثم&quot;","block_context":{"text":"Sin الإثم","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/sin-al-ithm\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":32472,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/tawbah-bidah-innovation\/","url_meta":{"origin":37666,"position":2},"title":"Hadith on Bid’ah: Repentance not accepted until heresy abandoned","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said, “Verily, Allah veils repentance from the practitioner of any heresy.” Source: al-Mu’jam al-Awsaṭ lil-Ṭabarānī 4204 Grade: Sahih (authentic) according to Al-Albani عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ…","rel":"","context":"In &quot;Sin الإثم&quot;","block_context":{"text":"Sin الإثم","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/sin-al-ithm\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22480,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/07\/suppress-rage-save-adhab\/","url_meta":{"origin":37666,"position":3},"title":"Hadith on Anger: Suppressing anger saves from punishment","author":"Abu Amina Elias","date":"April 7, 2016","format":false,"excerpt":"Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said, “Whoever restricts his tongue, Allah will cover his faults. Whoever restrains his anger, Allah will restrain his punishment on the Day of Resurrection. Whoever apologizes to Allah, Allah Almighty will accept his apology.” Source: Shu’ab…","rel":"","context":"In &quot;Sin الإثم&quot;","block_context":{"text":"Sin الإثم","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/sin-al-ithm\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":36237,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/sun-rises-west\/","url_meta":{"origin":37666,"position":4},"title":"Hadith on Tawbah: Repentance open until sun rises in West","author":"Abu Amina Elias","date":"May 21, 2021","format":false,"excerpt":"Safwan ibn ‘Assal reported: The Messenger of Allah, peace and blessings be upon him, said, “Verily, towards the Western sun is an open gate the length of which is seventy years of travel. It will remain open for repentance until the sun rises from there. When the sun rises from…","rel":"","context":"In &quot;Sin الإثم&quot;","block_context":{"text":"Sin الإثم","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/sin-al-ithm\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":36590,"url":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/06\/do-not-curse-rather-tawbah\/","url_meta":{"origin":37666,"position":5},"title":"Malik on Rulers: Do not curse kings, rather repent to Allah","author":"Abu Amina Elias","date":"June 6, 2021","format":false,"excerpt":"Salih al-Murri reported: Malik ibn Dinar, may Allah have mercy on him, said, “I have found in the Wisdom that Allah says: I am Allah, the King of kings. The hearts of the kings are in My hand. Whoever obeys Me, I will make them merciful to him, and whoever…","rel":"","context":"In &quot;Scholars العلماء&quot;","block_context":{"text":"Scholars العلماء","link":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/category\/scholars-ulema\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts\/37666","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/users\/3712"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/comments?post=37666"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/posts\/37666\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/media?parent=37666"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/categories?post=37666"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/wp-json\/wp\/v2\/tags?post=37666"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}