

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.nabahani.com/print.cfm?hgkkkoc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:15:47 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Nabahani.Com | Taqi  Al-Din Al-Nabahani and the Ba'thist Communist Influence Behind His Political Party (Hizb Al-Tahrir)</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/nabahani/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Nabahani.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Taqi  Al-Din Al-Nabahani and the Ba'thist Communist Influence Behind His Political Party (Hizb Al-Tahrir)</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Thursday, April, 12 2012 and
 filed under <a href="categories/cc-al-nabahani.html">Al-Nabahani</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/taqi-al-din-al-nabahani.html">
Taqi Al-Din Al-Nabahani 
</a> &#149; <a href="tags/marxism.html">
Marxism 
</a> &#149; <a href="tags/communism.html">
Communism 
</a> &#149; <a href="tags/jahmiyyah.html">
Jahmiyyah 
</a> &#149; <a href="tags/mutazilah.html">
Mu'tazilah 
</a> &#149; <a href="tags/ashariyyah.html">
Ash'ariyyah 
</a> &#149; <a href="tags/ahl-al-kalam-nu.html">
Ahl Al-Kalam 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<blockquote><font class='titleHeadline'>Introduction</font>    <P>
<img src=assets/images/nabahani-face-pic.gif align=right border=1 hspace=8 vspace=8 border=0><u>Taqi ud-Din an-Nabahani</u> (1909-1977CE) is the founder of the group "<b><a href='tags/hizb-ut-tahrir.html' class='tagLink'><font class='tagLink'>Hizb ut-Tahrir</font></a></b>", the picture on the right - taken in his early years - indicates the traditional <u>Azhari, Ash'ari</u> early upbringing.  He was an <u>Ash'ari</u> in <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> (mixed with some of usool of the <u><a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a></u>, <u><a href='tags/murjiah.html' class='tagLink'><font class='tagLink'>Murji'ah</font></a></u> and <u>Qadariyyah</u>). He is of Palestinian origin, coming from a Sufi family background. His maternal grandfather was <u>Yusuf bin Ismaa'eel an-Nabahani</u>, a fervent adherent of Tasawwuf and one who authored a book, "<i>Shawaahid ul-Haqq fil-Istighaathah bi Sayyid il-Khalq</i>", arguing for the justification of seeking and calling upon the Prophet (sallallaahu alayhi wasallam) for rescue from calamity in those things in which only Allaah has power and ability. Given this family background (Ash'ari Sufi with Mu'tazili, Qadariyy usool) it is not surprising to see that in all the books of Taqi ud-Din an-Nabahani, the grandson, the discussion of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> barely extends further than merely affirming Allaah's existence and around nine or ten attributes (which is not the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> that the Messengers came to establish).    <P>
Taqi ud-Din an-Nabahani authored a range of books outlining his own political philosophy including "<i>Nidhaam ul-Islaam</i>" and "<i>ash-Shakhsiyyah al-Islaamiyyah</i>". Like those before him such as <u>Hasan al-Banna</u> and <u><a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a></u>, an-Nabahani was an Ash'ari, Maturidi in his <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and carried some of the usool of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, and <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> in his works.  His goal, just like previous Ash'arites such as Hasan al-Banna and <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, was the restoration of the khilaafah, and he just like them, considered all Muslim lands to be lands of kufr in which a <a href='tags/revolution.html' class='tagLink'><font class='tagLink'>revolution</font></a>, ideological or otherwise, was obligatory. All of these ideologies of the 20th century came from <u>Ash'ari, Maturidi</u>, [Sufi] agitators who were far away from the creed (<a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>) of the Salaf, and were influenced - in their methodologies of reform - by the practical elements of the prevailing secular ideologies of their time, in particular <a href='tags/marxism.html' class='tagLink'><font class='tagLink'>Marxism</font></a> and <a href='tags/leninism.html' class='tagLink'><font class='tagLink'>Leninism</font></a>. When we come to realize that al-Nabahani was himself a Ba'thist Communist, his political ideology should no longer be surprising.    <P>
<font class='titleHeadline'>Taqi al-Din al-Nabahani and His Ba'thist Communist Heritage Which Was the Basis For His Political Party, Hizb al-Tahrir</font>    <P>
In the <i>Encyclopedia of Islamic Movements in the Arabic Nation, Turkey and Iran</i>, of Dr. Ahmad al-Mawsili, there occurs under an-Nabhani's entry (p. 407):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1578;&#1576;&#1606;&#1609; &#1604;&#1601;&#1578;&#1585;&#1577; &#1605;&#1606; &#1575;&#1604;&#1608;&#1602;&#1578; &#1593;&#1602;&#1610;&#1583;&#1577; &#1581;&#1586;&#1576; &#1575;&#1604;&#1576;&#1593;&#1579;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>For a period of time, he adopted the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> of Hizb ul-Ba'th (the Ba'th Party).</blockquote>    <P>
<a href=http://en.wikipedia.org/wiki/Abdullah_el_Tell>Abdullaah at-Tall</a> was an Arab Nationalist and Ba'thist, and he writes in his memoirs, referring to his sending of an-Nabahani to Damascus as part of a plan for a military coup, which eventually failed, and this is documented by him in his memoirs (<span class='arb' lang='AR-SA'>&#1603;&#1575;&#1585;&#1579;&#1577; &#1601;&#1604;&#1587;&#1591;&#1610;&#1606;</span>), "<i>Catastrophe of Palestine</i>" (1/591):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1601;&#1575;&#1582;&#1578;&#1585;&#1578; &#1588;&#1582;&#1589;&#1610;&#1606; &#1603;&#1575;&#1606;&#1575; &#1605;&#1608;&#1590;&#1593; &#1579;&#1602;&#1578;&#1610;&#1548; &#1608;&#1578;&#1585;&#1576;&#1591;&#1607;&#1605;&#1575; &#1589;&#1583;&#1575;&#1602;&#1577; &#1605;&#1578;&#1610;&#1606;&#1577; &#1608;&#1607;&#1605;&#1575;: &#1575;&#1604;&#1587;&#1610;&#1583; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1585;&#1610;&#1605;&#1575;&#1608;&#1610;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; (&#1578;&#1602;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610;). &#1608;&#1581;&#1605;&#1617;&#1604;&#1578;&#1607;&#1605;&#1575; &#1580;&#1608;&#1575;&#1586; &#1587;&#1601;&#1585;&#1610; &#1575;&#1604;&#1587;&#1610;&#1575;&#1587;&#1610; &#1604;&#1610;&#1602;&#1583;&#1605;&#1575;&#1607; &#1604;&#1604;&#1586;&#1593;&#1610;&#1605; &#1581;&#1587;&#1606;&#1610; &#1575;&#1604;&#1586;&#1593;&#1610;&#1605;&#1548; &#1603;&#1573;&#1588;&#1575;&#1585;&#1577; &#1605;&#1578;&#1601;&#1602; &#1593;&#1604;&#1610;&#1607;&#1575; &#1576;&#1610;&#1606;&#1606;&#1575;&#1548; &#1608;&#1578;&#1581;&#1585;&#1603; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604;&#1575;&#1606; &#1573;&#1604;&#1609; &#1583;&#1605;&#1588;&#1602; &#1601;&#1610; 7/5/1949&#1548; &#1576;&#1581;&#1580;&#1577; &#1588;&#1585;&#1575;&#1569; &#1608;&#1585;&#1602; &#1604;&#1580;&#1585;&#1610;&#1583;&#1577; &#1575;&#1604;&#1576;&#1593;&#1579;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I chose two individuals in whom I placed my trust, and who were tied together with very strong friendship, and they are as-Sayyid Abdullaah ar-Rimaawee and the Shaykh, Taqi ud-Din an-Nabahani. I tasked them with taking my political passport so that they can present it to the leader, <a href=http://en.wikipedia.org/wiki/Husni_al-Za%27im>Husni az-Za'eem</a>, as an agreed upon gesture between us. And so these two messengers went to Damascus on 7/5/1949 with the reason (excuse) of purchasing paper for [publication of] the Ba'th Magazine.</blockquote>    <P>
<a href=http://en.wikipedia.org/wiki/Husni_al-Za%27im>Az-Za'eem</a> was executed in August 1949 after the failed military coup in <a href='tags/syria.html' class='tagLink'><font class='tagLink'>Syria</font></a> (after having already launched a successful bloodless coup earlier in the year in March). This gives an interesting insight into the colorful background of individuals like an-Nabahani and shows their background ideological nurturing upon secular revolutionary ideologies, such as Ba'thism (Socialism for the Arabs) which - without any shadow of doubt - strongly influenced their own political philosophies that were clothed with the garb of Islaam.    <P>
In the book, (<span class='arb' lang='AR-SA'>&#1575;&#1604;&#1588;&#1610;&#1582; &#1578;&#1602;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1583;&#1575;&#1593;&#1610;&#1577; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577;</span>), '<i>Shaykh Taqi ud-Din an-Nabahani, the Caller of the Islamic Caliphate</i>',  Hisham Ulaywan (2009), also documents the same, saying:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1576;&#1593;&#1583; &#1606;&#1580;&#1575;&#1581; &#1575;&#1604;&#1575;&#1606;&#1602;&#1604;&#1575;&#1576; &#1575;&#1604;&#1593;&#1587;&#1603;&#1585;&#1610; &#1601;&#1610; &#1587;&#1608;&#1585;&#1610;&#1575; &#1576;&#1602;&#1610;&#1575;&#1583;&#1577; &#1581;&#1587;&#1606;&#1610; &#1575;&#1604;&#1586;&#1593;&#1610;&#1605; (1897-1949) &#1610;&#1608;&#1605; 30 &#1570;&#1584;&#1575;&#1585;/&#1605;&#1575;&#1585;&#1587; 1949&#1548; &#1576;&#1615;&#1581;&#1579;&#1578; &#1605;&#1587;&#1571;&#1604;&#1577; &#1573;&#1587;&#1602;&#1575;&#1591; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1571;&#1585;&#1583;&#1606;&#1610; &#1576;&#1575;&#1606;&#1602;&#1604;&#1575;&#1576; &#1593;&#1587;&#1603;&#1585;&#1610; &#1605;&#1605;&#1575;&#1579;&#1604;&#1548; &#1576;&#1610;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1578;&#1604; &#1608;&#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1585;&#1610;&#1605;&#1575;&#1608;&#1610; &#1608;&#1578;&#1602;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610;. &#1608;&#1578;&#1608;&#1580;&#1617;&#1607; &#1575;&#1604;&#1585;&#1610;&#1605;&#1575;&#1608;&#1610; &#1608;&#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1573;&#1604;&#1609; &#1583;&#1605;&#1588;&#1602; &#1576;&#1585;&#1587;&#1575;&#1604;&#1577; &#1605;&#1606; &#1575;&#1604;&#1578;&#1604; &#1573;&#1604;&#1609; &#1575;&#1604;&#1586;&#1593;&#1610;&#1605;&#1548; &#1608;&#1584;&#1604;&#1603; &#1602;&#1576;&#1604; &#1571;&#1606; &#1610;&#1601;&#1585;&#1617; &#1575;&#1604;&#1578;&#1604; &#1604;&#1575;&#1580;&#1574;&#1575;&#1611; &#1587;&#1610;&#1575;&#1587;&#1610;&#1575;&#1611; &#1573;&#1604;&#1609; &#1605;&#1589;&#1585; &#1601;&#1610; &#1575;&#1604;&#1593;&#1575;&#1588;&#1585; &#1605;&#1606; &#1578;&#1588;&#1585;&#1610;&#1606; &#1575;&#1604;&#1571;&#1608;&#1604;/&#1571;&#1603;&#1578;&#1608;&#1576;&#1585;</div>     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>After the success of the military coup in <a href='tags/syria.html' class='tagLink'><font class='tagLink'>Syria</font></a> under the leadership of Husni az-Za'eem (1897-1949), on 30th March 1949, the issue of removing the Jordanian system (of government) through a similar military coup was discussed between Abdullah at-Tall, Abdullaah ar-Rimaawee and Taqi ud-Din an-Nabahani. And ar-Rimaawee and an-Nabahani turned to Damascus with a message from at-Tall to az-Za'eem, and this was before Abdullaah at-Tall fled, seeking political asylum in Egypt in October 1949.</blockquote>    <P>
Ulaywan also states that it is not possible to reject the plausibility that an-Nabahani was involved with some of the nationalistic parties, he states:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1604;&#1575; &#1610;&#1605;&#1603;&#1606; &#1585;&#1601;&#1590; &#1575;&#1581;&#1578;&#1605;&#1575;&#1604; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1602;&#1583; &#1606;&#1588;&#1591; &#1587;&#1585;&#1575;&#1611; &#1601;&#1610; &#1573;&#1581;&#1583;&#1609; &#1575;&#1604;&#1605;&#1580;&#1605;&#1608;&#1593;&#1575;&#1578; &#1575;&#1604;&#1602;&#1608;&#1605;&#1610;&#1577; &#1575;&#1604;&#1589;&#1594;&#1610;&#1585;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>... it is not possible to reject the plausiblity that an-Nabahani was raised (i.e. cultivated) secretly in one of the small nationalistic groups...</blockquote>    <P>
<img src=assets/images/abdul-aziz-khayyat.gif align=right hspace=8 vspace=6 border=1 width=150 border=0> And he cites as evidence for this, an-Nabahani's involvement with the likes of at-Tall and ar-Rimaawee and also his participation with the Arab Nationalist Movement in their gatherings in Haifa in 1947. The author of "<i>Hizb ut-Tahrir al-Islamee wat-Tadleel as-Siyaasee</i>" cites the following (p. 9) from <b>Dr. Abdul-Azeez al-Khayyaat</b> (pictured right) -  a former Jordanian government minister, originally from Palestine and graduated from al-Azhar, (similar to an-Nabahani), he was amongst the founders of al-Ikhwan al-Muslimeen in Jordan and Palestine, died in November 2011 - this is what is cited from al-Khayyaat:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1602;&#1583; &#1571;&#1603;&#1583; &#1606;&#1586;&#1593;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; (&#1578;&#1602;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610;) &#1575;&#1604;&#1602;&#1608;&#1605;&#1610;&#1577;&#1548; &#1585;&#1601;&#1610;&#1602; &#1583;&#1585;&#1576;&#1607;&#1548; &#1608;&#1586;&#1610;&#1585; &#1575;&#1604;&#1571;&#1608;&#1602;&#1575;&#1601; &#1575;&#1604;&#1571;&#1585;&#1583;&#1606;&#1610; &#1575;&#1604;&#1587;&#1575;&#1576;&#1602;&#1548;  &#1575;&#1604;&#1583;&#1603;&#1578;&#1608;&#1585; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1575;&#1604;&#1582;&#1610;&#1575;&#1591; &#1581;&#1610;&#1579; &#1602;&#1575;&#1604; &#1593;&#1606;&#1607;: <<&#1608;&#1603;&#1575;&#1606; &#1581;&#1583;&#1610;&#1579;&#1607; &#1590;&#1576;&#1575;&#1576;&#1610;&#1575;&#1611;&#1548; &#1573;&#1584; &#1603;&#1575;&#1606; &#1610;&#1583;&#1593;&#1608; &#1573;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1608;&#1576;&#1577; &#1571;&#1603;&#1579;&#1585; &#1605;&#1606; &#1583;&#1593;&#1608;&#1578;&#1607; &#1573;&#1604;&#1609; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;>>. &#1608;&#1576;&#1593;&#1583;&#1607;&#1575; &#1576;&#1602;&#1604;&#1610;&#1604;&#1548; &#1571;&#1588;&#1575;&#1585; &#1575;&#1604;&#1582;&#1610;&#1575;&#1591; &#1573;&#1604;&#1609; &#1602;&#1610;&#1575;&#1605; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1576;&#1603;&#1578;&#1575;&#1576;&#1577; &#1585;&#1587;&#1575;&#1604;&#1577; &#1576;&#1593;&#1606;&#1608;&#1575;&#1606;: <<&#1585;&#1587;&#1575;&#1604;&#1577; &#1575;&#1604;&#1593;&#1585;&#1576;>>. &#1579;&#1605; &#1602;&#1575;&#1604; &#1576;&#1582;&#1589;&#1608;&#1589; &#1601;&#1603;&#1585;&#1578;&#1607; &#1604;&#1578;&#1588;&#1603;&#1610;&#1604; &#1580;&#1605;&#1575;&#1593;&#1577; &#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; &#1608;&#1575;&#1581;&#1583;&#1577;: <<&#1603;&#1575;&#1606; &#1607;&#1605;&#1617;&#1610; &#1600; &#1571;&#1610; &#1575;&#1604;&#1582;&#1610;&#1575;&#1591; &#1600; &#1575;&#1604;&#1593;&#1605;&#1604; &#1593;&#1604;&#1609; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1601;&#1603;&#1585;&#1578;&#1610;&#1606;: &#1593;&#1606;&#1583; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; (&#1575;&#1604;&#1602;&#1608;&#1605;&#1610;&#1577;)&#1548; &#1608;&#1604;&#1583;&#1609; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; (&#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577;)>>&#1575;&#1607;&#1600; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Jordanian Minister of 'Awqaaf, Dr. Abdul-Aziz al-Khayyaat stated about an-Nabahani, "His speech used to be very hazy, since he used to call to Arabism more than his call to Islaam", and after mentioning the book written by an-Nabahani "Risaalat ul-'Arab" he (al-Khayyaat) stated about his own designs to formulate an Islamic party, "My interest was to work to unite the two ideas, the (one) with an-Nabahani (nationalistic) and the (one) with al-Ikhwan al-Muslimeen (Islamic)."</blockquote>    <P>
And he indicates the source for this as:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1605;&#1580;&#1604;&#1577; &#1575;&#1604;&#1608;&#1587;&#1591;&#1548; &#1575;&#1604;&#1593;&#1583;&#1583; (180) &#1576;&#1578;&#1575;&#1585;&#1610;&#1582; 10/7/1995&#1605;&#1548; &#1589;33.</div>    <P>
Which is the magazine, "al-Wasat", no. 180, dated 10/7/1995, p. 33.    <P>
<font class='titleHeadline'>Hizb ul-Ba'th (The Ba'th Party) and <a href="tags/hizb-ut-tahrir.html" class="tagLink"><font class="tagLink">Hizb ut-Tahrir</font></a></font>    <P>
Michel Aflaq (d. 1989) is the Greek Orthodox Christian who founded Ba'thism and the Ba'th Party (in Syria), an ideology of Socialist (Communist), Arab Nationalism. He was a contemporary of an-Nabahani.    <P>
In the book, (<span class='arb' lang='AR-SA'>&#1575;&#1604;&#1588;&#1610;&#1582; &#1578;&#1602;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1583;&#1575;&#1593;&#1610;&#1577; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577;</span>), '<i>Shaykh Taqi ud-Din an-Nabahani, the Caller of the Islamic Caliphate</i>',  Hisham Ulaywan (2009) notes, under the heading of "an-Nabahani and Aflaq" in which he looks at the resemblance between ideas of the two:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1576;&#1604; &#1573;&#1606;&#1617; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1575;&#1604;&#1584;&#1610; &#1575;&#1606;&#1578;&#1602;&#1583; &#1591;&#1585;&#1610;&#1602;&#1577; &#1593;&#1605;&#1604; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; (&#1575;&#1604;&#1578;&#1603;&#1578;&#1604; &#1575;&#1604;&#1580;&#1605;&#1593;&#1610;)&#1548; &#1575;&#1593;&#1578;&#1605;&#1583; &#1591;&#1585;&#1610;&#1602;&#1577; &#1575;&#1604;&#1578;&#1603;&#1578;&#1604; &#1575;&#1604;&#1581;&#1586;&#1576;&#1610;&#1548; &#1608;&#1588;&#1575;&#1576;&#1614;&#1607;&#1614; &#1601;&#1610; &#1576;&#1606;&#1575;&#1569; &#1581;&#1586;&#1576; &#1575;&#1604;&#1578;&#1581;&#1585;&#1610;&#1585; &#1578;&#1580;&#1585;&#1576;&#1577; &#1575;&#1604;&#1593;&#1605;&#1604; &#1575;&#1604;&#1587;&#1585;&#1610; &#1575;&#1604;&#1605;&#1593;&#1602;&#1617;&#1583; &#1604;&#1604;&#1578;&#1606;&#1592;&#1610;&#1605;&#1575;&#1578; &#1575;&#1604;&#1602;&#1608;&#1605;&#1610;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Rather, an-Nabahani who criticized the way of action of al-Ikhwan [al-Muslimoon] of the formation of (all people) into a mass, he (himself) depended upon the (route of) party-formation and in setting up <a href='tags/hizb-ut-tahrir.html' class='tagLink'><font class='tagLink'>Hizb ut-Tahrir</font></a> he resembled (i.e. borrowed) from the secretive practical experience intertwined with the (Arab) nationalistic organizations.</blockquote>    <P>
He then mentions an-Nabahani's attendance at the Arab Nationalist Party's meeting in Haifa in 1947, and also many nationalistic and secret organizations that were present in the region, he then says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1576;&#1575;&#1604;&#1573;&#1590;&#1575;&#1601;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1578;&#1588;&#1575;&#1576;&#1607; &#1575;&#1604;&#1578;&#1606;&#1592;&#1610;&#1605;&#1610; &#1576;&#1610;&#1606; &#1581;&#1586;&#1576; &#1575;&#1604;&#1578;&#1581;&#1585;&#1610;&#1585; &#1608;&#1575;&#1604;&#1571;&#1581;&#1586;&#1575;&#1576; &#1575;&#1604;&#1602;&#1608;&#1605;&#1610;&#1577;&#1548; &#1610;&#1605;&#1603;&#1606; &#1605;&#1604;&#1575;&#1581;&#1592;&#1577; &#1571;&#1608;&#1580;&#1607; &#1588;&#1576;&#1607; &#1601;&#1610; &#1575;&#1604;&#1605;&#1590;&#1605;&#1608;&#1606; &#1608;&#1575;&#1604;&#1605;&#1589;&#1591;&#1604;&#1581;&#1548; &#1576;&#1610;&#1606; &#1582;&#1591;&#1575;&#1576; &#1605;&#1610;&#1588;&#1575;&#1604; &#1593;&#1601;&#1604;&#1602; &#1605;&#1572;&#1587;&#1587; &#1581;&#1586;&#1576; &#1575;&#1604;&#1576;&#1593;&#1579; &#1606;&#1601;&#1587;&#1607; &#1608;&#1582;&#1591;&#1575;&#1576; &#1575;&#1604;&#1606;&#1576;&#1607;&#1575;&#1606;&#1610; &#1604;&#1575; &#1587;&#1610;&#1605;&#1575; &#1602;&#1576;&#1604; &#1578;&#1571;&#1587;&#1610;&#1587;&#1607; &#1581;&#1586;&#1576; &#1575;&#1604;&#1578;&#1581;&#1585;&#1610;&#1585;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And in addition to the structural (organizational) resemblance between <a href='tags/hizb-ut-tahrir.html' class='tagLink'><font class='tagLink'>Hizb ut-Tahrir</font></a> and the (Arab) nationalistic parties, it is possible to note the aspects of resemblance in content and terminology between the discourse of Michel Aflaq, the founder of al-Ba'th himself, and the discourse of an-Nabahani, especially (in the period) before his founding of <a href='tags/hizb-ut-tahrir.html' class='tagLink'><font class='tagLink'>Hizb ut-Tahrir</font></a>...</blockquote>    <P>
And then Ulaywan mentions some similarities between the discourses of the two ideologues, quoting from their statements. As we stated earlier, the circumstances and environment in which an-Nabahani was present and the circles within which he mixed and his very strong ties to certain Ba'thists and (Arab) nationalists, makes it impossible to deny that he was influenced by that background cultivation in the formation of his party, its structure, its goals  and mode of operation.    <P>
<font class='titleHeadline'>Closing Notes</font>    <P>
Al-Nabahani, (like Sayyid Qutb) was affected by the revolutionary Communist, Marxist  movements, if not directly, then at least indirectly as he was involved with Hizb al-Ba'th and also with nationalistic movements. His party, Hizb al-Tahrir, appears to mimick Hizb al-Ba'th, differing in the final objective, but adopting all the methods and structures typical of political and nationalist parties of that time which took to adopting secrecy and rigid tight internal structures as fundamental elements upon which their success would be determined. Like <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, its another example of an Ash'ari thinker borrowing from the practical elements of <a href='tags/marxism.html' class='tagLink'><font class='tagLink'>Marxism</font></a>, <a href='tags/leninism.html' class='tagLink'><font class='tagLink'>Leninism</font></a> and pushing that "fikr" (ideology) onto Islam.    <P>
<div class='sidebar'>As for what we find in the <a href='tags/shariah.html' class='tagLink'><font class='tagLink'>Shariah</font></a>, then corrupt, tyrannical, oppressive <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> are a punishment from Allaah through which the people are given a taste of what their own hands have earned, and this is a divine law operative in the creation. This is established in numerous texts and are dealt with in other articles (see   <a href=index19cc.html?lfnppnj>here</a>, <a href=indexde51.html?bqppsge>here</a>, <a href=indexf3df.html?xnyprqo>here</a>, <a href=indexf596.html?whkjsfv>here</a>, and <a href=index3b23.html?amqxrhq>here</a>). What this indicates is that all those thinkers who came in the 20th century thinking that by revolutions against the ruling authorities they will establish an Islamic state, they, in light of these Prophetic texts (which explain the true causes and effects), are an example of <b>the blind leading the blind</b>. If the ideology is so blatantly off the mark in identifying the true underlying cause, then the solution being presented (depending on who you go to, <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, Mawdudi or Nabahani) is nothing but falsehood in vain.</div>  </blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.nabahani.com/print.cfm?hgkkkoc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:15:47 GMT -->
</html>


