

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.nabahani.com/print.cfm?bqppsge by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:15:47 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Nabahani.Com | Ibn Al-Qayyim (d. 751H) Verses Al-Nabahani and Followers: The Kings and Rulers Are Simply a Manifestation of the Actions of the Servants</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/nabahani/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Nabahani.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Ibn Al-Qayyim (d. 751H) Verses Al-Nabahani and Followers: The Kings and Rulers Are Simply a Manifestation of the Actions of the Servants</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Friday, April, 13 2012 and
 filed under <a href="categories/cz-the-rulers.html">The Rulers & Rulership</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/ibn-al-qayyim.html">
Ibn Al-Qayyim 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p>The great scholar, <a href='tags/ibn-al-qayyim.html' class='tagLink'><font class='tagLink'>Ibn al-Qayyim</font></a> wrote, in explanation of the reality that the actions of the servants become manifest in those placed in authority over them, this being from the Divine wisdom:    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1608;&#1578;&#1571;&#1605;&#1604; &#1581;&#1603;&#1605;&#1578;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1601;&#1610; &#1578;&#1587;&#1604;&#1610;&#1591; &#1575;&#1604;&#1593;&#1583;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583; &#1573;&#1584;&#1575; &#1580;&#1575;&#1585; &#1602;&#1608;&#1610;&#1607;&#1605; &#1593;&#1604;&#1609; &#1590;&#1593;&#1610;&#1601;&#1607;&#1605; &#1608;&#1604;&#1605; &#1610;&#1572;&#1582;&#1584; &#1604;&#1604;&#1605;&#1592;&#1604;&#1608;&#1605; &#1581;&#1602;&#1607; &#1605;&#1606; &#1592;&#1575;&#1604;&#1605;&#1607; &#1603;&#1610;&#1601; &#1610;&#1587;&#1604;&#1591; &#1593;&#1604;&#1610;&#1607;&#1605; &#1605;&#1606; &#1610;&#1601;&#1593;&#1604; &#1576;&#1607;&#1605; &#1603;&#1601;&#1593;&#1604;&#1607;&#1605; &#1576;&#1585;&#1593;&#1575;&#1610;&#1575;&#1607;&#1605; &#1608;&#1590;&#1593;&#1601;&#1575;&#1574;&#1607;&#1605; &#1587;&#1608;&#1575;&#1569; &#1608;&#1607;&#1584;&#1607; &#1587;&#1606;&#1577; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1605;&#1606;&#1584; &#1602;&#1575;&#1605;&#1578; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1575;&#1604;&#1609; &#1575;&#1606; &#1578;&#1591;&#1608;&#1609; &#1575;&#1604;&#1575;&#1585;&#1590; &#1608;&#1610;&#1593;&#1610;&#1583;&#1607;&#1575; &#1603;&#1605;&#1575; &#1576;&#1583;&#1571;&#1607;&#1575; &#1608;&#1578;&#1571;&#1605;&#1604; &#1581;&#1603;&#1605;&#1578;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1601;&#1610; &#1575;&#1606; &#1580;&#1593;&#1604; &#1605;&#1604;&#1608;&#1603; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583; &#1608;&#1571;&#1605;&#1585;&#1575;&#1569;&#1607;&#1605; &#1608;&#1608;&#1604;&#1575;&#1578;&#1607;&#1605; &#1605;&#1606; &#1580;&#1606;&#1587; &#1575;&#1593;&#1605;&#1575;&#1604;&#1607;&#1605; &#1576;&#1604; &#1603;&#1571;&#1606; &#1571;&#1593;&#1605;&#1575;&#1604;&#1607;&#1605; &#1592;&#1607;&#1585;&#1578; &#1601;&#1610; &#1589;&#1608;&#1585; &#1608;&#1604;&#1575;&#1578;&#1607;&#1605; &#1608;&#1605;&#1604;&#1608;&#1603;&#1607;&#1605; &#1601;&#1573;&#1606; &#1587;&#1575;&#1578;&#1602;&#1575;&#1605;&#1608;&#1575; &#1575;&#1587;&#1578;&#1602;&#1575;&#1605;&#1578; &#1605;&#1604;&#1608;&#1603;&#1607;&#1605; &#1608;&#1573;&#1606; &#1593;&#1583;&#1604;&#1608;&#1575; &#1593;&#1583;&#1604;&#1578; &#1593;&#1604;&#1610;&#1607;&#1605; &#1608;&#1573;&#1606; &#1580;&#1575;&#1585;&#1608;&#1575; &#1580;&#1575;&#1585;&#1578; &#1605;&#1604;&#1608;&#1603;&#1607;&#1605; &#1608;&#1608;&#1604;&#1575;&#1578;&#1607;&#1605; &#1608;&#1573;&#1606; &#1592;&#1607;&#1585; &#1601;&#1610;&#1607;&#1605; &#1575;&#1604;&#1605;&#1603;&#1585; &#1608;&#1575;&#1604;&#1582;&#1583;&#1610;&#1593;&#1577; &#1601;&#1608;&#1604;&#1575;&#1578;&#1607;&#1605; &#1603;&#1584;&#1604;&#1603; &#1608;&#1573;&#1606; &#1605;&#1606;&#1593;&#1608;&#1575; &#1581;&#1602;&#1608;&#1602; &#1575;&#1604;&#1604;&#1607; &#1604;&#1583;&#1610;&#1607;&#1605; &#1608;&#1576;&#1582;&#1604;&#1608;&#1575; &#1576;&#1607;&#1575; &#1605;&#1606;&#1593;&#1578; &#1605;&#1604;&#1608;&#1603;&#1607;&#1605; &#1608;&#1608;&#1604;&#1575;&#1578;&#1607;&#1605; &#1605;&#1575; &#1604;&#1607;&#1605; &#1593;&#1606;&#1583;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1581;&#1602; &#1608;&#1606;&#1581;&#1604;&#1608;&#1575; &#1576;&#1607;&#1575; &#1593;&#1604;&#1610;&#1607;&#1605; &#1608;&#1573;&#1606; &#1575;&#1582;&#1584;&#1608;&#1575; &#1605;&#1605;&#1606; &#1610;&#1587;&#1578;&#1590;&#1593;&#1601;&#1608;&#1606;&#1607; &#1605;&#1575;&#1604;&#1575; &#1610;&#1587;&#1578;&#1581;&#1602;&#1608;&#1606;&#1607; &#1601;&#1610; &#1605;&#1593;&#1575;&#1605;&#1604;&#1578;&#1607;&#1605; &#1575;&#1582;&#1584;&#1578; &#1605;&#1606;&#1607;&#1605; &#1575;&#1604;&#1605;&#1604;&#1608;&#1603; &#1605;&#1575;&#1604;&#1575; &#1610;&#1587;&#1578;&#1581;&#1602;&#1608;&#1606;&#1607; &#1608;&#1590;&#1585;&#1576;&#1578; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1605;&#1603;&#1608;&#1587; &#1608;&#1575;&#1604;&#1608;&#1592;&#1575;&#1574;&#1601; &#1608;&#1603;&#1604;&#1605;&#1575; &#1610;&#1587;&#1578;&#1582;&#1585;&#1580;&#1608;&#1606;&#1607; &#1605;&#1606; &#1575;&#1604;&#1590;&#1593;&#1610;&#1601; &#1610;&#1587;&#1578;&#1582;&#1585;&#1580;&#1607; &#1575;&#1604;&#1605;&#1604;&#1608;&#1603; &#1605;&#1606;&#1607;&#1605; &#1576;&#1575;&#1604;&#1602;&#1608;&#1577; &#1601;&#1575;&#1593;&#1605;&#1575;&#1604;&#1607;&#1605; &#1592;&#1607;&#1585;&#1578; &#1601;&#1610; &#1589;&#1608;&#1585; &#1575;&#1593;&#1605;&#1575;&#1604;&#1607;&#1605; &#1608;&#1604;&#1610;&#1587; &#1601;&#1610; &#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1575;&#1604;&#1575;&#1604;&#1607;&#1610;&#1577; &#1575;&#1606; &#1610;&#1608;&#1604;&#1609; &#1593;&#1604;&#1609; &#1575;&#1604;&#1575;&#1588;&#1585;&#1575;&#1585; &#1575;&#1604;&#1601;&#1580;&#1575;&#1585; &#1575;&#1604;&#1575; &#1605;&#1606; &#1610;&#1603;&#1608;&#1606; &#1605;&#1606; &#1580;&#1606;&#1587;&#1607;&#1605; &#1608;&#1604;&#1605;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1589;&#1583;&#1585; &#1575;&#1604;&#1575;&#1608;&#1604; &#1582;&#1610;&#1575;&#1585; &#1575;&#1604;&#1602;&#1585;&#1608;&#1606; &#1608;&#1575;&#1576;&#1585;&#1607;&#1575; &#1603;&#1575;&#1606;&#1578; &#1608;&#1604;&#1575;&#1578;&#1607;&#1605; &#1603;&#1584;&#1604;&#1603; &#1601;&#1604;&#1605;&#1575; &#1588;&#1575;&#1576;&#1608;&#1575; &#1588;&#1575;&#1576;&#1578; &#1604;&#1607;&#1605; &#1575;&#1604;&#1608;&#1604;&#1575;&#1577; &#1601;&#1581;&#1603;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1578;&#1571;&#1576;&#1609; &#1575;&#1606; &#1610;&#1608;&#1604;&#1610; &#1593;&#1604;&#1610;&#1606;&#1575; &#1601;&#1610; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1575;&#1586;&#1605;&#1575;&#1606; &#1605;&#1579;&#1604; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1608;&#1593;&#1605;&#1585; &#1576;&#1606; &#1593;&#1576;&#1583;&#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1601;&#1590;&#1604;&#1575; &#1593;&#1606; &#1605;&#1579;&#1604; &#1575;&#1576;&#1610; &#1576;&#1603;&#1585; &#1608;&#1593;&#1605;&#1585; &#1576;&#1604; &#1608;&#1604;&#1575;&#1578;&#1606;&#1575; &#1593;&#1604;&#1609; &#1602;&#1583;&#1585;&#1606;&#1575; &#1608;&#1608;&#1604;&#1575;&#1577; &#1605;&#1606; &#1602;&#1576;&#1604;&#1606;&#1575; &#1593;&#1604;&#1609; &#1602;&#1583;&#1585;&#1607;&#1605; &#1608;&#1603;&#1604; &#1605;&#1606; &#1575;&#1604;&#1575;&#1605;&#1585;&#1610;&#1606; &#1605;&#1608;&#1580;&#1576; &#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1608;&#1605;&#1602;&#1578;&#1590;&#1575;&#1607;&#1575; &#1608;&#1605;&#1606; &#1604;&#1607; &#1601;&#1591;&#1606;&#1607; &#1573;&#1584;&#1575; &#1587;&#1575;&#1601;&#1585; &#1576;&#1601;&#1603;&#1585;&#1607; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1576;&#1575;&#1576; &#1585;&#1571;&#1609; &#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1575;&#1604;&#1575;&#1604;&#1607;&#1610;&#1577; &#1587;&#1575;&#1574;&#1585;&#1577; &#1601;&#1610; &#1575;&#1604;&#1602;&#1590;&#1575;&#1569; &#1608;&#1575;&#1604;&#1602;&#1583;&#1585; &#1592;&#1575;&#1607;&#1585;&#1577; &#1608;&#1576;&#1575;&#1591;&#1606;&#1577; &#1601;&#1610;&#1607; &#1603;&#1605;&#1575; &#1601;&#1610; &#1575;&#1604;&#1582;&#1604;&#1602; &#1608;&#1575;&#1604;&#1575;&#1605;&#1585; &#1587;&#1608;&#1575;&#1569; &#1601;&#1573;&#1610;&#1575;&#1603; &#1575;&#1606; &#1578;&#1592;&#1606; &#1576;&#1592;&#1606;&#1603; &#1575;&#1604;&#1601;&#1575;&#1587;&#1583;&#1575;&#1606; &#1588;&#1610;&#1574;&#1575; &#1605;&#1606; &#1575;&#1602;&#1590;&#1610;&#1578;&#1607; &#1608;&#1575;&#1602;&#1583;&#1575;&#1585;&#1607; &#1593;&#1575;&#1585; &#1593;&#1606; &#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1575;&#1604;&#1576;&#1575;&#1604;&#1594;&#1577; &#1576;&#1604; &#1580;&#1605;&#1610;&#1593; &#1575;&#1602;&#1590;&#1610;&#1578;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1571;&#1602;&#1583;&#1575;&#1585;&#1607; &#1608;&#1575;&#1602;&#1593;&#1577; &#1593;&#1604;&#1609; &#1575;&#1578;&#1605; &#1608;&#1580;&#1608;&#1607; &#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1608;&#1575;&#1604;&#1589;&#1608;&#1575;&#1576; &#1608;&#1604;&#1603;&#1606; &#1575;&#1604;&#1593;&#1602;&#1608;&#1604; &#1575;&#1604;&#1590;&#1593;&#1610;&#1601;&#1577; &#1605;&#1581;&#1580;&#1608;&#1576;&#1577; &#1576;&#1590;&#1593;&#1601;&#1607;&#1575; &#1593;&#1606; &#1573;&#1583;&#1585;&#1575;&#1603;&#1607;&#1575; &#1603;&#1605;&#1575; &#1575;&#1606; &#1575;&#1604;&#1575;&#1576;&#1589;&#1575;&#1585; &#1575;&#1604;&#1582;&#1601;&#1575;&#1588;&#1610;&#1577; &#1605;&#1581;&#1580;&#1608;&#1576;&#1577; &#1576;&#1590;&#1593;&#1601;&#1607;&#1575; &#1593;&#1606; &#1590;&#1608;&#1569; &#1575;&#1604;&#1588;&#1605;&#1587;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And reflect upon His, the Most High's wisdom, in empowering the enemy over the servants when their strong ones oppress the weak one's (amongst them) and [when] the right of the oppressed is not taken back from the  oppressor, [reflect on] how [an enemy] is empowered over them who does to them what they do to those under their responsibility and their weak ones, like (for like). <b>And this is the Sunnah of Allaah, the Exalted, ever since the world was established until the Earth is rolled up and is returned just as it was originated (the first time around)</b>.    <P>
And reflect in His, the Most High's wisdom in making the kings of the servants, their leaders and their <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> to be of the same species as the actions [of the servants]. Rather, it is as if their actions became manifest in the appearances of their <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> and kings.     <P>
<ul><li>  If they remain upright, then their kings will remain upright, and if they turn away (from uprightness), then they (the kings) too will turn away from uprightness.     <P>
<li>And if they (the servants) oppress [themselves and others], then their kings and <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> will oppress [them].     <P>
<li>And if their appears plotting and deception from them, their <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> will [be made to] behave likewise, and if they (the servants) prevent the rights of Allaah that are between themselves and become miserly with respect to them (i.e. withhold the rights of each other), then their kings and their <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> will withhold the right that they (the servants) have upon them and will become miserly with respect to them.     <P>
<li>And if they take from the one who is considered weak, what they do not deserve to take from him in their dealings (i.e. misappropriate from him), then the kings will take from them (the servants) what they do not deserve to take (from them) and will inflict them with taxes.     <P>
<li>And everything that they (the servants) take away from the weak person, the kings will take away from them with power, force.</ul>    <P>
So their actions (those of the servants) become manifest in their actions (those of the kings and rulers). <b>And it is not from the Divine wisdom that the evil-doers and the sinners are made to be ruled over [by anyone] except by one who is of their like.</b>    <P>
And when the very first band (of Islaam) was the best of the generations, and the most pious of them, then their <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> were likewise. And when they became tarnished (i.e. corrupted), the <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> were made corrupted over them. Thus, the wisdom of Allaah refuses that the likes of Mu'aawiyah, and 'Umar bin 'Abdil-'Azeez are put in authority over us in the likes of these times [the 8th Century Hijrah], let alone the likes of Abu Bakr and 'Umar. Rather, our <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> are in accordance with our (nature) and the <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> of those before us were in accordance with their (nature).     <P>
And both of the two matters necessitate wisdom and what it requires. And the one who has deep rooted intelligence, when he moves his thought around in this subject will see the Divine wisdom that runs through al-Qadaa wal-Qadar (Ordainment and Pre-Decree), externally and internally, just as it runs through al-Khalq wal-Amr (the Creation and the Command) . So beware from thinking with your corrupt thought that anything of His ordainments and decrees are devoid of the far-reaching wisdom. Rather, all of His, the Most High's ordainments and decrees take place from the most perfect angles of correctness and wisdom. However, the weak intellects are veiled, by way of their weakness, from perceiving these [aspects of wisdom], just like eyes suffering day-blindness are veiled, by way of their weakness from the light of the sun.</blockquote>    <P>
<b>Source:</b> <i>Miftaah Daar is-Sa'aadah</i>,  Daar Ibn 'Affaan Publishing, (2/177).    <P>
All of the jamaa'aat (groups) that have appeared in the 20th century, claiming to rectify the Ummah, have fallen into deviation in their methodologies of reform and they have not judged by what Allaah has revealed in their understandings, their methodologies and their calls. They wrongly believe by removing one ruler, or one government they can establish Allaah's law, or that they can do so through political parties that engineer coups and revolutions while turning a blind eye to or belittling the fact that the Muslims are far removed from <u>that Islaam</u> which gave honour and victory to the Companions, but upon an Islaam tainted with innovations, devations, foreign philosophies and ideologies in the fields of <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and ibaadah and manhaj and siyaasah. And thus, that tainted Islam they are following does not have the same effect in bringing about the aid and support of Allaah and the granting of success as that pure Islaam, with its purity in <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, and <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, that the Companions were upon.    <P>
The activities of these groups claiming to rectify the Ummah are based upon methodologies that are in opposition to the Book, the Sunnah and the way of the Righteous Salaf whose belief and methodology Allaah has made a criterion of truth in all affairs of the religion. <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.nabahani.com/print.cfm?bqppsge by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:15:47 GMT -->
</html>


