{"id":11235,"date":"2016-07-04T10:50:06","date_gmt":"2016-07-04T06:50:06","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=11235"},"modified":"2025-07-04T10:53:42","modified_gmt":"2025-07-04T06:53:42","slug":"is-prophet-muhammad-better-than-other-prophets-making-no-distinction-between-the-prophets-of-allah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/is-prophet-muhammad-better-than-other-prophets-making-no-distinction-between-the-prophets-of-allah\/","title":{"rendered":"Prophet Muhammad is better than other Prophets?"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Muslims believe in all of the Prophets of Allah, peace and blessings be upon them, without making any distinction between them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قُولُوا آمَنَّا بِاللَّهِ وَمَا أُنزِلَ إِلَيْنَا وَمَا أُنزِلَ إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَمَا أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَا أُوتِيَ النَّبِيُّونَ مِن رَّبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ<\/p>\n<p><strong>Say: We have believed in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael and Isaac and Jacob and the Descendants and what was given to Moses and Jesus and what was given to the prophets from their Lord. We make no distinction between any of them, and we are Muslims in submission to Him.<\/strong><\/p>\n<p>Surah Al-Baqarah 2:136<\/p><\/blockquote>\n<p>This means the Muslims believe in all of them without saying one prophet is better than another.<\/p>\n<p>Abu Sa’eed Al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ<\/p>\n<p><strong>Do not make the prophets better than one another.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2281, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/03\/hadith-on-prophets-the-prophet-listens-to-the-complaint-of-a-jew-against-another-muslim\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>This is the general rule regarding our attitude towards the Prophets and Messengers, and our Prophet specifically forbade us from saying that he is better than some other prophets.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى<\/p>\n<p><strong>No servant should say that I am better than Jonah son of Mata.<\/strong><\/p>\n<p>Source: Sahih Bukhari 3234, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/06\/hadith-on-jonah-no-one-should-say-i-am-better-than-the-prophet-jonah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In this narration, the Messenger of Allah has forbidden us from claiming that he is superior to the Prophet Jonah (<em>Yunus<\/em>), upon him be peace. In another narration, the Prophet forbade us from saying this in even stronger terms:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ قَالَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى فَقَدْ كَذَبَ<\/p>\n<p><strong>Whoever says that I am better than Jonah son of Mata has told a lie.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi, 3245 Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/13\/hadith-on-prophets-it-is-forbidden-to-say-prophet-muhammad-is-better-than-moses-or-jonah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>We should believe in the exalted status of the prophets in general, although it is true that Allah has honored some prophets with blessings not given to other prophets.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ<\/p>\n<p><strong>Some of the Messengers we favored over others.<\/strong><\/p>\n<p>Surah Al-Baqarah 2:253<\/p><\/blockquote>\n<p>Abraham, upon him be peace, will be the first to be clothed on the Day of Resurrection.<\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَوَّلُ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ<\/p>\n<p><strong>The first to be clothed on the Day of Resurrection will be Abraham.<\/strong><\/p>\n<p>Source: Sahih Bukhari 3171, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/06\/hadith-on-resurrection-the-gathering-for-judgment-the-honor-of-abraham-and-the-humiliation-of-renegades\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Jonah, upon him be peace, was the only prophet whose entire people embraced Islam. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَوْلَا كَانَتْ قَرْيَةٌ آمَنَتْ فَنَفَعَهَا إِيمَانُهَا إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا وَمَتَّعْنَاهُمْ إِلَىٰ حِينٍ<\/p>\n<p><strong>Has there not been a single city that believed so its faith benefited them except for the people of Jonah? When they believed, We removed from them the punishment of disgrace in worldly life and gave them enjoyment for a time.<\/strong><\/p>\n<p>Surah Yunus 10:98<\/p><\/blockquote>\n<p>Solomon, upon him be peace, was given an earthly kingdom unlike any prophet or ruler who came after him.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَسَأَلَ اللَّهَ عَزَّ وَجَلَّ مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِهِ فَأُوتِيَهُ<\/p>\n<p><strong>Solomon asked Allah the Exalted for a kingdom that none after him would have, and he was given.<\/strong><\/p>\n<p>Source: Sunan An-Nasa’i 693, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/02\/hadith-on-jerusalem-solomon-son-of-david-builds-the-sacred-house-and-asks-allah-for-blessings\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Moses, upon him be peace, was given the honor of speaking with Allah directly.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَكَلَّمَ اللَّهُ مُوسَىٰ تَكْلِيمًا<\/p>\n<p><strong>Allah spoke to Moses directly.<\/strong><\/p>\n<p>Surah An-Nisa 4:164<\/p><\/blockquote>\n<p>Jesus and his mother Mary, peace and blessings be upon them both, were honored with being protected from Satan at the time of birth, although all other people are touched by Satan.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">كُلُّ بَنِي آدَمَ يَمَسُّهُ الشَّيْطَانُ يَوْمَ وَلَدَتْهُ أُمُّهُ إِلَّا مَرْيَمَ وَابْنَهَا<\/p>\n<p><strong>Satan touches every son of Adam on the day his mother gives birth to him, except for Mary and her son.<\/strong><\/p>\n<p>Source: Sahih Muslim 2366, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/06\/hadith-on-jesus-every-person-is-touched-by-satan-upon-birth-except-jesus-and-his-blessed-mother\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>These examples demonstrate that some prophets were given unique honors, but this does not allow Muslims to claim one prophet is better than another. Rather, the Messenger of Allah specifically prohibited Muslims from arguing with the Jews and Christians about whose prophet is better.<\/p>\n<p>Abu Huraira reported: Two people, one Jewish and the other Muslim, fell into dispute and began to abuse one another. The Muslim said, “By Him Who chose Muhammad in the worlds!” The Jew said, “By Him Who chose Moses in the worlds!” Then the Muslim slapped the Jew on his face. The Jew went to the Messenger of Allah, peace and blessings be upon him, and told him about the incident, so the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\"> لَا تُخَيِّرُونِي عَلَى مُوسَى فَإِنَّ النَّاسَ يَصْعَقُونَ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ فَلَا أَدْرِي أَكَانَ فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي أَمْ كَانَ مِمَّنْ اسْتَثْنَى اللَّهُ<\/p>\n<p><strong>Do not say I am better than Moses for mankind will faint on the Day of Judgment and I will be the first to recover, and Moses at that time will be holding the side of the Throne. I do not know if he would faint and recover before me, or if Allah will make an exception for him.<\/strong><\/p>\n<p>Source: Sahih Muslim 2373, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/06\/hadith-on-moses-do-not-make-muhammad-superior-to-moses-because-moses-will-be-by-the-throne-on-the-day-of-resurrection\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Despite the Messenger of Allah&#8217;s multiple commands to make no distinction among the prophets, some Muslims have given him the title “best of creation” (<em>khayr al-barriyah<\/em>). They cite as evidence the unique honors bestowed upon our Prophet, such as his leadership on the Day of Resurrection and his intercession.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَنَا سَيِّدُ وَلَدِ آدَمَ يَوْمَ الْقِيَامَةِ وَأَوَّلُ مَنْ يَنْشَقُّ عَنْهُ الْقَبْرُ وَأَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ<\/p>\n<p><strong>I will be the leader of the children of Adam on the Day of Resurrection, and I will be the first intercessor and the first whose intercession will be accepted.<\/strong><\/p>\n<p>Source: Sahih Muslim 2278, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/07\/hadith-on-muhammad-the-prophet-will-be-the-leader-of-the-children-of-adam-on-the-day-of-resurrection\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>This is a great honor for our Prophet, but it was not the intention of the Messenger of Allah to bestow the title &#8220;best of creation&#8221; upon himself. In fact, the Messenger of Allah rejected the title “best of creation” for himself. Rather, he gave this title to his father Abraham, upon him be peace.<\/p>\n<p>Anas ibn Malik reported: A person came to the Messenger of Allah, peace and blessings be upon him, and said, “O best of creation!” So the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">ذَاكَ إِبْرَاهِيمُ عَلَيْهِ السَّلَام<\/p>\n<p><strong>That is Abraham, upon him be peace.<\/strong><\/p>\n<p>Source: Sahih Muslim 2369, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/06\/hadith-on-abraham-the-prophet-abraham-was-the-best-of-creation\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>By giving this special title to Abraham and rejecting it for himself, the Messenger of Allah showed his great humility and his love for his father Abraham. It may also have been meant to prevent bickering among the Muslims and the Jews and Christians, since all three religions have respect for Abraham.<\/p>\n<p>Nevertheless, we have been warned about exaggerating the status of the Messenger of Allah.<\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُطْرُونِي كَمَا أَطْرَتْ النَّصَارَى ابْنَ مَرْيَمَ فَإِنَّمَا أَنَا عَبْدُهُ فَقُولُوا عَبْدُ اللَّهِ وَرَسُولُهُ<\/p>\n<p><strong>Do not exalt me as the Christians have exalted the son of Mary. I am but a servant, so call me the servant of Allah and His messenger<\/strong>.<\/p>\n<p>Source: Sahih Bukhari 3261, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/03\/hadith-on-muhammad-do-not-exaggerate-about-me-as-the-christians-have-exaggerated-about-jesus-son-of-mary\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: A man said, “O Muhammad! O master son of our master! O best of us son of the best of us!” So the Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ عَلَيْكُمْ بِتَقْوَاكُمْ وَلَا يَسْتَهْوِيَنَّكُمْ الشَّيْطَانُ أَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَبْدُ اللَّهِ وَرَسُولُهُ وَاللَّهِ مَا أُحِبُّ أَنْ تَرْفَعُونِي فَوْقَ مَنْزِلَتِي الَّتِي أَنْزَلَنِي اللَّهُ عَزَّ وَجَلَّ<\/p>\n<p><b>O people, say what you must say but do not allow Satan to deceive you. I am Muhammad the son of Abdullah, the servant of Allah and His Messenger. By Allah, I do not love that you raise my status above what Allah the Exalted has granted me.<\/b><\/p>\n<p>Source: Musnad Ahmad 12141, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/03\/hadith-on-muhammad-do-not-let-satan-trick-you-into-wrongly-elevating-the-status-of-the-prophet\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Therefore, the safest course of action is to refer to the Messenger of Allah as the &#8220;servant of Allah&#8221; and &#8220;His Messenger&#8221; without adding any exaggerated titles to this.<\/p>\n<p>In conclusion, Muslims make no distinctions between the prophets, peace be upon them all. We believe in all of them without favoring one over another. The Messenger of Allah commanded us not to say one prophet is better than another, or to argue with the Jews and Christians about this matter. Likewise, we have been warned not to exaggerate our praises of the Messenger of Allah.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;No servant should say that I am better than Jonah son of Mata.&#8221;<\/p>\n<p>[Sahih Bukhari, Book 5, Number 627]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[167,14,61,183,32,34,104,138,261,100,57,115,196,124,242,137],"class_list":["post-11235","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-abraham-ibrahim","tag-arrogance-al-takabbur","tag-call-to-islam-dawah","tag-day-of-resurrection-yawm-al-qiyammah","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-humility-al-tawaduh","tag-jesus-isa","tag-jonah-yunus","tag-manners-al-adab","tag-moses-musa","tag-people-of-the-book","tag-prophetic-virtues","tag-reconciliation","tag-scriptures-kutub","tag-solomon-sulayman"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-2Vd","jetpack-related-posts":[{"id":19412,"url":"https:\/\/www.abuaminaelias.com\/few-women-ever-achieved-perfection\/","url_meta":{"origin":11235,"position":0},"title":"Few women ever achieved perfection?","author":"Abu Amina Elias","date":"March 26, 2018","format":false,"excerpt":"\"We sent to her Our angel in the form of a well-proportioned man.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14914,"url":"https:\/\/www.abuaminaelias.com\/parallel-sayings-in-the-bible-and-islam\/","url_meta":{"origin":11235,"position":1},"title":"Parallel Sayings in the Bible and Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"We believe in Allah and what has been revealed to us...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13592,"url":"https:\/\/www.abuaminaelias.com\/quran-mistake-maryam-harun\/","url_meta":{"origin":11235,"position":2},"title":"Does the Quran mistake Mary as sister of Aaron?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"O sister of Aaron, your father was not a man of evil...\" (19:28)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15209,"url":"https:\/\/www.abuaminaelias.com\/beware-of-satan-and-the-idol-of-desire\/","url_meta":{"origin":11235,"position":3},"title":"Beware of the satanic idol of desire","author":"Abu Amina Elias","date":"January 11, 2014","format":false,"excerpt":"\"Have you seen the one who takes his own desire as his god? Then would you be responsible for him?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20478,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-love-for-sake-of-allah\/","url_meta":{"origin":11235,"position":4},"title":"Imam al-Mundhiri on Love for the Sake of Allah","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"They are the allies of Allah, upon whom there is no fear or grief.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17407,"url":"https:\/\/www.abuaminaelias.com\/reason-science-islam\/","url_meta":{"origin":11235,"position":5},"title":"Reason and science in Islam","author":"Abu Amina Elias","date":"December 8, 2015","format":false,"excerpt":"\"The foundation of a man is his intellect,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/11235","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=11235"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/11235\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=11235"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=11235"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=11235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}