{"id":12904,"date":"2016-07-04T10:50:06","date_gmt":"2016-07-04T06:50:06","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=12904"},"modified":"2025-07-04T10:53:48","modified_gmt":"2025-07-04T06:53:48","slug":"crucifixion-mutilation-islamic-law","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/crucifixion-mutilation-islamic-law\/","title":{"rendered":"Crucifixion and mutilation as legal punishments in Islam?"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Crucifixion as a method of public torture is prohibited in Islam. Displaying an executed criminal is neither prescribed nor prohibited by the Quran, although some scholars have interpreted a verse as mandating crucifixion to punish the worst of violent criminals. Jurists laid down several mitigating factors to limit its potential abuse by governments, while the Quran itself implicitly discourages the practice. Mutilation, on the other hand, was explicitly prohibited by the Prophet (s).<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا أَن يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُم مِّنْ خِلَافٍ أَوْ يُنفَوْا مِنَ الْأَرْضِ ۚ ذَٰلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ إِلَّا الَّذِينَ تَابُوا مِن قَبْلِ أَن تَقْدِرُوا عَلَيْهِمْ ۖ فَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ رَّحِيمٌ<\/p>\n<p><strong>Verily, the recompense for those who wage war on Allah and his messenger and strive to corrupt the land is that they are killed, crucified, their hands and feet are cut on opposite sides, or they are banished from the land. That is disgrace for them in the world and in the Hereafter they will have a great punishment, except for those who repent before you apprehend them, for Allah is forgiving and merciful.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:33-34<\/p><\/blockquote>\n<p>This verse is phrased as a description and not a prescription. The verbs ‘they are killed’ (<em>yuqattalu<\/em>) and ‘they are crucified’ (<em>yusallabu<\/em>) are in the passive grammatical tense, an important nuance often missed by interpreters and translators. Elsewhere in the Quran, even in the same chapter, the few legal punishments prescribed are expressed as grammatical imperatives or commands.<\/p>\n<p>The verse 5:33 was revealed in connection to a violent crime committed against an innocent Muslim. Some people had feigned conversion to Islam to earn the Prophet’s (s) favor. He treated them generously and they were hosted by a shepherd, whom they later robbed and killed in a gruesome way. The Prophet (s) responded by punishing them in the same manner they had tortured the shepherd, and the verse was revealed.<\/p>\n<p>In some narrations of this incident, it is said that the Prophet (s) gouged their eyes out as a literal application of the law of equal retaliation, or ‘eye for an eye.’ Allah revealed the verse as a rebuke of this practice, because ‘eye for an eye’ means the punishment must fit the crime and is not necessarily literal.<\/p>\n<p>Abu al-Zinnad reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَطَّعَ الَّذِينَ سَرَقُوا لِقَاحَهُ وَسَمَلَ أَعْيُنَهُمْ بِالنَّارِ عَاتَبَهُ اللَّهُ تَعَالَى فِي ذَلِكَ فَأَنْزَلَ اللَّهُ تَعَالَى  <strong>إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ<\/strong><\/p>\n<p>When the Messenger of Allah, peace and blessings be upon him, cut the limbs of those who stole his camels and gouged their eyes with hot iron, Allah Almighty rebuked him for that and revealed the verse: <strong>Verily, the recompense for those who wage war on Allah and his messenger… <\/strong>(5:33)<\/p>\n<p>Source: Sunan Abī Dāwūd 4370<\/p><\/blockquote>\n<p>After this event, the Prophet (s) prohibited mutilation in all cases, even if criminals themselves mutilate their victims.<\/p>\n<p>Anas ibn Malik, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ نَهَى عَنْ الْمُثْلَةِ<\/p>\n<p>Thereafter, mutilation was forbidden.<\/p><\/blockquote>\n<p>And Qatadah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلَغَنَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ كَانَ يَحُثُّ عَلَى الصَّدَقَةِ وَيَنْهَى عَنْ الْمُثْلَةِ<\/p>\n<p>We have heard that after this incident the Prophet, peace and blessings be upon him, would encourage charity and he forbade mutilation.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3956, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Therefore, cutting limbs and mutilating flesh is generally prohibited by scholars as a legal punishment, except for severing one hand of a thief in <a href=\"https:\/\/abuaminaelias.com\/imam-al-subki-on-mitigating-factors-in-criminal-punishment\/\">the most egregious cases of grand theft<\/a>.<\/p>\n<p>Al-Hayyaj ibn ‘Imran reported: A servant boy of ‘Imran had run away and he vowed to Allah that if he caught him, he would cut off his hand. He sent me to ask about that, so I went to Samurah ibn Jundab and I asked him. Samurah, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُثُّنَا عَلَى الصَّدَقَةِ وَيَنْهَانَا عَنْ الْمُثْلَةِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, encouraged us to give in charity and he forbade us from mutilation.<\/p>\n<p>Source: Sunan Abī Dāwūd 2667, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/28\/hadith-on-mutilation-the-prophet-encouraged-charity-and-he-prohibited-mutilation\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And Al-Tirmidhi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَرِهَ أَهْلُ الْعِلْمِ الْمُثْلَةَ<\/p>\n<p>The people of knowledge hate mutilation.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/16\/hadith-on-jihad-the-prophet-enjoined-honorable-conduct-during-war-and-he-forbade-stealing-treachery-mutilation-and-killing-innocents\/\">Sunan al-Tirmidhī 1408<\/a><\/p><\/blockquote>\n<p>As such, crucifixion as a method of public torture involving mutilation is prohibited in Islam. But scholars did allow or sometimes mandate displaying an executed criminal in public as a means of deterring other violent criminals.<\/p>\n<p>Al-Tabari summarizes the interpretations of verse 5:33, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ بَعْضُهُمْ تَجِبُ عَلَى الْمُحَارِبِ الْعُقُوبَةُ عَلَى قَدْرِ اسْتِحْقَاقِهِ وَيَلْزَمُهُ مَا لَزِمَهُ مِنْ ذَلِكَ عَلَى قَدْرِ جُرْمِهِ مُخْتَلِفًا بِاخْتِلَافِ أَجْرَامِهِ&#8230;.وَقَالَ آخَرُونَ الْإِمَامُ فِيهِ بِالْخِيَارِ أَنْ يَفْعَلَ أَيَّ هَذِهِ الْأَشْيَاءِ الَّتِي ذَكَرَهَا اللَّهُ فِي كِتَابِهِ<\/p>\n<p>Some interpreters said it is necessary for a brigand to be punished according to the measure he deserves and what is required of that according to the measure of his crimes, differing with different crimes… Others said the Muslim leader has a choice to do any of these things which Allah mentioned in his book.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 5:33<\/p><\/blockquote>\n<p>Depending upon the interpretation, crucifixion was reserved for only the worst criminals, in which case it was severely restricted, or it was generally the prerogative of legal authorities to decide whether such a punishment was warranted, which means it was not mandated at all.<\/p>\n<p>Moreover, a criminal would not be hanged alive until he died, as that would be a form of prohibited mutilation and torture.<\/p>\n<p>Al-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ الْهَادِي وَأَبُو حَنِيفَةَ وَهُوَ مَرْوِيٌّ عَنْ الشَّافِعِيِّ رَحِمَهُ اللَّه إنَّهُ لَا صَلْبَ قَبْلَ الْقَتْلِ لِأَنَّهُ مُثْلَةٌ<\/p>\n<p>Al-Hadi and Abu Hanifa, and which is also narrated from Al-Shafi’i, may Allah have mercy on him, said that he is not crucified before he is executed, as that would be mutilation.<\/p>\n<p>Source: Nayl al-Awṭār 6\/185<\/p><\/blockquote>\n<p>The purpose of displaying executed criminals was to deter future violent crimes, not to terrorize citizens or indulge a lust for blood. If the objective of deterrence is not met by crucifixion, then it should be abandoned.<\/p>\n<p>The Quran also implicitly discourages the practice in an indirect way, as crucifixion with mutilation were the method of choice used by Pharaoh and other tyrants to terrorize their people and persecute the Prophets, peace be upon them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَافٍ ثُمَّ لَأُصَلِّبَنَّكُمْ أَجْمَعِينَ<\/p>\n<p><strong>Pharaoh said: I will surely cut off your hands and feet on opposite sides and will crucify you altogether!<\/strong><\/p>\n<p>Surat al-A’raf 7:124<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ أَجْمَعِينَ<\/p>\n<p><strong>Pharaoh said: I will surely cut off your hands and feet on opposite sides and I will crucify you altogether!<\/strong><\/p>\n<p>Surat al-Shu’ara 26:49<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ فِي جُذُوعِ النَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَا أَشَدُّ عَذَابًا وَأَبْقَىٰ<\/p>\n<p><strong>Pharaoh said: I will surely cut off your hands and feet on opposite sides and I will crucify you to the trunk of a palm tree, then you will know which of us is the most severe and lasting in punishment!<\/strong><\/p>\n<p>Surat Ta Ha 20:71<\/p><\/blockquote>\n<p>And Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوَّلُ مَنْ صَلَبَ وَأَوَّلُ مَنْ قَطَعَ الْأَيْدِي وَالْأَرْجُلَ مِنْ خِلَافٍ فِرْعَوْنُ<\/p>\n<p>The first to crucify and the first to cut hands and feet on opposite sides was Pharaoh.<\/p>\n<p>Source: Tafsīr al-Ṭabar 7:124<\/p><\/blockquote>\n<p>The fact that Pharaoh, the epitome of tyranny in the Quran, was the first to persecute people by crucifixion and mutilation is reason enough to discourage and end the practice, even though some jurists have argued for its permissibility.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The Prophet (s) would encourage charity and he forbade mutilation.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[17,342,26,38,41,100,57,291,45],"class_list":["post-12904","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-charity-al-sadaqah","tag-al-fiqh","tag-forgiveness-al-maghfirah","tag-imam-abu-hanifah","tag-imam-al-shafii","tag-manners-al-adab","tag-moses-musa","tag-pharaoh-firawn","tag-quran-exegesis-tafsir"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3m8","jetpack-related-posts":[{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":12904,"position":0},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17921,"url":"https:\/\/www.abuaminaelias.com\/hafsa-maria-surat-at-tahreem\/","url_meta":{"origin":12904,"position":1},"title":"Story of Hafsa and Maria in Surat al-Tahrim","author":"Abu Amina Elias","date":"March 26, 2016","format":false,"excerpt":"\"Indeed, the only authentic narration is that it was about honey,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18681,"url":"https:\/\/www.abuaminaelias.com\/was-the-stoning-verse-abrogated\/","url_meta":{"origin":12904,"position":2},"title":"Is the stoning verse missing from the Quran?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The ruling of the verse of stoning is affirmed and its recitation is abrogated.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15662,"url":"https:\/\/www.abuaminaelias.com\/islam-female-genital-mutilation\/","url_meta":{"origin":12904,"position":3},"title":"Does Islam support female genital mutilation (FGM)?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Female circumcision is merely a cultural practice,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23075,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-committing-to-the-quran-reciting-pleasantly\/","url_meta":{"origin":12904,"position":4},"title":"Imam al-Mundhiri on Committing to the Quran, Reciting Pleasantly","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Strive to remember the Quran, for it is quicker to escape the hearts of men than camels.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16852,"url":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","url_meta":{"origin":12904,"position":5},"title":"No theology of rape in Islam","author":"Abu Amina Elias","date":"August 20, 2015","format":false,"excerpt":"\"Scholars agree that the rapist must be given legal punishment,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/12904","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=12904"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/12904\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=12904"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=12904"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=12904"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}