{"id":12964,"date":"2013-03-19T13:25:04","date_gmt":"2013-03-19T17:25:04","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=12964"},"modified":"2025-07-24T11:12:39","modified_gmt":"2025-07-24T07:12:39","slug":"quran-let-muslims-beat-wives","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/quran-let-muslims-beat-wives\/","title":{"rendered":"Husbands beating their wives in Islam?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It is not permissible for a husband to physically harm his wife by hitting or beating her in a way that causes pain, bruising, or injury. Such acts of abuse are grounds for the wife to seek a divorce imposed by an Islamic judge.<\/p>\n<p>However, there is a verse in the Quran that permits ‘striking’ the wife in cases of serious misconduct, but the Companions, the Salaf, and the scholars placed strict limits on this practice that functionally amount to a ban on domestic violence. In fact, the Prophet ﷺ never did it himself, and the jurists overwhelmingly ruled it as discouraged (<em>makruh<\/em>). The word ‘strike’ (<em>darb<\/em>) carries a number of connotations based on the context, but it does not mean ‘beating’ or ‘flogging’ (<em>jald<\/em>).<\/p>\n<p>In the case of a wife egregiously violating the conditions of her marriage contract, which is unjust to her husband, Allah recommends a step-by-step approach to correct her behavior.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنفَقُوا مِنْ أَمْوَالِهِمْ فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِّلْغَيْبِ بِمَا حَفِظَ اللَّهُ وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا<\/p>\n<p><strong>Men are the caretakers of women, as men have been provisioned by Allah over women and tasked with supporting them financially. Righteous women are devoutly obedient and, when alone, protective of what Allah has entrusted them with. If you sense misconduct from your women, advise them first, and if they persist, do not share their beds, and if they still persist, then strike them. But if they change their ways, do not be unjust to them. Surely, Allah is Most High, Most Great.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:34<\/p><\/blockquote>\n<p>This verse has been the subject of intense scrutiny, often misunderstood or misused—by both critics of Islam and some Muslims. A return to the classical texts, however, reveals a far more nuanced and ethical approach.<\/p>\n<p>Since men are typically the ‘bread-winners,’ perform military service, and are responsible for the well-being of their wives and children, they have been given limited authority over their wives. This is not because men are inherently superior, but because the additional responsibilities they have require a measure of authority.<\/p>\n<p>However, the husband does not have absolute control over his wife, but rather only in issues related to established marital rights. He is not allowed to micromanage her life, burden her, or completely deny her autonomy.<\/p>\n<p>Imam Ibn Nujaym said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَرْأَة لَا يَجِبُ عَلَيْهَا طَاعَةُ الزَّوْجِ فِي كُلِّ مَا يَأْمُرُ بِهِ إنَّمَا ذَلِكَ فِيمَا يَرْجِعُ إلَى النِّكَاحِ وَتَوَابِعِهِ خُصُوصًا إذَا كَانَ فِي أَمْرِهِ إضْرَارٌ بِهَا<\/p>\n<p>A woman is not obligated to obey her husband in everything he commands. This only applies to matters related to marriage and its corollaries, especially if his command causes her harm.<\/p>\n<p>Source: al-Baḥr al-Rā’iq Sharḥ Kanz al-Daqā’iq 5\/77<\/p><\/blockquote>\n<p><span style=\"font-size: 16px;\">Suppose a wife habitually disobeys her husband in matters for which he is entitled to obedience, or she commits other acts of serious misconduct (<\/span><em style=\"font-size: 16px;\">nushuz<\/em><span style=\"font-size: 16px;\">). In that case,<\/span> he must first warn her gently. If that does not work, he should stop sleeping in her bed. Finally, if neither of those works, he may ‘strike’ her without causing pain, bruising, or injury. This ‘striking’ is meant to discipline her, not to hurt her.<\/p>\n<p>Most women are mature enough that this step is never needed. Still, there may be rare cases of serious misconduct where some women do not respond to verbal counsel or separation, and this symbolic gesture serves as a final wake-up call—though even then, it is discouraged and nearly obsolete in practice today.<\/p>\n<p>All scholars unanimously agree that the permissible ‘striking’ must be ‘without violence’ (<em>ghayru mubarriḥ<\/em>) or ‘without pain’ (<em>ghayru mu&#8217;allim<\/em>), which indicates that this is a prohibition of domestic violence, not an endorsement of it. In most contemporary Muslim societies, legal and cultural norms—as well as Islamic ethical ideals—render this gesture virtually obsolete. Any act that causes harm, humiliation, or fear violates the Prophet’s ﷺ teachings.<\/p>\n<p>Amr bin al-Ahwas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا وَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا فَإِنَّمَا هُنَّ عَوَانٌ عِنْدَكُمْ لَيْسَ تَمْلِكُونَ مِنْهُنَّ شَيْئًا غَيْرَ ذَلِكَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ فَإِنْ فَعَلْنَ فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا<\/p>\n<p><strong>Surely, I enjoin you to treat women well, for they are like your captives. You do not have any right to treat them otherwise, unless they commit clear obscenity. If they do so, you may forsake their beds and then ‘strike’ them without hurting them, but if they obey you, then you may not do so.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1163, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/17\/prophet-enjoins-good-women\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ضَرْبًا غَيْرَ مُبَرِّحٍ<\/p>\n<p>It is a striking without violence.<\/p><\/blockquote>\n<p>It was said, “What is a striking without violence?” Ibn Abbas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> بِالسِّوَاكِ وَنَحْوِهِ<\/p>\n<p>It is with a toothstick or something similar.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 4:34<\/p><\/blockquote>\n<p>Al-Hasan al-Basri, may Allah be pleased with him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاضْرِبُوهُنَّ أيّ ضَرْبٌ غَيْرُ مُبَرِّحٍ غَيْرُ مُؤَثِّرٍ<\/p>\n<p>The verse, ‘<strong>And strike them<\/strong>,’ means without violence or leaving a mark.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 7623<\/p><\/blockquote>\n<p>Imam al-Razi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أن يكون الضرب بمنديل ملفوف أو بيده ولا يضربها بالسياط ولا بالعصا<\/p>\n<p>It should be a striking with a folded handkerchief or his palm, and he should not strike her with whips or clubs.<\/p>\n<p>Source: Tafsīr al-Rāzī 4:34<\/p><\/blockquote>\n<p>Imam Ibn &#8216;Ajibah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ضربًا غير مؤلم ولا شائن<\/p>\n<p>It is a striking without causing pain or disgrace.<\/p>\n<p>Source: al-Baḥr al-Madīd 4:34<\/p><\/blockquote>\n<p>Imam al-Qurtubi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالضَّرْبُ فِي هَذِهِ الْآيَةِ هُوَ ضَرْبُ الْأَدَبِ غَيْرُ الْمُبَرِّحِ وَهُوَ الَّذِي لَا يَكْسِرُ عَظْمًا وَلَا يَشِينُ جَارِحَةً كَاللَّكْزَةِ وَنَحْوِهَا فَإِنَّ الْمَقْصُودَ مِنْهُ الصَّلَاحُ لَا غَيْرَ<\/p>\n<p>The striking in this verse is a striking of discipline without violence, which may not break bones or disgrace with injuries as if it were a clenched first, and so on. Indeed, the purpose is rectification of her behavior and nothing else.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 4:34<\/p><\/blockquote>\n<p>Imam al-Zamakhshari commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالُوا يَجِبُ أَنْ يَكُونَ ضَرْبًا غَيْرَ مُبَرِّحٍ لا يَجْرَحُهَا وَلا يَكْسِرُ لَهَا عَظْمًا وَيَجْتَنِبُ الْوَجْهَ<\/p>\n<p>Scholars said it must be a striking without violence. It may not cause injury, nor break bones, and he must avoid the face.<\/p>\n<p>Source: al-Kashshāf 4:34<\/p><\/blockquote>\n<p>Imam Ibn Kathir commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الْفُقَهَاءُ هُوَ أَلَا يَكْسِرَ فِيهَا عُضْوًا وَلَا يُؤَثِّرَ فِيهَا شَيْئًا<\/p>\n<p>The jurists said it may not break limbs, nor cause a mark of any kind.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 4:34<\/p><\/blockquote>\n<p>Imam Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَعْنَى غَيْرَ مُبَرِّحٍ أَيْ لَيْسَ بِالشَّدِيدِ قَالَ الْخَلَّالُ سَأَلْت أَحْمَدَ بْنَ يَحْيَى عَنْ قَوْلِهِ ضَرْبًا غَيْرَ مُبَرِّحٍ قَالَ غَيْرَ شَدِيدٍ وَعَلَيْهِ أَنْ يَجْتَنِبَ الْوَجْهَ وَالْمَوَاضِعَ الْمَخُوفَةَ لِأَنَّ الْمَقْصُودَ التَّأْدِيبُ لَا الْإِتْلَافُ<\/p>\n<p>The meaning of ‘not violent’ is ‘not severe.’ Al-Khalal said: I asked Ahmad ibn Yahya about his statement, ‘a striking that is not violent.’ He said, ‘Not severe, and he should avoid the face and sensitive areas, because the purpose is discipline, not damage.’<\/p>\n<p>Source: al-Mughnī7\/319<\/p><\/blockquote>\n<p>Shaykh Ibn ‘Uthaymeen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ضَرْبًا غيرَ مُبَرِّحٍ يعني غير مؤلِم ولا مُوجع لكن للتأديب &#8230; لأن المقصود التأديب لا التعذيب<\/p>\n<p>A ‘striking’ without violence means without pain or hurting her… as the intention is to discipline, not torture.<\/p>\n<p>Source: al-Sharḥ al-Ṣawtī li-Zād al-Mustaqni&#8217; 2\/2959<\/p><\/blockquote>\n<p>And Imam ibn ‘Ashur writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ الْجُمْهُورَ قَيَّدُوا ذَلِكَ بِالسَّلَامَةِ مِنَ الْإِضْرَارِ وَبِصُدُورِهِ مِمَّنْ لَا يُعَدُّ الضَّرْبُ بَيْنَهُمْ إِهَانَةً وَإِضْرَارًا<\/p>\n<p>The majority restricted this ‘striking’ to being free from harm and carried out when neither of them considers it insulting or harmful.<\/p>\n<p>Tafsīr al-Taḥrīr wal-Tanwīr 5\/44<\/p><\/blockquote>\n<p>Specifically, it is forbidden to deliberately strike the face of one’s wife, or anyone else, for any reason.<\/p>\n<p>Mu’awiyah al-Qushayri reported: I said, “O Messenger of Allah, what are the rights of women over us?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ تُطْعِمَهَا إِذَا طَعِمْتَ وَتَكْسُوَهَا إِذَا اكْتَسَيْتَ أَوْ اكْتَسَبْتَ وَلَا تَضْرِبْ الْوَجْهَ<\/p>\n<p><strong>That you feed them when you eat, you clothe them when you clothe yourself, you do not strike her face.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2142, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/15\/rights-wives-over-husbands\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الضَّرْبُ فِي الْوَجْهِ فَمَنْهِيٌّ عَنْهُ فِي كُلِّ الْحَيَوَانِ الْمُحْتَرَمِ مِنَ الْآدَمِيِّ وَالْحَمِيرِ وَالْخَيْلِ وَالْإِبِلِ وَالْبِغَالِ وَالْغَنَمِ وَغَيْرِهَا لَكِنَّهُ فِي الْآدَمِيِّ أَشَدُّ لِأَنَّهُ مَجْمَعُ الْمَحَاسِنِ مَعَ أَنَّهُ لَطِيفٌ لِأَنَّهُ يَظْهَرُ فِيهِ أَثَرُ الضَّرْبِ وَرُبَّمَا شَانَهُ وَرُبَّمَا آذَى بَعْضَ الْحَوَاسِّ<\/p>\n<p>As for hitting the face, it is forbidden for all creatures, including humans, donkeys, horses, camels, mules, sheep, and others. However, it is more severe for humans, as the face is the sum of all beautiful characteristics, despite being subtle, for it will leave a mark and possibly disfigure it or harm some of the senses.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 14\/97<\/p><\/blockquote>\n<p>To summarize, a husband may ‘strike’ his wife as a last resort to correct her misbehavior, but it must not be violent, painful, injurious, humiliating, or on sensitive areas like the face. These conditions practically forbid domestic violence, not allow it. It is nothing more than a teaching mechanism, a physical symbolic signal.<\/p>\n<p>The Prophet ﷺ would use such a symbolic &#8216;striking&#8217; with his male companions as a means of catching their attention.<\/p>\n<p>Abu Dharr reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَضَرَبَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ عَلَى مَنْكِبِي ثُمَّ قَالَ<\/p>\n<p>The Prophet, peace and blessings be upon him, struck my chest with his hand and he said…<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1825, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/04\/imam-sultan-amanah-trust\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Prophet ﷺ did not intend to hurt his companion, but rather to signal the importance of what he was about to tell him.<\/p>\n<p>Nevertheless, ‘striking’ the wife in any circumstance, even if done lightly, was discouraged by the Companions and the Salaf. The Prophet ﷺ never did it himself, which is why the jurists ruled it as a disapproved action.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا قَطُّ بِيَدِهِ وَلَا امْرَأَةً وَلَا خَادِمًا إِلَّا أَنْ يُجَاهِدَ فِي سَبِيلِ اللَّهِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, never struck anything with his hand, neither a woman nor a servant, unless he was fighting in the way of Allah.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2328, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/12\/01\/prophet-never-hit-women\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ أَنَّ ضَرْبَ الزَّوْجَةِ وَالْخَادِمِ وَالدَّابَّةِ وَإِنْ كَانَ مُبَاحًا لِلْأَدَبِ فَتَرْكُهُ أفضل<\/p>\n<p>Striking a wife, a servant, or an animal, even if it were justified as discipline, it is still better to avoid it.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 15\/84<\/p><\/blockquote>\n<p>‘Ata’, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> لَا يَضْرِبُهَا وَإِنْ أَمَرَهَا وَنَهَاهَا فَلَمْ تُطِعْهُ وَلَكِنْ يَغْضَبُ عَلَيْهَا<\/p>\n<p>A man should not strike his wife if he commands her and prohibits her and she does not obey him, but rather he should show her his anger.<\/p>\n<p>Source: Aḥkām al-Qur&#8217;ān li-Ibn al-&#8216;Arabī 4:34<\/p><\/blockquote>\n<p>Iyas ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ لَيْسَ أُولَئِكَ بِخِيَارِكُمْ<\/p>\n<p><strong>Many women have come to the family of Muhammad complaining about their husbands<\/strong> <strong>striking them. These men are not the best among you.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2146, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/10\/nikah-man-strike-wife-not-best\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam al-Azimabadi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلْ خِيَارُكُمْ مَنْ لَا يَضْرِبُهُنَّ وَيَتَحَمَّلُ عَنْهُنَّ<\/p>\n<p>Rather, the best among you is he who does not strike them, but rather is forbearing with them.<\/p>\n<p>Source: ‘Awn al-Ma’būd 6\/130<\/p><\/blockquote>\n<p>Abdullah bin Zam’ah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بِمَ يَضْرِبُ أَحَدُكُمْ امْرَأَتَهُ ضَرْبَ الْفَحْلِ أَوْ الْعَبْدِ ثُمَّ لَعَلَّهُ يُعَانِقُهَا<\/p>\n<p><strong>How does one of you strike his wife as he beats the stallion camel and then embrace her?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6042, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/12\/prophet-rebukes-wife-beating\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam al-Bukhari classified this Hadith under the heading:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَابُ مَا يُكْرَهُ مِنْ ضَرْبِ النِّسَاءِ وَقَوْلِهِ وَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ<\/p>\n<p>Chapter on discouragement to strike wives, and His saying, ‘<strong>&#8230;and strike them<\/strong>,’ means without violence.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7\/32<\/p><\/blockquote>\n<p>Imam Ibn Hajar, the leading exegete of Sahih al-Bukhari, commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ إِشَارَةٌ إِلَى أَنَّ ضَرْبَهُنَّ لَا يُبَاحُ مُطْلَقًا بَلْ فِيهِ مَا يُكْرَهُ كَرَاهَةَ تَنْزِيهٍ<\/p>\n<p>This indicates that striking them is not permissible unconditionally. Rather, it is discouraged.<\/p>\n<p>Source: Fatḥ al-Bārī 9\/302<\/p><\/blockquote>\n<p>And the Imam continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ اكْتَفَى بِالتَّهْدِيدِ وَنَحْوِهِ كَانَ أَفْضَلَ وَمَهْمَا أَمْكَنَ الْوُصُولُ إِلَى الْغَرَضِ بِالْإِيهَامِ لَا يَعْدِلُ إِلَى الْفِعْلِ لِمَا فِي وُقُوعِ ذَلِكَ مِنَ النَّفْرَةِ الْمُضَادَّةِ لِحُسْنِ الْمُعَاشَرَةِ الْمَطْلُوبَةِ فِي الزَّوْجِيَّةِ<\/p>\n<p>If warnings and the like are enough, that is better. Whenever it is possible to achieve the goal through persuasion, he should not resort to physical action because that can cause estrangement, which is contrary to the good treatment required in marriage.<\/p>\n<p>Source: Fatḥ al-Bārī 9\/304<\/p><\/blockquote>\n<p>Imam Ibn Battal commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنما يكره من ضرب النساء التعدى فيه والإسراف<\/p>\n<p>Surely, it is reprehensible to strike one’s wife aggressively and excessively.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ al-Bukhārī li-Ibn Baṭṭāl 7\/325<\/p><\/blockquote>\n<p>And Imam Badr al-Din commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يجوز الضَّرْب الْيَسِير بِحَيْثُ لَا يحصل مِنْهُ النفور التَّام فَلَا يفرط فِي الضَّرْب وَلَا يفرط فِي التَّأْدِيب<\/p>\n<p>Lightly ‘striking’ is permissible, provided that it does not result in complete estrangement, so do not be extreme in striking or discipline.<\/p>\n<p>Source: &#8216;Umdat al-Qārī Sharḥ Ṣaḥīḥ al-Bukhārī 20\/193<\/p><\/blockquote>\n<p>Gently striking the wife, even if her egregious behavior justified it, often leads to estrangement and defeats the purpose of marriage in the first place, which is supposed to be based on love and mercy.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا لِّتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ<\/p>\n<p><strong>One of His signs is that He created for you spouses from among yourselves so that you may find comfort in them, and He has placed between you affection and mercy. Surely, in this are signs for people who reflect.<\/strong><\/p>\n<p>Surat al-Rum 30:21<\/p><\/blockquote>\n<p>If a husband transgresses the limits and hurts his wife in any way, she has the right to request an Islamic judge to impose a divorce on him. The Prophet ﷺ himself advocated on behalf of a woman who was being violently beaten by her husband, setting a legal precedent for authorities to intervene.<\/p>\n<p>Ali ibn Abi Talib reported: The wife of Al-Walid ibn ‘Uqbah came to the Prophet, peace and blessings be upon him, and she complained to him, saying, “O Messenger of Allah! Al-Walid has beaten me!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُولِي لَهُ قَدْ أَجَارَنِي<\/p>\n<p><strong>Say to him, ‘He has protected me<\/strong>.’<\/p><\/blockquote>\n<p>She did not stay but for a while until she returned, and she said, “He did not give me anything but more beatings!” The Prophet tore a piece of cloth from his shirt, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُولِي لَهُ إِنَّ رَسُولَ اللَّهِ قَدْ أَجَارَنِي<\/p>\n<p><strong>Say to him, ‘Verily, the Messenger of Allah has given me his protection!’<\/strong><\/p><\/blockquote>\n<p>She did not stay but for a while until she returned, and she said, “He did not give me anything but more beatings!” The Prophet raised his hands, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ عَلَيْكَ الْوَلِيدَ أَثِمَ بِي مَرَّتَيْنِ<\/p>\n<p><strong>O Allah, you must deal with Al-Walid, for he has sinned against me twice!<\/strong><\/p>\n<p>Source: Musnad Aḥmad 1257, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/17\/prophet-protects-woman-from-husband\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam Khalil writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولَهَا التَّطْلِيقُ بِالضَّرَرِ ولَوْ لَمْ تَشْهَدِ الْبَيِّنَةُ بِتَكَرُّرِهِ وعَلَيْهِمَا الإِصْلاحُ وإِنْ تَعَذَّرَ وإِنْ أَسَاءَ الزَّوْجُ طَلَّقَا بِلا خُلْعٍ<\/p>\n<p>She has the right to divorce on the grounds of harm, even if there is no evidence that it has happened repeatedly. They must try to reconcile, but if that is not possible, they are divorced without requiring the husband’s consent or her compensation.<\/p>\n<p>Source: Mukhtaṣar Khalīl 1\/111<\/p><\/blockquote>\n<p>Imam al-Majlisi commented on this statement:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولها التطليق بالضرر هو أن لا يعاشرها بالمعروف واعلم أن المعاشرة بالمعروف من حقها عليه كما أن ذلك من حقه عليها<\/p>\n<p>She has the right to divorce on the grounds of harm, which is that he does not treat her kindly. Know that treating her kindly is her right over him, just as it is his right over her.<\/p>\n<p>Source: Lawāmi’ al-Durar fī Hatk Astār al-Mukhtaṣar 6\/640<\/p><\/blockquote>\n<p>Imam al-Khattab al-Maliki commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنْ الضَّرَرِ قَطْعُ كَلَامِهِ عَنْهَا وَتَحْوِيلُ وَجْهِهِ فِي الْفِرَاشِ عَنْهَا وَإِيثَارُ امْرَأَةٍ عَلَيْهَا وَضَرْبُهَا ضَرْبًا مُؤْلِمًا<\/p>\n<p>Harmful acts include cutting off his speech to her, turning his face away from her in bed, preferring another woman over her, and hitting her painfully.<\/p>\n<p>Source: Mawāhib al-Jalīl fī Sharḥ Mukhtaṣar Khalīl 4\/17<\/p><\/blockquote>\n<p>And Imam al-Dasuqi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">للزوجة التطليق على الزوج بالضرر وهو ما لا يجوز شرعا كهجرها بلا موجب شرعي وضربها كذلك وسبها وسب أبيها<\/p>\n<p>The wife may have a separation from her husband due to harm caused that is not permissible, such as abandoning her without a legal justification, striking her likewise, or cursing her or her parents.<\/p>\n<p>Source: al-Sharḥ al-Kabīr wa Ḥāshiyat al-Dasūqī 2\/345<\/p><\/blockquote>\n<p>The Prophet ﷺ would warn women in the community about men who would beat their wives. For example, he advised Fatimah ibn Qays not to marry a man who was known for hitting women, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا أَبُو الْجَهْمِ فَرَجُلٌ ضَرَّابٌ لِلنِّسَاءِ وَلَكِنْ أُسَامَةَ<\/p>\n<p><strong>As for Abu al-Jahm, he frequently beats women. Rather, you should marry Usamah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1480, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/03\/19\/hadith-on-marriage-obedience-to-allah-and-his-messenger-is-the-best-for-a-marriage\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>On another occasion, the Prophet ﷺ separated a man from his wife because he had hit her.<\/p>\n<p>Yahya ibn Sa’id reported: Habibah bint Sahl was the wife of Thabit ibn Qays, and she was the neighbor of the Messenger of Allah, peace and blessings be upon him. Thabit had struck her, so she appeared at the door of the Prophet, saying, “Thabit and I can no longer be married.” The Prophet said to Thabit:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُذْ مِنْهَا وَخَلِّ سَبِيلَهَا<\/p>\n<p><strong>Take what she owes to you and let her go her way.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 2200, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/17\/talaq-darb-husband\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>As such, classical jurists established the right of a wife to seek a divorce from an Islamic judge if her husband harms her, either physically by hitting her or emotionally by verbally abusing her.<\/p>\n<p>Finally, Allah and His Messenger ﷺ obligated Muslim men to treat women in general, and their wives in particular, with the utmost respect and chivalry. The measure of a man&#8217;s character is directly related to his treatment of women.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ<\/p>\n<p><strong>And live with them honorably.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:19<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَخِيَارُكُمْ خِيَارُكُمْ لِنِسَائِهِمْ خُلُقًا<\/p>\n<p><strong>The most complete of believers in faith are those with the best character, and the best of you are the best in behavior to their women.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1162, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/10\/best-good-character-women\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In sum, Islam teaches men to treat women with the utmost respect and compassion. The Quran does not allow husbands to harm or &#8216;beat&#8217; their wives. Rather, the &#8216;striking&#8217; mentioned in the verse is a symbolic gesture, a gentle physical signal, and a permissible last resort to correct a wife&#8217;s serious misconduct, but it is better not to do it at all. If a husband harms his wife in any way, either physically, emotionally, or financially, she has the right for an Islamic judge to impose a divorce upon him.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The best of you are the best in behavior to their women.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[24,25,49,41,100,53,93,94,58,45,128],"class_list":["post-12964","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-family-ties-sillat-rahim","tag-forbearance-al-hilm","tag-gentleness-al-rifq","tag-imam-al-shafii","tag-manners-al-adab","tag-marriage-al-nikah","tag-moderation-al-wasitiyyah","tag-obedience-al-taah","tag-patience-al-sabr","tag-quran-exegesis-tafsir","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3n6","jetpack-related-posts":[{"id":13256,"url":"https:\/\/www.abuaminaelias.com\/why-does-islam-allow-polygamy\/","url_meta":{"origin":12964,"position":0},"title":"Why does Islam allow polygamy?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"You will never be able to do perfect justice between wives...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13592,"url":"https:\/\/www.abuaminaelias.com\/quran-mistake-maryam-harun\/","url_meta":{"origin":12964,"position":1},"title":"Does the Quran mistake Mary as sister of Aaron?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"O sister of Aaron, your father was not a man of evil...\" (19:28)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21204,"url":"https:\/\/www.abuaminaelias.com\/textual-corruption-of-surat-al-asr\/","url_meta":{"origin":12964,"position":2},"title":"Textual corruption of Surat al-‘Asr?","author":"Abu Amina Elias","date":"September 18, 2019","format":false,"excerpt":"\"By the time and calamities of age!\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23075,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-committing-to-the-quran-reciting-pleasantly\/","url_meta":{"origin":12964,"position":3},"title":"Imam al-Mundhiri on Committing to the Quran, Reciting Pleasantly","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Strive to remember the Quran, for it is quicker to escape the hearts of men than camels.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20171,"url":"https:\/\/www.abuaminaelias.com\/thamud-historical-error-quran\/","url_meta":{"origin":12964,"position":4},"title":"Thamud is an historical error in the Quran?","author":"Abu Amina Elias","date":"February 10, 2019","format":false,"excerpt":"\"The Quran does not make any claim about the historicity of specific sites,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13539,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-reading-the-quran\/","url_meta":{"origin":12964,"position":5},"title":"Imam al-Nawawi on Reading and Reciting the Quran","author":"Abu Amina Elias","date":"May 16, 2013","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/12964","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=12964"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/12964\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=12964"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=12964"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=12964"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}