{"id":13131,"date":"2016-07-04T10:49:58","date_gmt":"2016-07-04T06:49:58","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13131"},"modified":"2025-07-04T10:55:31","modified_gmt":"2025-07-04T06:55:31","slug":"was-prophet-muhammad-a-terrorist","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-a-terrorist\/","title":{"rendered":"Was Prophet Muhammad a terrorist?"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Perhaps the most challenging issue for Muslim communities today is the spectre of terrorist violence afflicting many places in the world and the false perception of Islam this creates in the minds of people. Terrorism has been defined by modern Muslim authorities as follows:<\/p>\n<blockquote><p>Any act of violence or threat perpetrated to carry out a criminal plan with the aim of terrorizing people or threatening to harm them or imperiling their lives, honor, freedom, security, or rights.<\/p>\n<p>Source: OIC Convention to Combat Terrorism<\/p><\/blockquote>\n<p>According to this definition, terrorism includes the unlawful and random killing of women, children, and non-combatants as a means of political change. Such acts are completely forbidden and condemned by Islam. Muslims are only allowed to fight hostile forces who initiate aggression against themselves and innocent people.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلَا تَعْتَدُوا ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ<\/p>\n<p><b>Fight in the way of Allah those who fight you but do not transgress. Verily, Allah does not love transgressors.<\/b><\/p>\n<p>Surah Al-Baqarah 2:190<\/p><\/blockquote>\n<p>“Do not transgress,” has been interpreted by scholarly authorities as a firm prohibition against killing women, children, and civilians.<\/p>\n<p>Ibn Abbas explained the verse, saying:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَقْتُلُوا النِّسَاءَ وَلَا الصِّبْيَانَ وَلَا الشَّيْخَ الْكَبِيرَ وَلَا مَنْ أَلْقَى إِلَيْكُمُ السَّلَمَ وَكَفَ يَدَهُ فَإِنْ فَعَلْتُمْ هَذَا فَقَدَ اعْتَدَيْتُمْ<\/p>\n<p>Do not kill women, children, old men, or whoever comes to you offering peace and refrains from fighting. If you did so, you would have certainly transgressed.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/18\/ibn-abbas-on-transgression-do-not-kill-women-children-old-men-or-anyone-who-refuses-to-fight-you\/\">Tafseer At-Tabari 2:190<\/a><\/p><\/blockquote>\n<p>This concern was addressed directly by the Prophet himself when he explicitly forbade and condemned the killing of women, children, and civilians.<\/p>\n<p>Abdullah ibn Umar reported:<\/p>\n<blockquote>\n<p align=\"right\">أَنَّ امْرَأَةً وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ<\/p>\n<p>A woman was found killed in one of the battles of the Messenger of Allah, so he condemned the killing of women and children.<\/p>\n<p>Source: Sahih Bukhari 2851, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/17\/hadith-on-jihad-the-prophet-condemned-the-killing-of-women-children-and-those-who-do-not-fight\/\"><b><i><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/i><\/b><\/a><\/p><\/blockquote>\n<p>Hanzala Al-Katib reported: We went on an expedition with the Messenger of Allah, peace and blessings be upon him, and we passed by a woman who had been killed and the people were gathered around her. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">مَا كَانَتْ هَذِهِ تُقَاتِلُ فِيمَنْ يُقَاتِلُ<\/p>\n<p><b>She was not one of those who were fighting.<\/b><\/p><\/blockquote>\n<p>Then the Prophet told a man to make the announcement:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُكَ يَقُولُ لَا تَقْتُلَنَّ ذُرِّيَّةً وَلَا عَسِيفًا<\/p>\n<p><b>Verily, the Messenger of Allah has commanded you, saying: Do not kill children or workers.<\/b><\/p>\n<p>Source: Sunan ibn Majah 2842 Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/17\/hadith-on-bloodshed-the-prophet-forbade-muslims-from-killing-civilian-non-combatants-in-jihad\/\"><i>Hasan<\/i><\/a><\/p><\/blockquote>\n<p>The Quran declares that killing, kidnapping, terrorizing people, and expelling them from their homes are all crimes that were forbidden for the Israelites, and likewise for the Muslims.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">ثُمَّ أَنتُمْ هَٰؤُلَاءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِم بِالْإِثْمِ وَالْعُدْوَانِ وَإِن يَأْتُوكُمْ أُسَارَىٰ تُفَادُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ<\/p>\n<p><b>You are those same ones who are killing one another and evicting a party of your people from their homes, cooperating against them in sin and aggression. If they come to you as captives, you sell them for ransom, although their eviction was forbidden to you. So do you believe in part of the Book and disbelieve in the rest?<\/b><\/p>\n<p>Surah Al-Baqarah 2:85<\/p><\/blockquote>\n<p>People who commit such crimes in the name of religion are guilty of a glaring hypocrisy, strictly adhering only to part of the scriptures and ignoring the values expressed in other passages.<\/p>\n<p>For these reasons, the Organization of Islamic Cooperation at the United Nations issued the following statement:<\/p>\n<blockquote><p>The tenets of the tolerant Islamic Law rejects all forms of violence and terrorism, and in particular especially those based on extremism, and it calls for protection of human rights, whose provisions are paralleled by the principles and rules of international law founded on cooperation between peoples for the establishment of peace.<\/p><\/blockquote>\n<p>Even Orientalist scholars with less-than-favorable views of Muslim societies must admit that Islam does not permit terrorism in way. Professor Bernard Lewis of Princeton University cannot be described as an Islamic apologist. His writings are often critical of Muslims, yet he states clearly that modern terrorism committed in the name of Islam has nothing to do with the classical scholarly tradition. Lewis writes:<\/p>\n<blockquote><p>Muslim fighters are commanded not to kill women, children, or the aged unless they attack first; not to torture or otherwise ill-treat prisoners; to give fair warning of the opening of hostilities or their resumption after a truce; and to honor agreements&#8230; At no time did the classical jurists offer any approval or legitimacy to what we nowadays call terrorism. Nor indeed is there any evidence of the use of terrorism as it is practiced nowadays.<\/p>\n<p>Source: Lewis, B., &amp; Churchill, B. (2009). <em>Islam: The religion and the people<\/em>, p. 151<\/p><\/blockquote>\n<p>Lewis affirms that the sacred scriptures of Islam provide no legal support for terrorist actions:<\/p>\n<blockquote><p>At no point do the basic texts of Islam enjoin terrorism and murder. At no point, as far as I am aware, do they even consider the random slaughter of uninvolved bystanders.<\/p>\n<p>Source: Lewis, B. (2003). <i>The crisis of Islam: Holy war and unholy terror<\/i>, p. 39<\/p><\/blockquote>\n<p>Professor Lewis&#8217; writings are subject to peer-reviewed scrutiny by scholars of competing academic presses. No one with the relevant academic credentials has been able to seriously challenge him on this point because it is the truth.<\/p>\n<p>However, verses of the Quran are taken out of context by some Muslims and non-Muslims alike to argue that Islam justifies acts of terrorism. One verse in particular refers to Allah and the angels casting fear into the hearts of the unbelievers who, at the time, were waging a war of aggression and extermination against the early Muslim community.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِذْ يُوحِي رَبُّكَ إِلَى الْمَلَائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا ۚ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الْأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ<\/p>\n<p><b>Remember when your Lord inspired to the angels, saying: I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike them upon their necks and strike their every fingertip.<\/b><\/p>\n<p>Surah Al-Anfal 8:12<\/p><\/blockquote>\n<p>Often quoted but rarely contextualized, the verse refers to a miraculous event in which the enemies of Islam were confronted by the angels. It does not command Muslims to terrorize other communities through bombings and acts of random violence.<\/p>\n<p>Ibn Kathir explains the meaning of this verse, saying:<\/p>\n<blockquote>\n<p align=\"right\">ثَبِّتُوا أَنْتُمُ الْمُسْلِمِينَ وَقَوُّوا أَنْفُسَهُمْ عَلَى أَعْدَائِهِمْ عَنْ أَمْرِي لَكُمْ بِذَلِكَ سَأُلْقِي الرُّعْبَ وَالْمَذَلَّةَ وَالصَّغَارَ عَلَى مَنْ خَالَفَ أَمْرِي وَكَذَّبَ رَسُولِي<\/p>\n<p>You – the angels – support the Muslims and strengthen their resolve against their enemies, thus implementing My command. I – Allah – will cast terror, disgrace, and humiliation upon whoever defies My command and rejects My messenger.<\/p>\n<p>Source: Tafseer Ibn Kathir 8:12<\/p><\/blockquote>\n<p>In the aftermath of the battle, there were signs that the angels had supported the Muslims in their defensive struggle against the persecuting army.<\/p>\n<p>Ar-Rabi’ ibn Anas said:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ النَّاسُ يَوْمَ بَدْرٍ يَعْرِفُونَ قَتْلَى الْمَلَائِكَةِ مِمَّنْ قَتَلُوا هُمْ بِضَرْبٍ فَوْقَ الْأَعْنَاقِ وَعَلَى الْبَنَانِ مِثْلَ سِمَةِ النَّارِ قَدِ أُحْرِقَ بِهِ<\/p>\n<p>In the aftermath of the battle of Badr, the people used to recognize whomever the angels killed by the wounds over their necks, fingers and toes, because those parts had a mark as if they were branded by fire.<\/p><\/blockquote>\n<p>Therefore, the verse refers to divine intervention by angels in support of the Muslims who were defending their city from aggression. The terror thrown into the unbelievers&#8217; hearts was upon their realization that Allah was supporting the Muslims with angels and miracles. It does not mean Muslims have been commanded to spread terror and violence in society as a means of political change. Muslims are only permitted to take up arms against those who have declared war against them, never as a means to force people into Islam.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الكفار إنما يقاتلون بشرط الحراب كما ذهب اليه جمهور العلماء وكما دل عليه الكتاب والسنة<\/p>\n<p>The unbelievers are only fought on the condition that they declare war according to the majority of scholars, as evident in the book and prophetic tradition.<\/p>\n<p>Source: An-Nubuwwat 1\/140<\/p><\/blockquote>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p align=\"right\">وَلَمْ يُكْرِهْ أَحَدًا قَطُّ عَلَى الدِّينِ وَإِنَّمَا كَانَ يُقَاتِلُ مَنْ يُحَارِبُهُ وَيُقَاتِلُهُ وَأَمَّا مَنْ سَالَمَهُ وَهَادَنَهُ فَلَمْ يُقَاتِلْهُ وَلَمْ يُكْرِهْهُ عَلَى الدُّخُولِ فِي دِينِهِ<\/p>\n<p>The Prophet never forced the religion upon anyone, but rather he only fought those who waged war against him and fought him first. As for those who made peace with him or conducted a truce, then he never fought them and he never compelled them to enter his religion.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/02\/27\/ibn-al-qayyim-on-jihad-the-prophet-never-fought-those-who-made-peace-with-him\/\">Hidayat Al-Hayara 237<\/a><\/p><\/blockquote>\n<p>In conclusion, terrorism, political violence, and spreading religion by force is forbidden in Islam. Killing women, children, and non-combatants as well as initiating wars of aggression are major sins in Islam according to classical and modern authorities. Historically, the Prophet only fought battles in self-defense and to repel aggression against the Muslim community.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Fight in the way of Allah those who fight you, but do not transgress.&#8221; (2:190)<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[122,18,47,48,100,55,93,59,103,45,121,98],"class_list":["post-13131","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-angels-malaikah","tag-community-jamaah","tag-jihad","tag-justice-adl","tag-manners-al-adab","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-peace","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-terrorism-al-irhab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3pN","jetpack-related-posts":[{"id":13557,"url":"https:\/\/www.abuaminaelias.com\/suicide-bombings-in-islam\/","url_meta":{"origin":13131,"position":0},"title":"Suicide bombings are unlawful in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill yourselves. Verily, Allah is ever merciful to you.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14171,"url":"https:\/\/www.abuaminaelias.com\/islam-forbids-violent-rebellion\/","url_meta":{"origin":13131,"position":1},"title":"Non-Violent Reform of Unjust Muslim Rulers","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"You should listen and obey, even if they strike your back.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16006,"url":"https:\/\/www.abuaminaelias.com\/prophet-accept-severed-heads\/","url_meta":{"origin":13131,"position":2},"title":"Did the Prophet accept presentation of severed heads?","author":"Abu Amina Elias","date":"August 19, 2014","format":false,"excerpt":"\"A severed head was never presented to the Messenger of Allah.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14876,"url":"https:\/\/www.abuaminaelias.com\/who-implements-hudud-punishments\/","url_meta":{"origin":13131,"position":3},"title":"Who carries out Islamic legal punishments?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"It is forbidden to establish a legal punishment unless...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":13131,"position":4},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16057,"url":"https:\/\/www.abuaminaelias.com\/dangers-of-takfir-declaring-muslims-to-be-apostates\/","url_meta":{"origin":13131,"position":5},"title":"Dangers of takfir, declaring Muslims to be apostates","author":"Abu Amina Elias","date":"November 4, 2014","format":false,"excerpt":"\"I will not declare anyone from this nation to be an unbeliever.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13131","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13131"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13131\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13131"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13131"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}