{"id":13188,"date":"2016-07-04T10:49:59","date_gmt":"2016-07-04T06:49:59","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13188"},"modified":"2025-07-04T10:55:25","modified_gmt":"2025-07-04T06:55:25","slug":"muslims-hate-infidels-neighbors","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/muslims-hate-infidels-neighbors\/","title":{"rendered":"Are Muslims supposed to hate the infidels?"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>The Prophet (s) taught Muslims to love goodness for all creation, to treat people the way they would love to be treated, and to hate sinful deeds but not the sinners who commit them.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><b>None of you has faith until he loves for his brother or his neighbor what he loves for himself.<\/b><\/p>\n<p>Source: Sahih Bukhari 13, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>An-Nawawi commented on this tradition, saying:<\/p>\n<blockquote>\n<p align=\"right\">الأولى أن يحمل ذلك على عموم الأخوة حتى يشمل الكافر والمسلم فيحب لأخيه الكافر مايحب لنفسه &#8230; والمراد بالمحبة إرادة الخير والمنفعة ثم المراد المحبة الدينية لا المحبة البشرية<\/p>\n<p>It is better to interpret this as brotherhood in general, such that it includes the disbeliever and the Muslim. So he should love for his brother, the disbeliever, what he loves for himself… The meaning of love here is an intention for good and benefit, and this meaning is religious love, not human love.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/an-nawawi-the-meaning-of-brotherhood-is-to-love-good-for-all-humanity-muslims-and-disbelievers\/\">Sharh Arba’een An-Nawawi<\/a><\/p><\/blockquote>\n<p>Therefore, Muslims have been commanded to love their neighbors as themselves, whether they are Muslims or non-Muslims, righteous or sinful. This involves treating people as if they were our own selves.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ أَحَبَّ أَنْ يُزَحْزَحَ عَنْ النَّارِ وَيَدْخُلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَنِيَّتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><b>Whoever would love to be delivered from the Hellfire and entered into Paradise, then let him die with faith in Allah and the Last Day, and let him treat the people the way he would love to be treated.<\/b><\/p>\n<p>Source: Sahih Muslim 1844 Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/10\/hadith-on-salvation-let-him-treat-the-people-the-way-he-would-love-to-be-treated\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Likewise, Muslims have been warned about hatred, which is a desire to harm others.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا<\/p>\n<p><b>Do not hate each other, do not envy each other, do not turn away from each other, but rather be servants of Allah as brothers.<\/b><\/p>\n<p>Source: Sahih Muslim 2559 Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/10\/03\/brotherhood-means-to-reject-hate-envy-and-cruelty\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Az-Zubair ibn Awwam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">دَبَّ إِلَيْكُمْ دَاءُ الْأُمَمِ قَبْلَكُمْ الْحَسَدُ وَالْبَغْضَاءُ وَالْبَغْضَاءُ هِيَ الْحَالِقَةُ حَالِقَةُ الدِّينِ لَا حَالِقَةُ الشَّعَرِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلَا أُنَبِّئُكُمْ بِشَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><b>There has come to you the disease of the nations before you: envy and hatred, and hatred is the razor; it shaves the religion and it does not shave hair. By the one in whose hand is my soul, you will not believe until you love one another. Shall I tell you something which, if you did, you would love each other? Spread peace between yourselves.<\/b><\/p>\n<p>Source: Musnad Ahmad 1415 Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-hatred-beware-the-disease-of-hatred-which-afflicted-the-previous-nations-and-destroyed-their-religion\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Hajar wrote in his commentary:<\/p>\n<blockquote>\n<p align=\"right\">وَلَا يَتِمُّ ذَلِكَ إِلَّا بِتَرْكِ الْحَسَدِ وَالْغِلِّ وَالْحِقْدِ وَالْغِشِّ<\/p>\n<p>Faith is not complete until a Muslim abandons envy, rancor, malice, and fraud.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\">Fath ul-Bari<\/a><\/p><\/blockquote>\n<p>Muslims have been taught to hate the evil deeds people commit, but not the people themselves.<\/p>\n<p>Allah says:<\/p>\n<blockquote>\n<p align=\"right\">وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ۚ أُولَٰئِكَ هُمُ الرَّاشِدُونَ<\/p>\n<p><b>He has made hateful to you unbelief, wickedness, and disobedience; those are the rightly-guided.<\/b><\/p>\n<p>Surah Al-Hujurat 49:7<\/p><\/blockquote>\n<p>That is, Allah has made a condition of faith the hatred of unbelief (<i>kufr<\/i>) but not hatred of the unbeliever (<i>kafir<\/i>). In other words, Muslims hate the sin but not the sinner.<\/p>\n<p>Ibn Rajab reported:<\/p>\n<blockquote>\n<p align=\"right\">قَالَ بَعْضُ الصَّالِحِينَ مِنَ السَّلَفِ أَهْلُ الْمَحَبَّةِ لِلَّهِ نَظَرُوا بِنُورِ اللَّهِ وَعَطَفُوا عَلَى أَهْلِ مَعَاصِي اللَّهِ مَقَتُوا أَعْمَالَهُمْ وَعَطَفُوا عَلَيْهِمْ لِيُزِيلُوهُمْ بِالْمَوَاعِظِ عَنْ فِعَالِهِمْ وَأَشْفَقُوا عَلَى أَبْدَانِهِمْ مِنَ النَّارِ وَلَا يَكُونُ الْمُؤْمِنُ مُؤْمِنًا حَقًّا حَتَّى يَرْضَى لِلنَّاسِ مَا يَرْضَاهُ لِنَفْسِهِ<\/p>\n<p>Some of the righteous predecessors said: The people who love Allah look by the light of Allah, and they are compassionate with those who disobey Allah. They hate their actions but show mercy to them so that through their admonitions they might leave their actions. They are afraid that the Hellfire will consume their bodies. The believer will not truly be a believer until he is pleased for people to have what he is pleased for himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">Jami’ Ulum wal-Hikam 13<\/a><\/p><\/blockquote>\n<p>Abu Qilaba reported: Abu Ad-Darda, may Allah be pleased with him, once came upon a man who was being beaten because of his sin, and they were abusing him. He said, “What do you think if he had fallen into a well, would you not try to rescue him?” They said, “Yes.” He said, “Then do not abuse your brother, and praise Allah who has protected you from sin.” They said, “Do you not hate him?” He said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّمَا أُبْغِضُ عَمَلَهُ فَإِذَا تَرَكَهُ فَهُوَ أَخِي<\/p>\n<p>Verily, I only hate his sinful deed, but when he leaves it then he is still my brother.<\/p>\n<p>Source: Hilyat Al-Awliya 793<\/p><\/blockquote>\n<p>In fact, the companions of the Prophet asked him how a person can hate for the sake of Allah, and the Prophet responded that true hatred for the sake of Allah is to hate for people what we hate for ourselves; that is, to hate for them to be harmed.<\/p>\n<p>Sahl ibn Mu’adh reported: His father heard from the Messenger of Allah, peace and blessings be upon him:<\/p>\n<blockquote>\n<p align=\"right\">أَفْضَلُ الْإِيمَانِ أَنْ تُحِبَّ لِلَّهِ وَتُبْغِضَ فِي اللَّهِ وَتُعْمِلَ لِسَانَكَ فِي ذِكْرِ اللَّهِ<\/p>\n<p><b>The most virtuous faith is to love for the sake of Allah, to hate for the sake of Allah, and to work your tongue in the remembrance of Allah.<\/b><\/p><\/blockquote>\n<p>Mu’adh said, “How is that, O Messenger of Allah?” He said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَنْ تُحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ وَتَكْرَهَ لَهُمْ مَا تَكْرَهُ لِنَفْسِكَ وَأَنْ تَقُولَ خَيْرًا أَوْ تَصْمُتَ<\/p>\n<p><b>That you love for the people what you love for yourself, and you hate for the people what you hate for yourself, and that you speak goodness or remain silent.<\/b><\/p>\n<p>Source: Musnad Ahmad 21627 Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/24\/hadith-on-faith-the-best-faith-is-to-love-good-for-others-to-hate-evil-others-and-righteous-speech\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Abu Muntafiq reported: He said, “O Messenger of Allah, teach me what will save me from Allah’s punishment and enter me into Paradise.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">اعْبُدِ اللَّهَ وَلا تُشْرِكْ بِهِ شَيْئًا وَأَقِمِ الصَّلاةَ الْمَكْتُوبَةَ وَأَدِّ الزَّكَاةَ الْمَفْرُوضَةَ وَحُجَّ وَاعْتَمِرْ وَأَظُنُّهُ قَالَ وَصُمْ رَمَضَانَ وَانْظُرْ مَا تُحِبُّ لِلنَّاسِ أَنْ يَأْتُوهُ إِلَيْكَ فَافْعَلْهُ بِهِمْ وَمَا تَكْرَهُ أَنْ يَأْتُوهُ إِلَيْكَ فَذَرْهُمْ مِنْهُ<\/p>\n<p><b>Worship Allah and do not associate anything with Him, establish the prescribed prayers, give the obligatory charity, fast the month of Ramadan, and however you love for the people to treat you, then treat them that way, and however you hate for the people to treat you, then do not treat them that way.<\/b><\/p>\n<p>Source: Al-Ma’jam Al-Kabeer At-Tabarani 15833 Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-manners-treat-people-the-way-you-would-love-to-be-treated-and-you-will-enter-paradise\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>For this reason, Ibn Hajar cites the scholar Al-Kirmani as saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنَ الْإِيمَانِ أَيْضًا أَنْ يُبْغِضَ لِأَخِيهِ مَا يُبْغِضُ لِنَفْسِهِ مِنَ الشَّرِّ<\/p>\n<p>It is part of faith to hate evil for his brother as he hates it for himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/24\/hadith-on-hate-hatred-for-the-sake-of-allah-means-to-hate-evil-for-people-not-to-harm-them\/\">Fath ul-Bari<\/a><\/p><\/blockquote>\n<p>In conclusion, a Muslim is taught to desire good and benefit for all people, even the animals. Likewise, a Muslim should never hate a person in the sense of desiring harm for them. Rather, Muslims only hate sinful deeds but not the people who commit them.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;None of you has faith until he loves for his brother what he loves for himself.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[61,18,32,52,311,100,93,103,64,98],"class_list":["post-13188","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-call-to-islam-dawah","tag-community-jamaah","tag-hereafter-akhirah","tag-love-al-mahabbah","tag-malice-hiqd","tag-manners-al-adab","tag-moderation-al-wasitiyyah","tag-public-welfare-al-maslaha","tag-reform-islah","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3qI","jetpack-related-posts":[{"id":16503,"url":"https:\/\/www.abuaminaelias.com\/love-the-sinner-hate-the-sin-in-islam\/","url_meta":{"origin":13188,"position":0},"title":"Love the sinner, hate the sin in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Love for people what you would love for yourself.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13813,"url":"https:\/\/www.abuaminaelias.com\/golden-rule-in-islam-love-humanity\/","url_meta":{"origin":13188,"position":1},"title":"Golden rule in Islam: Love for humanity what you love for yourself","author":"Abu Amina Elias","date":"June 17, 2013","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13532,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-naseehah\/","url_meta":{"origin":13188,"position":2},"title":"Imam al-Nawawi on Sincere Good Will","author":"Abu Amina Elias","date":"May 15, 2013","format":false,"excerpt":"\"I convey the message of my Lord to you and I sincerely advise you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15251,"url":"https:\/\/www.abuaminaelias.com\/brotherhood-quran-and-sunnah\/","url_meta":{"origin":13188,"position":3},"title":"Brotherhood in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 20, 2014","format":false,"excerpt":"\"The believers are but brothers,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13436,"url":"https:\/\/www.abuaminaelias.com\/islam-good-neighborliness-to-all\/","url_meta":{"origin":13188,"position":4},"title":"Islam is good neighborliness to everyone","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"...until he loves for his brother or his neighbor what he loves for himself.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22690,"url":"https:\/\/www.abuaminaelias.com\/showing-love-and-affection-to-unbelievers\/","url_meta":{"origin":13188,"position":5},"title":"Showing love and affection to unbelievers","author":"Abu Amina Elias","date":"November 11, 2020","format":false,"excerpt":"\"I do not ask you anything for it, except affection due to relatives.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13188","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13188"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13188\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}