{"id":13343,"date":"2016-07-04T10:50:02","date_gmt":"2016-07-04T06:50:02","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13343"},"modified":"2025-07-04T10:55:05","modified_gmt":"2025-07-04T06:55:05","slug":"what-are-the-islamic-evidences-for-the-existence-of-the-creator","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/what-are-the-islamic-evidences-for-the-existence-of-the-creator\/","title":{"rendered":"Evidence for the existence of the Creator in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Philosophers and theologians throughout history have devised a number of rational arguments for the existence of the Creator, such as the ontological argument. However, many of these arguments fall short because human reasoning is itself limited. Rather, the proper way to demonstrate the existence of the Creator is to refer to the arguments mentioned in the Quran: that the universe must necessarily have a Creator, that signs in nature point to the Creator’s design, and that human instinct accepts the existence of the Creator.<\/p>\n<p>The universe must necessarily have a Creator because it is impossible for the universe to have created itself or to have been created by nothing. Therefore, there must have been a Creator who provided the initial force and energy needed to set the universe in motion. This is sometimes called the cosmological argument.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ أَمْ خَلَقُوا السَّمَاوَاتِ وَالْأَرْضَ ۚ بَل لَّا يُوقِنُونَ<\/p>\n<p><b>Were they created by nothing, or were they the creators of themselves? Or did they create the heavens and the earth? Rather, they are not certain.<\/b><\/p>\n<p>Surah At-Tur 52:35-36<\/p><\/blockquote>\n<p>Newton’s first law of motion tells us that bodies at rest will stay at rest unless a force acts upon them. Therefore, the initiation of the universe required force and energy to originally set it in motion. This force and energy is the work of Allah the Exalted, the Creator. This argument was used by Imam Abu Hanifa to confound the atheists who challenged him.<\/p>\n<p>Ibn Abu Al-‘Izz reported: It is said that Abu Hanifa, may Allah have mercy on him, was approached by some speculative theologians who intended to discuss with him the oneness of Allah’s Lordship. He said, “Before we discuss this question, tell me what you think about a boat in the Euphrates which goes to shore, loads itself with food and other things, then returns, anchors and unloads all by itself, without anyone sailing or controlling it?” They said, “This is impossible.” Abu Hanifa said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا كَانَ هَذَا مُحَالًا فِي سَفِينَةٍ فَكَيْفَ فِي هَذَا الْعَالَمِ كُلِّهِ عُلْوِهِ وَسُفْلِهِ<\/p>\n<p>If it is impossible with a boat, then how is it possible for the world, in all its vastness, to move by itself?<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/04\/abu-hanifa-on-monotheism-the-story-of-abu-hanifas-rebuttal-against-the-atheists-doubts-about-allah\/\">Sharh Aqidah At-Tahawi 35<\/a><\/p><\/blockquote>\n<p>This argument agrees with sound reasoning and has been accepted by philosophers and theologians across different religions through history. The argument is so strong that Jubair bin Mut’im said that after he had recited these verses:<\/p>\n<blockquote>\n<p align=\"right\">كَادَ قَلْبِي أَنْ يَطِيرَ<\/p>\n<p>I felt my heart was about to fly.<\/p>\n<p>Source: Sahih Bukhari 4573, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/04\/hadith-on-creation-were-they-created-by-nothing-or-where-they-themselves-the-creator\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Allah’s saying, “<strong>Rather, they are not certain<\/strong>,” refers to the uncertainty inherent in atheist philosophy. In fact, the preeminent &#8220;new atheist&#8221; philosopher Richard Dawkins admitted in debate that he <a href=\"http:\/\/www.youtube.com\/watch?v=dfk7tW429E4\">cannot be certain Allah does not exist<\/a>. This is because atheism is not based upon any evidence, but rather ignorance of the truth as known through sound reasoning and human nature.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالُوا مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ ۚ وَمَا لَهُم بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَظُنُّونَ<\/p>\n<p><strong>They say: There is nothing but our worldly life, and we live and die and nothing destroys us but time. They have no knowledge, but rather they only speculate.<\/strong><\/p>\n<p>Surah Al-Jathiyah 45:24<\/p><\/blockquote>\n<p>Next, Allah calls our attention to observe the various signs (<i>ayat<\/i>) in nature that demonstrate His power and design. This is sometimes called the teleological argument.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ فِي اخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا خَلَقَ اللَّهُ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِّقَوْمٍ يَتَّقُونَ<\/p>\n<p><b>Verily, in the alternation of the night and the day and in what Allah has created in the heavens and the earth are signs for a people who would be righteous.<\/b><\/p>\n<p>Surah Yunus 10:6<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَمْ يَرَوْا أَنَّا جَعَلْنَا اللَّيْلَ لِيَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ<\/p>\n<p><strong>Do they not see that We made the night for resting therein and the day giving sight? Verily, in that are signs for a people who believe.<\/strong><\/p>\n<p>Surah An-Naml 27:86<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُّخْتَلِفًا أَلْوَانُهَا ۚ وَمِنَ الْجِبَالِ جُدَدٌ بِيضٌ وَحُمْرٌ مُّخْتَلِفٌ أَلْوَانُهَا وَغَرَابِيبُ سُودٌ وَمِنَ النَّاسِ وَالدَّوَابِّ وَالْأَنْعَامِ مُخْتَلِفٌ أَلْوَانُهُ كَذَٰلِكَ<\/p>\n<p><b>Do you not see that Allah sends down rain from the sky, and We produce thereby fruits of varying colors? And in the mountains are tracts, white and red of varying shades and black, and among people and moving creatures and grazing livestock are various colors similarly.<\/b><\/p>\n<p>Surah Fatir 35:27-28<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَلْيَنظُرِ الْإِنسَانُ إِلَىٰ طَعَامِهِ أَنَّا صَبَبْنَا الْمَاءَ صَبًّا ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا فَأَنبَتْنَا فِيهَا حَبًّا وَعِنَبًا وَقَضْبًا وَزَيْتُونًا وَنَخْلًا وَحَدَائِقَ غُلْبًا وَفَاكِهَةً وَأَبًّا مَّتَاعًا لَّكُمْ وَلِأَنْعَامِكُمْ<\/p>\n<p><b>Then let mankind look at his food, how We poured down water in torrents, then We broke open the earth, splitting it with sprouts, and caused to grow within it grain, and grapes and herbage, and olive and palm trees, and gardens of dense shrubbery, and fruit and grass as enjoyment for you and your grazing livestock.<\/b><\/p>\n<p>Surah Abasa 80:24-32<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَقَدْ خَلَقْنَا الْإِنسَانَ مِن سُلَالَةٍ مِّن طِينٍ ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَّكِينٍ ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنشَأْنَاهُ خَلْقًا آخَرَ ۚ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ<\/p>\n<p><b>Certainly did We create man from an extract of clay. Then We placed him as a sperm-drop in a firm lodging. Then We made the sperm-drop into a clinging clot, and We made the clot into a lump of flesh, and We made bones from the lump, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah, the best of creators.<\/b><\/p>\n<p>Surah Al-Muminun 23:12-14<\/p><\/blockquote>\n<p>Thus, from the sun and the moon in the heavens, to the creatures on the earth, to the innermost parts of the human being – all of these point to the power and deliberate design of the Creator. It is human instinct (<i>fitrah<\/i>) to recognize these signs as evidence of the Creator’s purpose.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ<\/p>\n<p><b>Verily, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding, who remember Allah while standing or sitting or lying on their sides and give thought to the creation of the heavens and the earth, saying: Our Lord, You did not create this aimlessly; exalted are You above such a thing, then protect us from the punishment of the Fire.<\/b><\/p>\n<p>Surah Ali Imran 3:190-191<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ<\/p>\n<p><b>We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. But is it not sufficient concerning your Lord that He is, over all things, a witness?<\/b><\/p>\n<p>Surah Fussilat 41:53<\/p><\/blockquote>\n<p>A classical formulation of this argument is mentioned by Ibn Kathir. Once a desert Arab was asked about the evidence of Allah’s existence, so he responded:<\/p>\n<blockquote>\n<p align=\"right\">يَا سُبْحَانَ اللَّهِ إِنَّ الْبَعْرَةَ لَتَدُلُّ عَلَى الْبَعِيرِ وَإِنَّ أَثَرَ الْأَقْدَامِ لَتَدُلُّ عَلَى الْمَسِيرِ فَسَمَاءٌ ذَاتُ أَبْرَاجٍ وَأَرْضٌ ذَاتُ فِجَاجٍ وَبِحَارٌ ذَاتُ أَمْوَاجٍ أَلَا يَدُلُّ ذَلِكَ عَلَى وُجُودِ اللَّطِيفِ الْخَبِيرِ<\/p>\n<p>Glory be to Allah! The camel’s dung testifies to the existence of the camel, and the track testifies to the fact that someone was walking. A sky that holds the stars, a land that has fairways and a sea that has waves? Does not all of this testify to the existence of the Most Kind, Most Knowledgeable?<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-kathir-evidence-for-the-existence-of-allah-the-almighty-creator\/\">Tafseer Ibn Kathir, verse 2:21<\/a><\/p><\/blockquote>\n<p>Ibn Kathir further comments:<\/p>\n<blockquote>\n<p align=\"right\">وَكَذَلِكَ هَذِهِ الْأَنْهَارُ السَّارِحَةُ مِنْ قُطْرٍ إِلَى قُطْرٍ لِمَنَافِعِ الْعِبَادِ وَمَا ذَرَأَ فِي الْأَرْضِ مِنَ الْحَيَوَانَاتِ الْمُتَنَوِّعَةِ وَالنَّبَاتِ الْمُخْتَلِفِ الطُّعُومِ وَالْأَرَايِيحِ وَالْأَشْكَالِ وَالْأَلْوَانِ مَعَ اتِّحَادِ طَبِيعَةِ التُّرْبَةِ وَالْمَاءِ عَلِمَ وُجُودَ الصَّانِعِ وَقُدْرَتَهُ الْعَظِيمَةَ وَحِكْمَتَهُ وَرَحْمَتَهُ بِخَلْقِهِ وَلُطْفَهُ بِهِمْ وَإِحْسَانَهُ إِلَيْهِمْ وَبِرَّهُ بِهِمْ لَا إِلَهَ غَيْرُهُ وَلَا رَبَّ سِوَاهُ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ وَالْآيَاتُ فِي الْقُرْآنِ الدَّالَّةُ عَلَى هَذَا الْمَقَامِ كَثِيرَةٌ جِدًّا<\/p>\n<p>Whoever thinks about the running rivers that travel from area to area bringing benefit, whoever ponders over what Allah has created on earth; various animals and plants of different tastes, scents, shapes and colors that are a result of unity between land and water. Whoever thinks about all of this then he will realize that these facts testify to the existence of the Creator, His perfect ability, wisdom, mercy, kindness, generosity and His overall compassion for His creation. There is no deity worthy of worship except Allah, nor is there a Lord besides Him, upon Him we rely and to Him we turn in repentance. There are numerous verses in the Quran on this subject.<\/p><\/blockquote>\n<p>Moreover, the vast majority of human beings throughout history and across religious traditions have affirmed the existence of the Almighty Creator. It is simply part of our nature to recognize these signs because Allah has created us this way.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ<\/p>\n<p><b>So direct your face toward the religion, inclining to truth. Adhere to the nature of Allah upon which He has created all people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.<\/b><\/p>\n<p>Surah Ar-Rum 30:30<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ<\/p>\n<p><b>No one is born except they are upon natural instinct.<\/b><\/p>\n<p>Source: Sahih Muslim 2658, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/03\/hadith-on-fitrah-every-child-is-born-upon-al-fitrah-monotheistic-instinct\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ<\/p>\n<p><b>If you asked them: Who created the heavens and earth? They would surely say: Allah. Say: All praise is due to Allah, but most of them do not know.<\/b><\/p>\n<p>Surah Luqman 31:25<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ<\/p>\n<p><b>If you asked them who created them, they would surely say: Allah. So how are they deluded?<\/b><\/p>\n<p>Surah Az-Zukhruf 43:87<\/p><\/blockquote>\n<p>For this reason, every human being will call out to Allah during times of calamity, as it is an innate instinct to turn to the Creator in times of distress. Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قُلْ مَن يُنَجِّيكُم مِّن ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ تَدْعُونَهُ تَضَرُّعًا وَخُفْيَةً لَّئِنْ أَنجَانَا مِنْ هَٰذِهِ لَنَكُونَنَّ مِنَ الشَّاكِرِينَ قُلِ اللَّهُ يُنَجِّيكُم مِّنْهَا وَمِن كُلِّ كَرْبٍ ثُمَّ أَنتُمْ تُشْرِكُونَ<\/p>\n<p><b>Say: Who rescues you from the darkness of the land and sea when you call upon Him imploring aloud and privately: If He should save us from this crisis, we will surely be among the thankful. Say: It is Allah who saves you from it and from every distress, yet you still associate others with Him.<\/b><\/p>\n<p>Surah Al-An’am 6:63-64<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَن تَدْعُونَ إِلَّا إِيَّاهُ ۖ فَلَمَّا نَجَّاكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ ۚ وَكَانَ الْإِنسَانُ كَفُورًا<\/p>\n<p><b>When adversity touches you at sea, lost are all those you invoke except for Him. But when He delivers you to the land, you turn away from Him. Ever is man ungrateful.<\/b><\/p>\n<p>Surah Al-Isra 17:67<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ<\/p>\n<p><b>When they board a ship, they supplicate Allah, being sincere to Him in religion. But when He delivers them to the land, at once they associate others with Him.<\/b><\/p>\n<p>Surah Al-Ankabut 29:65<\/p><\/blockquote>\n<p>Human nature also recognizes objective moral values shared across religions and cultures throughout time, known to philosophers as &#8220;natural law.&#8221; This is sometimes called the moral argument.<\/p>\n<p>Wabisa ibn Ma’bad Al-Asadi reported: The Messenger of Allah, peace and blessings be upon him, said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِئْتَ تَسْأَلُ عَنْ الْبِرِّ وَالْإِثْمِ<\/p>\n<p style=\"text-align: left;\"><strong>Have you come to ask about righteousness and sin?<\/strong><\/p>\n<\/blockquote>\n<p>I said, “Yes.” So the Prophet brought his fingers together and struck his chest three times, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ يَا وَابِصَةُ ثَلَاثًا الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ<\/p>\n<p><strong>Consult your soul, consult your heart, O Wabisa. Righteousness is what is satisfying to your soul and your heart, and sin is what wavers in your soul and causes hesitancy in your chest, even if the people give you a judgment, and again give you a judgment<\/strong>.<\/p>\n<p>Source: Sunan Ad-Darimi 2533, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/25\/hadith-on-righteousness-consult-your-heart-about-righteousness-and-sin-even-if-the-people-give-you-a-judgment\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>It might asked why some people disbelieve in the Creator if sound human nature inclines toward faith. The answer is that Allah has created life as a test involving various influences such as the temptations of Satan and selfish desires. Although human nature inclines toward faith, a person must ultimately choose to pursue faith in the Creator over the influences of unbelief.<\/p>\n<p>Iyad ibn Himar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِنِّي خَلَقْتُ عِبَادِي حُنَفَاءَ كُلَّهُمْ وَإِنَّهُمْ أَتَتْهُمْ الشَّيَاطِينُ فَاجْتَالَتْهُمْ عَنْ دِينِهِمْ وَحَرَّمَتْ عَلَيْهِمْ مَا أَحْلَلْتُ لَهُمْ وَأَمَرَتْهُمْ أَنْ لَا يُشْرِكُوا بِي مَا لَمْ أُنْزِلْ بِهِ سُلْطَانًا<\/p>\n<p><b>Allah said: I have created all of My servants naturally inclined to worship one God but it is the devils who turn them away from their religion. They make unlawful for them what has been made lawful for them, and they command them to associate partners with Me, although no authority has been revealed for them.<\/b><\/p>\n<p>Source: Sahih Muslim 2865, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/31\/hadith-on-monotheism-human-beings-were-made-to-worship-allah-but-satan-leads-people-astray\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In conclusion, when demonstrating the existence of the Creator, Muslims do not need to refer to the arguments of various philosophers, some of which are strong but many of which are flawed. Rather, we should refer to the arguments for the existence of the Creator as found in the Quran and Sunnah.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do they not see that We made the night for resting therein and the day giving sight?&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[317,61,334,20,21,55,56,115,301,45,68,220,98],"class_list":["post-13343","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-animals","tag-call-to-islam-dawah","tag-certainty-al-yaqin","tag-creation-al-khalq","tag-creed-aqidah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-people-of-the-book","tag-pure-nature-fitrah","tag-quran-exegesis-tafsir","tag-satan-al-shaytan","tag-supplication-al-dua","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3td","jetpack-related-posts":[{"id":21379,"url":"https:\/\/www.abuaminaelias.com\/who-created-allah-the-creator\/","url_meta":{"origin":13343,"position":0},"title":"If Allah created everything, who created Allah?","author":"Abu Amina Elias","date":"October 24, 2019","format":false,"excerpt":"\"It is known by necessity and human nature that the question is invalid.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21405,"url":"https:\/\/www.abuaminaelias.com\/was-the-universe-created-by-chance\/","url_meta":{"origin":13343,"position":1},"title":"Was the universe created by chance?","author":"Abu Amina Elias","date":"October 30, 2019","format":false,"excerpt":"\"We will show them Our signs in the horizons and within themselves...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15719,"url":"https:\/\/www.abuaminaelias.com\/the-oneness-of-lordship-tawheed-ar-rububiyyah\/","url_meta":{"origin":13343,"position":2},"title":"Oneness of Lordship (tawheed ar-rububiyyah)","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, your Lord is Allah...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":13343,"position":3},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23609,"url":"https:\/\/www.abuaminaelias.com\/dealing-doubts-islam\/","url_meta":{"origin":13343,"position":4},"title":"Dealing with faith-related doubts in Islam","author":"Abu Amina Elias","date":"October 7, 2021","format":false,"excerpt":"\"We are more likely to doubt than Abraham, when he said: O Lord, show me how You give life to the dead.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20861,"url":"https:\/\/www.abuaminaelias.com\/does-allah-exist-in-a-place\/","url_meta":{"origin":13343,"position":5},"title":"Does Allah exist in a place? A man in the sky?","author":"Abu Amina Elias","date":"August 29, 2019","format":false,"excerpt":"\"There is nothing like Him, for He is the Hearing, the Seeing.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13343","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13343"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13343\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13343"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13343"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13343"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}