{"id":13389,"date":"2016-07-04T10:48:32","date_gmt":"2016-07-04T06:48:32","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13389"},"modified":"2025-07-04T11:03:27","modified_gmt":"2025-07-04T07:03:27","slug":"islam-mercy-to-the-worlds","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/islam-mercy-to-the-worlds\/","title":{"rendered":"Islam is mercy for all creation, even enemies"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>Islam teaches us to be merciful to the entire creation, to Muslims and non-Muslims, to friends and enemies and even to the animals. Mercy (<em>raḥmah<\/em>) in Islam has a very wide meaning that includes kindness, compassion, love, tolerance, patience with people, and to treat others the way we would love to be treated. This Islamic value is at the core of the prophetic message and meaning of faith, just as it was in all of the revealed religions before Islam. Every Muslim needs to strive to be an agent of mercy on earth for all human beings and creatures.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ<\/p>\n<p><b>We have not sent you except as mercy to the worlds.<\/b><\/p>\n<p>Surat al-Anbiya 21:107<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ<\/p>\n<p><b>Then he was among those who had faith and advised one another to patience and advised one another to mercy.<\/b><\/p>\n<p>Surat al-Balad 90:17<\/p><\/blockquote>\n<p>Abu Salih reported: The Messenger of Allah, peace and blessings be upon him, would address the people saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّمَا أَنَا رَحْمَةٌ مُهْدَاةٌ<\/p>\n<p><strong>O people, I am only a mercy and a guide.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 490, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/12\/hadith-on-muhammad-o-people-i-was-sent-only-as-a-mercy-and-a-guide\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Allah intends for the mercy of Islam to touch every person on earth. It is not as some have claimed, that Islam is only merciful to Muslims. Rather, Islam teaches us to be mercy to the entire world and everyone in it.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الرَّاحِمُونَ يَرْحَمُهُمْ الرَّحْمَنُ ارْحَمُوا مَنْ فِي الْأَرْضِ يَرْحَمْكُمْ مَنْ فِي السَّمَاءِ<\/p>\n<p><b>Those who are merciful will be shown mercy by the Merciful. Be merciful to those on the earth and the One above the heavens will have mercy upon you.<\/b><\/p>\n<p>Source: Sunan al-Tirmidhī 1924, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/11\/16\/show-mercy-to-those-on-the-earth\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Musa Al-Ashari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَنْ تُؤْمِنُوا حَتَّى تَحَابُوا أَفَلا أَدُلُّكُمْ عَلَى مَا تَحَابُونَ عَلَيْهِ<\/p>\n<p><b>You will never have faith until you love each other. Shall I tell you what will make you love each other<\/b>?<\/p><\/blockquote>\n<p>They said, “Of course, O Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْشُوا السَّلامَ بَيْنِكُمْ فَوَالَّذِي نَفْسِي بِيَدِهِ لا تَدْخُلُونَ الْجَنَّةَ حَتَّى تَرَاحَمُوا<\/p>\n<p><b>Spread peace between yourselves. By the one in whose hand is my soul, you will not enter Paradise until you are merciful to others<\/b>.<\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, all of us are merciful.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهُ لَيْسَ بِرَحْمَةِ أَحَدِكُمْ خَاصَّتَهُ وَلَكِنْ رَحْمَةُ الْعَامَّةِ<\/p>\n<p><b>Verily, it is not only mercy between yourselves, but rather it is mercy in general.<\/b><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Nasāʼī 5760, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/29\/hadith-on-mercy-none-has-true-faith-until-he-is-merciful-to-the-entire-creation\/\">Sahih <\/a><\/i><\/b><\/p><\/blockquote>\n<p>Not only should we be merciful to human beings, but we also need to be merciful to the animals. All of Allah&#8217;s creatures have <a href=\"https:\/\/abuaminaelias.com\/the-rights-on-animals-in-islam\/\">rights in Islam<\/a>, humans and animals, so it is the duty of Muslims to uphold, and protect their natural rights.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ ثُمَّ خَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنْ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنْ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ مِنِّي فَنَزَلَ الْبِئْرَ فَمَلَأَ خُفَّهُ مَاءً ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ<\/p>\n<p><b>Once a man suffered from thirst while he was walking on a journey. When he found a well, he climbed down into it and drank from it. Then he came out and saw a dog lolling its tongue from thirst and licking the ground. The man said: this dog has suffered thirst just as I have suffered from it. So he climbed down into the well, filled his shoe with water, and caught it in his mouth as he climbed up; then he gave the dog a drink. Allah appreciated this deed and so He forgave him.<\/b><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, is there a reward for charity even for the animals?” He said:<\/p>\n<blockquote>\n<p align=\"right\">فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ<\/p>\n<p><b>In every living being there is a reward for charity.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5663, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/30\/hadith-on-animals-a-man-was-forgiven-because-he-was-merciful-to-a-thirsty-dog\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Qurra ibn Iyas reported: A man said, “O Messenger of Allah, I would have slaughtered a sheep but I had mercy on it.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالشَّاةُ إِنْ رَحِمْتَهَا رَحِمَكَ اللَّهُ مَرَّتَيْنِ‏<\/p>\n<p><strong>If you had mercy on the sheep, then Allah will have mercy on you twice.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 368, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/02\/27\/hadith-on-mercy-if-you-have-mercy-on-the-sheep-allah-will-have-mercy-on-you\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The only way we can secure mercy for our own selves on the Day of Judgment is to be merciful to the creation. Allah is not merciful in the Hereafter to those who are not merciful to people and to his creatures.<\/p>\n<p>Abu Huraira reported: A man saw the Prophet kissing his grandson Hasan and he said, “I have ten children and I do not kiss any of them.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ مَنْ لَا يَرْحَمْ لَا يُرْحَمْ<\/p>\n<p><strong>Verily, whoever does not show mercy will not receive mercy.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5651, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/09\/11\/compassion-for-children\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jareer ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَرْحَمُ اللَّهُ مَنْ لَا يَرْحَمُ النَّاسَ<\/p>\n<p><b>Allah will not be merciful to those who are not merciful to the people.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6941, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/01\/18\/allah-is-not-merciful-with-those-who-do-not-show-mercy-to-people\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Usama ibn Zaid reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ<\/p>\n<p><strong>Verily, Allah is only merciful to those of his servants who are merciful.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1224, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/hadith-on-mercy-this-is-mercy-which-allah-has-rooted-in-the-hearts-of-his-servants\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Hisham, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلَغَنِي أَنَّهُ مَكْتُوبٌ فِي التَّوْرَاةِ كَمَا تَرْحَمُونَ تُرْحَمُونَ<\/p>\n<p>It has reached me that it is written in the Torah: As you show mercy you will receive mercy.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/09\/11\/compassion-for-children\/\">Muṣannaf Ibn Abī Shaybah 24780<\/a><\/p><\/blockquote>\n<p>Hence, by being merciful to others we not only benefit them in this world, we also benefit ourselves in the Hereafter.<\/p>\n<p>The Prophet applied the teachings of divine mercy throughout his entire life, even to his enemies and oppressors. On one occasion, the companions asked the Prophet to pray against his enemies who had been persecuting them for years, even raising an army against them and killing their innocents. Even so, the Prophet refused to pray against his enemies as it would have contradicted the message of mercy.<\/p>\n<p>Abu Huraira reported: The Prophet was told, “O Messenger of Allah, pray against the idolaters!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً<\/p>\n<p><strong>Verily, I was not sent to invoke curses, but rather I was only sent as a mercy<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2599, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/07\/the-prophet-is-mercy-to-humanity-not-an-invoker-of-curses\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Perhaps the most famous example of the Prophet&#8217;s mercy was the forgiveness he showed his enemies after he finally had power over them. The Quraish tribal aristocracy had persecuted the Muslims for nearly twenty-three years only because they chose to worship Allah instead of the idols. They mocked the Muslims, threatened them, tortured them, punished them with an economic boycott, and even raise arms against them after they fled to Medina. They killed Hamza the Prophet&#8217;s uncle, mutilated his corpse, and unjustifiably killed many other Muslims.<\/p>\n<p>Despite all of this, the Prophet was able to win the hearts and minds of the Arabs and he finally gained power over the Quraish when the city of Mecca surrendered. Rather than taking revenge, the Prophet forgave his enemies and declared it to be a day of mercy.<\/p>\n<p>Al-Qasim ibn Salim reported: When they came to the Ka’bah they were holding onto its door and the Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَقُولُونَ وَمَا تَظُنُّونَ<\/p>\n<p style=\"text-align: left;\"><strong>What do you say? What do you think?<\/strong><\/p>\n<\/blockquote>\n<p>They said three times, “We say you are the son of our brother.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقُولُ كَمَا قَالَ يُوسُفُ لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ<\/p>\n<p style=\"text-align: left;\"><strong>I say to you as Joseph said to his brothers: No blame upon you today. Allah will forgive you, for he is the Most Merciful of the merciful<\/strong>. (12:92)<\/p>\n<p>Source: Sunan al-Kubrā 17714, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/12\/hadith-on-compassion-the-prophet-forgives-his-enemies-during-the-liberation-of-mecca\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Asakir reported: When Sa’d passed by Abu Sufyan with the banner of the Prophet on the day Mecca was liberated, he announced, “O Abu Sufyan! Today is a day of slaughter! Today the unlawful will be lawful! Today Allah will disgrace the Quraish!” So the Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَبَا سُفْيَانَ الْيَوْمَ يَوْمُ الْمَرْحَمَةِ الْيَوْمَ أَعَزَّ اللَّهُ فِيهِ قُرَيْشًا<\/p>\n<p><strong>O Abu Sufyan, today is a day of mercy. Today Allah will honor the Quraish<\/strong>.<\/p>\n<p>Source: Tārīkh Dimashq 23282, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/22\/hadith-on-mercy-the-liberation-of-mecca-is-a-day-of-mercy-in-which-allah-honored-the-quraish\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Mawardi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَجَعْلَهُ يَوْمَ مَرْحَمَةٍ وَأَنْكَرَ أَنْ يَكُونَ يَوْمَ مَلْحَمَةٍ فَدَلَّ عَلَى الصُّلْحِ دُونَ الْعَنْوَةِ<\/p>\n<p>The Prophet made it a day of mercy and he rejected that it would be a day of slaughter. Thus, it shows that it was reconciliation without violence.<\/p>\n<p>Source: al-Ḥāwī al-Kabīr 14\/28<\/p><\/blockquote>\n<p>Indeed, the Prophet was so forgiving and merciful because Allah had revealed to him, as well as to the Prophets before him, that among the best and most honored people to Allah are those who forgive others and treat others the way they would love to be treated.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَأَلَ مُوسَى رَبَّهُ وقَالَ فَأَيُّ عِبَادِكَ أَحْكُمُ قَالَ الَّذِي يَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ قَالَ فَأَيُّ عِبَادِكَ أَعَزُّ قَالَ الَّذِي إِِذَا قَدَرَ غَفَرَ<\/p>\n<p><strong>Moses said: Who is the best in judgment of your servants? Allah said: Those who judge people as they would love to be judged themselves. Moses said: Who are the most honored of your servants? Allah said: Those who forgive when they have power over others.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 6352, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/07\/hadith-on-forgiveness-the-most-honorable-act-of-worship-is-forgiveness\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>In sum, mercy is an essential defining attribute of the righteous Muslims and it distinguishes them from other religious groups. Those who fail to be merciful to others are among the misguided who have forsaken the teachings of the true religion and its divine values.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p align=\"right\">وَأَهْلُ السُّنَّةِ وَالْجَمَاعَةِ يَتَّبِعُونَ الْكِتَابَ وَالسُّنَّةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ فَيَتَّبِعُونَ الْحَقَّ وَيَرْحَمُونَ الْخَلْقَ<\/p>\n<p>The people of the Sunnah and the Muslim community follow the Book and the Sunnah and they obey Allah and his Messenger and follow the truth. They have mercy upon the creation.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/02\/ibn-taymiyyah-it-is-forbidden-to-declare-a-muslim-to-be-a-disbeliever-on-account-of-his-sins\/\">Majmū&#8217; al-Fatāwá 1\/278<\/a><\/p><\/blockquote>\n<p>Thus, we must do our best to be merciful to the entire creation, to the Muslims and non-Muslims, to our families and relatives, to friends and strangers, to people and animals, and even to our most bitter enemies.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Those who are merciful will be shown mercy by the Merciful.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[317,16,18,20,49,32,100,207,54,103,98],"class_list":["post-13389","post","type-post","status-publish","format-standard","hentry","category-featured","tag-animals","tag-character-akhlaq","tag-community-jamaah","tag-creation-al-khalq","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-manners-al-adab","tag-mecca-makkah","tag-mercy-al-rahmah","tag-public-welfare-al-maslaha","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3tX","jetpack-related-posts":[{"id":12981,"url":"https:\/\/www.abuaminaelias.com\/are-muslims-only-kind-to-believers\/","url_meta":{"origin":13389,"position":0},"title":"Are Muslims only kind to believers?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah does not forbid you from being kind and just...\" (60:8)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16482,"url":"https:\/\/www.abuaminaelias.com\/transcendency-of-allah-in-islam\/","url_meta":{"origin":13389,"position":1},"title":"Transcendency of Allah in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Most Merciful is established upon the Throne.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18417,"url":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","url_meta":{"origin":13389,"position":2},"title":"Praying for enemies in Islam","author":"Abu Amina Elias","date":"November 2, 2016","format":false,"excerpt":"\"I was not sent to invoke curses, but rather I was only sent as mercy.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14152,"url":"https:\/\/www.abuaminaelias.com\/justice-and-fairness-for-all-in-islam\/","url_meta":{"origin":13389,"position":3},"title":"Justice and fairness for all in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, Allah orders justice and good conduct and giving to relatives,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16945,"url":"https:\/\/www.abuaminaelias.com\/understanding-loyalty-and-disavowal-in-islam\/","url_meta":{"origin":13389,"position":4},"title":"Understanding loyalty and disavowal in Islam","author":"Abu Amina Elias","date":"August 31, 2015","format":false,"excerpt":"\"The believing men and believing women are allies of one another.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19795,"url":"https:\/\/www.abuaminaelias.com\/people-created-in-image-of-allah\/","url_meta":{"origin":13389,"position":5},"title":"People are created in the image of Allah","author":"Abu Amina Elias","date":"June 20, 2018","format":false,"excerpt":"\"Verily, Allah created Adam in His image.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13389","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13389"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13389\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13389"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13389"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13389"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}