{"id":13382,"date":"2016-07-04T10:50:03","date_gmt":"2016-07-04T06:50:03","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13382"},"modified":"2025-07-04T10:54:54","modified_gmt":"2025-07-04T06:54:54","slug":"muslims-allowed-to-lie-taqiyya","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/muslims-allowed-to-lie-taqiyya\/","title":{"rendered":"Taqiya: Are Muslims allowed to lie for Islam?"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>According to Lane’s Lexicon, <i>Taqiyya<\/i> comes from the root word meaning “to be cautious, to guard.” When a Muslim’s life is being threatened, it is permissible to deny Allah and His Messenger if that will save his life or protect him from harm. Such permission was necessary at the time when Muslims were being persecuted, tortured, and killed simply for being a Muslim. Muslims are never allowed to lie for political or religious reasons, but rather only for security reasons.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">مَن كَفَرَ بِاللَّهِ مِن بَعْدِ إِيمَانِهِ إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمَانِ وَلَٰكِن مَّن شَرَحَ بِالْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِّنَ اللَّهِ وَلَهُمْ عَذَابٌ عَظِيمٌ<\/p>\n<p><b>Whoever disbelieves in Allah after his belief, except for one who is forced to renounce his religion while his heart is secure in faith, but those who willingly open their hearts to unbelief, upon them is wrath from Allah and for them is a great punishment.<\/b><\/p>\n<p>Surah An-Nahl 16:106<\/p><\/blockquote>\n<p>Ibn Kathir comments on this verse, saying:<\/p>\n<blockquote>\n<p align=\"right\">فَهُوَ اسْتِثْنَاءٌ مِمَّنْ كَفَرَ بِلِسَانِهِ وَوَافَقَ الْمُشْرِكِينَ بِلَفْظِهِ مُكْرَهًا لِمَا نَالَهُ مِنْ ضَرْبٍ وَأَذًى وَقَلْبُهُ يَأْبَى مَا يَقُولُ وَهُوَ مُطَمْئِنٌ بِالْإِيمَانِ بِاللَّهِ وَرَسُولِهِ<\/p>\n<p>This is an exception in the case of one who utters statements of unbelief and verbally agrees with the idolaters because he is forced to do so by their beatings and abuse to which he is subjected, but his heart refuses to accept what he is saying, while he is in reality at peace with his faith in Allah and His Messenger.<\/p>\n<p>Source: Tafseer Ibn Kathir 16:106<\/p><\/blockquote>\n<p>It is only in these specific circumstances, in which a Muslim faces harm and persecution, that he or she is allowed to lie in self-defense. The general rule is that a Muslim should always speak the truth and be just, even when truth and justice are not in favor of the Muslims.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَن تَعْدِلُوا ۚ وَإِن تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا<\/p>\n<p><b>O you who believe, be persistently standing firm in justice as witnesses for Allah, even if it be against yourselves or your parents and relatives. Whether one is rich or poor, Allah is more worthy of both. Follow not your desires, lest you not be just, and if you distort your testimony or refuse to give it, then Allah is aware of what you do.<\/b><\/p>\n<p>Surat An-Nisa 4:135<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ<\/p>\n<p><b>O you who believe, fear Allah and be with those who are truthful.<\/b><\/p>\n<p>Surat At-Tawba 9:119<\/p><\/blockquote>\n<p>The Prophet told us that truthfulness leads to Paradise and falsehood leads to Hellfire. If a Muslim continues to lie and cheat, then Allah will record him as a liar and punish him on the Day of Judgment.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ وَإِنَّ الرَّجُلَ لَيَصْدُقُ حَتَّى يُكْتَبَ صِدِّيقًا وَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَإِنَّ الرَّجُلَ لَيَكْذِبُ حَتَّى يُكْتَبَ كَذَّابًا<\/p>\n<p><b>Verily, truthfulness leads to righteousness and righteousness leads to Paradise. A man may speak the truth until he is recorded with Allah as truthful. Verily, lying leads to wickedness and wickedness leads to the Hellfire. A man may tell lies until he is recorded with Allah as a liar.<\/b><\/p>\n<p>Source: Sahih Muslim 2607, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/05\/honesty-leads-to-paradise-dishonesty-leads-to-hell\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In fact, lying and false testimony were among the most hated behaviors to the Prophet. If he heard someone telling a lie, he would not be satisfied until he knew that person had repented.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p align=\"right\">مَا كَانَ خُلُقٌ أَبْغَضَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْكَذِبِ وَلَقَدْ كَانَ الرَّجُلُ يُحَدِّثُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْكِذْبَةِ فَمَا يَزَالُ فِي نَفْسِهِ حَتَّى يَعْلَمَ أَنَّهُ قَدْ أَحْدَثَ مِنْهَا تَوْبَةً<\/p>\n<p>There was no behavior more hateful to the Messenger of Allah than dishonesty. A man would lie when narrating something in the presence of the Prophet and he would not be satisfied until he knew that he had repented.<\/p>\n<p>Source: Sunan At-Tirmidhi 1973, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/24\/hadith-on-truthfulness-the-most-hated-behavior-to-the-messenger-of-allah-was-false-speech\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>As for the Prophet’s statement, “<b>War is deceit<\/b>,” he said this in the context of a battle in which he intended to misdirect enemy troops.<\/p>\n<p>Abdur Rahman ibn Ka’b reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ إِذَا أَرَادَ غَزْوَةً وَرَّى غَيْرَهَا وَكَانَ يَقُولُ الْحَرْبُ خَدْعَةٌ<\/p>\n<p>When the Prophet intended to go on an expedition, he would pretend to go somewhere else and he would say, “<b>War is deception<\/b>.”<\/p>\n<p>Source: Sunan Abu Dawud 2637, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/02\/hadith-on-war-permission-to-tactically-deceive-the-enemy-during-war-time-operations\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>This is not lying for political reasons, but rather for security reasons. It is employing the same classical military tactics used by armies for centuries.<\/p>\n<p>Dr. Joseph Caddell, professor of military history at North Carolina State University, acknowledges that warfare has always involved tactics of deception. Dr. Caddell writes:<\/p>\n<blockquote><p>Deception in warfare is probably as old as armed conflict itself. The logic of confusing an adversary is obvious, and the rewards can be realized very quickly.<\/p>\n<p>Source: <a href=\"http:\/\/fas.org\/irp\/eprint\/deception.pdf\">Caddell, Joseph, &#8220;Deception 101: Primer on Deception.&#8221;<\/a><\/p><\/blockquote>\n<p>However, this deception is only allowed in Islam during a declared state of war. It is a major sin for a Muslim to act treacherously or deceptively regarding covenants, peace treaties, promises, and agreements.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا جَمَعَ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ يَوْمَ الْقِيَامَةِ يُرْفَعُ لِكُلِّ غَادِرٍ لِوَاءٌ فَقِيلَ هَذِهِ غَدْرَةُ فُلاَنِ بْنِ فُلاَنٍ<\/p>\n<p><b>When Allah gathers together the earlier and later generations on the Day of Resurrection, He will raise a banner for every treacherous person and it will be announced that this is the treachery of so-and-so the son of so-and-so.<\/b><\/p>\n<p>Source: Sahih Muslim 1735, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/22\/hadith-on-treachery-whoever-treacherously-breaks-his-promises-will-be-exposed-on-the-day-of-judgment\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>This applies to non-Muslims, as the Prophet informed us that he would testify on the Day of Judgment on behalf of any peaceful non-Muslim against the Muslim who oppressed them.<\/p>\n<p>Sufwan ibn Saleem reported: A number of the companions said the Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَا مَنْ ظَلَمَ مُعَاهِدًا أَوْ انْتَقَصَهُ أَوْ كَلَّفَهُ فَوْقَ طَاقَتِهِ أَوْ أَخَذَ مِنْهُ شَيْئًا بِغَيْرِ طِيبِ نَفْسٍ فَأَنَا حَجِيجُهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><b>If anyone wrongs a person protected by a covenant, violates his rights, burdens him with more work than he is able to do, or takes something from him without his consent, then I will plead for him on the Day of Resurrection.<\/b><\/p>\n<p>Source: Sunan Abu Dawud 3052, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/16\/hadith-on-oppression-the-prophet-will-support-the-oppressed-non-muslims-on-the-day-of-judgment\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>This even applies when treachery would result in a military advantage for the Muslims. The companions of the Prophet strictly avoided treachery and dishonesty even at the expense of military or political gains.<\/p>\n<p>Sulaym ibn Amir reported: There was a peace treaty between Muawiyah and the Byzantines. He was marching towards their country and when the covenant came to an end, he would attack them. A man came on a horse, saying, “Allah is Most Great! Allah is Most Great! Let there be faithfulness and not treachery!” When they looked they found that he was Amr ibn Abasah. Muawiyah sent for him and questioned him about that. He said: I heard the Messenger of Allah, peace and blessings be upon him, say:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ كَانَ بَيْنَهُ وَبَيْنَ قَوْمٍ عَهْدٌ فَلَا يَحُلَّنَّ عَهْدًا وَلَا يَشُدَّنَّهُ حَتَّى يَمْضِيَ أَمَدُهُ أَوْ يَنْبِذَ إِلَيْهِمْ عَلَى سَوَاءٍ<\/p>\n<p><b>When one has a covenant with people he must not strengthen or loosen it until its term comes to an end or he brings it to an end in agreement with them.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1580, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/19\/hadith-on-treachery-it-is-forbidden-to-betray-even-an-aggressive-enemy\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In this example, the Prophet&#8217;s companions prevented the Caliph Mu’awiyah from marching his army toward the Romans in an attempt to surprise attack them when the peace treaty expired. Marching to war was considered an act of war that was initiated before the expiration of the treaty, so the companions protested despite the benefit they would have gained against a formidable and hostile enemy empire. Hence, Mu’awiyah returned with his armies and did not commence with his surprise attack.<\/p>\n<p>As we can see, Muslims are only allowed to lie if it is necessary to protect themselves from persecution. The general rule is that a Muslim must always speak the truth even if it goes against himself, his family, or his community. Moreover, the permission for deception during a state of war is universally consistent with military tactics used by armies since antiquity unto the present, but deception in violation of peace treaties, covenants, and agreements is strictly forbidden in every circumstance.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O you who believe, fear Allah and be with those who are truthful.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[16,18,32,48,51,100,55,103,45,72,98],"class_list":["post-13382","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-character-akhlaq","tag-community-jamaah","tag-hereafter-akhirah","tag-justice-adl","tag-leadership-imamate","tag-manners-al-adab","tag-methodology-al-minhaj","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-truthfulness-al-sidq","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3tQ","jetpack-related-posts":[{"id":20176,"url":"https:\/\/www.abuaminaelias.com\/expel-jews-christians-arabian-peninsula\/","url_meta":{"origin":13382,"position":0},"title":"Expel Jews and Christians from Arabian Peninsula?","author":"Abu Amina Elias","date":"February 10, 2019","format":false,"excerpt":"\"Allah does not forbid you from those who did not fight you,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17452,"url":"https:\/\/www.abuaminaelias.com\/congratulating-non-muslims-festivals\/","url_meta":{"origin":13382,"position":1},"title":"Prohibition of congratulating non-Muslims for their festivals","author":"Abu Amina Elias","date":"December 23, 2015","format":false,"excerpt":"\"Harshness is not found in anything except that it disgraces it.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15577,"url":"https:\/\/www.abuaminaelias.com\/war-is-deceit-lie-to-unbelievers\/","url_meta":{"origin":13382,"position":2},"title":"War is deceit? Lie to unbelievers?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Can Muslims lie to advance Islam?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":13382,"position":3},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14540,"url":"https:\/\/www.abuaminaelias.com\/verse-of-the-sword-slay-unbelievers\/","url_meta":{"origin":13382,"position":4},"title":"Slay them wherever you find them?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Prophet never forced the religion upon anyone,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14532,"url":"https:\/\/www.abuaminaelias.com\/fight-people-until-they-become-muslims\/","url_meta":{"origin":13382,"position":5},"title":"Fight people until they become Muslims?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The meaning is to fight those who are waging war...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13382","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13382"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13382\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13382"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13382"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}