{"id":13409,"date":"2013-05-06T04:19:04","date_gmt":"2013-05-06T00:19:04","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13409"},"modified":"2025-03-08T21:31:10","modified_gmt":"2025-03-08T17:31:10","slug":"an-nawawi-on-the-virtue-of-ablution-wudu","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-ablution-wudu\/","title":{"rendered":"Imam al-Nawawi on Ritual Ablution, al-Wudu"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب فضل الوضوء<\/p>\n<p>Chapter on the virtue of ablution.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/303<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا وَإِن كُنتُم مَّرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ۚ مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ<\/p>\n<p><strong>O believers! When you rise up for prayer, wash your faces and your hands up to the elbows, wipe your heads, and wash your feet to the ankles. And if you are in a state of full impurity, then take a full bath. But if you are ill, on a journey, or have relieved yourselves, or have been intimate with your wives and cannot find water, then purify yourselves with clean earth by wiping your faces and hands. It is not Allah’s will to burden you, but to purify you and complete His favour upon you, so perhaps you will be grateful.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:6<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ أُمَّتِي يُدْعَوْنَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ فَمَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ<\/p>\n<p><strong>Verily, my nation will be called on the Day of Resurrection as brightly radiant from the traces of ablution. Whoever among you is able to extend his radiance, let him do so.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 136, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/04\/the-virtue-of-ablution-wudu\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">تَبْلُغُ الْحِلْيَةُ مِنْ الْمُؤْمِنِ حَيْثُ يَبْلُغُ الْوَضُوءُ<\/p>\n<p><strong>The radiance of a believer will reach wherever the water of ablution has reached.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 250, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/06\/radiance-adornment-wudu\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Uthman ibn Affan reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ خَرَجَتْ خَطَايَاهُ مِنْ جَسَدِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِهِ<\/p>\n<p><b>Whoever performs ablution in an excellent manner, his sins will depart from his body even from under his fingernails.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 245, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/06\/wudu-sins-erased\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Humran reported: Uthman, may Allah be pleased with him, requested a vessel of water and he poured water over his hands three times and washed them. Then, he put his right hand in the vessel and rinsed his mouth and sniffed water into his nose. Then, he washed his face three times, and his hands up to the elbow three times. Then, he wiped his head and washed his feet three times. Then, Uthman said: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ<\/p>\n<p><strong>Whoever performs ablution like this ablution of mine and performs two cycles of prayer, without allowing his thoughts to stray, his previous sins will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 158, Grade: <strong><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/06\/wudu-perfect-ablution\/\">Muttafaqun Alayhi<\/a><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ أَوْ الْمُؤْمِنُ فَغَسَلَ وَجْهَهُ خَرَجَ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ يَدَيْهِ خَرَجَ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ كَانَ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتْ كُلُّ خَطِيئَةٍ مَشَتْهَا رِجْلَاهُ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ حَتَّى يَخْرُجَ نَقِيًّا مِنْ الذُّنُوبِ<\/p>\n<p><b>When a Muslim or a believer washes his face in ablution, every sin that he committed with his eyes will be washed away with the last drop of water. When he washes his hands, every sin that he committed with his hands will be washed away with the last drop of water. When he washes his feet, every sin that he committed with his feet will be washed away with the last drop of water, until he emerges purified from sin.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 244, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/23\/sin-washed-away-drop\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, came to a graveyard and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ وَدِدْتُ أَنَّا قَدْ رَأَيْنَا إِخْوَانَنَا<\/p>\n<p><strong>Peace be upon you, the abode of a people who had faith. We, if Allah wills, will join you. I love to see my brothers.<\/strong><\/p><\/blockquote>\n<p>They said, “Are we not your brothers, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْتُمْ أَصْحَابِي وَإِخْوَانُنَا الَّذِينَ لَمْ يَأْتُوا بَعْدُ<\/p>\n<p><strong>You are my companions, but our brothers are those who have yet to come.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, how will you recognize those people from your nation who have not yet been born?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتَ لَوْ أَنَّ رَجُلًا لَهُ خَيْلٌ غُرٌّ مُحَجَّلَةٌ بَيْنَ ظَهْرَيْ خَيْلٍ دُهْمٍ بُهْمٍ أَلَا يَعْرِفُ خَيْلَهُ<\/p>\n<p><strong>Suppose a man had horses with white blazes on their foreheads and legs, among horses which are all black. Tell me, would he not recognize his own horses?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّهُمْ يَأْتُونَ غُرًّا مُحَجَّلِينَ مِنْ الْوُضُوءِ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ أَلَا لَيُذَادَنَّ رِجَالٌ عَنْ حَوْضِي كَمَا يُذَادُ الْبَعِيرُ الضَّالُّ أُنَادِيهِمْ أَلَا هَلُمَّ فَيُقَالُ إِنَّهُمْ قَدْ بَدَّلُوا بَعْدَكَ فَأَقُولُ سُحْقًا سُحْقًا<\/p>\n<p><strong>They will come with radiant faces, arms, and legs due to the traces of ablution. I will arrive at the fountain before them. Some people will be driven away from my fountain, just as a stray camel is driven away. I will call out, &#8216;Come! Come!&#8217; But then it will be said to me: These people changed themselves after you, and I will say, &#8216;Be off! Be off!&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 249, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/04\/prophet-meets-followers-hawd\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَا أَدُلُّكُمْ عَلَى مَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ<\/p>\n<p><strong>Shall I not tell you of a deed by which Allah expiates your sins and raises your status?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course, O Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلَاةِ بَعْدَ الصَّلَاةِ فَذَلِكُمْ الرِّبَاطُ<\/p>\n<p><strong>Thorough ablution despite difficulty, taking many steps to the mosque, and waiting for one prayer after another. That is like guarding the frontier.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 251, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/06\/waiting-prayer-fortress\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ اللَّهُمَّ اجْعَلْنِي مِنْ التَّوَّابِينَ وَاجْعَلْنِي مِنْ الْمُتَطَهِّرِينَ فُتِحَتْ لَهُ ثَمَانِيَةُ أَبْوَابِ الْجَنَّةِ يَدْخُلُ مِنْ أَيِّهَا شَاءَ<\/p>\n<p><strong>Whoever performs ablution in the best manner and he says, ‘I bear witness there is no God but Allah alone, without any partners, and I bear witness that Muhammad is His servant and His Messenger. O Allah, make me among the repentant and make me among those who purify themselves,’ then the eight gates of Paradise will be opened for him and he may enter through whichever he wishes.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 55, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/13\/gates-paradise-wudu\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The radiance of a believer will reach wherever the water of ablution has reached.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[160,18,32,100,134,179],"class_list":["post-13409","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-ablution-wudu","tag-community-jamaah","tag-hereafter-akhirah","tag-manners-al-adab","tag-paradise-jannah","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3uh","jetpack-related-posts":[{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":13409,"position":0},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18580,"url":"https:\/\/www.abuaminaelias.com\/excellent-ablution-wudu-with-evidences\/","url_meta":{"origin":13409,"position":1},"title":"An excellent ablution (wudu) with evidences","author":"Abu Amina Elias","date":"December 5, 2017","format":false,"excerpt":"\"O you who believe, when you rise to perform prayer, wash your faces and your forearms to the elbows...\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14845,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-walking-to-the-mosque\/","url_meta":{"origin":13409,"position":2},"title":"Imam al-Nawawi on Walking to the Mosque","author":"Abu Amina Elias","date":"August 29, 2013","format":false,"excerpt":"\"Give glad tidings to those who walk to the mosque in darkness,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20698,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-excellent-wudu\/","url_meta":{"origin":13409,"position":3},"title":"Imam al-Mundhiri on Excellent Ablution","author":"Abu Amina Elias","date":"July 30, 2019","format":false,"excerpt":"\"Purity is half of faith,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":13409,"position":4},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14792,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-friday-prayer-jumuah-jummah\/","url_meta":{"origin":13409,"position":5},"title":"Imam al-Nawawi on Friday Prayer, Salat al-Jumu&#8217;ah","author":"Abu Amina Elias","date":"August 23, 2013","format":false,"excerpt":"\"Verily, the best of your days is Friday.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13409","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13409"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13409\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13409"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13409"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13409"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}