{"id":13480,"date":"2016-07-04T10:50:04","date_gmt":"2016-07-04T06:50:04","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13480"},"modified":"2025-07-04T10:54:43","modified_gmt":"2025-07-04T06:54:43","slug":"why-should-a-muslim-act-if-everything-is-already-decreed-by-allah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/why-should-a-muslim-act-if-everything-is-already-decreed-by-allah\/","title":{"rendered":"Why should a Muslim act if everything is already decreed by Allah?"},"content":{"rendered":"<p><b>Question:<\/b><\/p>\n<p>Why should a Muslim do anything if all things have already been decided by Allah? How does Islam reconcile free will with providence (<i>al-qadr<\/i>)?<\/p>\n<p><b>Answer:<\/b><\/p>\n<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>The correct Islamic belief lies between the misguidance of the fatalists (<i>al-jabriyyah<\/i>) and those who deny the providence of Allah (<i>al-qadriyyah<\/i>). Allah has decreed in general everything that will occur until the end of time, but He reserves the right to erase whatever He wills in the specific destinies of people.<\/p>\n<p>In general, all things have been written on the Preserved Tablet (<i>al-lawh al-mahfuz<\/i>) and none of this will change.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ<\/p>\n<p><b>Verily, We have created all things with providence.<\/b><\/p>\n<p>Surah Al-Qamar 54:49<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُّبِينٍ<\/p>\n<p><b>Verily, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear register.<\/b><\/p>\n<p>Surah Ya Seen 36:12<\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ وَلَوْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ رُفِعَتْ الْأَقْلَامُ وَجَفَّتْ الصُّحُفُ<\/p>\n<p><b>Know that if the entire creation were to gather together to benefit you, they would not benefit you except if Allah willed; and if the entire creation gathered together to harm you, they would not harm you except if Allah willed. The pens have been raised and the pages dried.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2516, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/29\/hadith-on-trusting-allah-be-mindful-of-allah-and-he-will-protect-you-for-none-can-harm-you-except-if-allah-wills\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>There are many verses and traditions which convey this meaning, that all things have been decreed by Allah from the beginning of time until the end. We should understand from this that we can do nothing and achieve nothing except with the help of Allah, so we must put our trust and dependence (<i>tawakkul<\/i>) upon him.<\/p>\n<p>However, Allah reserves the right to erase whatever He wills from an individual’s specific destiny due to their choices, actions, and supplications. Allah does so due to His perfect knowledge and wisdom, not out of forgetfulness or ignorance, for He knew how people would act before he created them. We should understand that our destiny is determined by how we use the free will Allah has given us.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ ۖ وَعِندَهُ أُمُّ الْكِتَابِ<\/p>\n<p><b>Allah eliminates  or confirms <b>what He wills<\/b>, and with Him is the foundation of the Book.<\/b><\/p>\n<p>Surah Ar-Ra’d 13:39<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ<\/p>\n<p><strong>Every day He brings forth a matter.<\/strong><\/p>\n<p>Surat Ar-Rahman 55:29<\/p><\/blockquote>\n<p>Thus, it is permissible to ask Allah to change our destinies for the better.<\/p>\n<p>Ibn Taymiyyah reported: Umar ibn Al-Khattab, may Allah be pleased with him, would say:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ إنْ كُنْتَ كَتَبْتَنِي شَقِيًّا فَامْحُنِي وَاكْتُبْنِي سَعِيدًا فَإِنَّكَ تَمْحُو مَا تَشَاءُ<\/p>\n<p>O Allah, if you have written me among the wretched, then erase it and write me among the fortunate. Verily, you can erase whatever you will.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-taymiyyah-on-belief-in-providence-provision-and-free-will\/\">Majmu’ Al-Fatawa 8\/540<\/a><\/p><\/blockquote>\n<p>Ibn Kathir reported: Mansur asked Mujahid about the supplication:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ إِنْ كَانَ اسْمِي فِي السُّعَدَاءِ فَأَثْبِتْهُ فِيهِمْ وَإِنْ كَانَ فِي الْأَشْقِيَاءِ فَامْحُهُ عَنْهُمْ وَاجْعَلْهُ فِي السُّعَدَاءِ<\/p>\n<p style=\"text-align: left;\" align=\"right\">O Allah, if my name is with those who are fortunate then affirm my name among them, and if my name is among the miserable then remove it and place it among those who are fortunate.<\/p>\n<\/blockquote>\n<p>Mujahid said, “This is a good supplication.” And Abu Wa’il Shaqiq ibn Salamah said he would recite this supplication often:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ إِنْ كُنْتَ كَتَبْتَنَا أَشْقِيَاءَ فَامْحُهُ وَاكْتُبْنَا سُعَدَاءَ وَإِنْ كُنْتَ كَتَبْتَنَا سُعَدَاءَ فَأَثْبِتْنَا فَإِنَّكَ تَمْحُو مَا تَشَاءُ وَتُثْبِتُ وَعِنْدَكَ أُمُّ الْكِتَابِ<\/p>\n<p>O Allah, if you wrote us among the miserable then remove this from us and write us among the blessed, and if you wrote us among the blessed then let us stay this way. Verily, you erase and confirm whatever you will and with you is the foundation of the Book.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/14\/verse-on-providence-allah-eliminates-and-confirms-what-he-wills-of-the-servants-records\/\">Tafseer Ibn Kathir 13:39<\/a><\/p><\/blockquote>\n<p>There are narrations from the Prophet which indicate that Allah can change a person’s destiny due to their actions and supplications.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ سَرَّهُ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ وَأَنْ يُنْسَأَ لَهُ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ<\/p>\n<p><b>Whoever is pleased to be given more wealth and to have his life extended, then he should keep good relations with his family.<\/b><\/p>\n<p>Source: Sahih Bukhari 5639, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/03\/hadith-on-family-good-relations-with-family-will-increase-wealth-and-extend-life\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ubadah ibn As-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا عَلَى الْأَرْضِ مُسْلِمٌ يَدْعُو اللَّهَ بِدَعْوَةٍ إِلَّا آتَاهُ اللَّهُ إِيَّاهَا أَوْ صَرَفَ عَنْهُ مِنْ السُّوءِ مِثْلَهَا مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رَحِمٍ<\/p>\n<p><b>There is no Muslim on the earth who calls upon Allah in supplication except that Allah will grant it to him or divert some evil away from him, so long as he does not ask for something sinful or to cut off family ties.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 3573, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/25\/hadith-on-providence-every-muslim-can-divert-the-misfortune-of-the-divine-decree-with-his-supplications\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Hasan ibn Ali reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ<\/p>\n<p><strong>O Allah, guide me among those you have guided, pardon me among those you have pardoned, protect me among those you have protected, bless me in what you have given me, and save me from the evil of what You have decreed. Verily, you alone decree and none can pass decree upon you.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 464, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/04\/hadith-on-destiny-o-allah-save-me-from-the-evil-of-what-you-have-decreed\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَعَوَّذُ مِنْ سُوءِ الْقَضَاءِ<\/p>\n<p>The Prophet, peace and blessings be upon him, would seek refuge in Allah from the evil of the divine decree.<\/p>\n<p>Source: Sahih Muslim 2707, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/12\/hadith-on-destiny-the-prophet-would-seek-refuge-in-allah-from-an-evil-destiny\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Salman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَرُدُّ الْقَضَاءَ إِلَّا الدُّعَاءُ وَلَا يَزِيدُ فِي الْعُمْرِ إِلَّا الْبِرُّ<\/p>\n<p><b>Nothing repels the divine decree except supplication, and nothing increases life span except righteousness.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2139, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/25\/hadith-on-providence-supplication-repels-the-divine-decree-righteousness-increases-life-span\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Thawban reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لاَ يَزِيدُ فِي الْعُمْرِ إِلاَّ الْبِرُّ وَلاَ يَرُدُّ الْقَدَرَ إِلاَّ الدُّعَاءُ وَإِنَّ الرَّجُلَ لَيُحْرَمُ الرِّزْقَ لِلْخَطِيئَةِ يَعْمَلُهَا<\/p>\n<p><b>The span of life is not increased except by righteousness, and providence is not repelled except by supplication. Verily, a man is not deprived of provision except because of the sins he commits.<\/b><\/p>\n<p>Source: Sunan Ibn Majah 90, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/25\/hadith-on-providence-righteousness-increases-life-span-providence-is-repelled-by-supplication\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Therefore, Allah decreed general destinies for all people before their creation but their specific destinies can be changed according to their use of free will. This is a secret within the creation in which we must believe, as it has been reported in the authentic texts, although it might be difficult for us to fully comprehend since our frame of reference is limited by time and space. For this reason, the Prophet forbade the Muslims from delving deeply into the divine decree and arguing about its exact nature.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, entered upon us while we were arguing about the issue of providence. The Prophet became angry until his face was red as if a pomegranate were bursting from his cheeks. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">أَبِهَذَا أُمِرْتُمْ أَمْ بِهَذَا أُرْسِلْتُ إِلَيْكُمْ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ حِينَ تَنَازَعُوا فِي هَذَا الْأَمْرِ عَزَمْتُ عَلَيْكُمْ أَلَّا تَتَنَازَعُوا فِيهِ<\/p>\n<p><b>Is this what I have commanded of you? Is this the reason I was sent to you? Verily, the people before you were destroyed when they argued about this matter. I order you not to debate about it.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2133, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/25\/hadith-on-providence-the-prophet-forbids-the-companions-from-arguing-about-the-divine-decree\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>At-Tahawi states in his creed:<\/p>\n<blockquote>\n<p align=\"right\">وَأَصْلُ الْقَدَرِ سِرُّ اللَّهِ تَعَالَى فِي خَلْقِهِ لَمْ يَطَّلِعْ عَلَى ذَلِكَ مَلَكٌ مُقَرَّبٌ وَلَا نَبِيٌّ مُرْسَلٌ وَالتَّعَمُّقُ وَالنَّظَرُ فِي ذَلِكَ ذَرِيعَةُ الْخِذْلَانِ وَسُلَّمُ الْحِرْمَانِ وَدَرَجَةُ الطُّغْيَانِ<\/p>\n<p>The exact nature of the decree is Allah’s secret in His creation, and no angel near the Throne nor Prophet sent with a message has been given knowledge of it. Delving into it and reflecting too deeply upon it only leads to destruction and loss and results in rebelliousness.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/aqeedah-of-imam-tahawi\/\">Aqeedah At-Tahawi<\/a><\/p><\/blockquote>\n<p>In conclusion, the correct belief in Islam regarding providence (<i>al-qadr<\/i>) is that Allah has decreed all things universally but that He determines the particular destiny of people according to how they use their free will. We do not believe in fatalism, which denies people’s free will and responsibility, nor do we deny divine providence believing we are not subject to Allah&#8217;s will. Rather, Islam teaches us to follow a middle way between these two extremes. The exact nature of divine providence is a secret of the creation about which only Allah truly knows, so we have been commanded not to argue about it or to seek out its unseen secrets.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah eliminates  or confirms what He wills, and with Him is the foundation of the Book.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[16,18,21,24,32,100,56,92,254],"class_list":["post-13480","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-character-akhlaq","tag-community-jamaah","tag-creed-aqidah","tag-family-ties-sillat-rahim","tag-hereafter-akhirah","tag-manners-al-adab","tag-monotheism-tawheed","tag-providence-al-qada-wal-qadr","tag-provision-al-rizq"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3vq","jetpack-related-posts":[{"id":16119,"url":"https:\/\/www.abuaminaelias.com\/let-him-blame-no-one-but-himself\/","url_meta":{"origin":13480,"position":0},"title":"Let him blame no one but himself","author":"Abu Amina Elias","date":"December 9, 2014","format":false,"excerpt":"\"Whatever disaster strikes you is for what your hands have earned.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15128,"url":"https:\/\/www.abuaminaelias.com\/everything-decreed-is-good-for-the-believer-both-ease-and-hardship\/","url_meta":{"origin":13480,"position":1},"title":"Everything Allah decrees is good for the believer","author":"Abu Amina Elias","date":"January 4, 2014","format":false,"excerpt":"\"Verily, Allah does not decree anything for the believer except what is good for him.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23090,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-free-time-worship\/","url_meta":{"origin":13480,"position":2},"title":"Imam al-Mundhiri on Free Time for Worship, Concern for Hereafter","author":"Abu Amina Elias","date":"April 28, 2021","format":false,"excerpt":"\"Son of Adam, use your free time for My worship.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16830,"url":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","url_meta":{"origin":13480,"position":3},"title":"Definition of faith in Islam","author":"Abu Amina Elias","date":"August 16, 2015","format":false,"excerpt":"\"Faith is to believe in Allah, His angels, His books...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":24261,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-muraqaba\/","url_meta":{"origin":13480,"position":4},"title":"Forty Hadith on Mindfulness","author":"Abu Amina Elias","date":"October 3, 2024","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14856,"url":"https:\/\/www.abuaminaelias.com\/beware-of-transgression-and-exaggeration-in-supplication\/","url_meta":{"origin":13480,"position":5},"title":"Beware of exaggeration in supplication","author":"Abu Amina Elias","date":"September 2, 2013","format":false,"excerpt":"\"There will be people who will transgress in supplication, so beware not to be one of them.\" --Sunan Abu Dawud 1480","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13480","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13480"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13480\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13480"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13480"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13480"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}