{"id":13607,"date":"2013-05-30T00:31:20","date_gmt":"2013-05-29T20:31:20","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13607"},"modified":"2025-03-03T12:31:05","modified_gmt":"2025-03-03T08:31:05","slug":"an-nawawi-on-the-virtue-of-forgiveness-and-pardoning-the-ignorant","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-forgiveness-and-pardoning-the-ignorant\/","title":{"rendered":"Imam al-Nawawi on Forgiveness, Pardoning the Ignorant"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب العفو والإعراض عن الجاهلين<\/p>\n<p>Chapter on forgiveness and turning away from the ignorant.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/208<\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ<\/p>\n<p><strong>Be gracious, enjoin what is right, and turn away from those who act ignorantly.<\/strong><\/p>\n<p>Surat al-A’raf 7:199<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَإِنَّ السَّاعَةَ لَآتِيَةٌ فَاصْفَحِ الصَّفْحَ الْجَمِيلَ<\/p>\n<p><strong>We have not created the heavens and the earth and everything in between except for a purpose. And the Hour is certain to come, so forgive graciously.<\/strong><\/p>\n<p>Surat al-Hijr 15:85<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلْيَعْفُوا وَلْيَصْفَحُوا أَلَا تُحِبُّونَ أَن يَغْفِرَ اللَّهُ لَكُمْ وَاللَّهُ غَفُورٌ رَّحِيمٌ<\/p>\n<p><strong>Let them pardon and forgive. Do you not love to be forgiven by Allah? And Allah is All-Forgiving, Most Merciful.<\/strong><\/p>\n<p>Surat al-Nur 24:22<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ<\/p>\n<p><strong>Hasten towards forgiveness from your Lord and a Paradise as vast as the heavens and the earth, prepared for those mindful of Allah. They are those who donate in prosperity and adversity, control their anger, and pardon others. And Allah loves the good-doers.<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:133-134<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ وَلَمَنِ انتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِم مِّن سَبِيلٍ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><strong>The reward of an evil deed is its equivalent. But whoever pardons and seeks reconciliation, then their reward is with Allah. He certainly does not like the wrongdoers. There is no blame on those who enforce justice after being wronged. Blame is only on those who wrong people and transgress in the land unjustly. It is they who will suffer a painful punishment. And whoever endures patiently and forgives, surely this is a resolve to aspire to.<\/strong><\/p>\n<p>Surat al-Shura 42:40-43<\/p><\/blockquote>\n<p>Aisha reported: She asked the Prophet, “Have you encountered a harder day than the battle of Uhud?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ لَقِيتُ مِنْ قَوْمِكِ مَا لَقِيتُ وَكَانَ أَشَدَّ مَا لَقِيتُ مِنْهُمْ يَوْمَ الْعَقَبَةِ إِذْ عَرَضْتُ نَفْسِي عَلَى ابْنِ عَبْدِ يَالِيلَ بْنِ عَبْدِ كُلَالٍ فَلَمْ يُجِبْنِي إِلَى مَا أَرَدْتُ فَانْطَلَقْتُ وَأَنَا مَهْمُومٌ عَلَى وَجْهِي فَلَمْ أَسْتَفِقْ إِلَّا وَأَنَا بِقَرْنِ الثَّعَالِبِ فَرَفَعْتُ رَأْسِي فَإِذَا أَنَا بِسَحَابَةٍ قَدْ أَظَلَّتْنِي فَنَظَرْتُ فَإِذَا فِيهَا جِبْرِيلُ فَنَادَانِي فَقَالَ إِنَّ اللهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ وَمَا رَدُّوا عَلَيْكَ وَقَدْ بَعَثَ إِلَيْكَ مَلَكَ الْجِبَالِ لِتَأْمُرَهُ بِمَا شِئْتَ فِيهِمْ فَنَادَانِي مَلَكُ الْجِبَالِ فَسَلَّمَ عَلَيَّ ثُمَّ قَالَ يَا مُحَمَّدُ فَقَالَ ذَلِكَ فِيمَا شِئْتَ إِنْ شِئْتَ أَنْ أُطْبِقَ عَلَيْهِمُ الْأَخْشَبَيْنِ فَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَلْ أَرْجُو أَنْ يُخْرِجَ اللهُ مِنْ أَصْلَابِهِمْ مَنْ يَعْبُدُ اللهَ وَحْدَهُ لَا يُشْرِكُ بِهِ شَيْئًا<\/p>\n<p><strong>I have met your people as they are, and the worst of it was the day of ‘Aqabah as I had an audience with Ibn ‘Abd Yalil ibn ‘Abd Kulal. He did not respond as I had hoped, so I departed with grief upon my face. I could not recover until I reached Qarn al-Tha’alib, then I raised my head to behold a cloud shading me. I looked again to behold the Angel Gabriel within it, calling out to me, ‘Verily, Allah has heard what your people said to you and their response. He has sent the Angel of the Mountains for you to command as you wish regarding them.’ The Angel of the Mountains called out to greet me with peace, then he said, ‘O Muhammad, speak as you wish. I will crush them under two mountains if that is your desire.’ I said, ‘No, rather I hope Allah will bring out from their progeny those who would worship Allah alone without associating any partners with Him.&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3231, Grade: <em><strong><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/18\/angel-mountains-taif-mercy\/\">Muttafaqun Alayhi<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا خُيِّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَمْرَيْنِ إِلَّا أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ وَمَا انْتَقَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِنَفْسِهِ إِلَّا أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمَ لِلَّهِ بِهَا<\/p>\n<p style=\"text-align: left;\" align=\"right\">The Messenger of Allah, peace and blessings be upon him, was not presented with two matters but that he would choose the easier of them, as long as it was not sinful. If it was sinful, he would be the furthest of people from it. The Prophet did not take revenge for wrongs against himself, unless the sacred limits of Allah were violated, for then he would retaliate for the sake of Allah.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3560, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/11\/prophet-forbearing-forgiving\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p align=\"right\">كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ فَأَدْرَكَهُ أَعْرَابِيٌّ فَجَبَذَ بِرِدَائِهِ جَبْذَةً شَدِيدَةً قَالَ أَنَسٌ فَنَظَرْتُ إِلَى صَفْحَةِ عَاتِقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَثَّرَتْ بِهَا حَاشِيَةُ الرِّدَاءِ مِنْ شِدَّةِ جَبْذَتِهِ ثُمَّ قَالَ يَا مُحَمَّدُ مُرْ لِي مِنْ مَالِ اللَّهِ الَّذِي عِنْدَكَ فَالْتَفَتَ إِلَيْهِ فَضَحِكَ ثُمَّ أَمَرَ لَهُ بِعَطَاءٍ<\/p>\n<p>I was walking with the Messenger of Allah, peace and blessings be upon him, while he was wearing a Najrani cloak with a thick border. A bedouin Arab overtook the Prophet and forcibly pulled his clothes. I looked at the shoulder of the Prophet and I saw that the edge of his shirt had left a mark because of the strength of his pull. The man said, &#8216;O Muhammad! Order them to give me something from Allah’s wealth which you have!&#8217; The Prophet turned and he smiled, then he ordered that the man be given charity.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6088, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/prophet-hilm-kindness-sadaqah\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: I remember seeing the Messenger of Allah, peace and blessings be upon him, tell the story of a prophet who was beaten by his people, and he wiped the blood from his face, saying:<\/p>\n<blockquote>\n<p align=\"right\">رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ<\/p>\n<p><b>My Lord, forgive my people for they do not know.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6929, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/06\/03\/know-not-what-they-do\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لا يَعْلَمُونَ<\/p>\n<p><strong>O Allah, forgive my people for they do not know.<\/strong><\/p><\/blockquote>\n<p>Abu Hatim commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَعْنِي هَذَا الدُّعَاءُ أَنَّهُ قَالَ يَوْمَ أُحُدٍ لَمَّا شُجَّ وَجْهُهُ<\/p>\n<p>The Prophet said this supplication during the battle of Uhud when they slashed his face.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 973, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/prophet-forgives-battle-uhud\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ<\/p>\n<p><strong>The strongest are not the best wrestlers. Verily, the strongest are those who control themselves when angry.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6114, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/10\/06\/strong-control-anger\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الشَّدِيدُ مَنْ غَلَبَ النَّاسَ وَلَكِنَّ الشَّدِيدَ مَنْ غَلَبَ نَفْسَهُ<\/p>\n<p><strong>The strong are not those who defeat people. Rather, the strong are those who defeat their own ego.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 717, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/14\/jihad-al-nafs\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Be gracious, enjoin what is right, and turn away from those who act ignorantly.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[26,32,138,48,50,100,54,93,56,62,124,179],"class_list":["post-13607","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-forgiveness-al-maghfirah","tag-hereafter-akhirah","tag-jesus-isa","tag-justice-adl","tag-knowledge","tag-manners-al-adab","tag-mercy-al-rahmah","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-prophetic-biography-sirah","tag-reconciliation","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3xt","jetpack-related-posts":[{"id":15158,"url":"https:\/\/www.abuaminaelias.com\/forgiveness-in-the-quran-and-sunnah\/","url_meta":{"origin":13607,"position":0},"title":"Forgiveness in the Quran and Sunnah","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Show forgiveness, enjoin what is good, and turn away from the ignorant.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":13607,"position":1},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13611,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-kindness-tolerance-and-gentleness\/","url_meta":{"origin":13607,"position":2},"title":"Imam al-Nawawi on Forbearance, Clemency, and Gentleness","author":"Abu Amina Elias","date":"May 30, 2013","format":false,"excerpt":"\"Allah is kind and He loves kindness in all matters.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14052,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-night-of-decree-during-ramadan-laylat-al-qadr\/","url_meta":{"origin":13607,"position":3},"title":"Imam al-Nawawi on Night of Decree in Ramadan, Laylat al-Qadr","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Night of Decree is better than a thousand months.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14928,"url":"https:\/\/www.abuaminaelias.com\/eye-for-an-eye\/","url_meta":{"origin":13607,"position":4},"title":"What is the meaning of &#8216;eye for an eye&#8217;?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"We ordained for them a life for a life, an eye for an eye...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15285,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-bidah\/","url_meta":{"origin":13607,"position":5},"title":"Imam al-Nawawi on Innovation in Religion","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Whoever innovates something into this affair of ours...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13607","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13607"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13607\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13607"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13607"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13607"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}