{"id":13611,"date":"2013-05-30T06:27:54","date_gmt":"2013-05-30T02:27:54","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13611"},"modified":"2025-03-03T16:03:57","modified_gmt":"2025-03-03T12:03:57","slug":"an-nawawi-on-the-virtue-of-kindness-tolerance-and-gentleness","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-kindness-tolerance-and-gentleness\/","title":{"rendered":"Imam al-Nawawi on Forbearance, Clemency, and Gentleness"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب الحلم والأناة والرفق<\/p>\n<p>Chapter on forbearance, clemency, and gentleness.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/381<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ<\/p>\n<p><strong>Hasten towards forgiveness from your Lord and a Paradise as vast as the heavens and the earth, prepared for those mindful of Allah. They are those who donate in prosperity and adversity, control their anger, and pardon others. And Allah loves the good-doers.<\/strong><\/p>\n<p>Surat Ali ‘Imran 3:133-134<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ<\/p>\n<p><strong>Be gracious, enjoin what is right, and turn away from those who act ignorantly.<\/strong><\/p>\n<p>Surat al-A’raf 7:199<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ<\/p>\n<p><strong>Good and evil cannot be equal. Respond to evil with what is best, then the one you are in a feud with will be like a close friend. But this cannot be attained except by those who are patient and who are truly fortunate.<\/strong><\/p>\n<p>Surat Fussilat 41:34-35<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ وَلَمَنِ انتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِم مِّن سَبِيلٍ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><strong>The reward of an evil deed is its equivalent. But whoever pardons and seeks reconciliation, then their reward is with Allah. He certainly does not like the wrongdoers. There is no blame on those who enforce justice after being wronged. Blame is only on those who wrong people and transgress in the land unjustly. It is they who will suffer a painful punishment. And whoever endures patiently and forgives, surely this is a resolve to aspire to.<\/strong><\/p>\n<p>Surat al-Shura 42:40-43<\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said to Al-Ashajj ‘Abdul Qays:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ فِيكَ خَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ الْحِلْمُ وَالْأَنَاةُ<\/p>\n<p><strong>Verily, you have two qualities beloved to Allah. They are forbearance and clemency.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 17, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/10\/allah-loves-hilm-haya\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Aisha reported: A group of Jews asked permission to visit the Prophet and when they were admitted, they said, “Death be upon you!” I said to them, “Rather, death and the curse of Allah be upon you!” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الْأَمْرِ كُلِّهِ<\/p>\n<p><strong>O Aisha, Allah is gentle and he loves gentleness in all matters.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6927, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/16\/allah-is-kind-loves-kindness\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَلَيْكِ بِالرِّفْقِ وَإِيَّاكِ وَالْعُنْفَ وَالْفُحْشَ<\/p>\n<p><strong>You must be gentle, and beware of harshness and obscenity.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6030, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/03\/be-gentle-speech\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَى الرِّفْقِ مَا لَا يُعْطِي عَلَى الْعُنْفِ وَمَا لَا يُعْطِي عَلَى مَا سِوَاهُ<\/p>\n<p><strong>Verily, Allah is gentle, and He loves gentleness. He rewards for gentleness what is not granted for harshness, and He does not reward anything else like it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2593, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/10\/02\/allah-is-gentle-kind\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Aisha reported: I was on a camel that was misbehaving, so I started to beat it. The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p align=\"right\">عَلَيْكِ بِالرِّفْقِ فَإِنَّ الرِّفْقَ لَا يَكُونُ فِي شَيْءٍ إِلَّا زَانَهُ وَلَا يُنْزَعُ مِنْ شَيْءٍ إِلَّا شَانَهُ<\/p>\n<p><b>You must be gentle, for verily, gentleness is not in anything except that it beautifies it, and it is not removed from anything except that it disgraces it.<\/b><\/p>\n<p>Source: al-Adab al-Mufrad lil-Bukhārī 475, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/you-must-be-gentle\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: A desert Arab entered the mosque of the Prophet, peace and blessings be upon him, while the Prophet was sitting. He prayed and when finished he said, “O Allah, have mercy on me and Muhammad and no one else.” The Prophet turned to him and said:<\/p>\n<blockquote>\n<p align=\"right\">تَحَجَّرْتَ وَاسِعًا<\/p>\n<p><b>You have restricted something that is vast. <\/b><\/p><\/blockquote>\n<p>It was not long before he was urinating in the mosque, so the people rushed to him, but the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">أَهْرِيقُوا عَلَيْهِ سَجْلًا مِنْ مَاءٍ أَوْ دَلْوًا مِنْ مَاءٍ إِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ وَلَمْ تُبْعَثُوا مُعَسِّرِينَ<\/p>\n<p><strong>Pour a bucket or a tumbler of water over it. You have only been sent to make things easy, and you were not sent to make things difficult.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 147, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/01\/mercy-forgiveness-bedouin\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Burdah reported: The Prophet, peace and blessings be upon him, sent him and Mu’adh to Yemen, saying:<\/p>\n<blockquote>\n<p align=\"right\">يَسِّرَا وَلَا تُعَسِّرَا وَبَشِّرَا وَلَا تُنَفِّرَا وَتَطَاوَعَا وَلَا تَخْتَلِفَا<\/p>\n<p><strong>Make things easy and do not make things difficult. Give glad tidings and do not repel people. Cooperate with each other and do not become divided.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3038, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/11\/dawah-glad-tidings-easy\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Jarir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ يُحْرَمْ الرِّفْقَ يُحْرَمْ الْخَيْرَ<\/p>\n<p><strong>Whoever is deprived of the characteristic of gentleness is deprived of all goodness.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2592, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/24\/deprive-kindness-khayr\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ أُعْطِيَ حَظَّهُ مِنْ الرِّفْقِ فَقَدْ أُعْطِيَ حَظَّهُ مِنْ الْخَيْرِ وَمَنْ حُرِمَ حَظَّهُ مِنْ الرِّفْقِ فَقَدْ حُرِمَ حَظَّهُ مِنْ الْخَيْرِ<\/p>\n<p><strong>Whoever has the quality of kindness has been given his share of goodness. Whoever is deprived of the quality of kindness has been deprived of his share of goodness.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2013, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/12\/14\/rifq-blessed-khayr\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: A man came to the Prophet, peace and blessings be upon him, and said, “Advise me.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَغْضَبْ<\/p>\n<p><b>Do not get angry.<\/b><\/p><\/blockquote>\n<p>The man repeated his request twice, and the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَغْضَبْ<\/p>\n<p><b>Do not get angry.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6116, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/06\/do-not-get-angry\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَغْضَبْ وَلَكَ الْجَنَّةُ<\/p>\n<p><strong>Do not be angry and you will enter Paradise.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ lil-Ṭabarānī 2353, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/25\/do-not-get-angry-enter-paradise\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p><span style=\"font-size: 16px;\">Shadid ibn Aws reported: The Messenger of Allah, peace and blessings be upon him, said:<\/span><\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ فَلْيُرِحْ ذَبِيحَتَهُ<\/p>\n<p><strong>Verily, Allah has prescribed excellence in everything. If you have to kill, kill in the best manner. If you have to slaughter, slaughter in the best manner. Let one of you sharpen his knife, so his animal is spared of suffering.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1955, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/07\/allah-ihsan-all-things\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا خُيِّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَمْرَيْنِ إِلَّا أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ وَمَا انْتَقَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِنَفْسِهِ إِلَّا أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمَ لِلَّهِ بِهَا<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, was not presented with two matters but that he would choose the easier of them, as long as it was not sinful. If it was sinful, he would be the furthest of people from it. The Prophet did not take revenge for wrongs against himself, unless the sacred limits of Allah were violated, for then he would retaliate for the sake of Allah.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3560, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/11\/prophet-forbearing-forgiving\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَا أُخْبِرُكُمْ بِمَنْ يَحْرُمُ عَلَى النَّارِ أَوْ بِمَنْ تَحْرُمُ عَلَيْهِ النَّارُ عَلَى كُلِّ قَرِيبٍ هَيِّنٍ سَهْلٍ<\/p>\n<p><strong>Shall I not tell you of one forbidden for Hellfire or Hellfire is forbidden for him? It is everyone accessible, polite, and easy-going.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2488, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/11\/polite-easy-going-jannah\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah is kind and He loves kindness in all matters.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[13,317,61,16,18,25,26,49,32,100,54,93,179],"class_list":["post-13611","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-anger-al-ghadhab","tag-animals","tag-call-to-islam-dawah","tag-character-akhlaq","tag-community-jamaah","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-manners-al-adab","tag-mercy-al-rahmah","tag-moderation-al-wasitiyyah","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3xx","jetpack-related-posts":[{"id":20427,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-kindness-gentleness-hilm\/","url_meta":{"origin":13611,"position":0},"title":"Imam al-Mundhiri on Kindness, Gentleness, and Forbearance","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Allah is kind and he loves kindness in all matters.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15996,"url":"https:\/\/www.abuaminaelias.com\/allah-loves-gentleness-in-all-things\/","url_meta":{"origin":13611,"position":1},"title":"Allah loves gentleness in all things","author":"Abu Amina Elias","date":"August 6, 2014","format":false,"excerpt":"\"Whoever is given his portion of kindness has been given his portion of goodness.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14241,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-safeguarding-the-fast\/","url_meta":{"origin":13611,"position":2},"title":"Imam al-Nawawi on Safeguarding the Fast","author":"Abu Amina Elias","date":"July 16, 2013","format":false,"excerpt":"\"When one of you awakens in the morning for fasting...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12916,"url":"https:\/\/www.abuaminaelias.com\/the-martyrdom-of-prophet-muhammad-an-example-of-his-tolerance-and-forgiveness\/","url_meta":{"origin":13611,"position":3},"title":"Martyrdom of Prophet Muhammad: An example of forbearance and forgiveness","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"I never saw a case involving legal retaliation being referred to the Messenger of Allah, peace and blessings be upon him, except that he would command pardoning the criminal.\" --Anas ibn Malik","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14950,"url":"https:\/\/www.abuaminaelias.com\/humility-modesty-and-forbearance-in-islam\/","url_meta":{"origin":13611,"position":4},"title":"Humility, modesty, and forbearance in Islam","author":"Abu Amina Elias","date":"November 30, 2013","format":false,"excerpt":"\"Verily, Allah has revealed to me that you must be humble towards one another, so that no one wrongs another or arrogantly boasts to another.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":13611,"position":5},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13611","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13611"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13611\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13611"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13611"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13611"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}