{"id":13762,"date":"2013-06-08T07:38:21","date_gmt":"2013-06-08T11:38:21","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13762"},"modified":"2021-02-15T12:08:29","modified_gmt":"2021-02-15T08:08:29","slug":"salvation-outside-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","title":{"rendered":"Salvation for non-Muslims outside of Islam?"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>The general rule is that people who hear the message of Islam in its true form must believe in Prophet Muhammad (ṣ) and obey his commands to worship Allah alone; hose who reject the authentic message of Islam will be punished in Hellfire. However, it is possible that Allah might forgive some people who have a valid excuse, such as their honest ignorance or not having access to genuine Islamic knowledge. Allah has the right to forgive and reward whomever He wills, for Allah knows them best, and in general we cannot assume to know with certainty the ultimate fate of individuals.<\/p>\n<p>The duty for humanity to embrace the religion of Islam is confirmed in many verses and authentic traditions.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الدِّينَ عِندَ اللَّهِ الْإِسْلَامُ<\/p>\n<p><b>Verily, the religion with Allah is Islam.<\/b><\/p>\n<p>Surat Ali Imran 3:19<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَن يَبْتَغِ غَيْرَ الْإِسْلَامِ دِينًا فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ<\/p>\n<p><b>Whoever desires other than Islam as religion it never will it be accepted from him, and in the Hereafter he will be among the losers.<\/b><\/p>\n<p>Surat Ali Imran 3:85<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا يَسْمَعُ بِي أَحَدٌ مِنْ هَذِهِ الْأُمَّةِ يَهُودِيٌّ وَلَا نَصْرَانِيٌّ ثُمَّ يَمُوتُ وَلَمْ يُؤْمِنْ بِالَّذِي أُرْسِلْتُ بِهِ إِلَّا كَانَ مِنْ أَصْحَابِ النَّارِ<\/p>\n<p><b>By the one in whose hand is the soul of Muhammad, there is no one who hears of me from this nation of Jews and Christians and then dies without believing in my message but that he will be a companion of the Hellfire.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 153, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/05\/ahl-al-kitab-hear-prophet\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Yet the fact is that many Jews, Christians, and other non-Muslims are presented with a distorted version of Islam. They sincerely follow their own religions believing they are the truth. It is possible that Allah may forgive these people and reward them for their sincerity to Him, as Allah never punishes people unless they receive the authentic message clearly.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبْعَثَ رَسُولًا<\/p>\n<p><b>Never will We punish until We send a messenger.<\/b><\/p>\n<p>Surat al-Isra&#8217; 17:15<\/p><\/blockquote>\n<p>The question of the fate of Jews, Christians, and other non-Muslims in the Hereafter was asked in front of the Prophet (ṣ). Allah revealed verses to clarify that whoever sincerely worshiped Allah from previous nations will be forgiven and admitted into Paradise.<\/p>\n<p>Salman al-Farisi reported: I asked the Prophet, peace and blessings be upon him, about the people of religion who had been with me, mentioning their prayers and acts of worship. Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَىٰ وَالصَّابِئِينَ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ<\/p>\n<p><b>Verily, those who have faith, those who are Jewish, Christian, or Sabians, whoever had faith in Allah and the Last Day and worked righteousness will have their reward with their Lord and they will not fear nor grieve.<\/b> (2:62)<\/p>\n<p>Source: Tafsīr Ibn Abī Ḥātim 2:62, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/03\/jews-christians-non-muslims-islam\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Another verse alludes to the fate of Christians who came after Jesus, peace be upon him, and mistakenly worshiped him instead of Allah alone. Allah confirms that it is His decision alone whether to punish or forgive them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِن تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ ۖ وَإِن تَغْفِرْ لَهُمْ فَإِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ<\/p>\n<p><strong>Jesus said: If You punish them, they are Your servants, but if You forgive them, You alone are the Almighty, the Wise.<\/strong><\/p>\n<p>Surat al-Ma&#8217;idah 5:118<\/p><\/blockquote>\n<p>Jesus leaves their fate to Allah alone, as perhaps they might have been sincere but confused, or they were denied access to the true revelation. For this reason, some scholars believed that many Christians and non-Muslims would be forgiven because they never had access to genuine Islamic teachings.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p align=\"right\">إن الرحمة تشمل كثيرا من الأمم السالفة وإن كان أكثرهم يعرضون على النار إما عرضة خفيفة حتى في لحظة أو في ساعة وإما في مدة حتى يطلق عليهم اسم بعث النار بل أقول إن أكثر نصارى الروم والترك في هذا الزمان تشملهم الرحمة إن شاء الله تعالى … بل سمعوا أيضا منذ الصبا أن كذابا ملبسا اسمه محمد ادعى النبوة<\/p>\n<p>I say that Allah’s mercy will encompass many bygone communities as well, even if most of them may be briefly exposed to the Hellfire for a second or an hour or some period of time, by virtue of which they earn the title “party of the Hellfire.” I would say, Allah willing, most Christians of Byzantium and the Turks of this age will be covered by Allah’s mercy&#8230; All they have heard since childhood was that some great liar carrying the name Muhammad claimed to be a prophet.<\/p>\n<p>Source: Fayṣal al-Tafriqah 12<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا مَنْ بَعُدَ عَهْدُهُ بِالْمَسِيحِ وَبَلَغَتْهُ بَعْضُ أَخْبَارِهِ دُونَ بَعْضٍ أَوْ بِمُوسَى وَبَلَغَهُ أَخْبَارُهُ دُونَ بَعْضٍ فَهَؤُلَاءِ قَامَتْ عَلَيْهِمُ الْحُجَّةُ بِمَا بَلَغَهُمْ مِنْ أَخْبَارِهِمْ دُونَ مَا لَمْ يَبْلُغْهُمْ مِنْ أَخْبَارِهِمْ وَإِذَا اخْتَلَفُوا فِي تَأْوِيلِ بَعْضِ التَّوْرَاةِ وَالْإِنْجِيلِ فَمَنْ قَصَدَ الْحَقَّ وَاجْتَهَدَ فِي طَلَبِهِ لَمْ يَجِبْ أَنْ يُعَذَّبَ وَإِنْ كَانَ مُخْطِئًا لِلْحَقِّ جَاهِلًا بِهِ ضَالًّا عَنْهُ كَالْمُجْتَهِدِ فِي طَلَبِ الْحَقِّ مِنْ أُمَّةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>As for one far from the era of the Messiah and some of his reports reached him to the exclusion of others, or from Moses and only some of his reports reached him, for these the proof has been established upon them to the extent that their reports reached them, without regard to those which did not reach them. If they disagree over the interpretation of some of the Torah and the Gospel, whoever aimed for the truth and strove in seeking it, he must not be punished even if he was mistaken in the truth due to ignorance or misguidance, like an erudite jurist (<em>mujtahid<\/em>) in seeking the truth from the nation of Muhammad, peace and blessings be upon him.<\/p>\n<p>Source: al-Jawāb al-Ṣaḥīḥ 2\/301-302<\/p><\/blockquote>\n<p>Those who commit outward acts of unbelief are not necessarily judged to be absolute disbelievers if they have an excuse. Ibn al-Qayyim holds the opinion, based upon the authentic tradition, that those who commit acts of unbelief due to honest ignorance will be forgiven.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p align=\"right\">وَأَمَّا جَحْدُ ذَلِكَ جَهْلًا أَوْ تَأْوِيلًا يُعْذَرُ فِيهِ صَاحِبُهُ فَلَا يُكَفَّرُ صَاحِبُهُ بِهِ كَحَدِيثِ الَّذِي جَحَدَ قُدْرَةَ اللَّهِ عَلَيْهِ وَأَمَرَ أَهْلَهُ أَنْ يَحْرِقُوهُ وَيَذْرُوهُ فِي الرِّيحِ وَمَعَ هَذَا فَقَدْ غَفَرَ اللَّهُ لَهُ وَرَحِمَهُ لِجَهْلِهِ إِذْ كَانَ ذَلِكَ الَّذِي فَعَلَهُ مَبْلَغَ عِلْمِهِ وَلَمْ يَجْحَدْ قُدْرَةَ اللَّهِ عَلَى إِعَادَتِهِ عِنَادًا أَوْ تَكْذِيبًا<\/p>\n<p>If one of these matters of faith is denied out of ignorance or misinterpretation, then he is excused and the one who did so does not become an unbeliever, as in the narration in which the man denied the providence of Allah and he commanded his people to burn him and scatter his ashes in the wind. Despite this error, Allah forgave the man and had mercy upon him because of his ignorance. The knowledge about the providence of Allah that had reached him was not denied out of stubbornness or an intention to lie.<\/p>\n<p>Source: Madārij al-sālikīn 1\/347<\/p><\/blockquote>\n<p>Although, in general, people who knowingly reject true Islam will go to Hellfire, it is not permissible to claim a specific individual is in Paradise or Hellfire except those explicitly named in the Quran and Sunnah. The Prophet (ṣ) told us that some people appear destined for Hellfire but in reality they enter Paradise, and vice versa.<\/p>\n<p>Sahl ibn Sa’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ<\/p>\n<p><strong>Verily, a man may appear to people as doing the deeds of the people of Paradise, yet he is among the people of Hellfire. Verily, a man may appear to people as doing the deeds of the people of Hellfire, yet he is among the people of Paradise.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2898, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/18\/qadr-cannot-tell-by-deeds-alone\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Jews, Christians, and non-Muslims are considered unbelievers in an outward sense because they do not practice Islam. They follow different religious laws and perform different rituals regarding prayers, funerals, burials, inheritance, and so on. We can only judge their outward deeds but not their hearts, so it is not permissible to declare a specific individual among them to be an absolute unbeliever or a dweller of Hellfire; only Allah knows their true situation. Rather, we should leave their matter to Allah alone.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ<\/p>\n<p><b>Verily, those who believe and those who are Jews, and the Sabians, and the Christians, and the Magians, and those who worship others besides Allah, verily Allah will judge between them on the Day of Resurrection, for Allah is a witness over all things.<\/b><\/p>\n<p>Surat al-Hajj 22:17<\/p><\/blockquote>\n<p>In sum, Allah retains the right to admit any person into Paradise despite how we might judge their outward deeds in this world. Some non-Muslims will come on the Day of Resurrection with a valid excuse for their rejection of Islam, while many others will be held accountable if they had access to the authentic message.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah will judge between them on the Day of Resurrection.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[61,18,21,26,319,135,32,34,151,48,50,100,54,134,115,45,98],"class_list":["post-13762","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-call-to-islam-dawah","tag-community-jamaah","tag-creed-aqidah","tag-forgiveness-al-maghfirah","tag-funerals-janazah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-ignorance-al-jahl","tag-justice-adl","tag-knowledge","tag-manners-al-adab","tag-mercy-al-rahmah","tag-paradise-jannah","tag-people-of-the-book","tag-quran-exegesis-tafsir","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3zY","jetpack-related-posts":[{"id":14832,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-use-profanity\/","url_meta":{"origin":13762,"position":0},"title":"Did Prophet Muhammad use profanity?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The believer does not use profanity...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13557,"url":"https:\/\/www.abuaminaelias.com\/suicide-bombings-in-islam\/","url_meta":{"origin":13762,"position":1},"title":"Suicide bombings are unlawful in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill yourselves. Verily, Allah is ever merciful to you.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":13762,"position":2},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17935,"url":"https:\/\/www.abuaminaelias.com\/the-muslims-will-split-into-seventy-three-sects\/","url_meta":{"origin":13762,"position":3},"title":"Muslims will split into seventy three sects","author":"Abu Amina Elias","date":"March 27, 2016","format":false,"excerpt":"\"Indeed, this splitting has happened due to the presence of aggression and hatred.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17588,"url":"https:\/\/www.abuaminaelias.com\/ignorance-tribalism-racism\/","url_meta":{"origin":13762,"position":4},"title":"Tribalism and racism is ignorance in Islam","author":"Abu Amina Elias","date":"January 10, 2016","format":false,"excerpt":"\"O you who believe, be persistently standing firm in justice...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13282,"url":"https:\/\/www.abuaminaelias.com\/islam-and-torture\/","url_meta":{"origin":13762,"position":5},"title":"Is torture allowed in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, Allah will torture those who torture people in this world.\" --Sahih Muslim 2613","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13762","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13762"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13762\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13762"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13762"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13762"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}