{"id":13792,"date":"2013-06-16T07:39:16","date_gmt":"2013-06-16T11:39:16","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13792"},"modified":"2020-07-18T08:31:21","modified_gmt":"2020-07-18T04:31:21","slug":"beware-of-hatred-and-malice-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/beware-of-hatred-and-malice-in-islam\/","title":{"rendered":"Malicious hatred is a spiritual disease in Islam"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>Islam teaches us to beware of hatred, malice, and the intention to harm others. They are spiritual diseases of the heart whose consequences are destructive to the individual, the community, and the religion.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا<\/p>\n<p><b>Do not hate each other, do not envy each other, do not turn away from each other, but rather be servants of Allah as brothers.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2559, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/10\/03\/brotherhood-means-to-reject-hate-envy-and-cruelty\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: It was said to the Messenger of Allah, “Which of the people is best?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَخْمُومِ الْقَلْبِ صَدُوقِ اللِّسَانِ<\/p>\n<p><strong>Everyone who is pure of heart and truthful in speech.<\/strong><\/p><\/blockquote>\n<p>They said, “Truthful in speech we know, but what is a pure heart?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُوَ التَّقِيُّ النَّقِيُّ لَا إِثْمَ فِيهِ وَلَا بَغْيَ وَلَا غِلَّ وَلَا حَسَدَ<\/p>\n<p><strong>It is a heart that fears Allah and is clean. There is no sin in it and neither aggression, malice, nor envy. <\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4216, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/18\/hadith-on-purity-a-pure-heart-is-one-free-of-aggression-rancor-and-envy\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Al-Samarqandī reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَرُوِيَ عَنْ بَعْضِ الصَّحَابَةِ رَضِيَ اللَّهُ تَعَالَى عَنْهُمْ أَنَّهُ قَالَ مَنْ أَرَادَ فَضْلَ الْعَابِدِينَ فَلْيُصْلِحْ بَيْنَ النَّاسِ وَلَا يُوقِعْ بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ<\/p>\n<p>Some of the companions, may Allah be pleased with him, said: Whoever desires the virtue of the worshipers, then let him reconcile between people and let there not be any enmity and hatred between them.<\/p>\n<p>Source: Tanbīh al-Ghāfilīn 1\/184<\/p><\/blockquote>\n<p>Ibn Al-Arabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَكُونُ الْقَلْبُ سَلِيمًا إذَا كَانَ حَقُودًا حَسُودًا مُعْجَبًا مُتَكَبِّرًا وَقَدْ شَرَطَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْإِيمَانِ أَنْ يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p>The heart cannot be pure if it holds malice, envy, pride, and arrogance. The Prophet made it a requirement of faith that he love for his brother what he loves for himself.<\/p>\n<p>Source: Aḥkām al-Qurʼān 26:89<\/p><\/blockquote>\n<p>And Ibn Hajar writes:<\/p>\n<blockquote>\n<p align=\"right\">وَلَا يَتِمُّ ذَلِكَ إِلَّا بِتَرْكِ الْحَسَدِ وَالْغِلِّ وَالْحِقْدِ وَالْغِشِّ<\/p>\n<p>Faith is not complete until a Muslim abandons envy, rancor, malice, and malevolence.<\/p>\n<p>Source: Fatḥ al-Bārī 1\/74<\/p><\/blockquote>\n<p>The type of hatred prohibited in Islam is malicious hatred in the form of a desire to see people harmed and destroyed.<\/p>\n<p>Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ يَكُنْ حُبُّكَ كَلَفًا وَلاَ بُغْضُكَ تَلَفًا<\/p>\n<p>Let not your hatred be destruction.<\/p><\/blockquote>\n<p>It was said, &#8220;How is that?&#8221; Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا أَبْغَضْتَ أَحْبَبْتَ لِصَاحِبِكَ التَّلَف‏<\/p>\n<p>When you hate someone, you love to see your companion destroyed.<\/p>\n<p>Source: al-Adab al-Mufrad 1322, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/03\/umar-on-moderation-let-not-your-love-be-infatuation-and-let-not-your-hatred-be-destruction\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Shuʻaib Arnāʼūṭ writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التباغض من البغض ضد المحبة وهي إرادة المضرة<\/p>\n<p>Mutual hatred, the opposite of love, is an intention to do harm.<\/p>\n<p>Source: Sharḥ al-Musnad 13\/160<\/p><\/blockquote>\n<p>This malicious hatred is a major sin that prevents people from entering Paradise.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ لَا يُشْرِكُ بِاللَّهِ شَيْئًا إِلَّا رَجُلًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا<\/p>\n<p><strong>The gates of Paradise are opened on Monday and Thursday. Allah forgives every servant who does not associate anything with him except a man with hatred between himself and his brother. It will be said: Delay these two until they reconcile, delay these two until they reconcile.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2565, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/14\/hadith-on-rancor-they-will-not-enter-paradise-until-they-remove-rancor-from-their-hearts-and-then-reconcile\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلاثٌ مَنْ لَمْ يَكُنْ فِيهِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يَغْفِرُ بَعْدَ ذَلِكَ لِمَنْ يَشَاءُ مَنْ مَاتَ لا يُشْرَكُ بِاللَّهِ شَيْئًا وَمَنْ لَمْ يَكُنْ سَاحِرًا يَتْبَعُ السِّحْرَ وَمَنْ لَمْ يَحْقِدْ عَلَى أَخِيهِ<\/p>\n<p>If these three sins are not found within a person, then Allah the Exalted will forgive after that whatever he wills: one who died without associating partners with Allah, one who never turned to black magic, and one who never harbored malice towards his brother.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/09\/ibn-abbas-on-malice-allah-may-not-forgive-those-who-harbor-malice-against-others\/\">Shu’ab al-Imān 6103<\/a><\/p><\/blockquote>\n<p>Islam teaches us not to hate people in themselves, but rather we should hate for evil to come to people. This is a necessary element of <a href=\"https:\/\/abuaminaelias.com\/golden-rule-in-islam-love-for-humanity-what-you-love-for-yourself\/\">loving our neighbors as ourselves<\/a>.<\/p>\n<p>Yazeed ibn Asad reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ<\/p>\n<p><strong>Love for people what you love for yourself.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16220, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/09\/hadith-on-justice-if-you-want-to-be-just-then-love-people-as-yourself\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Mu’adh ibn Anas reported: He asked the Messenger of Allah, peace and blessings be upon him, about the best faith. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">أَفْضَلُ الْإِيمَانِ أَنْ تُحِبَّ لِلَّهِ وَتُبْغِضَ فِي اللَّهِ وَتُعْمِلَ لِسَانَكَ فِي ذِكْرِ اللَّهِ<\/p>\n<p><b>The most virtuous faith is to love for the sake of Allah, to hate for the sake of Allah, and to work your tongue in the remembrance of Allah.<\/b><\/p><\/blockquote>\n<p>Mu’adh said, “How is it, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَنْ تُحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ وَتَكْرَهَ لَهُمْ مَا تَكْرَهُ لِنَفْسِكَ وَأَنْ تَقُولَ خَيْرًا أَوْ تَصْمُتَ<\/p>\n<p><b>That you love for the people what you love for yourself, and you hate for the people what you hate for yourself, and you speak goodness or remain silent.<\/b><\/p>\n<p>Source: Musnad Aḥmad 21627, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/24\/hadith-on-faith-the-best-faith-is-to-love-good-for-others-to-hate-evil-others-and-righteous-speech\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Al-Kirmani said:<\/p>\n<blockquote>\n<p align=\"right\">وَمِنَ الْإِيمَانِ أَيْضًا أَنْ يُبْغِضَ لِأَخِيهِ مَا يُبْغِضُ لِنَفْسِهِ مِنَ الشَّرِّ<\/p>\n<p>It is also a part of faith to hate for his brother what he hates for himself of evil.<\/p>\n<p>Source: Fatḥ al-Bārī 1\/74<\/p><\/blockquote>\n<p>Another way to understand this is that we should hate sinful deeds, but we should not hate the sinners themselves.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ أُولَٰئِكَ هُمُ الرَّاشِدُونَ<\/p>\n<p><b>Allah has made hateful to you disbelief, defiance, and disobedience. Those are the rightly guided.<\/b><\/p>\n<p>Surat al-Hujurat 49:7<\/p><\/blockquote>\n<p>Hence, Allah has made it a condition of faith to hate evil deeds, but He does not command us hate the people who do them. This is called hatred for the deed (<i>karrahiya li amal<\/i>). This places our hatred toward the abstract evil in a constructive manner so as to avoid unjustly harming people. A group of the righteous predecessors (<i>salaf as-salih<\/i>) would make such a distinction between the deed and the doer.<\/p>\n<p>Ibn Rajab reported:<\/p>\n<blockquote>\n<p align=\"right\">قَالَ بَعْضُ الصَّالِحِينَ مِنَ السَّلَفِ أَهْلُ الْمَحَبَّةِ لِلَّهِ نَظَرُوا بِنُورِ اللَّهِ وَعَطَفُوا عَلَى أَهْلِ مَعَاصِي اللَّهِ مَقَتُوا أَعْمَالَهُمْ وَعَطَفُوا عَلَيْهِمْ لِيُزِيلُوهُمْ بِالْمَوَاعِظِ عَنْ فِعَالِهِمْ<\/p>\n<p>Some of the righteous predecessors said: The people who love Allah look by the light of Allah, and they are compassionate with those who disobey Allah. They find their deeds reprehensible but show mercy to them so that through their admonitions they might leave their actions.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">Jāmi’ al-‘Ulūm wal-Ḥikam 13<\/a><\/p><\/blockquote>\n<p>Allah has warned us about the destructive effects of hatred on the heart and the religion and that it will lead to injustice if left unchecked.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ<\/p>\n<p><strong>O you who believe, be persistently standing firm for Allah as witnesses in justice, and let not the hatred of a people prevent you from being just. Be just, for it is closer to righteousness.<\/strong><\/p>\n<p>Surat al-Ma&#8217;idah 5:8<\/p><\/blockquote>\n<p>Likewise, the Prophet warned us about the twin evils of envy and hatred, describing hatred as the razor that attacks religion. The soundness of a Muslim&#8217;s religious practice will be in danger if he or she succumbs to hateful desires.<\/p>\n<p>Az-Zubair ibn Awwam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَبَّ إِلَيْكُمْ دَاءُ الْأُمَمِ قَبْلَكُمْ الْحَسَدُ وَالْبَغْضَاءُ وَالْبَغْضَاءُ هِيَ الْحَالِقَةُ حَالِقَةُ الدِّينِ لَا حَالِقَةُ الشَّعَرِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلَا أُنَبِّئُكُمْ بِشَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><b>There have come to you the diseases of the nations before you: envy and hatred, and hatred is the razor. It shaves the religion and it does not shave hair. By the one in whose hand is the soul of Muhammad, you will not believe until you love one another. Shall I tell you something which, if you did, you would love each other? Spread peace between yourselves.<\/b><\/p>\n<p>Source: Musnad Aḥmad 1415, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-hatred-beware-the-disease-of-hatred-which-afflicted-the-previous-nations-and-destroyed-their-religion\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ لا تَدْخُلُوا الْجَنَّةَ حَتَّى تُسْلِمُوا وَلا تُسْلِمُوا حَتَّى تَحَابُّوا وَأَفْشُوا السَّلامَ تَحَابُّوا وَإِيَّاكُمْ وَالْبُغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ لا أَقُولُ لَكُمْ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ<\/p>\n<p><strong>By the one in whose hand is my soul, you will not enter Paradise until you submit to Allah and you will not submit until you love one another. Spread peace and you will love one another. Beware of hatred for it is the razor. I do not say that it shaves hair, but rather it shaves away the religion.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 260, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/02\/spread-love-and-peace-beware-of-hatred\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>The correct way to purify our hearts from hatred is to pray for guidance and goodness for the oppressors whom we hate. By doing so, the angel will pray for similar goodness for us.<\/p>\n<p>Abu Ad-Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لأَخِيهِ بِظَهْرِ الْغَيْبِ إِلاَّ قَالَ الْمَلَكُ وَلَكَ بِمِثْلٍ<\/p>\n<p><b>There is no Muslim servant who supplicates for his brother behind his back except that the angel says: And for you the same.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2732, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/01\/hadith-on-supplication-the-virtue-of-praying-for-your-brother-behind-their-back\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ<\/p>\n<p><strong>O boy, if you are able every morning and evening to remove any rancor from your heart towards anyone, then do so.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2678, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/17\/hadith-on-hatred-o-boy-make-sure-your-heart-is-purified-from-rancor-envy-and-malice\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>We should never pray for evil or destruction, nor should we invoke the wrath of Allah and the Hellfire.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَيَدْعُ الْإِنسَانُ بِالشَّرِّ دُعَاءَهُ بِالْخَيْرِ ۖ وَكَانَ الْإِنسَانُ عَجُولًا<\/p>\n<p><b>Man supplicates for evil as he supplicates for good, for man is ever impatient.<\/b><\/p>\n<p>Surat al-Isra 17:11<\/p><\/blockquote>\n<p>Samrah ibn Jundab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَلَاعَنُوا بِلَعْنَةِ اللَّهِ وَلَا بِغَضَبِهِ وَلَا بِالنَّارِ<\/p>\n<p><b>Do not invoke the curse of Allah, or His wrath, or the Hellfire.<\/b><\/p>\n<p>Source: Sunan al-Tirmidhī 1976, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/24\/hadith-on-curses-do-not-invoke-the-curse-of-allah-or-his-wrath-or-the-hellfire\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Therefore, all of our supplications should be for goodness. By supplicating for goodness and guidance for sinners, we will overcome our desire to cause them harm and replace this evil desire with love of goodness for them.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Hatred is the razor, it shaves the religion and it does not shave hair.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[61,16,18,105,30,135,32,48,52,311,55,93,56,59,60,103,91,98,179],"class_list":["post-13792","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-call-to-islam-dawah","tag-character-akhlaq","tag-community-jamaah","tag-envy-al-hasad","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-justice-adl","tag-love-al-mahabbah","tag-malice-hiqd","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-peace","tag-prayer-salat","tag-public-welfare-al-maslaha","tag-righteous-predecessors-al-salaf-al-salih","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3As","jetpack-related-posts":[{"id":18417,"url":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","url_meta":{"origin":13792,"position":0},"title":"Praying for enemies in Islam","author":"Abu Amina Elias","date":"November 2, 2016","format":false,"excerpt":"\"I was not sent to invoke curses, but rather I was only sent as mercy.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18033,"url":"https:\/\/www.abuaminaelias.com\/beware-of-envy-and-hatred\/","url_meta":{"origin":13792,"position":1},"title":"Beware of envy and hatred, destroyer of good deeds","author":"Abu Amina Elias","date":"April 12, 2016","format":false,"excerpt":"\"Envy consumes good deeds just as fire burns wood,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20451,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-hatred-malice-boycotting\/","url_meta":{"origin":13792,"position":2},"title":"Imam al-Mundhiri on Mutual-Hatred, Grudges, and Boycotting","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Do not hate each other, do not envy each other,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14732,"url":"https:\/\/www.abuaminaelias.com\/do-not-desire-to-fight-the-enemies-of-islam\/","url_meta":{"origin":13792,"position":3},"title":"Do not desire to fight the enemies of Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not wish to meet the enemy, but if you meet them, then be steadfast.\" --Sahih Bukhari 2863","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13188,"url":"https:\/\/www.abuaminaelias.com\/muslims-hate-infidels-neighbors\/","url_meta":{"origin":13792,"position":4},"title":"Are Muslims supposed to hate the infidels?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13845,"url":"https:\/\/www.abuaminaelias.com\/purification-heart-and-soul\/","url_meta":{"origin":13792,"position":5},"title":"Purification of the heart and soul in Islam","author":"Abu Amina Elias","date":"June 28, 2013","format":false,"excerpt":"\"He has succeeded who purifies himself...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13792","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13792"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13792\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13792"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13792"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13792"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}