{"id":13813,"date":"2013-06-17T08:51:00","date_gmt":"2013-06-17T12:51:00","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13813"},"modified":"2020-07-17T22:09:00","modified_gmt":"2020-07-17T18:09:00","slug":"golden-rule-in-islam-love-humanity","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/golden-rule-in-islam-love-humanity\/","title":{"rendered":"Golden rule in Islam: Love for humanity what you love for yourself"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The golden rule, or the ethics of reciprocity, is an Islamic moral principle that calls upon Muslims to treat others the way they would like to be treated. According to the Oxford Dictionary of Philosophy, the golden rule is defined as follows:<\/p>\n<blockquote><p>Any form of the dictum: Do unto others as you would have them do unto you. In some form this is found in almost all religions and ethical systems.<\/p>\n<p>Source: Blackburn, Simon. “Golden Rule.”<\/p><\/blockquote>\n<p>This principle was stated several times by our Prophet, so Muslims should use it as a point of agreement when sharing Islam with people of other religions. In fact, An-Nawawi states that this principle is the <a href=\"https:\/\/abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/\">root of all good character and manners<\/a>.<\/p>\n<p>The primary expression of this teaching is stated in the following authoritative tradition:<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 13, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/18\/love-for-all-people-what-you-love-for-yourself\/\"><em><strong>Muttafaqun <\/strong><\/em><em><strong>Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Many scholars interpreted &#8220;brother&#8221; in this and other traditions to mean universal brotherhood that includes all of humanity.<\/p>\n<p>An-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p align=\"right\"> الأولى أن يحمل ذلك على عموم الأخوة حتى يشمل الكافر والمسلم فيحب لأخيه الكافر ما يحب لنفسه من دخوله في الإسلام كما يحب لأخيه المسلم دوامه على الإسلام ولهذا كان الدعاء بالهداية للكافر مستحبا والمراد بالمحبة إرادة الخير والمنفعة ثم المراد المحبة الدينية لا المحبة البشرية<\/p>\n<p>This is interpreted as brotherhood in general, such that it includes the disbeliever and the Muslim. So he should love for his brother, the disbeliever, what he loves for himself which is his entering Islam, just as he should love for his brother Muslim that he remains in Islam. For this reason, it is recommended to supplicate for the disbeliever to be guided. The meaning of love here is an intention for good and benefit, and this meaning is religious love, not human love.<\/p>\n<p>Source: Sharḥ al-Arba’īn 13<\/p><\/blockquote>\n<p>And Ibn Hajar Al-Haytami writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والذي يظهر أن تعبيره بالأخ جري على الغالب لأنه ينبغي لكل مسلم أن يحب للكفار الإسلام وما يتفرع عليه من الكمالات &#8230; قوله يحب لنفسه أي من الخير فيكون معه كالنفس الواحدة<\/p>\n<p>What is apparent is that the use of the word brother is based upon its widest meaning, such that it is befitting for every Muslim to love for the unbeliever to have Islam and the virtues that derive from it&#8230; His saying to love for himself means of what is good, so that he will be together with them as if they were one person.<\/p>\n<p>Source: al-Fatḥ al-Mubīn 1\/305<\/p><\/blockquote>\n<p>And Hamza Muhammad Qasim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأولى أن يحمل قوله حتى يحب لأخيه على عموم الأخوة حتى يشمل الكافر و المسلم فيحب لأخيه الكافر ما يحب لنفسه من الدخول في الإسلام ولذلك ندب الدعاء له بالهداية وقد كان النبي صلى الله عليه وسلم يدعو لكفار قريش بالخير و يحبه لهم و يقول اللهم اهد قومي فإنهم لا يعلمون ومما يؤكد أن المراد محبة الخير للناس جميعاً لا فرق بين مسلم وكافر قوله صلى الله عليه وسلم أفضل الإيمان أن تحب للناس ما تحب لنفسك و تكره لهم ما تكره لنفسك<\/p>\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5;\">The Prophet&#8217;s saying to love for his brother what he loves for himself is interpreted as universal brotherhood, such that it includes the disbeliever and the Muslim, and he should love for his brother the disbeliever what he loves for himself which is his entering Islam. For this reason it is recommended to supplicate for their guidance. The Prophet invited the unbelievers of the Quraish to goodness and he loved good for them. He would say: O Allah, guide my people for they do not know. This confirms that the meaning is to love good for all people. There is no difference between a Muslim and a disbeliever in his saying that the best faith is to love for people what you love for yourself and to hate for people what you hate for yourself.<\/span><\/p>\n<p>Source: Manār al-Qārī 1\/91<\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother or his neighbor what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 45, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">وَالَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ عَبْدٌ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ مِنْ الْخَيْرِ<\/p>\n<p><strong>By Him in whose Hand is my soul, a servant does not believe until he loves for his brother what he loves for himself of goodness.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 5017, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/05\/hadith-on-brotherhood-until-he-loves-goodness-for-his-brother\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَجِدُ أَحَدٌ حَلَاوَةَ الْإِيمَانِ حَتَّى يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ<\/p>\n<p><strong>None of you will find the sweetness of faith until he loves a person only for the sake of Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5694, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/06\/17\/hadith-on-faith-the-sweetness-of-faith-is-to-love-allah-his-messenger-and-the-people\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ وَحَتَّى يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ عَزَّ وَجَلَّ<\/p>\n<p><strong>None of you has faith until he loves for the people what he loves for himself, and until he loves a person only for the sake of Allah the Exalted.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 13463, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/11\/26\/hadith-on-faith-until-he-loves-for-the-people-what-he-loves-for-himself\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لا يَبْلُغُ عَبْدٌ حَقِيقَةَ الإِيمَانِ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ مِنَ الْخَيْرِ<\/p>\n<p><strong>The servant does not reach the reality of faith until he loves for the people what he loves for himself of goodness.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 238, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-love-the-servant-does-not-reach-true-faith-until-he-loves-others-for-the-sake-of-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The reference to &#8220;people&#8221; in this and other versions of this tradition indicate that this principle applies to all of humanity.<\/p>\n<p>Al-Munawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولفظ الناس يشمل الكفار فينبغي لكل مسلم أن يحب للكافر الإسلام وما يتفرع عليه من الكمالات<\/p>\n<p>The use of the word people includes the unbeliever, so it is befitting for every Muslim to love for the unbeliever to have Islam and the virtues that derive from it.<\/p>\n<p>Source: Fayḍ al-Qadīr 1\/228<\/p><\/blockquote>\n<p>There are many traditions on the authority of several companions in which the Prophet taught us to treat people the way we would love to be treated, to hate for evil things to happen to others, and to spread peace on earth.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ أَحَبَّ أَنْ يُزَحْزَحَ عَنْ النَّارِ وَيَدْخُلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَنِيَّتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><strong>Whoever would love to be delivered from the Hellfire and entered into Paradise, then let him die with faith in Allah and the Last Day, and let him treat the people the way he would love to be treated.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1844, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/10\/hadith-on-salvation-let-him-treat-the-people-the-way-he-would-love-to-be-treated\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>An-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا مِنْ جَوَامِعِ كَلِمِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَدِيعِ حِكَمِهِ وَهَذِهِ قَاعِدَةٌ مُهِمَّةٌ فَيَنْبَغِي الِاعْتِنَاءُ بِهَا وَأَنَّ الْإِنْسَانَ يَلْزَمُ أَلَّا يَفْعَلَ مَعَ النَّاسِ إِلَّا مَا يُحِبُّ أَنْ يَفْعَلُوهُ مَعَهُ<\/p>\n<p>This is among the comprehensive sayings of the Prophet, his marvelous wisdom, and an important rule. It deserves to be given close attention, that the human being must not deal with people except in a way he would love to be treated by them.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 1844<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><strong>You will not enter Paradise until you believe and you will not believe until you love each other. Shall I show you something that, if you did, you would love each other? Spread peace between yourselves.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 54, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/16\/hadith-on-love-you-will-not-enter-paradise-until-you-love-each-other-for-the-sake-of-allah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">وَالَّذِي نَفْسِي بِيَدِهِ لا تَدْخُلُوا الْجَنَّةَ حَتَّى تُسْلِمُوا وَلا تُسْلِمُوا حَتَّى تَحَابُّوا  وَأَفْشُوا السَّلامَ تَحَابُّوا وَإِيَّاكُمْ وَالْبُغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ لا أَقُولُ لَكُمْ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ<\/p>\n<p><strong>By the one in whose hand is my soul, you will not enter Paradise until you submit, and you will not submit until you love one another. Greet each other with peace and you will love one another. Beware of hatred, for it is the razor. I do not say it shaves hair, but rather it shaves away the religion.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 260, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/02\/spread-love-and-peace-beware-of-hatred\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ تَكُنْ مُؤْمِنًا وَأَحْسِنْ جِوَارَ مَنْ جَاوَرَكَ تَكُنْ مُسْلِمًا<\/p>\n<p><strong>Love for the people what you love for yourself and you will be a believer. Behave well with your neighbors and you will be a Muslim.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4217, Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/05\/hadith-on-asceticism-love-good-for-people-be-content-with-islam-be-a-good-neighbor-and-laugh-less\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَحْسِنْ إِلَى جَارِكَ تَكُنْ مُؤْمِنًا وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ تَكُنْ مُسْلِمًا<\/p>\n<p><strong>Be kind to your neighbor and you will be a believer. Love for the people what you love for yourself and you will be a Muslim.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2305, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/10\/hadith-on-love-love-for-people-what-you-love-for-yourself-and-you-will-be-a-muslim\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَأَلَ مُوسَى رَبَّهُ وقَالَ فَأَيُّ عِبَادِكَ أَحْكُمُ قَالَ الَّذِي يَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ قَالَ فَأَيُّ عِبَادِكَ أَعَزُّ قَالَ الَّذِي إِِذَا قَدَرَ غَفَرَ<\/p>\n<p style=\"text-align: left;\"><strong style=\"line-height: 1.5;\">Moses said: Who is the best in judgment of your servants? Allah said: Those who judge people as they would love to be judged themselves. Moses said: Who are the most honored of your servants? Allah said: Those who forgive when they have power over others.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 6352, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/07\/hadith-on-forgiveness-the-most-honorable-act-of-worship-is-forgiveness\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Az-Zubair ibn Awwam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">دَبَّ إِلَيْكُمْ دَاءُ الْأُمَمِ قَبْلَكُمْ الْحَسَدُ وَالْبَغْضَاءُ هِيَ الْحَالِقَةُ لَا أَقُولُ تَحْلِقُ الشَّعَرَ وَلَكِنْ تَحْلِقُ الدِّينَ وَالَّذِي نَفْسِي بِيَدِهِ لَا تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلَا أُنَبِّئُكُمْ بِمَا يُثَبِّتُ ذَاكُمْ لَكُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><strong>There have come to you the diseases of the nations before you: envy and hatred, and hatred is the razor. It shaves the religion and it does not shave hair. By the one in whose hand is the soul of Muhammad, you will not believe until you love one another. Shall I tell you something which, if you did, you would love each other? Spread peace between yourselves.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 1415, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-hatred-beware-the-disease-of-hatred-which-afflicted-the-previous-nations-and-destroyed-their-religion\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Al-Muntafiq reported: He said, “O Messenger of Allah, teach me what will save me from Allah’s punishment and enter me into Paradise.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">اعْبُدِ اللَّهَ وَلا تُشْرِكْ بِهِ شَيْئًا وَأَقِمِ الصَّلاةَ الْمَكْتُوبَةَ وَأَدِّ الزَّكَاةَ الْمَفْرُوضَةَ وَحُجَّ وَاعْتَمِرْ وَأَظُنُّهُ قَالَ وَصُمْ رَمَضَانَ وَانْظُرْ مَا تُحِبُّ لِلنَّاسِ أَنْ يَأْتُوهُ إِلَيْكَ فَافْعَلْهُ بِهِمْ وَمَا تَكْرَهُ أَنْ يَأْتُوهُ إِلَيْكَ فَذَرْهُمْ مِنْهُ<\/p>\n<p><strong>Worship Allah and do not associate anything with Him. Establish the prescribed prayers, give the obligatory charity,<\/strong> <strong>fast the month of Ramadan. However you love for the people to treat you, then treat them that way. However you hate for the people to treat you, then do not treat them that way.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 15833, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-manners-treat-people-the-way-you-would-love-to-be-treated-and-you-will-enter-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Yazeed ibn Asad reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا يَزِيدُ أَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ<\/p>\n<p><strong>O Yazeed, love for people what you love for yourself.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16220, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/09\/hadith-on-justice-if-you-want-to-be-just-then-love-people-as-yourself\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">أَتُحِبُّ الْجَنَّةَ<\/p>\n<p><strong>Do you love Paradise?<\/strong><\/p><\/blockquote>\n<p>Yazeed said yes. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">فَأَحِبَّ لِأَخِيكَ مَا تُحِبُّ لِنَفْسِكَ<\/p>\n<p><strong>Then love for your brother what you love for yourself.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16219, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/10\/hadith-on-love-do-you-love-paradise-then-love-your-brothers-and-sisters\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Al-Mughirah reported: I said, “O Messenger of Allah, tell me about a deed that will bring me near Paradise and distance me from the Hellfire.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">تُقِيمُ الصَّلَاةَ وَتُؤْتِي الزَّكَاةَ وَتَحُجُّ الْبَيْتَ وَتَصُومُ رَمَضَانَ وَتُحِبُّ لِلنَّاسِ مَا تُحِبُّ أَنْ يُؤْتَى إِلَيْكَ وَتَكْرَهُ لَهُمْ مَا تَكْرَهُ أَنْ يُؤْتَى إِلَيْكَ<\/p>\n<p><strong>Establish the prayer, give the charity, perform pilgrimage to the House, fast the month of Ramadan, and love for people what you would love for yourself, and hate for people what you would hate for yourself.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 15453, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/20\/hadith-on-love-love-for-the-people-what-you-love-for-yourself-and-hate-for-the-people-what-you-hate-for-yourself\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَأْتِهِ مَنِيَّتُهُ وَهُوَ يَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><strong>Whoever has faith in Allah and the Last Day, then let him meet his end while he treats people the way he would love to be treated.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 10370, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/12\/hadith-on-faith-let-him-treat-people-the-way-he-would-love-to-be-treated\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Mu’adh ibn Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَفْضَلُ الْإِيمَانِ أَنْ تُحِبَّ لِلَّهِ وَتُبْغِضَ فِي اللَّهِ وَتُعْمِلَ لِسَانَكَ فِي ذِكْرِ اللَّهِ<\/p>\n<p><strong>The best faith is to love for the sake of Allah, to hate for the sake of Allah, and to work your tongue in the remembrance of Allah.<\/strong><\/p><\/blockquote>\n<p>Mu’adh said, “How is it, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَنْ تُحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ وَتَكْرَهَ لَهُمْ مَا تَكْرَهُ لِنَفْسِكَ وَأَنْ تَقُولَ خَيْرًا أَوْ تَصْمُتَ<\/p>\n<p><strong>That you love for the people what you love for yourself, and you hate for the people what you hate for yourself, and that you speak goodness or remain silent.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 21627, Grade: <strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/24\/hadith-on-faith-the-best-faith-is-to-love-good-for-others-to-hate-evil-others-and-righteous-speech\/\"><i>Sahih li ghayri<\/i><\/a><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَدْرُونَ مَنْ السَّابِقُونَ إِلَى ظِلِّ اللَّهِ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Do you know who are the foremost to the shade of Allah the Exalted on the Day of Resurrection?<\/strong><\/p><\/blockquote>\n<p>They said, “Allah and his Messenger knows best.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الَّذِينَ إِذَا أُعْطُوا الْحَقَّ قَبِلُوهُ وَإِذَا سُئِلُوهُ بَذَلُوهُ وَحَكَمُوا لِلنَّاسِ كَحُكْمِهِمْ لِأَنْفُسِهِمْ<\/p>\n<p><strong>They are those who accept the truth when they receive it, who offer the truth when they are asked for it, and who judge people the way they judge themselves.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 23858, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/16\/hadith-on-judgement-the-foremost-are-those-who-judge-others-the-way-they-want-to-be-judged\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>An-Nu’man ibn Basheer reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمُونَ كَرَجُلٍ وَاحِدٍ إِنْ اشْتَكَى عَيْنُهُ اشْتَكَى كُلُّهُ وَإِنْ اشْتَكَى رَأْسُهُ اشْتَكَى كُلُّهُ<\/p>\n<p><strong>The Muslims are like a single man. If the eye is afflicted, then the whole body is afflicted. If the head is afflicted, then the whole body is afflicted.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2586, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/09\/hadith-on-brotherhood-the-muslims-are-like-one-body-in-their-love-of-each-other\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Al-Halimi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَذَلِكَ يَنْبَغِي أَنْ يَكُونُوا وَكَمَا لا يُحِبُّ أَحَدٌ لإِحْدَى يَدَيْهِ إِلا مَا يُحِبُّ لِلأُخْرَى وَلا لإِحْدَى عَيْنَيْهِ أَوْ رِجْلَيْهِ أَوْ أُذُنَيْهِ إِلا مَا يُحِبُّ لِلأُخْرَى فَكَذَلِكَ يَنْبَغِي لَهُ أَنْ لا يُحِبَّ لأَخِيهِ الْمُسْلِمِ إِلا مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p>It is befitting for them to be like that. As one hand would not love but what the other loves, and one eye or one leg or one ear would not love but what the other loves. Likewise, he should not love for his Muslim brother except what he loves for himself.<\/p>\n<p>Source: Shu’b al-Imān 10379<\/p><\/blockquote>\n<p>Ali ibn Abi Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتَّةٌ بِالْمَعْرُوفِ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَعُودُهُ إِذَا مَرِضَ وَيَتْبَعُ جِنَازَتَهُ إِذَا مَاتَ وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>A Muslim has six rights over another Muslim regarding good conduct: to greet him with peace when he meets him, to respond to his invitation, to respond to his sneeze, to visit him when he is sick, to follow his funeral prayer when he dies, and to love for him what he loves for himself.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2736, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/03\/25\/hadith-on-rights-a-muslims-right-is-for-you-to-love-for-him-what-you-love-for-yourself\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Umamah reported: A young man came to the Prophet, peace and blessings be upon him, and he said, “O Messenger of Allah, give me permission to commit adultery.”  The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتُحِبُّهُ لِأُمِّكَ<\/p>\n<p><strong>Would you like that for your mother?<\/strong><\/p><\/blockquote>\n<p>The man said, “No, by Allah, may I be sacrificed for you. People would not like it for their mothers.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفَتُحِبُّهُ لِابْنَتِكَ<\/p>\n<p><strong>Would you like that for your daughter?<\/strong><\/p><\/blockquote>\n<p>The man said, “No, by Allah, may I be sacrificed for you. People would not like it for their daughters.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفَتُحِبُّهُ لِأُخْتِكَ<\/p>\n<p><strong>Would you like that for your sister?<\/strong><\/p><\/blockquote>\n<p>The man said, “No, by Allah, may I be sacrificed for you. People would not like it for their sisters.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفَتُحِبُّهُ لِعَمَّتِكَ<\/p>\n<p><strong>Would you like that for your aunts?<\/strong><\/p><\/blockquote>\n<p>The man said, “No, by Allah, may I be sacrificed for you. People would not like it for their aunts.” The Prophet placed his hand on him and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ ذَنْبَهُ وَطَهِّرْ قَلْبَهُ وَحَصِّنْ فَرْجَهُ<\/p>\n<p><strong>O Allah, forgive his sins, purify his heart, and guard his chastity.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 21708, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/05\/09\/hadith-on-adultery-would-you-like-that-for-your-mother-or-sister\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>In another narration, the Prophet said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاكْرَهْ مَا كَرِهَ اللَّهُ وَأَحِبَّ لأَخِيكَ مَا تُحِبُّ لِنَفْسِكَ<\/p>\n<p><strong>Then hate what Allah has hated, and love for your brother what you love for yourself.<\/strong><\/p>\n<p>Source: Sunan al-Kubrā 17025, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>Abu Dharr reported: I said, “O Messenger of Allah, will you not appoint me as a leader?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَبَا ذَرٍّ إِنِّي أَرَاكَ ضَعِيفًا وَإِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لَا تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلَا تَوَلَّيَنَّ مَالَ يَتِيمٍ<\/p>\n<p><strong>O Abu Dharr, I see you are weak and I love for you what I love for myself. Do not command even two people and do not manage the property of an orphan.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1825, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/04\/hadith-on-leadership-authority-is-a-public-trust-which-should-not-be-sought-unless-by-necessity\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>All of these traditions and others led to the development among the righteous predecessors (<em>as-salaf as-salih<\/em>) of the principle that Muslims should <a href=\"https:\/\/abuaminaelias.com\/love-the-sinner-hate-the-sin-in-islam\/\">hate sin but love the sinner<\/a>.<\/p>\n<p>Anas ibn Malik reported: I went out with a man to the market and some merchandise was being sold, so I bartered with him. The seller said, “Thirty coins.” The man thought to himself and said, “I will take it for forty coins.” The seller said, “What makes you say this when I would give it to you for less?” The man thought to himself again and he said, “I will take it for fifty coins.” The seller said, “What makes you say this when I would give it to you for less?” The man said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُؤْمِنُ عَبْدٌ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ وَأَنَا أَرَى أَنَّهُ صَالِحٌ بِخَمْسِينَ<\/p>\n<p>I heard the Messenger of Allah, peace and blessings be upon him, say that a servant does not have faith until he loves for his brother what he loves for himself, and I thought you would do better with fifty coins.<\/p>\n<p>Source: Musnad al-Bazzār 7548, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/19\/hadith-on-brotherhood-the-man-who-loved-the-seller-and-give-him-more-than-he-asked-for\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ammar ibn Nusair reported: Jesus the son of Mary, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَابْنَ آدَمَ كُنْ وَدِيعًا يُحِبَّكَ النَّاسُ وَارْضَ بِمَا قَسَمَ اللَّهُ لَكَ تَكُنْ أَغْنَى النَّاسِ وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ تَكُنْ مُؤْمِنًا وَلا تُؤْذِ جَارَكَ تَكُنْ مُسْلِمًا وَلا تُكْثِرِ الضَّحِكَ فَإِنَّهُ يُمِيتُ الْقَلْبَ<\/p>\n<p>O son of Adam, be disinterested in what people own and they will love you, be content with what Allah has allotted for you and you will be the wealthiest of people, love for people what you love for yourself and you will be a believer, do not harm your neighbor and you will be a Muslim, and do not laugh too much as it will deaden the heart.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/17\/jesus-on-love-blessed-is-he-who-loves-for-people-what-he-loves-for-himself\/\">Tārīkh Dimashq 51199<\/a><\/p><\/blockquote>\n<p>Ibn Asakir reported: Sa’eed ibn Amir said to Umar ibn Al-Khattab, may Allah be pleased with him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَمِيرَ الْمُؤْمِنِينَ اخْشَ اللَّهَ فِي النَّاسِ وَلا تَخْشَ النَّاسَ فِي اللَّهِ وَأَحِبَّ لِلْمُسْلِمِينَ مَا تُحِبُّ لِنَفْسِكَ وَأَهْلِ بَيْتِكَ وَاكْرَهْ لَهُمْ مَا تَكْرَهُ لِنَفْسِكَ وَأَهْلِ بَيْتِكَ<\/p>\n<p>O commander of the faithful! Fear Allah regarding people, yet do not fear people regarding Allah. Love for the Muslims what you love for yourself and your household, and hate for them what you hate for yourself and your household.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/16\/saeed-on-leadership-advice-to-the-caliph-to-love-muslims-as-himself-and-his-family\/\">Tārīkh Dimashq 20103<\/a><\/p><\/blockquote>\n<p>Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِمَ تَمْنَعُ أَخَاكَ مَا يَنْفَعُهُ وَهُوَ لَكَ نَافِعٌ<\/p>\n<p>Why would you prevent your brother from what benefits him, while you yourself benefit from it?<\/p>\n<p>Source: Sunan al-Kubrā 10985, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/19\/umar-on-benefit-why-would-you-not-love-for-your-brother-what-you-love-for-yourself\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَرَادَ أَنْ يَنْصِفَ النَّاسَ مِنْ نَفْسِهِ فَلْيُحِبَّ لَهُمْ مَا يُحِبَّ لِنَفْسِهِ<\/p>\n<p>Whoever intends from himself to be fair to people, then let him love for them as he loves for himself.<\/p>\n<p>Source: Tārīkh Dimashq 44955<\/p><\/blockquote>\n<p>Ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحَبَّ أَنْ يُنْصِفَ النَّاسَ مِنْ نَفْسِهِ , فَلْيَأْتِ إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p>Whoever would love for himself to be just with people, then let him treat people the way he would love to be treated.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/09\/hadith-on-justice-if-you-want-to-be-just-then-love-people-as-yourself\/\">Shu’b al-Imān 10375<\/a><\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَأَمُرُّ عَلَى الْآيَةِ مِنْ كِتَابِ اللَّهِ فَأَوَدُّ أَنَّ النَّاسَ كُلَّهُمْ يَعْلَمُونَ مِنْهَا مَا أَعْلَمُ<\/p>\n<p>Verily, I will pass over a verse from the Book of Allah and I would love for all of the people to know it as I know it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/11\/ibn-abbas-on-knowledge-i-would-love-for-everyone-to-have-the-knowledge-that-i-have\/\">Jāmi’ al-‘Ulūm wal-Ḥikam 13<\/a><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَبْلُغُ عَبْدٌ ذُرَى الْإِيمَانِ حَتَّى يَكُونَ التَّوَاضُعُ أَحَبَّ إِلَيْهِ مِنَ الشَّرَفِ وَمَا قَلَّ مِنَ الدُّنْيَا أَحَبَّ إِلَيْهِ مِمَّا كَثُرَ وَيَكُونُ مَنْ أَحَبَّ وَأَبْغَضَ فِي الْحَقِّ سَوَاءً يَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ وَأَهْلِ بَيْتِهِ<\/p>\n<p>A servant will not reach the heights of faith until humility is more beloved to him than nobility, until less in the world is more beloved to him than more, until it is the same whether he is loved or hated for the truth, and until he judges people the way he would love to be judged for himself and his household.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/13\/muadh-on-faith-he-will-not-have-true-faith-until-he-is-humble-ascetic-and-just\/\">al-Zuhd li-Ibn Ḥammād 191<\/a><\/p><\/blockquote>\n<p>Abdullah Al-Hashimi reported: I came to Tawus, may Allah have mercy on him, and he said to me, “Would you like me to summarize in this sitting all of the Torah, the Gospel, the Psalms, and the Quran?” I said yes. Tawus said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَفِ اللَّهَ تَعَالَى مَخَافَةً لا يَكُونُ عِنْدَكَ شَيْءٌ أَخْوَفَ مِنْهُ وَارْجُهْ رَجَاءً هُوَ أَشَدُّ مِنْ خَوْفِكَ إِيَّاهُ وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ<\/p>\n<p>Fear Allah the Exalted more than anything else, hope in Allah more intensely than you fear him, and love for people what you love for yourself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/12\/tawus-on-love-all-the-scriptures-are-summed-up-in-love-for-people-as-yourself\/\">Hilyat al-Awliyā 4693<\/a><\/p><\/blockquote>\n<p>Hasan Al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ مُوسَى صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَ رَبَّهُ جِمَاعًا مِنَ الْخَيْرِ فَقَالَ اصْحَبِ النَّاسَ بِمَا تُحِبُّ أَنْ تُصْحَبَ بِهِ<\/p>\n<p>Moses, peace and blessings be upon him, asked his Lord about what encompasses all goodness. Allah said: Be a companion to people in the way you would love to be accompanied yourself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/07\/hadith-on-forgiveness-the-most-honorable-act-of-worship-is-forgiveness\/\">Shu’b al-Imān 10374<\/a><\/p><\/blockquote>\n<p>Fadalah ibn Ubaid reported: David, peace be upon him, asked his Lord the Exalted about the most beloved people to him. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذُو سُلْطَانٍ يَرْحَمُ النَّاسَ وَيَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ<\/p>\n<p>Among them is a ruler who is merciful with people and he judges for people as he would judge himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/13\/david-on-virtues-allah-loves-those-who-perform-these-ten-righteous-deeds\/\">al-Zuhd wal-Raqā’iq 471<\/a><\/p><\/blockquote>\n<p>Ibn Al-Mubarak reported: Maymun ibn Mihran wrote to Yunus ibn Ubaid, saying, “I would love for you to write to me about what you do that I might do it.” Yunus wrote back to him, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي جَهَدْتُ بِنَفْسِي أَنْ تُحِبَّ لِلنَّاسِ مَا تُحِبُّ لَهَا وَتَكْرَهُ لَهُمْ مَا تَكْرَهُ لَهَا<\/p>\n<p>Verily, I strive for my soul to love for people what it loves for itself, and to hate for people what it hates for itself.<\/p><\/blockquote>\n<p>Al-Halimi, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلا يَنْبَغِي لِمُسْلِمٍ أَنْ يَتَمَنَّى بِقَلْبِهِ لأَخِيهِ مِنَ الشَّرِّ مَا يَكْرَهُ لِنَفْسِهِ أَوْ يَكْرَهُ لَهُ مِنَ الْخَيْرِ مَا يَتَمَنَّاهُ وَيُحِبُّهُ لِنَفْسِهِ<\/p>\n<p>It is not befitting for a Muslim to wish evil in his heart for his brother that he would hate for himself, or to hate good that he wishes and loves for himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/09\/yunus-on-love-i-strive-to-love-for-people-what-i-love-for-myself\/\">Shu’b al-Imān 10379<\/a><\/p><\/blockquote>\n<p>Qatadah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْدِلْ يَا ابْنَ آدَمَ كَمَا تُحِبُّ أَنْ يُعْدَلَ عَلَيْكَ وَأَوْفِ كَمَا تُحِبُّ أَنْ يُوَفَّى لَكَ فَإِنَّ بِالْعَدْلِ صَلَاحَ النَّاسِ<\/p>\n<p>O son of Adam, be just as you would love justice for yourself and fulfill the measure as you would love for it to be fulfilled for yourself. Verily, with justice is the well-being of people.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/10\/19\/qatadah-on-measures-fulfill-the-public-trust-as-you-would-love-it-for-yourself\/\">Tafsīr al-Ṭabarī 55:8<\/a><\/p><\/blockquote>\n<p>Hudhaifa ibn Qatadah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلاثُ خِصَالٍ إِنْ كُنَّ فِيكَ لَمْ يَنْزِلْ مِنَ السَّمَاءِ خَيْرٌ إِلا كَانَ لَكَ فِيهِ نَصِيبٌ يَكُونُ عَمَلُكَ لِلَّهِ وَتُحِبُّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ وَهَذِهِ الْكَسْرَةُ تَحَرَّ فِيهَا مَا قَدَرْتَ<\/p>\n<p>If you have three qualities, then no good will descend from the heavens but that you will have a share of it: that your deeds be for the sake of Allah, that you love for people what you love for yourself, and that you are careful with food as much as you can.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/12\/hudhaifa-on-love-if-you-love-people-as-yourself-you-will-get-blessings-from-the-heavens\/\">Hilyat al-Awliyā 12570<\/a><\/p><\/blockquote>\n<p>Ash-Shafi’ee, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا نَاظَرْتُ أَحَدًا فَأَحْبَبْتُ أَنْ يُخْطِئَ وَمَا فِي قَلْبِي مِنْ عِلْمٍ إِلا وَدِدْتُ أَنَّهُ عِنْدَ كُلِّ أَحَدٍ وَلا يُنْسَبُ إِلَيَّ<\/p>\n<p>I never debated anyone while desiring them to be wrong. There is no knowledge in my heart except that I would love for everyone to have it and attribute none of it to me.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/11\/ibn-abbas-on-knowledge-i-would-love-for-everyone-to-have-the-knowledge-that-i-have\/\">Ādāb al-Shāfi’ī 78<\/a><\/p><\/blockquote>\n<p>Ibn &#8216;Asākir reported: Abu Al-Hasan Al-Bushanji, may Allah have mercy on him, was asked about chivalry and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْفَتْوَةُ عِنْدَكَ فِي آيَةٍ مِنْ كِتَابِ اللَّهِ وَخَبَرٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَأَمَّا قَوْلُ اللَّهِ تَعَالَى<strong> يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ<\/strong> وَخَبَرُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<strong> لا يُؤْمِنُ الْعَبْدُ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/strong> يَعْنِي مِنْ خَيْرٍ وَيَكْرَهَ لأَخِيهِ مَا يَكْرَهُ لِنَفْسِهِ فَمَنِ اجْتَمَعَ فِيهِ هَاتَانِ الْحَالَتَانِ فَلَهُ الْفَتْوَةُ<\/p>\n<p>Chivalry is with you in a verse from the Book of Allah and a report from the Prophet, peace and blessings be upon him. As for the saying of Allah, it is: <strong>They love those who emigrated to them and do not find any want in their hearts for what they were given, for they prefer them over their own selves even though they were in deprivation.<\/strong>(59:9) As for the report of the Prophet, it is: <strong>No servant has faith until he loves for his brother what he loves for himself<\/strong>. It means to love what is good, and to hate for his brother what he hates for himself. Whoever combines these two traits will be chivalrous.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/18\/al-bushanji-on-chivalry-whoever-loves-his-brother-and-hates-evil-for-him-is-chivalrous\/\">Tārīkh Dimashq 42964<\/a><\/p><\/blockquote>\n<p>Al-Ghazālī reported: Ibn Al-Muqaffa heard that some people complained of the many rats in his house. It was said to him, “If only you had a cat!” Ibn Al-Muqaffa said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أخشى أن يسمع الفأر صوت الهر فيهرب إلى دور الجيران فأكون قد أحببت لهم ما لا أحب لنفسي<\/p>\n<p>I am afraid that the rats would hear the sound of the cat and flee to the houses of my neighbors, for then I would have loved for them what I do not love for myself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/19\/al-ghazali-on-neighbors-the-right-of-the-neighbor-includes-good-behavior-not-simply-avoiding-harm\/\">Iḥyāʼ Ulūm al-Dīn 2\/213<\/a><\/p><\/blockquote>\n<p>Ibrahim ibn Adham reported: Were passing through some cities and I saw two people among the ascetics on a journey. One of them said to the other, “O brother, what do the people who love Allah inherit from their beloved?” The other said, “They inherit insight from the light of Allah the Exalted and compassion for those who disobey Allah.” I said, “How can he have compassion for people who contradict their beloved?” He looked to me and said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَقَتَ أَعْمَالَهُمْ وَعَطَفَ عَلَيْهِمْ لِيَرُدَّهُمْ بِالْمَوَاعِظِ عَنْ فِعَالِهِمْ وَأَشْفَقَ عَلَى أَبْدَانِهِمْ مِنَ النَّارِ لا يَكُونُ الْمُؤْمِنُ مُؤْمِنًا حَقًّا حَتَّى يَرْضَى لِلنَّاسِ مَا يَرْضَى لِنَفْسِهِ<\/p>\n<p>They abhor their sinful deeds and have compassion for them that by their admonition they might leave their deeds, and they feel sympathy that their bodies might be burned in Hellfire. The believer is not truly a believer until he is pleased for people to have what he is pleased for himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">Hilyat al-Awliyā 11441<\/a><\/p><\/blockquote>\n<p>Ibn Rajab reported:<\/p>\n<blockquote>\n<p align=\"right\">فَضِيلَةً فَاقَ بِهَا عَلَيْهِ فَتَمَنَّى لِنَفَسِهِ مِثْلَهَا فَإِنْ كَانَتْ تِلْكَ الْفَضِيلَةُ دِينِيَّةً كَانَ حَسَنًا<\/p>\n<p>Some of the righteous predecessors said: The people who love Allah look by the light of Allah, and they are compassionate with those who disobey Allah. They hate their actions but show mercy to them so that through their admonitions they might leave their actions. They are afraid that the Hellfire will consume their bodies. The believer will not truly be a believer until he is pleased for people to have what he is pleased for himself. If he sees in someone else some merit by which they excel him, then he wishes the like of it for himself. If that merit is related to the religion then it is good.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">Jāmi&#8217; al-&#8216;Ulūm wal-Ḥ<\/a><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">ikam 13<\/a><\/p><\/blockquote>\n<p>And Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأفضل الأعمال سلامة الصدر من أنواع الشحناء كلها وأفضلها السلامة من شحناء أهل الأهواء والبدع التي تقتضي الطعن على سلف الأمة وبغضهم والحقد عليهم واعتقاد تكفيرهم أو تبديعهم وتضليلهم ثم يلي ذلك سلامة القلب من الشحناء لعموم المسلمين وإرادة الخير لهم ونصيحتهم وأن يحب لهم ما يحب لنفسه وقد وصف الله تعالى المؤمنين عموما بأنهم يقولون <strong>رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْأِيمَانِ وَلا تَجْعَلْ فِي قُلُوبِنَا غِلّاً لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَحِيمٌ<\/strong><\/p>\n<p>The best of deeds is to secure the heart from every type of enmity, and the best of it is to be secure from the enmity of the people of desires and heretical innovations that demands challenge against the righteous predecessors of the nation, their hatred and malice towards them, and belief in their charges of unbelief, heresy, and misguidance against them. Thereafter, following that is to secure the heart from enmity against the Muslim in general, to intend good for them, to give them sincere counsel, and to love for them what he loves for himself. Allah the Exalted has described the believers in general, that they say: <strong>Our Lord, forgive us and our brothers who preceded us in faith, and do not make any animosity in our hearts towards those who believe. Our Lord, you are kind and merciful. <\/strong>(59:10)<\/p>\n<p>Source: Laṭā&#8217;if al-Ma&#8217;ārif 1\/139<\/p><\/blockquote>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا طُمَأْنِينَةُ الْقَلْبِ بِمَحَبَّتِهِ وَحْدَهُ وَأَنْ يَكُونَ أَحَبَّ إلَيْهِ مِمَّا سِوَاهُمَا وَبِالتَّوَكُّلِ عَلَيْهِ وَحْدَهُ وَبِأَنْ يُحِبَّ لِأَخِيهِ الْمُؤْمِنِ مَا يُحِبُّ  لِنَفْسِهِ فَهَذِهِ مِنْ حَقَائِقِ الْإِيمَانِ الَّتِي تَخْتَصُّ بِهِ<\/p>\n<p>As for what reassures the heart, it is in love for Allah alone and that he is beloved more than anything else, and it is in reliance upon Allah alone, and it is in loving for his faithful brother what he loves for himself. Hence, these are among the realities of faith with which it has been specified.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 7\/426<\/p><\/blockquote>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ الْإِنْصَافَ يُوجِبُ عَلَيْهِ أَدَاءَ حُقُوقِ اللَّهِ كَامِلَةً مُوَفَّرَةً وَأَدَاءَ حُقُوقِ النَّاسِ كَذَلِكَ وَأَنْ لَا يُطَالِبَهُمْ بِمَا لَيْسَ لَهُ وَلَا يُحَمِّلَهُمْ فَوْقَ وُسْعِهِمْ وَيُعَامِلَهُمْ بِمَا يُحِبُّ أَنْ يُعَامِلُوهُ بِهِ وَيُعْفِيَهُمْ مِمَّا يُحِبُّ أَنْ يُعْفُوهُ مِنْهُ وَيَحْكُمَ لَهُمْ وَعَلَيْهِمْ بِمَا يَحْكُمُ بِهِ لِنَفْسِهِ وَعَلَيْهَا<\/p>\n<p>Indeed, a sense of justice is required to fulfill the rights of Allah with complete respect, as well as fulfill the rights of people. It is that he does not demand from them what they cannot do, he does not burden them beyond their capacity, he deals with them as he would love to be dealt with by them, he pardons them as he would love to be pardoned by them, and he judges for them and over them as he would judge for himself and over himself.<\/p>\n<p>Source: Zād al-Ma&#8217;ād 2\/371<\/p><\/blockquote>\n<p>And Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُلَاطَفَةُ الْخَلْقِ وَهِيَ مُعَامَلَتُهُمْ بِمَا يُحِبُّ أَنْ يُعَامِلُوهُ بِهِ مِنَ اللُّطْفِ وَلَا يُعَامِلُهُمْ بِالْعُنْفِ وَالشِّدَّةِ وَالْغِلْظَةِ فَإِنَّ ذَلِكَ يُنَفِّرُهُمْ عَنْهُ وَيُغْرِيهِمْ بِهِ وَيُفْسِدُ عَلَيْهِ قَلْبَهُ وَحَالَهُ مَعَ اللَّهِ<\/p>\n<p>A mark of tranquility and dignity is kindness with the creation. It is dealing with them in a way he would love to be treated kindly by them, and not treating them harshly, strictly, or roughly, for that would alienate them from him, estrange them, and corrupt his heart and his relationship with Allah.<\/p>\n<p>Source: Madārij al-Sālikīn 2\/478<\/p><\/blockquote>\n<p>And Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِن النَّصِيحَة لَا تجامع الغل إِذْ هِيَ ضِدّه فَمن نصح الائمة والامة فقد برِئ من الغل … فَإِن صَاحبه للزومه جمَاعَة الْمُسلمين يحب لَهُم مَا يحب لنَفسِهِ وَيكرهُ لَهُم مَا يكره لَهَا ويسوؤه مَا يسؤوهم ويسره مَا يسرهم<\/p>\n<p>Indeed, sincere good will does not include animosity, but is against it. Thus, whoever is sincere to the leaders and the nation is free from animosity… The one who is sincere to the Muslim community must love for them what he loves for himself, hate for them what he hates for himself, be displeased by what displeases them, and be happy by what makes them happy.<\/p>\n<p>Source: Miftāḥ Dār al-Sa’ādah 1\/72<\/p><\/blockquote>\n<p>Al-Muhāsibī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا احوط فِي الْحق وَالْعدْل وَلَا ارضى عِنْد الْخَاصَّة والعامة وَهُوَ ان تحب للنَّاس مَا تحب لنَفسك وَتكره للنَّاس مَا تكرههُ لَهَا<\/p>\n<p style=\"text-align: left;\">There is nothing better to guard truth and justice, and nothing more pleasing specifically and generally than that you love for people what you love in your soul and hate for people what you hate in your soul.<\/p>\n<p>Source: Ādāb al-Nufūs 1\/125<\/p><\/blockquote>\n<p>Al-Ghazālī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْهَا أَنْ يُنْصِفَ النَّاسَ مِنْ نَفْسِهِ وَلَا يَأْتِيَ إِلَيْهِمْ إِلَّا بِمَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p>Among the duties of a Muslim are to have a sense of justice within himself for people, and to not treat them except in a way that he would love to be treated by them.<\/p>\n<p>Source: Iḥyā&#8217; Ulūm al-Dīn 2\/198<\/p><\/blockquote>\n<p>And Al-Ghazālī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كلما عملت بالناس اجعله كما ترضى لنفسك منهم لأنه لا يكمل إيمان العبد حتى يحب لسائر الناس ما يحب لنفسه<\/p>\n<p>Every time you deal with people, treat them as you would be pleased to be treated by them, for the faith of a servant is not complete until he loves for all people what he loves for himself.<\/p>\n<p>Source: Ayyuhā al-Walad 1\/145<\/p><\/blockquote>\n<p>And Al-Ghazālī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْوَدُود من عباد الله من يُرِيد لخلق الله كل مَا يُريدهُ لنَفسِهِ وَأَعْلَى من ذَلِك من يؤثرهم على نَفسه كمن قَالَ مِنْهُم أُرِيد أَن أكون جِسْرًا على النَّار يعبر عَليّ الْخلق وَلَا يتأذون بهَا وَكَمَال ذَلِك أَن لَا يمنعهُ عَن الإيثار وَالْإِحْسَان الْغَضَب والحقد وَمَا ناله من الْأَذَى<\/p>\n<p>Loving kindness among the servants of Allah is one who desires for the creation of Allah what he desires for himself, and the highest part of that is to prefer them over himself. As if one of them said: I wish I could be a bridge over Hellfire so that the creation would cross over me and not be harmed by it. The perfection of this is that anger, malice, and what he endures of harm will not prevent him from altruism and excellent behavior.<\/p>\n<p>Source: al-Maqṣad al-Asná 1\/122<\/p><\/blockquote>\n<p>Al-Ṭūfī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فمقصوده ائتلاف قلوب الناس وانتظام أحوالهم وهو قاعدة الإسلام الكبرى التي أوصى الله عزَّ وجلَّ بها &#8230; وبيان ذلك أنه إذا أحبَّ كل واحد من الناس لباقيهم ما يحب لنفسه أحسن إليهم ولم يؤذهم لأنه هو يحب لنفسه أن يُحسَنَ إليه ولا يُؤذَى وإذا أحسن إليهم ولم يؤذهم أحبوه فتسري بذلك المحبة بين الناس وبسريان المحبة بينهم يسرى الخير ويرتفع الشر وبذلك ينتظم أمر المعاش والمعاد وتصلح أحوال العباد<\/p>\n<p>The objective of this tradition is to unite the hearts of people and rectify their circumstances, and it is a major principle in Islam that Allah the Exalted has enjoined… In clarification of that, if every person loved for others what he loves for himself he would treat them in the best manner, he would not harm them because he loves for himself to be treated well, and he himself would not be harmed. If he treats them well and does not harm those he loves, then love will emanate from that between people, and with the emanation of love between them will be the emanation of good and removal of evil, and with that the rectification of daily life and habits and the improvement of the servants’ circumstances.<\/p>\n<p>Source: al-Ta’yīn fī Sharḥ al-Arba’īn 1\/124-125<\/p><\/blockquote>\n<p>Al-Saffarīnī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِمَّا لِلْمُسْلِمِ عَلَى الْمُسْلِمِ أَنْ يَسْتُرَ عَوْرَتَهُ وَيَغْفِرَ زَلَّتَهُ وَيَرْحَمَ عَبْرَتَهُ وَيُقِيلَ عَثْرَتَهُ وَيَقْبَلَ مَعْذِرَتَهُ وَيَرُدَّ غِيبَتَهُ وَيُدِيمَ نَصِيحَتَهُ وَيَحْفَظَ خُلَّتَهُ وَيَرْعَى ذِمَّتَهُ وَيُجِيبَ دَعَوْتَهُ وَيَقْبَلَ هَدِيَّتَهُ وَيُكَافِئَ صِلَتَهُ وَيَشْكُرَ نِعْمَتَهُ وَيُحْسِنَ نُصْرَتَهُ وَيَقْضِيَ حَاجَتَهُ وَيَشْفَعَ مَسْأَلَتَهُ وَيُشَمِّتَ عَطْسَتَهُ وَيَرُدَّ ضَالَّتَهُ وَيُوَالِيَهُ وَلَا يُعَادِيَهُ وَيَنْصُرَهُ عَلَى ظَالِمِهِ وَيَكُفَّهُ عَنْ ظُلْمِ غَيْرِهِ وَلَا يُسْلِمَهُ وَلَا يَخْذُلَهُ وَيُحِبَّ لَهُ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p>Among the rights of a Muslim over another Muslim are that he cover his faults, forgive his mistakes, have mercy for his errors, overlook his missteps, reject his backbiting, always give him sincere advice, preserve his good traits, guard his covenants, answer his invitations, accept his guidance, repay his gifts, show gratitude for his favors, assist him in the best manner, fulfill his needs, intercede for his problems, respond to his sneeze, refuse his misguided advice, protect him and not take him as an enemy, support him against his oppressors, restrain him from oppressing others, not surrender him, not abandon him, and to love for him what he loves for himself.<\/p>\n<p>Source: Ghidhā al-Albāb 1\/266<\/p><\/blockquote>\n<p>Al-Qurtubī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمَ يَجِبُ عَلَيْهِ أَنْ يُحَذِّرَ أَخَاهُ مِمَّا يَخَافُ عَلَيْهِ وَيُرْشِدَهُ إِلَى مَا فِيهِ طَرِيقُ السَّلَامَةِ وَالنَّجَاةِ فَإِنَّ الدِّينَ النَّصِيحَةُ وَالْمُسْلِمُ أَخُو الْمُسْلِمِ<\/p>\n<p>The Muslim must warn his brother of what he fears for himself, and guide him to ways of safety and salvation. Indeed, the religion is sincere good will and the Muslim is the brother of another Muslim.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 12:68<\/p><\/blockquote>\n<p>Abu Abbas Al-Qurtubī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يتم إيمانُ أحد الإيمان التام الكامل حتى يضم إلى إسلامه سلامة الناس منه وإرادة الخير لهم والنصح لجميعهم فيما يحاوله معهم<\/p>\n<p>The faith on no one will be complete and perfected until his Islam includes safety for people, desire to do good to them, and good will for all of them in his dealings with them.<\/p>\n<p>Source: Kitāb al-Mufhim 1\/224<\/p><\/blockquote>\n<p>Ibn Al-Arabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَكُونُ الْقَلْبُ سَلِيمًا إذَا كَانَ حَقُودًا حَسُودًا مُعْجَبًا مُتَكَبِّرًا وَقَدْ شَرَطَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْإِيمَانِ أَنْ يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p>He cannot have a pure heart if it holds malice, envy, pride, and arrogance. The Prophet made it a requirement of faith that he love for his brother what he loves for himself.<\/p>\n<p>Source: Aḥkām al-Qurʼān 26:89<\/p><\/blockquote>\n<p>Ibn Abdul Barr writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنْ عَلَامَةِ الْمُومِنِ سُرُورُهُ لِأَخِيهِ بِمَا يُسَرُّ بِهِ لِنَفْسِهِ<\/p>\n<p>Among the signs of a true believer is that he is happy for his brother to have what makes himself happy.<\/p>\n<p>Source: al-Tamhīd 1011<\/p><\/blockquote>\n<p>Ibn Hazm writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تكلف صديقك إلا مثل ما تبذل له من نفسك فإن طلبت أكثر فأنت ظالم<\/p>\n<p>Do not hold your friend responsible except with what you would have him offer yourself. If you demand more, then you have done wrong.<\/p>\n<p>Source: Rasā&#8217;il Ibn Ḥazm 1\/364<\/p><\/blockquote>\n<p>Al-Ṭībī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فعلي المؤمن أن يحب لصاحبه ما يحب لنفسه ويكره له ما يكره لنفسه<\/p>\n<p>It is a duty upon the believer to love for his companion what he loves for himself and to hate for him what he hates for himself.<\/p>\n<p>Source: Sharḥ al-Mishkāh 3\/968<\/p><\/blockquote>\n<p>And Al-Ṭībī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">من أصاب خيرًا ينبغي له أن يحب لغيره ما يحب لنفسه فيأخذ بالأقرب فالأقرب<\/p>\n<p>Whoever would earn good, then he should love for others what he loves for himself, for he will keep coming closer and closer.<\/p>\n<p>Source: al-Tanwīr Sharḥ al-Jāmi&#8217; al-Ṣaghīr 6\/242<\/p><\/blockquote>\n<p>Ibn al-&#8216;Imād writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأولى أن يحمل على عموم الأخوة حتى يشمل الكافر فيحبّ لأخيه الكافر ما يحبُّ لنفسه من دخوله في الإسلام كما يحبّ للمسلم دوامه ومن ثم كان الدعاء بالهداية مستحباً<\/p>\n<p>The Prophet&#8217;s saying to love for his brother what he loves for himself is interpreted as universal brotherhood, such that it includes the unbeliever, so he should love for his brother the unbeliever what he loves for himself, part of which is his entering Islam and just as he loves for the Muslim to stay in Islam. Hence, it is preferred to supplicate for their guidance.<\/p>\n<p>Source: Dalīl al-Fāliḥīn 3\/26<\/p><\/blockquote>\n<p>Al-Qāsimī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ بَعْضُ الْمُفَسِّرِينَ إِنَّهُ يَجِبُ أَنْ يُحِبَّ الْإِنْسَانُ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ وَيُحِبَّ لِذُرِّيَّةِ غَيْرِهِ مِنَ الْمُؤْمِنِينَ مَا يُحِبُّ لِذَرِّيَّتِهِ<\/p>\n<p>Some of the commentators said that it is an obligation upon humanity to love for his brother what he loves for himself, and to love for the offspring of others among the believers what he would love for his own offspring.<\/p>\n<p>Source: Tafsīr al-Qāsimī 4:9<\/p><\/blockquote>\n<p>Al-Sa’dī writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومتضمن للعمل للآخرة والاستعداد لها لأن الإيمان الصحيح يقتضي ذلك ويستلزمه والإحسان إلى الناس وأن يصل إليهم من القول والفعل والمال والمعاملة ما يحب أن يعاملوه به فهذا هو الميزان الصحيح للإحسان وللنصح فكل أمر أشكل عليك مما تعامل به الناس، فانظر هل تحب أن يعاملوك بتلك المعاملة أم لا فإن كنت تحب ذلك كنت محبا لهم ما تحب لنفسك وإن كنت لا تحب أن يعاملوك بتلك المعاملة فقد ضيعت هذا الواجب العظيم<\/p>\n<p>Included in faith is work for the Hereafter and preparation for it, as sound faith requires and obligates it, and to treat people well, to maintain good relations with them in words, deeds, charity, and dealing with them in a way he would love to be dealt with by them. Hence, this is the true measure of excellence and good will. For every matter about which you are unsure how to deal with people, then ask yourself: Would you love for them to deal with you this way or not? If you love it, then you love for them what you love for yourself. If you do not love for them to deal with you this way, then you have failed this important obligation.<\/p>\n<p>Source: Bahjat Qulūb al-Abrār 1\/187<\/p><\/blockquote>\n<p>Aḥmad Ḥuṭaybah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فعلى الإنسان المؤمن أن يحب الناس ويحب الخير لهم ويحب أن ينفعهم فهذه هي علامة الإنسان المؤمن<\/p>\n<p>It is the duty of the believing human being to love people, to love good for them, and to love to benefit them. This is a sign of faith in the human being.<\/p>\n<p>Source: Sharḥ al-Targhīb wal-Tarhīb 8\/26<\/p><\/blockquote>\n<p>May Allah bless us with the will and ability to fulfill this most important Islamic teaching.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;None of you has faith until he loves for his brother what he loves for himself.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[61,16,17,18,30,32,138,52,55,57,134,59,103,91,179],"class_list":["post-13813","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-hatred-bigdah","tag-hereafter-akhirah","tag-jesus-isa","tag-love-al-mahabbah","tag-methodology-al-minhaj","tag-moses-musa","tag-paradise-jannah","tag-peace","tag-public-welfare-al-maslaha","tag-righteous-predecessors-al-salaf-al-salih","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3AN","jetpack-related-posts":[{"id":16137,"url":"https:\/\/www.abuaminaelias.com\/muslims-avoid-harming-people\/","url_meta":{"origin":13813,"position":0},"title":"Muslims avoid harming people in word and deed","author":"Abu Amina Elias","date":"December 20, 2014","format":false,"excerpt":"\"Do not harm or return harm.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12976,"url":"https:\/\/www.abuaminaelias.com\/islam-adult-breastfeeding\/","url_meta":{"origin":13813,"position":1},"title":"Adult breastfeeding in Islam?","author":"Abu Amina Elias","date":"March 25, 2013","format":false,"excerpt":"\"The Prophet devised a clever way to put Abu Hudhayfa at ease.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15069,"url":"https:\/\/www.abuaminaelias.com\/customs-and-acts-of-worship-in-islamic-law\/","url_meta":{"origin":13813,"position":2},"title":"Customs and acts of worship in Islamic Law","author":"Abu Amina Elias","date":"December 16, 2013","format":false,"excerpt":"\"With regard to customs, if there is no text to prove that a custom is forbidden, how can it be deemed to be forbidden?\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20074,"url":"https:\/\/www.abuaminaelias.com\/developing-moral-wisdom-in-islam\/","url_meta":{"origin":13813,"position":3},"title":"Developing moral wisdom in Islam","author":"Abu Amina Elias","date":"January 3, 2019","format":false,"excerpt":"\"Thus, We have ordained a law upon you in the matter,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16131,"url":"https:\/\/www.abuaminaelias.com\/abrogation-and-specification-in-the-quran\/","url_meta":{"origin":13813,"position":4},"title":"Abrogation and specification in the Quran","author":"Abu Amina Elias","date":"December 10, 2014","format":false,"excerpt":"\"If the first verse to be revealed was not to drink wine, they would have said we will never stop drinking.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":13813,"position":5},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13813","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13813"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13813\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13813"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13813"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13813"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}