{"id":13845,"date":"2013-06-28T09:28:51","date_gmt":"2013-06-28T13:28:51","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13845"},"modified":"2021-06-01T15:49:05","modified_gmt":"2021-06-01T11:49:05","slug":"purification-heart-and-soul","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/purification-heart-and-soul\/","title":{"rendered":"Purification of the heart and soul in Islam"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>The command to purify our hearts from sin was an essential Islamic teaching ever since the early stages of the revelation in Mecca. This is known as “purification of the soul” (<i>tazkiyyat an-nafs<\/i>).<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قَدْ أَفْلَحَ مَن زَكَّاهَا وَقَدْ خَابَ مَن دَسَّاهَا<\/p>\n<p><b>He has succeeded who purifies the soul, and he has failed who corrupts the soul.<\/b><\/p>\n<p>Surah Ash-Shams 91:9-10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ<\/p>\n<p><b>A day when there will be no benefit in wealth or children, but only in he who comes to Allah with a pure heart.<\/b><\/p>\n<p>Surah Ash-Shu’ara 26:88-89<\/p><\/blockquote>\n<p>We learn from these verses that our success in the Hereafter depends upon the purification of our hearts in this life. We must purify our hearts from spiritual sins such as greed, malice, envy, arrogance, and worldliness. In their place, we must adorn the heart with spiritual virtues such as generosity, compassion, benevolence, humility, and asceticism.<\/p>\n<p>Purification of the heart was one of the first commands with which Moses, upon him be peace, was sent to Pharaoh.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ فَقُلْ هَل لَّكَ إِلَىٰ أَن تَزَكَّىٰ<\/p>\n<p><b>Go to Pharaoh, for verily, he is a transgressor. Say to him: Will you purify yourself?<\/b><\/p>\n<p>Surah An-Naz’iat 79:17-18<\/p><\/blockquote>\n<p>Purity of heart is also one of the defining characteristics of Abraham, upon him be peace.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِنَّ مِن شِيعَتِهِ لَإِبْرَاهِيمَ إِذْ جَاءَ رَبَّهُ بِقَلْبٍ سَلِيمٍ<\/p>\n<p><b>Verily, among his people was Abraham, when he came to his Lord with a pure heart.<\/b><\/p>\n<p>Surah As-Saffat 37:83-84<\/p><\/blockquote>\n<p>One of the primary methods we can use to purify our hearts is to perform sincere supplications and prayers according to the prophetic way (<i>sunnah<\/i>).<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قَدْ أَفْلَحَ مَن تَزَكَّىٰ وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ<\/p>\n<p><b>He has succeeded who purifies himself, who remembers the name of his Lord and prays.<\/b><\/p>\n<p>Surah Al-A’la 87:14-15<\/p><\/blockquote>\n<p>When we exalt Allah and ask for our sins to be forgiven, this removes arrogance from our hearts and makes us humble. When we pray for Allah to guide others, this removes malice and hatred from our hearts and makes us love others for the sake of Allah. When we remember the Hereafter and the Day of Resurrection, this makes us less attached to the world and more inclined to help others.<\/p>\n<p>In this way, the Messenger of Allah would purify his heart every morning and evening by performing supplications and prayers.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p align=\"right\">يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ<\/p>\n<p><b>O boy, if you are able every morning and evening to remove any rancor from your heart towards anyone, then do so.<\/b><\/p><\/blockquote>\n<p>Then the Prophet said to me:<\/p>\n<blockquote>\n<p align=\"right\">يَا بُنَيَّ وَذَلِكَ مِنْ سُنَّتِي وَمَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجَنَّة<\/p>\n<p><b>O boy, that is my tradition<\/b> <b>and whoever revives my tradition has loved me, and whoever loves me will be with me in Paradise.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2678, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/17\/hadith-on-hatred-o-boy-make-sure-your-heart-is-purified-from-rancor-envy-and-malice\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>The ritual prayer is meant to prevent us from committing sins and immoral deeds.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ<\/p>\n<p><b>Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.<\/b><\/p>\n<p>Surah Al-Ankabut 29:45<\/p><\/blockquote>\n<p>Abu Huraira reported: A man came to the Prophet, peace and blessings be upon him, and he said, “Indeed, so-and-so prays in the night but he steals in the morning.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهُ سَيَنْهَاهُ مَا يَقُولُ<\/p>\n<p><b>Verily, it should prevent him from doing that.<\/b><\/p>\n<p>Source: Musnad Ahmad 9486, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/07\/hadith-on-prayer-a-sincere-prayer-should-prevent-a-person-from-committing-major-sins\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The next method we can use to purify our hearts is to give in charity and perform good deeds for others.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَسَيُجَنَّبُهَا الْأَتْقَى الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّىٰ<\/p>\n<p><b>But the righteous one will avoid Hellfire, who gives from his wealth to purify himself.<\/b><\/p>\n<p>Surah Al-Layl 92:17-18<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ<\/p>\n<p><b>Take from their wealth a charity by which you cleanse them and purify them, and invoke blessings upon them.<\/b><\/p>\n<p>Surah At-Tawbah 92:103<\/p><\/blockquote>\n<p>When we give away our wealth in charity, this removes worldliness from our hearts and envy of what others have and it makes us hope for our good deeds stored in the Hereafter. Charity means not only giving wealth, but also giving people your time, your effort, your work, and even a smile or a kind word.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">كُلُّ مَعْرُوفٍ صَدَقَةٌ وَإِنَّ مِنْ الْمَعْرُوفِ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ وَأَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ أَخِيكَ<\/p>\n<p><b>Every good deed is charity. Verily, it is a good deed to meet your brother with a smiling face, and to pour what is left from your bucket into the vessel of your brother.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1970, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/24\/hadith-on-charity-every-good-deed-is-charity-even-smiling-at-your-brother\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Charity is a duty upon every Muslim, for every person can give something from his wealth, time, and energy. At the very least, Muslims can refrain from harming others and that is also charity.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ قَالَ تَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ قَالَ وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ وَكُلُّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلَاةِ صَدَقَةٌ وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ<\/p>\n<p><b>Charity is due upon every joint of the people for every day upon which the sun rises. Being just between two people is charity, and helping a man with his animal and lifting his luggage upon it is charity, and a kind word is charity, and every step that you take towards the mosque is charity, and removing harmful things from the road is charity.<\/b><\/p>\n<p>Source: Sahih Muslim 1009, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/14\/hadith-on-charity-every-joint-has-charity-due-upon-it-even-a-good-word-is-charity\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>When a Muslim commits a sin, his or her heart is covered by a stain, but it is removed by repentance and good deeds.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُؤْمِنَ إِذَا أَذْنَبَ كَانَتْ نُكْتَةٌ سَوْدَاءُ فِي قَلْبِهِ فَإِنْ تَابَ وَنَزَعَ وَاسْتَغْفَرَ صُقِلَ قَلْبُهُ فَإِنْ زَادَ زَادَتْ فَذَلِكَ الرَّانُ الَّذِي ذَكَرَهُ اللَّهُ فِي كِتَابِهِ<\/p>\n<p><strong>Verily, when the believer commits a sin, a black spot appears upon his heart. If he repents and abandons the sin and seeks forgiveness, his heart will be polished, but if he increases in sin, the blackness increases. That is the covering which Allah has mentioned in his Book: Nay, but on their hearts is a covering because of what they have earned<\/strong>. (83:14)<\/p>\n<p>Source: Sunan ibn Majah 4244, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/13\/hadith-on-sin-when-a-muslim-commits-a-sin-a-black-spot-appears-on-his-heart-until-he-repents\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Therefore, a Muslim must continue to perform supplications, prayers, charity, and good deeds until the heart is purified from sin.<\/p>\n<p>In conclusion, the salvation of a Muslim depends upon purification of the heart soul from vices and adorning the heart with virtues. Purification is achieved through performing sincere supplications, prayers, and acts of charity toward others. We must remember that we will be judged on the Day of Resurrection according to the purity of our hearts and the righteousness of our deeds.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ<\/p>\n<p><b>Verily, Allah does not look at your appearance or wealth, but rather He looks at your hearts and actions.<\/b><\/p>\n<p>Source: Sahih Muslim 2564, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/17\/allah-will-judge-your-heart-and-actions\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;He has succeeded who purifies himself&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[167,14,241,61,16,17,183,168,105,49,184,30,32,104,48,52,311,100,207,55,56,57,134,291,62,196,103,84,64,66,70,220,179],"class_list":["post-13845","post","type-post","status-publish","format-standard","hentry","category-featured","tag-abraham-ibrahim","tag-arrogance-al-takabbur","tag-brotherhood-al-ikhwa","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-enjoin-good-amr-bil-maruf","tag-envy-al-hasad","tag-gentleness-al-rifq","tag-guidance-al-hidaya","tag-hatred-bigdah","tag-hereafter-akhirah","tag-humility-al-tawaduh","tag-justice-adl","tag-love-al-mahabbah","tag-malice-hiqd","tag-manners-al-adab","tag-mecca-makkah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-moses-musa","tag-paradise-jannah","tag-pharaoh-firawn","tag-prophetic-biography-sirah","tag-prophetic-virtues","tag-public-welfare-al-maslaha","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-reform-islah","tag-remembrance-dhikr","tag-sincerity-al-ikhlaas","tag-supplication-al-dua","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Bj","jetpack-related-posts":[{"id":16650,"url":"https:\/\/www.abuaminaelias.com\/the-purpose-of-prayer-in-islam\/","url_meta":{"origin":13845,"position":0},"title":"Purpose of prayer in Islam","author":"Abu Amina Elias","date":"June 25, 2015","format":false,"excerpt":"\"Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14732,"url":"https:\/\/www.abuaminaelias.com\/do-not-desire-to-fight-the-enemies-of-islam\/","url_meta":{"origin":13845,"position":1},"title":"Do not desire to fight the enemies of Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not wish to meet the enemy, but if you meet them, then be steadfast.\" --Sahih Bukhari 2863","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18580,"url":"https:\/\/www.abuaminaelias.com\/excellent-ablution-wudu-with-evidences\/","url_meta":{"origin":13845,"position":2},"title":"An excellent ablution (wudu) with evidences","author":"Abu Amina Elias","date":"December 5, 2017","format":false,"excerpt":"\"O you who believe, when you rise to perform prayer, wash your faces and your forearms to the elbows...\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":13845,"position":3},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20176,"url":"https:\/\/www.abuaminaelias.com\/expel-jews-christians-arabian-peninsula\/","url_meta":{"origin":13845,"position":4},"title":"Expel Jews and Christians from Arabian Peninsula?","author":"Abu Amina Elias","date":"February 10, 2019","format":false,"excerpt":"\"Allah does not forbid you from those who did not fight you,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":13845,"position":5},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13845","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13845"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13845\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13845"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13845"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13845"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}