{"id":13965,"date":"2013-07-10T09:26:57","date_gmt":"2013-07-10T13:26:57","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=13965"},"modified":"2021-04-15T13:36:08","modified_gmt":"2021-04-15T09:36:08","slug":"morning-meal-as-suhoor","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/morning-meal-as-suhoor\/","title":{"rendered":"The morning meal before fasting, al-Suhur"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>It is highly recommended for Muslims to take their pre-fasting meal (<em>al-suhur<\/em>) before beginning the day of fasting. The Prophet (ṣ) mentioned its blessings in several authentic traditions.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً<\/p>\n<p><b>Take the pre-fasting meal. Verily, there is blessing in the pre-fasting meal.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1923, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/eat-blessed-suhur\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Al-Miqdam ibn Ma’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">عَلَيْكُمْ بِغِذَاءِ السَّحَرِ فَإِنَّهُ هُوَ الْغِذَاءُ الْمُبَارَكُ<\/p>\n<p><b>You must take the pre-fasting meal. Verily, it is a blessed meal.<\/b><\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 2164, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/must-eat-suhur\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, invited me to the morning meal during Ramadan and he said:<\/p>\n<blockquote>\n<p align=\"right\">هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ<\/p>\n<p><b>Onward to the blessed meal.<\/b><\/p>\n<p>Source: Sunan Abī Dāwūd 2344, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/come-to-blessed-suhur\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السُّحُورُ أَكْلَةٌ بَرَكَةٌ فَلَا تَدَعُوهُ وَلَوْ أَنْ يَجْرَعَ أَحَدُكُمْ جَرْعَةً مِنْ مَاءٍ فَإِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الْمُتَسَحِّرِينَ<\/p>\n<p><b>The pre-fasting meal<\/b><b> is a blessed meal, so do not abandon it even if you take only a sip of water. Verily, Allah and His angels send blessings upon those who take the pre-fasting meal<\/b>.<\/p>\n<p>Source: Musnad Aḥmad 11003, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/14\/suhur-blessed-sip\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abdullah ibn al-Harith reported: The Prophet, peace and blessings be upon him, said about the pre-fasting meal:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهَا بَرَكَةٌ أَعْطَاكُمْ اللَّهُ إِيَّاهَا فَلَا تَدَعُوهُ<\/p>\n<p><b>Verily, it is a blessing Allah has given you, so do not abandon it.<\/b><\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 2162, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/do-not-neglect-suhur\/\"><strong><i>Sahih<\/i><\/strong><\/a><\/p><\/blockquote>\n<p>The best meal to eat before fasting is dates and water, or other healthy nutritious food. This is because food is our fuel to worship Allah throughout the day, so our meal should not contain too much heavy food or junk food that lacks benefit and produces laziness.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نِعْمَ سَحُورُ الْمُؤْمِنِ التَّمْرُ<\/p>\n<p><strong>The most excellent pre-fasting meal of the believer is dates.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1399, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/04\/17\/best-suhur-dates\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>It is recommended to prolong the morning meal as late as possible and to break fast as early as possible, because this makes it easier for Muslims to complete their fasting. There is no extra reward for fasting beyond the prescribed time period.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَزَالُ أُمَّتِي بِخَيْرٍ مَا عَجَّلُوا الْإِفْطَارَ وَأَخَّرُوا السُّحُورَ<\/p>\n<p><b>My nation will not cease to be upon goodness so long as they hasten to break their fasting and prolong the morning meal.<\/b><\/p>\n<p>Source: Musnad Aḥmad 20805, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/23\/hasten-break-fast-delay-suhur\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>It is permissible for Muslims to continue eating and drinking until redness appears on the horizon, which should occur just a few minutes after the first call to prayer for the dawn prayer.<\/p>\n<p>Abu Talaq reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُوا وَاشْرَبُوا يعني في السحور وَلَا يَهِيدَنَّكُمْ السَّاطِعُ الْمُصْعِدُ وَكُلُوا وَاشْرَبُوا حَتَّى يَعْتَرِضَ لَكُمْ الْأَحْمَرُ<\/p>\n<p><strong>Eat and drink in the pre-fasting meal and let not the ascending light stop you. Eat and drink until you see redness on the horizon.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 705, Grade: <strong><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/10\/hadith-on-fasting-continue-to-eat-and-drink-until-you-see-redness-upon-the-horizon\/\">Sahih<\/a><\/i><\/strong><\/p><\/blockquote>\n<p>Al-Tirmidhi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُ لَا يَحْرُمُ عَلَى الصَّائِمِ الْأَكْلُ وَالشُّرْبُ حَتَّى يَكُونَ الْفَجْرُ الْأَحْمَرُ الْمُعْتَرِضُ<\/p>\n<p>The people of knowledge acted upon this tradition, that they would not forbid a fasting person from eating or drinking until the red dawn was present.<\/p>\n<p>Source: Sunan al-Tirmidhī 705<\/p><\/blockquote>\n<p>The Prophet (ṣ) would continue eating and drinking after the first call to prayer for as long as it would take to recite about fifty verses from the Quran, which is about a few minutes.<\/p>\n<p>Zayd ibn Thabit reported: We ate the morning meal with the Prophet, peace and blessings be upon him, and then we stood for the prayer. It was asked, “How long was it between the two calls to prayer?” Zayd said:<\/p>\n<blockquote>\n<p align=\"right\">قَدْرُ خَمْسِينَ آيَةً<\/p>\n<p>It was time enough to recite fifty verses from the Quran.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1921, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/10\/hadith-on-fasting-continue-eating-the-morning-meal-until-a-few-minutes-after-the-first-adhan\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Al-Tirmidhi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ اسْتَحَبُّوا تَأْخِيرَ السُّحُورِ<\/p>\n<p>It was said by Al-Shafi&#8217;i, Ahmad, and Ishaq that it is recommended to prolong the pre-fasting meal.<\/p>\n<p>Source: Sunan al-Tirmidhī 704<\/p><\/blockquote>\n<p>And Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ مُتَوَسِّطَةً لَا طَوِيلَةً وَلَا قَصِيرَةً لَا سَرِيعَةً وَلَا بَطِيئَةً … وَفِيهِ تَأْخِيرُ السُّحُورِ<\/p>\n<p>It means it was a moderate length, not long, not short, not fast, and not slow… and in it the pre-fasting meal is prolonged.<\/p>\n<p>Source: Fatḥ al-Bārī 1821<\/p><\/blockquote>\n<p>You should consult your local Islamic authorities if you are confused about the exact timing.<\/p>\n<p>When a Muslim hears the first call to prayer, he or she should finish whatever food and drink they have in front of them, and not eat any more than what is already on their plate and in their cup.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا سَمِعَ أَحَدُكُمْ النِّدَاءَ وَالْإِنَاءُ عَلَى يَدِهِ فَلَا يَضَعْهُ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ<\/p>\n<p><b>When one of you hears the call to prayer <\/b><strong>while eating the pre-fasting meal and<\/strong><b> his vessel is in his hand, let him not put it down until he fulfills his needs from it.<\/b><\/p>\n<p>Source: Sunan Abī Dāwūd 2350, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/finish-suhur-adhan\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>However, it is very important to eat moderately when taking the morning meal and when breaking the fast. Some people eat extravagantly and actually gain weight from their fasting by overcompensating in their meals. This defeats the purpose of fasting, which is to control our desires and moderate our in-take of food.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِندَ كُلِّ مَسْجِدٍ وَكُلُوا وَاشْرَبُوا وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ<\/p>\n<p><b>O children of Adam, take your adornment at every mosque and eat and drink, but be not excessive. Verily, He likes not those who commit excess.<\/b><\/p>\n<p>Surat al-A’raf 7:31<\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ وَالْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ<\/p>\n<p><b>The unbeliever eats with seven intestines, and the believer eats with one intestine.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2060, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/10\/hadith-on-food-the-believers-are-moderate-in-the-amount-they-eat-and-unbelievers-are-extravagant\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Salman al-Farisi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ أَكْثَرَ النَّاسِ شِبَعًا فِي الدُّنْيَا أَطْوَلُهُمْ جُوعًا يَوْمَ الْقِيَامَةِ<\/p>\n<p><b>Verily, the people who eat their fill the most in this world will be the most hungry on the Day of Resurrection.<\/b><\/p>\n<p>Source: Sunan Ibn Mājah 3351, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/overeating-hungriest-akhirah\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>The Sunnah of the Prophet (ṣ) is to fill the stomach with a third of food, a third of drink, and a third to be left empty. We should not be in the habit of completely filling our stomach at every meal.<\/p>\n<p>Al-Miqdam ibn Ma’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا مَلَأَ آدَمِيٌّ وِعَاءً شَرًّا مِنْ بَطْنٍ حَسْبُ الْآدَمِيِّ لُقَيْمَاتٌ يُقِمْنَ صُلْبَهُ فَإِنْ غَلَبَتْ الْآدَمِيَّ نَفْسُهُ فَثُلُثٌ لِلطَّعَامِ وَثُلُثٌ لِلشَّرَابِ وَثُلُثٌ لِلنَّفَسِ<\/p>\n<p><strong>The son of Adam cannot fill a vessel worse than his stomach, as it is enough for him to take a few bites to straighten his back. If he cannot do it, then he may fill it with a third of his food, a third of his drink, and a third of his breath.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3349, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/21\/eating-third-food-drink-air\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Nevertheless, there is a concession to eat until one is fully satiated on special occasions or when eating with people. Celebrating with meals is a normal and joyous part of life, but again the operative principle is moderation in all things.<\/p>\n<p>Malik ibn Dinar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا شَبِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُبْزٍ قَطُّ وَلا لَحْمٍ إِلا عَلَى ضَفَفٍ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, never ate to his fill of bread or meat unless he was eating with people.<\/p>\n<p>Source: al-Shamā’il al-Muḥammadīyah 71, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/26\/never-ate-fill-unless-with-people\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In sum, every Muslim should take the morning meal before fasting due to its blessings. We should prolong the morning meal as late as possible, which is about a few minutes after the first call to prayer before the dawn prayer. We should eat nutritiously, moderately, and avoid extravagance any in consumption, for this is the best way to fuel our worship of Allah throughout the day.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, there is blessing in the morning meal.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[324,18,85,342,37,39,41,100,55,93,60,306,365,98,179],"class_list":["post-13965","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-blessings-al-barakah","tag-community-jamaah","tag-fasting-al-siyam","tag-al-fiqh","tag-idolatry-shirk","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-manners-al-adab","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-prayer-salat","tag-ramadan","tag-recommendation-al-mustahab","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Df","jetpack-related-posts":[{"id":21111,"url":"https:\/\/www.abuaminaelias.com\/fasting-muharram-day-of-ashura\/","url_meta":{"origin":13965,"position":0},"title":"Fasting in Al-Muharram and Day of &#8216;Ashura","author":"Abu Amina Elias","date":"September 7, 2019","format":false,"excerpt":"\"Best fast after Ramadan is in the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":13965,"position":1},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14319,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-giving-food-break-fasting\/","url_meta":{"origin":13965,"position":2},"title":"Imam al-Nawawi on Feeding the Breaking Fast","author":"Abu Amina Elias","date":"July 20, 2013","format":false,"excerpt":"\"Verily, the angels send blessings upon the fasting person...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":13965,"position":3},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14241,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-safeguarding-the-fast\/","url_meta":{"origin":13965,"position":4},"title":"Imam al-Nawawi on Safeguarding the Fast","author":"Abu Amina Elias","date":"July 16, 2013","format":false,"excerpt":"\"When one of you awakens in the morning for fasting...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21839,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-virtues-of-fasting\/","url_meta":{"origin":13965,"position":5},"title":"Imam al-Mundhiri on Virtues of Fasting","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Fasting is a shield from the Hellfire, just like a shield of yours in battle.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13965","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=13965"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/13965\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=13965"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=13965"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=13965"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}