{"id":14152,"date":"2016-07-04T10:48:32","date_gmt":"2016-07-04T06:48:32","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14152"},"modified":"2025-07-04T11:03:20","modified_gmt":"2025-07-04T07:03:20","slug":"justice-and-fairness-for-all-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/justice-and-fairness-for-all-in-islam\/","title":{"rendered":"Justice and fairness for all in Islam"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>In Islam, we should always stand for justice as a matter of principle, whether for Muslims or non-Muslims, even if justice should side against us.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا فَلَا تَتَّبِعُوا الْهَوَىٰ أَن تَعْدِلُوا وَإِن تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا<\/p>\n<p><b>O you who believe, be persistently standing firm in justice as witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. Follow not your desires, lest you not be just. If you distort your testimony or refuse to give it, then Allah is aware of what you do.<\/b><\/p>\n<p>Surat An-Nisa 4:135<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ وَالْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ<\/p>\n<p><b>Verily, Allah orders justice and good conduct and giving to relatives and He forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded.<\/b><\/p>\n<p>Surat An-Nahl 16:90<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تُؤَدُّوا الْأَمَانَاتِ إِلَىٰ أَهْلِهَا وَإِذَا حَكَمْتُم بَيْنَ النَّاسِ أَن تَحْكُمُوا بِالْعَدْلِ إِنَّ اللَّهَ نِعِمَّا يَعِظُكُم بِهِ إِنَّ اللَّهَ كَانَ سَمِيعًا بَصِيرًا<\/p>\n<p><b>Verily, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Verily, Allah is ever hearing and seeing.<\/b><\/p>\n<p>Surat An-Nisa 4:58<\/p><\/blockquote>\n<p>Justice is one of the core tenets of Islamic teachings. Whatever is just is necessarily a part of the religion of Islam.<\/p>\n<p>Ibn Al-Qayyim said:<\/p>\n<blockquote>\n<p align=\"right\">قَدْ بَيَّنَ سُبْحَانَهُ بِمَا شَرَعَهُ مِنْ الطُّرُقِ أَنَّ مَقْصُودَهُ إقَامَةُ الْعَدْلِ بَيْنَ عِبَادِهِ وَقِيَامُ النَّاسِ بِالْقِسْطِ فَأَيُّ طَرِيقٍ اُسْتُخْرِجَ بِهَا الْعَدْلُ وَالْقِسْطُ فَهِيَ مِنْ الدِّينِ وَلَيْسَتْ مُخَالِفَةً لَهُ<\/p>\n<p>Allah the Exalted has made clear in his law (<i>sharia<\/i>) that the objective is the establishment of justice between His servants and fairness among the people, so whichever path leads to justice and fairness is part of the religion and can never oppose it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/06\/ibn-al-qayyim-on-sharia-justice-is-integral-to-the-religion-of-islam-and-can-never-oppose-it\/\">al-Ṭuruq al-Ḥikmīya 13<\/a><\/p><\/blockquote>\n<p>We should never let our hatred for people or their sins be a cause for us to oppress them. Hatred, when misdirected at people instead of evil in the abstract, is a dangerous spiritual disease that often leads to acts of injustice.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ<\/p>\n<p><b>O you who believe, be persistently standing firm for Allah as witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just, for that is nearer to righteousness. Fear Allah, for verily, Allah is aware of what you do.<\/b><\/p>\n<p>Surat Al-Ma’idah 5:8<\/p><\/blockquote>\n<p>These commands apply equally to unbelievers as they apply to believers. Muslims should be just and fair to all non-Muslims in every circumstance.<\/p>\n<p>Al-Qurtubi said:<\/p>\n<blockquote>\n<p align=\"right\">وَدَلَّتِ الْآيَةُ أَيْضًا عَلَى أَنَّ كُفْرَ الْكَافِرِ لَا يَمْنَعُ مِنَ الْعَدْلِ عَلَيْهِ<\/p>\n<p>This verse shows that the unbelief of the unbeliever does not prevent him from enjoying justice.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/al-qurtubi-the-disbelief-of-the-disbeliever-does-not-prevent-him-from-enjoying-justice\/\">Tafseer Al-Qurtubi 5:8<\/a><\/p><\/blockquote>\n<p>In Islam, even the highest official, the Caliph, is subject to the same rules of justice as everyone else. There is a famous incident in which Ali Ibn Abu Talib lost a court case to a Christian because he lacked evidence, even though Ali was the Caliph at the time.<\/p>\n<p>Sha’bi reported: Ali ibn Abu Talib found a Christian man with his armor. He decided to take up the matter legally, so he brought the dispute to the judge, Shuraih. Ali said, “This is my armor and I have not sold it nor given it away.” Shuraih said to the Christian, “What do you say about what the leader of the believers has said?” The Christian replied, “It is my armor, but I do not consider the leader of the believers to be a liar.” Shuraih turned to Ali and said, “O leader of the believers, do you have proof?” Ali laughed and said, “Shuraih is correct. I do not have proof.” So Shuraih ruled in favor of the Christian. The Christian took the armor and began to walk away but then he returned. The Christian said:<\/p>\n<blockquote>\n<p align=\"right\">أَمَّا أَنَا فَأَشْهَدُ أَنَّ هَذِهِ أَحْكَامُ الْأَنْبِيَاءِ أَمِيرُ الْمُؤْمِنِينَ قَدَّمَنِي إِلَى قَاضِيهِ وَقَاضِيهِ يَقْضِي عَلَيْهِ ! أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ الدِّرْعُ وَاللَّهِ دِرْعُكَ يَا أَمِيرَ الْمُؤْمِنِينَ اتَّبَعْتُ الْجَيْشَ وَأَنْتَ مُنْطَلِقٌ إِلَى صِفِّينَ فَخَرَجَتْ مِنْ بَعِيرِكَ الْأَوْرَقِ<\/p>\n<p>As for me, I testify that this is the judgment of the Prophets. The leader of the believers himself takes me to his judge and the judge rules against him! I testify that there is no God except Allah, and I testify that Muhammad is the Messenger of Allah. By Allah, the armor is yours, O leader of the believers. I followed the army when you were on your way to the Battle of Siffin and the armor fell from your equipment.<\/p><\/blockquote>\n<p>Ali said:<\/p>\n<blockquote>\n<p align=\"right\">أَمَا إِذْ أَسْلَمْتَ فَهِيَ لَكَ<\/p>\n<p>If you have accepted Islam, then the armor is for you.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ali-ibn-abu-talib-rules-with-justice-in-his-dispute-with-the-christian-over-his-armor\/\">Al-Bidayah wa-Nihayah 11\/107<\/a><\/p><\/blockquote>\n<p>The reward for being just and fair is tremendous. The people who practice justice in all their matters will be given a special, exalted status on the Day of Judgment.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِينٌ الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا<\/p>\n<p><b>Verily, those who were fair will be in the presence of Allah upon pulpits of light, near the right hand of the Merciful, the Exalted, and both of His sides are right<\/b> (being equal in honor); <b>those who practiced justice in their rulings and with their families and in all that they did.<\/b><\/p>\n<p>Source: Sahih Muslim 4493, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/04\/hadith-on-justice-the-just-will-be-exalted-at-the-right-hand-of-the-merciful-seated-on-pulpits-of-light\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>True righteousness is, in fact, to fulfill the rights of Allah and the rights of people. Just as we must fulfill our duties to our Creator, we must also fulfill our duties to the creation.<\/p>\n<p>Ibn Taymiyyah reported that the scholars of Islam would say:<\/p>\n<blockquote>\n<p align=\"right\"> الصَّالِحُ الْقَائِمُ بِحُقُوقِ اللَّهِ وَحُقُوقِ عِبَادِهِ<\/p>\n<p>The righteous person is one who fulfills the rights of Allah and His servants.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-taymiyyah-righteousness-is-to-fulfill-the-rights-of-allah-and-the-rights-of-his-servants\/\">Majmu&#8217; Al-Fatawa 7\/57<\/a><\/p><\/blockquote>\n<p>In contrast, oppression is the violation of the rights of people. Islam has forbidden all forms of oppression great and small.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">عَنْ اللَّهِ تَبَارَكَ وَتَعَالَى أَنَّهُ قَالَ يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا<\/p>\n<p><b>Allah the Exalted said: O my servants, I have forbidden oppression for myself and have made it forbidden among you, so do not oppress one another. <\/b><\/p>\n<p>Source: Sahih Muslim 2577, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/05\/allah-has-forbidden-oppression\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Oppression will come on the Day of Judgment in the form of darkness and punishment.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">اتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ حَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمَهُمْ<\/p>\n<p><b>Guard yourself from oppression, for oppression will be darkness on the Day of Resurrection. Guard yourself from greed, for greed destroyed those before you. It caused them to shed blood and to make lawful what was unlawful.<\/b><\/p>\n<p>Source: Sahih Muslim 2578, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/18\/guard-yourself-from-committing-oppression-unlawfulness-or-greed\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The Prophet warned us about the supplications of the oppressed, even from unbelievers, because Allah always responds to them.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا دَعْوَةَ الْمَظْلُومِ وَإِنْ كَانَ كَافِرًا فَإِنَّهُ لَيْسَ دُونَهَا حِجَابٌ<\/p>\n<p><b>Beware of the supplication of the oppressed, even if he is an unbeliever, for there is no screen between it and Allah<\/b>.<\/p>\n<p>Source: Musnad Ahmad 12140, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/22\/hadith-on-oppression-fear-the-prayer-of-the-oppressed-because-allah-will-respond-to-it\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Oppression is often the result of tribalism (<em>al-asabiyyah<\/em>), a major sin in which people support their tribe or country when they are committing injustice. It is typified in modern times by the slogan, “My country right or wrong.”<\/p>\n<p>Wathilah ibn al-Asqa reported: I asked, “O Messenger of Allah, what is tribalism?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَنْ تُعِينَ قَوْمَكَ عَلَى الظُّلْمِ<\/p>\n<p><b>It is that you help your people in wrongdoing.<\/b><\/p>\n<p>Source: Sunan Abu Dawud 5100, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/18\/tribalism-is-to-support-your-people-when-they-are-wrong\/\"><i>Hasan<\/i><\/a><\/p><\/blockquote>\n<p>Islam has forbidden all forms of tribalism in the strongest terms and equated such thinking with the pre-Islamic ignorance of idol worship.<\/p>\n<p>Ibn Abdullah al-Bajali reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ قُتِلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ يَدْعُو عَصَبِيَّةً أَوْ يَنْصُرُ عَصَبِيَّةً فَقِتْلَةٌ جَاهِلِيَّةٌ<\/p>\n<p><b>Whoever is killed under the banner of blind following, who calls to tribalism or supports tribalism, then he has died upon ignorance.<\/b><\/p>\n<p>Source: Sahih Muslim 1850, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/03\/whoever-dies-upon-tribalism-bigotry-has-died-upon-ignorance\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Muslims should never be blind followers of any leader who commits injustice, but rather should stand for justice even when it is difficult.<\/p>\n<p>Hudhaifa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَكُونُوا إِمَّعَةً تَقُولُونَ إِنْ أَحْسَنَ النَّاسُ أَحْسَنَّا وَإِنْ ظَلَمُوا ظَلَمْنَا وَلَكِنْ وَطِّنُوا أَنْفُسَكُمْ إِنْ أَحْسَنَ النَّاسُ أَنْ تُحْسِنُوا وَإِنْ أَسَاءُوا فَلَا تَظْلِمُوا<\/p>\n<p><b>Do not let yourselves become blind followers, saying that if the people are good then we will be good, and if they are unjust then we will be unjust. Rather, make up your own minds. If the people are good then be good, but if they are evil then do not be unjust.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2007, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/31\/hadith-on-reason-do-not-be-a-blind-follower-of-people-rather-be-good-and-never-unjust\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Despite the emphasis of Islam on justice, it is recommended for Muslims to be merciful and forgiving when injustice is committed against them. For example, Islamic law gives the murder victim’s family the right to seek legal retaliation. However, it is better to remit this right by way of charity and mercy.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالْأَنفَ بِالْأَنفِ وَالْأُذُنَ بِالْأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ فَمَن تَصَدَّقَ بِهِ فَهُوَ كَفَّارَةٌ لَّهُ<\/p>\n<p><b>We ordained for them therein a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds is legal retribution. But whoever gives up his right as charity, it is expiation for him.<\/b><\/p>\n<p>Surat Al-Mai’dah 5:45<\/p><\/blockquote>\n<p>Whenever a case involving legal retaliation was referred to the Prophet, he would always recommend being patient and forbearing.<\/p>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p align=\"right\">مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُفِعَ إِلَيْهِ شَيْءٌ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ<\/p>\n<p>I never saw a case involving legal retaliation being referred to the Messenger of Allah, peace and blessings be upon him, except that he would command pardoning the criminal.<\/p>\n<p>Source: Sunan Abu Dawud 4497, Source: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/12\/hadith-on-mercy-the-messenger-of-allah-always-recommended-that-people-forgive-their-oppressors\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>This is because all human beings are flawed and in need of Allah’s mercy. If Allah sought complete justice for all of our sins, we would be punished severely. Rather, Allah has written in creation the principle that mercy should overcome wrath.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَمَّا قَضَى اللَّهُ الْخَلْقَ كَتَبَ فِي كِتَابِهِ فَهُوَ عِنْدَهُ فَوْقَ الْعَرْشِ إِنَّ رَحْمَتِي غَلَبَتْ غَضَبِي<\/p>\n<p><b>When Allah decreed the creation, He wrote in His Book which is with Him on His Throne: My mercy prevails over My wrath.<\/b><\/p>\n<p>Source: Sahih Bukhari 3022, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/08\/hadith-on-mercy-allahs-mercy-prevails-over-his-wrath\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Therefore, we must stand for justice for all people and the fulfillment of their rights, but we should stand for mercy when injustice is committed against us and our rights are violated.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, Allah orders justice and good conduct and giving to relatives,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[12,16,17,18,20,183,168,22,24,25,26,30,32,34,151,48,51,311,100,54,56,134,58,62,107,103,45,296,98,179],"class_list":["post-14152","post","type-post","status-publish","format-standard","hentry","category-featured","tag-ali-ibn-abi-talib","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-enjoin-good-amr-bil-maruf","tag-excellence-ihsaan","tag-family-ties-sillat-rahim","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-hatred-bigdah","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-ignorance-al-jahl","tag-justice-adl","tag-leadership-imamate","tag-malice-hiqd","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-patience-al-sabr","tag-prophetic-biography-sirah","tag-public-trust-al-amanah","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-sharia","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Gg","jetpack-related-posts":[{"id":17681,"url":"https:\/\/www.abuaminaelias.com\/justice-for-all-humanity-hilf-al-fudul\/","url_meta":{"origin":14152,"position":0},"title":"Cooperation with all humanity for justice, Hilf al-Fudul","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah commands his faithful servants to cooperate in good deeds,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":14152,"position":1},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20053,"url":"https:\/\/www.abuaminaelias.com\/equality-and-equity-in-islam\/","url_meta":{"origin":14152,"position":2},"title":"Equality and equity in Islam","author":"Abu Amina Elias","date":"December 11, 2018","format":false,"excerpt":"\"There are two words for justice in Islam...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":14152,"position":3},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13282,"url":"https:\/\/www.abuaminaelias.com\/islam-and-torture\/","url_meta":{"origin":14152,"position":4},"title":"Is torture allowed in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, Allah will torture those who torture people in this world.\" --Sahih Muslim 2613","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18273,"url":"https:\/\/www.abuaminaelias.com\/beware-dua-of-the-oppressed\/","url_meta":{"origin":14152,"position":5},"title":"Beware the Supplication of the Oppressed","author":"Abu Amina Elias","date":"June 14, 2016","format":false,"excerpt":"\"Injustice will be darkness on the Day of Resurrection.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14152","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14152"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14152\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14152"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14152"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14152"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}