{"id":14171,"date":"2013-07-15T13:58:41","date_gmt":"2013-07-15T09:58:41","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14171"},"modified":"2025-04-21T13:05:30","modified_gmt":"2025-04-21T09:05:30","slug":"islam-forbids-violent-rebellion","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/islam-forbids-violent-rebellion\/","title":{"rendered":"Non-Violent Reform of Unjust Muslim Rulers"},"content":{"rendered":"<p><i>In the Name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>It is not lawful for us to violently rebel against an unjust Muslim ruler, or any ruler with whom Muslims have a peace treaty, as long as we can practice the basics of Islam in safety. Rather, Muslims should be patient and encourage reform through non-violent action. The decision to overthrow a government belongs only to a committee of senior scholars who can consider the harms and benefits of such military action, not to individuals or unsanctioned partisan groups.<\/p>\n<p>Obedience to civil laws, whether in a Muslim or non-Muslim state, is obligatory as long as we are not commanded to commit sins. If the rulers command us to commit sins or they stubbornly persist in oppression, then we must strive to reform them without resorting to violence or destabilizing civil order.<\/p>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ<\/p>\n<p><strong>O believers! Obey Allah and obey the Messenger and those in authority among you. Should you disagree on anything, then refer it to Allah and His Messenger, if you truly believe in Allah and the Last Day. This is the best and fairest resolution.<\/strong><\/p>\n<p>Surat al-Nisa&#8217; 4:59<\/p><\/blockquote>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ فِيمَا أَحَبَّ وَكَرِهَ مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلَا سَمْعَ وَلَا طَاعَةَ<\/p>\n<p><strong>It is a duty upon a Muslim man to listen and obey authorities, whether he likes it or not, unless they command sinful disobedience. If they command sinful disobedience, then there is no listening or obedience to them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7144, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/15\/obey-unless-command-sin\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In many narrations, the Prophet ﷺ has forbidden us from rebelling against the rulers as long as they pray and allow Islam to be practiced in their lands. Violence that leads to civil war almost always results in a much worse situation than the unjust ruler himself.<\/p>\n<p>While an unjust ruler is an evil in itself, the violence required to overthrow him is almost always even worse.<\/p>\n<p>Hudhayfa ibn al-Yaman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَكُونُ بَعْدِي أَئِمَّةٌ لَا يَهْتَدُونَ بِهُدَايَ وَلَا يَسْتَنُّونَ بِسُنَّتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ<\/p>\n<p><b>Rulers after me will come who do not follow my guidance and my tradition<\/b> (<i>sunnah<\/i>). <b>Some of their men will have the hearts of devils in a human body.<\/b><\/p><\/blockquote>\n<p>I said, “O Messenger of Allah, what should I do if I live to see that time?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">تَسْمَعُ وَتُطِيعُ لِلْأَمِيرِ وَإِنْ ضُرِبَ ظَهْرُكَ وَأُخِذَ مَالُكَ فَاسْمَعْ وَأَطِعْ<\/p>\n<p><b>You should listen and obey them even if the ruler strikes your back and takes your wealth, even still listen and obey.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1847, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/tyrant-strike-back-patience\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْمَعْ وَأَطِعْ فِي عُسْرِكَ وَيُسْرِكَ وَمَكْرَهِكَ وَأَثَرَةٍ عَلَيْكَ وَإِنْ أَكَلُوا مَالَكَ وَضَرَبُوا ظَهْرَكَ إِلَّا أَنْ تَكُونَ مَعْصِيَةً لِلَّهِ بَوَاحًا<\/p>\n<p><strong>Listen and obey authorities in hardship, in ease, and in what you dislike, even if they give undue preference over you, even if they consume your property and they strike your back, unless they order flagrant disobedience to Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 4566, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/06\/sabr-unless-disobedient\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Awf ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">خِيَارُ أَئِمَّتِكُمْ الَّذِينَ تُحِبُّونَهُمْ وَيُحِبُّونَكُمْ وَيُصَلُّونَ عَلَيْكُمْ وَتُصَلُّونَ عَلَيْهِمْ وَشِرَارُ أَئِمَّتِكُمْ الَّذِينَ تُبْغِضُونَهُمْ وَيُبْغِضُونَكُمْ وَتَلْعَنُونَهُمْ وَيَلْعَنُونَكُمْ<\/p>\n<p><b>The best of your rulers are those whom you love and they love you, who pray for you and you pray for them. The worst of your rulers are those whom you hate and they hate you, whom you curse and they curse you.<\/b><\/p><\/blockquote>\n<p>It was said, “Shall we confront them with swords?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا مَا أَقَامُوا فِيكُمْ الصَّلَاةَ وَإِذَا رَأَيْتُمْ مِنْ وُلَاتِكُمْ شَيْئًا تَكْرَهُونَهُ فَاكْرَهُوا عَمَلَهُ وَلَا تَنْزِعُوا يَدًا مِنْ طَاعَةٍ<\/p>\n<p><b>No, as long as they establish prayer among you. If you find something hateful from them, you should hate their actions but not withdraw your hand from obedience.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1855, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/hate-tyrant-deeds-rebellion\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Umm Salamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">سَتَكُونُ أُمَرَاءُ فَتَعْرِفُونَ وَتُنْكِرُونَ فَمَنْ عَرَفَ بَرِئَ وَمَنْ أَنْكَرَ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ<\/p>\n<p><b>There will be rulers from whom you will see both goodness and corruption. One who recognizes their evil and hates it will maintain his innocence, but one who is pleased with it and follows them will be sinful.<\/b><\/p><\/blockquote>\n<p>It was said, “Shall we not fight them?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا مَا صَلَّوْا<\/p>\n<p><b>No, as long as they pray.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1854, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/muslim-tyrants-not-rebellion\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Many of those who call for violent rebellion have resorted to the use of terrorism against innocent civilians to destabilize the government. Such acts are completely forbidden in Islam. The Prophet ﷺ severely warned those who engage in unlawful civil disobedience and acts of reckless and indiscriminate violence, saying that they have nothing to do with Islam and will have died a death of ignorance.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِعَصَبَةٍ أَوْ يَدْعُو إِلَى عَصَبَةٍ أَوْ يَنْصُرُ عَصَبَةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلاَ يَتَحَاشَ مِنْ مُؤْمِنِهَا وَلاَ يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ<\/p>\n<p><b>Whoever rejects obedience to the ruler and divides the community and dies will have died upon ignorance. Whoever fights under the banner of one who is blind, raging for the sake of tribalism, or calling to tribalism, or supporting tribalism, and is killed will have died upon ignorance. Whoever rebels against my nation, striking the righteous and wicked alike and sparing not even the believers and does not fulfill the pledge of security, then he has nothing to do with me and I have nothing to do with him.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1848, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/14\/prophet-disavows-tribalism-terrorism\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The righteous predecessors (<em>al<\/em>&#8211;<i>salaf al-salih<\/i>) recognized that the evil of violent rebellion is far worse than the evil of an unjust ruler himself. For this reason, they counseled patience and wisdom in the face of injustice. In fact, they would pray for the ruler to be guided toward righteousness, as the ruler&#8217;s reform would benefit the entire society.<\/p>\n<p>Al-Hasan al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَاللَّهِ لَوْ أَنَّ النَّاسَ إِذَا ابْتُلُوا مِنْ قِبَلِ سُلْطَانِهِمْ صَبَرُوا مَا لَبِثُوا أَنْ يَرْفَعَ اللَّهُ ذَلِكَ عَنْهُمْ وَذَلِكَ أَنَّهُمْ يَفْزَعُونَ إِلَى السَّيْفِ فَيُوكَلُوا إِلَيْهِ وَوَاللَّهِ مَا جَاءُوا بِيَوْمِ خَيْرٍ قَطُّ<\/p>\n<p>If people had patience when they are afflicted with trials from their ruler, it would not be long before Allah relieves them of it. Yet, they take refuge in their swords, so they are left to their swords. By Allah, not even for a single day did they bring about any good.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/08\/hassan-left-to-their-swords\/\">al-Sharī’ah lil-Ājurrī 62<\/a><\/p><\/blockquote>\n<p>Al-Fudayl ibn &#8216;Iyad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ لِي دَعْوَةً مُسْتَجَابَةً مَا جَعَلْتُهَا إِلَّا فِي إِمَامٍ فَصَلَاحُ الْإِمَامِ صَلَاحُ الْبِلَادِ وَالْعِبَادِ<\/p>\n<p>If I had one supplication to be answered, I would make it for no one but the ruler. If the ruler is righteous then it will lead to the righteousness of the country and the people.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/07\/20\/fudayl-dua-muslim-imams\/\">Siyar A’lām al-Nubalā&#8217; 8\/434<\/a><\/p><\/blockquote>\n<p>Imam al-Tahawi stated in his famous creed:<\/p>\n<blockquote>\n<p align=\"right\">وَلَا نَرَى الْخُرُوجَ عَلَى أَئِمَّتِنَا وَوُلَاةِ أُمُورِنَا وَإِنْ جَارُوا وَلَا نَدْعُو عَلَيْهِمْ وَلَا نَنْزِعُ يَدًا مِنْ طَاعَتِهِمْ وَنَرَى طَاعَتَهُمْ مِنْ طَاعَةِ اللَّهِ عَزَّ وَجَلَّ فَرِيضَةً مَا لَمْ يَأْمُرُوا بِمَعْصِيَةٍ وَنَدْعُو لَهُمْ بِالصَّلَاحِ وَالْمُعَافَاةِ<\/p>\n<p>We do not recognize the rebellion against our leader or those in charge of our affairs even if they are unjust, nor do we wish evil for them, nor do we refuse to follow them. We hold that obedience to them is part of obedience to Allah the Exalted and therefore obligatory as long as they do not command us to commit sins. We pray for their right guidance and pardon.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/aqeedah-of-imam-tahawi\/\">al-Aqīdah al-Ṭaḥāwiyyah<\/a><\/p><\/blockquote>\n<p>Imam Ahmad ibn Hanbal said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ خَرَجَ عَلَى إِمَامِ الْمُسْلِمِينَ وَقَدْ كَانَ النَّاسُ اجْتَمَعُوا عَلَيْهِ وَأَقَرُّوا لَهُ بِالْخِلَافَةِ بِأَيِّ وَجْهٍ كَانَ بِالرِّضَا أَوْ بِالْغَلَبَةِ فَقَدْ شَقَّ هَذَا الْخَارِجُ عَصَا الْمُسْلِمِينَ وَخَالَفَ الْآثَارَ عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَإِنْ مَاتَ الْخَارِجُ عَلَيْهِ مَاتَ مِيتَةَ جَاهِلِيَّةٍ وَلَا يَحِلُّ قِتَالُ السُّلْطَانِ وَلَا الْخُرُوجُ عَلَيْهِ لِأَحَدٍ مِنَ النَّاسِ فَمَنْ فَعَلَ ذَلِكَ فَهُوَ مُبْتَدِعٌ عَلَى غَيْرِ السُّنَّةِ وَالطَّرِيقِ<\/p>\n<p>Whoever rebels against the leader of the Muslims, while the people have gathered around him and acknowledged his Caliphate by any means, whether by consent or by force, then this rebel has split the unity of the Muslims and opposed the reports of the Messenger of Allah. If the rebel dies, he dies a death of ignorance. It is not lawful for anyone to fight the ruler or to rebel. Whoever does that is a heretical innovator who is not following the Sunnah and the path.<\/p>\n<p>Source: Sharḥ Uṣul al-I’tiqād 1\/175<\/p><\/blockquote>\n<p>And Imam Ahmad said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يُتَعَرَّضُ بِالسُّلْطَانِ فَإِنَّ سَيْفَهُ مَسْلُولٌ<\/p>\n<p>Do not confront the ruler, for his sword is unsheathed.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/249<\/p><\/blockquote>\n<p>Imam al-Nawawi summarizes the views of the righteous predecessors, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْخُرُوجُ عَلَيْهِمْ وَقِتَالُهُمْ فَحَرَامٌ بِإِجْمَاعِ الْمُسْلِمِينَ وَإِنْ كَانُوا فَسَقَةً ظَالِمِينَ وَقَدْ تَظَاهَرَتِ الْأَحَادِيثُ بِمَعْنَى مَا ذَكَرْتُهُ وَأَجْمَعَ أَهْلُ السُّنَّةِ أَنَّهُ لَا يَنْعَزِلُ السُّلْطَانُ بِالْفِسْقِ وَأَمَّا الْوَجْهُ الْمَذْكُورُ فِي كُتُبِ الْفِقْهِ لِبَعْضِ أَصْحَابِنَا أَنَّهُ يَنْعَزِلُ وَحُكِيَ عَنِ الْمُعْتَزِلَةِ أَيْضًا فَغَلَطٌ مِنْ قَائِلِهِ مُخَالِفٌ لِلْإِجْمَاعِ قَالَ الْعُلَمَاءُ وَسَبَبُ عَدَمِ انْعِزَالِهِ وَتَحْرِيمِ الْخُرُوجِ عَلَيْهِ مَا يَتَرَتَّبُ عَلَى ذَلِكَ مِنَ الْفِتَنِ وَإِرَاقَةِ الدِّمَاءِ وَفَسَادِ ذَاتِ الْبَيْنِ فَتَكُونُ الْمَفْسَدَةُ فِي عَزْلِهِ أَكْثَرَ مِنْهَا فِي بَقَائِهِ<\/p>\n<p>As for rebelling against the ruler and fighting him, it is forbidden by consensus of the Muslims even if he is sinful and oppressive. I have mentioned many narrations with this meaning. The people of the Sunnah have agreed that the ruler should not be removed due to his sinfulness. As for the view mentioned in the books of jurisprudence from some of our companions that he should be removed, which is also the opinion of the Mu’tazilites, then it is a serious mistake from them and is in opposition to the consensus. The scholars have said the reason his removal and rebellion against him is forbidden is because of what that entails of tribulations, bloodshed, and corruption, for the harm in removing the ruler is greater than letting him remain.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 12\/229<\/p><\/blockquote>\n<p>Some Muslims claim that the narrations mentioned earlier forbidding rebellion against a Muslim ruler only apply to a ruler who &#8220;implements the Sharia&#8221; as they understand it. This is an unjustified restriction of the prophetic command that they have invented.<\/p>\n<p>Rather, the Prophet ﷺ has forbidden violence even if &#8220;they strike your back and take your wealth,&#8221; and &#8220;they do not follow my guidance or tradition,&#8221; and they have &#8220;hearts of devils.&#8221; The only criterion the Prophet mentioned is that they allow the prayer, meaning freedom to practice Islam.<\/p>\n<p>For this reason, Imam Muslim collected all of these narrations under the following chapter heading:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وُجُوبِ الإِنْكَارِ عَلَى الأُمَرَاءِ فِيمَا يُخَالِفُ الشَّرْعَ وَتَرْكِ قِتَالِهِمْ مَا صَلَّوْا وَنَحْوِ ذَلِكَ<\/p>\n<p>The obligation to denounce the rulers when they contradict the Sharia and to avoid fighting them as long as they pray and so on.<\/p><\/blockquote>\n<p>To claim that the Sharia is a political system, the absence of which necessitates violence, is a modern innovation in the religion. Instead, the proper way to enjoin good and forbid evil regarding the rulers is through non-violent preaching, advising, and, if necessary, acts of civil disobedience.<\/p>\n<p>Imam Ahmad ibn Hanbal, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p align=\"right\">التَّغْيِيرُ بِالْيَدِ لَيْسَ بِالسَّيْفِ وَالسِّلَاحِ<\/p>\n<p>Changing evil with one’s hand is not done with swords or weapons.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/248<\/p><\/blockquote>\n<p>Muslims should sincerely advise the ruler using calm and measured speech. Allah sent Moses and Aaron, upon them be peace, to speak to Pharaoh gently, even though he was a great tyrant who claimed to be God and enslaved and massacred thousands.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَقُولَا لَهُ قَوْلًا لَّيِّنًا لَّعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَىٰ<\/p>\n<p><strong>Speak to him gently, so perhaps he may be mindful of Me or fearful of My punishment.<\/strong><\/p>\n<p>Surat Ta Ha 20:44<\/p><\/blockquote>\n<p>A man recited this verse in front of Yahya ibn Mu’adh, may Allah have mercy on him, and he began to weep. Yahya said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِلَهِي هَذَا رِفْقُكَ بِمَنْ يَقُولُ أَنَا الْإِلَهُ فَكَيْفَ رِفْقُكَ بِمَنْ يَقُولُ أَنْتَ الْإِلَهُ<\/p>\n<p>My God! This is Your gentleness with one who claims to be God, then how is Your gentleness with one who says You are God?<\/p>\n<p>Source: Tafsīr al-Baghawī 5\/275<\/p><\/blockquote>\n<p>Moses and Aaron spoke to Pharaoh with the intention of guiding him to the truth, not condemning him to Hell. If this is how Allah asked his prophets to speak to one of the worst tyrants the world has seen, then we should act the same in our situation.<\/p>\n<p>We must also have a good intention to benefit the ruler on a personal level, as part of the good will (<em>nasiha<\/em>) they should receive from us. We should advise them of their misdeeds in private and only condemn their unjust actions in public when necessary.<\/p>\n<p>Iyad ibn Ghanam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَرَادَ أَنْ يَنْصَحَ لِسُلْطَانٍ بِأَمْرٍ فَلَا يُبْدِ لَهُ عَلَانِيَةً وَلَكِنْ لِيَأْخُذْ بِيَدِهِ فَيَخْلُوَ بِهِ فَإِنْ قَبِلَ مِنْهُ فَذَاكَ وَإِلَّا كَانَ قَدْ أَدَّى الَّذِي عَلَيْهِ لَهُ<\/p>\n<p><b>Whoever has advice for the ruler, let him take his hand and give it privately. If he accepts it, then he accepts it. If he rejects it, the duty upon him has been fulfilled<\/b>.<\/p>\n<p>Source: al-Sunnah li-Ibn Abī ‘Āṣim 1098, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/03\/06\/nasihah-imams-private\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even so, it may be necessary to become more vocal and assertive if the ruler is a stubborn oppressor. Speaking the truth to him in this case is a form of non-violent jihad without weapons.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ مِنْ أَعْظَمِ الْجِهَادِ كَلِمَةَ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ<\/p>\n<p><strong>Verily, among the greatest jihād is a word of justice in front of a tyrannical ruler.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2174, Grade: <strong><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/13\/greatest-jihad-word-haqq-truth\/\">Sahih<\/a><\/i><\/strong><\/p><\/blockquote>\n<p>In sum, Muslims should reform an unjust ruler and enjoin good without resorting to violence or destabilizing society. Violence and terrorism lead to the fracturing of Muslim society, which is even worse than the oppression of the rulers. Rather, Muslims must be patient and wise in the face of injustice, and we should pray for Allah to guide the rulers to righteous conduct. If armed struggle truly becomes necessary, this decision is solely the prerogative of a committee of senior scholars and leaders who have the constitutional authority to consider the benefits and harms of any proposed plan of action.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;You should listen and obey, even if they strike your back.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[308,61,18,168,99,25,39,47,100,55,93,57,58,291,60,62,103,45,64,91,296,121,98],"class_list":["post-14171","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-aaron-harun","tag-call-to-islam-dawah","tag-community-jamaah","tag-enjoin-good-amr-bil-maruf","tag-excommunication-takfir","tag-forbearance-al-hilm","tag-imam-ahmad-ibn-hanbal","tag-jihad","tag-manners-al-adab","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-moses-musa","tag-patience-al-sabr","tag-pharaoh-firawn","tag-prayer-salat","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-reform-islah","tag-righteous-predecessors-al-salaf-al-salih","tag-sharia","tag-terrorism-al-irhab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Gz","jetpack-related-posts":[{"id":16316,"url":"https:\/\/www.abuaminaelias.com\/required-muslims-one-ruler\/","url_meta":{"origin":14171,"position":0},"title":"Muslims must only have one ruler?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not be among those who commit idolatry...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21142,"url":"https:\/\/www.abuaminaelias.com\/obedience-to-unjust-muslim-rulers\/","url_meta":{"origin":14171,"position":1},"title":"Obedience to Unjust Muslim Rulers","author":"Abu Amina Elias","date":"September 11, 2019","format":false,"excerpt":"\"There is no obedience if it is disobedience to Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15801,"url":"https:\/\/www.abuaminaelias.com\/khawarij-ideology-of-violence\/","url_meta":{"origin":14171,"position":2},"title":"Dangers of the Khawarij ideology of violence","author":"Abu Amina Elias","date":"June 24, 2014","format":false,"excerpt":"\"They will pass through the religion as an arrow pierces its target...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14785,"url":"https:\/\/www.abuaminaelias.com\/patience-with-trials-and-tribulations\/","url_meta":{"origin":14171,"position":3},"title":"Patience with trials and tribulations in Islam","author":"Abu Amina Elias","date":"August 22, 2013","format":false,"excerpt":"\"It is he who created death and life to test which of you are best in deed,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17195,"url":"https:\/\/www.abuaminaelias.com\/protection-of-non-muslim-houses-of-worship-in-islam\/","url_meta":{"origin":14171,"position":4},"title":"Protection of non-Muslim houses of worship in Islam","author":"Abu Amina Elias","date":"October 18, 2015","format":false,"excerpt":"\"The houses of worship for non-Muslim citizens should be defended by the believers.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14163,"url":"https:\/\/www.abuaminaelias.com\/obeying-law-non-muslim-countries\/","url_meta":{"origin":14171,"position":5},"title":"Obeying the law in Non-Muslim countries","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Listening to and obeying the ruler is an obligation...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14171","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14171"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14171\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}