{"id":14329,"date":"2013-07-21T13:31:00","date_gmt":"2013-07-21T09:31:00","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14329"},"modified":"2025-03-10T16:29:47","modified_gmt":"2025-03-10T12:29:47","slug":"an-nawawi-on-recommendations-for-good-clothing","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-recommendations-for-good-clothing\/","title":{"rendered":"Imam al-Nawawi on Manners of Clothing"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب استحباب الثوب الأبيض، وجواز الأحمر والأخضر والأصفر والأسود، وجوازه من قطن وكتان وشعر وصوف وغيرها إِلَاّ الحرير<\/p>\n<p>Chapter on the recommendation of white clothing, and the permissibility of red, green, yellow, and black clothing, and the permissibility of it being made of cotton, linen, hair, wool, and other materials except silk.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/247<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p align=\"right\">يَا بَنِي آدَمَ قَدْ أَنزَلْنَا عَلَيْكُمْ لِبَاسًا يُوَارِي سَوْآتِكُمْ وَرِيشًا وَلِبَاسُ التَّقْوَىٰ ذَٰلِكَ خَيْرٌ ذَٰلِكَ مِنْ آيَاتِ اللَّهِ لَعَلَّهُمْ يَذَّكَّرُونَ<\/p>\n<p><strong>O children of Adam! We have provided for you clothing to cover your nakedness and as an adornment. However, the best clothing is righteousness. This is one of Allah’s bounties, so perhaps you will be mindful.<\/strong><\/p>\n<p>Surat al-A’raf 7:26<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَاللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَالًا وَجَعَلَ لَكُم مِّنَ الْجِبَالِ أَكْنَانًا وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ وَسَرَابِيلَ تَقِيكُم بَأْسَكُمْ كَذَٰلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ<\/p>\n<p><strong>Allah has provided you shade out of what He created, and has given you shelter in the mountains. He has also provided you with clothes protecting you from the heat and cold, and armour shielding you in battle. This is how He perfects His favour upon you, so perhaps you will submit to Him.<\/strong><\/p>\n<p>Surat al-Nahl 16:81<\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الْبَسُوا مِنْ ثِيَابِكُمْ الْبَيَاضَ فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ<\/p>\n<p><strong>Clothe yourselves in white garments, for they are the best of garments, and shroud your deceased in them.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 994, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/10\/prefer-white-garments\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Imam Ibn al-Mubarak, may Allah have mercy on him, commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَبُّ إِلَيَّ أَنْ يُكَفَّنَ فِي ثِيَابِهِ الَّتِي كَانَ يُصَلِّي فِيهَا<\/p>\n<p>The most beloved to me is to shroud oneself with a white garment in which one prays.<\/p>\n<p>Source: Sunan al-Tirmidhī 2\/309<\/p><\/blockquote>\n<p>Samurah ibn Jundab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الْبَسُوا الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ<\/p>\n<p><strong>Clothe yourselves in white, for it is cleaner and purer, and shroud your deceased in it.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2810, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/26\/wearing-white-clothes\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Al-Bara’ ibn ‘Azib, may Allah have mercy on him, reported:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرْبُوعًا بَعِيدَ مَا بَيْنَ الْمَنْكِبَيْنِ لَهُ شَعَرٌ يَبْلُغُ شَحْمَةَ أُذُنِهِ رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ لَمْ أَرَ شَيْئًا قَطُّ أَحْسَنَ مِنْهُ<\/p>\n<p>The Prophet, peace and blessings be upon him, was of moderate height, with broad shoulders and hair that reached to his ears. I once saw him wearing a red mantle and I have not seen anyone more handsome than him.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3551, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/21\/prophet-handsome-red-clothing\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Juhayfah, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ وَهُوَ بِالْأَبْطَحِ فِي قُبَّةٍ لَهُ حَمْرَاءَ مِنْ أَدَمٍ فَخَرَجَ بِلَالٌ بِوَضُوئِهِ فَمِنْ نَائِلٍ وَنَاضِحٍ فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ حُلَّةٌ حَمْرَاءُ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ سَاقَيْهِ<\/p>\n<p>I came to the Prophet, peace and blessings be upon him, in Mecca while he was at al-Abtah in a red leather tent. Bilal came out with his leftover water from ablution, and some of them took it and rubbed themselves with it. The Prophet came out wearing a red mantle and I caught a glance at the skin of his shins.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 503, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/10\/red-striped-mantle\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Imam Ibn al-Qayyim commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّمَا الْحُلَّةُ الْحَمْرَاءُ بُرْدَانِ يَمَانِيَّانِ مَنْسُوجَانِ بِخُطُوطٍ حُمْرٍ مَعَ الْأَسْوَدِ كَسَائِرِ الْبُرُودِ الْيَمَنِيَّةِ وَهِيَ مَعْرُوفَةٌ بِهَذَا الِاسْمِ بِاعْتِبَارِ مَا فِيهَا مِنَ الْخُطُوطِ الْحُمْرِ وَإِلَّا فَالْأَحْمَرُ الْبَحْتُ مَنْهِيٌّ عَنْهُ أَشَدَّ النَّهْيِ<\/p>\n<p>The red mantle is only two Yemeni cloaks woven with red and black stripes, like all other Yemeni cloaks. It is known by this name because of the red lines it contains. Otherwise, purely red clothing is strictly forbidden.<\/p>\n<p>Source: Zād al-Ma’ād 1\/132<\/p><\/blockquote>\n<p>Abu Rimthah, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p align=\"right\">رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ<\/p>\n<p>I saw the Messenger of Allah, peace and blessings be upon him, wearing two green cloaks.<\/p>\n<p>Source: Sunan al-Tirmidhī 2812, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/21\/prophet-sometimes-green\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Jabir ibn Abdullah, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ وَقَالَ قُتَيْبَةُ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ بِغَيْرِ إِحْرَامٍ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, entered Mecca on the day of its liberation while wearing a black turban, without preparing to perform the pilgrimage.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1358, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/21\/prophet-makkah-black-turban\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>‘Amr ibn Hurayth, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ<\/p>\n<p>I remember looking at the Messenger of Allah, peace and blessings be upon him, while he was upon the pulpit. The Prophet had a black turban on his head with the two ends hanging between his shoulders.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1359, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/10\/prophets-turban\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Aisha, may Allah be pleased with her, reported:<\/p>\n<blockquote>\n<p align=\"right\">كُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, was shrouded for his funeral in three white cotton garments, among which was neither a shirt, nor a turban.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1264, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/21\/prophet-shrouded-janazah\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Al-Mughirah ibn Shu’bah reported: I was with the Prophet, peace and blessings be upon him, on a journey and I reached out to take off his leather socks. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعْهُمَا فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ<\/p>\n<p><strong>Leave them, for I have worn them in a state of purity.<\/strong><\/p><\/blockquote>\n<p>Al-Mughirah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَسَحَ عَلَيْهِمَا<\/p>\n<p>Then, the Prophet wiped over them for ablution.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 206, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/02\/wiping-turban-socks-wudu\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, Al-Mughirah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَسَحَ بِنَاصِيَتِهِ وَعَلَى الْعِمَامَةِ وَعَلَى الْخُفَّيْنِ<\/p>\n<p>The Prophet wiped over his forehead, his turban, and his leather socks.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 274, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَمَّا أَطْلَقَ الرَّسُولُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَمْرَ بِالْمَسْحِ عَلَى الْخِفَافِ مَعَ عِلْمِهِ بِمَا هِيَ عَلَيْهِ فِي الْعَادَةِ وَلَمْ يُشْتَرَطْ أَنْ تَكُونَ سَلِيمَةً مِنْ الْعُيُوبِ وَجَبَ حَمْلُ أَمْرِهِ عَلَى الْإِطْلَاقِ وَلَمْ يَجُزْ أَنْ يُقَيَّدَ كَلَامُهُ إلَّا بِدَلِيلِ شَرْعِيٍّ وَكَانَ مُقْتَضَى لَفْظِهِ أَنَّ كُلَّ خُفٍّ يَلْبَسُهُ النَّاسُ وَيَمْشُونَ فِيهِ فَلَهُمْ أَنْ يَمْسَحُوا عَلَيْهِ وَإِنْ كَانَ مَفْتُوقًا أَوْ مَخْرُوقًا مِنْ غَيْرِ تَحْدِيدٍ لِمِقْدَارِ ذَلِكَ فَإِنَّ التَّحْدِيدَ لَا بُدَّ لَهُ مِنْ دَلِيلٍ<\/p>\n<p>When the Prophet commanded wiping over the socks, he knew what the normal state of affairs was and he did not make it an obligation that the socks should be whole and free of any faults. His command should be taken as general in meaning and it should not be restricted unless there is a legal evidence for doing so. What is implied by the wording is that any socks that people wear and walk about in may be wiped over, even if they have holes or are worn out, without defining the acceptable extent for these holes and tears, because even such a definition would require evidence.<\/p>\n<p>Source: Majmūʻ al-Fatāwá 21\/174<\/p><\/blockquote>\n<p>Umm Salamah, may Allah be pleased with her, reported:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ أَحَبَّ الثِّيَابِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَمِيصُ<\/p>\n<p>The most beloved garment to the Prophet, peace and blessings be upon him, was the long shirt.<\/p>\n<p>Source: Sunan al-Tirmidhī 1762, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/19\/favorite-garment-qamees\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Asma&#8217; bint Yazid, may Allah be pleased with her, reported:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ كُمُّ يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الرُّسْغِ<\/p>\n<p>The sleeves of the Messenger of Allah, peace and blessings be upon him, would extend to his wrists.<\/p>\n<p>Source: Sunan al-Tirmidhī 1765, Grade: <i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/19\/prophet-sleeves-wrists\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Clothe yourselves in garments of white,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[321,18,262,319,100,207,62,179],"class_list":["post-14329","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-clothing-al-malabis","tag-community-jamaah","tag-death-mawt","tag-funerals-janazah","tag-manners-al-adab","tag-mecca-makkah","tag-prophetic-biography-sirah","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3J7","jetpack-related-posts":[{"id":14337,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-sinfulness-of-vanity-in-clothing\/","url_meta":{"origin":14329,"position":0},"title":"Imam al-Nawawi on Pride and Vanity in Clothing","author":"Abu Amina Elias","date":"July 21, 2013","format":false,"excerpt":"\"Whatever part of the garment is below the two ankles is in the Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20316,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-forenoon-prayer-salat-duha\/","url_meta":{"origin":14329,"position":1},"title":"Imam al-Nawawi on Forenoon Prayer, Salat al-Duha","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"It is enough to perform two cycles of forenoon prayer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15289,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-reconciliation-and-harmony\/","url_meta":{"origin":14329,"position":2},"title":"Imam al-Nawawi on Reconciling People","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"The believers are but one brotherhood, so make peace between your brothers.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14241,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-safeguarding-the-fast\/","url_meta":{"origin":14329,"position":3},"title":"Imam al-Nawawi on Safeguarding the Fast","author":"Abu Amina Elias","date":"July 16, 2013","format":false,"excerpt":"\"When one of you awakens in the morning for fasting...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14374,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-assembly-and-gathering\/","url_meta":{"origin":14329,"position":4},"title":"Imam al-Nawawi on Manners of Assembly and Gathering","author":"Abu Amina Elias","date":"July 23, 2013","format":false,"excerpt":"\"No people sit in a gathering without remembering Allah...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14387,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-manners-of-interpreting-dreams\/","url_meta":{"origin":14329,"position":5},"title":"Imam al-Nawawi on Interpreting Dreams","author":"Abu Amina Elias","date":"July 24, 2013","format":false,"excerpt":"\"If one of you sees a dream he likes...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14329","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14329"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14329\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14329"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14329"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14329"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}