{"id":14374,"date":"2013-07-23T15:01:46","date_gmt":"2013-07-23T11:01:46","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14374"},"modified":"2025-03-16T17:18:54","modified_gmt":"2025-03-16T13:18:54","slug":"an-nawawi-on-good-manners-of-assembly-and-gathering","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-assembly-and-gathering\/","title":{"rendered":"Imam al-Nawawi on Manners of Assembly and Gathering"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب في آداب المجلس والجليس<\/p>\n<p>Chapter on the manners of gathering and the participant.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/258<\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يُقِيمُ الرَّجُلُ الرَّجُلَ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا<\/p>\n<p><strong>A man should not be made to stand so another can sit in his place. Rather, be accommodating and make room.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6269, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/adab-make-room-to-sit\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا قَامَ الرَّجُلُ مِنْ مَجْلِسٍ ثُمَّ رَجَعَ إِلَيْهِ فَهُوَ أَحَقُّ بِهِ<\/p>\n<p><b>If a man stands from his seat and later returns it, then he is more entitled to it.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2179, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/let-him-keep-seat\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Salman-al-Farisi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَغْتَسِلُ رَجُلٌ يَوْمَ الْجُمُعَةِ وَيَتَطَهَّرُ مَا اسْتَطَاعَ مِنْ طُهْرٍ وَيَدَّهِنُ مِنْ دُهْنِهِ أَوْ يَمَسُّ مِنْ طِيبِ بَيْتِهِ ثُمَّ يَخْرُجُ فَلَا يُفَرِّقُ بَيْنَ اثْنَيْنِ ثُمَّ يُصَلِّي مَا كُتِبَ لَهُ ثُمَّ يُنْصِتُ إِذَا تَكَلَّمَ الْإِمَامُ إِلَّا غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى<\/p>\n<p><strong>No one takes a bath on Friday, purifies himself as much as he can, uses oil or perfume in his house, then proceeds for prayer and does not separate two persons sitting together, then prays as much as is written for him and remains silent while the Imam is delivering the sermon, except that his sins between this Friday and the previous will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 883, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/25\/reward-jumuah-well\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَحِلُّ لِرَجُلٍ أَنْ يُفَرِّقَ بَيْنَ اثْنَيْنِ إِلَّا بِإِذْنِهِمَا<\/p>\n<p><strong>It is not permissible for a man to separate two people in a gathering without both their permission.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2752, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/16\/not-halal-to-separate\/\"><em>Hasan<\/em><\/a><b><\/b><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">خَيْرُ الْمَجَالِسِ أَوْسَعُهَا<\/p>\n<p><strong>The best gatherings make room for the most people.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4820, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/best-gatherings-most-people\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Barzah reported: The Messenger of Allah, peace and blessings be upon him, would say some final words when intending to leave an assembly:<\/p>\n<blockquote>\n<p align=\"right\">سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ<\/p>\n<p><strong>O Allah, glory and praise be to You. I testify there is no God but You, I ask Your forgiveness, and I repent to You.<\/strong><\/p><\/blockquote>\n<p>A man once said to him, “O Messenger of Allah, you spoke words you have not in the past.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">كَفَّارَةٌ لِمَا يَكُونُ فِي الْمَجْلِسِ<\/p>\n<p><strong>It is an expiation for what is done in the assembly.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4859, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/dua-expiation-sins-assembly\/\"><em><strong>Sahih<\/strong><\/em><\/a><i><\/i><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, would not stand to leave an assembly until saying these supplications for his companions:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ وَمِنْ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا وَاجْعَلْهُ الْوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلَا تَجْعَلْ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا<\/p>\n<p><strong>O Allah, apportion us fear of You that will stop us from disobeying You, apportion us obedience to You that will allow us to reach Paradise, and apportion us conviction that will make calamities in the world easier for us to endure. Let us enjoy our hearing, our sight, and our power, as long as You let us live. Make heirs among us and let retaliation be upon those who oppress us. Support us against our enemies and let no calamity afflict our religion. Let not the world be our greatest worry, nor the extent of our knowledge, and let not the unmerciful rule over us.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3502, Grade: <i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/prophet-dua-leaving-gathering\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ جَلَسَ فِي مَجْلِسٍ فَكَثُرَ فِيهِ لَغَطُهُ فَقَالَ قَبْلَ أَنْ يَقُومَ مِنْ مَجْلِسِهِ ذَلِكَ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ إِلَّا غُفِرَ لَهُ مَا كَانَ فِي مَجْلِسِهِ ذَلِكَ<\/p>\n<p><strong>Whoever sits in a gathering and indulges in idle talk, then let him say before leaving that gathering, ‘Glory be to You, O Allah, and Your praises. I bear witness there is no God but You, I seek Your forgiveness and repent to You,’ as he will be forgiven for what happened in that gathering of his.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3433, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/dua-gathering-idle-talk\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ قَعَدَ مَقْعَدًا لَمْ يَذْكُرْ اللَّهَ فِيهِ كَانَتْ عَلَيْهِ مِنْ اللَّهِ تِرَةٌ وَمَنْ اضْطَجَعَ مَضْجَعًا لَا يَذْكُرُ اللَّهَ فِيهِ كَانَتْ عَلَيْهِ مِنْ اللَّهِ تِرَةٌ<\/p>\n<p><strong>Whoever sits in a place and does not remember Allah, he will face a consequence from Allah. Whoever lies down to sleep and does not remember Allah, he will face a consequence from Allah.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4856, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/dhikr-regret-remembering-allah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\"> مَا مِنْ قَوْمٍ يَقُومُونَ مِنْ مَجْلِسٍ لاَ يَذْكُرُونَ اللَّهَ فِيهِ إِلاَّ قَامُوا عَنْ مِثْلِ جِيفَةِ حِمَارٍ وَكَانَ لَهُمْ حَسْرَةً<\/p>\n<p><strong>No people stand up from a gathering in which they did not remember Allah but that it is as if they have risen from the carcass of a donkey, and it will cause them grief.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4855, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/01\/16\/warning-majlis\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">مَا جَلَسَ قَوْمٌ مَجْلِسًا لَمْ يَذْكُرُوا اللَّهَ فِيهِ وَلَمْ يُصَلُّوا عَلَى نَبِيِّهِمْ إِلَّا كَانَ عَلَيْهِمْ تِرَةً فَإِنْ شَاءَ عَذَّبَهُمْ وَإِنْ شَاءَ غَفَرَ لَهُمْ<\/p>\n<p><strong>No people sit in a gathering without remembering Allah, or sending blessings upon their Prophet, but that they will earn the displeasure of Allah. If Allah wills, He will punish them. If He wills, He will forgive them.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3380, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/23\/allah-displeased-if-no-dhikr\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;No people sit in a gathering without remembering Allah&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[18,26,32,48,100,54,56,134,60,62,103,66,220],"class_list":["post-14374","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-community-jamaah","tag-forgiveness-al-maghfirah","tag-hereafter-akhirah","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-prayer-salat","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-remembrance-dhikr","tag-supplication-al-dua"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3JQ","jetpack-related-posts":[{"id":12837,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-character-manners\/","url_meta":{"origin":14374,"position":0},"title":"Imam al-Nawawi on Good Character, Manners","author":"Abu Amina Elias","date":"January 30, 2013","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14387,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-manners-of-interpreting-dreams\/","url_meta":{"origin":14374,"position":1},"title":"Imam al-Nawawi on Interpreting Dreams","author":"Abu Amina Elias","date":"July 24, 2013","format":false,"excerpt":"\"If one of you sees a dream he likes...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":14374,"position":2},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14361,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-sleeping\/","url_meta":{"origin":14374,"position":3},"title":"Imam al-Nawawi on Manners of Sleeping and Resting","author":"Abu Amina Elias","date":"July 23, 2013","format":false,"excerpt":"\"Make these your last words...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13432,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-freeing-slaves\/","url_meta":{"origin":14374,"position":4},"title":"Imam al-Nawawi on Freeing Slaves","author":"Abu Amina Elias","date":"May 8, 2013","format":false,"excerpt":"\"Feed the hungry, visit the sick, and set the captives free.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14354,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-eating-and-drinking\/","url_meta":{"origin":14374,"position":5},"title":"Imam al-Nawawi on Manners of Eating and Drinking","author":"Abu Amina Elias","date":"July 22, 2013","format":false,"excerpt":"\"Let him begin in the name of Allah.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14374","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14374"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14374\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}