{"id":14427,"date":"2013-07-25T10:26:52","date_gmt":"2013-07-25T06:26:52","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14427"},"modified":"2020-07-17T22:03:22","modified_gmt":"2020-07-17T18:03:22","slug":"islam-against-racism-bigotry","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/islam-against-racism-bigotry\/","title":{"rendered":"Islam is against racism and prejudice"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>Islam is against all forms of racism and bigotry, on the basis of both revelation and reason. Racism is defined as the belief that one ethnicity is superior to another, or one color of skin is superior to another, or the people of one country are superior to another. It is a type of <em>prejudice<\/em>, to pre-judge some demographic of people based upon their benign and arbitrary physical characteristics.<\/p>\n<p>Such repugnant beliefs are the traits of pre-Islamic ignorance (<em>al-<\/em><i>jahiliyyah<\/i>). Rather, in Islam, we believe all people are born equal in the sight of Allah and the only characteristic that makes someone superior to another is righteousness (<em>al-taqwa<\/em>).<\/p>\n<p>Allah has dignified the children of Adam, all human beings in the world, with blessed provisions such as reason, intelligence, and empathy.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا<\/p>\n<p><b>We have certainly honored the children of Adam and carried them on the land and sea and provided good things for them, and We favored them over much of what We created, with decisive preference.<\/b><\/p>\n<p>Surat al-Isra&#8217; 17:70<\/p><\/blockquote>\n<p>Allah created different races and tribes so that people would recognize each other and learn from each other, not so that the races would fight each other. Ethnic diversity is part of the divine plan, a means of enrichment.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ<\/p>\n<p><b>O people, We have created you male and female and made you into nations and tribes that you may know one another. Verily, the most noble of you to Allah is the most righteous of you. Verily, Allah is knowing and aware.<\/b><\/p>\n<p>Surat al-Hujurat 49:13<\/p><\/blockquote>\n<p>In fact, Allah created different skin colors and languages as a sign of His creative power. Just as flowers come in many different colors, all as different divine signs in Allah&#8217;s creation, so do human beings come in different colors.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافُ أَلْسِنَتِكُمْ وَأَلْوَانِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّلْعَالِمِينَ<\/p>\n<p><strong>Among His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Verily, in that are signs for people of knowledge.<\/strong><\/p>\n<p>Surat al-Rum 30:22<\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ تَعَالَى خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيعِ الْأَرْضِ فَجَاءَ بَنُو آدَمَ عَلَى قَدْرِ الْأَرْضِ فَجَاءَ مِنْهُمْ الْأَحْمَرُ وَالْأَبْيَضُ وَالْأَسْوَدُ وَبَيْنَ ذَلِكَ وَالسَّهْلُ وَالْحَزْنُ وَالْخَبِيثُ وَالطَّيِّبُ<\/p>\n<p><strong>Verily, Allah Almighty created Adam from a handful which He took from the earth, so the children of Adam come in accordance with the earth. Some come with red skin, white skin, or black skin, and whatever is in between: thin, thick, dirty, and clean.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2955, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/12\/hadith-on-humanity-allah-created-all-races-from-a-single-person-adam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Righteousness is the only quality that makes someone virtuous in the sight of Allah, not race, or skin color, or lineage, or social status, or country of origin. This message against racism and tribalism was delivered by the Prophet (ṣ) during his farewell sermon, demonstrating to us how important it is in Islam.<\/p>\n<p>Abu Nadrah reported: The Messenger of Allah, peace and blessings be upon him, said in the final days of the pilgimrage:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا النَّاسُ أَلَا إِنَّ رَبَّكُمْ وَاحِدٌ وَإِنَّ أَبَاكُمْ وَاحِدٌ أَلَا لَا فَضْلَ لِعَرَبِيٍّ عَلَى أَعْجَمِيٍّ وَلَا لِعَجَمِيٍّ عَلَى عَرَبِيٍّ وَلَا لِأَحْمَرَ عَلَى أَسْوَدَ وَلَا أَسْوَدَ عَلَى أَحْمَرَ إِلَّا بِالتَّقْوَى أَبَلَّغْتُ<\/p>\n<p><strong>O people, your Lord is one and your father Adam is one. There is no favor of an Arab over a foreigner, nor a foreigner over an Arab, and neither white skin over black skin, nor black skin over white skin, except by righteousness. Have I not delivered the message?<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22978, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/30\/farewell-sermon-your-lord-is-one-your-father-is-one-your-lives-are-sacred\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Uqbah ibn Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ لأَحَدٍ عَلَى أَحَدٍ فَضْلٌ إِلا بِالدِّينِ أَوْ عَمَلٍ صَالِحٍ حَسْبُ الرَّجُلِ أَنْ يَكُونَ فَاحِشًا بَذِيًّا بَخِيلا جَبَانًا<\/p>\n<p><strong>No one is better than anyone else except by religion or good deeds. It is enough evil for a man to be profane, vulgar, greedy, or cowardly.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 4767, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/01\/04\/hadith-on-religion-no-one-is-superior-to-another-except-by-righteous-deeds\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْظُرْ فَإِنَّكَ لَيْسَ بِخَيْرٍ مِنْ أَحْمَرَ وَلَا أَسْوَدَ إِلَّا أَنْ تَفْضُلَهُ بِتَقْوَى<\/p>\n<p><strong>Behold! Verily, you have no virtue over one with white skin or black skin, except by favor of righteousness.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 20885, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/01\/04\/hadith-on-racism-no-virtue-in-skin-color-but-only-in-good-deeds\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَقُولُ الرَّجُلُ لِلرَّجُلِ أَنَا أَكْرَمُ مِنْكَ ، فَلَيْسَ أَحَدٌ أَكْرَمَ مِنْ أَحَدٍ إِلا بِتَقْوَى اللَّهِ<\/p>\n<p>A man might say to another man, &#8216;I am more noble than you,&#8217; yet no one is more noble except by the mindfulness of Allah.<\/p>\n<p>Source: al-Adab al-Mufrad 898, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/07\/04\/none-is-made-noble-except-by-being-conscious-of-allah\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Boasting about lineage and ancestors is forbidden in Islam, since all people are descended from Adam and his wife. No one is better than anyone else because of the family they were born into or the status they inherited. The only criterion of superiority is faith and righteous deeds.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\"> إِنَّ اللَّهَ قَدْ أَذْهَبَ عَنْكُمْ عُبِّيَّةَ الْجَاهِلِيَّةِ وَفَخْرَهَا بِالْآبَاءِ إِنَّمَا هُوَ مُؤْمِنٌ تَقِيٌّ وَفَاجِرٌ شَقِيٌّ النَّاسُ كُلُّهُمْ بَنُو آدَمَ وَآدَمُ خُلِقَ مِنْ تُرَابٍ<\/p>\n<p><strong>Verily, Allah has removed from you the pride of the time of ignorance with its boasting of ancestors. Verily, one is only a righteous believer or a miserable sinner. All of the people are the children of Adam, and Adam was created from dust.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3955, Grade: <strong><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/28\/hadith-on-adam-none-should-boast-about-their-ancestors-because-all-people-are-the-children-of-adam\/\">Sahih<\/a><\/i><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ قَدْ أَذْهَبَ عَنْكُمْ عُبِّيَّةَ الْجَاهِلِيَّةِ وَتَعَاظُمَهَا بِآبَائِهَا فَالنَّاسُ رَجُلَانِ بَرٌّ تَقِيٌّ كَرِيمٌ عَلَى اللَّهِ وَفَاجِرٌ شَقِيٌّ هَيِّنٌ عَلَى اللَّهِ وَالنَّاسُ بَنُو آدَمَ وَخَلَقَ اللَّهُ آدَمَ مِنْ تُرَابٍ قَالَ اللَّهُ يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُمْ مِنْ ذَكَرٍ وَأُنْثَى وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ<\/p>\n<p><strong>O people, Allah has removed the slogans of ignorance from you and the exaltation of its forefathers. The people are only two kinds: either a righteous, Godfearing believer dignified to Allah, or a wicked, miserable sinner insignificant to Allah. The people are all the children of Adam and Adam was created from dust. Allah said: O people, We have created you male and female and made you into nations and tribes that you may know one another. Verily, the most noble to Allah is the most righteous of you.<\/strong> (49:13)<\/p>\n<p>Source: Sunan al-Tirmidhī 3270, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/01\/11\/hadith-on-humanity-all-people-are-descendants-of-adam-so-no-excuse-for-boasting\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ<\/p>\n<p><strong>Whoever is slow to good deeds will not be hastened by his lineage.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/hadith-on-brotherhood-allah-helps-those-who-help-others-he-makes-easy-the-path-to-paradise-for-those-seeking-knowledge-and-he-gives-no-special-treatment-for-those-with-a-noble-lineage\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Likewise, tribalism (<a href=\"https:\/\/abuaminaelias.com\/the-ignorance-of-tribalism-and-racism-in-islam\/\"><i>al-asabiyyah<\/i><\/a>) is a horrendous sin, which is defined in Islam as loyalty to one&#8217;s tribe or family over the principles of justice. The Prophet (ṣ) disavowed himself and Islam from anyone who acts according to the various ideological and cultural manifestations of tribalism.<\/p>\n<p>Jubair ibn Mut’im reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَيْسَ مِنَّا مَنْ دَعَا إِلَى عَصَبِيَّةٍ وَلَيْسَ مِنَّا مَنْ قَاتَلَ عَلَى عَصَبِيَّةٍ وَلَيْسَ مِنَّا مَنْ مَاتَ عَلَى عَصَبِيَّةٍ<\/p>\n<p><b>He is not one of us who calls to tribalism. He is not one of us who fights for the sake of tribalism. He is not one of us who dies following the way of tribalism.<\/b><\/p>\n<p>Source: Sunan Abī Dāwūd 5102, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/19\/he-is-not-one-of-us-who-calls-to-tribalism\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Malcolm X, known by his Muslim name Al-Hajj Malik El-Shabazz, was the famous African-American activist who struggled against institutional racism in mid-20th century America. At first, he embraced a path of extremism in his confrontation with white supremacy, but his heart changed when he performed his Hajj pilgrimage to Mecca.<\/p>\n<p>In Mecca, Malcolm X saw all kinds of people of different races and ethnicities united by the Hajj pilgrimage as one brotherhood. He wrote back to his friends in Harlem, saying:<\/p>\n<blockquote><p>America needs to understand Islam, because this is the one religion that erases from its society the race problem. Throughout my travels in the Muslim world, I have met, talked to, and even eaten with people who in America would have been considered white, but the white attitude was removed from their minds by the religion of Islam. I have never before seen sincere and true brotherhood practiced by all colors together, irrespective of their color.<\/p>\n<p>During the past eleven days here in the Muslim world, I have eaten from the same plate, drunk from the same glass, and slept on the same rug, while praying to the same God, with fellow Muslims, whose eyes were the bluest of blue, whose hair was the blondest of blond, and whose skin was the whitest of white. And in the words and in the deeds of the white Muslims, I felt the same sincerity that I felt among the black African Muslims of Nigeria, Sudan and Ghana.<\/p>\n<p>We were truly all the same, because their belief in one God had removed the white from their minds, the white from their behavior, and the white from their attitude. I could see from this, that perhaps if white Americans could accept the Oneness of God, then perhaps, too, they could accept in reality the Oneness of Man, and cease to measure and hinder and harm others in terms of their differences in color.<\/p>\n<p>Source: <a href=\"http:\/\/islam.uga.edu\/malcomx.html\">Malcolm X&#8217;s Letter from Mecca<\/a><\/p><\/blockquote>\n<p>Muslims must spread this message of Islam to the peoples of the earth, who still hold onto the sicknesses of racism and tribalism. Even among some Muslims, the scourge of racism exists and persisted, despite the Prophet&#8217;s (ṣ) clear guidance. The only way to completely eradicate racism is to embrace the authentic understanding of the oneness of Allah (<i>tawhid<\/i>) and then to arrive at its logical conclusion, the oneness of humanity.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, the most noble of you to Allah is the most righteous of you.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[300,14,241,61,18,88,34,37,151,48,50,100,207,93,56,62,103,124,64,179],"class_list":["post-14427","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-adam","tag-arrogance-al-takabbur","tag-brotherhood-al-ikhwa","tag-call-to-islam-dawah","tag-community-jamaah","tag-pilgrimage-hajj","tag-humanity-al-insaaniyyah","tag-idolatry-shirk","tag-ignorance-al-jahl","tag-justice-adl","tag-knowledge","tag-manners-al-adab","tag-mecca-makkah","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-reconciliation","tag-reform-islah","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3KH","jetpack-related-posts":[{"id":18845,"url":"https:\/\/www.abuaminaelias.com\/are-arabs-master-race-in-islam\/","url_meta":{"origin":14427,"position":0},"title":"Are Arabs the master race in Islam?","author":"Abu Amina Elias","date":"February 4, 2018","format":false,"excerpt":"\"There is no favor of an Arab over a foreigner,\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23529,"url":"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/","url_meta":{"origin":14427,"position":1},"title":"Racial justice in the Quran and Sunnah","author":"Abu Amina Elias","date":"September 4, 2021","format":false,"excerpt":"\"No one is better than anyone else, except by religion or good deeds.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17588,"url":"https:\/\/www.abuaminaelias.com\/ignorance-tribalism-racism\/","url_meta":{"origin":14427,"position":2},"title":"Tribalism and racism is ignorance in Islam","author":"Abu Amina Elias","date":"January 10, 2016","format":false,"excerpt":"\"O you who believe, be persistently standing firm in justice...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13049,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-kill-apostates\/","url_meta":{"origin":14427,"position":3},"title":"Did the Prophet kill apostates who renounce Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is no compulsion in religion...\" (2:256)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13256,"url":"https:\/\/www.abuaminaelias.com\/why-does-islam-allow-polygamy\/","url_meta":{"origin":14427,"position":4},"title":"Why does Islam allow polygamy?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"You will never be able to do perfect justice between wives...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15662,"url":"https:\/\/www.abuaminaelias.com\/islam-female-genital-mutilation\/","url_meta":{"origin":14427,"position":5},"title":"Does Islam support female genital mutilation (FGM)?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Female circumcision is merely a cultural practice,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14427","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14427"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14427\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14427"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}