{"id":14532,"date":"2016-07-04T10:49:42","date_gmt":"2016-07-04T06:49:42","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14532"},"modified":"2025-07-04T10:57:40","modified_gmt":"2025-07-04T06:57:40","slug":"fight-people-until-they-become-muslims","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/fight-people-until-they-become-muslims\/","title":{"rendered":"Fight people until they become Muslims?"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>What is the meaning of the following hadith?<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ<\/p>\n<p>I have been commanded to fight people until they say there is no God but Allah and Muhammad is the Messenger of Allah&#8230;<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 25, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>This tradition refers to fighting a specific group of idolaters who were waging a war of aggression against the Muslim community. It does not mean Muslims should force people to enter Islam or fight all people in general.<\/p>\n<p>Ibn Taymiyyah commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُرَادُهُ قِتَالُ الْمُحَارِبِينَ الَّذِينَ أَذِنَ اللَّهُ فِي قِتَالِهِمْ لَمْ يُرِدْ قِتَالَ الْمُعَاهَدِينَ الَّذِينَ أَمَرَ اللَّهُ بِوَفَاءِ عَهْدِهِمْ<\/p>\n<p>The meaning of this tradition is to fight those who are waging war, whom Allah has called us to fight. It does not mean to fight those who have made peace, with whom Allah has commanded us to fulfill their peace.<\/p>\n<p>Source: Majmū’ al-Fatāwá 19\/20<\/p><\/blockquote>\n<p>We should bring together all the narrations and verses that mention the context in which the Prophet (ṣ) made this statement and interpret them comprehensively and consistently, rather than taking a single narration out of context. Other narrations make clear that &#8220;fighting the people&#8221; here refers to the Arab tribes who threatened the new Muslim community in Mecca.<\/p>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُمِرْتُ أَنْ أُقَاتِلَ الْمُشْرِكِينَ<\/p>\n<p><strong>I have been commanded to fight the idolaters&#8230;<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2642, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>On the basis of this narration, scholars understood that &#8220;people&#8221; is not general and instead refers to a specific group.<\/p>\n<p>Ibn Hajar commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ قِيلَ مُقْتَضَى الْحَدِيثِ قِتَالُ كُلِّ مَنِ امْتَنَعَ مِنَ التَّوْحِيدِ فَكَيْفَ تُرِكَ قِتَالُ مُؤَدِّي الْجِزْيَةِ وَالْمُعَاهَدِ فَالْجَوَابُ مِنْ أَوْجُهٍ &#8230; أَنْ يَكُونَ مِنَ الْعَامِّ الَّذِي خُصَّ مِنْهُ الْبَعْضُ لِأَنَّ الْمَقْصُودَ مِنَ الْأَمْرِ حُصُولُ الْمَطْلُوبِ<\/p>\n<p>If it is said that the tradition required fighting everyone who rejects monotheism, how do you leave fighting those who pay tribute or enter a peace treaty? The answer is some several angels&#8230; that the general statement is specified as it refers to the achievement of an objective.<\/p>\n<p>Source: Fatḥ al-Bārī 1\/77<\/p><\/blockquote>\n<p>This is like the statement of Allah Almighty:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ<\/p>\n<p><strong>Those to whom the people said: Indeed, the people have gathered against you&#8230;<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:173<\/p><\/blockquote>\n<p>Al-Suyuti explains this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ لَهُمُ ٱلنَّاسُ أي نعيم بن مسعود الأشجعي إِنَّ ٱلنَّاسَ أبا سفيان وأصحابه قَدْ جَمَعُواْ لَكُمْ<\/p>\n<p>&#8216;Those to whom the people said,&#8217; meaning Na&#8217;im ibn Mas&#8217;ud al-Ashja&#8217;i, &#8216;Indeed, the people,&#8217; meaning Abu Sufyan and his companions &#8216;have gathered against you,&#8217;<\/p>\n<p>Source: Tafsīr Jalālayn 3:173<\/p><\/blockquote>\n<p>In this verse, the word &#8220;the people&#8221; is used to refer to two specific groups of people. The hadith uses the term &#8220;the people&#8221; in a similarly restricted manner, as proven by other evidence.<\/p>\n<p>Furthermore, the hadith does not demand that the idolaters accept Islam on a personal religious level, but rather only to stop fighting against Islam and persecuting Muslims. In a variant of the hadith, the Prophet (ṣ) thereafter recites verses from the Quran that prohibit compulsion in religion.<\/p>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوا لَا إِلَهَ إِلَّا اللَّهُ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ<\/p>\n<p><b>I have been commanded to fight the people until they say there is no God but Allah, so when they say there is no God but Allah then their lives and wealth are protected from me, except by right of justice, and their reckoning is with Allah.<\/b><\/p><\/blockquote>\n<p>Then, the Prophet (ṣ) recited the verse:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّمَا أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ<\/p>\n<p><b>Verily, you are only a reminder. You are not over them as a dictator<\/b>. (88:22)<\/p>\n<p>Source: Ṣaḥīḥ Muslim 21, Grade: <b><i><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/12\/28\/jihad-protect-islam\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>After declaring the command to fight these specific idolaters, the Prophet (ṣ) recited verses affirming that his duty is only to deliver the message of Islam, which indicates that he was not sanctioning forced conversions.<\/p>\n<p>Ibn Rajab commented on this tradition, saying:<\/p>\n<blockquote>\n<p align=\"right\">وَالْمَعْنَى إِنَّمَا عَلَيْكَ تَذْكِيرُهُمْ بِاللَّهِ وَدَعْوَتُهُمْ إِلَيْهِ وَلَسْتَ مُسَلَّطًا عَلَى إِدْخَالِ الْإِيمَانِ فِي قُلُوبِهِمْ قَهْرًا وَلَا مُكَلَّفًا بِذَلِكَ<\/p>\n<p>The meaning is that your duty is only to remind them about Allah and to preach to them. You do not have authority to enter faith into their hearts by force and you are not responsible for that.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 1\/236<\/p><\/blockquote>\n<p>The Prophet (ṣ) was commanded by Allah to fight the idolaters in order to defend his community from their aggression, but if they stopped waging war against Islam then there was no justification for fighting them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ لِلَّهِ ۖ فَإِنِ انتَهَوْا فَلَا عُدْوَانَ إِلَّا عَلَى الظَّالِمِينَ<\/p>\n<p><b>Fight them until there is no more persecution and worship is for Allah. But if they cease, then there is to be no aggression except against the oppressors.<\/b><\/p>\n<p>Surat al-Baqarah 2:193<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا<\/p>\n<p><b>If they remove themselves from you and do not fight you and offer you peace, then Allah has not made for you a cause for fighting against them.<\/b><\/p>\n<p>Surat al-Nisa&#8217; 4:90<\/p><\/blockquote>\n<p>Hence, &#8220;the people&#8221; to be fought are only those who persist in aggression and hostility against Islam. On the contrary, Islam requires Muslims to make peace with whoever offers them terms of peace.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ<\/p>\n<p><b>If the enemy inclines to peace, then incline to it also and rely upon Allah. Verily, it is He who is the Hearing, the Knowing.<\/b><\/p>\n<p>Surat al-Anfal 8:61<\/p><\/blockquote>\n<p>Ali ibn Abi Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهُ سَيَكُونُ بَعْدِي اخْتِلَافٌ أَوْ أَمْرٌ فَإِنْ اسْتَطَعْتَ أَنْ تَكُونَ السِّلْمَ فَافْعَل<\/p>\n<p><b>Verily, after me there will be conflicts or affairs, so if you are able to end them in peace then do so.<\/b><\/p>\n<p>Source: Musnad Aḥmad 697, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/11\/29\/end-conflicts-silm-salaam\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>It was also not necessary for these idolaters to accept Islam in order to make peace with Muslims. If they discontinued their hostilities against the Muslims and sought asylum, then the Muslims were required to grant them protection and safe passage, even if they did not accept Islam on a personal level.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْلَمُونَ<\/p>\n<p><b>If any one of the idolaters seeks your protection, then grant him protection so that he may hear the words of Allah and then deliver him to his place of safety. That is because they are people who do not know.<\/b><\/p>\n<p>Surat al-Tawbah 9:6<\/p><\/blockquote>\n<p>For this reason, the scholars maintain that fighting in Islam is to repel aggression and make the world safe to practice Islam. It is not permissible in Islam to fight people simply because they are non-Muslims.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الكفار إنما يقاتلون بشرط الحراب كما ذهب اليه جمهور العلماء وكما دل عليه الكتاب والسنة<\/p>\n<p>The unbelievers are only fought on the condition that they declare war according to the majority of scholars, as is evident in the Book and Sunnah.<\/p>\n<p>Source: al-Nubūwāt 1\/140<\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمْ يُكْرِهْ أَحَدًا قَطُّ عَلَى الدِّينِ وَإِنَّمَا كَانَ يُقَاتِلُ مَنْ يُحَارِبُهُ وَيُقَاتِلُهُ وَأَمَّا مَنْ سَالَمَهُ وَهَادَنَهُ فَلَمْ يُقَاتِلْهُ وَلَمْ يُكْرِهْهُ عَلَى الدُّخُولِ فِي دِينِهِ<\/p>\n<p>The Prophet never forced the religion upon anyone, but rather he only fought those who waged war against him and fought him. As for those who made peace with him or conducted a truce, then he never fought them and he never compelled them to enter his religion<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/27\/ibn-qayyim-jihad-never-fought\/\">Hidāyat al-Ḥayārá 1\/237<\/a><\/p><\/blockquote>\n<p>In sum, the tradition under discussion refers to fighting a particular group of hostile idolaters, who had been persecuting Muslims and waging a war of aggression. It does not mean Muslims are allowed to force anyone into Islam or to fight people just because they have another religion.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The meaning is to fight those who are waging war&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[133,132,37,47,48,100,55,444,62,103,98],"class_list":["post-14532","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-covenants","tag-freedom-al-huriyyah","tag-idolatry-shirk","tag-jihad","tag-justice-adl","tag-manners-al-adab","tag-methodology-al-minhaj","tag-misconceptions","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Mo","jetpack-related-posts":[{"id":14732,"url":"https:\/\/www.abuaminaelias.com\/do-not-desire-to-fight-the-enemies-of-islam\/","url_meta":{"origin":14532,"position":0},"title":"Do not desire to fight the enemies of Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not wish to meet the enemy, but if you meet them, then be steadfast.\" --Sahih Bukhari 2863","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17835,"url":"https:\/\/www.abuaminaelias.com\/why-prophet-muhammad-raid-caravans\/","url_meta":{"origin":14532,"position":1},"title":"Why did the Prophet raid caravans?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Whoever is notorious for plunder is not one of us.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20176,"url":"https:\/\/www.abuaminaelias.com\/expel-jews-christians-arabian-peninsula\/","url_meta":{"origin":14532,"position":2},"title":"Expel Jews and Christians from Arabian Peninsula?","author":"Abu Amina Elias","date":"February 10, 2019","format":false,"excerpt":"\"Allah does not forbid you from those who did not fight you,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17171,"url":"https:\/\/www.abuaminaelias.com\/purpose-armed-jihad-islam\/","url_meta":{"origin":14532,"position":3},"title":"Purpose of armed jihad in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"He who fights to make the word of Allah highest...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12922,"url":"https:\/\/www.abuaminaelias.com\/hadith-of-gharqad-tree\/","url_meta":{"origin":14532,"position":4},"title":"Hadith of Gharqad Tree: A good deed to kill Jews in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Among the people of Moses is a community which guides by truth...\" (7:159)","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":14532,"position":5},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14532","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14532"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14532\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14532"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14532"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14532"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}