{"id":14573,"date":"2013-07-29T14:44:44","date_gmt":"2013-07-29T10:44:44","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14573"},"modified":"2025-03-18T11:59:03","modified_gmt":"2025-03-18T07:59:03","slug":"an-nawawi-adab-traveling","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-adab-traveling\/","title":{"rendered":"Imam al-Nawawi on Manners of Traveling"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب آداب السَّفَر واستحباب الدعاء في السفر<\/p>\n<p>Chapter on manners of traveling and recommendation to supplicate while traveling.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/287<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَٱلَّذِى خَلَقَ ٱلْأَزْوَٰجَ كُلَّهَا وَجَعَلَ لَكُم مِّنَ ٱلْفُلْكِ وَٱلْأَنْعَـٰمِ مَا تَرْكَبُونَ لِتَسْتَوُۥا۟ عَلَىٰ ظُهُورِهِ ثُمَّ تَذْكُرُوا۟ نِعْمَةَ رَبِّكُمْ إِذَا ٱسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا۟ سُبْحَـٰنَ ٱلَّذِى سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّآ إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ<\/p>\n<p><strong>He is the One who created all things in pairs, and made for you ships and animals to ride so that you may sit firmly on their backs, and remember your Lord’s blessings once you are settled on them, saying, &#8216;Glory be to the One Who has subjected these for us, for we could have never done so on our own, and surely to our Lord we will all return.&#8217;<\/strong><\/p>\n<p>Surat al-Zukhruf 43:12-14<\/p><\/blockquote>\n<p>Ibn Umar reported: When the Messenger of Allah, peace and blessings be upon him, would mount his camel for travel, he would exalt Allah three times and then he would say:<\/p>\n<blockquote>\n<p align=\"right\">سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى وَمِنْ الْعَمَلِ مَا تَرْضَى اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ<\/p>\n<p><strong>Glory be to Him who has made this subservient to us, for we have no power over it ourselves, and to our Lord we shall return. O Allah, we ask You during this journey for righteousness, fear of You, and such deeds that are pleasing to You. O Allah, make this journey easy for us and make the distance short for us. O Allah, You are our companion during the journey and the guardian of the family. O Allah, I seek refuge in You from the hardship of travel, ugly scenes, and an evil return to our property and family.<\/strong><\/p><\/blockquote>\n<p>When the Prophet returned, he would say these words and add to them:<\/p>\n<blockquote>\n<p align=\"right\">آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ<\/p>\n<p><b>We are those who return, those who repent, those who worship and who praise our Lord.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1342, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/prophet-dua-for-travelling\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Anas ibn Malik reported: We returned from a journey along with the Prophet, peace and blessings be upon him. When we reached the outskirts of Medina, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ<\/p>\n<p><b>We are returning and repenting, worshiping our Lord and praising Him.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3086, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dua-returning-travel-journey\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abdullah ibn Sarjis reported: The Prophet, peace and blessings be upon him, would say when he traveled:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">للَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ اللَّهُمَّ اصْحَبْنَا فِي سَفَرِنَا وَاخْلُفْنَا فِي أَهْلِنَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرَ وَكَآبَةِ الْمُنْقَلَبِ وَمِنْ الْحَوْرِ بَعْدَ الْكَوْنِ وَمِنْ دَعْوَةِ الْمَظْلُومِ وَمِنْ سُوءِ الْمَنْظَرِ فِي الْأَهْلِ وَالْمَالِ<\/p>\n<p><strong>O Allah, You are the companion on the journey and the caretaker of the family. O Allah, accompany us on our journey and take care of our families. I seek refuge in You from the hardship of travel, returning in sorrow, loss after gain, the supplication of the oppressed, and the evil glance at our families and property.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3439, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/11\/seek-refuge-in-allah-travel\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ibn Rabi&#8217;ah reported: I saw an animal being brought to Ali ibn Abu Talib, may Allah be pleased with him, for riding. When he put his foot in the stirrup, Ali said three times:<\/p>\n<blockquote>\n<p align=\"right\">بِسْمِ اللَّهِ<\/p>\n<p><b>In the Name of Allah.<\/b><\/p><\/blockquote>\n<p>When he settled himself upon its back, Ali said:<\/p>\n<blockquote>\n<p align=\"right\">الْحَمْدُ لِلَّهِ ثُمَّ قَالَ  سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ<\/p>\n<p><b>All praise is due to Allah, who has made this subservient to us, for we have no power over it, and to our Lord we will return.<\/b><\/p><\/blockquote>\n<p>Ali recited three times:<\/p>\n<blockquote>\n<p align=\"right\">الْحَمْدُ لِلَّهِ<\/p>\n<p><b>All praise is due to Allah.<\/b><\/p><\/blockquote>\n<p>And he said three times:<\/p>\n<blockquote>\n<p align=\"right\">وَاللَّهُ أَكْبَرُ<\/p>\n<p><b>Allah is the greatest.<\/b><\/p><\/blockquote>\n<p>Then, he said:<\/p>\n<blockquote>\n<p align=\"right\">سُبْحَانَكَ إِنِّي قَدْ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ<\/p>\n<p><b>Glorified are You. I have wronged myself, so forgive me, for none can forgive sins but you.<\/b><\/p><\/blockquote>\n<p>Then, he was smiling, and it was said, “Why are you smiling, O commander of the faithful?” Ali said:<\/p>\n<blockquote>\n<p align=\"right\">رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ كَمَا صَنَعْتُ ثُمَّ ضَحِكَ فَقُلْتُ مِنْ أَيِّ شَيْءٍ ضَحِكْتَ يَا رَسُولَ اللَّهِ قَالَ إِنَّ رَبَّكَ لَيَعْجَبُ مِنْ عَبْدِهِ إِذَا قَالَ رَبِّ اغْفِرْ لِي ذُنُوبِي إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ غَيْرُكَ<\/p>\n<p>I saw the Messenger of Allah, peace and blessings be upon him, doing as I have done. I asked him, &#8216;Why are you smiling?&#8217; The Prophet said, &#8216;<strong>Verily, your Lord is delighted when His servant says: O Lord, forgive my sins, for none forgives sins besides You.<\/strong>&#8216;<\/p>\n<p>Source: Sunan al-Tirmidhī 3446, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/allah-pleased-ask-forgiveness\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, whenever he returned from the armies, campaigns, Hajj, or ‘Umrah, he would exalt Allah three times at the top of every hill or plateau. Then, the Prophet would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ<\/p>\n<p><strong>There is no God but Allah alone, without any partner, who controls the dominion, deserves all praise, and has power over all things. We are returning, repenting, worshiping, prostrating to our Lord, and praising Him. Allah alone fulfilled His promise, supported His servant, and routed the Confederates.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1797, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dua-returning-hajj-umrah\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: A man said, “O Messenger of Allah, I intend to travel, so instruct me.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote><p>&nbsp;<\/p><\/blockquote>\n<blockquote>\n<p align=\"right\">عَلَيْكَ بِتَقْوَى اللَّهِ وَالتَّكْبِيرِ عَلَى كُلِّ شَرَفٍ<\/p>\n<p><b>You must be mindful of Allah and exalt Him every time you ascend a height.<\/b><\/p><\/blockquote>\n<p>As the man turned to leave, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ اطْوِ لَهُ الْأَرْضَ وَهَوِّنْ عَلَيْهِ السَّفَرَ<\/p>\n<p><strong>O Allah, shorten the distance for him and make travel easy upon him.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3445, Grade: <i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dua-prophet-travelers\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Abu Musa reported: We were with the Prophet, peace and blessings be upon him, on a journey when the people began to exalt Allah loudly. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ فَإِنَّكُمْ لَا تَدْعُونَ أَصَمَّ وَلَا غَائِبًا وَلَكِنْ تَدْعُونَ سَمِيعًا بَصِيرًا<\/p>\n<p><strong>O people, be gentle with yourselves! You are not calling upon one who is deaf or absent, rather you are calling upon the Hearing, the Seeing.<\/strong><\/p><\/blockquote>\n<p>I was behind the Prophet and I said to myself, “There is no movement or might but with Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ قُلْ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ فَإِنَّهَا كَنْزٌ مِنْ كُنُوزِ الْجَنَّةِ<\/p>\n<p><strong>O Abdullah ibn Qays, say, &#8216;There is no movement or might but with Allah,’ for it is one of the treasures of Paradise.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6384, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/02\/01\/dua-loudly-allah-sami\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote><p>&nbsp;<\/p><\/blockquote>\n<blockquote>\n<p align=\"right\">ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ لَا شَكَّ فِيهِنَّ دَعْوَةُ الْمَظْلُومِ وَدَعْوَةُ الْمُسَافِرِ وَدَعْوَةُ الْوَالِدِ عَلَى وَلَدِهِ<\/p>\n<p><strong>Three supplications are answered without a doubt: the supplication of an oppressed person, the supplication of a traveler, and the supplication of a parent over his child.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1905, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/three-dua-never-rejected\/\"><em>Hasan<\/em><\/a><b><i><\/i><\/b><\/p><\/blockquote>\n<p>Abu Musa reported: When the Prophet, peace and blessings be upon him, feared evil from people, he would say:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ<\/p>\n<p><strong>O Allah, we place You in front of them, and we seek refuge in You from their evil.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1537, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/04\/21\/dua-fear-evil-people\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Khawlah bint Hakim reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ نَزَلَ مَنْزِلًا ثُمَّ قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ شَيْءٌ حَتَّى يَرْتَحِلَ مِنْ مَنْزِلِهِ ذَلِكَ<\/p>\n<p><strong>Whoever enters a residence and then says, ‘I seek refuge in the perfect words of Allah from the evil of what He created,’ nothing will harm him until he departs from that residence.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2708, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dua-refuge-perfect-words-allah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Umar reported: Whenever the Messenger of Allah, peace and blessings be upon him, set out on a journey, he would say by nightfall:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَرْضُ رَبِّي وَرَبُّكِ اللَّهُ أَعُوذُ بِاللَّهِ مِنْ شَرِّكِ وَشَرِّ مَا فِيكِ وَشَرِّ مَا خُلِقَ فِيكِ وَمِنْ شَرِّ مَا يَدِبُّ عَلَيْكِ وَأَعُوذُ بِاللَّهِ مِنْ أَسَدٍ وَأَسْوَدَ وَمِنْ الْحَيَّةِ وَالْعَقْرَبِ وَمِنْ سَاكِنِ الْبَلَدِ وَمِنْ وَالِدٍ وَمَا وَلَدَ<\/p>\n<p><strong>O earth, my Lord and your Lord is Allah. I seek refuge in Him from your evil, from the evil you contain, from the evil created in you, and from the evil of what walks upon you. I seek refuge in Allah from lions, from serpents, from scorpions, from the inhabitants of the land, and from an evil parent and his offspring.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2603, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dua-traveling-at-night\/\"><em>Hasan<\/em><\/a><b><i><\/i><\/b><\/p><\/blockquote>\n<p>Sakhr ibn al-Ghamidi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا<\/p>\n<p><b>O Allah, bless my nation in their early morning.<\/b><\/p><\/blockquote>\n<p>Sakhr said:<\/p>\n<blockquote>\n<p align=\"right\">وَكَانَ إِذَا بَعَثَ سَرِيَّةً أَوْ جَيْشًا بَعَثَهُمْ أَوَّلَ النَّهَارِ وَكَانَ إِذَا بَعَثَ تِجَارَةً بَعَثَهُمْ أَوَّلَ النَّهَارِ فَأَثْرَى وَكَثُرَ مَالُهُ<\/p>\n<p>When the Prophet prepared a company or army, he would dispatch them at the start of the day. When he prepared a trading convoy, he would dispatch them at the start of the day and they would acquire much wealth.<\/p>\n<p>Source: Sunan al-Tirmidhī 1212, Grade: <i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/ummah-blessed-morning\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَوْ يَعْلَمُ النَّاسُ مَا فِي الْوَحْدَةِ مَا أَعْلَمُ مَا سَارَ رَاكِبٌ بِلَيْلٍ وَحْدَهُ<\/p>\n<p><strong>If people knew what I knew about traveling alone, no one would set out alone at night.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2998, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dangers-travel-alone\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Sa’id al-Khurdi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا خَرَجَ ثَلَاثَةٌ فِي سَفَرٍ فَلْيُؤَمِّرُوا أَحَدَهُمْ<\/p>\n<p><strong>Whenever three people set out on a journey, let one of them be appointed as their leader.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2608, Grade: <i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/18\/travel-appoint-leader\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Sahl ibn al-Hanzala reported: The Messenger of Allah, peace and blessings be upon him, passed by a camel whose back had fallen to its stomach. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">اتَّقُوا اللَّهَ فِي هَذِهِ الْبَهَائِمِ الْمُعْجَمَةِ فَارْكَبُوهَا صَالِحَةً وَكُلُوهَا صَالِحَةً<\/p>\n<p><strong>Fear Allah regarding these beasts. Ride them while they are healthy, and eat them while they are healthy.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2548, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/29\/fear-allah-rights-of-animals\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abdullah ibn Ja’far reported: The Messenger of Allah, peace and blessings be upon him, entered a garden among the Ansar. When a camel saw the Prophet, it started weeping and making sounds as its tears flowed. The Prophet came to it and patted it on the head, so it became silent. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ رَبُّ هَذَا الْجَمَلِ لِمَنْ هَذَا الْجَمَلُ<\/p>\n<p><b>Who is the master of this camel? To whom does it belong?<\/b><\/p><\/blockquote>\n<p>A young man from the Ansar came and said, “This is mine, O Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">أَفَلَا تَتَّقِي اللَّهَ فِي هَذِهِ الْبَهِيمَةِ الَّتِي مَلَّكَكَ اللَّهُ إِيَّاهَا فَإِنَّهُ شَكَا إِلَيَّ أَنَّكَ تُجِيعُهُ وَتُدْئِبُهُ<\/p>\n<p><strong>Do you not fear Allah in this animal whom Allah has placed in your possession? She has complained to me that you keep her hungry and tired.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2549, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/fear-allah-animals-ride\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: While we were traveling with the Prophet, peace and blessings be upon him, he said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ كَانَ مَعَهُ فَضْلُ ظَهْرٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لَا ظَهْرَ لَهُ وَمَنْ كَانَ لَهُ فَضْلٌ مِنْ زَادٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لَا زَادَ لَهُ<\/p>\n<p><strong>Whoever has a spare mount should give it to one who has no mount. Whoever has spare provisions should give them to one without provision.<\/strong><\/p><\/blockquote>\n<p>Abu Sa&#8217;id said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَذَكَرَ مِنْ أَصْنَافِ الْمَالِ مَا ذَكَرَ حَتَّى رَأَيْنَا أَنَّهُ لَا حَقَّ لِأَحَدٍ مِنَّا فِي فَضْلٍ<\/p>\n<p>The Prophet mentioned so many kinds of wealth until we thought that none of us had the right to a surplus.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1728, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/30\/sadaqah-fudul-mustahab\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Jabir ibn ‘Abdillah reported: The Messenger of Allah, peace and blessings be upon him, decided to embark on an expedition, saying:<\/p>\n<blockquote>\n<p align=\"right\">يَا مَعْشَرَ الْمُهَاجِرِينَ وَالْأَنْصَارِ إِنَّ مِنْ إِخْوَانِكُمْ قَوْمًا لَيْسَ لَهُمْ مَالٌ وَلَا عَشِيرَةٌ فَلْيَضُمَّ أَحَدُكُمْ إِلَيْهِ الرَّجُلَيْنِ أَوْ الثَّلَاثَةِ<\/p>\n<p><strong>O Muhajirun and Ansar, there are people among you who have no property or family. Let every one of you take along with him two or three men.<\/strong><\/p><\/blockquote>\n<p>Jabir, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَا لِأَحَدِنَا مِنْ ظَهْرٍ يَحْمِلُهُ إِلَّا عُقْبَةٌ كَعُقْبَةِ يَعْنِي أَحَدِهِمْ قَالَ فَضَمَمْتُ إِلَيَّ اثْنَيْنِ أَوْ ثَلَاثَةً قَالَ مَا لِي إِلَّا عُقْبَةٌ كَعُقْبَةِ أَحَدِهِمْ مِنْ جَمَلِي<\/p>\n<p>There was none of us who had a spare animal, so we took rides by turn. I took two or three men with me, and I rode my camel by with them by turns.<\/p>\n<p>Source: Sunan Abī Dāwūd 2534, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/30\/support-needy-group\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>And Jabir said:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّفُ فِي الْمَسِيرِ فَيُزْجِي الضَّعِيفَ وَيُرْدِفُ وَيَدْعُو لَهُمْ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would stay behind the caravan, encouraging the weak to catch up, letting them ride with him, and supplicating for them.<\/p>\n<p>Source: Sunan Abī Dāwūd 2639, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/18\/helps-fellow-travelers\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">السَّفَرُ قِطْعَةٌ مِنْ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ طَعَامَهُ وَشَرَابَهُ وَنَوْمَهُ فَإِذَا قَضَى نَهْمَتَهُ فَلْيُعَجِّلْ إِلَى أَهْلِهِ<\/p>\n<p><strong>Travel is a piece of torment. It prevents one of you from eating, drinking, and sleeping. When he has finished his purpose, let him quickly return to his family.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1804, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/travel-quickly-return-family\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Jabir ibn &#8216;Abdillah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا أَطَالَ أَحَدُكُمْ الْغَيْبَةَ فَلَا يَطْرُقَنَّ أَهْلَهُ لَيْلًا<\/p>\n<p><strong>If one of you is absent for a long time while traveling, let him not startle his family in the night upon his return.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5244, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/startle-surprise-scare-family\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُسَافِرَ مَسِيرَةَ يَوْمٍ وَلَيْلَةٍ لَيْسَ مَعَهَا حُرْمَةٌ<\/p>\n<p><b>It is not lawful for a woman who believes in Allah and the Last Day to travel for a day and a night without her guardian.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1088, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/woman-travel-alone-guardian-mahram\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><i><\/i><\/b><\/p><\/blockquote>\n<p>Imam al-Tirmidhi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ يَكْرَهُونَ لِلْمَرْأَةِ أَنْ تُسَافِرَ إِلَّا مَعَ ذِي مَحْرَمٍ … وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا كَانَ الطَّرِيقُ آمِنًا فَإِنَّهَا تَخْرُجُ مَعَ النَّاسِ فِي الْحَجِّ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ<\/p>\n<p>The people of knowledge act upon this. They disapprove of a woman traveling unless she is with a guardian… Some of the people of knowledge said if the road is safe, then she may go out with people for the Hajj pilgrimage; such is the opinion of Malik and Al-Shafi’i.<\/p>\n<p>Source: Sunan al-Tirmidhī 1169<\/p><\/blockquote>\n<p>Ibn Abbas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ وَلَا تُسَافِرَنَّ امْرَأَةٌ إِلَّا وَمَعَهَا مَحْرَمٌ<\/p>\n<p><strong>A man should not be alone with a woman, nor should a woman travel unless a guardian is with her.<\/strong><\/p><\/blockquote>\n<p>A man stood up and said, “O Messenger of Allah, I have been assigned to a military expedition, but my wife has already left for the Hajj pilgrimage.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">اذْهَبْ فَحُجَّ مَعَ امْرَأَتِكَ<\/p>\n<p><strong>Go and perform the pilgrimage with your wife.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3006, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/go-to-hajj-with-wife\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Glory be to Allah who has made this subservient to us&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[317,324,282,18,183,169,24,26,27,88,32,48,51,100,56,298,60,67,68,220,128],"class_list":["post-14573","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-animals","tag-blessings-al-barakah","tag-children","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-ease-yusr","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-god-fearing-taqwa","tag-pilgrimage-hajj","tag-hereafter-akhirah","tag-justice-adl","tag-leadership-imamate","tag-manners-al-adab","tag-monotheism-tawheed","tag-parents","tag-prayer-salat","tag-repentance-al-tawbah","tag-satan-al-shaytan","tag-supplication-al-dua","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3N3","jetpack-related-posts":[{"id":20316,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-forenoon-prayer-salat-duha\/","url_meta":{"origin":14573,"position":0},"title":"Imam al-Nawawi on Forenoon Prayer, Salat al-Duha","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"It is enough to perform two cycles of forenoon prayer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":10658,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-shura-istikharah\/","url_meta":{"origin":14573,"position":1},"title":"Imam al-Nawawi on Consultation and Prayer of Decision, Salat al-Istikhara","author":"Abu Amina Elias","date":"August 5, 2012","format":false,"excerpt":"\"Those who respond to their Lord, establish prayer, conduct their affairs by consultation...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14374,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-assembly-and-gathering\/","url_meta":{"origin":14573,"position":2},"title":"Imam al-Nawawi on Manners of Assembly and Gathering","author":"Abu Amina Elias","date":"July 23, 2013","format":false,"excerpt":"\"No people sit in a gathering without remembering Allah...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14361,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-sleeping\/","url_meta":{"origin":14573,"position":3},"title":"Imam al-Nawawi on Manners of Sleeping and Resting","author":"Abu Amina Elias","date":"July 23, 2013","format":false,"excerpt":"\"Make these your last words...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13432,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-freeing-slaves\/","url_meta":{"origin":14573,"position":4},"title":"Imam al-Nawawi on Freeing Slaves","author":"Abu Amina Elias","date":"May 8, 2013","format":false,"excerpt":"\"Feed the hungry, visit the sick, and set the captives free.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":14573,"position":5},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14573","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14573"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14573\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}