{"id":14749,"date":"2013-08-20T11:40:57","date_gmt":"2013-08-20T07:40:57","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14749"},"modified":"2025-03-19T10:15:53","modified_gmt":"2025-03-19T06:15:53","slug":"an-nawawi-on-tribulations-and-signs-of-the-hour","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-tribulations-and-signs-of-the-hour\/","title":{"rendered":"Imam al-Nawawi on Tribulations and Signs of the Hour"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب أحاديث الدّجال وأشراط الساعة وغيرها<\/p>\n<p>Chapter on narrations about the False Messiah, the signs of the Hour, and so on.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/503<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَا أُحَدِّثُكُمْ حَدِيثًا عَنْ الدَّجَّالِ مَا حَدَّثَ بِهِ نَبِيٌّ قَوْمَهُ إِنَّهُ أَعْوَرُ وَإِنَّهُ يَجِيءُ مَعَهُ بِمِثَالِ الْجَنَّةِ وَالنَّارِ فَالَّتِي يَقُولُ إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أُنْذِرُكُمْ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ<\/p>\n<p><strong>Shall I not tell you about the False Messiah which no prophet has told his people before? Verily, he is blind in one eye. He will come with the likeness of paradise and fire. That which he calls ‘paradise’ is the Hellfire. I have surely warned you just as Noah had warned his people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3338, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-false-messiah-fake-paradise\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Hudhayfah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَنَا أَعْلَمُ بِمَا مَعَ الدَّجَّالِ مِنْهُ مَعَهُ نَهْرَانِ يَجْرِيَانِ أَحَدُهُمَا رَأْيَ الْعَيْنِ مَاءٌ أَبْيَضُ وَالْآخَرُ رَأْيَ الْعَيْنِ نَارٌ تَأَجَّجُ فَإِمَّا أَدْرَكَنَّ أَحَدٌ فَلْيَأْتِ النَّهْرَ الَّذِي يَرَاهُ نَارًا وَلْيُغَمِّضْ ثُمَّ لْيُطَأْطِئْ رَأْسَهُ فَيَشْرَبَ مِنْهُ فَإِنَّهُ مَاءٌ بَارِدٌ وَإِنَّ الدَّجَّالَ مَمْسُوحُ الْعَيْنِ عَلَيْهَا ظَفَرَةٌ غَلِيظَةٌ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ كَاتِبٍ وَغَيْرِ كَاتِبٍ<\/p>\n<p><strong>I surely know what the False Messiah will have with him. He will have two flowing rivers, one that appears to be clear water and another that appears to be blazing fire. If one of you sees that, let him go to the river of fire, lower his gaze, put his head down, and drink from it, for it will be cool water. The False Messiah has one covered eye with thick skin over it. Written between his eyes is the word of unbelief. Every believer will be able to read it, whether he is literate or not.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2934, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/dajjal-false-messiah-evil-good\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَيْسَ مِنْ بَلَدٍ إِلَّا سَيَطَؤُهُ الدَّجَّالُ إِلَّا مَكَّةَ وَالْمَدِينَةَ لَيْسَ لَهُ مِنْ نِقَابِهَا نَقْبٌ إِلَّا عَلَيْهِ الْمَلَائِكَةُ صَافِّينَ يَحْرُسُونَهَا ثُمَّ تَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلَاثَ رَجَفَاتٍ فَيُخْرِجُ اللَّهُ كُلَّ كَافِرٍ وَمُنَافِقٍ<\/p>\n<p><strong>No land will be safe from the False Messiah except for Mecca and Medina. No passage leads to them but that it will be guarded by angels arranged in ranks. The False Messiah will appear in a barren place next to Medina, and the city will be shaken three times. Allah will expel from it every unbeliever and hypocrite.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1881, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-every-country-mecca-medina\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Umm Sharik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَيَفِرَّنَّ النَّاسُ مِنْ الدَّجَّالِ فِي الْجِبَالِ<\/p>\n<p><strong>The people will flee from the False Messiah into the mountains.<\/strong><\/p><\/blockquote>\n<p>She said, “O Messenger of Allah, where will the Arabs be on that day?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">هُمْ قَلِيلٌ<\/p>\n<p><b>They will be few.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2945, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/dajjal-people-flee-to-mountains\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>&#8216;Imran ibn Husayn reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ السَّاعَةِ خَلْقٌ أَكْبَرُ مِنْ الدَّجَّالِ<\/p>\n<p><strong>Nothing between the creation of Adam until the establishment of the Hour is a greater tribulation than the False Messiah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2946, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-tribulation-false-messiah-greatest\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Al-Mughira ibn Shu’bah reported: The Messenger of Allah, peace and blessings be upon him, was asked about the False Messiah more than anything else. The Prophet said to me:<\/p>\n<blockquote>\n<p align=\"right\">أَيْ بُنَيَّ وَمَا يُنْصِبُكَ مِنْهُ إِنَّهُ لَنْ يَضُرَّكَ<\/p>\n<p><b>O my son, why are you worrying about him? He will not harm you.<\/b><\/p><\/blockquote>\n<p>I said, “The people will imagine he has flowing rivers and mountains of bread with him.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ<\/p>\n<p><strong>He is too insignificant to Allah to harm you with that.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7122, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/dajjal-false-messiah-harm-believers\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Al-Qadi ‘Iyad commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَاهُ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ أَنْ يَجْعَلَ مَا خَلَقَهُ اللَّهُ تَعَالَى عَلَى يَدِهِ مُضِلًّا لِلْمُؤْمِنِينَ وَمُشَكِّكًا لِقُلُوبِهِمْ بَلْ إِنَّمَا جَعَلَهُ لَهُ لِيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا وَيُثْبِتَ الْحُجَّةَ عَلَى الْكَافِرِينَ وَالْمُنَافِقِينَ وَنَحْوِهِمْ<\/p>\n<p>The meaning is he is too insignificant to Allah Almighty to make what Allah creates at his hand a cause of misguidance for believers and doubts in their hearts. He only makes it increase the faith of those who believe and an indictment against the unbelievers, hypocrites, and those like them.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 18\/74<\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَمَكْتُوبٌ بَيْنَ عَيْنَيْهِ ك ف ر<\/p>\n<p><strong>No prophet was sent but that he warned his nation of the one-eyed liar. Verily, he is blind in one eye while your Lord is not, and between his two eyes is written the word of unbelief.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7131, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/19\/dajjal-false-messiah-blind-one-eye\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><i><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَقُومُ السَّاعَةُ حَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ<\/p>\n<p><strong>The Hour will not be established until a man passes by the grave of another man and he says, &#8216;Would that I were in his place!&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7115, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/18\/people-wish-death-hour\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><i><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًا<\/p>\n<p><strong>Soon the Euphrates River will disclose a treasure of gold. Whoever witnesses it, let him not take anything from it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7119, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/sign-hour-killing-gold\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَقُومُ السَّاعَةُ حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ يَقْتَتِلُ النَّاسُ عَلَيْهِ فَيُقْتَلُ مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ وَيَقُولُ كُلُّ رَجُلٍ مِنْهُمْ لَعَلِّي أَكُونُ أَنَا الَّذِي أَنْجُو<\/p>\n<p><strong>The Hour will not be established until the Euphrates river uncovers a mountain of gold and people will fight over it. Every ninety-nine people out of a hundred will be killed, and each man among them will say, &#8216;Perhaps I will be the one who is saved!&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2894, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/sign-hour-killing-gold\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَكُونُ فِي آخِرِ الزَّمَانِ خَلِيفَةٌ يَقْسِمُ الْمَالَ وَلَا يَعُدُّهُ<\/p>\n<p><strong>There will be a Caliph near the end of time who will distribute wealth without counting it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2913, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/prosperity-before-end-of-time\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ يَطُوفُ الرَّجُلُ فِيهِ بِالصَّدَقَةِ مِنْ الذَّهَبِ ثُمَّ لَا يَجِدُ أَحَدًا يَأْخُذُهَا مِنْهُ وَيُرَى الرَّجُلُ الْوَاحِدُ يَتْبَعُهُ أَرْبَعُونَ امْرَأَةً يَلُذْنَ بِهِ مِنْ قِلَّةِ الرِّجَالِ وَكَثْرَةِ النِّسَاءِ<\/p>\n<p><strong>A time will come to people when a man will go around with gold to give in charity, but he will find no one to accept it, and a single man will be seen followed by forty women seeking refuge with him, due to the scarcity of men and abundance of women.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1414, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/14\/many-women-few-men-hour\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Mirdas al-Aslami reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَذْهَبُ الصَّالِحُونَ الْأَوَّلُ فَالْأَوَّلُ وَيَبْقَى حُفَالَةٌ كَحُفَالَةِ الشَّعِيرِ أَوْ التَّمْرِ لَا يُبَالِيهِمْ اللَّهُ بَالَةً<\/p>\n<p><strong>Righteous people will be taken away, one after another, until only the dregs of society will remain like the sediment of barley or dates. Allah will have no esteem for them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6434, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/disappearance-righteous-sign-hour\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا أَرَادَ اللَّهُ بِقَوْمٍ عَذَابًا أَصَابَ الْعَذَابُ مَنْ كَانَ فِيهِمْ ثُمَّ بُعِثُوا عَلَى أَعْمَالِهِمْ<\/p>\n<p><strong>When Allah intends to punish a people, the punishment afflicts everyone among them. Then, they are resurrected according to their deeds.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7108, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/allah-punish-entire-nation\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا ضُيِّعَتْ الْأَمَانَةُ فَانْتَظِرْ السَّاعَةَ<\/p>\n<p><b>When trust is lost, then wait for the Hour.<\/b><\/p><\/blockquote>\n<p>He said, “O Messenger of Allah, how will it be lost?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا أُسْنِدَ الْأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرْ السَّاعَةَ<\/p>\n<p><b>When authority is given to those who do not deserve it, then wait for the Hour.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6496, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/11\/09\/tyranny-look-for-the-hour\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;When trust is lost, then wait for the Hour.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[300,122,16,17,20,183,262,135,32,95,246,51,100,207,316,302,134,58,98,128],"class_list":["post-14749","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-adam","tag-angels-malaikah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-hypocrisy-al-nifaq","tag-intention-al-niyyah","tag-leadership-imamate","tag-manners-al-adab","tag-mecca-makkah","tag-medina-madinah","tag-noah-nuh","tag-paradise-jannah","tag-patience-al-sabr","tag-unbelief-al-kufr","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3PT","jetpack-related-posts":[{"id":15651,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-integrity-istiqamah\/","url_meta":{"origin":14749,"position":0},"title":"Imam al-Nawawi on Integrity, Steadfastness","author":"Abu Amina Elias","date":"April 16, 2014","format":false,"excerpt":"\"Remain upright as you are commanded.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15295,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-kindness-to-neighbors\/","url_meta":{"origin":14749,"position":1},"title":"Imam al-Nawawi on Kindness to Neighbors","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Be good to... the near neighbor and the distant neighbor.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14845,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-walking-to-the-mosque\/","url_meta":{"origin":14749,"position":2},"title":"Imam al-Nawawi on Walking to the Mosque","author":"Abu Amina Elias","date":"August 29, 2013","format":false,"excerpt":"\"Give glad tidings to those who walk to the mosque in darkness,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21491,"url":"https:\/\/www.abuaminaelias.com\/fitnah-al-masiha-al-dajjal\/","url_meta":{"origin":14749,"position":3},"title":"Tribulation of the False Messiah, al-Masiha al-Dajjal","author":"Abu Amina Elias","date":"December 5, 2019","format":false,"excerpt":"\"Know that your Lord does not have one eye.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21235,"url":"https:\/\/www.abuaminaelias.com\/ten-ayat-surah-kahf-dajjal\/","url_meta":{"origin":14749,"position":4},"title":"Ten verses of Surat al-Kahf to protect from Dajjal","author":"Abu Amina Elias","date":"September 20, 2019","format":false,"excerpt":"\"Whoever contemplates them will not be misled by the trials of the False Messiah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12837,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-character-manners\/","url_meta":{"origin":14749,"position":5},"title":"Imam al-Nawawi on Good Character, Manners","author":"Abu Amina Elias","date":"January 30, 2013","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14749","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14749"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14749\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14749"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14749"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14749"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}