{"id":14837,"date":"2016-07-04T10:49:36","date_gmt":"2016-07-04T06:49:36","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14837"},"modified":"2025-07-04T10:58:28","modified_gmt":"2025-07-04T06:58:28","slug":"permissible-to-curse-people","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/permissible-to-curse-people\/","title":{"rendered":"Is it permissible to curse people in Islam?"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>Are Muslims allowed to curse people? A “curse” in the Islamic context means a request for someone to be deprived of the mercy of Allah. According to classical lexicographer Ibn Manzur:<\/p>\n<blockquote>\n<p align=\"right\">وَاللَّعْنُ الْإِبْعَادُ وَالطَّرْدُ مِنَ الْخَيْرِ وَقِيلَ الطَّرْدُ وَالْإِبْعَادُ مِنَ اللَّهِ وَمِنَ الْخَلْقِ السَّبُّ وَالدُّعَاءُ<\/p>\n<p>Cursing means to be expelled and removed from goodness. It is said it is a condemnation and supplication for expulsion and removal from Allah and from the creation.<\/p>\n<p>Source: Lisān al-&#8216;Arab 13\/387<\/p><\/blockquote>\n<p>It is not permissible for a Muslim to curse a specific person, animal, or object by name. It is only permissible to curse wrongdoers or oppressors in a general sense without mentioning their proper names.<\/p>\n<p>Abdullah ibn Umar reported: He heard the Messenger of Allah, peace and blessings be upon him, raising his head from the last bowing in dawn prayer and saying:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ الْعَنْ فُلَانًا وَفُلَانًا وَفُلَانًا<\/p>\n<p><b>O Allah, curse this person and this person. <\/b><\/p><\/blockquote>\n<p>Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p align=\"right\">لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ<\/p>\n<p><b>You do not have any decision in the matter whether He will forgive them or punish them. Verily, they are wrongdoers.<\/b> (3:128)<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4559, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/29\/cursing-by-name-laan\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>After this incident, the Prophet (ṣ) would not curse specific people by name and he warned us not to indulge in curses.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, would not abuse others, he would not use obscene words, and he would not curse others. If he wanted to admonish anyone of us, he used to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا لَهُ تَرِبَ جَبِينُهُ<\/p>\n<p><b>What is wrong with him? His forehead be dusted!<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6031, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/31\/how-prophet-criticized-people\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\"> لَا يَنْبَغِي لِصِدِّيقٍ أَنْ يَكُونَ لَعَّانًا<\/p>\n<p><strong>It is not befitting the truthful that they are in the habit of cursing others.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2597, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/09\/siddeeq-cursing\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>It is also impossible for us to know the fate of a specific sinner or unbeliever, unless it is mentioned by divine revelation, so cursing someone in the sense of asking Allah to deprive them of mercy is a futile gesture, especially if they are believers.<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعلم أن لعن المسلم المصونِ حرامٌ بإجماع المسلمين ويجوزُ لعنُ أصحابِ الأوصافِ المذمومةِ كقولك لعن الله الظالمين … لأن اللعن هو الإبعادُ عن رحمةِ الله تعالى وما ندري ما يختم به لهذا الفاسقِ أو الكافر<\/p>\n<p>Know that cursing a protected Muslim is forbidden by consensus of the Muslims. It is permissible to curse people with blameworthy characteristics (without naming them), such as saying: The curse of Allah is upon the wrongdoers… For to curse is to distance someone from the mercy of Allah Almighty, and we do not know what was the fate of this sinner, or this unbeliever.<\/p>\n<p>Source: al-Adhkār lil-Nawawī 1\/560<\/p><\/blockquote>\n<p>On one occasion, the Prophet (ṣ) refused to curse the idolaters who were persecuting the Muslims at the time. These were the idolaters that harmed Muslims and if any creature deserved to be curses, it was them, but the Prophet (ṣ) refrained from doing so.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, was told, “O Messenger of Allah, pray against the idolaters!” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً<\/p>\n<p><b>Verily, I was not sent to invoke curses, but rather I was only sent as a mercy.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2599, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/04\/07\/mercy-to-the-worlds\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Likewise, it is not permissible to curse specific animals or objects by name. How much more so does this apply to people?<\/p>\n<p>Abu Barzah al-Aslami reported: A young woman was riding a camel upon which was people’s luggage. When she saw the Prophet, peace and blessings be upon him, and the pass of the mountain became narrow, the woman said to the camel, “Go ahead!” When it did not move, she said, “O Allah, curse it!” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تُصَاحِبْنَا نَاقَةٌ عَلَيْهَا لَعْنَةٌ<\/p>\n<p><b>We will not be accompanied by a camel that has been cursed.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2596, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/09\/not-cursing-animals\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>There are numerous dangers that arise from cursing people without right. Those who indulged in curses will not be granted the honor of interceding or witnessing on the Day of Resurrection.<\/p>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَكُونُ اللَّعَّانُونَ شُفَعَاءَ وَلَا شُهَدَاءَ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Those in the habit of cursing others will not be intercessors or witnesses on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2595, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/14\/curses-not-intercessors\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>If a Muslim curses another person who does not deserve it, then that curse will return against him in this life and in the Hereafter.<\/p>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الْعَبْدَ إِذَا لَعَنَ شَيْئًا صَعِدَتْ اللَّعْنَةُ إِلَى السَّمَاءِ فَتُغْلَقُ أَبْوَابُ السَّمَاءِ دُونَهَا ثُمَّ تَهْبِطُ إِلَى الْأَرْضِ فَتُغْلَقُ أَبْوَابُهَا دُونَهَا ثُمَّ تَأْخُذُ يَمِينًا وَشِمَالًا فَإِذَا لَمْ تَجِدْ مَسَاغًا رَجَعَتْ إِلَى الَّذِي لُعِنَ فَإِنْ كَانَ لِذَلِكَ أَهْلًا وَإِلَّا رَجَعَتْ إِلَى قَائِلِهَا<\/p>\n<p><strong>Verily, when a servant curses something, the curse rises to the heaven and the gates of heaven close upon it. It turns right and left and if it does not find a place to go, it will return to that which was cursed, only if it deserved to be curse; otherwise the curse will return upon the one who made it.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4905, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/09\/unjust-curse-backfires\/\"><i>Hasan<\/i><\/a><\/p><\/blockquote>\n<p>Only Allah knows if a person is truly deserving of His curse, so a Muslim who curses others is taking a serious risk. For this reason, the reality is that most people who curse others are actually cursing themselves.<\/p>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p align=\"right\">‏ لُعِنَ اللَّعَّانُونَ<\/p>\n<p>Those who curse others are themselves cursed.<\/p>\n<p>Source: al-Adab al-Mufrad 315<i><\/i><\/p><\/blockquote>\n<p>It is only permissible to curse wrongdoers in general without specifying their names, as is done several times in the Quran and Sunnah to warn people about their evil deeds.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ<\/p>\n<p><b>Is not the curse of Allah upon the oppressors?<\/b><\/p>\n<p>Surat Hud 11:18<\/p><\/blockquote>\n<p>This can be an effective way to warn people indirectly. If we see someone committing a major sin, we can say, “Allah has cursed those who do this.” So we mention that Allah has cursed the deed, but we do not curse the individual directly. The intention is not harm the individual with curses, rather to guide them through admonitions.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَعَنَ اللَّهُ آكِلَ الرِّبَا وَمُوكِلَهُ وَشَاهِدَيْهِ وَكَاتِبَهُ مَا ظَهَرَ فِي قَوْمٍ الرِّبَا وَالزِّنَا إِلَّا أَحَلُّوا بِأَنْفُسِهِمْ عِقَابَ اللَّهِ عَزَّ وَجَلَّ<\/p>\n<p><strong>Allah has cursed the one who consumes usury, its client, its witness, and its recorder. Usury and adultery do not become widespread among people but that they will become vulnerable to the punishment of Allah Almighty.<\/strong><b><i><\/i><\/b><\/p>\n<p>Source: Musnad Aḥmad 3799, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/03\/riba-cursed\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Sometimes we get angry and feel very strongly that we want to curse whoever has wronged us. Even the Prophet (ṣ) would get angry and sometimes curse people, but he would expiate this deed for himself by asking Allah to have mercy upon whoever he cursed in his anger.<\/p>\n<p>Salman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَيُّمَا رَجُلٍ مِنْ أُمَّتِي سَبَبْتُهُ سَبَّةً أَوْ لَعَنْتُهُ لَعْنَةً فِي غَضَبِي فَإِنَّمَا أَنَا مِنْ وَلَدِ آدَمَ أَغْضَبُ كَمَا يَغْضَبُونَ وَإِنَّمَا بَعَثَنِي رَحْمَةً لِلْعَالَمِينَ فَاجْعَلْهَا عَلَيْهِمْ صَلَاةً يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>If I scold a man among my nation, or I curse him in my anger, then know that I am only a son of Adam. I get angry as they do. Verily, I was only sent as a mercy to the worlds, so turn these curses into blessings on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4659, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/03\/curses-blessings-mercy\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>In general, it should not be the habit of the believers supplicate for evil such as invoking the curse of Allah, the punishment of Allah, or the Hellfire.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَدْعُ الْإِنسَانُ بِالشَّرِّ دُعَاءَهُ بِالْخَيْرِ ۖ وَكَانَ الْإِنسَانُ عَجُولًا<\/p>\n<p><strong>Man supplicates for evil as he supplicates for good, for man is ever hasty.<\/strong><\/p>\n<p>Surat al-Isra&#8217; 17:11<\/p><\/blockquote>\n<p>Samrah ibn Jundab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَلَاعَنُوا بِلَعْنَةِ اللَّهِ وَلَا بِغَضَبِهِ وَلَا بِالنَّارِ<\/p>\n<p><strong>Do not curse each other with the curse of Allah, nor his wrath, nor the Hellfire.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1976, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/24\/do-not-invoke-nar-jahannam\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>A Muslim should never desire for others to be destroyed. The Prophets were all sent to their people with sincere goodwill and a desire to save their people from the Hellfire. They taught us to love for our neighbors what we love for ourselves, and we would never love destruction upon ourselves, so we should never love it upon anyone else.<\/p>\n<p>In sum, Muslims may not curse specific people or animals by name. It is only permissible to curse wrongdoers in a general sense without naming them. If one does curse another person in anger, they should expiate this slip by supplicating for Allah to grant them mercy, especially if they are Muslim believers.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not invoke the curse of Allah&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[300,317,16,183,30,135,32,48,52,311,100,54,60,196,45,220,189,73],"class_list":["post-14837","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adam","tag-animals","tag-character-akhlaq","tag-day-of-resurrection-yawm-al-qiyammah","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-justice-adl","tag-love-al-mahabbah","tag-malice-hiqd","tag-manners-al-adab","tag-mercy-al-rahmah","tag-prayer-salat","tag-prophetic-virtues","tag-quran-exegesis-tafsir","tag-supplication-al-dua","tag-trade-al-baya","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Rj","jetpack-related-posts":[{"id":25684,"url":"https:\/\/www.abuaminaelias.com\/supplication-oppressed-limits\/","url_meta":{"origin":14837,"position":0},"title":"Supplication Against Oppressors and its Limits","author":"Abu Amina Elias","date":"July 8, 2025","format":false,"excerpt":"\"Whoever pardons and seeks reconciliation, their reward is with Allah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14856,"url":"https:\/\/www.abuaminaelias.com\/beware-of-transgression-and-exaggeration-in-supplication\/","url_meta":{"origin":14837,"position":1},"title":"Beware of exaggeration in supplication","author":"Abu Amina Elias","date":"September 2, 2013","format":false,"excerpt":"\"There will be people who will transgress in supplication, so beware not to be one of them.\" --Sunan Abu Dawud 1480","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23179,"url":"https:\/\/www.abuaminaelias.com\/eid-dua-taqabbal-allahu-minna-wa-minkum\/","url_meta":{"origin":14837,"position":2},"title":"Eid Supplication: May Allah accept from us and from you","author":"Abu Amina Elias","date":"May 11, 2021","format":false,"excerpt":"\"May Allah accept good deeds from us and from you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18417,"url":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","url_meta":{"origin":14837,"position":3},"title":"Praying for enemies in Islam","author":"Abu Amina Elias","date":"November 2, 2016","format":false,"excerpt":"\"I was not sent to invoke curses, but rather I was only sent as mercy.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18273,"url":"https:\/\/www.abuaminaelias.com\/beware-dua-of-the-oppressed\/","url_meta":{"origin":14837,"position":4},"title":"Beware the Supplication of the Oppressed","author":"Abu Amina Elias","date":"June 14, 2016","format":false,"excerpt":"\"Injustice will be darkness on the Day of Resurrection.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23056,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-dua-to-allah\/","url_meta":{"origin":14837,"position":5},"title":"Imam al-Mundhiri on Supplication to Allah","author":"Abu Amina Elias","date":"April 26, 2021","format":false,"excerpt":"\"Supplication is worship itself,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14837","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14837"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14837\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14837"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14837"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14837"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}