{"id":14907,"date":"2016-07-04T10:49:37","date_gmt":"2016-07-04T06:49:37","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14907"},"modified":"2025-07-04T10:58:18","modified_gmt":"2025-07-04T06:58:18","slug":"most-restrained-killing-believers","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/most-restrained-killing-believers\/","title":{"rendered":"Most restrained in killing are believers"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>The most restrained and forgiving of people when it comes to killing are the true believers.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ<\/p>\n<p><b>The most restrained of the people in killing are the people of faith.<\/b><\/p>\n<p>Source: Musnad Ahmad 3720, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/27\/hadith-on-mercy-the-most-pardoning-of-people-regarding-killing-are-the-people-of-faith\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The right to life is one of the most important objectives of Islamic law (<i>maqasid ash-sharia<\/i>).<\/p>\n<p>Al-Ghazali, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p align=\"right\">لكننا نعنى بالمصلحة المحافظة على مقصود الشرع ومقصود الشرع من الخلق خمسة وهو أن يحفظ عليهم دينهم وأنفسهم وعقلهم ونسلهم ومالهم فكل ما يتضمن حفظ هذه الأصول الخمسة فهو مصلحة وكل ما يفوت هذه الأصول الخمسة فهو مفسدة<\/p>\n<p>Welfare which we mean here is the protection of the objectives of the Sharia. Namely, the objectives of the Sharia are five in creation: the protection of religion, life, intellect, family relations, and property. Everything that advances the protection of these five fundamentals is considered benefit, and everything which fails to protect these five fundamentals is considered corruption.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/al-ghazali-the-objectives-of-the-sharia-are-the-protection-of-religion-life-intellect-family-and-property\/\">Al-Mustasfa min Ilm al-Usul 287<\/a><\/p><\/blockquote>\n<p>This means the believers fear Allah regarding the right of life for others. They are the furthest of the people from those who murder the innocent because they know whoever kills a single soul unjustly is as if he has killed all mankind.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">مِنْ أَجْلِ ذَٰلِكَ كَتَبْنَا عَلَىٰ بَنِي إِسْرَائِيلَ أَنَّهُ مَن قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ أَوْ فَسَادٍ فِي الْأَرْضِ فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا وَمَنْ أَحْيَاهَا فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا<\/p>\n<p><b>For that We decreed for the children of Israel that whoever kills a soul, unless to punish murder or prevent corruption in the land, then it is as if he has killed all mankind together. And whoever saves a soul is as if he has saved all mankind together.<\/b><\/p>\n<p>Surah Al-Ma’idah 5:32<\/p><\/blockquote>\n<p>Whoever kills a single person unjustly has implicitly endorsed every murder in history, so he will be blamed on the Day of Judgment as if he had a part in the murder of every human being. They will be like Cain, the son of Adam, who has a share of sin for every murder committed by criminals because he was the first to initiate the practice of murder.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُقْتَلُ نَفْسٌ ظُلْمًا إِلَّا كَانَ عَلَى ابْنِ آدَمَ الْأَوَّلِ كِفْلٌ مِنْ دَمِهَا لِأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ<\/p>\n<p><b>No person is wrongfully killed except that some of the burden falls upon the son of Adam, because he was the first to establish the practice of murder.<\/b><\/p>\n<p>Source: Sahih Bukhari 3158, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/27\/hadith-on-bloodshed-the-son-of-adam-cain-shares-the-burden-of-every-murder-because-he-started-the-practice-of-unlawful-killing\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Indeed, the first matters to be judged on the Day of Judgment regarding the rights of people will be the cases of murder.<\/p>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ فِي الدِّمَاءِ<\/p>\n<p><b>The first matters to be judged between people will be cases of murder.<\/b><\/p>\n<p>Source: Sahih Bukhari 6471, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/11\/24\/the-first-judgments-on-judgment-day-will-be-cases-of-murder\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In fact, the Prophet warned us about the coming conflicts and he encouraged us to avoid bloodshed as much as possible.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ أَفْلَحَ مَنْ كَفَّ يَدَهُ<\/p>\n<p><strong>Woe to the Arabs from the evil which is approaching! He has succeeded who has restrained his hand from fighting<\/strong>.<\/p>\n<p>Source: Sunan Abu Dawud 4249, Grade: <a href=\"https:\/\/abuaminaelias.com\/the-most-restrained-in-killing-are-the-believers\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>For these reasons, the believers fear Allah and diligently avoid this terrible sin.<\/p>\n<p>However, even when taking of life is justified in self-defense or to punish major crimes, the believers still behave with restraint and pardon, forgiving criminals when possible and punishing them only when absolutely necessary.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">ادْرَءُوا الْحُدُودَ عَنْ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِنْ كَانَ لَهُ مَخْرَجٌ فَخَلُّوا سَبِيلَهُ فَإِنَّ الْإِمَامَ أَنْ يُخْطِئَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يُخْطِئَ فِي الْعُقُوبَةِ<\/p>\n<p><b>Avoid applying legal punishment upon the Muslims if you are capable. If the criminal has a way out, then leave him to his way. Verily, it is better for the leader to make a mistake forgiving the criminal than it is for him to make a mistake punishing the innocent.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1424, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/23\/hadith-on-pardon-it-is-better-for-the-leader-to-err-in-forgiveness-than-in-punishment\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In Islamic law, the families of the murder victim reserve the right to forgive the criminal and avoid applying the death penalty in favor of another punishment such as a fine or imprisonment. The Prophet would always encourage the victims to forgive the criminal and defer capital punishment.<\/p>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p align=\"right\">مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُفِعَ إِلَيْهِ شَيْءٌ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ<\/p>\n<p>I never saw a case involving legal retaliation being referred to the Messenger of Allah, peace and blessings be upon him, except that he would command pardoning the criminal.<\/p>\n<p>Source: Sunan Abu Dawud 4497, Source: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/12\/hadith-on-mercy-the-messenger-of-allah-always-recommended-that-people-forgive-their-oppressors\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The Prophet would even defer capital punishment upon those who committed armed treason against the Muslim community if a single Muslim sought protection for the criminal.<\/p>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p align=\"right\">وَهُوَ عَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ أَبِي سَرْحٍ الَّذِي كَانَ عَلَى مِصْرَ كَانَ يَكْتُبُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَزَلَّهُ الشَّيْطَانُ فَلَحِقَ بِالْكُفَّارِ فَأَمَرَ بِهِ أَنْ يُقْتَلَ يَوْمَ الْفَتْحِ فَاسْتَجَارَ لَهُ عُثْمَانُ بْنُ عَفَّانَ فَأَجَارَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>Abdullah ibn Sa’d ibn Abu Sarh, who was in Egypt, would write to the Messenger of Allah, peace and blessings be upon him, but the devil deceived him and he joined the unbelievers. The Messenger of Allah ordered that he should be killed on the day of liberation, but Uthman ibn Affan sought protection for him, so the Messenger of Allah granted him protection.<\/p>\n<p>Source: Sunan An-Nasa’i 4069, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/15\/hadith-on-pardon-the-prophet-pardons-a-man-who-became-apostate-and-joined-the-enemy-army\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The Muslims who are attacking and indiscriminately killing civilians in the name of “jihad” are committing the worst of crimes. The Prophet has disowned himself from such people.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِعَصَبَةٍ أَوْ يَدْعُو إِلَى عَصَبَةٍ أَوْ يَنْصُرُ عَصَبَةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلاَ يَتَحَاشَ مِنْ مُؤْمِنِهَا وَلاَ يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ<\/p>\n<p><b>Whoever fights under the banner of one who is blind, raging for the sake of tribalism, or calling to tribalism, or supporting tribalism, and is killed will have died upon ignorance. Whoever rebels against my nation, striking the righteous and wicked alike and sparing not even the believers and does not fulfill the pledge of security, then he has nothing to do with me and I have nothing to do with him.<\/b><\/p>\n<p>Source: Sahih Muslim 1848, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/14\/hadith-on-tribalism-whoever-fights-against-muslims-for-the-sake-of-tribal-bigotry-i-have-nothing-to-do-with-him\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Rather, the believers take life when it is the only way to prevent a greater harm. When they do so, they implement justice solemnly without boasting or taking joy in it, as it is a duty and not a pleasure.<\/p>\n<p>Shadid ibn Aws reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ فَلْيُرِحْ ذَبِيحَتَهُ<\/p>\n<p><b>Verily, Allah has prescribed excellence in everything, so if you kill then kill in the best manner and if you slaughter then slaughter in the best manner. Let one of you sharpen his knife so his animal feels no pain.<\/b><\/p>\n<p>Source: Sahih Muslim 1955, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/07\/hadith-on-excellence-allah-prescribes-excellence-so-slaughter-well-such-that-the-animal-feels-no-pain\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The believers should never, under any circumstances, gloat or boast or rejoice when life is taken, even in justice. Likewise, they should never rejoice when misfortune strikes anyone.<\/p>\n<p>Wathila ibn Al-Asqa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تُظْهِرْ الشَّمَاتَةَ لِأَخِيكَ فَيَرْحَمَهُ اللَّهُ وَيَبْتَلِيكَ<\/p>\n<p><b>Do not rejoice over your brother’s misfortune, lest Allah have mercy upon him and subject you to trials.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2506, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/09\/16\/hadith-on-calamity-do-not-gloat-over-your-brothers-hardship\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Therefore, we ask Allah the Exalted to protect the lives of the innocent, to help us implement justice in the best manner, and to forgive our community for our sins.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The most restrained of the people in killing are the people of faith.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[300,13,317,16,18,183,22,25,26,32,34,153,47,48,51,100,54,55,93,56,115,62,103,148,296,121,98,179],"class_list":["post-14907","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adam","tag-anger-al-ghadhab","tag-animals","tag-character-akhlaq","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-excellence-ihsaan","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-al-ijtihad","tag-jihad","tag-justice-adl","tag-leadership-imamate","tag-manners-al-adab","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-reason-al-aql","tag-sharia","tag-terrorism-al-irhab","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Sr","jetpack-related-posts":[{"id":16070,"url":"https:\/\/www.abuaminaelias.com\/do-muslim-love-death\/","url_meta":{"origin":14907,"position":0},"title":"Do Muslims love death and desire it?","author":"Abu Amina Elias","date":"November 7, 2014","format":false,"excerpt":"\"The believer hates death and I hate to hurt him.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13049,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-kill-apostates\/","url_meta":{"origin":14907,"position":1},"title":"Did the Prophet kill apostates who renounce Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is no compulsion in religion...\" (2:256)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17033,"url":"https:\/\/www.abuaminaelias.com\/all-human-life-sacred-in-islam\/","url_meta":{"origin":14907,"position":2},"title":"All human life is sacred in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill the soul which Allah has made sacred...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20443,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-accusing-kufr-takfir\/","url_meta":{"origin":14907,"position":3},"title":"Imam al-Mundhiri on Accusing Believers of Unbelief, Takfir","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Accusing a believer of unbelief is like killing him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22759,"url":"https:\/\/www.abuaminaelias.com\/999-of-1000-in-hellfire\/","url_meta":{"origin":14907,"position":4},"title":"Only one out of 1000 are in Paradise?","author":"Abu Amina Elias","date":"December 29, 2020","format":false,"excerpt":"\"Of every thousand, nine hundred and ninety-nine...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15796,"url":"https:\/\/www.abuaminaelias.com\/whoever-changes-religion-kill-him\/","url_meta":{"origin":14907,"position":5},"title":"Apostasy: Whoever changes his religion, kill him?","author":"Abu Amina Elias","date":"June 19, 2014","format":false,"excerpt":"\"The most hesitant of people in killing are the people of faith.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14907","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14907"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14907\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14907"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14907"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14907"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}