{"id":14950,"date":"2013-11-30T12:16:10","date_gmt":"2013-11-30T08:16:10","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=14950"},"modified":"2018-03-25T15:53:01","modified_gmt":"2018-03-25T11:53:01","slug":"humility-modesty-and-forbearance-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/humility-modesty-and-forbearance-in-islam\/","title":{"rendered":"Humility, modesty, and forbearance in Islam"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Humility, modesty, and forbearance are virtues that are essential for Muslims. Allah has revealed that we should be humble towards one another and we should not boast to one another.<\/p>\n<p>Iyad ibn Himar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا حَتَّى لَا يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ وَلَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ<\/p>\n<p><b>Verily, Allah has revealed to me that you must be humble towards one another, so that no one wrongs another or arrogantly boasts to another.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2865, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/03\/allah-has-revealed-the-people-should-be-humble\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Humility means to avoid the destructive sin of arrogance and haughtiness. Arrogance is an evil deed in which a person praises himself instead of Allah, or he considers himself superior to others, or he rejects the truth because it comes from a person he considers lesser than himself.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ<\/p>\n<p><b>No one who has the weight of a seed of arrogance in his heart will enter Paradise.<\/b><\/p><\/blockquote>\n<p>Someone said, “Indeed, a man loves to have beautiful clothes and shoes.” So the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ جَمِيلٌ يُحِبُّ الْجَمَالَ الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ<\/p>\n<p><b>Verily, Allah is beautiful and He loves beauty. Arrogance means rejecting the truth and looking down on people.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/05\/arrogance-prevents-a-person-from-entering-paradise\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Rajab reported: Some of the righteous predecessors (<i>salaf as-salih<\/i>) said:<\/p>\n<blockquote>\n<p align=\"right\">التَّوَاضُعُ أَنَّ تَقْبَلَ الْحَقَّ مِنْ كُلِّ مَنْ جَاءَ بِهِ وَإِنْ كَانَ صَغِيرًا فَمَنْ قَبِلَ الْحَقَّ مِمَّنْ جَاءَ بِهِ سَوَاءً كَانَ صَغِيرًا أَوْ كَبِيرًا وَسَوَاءً كَانَ يُحِبُّهُ أَوْ لَا يُحِبُّهُ ، فَهُوَ مُتَوَاضِعٌ وَمَنْ أَبَى قَبُولَ الْحَقِّ تَعَاظُمًا عَلَيْهِ فَهُوَ مُتَكَبِّرٌ<\/p>\n<p>Humility is that you accept the truth from anyone who brings it, even if they are young. Whoever accepts the truth from whoever brings it to him, whether they are young or old, whether he loves them or not, then he is humble. Whoever refuses to accept the truth because he regards himself as too important beside it, or as compared to the person who speaks it to him, then he is arrogantly proud.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-humility-is-to-accept-the-truth-from-whoever-brings-it-young-or-old-rich-or-poor\/\">Jāmi’ al-‘Ulūm wal-Ḥikam 13<\/a><\/p><\/blockquote>\n<p>The true servants of Allah are those who carry themselves with humility and they forgive people for their bad behavior.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَعِبَادُ الرَّحْمَٰنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا<\/p>\n<p><b>The servants of the Most Merciful are those who walk upon the earth in humility, and when the ignorant address them, they say words of peace.<\/b><\/p>\n<p>Surat al-Furqān 25:63<\/p><\/blockquote>\n<p>Prophet Muhammad is our best example of humility. Even though he was the Messenger of Allah, he would not use this honor to praise himself or put other people down.<\/p>\n<p>On one occasion, the sun eclipsed when the young son of the Prophet died. A false prophet would have used this rare opportunity to praise himself, but Prophet Muhammad only used the occasion to praise Allah.<\/p>\n<p>Al-Mughira bin Shu’ba reported: On the day the Prophet’s son Abraham died, the sun eclipsed and the people said the eclipse was because of the death of Abraham. The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَادْعُوا اللَّهَ وَصَلُّوا حَتَّى يَنْجَلِيَ<\/p>\n<p><b>Verily, the sun and the moon are two signs among the signs of Allah and they do not eclipse because of the death or birth of any person. So when you see them, call upon Allah and pray until the eclipse is clear.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1012, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/28\/the-great-humility-of-the-prophet-proves-his-truthfulness\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>On another occasion, a man praised the Prophet in his presence by calling him the best of creation. A false prophet would have delighted in the opportunity to praise himself, but Prophet Muhammad only used the occasion to praise his father Abraham.<\/p>\n<p>Anas ibn Malik reported: A person came to the Messenger of Allah, peace and blessings be upon him, and said, “O best of creation!” So the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">ذَاكَ إِبْرَاهِيمُ عَلَيْهِ السَّلَام<\/p>\n<p><b>That is Abraham, upon him be peace.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2369, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/06\/hadith-on-abraham-the-prophet-abraham-was-the-best-of-creation\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Modesty in Islam means to have a good conscience, to be shy to commit evil deeds, to feel remorse for sinning. Such an attitude only brings goodness to those who practice it.<\/p>\n<p>Imran ibn Hussein reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الْحَيَاءُ لَا يَأْتِي إِلَّا بِخَيْرٍ<\/p>\n<p><b>Modesty does not bring anything except goodness.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 37, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/30\/hadith-on-modesty-shyness-and-good-conscience-do-not-bring-anything-but-goodness\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>We should be modest not only to people but also to Allah as it is His right. This is achieved by protecting ourselves from committing sins, to remember the hardship of trials, and to avoid showing off to people.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">اسْتَحْيُوا مِنْ اللَّهِ حَقَّ الْحَيَاءِ<\/p>\n<p><b>Be modest in front of Allah for He has a right to your modesty.<\/b><\/p><\/blockquote>\n<p>We said, “O Messenger of Allah, we have modesty. All praise is due to Allah.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَيْسَ ذَاكَ وَلَكِنَّ الِاسْتِحْيَاءَ مِنْ اللَّهِ حَقَّ الْحَيَاءِ أَنْ تَحْفَظَ الرَّأْسَ وَمَا وَعَى وَالْبَطْنَ وَمَا حَوَى وَلْتَذْكُرْ الْمَوْتَ وَالْبِلَى وَمَنْ أَرَادَ الْآخِرَةَ تَرَكَ زِينَةَ الدُّنْيَا فَمَنْ فَعَلَ ذَلِكَ فَقَدْ اسْتَحْيَا مِنْ اللَّهِ حَقَّ الْحَيَاءِ<\/p>\n<p><b>That is not what I meant. Having modesty with Allah is to protect the mind and what runs through it, to protect the stomach and what fills it, and to remember death and trials. Whoever wants the Hereafter should leave the ostentation of the worldly life, so whoever acts like this has been modest with Allah as is His right.<\/b><\/p>\n<p>Source: Sunan al-Tirmidhī 2458, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/23\/hadith-on-modesty-be-modest-with-allah-by-protecting-the-mind-and-stomach\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Allah loves the quality of modesty and its related virtue, forbearance. Forbearance means to be patient with people when they make you angry and to avoid responding to an evil deed with another evil deed.<\/p>\n<p>Ashaj ibn Asr reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ فِيكَ خُلَّتَيْنِ يُحِبُّهُمَا اللَّهُ عَزَّ وَجَلَّ<\/p>\n<p><b>Verily, you have two qualities which are loved by Allah the Exalted.<\/b><\/p><\/blockquote>\n<p>I said, “What are they?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">الْحِلْمُ وَالْحَيَاءُ<\/p>\n<p><b>Forbearance and modesty.<\/b><\/p>\n<p>Source: Musnad Aḥmad 17373, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/24\/hadith-on-clemency-you-have-two-qualities-loved-by-allah-forbearance-and-modesty\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Forbearance and compassion are the qualities of the Prophet Abraham which Allah has praised in the Quran.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ إِبْرَاهِيمَ لَحَلِيمٌ أَوَّاهٌ مُّنِيبٌ<\/p>\n<p><b>Verily, Abraham was forbearing, compassionate, and repentant.<\/b><\/p>\n<p>Surat Hūd 11:75<\/p><\/blockquote>\n<p>There are many examples from the life of the Prophet in which people were rude, arrogant, and evil to him but he responded with kindness, patience, and forbearance.<\/p>\n<p>On one occasion, a man very rudely demanded from the Prophet that he be given charity, but the Prophet only smiled and answered his request.<\/p>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p align=\"right\">كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ فَأَدْرَكَهُ أَعْرَابِيٌّ فَجَبَذَ بِرِدَائِهِ جَبْذَةً شَدِيدَةً قَالَ أَنَسٌ فَنَظَرْتُ إِلَى صَفْحَةِ عَاتِقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَثَّرَتْ بِهَا حَاشِيَةُ الرِّدَاءِ مِنْ شِدَّةِ جَبْذَتِهِ ثُمَّ قَالَ يَا مُحَمَّدُ مُرْ لِي مِنْ مَالِ اللَّهِ الَّذِي عِنْدَكَ فَالْتَفَتَ إِلَيْهِ فَضَحِكَ ثُمَّ أَمَرَ لَهُ بِعَطَاءٍ<\/p>\n<p>I was walking with the Messenger of Allah, peace and blessings be upon him, while he was wearing a Najrani sheet with a thick border. A desert Arab overtook the Prophet and forcibly pulled his clothes. I looked at the shoulder of the Prophet and I saw that the edge of his shirt had left a mark because of the strength of his pull. The man said, “O Muhammad! Order them to give me something from Allah’s wealth which you have!” The Prophet turned and he smiled. Then he ordered that he be given charity.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5738, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/05\/hadith-on-forbearance-the-prophet-responds-with-kindness-and-charity-to-an-arab-who-is-very-rude\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In the time of the Prophet, some of the Arabs shunned modesty and forbearance. They believed a person should be haughty and boastful and should take revenge against those who are evil to them. They considered modesty a sign of weakness, but the Prophet informed us that modesty is a sign of true faith.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, passed by a man from the Ansar who was admonishing his brother about modesty. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">دَعْهُ فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ<\/p>\n<p><b>Let him be, for modesty is part of faith.<\/b><\/p>\n<p>Source: Sunan Abī Dāwūd 4795, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/11\/10\/modesty-is-part-of-faith\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الْحَيَاءَ وَالإِيمَانَ قُرِنَا جَمِيعًا فَإِذَا رُفِعَ أَحَدُهُمَا رُفِعَ الآخَرُ<\/p>\n<p>Verily, modesty and faith come together. When one of the two is missing, so is the other.<\/p>\n<p>Source: al-Adab al-Mufrad 1313, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/04\/ibn-umar-on-modesty-faith-and-modesty-come-together-and-go-missing-together\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Therefore, Islam calls us to be humble, to be modest, and to be forbearing with others. We should avoid committing sins in public and in secret, praising ourselves, looking down on others, and responding to evil with evil.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, Allah has revealed to me that you must be humble towards one another, so that no one wrongs another or arrogantly boasts to another.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[167,13,14,16,17,18,20,262,25,26,49,32,104,151,48,100,54,292,56,134,58,59,62,67,91,72],"class_list":["post-14950","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-abraham-ibrahim","tag-anger-al-ghadhab","tag-arrogance-al-takabbur","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-creation-al-khalq","tag-death-mawt","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-humility-al-tawaduh","tag-ignorance-al-jahl","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-modesty-al-haya","tag-monotheism-tawheed","tag-paradise-jannah","tag-patience-al-sabr","tag-peace","tag-prophetic-biography-sirah","tag-repentance-al-tawbah","tag-righteous-predecessors-al-salaf-al-salih","tag-truthfulness-al-sidq"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3T8","jetpack-related-posts":[{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":14950,"position":0},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20421,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-modesty-haya-shamelessness\/","url_meta":{"origin":14950,"position":1},"title":"Imam al-Mundhiri on Modesty, Obscenity, and Shamelessness","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Be modest before Allah, as is his right.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20427,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-kindness-gentleness-hilm\/","url_meta":{"origin":14950,"position":2},"title":"Imam al-Mundhiri on Kindness, Gentleness, and Forbearance","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Allah is kind and he loves kindness in all matters.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13331,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-modesty-shyness-and-good-conscience\/","url_meta":{"origin":14950,"position":3},"title":"Imam al-Nawawi on Modesty, Good Conscience","author":"Abu Amina Elias","date":"April 30, 2013","format":false,"excerpt":"\"The Prophet was more modest than a virgin in seclusion.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17719,"url":"https:\/\/www.abuaminaelias.com\/good-character-salvation\/","url_meta":{"origin":14950,"position":4},"title":"Good character, the path to salvation in Islam","author":"Abu Amina Elias","date":"February 13, 2016","format":false,"excerpt":"\"I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13490,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-burn-down-peoples-houses-for-missing-the-prayer\/","url_meta":{"origin":14950,"position":5},"title":"Burn their houses for missing prayer?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not punish with the punishment of Allah the Exalted.\" --Musnad Ahmad 1904","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14950","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=14950"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/14950\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=14950"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=14950"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=14950"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}