{"id":15025,"date":"2013-12-07T20:04:04","date_gmt":"2013-12-07T16:04:04","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15025"},"modified":"2020-07-17T22:00:35","modified_gmt":"2020-07-17T18:00:35","slug":"beautiful-patience-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/beautiful-patience-in-islam\/","title":{"rendered":"Beautiful patience in Islam"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Patience (<i>sabr<\/i>) is a comprehensive virtue in Islam that encompasses perseverance, endurance, forbearance, diligence, and restraint. It is a characteristic of enlightenment that develops in the heart of a Muslim.<\/p>\n<p>Abu Sa’eed Al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً خَيْرًا وَأَوْسَعَ مِنْ الصَّبْرِ<\/p>\n<p><b>Whoever would be patient, then Allah will make him patient. There is no gift that is better and more comprehensive than patience.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1400, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/26\/hadith-on-patience-there-is-no-gift-that-is-better-and-more-comprehensive-than-patience\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Malik Al-Ash’ari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَالصَّبْرُ ضِيَاءٌ<\/p>\n<p><b>Patience is illumination.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 223, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/06\/purity-is-half-of-faith-prayer-is-light-charity-is-proof-and-patience-is-illumination\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>According to Ibn Al-Qayyim in his work &#8216;<em>Uddat al-Ṣābirīn<\/em>, patience is divide into three components:<\/p>\n<ol>\n<li>Patience in worshiping Allah and adhering to His commands.<\/li>\n<li>Patience in avoiding sins and acts of disobedience.<\/li>\n<li>Patience with the decree of Allah and calamities.<\/li>\n<\/ol>\n<p>Regarding the first aspect of patience, it is to have perseverance in fulfilling the obligations of Islam such as prayer, giving charity, and fasting.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ<\/p>\n<p><b>O you who believe, seek help through patience and prayer. Verily, Allah is with the patient.<\/b><\/p>\n<p>Surat al-Baqarah 2:153<\/p><\/blockquote>\n<p>Patience applies to the rights of people just as it applies to the rights of Allah, for we should be patient with people when they abuse us and sin against us.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا<\/p>\n<p><b>Be patient over what they say and avoid them with gracious avoidance.<\/b><\/p>\n<p>Surat al-Muzzamil 73:10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ<\/p>\n<p><strong>The messengers said: We will surely be patient against whatever harm you should cause us, and upon Allah let rely those who would rely.<\/strong><\/p>\n<p>Surat Ibrahim 14:12<\/p><\/blockquote>\n<p>For this reason, Allah has praised the believers who restrain their anger and forgive others.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ<\/p>\n<p><b>They are those who spend in charity during ease and hardship and who restrain their anger and pardon the people, for Allah loves the doers of good.<\/b><\/p>\n<p>Surat Ali Imran 3:134<\/p><\/blockquote>\n<p>Likewise, we should not repay an evil deed with another evil deed, but rather repel evil with good.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ<\/p>\n<p><b>Not equal are the good deed and the bad deed. Repel evil by that which is better, and then the one who is hostile to you will become as a devoted friend. But none is granted it except those who are patient and none is granted it except one having a great fortune.<\/b><\/p>\n<p>Surat Fussilat 41:34-35<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَٰئِكَ لَهُمْ عُقْبَى الدَّارِ<\/p>\n<p><b>They are those who are patient, seeking the countenance of their Lord, and establish prayer and spend from what We have provided for them, secretly and publicly, and repel evil with good, for those will have the good end.<\/b><\/p>\n<p>Surat al-Ra’d 13:22<\/p><\/blockquote>\n<p>This type of patience is an essential pillar of enjoining good and forbidding evil, such that one who is impatient cannot fulfill this duty.<\/p>\n<p>Ibn Taymiyyah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فلا بد من هذه الثلاثة‏ العلم والرفق والصبر العلم قبل الأمر والنهي والرفق معه والصبر بعده<\/p>\n<p>Three qualities are essential for enjoining good: knowledge, gentleness, and patience. Knowledge is required before enjoining and forbidding, gentleness is required during it, and patience is required after it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-taymiyyah-enjoining-good-and-forbidding-evil-requires-knowledge-mercy-and-wisdom\/\">al-Amr bil Ma’rūf 1\/20-21<\/a><\/p><\/blockquote>\n<p>Regarding the second aspect of patience, it is to be diligent in avoiding sins and acts of disobedience.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِل لَّهُمْ ۚ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِّن نَّهَارٍ ۚ بَلَاغٌ ۚ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ<\/p>\n<p><b>So be patient as were those of determination among the messengers and do not be impatient for them. It will be on the Day they see that which they are promised as though they had not remained in the world but an hour of a day. This is a notification, and will any be destroyed except the defiantly disobedient?<\/b><\/p>\n<p>Surat al-Ahqaf 46:35<\/p><\/blockquote>\n<p>For example, Allah will provide shade on the Day of Judgment to a man who was enticed by a woman to commit adultery but he remained patient.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّي أَخَافُ اللَّهَ<\/p>\n<p>(Allah will provide shade to) <b>a man to whom a beautiful woman of high status seduces but he rejects her by saying I fear Allah.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 629, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/08\/hadith-on-shade-seven-righteous-people-whom-allah-will-shade-on-the-day-of-judgment\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Regarding the third aspect of patience, it is to be content with the decree of Allah and at the time of calamity.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا بُنَيَّ أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنكَرِ وَاصْبِرْ عَلَىٰ مَا أَصَابَكَ ۖ إِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><b>Luqman said: O my son, establish prayer, enjoin what is right, forbid what is wrong, and be patient over what befalls you. Verily, that is among the matters requiring determination.<\/b><\/p>\n<p>Surat Luqman 31:17<\/p><\/blockquote>\n<p>In fact, true patience is to be calm and composed during the first strike of a calamity.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, passed by a woman who was weeping beside a grave. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">اتَّقِي اللَّهَ وَاصْبِرِي<\/p>\n<p><b>Be mindful of Allah and be patient.<\/b><\/p><\/blockquote>\n<p>She said, “Go away from me, for you have not been afflicted by a calamity like mine!” And she did not recognize him. Then, she was told that it was the Prophet, so she went to the house of the Prophet and she did not find any bodyguards there. She said to him, “I did not recognize you.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الْأُولَى<\/p>\n<p><b> Verily, patience is at the first strike.<\/b><\/p>\n<p>Source: Sahih Bukhari 1223, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/hadith-on-patience-beautiful-patience-is-at-the-first-strike-of-a-calamity\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Indeed, this high level of patience can only be achieved upon the realization that nothing occurring to a true believer is bad for him, because a calamity is an opportunity to be patient and thereby receive reward from Allah.<\/p>\n<p>Suhaib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">عَجَبًا لِأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ وَلَيْسَ ذَاكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ<\/p>\n<p><b>Wondrous is the affair of the believer for there is good for him in every matter and this is not the case with anyone except the believer. If he is happy, then he thanks Allah and thus there is good for him, and if he is harmed, then he shows patience and thus there is good for him.<\/b><\/p>\n<p>Source: Sahih Muslim 2999, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/04\/everything-that-happens-is-good-as-long-as-you-have-faith\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The perfection of these three aspects together is called beautiful patience. This was the characteristic of the Prophets of Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَاصْبِرْ صَبْرًا جَمِيلًا<\/p>\n<p><b>So be patient with beautiful patience.<\/b><\/p>\n<p>Surat Al-Ma’arij 70:4<\/p><\/blockquote>\n<p>If we can achieve such beautiful patience, only then will Allah bestow upon us true leadership in the religion.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا وَكَانُوا بِآيَاتِنَا يُوقِنُونَ<\/p>\n<p><b>We made from among them leaders guiding by our command when they were patient and when they were certain of our verses.<\/b><\/p>\n<p>Surah As-Sajda 32:24<\/p><\/blockquote>\n<p>Ibn Taymiyyah said:<\/p>\n<blockquote>\n<p align=\"right\">بالصبر واليقين تنال الإمامة في الدين<\/p>\n<p>With patience and certainty of faith one can achieve leadership in religion.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/06\/ibn-taymiyyah-leadership-in-religion-is-achieved-through-patience-and-certainty-of-faith\/\">Madarij As-Salikeen 153<\/a><\/p><\/blockquote>\n<p>Most importantly, practicing patience in all of these aspects is the only way we can complete our faith and guarantee protection for ourselves from loss in this life and in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَالْعَصْرِ إِنَّ الْإِنسَانَ لَفِي خُسْرٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ<\/p>\n<p><b>By the time, verily mankind is in loss except for those who have faith and perform righteous deeds and enjoin one another to truth and enjoin one another to patience.<\/b><\/p>\n<p>Surat Al-Asr 103:1-3<\/p><\/blockquote>\n<p>Therefore, the virtue of patience is tremendously important for our well-being  in this life and in the Hereafter, so we should strive to develop patience within ourselves in all of its aspects.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is no gift that is better and more comprehensive than patience.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[127,13,16,17,85,25,26,49,27,50,51,100,54,55,56,94,58,60,92,65,179],"class_list":["post-15025","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adultery-zina","tag-anger-al-ghadhab","tag-character-akhlaq","tag-charity-al-sadaqah","tag-fasting-al-siyam","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-gentleness-al-rifq","tag-god-fearing-taqwa","tag-knowledge","tag-leadership-imamate","tag-manners-al-adab","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-obedience-al-taah","tag-patience-al-sabr","tag-prayer-salat","tag-providence-al-qada-wal-qadr","tag-reliance-tawakkul","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Ul","jetpack-related-posts":[{"id":14950,"url":"https:\/\/www.abuaminaelias.com\/humility-modesty-and-forbearance-in-islam\/","url_meta":{"origin":15025,"position":0},"title":"Humility, modesty, and forbearance in Islam","author":"Abu Amina Elias","date":"November 30, 2013","format":false,"excerpt":"\"Verily, Allah has revealed to me that you must be humble towards one another, so that no one wrongs another or arrogantly boasts to another.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13490,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-burn-down-peoples-houses-for-missing-the-prayer\/","url_meta":{"origin":15025,"position":1},"title":"Burn their houses for missing prayer?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not punish with the punishment of Allah the Exalted.\" --Musnad Ahmad 1904","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":15025,"position":2},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16223,"url":"https:\/\/www.abuaminaelias.com\/tolerance-with-people-in-islam\/","url_meta":{"origin":15025,"position":3},"title":"Tolerance with people in Islam","author":"Abu Amina Elias","date":"January 20, 2015","format":false,"excerpt":"\"Make things easy and do not make things difficult. Give glad tidings and do not repel people.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18474,"url":"https:\/\/www.abuaminaelias.com\/the-right-way-to-defend-islam\/","url_meta":{"origin":15025,"position":4},"title":"Defending Islam with grace and sincerity","author":"Abu Amina Elias","date":"June 1, 2017","format":false,"excerpt":"\"Whoever intends justice, then let him imagine himself in the place of his adversary,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15996,"url":"https:\/\/www.abuaminaelias.com\/allah-loves-gentleness-in-all-things\/","url_meta":{"origin":15025,"position":5},"title":"Allah loves gentleness in all things","author":"Abu Amina Elias","date":"August 6, 2014","format":false,"excerpt":"\"Whoever is given his portion of kindness has been given his portion of goodness.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15025","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15025"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15025\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15025"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15025"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15025"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}