{"id":15056,"date":"2013-12-13T15:03:49","date_gmt":"2013-12-13T11:03:49","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15056"},"modified":"2025-03-03T11:53:33","modified_gmt":"2025-03-03T07:53:33","slug":"an-nawawi-on-patience-and-perseverance","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-patience-and-perseverance\/","title":{"rendered":"Imam al-Nawawi on Patience, Perseverance"},"content":{"rendered":"<p><i>In the Name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب الصبر<\/p>\n<p>Chapter on patience.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/23<\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ<\/p>\n<p><strong>O believers! Patiently endure, persevere, stand on guard, and be mindful of Allah, so you may be successful.<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:200<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ<\/p>\n<p><strong>We will certainly test you with a touch of fear and famine and loss of property, life, and crops. Give good news to those who patiently endure<\/strong><\/p>\n<p>Surat al-Baqarah 2:155<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ<\/p>\n<p><strong>O My servants who believe! Be mindful of your Lord. Those who do good in this world will have a good reward. And Allah’s earth is spacious. Only those who endure patiently will be given their reward without limit.<\/strong><\/p>\n<p>Surat al-Zumar 39:10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ وَلَمَنِ انتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِم مِّن سَبِيلٍ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><strong>The reward of an evil deed is its equivalent. But whoever pardons and seeks reconciliation, then their reward is with Allah. He certainly does not like the wrongdoers. There is no blame on those who enforce justice after being wronged. Blame is only on those who wrong people and transgress in the land unjustly. It is they who will suffer a painful punishment. And whoever endures patiently and forgives, surely this is a resolve to aspire to.<\/strong><\/p>\n<p>Surat al-Shura 42:40-43<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ<\/p>\n<p><strong>O believers! Seek comfort in patience and prayer. Allah is truly with those who are patient.<\/strong><\/p>\n<p>Surat al-Baqarah 2:153<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ الْمُجَاهِدِينَ مِنكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ<\/p>\n<p><strong>We will certainly test you believers until We prove those of you who truly struggle in Allah’s cause and remain steadfast, and reveal how you conduct yourselves.<\/strong><\/p>\n<p>Surat Muhammad 47:31<\/p><\/blockquote>\n<p>Abu Malik al-Ash’ari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الطُّهُورُ شَطْرُ الْإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآَنِ أَوْ تَمْلَأُ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ وَالصَّلَاةُ نُورٌ وَالصَّدَقَةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ كُلُّ النَّاسِ يَغْدُو فَبَايِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا<\/p>\n<p><strong>Purity is half of the faith. The praise of Allah fills the Scale, as the glorification and praise of Allah fill everything between the heavens and the earth. Prayer is a light, charity is a proof, and patience is luminous. The Quran is a decisive proof for you or against you. All people begin the day by trading for their soul, either setting it free or ensuring its ruin.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 223, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/07\/salat-nur-sadaqah-burhan\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Sa’eed Al-Khudri reported: Some people from the Ansar asked the Messenger of Allah, peace and blessings be upon him, and he gave them. Then they asked for charity again and he gave them. Then they asked again and he gave them until all he had was gone. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً خَيْرًا وَأَوْسَعَ مِنْ الصَّبْرِ<\/p>\n<p><strong>If I had anything, I would not withhold it. Whoever refrains from asking others, then Allah will make him content. Whoever would be independent, then Allah will make him independent. Whoever seeks to be patient, then Allah will make him patient. No one is given a gift that is better and more comprehensive than patience.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1400, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/26\/no-gift-better-than-sabr\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Suhayb reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">عَجَبًا لِأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ وَلَيْسَ ذَاكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ<\/p>\n<p><strong>Wondrous is the affair of a believer, as there is good for him in every matter; this is not the case for anyone but a believer. If he experiences pleasure, he thanks Allah and it is good for him. If he experiences harm, he shows patience and it is good for him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2999, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/06\/04\/everything-believer-sabr-shukr\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَجِبْتُ لِلْمُؤْمِنِ إِذَا أَصَابَهُ خَيْرٌ حَمِدَ اللَّهَ وَشَكَرَ وَإِنْ أَصَابَتْهُ مُصِيبَةٌ حَمِدَ اللَّهَ وَصَبَرَ فَالْمُؤْمِنُ يُؤْجَرُ فِي كُلِّ أَمْرِهِ حَتَّى يُؤْجَرَ فِي اللُّقْمَةِ يَرْفَعُهَا إِلَى فِي امْرَأَتِهِ<\/p>\n<p><strong>I am amazed by the believer. If he is granted goodness, he praises Allah and is grateful. If he is afflicted with a calamity, he praises Allah and is patient. The believer is rewarded for every matter, even feeding a morsel of food to his wife.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 1492, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/02\/qadr-reward-sabr-shukr\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Usamah ibn Zayd reported: One of the daughters of the Prophet, peace and blessings be upon him, sent a messenger calling for him and telling him that her child or son was on the verge of death. The Prophet said to the messenger:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ارْجِعْ إِلَيْهَا فَأَخْبِرْهَا أَنَّ للَّهِ تَعَالَى مَا أَخذَ ولَهُ مَا أعطَى وَكُلُّ شَيْء عِنْدَهُ بِأَجْلٍ مُسَمَّى فَمُرْهَا فلْتَصْبِرْ ولْتَحْتسِبْ<\/p>\n<p><strong>Return to her and tell her that it is for Allah Almighty to take and to give, for all things have an appointed term with Him. Enjoin her to be patient and hope for reward from Allah.<\/strong><\/p><\/blockquote>\n<p>She sent the messenger again, swearing by Allah that he must come. When the child was presented to him, his breath quivered as if it were within a water-skin. The Prophet’s eyes were overcome with tears. Sa’d said, “O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذِهِ رَحْمَةٌ جَعَلَهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ<\/p>\n<p><strong>This is mercy which Allah has placed in the hearts of His servants. Verily, Allah is only merciful to His merciful servants.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7377, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/08\/27\/rahmah-hearts\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, passed by a woman who was weeping next to a grave. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقِي اللَّهَ وَاصْبِرِي<\/p>\n<p><strong>Be mindful of Allah and be patient.<\/strong><\/p><\/blockquote>\n<p>She said, “Go away from me! You have not been afflicted by a calamity like mine,” and she did not recognize him. Then, she was told that it was the Prophet, so she went to the Prophet’s house and she did not find any guards there. She said to him, “I did not recognize you.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الْأُولَى<\/p>\n<p><strong>Verily, patience is at the first strike.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1283, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/gracious-patience-first-strike\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ سُبْحَانَهُ ابْنَ آدَمَ إِنْ صَبَرْتَ وَاحْتَسَبْتَ عِنْدَ الصَّدْمَةِ الْأُولَى لَمْ أَرْضَ لَكَ ثَوَابًا دُونَ الْجَنَّةِ<\/p>\n<p><strong>Allah Almighty says: O son of Adam, if you are patient and restrained at the first shock of calamity, I would not be pleased with any reward for you less than Paradise.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 1597, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/01\/22\/patience-first-strike-paradise\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّبْرُ عنْدَ الصَّدْمَةِ الأُولَى الصَّبرُ عِنْدَ الصَّدْمَةِ الأُولَى<\/p>\n<p><strong>Patience is at the first strike of calamity. Patience is at the first strike of calamity.<\/strong><\/p>\n<p>Source: Musnad Abī Ya’lá 6068, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/04\/17\/patience-first-shock\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَقُولُ اللَّهُ تَعَالَى مَا لِعَبْدِي الْمُؤْمِنِ عِنْدِي جَزَاءٌ إِذَا قَبَضْتُ صَفِيَّهُ مِنْ أَهْلِ الدُّنْيَا ثُمَّ احْتَسَبَهُ إِلَّا الْجَنَّةُ<\/p>\n<p><strong>Allah Almighty says: I have nothing to give to My faithful servant but Paradise if I cause his dear friend to die and he remains patient.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6424, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/16\/sabr-mawt-leads-to-jannah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, was asked about pestilence and he said:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ عَذَابًا يَبْعَثُهُ اللَّهُ عَلَى مَنْ يَشَاءُ فَجَعَلَهُ اللَّهُ رَحْمَةً لِلْمُؤْمِنِينَ فَلَيْسَ مِنْ عَبْدٍ يَقَعُ الطَّاعُونُ فَيَمْكُثُ فِي بَلَدِهِ صَابِرًا يَعْلَمُ أَنَّهُ لَنْ يُصِيبَهُ إِلَّا مَا كَتَبَ اللَّهُ لَهُ إِلَّا كَانَ لَهُ مِثْلُ أَجْرِ الشَّهِيدِ<\/p>\n<p><strong>It is a punishment that Allah sends upon whomever He wills, but Allah has made it mercy for the believers. Any servant who resides in a land afflicted by plague, remaining patient and hoping in reward from Allah, knowing that nothing will befall him but what Allah has decreed, then he will be given the reward of a martyr.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5734, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/13\/believers-die-plague-martyrs\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ قَالَ إِذَا ابْتَلَيْتُ عَبْدِي بِحَبِيبَتَيْهِ فَصَبَرَ عَوَّضْتُهُ مِنْهُمَا الْجَنَّةَ<\/p>\n<p><strong>Allah said: If I afflict My servant in his two dear eyes and he remains patient, he will be compensated for them with Paradise.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5653, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/13\/lose-eyes-sabr-jannah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: I remember seeing the Messenger of Allah, peace and blessings be upon him, tell the story of a prophet who was beaten by his people, and he wiped the blood from his face, saying:<\/p>\n<blockquote>\n<p align=\"right\">رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ<\/p>\n<p><b>My Lord, forgive my people for they do not know.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6929, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/06\/03\/know-not-what-they-do\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لا يَعْلَمُونَ<\/p>\n<p><strong>O Allah, forgive my people for they do not know.<\/strong><\/p><\/blockquote>\n<p>Abu Hatim commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَعْنِي هَذَا الدُّعَاءُ أَنَّهُ قَالَ يَوْمَ أُحُدٍ لَمَّا شُجَّ وَجْهُهُ<\/p>\n<p>The Prophet said this supplication during the battle of Uhud when they slashed his face.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 973, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/prophet-forgives-battle-uhud\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا يُصِيبُ الْمُؤْمِنَ مِنْ شَوْكَةٍ فَمَا فَوْقَهَا إِلاَّ رَفَعَهُ اللَّهُ بِهَا دَرَجَةً أَوْ حَطَّ عَنْهُ بِهَا خَطِيئَةً<\/p>\n<p><strong>No believer is pricked by a thorn or more but that Allah will raise him one degree in status or erase a sin.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5640, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/09\/29\/believer-reward-hardship-pain\/\"><em><strong>Mutaffaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا يَزَالُ الْبَلَاءُ بِالْمُؤْمِنِ وَالْمُؤْمِنَةِ فِي نَفْسِهِ وَوَلَدِهِ وَمَالِهِ حَتَّى يَلْقَى اللَّهَ وَمَا عَلَيْهِ خَطِيئَةٌ<\/p>\n<p><b>The believing men and women continue to be under trial in their selves, their children, and their wealth until they meet Allah without any sin.<\/b><\/p>\n<p>Source: Sunan al-Tirmidhī 2399, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/13\/believers-put-to-trial-sins\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ<\/p>\n<p><strong>If Allah wills good for someone, He afflicts him with trials.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5645, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/23\/allah-intends-good-afflicts-trials\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يَتَمَنَّيَنَّ أَحَدُكُمْ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ فَإِنْ كَانَ لَا بُدَّ فَاعِلًا فَلْيَقُلْ اللَّهُمَّ أَحْيِنِي مَا كَانَتْ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتْ الْوَفَاةُ خَيْرًا لِي<\/p>\n<p><strong>None of you should wish for death due to a calamity that has afflicted him. Yet if he must do something, let him say, &#8216;O Allah, keep me alive so long as life is good for me, and cause me to die if death is better for me.&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5671, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/22\/no-muslim-wish-for-death\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Khabbab ibn Al-Arat reported: We complained to the Messenger of Allah, peace and blessings be upon him, while he was leaning upon his rolled up cloak in the shade of the Ka’bah. We said, “Will you ask Allah to help us? Will you supplicate to Allah for us?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">كَانَ مَنْ قَبْلَكُمْ يُؤْخَذُ الرَّجُلُ فَيُحْفَرُ لَهُ فِي الْأَرْضِ فَيُجْعَلُ فِيهَا فَيُجَاءُ بِالْمِنْشَارِ فَيُوضَعُ عَلَى رَأْسِهِ فَيُجْعَلُ نِصْفَيْنِ وَيُمْشَطُ بِأَمْشَاطِ الْحَدِيدِ مَا دُونَ لَحْمِهِ وَعَظْمِهِ فَمَا يَصُدُّهُ ذَلِكَ عَنْ دِينِهِ وَاللَّهِ لَيَتِمَّنَّ هَذَا الْأَمْرُ حَتَّى يَسِيرَ الرَّاكِبُ مِنْ صَنْعَاءَ إِلَى حَضْرَمَوْتَ لَا يَخَافُ إِلَّا اللَّهَ وَالذِّئْبَ عَلَى غَنَمِهِ وَلَكِنَّكُمْ تَسْتَعْجِلُونَ<\/p>\n<p><strong>Among those before you, a believer would be seized, a ditch would be dug for him, and he would be thrown into it. Then, they would bring a saw that would be put on top of his head to split him into two halves, and his flesh would be torn from the bone with iron combs. Yet, all of this did not cause them to abandon their religion. By Allah, this religion will prevail until a rider travels from Yemen to Hadhramaut, fearing no one but Allah and the wolf, lest it trouble his sheep. Rather, you are impatient!<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6943, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/sabr-believers-past-persecuted\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, was distributing charity when a man from the Ansar said, “By Allah, Muhammad did not intend to please Allah with this!” I came to the Prophet and told him about it, then anger could be seen on his face. Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ يَعْدِلُ إِنْ لَمْ يَعْدِلِ اللَّهُ وَرَسُولُهُ‏ يَرْحَمُ اللَّهُ مُوسَى قَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ<\/p>\n<p><strong>Who would be just if Allah and His Messenger are not just? May Allah have mercy on Moses! He was hurt by more than this, yet he was patient.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3405, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/10\/musa-moses-patience-harm\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَرَادَ اللَّهُ بِعَبْدِهِ الْخَيْرَ عَجَّلَ لَهُ الْعُقُوبَةَ فِي الدُّنْيَا وَإِذَا أَرَادَ اللَّهُ بِعَبْدِهِ الشَّرَّ أَمْسَكَ عَنْهُ بِذَنْبِهِ حَتَّى يُوَافِيَ بِهِ يَوْمَ الْقِيَامَةِ إِنَّ عِظَمَ الْجَزَاءِ مَعَ عِظَمِ الْبَلَاءِ وَإِنَّ اللَّهَ إِذَا أَحَبَّ قَوْمًا ابْتَلَاهُمْ فَمَنْ رَضِيَ فَلَهُ الرِّضَا وَمَنْ سَخِطَ فَلَهُ السَّخَطُ<\/p>\n<p><strong>If Allah wills goodness for His servant, He hastens his punishment in this world. If Allah wills to harm His servant, He withholds punishment for his sins until he arrives on the Day of Resurrection. Verily, with greater rewards come greater trials. If Allah loves a people, He afflicts them with trials. Whoever is content will be given contentment, and whoever is displeased will be given displeasure.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2396, Grade: <strong><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/29\/punish-trials-this-world\/\">Sahih<\/a><\/i><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ<\/p>\n<p><strong>The strongest are not the best wrestlers. Verily, the strongest are those who control themselves when angry.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6114, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/10\/06\/strong-control-anger\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><b><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الشَّدِيدُ مَنْ غَلَبَ النَّاسَ وَلَكِنَّ الشَّدِيدَ مَنْ غَلَبَ نَفْسَهُ<\/p>\n<p><strong>The strong are not those who defeat people. Rather, the strong are those who defeat their own ego.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 717, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/14\/jihad-al-nafs\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Sulayman ibn Surad reported: Two people insulted each other in the presence of the Messenger of Allah, peace and blessings be upon him, and the eyes of one of them became red like embers and the veins of his neck were bulging. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنِّي لَأَعْرِفُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ الَّذِي يَجِدُ أَعُوذُ بِاللَّهِ مِنْ الشَّيْطَانِ الرَّجِيمِ<\/p>\n<p><strong>Verily, I know a word he could say to calm himself, &#8216;I seek refuge in Allah from the cursed Satan.&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6115, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/06\/shaytan-anger-seek-refuge\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: A man came to the Prophet, peace and blessings be upon him, and said, “Advise me.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَغْضَبْ<\/p>\n<p><b>Do not get angry. <\/b><\/p><\/blockquote>\n<p>The man repeated his request twice, and the Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَغْضَبْ<\/p>\n<p><b>Do not get angry.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6116, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/06\/do-not-get-angry\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَغْضَبْ وَلَكَ الْجَنَّةُ<\/p>\n<p><strong>Do not be angry and you will enter Paradise.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ lil-Ṭabarānī 2353, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/25\/do-not-get-angry-enter-paradise\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهَا سَتَكُونُ بَعْدِي أَثَرَةٌ وَأُمُورٌ تُنْكِرُونَهَا<\/p>\n<p><b>Verily, after me there will be favoritism and many things you will reject.<\/b><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, what do you order us to do if we reach that time?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">تُؤَدُّونَ الْحَقَّ الَّذِي عَلَيْكُمْ وَتَسْأَلُونَ اللَّهَ الَّذِي لَكُمْ<\/p>\n<p><strong>Fulfill the duties placed over you and ask Allah for what belongs to you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3603, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/06\/27\/sabr-tyrants\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Usayd ibn Hudayr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ<\/p>\n<p><strong>Verily, you will see favoritism after me, so be patient until you meet me at the Fountain.<\/strong><\/p>\n<p>Source: Sahih Muslim 1845, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/06\/27\/rulers-be-patient-fountain\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">‏لاَ تَمَنَّوْا لِقَاءَ الْعَدُوِّ فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا<\/p>\n<p><strong>Do not wish to meet the enemy in battle, but if you meet them, be steadfast.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3026, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/22\/jihad-war-is-last-resort\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O you who believe, seek help through patience and prayer.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[13,16,17,183,25,26,32,51,100,54,134,58,59,60,179],"class_list":["post-15056","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-anger-al-ghadhab","tag-character-akhlaq","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-hereafter-akhirah","tag-leadership-imamate","tag-manners-al-adab","tag-mercy-al-rahmah","tag-paradise-jannah","tag-patience-al-sabr","tag-peace","tag-prayer-salat","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3UQ","jetpack-related-posts":[{"id":14241,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-safeguarding-the-fast\/","url_meta":{"origin":15056,"position":0},"title":"Imam al-Nawawi on Safeguarding the Fast","author":"Abu Amina Elias","date":"July 16, 2013","format":false,"excerpt":"\"When one of you awakens in the morning for fasting...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23308,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-obedience-sultan\/","url_meta":{"origin":15056,"position":1},"title":"Imam al-Nawawi on Obedience to Muslim authorities","author":"Abu Amina Elias","date":"June 6, 2021","format":false,"excerpt":"\"...obey Allah, obey the Messenger, and those in authority over you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13513,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-kindness-to-women\/","url_meta":{"origin":15056,"position":2},"title":"Imam al-Nawawi on Kindness to Women","author":"Abu Amina Elias","date":"May 15, 2013","format":false,"excerpt":"\"A believer should not despise a believing woman.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14337,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-sinfulness-of-vanity-in-clothing\/","url_meta":{"origin":15056,"position":3},"title":"Imam al-Nawawi on Pride and Vanity in Clothing","author":"Abu Amina Elias","date":"July 21, 2013","format":false,"excerpt":"\"Whatever part of the garment is below the two ankles is in the Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20316,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-forenoon-prayer-salat-duha\/","url_meta":{"origin":15056,"position":4},"title":"Imam al-Nawawi on Forenoon Prayer, Salat al-Duha","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"It is enough to perform two cycles of forenoon prayer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15686,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-kindness-to-the-poor-and-weak\/","url_meta":{"origin":15056,"position":5},"title":"Imam al-Nawawi on Kindness to the Poor and Weak","author":"Abu Amina Elias","date":"May 7, 2014","format":false,"excerpt":"\"And lower your wing for the believers.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15056","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15056"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15056\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15056"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15056"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15056"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}