{"id":15093,"date":"2013-12-23T12:16:11","date_gmt":"2013-12-23T08:16:11","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15093"},"modified":"2020-07-17T22:12:07","modified_gmt":"2020-07-17T18:12:07","slug":"the-world-is-nothing-compared-to-the-hereafter","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","title":{"rendered":"This world is nothing compared to the Hereafter"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Islam teaches us that this life is temporary. It will someday come to an end for us and an end for humanity altogether, but the Hereafter is eternal. The realities of Paradise and Hellfire will last forever, so our most important goal in this life should be preparing ourselves for the Hereafter by performing good deeds.<\/p>\n<p>The experience of the worldly life is almost nothing compared to the Hereafter. The Prophet gives us the parable of one of us dipping our finger into the sea as compared to the sea itself.<\/p>\n<p>Al-Mustawrid reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا مَثَلُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَثَلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ فِي الْيَمِّ فَلْيَنْظُرْ بِمَ يَرْجِعُ<\/p>\n<p><b>What is the example of this worldly life in comparison to the Hereafter other than one of you dipping his finger in the sea? Let him see what he brings forth.<\/b><\/p>\n<p>Source: Sahih Muslim 2858, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/10\/10\/worldly-life-is-nothing-compared-to-the-hereafter\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>When we dip our fingers into the sea, the little bit of water we pull out it almost nothing compared to the entire sea. In the same way, the temporary experience of this world is practically nothing compared to the Hereafter.<\/p>\n<p>For this reason, the people of Paradise and Hellfire will soon forget whatever pleasures or hardships they experienced in the world.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ هَلْ مَرَّ بِكَ شِدَّةٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤْسٌ قَطُّ وَلَا رَأَيْتُ شِدَّةً قَطُّ<\/p>\n<p><b>The most privileged people in the world from the people of the Hellfire will come on the Day of Resurrection to be dipped in the Hellfire, then it will be said: O son of Adam, did you see any good? Did you get any blessing? He will say: No, by Allah, my Lord! Then the most miserable people in the world from the people of Paradise will come on the Day of Resurrection to be dipped in the Paradise, then it will be said: O son of Adam, did you see any hardship? Did you have any distress? He will say: No, by Allah, my Lord! I did not once see hardship or distress.<\/b><\/p>\n<p>Source: Sahih Muslim 2807, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/08\/the-status-of-the-most-privileged-and-the-most-miserable-on-the-day-of-judgment\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The person who endured the most hardship for the sake of Allah will soon forget all of his pain and suffering after he is dipped into Paradise only for a moment. In contrast, the person who had the most pleasure in the world for the sake of himself will soon forget all of his happiness after he is dipped into Hellfire for only a moment.<\/p>\n<p>The reality is that the Hereafter is the true life and this world is only a means to prepare us for this true life. Allah has told us about the people who will realize on the Day of Resurrection that the Hereafter is the true life, and they will be filled with remorse because they did not perform any good deeds for their eternal life.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي<\/p>\n<p><b>He will say: O woe to me, I wish I had sent good ahead for my life.<\/b><\/p>\n<p>Surah Al-Fajr 89:24<\/p><\/blockquote>\n<p>This person refers to the Hereafter as “my life” once he understands that his life in the Hereafter will last forever. He will be grieved when he sees that he has sent no good deeds forward for his life in the Hereafter. Therefore, our most important goal in this life should be to perform many good deeds in preparation for our life in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا هَٰذِهِ الْحَيَاةُ الدُّنْيَا إِلَّا لَهْوٌ وَلَعِبٌ ۚ وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوَانُ ۚ لَوْ كَانُوا يَعْلَمُونَ<\/p>\n<p><strong>This worldly life is nothing but diversion and amusement. Verily, the home of the Hereafter is the true life if only they knew.<\/strong><\/p>\n<p>Surah Al-Ankabut 29:64<\/p><\/blockquote>\n<p>Nevertheless, we should not go to extremes in our asceticism, temperance, and renunciation of the worldly life. We are permitted to ask Allah for goodness in this life and we should not let our preparation for the Hereafter cause us to neglect our duties in the world. Allah has given us a supplication in the Quran that should define our attitude towards this life.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ<\/p>\n<p><b>Our Lord, give us goodness in this life and goodness in the Hereafter and save us from the punishment of the Hellfire.<\/b><\/p>\n<p>Surah Al-Baqarah 2:201<\/p><\/blockquote>\n<p>Islam is a religion of balance and moderation, so we should balance our supplications by asking for both goodness in this life and in the Hereafter. The Prophet would ask Allah for good things in this life such as well-being, health, and ease.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَمْ تُؤْتَوْا شَيْئًا بَعْدَ كَلِمَةِ الْإِخْلَاصِ مِثْلَ الْعَافِيَةِ فَاسْأَلُوا اللَّهَ الْعَافِيَةَ<\/p>\n<p><b>You will not be given anything after the sincere word as good as well-being, so ask Allah for well-being.<\/b><\/p>\n<p>Source: Musnad Ahmad 11, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/26\/hadith-on-security-the-best-thing-after-sincere-faith-is-security-and-well-being-in-this-world\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The best thing to have after the faith that leads to Paradise is well-being and ease in the world, so the Prophet has commanded us to ask Allah for well-being. There is no harm in enjoying comfort and pleasure in the world within the limits of Islam. However, the Prophet also taught us to qualify anything we ask for in the world with the condition that it should not harm our life in the Hereafter.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, would supplicate by saying:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ<\/p>\n<p><b>O Allah, if you know that this matter is good for my religion and my livelihood and my ending, then decree it for me and make it easy for me and bless me in it. But if you know that this matter is evil for my religion and my livelihood and my ending, then divert it from me and keep me away from it, and decree for me what is good for me and make me content with it.<\/b><\/p>\n<p>Source: Sahih Bukhari 1113, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/05\/hadith-on-prayer-the-method-of-performing-a-special-prayer-for-guidance-in-making-decisions\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Whenever the Prophet wanted to supplicate for something in the world, he would make sure to ask Allah for it only if it was beneficial to his life in the Hereafter. Furthermore, the Prophet would balance his supplications in the world with supplications for goodness in the Hereafter, Paradise and the virtues that lead to it.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, would say:<\/p>\n<blockquote>\n<p align=\"right\">اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى<\/p>\n<p><b>O Allah, I ask you for guidance, righteousness, abstinence, and self-sufficiency.<\/b><\/p>\n<p>Source: Sahih Muslim 2721, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/16\/hadith-of-supplication-o-allah-i-ask-you-for-guidance-righteousness-abstinence-and-self-sufficiency\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The proper attitude we should have in the world is that we are on a journey to Allah. This life is only a temporary stop toward the final destination of eternity.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ<\/p>\n<p><b>Be in this world as if you were a stranger or a traveler along a path.<\/b><\/p>\n<p>Source: Sahih Bukhari 6053, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/05\/be-in-this-world-as-if-you-were-a-stranger-or-a-traveler\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا مَثَلِي وَمَثَلُ الدُّنْيَا كَرَاكِبٍ ظَلَّ تَحْتَ شَجَرَةٍ ثُمَّ رَاحَ وَتَرَكَهَا<\/p>\n<p><b>Verily, the example of this world and myself is that of a rider who seeks shade under a tree, then he moves on and leaves it<\/b>.<\/p>\n<p>Source: Musnad Ahmad 3701, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/12\/24\/hadith-on-asceticism-the-prophet-was-like-a-traveler-in-the-world-moving-onto-the-hereafter\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Ibn Umar would say:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا أَمْسَيْتَ فَلاَ تَنْتَظِرِ الصَّبَاحَ وَإِذَا أَصْبَحْتَ فَلاَ تَنْتَظِرِ الْمَسَاءَ وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ وَمِنْ حَيَاتِكَ لِمَوْتِكَ<\/p>\n<p>If you survive till the evening, do not expect to be alive in the morning, and if you survive till the morning, do not expect to be alive in the evening. Take from your health for your sickness, and take from your life for your death.<\/p><\/blockquote>\n<p>We should behave in this world with the knowledge that it will one day come to an end. We should ask Allah for goodness and comfort along our journey, but we must keep in mind that the final destination is the grave and the Day of Resurrection. We should do our best in this life to perform many good deeds in hope that Allah will reward us with bliss in Paradise forever.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;What is the example of this worldly life&#8230;?&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[17,183,262,169,184,135,32,34,50,93,56,134,70,329,332],"class_list":["post-15093","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-ease-yusr","tag-guidance-al-hidaya","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-knowledge","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-paradise-jannah","tag-sincerity-al-ikhlaas","tag-temperance-zuhd","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Vr","jetpack-related-posts":[{"id":14856,"url":"https:\/\/www.abuaminaelias.com\/beware-of-transgression-and-exaggeration-in-supplication\/","url_meta":{"origin":15093,"position":0},"title":"Beware of exaggeration in supplication","author":"Abu Amina Elias","date":"September 2, 2013","format":false,"excerpt":"\"There will be people who will transgress in supplication, so beware not to be one of them.\" --Sunan Abu Dawud 1480","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":11513,"url":"https:\/\/www.abuaminaelias.com\/women-majority-hellfire-explanation\/","url_meta":{"origin":15093,"position":1},"title":"Are women the majority in Hellfire?","author":"Abu Amina Elias","date":"November 10, 2012","format":false,"excerpt":"\"Women are the majority of the children of Adam,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14180,"url":"https:\/\/www.abuaminaelias.com\/worship-allah-in-fear-of-hellfire-and-hope-of-paradise\/","url_meta":{"origin":15093,"position":2},"title":"Worshiping Allah in fear and hope","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"They arise from their beds and they supplicate their Lord in fear and hope, and they spend from what We have provided them.\" --Surah As-Sajda 32:16","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20421,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-modesty-haya-shamelessness\/","url_meta":{"origin":15093,"position":3},"title":"Imam al-Mundhiri on Modesty, Obscenity, and Shamelessness","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Be modest before Allah, as is his right.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18340,"url":"https:\/\/www.abuaminaelias.com\/punished-hellfire-forever\/","url_meta":{"origin":15093,"position":4},"title":"Will people be punished in Hellfire forever?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah informed us that his mercy encompasses all things,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13762,"url":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","url_meta":{"origin":15093,"position":5},"title":"Salvation for non-Muslims outside of Islam?","author":"Abu Amina Elias","date":"June 8, 2013","format":false,"excerpt":"\"Allah will judge between them on the Day of Resurrection.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15093","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15093"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15093\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15093"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15093"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15093"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}