{"id":15139,"date":"2014-01-06T12:55:30","date_gmt":"2014-01-06T08:55:30","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15139"},"modified":"2020-07-17T22:12:38","modified_gmt":"2020-07-17T18:12:38","slug":"prophet-never-beat-women-servants","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/prophet-never-beat-women-servants\/","title":{"rendered":"The Prophet never beat women, servants, or animals"},"content":{"rendered":"<p><i>In the name of Allah, the Gracious, the Merciful<\/i><\/p>\n<p>Prophet Muhammad never struck a woman or a servant or an animal. He never beat anyone for any reason and he never hit anything unless he was defending himself in battle.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p align=\"right\">مَا ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَادِمًا لَهُ وَلَا امْرَأَةً وَلَا ضَرَبَ بِيَدِهِ شَيْئًا<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, did not strike a servant or a woman, and he never struck anything with his hand.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2328, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/12\/01\/hadith-on-forbearance-the-prophet-never-struck-a-woman-a-servant-or-anything-with-his-hand\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The Prophet warned us that Allah will retaliate on the Day of Judgment against those who wrongly beat others.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ ضَرَبَ ضَرْبًا اقْتُصَّ مِنْهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><b>Whoever strikes someone will receive retribution for it on the Day of Resurrection.<\/b><\/p>\n<p>Source: al-Adab al-Mufrad 185, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/18\/hadith-on-retribution-allah-will-retaliate-on-behalf-of-those-who-were-beaten-in-this-world\/\"><strong><i>Sahih<\/i><\/strong><\/a><\/p><\/blockquote>\n<p>Likewise, the Prophet warned us that Allah will punish those who torture others.<\/p>\n<p>Hisham ibn Hakim reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ فِي الدُّنْيَا<\/p>\n<p><b>Verily, Allah will torture those who torture people in this world.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2613, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/12\/hadith-on-justice-allah-will-punish-those-who-torture-people\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Beating a servant and causing harm to him is a major sin. If a Muslim beats his servant, the Prophet commanded the servant to be set free.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِنَّ كَفَّارَتَهُ أَنْ يُعْتِقَهُ<\/p>\n<p><b>Whoever strikes his servant without limit or slaps him, then the expiation for the sin is to emancipate him.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1657, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/26\/hadith-on-freedom-the-expiation-for-the-sin-of-beating-a-slave-is-to-free-him\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In the case of a wife who commits major sins, the Prophet gave permission for men to strike their wives without causing pain as a symbolic gesture intended as a last resort to correct her behavior.<\/p>\n<p>&nbsp;<\/p>\n<p>Sulaiman ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا وَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا فَإِنَّمَا هُنَّ عَوَانٌ عِنْدَكُمْ لَيْسَ تَمْلِكُونَ مِنْهُنَّ شَيْئًا غَيْرَ ذَلِكَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ فَإِنْ فَعَلْنَ فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا<\/p>\n<p><strong>I certainly enjoin you to treat women well for they are like your captives, and you do not have any right to treat them otherwise unless they commit a clear obscenity. If they do so, you may forsake their beds and then strike them without causing pain<\/strong> (<em>ghayra mubarriḥ<\/em>)<strong>, but if they obey you then you may not do so.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1163, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/17\/hadith-on-women-i-enjoin-good-treatment-of-women-and-fulfillment-of-their-rights\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>The &#8220;striking&#8221; without pain is only a teaching mechanism intended to draw attention to the seriousness of major sins and reform bad behavior. It is not intended to punish, humiliate, or degrade the dignity of a wife, nor is it meant to injure or harm her. For this reason, classical scholars placed strict limits on this and recommended a man use nothing more than a handkerchief.<\/p>\n<p>Al-Rāzī writes:<\/p>\n<blockquote>\n<p align=\"right\">أن يكون الضرب بمنديل ملفوف أو بيده ولا يضربها بالسياط ولا بالعصا<\/p>\n<p>It should be a striking with a folded handkerchief or his palm, and he should not strike her with whips or clubs.<\/p>\n<p>Source: Tafsīr al-Rāzī 4:34<\/p><\/blockquote>\n<p>Nevertheless, the Prophet never did this himself and he criticized men who strike their wives harshly and without a just cause.<\/p>\n<p>Abdullah bin Zam’ah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">بِمَ يَضْرِبُ أَحَدُكُمْ امْرَأَتَهُ ضَرْبَ الْفَحْلِ أَوْ الْعَبْدِ ثُمَّ لَعَلَّهُ يُعَانِقُهَا<\/p>\n<p><b>How does one of you beat his wife as he beats the stallion camel and then embrace her?<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5695, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/12\/hadith-on-women-how-does-one-of-you-beat-his-wife-and-then-sleep-with-her\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Iyas ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ لَيْسَ أُولَئِكَ بِخِيَارِكُمْ<\/p>\n<p><b>Many women have come to the family of Muhammad complaining about their husbands hitting them. These men are not the best among you.<\/b><\/p>\n<p>Source: Sunan Abī Dāwūd 2146, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/10\/hadith-on-marriage-the-best-of-you-are-those-who-do-not-strike-their-wives\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Indeed, Allah has prohibited men from harming their wives as a means to correct their behavior.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تُضَارُّوهُنَّ لِتُضَيِّقُوا عَلَيْهِنَّ<\/p>\n<p><strong>Do not harm them in order to straighten them.<\/strong><\/p>\n<p>Surat al-Ṭalāq 65:6<\/p><\/blockquote>\n<p>If a Muslim man violates these strict limits and he abuses his wife, the Prophet considered this a just cause for divorce.<\/p>\n<p>Yahya ibn Sa’eed reported: Habeeba bint Sahl was the wife of Thabit ibn Qais ibn Shammas and it was mentioned to the Messenger of Allah, peace and blessings be upon him, that Thabit had struck her so she appeared at the door of the Messenger of Allah. The Prophet said him:<\/p>\n<blockquote>\n<p align=\"right\">خُذْ مِنْهَا وَخَلِّ سَبِيلَهَا<\/p>\n<p><b>Take your dowry and let her go.<\/b><\/p>\n<p>Source: Sunan al-Dārimī 2200, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/17\/hadith-on-divorce-the-prophet-divorces-a-woman-from-the-husband-who-beat-her\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Based upon this precedent, Muslim women deserve legal protection from abusive husbands and may seek a divorce in court.<\/p>\n<p>Some people mistakenly believe that the Prophet abused Aisha because of her statement:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَهَزَنِي فِي صَدْرِي لَهْزَةً أَوْجَعَتْنِي<\/p>\n<p>He nudged me firmly on the chest.<\/p><\/blockquote>\n<p>They have mistranslated the word here to mean a beating or striking, but the word used in this tradition is <i>lahaza<\/i> which means a nudge or a light push. How can it mean the Prophet shoved or hit her when she herself testifies that he never hit anything except when defending himself in battle?<\/p>\n<p>This type of light contact was a common teaching mechanism of the Prophet, to grab the attention of his companions before delivering a lesson. After the Prophet nudged her chest, he taught her the following supplication:<\/p>\n<blockquote>\n<p align=\"right\">يَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ<\/p>\n<p><strong>May Allah have mercy on those who have gone ahead of us and those who will come later. If Allah wills, we will join them.<\/strong><\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 2307, Grade: <b><i>Sahih<\/i><\/b><\/p><\/blockquote>\n<p>This teaching mechanism is similar to how the Prophet would behave with his other companions.<\/p>\n<p>Abu Dharr reported:<\/p>\n<blockquote>\n<p align=\"right\">فَضَرَبَ بِيَدِهِ عَلَى مَنْكِبِي ثُمَّ قَالَ<\/p>\n<p>The Prophet struck my chest with his hand and he said…<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1825, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/04\/hadith-on-leadership-authority-is-a-public-trust-which-should-not-be-sought-unless-by-necessity\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>This “striking” is not meant to cause pain but rather to grab their attention before teaching an important lesson.<b><i><\/i><\/b><\/p>\n<p>In all things, the Prophet recommended us to be kind and gentle to others, as kindness is given a special reward from Allah.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَى الرِّفْقِ مَا لَا يُعْطِي عَلَى الْعُنْفِ وَمَا لَا يُعْطِي عَلَى مَا سِوَاهُ<\/p>\n<p><strong>Verily, Allah is gentle and He loves gentleness and he rewards for gentleness what is not granted for harshness. He does not reward anything else like it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2593, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/10\/01\/allah-is-gentle-and-loves-gentleness\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>We should be especially kind and gentle with our spouses and family members, as it is a sign of Allah&#8217;s favor.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَرَادَ اللَّهُ عَزَّ وَجَلَّ بِأَهْلِ بَيْتٍ خَيْرًا أَدْخَلَ عَلَيْهِمْ الرِّفْقَ<\/p>\n<p><b>If Allah the Exalted intends goodness for a household, he lets gentleness come over them<\/b>.<\/p>\n<p>Source: Musnad Aḥmad 23906, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/22\/hadith-on-kindness-if-allah-intends-good-for-a-family-he-makes-them-gentle\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>The Prophet enjoined kindness and gentleness even for the animals and he warned us not to beat them.<\/p>\n<p>Aisha reported: I was upon a camel which was misbehaving so I began to strike it. The the Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَلَيْكِ بِالرِّفْقِ فَإِنَّ الرِّفْقَ لَا يَكُونُ فِي شَيْءٍ إِلَّا زَانَهُ وَلَا يُنْزَعُ مِنْ شَيْءٍ إِلَّا شَانَهُ<\/p>\n<p><strong>You must be gentle. Verily, gentleness is not in anything except that it beautifies it, and it is not removed from anything except that it disgraces it<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 24417, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/24\/hadith-on-gentleness-you-must-be-gentle-because-gentleness-is-beautiful-harshness-is-disgraceful\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Therefore, we should do our best to emulate the example of the Prophet. He never hit a woman or a servant or an animal, and he never hit anything unless he was fighting in self-defense. The Prophet would be gentle, patient, forbearing, and forgiving with his family, his wives, his servants, and even the people who abused him.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever strikes someone will receive retribution&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[317,16,18,183,24,25,26,49,32,151,47,100,53,54,58,62,196,128],"class_list":["post-15139","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-animals","tag-character-akhlaq","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-family-ties-sillat-rahim","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-ignorance-al-jahl","tag-jihad","tag-manners-al-adab","tag-marriage-al-nikah","tag-mercy-al-rahmah","tag-patience-al-sabr","tag-prophetic-biography-sirah","tag-prophetic-virtues","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Wb","jetpack-related-posts":[{"id":13019,"url":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-pedophile\/","url_meta":{"origin":15139,"position":0},"title":"Was Prophet Muhammad a pedophile?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Prophet never struck a woman...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14597,"url":"https:\/\/www.abuaminaelias.com\/islam-and-slavery\/","url_meta":{"origin":15139,"position":1},"title":"What does Islam teach about slavery?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Your slaves are your brothers...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12964,"url":"https:\/\/www.abuaminaelias.com\/quran-let-muslims-beat-wives\/","url_meta":{"origin":15139,"position":2},"title":"Husbands beating their wives in Islam?","author":"Abu Amina Elias","date":"March 19, 2013","format":false,"excerpt":"\"The best of you are the best in behavior to their women.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23079,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-fatihah\/","url_meta":{"origin":15139,"position":3},"title":"Imam al-Mundhiri on Virtues of Surat al-Fatihah","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"All praise is due to Allah, the Lord of the worlds,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":15139,"position":4},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16852,"url":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","url_meta":{"origin":15139,"position":5},"title":"No theology of rape in Islam","author":"Abu Amina Elias","date":"August 20, 2015","format":false,"excerpt":"\"Scholars agree that the rapist must be given legal punishment,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15139","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15139"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15139\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15139"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15139"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15139"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}