{"id":15166,"date":"2014-01-07T11:59:02","date_gmt":"2014-01-07T07:59:02","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15166"},"modified":"2020-07-17T21:52:32","modified_gmt":"2020-07-17T17:52:32","slug":"love-in-the-quran-and-sunnah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/love-in-the-quran-and-sunnah\/","title":{"rendered":"Love in the Quran and Sunnah"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Love for the sake of Allah is one of the greatest virtues in Islam. The Muslim community should be based upon love for one another, as well as love for the good of all people. The essence of love in Islam is expressed by the ethics of reciprocity: <em>treat others the way you love to be treated<\/em>.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 13, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/18\/love-for-all-people-what-you-love-for-yourself\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Many scholars interpreted “brother” in this and other traditions to mean universal brotherhood that includes all of humanity.<\/p>\n<p>An-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> الأولى أن يحمل ذلك على عموم الأخوة حتى يشمل الكافر والمسلم فيحب لأخيه الكافر ما يحب لنفسه من دخوله في الإسلام كما يحب لأخيه المسلم دوامه على الإسلام ولهذا كان الدعاء بالهداية للكافر مستحبا والمراد بالمحبة إرادة الخير والمنفعة ثم المراد المحبة الدينية لا المحبة البشرية<\/p>\n<p>This is interpreted as brotherhood in general, such that it includes the disbeliever and the Muslim. So he should love for his brother, the disbeliever, what he loves for himself which is his entering Islam, just as he should love for his brother Muslim that he remains in Islam. For this reason, it is recommended to supplicate for the disbeliever to be guided. The meaning of love here is an intention for good and benefit, and this meaning is religious love, not human love.<\/p>\n<p>Source: Sharḥ al-Arba’īn 13<\/p><\/blockquote>\n<p>Love for the sake of Allah is ‘religious love’ (<em>al-muhabbat al-diniyyah<\/em>) and not ‘human love’ (<em>al-muhabbat al-bashriyyah<\/em>). Religious love is selfless in that it does not expect any repayment in the world, but rather only reward from Allah in the Hereafter. Human or natural love, on the other hand, usually is conditional upon receiving something in return.<\/p>\n<p>Furthermore, religious love is not a feeling in itself. It is an intention to do good to others and benefit them in this life and in the Hereafter. Every Muslim should have this general intention to benefit other people regardless of their faith, even if they are enemies.<\/p>\n<p>The brotherhood of humanity is eclipsed by a higher, spiritual brotherhood in Islam: the fellowship of faith. Not only should the believers love for each other what they love for themselves, they also grow closer in love through acts of affection. This fellowship transcends tribal, ethnic, national, and political boundaries.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ سَيَرْحَمُهُمُ اللَّهُ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ<\/p>\n<p><strong>The believing men and women are allies of each other. They enjoin what is good, forbid what is evil, perform prayer, give charity, and they obey Allah and His Messenger. Allah will have mercy upon these, for Allah is Mighty and Wise.<\/strong><\/p>\n<p>Surat al-Tawbah 9:71<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ<\/p>\n<p><strong>The believers are only brothers, so reconcile between your brothers, and fear Allah that you may receive mercy.<\/strong><\/p>\n<p>Surat al-Hujurat 49:10<\/p><\/blockquote>\n<p>Al-Nu’man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ وَالْحُمَّى<\/p>\n<p><strong>The parable of the believers in their affection, mercy, and compassion for each other is that of a body. When any limb aches, the whole body reacts with sleeplessness and fever.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5665, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/03\/believers-like-body\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُؤْمِنِينَ قَوْمٌ نَصَحَةُ بَعْضِهِمْ لِبَعْضٍ مُتَوَادُّونَ وَإِنْ بَعَدَتْ دِيَارُهُمْ وَأَبْدَانُهُمْ<\/p>\n<p>Verily, the believers are people with good will and love for each other, even if their lands and countries are far apart.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/10\/03\/ali-nasihah-believers-good-will\/\">Tārīkh Dimashq 23310<\/a><\/p><\/blockquote>\n<p>The love of the believers for one another, which is selflessly for the sake of Allah, is rewarded in this life by experience the ‘sweetness of faith.’<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلاَوَةَ الإِيمَانِ مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا وَمَنْ أَحَبَّ عَبْدًا لاَ يُحِبُّهُ إِلاَّ لِلَّهِ وَمَنْ يَكْرَهُ أَنْ يَعُودَ فِي الْكُفْرِ بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ كَمَا يَكْرَهُ أَنْ يُلْقَى فِي النَّارِ<\/p>\n<p><strong>Whoever has three traits within himself will find the sweetness of faith: one who loves Allah and His Messenger more than anything else, one who loves a servant only for the sake of Allah, and one who hates to turn back to unbelief after Allah has saved him, just as he hates to be thrown into the fire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 16, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/17\/sweetness-of-faith-love\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَجُلًا زَارَ أَخًا لَهُ فِي قَرْيَةٍ أُخْرَى فَأَرْصَدَ اللَّهُ لَهُ عَلَى مَدْرَجَتِهِ مَلَكًا فَلَمَّا أَتَى عَلَيْهِ قَالَ أَيْنَ تُرِيدُ قَالَ أُرِيدُ أَخًا لِي فِي هَذِهِ الْقَرْيَةِ قَالَ هَلْ لَكَ عَلَيْهِ مِنْ نِعْمَةٍ تَرُبُّهَا قَالَ لَا غَيْرَ أَنِّي أَحْبَبْتُهُ فِي اللَّهِ عَزَّ وَجَلَّ قَالَ فَإِنِّي رَسُولُ اللَّهِ إِلَيْكَ بِأَنَّ اللَّهَ قَدْ أَحَبَّكَ كَمَا أَحْبَبْتَهُ فِيهِ<\/p>\n<p><strong>A man set out to visit his brother from another town, so Allah sent an angel to watch over his steps. When the angel came to him, he said: Where are you going? The man said: I am visiting a brother of mine in this town. The angel said: Do you have a favor over him to be repaid? He said: No, only that I love him for the sake of Allah Almighty. The angel said: I am a messenger from Allah to tell you that Allah loves you as you love him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2567, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/29\/allah-loves-you-as-you-love-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحَبَّ أَنْ يَجِدَ طَعْمَ الْإِيمَانِ فَلْيُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ عَزَّ وَجَلَّ<\/p>\n<p><strong>Whoever would love to taste the flavor of faith, let him love a person only for the sake of Allah Almighty<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 7907, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/sweetness-iman-to-love\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Love and peace are interconnected in this life. Loving people for the sake of Allah leads to periods of peace and prosperity, in addition to the Hereafter, while hating people and desiring to harm them leads to strife and suffering.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><strong>You will not enter Paradise until you have faith and you will not have faith until you love each other. Shall I show you something that, if you did, you would love each other? Spread peace between yourselves.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 54, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/16\/no-paradise-until-love-one-another\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَفْشُوا السَّلامَ تَحَابُّوا وَإِيَّاكُمْ وَالْبُغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ لا أَقُولُ لَكُمْ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ<\/p>\n<p><strong>Spread peace and you will love one another. Beware of hatred, for it is the razor. I do not say that it shaves hair, but rather it shaves away the religion.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 260, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/02\/spread-love-peace-beware-hatred\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>A tremendous reward is waiting in the Hereafter for those who loved each other for the sake of Allah. It is so great that they will even be admired by the Prophets, the martyrs, and the righteous.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ بِجَلَالِي الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي<\/p>\n<p><strong>Verily, Allah will say on the Day of Resurrection: Where are those who love each other for the sake of my glory? Today, I will shelter them in my shade on a day when there is no shade but mine<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2566, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/love-each-other-shade-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said, “<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْمُتَحَابُّونَ فِي جَلَالِي لَهُمْ مَنَابِرُ مِنْ نُورٍ يَغْبِطُهُمْ النَّبِيُّونَ وَالشُّهَدَاءُ<\/p>\n<p><strong>Allah Almighty said: Those who love each other for the sake of my glory will be upon pulpits of light, admired by the prophets and the martyrs.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2390, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/02\/admired-prophets-martyrs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Ubadah ibn al-Samit reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تعالى حَقَّتْ مَحَبَّتِي لِلْمُتَحَابِّينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَزَاوِرِينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَبَاذِلِينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَوَاصِلِينَ فِيَّ<\/p>\n<p><strong>Allah Almighty said: My love is a right upon those who love each other for my sake. My love is a right upon those who visit each other for my sake. My love is a right upon those who sit together for my sake. My love is a right upon those who maintain relations for my sake<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 21575, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/23\/allah-love-haqq-each-other\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ عِبَادِ اللَّهِ لَأُنَاسًا مَا هُمْ بِأَنْبِيَاءَ وَلَا شُهَدَاءَ يَغْبِطُهُمْ الْأَنْبِيَاءُ وَالشُّهَدَاءُ يَوْمَ الْقِيَامَةِ بِمَكَانِهِمْ مِنْ اللَّهِ تَعَالَى<\/p>\n<p><strong>Verily, among the servants of Allah are people who are neither prophets nor martyrs, yet the prophets and martyrs will admire them on the Day of Resurrection due to their position before Allah Almighty<\/strong>.<\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, tell us who they are.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ قَوْمٌ تَحَابُّوا بِرُوحِ اللَّهِ عَلَى غَيْرِ أَرْحَامٍ بَيْنَهُمْ وَلَا أَمْوَالٍ يَتَعَاطَوْنَهَا فَوَاللَّهِ إِنَّ وُجُوهَهُمْ لَنُورٌ وَإِنَّهُمْ عَلَى نُورٍ لَا يَخَافُونَ إِذَا خَافَ النَّاسُ وَلَا يَحْزَنُونَ إِذَا حَزِنَ النَّاسُ<\/p>\n<p><strong>They are people who love each other with the spirit of Allah, despite having no shared family relations or wealth. By Allah, there will be light on their faces and they will be upon light. They will not fear when people are afraid, and they will not be sad when people are grieved.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet (ṣ) recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ<\/p>\n<p><strong>Certainly, the allies of Allah will have no fear, nor will they grieve.<\/strong> (10:62)<\/p>\n<p>Source: Sunan Abī Dāwūd 3527, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/05\/love-allah-no-fear-sadness\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ جُلَسَاءَ يَوْمَ الْقِيَامَةِ عَنْ يَمِينِ الْعَرْشِ وَكِلْتَا يَدَيِ اللَّهِ يَمِينٌ عَلَى مَنَابِرَ مِنْ نُورٍ وُجُوهُهُمْ مِنْ نُورٍ لَيْسُوا بِأَنْبِيَاءَ وَلا شُهَدَاءَ وَلا صِدِّيقِينَ<\/p>\n<p><strong>Verily, Allah will have an audience on the Day of Resurrection, sitting at his right side of the Throne, and both sides are honored as the right. They will be upon pulpits of light and there will be light upon their faces, yet they are not prophets, nor martyrs, nor disciples.<\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, who are they?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُتَحَابُّونَ بِجِلالِ اللَّهِ تَعَالَى<\/p>\n<p><strong>Those who loved each other for the glory of Allah Almighty<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr 12524, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/loving-right-side-throne\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Malik al-Ashari reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ اسْمَعُوا وَاعْقِلُوا وَاعْلَمُوا أَنَّ لِلَّهِ عَزَّ وَجَلَّ عِبَادًا لَيْسُوا بِأَنْبِيَاءَ وَلَا شُهَدَاءَ يَغْبِطُهُمْ الْأَنْبِيَاءُ وَالشُّهَدَاءُ عَلَى مَجَالِسِهِمْ وَقُرْبِهِمْ مِنَ اللَّهِ<\/p>\n<p><strong>O people, listen, understand, and know that Allah Almighty has servants who are neither prophets, nor martyrs, yet the prophets and martyrs admire them for their position and closeness to Allah.<\/strong><\/p><\/blockquote>\n<p>A man among the bedouins of a distant land came and he waved to the Prophet, saying, “O Prophet of Allah, describe them to us.” The Prophet (ṣ) was pleased by the bedouin’s question, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ نَاسٌ مِنْ أَفْنَاءِ النَّاسِ وَنَوَازِعِ الْقَبَائِلِ لَمْ تَصِلْ بَيْنَهُمْ أَرْحَامٌ مُتَقَارِبَةٌ تَحَابُّوا فِي اللَّهِ وَتَصَافَوْا يَضَعُ اللَّهُ لَهُمْ يَوْمَ الْقِيَامَةِ مَنَابِرَ مِنْ نُورٍ فَيُجْلِسُهُمْ عَلَيْهَا فَيَجْعَلُ وُجُوهَهُمْ نُورًا وَثِيَابَهُمْ نُورًا يَفْزَعُ النَّاسُ يَوْمَ الْقِيَامَةِ وَلَا يَفْزَعُونَ وَهُمْ أَوْلِيَاءُ اللَّهِ الَّذِينَ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ<\/p>\n<p><strong>They are people from faraway lands and different tribes. They have no close familial relationship between them. They sincerely love each other for the sake of Allah. Allah will place them on pulpits of light on the Day of Resurrection and grant them an audience. He will place light on their faces and light on their garments. People will be terrified on the Day of Resurrection, yet they will not be terrified. They are the allies of Allah, upon whom there is no fear or grief.<\/strong> (10:62)<\/p>\n<p>Source: Musnad Aḥmad 22307, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/honor-bestowed-loving-believers\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْمُتَحَابُّونَ بِجَلَالِي فِي ظِلِّ عَرْشِي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي<\/p>\n<p><strong>Allah Almighty said: Those who loved each other for the sake of my glory will be in the shade of my throne, on a day there is no shade but mine.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16825, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/loving-believers-shade-arsh\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Amr ibn ‘Abasah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَعَالَى حَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَصَادَقُونَ مِنْ أَجْلِي وَحَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَنَاصَرُونَ مِنْ أَجْلِي<\/p>\n<p><strong>Allah Almighty said: My love is a right upon those who befriend each other for my sake. My love is a right upon those who defend each other for my sake.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Ṣaghīr 1092, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/love-friends-for-his-sake\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَحَبَّ عَبْدٌ عَبْدًا فِي اللهِ عَزَّ وَجَلَّ إِلَّا أَكْرَمَهُ اللهُ<\/p>\n<p><strong>A servant does not love another servant for the sake of Allah Almighty but that Allah will honor him<\/strong>.<\/p>\n<p>Source: Shu’ab al-Imān 8601, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/07\/12\/honor-love-sake-of-allah\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>The more virtuous believer is the one who is stronger in his or her love for the believers. They love for each other what they love for themselves, and they show each other affection.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَحَابَّ اثْنَانِ فِي اللَّهِ إِلا كَانَ أَفْضَلَهُمَا أَشَدُّهُمَا حُبًّا لِصَاحِبِهِ<\/p>\n<p><strong>No two persons love each other for the sake of Allah but that the better of the two is the one with the strongest love for his companion<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 571, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/better-person-stronger-love\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Munawi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَشَدُّهُمَا حُبًّا لِصَاحِبِهِ أي في الله تعالى لا لغرض دنيوي وتأكد المحبة من الحقوق التي يوجبها عقد الصحبة والضابط فيه أن يعامله بما يحب أن يعامل به فمن لا يحب لأخيه ما يحب لنفسه فأخوته نفاق وهو عليه في الدنيا والآخرة<\/p>\n<p>‘<strong>The strongest love for his companion<\/strong>,’ meaning, for the sake of Allah Almighty and no other worldly purpose. He affirms love among the rights that are obligatory in a bond of fellowship. The criteria of it is that he treats him as he would love to be treated by him. For whoever does not love for his brother what he loves for himself, his fellowship is hypocrisy and it will be against him in the world and in the Hereafter.<\/p>\n<p>Source: Fayḍ al-Qadīr 5\/435<\/p><\/blockquote>\n<p>The believers should not be shy in expressing their love for one another. In fact, it is recommended to tell each other we love each other for Allah’s sake, as there is nothing shameful about it.<\/p>\n<p>Anas ibn Malik reported: A man was with the Prophet, peace and blessings be upon him, when another man passed by and he said, “O Messenger of Allah, I love this man.” The Prophet (ṣ) asked:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعْلَمْتَهُ<\/p>\n<p><strong>Have you told him<\/strong>?<\/p><\/blockquote>\n<p>He said no. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعْلِمْهُ<\/p>\n<p><strong>Tell him<\/strong>.<\/p><\/blockquote>\n<p>So he went to the man and he said, “I love you for the sake of Allah.” The other man said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ<\/p>\n<p>May Allah, for whose sake you love me, also love you.<\/p>\n<p>Source: Sunan Abī Dāwūd 5125, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/02\/may-allah-love-you-too\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Finally, a person will be on the Day of Resurrection with those whom they loved. If we want to be with the Prophets and the believers, we should increase our love for them and closeness to them. Even if we do not reach their rank, we will benefit simply by our love of them.<\/p>\n<p>Abdullah ibn Mas’ud reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, what do you say about a man who loves a people but his deeds do not compare to theirs?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَرْءُ مَعَ مَنْ أَحَبَّ<\/p>\n<p><strong>A person will be with those whom he loves<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5817, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/05\/with-those-he-loves-in-jannah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In sum, the believers love for all people what they love for themselves of guidance, knowledge, and benefit. They have a special relationship with each other that tribal, ethnic, national, and political boundaries. By their love, they experience the sweetness of faith in this life and the shade of Allah in the Hereafter. They will be admired by the Prophets, the martyrs, and the righteous.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The believers are only brothers,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[122,16,17,18,262,105,30,135,32,52,100,53,54,93,56,134,59,91,73],"class_list":["post-15166","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-angels-malaikah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-death-mawt","tag-envy-al-hasad","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-love-al-mahabbah","tag-manners-al-adab","tag-marriage-al-nikah","tag-mercy-al-rahmah","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-paradise-jannah","tag-peace","tag-righteous-predecessors-al-salaf-al-salih","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3WC","jetpack-related-posts":[{"id":15251,"url":"https:\/\/www.abuaminaelias.com\/brotherhood-quran-and-sunnah\/","url_meta":{"origin":15166,"position":0},"title":"Brotherhood in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 20, 2014","format":false,"excerpt":"\"The believers are but brothers,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":15166,"position":1},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14732,"url":"https:\/\/www.abuaminaelias.com\/do-not-desire-to-fight-the-enemies-of-islam\/","url_meta":{"origin":15166,"position":2},"title":"Do not desire to fight the enemies of Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not wish to meet the enemy, but if you meet them, then be steadfast.\" --Sahih Bukhari 2863","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13532,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-naseehah\/","url_meta":{"origin":15166,"position":3},"title":"Imam al-Nawawi on Sincere Good Will","author":"Abu Amina Elias","date":"May 15, 2013","format":false,"excerpt":"\"I convey the message of my Lord to you and I sincerely advise you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13813,"url":"https:\/\/www.abuaminaelias.com\/golden-rule-in-islam-love-humanity\/","url_meta":{"origin":15166,"position":4},"title":"Golden rule in Islam: Love for humanity what you love for yourself","author":"Abu Amina Elias","date":"June 17, 2013","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":15166,"position":5},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15166","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15166"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15166\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15166"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15166"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15166"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}