{"id":15170,"date":"2016-07-04T10:49:34","date_gmt":"2016-07-04T06:49:34","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15170"},"modified":"2025-07-04T10:58:43","modified_gmt":"2025-07-04T06:58:43","slug":"religious-love-and-human-love-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/religious-love-and-human-love-in-islam\/","title":{"rendered":"Religious love and human love in Islam"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Love is a deep concept that has many different attributes, as can be understood from the many words used to describe love in Arabic. In his commentary on the Forty Hadith, Imam An-Nawawi makes a distinction between religious love (<i>muhabbat ad-diniyyah<\/i>) and human love (<i>muhabbat al-bashriyyah<\/i>). In Islam, it is important for us to understand the difference between religious love and human love.<\/p>\n<p>Religious love is the concept of loving for other people what we love for ourselves, sometimes called the <a href=\"https:\/\/abuaminaelias.com\/golden-rule-in-islam-love-for-humanity-what-you-love-for-yourself\/\">Golden Rule<\/a>. It is an intention to do good, to wish well for others, and to love others for the sake of Allah. The Prophet mentioned this type of love in many traditions.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><b>None of you will have faith until he loves for his brother what he loves for himself.<\/b><\/p>\n<p>Source: Sahih Muslim 45, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>True faith is not complete until we have this type of love for the creation. It applies to Muslims and non-Muslims, believers and unbelievers, and it is closely related to the concept of good will (<i><a href=\"https:\/\/abuaminaelias.com\/an-nawawi-on-the-virtue-of-sincere-good-will\/\">naseehah<\/a><\/i>), that is to wish well for others and to benefit them. In order to fulfil this love, we must treat other people the way we would love to be treated.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ أَحَبَّ أَنْ يُزَحْزَحَ عَنْ النَّارِ وَيَدْخُلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَنِيَّتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><b>Whoever would love to be delivered from the Hellfire and entered into Paradise, then let him die with faith in Allah and the Last Day, and let him treat the people the way he would love to be treated.<\/b><\/p>\n<p>Source: Sahih Muslim 1844, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/10\/hadith-on-salvation-let-him-treat-the-people-the-way-he-would-love-to-be-treated\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>This type of love is so important that the Prophet told us we will not enter Paradise until we love each other in this way.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><b>You will not enter Paradise until you believe and you will not believe until you love each other. Shall I show you something that, if you did, you would love each other? Spread peace between yourselves.<\/b><\/p>\n<p>Source: Sahih Muslim 54, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/16\/hadith-on-love-you-will-not-enter-paradise-until-you-love-each-other-for-the-sake-of-allah\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>We should never hate people in the sense that we want them to be harmed, but rather we should hate sinful deeds while still loving good to come to the sinner.<\/p>\n<p>Ibn Rajab said:<\/p>\n<blockquote>\n<p align=\"right\">  قَالَ بَعْضُ الصَّالِحِينَ مِنَ السَّلَفِ أَهْلُ الْمَحَبَّةِ لِلَّهِ نَظَرُوا بِنُورِ اللَّهِ وَعَطَفُوا عَلَى أَهْلِ مَعَاصِي اللَّهِ مَقَتُوا أَعْمَالَهُمْ وَعَطَفُوا عَلَيْهِمْ لِيُزِيلُوهُمْ بِالْمَوَاعِظِ عَنْ فِعَالِهِمْ وَأَشْفَقُوا عَلَى أَبْدَانِهِمْ مِنَ النَّارِ وَلَا يَكُونُ الْمُؤْمِنُ مُؤْمِنًا حَقًّا حَتَّى يَرْضَى لِلنَّاسِ مَا يَرْضَاهُ لِنَفْسِهِ<\/p>\n<p>Some of the righteous predecessors said: The people who love Allah look by the light of Allah, and they are compassionate with those who disobey Allah. They hate their actions but show mercy to them so that through their admonitions they might leave their actions. They are afraid that the Hellfire will consume their bodies. The believer will not truly be a believer until he is pleased for people to have what he is pleased for himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">Jami’ Ulum wal-Hikam 13<\/a><\/p><\/blockquote>\n<p>Human love is the natural love we experience for things we like that manifests itself as affection and attachment. We naturally have love for our parents and family members and things we enjoy in life.<\/p>\n<p>We should have this kind of love and affection for fellow Muslims and it is a sign of Allah’s favor.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَيَجْعَلُ لَهُمُ الرَّحْمَٰنُ وُدًّا<\/p>\n<p><b>Verily, for those who have believed and done righteous deeds, the Most Merciful will appoint for them affection.<\/b><\/p>\n<p>Surah Maryam 19:96<\/p><\/blockquote>\n<p>In contrast, those who disobey Allah will often earn the scorn and hatred of people on account of their evil deeds and this is a sign that Allah is displeased with them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ إِذَا أَحَبَّ عَبْدًا دَعَا جِبْرِيلَ فَقَالَ إِنِّي أُحِبُّ فُلَانًا فَأَحِبَّهُ قَالَ فَيُحِبُّهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي السَّمَاءِ فَيَقُولُ إِنَّ اللَّهَ يُحِبُّ فُلَانًا فَأَحِبُّوهُ فَيُحِبُّهُ أَهْلُ السَّمَاءِ قَالَ ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الْأَرْضِ وَإِذَا أَبْغَضَ عَبْدًا دَعَا جِبْرِيلَ فَيَقُولُ إِنِّي أُبْغِضُ فُلَانًا فَأَبْغِضْهُ قَالَ فَيُبْغِضُهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُبْغِضُ فُلَانًا فَأَبْغِضُوهُ قَالَ فَيُبْغِضُونَهُ ثُمَّ تُوضَعُ لَهُ الْبَغْضَاءُ فِي الْأَرْضِ<\/p>\n<p><b>When Allah loves a servant, He calls Gabriel and says: Verily, I love him, so you should love him. Then Gabriel loves him and makes an announcement in the heaven saying: Allah loves him and you should love him. Then the dwellers of the Heaven love him and he is honored in the earth. When Allah is angry with a servant He calls Gabriel and says: I am angry with him, so you should be angry with him. Then Gabriel becomes angry and makes an announcement to the dwellers of Heaven: Verily, Allah is angry with him, so you should be angry with him. Thus they also become angry with him and he is hated in the earth.<\/b><\/p>\n<p>Source: Sahih Muslim 2637, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/12\/when-allah-loves-or-hates-a-servant\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>It is permissible to show affection to family members and friends who are not Muslims as long as they are not fighting against Islam or committing major sins. The Prophet had this kind of love for his uncle Abu Talib, who protected him from the idolaters even though he himself never embraced Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَٰكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ<\/p>\n<p><b>Verily, you do not guide whom you love, but Allah guides whom He wills. He is most knowing of the rightly guided.<\/b><\/p>\n<p>Surah Al-Qasas 28:56<\/p><\/blockquote>\n<p>The Prophet certainly had religious love and natural love for his uncle, but Allah revealed to him that this love cannot guide those whom Allah has willed to misguide.<\/p>\n<p>It is not permissible to show affection towards those who are fighting against Islam or committing major sins, as this would embolden them in their sinning and persecution.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">لَّا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ أَوْ أَبْنَاءَهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ<\/p>\n<p><b>You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred.<\/b><\/p>\n<p>Surah Al-Mujadila 58:22<\/p><\/blockquote>\n<p>We should have religious love for all people but sometimes this means we should withhold our affection from them. For those who are persecuting Muslims or committing major sins, our affection towards them may be interpreted as an endorsement or indifference to their sins, in which case we would be helping them in sin. Rather, in such a case we must show these people “tough love,” which is to do what is best for a person even if they dislike it.<\/p>\n<p>Sometimes religious love involves warning people about their sins or giving them uncomfortable advice, but if we truly love goodness for people then we must do what is best for them even if they do not like it.<\/p>\n<p>On one occasion, the Prophet had to give some uncomfortable advice to Abu Dharr but he did so out of love for him and his desire for him to do what is best.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَبَا ذَرٍّ إِنِّي أَرَاكَ ضَعِيفًا وَإِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لَا تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلَا تَوَلَّيَنَّ مَالَ يَتِيمٍ<\/p>\n<p><b>O Abu Dharr, I see you as weak and I love for you what I love for myself. Do not command even two people and do not manage the property of an orphan.<\/b><\/p>\n<p>Source: Sahih Muslim 1826, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/04\/hadith-on-love-love-for-your-brother-might-involve-giving-them-constructive-criticism\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In this example, the Prophet warned Abu Dharr not to take a leadership position because he did not have the skills to properly fulfil its duties. Since he loved goodness for him, the Prophet did not want to set Abu Dharr up for a failure which would be harmful to him in this life and in the Hereafter.<\/p>\n<p>Religious love is an absolute good and thus stronger religious love is always better, but human love must be moderated and controlled within the limits of Islam. The Prophet encouraged us to moderate the natural love and hate we experience.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَحْبِبْ حَبِيبَكَ هَوْنًا مَا عَسَى أَنْ يَكُونَ بَغِيضَكَ يَوْمًا مَا وَأَبْغِضْ بَغِيضَكَ هَوْنًا مَا عَسَى أَنْ يَكُونَ حَبِيبَكَ يَوْمًا مَا<\/p>\n<p><b>Love your beloved moderately, for perhaps he will become hateful to you someday. Hate the one you hate moderately, for perhaps he will become your beloved someday.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1997, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/26\/hadith-on-moderation-love-your-loved-one-moderately-and-hate-your-hated-one-moderately\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>We should not let our natural love become so overwhelming that we become infatuated and diverted from the right path, nor should we allow our natural hate to become so intense we desire to harm others.<\/p>\n<p>Zaid ibn Aslam reported: Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p align=\"right\">لا يَكُنْ حُبُّكَ كَلَفًا وَلا بُغْضُكَ تَلَفًا<\/p>\n<p>Let not your love be infatuation and let not your hatred be destruction.<\/p><\/blockquote>\n<p>It was said, “How is this?” Umar said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا أَحْبَبْتَ كَلِفْتَ كَلَفَ الصَّبِيِّ وَإِذَا أَبْغَضْتَ أَحْبَبْتَ لِصَاحِبِكَ التَّلَفَ<\/p>\n<p>When you love someone, you become infatuated like a child. When you hate someone, you love destruction for your companion.<\/p>\n<p>Source: Al-Adab Al-Mufrad 1322, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/03\/umar-on-moderation-let-not-your-love-be-infatuation-and-let-not-your-hatred-be-destruction\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Therefore, we should increase our religious love for others by having an intention to benefit them, to love good for them, and to treat them the way we would love to be treated. Our human and natural love for things we like should always be moderated within the limits of Islam, such that our love for something should not cause us to sin and neither should our hatred for something cause us to transgress. We should understand when it is appropriate to show others affection or when it is appropriate to show them “tough love” for their own good.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;In Islam, it is important for us to understand the difference between religious love and human love.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[125,122,241,18,24,330,184,30,32,51,54,93,56,134,59,62,91,73],"class_list":["post-15170","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-gabriel-jibreel","tag-angels-malaikah","tag-brotherhood-al-ikhwa","tag-community-jamaah","tag-family-ties-sillat-rahim","tag-good-will-naseehah","tag-guidance-al-hidaya","tag-hatred-bigdah","tag-hereafter-akhirah","tag-leadership-imamate","tag-mercy-al-rahmah","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-paradise-jannah","tag-peace","tag-prophetic-biography-sirah","tag-righteous-predecessors-al-salaf-al-salih","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3WG","jetpack-related-posts":[{"id":16284,"url":"https:\/\/www.abuaminaelias.com\/separation-mosque-and-state\/","url_meta":{"origin":15170,"position":0},"title":"Separation of Mosque and State in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Religious values should have a positive influence on the government,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15166,"url":"https:\/\/www.abuaminaelias.com\/love-in-the-quran-and-sunnah\/","url_meta":{"origin":15170,"position":1},"title":"Love in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 7, 2014","format":false,"excerpt":"\"The believers are only brothers,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12893,"url":"https:\/\/www.abuaminaelias.com\/camels-urine-as-medicine\/","url_meta":{"origin":15170,"position":2},"title":"Drinking camel urine as medicine?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Medicine mentioned in the religious tradition is not part of the divine revelation.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":15170,"position":3},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":15170,"position":4},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15251,"url":"https:\/\/www.abuaminaelias.com\/brotherhood-quran-and-sunnah\/","url_meta":{"origin":15170,"position":5},"title":"Brotherhood in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 20, 2014","format":false,"excerpt":"\"The believers are but brothers,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15170","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15170"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15170\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15170"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15170"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15170"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}