{"id":15225,"date":"2014-01-15T17:26:19","date_gmt":"2014-01-15T13:26:19","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15225"},"modified":"2018-03-21T11:23:40","modified_gmt":"2018-03-21T07:23:40","slug":"patience-of-ahmad-ibn-hanbal-when-persecuted-by-the-caliph","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/patience-of-ahmad-ibn-hanbal-when-persecuted-by-the-caliph\/","title":{"rendered":"Ahmad ibn Hanbal&#8217;s patience under persecution"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Sulaiman ibn Abdullah reported:<\/p>\n<p>I came to the gate of Caliph Al-Mu’tasim and the people were crowded around it as if it were the day of Eid. I entered the house and I saw carpets and chairs outspread and I stood between them. When the Caliph received us, he sat upon his throne and removed his shoes and placed his feet over each other. He said, “Bring us Ahmad ibn Hanbal.” So Ahmad was brought and when he arrived he greeted him with peace.<\/p>\n<p>The Caliph said, “O Ahmad, speak and do not be afraid.” Ahmad said, “O leader of the believers, by Allah I have entered upon you and I do not have an ounce of dread in my heart.” The Caliph said, “What do you say about the Quran?” Ahmad said, “It is the word of Allah, ancient and uncreated. Allah the Exalted said<b>: If one of the idolaters seeks your protection, then grant him protection that he may hear the word of Allah<\/b>.” (9:6) The Caliph said, “Do you have a proof other than this?” Ahmad said, “O leader of the believers, yes I do. Allah said: <strong>The Merciful has taught the Quran<\/strong> (55:1) and He did not say: The Merciful has created the Quran. Allah said: <strong>By the Wise Quran<\/strong> (36:1) and He did not say: By the created Quran.”<\/p>\n<p>The Caliph said, “Put him in prison.” So Ahmad was put in prison and the people dispersed. When I awoke the next morning, I went to the gate and saw the people entering, so I entered along with them. The Caliph received us and sat upon his throne and he said, “Bring us Ahmad ibn Hanbal.” So Ahmad was brought. When he stood in front of him, the Caliph said, “How were you in prison yesterday?” Ahmad said, “I was well and all praise is due to Allah, but I saw something wondrous, O leader of the believers.” The Caliph said, “What did you see?”<\/p>\n<p>Ahmad said, “I arose in the middle of the night and performed ablution and prayed two bowings. In one I recited: <b>All praise is due to Allah<\/b> (1:1) and I recited: <b>Say, I seek refuge in the Lord of the people <\/b>(114:1). In the second I recited praise for Allah and I recited: <b>Say, I seek refuge in the Lord of the daybreak<\/b> (113:1). Then I sat down, recited the testimony of faith and invoked peace. I stood again, exalted Allah and praised Allah and then I wanted to recite<b>: Say, He is Allah the One<\/b> (112:1), but I was unable to do so. I tried hard to read something else from the Quran but I could not do it. Then I turned my eyes to the corner of the prison and I saw the Quran dead upon the floor. So I washed it and shrouded it, then I prayed over it and buried it.&#8221;<\/p>\n<p>The Caliph said, “Woe to you, Ahmad! The Quran has died?” Ahmad said, “That is what you say. You say the Quran is created and all created things will perish.” The Caliph said, “Ahmad has defeated us. Ahmad has defeated us.” Ibn Abi Duad and Bashir Al-Marisi said, “Kill him so we may rest in peace.” The Caliph said, “I have pledged to Allah that I will not kill him with a sword, nor will I order him to be killed with a sword.” Ibn Abi Duad said, “Then lash him with a whip.” The Caliph said, “Yes, so bring the executioners.” They were brought and the Caliph said, “With how many lashes will you kill him?” They said, “O leader of the believers, with ten lashes.” The Caliph said, “Take him yourself.”<\/p>\n<p>So Ahmad was undressed and made to wear a garment of wool around his waist and two ropes were tied around his hands. The man took a whip in his hand and said, “O leader of the believers, shall I strike him?” The Caliph said, “Strike him,” and he struck him with one lash. Ahmad said, “All praise is due to Allah.” The man struck him again and Ahmad said, “What Allah intends will happen.” He struck him a third time and Ahmad said, “There is no power or might but in Allah the Exalted.”<\/p>\n<p>When the man intended to strike him a fourth time, I looked at the garment around his waist and it became loose. Ahmad wished he could fall to the ground, so he raised his head towards the sky and moved his lips, but it was as if the earth split and two hands came out to support his weight by the power of Allah.<\/p>\n<p>When the Calpih saw this, he said, “Leave him.” Ibn Abi Duad came to him and he said, “O Ahmad, say in my ear the Quran is created so that I can save you from the hand of the Caliph.” Ahmad said, “O Ibn Abi Duad, say in my ear the Quran is the uncreated word of Allah so that you may be saved from the punishment of Allah the Exalted.”<\/p>\n<p>Source: Tabaqat Al-Hanabilah 219<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْإِمَامُ أَحْمَد رَحِمَهُ اللَّهُ تَعَالَى تَرَحَّمَ عَلَيْهِمْ وَاسْتَغْفَرَ لَهُمْ لِعِلْمِهِ بِأَنَّهُمْ لِمَنْ يُبَيِّنُ لَهُمْ أَنَّهُمْ مُكَذِّبُونَ لِلرَّسُولِ وَلَا جَاحِدُونَ لِمَا جَاءَ بِهِ وَلَكِنْ تَأَوَّلُوا فَأَخْطَئُوا وَقَلَّدُوا مَنْ قَالَ لَهُمْ ذَلِكَ<\/p>\n<p>Imam Ahmad, may Allah be pleased with him, prayed for mercy and forgiveness for his persecutors because he knew it was not clear to them that they were denying the Messenger and contending against what he had brought. Rather, they had a misinterpretation and so they sinned and imitated those who told them as such.<\/p>\n<p>Source: Majmu&#8217; Al-Fatawa 23\/349<\/p><\/blockquote>\n<p align=\"right\">عَنْ سليمان بْن عَبْدِ اللَّهِ السجزي قَالَ أتيت إلى باب المعتصم وإذا الناس قد ازدحموا عَلَى بابه كيوم العيد فدخلت الدار فرأيت بساطا مبسوطا وكرسيا مطروحا فوقفت بإزاء الكرسي فبينما أنا قائم فإذا المعتصم قد أقبل فجلس عَلَى الكرسي ونزع نعله من رجله ووضع رجلا عَلَى رجل ثم قَالَ يحضر أَحْمَد بن حنبل فأحضر فلما وقف بين يديه وسلم عليه<\/p>\n<p align=\"right\">وقال له يا أَحْمَد تكلم ولا تخف فقال أَحْمَد والله يا أمير المؤمنين لقد دخلت عليك وما فِي قلبي مثقال حبة من الفزع فقال له المعتصم ما تقول فِي القرآن فقال كلام اللَّه قديم غير مخلوق قَالَ اللَّهُ عَزَّ وَجَلَّ <b>وَإِنْ أَحَدٌ مِنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ اللَّهِ<\/b> فقال له عندك حجة غير هذا فقال أَحْمَد نعم يا أمير المؤمنين قول اللَّه عَزَّ وَجَلَّ <b>الرَّحْمَنُ<\/b><b> <\/b><b>عَلَّمَ الْقُرْآنَ<\/b> ولم يقل الرحمن خلق القرآن وقوله عَزَّ وَجَلَّ <b>يس<\/b> <b>وَالْقُرْآنِ الْحَكِيمِ<\/b> ولم يقل يس والقرآن المخلوق<\/p>\n<p align=\"right\">فقال المعتصم احبسوه فحبس وتفرق الناس فلما أصبحت قصدت الباب فأدخل الناس فدخلت معهم فأقبل المعتصم وجلس عَلَى كرسيه فقال هاتوا أَحْمَد بن حنبل فجيء به فلما أن وقف بين يديه قَالَ له المعتصم كيف كنت يا أَحْمَد فِي محبسك البارحة فقال بخير والحمد اللَّه إلا أني رأيت يا أمير المؤمنين فِي محبسك أمرًا عجبا قَالَ له ما رأيت قَالَ قمت فِي نصف الليل فتوضأت للصلاة وصليت ركعتين فقرأت فِي ركعة<b> الْحَمْدُ لِلَّهِ<\/b> و<b> قُلْ أَعُوذُ بِرَبِّ النَّاسِ<\/b> وفي الثانية<b> الْحَمْدُ لِلَّهِ <\/b>و<b> قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ<\/b> ثم جلست وتشهدت وسلمت ثم قمت فكبرت وقرأت <b>الْحَمْدُ لِلَّهِ<\/b> وأردت أن أقرأ<b> قُلْ هُوَ اللَّهُ أَحَدٌ<\/b> فلم أقدر ثم أجتهد أن أقرأ غير ذلك من القرآن فلم أقدر فممدت عيني فِي زاوية السجن فإذا القرآن مسجى ميتا فغسلته وكفنته وصليت عليه ودفنته<\/p>\n<p align=\"right\">فقال له ويلك يا أَحْمَد والقرآن يموت فقال له أَحْمَد فأنت كذا تقول إنه مخلوق وكل مخلوق يموت فقال المعتصم قهرنا أَحْمَد قهرنا أَحْمَد فقال ابن دؤاد وبشر المريسي اقتله حتى نستريح منه فقال إني قد عاهد اللَّه أن لا أقتله بسيف ولا آمر بقتله بسيف فقال له ابن أبي دؤاد اضربه بالسياط فقال نعم ثم قَالَ أحضروا الجلادين فأحضروا فقال المعتصم لواحد منهم بكم سوط تقتله فقال بعشرة يا أمير المؤمنين فقال خذه إليك<\/p>\n<p align=\"right\">قَالَ سليمان السجزي فأخرج أَحْمَد بن حنبل من ثيابه وائتزر بمئزر من الصوف وشد فِي يديه حبلان جديدان وأخذ السوط فِي يده وقال اضربه يا أمير المؤمنين فقال المعتصم اضرب فضربه سوطا فقال أَحْمَد الحمد وضربه ثانيا فقال ما شاء اللَّه كان فضربه ثالثًا فقال لا حول ولا قوة إلا بالله العلي العظيم<\/p>\n<p align=\"right\">فلما أراد أن يضربه السوط الرابع نظرت إلى المئزر من وسطه قد انحل ويريد أن يسقط فرفع رأسه نحو السماء وحرك شفتيه وإذا الأرض قد انشقت وخرج منها يدان فوزرتاه بقدرة اللَّه عَزَّ وَجَلَّ فلما أن نظر المعتصم إلى ذلك قَالَ حلوه فتقدم إليه ابن أبي دؤاد وقال له يا أَحْمَد قل فِي أذني إن القرآن مخلوق حتى أخلصك من يد الخليفة فقال له أَحْمَد يا ابن أبي دؤاد قل فِي أذني إن القرآن كلام اللَّه غير مخلوق حتى أخلصك من عذاب اللَّه عَزَّ وَجَلَّ فقال المعتصم أدخلوه الحبس<\/p>\n<p align=\"right\">219 طبقات الحنابلة الطبقة الأولى باب السين<\/p>\n<p align=\"right\">قال ابن تيمية فَالْإِمَامُ أَحْمَد رَحِمَهُ اللَّهُ تَعَالَى تَرَحَّمَ عَلَيْهِمْ وَاسْتَغْفَرَ لَهُمْ لِعِلْمِهِ بِأَنَّهُمْ لِمَنْ يُبَيِّنُ لَهُمْ أَنَّهُمْ مُكَذِّبُونَ لِلرَّسُولِ وَلَا جَاحِدُونَ لِمَا جَاءَ بِهِ وَلَكِنْ تَأَوَّلُوا فَأَخْطَئُوا وَقَلَّدُوا مَنْ قَالَ لَهُمْ ذَلِكَ<\/p>\n<p align=\"right\">23\/349 مجموع فتاوى ابن تيمية الفقه الصلاة باب الإمامة من تصح الصلاة خلفه ومن لا تصح مسألة الصلاة خلف المرازقة<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><i><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“O Ibn Abi Duad, say in my ear the Quran is the word of Allah, it is not created, so that you may be saved from the punishment of Allah.”<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[16,18,20,21,262,25,39,51,100,56,58,60,45,220],"class_list":["post-15225","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-character-akhlaq","tag-community-jamaah","tag-creation-al-khalq","tag-creed-aqidah","tag-death-mawt","tag-forbearance-al-hilm","tag-imam-ahmad-ibn-hanbal","tag-leadership-imamate","tag-manners-al-adab","tag-monotheism-tawheed","tag-patience-al-sabr","tag-prayer-salat","tag-quran-exegesis-tafsir","tag-supplication-al-dua"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3Xz","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":15225,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16046,"url":"https:\/\/www.abuaminaelias.com\/hadith-black-flags-al-mahdi\/","url_meta":{"origin":15225,"position":1},"title":"Are hadith of the black flags of al-Mahdi authentic?","author":"Abu Amina Elias","date":"October 2, 2014","format":false,"excerpt":"\"Muslim groups must be judged by their actions, not their flags.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23179,"url":"https:\/\/www.abuaminaelias.com\/eid-dua-taqabbal-allahu-minna-wa-minkum\/","url_meta":{"origin":15225,"position":2},"title":"Eid Supplication: May Allah accept from us and from you","author":"Abu Amina Elias","date":"May 11, 2021","format":false,"excerpt":"\"May Allah accept good deeds from us and from you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":15225,"position":3},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18921,"url":"https:\/\/www.abuaminaelias.com\/secret-marriages-are-forbidden-in-islam\/","url_meta":{"origin":15225,"position":4},"title":"Secret marriages are forbidden in Islam","author":"Abu Amina Elias","date":"February 15, 2018","format":false,"excerpt":"\"This is a secret marriage and I do not permit it.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20412,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-controlling-anger-rage\/","url_meta":{"origin":15225,"position":5},"title":"Imam al-Mundhiri on Controlling Anger, Suppressing Rage","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"The strong are those who defeat their ego.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15225","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15225"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15225\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15225"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15225"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15225"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}