{"id":15251,"date":"2014-01-20T14:01:29","date_gmt":"2014-01-20T10:01:29","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15251"},"modified":"2021-06-01T15:43:34","modified_gmt":"2021-06-01T11:43:34","slug":"brotherhood-quran-and-sunnah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/brotherhood-quran-and-sunnah\/","title":{"rendered":"Brotherhood in the Quran and Sunnah"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Brotherhood in Islam is a comprehensive concept that is based upon good character with others, treating others the way we want to be treated, and uniting together upon common values. It has three levels of degree: religion, family, and humanity. Each of these levels has a set of rights and duties that a Muslim must uphold with others.<\/p>\n<p>The strongest level of brotherhood is the sense of community, friendship, and common purpose in Islam for the sake of Allah. At this level, the believers work together towards fulfilling the goals of the religion and living out its divine values.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ<\/p>\n<p><strong>The believers are but brothers, so make reconciliation between your brothers and fear Allah that you may receive mercy.<\/strong><\/p>\n<p>Surat al-Hujurat 49:10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِ إِخْوَانًا<\/p>\n<p><strong>Hold firmly to the rope of Allah all together and do not become divided. Remember the favor of Allah upon you, when you were enemies and he brought your hearts together and you became brothers by his favor.<\/strong><\/p>\n<p>Surat Ali Imran 3:103<\/p><\/blockquote>\n<p>Although we use the word “brotherhood,” what we really mean is a faith-based community that includes both men and women as brothers and sisters in religion.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ سَيَرْحَمُهُمُ اللَّهُ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ<\/p>\n<p><strong>The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give charity and obey Allah and His Messenger. Allah will have mercy upon them, for Allah is Almighty and Wise.<\/strong><\/p>\n<p>Surat al-Tawba 9:71<\/p><\/blockquote>\n<p>Most importantly, this level of brotherhood involves purifying the heart of all animosity, hatred, and malice for those who have faith, including for the righteous predecessors of Islam (<em>al-salaf al-ṣālihīn<\/em>), those who believed in the previous prophets, and the general masses of believers throughout all of history.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ<\/p>\n<p><strong>They say: Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts any resentment toward those who have faith. Our Lord, you are kind and merciful.<\/strong><\/p>\n<p>Surat al-Hashr 59:10<\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا وَلَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثٍ<\/p>\n<p><strong>Do not hate each other, do not envy each other, do not turn away from each other, but rather be servants of Allah as brothers. It is not lawful for a Muslim to boycott his brother for more than three days.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5718, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/03\/servants-allah-brothers-sisters\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأفضل الأعمال سلامة الصدر من أنواع الشحناء كلها وأفضلها السلامة من شحناء أهل الأهواء والبدع التي تقتضي الطعن على سلف الأمة وبغضهم والحقد عليهم واعتقاد تكفيرهم أو تبديعهم وتضليلهم ثم يلي ذلك سلامة القلب من الشحناء لعموم المسلمين وإرادة الخير لهم ونصيحتهم وأن يحب لهم ما يحب لنفسه<\/p>\n<p>The best of deeds is to secure the heart from every type of enmity, and the best of it is to be secure from the enmity of the people of desires and heretical innovations that challenges the righteous predecessors of the nation, their hatred and malice towards them, and their charges of infidelity, heresy, and misguidance against them. Thereafter, following that is to secure the heart from enmity against the Muslims in general, to intend good for them, to give them sincere counsel, and to love for them what he loves for himself.<\/p>\n<p>Source: Laṭā’if al-Ma’ārif 1\/139<\/p><\/blockquote>\n<p>The parable of the community of believers is that they are like one body in their love for one another. Just as each organ of a body is connected, so are the believers in their empathy and care for each other.<\/p>\n<p>An-Nu’man ibn Basheer reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ وَالْحُمَّى<\/p>\n<p><strong>The parable of the believers in their affection, mercy, and compassion for each other is that of a body. When any limb aches, the whole body reacts with sleeplessness and fever.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5665, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/03\/believers-like-body\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمُونَ كَرَجُلٍ وَاحِدٍ إِنْ اشْتَكَى عَيْنُهُ اشْتَكَى كُلُّهُ وَإِنْ اشْتَكَى رَأْسُهُ اشْتَكَى كُلُّهُ<\/p>\n<p><strong>The Muslims are like a single man. If the eye is afflicted, then the whole body is afflicted. If the head is afflicted, then the whole body is afflicted.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2586, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/09\/muslims-one-soul\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This means the believers love for each other what they love for themselves. They avoid harming one another, they are generous with one another, and they behave in the best manner.<\/p>\n<p>Al-Halimi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَذَلِكَ يَنْبَغِي أَنْ يَكُونُوا وَكَمَا لا يُحِبُّ أَحَدٌ لإِحْدَى يَدَيْهِ إِلا مَا يُحِبُّ لِلأُخْرَى وَلا لإِحْدَى عَيْنَيْهِ أَوْ رِجْلَيْهِ أَوْ أُذُنَيْهِ إِلا مَا يُحِبُّ لِلأُخْرَى فَكَذَلِكَ يَنْبَغِي لَهُ أَنْ لا يُحِبَّ لأَخِيهِ الْمُسْلِمِ إِلا مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p>It is befitting for them to be like that. As one hand would not love except what the other loves, and one eye or one leg or one ear would not love except what the other loves. Likewise, he should not love for his Muslim brother except what he loves for himself.<\/p>\n<p>Source: Shu’ab al-Imān 10379<\/p><\/blockquote>\n<p>When we help our brothers and sisters in Islam, in reality we are helping ourselves. When we pray for them, the angels pray for us. Fulfilling the rights of brotherhood in Islam is a means for Allah to support us and reward us in the Hereafter. Failing our brothers and sisters in Islam results in Allah withdrawing this support.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالآخِرَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالآخِرَةِ وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ<\/p>\n<p><strong>Whoever relieves the hardship of a believer in this world, Allah will relieve his hardship on the Day of Resurrection. Whoever helps ease one in difficulty, Allah will make it easy for him in this world and in the Hereafter. Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and in the Hereafter. Allah helps the servant as long as he helps his brother.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لأَخِيهِ بِظَهْرِ الْغَيْبِ إِلاَّ قَالَ الْمَلَكُ وَلَكَ بِمِثْلٍ<\/p>\n<p><strong>No Muslim servant supplicates for his brother behind his back but that the angel says: And for you the same.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2732, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/01\/dua-angels-behind-back\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>As brother and sisters, the Muslims are entitled to rights that are specific to the religious community, including the right to be treated with proper manners and etiquette, to be prayed for, to be greeted with peace, to be visited when sick, and to enjoy friendly companionship.<\/p>\n<p>Ali ibn Abi Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتَّةٌ بِالْمَعْرُوفِ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَعُودُهُ إِذَا مَرِضَ وَيَتْبَعُ جِنَازَتَهُ إِذَا مَاتَ وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>A Muslim has six rights over another Muslim in good conduct: to greet him with peace when he meets him, to respond to his invitation, to respond to his sneeze, to visit him when he is sick, to follow his funeral prayer when he dies, and to love for him what he loves for himself.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2736, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/25\/six-huquq-maruf-for-muslims\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Ibn Muflih writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومما لِلْمُسْلِمِ عَلَى الْمُسْلِمِ أَنْ يَسْتُرَ عَوْرَتَهُ وَيَغْفِرَ زَلَّتَهُ وَيَرْحَمَ عَبْرَتَهُ وَيُقِيلَ عَثْرَتَهُ وَيَقْبَلَ مَعْذِرَتَهُ وَيَرُدَّ غِيبَتَهُ وَيُدِيمَ نَصِيحَتَهُ وَيَحْفَظَ خِلَّتَهُ وَيَرْعَى ذِمَّتَهُ وَيُجِيبَ دَعْوَتَهُ وَيَقْبَلَ هَدِيَّتَهُ وَيُكَافِئَ صِلَتَهُ وَيَشْكُرَ نِعْمَتَهُ وَيُحْسِنَ نُصْرَتَهُ وَيَقْضِيَ حَاجَتَهُ وَيَشْفَعَ مَسْأَلَتَهُ وَيُشَمِّتَ عَطْسَتَهُ وَيَرُدَّ ضَالَّتَهُ وَيُوَالِيَهُ وَلَا يُعَادِيَهُ وَيَنْصُرَهُ عَلَى ظَالِمِهِ وَيَكُفَّهُ عَنْ ظُلْمِهِ غَيْرِهِ وَلَا يُسْلِمَهُ وَلَا يَخْذُلَهُ وَيُحِبَّ لَهُ مَا يُحِبُّ لِنَفْسِهِ وَيَكْرَهَ لَهُ مَا يَكْرَهُ لِنَفْسِهِ<\/p>\n<p>Among the rights of a Muslim over another Muslim are that he cover his faults, forgive his mistakes, have mercy for his errors, overlook his missteps, reject his backbiting, always give him sincere advice, preserve his good traits, guard his covenants, answer his invitations, accept his guidance, repay his gifts, show gratitude for his favors, assist him in the best manner, fulfill his needs, intercede for his problems, respond to his sneeze, refuse his misguided advice, protect him and not take him as an enemy, support him against his oppressors, restrain him from oppressing others, not surrender him, not abandon him, and to love for him what he loves for himself and to hate for him what he hates for himself.<\/p>\n<p>Source: al-Ādāb al-Shar’īyah 1\/290<\/p><\/blockquote>\n<p>Moreover, we need to give excuses and the benefit of the doubt (<em>ḥusn al-ẓann<\/em>) to our brothers and sisters. We ought to be gentle and patient with them when they are wrong, giving them sincere good advice, interpreting their statements and actions in the best way, and overlooking their mistakes.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ وَلَا تَحَسَّسُوا وَلَا تَجَسَّسُوا وَلَا تَنَافَسُوا وَلَا تَحَاسَدُوا وَلَا تَبَاغَضُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا<\/p>\n<p><strong>Beware of suspicion, for suspicion is the most false of tales. Do not seek out faults, do not spy on each other, do not contend with each other, do not envy each other, do not hate each other, and do not turn away from each other. Rather, be servants of Allah as brothers.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5719, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/04\/dhann-biggest-lie\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ لِامْرِئٍ مُسْلِمٍ سَمِعَ مِنْ أَخِيهِ كَلِمَةً أَنْ يَظُنَّ بِهَا سُوءًا وَهُوَ يَجِدُ لَهَا فِي شَيْءٍ مِنَ الْخَيْرِ مَصْدَرًا<\/p>\n<p>It is not allowed for a Muslim who hears a word from his brother to assume evil of him if he can find something good about it.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/07\/brotherhood-assume-good-excuses\/\">al-Tamhīd 18\/20<\/a><\/p><\/blockquote>\n<p>Ja’far ibn Muhammad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا بَلَغَكَ عَنْ أَخِيكَ الشَّيْءُ تُنْكِرُهُ فَالْتَمِسْ لَهُ عُذْرًا وَاحِدًا إِلَى سَبْعِينَ عُذْرًا فَإِنْ أَصَبْتَهُ وَإِلا قُلْ لَعَلَّ لَهُ عُذْرًا لا أَعْرِفُهُ<\/p>\n<p>If you hear something from your brother that you reject, make an excuse for him up to seventy excuses. If you cannot do it, then say: Perhaps he has an excuse I do not know.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/15\/up-to-seventy-excuses\/\">Shu’ab al-Imān 7853<\/a><\/p><\/blockquote>\n<p>Nevertheless, brotherhood in Islam must not descend into cruel tribalism in which Muslims support each other or their sect at the expense of justice. Ultimately we are to be loyal to the values of Islam over anything else. If we see one of our brothers or sisters committing injustice, then the only right action is to stop them.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا‏<\/p>\n<p><strong>Support your brother, whether he is an oppressor or is being oppressed.<\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, we help the one being oppressed but how do we help an oppressor?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحْجُزُهُ أَوْ تَمْنَعُهُ مِنَ الظُّلْمِ، فَإِنَّ ذَلِكَ نَصْرُهُ<\/p>\n<p><strong>By restraining him or preventing him from committing injustice, for that is how you support him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6552, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/14\/support-wrongdoers-stop-them\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The next level of brotherhood in Islam is that of family ties. Taking care of our families, especially our parents, is one of our most important duties in Islam. The best Muslims are those who are the most kind to their families.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَكْمَلِ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَأَلْطَفُهُمْ بِأَهْلِهِ<\/p>\n<p><strong>Verily, the believers with the most complete faith are those with the most excellent character and who are most kind to their families.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2612, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/23\/faith-is-perfected-character\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>If our families are Muslims, then they must also be afforded the rights of religious brotherhood. But even if they are not Muslims and oppose us, we must still treat them well to the best of our ability.<\/p>\n<p>For example, Allah commands us to accompany our parents with good conduct even if they strive (<em>jahada<\/em>) to make us forsake Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِن جَاهَدَاكَ عَلَىٰ أَن تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۖ وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا ۖ وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ<\/p>\n<p><strong>If they strive to make you associate with Me that of which you have no knowledge, do not obey them but accompany them in the world with good conduct and follow the way of those who turn back to Me.<\/strong><\/p>\n<p>Surat Luqman 31:15<\/p><\/blockquote>\n<p>We cannot sever relations with our family members if they oppose Islam. Cutting off family members for any reason is one of the major sins that prevent people from entering Paradise and hastens punishment in the world.<\/p>\n<p>Jubayr ibn Mut’im reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ قَاطِعٌ<\/p>\n<p><strong>The one who cuts off his family will not enter Paradise.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5638, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/09\/24\/cuts-off-family-no-jannah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Bakrah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللَّهُ تَعَالَى لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا مَعَ مَا يَدَّخِرُ لَهُ فِي الآخِرَةِ مِثْلُ الْبَغْىِ وَقَطِيعَةِ الرَّحِمِ<\/p>\n<p><strong>No sin deserves quicker punishment from Allah Almighty for its doer in the world, along with what is prepared for him in the Hereafter, like transgression and severing family ties.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2511, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/11\/30\/transgression-quick-punishment\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Prophet (ṣ) set the best example for dealing with family members who are hostile to the religion. He criticized their idolatry and intolerance in public, but he also publicly affirmed that he would maintain good relations with them as much as possible.<\/p>\n<p>&#8216;Amr ibn al-‘As reported: I heard the Prophet, peace and blessings be upon him, saying publicly and not secretly:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ آلَ أَبِي لَيْسُوا بِأَوْلِيَائِي إِنَّمَا وَلِيِّيَ اللَّهُ وَصَالِحُ الْمُؤْمِنِينَ وَلَكِنْ لَهُمْ رَحِمٌ أَبُلُّهَا بِبَلَاهَا يَعْنِي أَصِلُهَا بِصِلَتِهَا<\/p>\n<p><strong>Verily, the relatives of my father are not my allies. Verily, only Allah and the righteous believers are my allies. Yet, they have the bonds of kinship and I will uphold their family ties<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5644, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/05\/12\/maintain-relations-kuffar-family\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Even during a protracted conflict, we must try to maintain the best relations we can with our family members. When the Quraysh were persecuting Muslims and forced them to flee to Medina, we would have expected many of them to sever relations with their families. Yet, the Prophet commanded them to continue being kind to their families.<\/p>\n<p>Asma&#8217; bint Abi Bakr reported: My mother was an idolater and she came to me during the peace treaty with the Quraysh. I asked the Messenger of Allah, peace and blessings be upon him, “O Messenger of Allah, my mother has come to me and she is hoping for kind treatment. Should I treat her well?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ صِلِي أُمَّكِ<\/p>\n<p><strong>Yes, treat your mother well.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2477, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/22\/kindness-family-unbelievers\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Finally, the widest level of brotherhood is the relationship that we have with all of humanity, the children of Adam. We should love for all people what we love for ourselves, including non-Muslims whom we should love to be guided and brought closer to Islam.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 13, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/18\/love-brother-neighbor-self\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَتَّى يُحِبَّ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>Until he loves for his neighbor what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 45, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>The scholars interpreted “brother” in this tradition to mean universal brotherhood, as other prophetic narrations mention love for the “neighbor” and “people,” which includes non-Muslims and unbelievers.<\/p>\n<p>Al-Nawawi comments on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> الأولى أن يحمل ذلك على عموم الأخوة حتى يشمل الكافر والمسلم فيحب لأخيه الكافر ما يحب لنفسه من دخوله في الإسلام كما يحب لأخيه المسلم دوامه على الإسلام ولهذا كان الدعاء بالهداية للكافر مستحبا والمراد بالمحبة إرادة الخير والمنفعة ثم المراد المحبة الدينية لا المحبة البشرية<\/p>\n<p>This is interpreted as brotherhood in general, such that it includes the unbeliever and the Muslim. Thus, he should love for his brother the unbeliever what he loves for himself, which is his entering Islam, just as he should love for his brother Muslim that he remains in Islam. For this reason, it is recommended to supplicate for the unbelievers to be guided. The meaning of love here is an intention for good and benefit. This is religious love, not human love.<\/p>\n<p>Source: Sharḥ al-Arba’īn 13<\/p><\/blockquote>\n<p>And Ibn Hajar Al-Haytami writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والذي يظهر أن تعبيره بالأخ جري على الغالب لأنه ينبغي لكل مسلم أن يحب للكفار الإسلام وما يتفرع عليه من الكمالات<\/p>\n<p>What is apparent is that the use of the word ‘brother’ is based upon its widest meaning, such that it is befitting for every Muslim to love for the unbelievers to have Islam and the virtues that derive from it.<\/p>\n<p>Source: al-Fatḥ al-Mubīn 1\/305<\/p><\/blockquote>\n<p>In another narration of this tradition, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَبْلُغُ عَبْدٌ حَقِيقَةَ الإِيمَانِ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ مِنَ الْخَيْرِ<\/p>\n<p><strong>The servant does not reach the reality of faith until he loves for people what he loves for himself of goodness.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 238, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-love-the-servant-does-not-reach-true-faith-until-he-loves-others-for-the-sake-of-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Munawi comments on traditions like these, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولفظ الناس يشمل الكفار فينبغي لكل مسلم أن يحب للكافر الإسلام وما يتفرع عليه من الكمالات<\/p>\n<p>The use of the word ‘people’ includes the unbeliever, so it is befitting for every Muslim to love for the unbelievers to have Islam and the virtues that derive from it.<\/p>\n<p>Source: Fayḍ al-Qadīr 1\/228<\/p><\/blockquote>\n<p>What this amounts to is the obligation to treat all people the way we would love to be treated. From this belief is derived the concept of universal human rights, as every human being deserves to be protected by law in the same way that we would love ourselves to be protected.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحَبَّ أَنْ يُزَحْزَحَ عَنْ النَّارِ وَيَدْخُلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَنِيَّتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><strong>Whoever would love to be delivered from the Hellfire and entered into Paradise, then let him die with faith in Allah and the Last Day, and let him treat people the way he would love to be treated.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1844, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/10\/treat-people-love-to-be-treated\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Nawawi comments on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا مِنْ جَوَامِعِ كَلِمِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَدِيعِ حِكَمِهِ وَهَذِهِ قَاعِدَةٌ مُهِمَّةٌ فَيَنْبَغِي الِاعْتِنَاءُ بِهَا وَأَنَّ الْإِنْسَانَ يَلْزَمُ أَلَّا يَفْعَلَ مَعَ النَّاسِ إِلَّا مَا يُحِبُّ أَنْ يَفْعَلُوهُ مَعَهُ<\/p>\n<p>This is among the comprehensive sayings of the Prophet (ṣ), his marvelous wisdom, and an important rule. It deserves to be given close attention, that the human being must not treat people except in a way he would love to be treated by them.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 1844<\/p><\/blockquote>\n<p>Every human being deserves a share of empathy and compassion, regardless of their religious choices. This compassion for humanity can form the basis of cooperation and dialogue between the Muslims and other religious communities. If the Muslims and others united upon this principle, love and compassion and peace and justice would be spread throughout the earth.<\/p>\n<p>Al-Ṭufi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فمقصوده ائتلاف قلوب الناس وانتظام أحوالهم وهو قاعدة الإسلام الكبرى التي أوصى الله عزَّ وجلَّ بها … وبيان ذلك أنه إذا أحبَّ كل واحد من الناس لباقيهم ما يحب لنفسه أحسن إليهم ولم يؤذهم لأنه هو يحب لنفسه أن يُحسَنَ إليه ولا يُؤذَى وإذا أحسن إليهم ولم يؤذهم أحبوه فتسري بذلك المحبة بين الناس وبسريان المحبة بينهم يسرى الخير ويرتفع الشر<\/p>\n<p>The objective of this tradition is to unite the hearts of people and rectify their circumstances, and it is a major principle in Islam that Allah the Exalted has enjoined… In clarification of that, if every person loved for others what he loves for himself he would treat them in the best manner, he would not harm them as he loves for himself to be treated well and not harmed. If he treats them well and does not harm them, then they will love him and subsequently love will emanate between people, and with the emanation of love between them will be the emanation of good and the removal of evil.<\/p>\n<p>Source: al-Ta’yīn fī Sharḥ al-Arba’īn 1\/124-125<\/p><\/blockquote>\n<p>In sum, every person we meet will fall into one or more categories of brotherhood in Islam. As Muslims, it is our duty to treat them well according to the rights for which they are entitled, whether they are coreligionists, family members, or fellow human beings.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The believers are but brothers,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[122,241,16,17,18,105,49,27,30,135,32,48,52,100,54,134,60,124,67,220,73],"class_list":["post-15251","post","type-post","status-publish","format-standard","hentry","category-featured","tag-angels-malaikah","tag-brotherhood-al-ikhwa","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-envy-al-hasad","tag-gentleness-al-rifq","tag-god-fearing-taqwa","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-justice-adl","tag-love-al-mahabbah","tag-manners-al-adab","tag-mercy-al-rahmah","tag-paradise-jannah","tag-prayer-salat","tag-reconciliation","tag-repentance-al-tawbah","tag-supplication-al-dua","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-3XZ","jetpack-related-posts":[{"id":13436,"url":"https:\/\/www.abuaminaelias.com\/islam-good-neighborliness-to-all\/","url_meta":{"origin":15251,"position":0},"title":"Islam is good neighborliness to everyone","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"...until he loves for his brother or his neighbor what he loves for himself.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":15251,"position":1},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15289,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-reconciliation-and-harmony\/","url_meta":{"origin":15251,"position":2},"title":"Imam al-Nawawi on Reconciling People","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"The believers are but one brotherhood, so make peace between your brothers.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16503,"url":"https:\/\/www.abuaminaelias.com\/love-the-sinner-hate-the-sin-in-islam\/","url_meta":{"origin":15251,"position":3},"title":"Love the sinner, hate the sin in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Love for people what you would love for yourself.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14427,"url":"https:\/\/www.abuaminaelias.com\/islam-against-racism-bigotry\/","url_meta":{"origin":15251,"position":4},"title":"Islam is against racism and prejudice","author":"Abu Amina Elias","date":"July 25, 2013","format":false,"excerpt":"\"Verily, the most noble of you to Allah is the most righteous of you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13532,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-naseehah\/","url_meta":{"origin":15251,"position":5},"title":"Imam al-Nawawi on Sincere Good Will","author":"Abu Amina Elias","date":"May 15, 2013","format":false,"excerpt":"\"I convey the message of my Lord to you and I sincerely advise you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15251","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15251"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15251\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}