{"id":15419,"date":"2014-02-04T13:16:43","date_gmt":"2014-02-04T09:16:43","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15419"},"modified":"2025-03-08T08:54:08","modified_gmt":"2025-03-08T04:54:08","slug":"an-nawawi-on-intention-and-sincerity","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-intention-and-sincerity\/","title":{"rendered":"Imam al-Nawawi on Sincerity, Good Intentions"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب الإخلاص وإحضار النية في جميع الأعمال والأقوال<\/p>\n<p>Chapter on sincerity and presence of intention in all deeds and statements.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/9<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَٰلِكَ دِينُ الْقَيِّمَةِ<\/p>\n<p><strong>They were only commanded to worship Allah alone with sincere devotion to Him in all uprightness, establish prayer, and pay alms-tax. That is the upright Way.<\/strong><\/p>\n<p>Surat al-Bayyinah 98:5<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">لَن يَنَالَ اللَّهَ لُحُومُهَا وَلَا دِمَاؤُهَا وَلَٰكِن يَنَالُهُ التَّقْوَىٰ مِنكُمْ<\/p>\n<p><strong>Neither their meat nor blood reaches Allah. Rather, it is your piety that reaches Him.<\/strong><\/p>\n<p>Surat al-Hajj 22:37<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قُلْ إِن تُخْفُوا مَا فِي صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ اللَّهُ<\/p>\n<p><strong>Say, &#8216;Whether you conceal what is in your hearts or reveal it, it is known to Allah.&#8217;<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:29<\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ<\/p>\n<p><strong>Verily, deeds are only with intentions, and every person will have only what they intended. Whoever emigrated to Allah and His Messenger, his emigration is for Allah and His Messenger. Whoever emigrated to get something in the world or to marry a woman, his emigration is for that to which he emigrated.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 54, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/29\/deeds-intention-niyyah-ikhlaas\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَغْزُو جَيْشٌ الْكَعْبَةَ فَإِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ<\/p>\n<p><b>An army will raid the Ka’bah but when they reach a desert land, all of them will be swallowed by the earth.<\/b><\/p><\/blockquote>\n<p>I asked, “O Messenger of Allah, how will all of them be swallowed by the earth while among them are their markets and people not belonging to them?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ ثُمَّ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ<\/p>\n<p><strong>They will all be swallowed up. Then, they will be resurrected for judgment upon their intentions.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2118, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/21\/raised-judged-niyyah-ikhlaas\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا هِجْرَةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا<\/p>\n<p><b>There is no longer emigration, but rather only jihad in the way of Allah and good intentions. When you are called to duty, go forth.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1737, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/04\/29\/no-obligatory-hijrah\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Imam Ibn Hajar commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَادِرٌ لَكِنَّهُ يُمْكِنُهُ إِظْهَارُ دِينِهِ وَأَدَاءُ وَاجِبَاتِهِ فَمُسْتَحَبَّةٌ لِتَكْثِيرِ الْمُسْلِمِينَ<\/p>\n<p>One who is capable of emigration, but can openly practice his religion and fulfill his obligations, then it is only recommended for him to emigrate in order to increase the ranks of the Muslims.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/190<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ<\/p>\n<p><strong>Verily, Allah does not look at your appearance or wealth, but rather he looks at your hearts and actions.<\/strong><\/p>\n<p>Source: Sahih Muslim 2564, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/17\/allah-will-judge-your-heart-and-actions\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Musa reported: A man asked the Prophet, saying, “A man may fight to be courageous, and another may fight for zeal, and another may fight to show off. So which of those is fighting in the cause of Allah?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>He who fights to raise the word of Allah is in the way of Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 123, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/jihad-word-allah-highest\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Imam Ibn Hajar commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُرَادُ بِكَلِمَةِ اللَّهِ دَعْوَةُ اللَّهِ إِلَى الْإِسْلَامِ وَيَحْتَمِلُ أَنْ يَكُونَ الْمُرَادُ أَنَّهُ يعني الجهاد لَا يَكُونُ فِي سَبِيلِ اللَّهِ إِلَّا مَنْ كَانَ سَبَبُ قِتَالِهِ طَلَبَ إِعْلَاءِ كَلِمَةِ اللَّهِ فَقَطْ بِمَعْنَى أَنَّهُ لَوْ أَضَافَ إِلَى ذَلِكَ سَبَبًا مِنَ الْأَسْبَابِ الْمَذْكُورَةِ أَخَلَّ بِذَلِكَ<\/p>\n<p>The meaning of the ‘word of Allah’ is the invitation to Islam. It is interpreted to mean that jihad would not be in the cause of Allah unless the purpose is only to raise the word of Allah, such that if anyone were to add another reason to it that would violate it.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/28<\/p><\/blockquote>\n<p>Abu Bakrah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ<\/p>\n<p><b>If two Muslims confront each other with swords, both the killer and the killed will be in Hellfire<\/b>.<\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, we understand for killer, but why for the one killed?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهُ قَدْ أَرَادَ قَتْلَ صَاحِبِهِ<\/p>\n<p><b>Verily, he intended to kill his companion.<\/b><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7083, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/19\/intended-to-kill-muslim\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">صَلَاةُ الرَّجُلِ فِي الْجَمَاعَةِ تُضَعَّفُ عَلَى صَلَاتِهِ فِي بَيْتِهِ وَفِي سُوقِهِ خَمْسًا وَعِشْرِينَ ضِعْفًا وَذَلِكَ أَنَّهُ إِذَا تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ خَرَجَ إِلَى الْمَسْجِدِ لَا يُخْرِجُهُ إِلَّا الصَّلَاةُ لَمْ يَخْطُ خَطْوَةً إِلَّا رُفِعَتْ لَهُ بِهَا دَرَجَةٌ وَحُطَّ عَنْهُ بِهَا خَطِيئَةٌ فَإِذَا صَلَّى لَمْ تَزَلْ الْمَلَائِكَةُ تُصَلِّي عَلَيْهِ مَا دَامَ فِي مُصَلَّاهُ اللَّهُمَّ صَلِّ عَلَيْهِ اللَّهُمَّ ارْحَمْهُ وَلَا يَزَالُ أَحَدُكُمْ فِي صَلَاةٍ مَا انْتَظَرَ الصَّلَاةَ<\/p>\n<p><b>The prayer of a man in congregation is twenty five times better than prayer in his home or shop. When he performs ablution in a good manner and leaves to the mosque only to perform prayer, then his every step will raise him a degree and expiate a sin until he enters the mosque. When he is performing prayer, the angels send blessings upon him for as long as he remains in his place of prayer. They say: O Allah, bless him and have mercy upon him. One of you continues to be in prayer as long as he is waiting for prayer<\/b>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 620, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/09\/05\/angels-bless-remain-prayer\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ ثُمَّ بَيَّنَ ذَلِكَ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عَزَّ وَجَلَّ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِ مِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً<\/p>\n<p><strong>Verily, Allah has recorded good and evil deeds and he made them clear. Whoever intends to perform a good deed but does not do it, Allah will record it as a complete good deed. If he intends to do it and does so, Allah Almighty will record it as ten good deeds, up to seven hundred times as much or even more. If he intends to do an evil deed and does not do it, Allah will record for him one complete good deed. If he does it, Allah will record for him a single evil deed<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6126, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/22\/deeds-multiplied-favor\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Deeds are only be intentions.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[122,324,16,17,183,135,32,246,47,100,60,70],"class_list":["post-15419","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-angels-malaikah","tag-blessings-al-barakah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-intention-al-niyyah","tag-jihad","tag-manners-al-adab","tag-prayer-salat","tag-sincerity-al-ikhlaas"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-40H","jetpack-related-posts":[{"id":20555,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-sincerity-truthfulness-good-intentions\/","url_meta":{"origin":15419,"position":0},"title":"Imam al-Mundhiri on Sincerity, Honesty, and Good Intentions","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"\"Deeds are only by intentions.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14753,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-truthfulness-honesty-sidq\/","url_meta":{"origin":15419,"position":1},"title":"Imam al-Nawawi on Truthfulness, Honesty","author":"Abu Amina Elias","date":"August 20, 2013","format":false,"excerpt":"\"Verily, truthfulness leads to righteousness.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":15419,"position":2},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":15419,"position":3},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13567,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-salat-salah-salawat\/","url_meta":{"origin":15419,"position":4},"title":"Imam al-Nawawi on Five Daily Prayers","author":"Abu Amina Elias","date":"May 19, 2013","format":false,"excerpt":"\"The parable of the five prayers is that of a river running...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":15419,"position":5},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15419","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15419"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15419\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15419"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15419"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15419"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}