{"id":15463,"date":"2016-07-04T10:49:20","date_gmt":"2016-07-04T06:49:20","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15463"},"modified":"2025-07-04T11:01:55","modified_gmt":"2025-07-04T07:01:55","slug":"methods-islamophobic-propaganda","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/methods-islamophobic-propaganda\/","title":{"rendered":"Methods of anti-Islam propaganda"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>Allah has informed us that there will always be people who intend to misrepresent Islam and make it appear evil. Our modern term for this is &#8220;Islamophobia,&#8221; which means spreading fear and hatred of Islam. Most people who are against Islam have simply been given misinformation and we should help to provide them with an accurate view of Islam, while others deliberately slander the religion even after they know the truth.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">الَّذِينَ يَصُدُّونَ عَن سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُم بِالْآخِرَةِ كَافِرُونَ<\/p>\n<p><b>They are those who prevent people from the path of Allah, seeking to make it seem deviant, while they disbelieve in the Hereafter.<\/b><\/p>\n<p>Surah Al-A’raf 7:45<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا أُولَٰئِكَ فِي ضَلَالٍ بَعِيدٍ<\/p>\n<p><b>They are those who prefer the worldly life over the Hereafter and they prevent people from the path of Allah, seeking to make it seem deviant. Those have been led far astray.<\/b><\/p>\n<p>Surah Ibrahim 14:3<\/p><\/blockquote>\n<p>We should respond to these allegations with knowledge, good character, and wisdom in order to minimize their harmful impact and to correct the understanding of those who have been intentionally misled.<\/p>\n<p>Anti-Muslim propagandists employ some dishonest methods to achieve their goal. They often cite from apocryphal Islamic writings, such as the works of history by At-Tabari and Ibn Ishaq. These books contain some strange or awkward narrations which are not considered authentic, even by those who narrated them. Anti-Muslim propagandists will cite these stories as if they were authentic in order to undermine Islam. However, these books are not authoritative because they contain many reports with incomplete chains of narration.<\/p>\n<p>At-Tabari, for example, states clearly in the introduction to his history that he mentions narrations which are likely false, sometimes reprehensibly so, and he attributes these solely to their narrators. As a historian, he intended to document what people were narrating and, unlike Al-Bukhari and Muslim, his work was never intended to be a collection of authentic reports.<\/p>\n<p>At-Tabari writes:<\/p>\n<blockquote>\n<p align=\"right\">وليعلم الناظر في كتابنا هذا أن اعتمادي في كل ما أحضرت ذكره فيه مما شرطت أني راسمه فيه إنما هو على ما رويت من الأخبار التي أنا ذاكرها فيه والآثار التي أنا مسندها إلى رواتها فيه دون ما أدرك بحجج العقول واستنبط بفكر النفوس إلا اليسير القليل منه إذ كان العلم بما كان من أخبار الماضين وما هو كائن من أنباء الحادثين غير واصل إلى من لم يشاهدهم ولم يدرك زمانهم إلا بأخبار المخبرين ونقل الناقلين دون الاستخراج بالعقول والاستنباط بفكر النفوس فما يكن في كتابي هذا من خبر ذكرناه عن بعض الماضين مما يستنكره قارئه أو يستشنعه سامعه من أجل أنه لم يعرف له وجها في الصحة ولا معنى في الحقيقة فليعلم أنه لم يؤت ذلك من قبلنا وإنما أتى من قبل بعض ناقليه إلينا وإنا إنما أدينا ذلك على نحو ما أدي إلينا<\/p>\n<p>The reader should know that with respect to all I have mentioned and made it a condition to set down  in this writing of ours, I rely upon traditions and reports which I have transmitted and which I attribute to their transmitters. I rely only very exceptionally upon what is learned through rational arguments and deduced by internal thought processes. For no knowledge of history of men of the past and of recent men and events is attainable by those who were not able to observe them and did not live in their time, except through information  and transmission provided by  informants and transmitters. This cannot be brought out by reason or deduced by internal thought processes. This writing of mine may be found to contain some information, mentioned by us on the authority of certain men of the past, which the reader may disapprove of and the listener may find detestable, because he can find nothing sound and no real meaning in it. In such cases, he should know that such information has come not from us, but from those who transmitted it to us. We have merely reported it as it was reported to us.<\/p>\n<p>Source: Tareekh At-Tabari 3<\/p><\/blockquote>\n<p>Likewise, Imam Ahmad warned us about what is narrated in the books of history and exegesis (<i>tafseer<\/i>). Many of these books contain inauthentic apocryphal material that anti-Muslim writers use against Islam.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p align=\"right\">قَدْ نَصَبَ اللَّهُ الْأَدِلَّةَ عَلَى بَيَانِ مَا فِيهَا مِنْ صَحِيحٍ وَغَيْرِهِ وَمَعْلُومٌ أَنَّ الْمَنْقُولَ فِي التَّفْسِيرِ أَكْثَرُهُ كَالْمَنْقُولِ فِي الْمَغَازِي وَالْمَلَاحِمِ وَلِهَذَا قَالَ الْإِمَامُ أَحْمَد ثَلَاثَةُ أُمُورٍ لَيْسَ لَهَا إسْنَادٌ التَّفْسِيرُ وَالْمَلَاحِمُ وَالْمَغَازِي وَيُرْوَى لَيْسَ لَهَا أَصْلٌ أَيْ إسْنَادٌ لِأَنَّ الْغَالِبَ عَلَيْهَا الْمَرَاسِيلُ مِثْلُ مَا يَذْكُرُهُ عُرْوَةُ بْنُ الزُّبَيْرِ وَالشَّعْبِيُّ وَالزُّهْرِيُّ وَمُوسَى بْنُ عُقْبَةَ وَابْنُ إسْحَاقَ<\/p>\n<p>Allah has provided evidence establishing the authenticity or lack thereof for the narrations that are necessary in matters of the religion. It is well-known that most of what is reported in books of exegesis is similar to what is reported in books of history and battles. For this reason, Imam Ahmad said that three matters are not reliable: exegesis, stories of battles, and history. These matters are narrated without a basis or chain of narration from those who omit narrators such as what is mentioned from Urwah ibn Az-Zubair, Ash-Sha’bi, Az-Zuhri, Musa ibn Uqbah, and Ibn Ishaq.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/02\/10\/ibn-taymiyyah-on-history-beware-of-inauthentic-reports-in-books-of-history-and-exegesis\/\">Majmu’ Al-Fatawa 13\/346<\/a><\/p><\/blockquote>\n<p>Aside from apocryphal writings, anti-Muslim propagandists will cite what is authentic from the Quran and Sunnah but without its proper context and interpretation, giving it a meaning other than its intended meaning.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِن بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ<\/p>\n<p><b>Do you hope they will believe in you while a group among them hear the word of Allah, then they distorted its meaning after they understood while they were knowing?<\/b><\/p>\n<p>Surah Al-Baqarah 2:75<\/p><\/blockquote>\n<p>This verse is criticizing some of the Jews who would change the meaning of the Torah even after they understood the intention of its verses. Yet, it is a general phenomenon that many people who are against the religion of Allah intend to change it with various methods of dishonest interpretation. In our case, many times the Quran and Sunnah are mistranslated or cited without proper context.<\/p>\n<p>For example, perhaps the most misunderstood verses in the Quran are the verses that permit warfare. Some classical scholars referred to these as the “sword verses” by which they meant the sword as a symbol of justice, but anti-Muslim propagandists reinterpret the sword as a symbol of aggression instead. They cite the saying of Allah:<\/p>\n<blockquote>\n<p align=\"right\">فَإِذَا انسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدتُّمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ<\/p>\n<p><b>When the sacred months have passed, then kill the idolaters wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush.<\/b><\/p>\n<p>Surah At-Tawba 9:5<\/p><\/blockquote>\n<p>From this half of the verse, they determine that Islam prescribes killing all non-Muslims simply for being non-Muslims, but they omit the remainder of the verse:<\/p>\n<blockquote>\n<p align=\"right\">فَإِن تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَخَلُّوا سَبِيلَهُمْ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ<\/p>\n<p><b>But if they should repent, establish prayer, and give charity, let them go on their way. Verily, Allah is forgiving and merciful.<\/b><\/p>\n<p>Surah At-Tawba 9:5<\/p><\/blockquote>\n<p>The verse is referring to those who initiated aggression against the Muslim community, which is why they are called to repent and, if they do so, the war would be over. In the following verse, all they are required to do to end the war is to cease their aggression:<\/p>\n<blockquote>\n<p align=\"right\">وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْلَمُونَ<\/p>\n<p><b>If any one of the idolaters seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know.<\/b><\/p>\n<p>Surah At-Tawba 9:6<\/p><\/blockquote>\n<p>It is only by disregarding this context and the broader meaning of the passage that anti-Muslim propagandists can derive their distorted meaning.<\/p>\n<p>M.A.S. Abdul Haleem, Professor of Oriental and African Studies at the University of London, writes:<\/p>\n<blockquote><p>The main clause of the sentence, “<strong>kill the polytheists<\/strong>,” is singled out by some non-Muslims as representing the Islamic attitude to war. Even some Muslims takes this view and allege that this verse abrogated many other verses including, “<strong>There is no compulsion in religion<\/strong>,” (2:256) and even according to one solitary extremist, “<strong>God is forgiving and merciful<\/strong>.”<\/p>\n<p>This far-fetched interpretation isolates and decontextualizes a small part of a sentence and of a passage which gives many reasons for the order to fight such polytheists: they continually broke their agreements and aided others against the Muslims, they started hostilities against the Muslims, barred others from becoming Muslims, expelled them from the Holy Mosque and even from their own homes. At least eight times the passage mentions the misdeeds of these people against the Muslims.<\/p>\n<p>Moreover, consistent with the restriction of war elsewhere in the Quran, the immediate context of this “sword verse” exempts such polytheists who do not break their agreements and who keep peace with Muslims. It orders that those enemies seeking safe conduct should be protected and delivered to the place of safety they seek. The whole of this context to verse 9:5, with all its restrictions, is ignored by those who simply isolate one part of a sentence to build on it their theory of violence in Islam.<\/p>\n<p>Source: <i>The Qur’an, English translation and parallel Arabic text<\/i>. p. xxiii<\/p><\/blockquote>\n<p>In a similar manner, anti-Muslim propagandists cite some verses of the Quran in order make Islam appear as if it is cruel to women. They cite the saying of Allah:<\/p>\n<blockquote>\n<p align=\"right\">وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا<\/p>\n<p><b>But those wives from whom you fear arrogance, first advise them, then if they persist forsake them in bed, and finally strike them. But if they obey you, seek no means against them.<\/b><\/p>\n<p>Surah An-Nisa 4:34<\/p><\/blockquote>\n<p>They will translate the word “strike” as “beat” as if the verse gives men permission to harm their wives, but the commentators of the Quran agreed that the “striking” here should be without severity (<i><a href=\"https:\/\/abuaminaelias.com\/does-the-quran-let-muslims-beat-their-wives\/\">ghayru mubarrih<\/a><\/i>). This striking is not meant to harm the wife, but rather it is a teaching mechanism intended to direct her attention to the severity of her misdeeds. For this reason, Ar-Razi said:<\/p>\n<blockquote>\n<p align=\"right\">أن يكون الضرب بمنديل ملفوف أو بيده ولا يضربها بالسياط ولا بالعصا<\/p>\n<p>It should be a striking with a folded handkerchief or his palm, and he should not strike her with whips or clubs.<\/p>\n<p>Source: Tafseer Ar-Razi 4:34<\/p><\/blockquote>\n<p>These two issues, warfare and women, are commonly used to demonize Islam and Muslims. As a result, we need to respond with what the Quran and Sunnah really teach about warfare and women.<\/p>\n<p>Regarding warfare, Allah has prescribed it as a means of self-defense and only as a last resort when all peaceful measures have failed.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ<\/p>\n<p><b>If they incline to peace, then incline to it also and trust in Allah. Verily, He is the Hearing, the Knowing.<\/b><\/p>\n<p>Surah Al-Anfal 8:61<\/p><\/blockquote>\n<p>Ali ibn Abu Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهُ سَيَكُونُ بَعْدِي اخْتِلَافٌ أَوْ أَمْرٌ فَإِنْ اسْتَطَعْتَ أَنْ تَكُونَ السِّلْمَ فَافْعَل<\/p>\n<p><b>Verily, after me there will be conflicts or affairs, so if you are able to end them in peace then do so.<\/b><\/p>\n<p>Source: Musnad Ahmad 697, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/11\/29\/hadith-on-peace-if-you-can-end-conflicts-in-peace-then-do-so\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Regarding women, Allah has commanded men to treat them with kindness and the Prophet said the best men are those who are best to women.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ<\/p>\n<p><b>Live with them in kindness.<\/b><\/p>\n<p>Surah An-Nisa 4:19<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَخِيَارُكُمْ خِيَارُكُمْ لِنِسَائِهِمْ خُلُقًا<\/p>\n<p><b>The most complete of the believers in faith are those with the best character, and the best of you are the best in behavior to their women.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1162, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/10\/hadith-on-women-the-best-of-you-are-the-best-in-character-to-their-women\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Finally, anti-Muslim propagandists will attempt to perform publicity stunts in hopes that Muslims will react negatively with bad behavior or even violence. We witnessed such events when some people publicized their intention to burn the Quran or to produce an anti-Muslim film slandering the Prophet.<\/p>\n<p>Indeed, it is the plot of Satan to incite the believers to commit injustice. Satan has given up that those who pray will ever worship him, so instead he intends to exploit their anger.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الشَّيْطَانَ قَدْ يَئِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ وَلَكِنْ فِي التَّحْرِيشِ بَيْنَهُمْ ‏<\/p>\n<p><b>Verily, Satan has despaired of getting those who perform prayer to worship him, but rather he incites discord between them.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1937, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/26\/hadith-on-hatred-satan-is-busy-inciting-hatred-among-the-believers\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>When Muslims react negatively to such events, they are in fact being used by Satan. Such misbehavior by Muslims will give them a powerful weapon to use against Islam. Rather, in such cases, Allah has called upon us to be patient with those who abuse us and our religion.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذًى كَثِيرًا وَإِن تَصْبِرُوا وَتَتَّقُوا فَإِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><b>You will surely hear much abuse from those who were given the Scripture before you and from those who associate others with Allah. But if you are patient and fear Allah, verily, that is of the matters worthy of determination.<\/b><\/p>\n<p>Surah Ali Imran 3:186<\/p><\/blockquote>\n<p>Likewise, Allah has called upon us to forgive those who misrepresent our religion and not to seek revenge against them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قُل لِّلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْمًا بِمَا كَانُوا يَكْسِبُونَ<\/p>\n<p><b>Say to those who believe that they should forgive those who expect not the days of Allah, as it is for Him to recompense people for what they have earned.<\/b><\/p>\n<p>Surah Al-Jathiyah 45:14<\/p><\/blockquote>\n<p>Therefore, the best way to respond to anti-Muslim propaganda is with knowledge of our scriptures and the good character of the prophets. If we can respond positively in this way, we can minimize their harmful impact and further increase ourselves in good deeds.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;They are those who prefer the worldly life over the Hereafter&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[13,61,16,25,26,37,151,39,47,50,100,53,55,58,59,115,62,45,68,98,128],"class_list":["post-15463","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-anger-al-ghadhab","tag-call-to-islam-dawah","tag-character-akhlaq","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-idolatry-shirk","tag-ignorance-al-jahl","tag-imam-ahmad-ibn-hanbal","tag-jihad","tag-knowledge","tag-manners-al-adab","tag-marriage-al-nikah","tag-methodology-al-minhaj","tag-patience-al-sabr","tag-peace","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-quran-exegesis-tafsir","tag-satan-al-shaytan","tag-unbelief-al-kufr","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-41p","jetpack-related-posts":[{"id":15973,"url":"https:\/\/www.abuaminaelias.com\/jihad-sixth-pillar-of-islam\/","url_meta":{"origin":15463,"position":0},"title":"Jihad is the sixth pillar of Islam?","author":"Abu Amina Elias","date":"August 2, 2014","format":false,"excerpt":"\"Islam is built upon five pillars...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":15463,"position":1},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":15463,"position":2},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":15463,"position":3},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16523,"url":"https:\/\/www.abuaminaelias.com\/blessed-are-the-strangers-in-islam\/","url_meta":{"origin":15463,"position":4},"title":"Blessed are the strangers in Islam","author":"Abu Amina Elias","date":"April 10, 2015","format":false,"excerpt":"\"Be in this world as if you were a stranger or a traveler along a path.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":15463,"position":5},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15463","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15463"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15463\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15463"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15463"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15463"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}