{"id":15489,"date":"2014-02-17T11:46:55","date_gmt":"2014-02-17T07:46:55","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15489"},"modified":"2018-03-25T17:05:29","modified_gmt":"2018-03-25T13:05:29","slug":"nearest-to-allah-and-the-prophet-in-the-hereafter","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/nearest-to-allah-and-the-prophet-in-the-hereafter\/","title":{"rendered":"Nearest to Allah and the Prophet in the Hereafter"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>By performing various good deeds, we will become closer to Allah on the Day of Resurrection and will earn the intercession of Prophet Muhammad.<\/p>\n<p>The first and foremost good deed which serves as the foundation for all other good deeds is to worship Allah alone, sincerely with a pure heart and without associating any partners with Him. The intercession of Prophet Muhammad will only be allowed for those who sincerely worshiped Allah.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ خَالِصًا مِنْ قَلْبِهِ<\/p>\n<p><b>The happiest of people who earn my intercession on the Day of Resurrection are those who say there is no God but Allah sincerely from the heart.<\/b><\/p>\n<p>Source: Sahih Bukhari 99, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/02\/17\/hadith-on-intercession-those-who-earn-the-prophets-intercession-are-sincere-to-allah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>We will be closer to Prophet Muhammad’s gathering if we invoke peace and blessings upon him often.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَوْلَى النَّاسِ بِي يَوْمَ الْقِيَامَةِ أَكْثَرُهُمْ عَلَيَّ صَلَاةً<\/p>\n<p><b>The closest of the people to me on the Day of Resurrection are those who invoked the most blessings upon me.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 484, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/22\/hadith-on-supplications-the-nearest-to-the-prophet-on-judgment-day-are-those-who-supplicated-for-him\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Whenever we invoke peace and blessings upon the Prophet, Allah will send peace and blessings upon us ten times, thereby filling our records with good deeds.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا<\/p>\n<p><b>Whoever sends blessings upon me once will have Allah send blessings upon him ten times.<\/b><\/p>\n<p>Source: Sahih Muslim 408, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/23\/hadith-on-muhammad-bless-the-prophet-once-and-allah-will-bless-you-ten-times\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>In fact, there is a specific supplication for Prophet Muhammad we should say after we hear the call to prayer in which we ask Allah to raise his status. If we do so regularly, we can earn his intercession.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ<\/p>\n<p><b>Whoever says after hearing the call to prayer: O Allah, Lord of this perfect call and established prayer, give Muhammad the means of approach and favor, and raise him to the praiseworthy status which You promised for him; then my intercession will be allowed for him on the Day of Resurrection.<\/b><\/p>\n<p>Source: Sahih Bukhari 589, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/24\/the-correct-way-to-seek-the-prophet%E2%80%99s-intercession-on-judgment-day\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Good character is one of the <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/31\/hadith-on-character-good-character-is-the-heaviest-on-the-scale-and-allah-hates-shameless-obscenity\/\">heaviest of good deeds<\/a> upon the Scale in the Hereafter and likewise it will bring us nearer to Prophet Muhammad. In contrast, arrogance and bad character will keep us away from him.<\/p>\n<p>Amr ibn Shuaib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَلَا أُخْبِرُكُمْ بِأَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحْسَنُكُمْ خُلُقًا<\/p>\n<p><b>Shall I tell you about the most beloved to me and the closest to my assembly on the Day of Resurrection? They are those with the best character.<\/b><\/p>\n<p>Source: Musnad Ahmad 6696, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/02\/hadith-on-character-the-most-beloved-and-closest-to-the-prophet-are-those-with-the-best-character\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ مِنْ أَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحَاسِنَكُمْ أَخْلَاقًا وَإِنَّ أَبْغَضَكُمْ إِلَيَّ وَأَبْعَدَكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ الثَّرْثَارُونَ وَالْمُتَشَدِّقُونَ وَالْمُتَفَيْهِقُونَ<\/p>\n<p><b>Verily, the most beloved and nearest to my gathering on the Day of Resurrection are those of you with the best character. Verily, the most reprehensible of you to me and the furthest from my gathering on the Day of Resurrection will be the pompous, the extravagant, and the arrogant.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2018, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/30\/hadith-on-character-the-closest-to-the-prophet-will-be-those-with-the-best-character\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>An essential aspect of good character is to practice justice and fairness in all of our matters. The most beloved people to Allah are those who are just and they will earn a tremendous reward in the Hereafter, whereas those who are oppressive will be the furthest from Him.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِينٌ الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا<\/p>\n<p><b>Verily, those who were fair will be in the presence of Allah upon pulpits of light, near the right hand of the Merciful, the Exalted, and both of His sides are honorable. They are those who practiced justice in their rulings and with their families and in all that they did.<\/b><\/p>\n<p>Source: Sahih Muslim 4493, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/04\/hadith-on-justice-the-just-will-be-exalted-at-the-right-hand-of-the-merciful-seated-on-pulpits-of-light\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Sa’eed reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ أَحَبَّ النَّاسِ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَدْنَاهُمْ مِنْهُ مَجْلِسًا إِمَامٌ عَادِلٌ وَأَبْغَضَ النَّاسِ إِلَى اللَّهِ وَأَبْعَدَهُمْ مِنْهُ مَجْلِسًا إِمَامٌ جَائِرٌ<\/p>\n<p><b>Verily, the most beloved of people to Allah on the Day of Resurrection and the nearest to Him will be the just leader. The most hated of people to Allah and the furthest from Him will be the tyrannical leader.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 1329, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/02\/17\/hadith-on-justice-the-closest-to-allah-in-the-hereafter-are-the-leaders-of-justice\/\"><i>Hasan<\/i><\/a><\/p><\/blockquote>\n<p>Another essential aspect of good character is to love others for the sake of Allah. This love is <a href=\"https:\/\/abuaminaelias.com\/religious-love-and-human-love-in-islam\/\">religious love<\/a>, not human love. It means to have an intention and desire to benefit others in this life and in the Hereafter, and it manifests itself in kindness and good works for others.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ بِجَلَالِي الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي<\/p>\n<p><b>Allah will say on the Day of Resurrection: Where are those who love each other for the sake of my glory? Today, I will shelter them in my shade on a day when there is no shade but mine.<\/b><\/p>\n<p>Source: Sahih Muslim 2566, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/05\/where-are-those-who-love-each-other-for-the-sake-of-allah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْمُتَحَابُّونَ فِي جَلَالِي لَهُمْ مَنَابِرُ مِنْ نُورٍ يَغْبِطُهُمْ النَّبِيُّونَ وَالشُّهَدَاءُ<\/p>\n<p><b>Allah the Exalted said: Those who love each other for the sake of my glory will be upon pulpits of light and they will be envied by the prophets and the martyrs.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2390, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/02\/hadith-on-love-those-who-love-each-other-for-the-sake-of-allah-will-be-envied-by-the-prophets\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الْمُؤْمِنُ يَأْلَفُ وَيُؤْلَفُ وَلا خَيْرَ فِيمَنْ لا يَأْلَفُ وَلا يُؤْلَفُ وَخَيْرُ النَّاسِ أَنْفَعُهُمْ لِلنَّاسِ<\/p>\n<p><b>The believer is kind and gracious, for there is no goodness in one who is neither kind nor gracious. The best of the people are those who are most beneficial to others.<\/b><\/p>\n<p>Source: Mu’jam Al-Awsat 5937, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/02\/11\/hadith-on-kindness-the-best-people-are-those-who-are-kind-and-benefit-others\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>Closely related to love for the sake of Allah is the virtue of spreading peace among people, by greeting people with peace and encouraging reconciliation.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><b>You will not enter Paradise until you believe and you will not believe until you love each other. Shall I show you something that, if you did, you would love each other? Spread peace between yourselves.<\/b><\/p>\n<p>Source: Sahih Muslim 54, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/16\/hadith-on-love-you-will-not-enter-paradise-until-you-love-each-other-for-the-sake-of-allah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Indeed, the closest of the people to Allah are those who greet others with peace first.<\/p>\n<p>Abu Umamah reported: He said, “O Messenger of Allah, when two people meet each other, who should greet with peace first?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">أَوْلَاهُمَا بِاللَّهِ<\/p>\n<p><b>The one closest to Allah will greet first.<\/b><\/p>\n<p>Source: Sunan At-Tirmidhi 2694, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/28\/hadith-on-greetings-the-one-nearest-and-more-beloved-to-allah-will-greet-with-peace-first\/\">Hasan<\/a><\/i><\/p><\/blockquote>\n<p>These are some of the virtues and good deeds we can practice in order to become nearer to Allah and His Messenger on the Day of Resurrection. We ask Allah to make us among those who are blessed with such an honorable gathering.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Shall I tell you about the most beloved to me and the closest to my assembly on the Day of Resurrection? They are those with the best character.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[14,16,18,183,49,32,246,48,51,52,100,56,59,60,196,124,70,220],"class_list":["post-15489","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-arrogance-al-takabbur","tag-character-akhlaq","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-intention-al-niyyah","tag-justice-adl","tag-leadership-imamate","tag-love-al-mahabbah","tag-manners-al-adab","tag-monotheism-tawheed","tag-peace","tag-prayer-salat","tag-prophetic-virtues","tag-reconciliation","tag-sincerity-al-ikhlaas","tag-supplication-al-dua"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-41P","jetpack-related-posts":[{"id":23683,"url":"https:\/\/www.abuaminaelias.com\/asking-dead-for-dua\/","url_meta":{"origin":15489,"position":0},"title":"Asking the deceased for supplications or intercession?","author":"Abu Amina Elias","date":"November 7, 2021","format":false,"excerpt":"\"If you ask, ask from Allah. If you seek help, seek help from Allah.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":11235,"url":"https:\/\/www.abuaminaelias.com\/is-prophet-muhammad-better-than-other-prophets-making-no-distinction-between-the-prophets-of-allah\/","url_meta":{"origin":15489,"position":1},"title":"Prophet Muhammad is better than other Prophets?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"No servant should say that I am better than Jonah son of Mata.\" [Sahih Bukhari, Book 5, Number 627]","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22747,"url":"https:\/\/www.abuaminaelias.com\/benefits-sunan-adhan\/","url_meta":{"origin":15489,"position":2},"title":"Benefits of the Sunan of Adhan, call to prayer","author":"Abu Amina Elias","date":"December 27, 2020","format":false,"excerpt":"\"I am pleased with Allah as Lord,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":15489,"position":3},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13762,"url":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","url_meta":{"origin":15489,"position":4},"title":"Salvation for non-Muslims outside of Islam?","author":"Abu Amina Elias","date":"June 8, 2013","format":false,"excerpt":"\"Allah will judge between them on the Day of Resurrection.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15748,"url":"https:\/\/www.abuaminaelias.com\/allah-multiplies-the-reward-for-good-deeds\/","url_meta":{"origin":15489,"position":5},"title":"Allah multiplies the reward for good deeds","author":"Abu Amina Elias","date":"June 9, 2014","format":false,"excerpt":"\"Every deed of the son of Adam is multiplied from ten to seven hundred times.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15489","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15489"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15489\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15489"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15489"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15489"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}