{"id":15522,"date":"2014-02-24T11:36:24","date_gmt":"2014-02-24T07:36:24","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15522"},"modified":"2018-03-21T12:28:43","modified_gmt":"2018-03-21T08:28:43","slug":"attributes-of-success-in-the-hereafter","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/attributes-of-success-in-the-hereafter\/","title":{"rendered":"Attributes of success in the Hereafter"},"content":{"rendered":"<p><i>In the name of Allah, the Beneficent, the Merciful<\/i><\/p>\n<p>There are many ways people measure success in the worldly life, such as acquiring wealth, advancing in career, or having many children. However, Islam teaches us that true success is to be successful on the Day of Resurrection.<\/p>\n<p>There is an important passage in Surah Al-Muminun detailing the attributes of those who succeed in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قَدْ أَفْلَحَ الْمُؤْمِنُونَ الَّذِينَ هُمْ فِي صَلَاتِهِمْ خَاشِعُونَ وَالَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ وَالَّذِينَ هُمْ لِلزَّكَاةِ فَاعِلُونَ وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ إِلَّا عَلَىٰ أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ فَمَنِ ابْتَغَىٰ وَرَاءَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْعَادُونَ وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ أُولَٰئِكَ هُمُ الْوَارِثُونَ الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ<\/p>\n<p><b>Certainly the believers have succeeded, who are reverent during their prayers, who turn away from ill speech, who give in charity, who guard their chastity except from their wives or those their right hands possess, for they will not be blamed, but whoever seeks beyond that are transgressors, who fulfill their trusts and promises, who preserve their prayers, those are the inheritors who will inherit the highest Paradise in which they will abide for eternity.<\/b><\/p>\n<p>Surah Al-Muminun 23:1-11<\/p><\/blockquote>\n<p>Allah mentions here that the virtues practiced by those who succeed are true faith, prayer, charity, guarding the tongue, chastity, and truthfulness.<\/p>\n<p>True faith is to have complete faith inwardly with sincerity toward Allah and purity of heart, as well as complete faith outwardly by affirming the articles of faith, performing the obligations, and avoiding sin. They live by the virtues of faith to the point that they have become absolutely certain of the truth of Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ أُولَٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><b>They are those who believe in what has been revealed to you and what has been revealed before you and they are certain of the Hereafter. Those are upon guidance from their Lord and they will be successful.<\/b><\/p>\n<p>Surah Al-Baqarah 2:4-5<\/p><\/blockquote>\n<p>This means the believers must submit completely to the judgment of Allah and His Messenger, and to be obedient to their commands.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ أَن يَقُولُوا سَمِعْنَا وَأَطَعْنَا وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><b>The only statement of the believers when they are called to Allah and His Messenger to judge between them is that they say: We hear and we obey. Those will be successful.<\/b><\/p>\n<p>Surah An-Nur 24:51<\/p><\/blockquote>\n<p>After faith, the most important obligation is to fulfil the daily prayers. Allah has doubly emphasized the prayer by mentioning it at the beginning and end of the passage in Surah Al-Muminun, as well as in Surah Al-Ma’arij.<\/p>\n<p>The ritual prayer is fulfilled by completing them in their proper times and with correct observance, but the believers must also fulfill its objectives outside of prayer such as remembering Allah at all times, performing regular supplications, reading the Quran, and purifying the heart from spiritual diseases.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قَدْ أَفْلَحَ مَن تَزَكَّىٰ وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ<\/p>\n<p><b>He has succeeded who purifies himself, remembers the name of His Lord, and he prays.<\/b><\/p>\n<p>Surah Al-A’la 87:14-15<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><b>Whoever is protected from the greed in his soul, those will be successful.<\/b><\/p>\n<p>Surah At-Taghabun 64:16<\/p><\/blockquote>\n<p>Abu Malik Al-Ashari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">الطُّهُورُ شَطْرُ الْإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآَنِ أَوْ تَمْلَأُ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ وَالصَّلَاةُ نُورٌ وَالصَّدَقَةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ<\/p>\n<p><b>Purity is half of faith and the praise of Allah fills the scale. Glorification and praise fill up what is between the heavens and the earth. Prayer is a light, charity is proof, and patience is illumination.<\/b><\/p>\n<p>Source: Sahih Muslim 223, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/06\/purity-is-half-of-faith-prayer-is-light-charity-is-proof-and-patience-is-illumination\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Furthermore, the prayer is not completely fulfilled unless it reforms our behavior when we are not praying, such that we abstain from sin.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتْلُ مَا أُوحِيَ إِلَيْكَ مِنَ الْكِتَابِ وَأَقِمِ الصَّلَاةَ ۖ إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ<\/p>\n<p><b>Recite what has been revealed to you from the Book and establish prayer. Verily, prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.<\/b><\/p>\n<p>Surah Al-Aknabut 29:45<\/p><\/blockquote>\n<p>Abu Huraira reported: A man came to the Prophet and he said, “Indeed, this person prays in the night but he steals in the morning.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّهُ سَيَنْهَاهُ مَا يَقُولُ<\/p>\n<p><b>Verily, it should prohibit him from doing that.<\/b><\/p>\n<p>Source: Musnad Ahmad 9486, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/07\/hadith-on-prayer-a-sincere-prayer-should-prevent-a-person-from-committing-major-sins\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The successful perform acts of charity for others. Our families, the poor, and the needy have a right that we help them as much as we are able. This includes both fulfilling the obligatory charity (<i>zakat<\/i>) which is to give at least 2.5% of our surplus wealth to the poor, as well as to perform many voluntary good deeds (<i>sadaqah<\/i>) for others.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَآتِ ذَا الْقُرْبَىٰ حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ ۚ ذَٰلِكَ خَيْرٌ لِّلَّذِينَ يُرِيدُونَ وَجْهَ اللَّهِ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><b>Give the relative his right, as well as the needy and the traveler. That is best for those who desire the countenance of Allah. Those will be successful.<\/b><\/p>\n<p>Surah Ar-Rum 30:38<\/p><\/blockquote>\n<p>Indeed, every good deed is charity, even smiling at another person. By performing such acts of charity, we will earn good deeds that will be heavy upon the scale on the side of goodness in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَمَن ثَقُلَتْ مَوَازِينُهُ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><b>Those whose scales are heavy with good deeds, it is those who will be successful.<\/b><\/p>\n<p>Surah Al-Muminun 23:102<\/p><\/blockquote>\n<p>The successful are careful to guard their tongues from speaking in vain. A believer only has the option of speaking goodness or remaining silent.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ<\/p>\n<p><b>Whoever believes in Allah and the Last Day, let him speak goodness or remain silent. <\/b><\/p>\n<p>Source: Sahih Muslim 47m Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/09\/22\/let-him-speak-goodness-let-him-honor-his-neighbor-and-guest\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Likewise, the believers turn away from vain speech whenever they hear it. They do not argue among those who speak vanities, but rather they leave their company with grace.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَإِذَا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقَالُوا لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ سَلَامٌ عَلَيْكُمْ لَا نَبْتَغِي الْجَاهِلِينَ<\/p>\n<p><b>When they hear ill speech, they turn away from it and say: For us are our deeds and for you are your deeds. Peace be upon you. We seek not the ignorant.<\/b><\/p>\n<p>Surah Al-Qasas 28:55<\/p><\/blockquote>\n<p>The successful practice chastity and they protect their private parts from adultery and fornication, for sexual intimacy is only allowed in a lawful marriage.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلَا تَقْرَبُوا الزِّنَا إِنَّهُ كَانَ فَاحِشَةً وَسَاءَ سَبِيلًا<\/p>\n<p><b>Do not approach unlawful sexual intercourse. Verily, it is ever immoral and is an evil way.<\/b><\/p>\n<p>Surah Al-Isra 17:32<\/p><\/blockquote>\n<p>Allah has commanded the believers to limit sexual intercourse to marriage alone, including the servants mentioned as “<a href=\"https:\/\/abuaminaelias.com\/does-islam-allow-muslims-to-rape-female-sex-slaves-or-keep-unmarried-concubines\/\">those whom your right hands possess<\/a>.” It is not lawful for a man to have a mistress or a concubine with whom he has intercourse without marrying her.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَانكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلَا مُتَّخِذَاتِ أَخْدَانٍ<\/p>\n<p><b>Marry the servant girls with permission from their people and give them their due compensation according to what is acceptable. They should be chaste, neither of those who commit unlawful intercourse randomly nor those who take secret lovers.<\/b><\/p>\n<p>Surah An-Nisa 4:25<\/p><\/blockquote>\n<p>Even those who look at someone with lust have committed a lesser form of adultery, so we must avoid these acts in order to be successful.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَى أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ فَزِنَى الْعَيْنَيْنِ النَّظَرُ وَزِنَى اللِّسَانِ النُّطْقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يُصَدِّقُ ذَلِكَ أَوْ يُكَذِّبُهُ<\/p>\n<p><b>Verily, Allah has written for the son of Adam his portion of adultery which he will inevitably commit: the adultery of the eyes is the lustful look, the adultery of the tongue is lustful speech, and the soul hopes and lusts for what the private parts will fulfill or deny.<\/b><\/p>\n<p>Source: Sahih Muslim 2657, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/08\/hadith-on-desires-adultery-can-be-committed-with-the-eyes-and-tongue\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>The successful are truthful in their dealings with others, such that they fulfill their trusts and promises.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَوْفُوا بِالْعَهْدِ إِنَّ الْعَهْدَ كَانَ مَسْئُولًا<\/p>\n<p><b>Fulfill the covenants. Verily, the covenants will be questioned.<\/b><\/p>\n<p>Surah Al-Isra 17:34<\/p><\/blockquote>\n<p>In contrast, those who broke their promises, violated their covenants, and failed to fulfill their trusts will be exposed on the Day of Resurrection.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا جَمَعَ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ يَوْمَ الْقِيَامَةِ يُرْفَعُ لِكُلِّ غَادِرٍ لِوَاءٌ فَقِيلَ هَذِهِ غَدْرَةُ فُلاَنِ بْنِ فُلاَنٍ<\/p>\n<p><b>When Allah gathers together the earlier and later generations on the Day of Resurrection, He will raise a banner for every treacherous person and it will be announced that this is the treachery of this person, the son of this person.<\/b><\/p>\n<p>Source: Sahih Muslim 1735, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/22\/hadith-on-treachery-whoever-treacherously-breaks-his-promises-will-be-exposed-on-the-day-of-judgment\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Finally, the successful are those who not only practice these virtues as individuals, but they go even further by calling people to the virtues of Islam, enjoining good, and forbidding evil.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَلْتَكُن مِّنكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><b>Let a nation arise among you calling to goodness, enjoining good, and forbidding evil. Those will be successful.<\/b><\/p>\n<p>Surah Ali Imran 3:104<\/p><\/blockquote>\n<p>We ask Allah to make us among those who practice these virtues, inwardly and outwardly, who call others to the way of Allah and thereby succeed in the Hereafter.<\/p>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Certainly the believers have succeeded.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[127,61,16,17,331,18,334,183,168,24,184,32,100,53,56,94,134,58,59,60,107,84,66,333,70,220,72,332],"class_list":["post-15522","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-adultery-zina","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-chastity-al-hisn","tag-community-jamaah","tag-certainty-al-yaqin","tag-day-of-resurrection-yawm-al-qiyammah","tag-enjoin-good-amr-bil-maruf","tag-family-ties-sillat-rahim","tag-guidance-al-hidaya","tag-hereafter-akhirah","tag-manners-al-adab","tag-marriage-al-nikah","tag-monotheism-tawheed","tag-obedience-al-taah","tag-paradise-jannah","tag-patience-al-sabr","tag-peace","tag-prayer-salat","tag-public-trust-al-amanah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-remembrance-dhikr","tag-reverence-al-khushu","tag-sincerity-al-ikhlaas","tag-supplication-al-dua","tag-truthfulness-al-sidq","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-42m","jetpack-related-posts":[{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":15522,"position":0},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12950,"url":"https:\/\/www.abuaminaelias.com\/light-surah-al-kahf-jumuah\/","url_meta":{"origin":15522,"position":1},"title":"Light for reciting Surat al-Kahf on Friday","author":"Abu Amina Elias","date":"March 15, 2013","format":false,"excerpt":"\"Whoever recites Surat al-Kahf on Friday will have light...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15651,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-integrity-istiqamah\/","url_meta":{"origin":15522,"position":2},"title":"Imam al-Nawawi on Integrity, Steadfastness","author":"Abu Amina Elias","date":"April 16, 2014","format":false,"excerpt":"\"Remain upright as you are commanded.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18213,"url":"https:\/\/www.abuaminaelias.com\/positive-thinking-in-islam\/","url_meta":{"origin":15522,"position":3},"title":"Positive thinking and optimism in Islam","author":"Abu Amina Elias","date":"June 4, 2016","format":false,"excerpt":"\"I am as my servant expects Me and I am with him as he remembers Me.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16910,"url":"https:\/\/www.abuaminaelias.com\/helping-refugees-and-emigrants-in-islam\/","url_meta":{"origin":15522,"position":4},"title":"Helping refugees and emigrants in Islam","author":"Abu Amina Elias","date":"August 26, 2015","format":false,"excerpt":"\"Whoever helps ease someone in difficulty, Allah will make it easy for him in this world and in the Hereafter.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15489,"url":"https:\/\/www.abuaminaelias.com\/nearest-to-allah-and-the-prophet-in-the-hereafter\/","url_meta":{"origin":15522,"position":5},"title":"Nearest to Allah and the Prophet in the Hereafter","author":"Abu Amina Elias","date":"February 17, 2014","format":false,"excerpt":"\"Shall I tell you about the most beloved to me and the closest to my assembly on the Day of Resurrection? They are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15522","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15522"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15522\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15522"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15522"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15522"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}