{"id":15646,"date":"2014-04-15T15:37:48","date_gmt":"2014-04-15T11:37:48","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15646"},"modified":"2025-03-03T12:33:20","modified_gmt":"2025-03-03T08:33:20","slug":"an-nawawi-on-repentance-tawbah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-repentance-tawbah\/","title":{"rendered":"Imam al-Nawawi on Repentance, Seeking Forgiveness"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ العلماءُ التَّوْبَةُ وَاجبَةٌ مِنْ كُلِّ ذَنْب فإنْ كَانتِ المَعْصِيَةُ بَيْنَ العَبْدِ وبَيْنَ اللهِ تَعَالَى لاَ تَتَعلَّقُ بحقّ آدَمِيٍّ فَلَهَا ثَلاثَةُ شُرُوط أحَدُها أَنْ يُقلِعَ عَنِ المَعصِيَةِ والثَّانِي أَنْ يَنْدَمَ عَلَى فِعْلِهَا والثَّالثُ أَنْ يَعْزِمَ أَنْ لا يعُودَ إِلَيْهَا أَبَدًا فَإِنْ فُقِدَ أَحَدُ الثَّلاثَةِ لَمْ تَصِحَّ تَوبَتُهُ<\/p>\n<p style=\"text-align: right;\">وإنْ كَانَتِ المَعْصِيةُ تَتَعَلقُ بآدَمِيٍّ فَشُرُوطُهَا أرْبَعَةٌ هذِهِ الثَّلاثَةُ وأَنْ يَبْرَأَ مِنْ حَقّ صَاحِبِها، فَإِنْ كَانَتْ مالًا أَوْ نَحْوَهُ رَدَّهُ إِلَيْه<\/p>\n<p>The scholars have said it is necessary to repent from every sin. If the offense is between the servant and Allah Almighty, unrelated to the right of a human being, then it has three conditions: First, to stop committing it. Second, to feel regret for committing it. Third, to be determined not to recommit it. If one of these three are missing, one&#8217;s repentance is not sound.<\/p>\n<p>If the offense is related to a human being, then its conditions are four: these three and fulfilling the rights of those involved. If it involves property and so on, it is restored to him.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/14<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p align=\"right\">وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ<\/p>\n<p><strong>Turn to Allah in repentance all together, O believers, so that you may be successful.<\/strong><\/p>\n<p>Surat al-Nur 24:31<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَأَنِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ يُمَتِّعْكُم مَّتَاعًا حَسَنًا إِلَىٰ أَجَلٍ مُّسَمًّى وَيُؤْتِ كُلَّ ذِي فَضْلٍ فَضْلَهُ وَإِن تَوَلَّوْا فَإِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيرٍ<\/p>\n<p><strong>Seek your Lord’s forgiveness and turn to Him in repentance. He will grant you a good provision for an appointed term and graciously reward the doers of good. But if you turn away, then I truly fear for you the torment of a formidable Day.<\/strong><\/p>\n<p>Surat Hud 11:3<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ<\/p>\n<p><strong>O believers! Turn to Allah in sincere repentance, so your Lord may absolve you of your sins and admit you into Gardens, under which rivers flow, on the Day Allah will not disgrace the Prophet or the believers with him. Their light will shine ahead of them and on their right. They will say, &#8216;Our Lord! Perfect our light for us, and forgive us. For You are truly Most Capable of everything.&#8217;<\/strong><\/p>\n<p>Surat al-Tahrim 66:8<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">وَاللَّهِ إِنِّي لَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً<\/p>\n<p><strong>By Allah, I seek forgiveness from Allah and I repent to him more than seventy times in a day.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6307, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/tawbah-repent-seventy-times-day\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا النَّاسُ تُوبُوا إِلَى اللَّهِ فَإِنِّي أَتُوبُ فِي الْيَوْمِ إِلَيْهِ مِائَةَ مَرَّةٍ<\/p>\n<p><strong>O people, turn to Allah in repentance. Verily, I repent to him one hundred times in a day.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2702, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/repentance-one-hundred-day\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ حِينَ يَتُوبُ إِلَيْهِ مِنْ أَحَدِكُمْ كَانَ عَلَى رَاحِلَتِهِ بِأَرْضِ فَلاَةٍ فَانْفَلَتَتْ مِنْهُ وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ مِنْهَا فَأَتَى شَجَرَةً فَاضْطَجَعَ فِي ظِلِّهَا قَدْ أَيِسَ مِنْ رَاحِلَتِهِ فَبَيْنَا هُوَ كَذَلِكَ إِذَا هُوَ بِهَا قَائِمَةً عِنْدَهُ فَأَخَذَ بِخِطَامِهَا ثُمَّ قَالَ مِنْ شِدَّةِ الْفَرَحِ اللَّهُمَّ أَنْتَ عَبْدِي وَأَنَا رَبُّكَ أَخْطَأَ مِنْ شِدَّةِ الْفَرَحِ<\/p>\n<p><strong>Allah is more delighted at the repentance of His servant than one of you who lost his riding animal on a journey in a barren land while it carries his food and drink. He loses all hope as he comes to a tree to lie down in its shade, despairing over his animal, but suddenly he finds it standing over him. He takes hold of its reins and then he greatly rejoices, saying, &#8216;O Allah, You are my servant and I am your Lord!&#8217; He makes a mistake due to his great joy.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2747, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/delighted-tawbah-muslims-desert\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ عَزَّ وَجَلَّ يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ اللَّيْلِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا<\/p>\n<p><strong>Verily, Allah Almighty stretches out his hand by night to accept the repentance of those who sin by day, and he stretches out his hand by day to accept the repentance of those who sin by night, until the sun rises from the west.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2759, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/tawbah-by-night-and-day\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا تَابَ اللَّهُ عَلَيْهِ<\/p>\n<p><b>Whoever repents before the sun rises from the west, Allah will forgive him.<\/b><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2703, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/repentance-sun-rises-from-west\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ اللَّهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ<\/p>\n<p><strong>Verily, Allah accepts the repentance of his servants, as long as they are not on their death bed<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3537, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/repentance-accepted-death-bed\/\"><i>Hasan<\/i><\/a><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ قَتَلَ تِسْعَةً وَتِسْعِينَ إِنْسَانًا ثُمَّ خَرَجَ يَسْأَلُ فَأَتَى رَاهِبًا فَسَأَلَهُ فَقَالَ لَهُ هَلْ مِنْ تَوْبَةٍ قَالَ لَا فَقَتَلَهُ فَجَعَلَ يَسْأَلُ فَقَالَ لَهُ رَجُلٌ ائْتِ قَرْيَةَ كَذَا وَكَذَا فَأَدْرَكَهُ الْمَوْتُ فَنَاءَ بِصَدْرِهِ نَحْوَهَا فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ الْعَذَابِ فَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَقَرَّبِي وَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَبَاعَدِي وَقَالَ قِيسُوا مَا بَيْنَهُمَا فَوُجِدَ إِلَى هَذِهِ أَقْرَبَ بِشِبْرٍ فَغُفِرَ لَهُ<\/p>\n<p><strong>There was a man among the children of Israel who had killed ninety-nine people. Then he set out seeking repentance. He came upon a monk, and he asked him if his repentance would be accepted. The monk said no, so the man killed him. He continued asking until another man advised him to visit a certain village. He set out for it, but death overtook him on the way. As he died, he turned his chest toward the village. The angel of mercy and the angel of punishment argued about him among themselves. Allah ordered his destination to move closer to him and his old village to move away. Then, Allah ordered the angels to measure the distance between his body and the two villages. He was found to be one span closer to his destination, so he was forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3470, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/man-repented-hundred-murders\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>&#8216;Imran ibn Husayn reported: A woman from the tribe of Juhayna came to the Prophet, peace and blessings be upon him, while she was pregnant from committing adultery. She said, “O Prophet of Allah, I have committed an offense deserving of legal punishment, so establish it upon me.” The Prophet called her guardian and he said:<\/p>\n<blockquote>\n<p align=\"right\">أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَأْتِنِي بِهَا<\/p>\n<p><b>Treat her kindly and bring her after she delivers the child.<\/b><\/p><\/blockquote>\n<p>The guardian did so and the Prophet ordered the sentence to be carried out. Her clothes were secured around her and she was stoned. Then, the Prophet led her funeral prayer. Umar said, “Do you pray over one who committed adultery?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ تَوْبَةً أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ تَعَالَى<\/p>\n<p><strong>She had repented with such repentance that, if it had been divided between seventy people of Medina, it would have reached beyond them. Have you found any repentance better than this, that she gave up her life for Allah Almighty?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1696, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/great-tawbah-zina\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Anas bin Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَوْ أَنَّ لاِبْنِ آدَمَ وَادِيًا مِنْ ذَهَبٍ أَحَبَّ أَنْ يَكُونَ لَهُ وَادِيَانِ وَلَنْ يَمْلأَ فَاهُ إِلاَّ التُّرَابُ وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ<\/p>\n<p><strong>If the son of Adam had a valley full of gold, he would want to have two valleys. Nothing fills his mouth but the dust of the grave, yet Allah will relent to whoever repents to him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6439, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/21\/valley-gold-still-wants-more\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">يَضْحَكُ اللَّهُ إِلَى رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الْآخَرَ يَدْخُلَانِ الْجَنَّةَ يُقَاتِلُ هَذَا فِي سَبِيلِ اللَّهِ فَيُقْتَلُ ثُمَّ يَتُوبُ اللَّهُ عَلَى الْقَاتِلِ فَيُسْتَشْهَدُ<\/p>\n<p><strong>Allah laughs at two men, one of them killed the other, yet they both entered Paradise. This one fought in the way of Allah and was killed, then his killer repented and was also martyred.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2671, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/01\/28\/allah-laughs-men-jannah\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Seek forgiveness from your Lord and repent to Him.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[300,183,262,26,319,32,316,56,196,67],"class_list":["post-15646","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-adam","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-forgiveness-al-maghfirah","tag-funerals-janazah","tag-hereafter-akhirah","tag-medina-madinah","tag-monotheism-tawheed","tag-prophetic-virtues","tag-repentance-al-tawbah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-44m","jetpack-related-posts":[{"id":20133,"url":"https:\/\/www.abuaminaelias.com\/how-to-repent-from-sin-the-right-way\/","url_meta":{"origin":15646,"position":0},"title":"How to repent from sin the right way","author":"Abu Amina Elias","date":"January 24, 2019","format":false,"excerpt":"\"O you who have faith, repent to Allah with sincere repentance.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20551,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bidah-innovations-lowly-desires\/","url_meta":{"origin":15646,"position":1},"title":"Imam al-Mundhiri on Heretical Innovations, Lowly Desires","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"\"Every innovation is misguidance, every misguidance is in Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14374,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-assembly-and-gathering\/","url_meta":{"origin":15646,"position":2},"title":"Imam al-Nawawi on Manners of Assembly and Gathering","author":"Abu Amina Elias","date":"July 23, 2013","format":false,"excerpt":"\"No people sit in a gathering without remembering Allah...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14753,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-truthfulness-honesty-sidq\/","url_meta":{"origin":15646,"position":3},"title":"Imam al-Nawawi on Truthfulness, Honesty","author":"Abu Amina Elias","date":"August 20, 2013","format":false,"excerpt":"\"Verily, truthfulness leads to righteousness.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23222,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-tawbah-following-sayyiat-hasanat\/","url_meta":{"origin":15646,"position":4},"title":"Imam al-Mundhiri on Repentance, Following Evil with Good","author":"Abu Amina Elias","date":"May 21, 2021","format":false,"excerpt":"\"If you do a bad deed, follow it with a good deed...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23053,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-istighfar\/","url_meta":{"origin":15646,"position":5},"title":"Imam al-Mundhiri on Seeking Forgiveness from Allah","author":"Abu Amina Elias","date":"April 25, 2021","format":false,"excerpt":"\"I seek forgiveness from Allah Almighty...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15646","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15646"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15646\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15646"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15646"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15646"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}