{"id":15655,"date":"2014-04-16T11:47:36","date_gmt":"2014-04-16T07:47:36","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15655"},"modified":"2025-03-08T20:32:12","modified_gmt":"2025-03-08T16:32:12","slug":"an-nawawi-on-practicing-the-sunnah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-practicing-the-sunnah\/","title":{"rendered":"Imam al-Nawawi on Practicing the Sunnah"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب في الأمر بالمحافظة عَلَى السنة وآدابها<\/p>\n<p>Chapter on the command to preserve the Sunnah and its manners.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/391<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانتَهُوا وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ<\/p>\n<p><strong>Whatever the Messenger gives you, take it. And whatever he forbids you from, leave it. And fear Allah. Surely, Allah is severe in punishment.<\/strong><\/p>\n<p>Surat al-Hashr 59:7<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَمَا يَنطِقُ عَنِ الْهَوَىٰ إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ<\/p>\n<p><strong>Nor does he speak of his own whims. It is only a revelation sent down to him.<\/strong><\/p>\n<p>Surat al-Najm 53:3-4<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَاللَّهُ غَفُورٌ رَّحِيمٌ<\/p>\n<p><strong>Say, &#8216;If you love Allah, then follow me. Allah will love you and forgive your sins. For Allah is All-Forgiving, Most Merciful.&#8217;<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:31<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا<\/p>\n<p><strong>Indeed, in the Messenger of Allah you have an excellent example for whoever has hope in Allah and the Last Day, and remembers Allah often.<\/strong><\/p>\n<p>Surat al-Ahzab 33:21<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا<\/p>\n<p><strong>But no! By your Lord, they will never be true believers until they accept you, O Prophet, as the judge in their disputes, and find no resistance within themselves against your decision and submit wholeheartedly.<\/strong><\/p>\n<p>Surat al-Nisa&#8217; 4:65<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا<\/p>\n<p><strong>O believers! Obey Allah and obey the Messenger and those in authority among you. Should you disagree on anything, then refer it to Allah and His Messenger, if you truly believe in Allah and the Last Day. This is the best and fairest resolution.<\/strong><\/p>\n<p>Surah al-Nisa&#8217; 4:59<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">مَّن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ وَمَن تَوَلَّىٰ فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا<\/p>\n<p><strong>Whoever obeys the Messenger has truly obeyed Allah. But whoever turns away, then know that We have not sent you as a keeper over them.<\/strong><\/p>\n<p>Surat al-Nisa&#8217; 4:80<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِّنْ أَمْرِنَا مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَٰكِن جَعَلْنَاهُ نُورًا نَّهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا وَإِنَّكَ لَتَهْدِي إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ<\/p>\n<p><strong>So We have sent to you a revelation by Our command. You did not know of this Book and faith before. But We have made it a light, by which We guide whoever We will of Our servants. And you are truly leading all to the Straight Path.<\/strong><\/p>\n<p>Surat al-Shura 42:52<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">لَّا تَجْعَلُوا دُعَاءَ الرَّسُولِ بَيْنَكُمْ كَدُعَاءِ بَعْضِكُم بَعْضًا قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذًا فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَن تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ<\/p>\n<p><strong>Do not treat the Messenger’s summons to you as lightly as your summons to one another. Allah certainly knows those of you who slip away, hiding behind others. So let those who disobey his orders beware, for an affliction may befall them, or a painful torment may overtake them.<\/strong><\/p>\n<p>Surat al-Nur 24:63<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p align=\"right\">وَاذْكُرْنَ مَا يُتْلَىٰ فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّهِ وَالْحِكْمَةِ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا<\/p>\n<p><strong>Remember what is recited in your homes of Allah’s revelations and prophetic wisdom. Surely, Allah is Most Subtle, All-Aware.<\/strong><\/p>\n<p>Surat al-Ahzab 33:34<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ وَمَا أَمَرْتُكُمْ بِهِ فَافْعَلُوا مِنْهُ مَا اسْتَطَعْتُمْ فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ<\/p>\n<p><b>Avoid what I have forbidden for you and do what I have commanded you as much as you are able. Verily, the people before you were destroyed only because of their excessive questioning and differing with their prophets.<\/b><\/p>\n<p>Source: Sahih Bukhari 6858, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/hadith-on-sunnah-avoid-what-is-forbidden-do-what-is-commanded-as-much-as-possible-and-do-not-ask-unbeneficial-questions\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, prayed with us one day. Then, he faced us and delivered an eloquent sermon that brought tears to our eyes and hearts were shaken by it. It was said, “O Messenger of Allah, it is as if this is a farewell address. What do you instruct for us?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ عَبْدًا حَبَشِيًّا فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ بَعْدِي فَسَيَرَى اخْتِلَافًا كَثِيرًا فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الْمَهْدِيِّينَ الرَّاشِدِينَ تَمَسَّكُوا بِهَا وَعَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ وَكُلَّ بِدْعَةٍ ضَلَالَةٌ<\/p>\n<p><strong>I advise you to fear Allah, listen, and obey, even if an Abyssinian slave is put in charge of you. Whoever lives after me will see many conflicts. You must adhere to my Sunnah and the Sunnah of the righteous, guided successors. Hold firmly to it as if biting with your molar teeth. Beware of newly invented matters in religion, for every new matter is an innovation and, every innovation is misguidance.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4607, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/05\/follow-sunnah-beware-bidah\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">كُلُّ أُمَّتِي يَدْخُلُونَ الْجَنَّةَ إِلَّا مَنْ أَبَى<\/p>\n<p><strong>Everyone from my nation will enter Paradise but those who refuse.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, who will refuse?” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ أَطَاعَنِي دَخَلَ الْجَنَّةَ وَمَنْ عَصَانِي فَقَدْ أَبَى<\/p>\n<p><strong>Whoever obeys me enters Paradise, and whoever disobeys me has refused.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7280, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/10\/28\/all-jannah-but-refuse\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Salamah ibn al-Akwa’ reported: A man was eating with his left hand in the presence of the Messenger of Allah, peace and blessings be upon him. The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">كُلْ بِيَمِينِكَ<\/p>\n<p><b>Eat with your right hand.<\/b><\/p><\/blockquote>\n<p>The man said, “I cannot do it.” The Prophet said:<\/p>\n<blockquote>\n<p align=\"right\">لَا اسْتَطَعْتَ<\/p>\n<p><b>You will not be able to do it.<\/b><\/p><\/blockquote>\n<p>Salamah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا اسْتَطَعْتَ مَا مَنَعَهُ إِلَّا الْكِبْرُ قَالَ فَمَا رَفَعَهَا إِلَى فِيهِ<\/p>\n<p>Nothing prevented the man from doing so but arrogance. He was no longer able to raise his hand to his mouth.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2021, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/20\/reject-sunnah-arrogance\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Al-Nu’man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">لَتُسَوُّنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ وُجُوهِكُمْ<\/p>\n<p><strong>Straighten the rows of prayer or else Allah will surely disfigure your faces.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 717, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/08\/hadith-on-prayer-straighten-the-rows-for-prayer-or-else-it-will-cause-discord-among-you\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p align=\"right\">مَعْنَاهُ يُوقِعُ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ وَاخْتِلَافَ الْقُلُوبِ<\/p>\n<p>The meaning is that it will put enmity and hatred between the hearts that will show on the faces.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 4\/157<\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّ مَثَلَ مَا بَعَثَنِيَ اللَّهُ بِهِ عَزَّ وَجَلَّ مِنْ الْهُدَى وَالْعِلْمِ كَمَثَلِ غَيْثٍ أَصَابَ أَرْضًا فَكَانَتْ مِنْهَا طَائِفَةٌ طَيِّبَةٌ قَبِلَتْ الْمَاءَ فَأَنْبَتَتْ الْكَلَأَ وَالْعُشْبَ الْكَثِيرَ وَكَانَ مِنْهَا أَجَادِبُ أَمْسَكَتْ الْمَاءَ فَنَفَعَ اللَّهُ بِهَا النَّاسَ فَشَرِبُوا مِنْهَا وَسَقَوْا وَرَعَوْا وَأَصَابَ طَائِفَةً مِنْهَا أُخْرَى إِنَّمَا هِيَ قِيعَانٌ لَا تُمْسِكُ مَاءً وَلَا تُنْبِتُ كَلَأً فَذَلِكَ مَثَلُ مَنْ فَقُهَ فِي دِينِ اللَّهِ وَنَفَعَهُ بِمَا بَعَثَنِيَ اللَّهُ بِهِ فَعَلِمَ وَعَلَّمَ وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ<\/p>\n<p><strong>Verily, the parable of the guidance and knowledge that Allah Almighty sent with me is the likeness of rain falling upon the earth. Among them is a good group which receives the water and thus there is abundant growth of herbage and grass. Among them is a barren land which retains the water and thus Allah benefits people from it; they drink from it and graze their animals. And it falls upon another group which is only abysmal; it does not retain water, nor does herbage grow. Such is the parable of one who understands the religion of Allah and benefits from what Allah sent with me; he learns and he teaches. Such is the parable of one who does not raise his head and does not accept the guidance Allah sent with me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 79, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/07\/parable-prophet-hidayah\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنَّمَا مَثَلِي وَمَثَلُ النَّاسِ كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ جَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ الَّتِي تَقَعُ فِي النَّارِ يَقَعْنَ فِيهَا فَجَعَلَ يَنْزِعُهُنَّ وَيَغْلِبْنَهُ فَيَقْتَحِمْنَ فِيهَا فَأَنَا آخُذُ بِحُجَزِكُمْ عَنْ النَّارِ وَهُمْ يَقْتَحِمُونَ فِيهَا<\/p>\n<p><strong>Verily, the parable of myself and the people is that of a man who kindled a fire. When it lighted all that was around it, moths and insects started falling into the fire. The man tried to pull them out, but they overcame him and rushed into it. Thus, I take hold of your belts to keep you from falling in, yet you rush into it anyway.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6483, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/25\/parable-fire-moths-insects\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوَّلُ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ وَإِنَّ أُنَاسًا مِنْ أَصْحَابِي يُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ أَصْحَابِي أَصْحَابِي فَيَقُولُ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي إِلَى قَوْلِهِ الْعَزِيزُ الْحَكِيمُ<\/p>\n<p><strong>The first to be clothed on the Day of Resurrection will be Abraham. Some people among my companions will be taken towards the left side and I will say, ‘My companions! My companions!’ It will be said, ‘They were renegades, turning back on their heels since you left them.’ Then I will say as the righteous servant said, ‘I was a witness over them as long as I remained among them. But when You took me, You were the Witness over them, and You are a Witness over all things. If You punish them, they belong to You after all. But if You forgive them, You are surely the Almighty, All-Wise.’ <\/strong>(5:117-118)<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3349, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/06\/first-clothed-ibrahim\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, would lick what he ate with his three fingers during a meal, saying:<\/p>\n<blockquote>\n<p align=\"right\">إِذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الْأَذَى وَلْيَأْكُلْهَا وَلَا يَدَعْهَا لِلشَّيْطَانِ<\/p>\n<p><strong>When one of you drops a mouthful, he should remove any filth from it and then eat it. He should not leave it for the devil.<\/strong><\/p><\/blockquote>\n<p>The Prophet commanded us to wipe clean our dishes, saying:<\/p>\n<blockquote>\n<p align=\"right\">فَإِنَّكُمْ لَا تَدْرُونَ فِي أَيِّ طَعَامِكُمْ الْبَرَكَةُ<\/p>\n<p><strong>Verily, you do not know in which portion of your food is the blessing.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2034, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/31\/food-lick-fingers-clean-dish\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Abis ibn Rabia reported: Umar ibn Al-Khattab came to the black stone and he kissed it. Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p align=\"right\">إِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ لَا تَضُرُّ وَلَا تَنْفَعُ وَلَوْلَا أَنِّي رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ مَا قَبَّلْتُكَ<\/p>\n<p>Verily, I know you are only a stone with no power to harm or benefit me. Were it not that I saw the Prophet, peace and blessings be upon him, kiss you, I would not have kissed you.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1597, Grade: <b><i><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/02\/12\/touch-al-hajar-al-aswad\/\">Muttafaqun Alayhi<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, would praise Allah in his sermon, as He deserves to be praised, and then he would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْهُ فَلَا هَادِيَ لَهُ إِنَّ أَصْدَقَ الْحَدِيثِ كِتَابُ اللَّهِ وَأَحْسَنَ الْهَدْيِ هَدْيُ مُحَمَّدٍ وَشَرُّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلُّ مُحْدَثَةٍ بِدْعَةٌ وَكُلُّ بِدْعَةٍ ضَلَالَةٌ وَكُلُّ ضَلَالَةٍ فِي النَّارِ<\/p>\n<p><strong>Whomever Allah guides, no one can lead him astray. Whomever Allah sends astray, no one can guide him. The truest word is the Book of Allah, and the best guidance is the guidance of Muhammad. The evilest matters in religion are those that are newly invented, for every newly invented matter is an innovation, every innovation is misguidance, and every misguidance is in the Hellfire.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 1578, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/02\/16\/every-bidah-is-misguidance-fire\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p><i>Success comes from Allah, and Allah knows best.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;He does not speak from his desires. It is not but a revelation revealed.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[167,14,18,20,183,288,26,27,184,30,135,32,104,90,138,50,51,52,54,94,134,60,73],"class_list":["post-15655","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-abraham-ibrahim","tag-arrogance-al-takabbur","tag-community-jamaah","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-desires-shahawat","tag-forgiveness-al-maghfirah","tag-god-fearing-taqwa","tag-guidance-al-hidaya","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humility-al-tawaduh","tag-innovation-bidah","tag-jesus-isa","tag-knowledge","tag-leadership-imamate","tag-love-al-mahabbah","tag-mercy-al-rahmah","tag-obedience-al-taah","tag-paradise-jannah","tag-prayer-salat","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-44v","jetpack-related-posts":[{"id":15285,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-bidah\/","url_meta":{"origin":15655,"position":0},"title":"Imam al-Nawawi on Innovation in Religion","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Whoever innovates something into this affair of ours...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20313,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-the-witr-prayer\/","url_meta":{"origin":15655,"position":1},"title":"Imam al-Nawawi on Witr Prayer","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Perform Witr prayer before the morning.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20283,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-voluntary-sunan-fasting\/","url_meta":{"origin":15655,"position":2},"title":"Imam al-Nawawi on Voluntary Sunan Fasting","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Best fast after Ramadan is the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13432,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-freeing-slaves\/","url_meta":{"origin":15655,"position":3},"title":"Imam al-Nawawi on Freeing Slaves","author":"Abu Amina Elias","date":"May 8, 2013","format":false,"excerpt":"\"Feed the hungry, visit the sick, and set the captives free.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14188,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-excellence-of-hastening-to-break-fasting\/","url_meta":{"origin":15655,"position":4},"title":"Imam al-Nawawi on Hastening to Break Fast","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"People will continue to be upon goodness as long as they hasten to break their fast.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14753,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-truthfulness-honesty-sidq\/","url_meta":{"origin":15655,"position":5},"title":"Imam al-Nawawi on Truthfulness, Honesty","author":"Abu Amina Elias","date":"August 20, 2013","format":false,"excerpt":"\"Verily, truthfulness leads to righteousness.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15655","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15655"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15655\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15655"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}