{"id":15686,"date":"2014-05-07T14:38:45","date_gmt":"2014-05-07T10:38:45","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15686"},"modified":"2025-03-08T12:06:20","modified_gmt":"2025-03-08T08:06:20","slug":"an-nawawi-on-kindness-to-the-poor-and-weak","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-kindness-to-the-poor-and-weak\/","title":{"rendered":"Imam al-Nawawi on Kindness to the Poor and Weak"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Nawawi records in his book Meadows of the Righteous:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب ملاطفة اليتيم والبنات وسائر الضعفة والمساكين والمنكسرين والإحسان إليهم والشفقة عليهم والتواضع معهم وخفض الجناح لهم<\/p>\n<p>Chapter on being kind to orphans, girls, and all the weak, the poor, and the brokenhearted, and being kind to them, having compassion for them, being humble with them, and lowering one’s wing to them<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/376<\/p><\/blockquote>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ<\/p>\n<p><strong>And lower your wing for the believers.<\/strong><\/p>\n<p>Surat al-Hijr 15:88<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَن ذِكْرِنَا وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا<\/p>\n<p><strong>Patiently stick with those who call upon their Lord morning and evening, seeking His pleasure. Do not let your eyes look beyond them, desiring the luxuries of this worldly life. And do not obey those whose hearts We have made heedless of Our remembrance, who follow only their desires and whose state is total loss.<\/strong><\/p>\n<p>Surat al-Kahf 18:28<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ<\/p>\n<p><strong>So do not oppress the orphan, nor repulse the beggar.<\/strong><\/p>\n<p>Surat al-Duha&#8217; 93:9-10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ<\/p>\n<p><strong>Have you seen the one who denies the final Judgment? That is the one who repulses the orphan, and does not encourage the feeding of the poor.<\/strong><\/p>\n<p>Surat al-Ma’un 107:1-3<\/p><\/blockquote>\n<p>Sa’d reported: We were with the Prophet, peace and blessings be upon him, when the idolaters said to the Prophet, “Drive these people away, lest they turn against us.” The Prophet thought within himself whatever Allah willed him to think, then Allah Almighty revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ ۖ<\/p>\n<p><strong>Do not dismiss those poor believers who invoke their Lord morning and evening, seeking His pleasure. You are not accountable for them whatsoever, nor are they accountable for you. So do not dismiss them, or you will be one of the wrongdoers.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2413, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/07\/do-not-turn-away-sincere\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Sahl ibn Sa’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ هَكَذَا وَقَالَ بِإِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى<\/p>\n<p><strong>The one who cares for an orphan and myself will be together in Paradise like these two fingers of mine.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6005, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/prophet-caretaker-paradise-together\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ عَالَ جَارِيَتَيْنِ حَتَّى تَبْلُغَا جَاءَ يَوْمَ الْقِيَامَةِ أَنَا وَهُوَ وَضَمَّ أَصَابِعَهُ<\/p>\n<p><strong>Whoever cares for two girls until they reach maturity, then him and I will come together on the Day of Resurrection like these two fingers of mine<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2631, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/10\/26\/caring-for-daughters-young-girls\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْمِسْكِينُ بِالَّذِي تَرُدُّهُ التَّمْرَةُ وَالتَّمْرَتَانِ وَلَا اللُّقْمَةُ وَاللُّقْمَتَانِ إِنَّمَا الْمِسْكِينُ الْمُتَعَفِّفُ اقْرَءُوا إِنْ شِئْتُمْ لَا يَسْأَلُونَ النَّاسَ إِلْحَافًا<\/p>\n<p><strong>The poor person is not the one who is satisfied with a date or two, or a morsel or two, but rather the poor person is only one who abstains from begging. Recite the verse if you wish, &#8216;They do not beg people persistently.&#8217;<\/strong> (2:273)<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4539, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/05\/truly-poor-do-not-beg\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْمِسْكِينُ بِهَذَا الطَّوَّافِ الَّذِي يَطُوفُ عَلَى النَّاسِ فَتَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ<\/p>\n<p><strong>The truly poor man is not the one who goes around people and is dismissed by a morsel, two morsels, or one or two dates.<\/strong><\/p><\/blockquote>\n<p>They said, “Then who is the poor man, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الَّذِي لَا يَجِدُ غِنًى يُغْنِيهِ وَلَا يُفْطَنُ لَهُ فَيُتَصَدَّقَ عَلَيْهِ وَلَا يَسْأَلُ النَّاسَ شَيْئًا<\/p>\n<p><strong>The one who does not find enough to satisfy himself, nor is he considered such that charity would be given to him, nor does he beg people for anything.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1039, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/08\/poor-rely-upon-allah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ أَوْ الْقَائِمِ اللَّيْلَ الصَّائِمِ النَّهَارَ<\/p>\n<p><strong>One who lends effort to the widows and the poor is like one waging jihad in the way of Allah, or one who regularly prays at night and fasts during the day.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5353, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/22\/helping-poor-jihad-fi-sabil-allah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُمْنَعُهَا مَنْ يَأْتِيهَا وَيُدْعَى إِلَيْهَا مَنْ يَأْبَاهَا وَمَنْ لَمْ يُجِبْ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ<\/p>\n<p><strong>The most evil food is the food of a wedding banquet, in which those who want to come are left out and those who are invited refuse. Whoever does not answer an invitation has disobeyed Allah and His Messenger.<\/strong><\/p><\/blockquote>\n<p>And Abu Huraira said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بِئْسَ الطَّعَامُ طَعَامُ الْوَلِيمَةِ يُدْعَى إِلَيْهِ الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ<\/p>\n<p>The worst food is the food of a wedding banquet in which the rich are invited but the poor are left out.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1432, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/07\/worst-feasts-refuse-poor\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Aisha reported: A woman came to me along with her two daughters asking for charity, but she found nothing with me except one date. I gave it to her and she divided it between her two daughters. She did not eat anything herself, then she got up and left. The Prophet, peace and blessings be upon him, came in and I told him what happened. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ابْتُلِيَ مِنْ الْبَنَاتِ بِشَيْءٍ فَأَحْسَنَ إِلَيْهِنَّ كُنَّ لَهُ سِتْرًا مِنْ النَّارِ<\/p>\n<p><strong>Whoever is tested with daughters in any way and treats them well, they will be their shield from Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5649, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/30\/treating-daughters-well\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَدْ أَوْجَبَ لَهَا بِهَا الْجَنَّةَ أَوْ أَعْتَقَهَا بِهَا مِنْ النَّارِ<\/p>\n<p><strong>Verily, Allah as assured her place in Paradise, or He has freed her from the Hellfire, by her daughter.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2630, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنِّي أُحَرِّجُ حَقَّ الضَّعِيفَيْنِ الْيَتِيمِ وَالْمَرْأَةِ<\/p>\n<p><strong>O Allah, I have issued a warning regarding the rights of two vulnerable groups: orphans and women.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3678, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/10\/huquq-women-children-yatim\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Mus’ab ibn Sa’d reported: Sa’d viewed himself as better than those below him. The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ تُنْصَرُونَ وَتُرْزَقُونَ إِلَّا بِضُعَفَائِكُمْ<\/p>\n<p><strong>Are you not given support and provision due to your vulnerable ones?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2896, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/07\/allah-provides-sadaqah-miskin\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ابْغُونِي ضُعَفَاءَكُمْ فَإِنَّمَا تُرْزَقُونَ وَتُنْصَرُونَ بِضُعَفَائِكُمْ<\/p>\n<p><strong>Seek out your vulnerable on my behalf. Verily, you are only given provision and support from Allah due to the weak among you.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1702, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/07\/only-supported-help-weak\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;And lower your wing for the believers.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[17,282,18,183,22,85,135,32,104,47,56,94,134,58,60,254,128],"class_list":["post-15686","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-charity-al-sadaqah","tag-children","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-excellence-ihsaan","tag-fasting-al-siyam","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humility-al-tawaduh","tag-jihad","tag-monotheism-tawheed","tag-obedience-al-taah","tag-paradise-jannah","tag-patience-al-sabr","tag-prayer-salat","tag-provision-al-rizq","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-450","jetpack-related-posts":[{"id":13423,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-kindness-to-servants\/","url_meta":{"origin":15686,"position":0},"title":"Imam al-Nawawi on Kindness to Servants and Slaves","author":"Abu Amina Elias","date":"May 7, 2013","format":false,"excerpt":"\"Be good to... those bondspeople in your possession.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15295,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-kindness-to-neighbors\/","url_meta":{"origin":15686,"position":1},"title":"Imam al-Nawawi on Kindness to Neighbors","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Be good to... the near neighbor and the distant neighbor.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14049,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-seculsion-in-the-mosque-during-ramadan-itikaf\/","url_meta":{"origin":15686,"position":2},"title":"Imam al-Nawawi on Spiritual Retreat in Ramadan, al-I’tikaf","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Prophet seeks seclusion in the last ten nights.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20316,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-forenoon-prayer-salat-duha\/","url_meta":{"origin":15686,"position":3},"title":"Imam al-Nawawi on Forenoon Prayer, Salat al-Duha","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"It is enough to perform two cycles of forenoon prayer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13432,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-freeing-slaves\/","url_meta":{"origin":15686,"position":4},"title":"Imam al-Nawawi on Freeing Slaves","author":"Abu Amina Elias","date":"May 8, 2013","format":false,"excerpt":"\"Feed the hungry, visit the sick, and set the captives free.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13331,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-modesty-shyness-and-good-conscience\/","url_meta":{"origin":15686,"position":5},"title":"Imam al-Nawawi on Modesty, Good Conscience","author":"Abu Amina Elias","date":"April 30, 2013","format":false,"excerpt":"\"The Prophet was more modest than a virgin in seclusion.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15686","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15686"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15686\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15686"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15686"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15686"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}