{"id":15719,"date":"2016-07-04T10:48:29","date_gmt":"2016-07-04T06:48:29","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15719"},"modified":"2025-07-04T11:03:44","modified_gmt":"2025-07-04T07:03:44","slug":"the-oneness-of-lordship-tawheed-ar-rububiyyah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/the-oneness-of-lordship-tawheed-ar-rububiyyah\/","title":{"rendered":"Oneness of Lordship (tawheed ar-rububiyyah)"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The oneness of Allah’s Lordship is the belief that Allah alone has created the universe, that He alone is its Provider and Sustainer, and that He has complete ownership and power over His creation. In other words, Allah is one and unique in regard to His actions, such that no creature shares His power in creating and managing the universe.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ يُغْشِي اللَّيْلَ النَّهَارَ يَطْلُبُهُ حَثِيثًا وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ ۗ أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ ۗ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ<\/p>\n<p><strong>Verily, your Lord is Allah who created the heavens and earth in six days and then established Himself above the Throne. He covers the night with the day, chasing it rapidly, and the sun, the moon, and the stars are subjected to His command. Unquestionably, for Him is the creation and the command. Blessed is Allah, the Lord of the worlds.<\/strong><\/p>\n<p>Surah Al-A’raf 7:45<\/p><\/blockquote>\n<p>The oneness of Lordship includes the belief in divine providence (<em>qadr<\/em>), that all things happen by the decree of Allah. Allah alone has complete and uncontested power in the universe and everything occurs according to His will and wisdom.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ<\/p>\n<p><strong>Verily, Allah has power over all things.<\/strong><\/p>\n<p>Surah Al-Baqarah 2:20<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ<\/p>\n<p><strong>Verily, We have created all things by measure.<\/strong><\/p>\n<p>Surah Al-Qamar 54:49<\/p><\/blockquote>\n<p>The universe must necessarily have a Creator because it is impossible for the universe to have created itself or to have been created by nothing. Therefore, there must have been a Creator who provided the initial force and energy needed to set the universe in motion. This is sometimes called the <em>cosmological argument<\/em>, or argument from existence.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ أَمْ خَلَقُوا السَّمَاوَاتِ وَالْأَرْضَ ۚ بَل لَّا يُوقِنُونَ<\/p>\n<p><strong>Were they created by nothing, or were they the creators of themselves? Or did they create the heavens and the earth? Rather, they are not certain.<\/strong><\/p>\n<p>Surah At-Tur 52:35-36<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوَلَا يَذْكُرُ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن قَبْلُ وَلَمْ يَكُ شَيْئًا<\/p>\n<p><strong>Does man not remember that We created him before while he was nothing?<\/strong><\/p>\n<p>Surah Maryam 19:67<\/p><\/blockquote>\n<p>Imam Abu Hanifa used the motion of the universe to establish the existence of the Creator in his debate with the atheists.<\/p>\n<p>Ibn Abu Al-‘Izz reported: It is said that Abu Hanifa, may Allah have mercy on him, was approached by some speculative theologians who intended to discuss with him the oneness of Allah’s Lordship. He said, “Before we discuss this question, tell me what you think about a boat in the Euphrates which goes to shore, loads itself with food and other things, then returns, anchors and unloads all by itself, without anyone sailing or controlling it?” They said, “This is impossible.” Abu Hanifa said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا كَانَ هَذَا مُحَالًا فِي سَفِينَةٍ فَكَيْفَ فِي هَذَا الْعَالَمِ كُلِّهِ عُلْوِهِ وَسُفْلِهِ<\/p>\n<p>If it is impossible with a boat, then how is it possible for the world, in all its vastness, to move by itself?<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/04\/abu-hanifa-on-monotheism-the-story-of-abu-hanifas-rebuttal-against-the-atheists-doubts-about-allah\/\">Sharh Aqidah At-Tahawi 35<\/a><\/p><\/blockquote>\n<p>This argument agrees with sound reasoning and has been accepted by philosophers and theologians across different religions through history. The argument is so strong that Jubair bin Mut’im said that after he had recited the verses of Surah At-Tur (52:35-36):<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَادَ قَلْبِي أَنْ يَطِيرَ<\/p>\n<p>I felt my heart was about to fly.<\/p>\n<p>Source: Sahih Bukhari 4573, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/04\/hadith-on-creation-were-they-created-by-nothing-or-where-they-themselves-the-creator\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Further evidence of the Creator exists in the patterns and designs found in nature which imply the necessity of a Designer. Allah calls our attention to observe the various signs (<em>ayat<\/em>) in nature that demonstrate His power. This is sometimes called the <em>teleological argument<\/em>, or argument from design.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ<\/p>\n<p><strong>Verily, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding, who remember Allah while standing or sitting or lying on their sides and give thought to the creation of the heavens and the earth, saying: Our Lord, You did not create this without purpose, exalted are You above such a thing, then protect us from the punishment of the Hellfire.<\/strong><\/p>\n<p>Surah Ali Imran 3:190-191<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ<\/p>\n<p><strong>We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. But is it not sufficient concerning your Lord that He is, over all things, a witness?<\/strong><\/p>\n<p>Surah Fussilat 41:53<\/p><\/blockquote>\n<p>A classical formulation of this argument is mentioned by Ibn Kathir. Once a bedouin was asked about the evidence of Allah’s existence, so he responded:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا سُبْحَانَ اللَّهِ إِنَّ الْبَعْرَةَ لَتَدُلُّ عَلَى الْبَعِيرِ وَإِنَّ أَثَرَ الْأَقْدَامِ لَتَدُلُّ عَلَى الْمَسِيرِ فَسَمَاءٌ ذَاتُ أَبْرَاجٍ وَأَرْضٌ ذَاتُ فِجَاجٍ وَبِحَارٌ ذَاتُ أَمْوَاجٍ أَلَا يَدُلُّ ذَلِكَ عَلَى وُجُودِ اللَّطِيفِ الْخَبِيرِ<\/p>\n<p>Glory be to Allah! The camel’s dung testifies to the existence of the camel, and the track testifies to the fact that someone was walking. A sky that holds the stars, a land that has fairways and a sea that has waves? Does not all of this testify to the existence of the Most Kind, Most Knowing?<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/22\/ibn-kathir-on-lordship-the-creation-is-the-evidence-for-the-almighty-creator\/\">Tafseer Ibn Kathir 2:21<\/a><\/p><\/blockquote>\n<p>Ibn Kathir further comments:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَذَلِكَ هَذِهِ الْأَنْهَارُ السَّارِحَةُ مِنْ قُطْرٍ إِلَى قُطْرٍ لِمَنَافِعِ الْعِبَادِ وَمَا ذَرَأَ فِي الْأَرْضِ مِنَ الْحَيَوَانَاتِ الْمُتَنَوِّعَةِ وَالنَّبَاتِ الْمُخْتَلِفِ الطُّعُومِ وَالْأَرَايِيحِ وَالْأَشْكَالِ وَالْأَلْوَانِ مَعَ اتِّحَادِ طَبِيعَةِ التُّرْبَةِ وَالْمَاءِ عَلِمَ وُجُودَ الصَّانِعِ وَقُدْرَتَهُ الْعَظِيمَةَ وَحِكْمَتَهُ وَرَحْمَتَهُ بِخَلْقِهِ وَلُطْفَهُ بِهِمْ وَإِحْسَانَهُ إِلَيْهِمْ وَبِرَّهُ بِهِمْ لَا إِلَهَ غَيْرُهُ وَلَا رَبَّ سِوَاهُ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ وَالْآيَاتُ فِي الْقُرْآنِ الدَّالَّةُ عَلَى هَذَا الْمَقَامِ كَثِيرَةٌ جِدًّا<\/p>\n<p>Whoever thinks about the running rivers that travel from area to area bringing benefit, whoever ponders over what Allah has created on earth; various animals and plants of different tastes, scents, shapes and colors that are a result of unity between land and water. Whoever thinks about all of this then he will realize that these facts testify to the existence of the Creator, His perfect ability, wisdom, mercy, kindness, generosity and His overall compassion for His creation. There is no deity worthy of worship except Allah, nor is there a Lord besides Him, upon Him we rely and to Him we turn in repentance. There are numerous verses in the Quran on this subject.<\/p><\/blockquote>\n<p>Imam Ash-Shafi&#8217;ee drew attention to the food of animals to establish the existence of the Creator.<\/p>\n<p>Ash-Shafi’ee said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا وَرَقُ التُّوتِ طَعْمُهُ وَاحِدٌ تَأْكُلُهُ الدُّودُ فَيَخْرُجُ مِنْهُ الْإِبْرَيْسِمُ وَتَأْكُلُهُ النَّحْلُ فَيَخْرُجُ مِنْهُ الْعَسَلُ وَتَأْكُلُهُ الشَّاةُ وَالْبَعِيرُ وَالْأَنْعَامُ فَتُلْقِيهِ بَعْرًا وَرَوَثًا وَتَأْكُلْهُ الظِّبَاءُ فَيَخْرُجُ مِنْهَا الْمِسْكُ وَهُوَ شَيْءٌ وَاحِدٌ<\/p>\n<p>The leaves of a berry bush all have one taste. Worms eat it and produce silk, bees eat it and produce honey. Goats, camels, and cows eat it and deliver offspring. Deer eat it and produce musk. Yet, all of these come from one thing.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/09\/ash-shafiee-on-creation-many-different-phenomena-are-produced-by-a-single-creator\/\">Tafseer Ibn Kathir 2:21<\/a><\/p><\/blockquote>\n<p>Imam Malik was asked by Caliph Harun Rasheed about evidence for the Creator and he drew attention to our various languages, sounds, and melodies in nature.<\/p>\n<p>Malik said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><span style=\"color: #000000;\"> فَاسْتَدَلَّ بِاخْتِلَافِ اللُّغَاتِ وَالْأَصْوَاتِ وَالنَّغَمَاتِ<\/span><\/p>\n<p>You will find evidence in the different languages, different voices, and different melodies.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/09\/malik-on-creation-find-evidence-for-allah-in-different-languages-and-voices\/\">Tafseer Ibn Kathir 2:21<\/a><\/p><\/blockquote>\n<p>Imam Ahmad ibn Hanbal drew attention to the wonders of life emerging from an egg to establish the existence of the Creator.<\/p>\n<p>Ahmad said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَاهُنَا حِصْنٌ حَصِينٌ أَمْلَسُ لَيْسَ لَهُ بَابٌ وَلَا مَنْفَذٌ ظَاهِرُهُ كَالْفِضَّةِ الْبَيْضَاءِ وَبَاطِنُهُ كَالذَّهَبِ الْإِبْرِيزِ فَبَيْنَا هُوَ كَذَلِكَ إِذِ انْصَدَعَ جِدَارُهُ فَخَرَجَ مِنْهُ حَيَوَانٌ سَمِيعٌ بَصِيرٌ ذُو شَكْلٍ حَسَنٍ وَصَوْتٍ مَلِيحٍ<\/p>\n<p>Consider an impenetrable fortress without any doors or exits. The outside is like white silver and the inside is like shimmering gold. It is built like this until its walls crack and out comes an animal hearing and seeing with a beautiful shape and a pleasant voice.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/09\/ahmad-on-creation-consider-the-beautiful-animals-that-emerge-from-an-egg\/\">Tafseer Ibn Kathir 2:21<\/a><\/p><\/blockquote>\n<p>Ibn Al-Qayyim likewise used the argument by design in his debates with the atheists.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فسل المعطل الجاحد ما تقول في دولاب دائر على نهر قد احكمت آلاته وأحكم تركيبه وقدرت ادواته احسن تقدير وأبلغه بحيث لا يرى الناظر فيه خللا في مادته ولا في صورته وقد جعل على حديقة عظيمة فيها من كل انواع الثمار والزروع يسقيها حاجتها وفي تلك الحديقة من يلم شعثها ويحسن مراعاتها وتعهدها والقيام بجميع مصالحها فلا يختل منها شيء ولا يتلف ثمارها ثم يقسم قيمتها عند الجذاذ على سائر المخارج بحسب حاجاتهم وضروراتهم فيقسم لكل صنف منهم ما يليق به ويقسمه هكذا على الدوام اترى هذا اتفاقا بلا صانع ولا مختار ولا مدبر بل اتفق وجود ذلك الدولاب والحديقة وكل ذلك اتفاقا من غير فاعل ولا قيم ولا مدبر أفترى ما يقول لك عقلك في ذلك لو كان وما الذي يفتيك به وما الذي يرشدك اليه<\/p>\n<p>So ask the atheists, the deniers: What do you say about a watermill spinning over a river with perfect parts? It is delicately made in a way that an observer can see no breach in the construction, it efficiently irrigates a splendid orchard that contains all kinds of plants and fruits, the orchard being well cared for, pruned, weeded, and well served in every way so that nothing is left missing or ignored, no fruit is left to rot. Then its produce is estimated by the harvester and the money gained is distributed to various groups according to their needs, each getting what is right for them, and all of this happens each time. Would you say that all of this would happen by accident without an actor who has will and resolution? Would you say that the wheel and the orchard are there by coincidence and everything goes on there without an actor who has will and resolution? What would your mind say to that? How would it solve the riddle? What would that lead you to?<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-al-qayyim-and-the-example-of-a-watermill\/\">Miftah Dar As-Sa’adah 1\/214<\/a><\/p><\/blockquote>\n<p>Moreover, the vast majority of human beings throughout history and across religious traditions have affirmed the existence of the Almighty Creator. It is simply part of our nature to recognize these signs because Allah has created us this way.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ<\/p>\n<p><strong>Direct your face toward the religion, inclining to truth. Adhere to the nature of Allah upon which He has created all people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.<\/strong><\/p>\n<p>Surah Ar-Rum 30:30<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ<\/p>\n<p><strong>No one is born except they are upon natural instinct.<\/strong><\/p>\n<p>Source: Sahih Muslim 2658, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/03\/hadith-on-fitrah-every-child-is-born-upon-al-fitrah-monotheistic-instinct\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ<\/p>\n<p><strong>If you asked them: Who created the heavens and earth? They would surely say: Allah. Say: All praise is due to Allah, but most of them do not know.<\/strong><\/p>\n<p>Surah Luqman 31:25<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ<\/p>\n<p><strong>If you asked them who created them, they would surely say: Allah. So how are they deluded?<\/strong><\/p>\n<p>Surah Az-Zukhruf 43:87<\/p><\/blockquote>\n<p>For this reason, every human being will call out to Allah during times of calamity, as it is an innate instinct to turn to the Creator in times of distress.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْ مَن يُنَجِّيكُم مِّن ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ تَدْعُونَهُ تَضَرُّعًا وَخُفْيَةً لَّئِنْ أَنجَانَا مِنْ هَٰذِهِ لَنَكُونَنَّ مِنَ الشَّاكِرِينَ قُلِ اللَّهُ يُنَجِّيكُم مِّنْهَا وَمِن كُلِّ كَرْبٍ ثُمَّ أَنتُمْ تُشْرِكُونَ<\/p>\n<p><strong>Say: Who rescues you from the darkness of the land and sea when you call upon Him imploring aloud and privately: If He should save us from this crisis, we will surely be among the thankful. Say: It is Allah who saves you from it and from every distress, yet you still associate others with Him.<\/strong><\/p>\n<p>Surah Al-An’am 6:63-64<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَن تَدْعُونَ إِلَّا إِيَّاهُ ۖ فَلَمَّا نَجَّاكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ ۚ وَكَانَ الْإِنسَانُ كَفُورًا<\/p>\n<p><strong>When adversity touches you at sea, lost are all those you invoke except for Him. But when He delivers you to the land, you turn away from Him. Ever is man ungrateful.<\/strong><\/p>\n<p>Surah Al-Isra 17:67<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ<\/p>\n<p><strong>When they board a ship, they supplicate Allah, being sincere to Him in religion. But when He delivers them to the land, at once they associate others with Him.<\/strong><\/p>\n<p>Surah Al-Ankabut 29:65<\/p><\/blockquote>\n<p>Human nature also establishes the existence of the Creator by recognizing objective moral values shared across religions and cultures throughout time, known to philosophers as the “natural law” of the Creator. This is sometimes called the moral argument.<\/p>\n<p>Wabisa ibn Ma’bad Al-Asadi reported: The Messenger of Allah, peace and blessings be upon him, said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِئْتَ تَسْأَلُ عَنْ الْبِرِّ وَالْإِثْمِ<\/p>\n<p><strong>Have you come to ask about righteousness and sin?<\/strong><\/p><\/blockquote>\n<p>I said, “Yes.” So the Prophet brought his fingers together and struck his chest three times, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ يَا وَابِصَةُ ثَلَاثًا الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ<\/p>\n<p><strong>Consult your soul, consult your heart, O Wabisa. Righteousness is what is satisfying to your soul and your heart, and sin is what wavers in your soul and causes hesitancy in your chest, even if the people give you a judgment, and again give you a judgment<\/strong>.<\/p>\n<p>Source: Sunan Ad-Darimi 2533, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/25\/hadith-on-righteousness-consult-your-heart-about-righteousness-and-sin-even-if-the-people-give-you-a-judgment\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>It might asked why some people disbelieve in the Creator if sound human nature inclines toward faith. The answer is that Allah has created life as a test involving various influences such as the temptations of Satan and selfish desires. Although human nature inclines toward faith, a person must ultimately choose to pursue faith in the Creator over the influences of unbelief.<\/p>\n<p>Iyad ibn Himar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنِّي خَلَقْتُ عِبَادِي حُنَفَاءَ كُلَّهُمْ وَإِنَّهُمْ أَتَتْهُمْ الشَّيَاطِينُ فَاجْتَالَتْهُمْ عَنْ دِينِهِمْ وَحَرَّمَتْ عَلَيْهِمْ مَا أَحْلَلْتُ لَهُمْ وَأَمَرَتْهُمْ أَنْ لَا يُشْرِكُوا بِي مَا لَمْ أُنْزِلْ بِهِ سُلْطَانًا<\/p>\n<p><strong>Allah said: I have created all of My servants naturally inclined to worship one God but it is the devils who turn them away from their religion. They make unlawful for them what has been made lawful for them, and they command them to associate partners with Me, although no authority has been revealed for them.<\/strong><\/p>\n<p>Source: Sahih Muslim 2865, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/31\/hadith-on-monotheism-human-beings-were-made-to-worship-allah-but-satan-leads-people-astray\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In conclusion, the oneness of Lordship is one of the three essential principles of Islamic monotheism, the belief that Allah alone has created the universe, that He alone is its Provider and Sustainer, and that He has complete ownership and power over His creation. His power, existence, and unity is established by contemplating upon the universe and the signs of its design within nature.<\/p>\n<p><em>Success comes from Allah, and Allah knows best. <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, your Lord is Allah&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[61,20,21,32,38,39,41,43,55,56,92,45,98],"class_list":["post-15719","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-call-to-islam-dawah","tag-creation-al-khalq","tag-creed-aqidah","tag-hereafter-akhirah","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-providence-al-qada-wal-qadr","tag-quran-exegesis-tafsir","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-45x","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":15719,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":15719,"position":1},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":15719,"position":2},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20861,"url":"https:\/\/www.abuaminaelias.com\/does-allah-exist-in-a-place\/","url_meta":{"origin":15719,"position":3},"title":"Does Allah exist in a place? A man in the sky?","author":"Abu Amina Elias","date":"August 29, 2019","format":false,"excerpt":"\"There is nothing like Him, for He is the Hearing, the Seeing.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23635,"url":"https:\/\/www.abuaminaelias.com\/tawhid-worship-allah-alone\/","url_meta":{"origin":15719,"position":4},"title":"Necessity of worshiping Allah alone","author":"Abu Amina Elias","date":"October 23, 2021","format":false,"excerpt":"If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘Allah.’","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14049,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-seculsion-in-the-mosque-during-ramadan-itikaf\/","url_meta":{"origin":15719,"position":5},"title":"Imam al-Nawawi on Spiritual Retreat in Ramadan, al-I’tikaf","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Prophet seeks seclusion in the last ten nights.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15719","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15719"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15719\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15719"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15719"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15719"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}