{"id":15748,"date":"2014-06-09T12:55:33","date_gmt":"2014-06-09T08:55:33","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15748"},"modified":"2018-03-21T12:23:08","modified_gmt":"2018-03-21T08:23:08","slug":"allah-multiplies-the-reward-for-good-deeds","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/allah-multiplies-the-reward-for-good-deeds\/","title":{"rendered":"Allah multiplies the reward for good deeds"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Allah the Generous, in His infinite mercy, will multiply the good deeds of His righteous servants up to seven hundred times as much or even more.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَن يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ<\/p>\n<p><strong>The example of those who spend their wealth in the way of Allah is like a seed which grows seven spikes, in each spike is a hundred grains. Allah multiplies His reward for whom He wills, for Allah is vast and knowing.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:261<\/p><\/blockquote>\n<p>Like a single seed from which springs forth hundreds of grains, Allah will cause the good deeds of His righteous servants to grow and multiply in a similar manner.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَصَدَّقَ أَحَدٌ بِصَدَقَةٍ مِنْ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا الطَّيِّبَ إِلَّا أَخَذَهَا الرَّحْمَنُ بِيَمِينِهِ وَإِنْ كَانَتْ تَمْرَةً فَتَرْبُو فِي كَفِّ الرَّحْمَنِ حَتَّى تَكُونَ أَعْظَمَ مِنْ الْجَبَلِ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ<\/p>\n<p><strong>None gives charity from what is good, for Allah only accepts what is good, but that the Merciful takes it with His right hand. Even if it is a date, it is nurtured in the hand of the Merciful until it becomes greater than a mountain, just as one of you nurtures his young horse or camel.<\/strong><\/p>\n<p>Source: Sahih Muslim 1014, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/08\/05\/hadith-on-charity-allah-will-multiply-the-reward-for-those-who-spend-in-charity\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In contrast, Allah will not multiple our sins, but rather He only records each sin as a single sin.<\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ ثُمَّ بَيَّنَ ذَلِكَ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عَزَّ وَجَلَّ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِ مِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً<\/p>\n<p><strong>Verily, Allah has recorded good and bad deeds and He made them clear. Whoever intends to perform a good deed but does not do it, then Allah will record it as a complete good deed. If he intends to do it and does so, then Allah the Exalted will record it as ten good deeds up to seven hundred times as much or even more. If he intends to do a bad deed and does not do it, then Allah will record for him one complete good deed. If he does it then Allah will record for him a single bad deed.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6126, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/05\/22\/hadith-on-intention-allah-rewards-good-intentions-but-he-does-not-punish-bad-intentions-unless-the-evil-deed-is-done\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>We ought to take advantage of Allah’s mercy in this regard by performing many good deeds. Even good deeds we might see as ordinary, such as sending blessings upon the Prophet or giving the Islamic greeting, can be multiplied ten times.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا<\/p>\n<p><strong>Whoever sends blessings upon me once will have Allah send blessings upon him ten times.<\/strong><\/p>\n<p>Source: Sahih Muslim 408, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/23\/hadith-on-muhammad-bless-the-prophet-once-and-allah-will-bless-you-ten-times\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imran ibn Hussein reported: A man came to the Prophet and he said, “Peace be upon you.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَشْرٌ<\/p>\n<p><strong>Ten good deeds.<\/strong><\/p><\/blockquote>\n<p>Then another man came to the Prophet and he said, “Peace be upon you and the mercy of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عِشْرُونَ<\/p>\n<p><strong>Twenty good deeds.<\/strong><\/p><\/blockquote>\n<p>Then another man came to the Prophet and he said, “Peace be upon you and the mercy of Allah and His blessings.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثُونَ<\/p>\n<p><strong>Thirty good deeds.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2689, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/09\/hadith-on-greetings-the-best-greeting-is-peace-mercy-and-blessings-from-allah-be-upon-you\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even more, great deeds involving sacrifice and determination are multiplied up to seven hundred times.<\/p>\n<p>Abu Mas’ud reported: A man came with a bridled camel and he said, “This is for the cause of Allah.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَكَ بِهَا يَوْمَ الْقِيَامَةِ سَبْعُ مِائَةِ نَاقَةٍ كُلُّهَا مَخْطُومَةٌ<\/p>\n<p><strong>You will have for it seven hundred camels on the Day of Resurrection. Each of them will be bridled.<\/strong><\/p>\n<p>Source: Sahih Muslim 1892, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/06\/09\/hadith-on-reward-allah-mutiplies-great-deeds-up-to-seven-hundred-times-as-much\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In fact, this can apply to all good deeds except fasting, which is given a special and even greater reward from Allah.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ الْحَسَنَةُ عَشْرُ أَمْثَالِهَا إِلَى سَبْعمِائَة ضِعْفٍ قَالَ اللَّهُ عَزَّ وَجَلَّ إِلَّا الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ<\/p>\n<p><strong>Every deed of the son of Adam is multiplied from ten to seven hundred times. Allah the Exalted says: Except for fasting, for it is done for my sake and I will reward it.<\/strong><\/p>\n<p>Source: Sahih Muslim 1151, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/13\/hadith-on-fasting-every-good-deed-is-multiplied-but-for-fasting-there-is-more\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Good deeds that involve a number of people will cause many rewards to be distributed among them without decreasing each other’s rewards.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَنْفَقَتْ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا كَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ لَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا<\/p>\n<p><strong>When a woman spends in charity from her house’s meal without wasting it, then she will have a reward from what she spent. Her husband will have a reward from what he earned and the storekeeper will have a similar reward. Their rewards will not decrease each other in anything.<\/strong><\/p>\n<p>Source: Sahih Bukhari 1359, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/05\/06\/hadith-on-charity-spending-from-the-family-meals-is-charity-for-all-involved\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>By very simple and regular deeds, we can earn many rewards and erase many of our minor sins, but Satan causes many Muslims to forget to say their basic supplications after prayer and before sleeping.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَصْلَتَانِ أَوْ خَلَّتَانِ لَا يُحَافِظُ عَلَيْهِمَا رَجُلٌ مُسْلِمٌ إِلَّا دَخَلَ الْجَنَّةَ هُمَا يَسِيرٌ وَمَنْ يَعْمَلُ بِهِمَا قَلِيلٌ تُسَبِّحُ اللَّهَ عَشْرًا وَتَحْمَدُ اللَّهَ عَشْرًا وَتُكَبِّرُ اللَّهَ عَشْرًا فِي دُبُرِ كُلِّ صَلَاةٍ فَذَلِكَ مِائَةٌ وَخَمْسُونَ بِاللِّسَانِ وَأَلْفٌ وَخَمْسُ مِائَةٍ فِي الْمِيزَانِ وَتُسَبِّحُ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدُ ثَلَاثًا وَثَلَاثِينَ وَتُكَبِّرُ أَرْبَعًا وَثَلَاثِينَ عَطَاءٌ لَا يَدْرِي أَيَّتُهُنَّ أَرْبَعٌ وَثَلَاثُونَ إِذَا أَخَذَ مَضْجَعَهُ فَذَلِكَ مِائَةٌ بِاللِّسَانِ وَأَلْفٌ فِي الْمِيزَانِ فَأَيُّكُمْ يَعْمَلُ فِي الْيَوْمِ أَلْفَيْنِ وَخَمْسَ مِائَةِ سَيِّئَةٍ<\/p>\n<p><strong>There are two practices that will admit a Muslim into Paradise if he preserves them both. They are easy although those who practice them are few. It is to glorify Allah ten times and to praise Allah ten times and to exalt Allah ten times at the end of every prayer, for it is one hundred and fifty upon the tongue but one thousand five hundred upon the scale. And it is to glorify Allah thirty three times and to praise Allah thirty three times and to exalt Allah thirty four times when going to sleep, for it is one hundred upon the tongue and one thousand upon the scale. So which of you would commit two thousand five hundred sins in a day?<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, how are they easy but few practice them?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَأْتِي أَحَدَكُمْ الشَّيْطَانُ إِذَا فَرَغَ مِنْ صَلَاتِهِ فَيُذَكِّرُهُ حَاجَةَ كَذَا وَكَذَا فَيَقُومُ وَلَا يَقُولُهَا فَإِذَا اضْطَجَعَ يَأْتِيهِ الشَّيْطَانُ فَيُنَوِّمُهُ قَبْلَ أَنْ يَقُولَهَا<\/p>\n<p><strong>Satan comes to one of you during prayer and incites him to remember a need so he leaves the prayer without saying them, and Satan comes to him when he goes to bed and lulls him to sleep without saying them.<\/strong><\/p>\n<p>Source: Musnad Ahmad 6871, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/22\/hadith-on-remembrance-acts-of-remembrance-are-easy-and-rewarding-but-satan-causes-forgetfulness\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Even with such a tremendous advantage for earning good deeds, we must still be cautious not to fall into sins that destroy our good deeds and prevent them from being multiplied. The truly bankrupt Muslims are those who come on the Day of Judgment with some good deeds, only to see them destroyed by their many sins.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَدْرُونَ مَا الْمُفْلِسُ<\/p>\n<p><strong>Do you know who is bankrupt?<\/strong><\/p><\/blockquote>\n<p>They said, “The one without money or goods is bankrupt.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُفْلِسَ مِنْ أُمَّتِي يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلَاةٍ وَصِيَامٍ وَزَكَاةٍ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ دَمَ هَذَا وَضَرَبَ هَذَا فَيُعْطَى هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ أَنْ يُقْضَى مَا عَلَيْهِ أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَتْ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِ<\/p>\n<p><strong>Verily, the bankrupt of my nation are those who come on the Day of Resurrection with prayers, fasting, and charity, but also with insults, slander, consuming wealth, shedding blood, and beating others. The oppressed will each be given from his good deeds. If his good deeds run out before justice is fulfilled, then their sins will be cast upon him and he will be thrown into the Hellfire.<\/strong><\/p>\n<p>Source: Sahih Muslim 2581, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/08\/do-you-know-who-the-bankrupt-are\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Therefore, we must strive to perform many good deeds regularly and be careful not to ruin them with sins.<\/p>\n<p>We ask Allah to accept our deeds and to multiply them in Paradise and to protect us from evil deeds and the destruction they cause in the Hereafter.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Every deed of the son of Adam is multiplied from ten to seven hundred times.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[17,183,85,114,32,47,48,100,54,56,59,60,220,179],"class_list":["post-15748","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-fasting-al-siyam","tag-generosity-al-karam","tag-hereafter-akhirah","tag-jihad","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-peace","tag-prayer-salat","tag-supplication-al-dua","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-460","jetpack-related-posts":[{"id":16242,"url":"https:\/\/www.abuaminaelias.com\/every-good-deed-is-charity-in-islam\/","url_meta":{"origin":15748,"position":0},"title":"Every good deed is charity in Islam","author":"Abu Amina Elias","date":"January 26, 2015","format":false,"excerpt":"\"Has not Allah made for you ways to give charity? In every glorification of Allah is charity.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15665,"url":"https:\/\/www.abuaminaelias.com\/those-allah-loves-and-does-not-love\/","url_meta":{"origin":15748,"position":1},"title":"Those whom Allah loves and does not love","author":"Abu Amina Elias","date":"April 30, 2014","format":false,"excerpt":"\"Behave well. Verily, Allah loves those who are good.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20598,"url":"https:\/\/www.abuaminaelias.com\/reward-for-deeds-same-genus\/","url_meta":{"origin":15748,"position":2},"title":"Reward for deeds is from the same genus","author":"Abu Amina Elias","date":"June 29, 2019","format":false,"excerpt":"\"Allah helps a servant as long as he helps his brother.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16439,"url":"https:\/\/www.abuaminaelias.com\/easy-good-deeds-with-great-rewards\/","url_meta":{"origin":15748,"position":3},"title":"Easy good deeds with great rewards","author":"Abu Amina Elias","date":"March 30, 2015","format":false,"excerpt":"\"Glorify and exalt and praise Allah thirty three times after every prayer.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20713,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-ten-days-of-dhul-hijjah\/","url_meta":{"origin":15748,"position":4},"title":"Imam al-Mundhiri on First Ten Days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"Not even jihad in the way of Allah,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22759,"url":"https:\/\/www.abuaminaelias.com\/999-of-1000-in-hellfire\/","url_meta":{"origin":15748,"position":5},"title":"Only one out of 1000 are in Paradise?","author":"Abu Amina Elias","date":"December 29, 2020","format":false,"excerpt":"\"Of every thousand, nine hundred and ninety-nine...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15748","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15748"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15748\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15748"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15748"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15748"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}