{"id":15781,"date":"2016-07-04T10:49:22","date_gmt":"2016-07-04T06:49:22","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15781"},"modified":"2025-07-04T10:58:48","modified_gmt":"2025-07-04T06:58:48","slug":"verse-929-and-the-battle-of-tabuk","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/verse-929-and-the-battle-of-tabuk\/","title":{"rendered":"Verse 9:29 and the battle of Tabuk"},"content":{"rendered":"<p><strong>Question:<\/strong><\/p>\n<p>Does verse 9:29 permit aggression against non-Muslims?<\/p>\n<p><strong>Answer:<\/strong><\/p>\n<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The verse 9:29 is a command to fight the Byzantine Romans and other hostile powers who were planning an invasion against the Muslims in Arabia. In context, it is a distinct response to aggression, in particular the assassination of one of the Prophet’s ambassadors.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَاتِلُوا الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ وَلَا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ حَتَّىٰ يُعْطُوا الْجِزْيَةَ عَن يَدٍ وَهُمْ صَاغِرُونَ<\/p>\n<p><strong>Fight those who do not believe in Allah or in the Last Day and who do not consider unlawful what Allah and His Messenger have made unlawful and who do not acknowledge the religion of truth from those who were given the Scripture, until they give the tribute willingly while they are humbled.<\/strong><\/p>\n<p>Surah At-Tawba 9:29<\/p><\/blockquote>\n<p>On the surface, this appears to be an open-ended command to fight non-Muslims until they are conquered. However, a fundamental principle of Quranic exegesis (<em>tafseer<\/em>) is that the verses must be understood in the context in which they were revealed (<em>asbab an-nuzul<\/em>) and in conjunction with other verses delineating the rules of warfare.<\/p>\n<p>At-Tabari and other commentators record that this verse was revealed concerning the expedition of Tabuk.<\/p>\n<p>At-Tabari records:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنْ مُجَاهِدٍ<strong> قَاتِلُوا الَّذِينَ لا يُؤْمِنُونَ بِاللَّهِ وَلا بِالْيَوْمِ الآخِرِ<\/strong><strong>&#8230; <\/strong>حِينَ أُمِرَ مُحَمَّدٌ وَأَصْحَابُهُ بِغَزْوَةِ تَبُوكَ<\/p>\n<p>Mujahid reported concerning the verse, “<strong>Fight those who do not believe in Allah and the Last Day<\/strong>…” that it was revealed when Muhammad and his companions were commanded with the expedition of Tabuk.<\/p>\n<p>Source: Tafseer At-Tabari 9:29<\/p><\/blockquote>\n<p>The expedition of Tabuk was preceded by the battle of Mu’tah which began when the emissary of the Prophet was assassinated while delivering a letter to a Roman ally.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَانَ سَبَبُهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ الحارث بن عمير الأزدي أَحَدَ بَنِي لِهْبٍ بِكِتَابِهِ إِلَى الشَّامِ إِلَى مَلِكِ الرُّومِ أَوْ بُصْرَى فَعَرَضَ لَهُ شرحبيل بن عمرو الغساني فَأَوْثَقَهُ رِبَاطًا ثُمَّ قَدَّمَهُ فَضَرَبَ عُنُقَهُ وَلَمْ يُقْتَلْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَسُولٌ غَيْرُهُ فَاشْتَدَّ ذَلِكَ عَلَيْهِ حِينَ بَلَغَهُ الْخَبَرُ فَبَعَثَ الْبُعُوثَ<\/p>\n<p>The cause of the battle was that the Messenger of Allah, peace and blessings be upon him, sent Harith ibn Umair Al-Azdi of the tribe of Lihb with his letter to Syria for the Roman king or Busra. He presented it to Sharhabeel ibn Amr Al-Ghassani and he bound him and struck his neck. Never had an ambassador of the Messenger of Allah been killed besides him. The Prophet was upset by that when news reached him and he dispatched an expedition.<\/p>\n<p>Source: Zaad Al-Ma’ad 336<\/p><\/blockquote>\n<p>Safiur Rahman writes:<\/p>\n<blockquote><p>The Prophet, peace and blessings be upon him, had sent Al-Harith ibn Umair Al-Azdi on an errand to carry a letter to the ruler of Busra. On his way, he was intercepted by Sharhabeel ibn Amr Al-Ghassani, the governor of Al-Balqa and a close ally to Caesar, the Byzantine Emperor. Al-Harith was tied and beheaded by Al-Ghassani.<\/p>\n<p>Source: The Sealed Nectar p. 245<\/p><\/blockquote>\n<p>This was the first act of Roman aggression that further led to the expedition of Tabuk concerning which the verse 9:29 was revealed. The verse describes the aggressors as those “<strong>who do not believe in Allah and the Last Day<\/strong>,” because they committed this act of treachery. Executing emissaries from other countries is a war crime that could never be committed by those who sincerely believe in God.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِيمَانَ لِمَنْ لَا أَمَانَةَ لَهُ وَلَا دِينَ لِمَنْ لَا عَهْدَ لَهُ<\/p>\n<p><strong>There is no faith for one who cannot be trusted. There is no religion for one who cannot uphold a covenant.<\/strong><\/p>\n<p>Source: Musnad Ahmad 11975, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/05\/13\/hadith-on-treachery-there-is-no-faith-or-religion-for-one-who-cannot-keep-a-promise\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Safiur Rahman further describes the reason the conflict took place:<\/p>\n<blockquote><p>The Byzantine power, which was considered the greatest military force on earth at that time, showed an unjustifiable opposition towards Muslims. As we have already mentioned, their opposition started at killing the ambassador of the Messenger of Allah, peace and blessings be upon him, Al-Harith ibn Umair Al-Azdi, by Sharhabeel ibn Amr Al-Ghassani. The ambassador was then carrying a message from the Prophet to the ruler of Busra. We have also stated that the Prophet consequently dispatched a brigade under the command of Zaid bin Haritha, who had a fierce fight against the Byzantines at Mu’tah. Although Muslim forces could not have revenge on those haughty overproud tyrants, the confrontation itself had a great impression on the Arabs all over Arabia.<\/p>\n<p>Caesar, who could neither ignore the great benefit that the battle of Mu’tah had brought to Muslims, nor could he disregard the Arab tribes’ expectations of independence and their hopes of getting free from his influence and reign, nor he could ignore their alliance to the Muslims. Realizing all that, Caesar was aware of the progressive danger threatening his borders, especially the fronts of Syria which were neighboring Arab lands. So he concluded that demolition of the Muslims&#8217; power had grown an urgent necessity. This decision of his should, in his opinion, be achieved before the Muslims become too powerful to conquer and raise troubles and unrest in the adjacent Arab territories.<\/p>\n<p>To meet these exigencies, Caesar mustered a huge army of the Byzantines and pro-Roman Ghassanite tribes to launch a decisive bloody battle against the Muslims.<\/p>\n<p>Source: The Sealed Nectar p. 272<\/p><\/blockquote>\n<p>Therefore, this context must be understood when reading verse 9:29 so that we clearly know <em>who<\/em> should be fought, specifically the aggressors among the Jews and Christians and not all of them. Rather, many other verses of the Quran make clear that it is unlawful to initiate hostilities against other nations.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلَا تَعْتَدُوا إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ<\/p>\n<p><strong>Fight in the way of Allah those who fight you but do not transgress. Verily, Allah does not love transgressors.<\/strong><\/p>\n<p>Surah Al-Baqarah 2:190<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ لِلَّهِ فَإِنِ انتَهَوْا فَلَا عُدْوَانَ إِلَّا عَلَى الظَّالِمِينَ<\/p>\n<p><strong>Fight them until there is no more persecution and worship is for Allah. But if they cease, then there is to be no aggression except against the oppressors.<\/strong><\/p>\n<p>Surah Al-Baqarah 2:193<\/p><\/blockquote>\n<p>Other verses and traditions make clear that Muslims must accept peace offerings from their enemies.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ<\/p>\n<p><strong>If the enemy inclines to peace, then incline to it also and rely upon Allah. Verily, it is He who is the Hearing, the Knowing.<\/strong><\/p>\n<p>Surah Al-Anfal 8:61<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا<\/p>\n<p><strong>So if they remove themselves from you and do not fight you and offer you peace, then Allah has not made for you a cause for fighting against them.<\/strong><\/p>\n<p>Surah An-Nisa 4:90<\/p><\/blockquote>\n<p>Ali ibn Abu Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ سَيَكُونُ بَعْدِي اخْتِلَافٌ أَوْ أَمْرٌ فَإِنْ اسْتَطَعْتَ أَنْ تَكُونَ السِّلْمَ فَافْعَل<\/p>\n<p><strong>Verily, after me there will be conflicts or affairs, so if you are able to end them in peace then do so.<\/strong><\/p>\n<p>Source: Musnad Ahmad 697, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/11\/29\/hadith-on-peace-if-you-can-end-conflicts-in-peace-then-do-so\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Interpreting the verse 9:29 in light of the entire Quran makes unequivocal that the purpose of the verse is to defend from aggression, not to commit aggression against non-Muslim nations.<\/p>\n<p>Muhammad Asad interprets the verse as follows:<\/p>\n<blockquote><p>In accordance with the fundamental principle observed throughout my interpretation of the Quran, that all of its statements and ordinances are mutually complementary and cannot, therefore, be correctly understood unless they are considered as parts of one integral whole, this verse 9:29 too must be read in the context of the clear-cut Quranic rule that war is permitted only in self-defense. In other words, the above injunction to fight is relevant only in the event of aggression committed against the Muslim community or state, or in the presence of an unmistakable threat to its security: a view which has been shared by that great Islamic thinker, Muhammad Abduh. Commenting on this verse, he declared:<\/p>\n<p style=\"text-align: right;\">القتال الواجب في الإسلام إنما شرع للدفاع عن الحق وأهله&#8230; إن غزوات النبي صلى الله عليه وسلم كانت كلها دفاعا وكذلك حروب الصحابة في الصدر الأول<\/p>\n<p>“Fighting has been made obligatory in Islam only for the sake of defending the truth and its followers… All the campaigns of the Prophet were defensive in character and so were the wars undertaken by the companions in the earliest period of Islam.”<\/p>\n<p>Source: Message of the Quran 9:29<\/p><\/blockquote>\n<p>We conclude that verse 9:29 does not permit aggression against peaceful nations. Rather, it must be read within the context in which it was revealed and in combination with the Quran and authentic traditions as a whole.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Fight in the way of Allah those who fight you but do not transgress. Verily, Allah does not love transgressors.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[61,16,18,133,37,47,48,100,55,93,59,115,62,103,45,72,98],"class_list":["post-15781","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-call-to-islam-dawah","tag-character-akhlaq","tag-community-jamaah","tag-covenants","tag-idolatry-shirk","tag-jihad","tag-justice-adl","tag-manners-al-adab","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-peace","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-truthfulness-al-sidq","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-46x","jetpack-related-posts":[{"id":13131,"url":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-a-terrorist\/","url_meta":{"origin":15781,"position":0},"title":"Was Prophet Muhammad a terrorist?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Fight in the way of Allah those who fight you, but do not transgress.\" (2:190)","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14540,"url":"https:\/\/www.abuaminaelias.com\/verse-of-the-sword-slay-unbelievers\/","url_meta":{"origin":15781,"position":1},"title":"Slay them wherever you find them?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Prophet never forced the religion upon anyone,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":15781,"position":2},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15463,"url":"https:\/\/www.abuaminaelias.com\/methods-islamophobic-propaganda\/","url_meta":{"origin":15781,"position":3},"title":"Methods of anti-Islam propaganda","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"They are those who prefer the worldly life over the Hereafter...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18681,"url":"https:\/\/www.abuaminaelias.com\/was-the-stoning-verse-abrogated\/","url_meta":{"origin":15781,"position":4},"title":"Is the stoning verse missing from the Quran?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The ruling of the verse of stoning is affirmed and its recitation is abrogated.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":15781,"position":5},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15781","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15781"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15781\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15781"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15781"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15781"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}