{"id":15801,"date":"2014-06-24T14:22:11","date_gmt":"2014-06-24T10:22:11","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15801"},"modified":"2020-07-17T22:06:14","modified_gmt":"2020-07-17T18:06:14","slug":"khawarij-ideology-of-violence","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/khawarij-ideology-of-violence\/","title":{"rendered":"Dangers of the Khawarij ideology of violence"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The most dangerous sect in Islam are the Kharijites (<em>al-khawārij<\/em>). They have existed since the very early period of Islam and they will continue to cause strife in the Muslim nation until the end of time when they will join forces with the False Messiah (<em>al-dajjāl<\/em>). We must be aware of their ideology and characteristics in order to protect ourselves from unwittingly supporting their destructive behavior.<\/p>\n<p>The Kharijites earned their name (from the root <em>kh-ra-ja<\/em> meaning “to go out”) because they exited Islam and the Muslim community due to their heretical innovations. They will recite the Quran but it will not go beyond their throats, meaning it will not enter their hearts and they will not understand it.<\/p>\n<p>Abu Sa’eed Al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَخْرُجُ نَاسٌ مِنْ قِبَلِ الْمَشْرِقِ وَيَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ ثُمَّ لَا يَعُودُونَ فِيهِ حَتَّى يَعُودَ السَّهْمُ إِلَى فُوقِهِ<\/p>\n<p><strong>There will come a people from the east who recite the Quran but it will not go beyond their throats. They will pass through the religion just as an arrow pierces its target and they will not return to it just as the arrow does not return to the bow.<\/strong><\/p>\n<p>Source: Sahih Bukhari 7123, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/11\/hadith-on-khawarij-the-violent-rebels-in-islam-recite-quran-but-do-not-understand-it\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Kharijite ideology is based upon the following evil tenets:<\/p>\n<ol>\n<li>Declaring Muslims to be unbelievers.<\/li>\n<li>Rejecting lawful obedience to the rulers.<\/li>\n<li>Justifying violence against Muslims and innocent people.<\/li>\n<\/ol>\n<p>The correct Islamic belief is that no Muslim can become an unbeliever due to his sins alone. A Muslim must explicitly disavow Islam in order to be properly considered an unbeliever.<\/p>\n<p>At-Tahawi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا نُكَفِّرُ أَحَدًا مِنْ أَهْلِ الْقِبْلَةِ بِذَنْبٍ مَا لَمْ يَسْتَحِلَّهُ وَلَا نَقُولُ لَا يَضُرُّ مَعَ الْإِيمَانِ ذَنْبٌ لِمَنْ عَمِلَهُ<\/p>\n<p>We do not excommunicate anyone who prays toward Mecca because of their sins as long as he does not consider them lawful, and we do not say sins do not harm the faith of those who commit them.<\/p><\/blockquote>\n<p>And he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يَخْرُجُ الْعَبْدُ مِنَ الْإِيمَانِ إِلَّا بِجُحُودِ مَا أَدْخَلَهُ فِيهِ<\/p>\n<p>A person does not leave faith except by disavowing what brought him into it.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/aqeedah-of-imam-tahawi\/\">al-Aqīdah al-Ṭaḥāwiyyah<\/a><\/p><\/blockquote>\n<p>In contrast, the Kharijites charge other Muslims with unbelief due to their sins or perceived sins in order to justify their merciless and criminal behavior towards them.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْخَوَارِجُ هُمْ أَوَّلُ مَنْ كَفَّرَ الْمُسْلِمِينَ يُكَفِّرُونَ بِالذُّنُوبِ ، وَيُكَفِّرُونَ مَنْ خَالَفَهُمْ فِي بِدْعَتِهِمْ وَيَسْتَحِلُّونَ دَمَهُ وَمَالَهُ وَهَذِهِ حَالُ أَهْلِ الْبِدَعِ يَبْتَدِعُونَ بِدْعَةً وَيُكَفِّرُونَ مَنْ خَالَفَهُمْ فِيهَا وَأَهْلُ السُّنَّةِ وَالْجَمَاعَةِ يَتَّبِعُونَ الْكِتَابَ وَالسُّنَّةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ فَيَتَّبِعُونَ الْحَقَّ وَيَرْحَمُونَ الْخَلْقَ<\/p>\n<p>The Kharijite sect was the first to declare Muslims to be unbelievers because of their sins. They charged as unbelievers whoever disagreed with their innovations and they made lawful the spilling of blood and the taking of wealth. This is the condition of the people of innovation, that they invent some religious innovation and then they excommunicate whoever disagrees with them concerning it. Rather, the people of the Sunnah and the community follow the Book and the Sunnah and they obey Allah and His Messenger and follow the truth. They have mercy upon the creation.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/02\/ibn-taymiyyah-it-is-forbidden-to-declare-a-muslim-to-be-a-disbeliever-on-account-of-his-sins\/\">Majmū&#8217; al-Fatāwá 1\/278<\/a><\/p><\/blockquote>\n<p>True Muslims have mercy upon the entire creation, including unbelievers and idolaters, but the Kharaijites have no mercy for those outside their group. They declare other Muslims to be unbelievers by misinterpreting and misapplying the verses of the Quran.<\/p>\n<p>Al-Bukhari reported: Ibn Umar, may Allah be pleased with him, considered the Kharijites to be the worst of Allah’s creation and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُمْ انْطَلَقُوا إِلَى آيَاتٍ نَزَلَتْ فِي الْكُفَّارِ فَجَعَلُوهَا عَلَى الْمُؤْمِنِينَ<\/p>\n<p>Verily, they take verses that were revealed about unbelievers and use them against the believers.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6531, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/08\/ibn-umar-on-rebels-the-khawarij-apply-verses-about-disbelievers-against-the-believing-muslims\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In the early period of Islam, they declared Ali ibn Abi Talib to be an unbeliever when he intended to reconcile with Mu’awiyah.<\/p>\n<p>Ubaidullah ibn Abu Rafi reported: The Kharijites came out against Ali ibn Abi Talib and they said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا حُكْمَ إِلَّا لِلَّهِ<\/p>\n<p><strong>There is no rule <\/strong>(<em>ḥukm<\/em>)<strong> but for Allah.<\/strong> (12:40)<\/p><\/blockquote>\n<p>Ali, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَلِمَةُ حَقٍّ أُرِيدَ بِهَا بَاطِلٌ<\/p>\n<p>A word of truth by which is intended falsehood.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1066, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/18\/ali-on-khawarij-their-words-about-allahs-rule-are-truthful-but-their-intentions-are-falsehood\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The original Kharijites misused the verse “there is no rule but for Allah,” (12:40) by not properly distinguishing between matters upon which Allah has definitively ruled and matters left open to interpretation, consultation, and human decision-making. Ali ibn Abi Talib decisively refuted them with the Quran.<\/p>\n<p>Abdullah ibn Shaddad reported: The Kharijites came out against Ali and they said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><span style=\"line-height: 1.5;\">انْسَلَخْتَ مِنْ قَمِيصٍ أَلْبَسَكَهُ اللَّهُ تَعَالَى وَاسْمٍ سَمَّاكَ اللَّهُ تَعَالَى بِهِ ثُمَّ انْطَلَقْتَ فَحَكَّمْتَ فِي دِينِ اللَّهِ فَلَا حُكْمَ إِلَّا لِلَّهِ تَعَالَى<\/span><\/p>\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5;\">You have replaced the authority Allah the Exalted has given you and the name with which he named you. Then, you have withdrawn and judged with the judgment of men in the religion of Allah while <\/span>there is no rule but for Allah<span style=\"line-height: 1.5;\">.<\/span><\/p>\n<\/blockquote>\n<p>When Ali heard this, he gathered the people and he called for the greatest scripture (<em>muṣḥaf<\/em>). He started striking it with his hand, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا الْمُصْحَفُ حَدِّثْ النَّاسَ<\/p>\n<p>O you scripture, speak to the people!<\/p><\/blockquote>\n<p>They said, “It is not a person. It is only ink and paper. We are speaking about what is narrated from it.” Ali said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><span style=\"line-height: 1.5;\">أَصْحَابُكُمْ هَؤُلَاءِ الَّذِينَ خَرَجُوا بَيْنِي وَبَيْنَهُمْ كِتَابُ اللَّهِ يَقُولُ اللَّهُ تَعَالَى فِي كِتَابِهِ فِي امْرَأَةٍ وَرَجُلٍ وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا فَأُمَّةُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْظَمُ دَمًا وَحُرْمَةً مِنْ امْرَأَةٍ وَرَجُلٍ<\/span><\/p>\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5;\">The Book of Allah is between myself and these companions of yours who have come out against me. Allah said in his Book regarding the woman and man,<\/span><strong style=\"line-height: 1.5;\"> &#8216;<\/strong>If you fear dissension between the two, send an arbitrator (<em>ḥakam<\/em>) from his people,&#8217;<span style=\"line-height: 1.5;\"> (4:35) and the nation of Muhammad is greater in sanctity for their lives than the affair of a woman and a man. <\/span><\/p>\n<\/blockquote>\n<p>Ibn Abbas was sent to debate with the rebels and four thousand of them repented and returned to the side of Ali. Then, Ali said to the remaining rebels:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَقِفُوا حَيْثُ شِئْتُمْ حَتَّى تَجْتَمِعَ أُمَّةُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَنَا وَبَيْنَكُمْ أَنْ لَا تَسْفِكُوا دَمًا حَرَامًا أَوْ تَقْطَعُوا سَبِيلًا أَوْ تَظْلِمُوا ذِمَّةً فَإِنَّكُمْ إِنْ فَعَلْتُمْ فَقَدْ نَبَذْنَا إِلَيْكُمْ الْحَرْبَ عَلَى سَوَاءٍ إِنَّ اللَّهَ لَا يُحِبُّ الْخَائِنِينَ<\/p>\n<p>Remain wherever you wish, for the nation of Muhammad has agreed between us and you that you will not shed sacred blood or obstruct the highways or oppress a protected people. If you do so, then we have issued a notice of war against you on equal footing. Verily, Allah does not love the treacherous.<\/p>\n<p>Source: Musnad Aḥmad 658, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Ahmad Shakir declared this narration to be authentic in his verification of Musnad Aḥmad 2\/66.<\/p>\n<p>The Kharijites believe their opinions regarding leadership, government, politics, and the Sharia are the only valid opinions in Islam and whoever disagrees with them becomes an unbeliever. However, the truth is that much of these matters are left open to interpretation and consultation among the Muslims.<\/p>\n<p>In fact, the Prophet commanded us to distinguish between the rule of Allah and the rule of people and <em>not<\/em> to claim our opinions are the rulings of Allah.<\/p>\n<p>Buraida reported: When the Messenger of Allah, peace and blessings be upon him, would appoint a commander over the army, he would personally enjoin him to fear Allah and to be good with the Muslims who were with him. The Prophet would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اللَّهِ وَذِمَّةَ نَبِيِّهِ فَلَا تَجْعَلْ لَهُمْ ذِمَّةَ اللَّهِ وَلَا ذِمَّةَ نَبِيِّهِ وَلَكِنْ اجْعَلْ لَهُمْ ذِمَّتَكَ وَذِمَّةَ أَصْحَابِكَ فَإِنَّكُمْ أَنْ تُخْفِرُوا ذِمَمَكُمْ وَذِمَمَ أَصْحَابِكُمْ أَهْوَنُ مِنْ أَنْ تُخْفِرُوا ذِمَّةَ اللَّهِ وَذِمَّةَ رَسُولِهِ وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تُنْزِلَهُمْ عَلَى حُكْمِ اللَّهِ فَلَا تُنْزِلْهُمْ عَلَى حُكْمِ اللَّهِ وَلَكِنْ أَنْزِلْهُمْ عَلَى حُكْمِكَ فَإِنَّكَ لَا تَدْرِي أَتُصِيبُ حُكْمَ اللَّهِ فِيهِمْ أَمْ لَا<\/p>\n<p><strong>When you besiege the people of a fortress and they appeal to you for protection in the name of Allah and His Prophet, do not give them protection in the name of Allah and His Prophet but rather give them protection in the name of you and your companions. Verily, for you to violate the protection of yourself and your companions is a lesser sin than to violate the protection of Allah and His Messenger. When you besiege the people of a fortress and they appeal for you to bring them out according to the rule of Allah, do not bring them our according to the rule of Allah but rather bring them out according to your ruling. Verily, you do not know if you will judge with the ruling of Allah concerning them or not.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1731, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/12\/10\/hadith-on-war-the-prophets-instructions-for-his-battlefield-commanders\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thus, Muslims must distinguish between the rule of Allah and the rule of people. Yet the Kharijites, who make no such distinction, will charge other Muslims with unbelief who disagree with their views. In fact, the Kharijites do not simply declare Muslims to be unbelievers in a theoretical way, but rather they call for violent rebellion against entire Muslim societies.<\/p>\n<p>Regarding Muslim rulers, the correct Islamic belief is that we must obey them in all lawful matters. We should only disobey them if they command us to commit sins and we may not call for a violent overthrow of their governments as long as they allow the prayer.<\/p>\n<p>Umm Salamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَتَكُونُ أُمَرَاءُ فَتَعْرِفُونَ وَتُنْكِرُونَ فَمَنْ عَرَفَ بَرِئَ وَمَنْ أَنْكَرَ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ<\/p>\n<p><strong>There will be rulers from whom you will see both goodness and corruption. One who recognizes their evil and hates it will maintain his innocence, but one who is pleased with it and follows them will be sinful.<\/strong><\/p><\/blockquote>\n<p>It was said, “Shall we not fight them?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا مَا صَلَّوْا<\/p>\n<p><strong>No, as long as they pray.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1854, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/15\/hadith-on-tyranny-whoever-sees-an-unjust-ruler-and-hates-his-evil-will-maintain-his-innocence\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As long as Muslims are allowed to pray and practice the pillars of Islam, then there is no justification for declaring a rebellion against the rulers. In contrast, the Kharijites rebel against the ruler not to protect the religion, but rather for inexcusable worldly reasons.<\/p>\n<p>Abu Hayyan reported: A man from the Kharijites came to Hasan Al-Basri and he said, “What do you say about the rebels?” Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هم أصحاب دنيا<\/p>\n<p>They are seekers of the world.<\/p><\/blockquote>\n<p>He said, “Why do you say that when one of them goes out with his spear until it breaks and he leaves his family and children?” Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حدثني عن السلطان أيمنعك من إقامة الصلاة وإيتاء الزكاة والحج والعمرة<\/p>\n<p>Tell me about the ruler. Does he prevent you from establishing prayer, giving charity, and performing the pilgrimage?<\/p><\/blockquote>\n<p>He said no. Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأراه إنما منعك الدنيا فقاتلته عليها<\/p>\n<p>As I see it, he has only prevented you from seeking the world and you have fought him for it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/02\/12\/hasan-on-khawarij-the-ruler-prevented-them-from-the-worldly-life-so-they-fought-him-for-it\/\">al-Baṣā&#8217;ir wal-Dhakhā&#8217;ir 1\/34<\/a><\/p><\/blockquote>\n<p>In general, Muslims must work to reform societies through non-violent methods such as teaching, preaching, and charity. Violence is only a last resort in the worst case. The Kharijites, on the other hand, charge Muslim leaders with unbelief and anyone else who does not support their call for violent rebellion. In this way, they justify indiscriminate violence against entire Muslim societies.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِعَصَبَةٍ أَوْ يَدْعُو إِلَى عَصَبَةٍ أَوْ يَنْصُرُ عَصَبَةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلاَ يَتَحَاشَ مِنْ مُؤْمِنِهَا وَلاَ يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ<\/p>\n<p><strong>Whoever rejects obedience to the leader and divides the community and dies will have died upon ignorance. Whoever fights under the banner of one who is blind, raging for the sake of tribalism, or calling to tribalism, or supporting tribalism, and is killed will have died upon ignorance. Whoever rebels against my nation, striking the righteous and wicked alike and sparing not even the believers and does not fulfill the pledge of security, then he has nothing to do with me and I have nothing to do with him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1848, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/14\/hadith-on-tribalism-whoever-fights-against-muslims-for-the-sake-of-tribal-bigotry-i-have-nothing-to-do-with-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This narration succinctly describes the characteristics of the Kharijites and their violent behavior. They reject lawful obedience to Muslim leaders and they fight according to their tribal zeal, meaning they are not concerned with justice for their victims. They attack both the righteous and the wicked, and they do not honor covenants of security and the protection of civilians.<\/p>\n<p>In our times, you will see them target markets, bus stations, airports, and other places frequented by unarmed civilians. The purpose of such attacks is not to achieve any immediate military objectives, but rather to spread terror among the population and destabilize the government. In this way, they follow the same path as the first Kharijites in the early period of Islam.<\/p>\n<p>At-Tabari reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأتت الخوارج قريته فأخذوه وأخذوا ابنته فقدموا ابنته فقتلوها وزعم لي أبو الربيع السلولي أن اسم ابنته أم يزيد وأنها كانت تقول لهم يا أهل الإسلام إن أبي مصاب فلا تقتلوه وأما أنا فإنما أنا جارية والله ما أتيت فاحشة قط ولا آذيت جارة لي ولا تطلعت ولا تشرفت قط فقدموها ليقتلوها فأخذت تنادي ما ذنبي ما ذنبي ثم سقطت مغشيا عليها أو ميتة  ثم قطعوها بأسيافهم<\/p>\n<p>The Khawarij came to a village and they seized a man and his daughter. She said to them, &#8220;O people of Islam! Indeed, my father is an old man so do not kill him, and I am only a girl. By Allah, I have never been immoral and I have never harmed anyone.&#8221; They brought her to kill her and she kept saying, &#8220;What is my sin? What is my sin?&#8221; Then she fainted and they killed her with their swords.<\/p>\n<p>Source: Tārīkh al-Ṭabarī 6\/124<\/p><\/blockquote>\n<p>Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذْ لَوْ قَوُوا هَؤُلَاءِ لَأَفْسَدُوا الْأَرْضَ كُلَّهَا عِرَاقًا وَشَامًا وَلَمْ يَتْرُكُوا طِفْلًا وَلَا طِفْلَةَ وَلَا رَجُلًا وَلَا امْرَأَةً لِأَنَّ النَّاسَ عِنْدَهُمْ قَدْ فَسَدُوا فَسَادًا لَا يُصْلِحُهُمْ إِلَّا الْقَتْلُ جُمْلَةً<\/p>\n<p>If the Khawarij ever gained power, they would corrupt the entire earth, Iraq, and Syria. They would not leave a boy or a girl or a man or a woman, for in their view the people have become so corrupt that they cannot be reformed except by mass killing.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 10\/584<\/p><\/blockquote>\n<p>Wherever they appear, the Kharijites cause division among the Muslims at large and even among their own groups. Whenever they form a group, it is not long before splinter groups and off-shoots appear with each one claiming to have the right to seize the Caliphate.<\/p>\n<p>Wahb ibn Munabbih said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أني قد أدركت صدر الإسلام فوالله ما كانت للخوارج جماعة قط إلا فرقها اللَّه على شر حالاتهم وما أظهر أحد منهم رأيه قط إلا ضرب اللَّه عنقه وما اجتمعت الأمة على رجل قط من الخوارج ولو أمكن اللَّه الخوارج من رأيهم لفسدت الأرض وقطعت السبل وقطع الحج من بيت اللَّه الحرام وإذا لعاد أمر الإسلام جاهلية حتى يعود الناس يستغيثون برءوس الجبال كما كانوا في الجاهلية وإذا لقام أكثر من عشرة أو عشرين رجلا ليس منهم رجل إلا وهو يدعو إلى نفسه بالخلافة ومع كل رجل منهم أكثر من عشرة آلاف يقاتل بعضهم بعضا ويشهد بعضهم على بعض بالكفر حتى يصبح الرجل المؤمن خائفا على نفسه ودينه ودمه وأهله وماله لا يدري أين يسلك أو مع من يكون<\/p>\n<p>I knew the early period of Islam. By Allah, the Kharijites never had a group except that Allah caused it to split due to their evil condition. Never did one of them proclaim his opinion except that Allah caused his neck to be struck. Never did the Muslim nation unite upon a man from the Kharijites. If Allah had allowed the opinion of the Kharijites to take root, the earth would have been corrupted, the roadways would have been cut off, the Hajj pilgrimage to the sacred house of Allah would have been cut off, and the affair of Islam would have returned to ignorance until the people would seek refuge in the mountains as they had done in the time of ignorance. If there were to arise among them ten or twenty men, there would not be a man among them except that he would claim the Caliphate for himself. With each man among them would be ten thousand others, all of them fighting each other and charging each other with unbelief until even the believer would fear for himself, his religion, his life, his family, his wealth, and he would not know where to travel or with whom he should be.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/06\/23\/wahb-on-khawarij-dreadful-consequences-of-the-kharijite-heresy-and-rebellion\/\">Tārīkh Dimashq 69290<\/a><\/p><\/blockquote>\n<p>Nevertheless, the Kharijites have been successful recruiting ignorant or desperate Muslims. The Prophet described them as using beautiful Islamic rhetoric and selling “foolish dreams” to the Muslim masses.<\/p>\n<p>Ali ibn Abu Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَأْتِي فِي آخِرِ الزَّمَانِ قَوْمٌ حُدَثَاءُ الْأَسْنَانِ سُفَهَاءُ الْأَحْلَامِ يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ يَمْرُقُونَ مِنْ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ لَا يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ<\/p>\n<p><strong>In the last days, there will be young people with foolish dreams. They will say the best of words in creation but they will pass through Islam just as an arrow passes through its game. Their faith will not go beyond their throats.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4770, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/04\/hadith-on-rebels-in-the-last-days-violent-young-rebels-with-foolish-dreams-will-terrorize-the-muslims\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Their “foolish dreams” are their promises of an Islamic Utopia, a glorious jihad, a new Caliphate that will bring honor and strength back to the Muslims. Yet, their dreams are unrealistic and their methodologies dangerous to the very people they claim to be helping. Their understanding of faith is so shallow, superficial, and hypocritical that they cause even greater harm to Muslim community.<\/p>\n<p>In another narration, the Prophet described them saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَيَكُونُ فِي أُمَّتِي اخْتِلَافٌ وَفُرْقَةٌ قَوْمٌ يُحْسِنُونَ الْقِيلَ وَيُسِيئُونَ الْفِعْلَ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الدِّينِ مُرُوقَ السَّهْمِ مِنْ الرَّمِيَّةِ لَا يَرْجِعُونَ حَتَّى يَرْتَدَّ عَلَى فُوقِهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ<\/p>\n<p><strong>There will be dissension and division in my nation and a people will come with beautiful words but evil deeds. They recite the Quran but it will not pass beyond their throats. They will leave the religion as an arrow leaves its target and they will not return until the arrows returns to its notch. They are the worst of the creation.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4765, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/09\/18\/hadith-on-khawarij-the-kharijites-come-with-beautiful-preaching-but-evil-deeds\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Indeed, like their predecessors their preaching and propaganda entices people to join their cause but by their actions they are the worst of the creation, even though they recite the Quran and call to Islam. They bring forth verses of the Quran to bolster their arguments but they wield them against the objectives of Islam.<\/p>\n<p>Usama ibn Zaid reported: Sa’d, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنَا وَاللَّهِ لَا أَقْتُلُ مُسْلِمًا حَتَّى يَقْتُلَهُ ذُو الْبُطَيْنِ<\/p>\n<p>By Allah, I would never kill a Muslim as this one had killed him.<\/p><\/blockquote>\n<p>A man said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَمْ يَقُلْ اللَّهُ وَقَاتِلُوهُمْ حَتَّى لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ<\/p>\n<p>Did not Allah say: <strong>Fight them until there is no more persecution and religion is entirely for Allah<\/strong>? (2:193)<\/p><\/blockquote>\n<p>Sa’d said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ قَاتَلْنَا حَتَّى لَا تَكُونَ فِتْنَةٌ وَأَنْتَ وَأَصْحَابُكَ تُرِيدُونَ أَنْ تُقَاتِلُوا حَتَّى تَكُونُ فِتْنَةٌ<\/p>\n<p>We did fight them until there was no more persecution, but you and your companions intend to fight until there is persecution.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 96, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/07\/05\/hadith-on-persecution-the-prophet-fought-for-religious-freedom-not-political-authority\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sa’eed ibn Jubair reported: We were met by Abdullah ibn Umar and we hoped that he would narrate to us a good saying. A man approached him and he said, “O Abu Abdur Rahman, tell us about fighting during times of persecution as Allah said: <strong>And fight until there is no more persecution<\/strong>.” (2:193) Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ تَدْرِي مَا الْفِتْنَةُ ثَكِلَتْكَ أُمُّكَ إِنَّمَا كَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَاتِلُ الْمُشْرِكِينَ وَكَانَ الدُّخُولُ فِي دِينِهِمْ فِتْنَةً وَلَيْسَ كَقِتَالِكُمْ عَلَى الْمُلْكِ<\/p>\n<p>Do you know what persecution is? May your mother be bereaved of you! Muhammad, peace and blessings be upon him, only fought the idolaters as there was persecution for practicing their religion. It was not like your fighting for the sake of ruling.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6682, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/07\/05\/hadith-on-persecution-the-prophet-fought-for-religious-freedom-not-political-authority\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The purpose of a just war in Islam is to end religious persecution and to protect innocent people, yet the Kharijites use such verses to further persecute Muslims and to justify their worldly ambitions of political power.<\/p>\n<p>We will continue to see the violent call of the Kharijites appear again and again until the end of time when the False Messiah appears among them. They follow the same Satanic forces from which will emerge the greatest tribulation and suffering ever faced by humanity.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَيَخْرُجُ أُنَاسٌ مِنْ أُمَّتِي مِنْ قِبَلِ الْمَشْرِقِ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ كُلَّمَا خَرَجَ مِنْهُمْ قَرْنٌ قُطِعَ كُلَّمَا خَرَجَ مِنْهُمْ قَرْنٌ قُطِعَ<\/p>\n<p><strong>There will emerge from the east some people from my nation who recite the Quran but it will not go beyond their throats. Every time a faction of them emerges it will be cut off.<\/strong><\/p><\/blockquote>\n<p>The Prophet repeated this and on the tenth time he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلَّمَا خَرَجَ مِنْهُمْ قَرْنٌ قُطِعَ حَتَّى يَخْرُجَ الدَّجَّالُ فِي بَقِيَّتِهِمْ<\/p>\n<p><strong>Every time a faction of them emerges it will be cut off until the False Messiah emerges from their remnants.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 27767, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/06\/23\/hadith-on-khawarij-the-dajjal-will-emerge-from-within-the-kharijite-rebels\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As such, in our times we are witnessing a number of conflicts between oppressive governments and rebel Kharijite forces. Muslims are stuck between the spear of the ruler and the sword of the rebel. In such cases, we must remain patient and work to reform and improve our communities through education, preaching, and charity.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلَاهَا فِي النَّارِ اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِ<\/p>\n<p><strong>There will be a tribulation that will wipe out the Arabs in which those killed on both sides are in the Hellfire. In that time the tongue will be stronger than the sword.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6941, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/30\/hadith-on-fitnah-a-tribulation-will-come-in-which-the-tongue-is-mightier-than-the-sword\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>If we are not careful, we might fall into the sins of either side of the conflict by legitimizing the misdeeds of an oppressive government or justifying acts of terrorism in response. We should not rush to support one or another side in such conflicts as they are tribulations (<em>fitnah<\/em>) in which the truth is unclear.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْقَائِمُ خَيْرٌ مِنْ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفْهُ فَمَنْ وَجَدَ مَلْجَأً أَوْ مَعَاذًا فَلْيَعُذْ بِهِ<\/p>\n<p><strong>There will be tribulations during which a sitting person will be better than the one standing. The one standing will be better than the one walking. The one walking will be better than the one running. Whoever exposes himself to these tribulations will be destroyed, so whoever finds a place of protection or refuge should take shelter in it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6670, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/13\/the-one-who-avoids-fitnah-trials-is-better-than-one-who-rushes-into-them\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Rather, we must be patient, resist calls for violence, and avoid getting involved in these conflicts. If we are patient, it will not be long before Allah will give us a way out. But if we call for violence, then Allah will heap more violence upon us.<\/p>\n<p>Hasan Al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ النَّاسَ إِذَا ابْتُلُوا مِنْ قِبَلِ سُلْطَانِهِمْ صَبَرُوا مَا لَبِثُوا أَنْ يُفْرَجَ عَنْهُمْ وَلَكِنَّهُمْ يَجْزَعُونَ إِلَى السَّيْفِ فَيُوَكَّلُونَ إِلَيْهِ فَوَاللَّهِ مَا جَاءُوا بِيَوْمِ خَيْرٍ قَطُّ<\/p>\n<p>If the people had patience when they are being tested by their unjust ruler, it will not be long before Allah will give them a way out. However, they always rush to their swords, so they are left with their swords. By Allah, not even for a single day did they bring about any good.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/hassan-al-basri-people-who-rush-to-their-swords-are-left-with-their-swords\/\">al-Ṭabaqāt al-Kubrá 8789<\/a><\/p><\/blockquote>\n<p>Satan intends to use the alluring call of the Kharijites as a means to drag us into the Hellfire. We have to resist them by upholding the true teachings of Islam: mercy with the creation, patience with hardship, justice with our enemies. The Kharijites intend to impress us by their outward displays of faith, but inwardly they have no faith. Only by understanding true Islam in both its inward and outward teachings can we protect ourselves, our children, and our communities from their dangerous ideology.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;They will pass through the religion as an arrow pierces its target&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[12,18,19,133,20,21,99,88,135,95,37,151,90,47,48,120,51,207,54,55,56,58,60,62,196,45,64,68,296,121,98],"class_list":["post-15801","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-ali-ibn-abi-talib","tag-community-jamaah","tag-consultation-shura","tag-covenants","tag-creation-al-khalq","tag-creed-aqidah","tag-excommunication-takfir","tag-pilgrimage-hajj","tag-hellfire-jahannam","tag-hypocrisy-al-nifaq","tag-idolatry-shirk","tag-ignorance-al-jahl","tag-innovation-bidah","tag-jihad","tag-justice-adl","tag-rebels-khawarij","tag-leadership-imamate","tag-mecca-makkah","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-patience-al-sabr","tag-prayer-salat","tag-prophetic-biography-sirah","tag-prophetic-virtues","tag-quran-exegesis-tafsir","tag-reform-islah","tag-satan-al-shaytan","tag-sharia","tag-terrorism-al-irhab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-46R","jetpack-related-posts":[{"id":16006,"url":"https:\/\/www.abuaminaelias.com\/prophet-accept-severed-heads\/","url_meta":{"origin":15801,"position":0},"title":"Did the Prophet accept presentation of severed heads?","author":"Abu Amina Elias","date":"August 19, 2014","format":false,"excerpt":"\"A severed head was never presented to the Messenger of Allah.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17935,"url":"https:\/\/www.abuaminaelias.com\/the-muslims-will-split-into-seventy-three-sects\/","url_meta":{"origin":15801,"position":1},"title":"Muslims will split into seventy three sects","author":"Abu Amina Elias","date":"March 27, 2016","format":false,"excerpt":"\"Indeed, this splitting has happened due to the presence of aggression and hatred.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16046,"url":"https:\/\/www.abuaminaelias.com\/hadith-black-flags-al-mahdi\/","url_meta":{"origin":15801,"position":2},"title":"Are hadith of the black flags of al-Mahdi authentic?","author":"Abu Amina Elias","date":"October 2, 2014","format":false,"excerpt":"\"Muslim groups must be judged by their actions, not their flags.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16830,"url":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","url_meta":{"origin":15801,"position":3},"title":"Definition of faith in Islam","author":"Abu Amina Elias","date":"August 16, 2015","format":false,"excerpt":"\"Faith is to believe in Allah, His angels, His books...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15973,"url":"https:\/\/www.abuaminaelias.com\/jihad-sixth-pillar-of-islam\/","url_meta":{"origin":15801,"position":4},"title":"Jihad is the sixth pillar of Islam?","author":"Abu Amina Elias","date":"August 2, 2014","format":false,"excerpt":"\"Islam is built upon five pillars...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16910,"url":"https:\/\/www.abuaminaelias.com\/helping-refugees-and-emigrants-in-islam\/","url_meta":{"origin":15801,"position":5},"title":"Helping refugees and emigrants in Islam","author":"Abu Amina Elias","date":"August 26, 2015","format":false,"excerpt":"\"Whoever helps ease someone in difficulty, Allah will make it easy for him in this world and in the Hereafter.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15801","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15801"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15801\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}