{"id":15863,"date":"2014-07-19T02:52:13","date_gmt":"2014-07-18T22:52:13","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15863"},"modified":"2021-05-03T12:47:00","modified_gmt":"2021-05-03T08:47:00","slug":"blessings-night-of-decree-laylat-al-qadr","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/blessings-night-of-decree-laylat-al-qadr\/","title":{"rendered":"Blessings of the Night of Decree, Laylat al-Qadr"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Allah Almighty has blessed each of us with the opportunity to earn tremendous rewards, forgiveness, and salvation on a special night during the last ten nights of Ramadan. Worship during the Night of Decree is better than a thousand months of worship; it was also the night on which the Quran was revealed.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ<\/p>\n<p><strong>Verily, We sent the Quran down during the Night of Decree. And what will make you know what is the Night of Decree? The Night of Decree is better than a thousand months. The angels and the Spirit descend therein by permission of their Lord for every matter. Peace it is, until the appearance of dawn.<\/strong><\/p>\n<p>Surat al-Qadr 97:1-5<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّا أَنزَلْنَاهُ فِي لَيْلَةٍ مُّبَارَكَةٍ إِنَّا كُنَّا مُنذِرِينَ فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ أَمْرًا مِّنْ عِندِنَا<\/p>\n<p><strong>Verily, We sent it down during a blessed night. Verily, We send warning. On that night every wise command is made distinct, a command from Us. <\/strong><\/p>\n<p>Surat al-Dukhān 44:3-6<\/p><\/blockquote>\n<p>This special night that is better than a thousand months of worship occurs during one of the odd nights among the last ten nights of Ramadan. Keep in mind that an odd night on the Islamic calendar occurs after the Mahgrib prayer on an even numbered day, unlike the Gregorian calendar which turns over at midnight. Ask your local Islamic authorities for the exact dates in your region if you are unsure.<\/p>\n<p>During this time, the Prophet (ṣ) would seek seclusion inside the mosque (<em>al-i’tikaf<\/em>) to concentrate on prayer, recitation of the Quran, and worship, if possible. One should not leave the mosque except for essential and unavoidable tasks. This practice is highly recommended, but not obligatory.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, would seek seclusion in the mosque during the last ten nights of Ramadan and he would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ<\/p>\n<p><strong>Search for the Night of Decree during the last ten nights of Ramadan.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2020, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْوِتْرِ مِنْ الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ<\/p>\n<p><strong>Search for the Night of Decree in the odd nights among the last ten nights of Ramadan.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2017, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/14\/last-ten-nights-ramadan\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam Al-Shafi’i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ أَرَادَ الِاقْتِدَاءَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاعْتِكَافِ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فَيَنْبَغِي أَنْ يَدْخُلَ الْمَسْجِدَ قَبْلَ غُرُوبِ الشَّمْسِ لَيْلَةَ الْحَادِي وَالْعِشْرِينَ مِنْهُ<\/p>\n<p>Whoever desires to follow the example of the Prophet, peace and blessings be upon him, in practicing spiritual retreat in the mosque during the last ten nights of Ramadan, he should enter the mosque before the setting of the sun on the twenty-first night.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhdhab 6\/475<\/p><\/blockquote>\n<p>We do not know the specific date when the Night of Decree will occur because the exact night changes from year to year, according to a sound scholarly opinion. The knowledge of its date was taken away when some Muslims spoiled their fast by arguing in from of the Prophet (ṣ). Therefore, we should strive in worship during all of the ten nights as much as we can, with special emphasis on the odd nights beginning with the 21st.<\/p>\n<p>‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, came out to inform people about the Night of Decree in Ramadan, but two Muslim men were insulting each other. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي خَرَجْتُ لِأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ وَإِنَّهُ تَلَاحَى فُلَانٌ وَفُلَانٌ فَرُفِعَتْ وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ الْتَمِسُوهَا فِي السَّبْعِ وَالتِّسْعِ وَالْخَمْسِ<\/p>\n<p><strong>Verily, I have come out to tell you about the Night of Decree, but two men were insulting each other. Thus, its knowledge was removed and perhaps it is better for you. Look for it during the seventh, ninth, or fifth night of the last ten nights.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 49, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/ramadan-knowledge-night-decree\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Qilabah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْلَةُ الْقَدْرِ تَنْتَقِلُ فِي الْعَشْرِ الأَوَاخِرِ<\/p>\n<p>The Night of Decree moves each year during the last ten nights of Ramadan.<\/p>\n<p>Source: Sunan al-Tirmidhī 792<\/p><\/blockquote>\n<p>Ibn Kathir commented on this statement, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا الَّذِي حَكَاهُ عَنْ أَبِي قِلَابَةَ نَصَّ عَلَيْهِ مَالِكٌ وَالثَّوْرِيُّ وَأَحْمَدُ بْنُ حَنْبَلٍ وَإِسْحَاقُ بْنُ رَاهَوَيْهِ وَأَبُو ثَوْرٍ وَالْمُزَنِيُّ وَأَبُو بَكْرِ بْنُ خُزَيْمَةَ وَغَيْرُهُمْ وَهُوَ مَحْكِيٌّ عَنِ الشَّافِعِيِّ نَقَلَهُ الْقَاضِي عَنْهُ وَهُوَ الْأَشْبَهُ وَاللَّهُ أَعْلَمُ<\/p>\n<p>This view narrated from Abu Qilabah has also been recorded by Malik, Al-Thawri, Ahmad ibn Hanbal, Ishaq ibn Rahuwayh, Abu Thawr, Al-Muzani, Abu Bakr ibn Khuzaymah, and others. It has been related from Al-Shafi’i and Al-Qadi reported it from him. This is most likely the case. Allah knows best.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 97:1<\/p><\/blockquote>\n<p>In any case, the Prophet (ṣ) would exert himself in worship during the entire ten nights and likewise encourage his family to spend their nights in praying, reciting the Quran, and remembering Allah. They would strive in worship during these ten nights more so than any other time of the year.<\/p>\n<p>Aisha, may Allah be pleased with her, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْعَشْرُ شَدَّ مِئْزَرَهُ وَأَحْيَا لَيْلَهُ وَأَيْقَظَ أَهْلَهُ<\/p>\n<p>When the last ten days of Ramadan arrived, the Prophet, peace and blessings be upon him, would tighten his belt, spend the night in worship, and awaken his family.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2024, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/07\/worship-jihad-ten-nights-ramadan\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, Aisha said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيْرِهِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would exert himself in worship during the last ten nights more than at any other time.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1175, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Even if we have missed some nights, or are sick,  or find it otherwise difficult to complete ten days, then we should still do our best to strive in the last seven nights.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ يَعْنِي لَيْلَةَ الْقَدْرِ فَإِنْ ضَعُفَ أَحَدُكُمْ أَوْ عَجَزَ فَلَا يُغْلَبَنَّ عَلَى السَّبْعِ الْبَوَاقِي<\/p>\n<p><strong>Look for the Night of Decree in the last ten nights of Ramadan, but if one of you is weak or frustrated then do not be overcome during the remaining seven nights.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1165, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/07\/laylat-al-qadar-seven-nights\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>We have to remember what an incredible chance this night is to receive invaluable blessings. Allah has promised us through His Messenger (ṣ) that if we sincerely fast the entire month of Ramadan, and if we stand in prayer during the Night of Decree in particular, He will forgive all of our previous minor sins that do not require specific repentance.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ<\/p>\n<p><strong>Whoever stands in prayer during the Night of Decree due to faith and seeking reward, his previous sins will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1901, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/18\/fasting-praying-ramadan\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Prophet (ṣ) recommended that we say a special supplication for forgiveness and pardon during these nights. In this supplication, we ask Allah by His beautiful attributes of forgiveness and generosity to forgive all of our sins.<\/p>\n<p>Aisha reported: I said, “O Messenger of Allah, I see that you know which night is the Night of Decree. What should I say during it?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُولِي اللَّهُمَّ إِنَّكَ عُفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي<\/p>\n<p><strong>Say: O Allah, You are pardoning. You love to forgive, so forgive me.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3513, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/07\/12\/laylat-al-qadr-supplication-ramadan\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>We should do everything we can to make the most of this once-in-a-lifetime chance to get closer to Allah. Whoever misses this magnificent opportunity has truly deprived himself of goodness, so perform as much worship as you reasonably can in these last ten nights.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ مَنْ حُرِمَ خَيْرَهَا قَدْ حُرِمَ<\/p>\n<p><strong>Allah has made a night in Ramadan that is better than a thousand months, so whoever is deprived of it is truly deprived.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7148, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/24\/ramadan-blessed-mercy\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَرَغِمَ أَنْفُ رَجُلٍ دَخَلَ عَلَيْهِ رَمَضَانُ ثُمَّ انْسَلَخَ قَبْلَ أَنْ يُغْفَرَ لَهُ<\/p>\n<p><b>May he be humbled, who enters the month of Ramadan and it passes before he is forgiven.<\/b><\/p>\n<p>Source: Sunan al-Tirmidhī 3545, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/bless-prophet-ramadan-parents\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In sum, we must strive in worship, prayer, recitation of the Quran, and remembrance of Allah during the last ten nights of Ramadan, with a special emphasis on the odd nights beginning with the 21st. It is a blessed time to encourage our families and all Muslims to take part in this effort, as it will lead to the forgiveness of Allah and ultimately to Paradise in the Hereafter.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The Night of Decree is better than a thousand months.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[324,18,24,85,26,114,41,100,54,56,315,59,45,306,66,179],"class_list":["post-15863","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-blessings-al-barakah","tag-community-jamaah","tag-family-ties-sillat-rahim","tag-fasting-al-siyam","tag-forgiveness-al-maghfirah","tag-generosity-al-karam","tag-imam-al-shafii","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-night-of-decree-laylat-al-qadr","tag-peace","tag-quran-exegesis-tafsir","tag-ramadan","tag-remembrance-dhikr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-47R","jetpack-related-posts":[{"id":14052,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-night-of-decree-during-ramadan-laylat-al-qadr\/","url_meta":{"origin":15863,"position":0},"title":"Imam al-Nawawi on Night of Decree in Ramadan, Laylat al-Qadr","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Night of Decree is better than a thousand months.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13859,"url":"https:\/\/www.abuaminaelias.com\/blessings-of-the-month-of-ramadan\/","url_meta":{"origin":15863,"position":1},"title":"Blessings of the month of Ramadan","author":"Abu Amina Elias","date":"June 29, 2013","format":false,"excerpt":"\"Whoever fasts the month of Ramadan...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21843,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-fasting-in-ramadan\/","url_meta":{"origin":15863,"position":2},"title":"Imam al-Mundhiri on Fasting in Ramadan","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Allah has people He redeems in every day and night of Ramadan.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23006,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-ramadan\/","url_meta":{"origin":15863,"position":3},"title":"Forty Hadith on Ramadan","author":"Abu Amina Elias","date":"April 19, 2021","format":false,"excerpt":"\"The gates of the heaven are opened, the gates of Hellfire are closed,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14045,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-fasting-ramadan\/","url_meta":{"origin":15863,"position":4},"title":"Imam al-Nawawi on Fasting in Ramadan","author":"Abu Amina Elias","date":"July 13, 2013","format":false,"excerpt":"\"O you who have faith, decreed upon you is fasting,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16602,"url":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","url_meta":{"origin":15863,"position":5},"title":"Worship in the middle night of Sha’ban","author":"Abu Amina Elias","date":"April 23, 2015","format":false,"excerpt":"\"There is a proof for it, so it cannot be rejected.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15863","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15863"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15863\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15863"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15863"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15863"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}