{"id":15955,"date":"2014-08-01T18:44:59","date_gmt":"2014-08-01T14:44:59","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15955"},"modified":"2018-03-21T11:51:34","modified_gmt":"2018-03-21T07:51:34","slug":"islam-reason-and-spiritual-freedom","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/islam-reason-and-spiritual-freedom\/","title":{"rendered":"Islam, reason, and spiritual freedom"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The conflict in the human soul is a battle between the forces of reason and the forces of desire. Reason calls us to follow our nature and to control our desires for the sake of the greater good, whereas desire calls us to seek immediate pleasure despite the unfortunate consequences it may entail.<\/p>\n<p>Every human being was born with an innate nature (<em>fitrah<\/em>) that inclines us toward the purpose for which we were created. The faculty of reason helps us identity the divine intention behind our design and it directs us to act accordingly.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ<\/p>\n<p><strong>So direct your face toward the religion, inclining to truth. Adhere to the nature of Allah upon which He has created all people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.<\/strong><\/p>\n<p>Surah Ar-Rum 30:30<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ<\/p>\n<p><strong>No one is born except they are upon natural instinct.<\/strong><\/p>\n<p>Source: Sahih Muslim 2658, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/03\/hadith-on-fitrah-every-child-is-born-upon-al-fitrah-monotheistic-instinct\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Our nature is something we inherit, not something we can change or manipulate. Reason observes the patterns of nature, sometimes called “natural law,” and leads us to conclusions that are best for us as individuals and society: restriction of sexual intercourse to marriage, avoidance of harmful addictions and behaviors, encouragement of selfless charity, and adherence to law and order.<\/p>\n<p>In fact, it is reason itself, our ability to control our desires and impulses, which separates human beings from the animals.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ أَفَأَنتَ تَكُونُ عَلَيْهِ وَكِيلًا أَمْ تَحْسَبُ أَنَّ أَكْثَرَهُمْ يَسْمَعُونَ أَوْ يَعْقِلُونَ ۚ إِنْ هُمْ إِلَّا كَالْأَنْعَامِ ۖ بَلْ هُمْ أَضَلُّ سَبِيلًا<\/p>\n<p><strong>Have you seen the one who takes his own desire as his god? Then would you be responsible for him? Or do you think that most of them hear or reason? They are not but like cattle. Rather, they are even further astray from the right path.<\/strong><\/p>\n<p>Surah Al-Furqan 25:43-44<\/p><\/blockquote>\n<p>When people follow their desires instead of their reason, they become like animals who live only to eat, drink, and seek pleasure, without any transcendent purpose in life.<\/p>\n<p>Ibn Al-Jawzi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنما فضل الآدمي على الحيوان البهيمي بالعقل الذي أمر بكف الهوى فإذا لم يقبل قوله وحكم الهوى كان الحيوان البهيمي أعذر من الآدمي<\/p>\n<p>Indeed, humans are only favored over beastly animals by their minds which order them to restrain their desires. If one does not accept its suggestion and instead follows the judgment of his desires, the beastly animals will have more of an excuse than him.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-al-jawzi-on-conflict-between-reason-and-desires\/\">At-Tibb Ar-Ruhani 7<\/a><\/p><\/blockquote>\n<p>True freedom, then, is spiritual in nature. An authentic and fully developed personality is one that can master his soul and prevent himself from following his lowly desires. Notwithstanding worldly aspects of freedom, such as freedom from slavery, the freedom professed by Islam must include freedom of the soul from being controlled by our desires.<\/p>\n<p>Ibn Al-Jawzi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">واعلم أن الانسان إذا وافق هواه وإن لم يضره وجد من نفسه ذلاً لمكان أنه مغلوب وإذا قهر هواه وجد في نفسه عزاً لأجل أنه غالب ثم أنت ترى الناس إذا شاهدوا زاهداً تعجبوا منه وقبلوا يده وما ذاك إلا لأنه قوي على ترك ما ضعفوا عنه من مخالفة الهوى<\/p>\n<p>Know that when a human acts in accordance with his desire, he will find himself in disgrace and humiliation even if this desire does not harm him, for he has been defeated by his desire. When he overcomes his desire, he will find honor and pride in himself as he has been victorious. For this reason, when people see an ascetic they become amazed by him and they would kiss his hand out of respect because they consider him to be a person who is strong enough to abandon that over which they were weak, and that is disobeying his desire.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-al-jawzi-on-conflict-between-reason-and-desires\/\">At-Tibb Ar-Ruhani 10<\/a><\/p><\/blockquote>\n<p>In contrast, a competing vision understands freedom in the opposite sense. Freedom, in this view, is the ability of a person to fulfill their desires without restraint from traditional moral and religious convictions, but rather self-indulgence should be maximized as much as possible. There is no such thing as human nature or absolute truth, for humans can be molded into any form we wish. An authentic personality is one that can be “true to who they are” or do as they want even if it contradicts time-tested values. This view of freedom is, in fact, a form of spiritual slavery.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعِسَ عَبْدُ الدِّينَارِ وَالدِّرْهَمِ وَالْقَطِيفَةِ وَالْخَمِيصَةِ إِنْ أُعْطِيَ رَضِيَ، وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ<\/p>\n<p><strong>Wretched is the slave of gold, silver, fine clothes, and garments. If he is given he is pleased, but if he is not given he is displeased.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6071, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/11\/26\/wretched-is-the-slave-of-money-and-wealth\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>A person who is only concerned about fulfilling their desires will not use reason to identify his nature and purpose in life, but rather will use his reason to rationalize his desires. Such was the view of Scottish philosopher David Hume when he wrote:<\/p>\n<blockquote><p>Reason is, and ought only to be the slave of the passions, and can never pretend to any other office than to serve and obey them.<\/p>\n<p>Source: A Treatise of Human Nature<\/p><\/blockquote>\n<p>Thus, happiness depends solely on the fulfillment of desires and reason is subjugated toward this end. People who practice this philosophy may achieve happiness in the short term, their actions in the long term will lead to despair as they realize their desires can never satisfied.<\/p>\n<p>Anas bin Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ لاِبْنِ آدَمَ وَادِيًا مِنْ ذَهَبٍ أَحَبَّ أَنْ يَكُونَ لَهُ وَادِيَانِ وَلَنْ يَمْلأَ فَاهُ إِلاَّ التُّرَابُ<\/p>\n<p><strong>If the son of Adam had a valley full of gold, he would like to have two valleys for nothing fills his mouth except dust.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6075, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/21\/nothing-can-satisfy-the-greed-of-mankind\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For example, an alcoholic may rationalize his alcoholism by imagining that it makes him happy and fulfills his purpose in life, but eventually he will see its harm in deterioration of the body, clouding of the mind, or worse. The pleasure of alcohol will fade away as his health and intellect degrade.<\/p>\n<p>Likewise, an adulterer may rationalize his promiscuity by imagining that it makes him happy and fulfills his purpose in life, but eventually he will see its harm in the form of disease, emotional turmoil, scandalous exposure, or worse. The pleasure of adultery will fade as his youth and stamina degrade.<\/p>\n<p>The satisfaction of desire will soon pale in comparison to the great void in our soul that comes from neglecting our spiritual purpose. As such, whenever we fall victim to our desires, we must reflect upon the triviality of the pleasure in relation to its sin.<\/p>\n<p>Ibn Al-Jawzi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومما يوضح له الدليل أن يقدر بلوغ غرضه قبل نيله ثم ينظر في حاله بعد انقضاء لذته وما اكتسبه ويزن الالتذاذ بالجناية فيعلم حينئذ أنه قد خسر أضعاف ماربح وقد أنشدو في ذلك كم لذة مستفزة فرحاً قد انجلت عن غموم آفات كم شهوات سلبن صاحبها ثوب الديانات والمروآت<\/p>\n<p>Proof is of the virtue of reason is found when one anticipates what his desire is calling him to before he attains it. Then, he should examine himself after his pleasure has passed and compare his pleasure to the sin he has earned, for he will realize he has lost twice as much as he has gained. As the poet has said: How much satisfaction that provoked happiness, ended by revealing sorrow and sadness? How many desires ripped from their companions, the garments of religion and chivalry?<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-al-jawzi-on-conflict-between-reason-and-desires\/\">At-Tibb Ar-Ruhani 9<\/a><\/p><\/blockquote>\n<p>In reality, the sin of deliberately choosing to indulge desire is nothing less than idol worship, wherein idols of wood and stone have been replaced by idols of ego and lust. He will enjoy his temporal pleasures for a time, but ultimately it will lead to lasting punishment and disgrace in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَّن كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَن نُّرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلَاهَا مَذْمُومًا مَّدْحُورًا<\/p>\n<p><strong>Whoever should desire the immediate life, We will hasten for him from it what We will to whom We intend. Then, We have made for him Hell in which he will enter to burn, censured and banished.<\/strong><\/p>\n<p>Surah Al-Isra 17:18<\/p><\/blockquote>\n<p>Rather, true enlightenment and salvation in this life and in the Hereafter will only come by using our minds to overcome our selfish desires. We must fulfill the purpose for which Allah has created us and seek out the greater good of our existence. In this way, our capacity to reason is like a doctor who sincerely advises his patient of what is in his best interest.<\/p>\n<p>Ibn Al-Jawzi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأما العقل فإنه يراقب العواقب وينظر في المصالح فمثله كمثل الرجل الحازم والطبيب والناصح ومثل الهوى كمثل الصبي الجاهل والمريض الشره فينبغي للبيب إذا اختلف عقله وهواه وقد علم أن العقل عالم ناصح أن يستشيره وأن يصبر على مضض ما يأمر به ويكفيه في إيثار العقل علمه بفضله<\/p>\n<p>As for the mind, it observes the consequences and examines the benefits and its example is that of a resolute man or a sincere doctor. The example of desire is that of an ignorant boy or a gluttonous sick person. Thus, he should know that when his mind and his desires are in disagreement that his mind is a sincere adviser and he should consult it and be patient with what it orders him to do, for knowing the excellence of reason is enough for him to favor it.<\/p>\n<p>Source: At-Tibb Ar-Ruhani 8<\/p><\/blockquote>\n<p>Indeed, Allah has promised those who control themselves and submit to His will instead of their desires will be rewarded with eternal Paradise.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ<\/p>\n<p><strong>As for him who feared to stand before his Lord and he restrained himself from his desires, then Paradise will be his refuge.<\/strong><\/p>\n<p>Surah An-Naziat 79:40<\/p><\/blockquote>\n<p>Therefore, we should not be fooled by some ideologues who repeat slogans of freedom whereas what they truly call to is spiritual slavery. For a person who cannot control himself and his actions is not free, even though he imagines he owns his will, because true spiritual freedom lies in the ability to control our desires in pursuit of enlightenment, self-actualization, and ultimate truth.<\/p>\n<p>We ask Allah to give us the ability to restrain our desires and to willingly submit ourselves to His will.<\/p>\n<p><em>Success comes from Allah, and Allah knows best. <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Indeed, humans are only favored over beastly animals by their minds which order them to restrain their desires.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[127,317,16,17,20,288,132,330,135,32,34,37,50,100,56,134,148,70,267],"class_list":["post-15955","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-adultery-zina","tag-animals","tag-character-akhlaq","tag-charity-al-sadaqah","tag-creation-al-khalq","tag-desires-shahawat","tag-freedom-al-huriyyah","tag-good-will-naseehah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-idolatry-shirk","tag-knowledge","tag-manners-al-adab","tag-monotheism-tawheed","tag-paradise-jannah","tag-reason-al-aql","tag-sincerity-al-ikhlaas","tag-slavery-al-istibad"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-49l","jetpack-related-posts":[{"id":19458,"url":"https:\/\/www.abuaminaelias.com\/meat-would-not-decay-eve-betrayed-her-husband\/","url_meta":{"origin":15955,"position":0},"title":"Meat would not decay? Eve betrayed her husband?","author":"Abu Amina Elias","date":"April 4, 2018","format":false,"excerpt":"\"No soul earns anything but it is upon itself,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22796,"url":"https:\/\/www.abuaminaelias.com\/nur-aql-iman\/","url_meta":{"origin":15955,"position":1},"title":"The Parable of Light, Reason, and Faith","author":"Abu Amina Elias","date":"January 18, 2021","format":false,"excerpt":"\"Light upon light,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17407,"url":"https:\/\/www.abuaminaelias.com\/reason-science-islam\/","url_meta":{"origin":15955,"position":2},"title":"Reason and science in Islam","author":"Abu Amina Elias","date":"December 8, 2015","format":false,"excerpt":"\"The foundation of a man is his intellect,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23744,"url":"https:\/\/www.abuaminaelias.com\/guiding-romantic-desire\/","url_meta":{"origin":15955,"position":3},"title":"Guiding Romantic Desire: Wisdom in the Sexual Ethics of Islam","author":"Abu Amina Elias","date":"December 15, 2021","format":false,"excerpt":"\"This paper discusses traditional sexual ethics in Islam...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16260,"url":"https:\/\/www.abuaminaelias.com\/jihad-against-the-soul-in-islam\/","url_meta":{"origin":15955,"position":4},"title":"Jihad against the soul in Islam","author":"Abu Amina Elias","date":"January 27, 2015","format":false,"excerpt":"\"He has succeeded who purifies the soul,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15209,"url":"https:\/\/www.abuaminaelias.com\/beware-of-satan-and-the-idol-of-desire\/","url_meta":{"origin":15955,"position":5},"title":"Beware of the satanic idol of desire","author":"Abu Amina Elias","date":"January 11, 2014","format":false,"excerpt":"\"Have you seen the one who takes his own desire as his god? Then would you be responsible for him?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15955","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15955"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15955\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15955"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15955"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15955"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}