{"id":15973,"date":"2014-08-02T19:02:56","date_gmt":"2014-08-02T15:02:56","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=15973"},"modified":"2020-07-18T08:48:24","modified_gmt":"2020-07-18T04:48:24","slug":"jihad-sixth-pillar-of-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/jihad-sixth-pillar-of-islam\/","title":{"rendered":"Jihad is the sixth pillar of Islam?"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>It is well-known that there are five pillars of Islam and jihad is not one of them. Rather, jihad is the peak of Islam. Some scholars have designated jihad as the sixth pillar of Islam, but there is no evidence to support this opinion.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ عَلَى أَنْ يُعْبَدَ اللَّهُ وَيُكْفَرَ بِمَا دُونَهُ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَحَجِّ الْبَيْتِ وَصَوْمِ رَمَضَانَ<\/p>\n<p><strong>Islam is built upon five: to worship Allah and to disbelieve in what is worshiped besides him, to establish prayer, to give charity, to perform Hajj pilgrimage to the House, and to fast the month of Ramadan.<\/strong><\/p>\n<p>Source: Sahih Bukhari 8, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/17\/hadith-on-islam-islam-is-built-upon-the-five-pillars-of-monotheism-prayer-charity-fasting-and-pilgrimage\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Rajab comments on this narration, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمَقْصُودُ تَمْثِيلُ الْإِسْلَامِ بِبُنْيَانِهِ وَدَعَائِمُ الْبُنْيَانِ هَذِهِ الْخَمْسُ فَلَا يَثْبُتُ الْبُنْيَانُ بِدُونِهَا وَبَقِيَّةُ خِصَالِ الْإِسْلَامِ كَتَتِمَّةِ الْبُنْيَانِ فَإِذَا فُقِدَ مِنْهَا شَيْءٌ نَقَصَ الْبُنْيَانُ وَهُوَ قَائِمٌ لَا يَنْتَقِضُ بِنَقْصِ ذَلِكَ بِخِلَافِ نَقْضِ هَذِهِ الدَّعَائِمِ الْخَمْسِ فَإِنَّ الْإِسْلَامَ يَزُولُ بِفَقْدِهَا جَمِيعًا بِغَيْرِ إِشْكَالٍ<\/p>\n<p>The meaning of this tradition is to provide the parable of Islam as a building supported upon these five, such that the building cannot stand firm without them. The rest of the attributes of Islam are added to the building to make it complete. If any of them are missing the building will stand although lacking and it will not fall into ruin due to that shortcoming, as opposed to if it lacks any of the five supports, for without a doubt Islam will disappear if all of them are missing.<\/p>\n<p>Source: Jami’ Al-Ulum wal Hikam 3<\/p><\/blockquote>\n<p>The Prophet likened Islam to a building which is supported by its five pillars: faith, prayer, charity, fasting, and the Hajj pilgrimage. All other issues in Islam, while important, must be founded upon these five pillars.<\/p>\n<p>In another tradition, the Prophet described jihad as the peak of Islam, or the highest part of its building.<\/p>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأْسُ الْأَمْرِ الْإِسْلَامُ وَعَمُودُهُ الصَّلَاةُ وَذِرْوَةُ سَنَامِهِ الْجِهَادُ<\/p>\n<p><strong>The head of the matter is Islam, its pillar is the prayer, and jihad is its peak.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2616, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/20\/hadith-on-islam-the-head-of-the-matter-is-islam-its-pillar-is-prayer-its-peak-is-jihad-and-all-this-is-achieved-by-guarding-the-tongue-from-sin\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Rajab comments on this narration, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعْلَى شَيْءٍ فِيهِ وَلَكِنَّهُ لَيْسَ مِنْ دَعَائِمِهِ وَأَرْكَانِهِ الَّتِي بُنِيَ عَلَيْهَا وَذَلِكَ لِوَجْهَيْنِ أَحَدُهُمَا أَنَّ الْجِهَادَ فَرْضُ كِفَايَةٍ عِنْدَ جُمْهُورِ الْعُلَمَاءِ لَيْسَ بِفَرْضِ عَيْنٍ بِخِلَافِ هَذِهِ الْأَرْكَانِ وَالثَّانِي أَنَّ الْجِهَادَ لَا يَسْتَمِرُّ فِعْلُهُ إِلَى آخِرِ الدَّهْرِ بَلْ إِذَا نَزَلَ عِيسَى عَلَيْهِ السَّلَامُ وَلَمْ يَبْقَ حِينَئِذٍ مِلَّةٌ غَيْرُ مِلَّةِ الْإِسْلَامِ فَحِينَئِذٍ تَضَعُ الْحَرْبُ أَوْزَارَهَا وَيَسْتَغْنِي عَنِ الْجِهَادِ بِخِلَافِ هَذِهِ الْأَرْكَانِ فَإِنَّهَا وَاجِبَةٌ عَلَى الْمُؤْمِنِينَ إِلَى أَنْ يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ عَلَى ذَلِكَ وَاللَّهُ أَعْلَمُ<\/p>\n<p>The peak is the highest part of the building, but it is not one of its supports or pillars upon which it is built. That is for two reasons. First, jihad is a collective obligation (<em>fard al-kifayah<\/em>) according to the majority of scholars and, unlike the pillars, it is not an individual obligation. Second, jihad will not continue until the end of time. On the contrary, when Jesus, peace be upon him, arrives and there is no longer any other religion besides Islam at that time, then war will lay down its burden and there will be no need for jihad, unlike these pillars which are obligatory upon the believers until the command of Allah is given and they are still in that state. Allah knows best.<\/p>\n<p>Source: Jami’ Al-Ulum wal Hikam 3<\/p><\/blockquote>\n<p>Jihad in the sense of armed struggle is not described as a pillar of Islam because, in general, it is a communal obligation and not an individual obligation like prayer or charity. If enough people participate in the armed defense of the nation and meet its security needs, then everyone else is not obligated to participate. Armed struggle only becomes an individual obligation on those capable of assisting the oppressed during a serious crisis.<\/p>\n<p>For this reason, the Prophet refused to allow a young man to join the expedition. Rather, he commanded him to go back to his parents and strive in their service.<\/p>\n<p>Abdullah ibn Amr reported: A man came to the Prophet, peace and blessings be upon him, asking permission to strive in jihad. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَيٌّ وَالِدَاكَ<\/p>\n<p><strong>Are your parents alive?<\/strong><\/p><\/blockquote>\n<p>The man said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَفِيهِمَا فَجَاهِدْ<\/p>\n<p><strong>Then strive in their service.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2842, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/08\/31\/taking-care-of-parents-is-a-jihad-more-important-than-fighting-on-the-battlefield\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This tradition, and many others like it, further demonstrate that jihad as a struggle for a good cause can take various forms besides armed struggle.<\/p>\n<p>In addition, the authentic traditions clarify that the Prophet did not make armed struggle a general obligation upon all Muslims.<\/p>\n<p>Abu Huraira reported: A bedouin came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, show me a deed by which I may enter Paradise.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ الْمَكْتُوبَةَ وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ وَتَصُومُ رَمَضَانَ<\/p>\n<p><strong>Worship Allah and never associate anything with Him, establish the prescribed prayers, give the obligatory charity, and fast of the month of Ramadan.<\/strong><\/p><\/blockquote>\n<p>The man said, “By Him in whose hand is my soul, I will never add anything to it, nor will I lessen anything from it.” When the man turned his back, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا<\/p>\n<p><strong>He who is pleased to see a man from the people of Paradise should look to him.<\/strong><\/p>\n<p>Source: Sahih Muslim 14, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/01\/27\/the-essentials-of-salvation-are-the-pillars-of-islam\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ آمَنَ بِاللَّهِ وَبِرَسُولِهِ وَأَقَامَ الصَّلَاةَ وَصَامَ رَمَضَانَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ جَاهَدَ فِي سَبِيلِ اللَّهِ أَوْ جَلَسَ فِي أَرْضِهِ الَّتِي وُلِدَ فِيهَا<\/p>\n<p><strong>Whoever believes in Allah and His Messenger, establishes prayer, and fasts the month of Ramadan will have a right upon Allah that he will be entered into Paradise whether he strives in the cause of Allah or remains in the land in which he was born.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2637, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/09\/hadith-on-jihad-whoever-has-faith-prays-and-fasts-will-enter-paradise-whether-he-fights-in-jihad-or-not\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Furthermore, it must be understand that soldiers participating in the defense of the nation must be educated about the pillars of Islam and their objectives (<em>maqasid ash-sharia<\/em>). Allah commands the believers to have scholars remain behind and not participate in the armed struggle, so that they can educate the soldiers when they return.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا كَانَ الْمُؤْمِنُونَ لِيَنفِرُوا كَافَّةً ۚ فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَائِفَةٌ لِّيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ<\/p>\n<p><strong>It is not for the believers to go forth in battle all at once. For there should separate from every division of them a group remaining to obtain understanding in the religion and warn their people when they return to them that they might be cautious.<\/strong><\/p>\n<p>Surah At-Tawba 9:122<\/p><\/blockquote>\n<p>An ignorant army is dangerous for Islam and Muslims because they are more likely to transgress the limits of Islam, violate the rules of war, and subvert its objectives. The heretical jihad of the Kharijites is a clear example of the dangers of ignorance and extremism, for they fight in the name of Islam while they undermine Islam from within.<\/p>\n<p>Therefore, jihad as armed struggle is important for the defense of the Muslim community but it is not a pillar of the religion. Muslims must become educated and proficient in the five pillars of Islam before concentrating on other aspects of the religion. We should warn those who stubbornly insist that jihad is the sixth pillar of Islam that their statement contradicts the authentic Prophetic tradition.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Islam is built upon five pillars&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[17,18,85,88,32,90,138,47,48,120,50,55,93,134,306,296,121],"class_list":["post-15973","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-charity-al-sadaqah","tag-community-jamaah","tag-fasting-al-siyam","tag-pilgrimage-hajj","tag-hereafter-akhirah","tag-innovation-bidah","tag-jesus-isa","tag-jihad","tag-justice-adl","tag-rebels-khawarij","tag-knowledge","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-paradise-jannah","tag-ramadan","tag-sharia","tag-terrorism-al-irhab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-49D","jetpack-related-posts":[{"id":13203,"url":"https:\/\/www.abuaminaelias.com\/comprehensive-meaning-jihad\/","url_meta":{"origin":15973,"position":0},"title":"Comprehensive meaning of jihad in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Mujahid wages jihad against himself.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16260,"url":"https:\/\/www.abuaminaelias.com\/jihad-against-the-soul-in-islam\/","url_meta":{"origin":15973,"position":1},"title":"Jihad against the soul in Islam","author":"Abu Amina Elias","date":"January 27, 2015","format":false,"excerpt":"\"He has succeeded who purifies the soul,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17171,"url":"https:\/\/www.abuaminaelias.com\/purpose-armed-jihad-islam\/","url_meta":{"origin":15973,"position":2},"title":"Purpose of armed jihad in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"He who fights to make the word of Allah highest...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25452,"url":"https:\/\/www.abuaminaelias.com\/jihad-war-peace-in-islam\/","url_meta":{"origin":15973,"position":3},"title":"Jihad, War, and Peace in Islam","author":"Abu Amina Elias","date":"June 26, 2025","format":false,"excerpt":"\"The one who strives in jihad is the one who strives against himself.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":15973,"position":4},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":15973,"position":5},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15973","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=15973"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/15973\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=15973"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=15973"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=15973"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}