{"id":16057,"date":"2014-11-04T20:57:24","date_gmt":"2014-11-04T16:57:24","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16057"},"modified":"2018-03-25T16:02:53","modified_gmt":"2018-03-25T12:02:53","slug":"dangers-of-takfir-declaring-muslims-to-be-apostates","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/dangers-of-takfir-declaring-muslims-to-be-apostates\/","title":{"rendered":"Dangers of takfir, declaring Muslims to be apostates"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>One of the worst crimes against Islam and the Muslim community is the practice of excommunication (<em>takfir<\/em> or <em>takfeer<\/em>) which is to declare a practicing Muslim to be an unbeliever. There is a unanimous consensus among the classical scholars that the Quran, the Sunnah, and the righteous predecessors prohibit Muslims from charging each other with unbelief.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَلْمِزُوا أَنفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ<\/p>\n<p><strong>Do not insult one another and do not call each other by offensive names.<\/strong><\/p>\n<p>Surat Al-Hujurat 49:11<\/p><\/blockquote>\n<p>Ibn Abdul Barr comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ قَالَ جَمَاعَةٌ مِنْ أَهْلِ الْعِلْمِ هُوَ قَوْلُ الرَّجُلِ لِأَخِيهِ يَا كَافِرُ يَا فَاسِقُ<\/p>\n<p>A group of scholars have said that offensive names are a man calling his brother an unbeliever or a wicked sinner.<\/p>\n<p>Source: al-Tamhīd 17\/21<\/p><\/blockquote>\n<p>In several traditions, the Prophet and his companions warned us about the severity of charging a Muslim with unbelief or apostasy.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّمَا امْرِئٍ قَالَ لِأَخِيهِ يَا كَافِرُ فَقَدْ بَاءَ بِهَا أَحَدُهُمَا إِنْ كَانَ كَمَا قَالَ وَإِلَّا رَجَعَتْ عَلَيْهِ<\/p>\n<p style=\"text-align: left;\"><strong style=\"line-height: 1.5;\">When a man calls his brother an unbeliever, it returns at least to one of them. <strong>Either the accused is as claimed, or the charge will return against the accuser<\/strong>.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5753, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/19\/wrongfully-labeling-someone-a-disbeliever-turns-one-into-a-disbeliever\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا قَالَ الرَّجُلُ لِأَخِيهِ يَا كَافِرُ فَقَدْ بَاءَ بِهِ أَحَدُهُمَا<\/p>\n<p><strong>When a man says to his brother: O disbeliever! Then it will return to at least one of them.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5752, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/04\/hadith-on-excommunication-when-a-person-calls-his-brother-an-unbeliever-it-returns-to-at-least-one-of-them\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَرْمِي رَجُلٌ رَجُلًا بِالْفُسُوقِ وَلَا يَرْمِيهِ بِالْكُفْرِ إِلَّا ارْتَدَّتْ عَلَيْهِ إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ<\/p>\n<p><strong>A man does not accuse another man of wickedness or unbelief except that it will return against him if his companion is innocent.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5698, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/05\/hadith-on-excommunication-an-accusation-of-sinfulness-or-disbelief-against-an-innocent-person-will-be-returned-against-the-accuser\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Qais reported: Ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا قَالَ الرَّجُلُ لِصَاحِبِهِ‏ أَنْتَ عَدُوِّي فَقَدْ خَرَجَ أَحَدُهُمَا مِنَ الإِسْلاَمِ أَوْ بَرِئ مِنْ صَاحِبِهِ‏<\/p>\n<p>When a man says to his companion: You are my enemy! Then at least one of them has left Islam or his companion is innocent.<\/p>\n<p>Source: al-Adab al-Mufrad 421, Grade: <strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/02\/ibn-masud-on-excommunication-when-a-man-calls-his-companion-an-enemy-then-at-least-one-of-them-has-left-islam\/\"><em>Sahih<\/em><\/a><\/strong><\/p><\/blockquote>\n<p>Abu Sufyan reported: I said to Jabir ibn Abdullah, “Did you used to declare anyone who prays facing Mecca (qiblah) to be an unbeliever?” Jabir said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا<\/p>\n<p>No.<\/p><\/blockquote>\n<p>I said, “Did you declare them to be idolaters?” Jabir said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُعَاذَ اللَّهِ<\/p>\n<p>I seek refuge in Allah.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/01\/27\/jabir-on-takfir-i-seek-refuge-in-allah-from-accusing-a-muslim-of-unbelief\/\">al-Muʻjam al-Awsaṭ 7548<\/a><\/p><\/blockquote>\n<p>Ibn Abdul Barr comments on all of these traditions, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْقُرْآنُ وَالسُّنَّةُ يَنْهَيَانِ عَنْ تَفْسِيقِ الْمُسْلِمِ وَتَكْفِيرِهِ بِبَيَانٍ لَا إِشْكَالَ فِيهِ<\/p>\n<p>The Quran and Sunnah both clearly prohibit a Muslim from being accused of wickedness or unbelief. There is no doubt about it.<\/p>\n<p>Source: al-Tamhīd 17\/21<\/p><\/blockquote>\n<p>Thus, a Muslim who wrongfully accuses another Muslim of unbelief and apostasy will himself carry the heavy burden of unbelief on the Day of Resurrection.<\/p>\n<p>The issue of excommunication is not merely a theoretical or abstract matter, but rather it is used by criminals to justify violence.<\/p>\n<p>It is well known that the life of a Muslim is sacred and must be safeguarded in all respects.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ دَمُهُ وَمَالُهُ وَعِرْضُهُ<\/p>\n<p><strong>All of the Muslim is sacred to another Muslim: his life, his wealth, and his honor.<\/strong><\/p>\n<p>Source: Sahih Muslim 2564, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/10\/07\/taqwa-mindfulness-of-allah-is-in-the-heart-it-protects-the-believer-from-envy-hatred-and-discord\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Whoever unjustly kills a single believer on purpose will enter Hellfire and reside there forever.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَن يَقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا وَغَضِبَ اللَّهُ عَلَيْهِ وَلَعَنَهُ وَأَعَدَّ لَهُ عَذَابًا عَظِيمًا<\/p>\n<p><strong>Whoever kills a believer intentionally, his recompense is Hell wherein he will abide eternally and Allah has become angry with him and has cursed him and has prepared for him a great punishment.<\/strong><\/p>\n<p>Surat An-Nisa 4:93<\/p><\/blockquote>\n<p>Similarly, the lives of all peaceful non-Muslims are protected and whoever kills one of them wrongfully will never enter Paradise.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ نَفْسًا مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا يُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا<\/p>\n<p><strong>Whoever kills a person protected by a treaty will never smell the fragrance of Paradise. Verily, its fragrance can be found a distance of forty years of travel.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6516, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/11\/whoever-breaks-a-peace-treaty-will-not-even-smell-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>To bypass these clear prohibitions, the criminal excommunicators (<em>takfirists<\/em>) within the Muslim community have developed a theory and ideology of excommunication. The original heresy was innovated by the <a href=\"https:\/\/abuaminaelias.com\/dangers-of-the-khawarij-ideology-of-violence\/\">Kharijite sect<\/a> and their misguidance continues today in the form of militant terrorism.<\/p>\n<p>In reality, those who declare Muslims to be unbelievers and justify violence against them are closer to idolatry than the people they accuse.<\/p>\n<p>Hudhaifa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مَا أَتَخَوَّفُ عَلَيْكُمْ رَجُلٌ قَرَأَ الْقُرْآنَ حَتَّى رُئِيَتْ بَهْجَتُهُ عَلَيْهِ وَكَانَ رِدْئًا لِلإِسْلامِ غَيَّرَهُ إِلَى مَا شَاءَ الِلَّهِ فَانْسَلَخَ مِنْهُ وَنَبَذَهُ وَرَاءَ ظَهْرِهِ وَسَعَى عَلَى جَارِهِ بِالسَّيْفِ وَرَمَاهُ بِالشِّرْكِ<\/p>\n<p><strong>Verily, I fear for you that a man will recite the Quran until his delight is seen and he is wicked for Islam and he changes to whatever Allah wills for him, such that it is stripped from him and he throws it behind his back, assaulting his neighbor with the sword and accusing him of idolatry.<\/strong><\/p><\/blockquote>\n<p>I said, “O Prophet of Allah, which one is closer to idolatry? The accused or the accuser?”<\/p>\n<p>The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلِ الرَّامِي<\/p>\n<p><strong>Rather it is the accuser.<\/strong><\/p>\n<p>Source: Sahih Ibn Hibban 81, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/10\/02\/hadith-on-takfeer-the-accuser-is-closer-to-unbelief-than-the-accused\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Allah knows that some Muslims will accuse others of unbelief and reject their peace offerings only because they want to plunder their wealth. Therefore, Allah has forbidden this in the strongest terms.<\/p>\n<p>Ibn Abbas reported: A man passed by a group of companions of the Messenger of Allah, peace and blessings be upon him, and he had with him some sheep. The man greeted them with peace and they said, “He only offered peace to protect himself.” So they attacked him, killed him, and took his sheep. They went to the Prophet and Allah the Exalted revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمْ السَّلَامَ لَسْتَ مُؤْمِنًا<\/p>\n<p><strong>O you who believe, when you go forth in the cause of Allah, do not say to whoever greets you with peace that you are not a believer.<\/strong> (4:94)<\/p>\n<p>Source: Sunan At-Tirmidhi 3030, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/11\/04\/hadith-on-peace-obligation-to-accept-peace-offerings-at-face-value\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The excommunicators merely use the charge of unbelief as an excuse to murder and plunder their innocent victims. Rather, the truth in Islam is that the killing of a single Muslim believer is a greater evil than the freeing of a thousand apostates.<\/p>\n<p>Al-Ghazali said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ اسْتِبَاحَةَ دِمَاءِ الْمُصَلِّينَ الْمُقِرِّينَ بِالتَّوْحِيدِ خَطَأٌ وَالْخَطَأُ فِي تَرْكِ أَلْفِ كَافِرٍ فِي الْحَيَاةِ أَهْوَنُ مِنَ الْخَطَإِ فِي سَفْكِ دَمٍ لِمُسْلِمٍ وَاحِدٍ<\/p>\n<p>Verily, to permit the killing of someone worshiping upon monotheism is a serious mistake. The mistake of leaving a thousand unbelievers to go free is lesser than shedding the blood of a single Muslim.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/12\/28\/al-ghazali-on-takfeer-leaving-a-thousand-unbelievers-is-better-than-killing-a-single-believer\/\">Fath ul-Bari 12\/314<\/a><\/p><\/blockquote>\n<p>This is the case of the wrongful killing of a single Muslim believer accused of apostasy. How much greater, then, is the case of those who declare whole cities, countries, and societies full of Muslims to be unbelievers? Indeed, it is an incredibly disturbing phenomena we are witnessing that an entire country and all of its Muslim citizens are declared to be apostates and heinous violence is justified against them.<\/p>\n<p>The caution we must have in this matter becomes all the more clear when we understand the important distinction between <em>acts of unbelief<\/em> and <em>unbelievers themselves<\/em>. A Muslim might commit an outward act of unbelief due to ignorance or misinterpretation, yet Allah considers them to be believers. This is proven in the following tradition:<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَسْرَفَ رَجُلٌ عَلَى نَفْسِهِ فَلَمَّا حَضَرَهُ الْمَوْتُ أَوْصَى بَنِيهِ فَقَالَ إِذَا أَنَا مُتُّ فَأَحْرِقُونِي ثُمَّ اسْحَقُونِي ثُمَّ اذْرُونِي فِي الرِّيحِ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ عَلَىَّ رَبِّي لَيُعَذِّبُنِي عَذَابًا مَا عَذَّبَهُ بِهِ أَحَدًا قَالَ فَفَعَلُوا ذَلِكَ بِهِ فَقَالَ لِلأَرْضِ أَدِّي مَا أَخَذْتِ فَإِذَا هُوَ قَائِمٌ فَقَالَ لَهُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ فَقَالَ خَشْيَتُكَ يَا رَبِّ أَوْ قَالَ مَخَافَتُكَ فَغَفَرَ لَهُ بِذَلِكَ<\/p>\n<p><strong>A man had indulged himself in sin, so when death approached he enjoined his sons saying: If I die, then burn me, pulverize me, and scatter me to the winds over the sea, for by Allah, if He is able He will punish me in a way he has not punished anyone else. So they did that to him, and when he stood before his Lord, He said to him: What made you do that? The man said: Fear and awe of You, O Lord. So Allah forgave him because of that.<\/strong><\/p>\n<p>Source: Sahih Muslim 2756, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/01\/hadith-on-repentance-the-man-whom-allah-forgave-because-of-his-god-fearing-deed-despite-his-error-in-belief\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This man did not believe that Allah had the power to resurrect and judge him, a clear act of unbelief according to the consensus of Muslim scholars. Yet, Allah pardoned this act of unbelief due to man’s honest ignorance. The man’s righteous fear of Allah, based upon his faith, outweighed his act of unbelief.<\/p>\n<p>Ibn Taymiyyah comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَغَفَرَ لَهُ فَهَذَا رَجُلٌ شَكَّ فِي قُدْرَةِ اللَّهِ وَفِي إعَادَتِهِ إذَا ذُرِّيَ بَلْ اعْتَقَدَ أَنَّهُ لَا يُعَادُ وَهَذَا كُفْرٌ بِاتِّفَاقِ الْمُسْلِمِينَ لَكِنْ كَانَ جَاهِلًا لَا يَعْلَمُ ذَلِكَ وَكَانَ مُؤْمِنًا يَخَافُ اللَّهَ أَنْ يُعَاقِبَهُ فَغَفَرَ لَهُ بِذَلِكَ<\/p>\n<p>So Allah forgave him. This man doubted the ability of Allah to resurrect him when he was turned to dust. Rather, he believed Allah could not resurrect him and this is unbelief by the consensus of the Muslims but he was ignorant. He did not know that and he was a believer who feared that Allah would punish Him and so Allah forgave him for that.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-taymiyyah-does-an-act-of-disbelief-always-necessitate-absolute-disbelief-kufr-al-akbar\/\">Majmu’ Al-Fatawa 3\/231<\/a><\/p><\/blockquote>\n<p>Likewise, Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا جَحْدُ ذَلِكَ جَهْلًا أَوْ تَأْوِيلًا يُعْذَرُ فِيهِ صَاحِبُهُ فَلَا يُكَفَّرُ صَاحِبُهُ بِهِ كَحَدِيثِ الَّذِي جَحَدَ قُدْرَةَ اللَّهِ عَلَيْهِ وَأَمَرَ أَهْلَهُ أَنْ يَحْرِقُوهُ وَيَذْرُوهُ فِي الرِّيحِ وَمَعَ هَذَا فَقَدْ غَفَرَ اللَّهُ لَهُ وَرَحِمَهُ لِجَهْلِهِ إِذْ كَانَ ذَلِكَ الَّذِي فَعَلَهُ مَبْلَغَ عِلْمِهِ وَلَمْ يَجْحَدْ قُدْرَةَ اللَّهِ عَلَى إِعَادَتِهِ عِنَادًا أَوْ تَكْذِيبًا<\/p>\n<p>If one of these matters of faith is denied out of ignorance or misinterpretation, then he is excused and the one who did so does not become an unbeliever, as in the narration in which the man denied the power of Allah and he commanded his people to burn him and scatter his ashes in the wind. Despite this error, Allah forgave the man and had mercy upon him because of his ignorance. The knowledge about the power of Allah that had reached him was not denied out of stubbornness or an intention to lie.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-al-qayyim-on-unbelief-a-muslim-who-denies-faith-out-of-ignorance-or-misinterpretation-is-not-an-unbeliever\/\">Madarij As-Salikeen 1\/347<\/a><\/p><\/blockquote>\n<p>Hence, we must not declare an individual Muslim to be an unbeliever due to an act of unbelief, let alone an entire Muslim society. A Muslim can only be considered an unbeliever when they declare themselves to be such. Their declarations of faith should be taken at face value and their lives protected by due process of law.<\/p>\n<p>At-Tahawi writes in his important work on Sunni creed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يَخْرُجُ الْعَبْدُ مِنَ الْإِيمَانِ إِلَّا بِجُحُودِ مَا أَدْخَلَهُ فِيهِ<\/p>\n<p>A person does not leave faith except by disavowing what brought him into it.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/aqeedah-of-imam-tahawi\/\">Aqeedah At-Tahawi<\/a><\/p><\/blockquote>\n<p>Furthermore, Ash-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعلم أن الحكم على الرجل المسلم بخروجه من دين الإسلام ودخوله في الكفر لا ينبغي لمسلم يؤمن بالله واليوم الآخر أن يقدم عليه إلا ببرهان أوضح من شمس النهار<\/p>\n<p>Know that with regard to the ruling upon a Muslim man for leaving Islam and entering into unbelief, it is not befitting for a Muslim who believes in Allah and the Last Day to apply it unless with a proof that is clearer than the light of day.<\/p>\n<p>Source: Sayl Al-Jirar 1\/978<\/p><\/blockquote>\n<p>As such, it was the practice of the righteous predecessors (<em>salaf as-salih<\/em>) to refrain from excommunicating the heretics who opposed them, as it is the right of Allah alone to determine that a Muslim has become an unbeliever.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فلهذا كان أهل العلم والسنة لا يكفرون من خالفهم وإن كان ذلك المخالف يكفرهم لأن الكفر حكم شرعي فليس للإنسان أن يعاقب بمثله كمن كذب عليك وزنى بأهلك ليس لك أن تكذب عليه وتزني بأهله لأن الكذب والزنا حرام لحق الله تعالى وكذلك التكفير حق لله فلا يكفر إلا من كفره الله ورسوله<\/p>\n<p>The scholars and people of the Sunnah would not excommunicate those who opposed them even if their opponents declared them to be unbelievers, for the matter of unbelief is a legal judgment and a person may not punish with the like of it, such as if someone lies against you or commits adultery with your family it would not be permissible for you to lie against him or commit adultery with his family. Fornication and falsehood are unlawful by the right of Allah. Likewise, excommunication is the right of Allah, so we do not excommunicate anyone except those whom Allah and His Messenger have declared to be unbelievers.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/08\/05\/ibn-taymiyyah-on-takfeer-the-scholars-would-not-excommunicate-those-who-excommunicated-them\/\">Ar-Radd ‘ala Al-Bakri 1\/381<\/a><\/p><\/blockquote>\n<p>Perhaps our greatest example in this respect is the distinguished Imam Ahmad ibn Hanbal who stood strong against the persecution of the Mu’tazilites. The extremist Mu’tazilite sect fabricated their doctrine of the “creation of the Quran” and they were charging with unbelief and oppressing anyone who publicly disagreed with them. Imam Ahmad was taken prisoner by them and brutally flogged, yet he refrained from excommunicating them, cursing them, or calling for violent rebellion. Instead, Imam Ahmad understood that they were confused by misinterpretations and he prayed for Allah to forgive them.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْإِمَامُ أَحْمَد رَحِمَهُ اللَّهُ تَعَالَى تَرَحَّمَ عَلَيْهِمْ وَاسْتَغْفَرَ لَهُمْ لِعِلْمِهِ بِأَنَّهُمْ لِمَنْ يُبَيِّنُ لَهُمْ أَنَّهُمْ مُكَذِّبُونَ لِلرَّسُولِ وَلَا جَاحِدُونَ لِمَا جَاءَ بِهِ وَلَكِنْ تَأَوَّلُوا فَأَخْطَئُوا وَقَلَّدُوا مَنْ قَالَ لَهُمْ ذَلِكَ<\/p>\n<p>Imam Ahmad, may Allah be pleased with him, prayed for mercy and forgiveness for his persecutors because he knew it was not clear to them that they were denying the Messenger and disputing what he had brought. Rather, they had a misinterpretation and they were mistaken and imitated those who told them that.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/patience-of-ahmad-ibn-hanbal-when-persecuted-by-the-caliph\/\">Majmu’ Al-Fatawa 23\/349<\/a><\/p><\/blockquote>\n<p>Such is the excellent example of the patience, forbearance, and mercy of Imam Ahmad in stark contrast to the violent rebels and excommunicators.<\/p>\n<p>Following in the footsteps of Imam Ahmad was Ibn Taymiyyah who also took a strong stance against excommunication.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا مَعَ أَنِّي دَائِمًا وَمَنْ جَالَسَنِي يَعْلَمُ ذَلِكَ مِنِّي أَنِّي مِنْ أَعْظَمِ النَّاسِ نَهْيًا عَنْ أَنْ يُنْسَبَ مُعَيَّنٌ إلَى تَكْفِيرٍ وَتَفْسِيقٍ وَمَعْصِيَةٍ إلَّا إذَا عُلِمَ أَنَّهُ قَدْ قَامَتْ عَلَيْهِ الْحُجَّةُ الرسالية الَّتِي مَنْ خَالَفَهَا كَانَ كَافِرًا تَارَةً وَفَاسِقًا أُخْرَى وَعَاصِيًا أُخْرَى وَإِنِّي أُقَرِّرُ أَنَّ اللَّهَ قَدْ غَفَرَ لِهَذِهِ الْأُمَّةِ خَطَأَهَا وَذَلِكَ يَعُمُّ الْخَطَأَ فِي الْمَسَائِلِ الْخَبَرِيَّةِ الْقَوْلِيَّةِ وَالْمَسَائِلِ الْعَمَلِيَّةِ وَمَا زَالَ السَّلَفُ يَتَنَازَعُونَ فِي كَثِيرٍ مِنْ هَذِهِ الْمَسَائِلِ وَلَمْ يَشْهَدْ أَحَدٌ مِنْهُمْ عَلَى أَحَدٍ لَا بِكُفْرِ وَلَا بِفِسْقِ وَلَا مَعْصِيَةٍ<\/p>\n<p>Those who always sit with me know that I am the strongest of the people to forbid declaring an individual to be an unbeliever or a sinner, unless it is known that the legal proof has been established against him that he is an unbeliever or a sinner. I affirm that Allah will forgive this nation for its mistakes, whether it is mistakes in narrating or practice. The righteous predecessors continued to debate many of these matters and none of them testified that another among them was an unbeliever or a sinner.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/08\/04\/ibn-taymiyyah-on-takfeer-i-am-the-strongest-of-people-to-forbid-excommunication\/\">Majmu’ al-Fatawa 3\/229<\/a><\/p><\/blockquote>\n<p>Indeed, despite the persecution he endured at the hands of opposing scholars, Ibn Taymiyyah vowed never to excommunicate a single Muslim.<\/p>\n<p>Adh-Dhahabi reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><span style=\"line-height: 1.5;\">كَانَ شَيْخُنَا ابْنُ تَيْمِيَّةَ فِي أَوَاخِرِ أَيَّامِهِ يَقُولُ أَنَا لَا أُكَفِّرُ أَحَدًا مِنَ الْأُمَّةِ<\/span><\/p>\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5;\">Our Sheikh, Ibn Taymiyyah, said near the end of his life: I will not declare anyone from this nation to be an unbeliever.<\/span><\/p>\n<p>Source: Siyar Aʻlām al-Nubalāʼ 15\/88<\/p><\/blockquote>\n<p>In the same manner, we must take a principled stance against excommunication and those who use illegitimate violence against the Muslim community. We must be clear that declarations of faith and the offering of peace by anyone must be taken at face value and that such peace offerings immediately invalidate violent action.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;I will not declare anyone from this nation to be an unbeliever.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[18,183,99,25,26,27,135,37,38,39,90,47,120,54,55,56,134,58,59,121,98],"class_list":["post-16057","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-excommunication-takfir","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-god-fearing-taqwa","tag-hellfire-jahannam","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-innovation-bidah","tag-jihad","tag-rebels-khawarij","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-paradise-jannah","tag-patience-al-sabr","tag-peace","tag-terrorism-al-irhab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4aZ","jetpack-related-posts":[{"id":20443,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-accusing-kufr-takfir\/","url_meta":{"origin":16057,"position":0},"title":"Imam al-Mundhiri on Accusing Believers of Unbelief, Takfir","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Accusing a believer of unbelief is like killing him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16316,"url":"https:\/\/www.abuaminaelias.com\/required-muslims-one-ruler\/","url_meta":{"origin":16057,"position":1},"title":"Muslims must only have one ruler?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not be among those who commit idolatry...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16057,"position":2},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25737,"url":"https:\/\/www.abuaminaelias.com\/qadiyani-ahmadiyyah-are-they-muslims\/","url_meta":{"origin":16057,"position":3},"title":"The Qadiyani Sect: Are they Muslims?","author":"Abu Amina Elias","date":"July 24, 2025","format":false,"excerpt":"\"Invite to the Way of your Lord with wisdom and kind advice,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17452,"url":"https:\/\/www.abuaminaelias.com\/congratulating-non-muslims-festivals\/","url_meta":{"origin":16057,"position":4},"title":"Prohibition of congratulating non-Muslims for their festivals","author":"Abu Amina Elias","date":"December 23, 2015","format":false,"excerpt":"\"Harshness is not found in anything except that it disgraces it.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15738,"url":"https:\/\/www.abuaminaelias.com\/muslims-not-punished-for-killing-non-muslims\/","url_meta":{"origin":16057,"position":5},"title":"Muslims not punished for killing non-Muslims?","author":"Abu Amina Elias","date":"May 28, 2014","format":false,"excerpt":"\"The general rule is that all crimes should be prosecuted and punished equally,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16057","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16057"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16057\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16057"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16057"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16057"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}