{"id":16113,"date":"2014-12-01T16:41:36","date_gmt":"2014-12-01T12:41:36","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16113"},"modified":"2018-03-25T16:02:49","modified_gmt":"2018-03-25T12:02:49","slug":"mercy-towards-prisoners-of-war-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/mercy-towards-prisoners-of-war-in-islam\/","title":{"rendered":"Mercy towards prisoners of war in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Islam teaches us to be merciful to the entire creation, even towards those who oppose Islam and worship idols. Islam only allows war in self-defense and to prevent injustice, and one of the unfortunate circumstances of war is that prisoners will be taken from the enemy’s forces. Even so, Islam calls us to treat such prisoners with mercy and dignity.<\/p>\n<p>As a general rule, Allah has commanded the believers to feed prisoners well even to the point of preferring them over our own selves.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُطْعِمُونَ الطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنكُمْ جَزَاءً وَلَا شُكُورًا<\/p>\n<p><strong>They give food in spite of love for it to the needy, the orphan, and the captive, saying: We feed you only for the countenance of Allah. We do not desire from you reward or gratitude.<\/strong><\/p>\n<p>Surat Al-Insan 76:8-9<\/p><\/blockquote>\n<p>Ibn Kathir explained this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ ابْنُ عَبَّاسٍ كَانَ أُسَرَاؤُهُمْ يَوْمَئِذٍ مُشْرِكِينَ وَيَشْهَدُ لِهَذَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَصْحَابَهُ يَوْمَ بَدْرٍ أَنْ يُكْرِمُوا الْأُسَارَى فَكَانُوا يُقَدِّمُونَهُمْ عَلَى أَنْفُسِهِمْ عِنْدَ الْغَدَاءِ وَهَكَذَا قَالَ سَعِيدُ بْنُ جُبَيْرٍ وَعَطَاءٌ وَالْحَسَنُ وَقَتَادَةُ وَقَدْ وَصَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْإِحْسَانِ إِلَى الْأَرِقَّاءِ فِي غَيْرِمَا حَدِيثٍ حَتَّى إِنَّهُ كَانَ آخِرَ مَا أَوْصَى أَنْ جَعَلَ يَقُولُ<strong> الصَّلَاةَ وَمَا مَلَكَتْ أَيْمَانُكُمْ<\/strong><\/p>\n<p>Ibn Abbas said: Their captives on that day were idolaters. The evidence for that is that the Messenger of Allah, peace and blessings be upon him, commanded his companions to be generous to the prisoners on the day of Badr and they would give preference to them in meals over themselves. Such was reported by Sa’eed ibn Jubair, Ata’, Al-Hasan, and Qatadah. The Messenger of Allah had enjoined good treatment towards captives in more than one tradition, so often that one of the last things he said was: <strong>Guard the prayer and those whom your right hand possesses.<\/strong><\/p>\n<p>Source: Tafseer Ibn Kathir 76:8<\/p><\/blockquote>\n<p>Thus, the Prophet attached great importance to the good treatment of prisoners by repeating this command often and making it one of his last instructions.<\/p>\n<p>During the battle of Badr, the Muslims captured a number of enemy fighters from the Quraish tribe and they were treated well, such that some of them eventually embraced Islam.<\/p>\n<p>Abu Aziz ibn Umair reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ فِي الأُسَارَى يَوْمَ بَدْرٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَوْصُوا بِالأُسَارَى خَيْرًا وَكُنْتُ فِي نَفَرٍ مِنَ الأَنْصَارِ وَكَانُوا إِذَا قَدَّمُوا غَدَاءَهُمْ وَعَشَاءَهُمْ أَكَلُوا التَّمْرَ وَأَطْعَمُونِي الْخُبْزَ بِوَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاهُمْ<\/p>\n<p>I was among the prisoners of war on the day of Badr. The Messenger of Allah, peace and blessings be upon him, said, “<strong>I enjoin you to treat the captives well<\/strong>.” After I accepted Islam, I was among the Ansar and when the time of lunch or dinner arrived, I would feed the prisoners dates as I had been fed bread due to the command of the Prophet.<\/p>\n<p>Source: Mu’jam Al-Kabeer 18444, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/09\/07\/hadith-on-prisoners-the-prophet-commands-the-companions-to-treat-prisoners-well\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Such prisoners of war would become slaves, or rather servants, which became the only legal way to acquire slaves in Islam. In contrast, freeing slaves became a great virtue and a means to enter Paradise.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا اقْتَحَمَ الْعَقَبَةَ وَمَا أَدْرَاكَ مَا الْعَقَبَةُ فَكُّ رَقَبَةٍ<\/p>\n<p><strong>But he has not broken through the difficult path, and what will make you know what is the difficult path? It is the freeing of a slave.<\/strong><\/p>\n<p>Surah Al-Balad 90:11-13<\/p><\/blockquote>\n<p>Abu Musa Al-Ashari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَطْعِمُوا الْجَائِعَ وَعُودُوا الْمَرِيضَ وَفُكُّوا الْعَانِيَ<\/p>\n<p><strong>Feed the hungry, visit the sick, and set the captives free.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5058, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/09\/hadith-on-charity-feed-the-hungry-visit-the-sick-and-set-slaves-free\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In addition, the Prophet warned us that evil treatment of slaves is a means to enter Hellfire.<\/p>\n<p>Abu Bakr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ<\/p>\n<p><strong>He will not enter Paradise who is evil to his slaves.<\/strong><\/p>\n<p>Source: Musnad Ahmad 32, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/25\/hadith-on-servants-whoever-is-evil-to-his-servants-will-not-enter-paradise\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>These teachings would eventually lead to the abolition of slavery in Muslim lands.<\/p>\n<p>Therefore, the general attitude of Islam towards prisoners of war is that they should be treated with mercy, dignity, fed and clothed properly, and set free if their freedom would not lead to further insecurity.<\/p>\n<p>Nonetheless, there are times when the demands of justice necessitate an exception to the rule. Such was the case with a few of the prisoners from the battle of Badr.<\/p>\n<p>Umar ibn Al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said to Abu Bakr and Umar on the day of Badr:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَرَوْنَ فِي هَؤُلاَءِ الأُسَارَى<\/p>\n<p><strong>What is your opinion about these captives? <\/strong><\/p><\/blockquote>\n<p>Abu Bakr said, “They are our kith and kin. I think you should release them after getting for a ransom. This will be a source of strength to us against the unbelievers and Allah might guide them to Islam.” Then, the Prophet said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَرَى يَا ابْنَ الْخَطَّابِ<\/p>\n<p><strong>What is your opinion, son of Khattab? <\/strong><\/p><\/blockquote>\n<p>I said, “O Messenger of Allah, I do not hold the same opinion as Abu Bakr. I think you should hand them over to us that we may strike their necks. Hand over Aqeel to Ali that he may strike his neck, and hand over another to me that I may strike his neck. They are leaders of the unbelievers and their veterans.” The Prophet approved the opinion of Abu Bakr and he did not approve what I said.<\/p>\n<p>The next day when I came to the Prophet, I found him and Abu Bakr sitting and weeping. I said, “O Messenger of Allah, why are you and your companion weeping? Tell me for I will weep with you, and if not I will at least feign weeping.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبْكِي لِلَّذِي عَرَضَ عَلَىَّ أَصْحَابُكَ مِنْ أَخْذِهِمُ الْفِدَاءَ لَقَدْ عُرِضَ عَلَىَّ عَذَابُهُمْ أَدْنَى مِنْ هَذِهِ الشَّجَرَةِ<\/p>\n<p><strong>I weep for what has happened to your companions for taking ransom. I was shown the punishment to which they were subjected. It was brought to me as close as this tree.<\/strong><\/p><\/blockquote>\n<p>The Prophet pointed to a tree close to him. Then Allah revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُ أَسْرَىٰ حَتَّىٰ يُثْخِنَ فِي الْأَرْضِ ۚ تُرِيدُونَ عَرَضَ الدُّنْيَا وَاللَّهُ يُرِيدُ الْآخِرَةَ وَاللَّهُ عَزِيزٌ حَكِيمٌ<\/p>\n<p><strong>It is not for a prophet to have captives until he battles strenuously in the land. Some desire the commodities of this world, but Allah desires for you the Hereafter, for Allah is Almighty and Wise.<\/strong> (8:67)<\/p>\n<p>Source: Sahih Muslim 1763, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>We have seen how the Prophet commanded good treatment of prisoners on the day of Badr, but this incident informs us that a few of these prisoners were dangerous criminals who should have been executed as a matter of justice. We can derive the following points from this story:<\/p>\n<p>First, the Prophet preferred the opinion of Abu Bakr which favored pardon and mercy, indicating that this is the general rule in Islam.<\/p>\n<p>Second, the reason these few prisoners should have been executed was as Umar said, “They are the leaders of the unbelievers and their veterans.” These men were leaders of the enemy army and war criminals. Ransoming them at a time when the conflict was at its climax would endanger the Muslim community.<\/p>\n<p>Third, some of the Muslims had a blameworthy intention for ransoming the prisoners in their desire for payment. This demonstrates that it is not permissible to instigate a war for the purpose of acquiring slaves or wealth through ransom and spoils. This is made clear in the following tradition:<\/p>\n<p>Abu Huraira reported: A man said, “O Messenger of Allah, a man intends to fight for the sake of Allah and he is seeking worldly gains.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him.<\/strong><\/p><\/blockquote>\n<p>The people found that very difficult and they said, “Return to the Messenger of Allah, for perhaps he did not understand you.” The man returned and he said, “O Messenger of Allah, a man intends to fight for the sake of Allah and he is seeking worldly gain.” The Messenger of Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him.<\/strong><\/p><\/blockquote>\n<p>Then he returned a third time and the Messenger of Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him.<\/strong><\/p>\n<p>Source: Musnad Ahmad 7840, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/27\/hadith-on-jihad-no-reward-for-one-who-fights-for-spoils-honor-zeal-or-worldly-gains\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Finally, we should understand that this exception only applies to the circumstances in which it was specified and it does not nullify the general rule. Using this story to justify harshness and cruelty towards prisoners in general is not consistent with a totality of the divine revelation.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I enjoin you to treat the captives well.”<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[320,61,17,322,32,246,47,100,54,56,62,45,73],"class_list":["post-16113","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-abu-bakr","tag-call-to-islam-dawah","tag-charity-al-sadaqah","tag-gratitude-al-shukr","tag-hereafter-akhirah","tag-intention-al-niyyah","tag-jihad","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-prophetic-biography-sirah","tag-quran-exegesis-tafsir","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4bT","jetpack-related-posts":[{"id":13389,"url":"https:\/\/www.abuaminaelias.com\/islam-mercy-to-the-worlds\/","url_meta":{"origin":16113,"position":0},"title":"Islam is mercy for all creation, even enemies","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Those who are merciful will be shown mercy by the Merciful.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19476,"url":"https:\/\/www.abuaminaelias.com\/ali-ibn-abi-talib-rape-girl\/","url_meta":{"origin":16113,"position":1},"title":"Did &#8216;Ali ibn Abi Talib rape an underage girl?","author":"Abu Amina Elias","date":"April 16, 2018","format":false,"excerpt":"\"Do not cause harm or return harm.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16113,"position":2},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16544,"url":"https:\/\/www.abuaminaelias.com\/arguing-about-the-religion-in-islam\/","url_meta":{"origin":16113,"position":3},"title":"Arguing about the religion in Islam","author":"Abu Amina Elias","date":"April 11, 2015","format":false,"excerpt":"\"No people go astray after being guided except that they indulge in arguments.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16945,"url":"https:\/\/www.abuaminaelias.com\/understanding-loyalty-and-disavowal-in-islam\/","url_meta":{"origin":16113,"position":4},"title":"Understanding loyalty and disavowal in Islam","author":"Abu Amina Elias","date":"August 31, 2015","format":false,"excerpt":"\"The believing men and believing women are allies of one another.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16482,"url":"https:\/\/www.abuaminaelias.com\/transcendency-of-allah-in-islam\/","url_meta":{"origin":16113,"position":5},"title":"Transcendency of Allah in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Most Merciful is established upon the Throne.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16113","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16113"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16113\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16113"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16113"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16113"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}