{"id":16131,"date":"2014-12-10T15:41:36","date_gmt":"2014-12-10T11:41:36","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16131"},"modified":"2018-10-24T12:32:08","modified_gmt":"2018-10-24T08:32:08","slug":"abrogation-and-specification-in-the-quran","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/abrogation-and-specification-in-the-quran\/","title":{"rendered":"Abrogation and specification in the Quran"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Abrogation of verses is an important concept to understand when studying the Quran, as neglecting this principle might lead to erroneous interpretations. It is a concept also misrepresented by anti-Muslim polemicists and even some Muslims.<\/p>\n<p>The word “abrogation” (<em>naskh<\/em>) in Islamic terminology does not mean a verse of the Quran is cancelled or negated (<em>nafi<\/em>), but rather it means one rule has been replaced by another rule or a general rule has been made specific.<\/p>\n<p>The general concept of abrogation has been established in the Quran, the Sunnah, and the teachings of the righteous predecessors.  It was later developed into a variety of definitions and detailed interpretations by succeeding scholars.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا نَنسَخْ مِنْ آيَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَا أَوْ مِثْلِهَا أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ<\/p>\n<p><strong>We do not abrogate a verse or cause it to be forgotten except that We bring forth one better than it or similar to it. Do you not know that Allah has power over all things?<\/strong><\/p>\n<p>Surat al-Baqarah 2:106<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا بَدَّلْنَا آيَةً مَّكَانَ آيَةٍ وَاللَّهُ أَعْلَمُ بِمَا يُنَزِّلُ قَالُوا إِنَّمَا أَنتَ مُفْتَرٍ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ<\/p>\n<p><strong>When We substitute a verse in place of a verse, and Allah is most knowing of what He sends down, they say: You are but a forger! But most of them do not know.<\/strong><\/p>\n<p>Surat al-Nahl 16:101<\/p><\/blockquote>\n<p>Abrogation in Islam recognizes that one rule might not always be suitable for every situation. Far from Allah changing his mind, abrogation demonstrates the wisdom of Allah in legislating rules for their appropriate time and context. For most rules in Islam, there exist circumstances that warrant an exception to the rule. The righteous predecessors would often use the word abrogation in this sense of specification, exception, or clarification.<\/p>\n<p>Ash-Shatibi reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال مكي وقد ذكر ابْنِ عَبَّاسٍ فِي أَشْيَاءَ كَثِيرَةٍ فِي الْقُرْآنِ فِيهَا حَرْفُ الِاسْتِثْنَاءِ أَنَّهُ قَالَ مَنْسُوخٌ<\/p>\n<p>Makki said: Ibn Abbas mentioned several things within the Quran as exceptions and he would say they are ‘abrogated.’<\/p>\n<p>Source: al-Muwāfaqāt 3\/346<\/p><\/blockquote>\n<p>And As-Sakhawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وتخصيص واستثناء اصطلاح وقع بعد ابن عباس، وكان ابن عباس يسمي ذلك نسخاً<\/p>\n<p>‘Specification’ and ‘exception’ are terms that appeared after Ibn Abbas, and Ibn Abbas referred to those as ‘abrogated.’<\/p>\n<p>Source: Jamāl al-Qurrā’ 1\/337<\/p><\/blockquote>\n<p>And Al-Qurtubi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُتَقَدِّمُونَ يُطْلِقُونَ عَلَى التَّخْصِيصِ نَسْخًا تَوَسُّعًا وَمَجَازًا<\/p>\n<p>The predecessors would refer to specification as ‘abrogation,’ extension and granting permission.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 2:106<\/p><\/blockquote>\n<p>And Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ يَكُونُ مُرَادُهُمْ بِالنَّسْخِ الْبَيَانَ وَالْإِيضَاحَ فَإِنَّ السَّلَفَ كَانُوا يُطْلِقُونَ النَّسْخَ عَلَى مِثْلِ ذَلِكَ كَثِيرًا<\/p>\n<p>Their intended meaning of the word &#8216;abrogation&#8217; is explanation and clarification. Indeed, the righteous predecessors would often use the word abrogation in this way.<\/p>\n<p>Source: Kalimat al-Ikhlāṣ 1\/24<\/p><\/blockquote>\n<p>A good example of this usage is found in the verses revealed about entering uninhabited houses.<\/p>\n<p>At-Tabari reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ ابْنُ عَبَّاسٍ لَا تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ ثُمَّ نَسَخَ وَاسْتَثْنَى فَقَالَ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَدْخُلُوا بُيُوتًا غَيْرَ مَسْكُونَةٍ فِيهَا مَتَاعٌ لَكُمْ<\/p>\n<p>Ibn Abbas said the verse, &#8216;Do not enter houses other than your houses,&#8217; (24:27) was then abrogated and an exception was given by the verse, &#8216;There is no blame upon you for entering houses not inhabited in which there is convenience for you.&#8217; (24:29)<\/p>\n<p>Source: Tafsīr al-Ṭabarī 24:29<\/p><\/blockquote>\n<p>The word “abrogation” has been used here in the sense of specification (<em>takhṣīṣ<\/em>) and exception (<em>istithnā<\/em>). Allah gave a general command not to enter houses without permission but then He made an exception for uninhabited houses. Thus, the first verse is general in meaning and the second verse is specific to a certain situation.<\/p>\n<p>Confusion occurs because the word &#8220;abrogation&#8221; developed a technical meaning later on that was not the same as it was used by the earliest interpreters of the Quran. The righteous predecessors, such as Ibn Abbas and others, would use the term abrogation to mean a number of situations that did not involved the cancellation of previous verses.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْت مُرَادُهُ وَمُرَادُ عَامَّةِ السَّلَفِ بِالنَّاسِخِ وَالْمَنْسُوخِ رَفْعُ الْحُكْمِ بِجُمْلَتِهِ تَارَةً وَهُوَ اصْطِلَاحُ الْمُتَأَخِّرِينَ، وَرَفْعُ دَلَالَةِ الْعَامِّ وَالْمُطْلَقِ وَالظَّاهِرِ وَغَيْرِهَا تَارَةً إمَّا بِتَخْصِيصٍ أَوْ تَقْيِيدٍ أَوْ حَمْلِ مُطْلَقٍ عَلَى مُقَيَّدٍ وَتَفْسِيرِهِ وَتَبْيِينِهِ حَتَّى إنَّهُمْ يُسَمُّونَ الِاسْتِثْنَاءَ وَالشَّرْطَ<\/p>\n<p>I say: The general meaning of the righteous predecessors when using the words ‘abrogating’ and ‘abrogated’ is sometimes the complete removal of the previous ruling – and this is the technical term of the latter generations – or sometimes the removal of the general, absolute, and outward meaning, whether by specification, restriction, interpreting an absolute as limited, or by explanation and clarification. Even they would refer to is as exceptional and conditional.<\/p>\n<p>Source: Iʻlām al-Muwaqqiʻīn 1\/29<\/p><\/blockquote>\n<p>Therefore, when statements are attributed to the companions and the righteous predecessors in which they use the word “abrogation” or its derivatives, we should know that they were using the word in its <em>linguistic meaning<\/em> before its technical meaning and definition had been developed by later scholars. The word abrogation could mean specifying a general rule (<em>takhṣīṣ<\/em>), clarifying a rule (<em>tabyīn<\/em>), explaining a rule (<em>tafsīr<\/em>), restricting a rule (<em>taqyīd<\/em>), making an exception (<em>istithnā<\/em>), or setting a condition (<em>sharṭ<\/em>).<\/p>\n<p>We should be careful not to transpose the later technical meaning onto its earlier usage and thereby distort the context of such statements. This misunderstanding causes many Muslims to claim verses are entirely cancelled when they are not at all.<\/p>\n<p>scholars found ways in which the so-called mansookh verse was still applicable thus removing it from the definition of abrogation &#8211; basically they ended up demonstrating that takhsis and naskh are on a continuum writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِأَنَّ الْقُرْآنَ نَاسِخٌ مُهَيْمِنٌ عَلَى كُلِّ الْكُتُبِ وَلَيْسَ يَأْتِي بَعْدَهُ نَاسِخٌ لَهُ وَمَا فِيهِ مِنْ نَاسِخٍ وَمَنْسُوخٍ فَمَعْلُومٌ وَهُوَ قَلِيلٌ بَيَّنَ اللَّهُ نَاسِخَهُ عِنْدَ مَنْسُوخِهِ &#8230; وَأَمَّا بِالْقُرْآنِ عَلَى مَا ظَنَّهُ كَثِيرٌ مِنَ الْمُفَسِّرِينَ فَلَيْسَ بِنَسْخٍ وَإِنَّمَا هُوَ نَسَأٌ وَتَأْخِيرٌ أَوْ مُجْمَلٌ أُخِّرَ بَيَانُهُ لِوَقْتِ الْحَاجَةِ أَوْ خِطَابٌ قَدْ حَالَ بَيْنَهُ وَبَيْنَ أَوَّلِهِ خِطَابُ غَيْرِهِ أَوْ مَخْصُوصٌ مِنْ عُمُومٍ أَوْ حُكْمٌ عَامٌّ لِخَاصٍّ أَوْ لِمُدَاخَلَةِ مَعْنًى فِي مَعْنًى وَأَنْوَاعُ الْخِطَابِ كَثِيرَةٌ فَظَنُّوا ذَلِكَ نَسْخًا وَلَيْسَ بِهِ وَأَنَّهُ الْكِتَابُ الْمُهَيْمِنُ عَلَى غَيْرِهِ وَهُوَ فِي نَفْسِهِ مُتَعَاضِدٌ<\/p>\n<p><i><span style=\"font-weight: 400;\">The Quran has abrogated and oversees all divine scriptures. There will be nothing after it to abrogate it. What is within it of abrogating and abrogated verses is known to be few and Allah clarifies what is abrogated at the time it is abrogated… As for the Quran, despite the opinion of many commentators, it is not abrogated (by the Sunnah). Indeed, it is only postponed and delayed, or it is held back as vague until it is clarified in a necessary moment, or it is a directive that alters another directive before it, or it specifies the general meaning, or a general ruling has been specified, or one meaning contributes to another. There are many directives of this kind that they imagine are abrogated but it is not so. It is the Book overseeing all other sacred books besides it, and it is internally consistent.<\/span><\/i><\/p>\n<p>Source: al-Burhān 2\/43-44<\/p><\/blockquote>\n<p>And Ibn Aqilah Al-Makki writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عن التخصيص والبيان أقول تسمية هذا النوع نسخاً تجوزاً إذ النسخ رفع الحكم الأول وهذا تخصيص وبيان في آيات الاستثناء المذكورة وإنما سمي نسخاً لكونه رفعاً لعموم الحكم وإلا فليس هو من النسخ الحقيقي<\/p>\n<p>Regarding specification and clarification, I say these names are types of abrogation and granting permission. If abrogation is removal of the original ruling, and this is specification and clarification of the verses offering exceptions, then it is only referred to as ‘abrogation’ as it involves removing the general rule; otherwise, it would not truly be abrogation.<\/p>\n<p>Source: al-Ziyādah wal Iḥsān 5\/298<\/p><\/blockquote>\n<p>The technical meaning of abrogation differs in the scholarly literature and there is not an agreed upon definition for what exactly constitutes abrogation. For this reason, scholars greatly differed in the number of verses they considered to be abrogated, such as Ibn Hazim who considered as many as two hundred verses to be abrogated, As-Suyuti who considered twenty verses to be abrogated, or Shah Waliullah who considered only five verses to be truly abrogated.<\/p>\n<p>Nevertheless, the concept is valid and essential for interpreting the Quran, even though scholars tend to disagree on its exact definition and details. The classic example of abrogation in the Quran is the gradual prohibition of alcohol.<\/p>\n<p>First, Allah discouraged the believers from drinking alcohol by highlighting its negative effects. Although people earned some benefit from alcohol through trade and entertainment, it was made clear that the harm in it is greater than its benefit.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَا أَكْبَرُ مِن نَّفْعِهِمَا<\/p>\n<p><strong>They ask you about wine and gambling. Say: In them is great sin and some benefit for people, but their sin is greater than their benefit.<\/strong><\/p>\n<p>Surat al-Baqarah 2:219<\/p><\/blockquote>\n<p>Ibn Kathir comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِهَذَا كَانَتْ هَذِهِ الْآيَةُ مُمَهِّدَةً لِتَحْرِيمِ الْخَمْرِ عَلَى الْبَتَاتِ وَلَمْ تَكُنْ مُصَرِّحَةً بَلْ مُعَرِّضَةً<\/p>\n<p>This verse prepared the way for prohibiting wine gradually, as it did not do so explicitly but rather by implication.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 2:219<\/p><\/blockquote>\n<p>Then, Allah prohibited the believers from approaching prayer while in a state of drunkenness.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنتُمْ سُكَارَىٰ حَتَّىٰ تَعْلَمُوا مَا تَقُولُونَ<\/p>\n<p><strong>O you who believe, do not approach prayer while you are intoxicated until you know what you are saying.<\/strong><\/p>\n<p>Surat al-Nisa 4:43<\/p><\/blockquote>\n<p>Finally, Allah prohibited alcohol completely once the people were ready for it.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْأَنصَابُ وَالْأَزْلَامُ رِجْسٌ مِّنْ عَمَلِ الشَّيْطَانِ فَاجْتَنِبُوهُ لَعَلَّكُمْ تُفْلِحُونَ<\/p>\n<p><strong>O you who believe, wine, gambling, sacrificing on stone alters, and divining arrows are but defilement from the work of Satan, so avoid them that you may be successful.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:90<\/p><\/blockquote>\n<p>Thus, the prohibition of alcohol came gradually over time. It is important to understand this progression so that we do not misinterpret the previous verses to think that alcohol is merely discouraged.<\/p>\n<p>The wisdom behind the gradual prohibition was that Arab society in the beginning was not ready to abandon drinking alcohol. They needed to strengthen their faith in order to overcome their desire to drink.<\/p>\n<p>Aisha, may Allah be pleased with her, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَوْ نَزَلَ أَوَّلَ شَيْءٍ لَا تَشْرَبُوا الْخَمْرَ لَقَالُوا لَا نَدَعُ الْخَمْرَ أَبَدًا وَلَوْ نَزَلَ لَا تَزْنُوا لَقَالُوا لَا نَدَعُ الزِّنَا أَبَدًا<\/p>\n<p>If the first verse to be revealed was to not drink wine, they would have said we will never stop drinking. And if it had been revealed to not commit adultery, they would have said we will never stop committing adultery.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4707, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/09\/hadith-on-revelation-the-quran-was-revealed-gradually-by-the-wisdom-of-allah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Even though the prohibition of alcohol is the general rule, the previous verses that allowed it have not been cancelled in the sense that they are without a wise lesson. They teach us that individuals and society must gradually wean themselves off alcohol addiction. In fact, we know from modern medical studies that it can be very dangerous for an advanced alcoholic to suddenly stop drinking.<\/p>\n<p>According to WedMD:<\/p>\n<blockquote><p>Alcohol withdrawal syndrome is a potentially life-threatening condition that can occur in people who have been drinking heavily for weeks, months, or years and then either stop or significantly reduce their alcohol consumption… Severe alcohol withdrawal symptoms are a medical emergency. If seizures, fever, severe confusion, hallucinations, or irregular heartbeats occur, either take the patient to an emergency room or call 911.<\/p>\n<p>Source: <a href=\"http:\/\/www.webmd.com\/mental-health\/addiction\/alcohol-withdrawal-symptoms-treatments\">WebMD<\/a><\/p><\/blockquote>\n<p>Indeed, ignoring the wisdom of gradually reducing alcohol consumption could have devastating effects not only for the individual but also for society at large. The prohibition movement in America, which sought to criminalize alcohol consumption, failed disastrously because it came too suddenly upon an entrenched drinking culture.<\/p>\n<p>The 18<sup>th<\/sup> constitutional amendment was ratified in 1920 and it prohibited the manufacture, transportation, and sale of alcohol. This led to the rise of black market alcohol sales which strengthened organized crime and facilitated a catastrophic crime spree. The congress was eventually forced to repeal the 18<sup>th<\/sup> amendment due to this widespread unintended harm.<\/p>\n<p>Hence, from such experiences we can appreciate the wisdom of the Quran’s gradual approach and we see clearly that, although the ruling of some verses was replaced, their lessons were not annulled.<\/p>\n<p>In summary, abrogation is an important principle for understanding the Quran. It is often misrepresented by anti-Muslim writers and even some Muslims as a complete negation or annulment of verses, although the reality is that it involves the ability to distinguish which verses are general, specific, or restricted in Islam.<\/p>\n<p>When interpreting the Quran, we must be careful not to take isolated verses out of context. The phenomenon of abrogation requires us to compile all the verses and traditions on a given subject and to refer to their scholarly commentaries before issuing a judgment from the Quran and Sunnah.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Further Reading<\/strong><\/span><\/p>\n<p>Qadhi, A. A. Y. (1999). <em>An introduction to the sciences of the Quran<\/em>. Birmingham, UK: Al-Hidaayah Pub.<\/p>\n<p>Fatoohi, L. (2012). <em>Abrogation in the Quran and Islamic law: A critical study of the concept of &#8220;naskh&#8221; and its impact<\/em>. New York: Routledge.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;If the first verse to be revealed was not to drink wine, they would have said we will never stop drinking.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[18,55,62,103,45,91,68],"class_list":["post-16131","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-community-jamaah","tag-methodology-al-minhaj","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-righteous-predecessors-al-salaf-al-salih","tag-satan-al-shaytan"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4cb","jetpack-related-posts":[{"id":21204,"url":"https:\/\/www.abuaminaelias.com\/textual-corruption-of-surat-al-asr\/","url_meta":{"origin":16131,"position":0},"title":"Textual corruption of Surat al-‘Asr?","author":"Abu Amina Elias","date":"September 18, 2019","format":false,"excerpt":"\"By the time and calamities of age!\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14934,"url":"https:\/\/www.abuaminaelias.com\/bismillah-missing-surah-at-tawbah\/","url_meta":{"origin":16131,"position":1},"title":"Why is Bismillah missing from Surah al-Tawbah?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Al-Anfal was among the first to be revealed in Medina...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18681,"url":"https:\/\/www.abuaminaelias.com\/was-the-stoning-verse-abrogated\/","url_meta":{"origin":16131,"position":2},"title":"Is the stoning verse missing from the Quran?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The ruling of the verse of stoning is affirmed and its recitation is abrogated.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13539,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-reading-the-quran\/","url_meta":{"origin":16131,"position":3},"title":"Imam al-Nawawi on Reading and Reciting the Quran","author":"Abu Amina Elias","date":"May 16, 2013","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25259,"url":"https:\/\/www.abuaminaelias.com\/how-to-enjoy-your-worship-of-allah\/","url_meta":{"origin":16131,"position":4},"title":"How to enjoy your worship of Allah","author":"Abu Amina Elias","date":"May 1, 2025","format":false,"excerpt":"\"I suffered with prayer for twenty years, then I enjoyed it for twenty years.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17977,"url":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","url_meta":{"origin":16131,"position":5},"title":"Good character before learning Islamic sciences","author":"Abu Amina Elias","date":"April 5, 2016","format":false,"excerpt":"\"What I learned from Malik's manners was better than his knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16131","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16131"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16131\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16131"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16131"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}