{"id":16173,"date":"2016-07-04T10:49:19","date_gmt":"2016-07-04T06:49:19","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16173"},"modified":"2025-07-04T11:01:50","modified_gmt":"2025-07-04T07:01:50","slug":"islam-between-blasphemy-extremism","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/islam-between-blasphemy-extremism\/","title":{"rendered":"Islam between blasphemy and extremism"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Blasphemy is a very controversial topic in Islam that has taken on new importance due to the proliferation of instant global communication. Muslim extremists incorrectly cite a precedent in classical Islamic law to justify gross acts of vigilante violence and murder. Therefore, it is important for us to understand the context of the classical ruling and to view this issue in the larger perspective of the Quran and Sunnah as a consistent whole.<\/p>\n<p>The general answer to blasphemy (<em>sabb ala Allah wa rasulihi<\/em>) as commanded in the Quran is to respond with patience, beautiful preaching, and graceful avoidance. The Quran records the fact that the Prophet (ṣ) was called a “sorcerer,” a “madman,” and a “liar,” yet Allah commanded him to be patient and to increase his acts of worship.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا<\/p>\n<p><strong>Be patient over what they say and avoid them with gracious avoidance.<\/strong><\/p>\n<p>Surat al-Muzzamil 73:10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ<\/p>\n<p><strong>So be patient over what they say and exalt with the praises of your Lord before the rising of the sun and before its setting.<\/strong><\/p>\n<p>Surat Qaf 50:39<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا<\/p>\n<p><strong>So be patient over what they say and exalt with the praises of your Lord before the rising of the sun and before its setting.<\/strong><\/p>\n<p>Surat Ta Ha 20:130<\/p><\/blockquote>\n<p>These insults deeply hurt the feelings of the Prophet (ṣ) and his companions, but Allah did not prescribe revenge for them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ السَّاجِدِينَ<\/p>\n<p><strong>We already know that your heart is constrained by what they say, so glorify the praises of your Lord and be among those who prostrate.<\/strong><\/p>\n<p>Surat al-Hijr 15:97-98<\/p><\/blockquote>\n<p>In fact, Allah told the Prophet (ṣ) and his companions to expect more insults and mockery from the followers of other religions, and that they should remain patient and not let their abuse shake their faith.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَتُبْلَوُنَّ فِي أَمْوَالِكُمْ وَأَنفُسِكُمْ وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذًى كَثِيرًا ۚ وَإِن تَصْبِرُوا وَتَتَّقُوا فَإِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><strong>You will surely be tested in your possessions and in yourselves, and you will surely hear from those who were given the Scripture before you and from those who associate others with Allah much abuse. But if you are patient and fear Allah, that is of the matters requiring resolve.<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:186<\/p><\/blockquote>\n<p>In other verses, Allah commands the believers to simply avoid those who mock Islam and not to sit with them until they discuss something else.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا رَأَيْتَ الَّذِينَ يَخُوضُونَ فِي آيَاتِنَا فَأَعْرِضْ عَنْهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ<\/p>\n<p><strong>When you see those who engage in offensive discourse concerning Our verses, then turn away from them until they enter into another conversion.<\/strong><\/p>\n<p>Surat al-An&#8217;am 6:68<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا مَعَهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ۚ إِنَّكُمْ إِذًا مِّثْلُهُمْ ۗ<\/p>\n<p><strong>It has already been revealed to you in the Book that when you hear the verses of Allah, they are denied and ridiculed. So do not sit with them until they enter into another conversation. Verily, you would then be like them.<\/strong><\/p>\n<p>Surat al-Nisa&#8217; 4:140<\/p><\/blockquote>\n<p>Generally, the Prophet (ṣ) was commanded to endure any insult or mockery from his enemies which resulted from their bad character.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ<\/p>\n<p><strong>Show forgiveness, enjoin what is good, and turn away from the ignorant.<\/strong><\/p>\n<p>Surat Al-A’raf 7:199<\/p><\/blockquote>\n<p>Abdullah ibn Zubair explained this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُمِرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم أَنْ يَأْخُذَ الْعَفْوَ مِنْ أَخْلاَقِ النَّاسِ<\/p>\n<p>The Prophet (ṣ) was commanded to forgive the people’s bad character.<\/p>\n<p>Source: Sunan Abī Dāwūd 4787, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/11\/03\/commanded-to-forgive\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>There are many recorded incidents in the life of the Prophet (ṣ) in which he was mocked, defamed, and even physically attacked for his faith in Islam, but despite this abuse the Prophet responded with patience, forbearance, mercy, and forgiveness.<\/p>\n<p>In one incident, a group of Jews insulted the Prophet (ṣ) in his own home. Although the Prophet was the leader of Medina at the time, he did not order these men to be harmed. Rather, he used the incident to teach his companions an important lesson about kindness.<\/p>\n<p>Aisha reported: A group of Jews asked permission to visit the Prophet (ṣ) and when they were admitted they said, “Death be upon you.” I said to them, “Rather death and the curse of Allah be upon you!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الْأَمْرِ كُلِّهِ<\/p>\n<p><strong>O Aisha, Allah is kind and He loves kindness in all matters.<\/strong><\/p><\/blockquote>\n<p>I said, “Have you not heard what they said?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْتُ وَعَلَيْكُمْ<\/p>\n<p><strong>I said to them: And upon you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6528, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/16\/allah-is-kind-and-loves-kindness\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Bukhari records this narration in his chapter regarding those who curse and abuse the Prophet (ṣ), which strongly implies that he did not believe legal punishment should be applied to every case of blasphemy.<\/p>\n<p>Badr al-Din al-&#8216;Ayni, a scholar of the Hanafi school, comments on this chapter heading:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">البخاري اختار في هذا مذهب الكوفيين فإن عندهم أن من سب النبي أو عابه فإن كان ذميا عزر ولا يقتل وهو قول الثوري<\/p>\n<p>Al-Bukhari has adopted the method of the people of Kufi on this issue, that if someone curses or berates the Prophet (ṣ) and he is a non-Muslim citizen, then he is rebuked but he is not killed. This is the opinion of al-Thawri.<\/p>\n<p>Source: ʻUmdat al-Qāriʼ Sharḥ Ṣaḥīḥ al-Bukhārī 34\/412<\/p><\/blockquote>\n<p>In another incident, the Prophet (ṣ) was defamed and insulted by one of the men of Medina who was upset with his method of distributing charity. The Prophet did not retaliate against him even though he was very disturbed by it, citing the fact that Moses, peace be upon him, was harmed by his people with much greater abuse.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, was distributing charity among the people when a man from the Ansar said, “By Allah, Muhammad did not intend to please Allah with this distribution!” I came to the Prophet (ṣ) and informed him about this, then anger could be seen on his face and the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ أُوذِيَ مُوسَى بِأَكْثَرَ مِنْ ذَلِكَ فَصَبَرَ<\/p>\n<p><strong>Moses was hurt with more than this, yet he remained patient.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5712, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/10\/musa-moses-patience-harm\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Indeed, it was the practice of all the Prophets (aṣ) to patiently endure the harm they received from their people, even to the point of asking Allah to forgive their oppressors.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ<\/p>\n<p><strong>They said: We will surely be patient with whatever harm you cause us, and let them rely who would rely upon Allah.<\/strong><\/p>\n<p>Surat Ibrahim 14:12<\/p><\/blockquote>\n<p>Ibn Mas’ud reported: I saw the Messenger of Allah, peace and blessings be upon him, tell the story of a prophet who was beaten by his people and he wiped the blood from his face, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ<\/p>\n<p><strong>My Lord, forgive my people for they do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6530, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/06\/03\/know-not-what-they-do\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>An-Nawawi comments on this narration, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ مَا كَانُوا عَلَيْهِ صَلَوَاتُ اللَّهِ وَسَلَامُهُ عَلَيْهِمْ مِنَ الْحِلْمِ وَالتَّصَبُّرِ وَالْعَفْوِ وَالشَّفَقَةِ عَلَى قَوْمِهِمْ وَدُعَائِهِمْ لَهُمْ بِالْهِدَايَةِ وَالْغُفْرَانِ وَعُذْرِهِمْ فِي جِنَايَتِهِمْ عَلَى أَنْفُسِهِمْ بِأَنَّهُمْ لَا يَعْلَمُونَ<\/p>\n<p>In this is what the prophets, peace and blessings be upon them, were upon of forbearance, patience, forgiveness, and compassion for their people, their supplications for them to receive guidance and to be forgiven, and that they should be excused for their sins because they did not know.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 1792<\/p><\/blockquote>\n<p>The Prophet (ṣ) continued to set this example throughout his life, even to the point of forgiving several people who tried to kill him.<\/p>\n<p>In one incident, a woman came to the Prophet (ṣ) and fed him with a poisoned sheep. When the Prophet began to suffer and it was discovered what she had done, the companions asked him if they should kill her. In this case, it would have been a justified retaliation against attempted murder, but the Prophet pardoned her instead.<\/p>\n<p>Anas ibn Malik reported: A Jewish woman came to the Messenger of Allah, peace and blessings be upon him, with a poisoned sheep and he ate from it. She was brought to him and he asked her about it. She said, “I wanted to kill you.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَ اللَّهُ لِيُسَلِّطَكِ عَلَى ذَاكِ<\/p>\n<p><strong>Allah has given you no authority over me.<\/strong><\/p><\/blockquote>\n<p>It was said, “Should we kill her?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا<\/p>\n<p><strong>No.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2474, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/15\/prophet-pardon-jewish-woman\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another incident, a man from an opposing tribe attempted to kill the Prophet (ṣ) while he was sleeping. Allah miraculously saved the Prophet by causing the man’s hand to slip, after which the Prophet gained power him. Even so, in this position of strength the Prophet continued to show clemency.<\/p>\n<p>Jabir reported: We took part in the expedition with the Messenger of Allah, peace and blessings be upon him, against Najd and when the time for afternoon rest approached, he was in a valley of thorny trees. He dismounted under a tree to rest in its shade and hung his sword upon it. The people dispersed among the trees in order to use their shade. While we were like this, the Prophet (ṣ) called us and we came to find a bedouin sitting in front of him. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذَا اخْتَرَطَ عَلَيَّ سَيْفِي وَأَنَا نَائِمٌ فَاسْتَيْقَظْتُ وَهُوَ فِي يَدِهِ صَلْتًا فَقَالَ مَنْ يَمْنَعُكَ مِنِّي فَقُلْتُ اللَّهُ ثَلَاثًا<\/p>\n<p><strong>This person came to me while I was asleep and he quietly took my sword. I woke up while he was standing over my head, holding my unsheathed sword. He said: Who will protect you from me? I said three times: Allah.<\/strong><\/p><\/blockquote>\n<p>Jabir said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمْ يُعَاقِبْهُ وَجَلَسَ<\/p>\n<p>The Prophet did not punish him and he sat down.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2753, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/01\/pardon-prophet-forgives-idolater\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said to the man:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ<\/p>\n<p><strong>Will you bear witness that there is no god but Allah and I am the Messenger of Allah?<\/strong><\/p><\/blockquote>\n<p>The man said, “No, but I give you my word that I will not fight you and I will not join anyone who is fighting you.” The Prophet (ṣ) let him go. The man returned to his people and said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِئْتُكُمْ مِنْ عِنْدِ خَيْرِ النَّاسِ<\/p>\n<p>I have just come to you from the best of people!<\/p>\n<p>Source: Musnad Aḥmad 14768, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>The man was impressed by the Prophet’s character (ṣ) so much that he returned to his people and praised him. This is an excellent example of how mercy and forgiveness are among the best deeds for winning the hearts and minds to Islam.<\/p>\n<p>In one of the most famous incidents, the Prophet (ṣ) finally gained power over his enemies after being persecuted for twenty-three years. He could have easily ordered their execution and the companions would have complied. However, the Prophet used this moment to teach the lesson of mercy just as Joseph, peace be upon him, had forgiven his brothers.<\/p>\n<p>Al-Qasim ibn Salim reported: When they came to the Ka’bah they were holding onto its door and the Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَقُولُونَ وَمَا تَظُنُّونَ<\/p>\n<p><strong>What do you say? What do you think?<\/strong><\/p><\/blockquote>\n<p>They said three times, “We say you are the son of our brother.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقُولُ كَمَا قَالَ يُوسُفُ لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ<\/p>\n<p><strong>I say to you as Joseph said to his brothers: No blame upon you today. Allah will forgive you, and He is the most merciful of the merciful<\/strong>. (12:92)<\/p><\/blockquote>\n<p>Abu Yusuf reported: When they had gathered in front of the sacred mosque, the Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَرَوْنَ أَنِّي صَانِعٌ بِكُمْ<\/p>\n<p><strong>What do you think I will do with you?<\/strong><\/p><\/blockquote>\n<p>They said, “Only good, O noble brother, son of a noble brother.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اذْهَبُوا فَأَنْتُمُ الطُّلَقَاءُ<\/p>\n<p><strong>Go, you are free.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá 17714, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/12\/hadith-on-compassion-the-prophet-forgives-his-enemies-during-the-liberation-of-mecca\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>All of this evidence indicates the general rule that Muslims should respond to blasphemy with patience, forbearance, and graceful discussion. We need to behave in the serene manner of the Prophet (ṣ) as well as publish articles, set up websites, and otherwise spread authentic information about his life and teachings.<\/p>\n<p>That said, the classical ruling in Islamic law imposes the death penalty upon those who blaspheme against Islam. This ruling is derived from handful of instances in which the Prophet (ṣ) executed some people for treason, not for merely insulting Islam.<\/p>\n<p>For example, the Prophet (ṣ) ordered the execution of Ka’b ibn al-Ashraf as he conspired to wage war against Medina. Ka’b also wrote poetry satirizing the Prophet and his companions, although this was not his only offense. Rather, he posed an imminent danger to the Muslim community due to his support for gathering an army.<\/p>\n<p>Badr al-Din al-&#8216;Ayni comments on the story of Ka&#8217;b and other narrations:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">في هذا كله أنه لم يقتلهم بمجرد سبهم وإنما كانوا عونا عليه ويجمعون من يحاربونه<\/p>\n<p>In these traditions it is shown that they were not killed merely for their insults. Indeed, they were only killed due to their aiding the enemy and preparing for war against him.<\/p>\n<p>Source: ʻUmdat al-Qāriʼ Sharḥ Ṣaḥīḥ al-Bukhārī 34\/413<\/p><\/blockquote>\n<p>This was the general social and political context within which the classical ruling against blasphemy had developed. Therefore, it is not mere blasphemy that warrants the death penalty, but rather only when it is combined with acts of treason and sedition.<\/p>\n<p>There is one particular proof-text being used in support of vigilante violence which we must critically examine. Extremists cite this narration in isolation and without context to justify the murder of anyone who insults the Prophet (ṣ). The fault in their interpretation results from their attempt to derive a legal ruling from an anomalous narration and in disregard for general rules and principles firmly established in stronger texts.<\/p>\n<p>Ibn Abbas reported: A blind man had a concubine who used to disparage and slander the Prophet (ṣ). The man forbade her and rebuked her, but she did not stop. One night she again slandered and disparaged the Prophet (ṣ), so he stabbed her in the stomach and killed her. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلاَ اشْهَدُوا أَنَّ دَمَهَا هَدَرٌ<\/p>\n<p>Bear witness there is no retaliation for her life.<\/p>\n<p>Source: Sunan Abī Dāwūd 4361<\/p><\/blockquote>\n<p>This tradition is weak because it comes through a questionable chain of authority and it apparently contradicts well-established moral and legal principles in Islam. The implication some people have wrongly inferred from the narration – that an extrajudicial killing for blasphemy is permissible – is a serious mistake.<\/p>\n<p>As for the chain of authorities, every version of the story originates with Uthman ibn Muslim al-Shuhham narrating from ‘Ikramah, may Allah have mercy on them. There are no other credible chains to support this story.<\/p>\n<p>Uthman al-Shuhham was considered reliable by some scholars, but plenty of others criticized and rejected his narrations. He narrated very few traditions as compared to other narrators, whom he usually narrated from Muslim ibn Abi Bakrah, and even fewer traditions from ‘Ikramah. He is in no way an agreed upon narrator.<\/p>\n<p>Al-Dhahabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال يحيى القطان يعرف من حديثه وينكر وقال النسائي ليس بالقوى<\/p>\n<p>Yahya al-Qattan said: His narrations are sometimes acknowledged or rejected. Al-Nasa’i said: He is not strong.<\/p>\n<p>Source: Mīzān al-I’tidāl 3\/60<\/p><\/blockquote>\n<p>And Al-Mughaltay writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقال أبو أحمد الحاكم عثمان بن مسلم أبو سلمة الشحام ليس بالمتين عندهم<\/p>\n<p>Abu Ahmad al-Hakim said Uthman ibn Muslim, Abu Salamah, is not solid in their view.<\/p>\n<p>Source: Ikmāl Tahdhīb al-Kamāl 9\/194<\/p><\/blockquote>\n<p>And Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكذا أبو أحمد وقال ليس بالمتين عندهم وقال الدارقطني بصري يعتبر به<\/p>\n<p>Likewise was said by Abu Ahmad that he is not solid in their view. Al-Daraqutni said he is a Basran in need of further consideration.<\/p>\n<p>Source: Tahdhīb al-Tahdhīb 7\/161<\/p><\/blockquote>\n<p>And Al-Arna’ut writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي عثمان كلام ينزله عن رتبة الصحيح<\/p>\n<p>There is a discussion on Uthman about lowering him from the level of soundness.<\/p>\n<p>Source: Takhrīj al-Musnad 34\/131<\/p><\/blockquote>\n<p>Ibn ‘Adi also mentioned him in his book of weak narrators, although he did not consider him weak per se, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عُثْمَانُ الشَّحَّامُ لَيْسَ لَهُ كَثِيرُ حَدِيثٍ وَمَا رَأَى بِهِ بَأْسًا فِي رِوَايَاتِهِ<\/p>\n<p>Uthman al-Shuhham does not have many traditions, but there is no objection seen in his narrations.<\/p>\n<p>Source: al-Kāmil fī Ḍuʻafā’ al-Rijāl 6\/293<\/p><\/blockquote>\n<p>However, just because Ibn ‘Adi saw nothing wrong in his narrations does not mean he considered him above scrutiny.<\/p>\n<p>Imam Muslim included only one narration of Uthman al-Shuhham from Muslim ibn Abi Bakrah in his Sahih collection. This indicates that Imam Muslim considered his chain from Ibn Abi Bakrah to be authentic, but he did not narrate his chain from ‘Ikramah. Thus, the presence of Uthman al-Shuhham in the Sahih does not mean every narration from him was considered authentic by Imam Muslim.<\/p>\n<p>Hence, the problematic tradition of the blind man is based on the authority of a questionable narrator, who narrated an unusually small number of traditions, who was criticized and rejected by some scholars, and whose narrations are otherwise not widely-regarded as legal evidence. On this basis alone, Muslims are not required at all to accept the authenticity of the story or the legal ruling it supports.<\/p>\n<p>Does this mean that blasphemy should be tolerated in every case? Free speech is not merely a human right, but rather it is a <em>responsibility<\/em>. The purpose of free speech is to facilitate discussion in search of truth and justice. Consequently, the general rule is that people are free to speak their minds respectfully, but speech that serves no purpose other than to slander, defame, offend, or incite to violence is not worthy of protection. Indeed, the Muslims have been prohibited from cursing other religions and even idols.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَسُبُّوا الَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدْوًا بِغَيْرِ عِلْمٍ<\/p>\n<p><strong>Do not insult those they invoke besides Allah, lest they insult Allah in enmity without knowledge.<\/strong><\/p>\n<p>Surat al-An’am 6:108<\/p><\/blockquote>\n<p>For this reason, many Muslim countries have statutes against defaming Islam as well as Judaism, Christianity, and other religions, as this harms the cohesion of peaceful communities. Most countries in the world impose legal or at least social restraints on free speech with laws against slander and defamation, as well as what they consider “blasphemy,” such as the many European countries that prohibit profaning the memory of the Holocaust. Muslims and all people should respect such limits as it is the responsibility of good citizens to refrain from harming social order and peace.<\/p>\n<p>However, the best way to counter false speech is by speaking the truth. The problem of blasphemy can usually be remedied by a number of peaceful solutions such as publishing articles, setting up websites, holding conferences, and arguing with good manners. Every non-violent means should be used to counter blasphemous speech before resorting to legal action and especially the death penalty. No doubt, the least likely to resort to killing are the true believers.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ<\/p>\n<p><strong>The most restrained of the people regarding killing are the people of faith.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 3720, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/27\/ahl-al-iman-restrained-killing\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Muslims must avoid calling for the death penalty whenever possible, because indulgence in this matter indicates a lack of strong faith.<\/p>\n<p>We also need to view this matter from the legal principle of public welfare (<em>maslahah mursalah<\/em>). Ibn Taymiyyah defines this principle as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَصَالِحُ الْمُرْسَلَةُ وَهُوَ أَنْ يَرَى الْمُجْتَهِدُ أَنَّ هَذَا الْفِعْلَ يَجْلِبُ مَنْفَعَةً رَاجِحَةً وَلَيْسَ فِي الشَّرْعِ مَا يَنْفِيه<\/p>\n<p>The principle of public welfare is the case when a distinguished jurist views another action as more likely to bring benefit and there is nothing in the law to negate it.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 11\/342<\/p><\/blockquote>\n<p>In so many cases, we see that the prosecution of blasphemy can cause greater harm to the community and the image of Islam than the blasphemy itself. We have a precedent in the practice of the Prophet (ṣ) to withhold such punishments when they might cause greater harm.<\/p>\n<p>Jabir ibn Abdullah reported: A man came to the Messenger of Allah on his way back from Hunain while there was some silver in the backpack of Bilal. The Messenger of Allah took a handful from it and distributed it among the people. The man said to him, “O Muhammad! Be just!” Umar ibn Al-Khattab said, “O Messenger of Allah, allow me to kill this hypocrite!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعَاذَ اللَّهِ أَنْ يَتَحَدَّثَ النَّاسُ أَنِّي أَقْتُلُ أَصْحَابِي<\/p>\n<p><strong>I seek refuge in Allah that the people will say I am killing my companions.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1063, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/12\/dawah-muhammad-killing-sahabah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعْهُ لَا يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ<\/p>\n<p><strong>Leave him alone, lest people say Muhammad is killing his companions.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2584, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>In this case, the Prophet (ṣ) refused to punish a dangerous man, a hypocrite who was pretending to be a Muslim in order to attack the community from within, on the grounds that it would have harmed the image of Islam in the eyes of the people.<\/p>\n<p>Likewise, the age of instant communication ensures that cases of blasphemy are no longer confined to local areas, but instead they have global implications. Prosecution for mere childish insults and thoughtless, impromptu remarks, without evidence of treasonous intent, only project an image of Islam as intolerant and draconian. Rather, judges need to carefully consider the unintended consequences and they must justify any prosecution in terms greater than mere insults and hurt feelings.<\/p>\n<p>Furthermore, we have the lessons of history which compel us to seek mitigation and restriction of the classical blasphemy law. Numerous Muslim scholars were imprisoned and persecuted because their views were considered “blasphemy” by the ruling regime. Most notably is the case of Ahmad ibn Hanbal who was imprisoned and tortured by the ruling Mu’tazilte regime for his alleged blasphemy of affirming the Quran was uncreated. An uncompromising and loosely interpreted blasphemy statute increases the possibility of it being misused by a corrupt regime to victimize callers to truth.<\/p>\n<p>In sum, numerous verses and traditions in Islam demonstrate that the general rule for responding to blasphemy is to counter it with patience, forbearance, and speaking the truth in a beautiful manner. Muslims ought to behave this way in the overwhelming majority of cases. The only exception to this rule is derived from the specific cases in which the Prophet (ṣ) punished some people for treason in addition to their harmful utterances. We must not expand this specific rule to all cases, thereby negating the general teachings of mercy, patience, and tolerance.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Be patient over what they say&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[61,16,18,25,26,132,34,38,39,41,48,100,54,93,58,115,62,103],"class_list":["post-16173","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-call-to-islam-dawah","tag-character-akhlaq","tag-community-jamaah","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-freedom-al-huriyyah","tag-humanity-al-insaaniyyah","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-moderation-al-wasitiyyah","tag-patience-al-sabr","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4cR","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":16173,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21247,"url":"https:\/\/www.abuaminaelias.com\/blind-man-kills-concubine-blasphemy\/","url_meta":{"origin":16173,"position":1},"title":"Blind man kills his concubine for blasphemy?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There are good reasons to question the authenticity of the hadith...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16173,"position":2},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":16173,"position":3},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":16173,"position":4},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15796,"url":"https:\/\/www.abuaminaelias.com\/whoever-changes-religion-kill-him\/","url_meta":{"origin":16173,"position":5},"title":"Apostasy: Whoever changes his religion, kill him?","author":"Abu Amina Elias","date":"June 19, 2014","format":false,"excerpt":"\"The most hesitant of people in killing are the people of faith.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16173","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16173"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16173\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16173"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16173"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}