{"id":16242,"date":"2015-01-26T10:50:29","date_gmt":"2015-01-26T06:50:29","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16242"},"modified":"2018-03-25T16:01:35","modified_gmt":"2018-03-25T12:01:35","slug":"every-good-deed-is-charity-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/every-good-deed-is-charity-in-islam\/","title":{"rendered":"Every good deed is charity in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Giving in charity is one of the five pillars of Islam and among its most important teachings. Muslims are required to give a small percentage of their wealth in charity every year, but charity does not always take monetary form. In fact, any good deed done for another person is an act of charity.<\/p>\n<p>Ibn Abi Shayba reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَعْرُوفٍ صَدَقَةٌ<\/p>\n<p><strong>Every good deed is charity.<\/strong><\/p>\n<p>Source: Sahih Muslim 1005, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/24\/every-good-deed-counts-as-charity\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَعْرُوفٍ صَدَقَةٌ وَإِنَّ مِنْ الْمَعْرُوفِ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ وَأَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ أَخِيكَ<\/p>\n<p><strong>Every good deed is charity. Verily, it is a good deed to meet your brother with a smiling face, and to pour what is left from your bucket into the vessel of your brother.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 1970, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/24\/hadith-on-charity-every-good-deed-is-charity-even-smiling-at-your-brother\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Charity, in this wider sense, is not simply giving away money but rather it is a way of life. Muslims have a moral responsibility to give charity every day from their wealth, time, and effort as acts of gratitude for the blessings of Allah. Allah has given us health, wealth, time, and energy so we need to give back to others in His service.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ قَالَ تَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ قَالَ وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ وَكُلُّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلَاةِ صَدَقَةٌ وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ<\/p>\n<p><strong>Charity is due upon every joint of the people for every day upon which the sun rises. Being just between two people is charity. Helping a man with his animal and lifting his luggage upon it is charity. A kind word is charity. Every step that you take towards the mosque is charity, and removing harmful things from the road is charity.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2827, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/14\/hadith-on-charity-every-joint-has-charity-due-upon-it-even-a-good-word-is-charity\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The companions once complained to the Prophet that the wealthy had taken all the rewards due to their ability to spend in charity. However, the Prophet told them that even the poorest of Muslims is capable of earning great rewards through good deeds such as praising Allah and even pursuing healthy desires in a lawful manner.<\/p>\n<p>Abu Dharr reported: Some people among the companions came to the Messenger of Allah and they said, “O Messenger of Allah, the rich have taken all the rewards. They pray as we pray, they fast as we fast, and they give charity from their extra wealth.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوَ لَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً وَكُلِّ تَكْبِيرَةٍ صَدَقَةً وَكُلِّ تَحْمِيدَةٍ صَدَقَةً وَكُلِّ تَهْلِيلَةٍ صَدَقَةً وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ<\/p>\n<p><strong>Has not Allah made for you ways to give charity? In every glorification of Allah is charity, in every declaration of His greatness is charity, in every praise of Him is charity, in every declaration of His oneness is charity, enjoining good is charity and forbidding evil is charity, and in a man’s intimate relations with his wife is charity.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, is there a reward for one who satisfies his passions?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهَا وِزْرٌ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرًا<\/p>\n<p><strong>You see that if he were to devote himself to the forbidden it would be sin. Likewise, if he were to devote himself to the lawful he will have a reward.<\/strong><\/p>\n<p>Source: Sahih Muslim 1006, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/19\/hadith-on-charity-has-not-allah-made-for-you-ways-to-give-in-charity\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Doing good deeds for our family is an important means of performing charity and strengthening family ties. We should give first to those who depend upon us to take care of them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وَابْدَأْ بِمَنْ تَعُولُ<\/p>\n<p><strong>The best charity is what you give when you are independent, and you should start with spending on your dependents.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5041, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/07\/24\/the-best-charity-is-given-from-your-wealth-to-your-needy-family-members\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَنْفَقَ الْمُسْلِمُ نَفَقَةً عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا كَانَتْ لَهُ صَدَقَةً<\/p>\n<p><strong>When a Muslim spends on his family intending good it is regarded as charity for him.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5036, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/07\/22\/spending-on-your-family-is-an-act-of-charity\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Charity should be a way of life practiced by the whole family. If the entire family cooperates in performing acts of charity, their rewards will reinforce and increase each other.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَنْفَقَتْ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا كَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ لَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا<\/p>\n<p><strong>When a woman spends in charity from her house’s meal without wasting it, then she will have a reward from what she spent. Her husband will have a reward from what he earned and the storekeeper will have a similar reward. Their rewards will not decrease each other in anything.<\/strong><\/p>\n<p>Source: Sahih Bukhari 1359, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/05\/06\/hadith-on-charity-spending-from-the-family-meals-is-charity-for-all-involved\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even small good deeds can have a tremendous positive effect on others in this life. For this reason, the Prophet told us never to belittle any good deed, even smiling at others, saying a kind word, or giving away half of a date fruit. Small good deeds such as these may be the reason Allah admits us into Paradise.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ<\/p>\n<p><strong>Do not regard any good deed as insignificant, even meeting your brother with a cheerful face.<\/strong><\/p>\n<p>Source: Sahih Muslim 2626, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/22\/all-good-deeds-are-rewarded-even-small-deeds\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Adi ibn Hatim reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ<\/p>\n<p><strong>Protect yourself from the Hellfire even with half of a date in charity, and if he cannot find it then with a kind word<\/strong>.<\/p>\n<p>Source: Sahih Bukhari 6195, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/14\/hadith-on-charity-save-yourself-from-hellfire-by-giving-half-of-a-date-in-charity\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Charity should be performed not only for human beings, but also for the animals. In one narration, the Prophet told us about a prostitute who helped a thirsty dog get a drink of water. Allah appreciated her sincere deed so much that her sins were forgiven.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">امْرَأَةً بَغِيًّا رَأَتْ كَلْبًا فِي يَوْمٍ حَارٍّ يُطِيفُ بِبِئْرٍ قَدْ أَدْلَعَ لِسَانَهُ مِنْ الْعَطَشِ فَنَزَعَتْ لَهُ بِمُوقِهَا فَغُفِرَ لَهَا<\/p>\n<p><strong>A prostitute saw a dog lolling around a well on a hot day and hanging his tongue from thirst. She drew some water for it in her shoe, so Allah forgave her.<\/strong><\/p>\n<p>Source: Sahih Muslim 2245, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/30\/hadith-on-animals-allah-has-forgiven-a-prostitute-because-of-her-kindness-to-a-thirsty-dog\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>By spending our wealth, time, and energy in charitable service for others, Allah promises to multiply and magnify our good deeds into tremendous rewards in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّائَةُ حَبَّةٍ ۗ وَاللَّهُ يُضَاعِفُ لِمَن يَشَاءُ ۗ وَاللَّهُ وَاسِعٌ عَلِيمٌ<\/p>\n<p><strong>The example of those who spend their wealth in the way of Allah is like a seed of grain which grows seven spikes, in each spike is a hundred grains. Allah multiplies the reward for whomever He wills, for Allah is vast and knowing.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:261<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ أَنْفِقْ يَا ابْنَ آدَمَ أُنْفِقْ عَلَيْك<\/p>\n<p><strong>Allah said: Spend in charity, O son of Adam, and I will spend on you.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5037, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/07\/22\/spend-in-charity-and-allah-will-spend-on-you\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this way, charity does not decrease wealth, that is, the true wealth of having good deeds for the Hereafter. Forgiving others and behaving with humility are likewise good deeds that raise the honor and status of those who do them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلاَّ رَفَعَهُ اللَّهُ<\/p>\n<p><strong>Charity does not decrease wealth, no one forgives another except that Allah increases his honor, and no one humbles himself for the sake of Allah except that Allah raises his status.<\/strong><\/p>\n<p>Source: Sahih Muslim 2588, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/09\/20\/charity-does-not-decrease-wealth-forgiveness-and-humility-increase-honor\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Therefore, we should instill charity as an attitude and way of life within ourselves, our families, and our communities. We should habitually perform good deeds for our fellow human beings and even for the animals. The wealth, time, and effort we put into charitable work will return to us as multiplied rewards on the Day of Resurrection.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Has not Allah made for you ways to give charity? In every glorification of Allah is charity.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[127,317,16,17,18,183,168,24,26,114,49,135,32,34,104,48,100,134,60,103,70,220,179],"class_list":["post-16242","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adultery-zina","tag-animals","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-enjoin-good-amr-bil-maruf","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-generosity-al-karam","tag-gentleness-al-rifq","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-humility-al-tawaduh","tag-justice-adl","tag-manners-al-adab","tag-paradise-jannah","tag-prayer-salat","tag-public-welfare-al-maslaha","tag-sincerity-al-ikhlaas","tag-supplication-al-dua","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4dY","jetpack-related-posts":[{"id":14445,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-smiling-and-kind-words\/","url_meta":{"origin":16242,"position":0},"title":"Imam al-Nawawi on Kind Words and Smiling","author":"Abu Amina Elias","date":"July 25, 2013","format":false,"excerpt":"\"A kind word is charity,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22666,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-paying-zakat\/","url_meta":{"origin":16242,"position":1},"title":"Imam al-Mundhiri on Obligatory Charity","author":"Abu Amina Elias","date":"October 19, 2020","format":false,"excerpt":"\"Whoever pays alms on his wealth, his evil will depart from him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20555,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-sincerity-truthfulness-good-intentions\/","url_meta":{"origin":16242,"position":2},"title":"Imam al-Mundhiri on Sincerity, Honesty, and Good Intentions","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"\"Deeds are only by intentions.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13845,"url":"https:\/\/www.abuaminaelias.com\/purification-heart-and-soul\/","url_meta":{"origin":16242,"position":3},"title":"Purification of the heart and soul in Islam","author":"Abu Amina Elias","date":"June 28, 2013","format":false,"excerpt":"\"He has succeeded who purifies himself...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20440,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-smiles-kalimat-tayyibah\/","url_meta":{"origin":16242,"position":4},"title":"Imam al-Mundhiri on Smiling, Cheerfulness, and Kind Words","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Smiling in the face of your brother is charity,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14729,"url":"https:\/\/www.abuaminaelias.com\/is-it-permissible-to-kill-dogs-in-islam\/","url_meta":{"origin":16242,"position":5},"title":"Killing dogs in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Five animals are harmful and are lawful to kill while in a state of pilgrimage: a snake, a speckled crow, a rat, a biting dog, and a kite.\" --Sahih Muslim 1198","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16242","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16242"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16242\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16242"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16242"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16242"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}