{"id":16284,"date":"2016-07-04T10:50:24","date_gmt":"2016-07-04T06:50:24","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16284"},"modified":"2025-07-04T10:52:57","modified_gmt":"2025-07-04T06:52:57","slug":"separation-mosque-and-state","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/separation-mosque-and-state\/","title":{"rendered":"Separation of Mosque and State in Islam?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The call for secularism in the Muslim world is rooted in the misunderstanding of Islam’s traditional relationship to government and the assumption that Western secular models are appropriate for Muslim countries. Both Muslims and non-Muslims have trouble understanding this issue in context due to the lack of scholarly analysis available in the media.<\/p>\n<p>Secularism originated in the West as a reaction to the internecine wars of religion in Europe. Europe developed theocratic governments in which the religious and political institutions were one and the same, thereby corrupting the purity of religious practice. Religion was politicized and this led to fanatical intolerance and persecution for which it was deemed necessary to forcibly separate “the church” and the state.<\/p>\n<p>The Western experience does not entirely apply to Islam because normative Islamic tradition has within it the mechanisms necessary to prevent theocracy, politicization of religion, intolerance, and human rights abuses. A Western solution to a Western problem does not mean the same solution can apply to a Muslim problem. Rather, Muslims can overcome the problem of fanaticism and intolerance from within Islam itself.<\/p>\n<p>In fact, Islam <em>requires<\/em> a “soft” separation between the religious scholars and the ruling authorities. Religious scholars should keep a healthy distance and independence from the ruling elite in order to maintain the purity of religious teachings and to prevent themselves from being corrupted by the ambitions of power.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ أَتَى أَبْوَابَ السُّلْطَانِ افْتُتِنَ وَمَا ازْدَادَ عَبْدٌ مِنْ السُّلْطَانِ قُرْبًا إِلَّا ازْدَادَ مِنْ اللَّهِ بُعْدًا<\/p>\n<p><strong>Whoever goes to the gates of the ruler will endure tribulation. A servant does not move closer to the ruler except that he moves further away from Allah.<\/strong><\/p>\n<p>Source: Musnad Ahmad 8619, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/01\/22\/hadith-on-rulers-beware-of-seeking-leadership-and-distancing-yourself-from-allah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Religious scholars who are controlled by state governments will inevitably lose credibility with people.<\/p>\n<p>Sa’eed ibn Al-Musayyib, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إذَا رَأَيْتُمْ الْعَالِمَ يَغْشَى الْأُمَرَاءَ فَاحْذَرُوا مِنْهُ فَإِنَّهُ لِصٌّ<\/p>\n<p>If you see a religious scholar frequently visiting the rulers, then beware of him for he is a thief.<\/p>\n<p>Source: Al-Adab Ash-Shar’iya 477<\/p><\/blockquote>\n<p>This kind of “soft” separation is in contrast to a “hard” separation, such as the French political model, in which religion is marginalized and excluded from public and political life. Rather, the religion should have a positive influence on the politics of a Muslim country but religious scholars should remain independent in order to provide an important check on state power.<\/p>\n<p>Ibn Abdul Barr writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالُوا شَرُّ الأُمَرَاءِ أَبْعَدُهُمْ مِنَ الْعُلَمَاءِ وَشَرُّ الْعُلَمَاءِ أَقْرَبُهُمْ مِنَ الأُمَرَاءِ<\/p>\n<p>It is said that the worst rulers are far from the scholars and the worst scholars are near to the rulers.<\/p>\n<p>Source: Jami’ Bayan Al-‘Ilm 727<\/p><\/blockquote>\n<p>That is, the best rulers seek advice from religious scholars and the worst religious scholars seek favors, bribes, and other worldly gains from the rulers. In other words, religious values should have a positive influence on the government but the government should not be allowed to misuse religion.<\/p>\n<p>In practice, the institutions of religion and state were separate throughout most of Islamic history.<\/p>\n<p>Deepa Kumar, professor of Middle Eastern studies at Rutgers University, writes:<\/p>\n<blockquote><p>This role of ensuring social discipline through religious law was pervasive, and in this realm the religious scholars did indeed hold power. However, in the realm of politics they had little sway. Instead, in terms of Muslim societies as a whole, the religious scholars played a secondary and subservient role in relation to the political leadership. Thus, even though Islamic treatises that emerged during this period and later have a good deal to say about the nature of good rulers and governments and are loaded with suggestions and advice for rulers, they do not stake out a political role for the clergy. While the clergy insisted that the powerful should rule society in a way that conformed to Sharia law, they viewed their role to be censuring bad rulers rather than acting as rulers themselves.<\/p>\n<p>Source: Kumar, D. (2012). <em>Islamophobia: The cultural logic of empire<\/em>. p. 84.<\/p><\/blockquote>\n<p>Therefore, Islam does not promote in theory or practice a theocratic model of government in which the religious and political authorities are the same. Some contemporary Muslim groups reacted to the failure of authoritarian secularism by positing the radical fusion of Islam and state under the slogan “Islam is religion and state” (<em>al-Islam din wa dawla<\/em>), but this project of theirs is ahistorical, without a strong basis in Islamic tradition, and it has had a corrupting influence on religious practice to the point of encouraging violence.<\/p>\n<p>It is true that religious and political authority was united in Prophet Muhammad, peace and blessings be upon him, but this was specific to him alone. The first Caliph to succeed the Prophet, Abu Bakr, made clear in his inaugural address that he should not be considered an absolute divine authority in himself.<\/p>\n<p>Abu Bakr, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ فَإِنِّي قَدْ وُلِّيتُ عَلَيْكُمْ وَلَسْتُ بِخَيْرِكُمْ فَإِنْ أَحْسَنْتُ فَأَعِينُونِي وَإِنْ أَسَأْتُ فَقَوِّمُونِي<\/p>\n<p>O people, I have been put in authority over you and I am not the best of you. If I do right then help me, and if I do wrong then put me straight.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/13\/ibn-hisham-the-opening-speech-of-abu-bakr-upon-assuming-the-office-of-caliph\/\">Seerah Ibn Hisham 657<\/a><\/p><\/blockquote>\n<p>Furthermore, the Prophet warned us about the dangers of seeking power and authority. The best leaders are those who are qualified but reluctant to lead, due to their understanding of its enormous responsibility.<\/p>\n<p>Abu Musa reported: Two of my cousins and I entered the house of the Prophet. One of them said, “O Messenger of Allah, appoint us as leaders over some lands that Allah the Exalted has entrusted to your care.” The other said something similar. The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّا وَاللَّهِ لاَ نُوَلِّي عَلَى هَذَا الْعَمَلِ أَحَدًا سَأَلَهُ وَلاَ أَحَدًا حَرَصَ عَلَيْهِ<\/p>\n<p><strong>Verily, by Allah, we do not appoint anyone to this position who asks for it or is anxious for it.<\/strong><\/p>\n<p>Source: Sahih Muslim 1733, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/07\/the-prohibition-of-desiring-power-and-authority-over-people\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ<\/p>\n<p><strong>Whoever accepts an appointment as a judge is as if he has been slaughtered without a knife.<\/strong><\/p>\n<p>Source: Sunan Abu Dawud 3571, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/05\/10\/hadith-on-judges-whoever-is-appointed-as-a-judge-has-been-given-a-tremendous-responsibility\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Sufyan At-Thawri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِيَّاكَ وَحُبَّ الرِّيَاسَةِ فَإِنَّ الرَّجُلَ تَكُونُ الرِّيَاسَةُ أَحَبَّ إِلَيْهِ مِنَ الذَّهَبِ وَالْفِضَّةِ وَهُوَ بَابٌ غَامِضٌ لَا يُبْصِرُهُ إِلَّا الْبَصِيرُ مِنَ الْعُلَمَاءِ السَّمَاسِرَةِ<\/p>\n<p>Beware of the love of leadership, for leadership may be more beloved to a man than gold and silver, yet it is something difficult and obscure. This will not be understood except by the scholars of wisdom.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/02\/18\/sufyan-at-thawris-letter-of-religious-and-political-advice-to-abbad-ibn-abbad-al-khawwas\/\">Hilyat Al-Awliya 376<\/a><\/p><\/blockquote>\n<p>As such, we should be very skeptical of Muslim political parties that “politicize” Islam and use it as a means of achieving power. The best and most sincere religious scholars remain distant from the ruling authority because they heed the Prophet’s warning about desiring leadership. For this reason, the great Imams who formulated Islamic law did not seek authority or position or government office, and in fact they were sometimes persecuted by the rulers.<\/p>\n<p>Moreover, Islam contains within its tradition the mechanisms needed to prevent intolerance and to allow space for natural pluralism and differences of opinion in society. In the time of Imam Malik, the Caliph Al-Mansur wanted to adopt the Maliki law school above all others. However, Imam Malik refused his offer due to his understanding of the harm this would cause.<\/p>\n<p>Ibn Abdul Barr reported: When Caliph Al-Mansur performed the pilgrimage, he called Malik and said, “I am determined to have several copies made of these books of yours. I will send a copy to every region in the lands of the Muslims and I will command them to adhere to its contents without referring to any other, and they will set aside everything but this new knowledge.” Malik replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَمِيرَ الْمُؤْمِنِينَ لَا تَفْعَلْ هَذَا فَإِنَّ النَّاسَ قَدْ سَبَقَتْ إِلَيْهِمْ أَقَاوِيلَ وَسَمِعُوا أَحَادِيثَ وَرَوَوْا رِوَايَاتٍ وَأَخَذَ كُلُّ قَوْمٍ مِنْهُمْ بِمَا سَبَقَ إِلَيْهِمْ وَعَمِلُوا بِهِ وَدَانَوْا بِهِ مِنَ اخْتِلَافِ النَّاسِ وَغَيْرِهِمْ وَإِنَّ رَدَّهُمْ عَمَّا اعْتَقَدُوهُ تَشْدِيدٌ فَدَعِ النَّاسَ وَمَا هُمْ عَلَيْهِ وَمَا اخْتَارَ أَهْلُ كُلِّ بَلَدٍ لِأَنْفُسِهِمْ<\/p>\n<p>O leader of the believers, do not do this, for the people have received sayings, heard narrations, and transmitted various accounts. Each people adheres to what it has received and acts by it. They deal with their differences accordingly and, indeed, to turn them away from their beliefs would be very difficult, so leave the people with what they are upon and with what the people of every country has chosen for themselves.<\/p>\n<p>Source: Jami’ Bayan Al-‘Ilm 607<\/p><\/blockquote>\n<p>The natural differences that arise from different schools of thought were recognized by the great Imams of Islam, so it became a rule that a religious scholar should not be allowed to force his personal views on others.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْأَئِمَّةِ لَيْسَ لِلْفَقِيهِ أَنْ يَحْمِلَ النَّاسَ عَلَى مَذْهَبِهِ<\/p>\n<p>Some of the Imams would say it is not the duty of the religious jurist to force his school of thought upon the people.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/19\/ibn-taymiyyah-it-is-not-the-duty-of-the-jurist-to-compel-people-to-follow-his-school-of-thought\/\">Majmu’ Al-Fatawa 30\/80<\/a><\/p><\/blockquote>\n<p>In our times, a great religious and political consensus has emerged through the issuance of the <a href=\"http:\/\/www.ammanmessage.com\/\">Amman Message<\/a>. An unprecedented gathering of Muslim scholars agreed upon the following three points:<\/p>\n<ol>\n<li>They specifically recognized the validity of all 8 <em>Mathhabs<\/em> (legal schools) of Sunni, Shi&#8217;a and Ibadhi Islam, of traditional Islamic Theology (Ash&#8217;arism), of Islamic Mysticism (Sufism), and of true Salafi thought, and came to a precise definition of who is a Muslim.<\/li>\n<li>Based upon this definition they forbade <em>takfir<\/em> (declarations of apostasy) between Muslims.<\/li>\n<li>Based upon the <em>Mathahib<\/em> they set forth the subjective and objective preconditions for the issuing of fatwas, thereby exposing ignorant and illegitimate edicts in the name of Islam.<\/li>\n<\/ol>\n<p>A similar message of tolerance and respect for fundamental rights was issued to the non-Muslim world by the <a href=\"http:\/\/www.acommonword.com\/\">Common Word<\/a> initiative and the <a href=\"http:\/\/www.oic-oci.org\/english\/article\/human.htm\">Cairo Declaration of Human Rights in Islam<\/a>.<\/p>\n<p>Therefore, tolerance is an essential teaching in Islam so there is no need to adopt a Western secular model to safeguard human rights in Muslim societies.<\/p>\n<p>At this point, some commentators will argue that most Muslims desire to be governed by Sharia law, which they mistakenly equate with medieval jurisprudence, and warn that Sharia contradicts basic human rights. However, they have not understood the important distinction between the <em>Sharia<\/em>, the way of Allah, and <em>Fiqh<\/em>, practical jurisprudence. Sharia serves as the legal and ethical philosophy of Islam which encompasses all human activities, whereas Fiqh is its practical application restricted to legal matters. Sharia is divine and immutable and comprehensive in scope, whereas Fiqh is human and more narrow and subject to change under different conditions.<\/p>\n<p>Ibn Al-Qayyim, one of the great jurists of Islamic tradition, defined the values of the Sharia to be justice, mercy, welfare, and wisdom. Any law that contradicts these values is not the Sharia, even if it is based upon an interpretation of Islamic scripture.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ الشَّرِيعَةَ مَبْنَاهَا وَأَسَاسُهَا عَلَى الْحِكَمِ وَمَصَالِحِ الْعِبَادِ فِي الْمَعَاشِ وَالْمَعَادِ وَهِيَ عَدْلٌ كُلُّهَا وَرَحْمَةٌ كُلُّهَا وَمَصَالِحُ كُلُّهَا وَحِكْمَةٌ كُلُّهَا فَكُلُّ مَسْأَلَةٍ خَرَجَتْ عَنْ الْعَدْلِ إلَى الْجَوْرِ وَعَنْ الرَّحْمَةِ إلَى ضِدِّهَا وَعَنْ الْمَصْلَحَةِ إلَى الْمَفْسَدَةِ وَعَنْ الْحِكْمَةِ إلَى الْبَعْثِ فَلَيْسَتْ مِنْ الشَّرِيعَةِ وَإِنْ أُدْخِلَتْ فِيهَا بِالتَّأْوِيلِ<\/p>\n<p>Verily, the Sharia is founded upon wisdom and welfare for the servants in this life and the afterlife. In its entirety it is justice, mercy, benefit, and wisdom. Every matter which abandons justice for tyranny, mercy for cruelty, benefit for corruption, and wisdom for foolishness is not a part of the Sharia even if it was introduced therein by an interpretation.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ibn-al-qayyim-the-sharia-is-based-upon-justice-mercy-welfare-and-wisdom\/\">I’lam Al-Muwaqqi’in 11<\/a><\/p><\/blockquote>\n<p>In addition, the great scholar Al-Ghazali defined the objectives of the Sharia to be the protection of life, religion, intellect, family relations, and property, objectives from which modern human rights are derived in Islam.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لكننا نعنى بالمصلحة المحافظة على مقصود الشرع ومقصود الشرع من الخلق خمسة وهو أن يحفظ عليهم دينهم وأنفسهم وعقلهم ونسلهم ومالهم فكل ما يتضمن حفظ هذه الأصول الخمسة فهو مصلحة وكل ما يفوت هذه الأصول الخمسة فهو مفسدة<\/p>\n<p>Welfare which we mean here is the protection of the objectives of the Sharia. Namely, the objectives of the Sharia are five in creation: the protection of religion, life, intellect, family relations, and property. Everything that advances the protection of these five fundamentals is considered benefit, and everything which fails to protect these five fundamentals is considered corruption.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/al-ghazali-the-objectives-of-the-sharia-are-the-protection-of-religion-life-intellect-family-and-property\/\">Al-Mustasfa min Ilm al-Usul 287<\/a><\/p><\/blockquote>\n<p>Unlike the view of some &#8220;Islamist&#8221; political parties with a rigid understanding of Islamic law, the truth is that Islam has laid this foundation of principles, ethics, and values to serve as the basis of a just government but whose details can then be modified and adapted to accommodate the needs of a specific society and era. This is what makes Islam compatible with every time and place, because it gives people the flexibility to apply Islamic teachings in a new setting.<\/p>\n<p>The recognition that different conditions necessitate different rulings in worldly matters has always been a fundamental principle of Islamic law.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا قَوْلُهُ الْخَامِسَةُ مَعْرِفَةُ النَّاسِ فَهَذَا أَصْلٌ عَظِيمٌ يَحْتَاجُ إلَيْهِ الْمُفْتِي وَالْحَاكِمُ فَإِنْ لَمْ يَكُنْ فَقِيهًا فِيهِ فَقِيهًا فِي الْأَمْرِ وَالنَّهْيِ ثُمَّ يُطَبِّقُ أَحَدَهُمَا عَلَى الْآخَرِ وَإِلَّا كَانَ مَا يَفْسُدُ أَكْثَرَ مِمَّا يَصْلُحُ فَإِنَّهُ إذَا لَمْ يَكُنْ فَقِيهًا فِي الْأَمْرِ لَهُ مَعْرِفَةٌ بِالنَّاسِ تَصَوَّرَ لَهُ الظَّالِمُ بِصُورَةِ الْمَظْلُومِ وَعَكْسُهُ وَالْمُحِقُّ بِصُورَةِ الْمُبْطِلِ وَعَكْسُهُ وَرَاجَ عَلَيْهِ الْمَكْرُ وَالْخِدَاعُ وَالِاحْتِيَالُ وَتَصَوَّرَ لَهُ الزِّنْدِيقُ فِي صُورَةِ الصِّدِّيقِ وَالْكَاذِبُ فِي صُورَةِ الصَّادِقِ وَلَبِسَ كُلُّ مُبْطِلٍ ثَوْبَ زُورٍ تَحْتَهَا الْإِثْمُ وَالْكَذِبُ وَالْفُجُورُ وَهُوَ لِجَهْلِهِ بِالنَّاسِ وَأَحْوَالِهِمْ وَعَوَائِدِهِمْ وَعُرْفِيَّاتِهِمْ لَا يُمَيِّزُ هَذَا مِنْ هَذَا بَلْ يَنْبَغِي لَهُ أَنْ يَكُونَ فَقِيهًا فِي مَعْرِفَةِ مَكْرِ النَّاسِ وَخِدَاعِهِمْ وَاحْتِيَالِهِمْ وَعَوَائِدِهِمْ وَعُرْفِيَّاتِهِمْ فَإِنَّ الْفَتْوَى تَتَغَيَّرُ بِتَغَيُّرِ الزَّمَانِ وَالْمَكَانِ وَالْعَوَائِدِ وَالْأَحْوَالِ وَذَلِكَ كُلُّهُ مِنْ دِينِ اللَّهِ كَمَا تَقَدَّمَ بَيَانُهُ وَبِاَللَّهِ التَّوْفِيقُ<\/p>\n<p>As for knowing the condition of people, this is a tremendous principle required of the scholar and judge. For if he does not have a proper understanding of commanding and forbidding and then he applies one judgment over another, it will cause more harm than benefit. Indeed, if he does not understand the condition of people in the matter, he will make the oppressor appear like the oppressed and vice versa, he will make the truth appear like falsehood and vice versa and he will spread its deceit, treachery, and fraud. He will make heresy appear as righteousness and falsehood appear as truth, and he will dress every lie in a false garment beneath which is sin and wickedness. It is ignorance of the people, their circumstances, their customs, and their traditions for which he cannot distinguish this matter from that. Rather, the scholar must understand the tendency of people to plot, deceive, and defraud, as well as their customs and traditions. Indeed, the judgment (<em>fatwa<\/em>) changes with the change of time, place, custom, and circumstance. All of this is from the religion of Allah as has been explained, and success comes from Allah.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/09\/25\/ibn-al-qayyim-on-fatwa-islamic-rulings-and-judgments-may-change-by-time-place-and-condition\/\">I’lam Al-Muwaqi’een 4\/157<\/a><\/p><\/blockquote>\n<p>This principle most certainly applies to the contemporary political situation and issues of good governance. According to Dr. Tariq Ramadan:<\/p>\n<blockquote><p>Faithfulness to principles cannot involve faithfulness to the historical [political] model because times change, societies and political and economic systems become more complex, and in every age it is in fact necessary to think of a model appropriate to each social and cultural reality.<\/p>\n<p>Source: Ramadan, T. (2004). <em>Western Muslims and the future of Islam<\/em>. p. 35<\/p><\/blockquote>\n<p>In this light, the call for the Sharia among Muslims in general is largely a desire for the moral values and principles of Islam to influence government. This does not necessitate the rigid application of a medieval school of law, or <em>Fiqh<\/em>. In fact, most Muslims believe the Sharia can be synthesized with modern methods of government and can incorporate the lessons of historical experience.<\/p>\n<p>Dr. John Esposito has analyzed a poll of Muslim attitudes conducted in many countries and he concludes that the majority of Muslims in most countries do not the desire to be governed by religious theocracy or secularism, but rather desire a third model that combines Islamic tradition with modern governance.<\/p>\n<p>John Esposito writes:<\/p>\n<blockquote><p>Most Muslims believe their own religion and values are essential to their progress. Thus, while some reformers dismiss the relationship of religion to the state, arguing for a secular state, majorities of Muslims expressed a desire for Sharia, the basis for religious values, as a source of law. Although perceptions of what the Sharia represents and the degree to which it is possible to implement its rulings in society vary enormously, most want democratic and religious principles and values to coexist in their government and thus see a role for religious principles in the formulation of state legislation…<\/p>\n<p>Significant majorities in many countries say religious leaders should play no direct role in drafting a country’s constitution, writing national legislation, drafting new laws, determining foreign policy and international relations, or deciding how women should dress in public or what should be televised or published in newspapers. Thus, many Muslims want neither a Western secular nor theocratic state but rather one that combines religious values with broader political participation, political freedoms, and the rule of law.<\/p>\n<p>Source: Esposito, J. L. (2010). <em>The future of Islam<\/em>. p.146<\/p><\/blockquote>\n<p>In conclusion, Islam contains within its tradition all of the mechanisms needed to avoid the theocracy, politicization of religion, intolerance, and human rights abuses which forced Western societies to separate church and state. Muslims largely desire to develop indigenous solutions to their own political problems from within the Islamic tradition itself and not from imported Western models imposed from outside.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Religious values should have a positive influence on the government,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[320,18,99,48,51,54,55,93,115,62,103,64,91,296,121],"class_list":["post-16284","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-abu-bakr","tag-community-jamaah","tag-excommunication-takfir","tag-justice-adl","tag-leadership-imamate","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-reform-islah","tag-righteous-predecessors-al-salaf-al-salih","tag-sharia","tag-terrorism-al-irhab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4eE","jetpack-related-posts":[{"id":20801,"url":"https:\/\/www.abuaminaelias.com\/islamic-teachings-non-muslims-too\/","url_meta":{"origin":16284,"position":0},"title":"Islamic teachings apply to non-Muslims too","author":"Abu Amina Elias","date":"August 20, 2019","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":16284,"position":1},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17207,"url":"https:\/\/www.abuaminaelias.com\/equality-under-law-non-muslims\/","url_meta":{"origin":16284,"position":2},"title":"Equal protection of law for Muslims and non-Muslims","author":"Abu Amina Elias","date":"October 20, 2015","format":false,"excerpt":"\"Islam guarantees the protection of civil law for all citizens and visitors,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13626,"url":"https:\/\/www.abuaminaelias.com\/greeting-non-muslims-salaam\/","url_meta":{"origin":16284,"position":3},"title":"Can Muslims greet non-Muslims with peace?","author":"Abu Amina Elias","date":"June 2, 2013","format":false,"excerpt":"\"This is an assurance of security for the people of our covenant.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16284,"position":4},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20085,"url":"https:\/\/www.abuaminaelias.com\/criticizing-muslims-without-naming-shaming\/","url_meta":{"origin":16284,"position":5},"title":"Criticizing Muslims without naming and shaming","author":"Abu Amina Elias","date":"January 7, 2019","format":false,"excerpt":"\"Whoever admonishes his brother in public has betrayed him.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16284","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16284"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16284\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16284"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16284"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16284"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}