{"id":16316,"date":"2016-07-04T10:49:15","date_gmt":"2016-07-04T06:49:15","guid":{"rendered":"http:\/\/www.faithinallah.org\/?p=16316"},"modified":"2025-07-04T11:01:21","modified_gmt":"2025-07-04T07:01:21","slug":"required-muslims-one-ruler","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/required-muslims-one-ruler\/","title":{"rendered":"Muslims must only have one ruler?"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>It is an obligation for Muslims to be united to the greatest extent possible, if not politically then at least morally and spiritually. Many Muslim scholars of the past believed it is an obligation for Muslims to be united under one ruler, but this is the ideal situation if it is a realistic political option. Otherwise, scholars say that it is permissible for Muslims to have multiple rulers in different locations when it is necessary.<\/p>\n<p>Allah has commanded us to be united and to avoid splitting into different factions and sects.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا ۚ وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِ إِخْوَانًا<\/p>\n<p><strong>Hold firmly to the rope of Allah all together and do not become divided. Remember the favor of Allah upon you, when you were enemies and He brought your hearts together and you became brothers by His favor.<\/strong><\/p>\n<p>Surat Ali Imran 3:103<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ وَأَقِيمُوا الصَّلَاةَ وَلَا تَكُونُوا مِنَ الْمُشْرِكِينَ مِنَ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا ۖ كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ<\/p>\n<p><strong>Turn in repentance, be mindful, and establish prayer. Do not be among those who commit idolatry or those who divided their religion and became sects, each party rejoicing in itself.<\/strong><\/p>\n<p>Surat Ar-Rum 30:31-32<\/p><\/blockquote>\n<p>In some traditions, the Prophet commanded us to be united under one ruler and he warned us to defend our community against those who would come to divide us and usurp authority for themselves.<\/p>\n<p>Arfaja reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ سَتَكُونُ هَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ هَذِهِ الْأُمَّةِ وَهِيَ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كَانَ<\/p>\n<p><strong>Verily, there will soon appear evil after evil. So whoever intends to cause insurrection in this nation while they are united, then strike him with the sword no matter who he may be.<\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَتَاكُمْ وَأَمْرُكُمْ جَمِيعٌ عَلَى رَجُلٍ وَاحِدٍ يُرِيدُ أَنْ يَشُقَّ عَصَاكُمْ أَوْ يُفَرِّقَ جَمَاعَتَكُمْ فَاقْتُلُوهُ<\/p>\n<p><strong>Whoever comes to you while you are united upon one man as leader and he intends to undermine your solidarity or split your community, then kill him.<\/strong><\/p>\n<p>Source: Sahih Muslim 1852, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>An-Nawawi comments on these traditions, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ الْأَمْرُ بِقِتَالِ مَنْ خَرَجَ عَلَى الْإِمَامِ أَوْ أَرَادَ تَفْرِيقَ كَلِمَةِ الْمُسْلِمِينَ وَنَحْوَ ذَلِكَ وَيُنْهَى عَنْ ذَلِكَ فَإِنْ لَمْ يَنْتَهِ قُوتِلَ وَإِنْ لَمْ يَنْدَفِعْ شَرُّهُ إِلَّا بِقَتْلِهِ فَقُتِلَ كَانَ هَدَرًا &#8230; مَعْنَاهُ إِذَا لَمْ يَنْدَفِعْ إِلَّا بِذَلِكَ<\/p>\n<p>In this is the command to fight those who rebel against the leader or intend to divide the Muslim community and so on. He is prohibited from rebelling and if he does not relent, then he is fought. If his evil cannot be averted except by killing him, then he is to be killed without retaliation&#8230; The meaning is that he should be killed only if he will not relent except by that.<\/p>\n<p>Source: Sharh Sahih Muslim 1852<\/p><\/blockquote>\n<p>These traditions make clear that the command to have one ruler is meant to prevent civil war and insurgency between Muslim political factions. If the community had two executive authorities in a single region, then any conflict that arises between them would cause serious dysfunction. In fact, no company or country or organization can manage its affairs in this way. Common sense tells us that any effective organization needs a single executive leader who directs their subordinate chain of command.<\/p>\n<p>However, scholars recognized that Islam accommodates reality and the fact is that throughout most of Islamic history it has not been possible for Muslims to be united under one ruler or Caliph. The scholars said it is permissible for Muslims to have more than one ruler when the countries are separated by geography or in cases of necessity.<\/p>\n<p>According to the Kuwaiti Encyclopedia of Islamic Law:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَذَهَبَ الْمَالِكِيَّةُ إِلَى أَنَّهُ إِذَا تَبَاعَدَتِ الْبِلَادُ وَتَعَذَّرَتِ الِاسْتِنَابَةُ جَازَ تَعَدُّدُ الْأَئِمَّةِ بِقَدْرِ الْحَاجَةِ وَهُوَ قَوْلٌ عِنْدَ الشَّافِعِيَّةِ<\/p>\n<p>The Maliki scholars maintain that if two lands are far apart and it would be impossible to exercise authority, then it becomes permissible to have more than one leader due to necessity. This is likewise an opinion among the Shafi’ee scholars.<\/p>\n<p>Source: Mawsu’at Al-Fiqhiya 7\/286<\/p><\/blockquote>\n<p>Al-Qurtubi comments on the traditions previously cited, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا أَدَلُّ دَلِيلٍ عَلَى مَنْعِ إِقَامَةِ إِمَامَيْنِ وَلِأَنَّ ذَلِكَ يُؤَدِّي إِلَى النِّفَاقِ وَالْمُخَالَفَةِ وَالشِّقَاقِ وَحُدُوثِ الْفِتَنِ وَزَوَالِ النِّعَمِ لَكِنْ إِنْ تَبَاعَدَتِ الْأَقْطَارُ وَتَبَايَنَتْ كَالْأَنْدَلُسِ وَخُرَاسَانَ جَازَ ذَلِكَ<\/p>\n<p>This is evidence for the prohibition of having two leaders because that would support hypocrisy, disputes, dissension, the occurrence of tribulations, and the removal of blessings. However, if the lands are far apart and disparate such as Al-Andalus and Khorasan, then it becomes permissible.<\/p>\n<p>Source: Tafseer Al-Qurtubi 2:30<\/p><\/blockquote>\n<p>The reality of our situation is that the world has become more complex in numerous ways such that uniting Muslims politically through the traditional method of election (<em>ahl al-hall wa al-‘aqd<\/em>) is not a reasonable expectation. Necessity demands that we accept the validity of the various governments in the Muslim world and work towards greater cooperation and unity by peaceful means.<\/p>\n<p>Ash-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما بعد انتشار الإسلام واتساع رقعته وتباعد أطرافه فمعلوم أنه قد صار في كل قطر أو أقطار الولاية إلى إمام أو سلطان وفي القطر الآخر أو الأقطار كذلك ولا ينفذ لبعضهم أمر ولا نهي في قطر الآخر وأقطاره التي رجعت إلى ولايته فلا بأس بتعدد الأئمة والسلاطين ويجب الطاعة لكل واحد منهم بعد البيعة له على أهل القطر الذي ينفذ فيه أوامره ونواهيه وكذلك صاحب القطر الآخر<\/p>\n<p>After Islam and its territories expanded and its regions became distance, it is known that there had appeared in every country a state under the authority of a leader or ruler and likewise in other countries. They did not implement the orders of a country that referred to another authority. Thus, there is nothing wrong with having multiple leaders and rulers. It is an obligation for everyone in the country in which the orders of a ruler are implemented to obey them after pledging allegiance to them. It is likewise an obligation for the residents of another country.<\/p>\n<p>Source: As-Sayl Al-Jarrar 1\/941<\/p><\/blockquote>\n<p>As such, we must take a firm stand against violent extremists who misuse texts of Islamic law in their propaganda to convince Muslims to wage war against existing governments until the Caliphate (<em>khilafah<\/em>) is established by force. This is the affair of the Kharijites, the violent rebels in early Islam and today, that they declare Muslim rulers to be unbelievers so that they can usurp power and authority for themselves.<\/p>\n<p>Wahb ibn Munabbih, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإذا لقام أكثر من عشرة أو عشرين رجلا ليس منهم رجل إلا وهو يدعو إلى نفسه بالخلافة ومع كل رجل منهم أكثر من عشرة آلاف يقاتل بعضهم بعضا ويشهد بعضهم على بعض بالكفر<\/p>\n<p>If there were to arise among the Khawarij ten or twenty men, there would not be a man among them except that he would claim the Caliphate for himself. With each man among them would be ten thousand others, all of them fighting each other and charging each other with unbelief.<\/p>\n<p>Source: Ta’reekh Dimshaq 69290<\/p><\/blockquote>\n<p>Rather, the authentic Caliphate which exists to serve Islam and Muslims and humanity at large can only be established by consultation and valid legal means, not by force or terrorism.<\/p>\n<p>Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ بَايَعَ رَجُلاً عَنْ غَيْرِ مَشُورَةٍ مِنَ الْمُسْلِمِينَ فَلاَ يُبَايَعُ هُوَ وَلاَ الَّذِي بَايَعَهُ تَغِرَّةً أَنْ يُقْتَلاَ<\/p>\n<p>Whoever pledges allegiance to a man without consulting the Muslims, then there is to be no allegiance for him nor for the one who pledged, lest they both be killed.<\/p>\n<p>Source: Sahih Bukhari 6442, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Moreover, a fundamental flaw in the ideology of these violent extremists is that they have given the matter of government more importance than it deserves, even to the point of neglecting essential aspects of faith, ethics, and spirituality. Matters of government are secondary issues in relation to matters of faith. Ibn Taymiyyah wrote at length against such people who exaggerate the status of leadership in Islam.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ قَوْلَ الْقَائِلِ إِنَّ مَسْأَلَةَ الْإِمَامَةِ أَهَمُّ الْمَطَالِبِ فِي أَحْكَامِ الدِّينِ وَأَشْرَفُ مَسَائِلِ الْمُسْلِمِينَ كَذِبٌ كَاذِبٌ بِإِجْمَاعِ الْمُسْلِمِينَ سُنِّيِّهِمْ وَشِيعِيِّهِمْ بَلْ هَذَا هُوَ كُفْرٌ … أَنْ يُقَالَ الْإِيمَانُ بِاللَّهِ وَرَسُولِهِ فِي كُلِّ زَمَانٍ وَمَكَانٍ أَعْظَمُ مِنْ مَسْأَلَةِ الْإِمَامَةِ فَلَمْ تَكُنْ فِي وَقْتٍ مِنَ الْأَوْقَاتِ لَا الْأَهَمَّ وَلَا الْأَشْرَفَ<\/p>\n<p>The one who says that the matter of leadership is the greatest demand and the most noble of the rulings of the religion has lied according to the consensus of the Muslims, the Sunnis and Shi’ites among them. Rather, it is an act of unbelief because faith in Allah and His Messenger is more important than the matter of leadership, and this is necessarily known to be part of the religion of Islam… It should be said that faith in Allah and His Messenger is more important than the issue of leadership in every time and place. Indeed, leadership will never be more important or more noble at any time.<\/p>\n<p>Source: Minhaj As-Sunnah 1\/75-78<\/p><\/blockquote>\n<p>Since political matters are secondary in Islam, it follows that there is no justification for excommunicating Muslims as unbelievers (<em>takfir<\/em>) and justifying violence against them due to their variant political opinions.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">واعلم أن الخطأ في الإمامة وتعيينها وشروطها وما يتعلق به لا يوجب شيئ منه تكفيراً فقد أنكر ابن كيسان أصل وجوب الإمامة ولا يلزم تكفيره ولا يلتفت إلى قوم يعظمون أمر الإمامة ويجعلون الإيمان بالإمام مقروناً بالإيمان بالله ورسوله ولا إلى خصومهم المكفرين لهم بمجرد مذهبهم في الإمامة فكل ذلك إسراف إذ ليس في واحد من القولين تكذيب للرسول صلى الله عليه وسلم أصلاً<\/p>\n<p>Know that errors in the matter of leadership, its specifics, its conditions, and what is related to it does not in any way necessitate excommunication. Ibn Al-Kaysan had entirely rejected the obligation of establishing leadership but this was not cause for his excommunication. Neither does it apply to people who exaggerate the matter of leadership and make recognition of the Imam equal to faith in Allah and His Messenger. Neither does it apply to those who oppose them and excommunicate them due to their doctrine of the Imamate. Each of their positions is extreme, yet none of their opinions involves denying the Messenger of Allah.<\/p>\n<p>Source: Faysal At-Tafriqa 13<\/p><\/blockquote>\n<p>The correct method of political reform in Islam begins with spiritual reform. We first have to understand and practice the basics of our faith correctly, the pillars of Islam and its noble ethics, and purify our hearts of spiritual diseases like malice, envy, greed, and arrogance. If we make our faith and the Hereafter our ultimate concern, then the Prophet promises us that Allah will take care of our worldly affairs.<\/p>\n<p>Zaid ibn Thabit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَتْ الدُّنْيَا هَمَّهُ فَرَّقَ اللَّهُ عَلَيْهِ أَمْرَهُ وَجَعَلَ فَقْرَهُ بَيْنَ عَيْنَيْهِ وَلَمْ يَأْتِهِ مِنْ الدُّنْيَا إِلَّا مَا كُتِبَ لَهُ وَمَنْ كَانَتْ الْآخِرَةُ نِيَّتَهُ جَمَعَ اللَّهُ لَهُ أَمْرَهُ وَجَعَلَ غِنَاهُ فِي قَلْبِهِ وَأَتَتْهُ الدُّنْيَا وَهِيَ رَاغِمَةٌ<\/p>\n<p><strong>Whoever makes the world his more important matter, Allah will confound his affairs and make poverty appear before his eyes and he will not get anything from the world except what has been decreed for him. Whoever makes the Hereafter his most important matter, Allah will settle his affairs and make him content in his heart and the world will come to him although he does not want it.<\/strong><\/p>\n<p>Source: Sunan Ibn Majah 4105, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/08\/11\/hadith-on-hereafter-whoever-makes-the-hereafter-important-allah-takes-care-of-his-affairs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sufyan Ath-Thawri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْمَلْ لِآخِرَتِكَ يَكْفِكَ اللَّهُ أَمْرَ دُنْيَاكَ بِعْ دُنْيَاكَ بِآخِرَتِكَ تَرْبَحْهُمَا جَمِيعًا<\/p>\n<p>Work for your Hereafter and Allah will suffice your affairs in this world. Sell your worldly life for your Hereafter and you will profit in them both entirely.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/02\/01\/sufyan-on-hereafter-take-care-of-your-hereafter-and-allah-will-take-care-of-your-life\/\">Hilyat Al-Awliya 35<\/a><\/p><\/blockquote>\n<p>Therefore, we need to campaign for spiritual reform in our societies at a grassroots level, one Muslim at a time, until we achieve the strength of faith needed to precede political unity. Focusing on political matters at the expense of spiritual matters will not produce success in this world or in the Hereafter. Allah tells us that He will not change the worldly condition of people for the better until they purify their hearts.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنفُسِهِمْ<\/p>\n<p><strong>Verily, Allah will not change the condition of a people until they change what is in themselves.<\/strong><\/p>\n<p>Surat Ar-Ra’d 13:11<\/p><\/blockquote>\n<p>In conclusion, it is very important for Muslims to be united as much as possible but it is permissible to have more than one ruler or government in the case of necessity. Our current situation requires us to accept the validity of Muslim governments and to work toward achieving greater unity by peaceful means, the foremost of which is strengthening our faith, purifying our hearts, and preaching Islam in a beautiful manner.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not be among those who commit idolatry&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[14,61,18,19,99,27,30,32,34,37,41,43,120,51,55,93,56,60,84,67,121,73,98,332],"class_list":["post-16316","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-arrogance-al-takabbur","tag-call-to-islam-dawah","tag-community-jamaah","tag-consultation-shura","tag-excommunication-takfir","tag-god-fearing-taqwa","tag-hatred-bigdah","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-idolatry-shirk","tag-imam-al-shafii","tag-imam-malik","tag-rebels-khawarij","tag-leadership-imamate","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-prayer-salat","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-repentance-al-tawbah","tag-terrorism-al-irhab","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4fa","jetpack-related-posts":[{"id":14171,"url":"https:\/\/www.abuaminaelias.com\/islam-forbids-violent-rebellion\/","url_meta":{"origin":16316,"position":0},"title":"Non-Violent Reform of Unjust Muslim Rulers","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"You should listen and obey, even if they strike your back.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16316,"position":1},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21142,"url":"https:\/\/www.abuaminaelias.com\/obedience-to-unjust-muslim-rulers\/","url_meta":{"origin":16316,"position":2},"title":"Obedience to Unjust Muslim Rulers","author":"Abu Amina Elias","date":"September 11, 2019","format":false,"excerpt":"\"There is no obedience if it is disobedience to Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":16316,"position":3},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":16316,"position":4},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":16316,"position":5},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16316","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16316"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16316\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16316"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16316"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16316"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}