{"id":16439,"date":"2015-03-30T11:20:03","date_gmt":"2015-03-30T07:20:03","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16439"},"modified":"2020-07-17T22:03:11","modified_gmt":"2020-07-17T18:03:11","slug":"easy-good-deeds-with-great-rewards","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/easy-good-deeds-with-great-rewards\/","title":{"rendered":"Easy good deeds with great rewards"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Allah has made many good deeds for us, acts of worship and kindness towards others, which are easy to do and are greatly rewarded. These deeds might appear small in the sight of people but they can become as heavy as mountains on the scale of good on the Day of Resurrection. We should become familiar with them so we can practice them daily and thereby earn their blessings.<\/p>\n<p>Perhaps the easiest deeds for us to do are to fill our days with supplications, praising and glorifying Allah morning and night. Every supplication will be counted among our good deeds and will erase our sins. Of course, we must not merely say them outwardly as we must also be sincere and act upon the meaning of these supplications.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَلِمَتَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ خَفِيفَتَانِ عَلَى اللِّسَانِ ثَقِيلَتَانِ فِي الْمِيزَانِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ<\/p>\n<p><strong>Two words are beloved to the Most Merciful. They are light on the tongue but heavy on the scale: glory and praise to Allah, and glory to Allah the Almighty.<\/strong><\/p>\n<p>Source: Sahih Bukhari 7124, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/05\/hadith-on-supplication-two-phrases-are-light-on-the-tongue-but-heavy-on-the-scale-of-good-deeds\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ فِي يَوْمٍ مِائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ وَلَمْ يَأْتِ أَحَدٌ أَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ وَمَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ<\/p>\n<p><strong>Whoever declares there is no god but Allah, He is one without partner, to Him is the sovereignty and praise and He is powerful over everything one hundred times a day, then he will have the reward of emancipating ten slaves, a hundred good deeds will be recorded for him, a hundred sins will be erased from his record, and he will be guarded from the devil during the day until evening. No one will exceed him except one who recited these words more often. Whoever declares the glory of Allah one hundred times a day, his sins will be erased even if they are like the foam of the ocean.<\/strong><\/p>\n<p>Source: Sahih Muslim 2691, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/09\/hadith-on-remembrance-whoever-declares-the-glory-of-allah-will-have-his-sins-erased\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَدُلُّكَ عَلَى كَلِمَةٍ هِيَ كَنْزٌ مِنْ كُنُوزِ الْجَنَّةِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ<\/p>\n<p><strong>Shall I not tell you about a treasure among the treasures of Paradise? Say: There is no power or might but with Allah.<\/strong><\/p>\n<p>Source: Sahih Bukhari 3910, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/02\/01\/hadith-on-supplications-do-not-supplicate-so-loudly-for-allah-is-hearing-and-seeing\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Spending time in the mosques, the houses of Allah, is an easy way to earn great rewards. In fact, every step we take towards the mosque will raise us a degree and expiate a minor sin.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَطَهَّرَ فِي بَيْتِهِ ثُمَّ مَشَى إِلَى بَيْتٍ مِنْ بُيُوتِ اللَّهِ لِيَقْضِيَ فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ كَانَتْ خَطْوَتَاهُ إِحْدَاهُمَا تَحُطُّ خَطِيئَةً وَالْأُخْرَى تَرْفَعُ دَرَجَةً<\/p>\n<p><strong>Whoever purifies himself for ablution in his house and he walks to a house among the houses of Allah in order to fulfill an obligation among the obligations of Allah, then one step of his will expiate his sins and another step will elevate his status.<\/strong><\/p>\n<p>Source: Sahih Muslim 666, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/06\/hadith-on-prayer-reward-for-performing-ablution-and-walking-to-the-mosque-for-prayer\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Performing the five daily prayers with their due reverence, being sincere inwardly and perfecting their outward form, is like bathing in a river five times a day. When these prayers are performed in an excellent manner, they clean our souls from spiritual sins and expiate our minor sins such that we are left pure in heart.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتُمْ لَوْ أَنَّ نَهَرًا بِبَابِ أَحَدِكُمْ، يَغْتَسِلُ فِيهِ كُلَّ يَوْمٍ خَمْسًا مَا تَقُولُ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ‏<\/p>\n<p><strong>If there was a river at the door of anyone of you and he took a bath in it five times a day, would you notice any dirt on him?<\/strong><\/p><\/blockquote>\n<p>They said, “Not a trace of dirt would be left.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَذَلِكَ مِثْلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللَّهُ بِهَا الْخَطَايَا<\/p>\n<p><strong>That is the example of the five prayers with which Allah erases evil deeds.<\/strong><\/p>\n<p>Source: Sahih Bukahri 505, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/04\/the-five-prayers-remove-sins-like-water-removes-dirt\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>After the prayer, we should not rush back to our worldly affairs so quickly without remembering Allah. Just as we need a “cool down” exercise after a workout in the gym, we should perform a spiritual cool down exercise after prayer by glorifying, praising, and exalting Allah ten times, but preferably up to thirty three times or more. However, many of us lose this opportunity as Satan distracts us with some worldly need after prayer.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تُسَبِّحُونَ وَتُكَبِّرُونَ وَتَحْمَدُونَ دُبُرَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ مَرَّةً<\/p>\n<p><strong>Glorify and exalt and praise Allah thirty three times after every prayer.<\/strong><\/p>\n<p>Source: Sahih Muslim 595, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/09\/hadith-on-prayer-glorify-and-praise-allah-thirty-three-times-after-every-prayer\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَصْلَتَانِ أَوْ خَلَّتَانِ لَا يُحَافِظُ عَلَيْهِمَا رَجُلٌ مُسْلِمٌ إِلَّا دَخَلَ الْجَنَّةَ هُمَا يَسِيرٌ وَمَنْ يَعْمَلُ بِهِمَا قَلِيلٌ تُسَبِّحُ اللَّهَ عَشْرًا وَتَحْمَدُ اللَّهَ عَشْرًا وَتُكَبِّرُ اللَّهَ عَشْرًا فِي دُبُرِ كُلِّ صَلَاةٍ فَذَلِكَ مِائَةٌ وَخَمْسُونَ بِاللِّسَانِ وَأَلْفٌ وَخَمْسُ مِائَةٍ فِي الْمِيزَانِ وَتُسَبِّحُ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدُ ثَلَاثًا وَثَلَاثِينَ وَتُكَبِّرُ أَرْبَعًا وَثَلَاثِينَ عَطَاءٌ لَا يَدْرِي أَيَّتُهُنَّ أَرْبَعٌ وَثَلَاثُونَ إِذَا أَخَذَ مَضْجَعَهُ فَذَلِكَ مِائَةٌ بِاللِّسَانِ وَأَلْفٌ فِي الْمِيزَانِ فَأَيُّكُمْ يَعْمَلُ فِي الْيَوْمِ أَلْفَيْنِ وَخَمْسَ مِائَةِ سَيِّئَةٍ<\/p>\n<p><strong>There are two practices that will admit a Muslim into Paradise if he preserves them both. They are easy although those who practice them are few. It is to glorify Allah ten times and to praise Allah ten times and to exalt Allah ten times at the end of every prayer, for it is one hundred and fifty upon the tongue but one thousand five hundred upon the scale. And it is to glorify Allah thirty three times and to praise Allah thirty three times and to exalt Allah thirty four times when going to sleep, for it is one hundred upon the tongue and one thousand upon the scale. So which of you would commit two thousand five hundred sins in a day?<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, how are they easy but few practice them?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَأْتِي أَحَدَكُمْ الشَّيْطَانُ إِذَا فَرَغَ مِنْ صَلَاتِهِ فَيُذَكِّرُهُ حَاجَةَ كَذَا وَكَذَا فَيَقُومُ وَلَا يَقُولُهَا فَإِذَا اضْطَجَعَ يَأْتِيهِ الشَّيْطَانُ فَيُنَوِّمُهُ قَبْلَ أَنْ يَقُولَهَا<\/p>\n<p><strong>Satan comes to one of you during prayer and incites him to remember a need so he leaves the prayer without saying them, and Satan comes to him when he goes to bed and lulls him to sleep without saying them.<\/strong><\/p>\n<p>Source: Musnad Ahmad 6871, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/07\/22\/hadith-on-remembrance-acts-of-remembrance-are-easy-and-rewarding-but-satan-causes-forgetfulness\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In addition to the five prayers, we should accustom ourselves to praying the voluntary Sunan prayers throughout the day. Whoever makes it a regular practice to pray twelve voluntary bowings (<em>raka&#8217;at<\/em>) a day will have a house built for them in Paradise.<\/p>\n<p>Umm Habiba reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ عَبْدٍ مُسْلِمٍ يُصَلِّي لِلَّهِ كُلَّ يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا غَيْرَ فَرِيضَةٍ إِلَّا بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ أَوْ إِلَّا بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ<\/p>\n<p><strong>There is no Muslim servant who prays for Allah twelve bowings every day in addition to what is obligatory except that Allah will build for him a house in Paradise.<\/strong><\/p><\/blockquote>\n<p>Umm Habiba said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَا بَرِحْتُ أُصَلِّيهِنَّ بَعْدُ<\/p>\n<p>I have never abandoned praying them after this.<\/p>\n<p>Source: Sahih Muslim 728, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/03\/23\/hadith-on-prayer-a-muslim-who-prays-twelve-voluntary-rakaat-in-every-day-is-rewarded-with-paradise\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَلَّى فِي يَوْمٍ وَلَيْلَةٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ<\/p>\n<p><strong>Whoever prays twelve additional bowings in a day and night will have a house built for him in Paradise: four before noon prayer<\/strong> <strong>and two after it, two after sunset prayer<\/strong>, <strong>two after evening prayer<\/strong>, <strong>and two before dawn prayer<\/strong>.<\/p>\n<p>Source: Sunan At-Tirmidhi 415, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Recitation of the Quran is a very easy way to earn tremendous rewards. Every letter we recite will be recorded as ten good deeds and each verse we memorize will raise us a degree in Paradise.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا لَا أَقُولُ الم حَرْفٌ وَلَكِنْ أَلِفٌ حَرْفٌ وَلَامٌ حَرْفٌ وَمِيمٌ حَرْفٌ<\/p>\n<p><strong>Whoever recites a letter from the Book of Allah, he will receive one good deed as ten good deeds like it. I do not say that Alif Lam Meem is one letter, but rather Alif is a letter, Lam is a letter, and Meem is a letter.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2910, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/16\/hadith-on-quran-those-who-recite-a-single-letter-will-be-rewarded-with-ten-good-deeds\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُقَالُ لِصَاحِبِ الْقُرْآنِ اقْرَأْ وَارْتَقِ وَرَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَتَكَ عِنْدَ آخِرِ آيَةٍ تَقْرَأُ بِهَا<\/p>\n<p><strong>It will be said to the companion of the Quran: Recite and ascend as you recited in the world. Verily, your rank is determined by the last verse you recite.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2914, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/16\/hadith-on-quran-read-the-quran-and-ascend-through-the-levels-of-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even if reciting the Quran is very difficult for those of us who do not know Arabic, we should remember that the reward will be doubled.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَثَلُ الَّذِي يَقْرَأُ وَهُوَ يَتَعَاهَدُهُ وَهُوَ عَلَيْهِ شَدِيدٌ فَلَهُ أَجْرَانِ<\/p>\n<p><strong>The example of one who recites the Quran and he is committed to it and it is very difficult for him is that of one who receives a double reward.<\/strong><\/p>\n<p>Source: Sahih Bukhari 4653, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/11\/hadith-on-quran-reciters-of-the-quran-will-be-with-noble-scribes-with-a-double-reward\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Greeting our brothers and sisters with peace is an easy way to spread love between members of the community and earn good deeds. If we extend the greeting as “peace be upon you and the mercy of Allah and His blessings” (<em>as-salaamu alaykum wa rahmatullahi wa barakatuhu<\/em>) we will earn thirty good deeds each time.<\/p>\n<p>Imran ibn Hussein reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “Peace be upon you.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَشْرٌ<\/p>\n<p><strong>Ten good deeds.<\/strong><\/p><\/blockquote>\n<p>Then another man came to the Prophet and he said, “Peace be upon you and the mercy of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عِشْرُونَ<\/p>\n<p><strong>Twenty good deeds.<\/strong><\/p><\/blockquote>\n<p>Then another man came to the Prophet and he said, “Peace be upon you and the mercy of Allah and His blessings.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثُونَ<\/p>\n<p><strong>Thirty good deeds.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2689, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/09\/hadith-on-greetings-the-best-greeting-is-peace-mercy-and-blessings-from-allah-be-upon-you\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Fasting might be a difficult deed for many people but after practice it can become easy. We should remember that fasting a single day will remove us from Hellfire by a distance of seventy years, an enormous blessing for comparatively little effort.<\/p>\n<p>Abu Sa’eed reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اللَّهِ إِلَّا بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا<\/p>\n<p><strong>There is no servant who fasts a day in the way of Allah except that Allah will distance his face from the Hellfire by a length of seventy years of travel.<\/strong><\/p>\n<p>Source: Sahih Muslim 1153, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/24\/hadith-on-fasting-a-muslim-who-fasts-will-be-distanced-from-the-hellfire\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This great reward can be acquired even more easily if we fast during the short winter days.<\/p>\n<p>Anas reported: Abu Huraira, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلا أَدُلُّكُمْ عَلَى غَنِيمَةٍ بَارِدَةٍ<\/p>\n<p>Shall I tell you about easy spoils?<\/p><\/blockquote>\n<p>They said, “O Abu Huraira, what are they?” Abu Huraira said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّوْمُ فِي الشِّتَاءِ<\/p>\n<p>Fasting in the winter.<\/p>\n<p>Source: Hilyat Al-Awliya 1356, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/12\/09\/hadith-on-fasting-easy-rewards-for-fasting-during-the-short-winter-days\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Finally, we should perform acts of kindness for others and even animals. A small act of kindness might seem trivial to people but they are great in the sight of Allah, as some people have entered Paradise due to such deeds.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ ثُمَّ خَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنْ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنْ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ مِنِّي فَنَزَلَ الْبِئْرَ فَمَلَأَ خُفَّهُ مَاءً ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ<\/p>\n<p><strong>Once a man suffered from thirst while he was walking on a journey. When he found a well, he climbed down into it and drank from it. Then he came out and saw a dog lolling its tongue from thirst and licking the ground. The man said: This dog has suffered thirst just as I have suffered from it. He climbed down into the well, filled his shoe with water, and caught it in his mouth as he climbed up. Then he gave the dog a drink. Allah appreciated this deed, so He forgave him.<\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, is there a reward for charity even for the animals?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ<\/p>\n<p><strong>In every living being there is a reward for charity.<\/strong><\/p>\n<p>Source: Sahih Muslim 2244, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/30\/hadith-on-animals-a-man-was-forgiven-because-he-was-merciful-to-a-thirsty-dog\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This man went to Paradise because of his act of kindness for a dog, so how much greater are acts of kindness toward people?<\/p>\n<p>Allah rebukes those Muslims who pray outwardly but their superficial prayer does not lead them to give “simple assistance” or “small kindnesses” (<em>al-ma’un<\/em>) towards others.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَوَيْلٌ لِّلْمُصَلِّينَ الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ الَّذِينَ هُمْ يُرَاءُونَ وَيَمْنَعُونَ الْمَاعُونَ<\/p>\n<p><strong>Woe to those who pray, who are heedless of their prayer, who pray to be seen and withhold simple assistance.<\/strong><\/p>\n<p>Surat Al-Ma’un 107:4-7<\/p><\/blockquote>\n<p>Ibn Kathir reported: Ibn Mas’ud, may Allah be pleased with him, explained the meaning of simple assistance by saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> هُوَ مَا يَتَعَاطَاهُ النَّاسُ بَيْنَهُمْ مِنَ الْفَأْسِ وَالْقِدْرِ وَالدَّلْوِ وَأَشْبَاهِ ذَلِكَ<\/p>\n<p>They are the things people give each other, such as an axe, a pot, a bucket, and similar items.<\/p>\n<p>Source: Tafseer Ibn Kathir 107:7<\/p><\/blockquote>\n<p>Simple help for our neighbors is a great way to earn the pleasure of Allah, yet to withhold such easy deeds is an act of extreme miserliness and hypocrisy.<\/p>\n<p>Rather, the Prophet told us that even half of a date in charity or a kind word might tip the scale in our favor on the Day of Resurrection, so we should never belittle any good deed no matter how small we might think it is.<\/p>\n<p>Adi ibn Hatim reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ<\/p>\n<p><strong>Protect yourself from the Hellfire even with half of a date in charity, and if he cannot find it then with a kind word.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6195, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/14\/hadith-on-charity-save-yourself-from-hellfire-by-giving-half-of-a-date-in-charity\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>We ask Allah to guide us and facilitate us towards such deeds that are pleasing to Him and easy for us in this world.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Glorify and exalt and praise Allah thirty three times after every prayer.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[160,317,324,17,85,49,135,32,95,100,54,56,126,134,59,60,45,66,68,70,220],"class_list":["post-16439","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-ablution-wudu","tag-animals","tag-blessings-al-barakah","tag-charity-al-sadaqah","tag-fasting-al-siyam","tag-gentleness-al-rifq","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-hypocrisy-al-nifaq","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-neighbors","tag-paradise-jannah","tag-peace","tag-prayer-salat","tag-quran-exegesis-tafsir","tag-remembrance-dhikr","tag-satan-al-shaytan","tag-sincerity-al-ikhlaas","tag-supplication-al-dua"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4h9","jetpack-related-posts":[{"id":15748,"url":"https:\/\/www.abuaminaelias.com\/allah-multiplies-the-reward-for-good-deeds\/","url_meta":{"origin":16439,"position":0},"title":"Allah multiplies the reward for good deeds","author":"Abu Amina Elias","date":"June 9, 2014","format":false,"excerpt":"\"Every deed of the son of Adam is multiplied from ten to seven hundred times.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20671,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-consistent-good-habits\/","url_meta":{"origin":16439,"position":1},"title":"Imam al-Mundhiri on Consistent Good Habits","author":"Abu Amina Elias","date":"July 16, 2019","format":false,"excerpt":"\"Most beloved deeds to Allah are performed regularly,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":16439,"position":2},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23179,"url":"https:\/\/www.abuaminaelias.com\/eid-dua-taqabbal-allahu-minna-wa-minkum\/","url_meta":{"origin":16439,"position":3},"title":"Eid Supplication: May Allah accept from us and from you","author":"Abu Amina Elias","date":"May 11, 2021","format":false,"excerpt":"\"May Allah accept good deeds from us and from you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16830,"url":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","url_meta":{"origin":16439,"position":4},"title":"Definition of faith in Islam","author":"Abu Amina Elias","date":"August 16, 2015","format":false,"excerpt":"\"Faith is to believe in Allah, His angels, His books...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20713,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-ten-days-of-dhul-hijjah\/","url_meta":{"origin":16439,"position":5},"title":"Imam al-Mundhiri on First Ten Days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"Not even jihad in the way of Allah,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16439","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16439"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16439\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16439"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16439"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16439"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}