{"id":16462,"date":"2015-03-31T16:27:22","date_gmt":"2015-03-31T12:27:22","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16462"},"modified":"2018-03-21T12:30:17","modified_gmt":"2018-03-21T08:30:17","slug":"charms-talismans-and-amulets-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","title":{"rendered":"Charms, talismans, and amulets in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The issue of wearing amulets and good luck charms is important to understand for a Muslim to implement the teachings of monotheism (<em>tawheed<\/em>) in his or her daily life. Many cultures have practices in which they wear accessories or seek blessings from objects, believing that these objects can ward off evil. Such practices contradict the correct understanding of the attributes of Allah, as only Allah has the absolute power to bring benefit and protect from harm.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُل لَّا أَمْلِكُ لِنَفْسِي ضَرًّا وَلَا نَفْعًا إِلَّا مَا شَاءَ اللَّهُ<\/p>\n<p><strong>Say: I have no power at all for myself to harm or benefit except as Allah wills.<\/strong><\/p>\n<p>Surat Yunus 10:49<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَدْعُ مِن دُونِ اللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَ ۖ فَإِن فَعَلْتَ فَإِنَّكَ إِذًا مِّنَ الظَّالِمِينَ<\/p>\n<p><strong>Do not invoke besides Allah that which neither benefits you nor harms you, for if you did so then you would be wrongdoers.<\/strong><\/p>\n<p>Surat Yunus 10:106<\/p><\/blockquote>\n<p>A believer should only place their hope and trust in Allah to direct destiny towards a good end. People who depend upon amulets, necklaces, trinkets, charms, spells, and other things have placed their ultimate hope and trust in them and they have ascribed to them attributes which belong to Allah alone, thereby committing an act of idolatry.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الرُّقَى وَالتَّمَائِمَ وَالتِّوَلَةَ شِرْكٌ<\/p>\n<p><strong>Verily, spells, amulets, and charms are acts of idolatry.<\/strong><\/p>\n<p>Source: Sunan Abu Dawud 3883, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/03\/31\/hadith-on-charms-spells-amulets-and-charms-are-acts-of-idolatry\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet has strongly forbidden us from using amulets and charms as a means of seeking blessings, warning that those who do so expose themselves to punishment from Allah.<\/p>\n<p>Uqbah ibn Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَعَلَّقَ تَمِيمَةً فَلَا أَتَمَّ اللَّهُ لَهُ وَمَنْ تَعَلَّقَ وَدَعَةً فَلَا وَدَعَ اللَّهُ لَهُ<\/p>\n<p><strong>Whoever hangs an amulet around his neck, then Allah will not fulfill his wishes. Whoever hangs a seashell as a charm, then Allah will not leave him without penalty.<\/strong><\/p>\n<p>Source: Musnad Ahmad 16951, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/16\/hadith-on-amulets-allah-will-punish-the-one-who-wears-an-amulet-while-believing-it-will-bring-him-benefit\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Arabs in the time of the Prophet would sometimes seek healing by resorting to spells, amulets, and charms. The Prophet told us that such practices never help cure disease but rather will lead to great loss and regret in the Hereafter.<\/p>\n<p>Imran ibn Hussein reported: The Messenger of Allah, peace and blessings be upon him, saw a man wearing a brass ring, so he asked what it was. The man said, “It is protection from my arthritis.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَا إِنَّهَا لَا تَزِيدُكَ إِلَّا وَهْنًا انْبِذْهَا عَنْكَ فَإِنَّكَ لَوْ مِتَّ وَهِيَ عَلَيْكَ مَا أَفْلَحْتَ أَبَدًا<\/p>\n<p><strong>Remove it, for it will only increase your arthritis and if you were to die wearing it you would never be successful.<\/strong><\/p>\n<p>Source: Musnad Ahmad 19498, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/16\/hadith-on-amulets-good-luck-charms-only-bring-harm-upon-one-who-believes-in-them-and-wears-them\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The same is true for the practice of seeking blessings from created objects such as trees, animals, or graves. In fact, the Prophet compared those who seek blessings from trees to the Israelites who worshiped the image of a calf.<\/p>\n<p>Abu Waqid Al-Laithi reported: When we traveled to Hunain with the Messenger of Allah, peace and blessings be upon him, we passed by a tree which the idolaters called Dhat Al-Anwat. They would hang their weapons upon it for blessings. I said, “O Messenger of Allah, make for us a blessed tree just as they have one.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سُبْحَانَ اللَّهِ هَذَا كَمَا قَالَ قَوْمُ مُوسَى اجْعَلْ لَنَا إِلَهًا كَمَا لَهُمْ آلِهَةٌ وَالَّذِي نَفْسِي بِيَدِهِ لَتَرْكَبُنَّ سُنَّةَ مَنْ كَانَ قَبْلَكُمْ<\/p>\n<p><strong>Glory be to Allah! You have said just as the people of Moses said: make for us a god as they have a god<\/strong> (7:138).<strong> By the One in whose Hand is my soul, you will follow the traditions of the people before you.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2180, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/16\/hadith-on-monotheism-whoever-seeks-blessings-from-a-created-object-is-as-if-he-has-worshipped-an-idol\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Essentially, those who rely upon spells, charms, and amulets will be entrusted to their care. They will no longer receive blessings from Allah and will be left to the amulet which can never help them. Would any of us want to be entrusted to the care of a lifeless object instead of the Merciful Lord?<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ عَقَدَ عُقْدَةً ثُمَّ نَفَثَ فِيهَا فَقَدْ سَحَرَ وَمَنْ سَحَرَ فَقَدْ أَشْرَكَ وَمَنْ تَعَلَّقَ شَيْئًا وُكِلَ إِلَيْهِ<\/p>\n<p><strong>Whoever ties a knot and blows on it has performed magic, and whoever performs magic has committed idolatry. Whoever hangs something as a charm will be entrusted to it.<\/strong><\/p>\n<p>Source: Sunan An-Nasa’i 4079, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/03\/31\/hadith-on-charms-whoever-hangs-an-amulet-will-be-entrusted-to-it\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Therefore, we must not wear charms or amulets, resort to magic spells, or seek blessings from created objects. Rather, we should put our trust and reliance in Allah alone, seek blessings from Him alone, and direct our prayers and acts of worship to Him alone.<\/p>\n<p>Regarding Quranic amulets, some of the scholars allowed them while others prohibited them.<\/p>\n<p>According to the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَّا إِذَا كَانَتِ التَّمِيمَةُ لَا تَشْتَمِلُ إِلَّا عَلَى شَيْءٍ مِنَ الْقُرْآنِ وَأَسْمَاءِ اللَّهِ تَعَالَى وَصِفَاتِهِ فَقَدِ اخْتَلَفَتِ الْآرَاءُ فِيهَا عَلَى النَّحْوِ التَّالِي ذَهَبَ الْحَنَفِيَّةُ وَالْمَالِكِيَّةُ وَالشَّافِعِيَّةُ وَأَحْمَدُ فِي رِوَايَةٍ إِلَى جَوَازِ ذَلِكَ وَهُوَ ظَاهِرُ مَا رُوِيَ عَنْ عَائِشَة وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ وَحَمَلُوا حَدِيثَ إنَّ الرُّقَى وَالتَّمَائِمَ وَالتُّوَلَةَ شِرْكٌ عَلَى التَّمَائِمِ الَّتِي فِيهَا شِرْكٌ وَالرِّوَايَةُ الْأُخْرَى عَنْ أَحْمَدَ حُرْمَةُ التَّمِيمَةِ وَهُوَ ظَاهِرُ قَوْلِ حُذَيْفَةَ وَعُقْبَةَ بْنِ عَامِرٍ وَابْنِ حَكِيمٍ وَبِهِ قَالَ ابْنُ مَسْعُودٍ وَابْنُ عَبَّاسٍ وَجَمَاعَةٌ مِنَ التَّابِعِينَ<\/p>\n<p>As for amulets which do not contain anything but verses from the Quran or the names and attributes of Allah the Exalted, there are different opinions. The Hanafi, Maliki, and Shafi’ee scholars as well as a narration from Ahmad incline towards the permissibility of that. It is the apparent meaning of what is narrated from Aisha and is likewise the opinion of Abdullah ibn Amr. They interpreted the narration that spells, amulets, and charms are idolatry to mean only amulets within which is idolatry. Another narration from Ahmad forbids amulets in general and it is the apparent meaning of the statement of Hudhaifa, Uqbah ibn Amir, and Ibn Hakeem as well as Ibn Mas’ud, Ibn Abbas, and a group of the companion’s students.<\/p>\n<p>Source: Mawsu’at Al-Fiqhiyyah 15\/23<\/p><\/blockquote>\n<p>For those who wear Quranic amulets, it should be understood that the blessings in them do not come from the object itself. Rather, the blessings are in remembering and reciting the words of Allah. There is no harm if the verses of the Quran are displayed in order to remember and recite them often, but they should not be misunderstood as being blessed simply by their presence.<\/p>\n<p>Nevertheless, many Muslims in our time do not appreciate this importance nuance and they have used Quranic amulets in the wrong manner. It should be noted that the use of Quranic amulets is not a confirmed prophetic tradition nor is it recommended, rather it is only permissible according to some scholars, and the prophetic narrations which prohibit amulets make no clear distinction in this regard. For this reason, it may be better and safer to avoid the use of Quranic amulets altogether.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever hangs something as a charm will be entrusted to it.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[324,21,32,37,38,39,41,43,100,56,57,115,92,65,66],"class_list":["post-16462","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-blessings-al-barakah","tag-creed-aqidah","tag-hereafter-akhirah","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-manners-al-adab","tag-monotheism-tawheed","tag-moses-musa","tag-people-of-the-book","tag-providence-al-qada-wal-qadr","tag-reliance-tawakkul","tag-remembrance-dhikr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4hw","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":16462,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":16462,"position":1},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14049,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-seculsion-in-the-mosque-during-ramadan-itikaf\/","url_meta":{"origin":16462,"position":2},"title":"Imam al-Nawawi on Spiritual Retreat in Ramadan, al-I’tikaf","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Prophet seeks seclusion in the last ten nights.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":16462,"position":3},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14792,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-friday-prayer-jumuah-jummah\/","url_meta":{"origin":16462,"position":4},"title":"Imam al-Nawawi on Friday Prayer, Salat al-Jumu&#8217;ah","author":"Abu Amina Elias","date":"August 23, 2013","format":false,"excerpt":"\"Verily, the best of your days is Friday.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21111,"url":"https:\/\/www.abuaminaelias.com\/fasting-muharram-day-of-ashura\/","url_meta":{"origin":16462,"position":5},"title":"Fasting in Al-Muharram and Day of &#8216;Ashura","author":"Abu Amina Elias","date":"September 7, 2019","format":false,"excerpt":"\"Best fast after Ramadan is in the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16462","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16462"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16462\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}