{"id":16556,"date":"2015-04-20T12:02:11","date_gmt":"2015-04-20T08:02:11","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16556"},"modified":"2018-03-25T16:01:39","modified_gmt":"2018-03-25T12:01:39","slug":"key-to-paradise-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","title":{"rendered":"Key to Paradise in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The key to Paradise is found in the declaration that there is nothing worthy of worship except Allah and Muhammad is the Messenger of Allah (<em>la ilaha illa Allah, Muhammad ar-rasul Allah<\/em>). This statement is the foundation of Islam, the beginning of faith, the source of virtues, and the means of happiness in the Hereafter for those who actualize its meaning.<\/p>\n<p>Uthman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنَّهُ لاَ إِلَهَ إِلاَّ اللَّهُ دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>He who died knowing that there is no God but Allah will enter Paradise.<\/strong><\/p>\n<p>Source: Sahih Muslim 26, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/12\/14\/whoever-truly-knows-allah-will-enter-paradise\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>To know Allah does not mean simply to be aware of His existence, as even Satan knows that Allah exists. Rather, to know Allah as stated in this tradition means to realize and fulfill the implications of this knowledge, its duties, its obligations, and its virtues.<\/p>\n<p>The testimony of faith is the key to Paradise, but every key must have ridges which match the lock on the door or else it will not open. Likewise, the testimony of faith has certain conditions which must be met in order to lead us to Paradise.<\/p>\n<p>Al-Bukhari reported: It was said to Wahb, “Is not the key to Paradise the declaration that there is no God but Allah?” Wahb said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلَى وَلَكِنْ لَيْسَ مِفْتَاحٌ إِلَّا لَهُ أَسْنَانٌ فَإِنْ جِئْتَ بِمِفْتَاحٍ لَهُ أَسْنَانٌ فُتِحَ لَكَ وَإِلَّا لَمْ يُفْتَحْ لَكَ<\/p>\n<p>Of course, but rather every key has ridges. If you come with the correct key, the door will be opened for you. Otherwise it will never be opened.<\/p>\n<p>Source: Sahih Bukhari 1180, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/14\/wahb-on-monotheism-the-key-to-paradise-has-teeth-so-whoever-comes-with-a-wrong-key-will-not-enter\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Faith in Allah must be sincere, without compulsion or coercion, and include two complimentary aspects: affirming worship for Allah alone and negating the worship of all other things.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِكْرَاهَ فِي الدِّينِ ۖ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَن يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ<\/p>\n<p><strong>There shall be no compulsion in the religion. The right course has become clear from the wrong. Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break, for Allah is hearing and knowing.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:256<\/p><\/blockquote>\n<p>If we say in English that &#8220;there is no God but Allah,&#8221; this is entirely true but it does not encompass the entire meaning of the Arabic phrase. Some people might mistakenly believe there is only one God but that they are allowed to worship others alongside Him. For this reason, the best translation of the testimony of faith is, “There is nothing worthy of worship except Allah.”<\/p>\n<p>Faith in Allah must include faith in Prophet Muhammad, peace and blessings be upon him, through whom Allah has been made known. The Prophet revealed to us the attributes of Allah and the correct method with which we should worship Him. Thus, our faith should conform to his beliefs and practices.<\/p>\n<p>Based upon this, the scholars noted that there are two conditions for good deeds to be acceptable to Allah: sincerity of intention (<em>ikhlas<\/em>) and conformity with the prophetic tradition (<em>sunnah<\/em>). The first concerns the inward aspects of deeds and the second concerns their outward aspects. These two conditions are embedded in the testimony of faith, as “there is nothing worthy of worship except Allah” regards sincerity and “Muhammad is the Messenger of Allah” regards following the prophetic way.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فالأول سؤال عن الإخلاص والثاني عن المتابعة فإن الله سبحانه لا يقبل عملا إلا بهما فطريق التخلص من السؤال الأول بتجريد الإخلاص وطريق التخلص من السؤال الثاني بتحقيق المتابعة وسلامة القلب من إرادة تعارض الإخلاص وهوى يعارض الاتباع فهذا حقيقة سلامة القلب الذي ضمنت له النجاة والسعادة<\/p>\n<p>The first matter concerns sincerity and the second concerns following the Messenger. Allah does not accept any action until both of these conditions are met. The method of absolution from the first question is to purify one’s sincerity such that it is for Allah alone. The method of absolution from the second question is to actualize the following of the Messenger and by securing the heart from any intent that would impair its sincerity and any base desire that would impair its following the Messenger.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-al-qayyim-on-three-types-of-hearts\/\">Ighathatul Lahfan fi Masayid ash-Shaytan 1\/7<\/a><\/p><\/blockquote>\n<p>Furthermore, the completion of monotheism (<em>tawheed<\/em>) involves the fulfillment of three categories of belief and practice:<\/p>\n<ol>\n<li>Oneness of Lordship (<em>tawheed ar-rububiyyah<\/em>),<\/li>\n<li>Oneness of Godship (<em>tawheed al-uluhiyyah<\/em>),<\/li>\n<li>Oneness of Names and Attributes (<em>tawheed asma wa sifat<\/em>).<\/li>\n<\/ol>\n<p>We must believe that Allah is the only Lord and Creator who alone deserves to be worshiped and who alone possesses divine names and attributes. We should neither ascribe divine characteristics to created beings, nor ascribe imperfect characteristics to Allah by comparing Him to the creation.<\/p>\n<p>Ibn Abi Al-‘Izz writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالتَّوْحِيدُ أَوَّلُ الْأَمْرِ وَآخِرُهُ أَعْنِي تَوْحِيدَ الْإِلَهِيَّةِ فَإِنَّ التَّوْحِيدَ يَتَضَمَّنُ ثَلَاثَ أَنْوَاعٍ أَحَدُهَا الْكَلَامُ فِي الصِّفَاتِ وَالثَّانِي تَوْحِيدُ الرُّبُوبِيَّةِ وَبَيَانُ أَنَّ اللَّهَ وَحْدَهُ خَالِقُ كُلِّ شَيْءٍ وَالثَّالِثُ تَوْحِيدُ الْإِلَهِيَّةِ وَهُوَ اسْتِحْقَاقُهُ سُبْحَانَهُ وَتَعَالَى أَنْ يُعْبَدَ وَحْدَهُ لَا شَرِيكَ لَهُ<\/p>\n<p>Monotheism is the beginning of the matter and its end. What is meant by this is the belief in the unity of God, for monotheism has three dimensions: first, matters concerning the attributes of Allah; second, the oneness of Lordship which states that Allah alone created everything; third, the oneness of Godship which states that Allah alone should be worshiped without associating any partners with Him.<\/p>\n<p>Source: Sharh Aqidah At-Tahawi 24<\/p><\/blockquote>\n<p>These three aspects are derived from numerous statements in the Quran and Sunnah. In fact, all three of them are contained in the concise saying of Allah:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ ۚ هَلْ تَعْلَمُ لَهُ سَمِيًّا<\/p>\n<p><strong>He is the Lord of the heavens and the earth and whatever is between them, so worship Him and have patience in His worship. Do you know of anything similar to Him?<\/strong><\/p>\n<p>Surat Maryam 19:65<\/p><\/blockquote>\n<p>If a Muslim fulfills these conditions of faith inwardly and outwardly, then Allah has promised that he or she will enter Paradise despite their sins.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَام فَبَشَّرَنِي أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِكَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Gabriel, upon him be peace, came to me with the good news that anyone from my nation who dies without associating partners with Allah will enter Paradise.<\/strong><\/p><\/blockquote>\n<p>I said, “Even if he commits adultery and theft?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ زَنَى وَإِنْ سَرَقَ<\/p>\n<p><strong>Even if he commits adultery and theft.<\/strong><\/p>\n<p>Source: Sahih Bukhari 1180, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/28\/hadith-on-monotheism-whoever-dies-without-associating-partners-with-allah-will-enter-paradise\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>However, this does not mean the believers will be exempt from Hellfire entirely. The believers who commit major sins will be punished in Hellfire until they are justly recompensed for their crimes.<\/p>\n<p>An-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهُوَ حُجَّةٌ لِمَذْهَبِ أَهْلِ السَّنَةِ أَنَّ أَصْحَابَ الْكَبَائِرِ لَا يُقْطَعُ لَهُمْ بِالنَّارِ وَأَنَّهُمْ إِنْ دَخَلُوهَا أُخْرِجُوا مِنْهَا وَخُتِمَ لَهُمْ بِالْخُلُودِ فِي الْجَنَّةِ<\/p>\n<p>This is a proof for the people of the Sunnah, that those who commit major sins will not remain in the Hellfire forever. If they enter it, they will be taken out and eventually admitted into Paradise.<\/p>\n<p>Source: Sharh Sahih Muslim 94<\/p><\/blockquote>\n<p>We should not take this matter lightly and indulge in sins believing we will eventually enter Paradise, because even a single moment in the Hellfire will be so terrible that all pleasures we enjoyed by sinning will become worthless and a source of intense regret.<\/p>\n<p>Therefore, our ultimate goal should be the full completion and actualization of true faith such that we will enter Paradise without any reckoning in the Hellfire. Our worship of Allah necessarily involves upholding the rights of humanity and creation in general and practicing virtues such as charity, justice, mercy, forgiveness and patience. We will find numerous verses in the Quran in which the worship of Allah is mentioned alongside such good deeds.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَن كَانَ مُخْتَالًا فَخُورًا<\/p>\n<p><strong>Worship Allah and associate nothing with Him and be good to parents and to relatives, orphans, the needy, the near neighbor, the far neighbor, the companion at your side, the traveler, and those whom your right hands possess. Verily, Allah does not like those who are deluding and boastful.<\/strong><\/p>\n<p>Surat An-Nisa 4:36<\/p><\/blockquote>\n<p>There are likewise traditions in which the Prophet described certain virtues and deeds as acts of faith.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother or his neighbor what he loves for himself.<\/strong><\/p>\n<p>Source: Sahih Muslim 45, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>No one has true and complete faith until he loves for all people what he loves for himself of goodness. This general good will for all humanity is an essential component of sincere faith. The believing monotheists who do not have this quality are still considered believers, but their faith is weak and deficient.<\/p>\n<p>The believers must continue acquiring, developing, and practicing the virtues of faith and purifying their hearts until they reach a state of spiritual excellence (<em>ihsan<\/em>) such that they worship Allah as if they can see Him. This is the highest state of righteousness the believers can achieve as all of their deeds will be pleasing to Allah.<\/p>\n<p>Ibn Taymiyyah concisely describes this behavior of the righteous believers, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَنْدُبُونَ إِلَى أَنْ تَصِلَ مَنْ قَطَعَكَ وَتُعْطِيَ مَنْ حَرَمَكَ وَتَعْفُوَ عَمَّنْ ظَلَمَكَ‏‏ وَيَأْمُرُونَ بِبِرِّ الْوَالِدَيْنِ وَصِلَةِ الأَرْحَامِ وَحُسْنِ الْجِوَارِ وَالإِحْسِانِ إلَى الْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ وَالرِّفْقِ بِالْمَمْلُوكِ‏ وَيَنْهَوْنَ عَنِ الْفَخْرِ وَالْخُيَلاءِ وَالْبَغْيِ وَالاسْتِطَالَةِ عَلَى الْخَلْقِ بِحَقٍّ أَوْ بِغَيْرِ حَقٍّ وَيَأْمُرُونَ بِمَعَالِي الأَخْلاَقِ وَيَنْهَوْنَ عَنْ سَفْسَاِفِهَا‏‏ وَكُلُّ مَا يَقُولُونَهُ وَيَفْعَلُونَهُ مِنْ هَذَا وَغَيْرِهِ فَإِنَّمَا هُمْ فِيهِ مُتَّبِعُونَ لِلْكِتَابِ وَالسُّنَّةِ وَطَرِيقَتُهُمْ هِيَ دِينُ الإسْلاَمِ الَّذِي بَعَثَ اللهُ بِهِ مُحَمَّدًا صلى الله عليه وسلم<\/p>\n<p>The believers encourage people to reconcile relations with those who have cut them off, to give charity to those who have deprived them, and to forgive those who have oppressed them. They order people to be benevolent with parents, to uphold ties of family, to be good with neighbors, to be kind with orphans, travelers and the poor, and to be gentle with servants. They forbid bragging, arrogance and transgression. They discourage people from feeling superior over others, rightly or wrongly. And they bid people use lofty manners and prohibit them from pursuing trifles. All that they say or do from these virtues and other teachings, in all of it they follow the Book and the Sunnah. Their path is the religion of Islam with which Allah has sent Muhammad, peace be blessings be upon him.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ibn-taymiyyah-reconcile-charity-good-character\/\">Al-Aqidah Al-Wasitiyyah 71<\/a><\/p><\/blockquote>\n<p>The sacred journey of Islam begins with the testimony of faith and proceeds along the straight path, earning virtues and good deeds along the way, purifying the soul and achieving spiritual heights until the gates of Paradise are opened.<\/p>\n<p>We ask Allah to make us steadfast upon true faith and to endow us with such virtues which earn His pleasure and reward in the Hereafter.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[127,125,14,61,16,17,21,135,32,246,48,52,100,54,56,126,134,84,70,179],"class_list":["post-16556","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-adultery-zina","tag-gabriel-jibreel","tag-arrogance-al-takabbur","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-creed-aqidah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-intention-al-niyyah","tag-justice-adl","tag-love-al-mahabbah","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-neighbors","tag-paradise-jannah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-sincerity-al-ikhlaas","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4j2","jetpack-related-posts":[{"id":22747,"url":"https:\/\/www.abuaminaelias.com\/benefits-sunan-adhan\/","url_meta":{"origin":16556,"position":0},"title":"Benefits of the Sunan of Adhan, call to prayer","author":"Abu Amina Elias","date":"December 27, 2020","format":false,"excerpt":"\"I am pleased with Allah as Lord,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13762,"url":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","url_meta":{"origin":16556,"position":1},"title":"Salvation for non-Muslims outside of Islam?","author":"Abu Amina Elias","date":"June 8, 2013","format":false,"excerpt":"\"Allah will judge between them on the Day of Resurrection.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":16556,"position":2},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16830,"url":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","url_meta":{"origin":16556,"position":3},"title":"Definition of faith in Islam","author":"Abu Amina Elias","date":"August 16, 2015","format":false,"excerpt":"\"Faith is to believe in Allah, His angels, His books...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15651,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-integrity-istiqamah\/","url_meta":{"origin":16556,"position":4},"title":"Imam al-Nawawi on Integrity, Steadfastness","author":"Abu Amina Elias","date":"April 16, 2014","format":false,"excerpt":"\"Remain upright as you are commanded.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20421,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-modesty-haya-shamelessness\/","url_meta":{"origin":16556,"position":5},"title":"Imam al-Mundhiri on Modesty, Obscenity, and Shamelessness","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Be modest before Allah, as is his right.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16556","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16556"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16556\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16556"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16556"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16556"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}