{"id":16602,"date":"2015-04-23T11:46:46","date_gmt":"2015-04-23T07:46:46","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16602"},"modified":"2021-03-27T00:51:48","modified_gmt":"2021-03-26T20:51:48","slug":"worship-middle-night-shaban","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","title":{"rendered":"Worship in the middle night of Sha’ban"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Scholars disagreed about the virtue of praying during the night on the 15<sup>th<\/sup>&nbsp;day of Sha’ban, which is the evening after sunset prayer on the 14<sup>th<\/sup> day. The reason for their differences was due to a disagreement over the authenticity of traditions attributed to the Prophet (ṣ) in this regard.<\/p>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَطْلُعُ اللَّهُ إِلَى خَلْقِهِ فِي لَيْلَةِ النِّصْفِ مِنْ شَعْبَانَ فَيَغْفِرُ لِجَمِيعِ خَلْقِهِ إِلا لِمُشْرِكٍ أَوْ مُشَاحِنٍ<\/p>\n<p><strong>Allah looks down at His creation on the middle night of Sha’ban and He forgive all of his creatures, except for an idolater or one harboring hatred.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 5782, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/forgives-shaban-except-mushrik\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>Abu Tha’labah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَطَّلِعُ اللَّهُ عَلَى عِبَادِهِ لَيْلَةَ النِّصْفِ مِنْ شَعْبَانَ فَيَغْفِرُ لِلْمُؤْمِنِينَ وَيُمْهِلُ الْكَافِرِينَ وَيَدَعُ أَهْلَ الْحِقْدِ بِحِقْدِهِمْ حَتَّى يَدَعُوهُ<\/p>\n<p><strong>Allah looks down upon His servants in the middle night of Sha’ban. He forgives the believers, He gives respite to the unbelievers, and He abandons the people of malice to their malice until they leave it.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 590, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/leaves-people-of-grudges\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إِنَّ اللَّهَ لَيَطَّلِعُ فِي لَيْلَةِ النِّصْفِ مِنْ شَعْبَانَ فَيَغْفِرُ لِجَمِيعِ خَلْقِهِ إِلاَّ لِمُشْرِكٍ أَوْ مُشَاحِنٍ<\/p>\n<p><strong>Verily, Allah looks down on the night of the middle of Sha’ban and forgives all of his creation, except for the idolaters and those who hold grudges.<\/strong><\/p>\n<p>Source: Sunan Ibn Majah 1390, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/06\/13\/middle-shaban-forgive\/\">Hasan<\/a><\/em><\/p>\n<\/blockquote>\n<p>The middle night of Sha&#8217;ban is an excellent time to prepare our mindset for Ramadan and to purify our hearts of any hateful grudges we hold towards Muslims. Every Muslim should be paying attention to this month in anticipation of Ramadan, regardless of their opinion on the middle night.<\/p>\n<p>Scholars who do not recognize the 15<sup>th<\/sup>&nbsp;night of Sha’ban do not believe that these traditions are strong enough to warrant recognition of the night. Their concern is to preserve the integrity of the Sunnah by not possibly adding anything inauthentic to it.<\/p>\n<p>In contrast, the scholars who recognize the 15<sup>th<\/sup>&nbsp;night of Sha’ban noted that there are several reported traditions concerning it which, when added together, raise them to the level of a recommended practice.<\/p>\n<p>Al-Shafi’i writes:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَبَلَغَنَا أَنَّهُ كَانَ يُقَالُ إنَّ الدُّعَاءَ يُسْتَجَابُ فِي خَمْسِ لَيَالٍ فِي لَيْلَةِ الْجُمُعَةِ وَلَيْلَةِ الْأَضْحَى وَلَيْلَةِ الْفِطْرِ وَأَوَّلِ لَيْلَةٍ مِنْ رَجَبٍ وَلَيْلَةِ النِّصْفِ مِنْ شَعْبَانَ &#8230; وَأَنَا أَسْتَحِبُّ كُلَّ مَا حُكِيَتْ فِي هَذِهِ اللَّيَالِيِ مِنْ غَيْرِ أَنْ يَكُونَ فَرْضًا<\/p>\n<p>It has reached us that it is said supplications are answered on five nights: the night of Friday, the night of Eid al-Adha, the night of Eid al-Fitr, the first night of the month of Rajab, and the middle night of Sha’ban… I recommend everything related about these nights, without it being an obligation.<\/p>\n<p>Source: al-Umm 1\/264<\/p>\n<\/blockquote>\n<p>Moreover, there was a group of the righteous predecessors (<em>al-salaf al-salih<\/em>) who acted upon these traditions and they singled out this night for prayer, supplication, remembrance of Allah, and acts of worship.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَأَمَّا لَيْلَةُ النِّصْفِ فَقَدْ رُوِيَ فِي فَضْلِهَا أَحَادِيثُ وَآثَارٌ وَنُقِلَ عَنْ طَائِفَةٍ مِنْ السَّلَفِ أَنَّهُمْ كَانُوا يُصَلُّونَ فِيهَا فَصَلَاةُ الرَّجُلِ فِيهَا وَحْدَهُ قَدْ تَقَدَّمَهُ فِيهِ سَلَفٌ وَلَهُ فِيهِ حُجَّةٌ فَلَا يُنْكَرُ مِثْلُ هَذَا<\/p>\n<p>As for the night of the middle of Sha’ban, there are prophetic traditions and reports mentioning its virtue and it has been reported from a group of the righteous predecessors that they would pray during it. Thus, the prayer of a man individually has been done by the predecessors and there is a proof for it, so it cannot be rejected.<\/p>\n<p>Source: Majmū’ al-Fatāwá 23\/132<\/p>\n<\/blockquote>\n<p>Therefore, there is no blame upon any Muslim who chooses to perform extra prayers or not during this night. Those who choose not to pray should not accuse other Muslims of innovation (<em>bid’ah<\/em>) for performing more prayers on this specific night.<\/p>\n<p>Likewise, those who choose to perform extra prayers should not accuse other Muslims of belittling a prophetic practice, although one must avoid exaggerating this issue beyond what the righteous predecessors and scholars have said about it.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إذَا صَلَّى الْإِنْسَانُ لَيْلَةَ النِّصْفِ وَحْدَهُ أَوْ فِي جَمَاعَةٍ خَاصَّةٍ كَمَا كَانَ يَفْعَلُ طَوَائِفُ مِنْ السَّلَفِ فَهُوَ أَحْسَنُ وَأَمَّا الِاجْتِمَاعُ فِي الْمَسَاجِدِ عَلَى صَلَاةٍ مُقَدَّرَةٍ كَالِاجْتِمَاعِ عَلَى مِائَةِ رَكْعَةٍ بِقِرَاءَةِ أَلِفِ قُلْ هُوَ اللَّهُ أَحَدٌ دَائِمًا فَهَذَا بِدْعَةٌ لَمْ يَسْتَحِبَّهَا أَحَدٌ مِنْ الْأَئِمَّةِ وَاَللَّهُ أَعْلَمُ<\/p>\n<p>If people pray in the middle night of Sha’ban alone, or in a special congregation as was done by the righteous predecessors, this is excellent. As for congregating in the mosque for a fixed prayer, such as gathering for one hundred cycles in which Surat al-Ikhlas is constantly recited a thousand times, this is an innovation. None of the Imams recommended it. Allah knows best.<\/p>\n<p>Source: al-Fatāwā al-Kubrā 2\/262<\/p>\n<\/blockquote>\n<p>Al-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right\">مِنْ الْبِدَعِ الْمُنْكَرَةِ مَا يُفْعَلُ فِي كَثِيرٍ مِنْ الْبُلْدَانِ مِنْ إيقَادِ الْقَنَادِيلِ الْكَثِيرَةِ الْعَظِيمَةِ السَّرَفِ فِي لَيَالٍ مَعْرُوفَةٍ مِنْ السَّنَةِ كَلَيْلَةِ نِصْفِ شَعْبَانَ<\/p>\n<p>Among reprehensible innovations is what is done in many countries, kindling many large and extravagant lamps on a specified night of the year, such as the middle of Sha’ban.<\/p>\n<p>Source: al-Majmū&#8217; Sharḥ al-Muhadhdhab 2\/177<\/p>\n<\/blockquote>\n<p>And Al-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right\">الصَّلَاةُ الْمَعْرُوفَةُ بصلاة الرغائب وهي ثنتى عَشْرَةَ رَكْعَةً تُصَلَّى بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ لَيْلَةَ أَوَّلِ جُمُعَةٍ فِي رَجَبٍ وَصَلَاةُ لَيْلَةِ نِصْفِ شَعْبَانَ مِائَةُ رَكْعَةٍ وَهَاتَانِ الصَّلَاتَانِ بِدْعَتَانِ وَمُنْكَرَانِ<\/p>\n<p>The prayer known as Salat al-Ragha’ib, which is twelve cycles prayed between sunset and evening prayer on the first Friday night of Rajab, and the prayer of one hundred cycles in the middle night of Sha’ban, these two prayers are reprehensible innovations.<\/p>\n<p>Source: al-Majmū&#8217; Sharḥ al-Muhadhdhab 4\/56<\/p>\n<\/blockquote>\n<p>In general, we should avoid argumentation and disputes about secondary issues in Islam such as these. It is a matter of legitimate scholarly difference, with each side citing valid proofs and principles for their position. Every Muslim should choose what he or she believes is the better opinion and maintain friendly relations with those who have an opposing view, while everyone must be cautious about not exaggerating issues in the religion.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is a proof for it, so it cannot be rejected.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[18,20,342,26,37,41,90,100,60,306,365,66,91,98],"class_list":["post-16602","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-community-jamaah","tag-creation-al-khalq","tag-al-fiqh","tag-forgiveness-al-maghfirah","tag-idolatry-shirk","tag-imam-al-shafii","tag-innovation-bidah","tag-manners-al-adab","tag-prayer-salat","tag-ramadan","tag-recommendation-al-mustahab","tag-remembrance-dhikr","tag-righteous-predecessors-al-salaf-al-salih","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4jM","jetpack-related-posts":[{"id":20451,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-hatred-malice-boycotting\/","url_meta":{"origin":16602,"position":0},"title":"Imam al-Mundhiri on Mutual-Hatred, Grudges, and Boycotting","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Do not hate each other, do not envy each other,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20283,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-voluntary-sunan-fasting\/","url_meta":{"origin":16602,"position":1},"title":"Imam al-Nawawi on Voluntary Sunan Fasting","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Best fast after Ramadan is the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20434,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-good-character-akhlaq-adab\/","url_meta":{"origin":16602,"position":2},"title":"Imam al-Mundhiri on Good Character and Manners","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Best of you have the best character.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":16602,"position":3},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15863,"url":"https:\/\/www.abuaminaelias.com\/blessings-night-of-decree-laylat-al-qadr\/","url_meta":{"origin":16602,"position":4},"title":"Blessings of the Night of Decree, Laylat al-Qadr","author":"Abu Amina Elias","date":"July 19, 2014","format":false,"excerpt":"\"The Night of Decree is better than a thousand months.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25259,"url":"https:\/\/www.abuaminaelias.com\/how-to-enjoy-your-worship-of-allah\/","url_meta":{"origin":16602,"position":5},"title":"How to enjoy your worship of Allah","author":"Abu Amina Elias","date":"May 1, 2025","format":false,"excerpt":"\"I suffered with prayer for twenty years, then I enjoyed it for twenty years.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16602","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16602"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16602\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16602"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16602"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}