{"id":16650,"date":"2015-06-25T16:30:23","date_gmt":"2015-06-25T12:30:23","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16650"},"modified":"2020-07-17T22:21:54","modified_gmt":"2020-07-17T18:21:54","slug":"the-purpose-of-prayer-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/the-purpose-of-prayer-in-islam\/","title":{"rendered":"Purpose of prayer in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Prayer (<em>salat<\/em>) is the most important practice in Islam after declaring faith in Allah and His Messenger. The Prophet described the prayer as <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/06\/purity-is-half-of-faith-prayer-is-light-charity-is-proof-and-patience-is-illumination\/\">a light<\/a>, the <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/17\/hadith-on-islam-islam-is-built-upon-the-five-pillars-of-monotheism-prayer-charity-fasting-and-pilgrimage\/\">pillar of Islam<\/a>, and among the best deeds.<\/p>\n<p>Abdullah ibn Mas’ud reported: I asked, “O Messenger of Allah, which deed is best?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّلَاةُ عَلَى مِيقَاتِهَا<\/p>\n<p><strong>Prayer in its proper time.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2630, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/21\/hadith-on-virtue-the-best-deeds-are-prayer-on-time-righteousness-with-parents-and-struggling-in-allahs-cause\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>But this is for the true and sincere prayer that completes its purpose and objectives, both inwardly and outwardly, not simply going through the motions without presence of heart. In order for the prayer to be fulfilled, we must allow it to purify our hearts, to keep us away from sin, and to enrich our lives in the remembrance of Allah.<\/p>\n<p>Purification of the heart is the ultimate religious objective of prayer. A prayer will only be acceptable to Allah if it is done with sincerity, reverence, awareness, and repentance. Our prayers should cleanse the heart of every spiritual disease such as envy, malice, and arrogance.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ أَفْلَحَ مَن تَزَكَّىٰ وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ<\/p>\n<p><strong>He has succeeded who purifies himself, who remembers the name of his Lord and prays.<\/strong><\/p>\n<p>Surat Al-A’la 87:14-15<\/p><\/blockquote>\n<p>The parable of the prayer is that of a running river in which we cleanse our hearts five times a day.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الصَّلَوَاتِ الْخَمْسِ كَمَثَلِ نَهْرٍ جَارٍ غَمْرٍ عَلَى بَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ<\/p>\n<p><strong>The example of the five prayers is that of a river running at the door of one of you in which he cleanses himself five times a day.<\/strong><\/p>\n<p>Source: Sahih Muslim 668, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/19\/hadith-on-prayer-the-parable-of-five-prayers-is-a-river-in-which-he-takes-a-bath\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When we are preparing for prayer, we should keep this image in mind so that our awareness is focused on the goal of attaining a pure heart. Related to this inward purification is the purification from sin, as prayer is among the greatest good deeds for which we expiate our sins.<\/p>\n<p>Abdullah ibn Mas’ud reported: A man kissed a woman who was not his wife and he came to the Messenger of Allah, peace and blessings be upon him, and told him about that. The verse was revealed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقِمْ الصَّلَاةَ طَرَفَيْ النَّهَارِ وَزُلَفًا مِنْ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ<\/p>\n<p><strong>Establish prayer at the two ends of the day and in the first hours of the night. Verily, good deeds will do away with bad deeds.<\/strong> (11:114)<\/p>\n<p>Source: Sahih Bukhari 4410, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/31\/hadith-on-repentance-good-deeds-like-prayer-and-charity-will-remove-evil-deeds-from-the-scale\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This is expiation is another way to view the prayer as a river, since it cleanses us from the sins we commit.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتُمْ لَوْ أَنَّ نَهَرًا بِبَابِ أَحَدِكُمْ، يَغْتَسِلُ فِيهِ كُلَّ يَوْمٍ خَمْسًا مَا تَقُولُ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ‏<\/p>\n<p><strong>If there was a river at the door of anyone of you and he took a bath in it five times a day, would you notice any dirt on him?<\/strong><\/p><\/blockquote>\n<p>They said, “Not a trace of dirt would be left.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَذَلِكَ مِثْلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللَّهُ بِهَا الْخَطَايَا<\/p>\n<p><strong>That is the example of the five prayers with which Allah erases evil deeds.<\/strong><\/p>\n<p>Source: Sahih Bukahri 505, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/04\/the-five-prayers-remove-sins-like-water-removes-dirt\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The ablution with water (<em>wudu<\/em>), which itself precedes the prayer, represents this process of repentance and purification. When we perform ablution, we should imagine that the sincerity and purity of our act is cleansing the sin from our souls with every drop of water.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ أَوْ الْمُؤْمِنُ فَغَسَلَ وَجْهَهُ خَرَجَ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنَيْهِ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ يَدَيْهِ خَرَجَ مِنْ يَدَيْهِ كُلُّ خَطِيئَةٍ كَانَ بَطَشَتْهَا يَدَاهُ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ فَإِذَا غَسَلَ رِجْليْهِ خَرَجَتْ كُلُّ خَطِيئَةٍ مَشَتْهَا رِجْلَاهُ مَعَ الْمَاءِ أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ حَتَّى يَخْرُجَ نَقِيًّا مِنْ الذُّنُوبِ<\/p>\n<p><strong>When a Muslim or a believer washes his face in ablution, then every sin which he committed with his eyes will be washed away with the last drop of water. When he washes his hands, then every sin which he committed with his hands will be washed away with the last drop of water. When he washes his feet, then every sin which he committed with his feet will be washed away with the last drop of water until he emerges purified from sin.<\/strong><\/p>\n<p>Source: Sahih Muslim 244, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/03\/23\/hadith-on-ablution-every-sin-a-muslim-commits-will-be-washed-away-with-the-last-drop-of-water\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For this reason, the Prophet’s supplication upon completing ablution was to say this:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اجْعَلْنِي مِنْ التَّوَّابِينَ وَاجْعَلْنِي مِنْ الْمُتَطَهِّرِينَ<\/p>\n<p><strong>O Allah, make me among those who repent and make me among those who purify themselves.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 55, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/13\/hadith-on-ablution-great-reward-for-perfect-wudu-and-performance-of-sunan-supplication\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In general, the prayer expiates minor sins for which there is no need of specific repentance. We should not think to ourselves that we may perform major sins and expiate them with prayers alone.<\/p>\n<p>Uthman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ امْرِئٍ مُسْلِمٍ تَحْضُرُهُ صَلَاةٌ مَكْتُوبَةٌ فَيُحْسِنُ وُضُوءَهَا وَخُشُوعَهَا وَرُكُوعَهَا إِلَّا كَانَتْ كَفَّارَةً لِمَا قَبْلَهَا مِنْ الذُّنُوبِ مَا لَمْ يُؤْتِ كَبِيرَةً وَذَلِكَ الدَّهْرَ كُلَّهُ<\/p>\n<p><strong>When the time of prescribed prayer arrives, no Muslim performs it with its ablution, its reverence, and its bowing except that it will be an expiation for his previous sins as long as he does not commit a major sin, and this applies for all time.<\/strong><\/p>\n<p>Source: Sahih Muslim 228, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/19\/hadith-on-prayer-excellent-ablution-and-prayer-will-erase-all-previous-minor-sins\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Major sins which involve the rights of people, such as theft, require specific acts of repentance like returning the stolen money or otherwise redressing what was done wrong. However, in some special cases a sincere prayer as an act of repentance can expiate sins which might otherwise involve worldly punishment.<\/p>\n<p>Anas ibn Malik reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, I have committed an offense which deserves legal punishment, so impose it upon me.” The man was present at the prayer and he prayed with the Messenger of Allah. When they finished the prayer, the man repeated his request. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">‏هَلْ حَضَرْتَ الصَّلاَةَ مَعَنَا<\/p>\n<p><strong>Were you present with us at the time of prayer?<\/strong><\/p><\/blockquote>\n<p>The man said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ غُفِرَ لَكَ ‏<\/p>\n<p><strong>You have been forgiven.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6437, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/12\/it-is-best-to-avoid-legal-punishments-if-given-a-valid-excuse-such-as-a-vague-confession\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this example, the man confessed to the Prophet without naming his specific crime. The Prophet did not like to apply legal punishment if the situation could be rectified without it. Since the man’s confession was vague enough, yet indicative of his sincere repentance, the Prophet informed him that the prayer had expiated his sin.<\/p>\n<p>Having performed prayer with this understanding and spiritual purpose, the natural result is that our prayers should prevent us from committing further sins and instill us with good character.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ<\/p>\n<p><strong>Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.<\/strong><\/p>\n<p>Surah Al-Ankabut 29:45<\/p><\/blockquote>\n<p>How then can a person perform prayer, intending to purify his heart and to repent for his sins, and thereafter commit more sins and crimes? Further indulgence in wrongdoing after the prayer only demonstrates that the prayer performed had been deficient.<\/p>\n<p>Abu Huraira reported: A man came to the Prophet and he said, “Indeed, a man prays in the night but he steals in the morning.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ سَيَنْهَاهُ مَا يَقُولُ<\/p>\n<p><strong>Verily, it should prevent him from doing that.<\/strong><\/p>\n<p>Source: Musnad Ahmad 9486, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/07\/hadith-on-prayer-a-sincere-prayer-should-prevent-a-person-from-committing-major-sins\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>No doubt, the avoidance of sin is a major objective of the prayer, but as the verse says, “the remembrance of Allah is greater.”<\/p>\n<p>Essentially, the prayer is an entire act of remembrance for Allah, remembering His greatness, the path of the prophets, and the Hereafter. This remembrance is at the core of prayer and every act of worship and good deed. It is what enriches our lives and leads to the eternal life in Paradise. Hence, the parable of those who remember or forget Allah is like the difference between the living and the dead.<\/p>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْبَيْتِ الَّذِي يُذْكَرُ اللَّهُ فِيهِ وَالْبَيْتِ الَّذِي لَا يُذْكَرُ اللَّهُ فِيهِ مَثَلُ الْحَيِّ وَالْمَيِّتِ<\/p>\n<p><strong>The example of the house in which Allah is remembered and the house in which Allah is not remembered is that of the living and the dead.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6044, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/26\/hadith-on-remembrance-the-example-of-those-who-remember-allah-and-who-do-not-is-that-of-the-living-and-the-dead\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>With this in mind, we must strive to make our prayers meaningful on every level, inwardly and outwardly, according to the rules of proper practice and the rules of the heart.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[16,26,32,100,134,60,84,66,67,220,179],"class_list":["post-16650","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-character-akhlaq","tag-forgiveness-al-maghfirah","tag-hereafter-akhirah","tag-manners-al-adab","tag-paradise-jannah","tag-prayer-salat","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-remembrance-dhikr","tag-repentance-al-tawbah","tag-supplication-al-dua","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4ky","jetpack-related-posts":[{"id":22747,"url":"https:\/\/www.abuaminaelias.com\/benefits-sunan-adhan\/","url_meta":{"origin":16650,"position":0},"title":"Benefits of the Sunan of Adhan, call to prayer","author":"Abu Amina Elias","date":"December 27, 2020","format":false,"excerpt":"\"I am pleased with Allah as Lord,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22666,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-paying-zakat\/","url_meta":{"origin":16650,"position":1},"title":"Imam al-Mundhiri on Obligatory Charity","author":"Abu Amina Elias","date":"October 19, 2020","format":false,"excerpt":"\"Whoever pays alms on his wealth, his evil will depart from him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13567,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-salat-salah-salawat\/","url_meta":{"origin":16650,"position":2},"title":"Imam al-Nawawi on Five Daily Prayers","author":"Abu Amina Elias","date":"May 19, 2013","format":false,"excerpt":"\"The parable of the five prayers is that of a river running...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22636,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-the-call-to-prayer\/","url_meta":{"origin":16650,"position":3},"title":"Imam al-Mundhiri on the Call to Prayer","author":"Abu Amina Elias","date":"October 4, 2020","format":false,"excerpt":"\"The caller to prayer is forgiven for as far as his voice reaches,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13490,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-burn-down-peoples-houses-for-missing-the-prayer\/","url_meta":{"origin":16650,"position":4},"title":"Burn their houses for missing prayer?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not punish with the punishment of Allah the Exalted.\" --Musnad Ahmad 1904","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15522,"url":"https:\/\/www.abuaminaelias.com\/attributes-of-success-in-the-hereafter\/","url_meta":{"origin":16650,"position":5},"title":"Attributes of success in the Hereafter","author":"Abu Amina Elias","date":"February 24, 2014","format":false,"excerpt":"\"Certainly the believers have succeeded.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16650","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16650"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16650\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16650"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16650"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16650"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}