{"id":16677,"date":"2015-07-06T14:35:36","date_gmt":"2015-07-06T10:35:36","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16677"},"modified":"2021-06-01T15:43:24","modified_gmt":"2021-06-01T11:43:24","slug":"depression-anxiety-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/depression-anxiety-islam\/","title":{"rendered":"Overcoming depression and anxiety with Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Depression and anxiety are two closely related ailments that will afflict many of us at one time or another during our lives. Periods of grief and worry are a normal part of life, which can usually be cured with prayer, patience, and positive thinking. However, sometimes we unwittingly nurture these negative feelings to the point of developing an anxiety disorder or clinical depression.<\/p>\n<p>For those of us who experience abnormal and unhealthy levels of grief and worry, there is hope in Islam to overcome these debilitating symptoms without resorting to pharmaceuticals. We should seek our cure for depression and anxiety in a holistic manner by addressing its physical, mental, social, and spiritual aspects. These symptoms usually occur because there is something wrong, but treatable, in our body, mind, or spirit that needs to be fixed.<\/p>\n<p>If depression and anxiety persist after exhausting these techniques, then medical intervention by a specialist doctor may be necessary.<\/p>\n<p>First, we must recognize that in Islam our physical bodies have a right over us, that we take care of our health, optimize our nutrition, get enough quality sleep, and physically exercise regularly. These three &#8211; diet, sleep, and exercise &#8211; are the pillars of physical health.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّ لِنَفْسِكَ عَلَيْكَ حَقًّا فَصُمْ وَأَفْطِرْ وَصَلِّ وَنَمْ<\/p>\n<p><strong>Verily, your own self has rights over you, so fast and break your fast, pray and sleep.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1369, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/07\/06\/family-body-rights\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Indeed, prayer and fasting are inherently good acts, but doing them excessively to the point of neglecting the needs of the body makes them blameworthy. One cannot continue to worship Allah without a healthy body, so a healthy body takes priority over voluntary worship.<\/p>\n<p>The most important aspect of bodily health is to eat nutritious, wholesome, and natural foods, because most diseases take root in the stomach due to unhealthy eating habits.<\/p>\n<p>Ibn Rajab reports that classical Arab doctors would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَمِيَّةُ رَأْسُ الدَّوَاءِ وَالْبِطْنَةُ رَأْسُ الدَّاءِ<\/p>\n<p>Diet is the foundation of medicine and gluttony is the foundation of illness.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/468<\/p><\/blockquote>\n<p>Many of us become depressed because our bodies are not receiving enough nutrients, and such an imbalance affects our whole being. Hence, Allah commands us to eat wholesome foods (<em>tayyibat<\/em>) produced naturally from the earth.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ<\/p>\n<p><strong>O you who believe, eat from the wholesome things which We have provided for you and be grateful to Allah, if it is him that you worship.<\/strong><\/p>\n<p>Surat al-Baqarah 2:172<\/p><\/blockquote>\n<p>Much of the industrial, mass-produced food in our age is highly processed and stripped of its nutrients. These foods contain too much sugar, salt, chemicals, and other harmful additives. We should take gradual steps to eat less of these foods while adding more fruits, vegetables, healthy fats and proteins to our diet.<\/p>\n<p>We also need to avoid extravagance with food and overeating. Even eating too much good food can cause a nutritional imbalance, which will ultimately affect our mental health.<\/p>\n<p>Miqdam ibn Ma’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مَلَأَ آدَمِيٌّ وِعَاءً شَرًّا مِنْ بَطْنٍ حَسْبُ الْآدَمِيِّ لُقَيْمَاتٌ يُقِمْنَ صُلْبَهُ فَإِنْ غَلَبَتْ الْآدَمِيَّ نَفْسُهُ فَثُلُثٌ لِلطَّعَامِ وَثُلُثٌ لِلشَّرَابِ وَثُلُثٌ لِلنَّفَسِ<\/p>\n<p><strong>There is no vessel which the son of Adam can fill that is more evil than his stomach, for it is enough for him to take a few bites in order to straighten his back. Yet if he is overcome by appetite, then he may fill it with a third of food, a third of drink, and a third of breath.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3349, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/21\/eating-third-food-drink-air\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ إِيَّاكُمْ وَالْبِطْنَةَ مِنَ الطَّعَامِ فَإِنَّهَا مَكْسَلَةٌ عَنِ الصَّلاةِ مُفْسِدَةٌ لِلْجَسَدِ مُوَرِّثَةٌ لِلسَّقَمِ وَأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يُبْغِضُ الْحَبْرَ السَّمِينَ وَلَكِنْ عَلَيْكُمْ بِالْقَصْدِ فِي قُوتِكُمْ فَإِنَّهُ أَدْنَى مِنَ الإِصْلاحِ وَأَبْعَدُ مِنَ السَّرَفِ وَأَقْوَى عَلَى عِبَادَةِ اللَّهِ وَإِنَّهُ لَنْ يَهْلِكَ عَبْدٌ حَتَّى يُؤْثَرَ شَهْوَتَهُ عَلَى دِينِهِ<\/p>\n<p>O people, beware of gluttony in eating. Verily, it causes laziness with the prayer, it harms the body, it inherits disease, and Allah Almighty detests the fatness of a cleric. Rather, you must be moderate in your provisions, for it is closer to righteousness, further from extravagance, and stronger for the worship of Allah. Verily, a servant is not destroyed unless he prefers his desires over his religion.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/05\/06\/umar-hawa-over-deen\/\">al-Jū’ li-Ibn Abī Dunyā 81<\/a><\/p><\/blockquote>\n<p>The Sunnah is to fill the stomach with one third of food, one third of drink, and one third left empty, except for special occasions when it is permitted to eat one&#8217;s fill. One should gradually decrease their food portions and intake over time until they become accustomed to eating in moderate amounts. If we followed this wise advice, as difficult as it may be for some of us, we would inevitably see the positive results on our bodies and subsequently on our depression and anxiety.<\/p>\n<p>In addition to diet, we need to make sure we get enough quality sleep and exercise. Allah created the night time for us to rest, and our bodies need it to heal and recharge our energy reserves. Neglecting our sleep requirements for any reason, even prayer, is a blameworthy excess.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا وَجَعَلْنَا اللَّيْلَ لِبَاسًا<\/p>\n<p><strong>And We made your sleep for rest and the night as a covering.<\/strong><\/p>\n<p>Surat al-Naba 78:9-10<\/p><\/blockquote>\n<p>Practicing the prophetic traditions related to sleep as a nightly routine, as part of healthy sleep hygiene, will strengthen the body and aid the healing process, among many other benefits.<\/p>\n<p>Next, we should adopt <a href=\"https:\/\/yaqeeninstitute.org\/en\/justin-parrott\/how-to-be-a-mindful-muslim-an-exercise-in-islamic-meditation\/\">Islamic mindfulness techniques<\/a> to gain control over our negative thoughts. Thoughts are often difficult to regulate, but we do have a degree of control over what we choose to think about and reflect upon. The true believer should try to be an optimist, thinking the best about Allah and his decrees, rather than being a pessimist who always dwells upon the worst case scenario.<\/p>\n<p>Conscious thinking is a habit and a choice; if we are in the habit of thinking negatively, we should apply mindfulness techniques to form better thinking habits.<\/p>\n<p>One of the most destructive ways of thinking is to nurture hatred, envy, and malice towards others. Many times our hatred of others harms ourselves more than anyone else. We have to force ourselves to forgive others, to let go of grudges, and to calm pent up feelings of anger. The prophetic way is to cleanse our mind of hateful thoughts every morning and evening through prayer and supplication.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ<\/p>\n<p><strong>My son, if you are able every morning and evening to remove any rancor from your heart towards anyone, then do so.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ وَذَلِكَ مِنْ سُنَّتِي وَمَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجَنَّة<\/p>\n<p><strong>My son, that is my tradition<\/strong> <strong>and whoever revives my tradition has loved me, and whoever loves me will be with me in Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2678, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/17\/tazkiyyat-al-nafs-hasad-hiqd\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>We should not indulge in negative assumption and suspicion about others. Sometimes we find ourselves thinking the worst about others and even expressing it verbally by backbiting against them. We should apply mindfulness techniques to catch ourselves in such moments and switch our mental self-conversation to something better.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا وَلَا يَغْتَب بَّعْضُكُم بَعْضًا<\/p>\n<p><strong>O you who believe, avoid much suspicion. Verily, some suspicion is sin, and do not spy or backbite each other.<\/strong><\/p>\n<p>Surat al-Hujurat 49:12<\/p><\/blockquote>\n<p>Not only must we gain control over our thoughts and feelings towards people, we must also control our thoughts and feelings related to objects. When our happiness depends upon material wealth and success, we are bound to be disappointed as such worldly pleasures will never last forever. If we are too deeply attached to a material object, we will become depressed when it is inevitably taken away.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعِسَ عَبْدُ الدِّينَارِ وَالدِّرْهَمِ وَالْقَطِيفَةِ وَالْخَمِيصَةِ إِنْ أُعْطِيَ رَضِيَ، وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ<\/p>\n<p><strong>Wretched is the servant of gold, silver, fine clothes, and garments. If he is given he is pleased, but if he is not given he is displeased.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6071, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/11\/26\/wretched-slave-money-wealth\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Often people become depressed when they do not get what they want, but true believers, who have trained themselves to be unattached to the world, are always happy even in dire circumstances. The Prophet (s) suffered for the cause of Islam more than any of us, losing his loved ones and enduring pain and hunger, yet the companions reported that they never saw anyone smile as often as him.<\/p>\n<p>Abdullah ibn al-Harith reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا رَأَيْتُ أَحَدًا أَكْثَرَ تَبَسُّمًا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>I have not seen anyone smile more often than the Messenger of Allah, peace and blessings be upon him.<\/p>\n<p>Source: Sunan al-Tirmidhī 3641, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/20\/no-one-smile-more-muhammad\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Even when death and destruction seemed so close, the Prophet (ṣ) would continue to smile and spread his positive thinking and optimism.<\/p>\n<p>Another important factor in our overall health is our place in the support structure of our community. Loneliness is a common cause of depression and anxiety, so having a real social network (not simply online) is essential.<\/p>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُؤْمِنَ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا<\/p>\n<p><strong>Verily, the believers are like a structure, each part strengthening the other.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 467, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/28\/believers-structure\/\"><strong>Muttafaqun Alayhi<\/strong><\/a><\/p><\/blockquote>\n<p>We should surround ourselves with family, friends, and believers who can be a positive influence on us. If we simply cannot find enough good people to be around, then it is better to be lonely than surrounded by bad people.<\/p>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا مَثَلُ الْجَلِيسِ الصَّالِحِ وَالْجَلِيسِ السَّوْءِ كَحَامِلِ الْمِسْكِ وَنَافِخِ الْكِيرِ فَحَامِلُ الْمِسْكِ إِمَّا أَنْ يُحْذِيَكَ وَإِمَّا أَنْ تَبْتَاعَ مِنْهُ وَإِمَّا أَنْ تَجِدَ مِنْهُ رِيحًا طَيِّبَةً وَنَافِخُ الْكِيرِ إِمَّا أَنْ يُحْرِقَ ثِيَابَكَ وَإِمَّا أَنْ تَجِدَ رِيحًا خَبِيثَةً<\/p>\n<p><strong>Verily, the parable of a good friend and a bad friend is only that of a seller of musk and a blacksmith. The seller of musk will give you some perfume, you will buy some, or you will notice a good smell. As for the blacksmith, he will burn your clothes or you will notice a bad smell.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1995, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/10\/26\/parable-good-bad-company\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Darda, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّاحِبُ الصَّالِحُ خَيْرٌ مِنَ الْوَحْدَةِ وَالْوَحْدَةُ خَيْرٌ مِنَ الصَّاحِبِ السُّوءِ وَمُمْلِي الْخَيْرِ خَيْرٌ مِنَ السَّاكِتِ وَالسَّاكِتُ خَيْرٌ مِنْ مُمْلِي الشَّرِّ<\/p>\n<p>A righteous companion is better than loneliness, and loneliness is better than an evil companion. A good writer is better than one silent, and one silent is better than an evil writer.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/05\/16\/abu-darda-loneliness-evil-friend\/\">Rawḍat al-‘Uqalā 56<\/a><\/p><\/blockquote>\n<p>Finally, we have to become spiritually healthy by adhering to authentic theological beliefs and practicing acts of worship properly. There is a specific supplication that the Prophet (s) taught us for curing depression and anxiety, which reveals how important sound creed is to our mental health:<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنِّي عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ مَاضٍ فِيَّ حُكْمُكَ عَدْلٌ فِيَّ قَضَاؤُكَ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي وَنُورَ صَدْرِي وَجِلَاءَ حُزْنِي وَذَهَابَ هَمِّي<\/p>\n<p><strong>O Allah, I am your servant, the son of your servant, the son of your maidservant. My forelock is in your hand, your command concerning me prevails, and your decision concerning me is just. I call upon you by every one of the beautiful names with which you have described yourself, or which you have revealed in your Book, or you have taught to any of your creatures, or which you have chosen to keep in the knowledge of the unseen with you, to make the Quran the delight of my heart, the light of my chest, and to remove my sadness and dispel my anxiety.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 3704, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/05\/dua-anxiety-stress\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This supplication expresses firm faith in the providence of Allah (<em>al-qada&#8217; wal-qadr<\/em>) over all creation. We should remember that Allah is in control of everything and, as long as we have faith, he will decree only what is best for us in this world and in the Hereafter.<\/p>\n<p>Suhayb reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَجَبًا لِأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ وَلَيْسَ ذَاكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ<\/p>\n<p><strong>Wondrous is the affair of a believer, as there is good for him in every matter; this is not the case for anyone but a believer. If he experiences pleasure, he thanks Allah and it is good for him. If he experiences harm, he shows patience and it is good for him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2999, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/06\/04\/everything-believer-sabr-shukr\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This is the secret to authentic happiness, by which so many of the righteous predecessors were able to remain positive despite living in difficult circumstances. They understood that, as long as they had faith, whatever Allah decreed for them was good; if not immediately in this life, then definitely in the next.<\/p>\n<p>Even if something that happened looked bad to them in worldly terms, they had faith that it was the best for their destiny in the Hereafter. They would always praise Allah in every circumstance, hardship or ease.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ<\/p>\n<p><strong>All praise is due to Allah in every circumstance.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3803, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/24\/hamdulillah-ala-kul-hal\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ إِنَّ الْمُؤْمِنَ عِنْدِي بِمَنْزِلَةِ كُلِّ خَيْرٍ يَحْمَدُنِي وَأَنَا أَنْزِعُ نَفْسَهُ مِنْ بَيْنِ جَنْبَيْهِ<\/p>\n<p><strong>Allah Almighty said: Verily, the believer is always in a good position with me. He praises me, even as I remove his soul from between his two sides.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 8514, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/27\/believers-praise-allah-everything\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And Shuraih, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَأُصَابُ بِالْمُصِيبَةِ فَأَحْمَدُ اللَّهَ عَلَيْهَا أَرْبَعَ مَرَّاتٍ أَحْمَدُ إِذْ لَمْ يَكُنْ أَعْظَمَ مِنْهَا وَأَحْمَدُ إِذْ رَزَقَنِي الصَّبْرَ عَلَيْهَا وَأَحْمَدُ إِذْ وَفَّقَنِي لِلِاسْتِرْجَاعِ لِمَا أَرْجُو مِنَ الثَّوَابِ وَأَحْمَدُ إِذْ لَمْ يَجْعَلْهَا فِي دِينِي<\/p>\n<p>Verily, if I am afflicted by a calamity, then I praise Allah four times. I praise him that it was not worse than it was. I praise him as he provides me with patience to bear it. I praise him as he guides me to remember my hope for reward, and I praise him as he did not make it a calamity in my religion.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/16\/shurayh-praise-four-times\/\">Siyar A’lām al-Nubalā’ 4\/105<\/a><\/p><\/blockquote>\n<p>In life, we will be disappointed when we experience hardship and loss, but our faith and trust in Allah’s infinite wisdom will help us endure these trials and keep us focused on the greater goal of salvation in the Hereafter.<\/p>\n<p>We should return to the Quran often to hear this message, remind us of the favors of Allah, and keep this worldly existence in a proper perspective. It is through the Quran, which is the greatest way to remember Allah, that our hearts will find rest and assurance.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ<\/p>\n<p><strong>No doubt, by the remembrance of Allah hearts are assured.<\/strong><\/p>\n<p>Surat al-Ra’d 13:28<\/p><\/blockquote>\n<p>To sum, overcoming depression and anxiety, when they have a stranglehold over our lives, is a very difficult task. It will take patience, sustained effort, and perseverance to implement a long-term plan for well-being, yet there is hope for healing and a clear path forward in Islam. By adopting healthy habits in our mind, body, and spirit, we can restore the natural balance within us that leads to recovery and prosperity.<\/p>\n<p>For those who exhaust these techniques and continue to suffer from depression and anxiety, they may need to consult a specialist doctor to treat their condition.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is good for a believer in every matter.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[13,21,24,26,322,508,30,50,311,100,289,56,60,92,84,65,66,91,220,332],"class_list":["post-16677","post","type-post","status-publish","format-standard","hentry","category-featured","tag-anger-al-ghadhab","tag-creed-aqidah","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-gratitude-al-shukr","tag-grief-al-huzn","tag-hatred-bigdah","tag-knowledge","tag-malice-hiqd","tag-manners-al-adab","tag-medicine-tibb","tag-monotheism-tawheed","tag-prayer-salat","tag-providence-al-qada-wal-qadr","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-reliance-tawakkul","tag-remembrance-dhikr","tag-righteous-predecessors-al-salaf-al-salih","tag-supplication-al-dua","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4kZ","jetpack-related-posts":[{"id":18213,"url":"https:\/\/www.abuaminaelias.com\/positive-thinking-in-islam\/","url_meta":{"origin":16677,"position":0},"title":"Positive thinking and optimism in Islam","author":"Abu Amina Elias","date":"June 4, 2016","format":false,"excerpt":"\"I am as my servant expects Me and I am with him as he remembers Me.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":16677,"position":1},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23251,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nawafil-salat\/","url_meta":{"origin":16677,"position":2},"title":"Imam al-Mundhiri on Voluntary Sunan Prayers","author":"Abu Amina Elias","date":"May 30, 2021","format":false,"excerpt":"\"Whoever perseveres in performing twelve raka'at...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20313,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-the-witr-prayer\/","url_meta":{"origin":16677,"position":3},"title":"Imam al-Nawawi on Witr Prayer","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Perform Witr prayer before the morning.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":16677,"position":4},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12957,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-voluntary-sunan-prayers\/","url_meta":{"origin":16677,"position":5},"title":"Imam al-Nawawi on Voluntary Sunan Prayer","author":"Abu Amina Elias","date":"March 18, 2013","format":false,"excerpt":"\"Whoever performs twelve cycles of prayer in each day and night, a house will be built for him in Paradise.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16677","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16677"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16677\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16677"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16677"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16677"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}