{"id":16830,"date":"2015-08-16T15:24:06","date_gmt":"2015-08-16T11:24:06","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16830"},"modified":"2020-07-17T21:56:16","modified_gmt":"2020-07-17T17:56:16","slug":"the-definition-of-faith-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","title":{"rendered":"Definition of faith in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The intended meaning of faith in Islam is important for us to understand, as mistaken definitions of faith have caused a number of problems in early Islamic history up until the present time. However, the righteous predecessors had a clear definition of faith that should serve as the basis of our understanding of Islam.<\/p>\n<p>“Faith” (<em>al-iman<\/em>) in the Arabic language means to affirm something and to comply with it.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَعْلُومٌ أَنَّ الْإِيمَانَ هُوَ الْإِقْرَارُ لَا مُجَرَّدُ التَّصْدِيقِ وَالْإِقْرَارُ ضِمْنَ قَوْلِ الْقَلْبِ الَّذِي هُوَ التَّصْدِيقُ وَعَمَلِ الْقَلْبِ الَّذِي هُوَ الِانْقِيَادُ<\/p>\n<p>It is understood that faith is affirmation and not merely belief. Affirmation includes the words of the heart, which is belief, and the actions of the heart, which is compliance.<\/p>\n<p>Source: Majmu’ Al-Fatawa 7\/638<\/p><\/blockquote>\n<p>Hence, faith in Islam means to believe in Allah, to affirm His truth, and to submit to His commands. The six pillars of faith are to believe and affirm the following:<\/p>\n<ol>\n<li>Allah,<\/li>\n<li>His angels,<\/li>\n<li>His messengers,<\/li>\n<li>His books,<\/li>\n<li>The Day of Judgment,<\/li>\n<li>Providence.<\/li>\n<\/ol>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنزَلَ مِن قَبْلُ ۚ وَمَن يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا<\/p>\n<p><strong>O you who believe, have faith in Allah and His messenger and the book that He revealed to His messenger and the scripture which He revealed before. Whoever disbelieves in Allah, His angels, His books, His messengers, and the Last Day has certainly gone far astray.<\/strong><\/p>\n<p>Surat An-Nisa 4:136<\/p><\/blockquote>\n<p>Umar ibn Al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ<\/p>\n<p><strong>Faith is to believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in providence both its good and its bad.<\/strong><\/p>\n<p>Source: Sahih Muslim 8, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/25\/hadith-of-gabriel-he-has-come-to-teach-you-the-foundations-of-the-religion\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Faith is not simply to believe in the existence of Allah. Iblees, or Satan, believes in the existence of Allah, he knows Allah exists, yet he does not have faith in Him.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ إِلَّا إِبْلِيسَ اسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ<\/p>\n<p><strong>So the angels prostrated, all of them entirely, except Iblees for he was arrogant and was among the unbelievers. <\/strong><\/p>\n<p>Surat Sad 38:73<\/p><\/blockquote>\n<p>Neither is faith to believe in Allah and the Unseen without reason or rational proof. Some people deny the existence of Allah because He cannot be perceived directly, but the inability to directly observe something is not proof of its non-existence. There are numerous natural phenomena in the universe, such as <a href=\"https:\/\/en.wikipedia.org\/wiki\/Dark_matter\">dark matter<\/a> and <a href=\"https:\/\/en.wikipedia.org\/wiki\/Dark_energy\">dark energy<\/a>, that we know exist because we observe their signs, even though no one has ever directly seen them.<\/p>\n<p>In other words, we can reasonably infer the existence of unseen phenomena by observing their indirect effects. In fact, it is scientifically proven most of what exists in the universe cannot be directly perceived by the senses. In the same way, we can logically infer the existence of Allah by observing His signs in the creation.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا أَنزَلَ اللَّهُ مِنَ السَّمَاءِ مِن رِّزْقٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيفِ الرِّيَاحِ آيَاتٌ لِّقَوْمٍ يَعْقِلُونَ<\/p>\n<p><strong>In the changing of night and day and in what Allah sends down from the sky of provision and gives life thereby to the earth after its lifelessness and in His directing the winds are signs for people who reason.<\/strong><\/p>\n<p>Surat Al-Jathiya 45:5<\/p><\/blockquote>\n<p>Therefore, faith in Islam means to submit to Allah, not despite a lack of evidence, but rather because the <a href=\"https:\/\/abuaminaelias.com\/what-are-the-islamic-evidences-for-the-existence-of-the-creator\/\">proofs of His Lordship are overwhelming<\/a>.<\/p>\n<p>True faith, then, must manifest itself in the heart as sincerity, on the tongue as affirmation, and on the limbs as action.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ أُصُولِ أَهْلِ السُّنَّةِ وَالْجَمَاعَةِ أَنَّ الدِّينَ وَالْإِيمَانَ قَوْلٌ وَعَمَلٌ قَوْلُ الْقَلْبِ وَاللِّسَانِ وَعَمَلُ الْقَلْبِ وَاللِّسَانِ وَالْجَوَارِحِ<\/p>\n<p>Among the principles of the people of the Sunnah and the community is that the religion and faith consists of sayings and actions: the sayings of the heart and the tongue, and the actions of the heart, tongue, and limbs.<\/p>\n<p>Source: Sharh Al-Aqida Al-Wasitiyya 1\/264<\/p><\/blockquote>\n<p>Righteous deeds are the inevitable result of sincere faith, such that Allah constantly emphasizes the reward of those “who have faith and do good deeds.”<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۚ ذَٰلِكَ الْفَوْزُ الْكَبِيرُ<\/p>\n<p><strong>Verily, those who had faith and had done righteous deeds will have gardens beneath which rivers flow. That is the great achievement.<\/strong><\/p>\n<p>Surat Al-Buruj 85:11<\/p><\/blockquote>\n<p>Righteous deeds are an important manifestation of faith, but they are not the reason Allah admits people into Paradise. We can never repay Allah or do enough good <em>to<\/em> <em>deserve<\/em> Paradise. Rather, we only enter Paradise because of the mercy of Allah.<\/p>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلَا يُجِيرُهُ مِنْ النَّارِ وَلَا أَنَا إِلَّا بِرَحْمَةٍ مِنْ اللَّهِ<\/p>\n<p><strong>None of you will enter Paradise because of his good deeds alone. None would be rescued from the Hellfire, not even myself, except for the mercy of Allah.<\/strong><\/p>\n<p>Source: Sahih Muslim 2817, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/08\/none-enters-paradise-by-virtue-of-good-deeds-but-only-by-the-mercy-of-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>On this point, Islam holds the middle position between those who says deeds are not essential to faith and those who say any deficiency in deeds nullifies faith.<\/p>\n<p>The Murji&#8217;ah was an early sect in Islam that claimed deeds were not essential to faith. Their intention was to make the religion more ecumenical in the face of extreme partisan in-fighting, but their creed, besides lacking basis in scripture, diluted the concept of faith to the point that it was nearly meaningless.<\/p>\n<p>On the other hand, the Kharijites were another early sect that claimed any deficiency in deeds cause a Muslim to be excommunicated from Islam. Today their spiritual heirs are called Takfirists, literally “the excommunicators.” The <a href=\"https:\/\/abuaminaelias.com\/dangers-of-the-khawarij-ideology-of-violence\/\">propensity of this sect towards violence<\/a> makes their heresy all the more obvious.<\/p>\n<p>Islam stands between the extremism of the Murji’ah and the Kharijites. Deeds are essential to faith such that a person who never acted at all on their belief in Allah never had faith to begin with, while at the same time a deficiency in deeds, or sin, does not nullify the faith of a Muslim. The strength of a Muslim’s faith is proportional to the inward and outward good deeds they perform.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنَّ الْإِيمَانَ يَزِيدُ بِالطَّاعَةِ وَيَنْقُصُ بِالْمَعْصِيَةِ<\/p>\n<p>Faith increase by acts of obedience to Allah and decreases by acts of disobedience.<\/p>\n<p>Source: Sharh Al-Aqida Al-Wasitiyya 1\/264<\/p><\/blockquote>\n<p>In other words, a Muslim who has a pure heart and performs many good deeds regularly has strong faith, whereas a Muslim who has a heart tainted by spiritual diseases and does not perform many good deeds has weak faith. Even so, a Muslim with weak faith is still considered a believer and his good qualities should not be dismissed.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنْ الْمُؤْمِنِ الضَّعِيفِ وَفِي كُلٍّ خَيْرٌ<\/p>\n<p><strong>The strong believer is more beloved to Allah than the weak believer, but there is goodness in both.<\/strong><\/p>\n<p>Source: Sahih Muslim 2664, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/20\/hadith-on-faith-allah-loves-the-strong-believer-more-but-all-believers-are-good-and-the-believers-accept-the-divine-decree\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This point is very important to understand some verses and prophetic traditions which discuss faith and unbelief in a rhetorical manner. For example, the following tradition:<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother or his neighbor what he loves for himself.<\/strong><\/p>\n<p>Source: Sahih Muslim 45, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Without a doubt, loving good for others and treating other people the way we want to be treated is an integral quality of true faith. However, understanding the tradition literally might lead to a misunderstanding. It is not the case that the one without this quality has no faith at all, but rather they do not have complete faith. Virtually all of the commentators on this tradition state that the meaning of faith here is “complete faith” and the usage is rhetorical, not literal.<\/p>\n<p>In a similar manner, Allah and His Messenger have sometimes described acts as “unbelief” although committing such acts does not make someone an absolute unbeliever. For example, the following verse:<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ لَمْ يَحْكُم بِمَا أَنْزَلَ اللَّه فَأُولَئِكَ هُمْ الْكَافِرُونَ<\/p>\n<p><strong>Whoever does not judge by what Allah has revealed, then those are the unbelievers.<\/strong><\/p>\n<p>Surat Al-Ma’idah 5:44<\/p><\/blockquote>\n<p>Tawus said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ بِكُفْرٍ يَنْقُل عَنْ الْمِلَّة<\/p>\n<p>It is not the disbelief which ejects someone from the religion.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ibn-abbas-ruling-against-allahs-revelation-is-disbelief-less-than-greater-disbelief\/\">Tafseer At-Tabari 5:44<\/a><\/p><\/blockquote>\n<p>Scholars refer to such deeds as the “lesser unbelief” since, although they are heinous sins, they do not excommunicate a Muslim from Islam or nullify his faith. Whenever we encounter such rhetorical usage in the Quran or prophetic traditions, we should always refer to the scholarly commentaries which can explain to us the intended meaning of a certain phrase.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Faith is to believe in Allah, His angels, His books&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[122,20,21,183,32,90,120,52,56,134,45,68,242,98],"class_list":["post-16830","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-angels-malaikah","tag-creation-al-khalq","tag-creed-aqidah","tag-day-of-resurrection-yawm-al-qiyammah","tag-hereafter-akhirah","tag-innovation-bidah","tag-rebels-khawarij","tag-love-al-mahabbah","tag-monotheism-tawheed","tag-paradise-jannah","tag-quran-exegesis-tafsir","tag-satan-al-shaytan","tag-scriptures-kutub","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4ns","jetpack-related-posts":[{"id":20421,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-modesty-haya-shamelessness\/","url_meta":{"origin":16830,"position":0},"title":"Imam al-Mundhiri on Modesty, Obscenity, and Shamelessness","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Be modest before Allah, as is his right.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":16830,"position":1},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23609,"url":"https:\/\/www.abuaminaelias.com\/dealing-doubts-islam\/","url_meta":{"origin":16830,"position":2},"title":"Dealing with faith-related doubts in Islam","author":"Abu Amina Elias","date":"October 7, 2021","format":false,"excerpt":"\"We are more likely to doubt than Abraham, when he said: O Lord, show me how You give life to the dead.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13792,"url":"https:\/\/www.abuaminaelias.com\/beware-of-hatred-and-malice-in-islam\/","url_meta":{"origin":16830,"position":3},"title":"Malicious hatred is a spiritual disease in Islam","author":"Abu Amina Elias","date":"June 16, 2013","format":false,"excerpt":"\"Hatred is the razor, it shaves the religion and it does not shave hair.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16503,"url":"https:\/\/www.abuaminaelias.com\/love-the-sinner-hate-the-sin-in-islam\/","url_meta":{"origin":16830,"position":4},"title":"Love the sinner, hate the sin in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Love for people what you would love for yourself.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16316,"url":"https:\/\/www.abuaminaelias.com\/required-muslims-one-ruler\/","url_meta":{"origin":16830,"position":5},"title":"Muslims must only have one ruler?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not be among those who commit idolatry...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16830","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16830"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16830\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16830"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16830"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}