{"id":16852,"date":"2015-08-20T20:24:36","date_gmt":"2015-08-20T16:24:36","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16852"},"modified":"2020-07-17T21:44:25","modified_gmt":"2020-07-17T17:44:25","slug":"no-theology-of-rape-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","title":{"rendered":"No theology of rape in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Islam has forbidden rape and sexual abuse since the time of the Prophet until today. Allegations by anti-Muslim activists are only buttressed by the appalling criminal behavior of terrorist groups acting in the name of Islam, who use rape as a weapon of war. Rape by itself is an atrocity, but it is made even worse, tantamount to idolatry, when it is falsely justified in the name of Allah and His Messenger.<\/p>\n<p>The basic principle in Islamic law is that a Muslim is forbidden from harming another person or animal unless it is necessary to repel a greater harm.<\/p>\n<p>Ubaida ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, issued a decree:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ ضَرَرَ وَلاَ ضِرَارَ<\/p>\n<p><strong>Do not cause harm or return harm.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2340, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/03\/hadith-on-islamic-law-do-not-be-harmed-or-harm-others\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Al-Suyuti expressed the legal principle as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الضَّرَر يُزَال<\/p>\n<p>Harm should be removed.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/12\/19\/as-suyuti-on-jurisprudence-the-five-principles-of-the-school-of-imam-ash-shafiee\/\">al-Ashbāh wal-Naẓāʼir 1\/7<\/a><\/p><\/blockquote>\n<p>Since it is well-established that rape causes innumerable harms to mind, body, and spirit, without any rational justification of preventing a greater wrong, it follows that rape is absolutely forbidden in Islam. This by itself is enough to establish the prohibition of rape. Even so, the Prophet further set the precedent that rape should not be tolerated in Muslim society. A man in Medina was caught after he raped a woman and the Prophet applied legal punishment on him, the maximum of which is the death penalty.<\/p>\n<p>Abu Alqama reported: A woman went out to pray during the time of the Prophet and she was met by a man who attacked her and raped her. She said, “This man has molested me!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ارْجُمُوهُ<\/p>\n<p><strong>He is condemned to death.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1454, Grade: <strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/02\/hadith-on-rape-the-prophet-applied-legal-punishment-upon-a-rapist-and-he-pardoned-his-victim\/\"><em>Sahih<\/em><\/a><\/strong><\/p><\/blockquote>\n<p>The righteous Caliphs who succeeded the Prophet continued this policy of legal punishment for the crime of rape. The victim of rape would not be punished regardless of the circumstances.<\/p>\n<p>Ibn Umar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ عُمَرَ رضي الله عنه أُتِيَ بِإِمَاءٍ مِنْ إِمَاءِ الإِمَارَةِ اسْتَكْرَهَهُنَّ غِلْمَانٌ مِنْ غِلْمَانِ الإِمَارَةِ فَضَرَبَ الْغِلْمَانَ وَلَمْ يَضْرِبْ الإِمَاءَ<\/p>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, was presented with a servant girl among those who served the leadership. She was forced upon by one of the young men, so Umar flogged the man and he did not flog the woman.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 29012<\/p><\/blockquote>\n<p>Nafi’ reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَجُلاً أَضَافَ أَهْلَ بَيْتٍ فَاسْتَكْرَهَ مِنْهُمَ امْرَأَةً فَرُفِعَ ذَلِكَ إِلَى أَبِي بَكْرٍ فَضَرَبَهُ وَنَفَاهُ وَلَمْ يَضْرِبْ الْمَرْأَةَ<\/p>\n<p>A man was invited as a guest of the family of a household, then he forced himself upon a woman among them. It was referred to Abu Bakr, so he flogged him and expelled him, and he did not flog the woman.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 29013<\/p><\/blockquote>\n<p>Hajjaj reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ حَبَشِيًّا اسْتَكْرَهَ امْرَأَةً مِنْهُمْ فَأَقَامَ عَلَيْهِ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ الْحَدَّ<\/p>\n<p>An Abyssinian forced himself upon a woman among them. It was referred to Umar ibn Abdul Aziz and he applied legal punishment on him.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 29014<\/p><\/blockquote>\n<p>The righteous jurists who succeeded the companions of the Prophet established a legal consensus that rape was forbidden and should be punished as if it were adultery. Neither should a rape victim be punished or required to provide four witnesses.<\/p>\n<p>Ibn Abdul Barr writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ أَجْمَعَ الْعُلَمَاءُ عَلَى أَنَّ عَلَى الْمُسْتَكْرِهِ الْمُغْتَصِبِ الْحَدَّ إِنْ شَهِدَتِ الْبَيِّنَةُ عَلَيْهِ بِمَا يُوجِبُ الْحَدَّ أَوْ أَقَرَّ بِذَلِكَ فَإِنْ لَمْ يَكُنْ فَعَلَيْهِ الْعُقُوبَةُ وَلَا عُقُوبَةَ عَلَيْهَا إِذَا صَحَّ أَنَّهُ اسْتَكْرَهَهَا وَغَلَبَهَا عَلَى نَفْسِهَا وَذَلِكَ يُعْلَمُ بِصُرَاخِهَا وَاسْتِغَاثَتِهَا وَصِيَاحِهَا<\/p>\n<p>The scholars agreed that the rapist must be given legal punishment if there is clear evidence against him that he deserves punishment or if he confesses to it. If the evidence is not as clear, then he is given a discretionary punishment. There is no punishment for the victim if it is true that she was forced and overpowered, as would be evident by her screams and cries for help.<\/p>\n<p>Source: al-Istidhkār 32083<\/p><\/blockquote>\n<p>And Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا حَدَّ عَلَى مُكْرَهَةٍ فِي قَوْلِ عَامَّةِ أَهْلِ الْعِلْمِ رُوِيَ ذَلِكَ عَنْ عُمَرَ وَالزُّهْرِيِّ وَقَتَادَةَ وَالثَّوْرِيِّ وَالشَّافِعِيِّ وَأَصْحَابِ الرَّأْيِ وَلَا نَعْلَمُ فِيهِ مُخَالِفًا &#8230; وَلَا فَرْقَ بَيْنَ الْإِكْرَاهِ بِالْإِلْجَاءِ وَهُوَ أَنْ يَغْلِبَهَا عَلَى نَفْسِهَا وَبَيْنَ الْإِكْرَاهِ بِالتَّهْدِيدِ بِالْقَتْلِ وَنَحْوِهِ<\/p>\n<p>There is no legal punishment upon a rape victim according to the general opinion of the scholars. It has been narrated from Umar, Al-Zuhri, Qatadah, Al-Thawri, Al-Shafi&#8217;i, and the people of reasoning. We do not know of any disagreement&#8230; There is no difference between rape by force, which is he had overpowered her, or rape by threat of death and so on.<\/p>\n<p>Source: al-Mughnī 9\/59<\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُكْرَهَةُ لَا حَدَّ عَلَيْهَا<\/p>\n<p>There is no punishment upon the rape victim.<\/p>\n<p>Source: al-Ṭuruq al-Ḥukmīyah 1\/49<\/p><\/blockquote>\n<p>The prohibition of rape and sexual assault applied to all women, including wives, slaves, and prisoners of war. Rape as a weapon of war is never considered permissible in Islam.<\/p>\n<p>Harun ibn al-Asim reported: Umar ibn al-Khattab, may Allah be pleased with him, dispatched Khalid ibn al-Walid with the army. Khalid sent Dirar ibn al-Azwar along with a company of horsemen and they raided a district belonging to the tribe of Asad. They captured a woman who was a beautiful bride-to-be and she amazed Dirar. He asked his companions for her and they gave her to him, then he had intercourse with her. When he returned from the expedition, he regretted what he had done and he collapsed in dismay. It was referred to Khalid and told him what he had done. Khalid said, “Indeed, I have made her permissible and wholesome for you.” Dirar said, “No, not until you write to Umar.” Umar replied that he should be stoned to death, but he had passed away from natural causes by the time Umar’s letter arrived. Khalid said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَ اللَّهُ لِيُخْزِيَ ضِرَارَ بْنَ الأَزْوَرِ<\/p>\n<p>Allah did not want to disgrace Dirar ibn al-Azwar.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/06\/umar-on-adultery-sentences-a-man-for-adultery-in-war\/\">al-Sunan al-Kubrá 16761<\/a><\/p><\/blockquote>\n<p>Umar (ra) was going to punish him for adultery even if she had consensual intercourse with him, because no one had legalized their relationship, so it would have been even worse if he had raped or harmed her.<\/p>\n<p>Al-Shafi’i said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا اغْتَصَبَ الرَّجُلُ الْجَارِيَةَ ثُمَّ وَطِئَهَا بَعْدَ الْغَصْبِ وَهُوَ مِنْ غَيْرِ أَهْلِ الْجَهَالَةِ أُخِذَتْ مِنْهُ الْجَارِيَةُ وَالْعُقْرُ وَأُقِيمَ عَلَيْهِ حَدُّ الزِّنَا<\/p>\n<p>If a man forcefully acquired a slave girl and then has intercourse with her thereafter, and he is not ignorant, the slave girl is taken away from him, he is fined, and he is punished for adultery.<\/p>\n<p>Source: al-Umm 3\/253<\/p><\/blockquote>\n<p>Furthermore, it is forbidden in Islam to merely slap a slave or a servant, let alone commit any harm greater than that. If a Muslim slapped his servant or slave in a manner that causes injury or indignity, the master would forfeit his legal custodianship over them.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessing be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِنَّ كَفَّارَتَهُ أَنْ يُعْتِقَهُ<\/p>\n<p><strong>Whoever strikes his slave sharply or slaps him, then the expiation for the sin is to emancipate him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1657, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/26\/hadith-on-freedom-the-expiation-for-the-sin-of-beating-a-slave-is-to-free-him\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Suwaid ibn Muqarrin reported: He had a servant girl and someone slapped her, so he said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَا عَلِمْتَ أَنَّ الصُّورَةَ مُحَرَّمَةٌ فَقَالَ لَقَدْ رَأَيْتُنِي وَإِنِّي لَسَابِعُ إِخْوَةٍ لِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَا لَنَا خَادِمٌ غَيْرُ وَاحِدٍ فَعَمَدَ أَحَدُنَا فَلَطَمَهُ فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نُعْتِقَهُ<\/p>\n<p>Did you not know that it is forbidden to strike the face? I was the seventh of my brothers during the lifetime of the Prophet and we had only one servant. One of us became enraged and slapped him, so the Prophet commanded us to set him free.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1658, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/12\/hadith-on-servants-the-messenger-of-allah-commanded-his-companion-to-free-a-slave-who-had-been-beaten\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Malik reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ عُمَرَ بْنَ الْخَطَّابِ رضي الله عنه أَتَتْهُ وَلِيدَةٌ قَدْ ضَرَبَهَا سَيِّدُهَا بِنَارٍ أَوْ أَصَابَهَا بِهَا فَأَعْتَقَهَا<\/p>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, was presented with a servant woman who had been struck by her master with a piece of hot iron or had been injured by it, so he ordered him to emancipate her.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/24\/umar-on-slaves-a-slave-injured-by-their-master-must-be-set-free\/\">al-Muwaṭṭa’ 2\/403<\/a><\/p><\/blockquote>\n<p>Al-Shawkani comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذَهَبَ مَالِكٌ وَالْأَوْزَاعِيُّ وَاللَّيْثُ إلَى عِتْقِ الْعَبْدِ بِذَلِكَ وَيَكُونُ وَلَاؤُهُ لَهُ وَيُعَاقِبُهُ السُّلْطَانُ عَلَى فِعْلِهِ<\/p>\n<p>Malik, Al-Awza’i, and Al-Layth adhered to the opinion that a slave is freed on account of that abuse, he will have his loyalty inheritance, and the authorities will punish the master for what he did.<\/p>\n<p>Source: Nayl al-Awṭār 6\/101<\/p><\/blockquote>\n<p>That tacit question is this: If a man may not even slap a slave, how then could he in good conscience rape her or sexually assault her?<\/p>\n<p>Anti-Muslim activists and their extremist Muslim counterparts agree that Islam allows the rape of captive women, yet their argument is one of silence. Since the Quran does not forbid rape, they imagine, it must therefore allow it. But an argument from silence is not a logically sound argument at all; rather, it is an incredibly unwarranted <em>eisegesis<\/em>, or a reading into the text that which it does not say. Plenty of evidence, as we have demonstrated, proves their claim to be false.<\/p>\n<p>Yet we must confront their specific misinterpretations. Their primary proof-text used to justify their claim of rape is the following tradition:<\/p>\n<p>Abu Sa’id al-Khudri reported: At the battle of Hunain, the Messenger of Allah, peace and blessings be upon him, sent an army to Awtas and they encountered the enemy and fought them. Having overcome them and taken them prisoner, the companions refrained from having intercourse with the captive women because their husbands were idolaters. Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ<\/p>\n<p>(Prohibited for you)<strong> are married women except those whom your right hands possesses.<\/strong> (4:24)<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1456, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>This narration, read in isolation, might appear to sanction rape, since the attitude of the women and the accompanying rules of concubinage are unstated in this particular text. On the contrary, the appropriate scholarly methodology requires the collation of all texts and commentaries on a given topic before coming to a conclusive rule, principle, or practice.<\/p>\n<p>In reality, we will find that this tradition is a proof <em>against<\/em> their position. Sexual intercourse was only made lawful with these women after they embraced Islam, which was a statement of their consent.<\/p>\n<p>Al-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ مَذْهَبَ الشَّافِعِيِّ وَمَنْ قَالَ بِقَوْلِهِ مِنَ الْعُلَمَاءِ أَنَّ الْمَسْبِيَّةَ مِنْ عَبَدَةِ الْأَوْثَانِ وَغَيْرِهِمْ مِنَ الْكُفَّارِ الَّذِينَ لَا كِتَابَ لَهُمْ لَا يَحِلُّ وَطْؤُهَا بِمِلْكِ الْيَمِينِ حَتَّى تُسْلِمَ فَمَا دَامَتْ عَلَى دِينِهَا فَهِيَ مُحَرَّمَةٌ وهَؤُلَاءِ الْمَسْبِيَّاتُ كُنَّ مِنْ مُشْرِكِي الْعَرَبِ عَبَدَةِ الْأَوْثَانِ فَيُئَوَّلُ هَذَا الْحَدِيثُ وَشِبْهُهُ عَلَى أَنَّهُنَّ أَسْلَمْنَ وَهَذَا التَّأْوِيلُ لَا بُدَّ مِنْهُ وَاللَّهُ أَعْلَمُ<\/p>\n<p>Know that it is the way of Al-Shafi’i, and the scholars who agreed with him, that it is unlawful to have intercourse with the captive women among the idolaters and other unbelievers who are without a divine scripture unless they first embrace Islam. They are forbidden to approach as long as they are following their religion and these captive girls were among the Arab polytheists who worshiped idols. This tradition and others like it imply that the women embraced Islam and this is how they must be interpreted. Allah knows best.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 1456<\/p><\/blockquote>\n<p>Taking responsibility for the custodianship of concubines is also not devoid of moral considerations, such as the divine command to treat them well.<\/p>\n<p>In sum, contrary to the practice of self-identified Muslim terrorists who rape their hostages, the righteous jurists prohibited rape and sexual assault against all women, including wives, concubines, and prisoners of war. Sexual intercourse was only lawful in a legally valid marriage or in concubinage, which substituted as a marriage but is no longer valid due to the unanimous abolition of slavery.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Scholars agree that the rapist must be given legal punishment,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[320,127,437,165,132,37,38,39,41,43,90,48,51,316,55,115,62,103,45,440,91,267,121,73,128],"class_list":["post-16852","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-abu-bakr","tag-adultery-zina","tag-concubines-al-surriyyah","tag-consensus-al-ijma","tag-freedom-al-huriyyah","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-innovation-bidah","tag-justice-adl","tag-leadership-imamate","tag-medina-madinah","tag-methodology-al-minhaj","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-rape","tag-righteous-predecessors-al-salaf-al-salih","tag-slavery-al-istibad","tag-terrorism-al-irhab","tag-umar-ibn-al-khattab","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4nO","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":16852,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":16852,"position":1},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17258,"url":"https:\/\/www.abuaminaelias.com\/marital-rape-domestic-violence\/","url_meta":{"origin":16852,"position":2},"title":"Marital rape and domestic violence in Islamic law","author":"Abu Amina Elias","date":"October 29, 2015","format":false,"excerpt":"\"Live with women honorably.\" (4:19)","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":16852,"position":3},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":16852,"position":4},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":16852,"position":5},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16852","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16852"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16852\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16852"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16852"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16852"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}