{"id":16910,"date":"2015-08-26T15:54:32","date_gmt":"2015-08-26T11:54:32","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16910"},"modified":"2018-03-25T16:06:34","modified_gmt":"2018-03-25T12:06:34","slug":"helping-refugees-and-emigrants-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/helping-refugees-and-emigrants-in-islam\/","title":{"rendered":"Helping refugees and emigrants in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>The world is experiencing an unprecedented refugee crisis as millions of people are forced from their homes and involuntarily displaced due to conflict, war, and poverty. In particular, there are an estimated <a href=\"http:\/\/data.unhcr.org\/syrianrefugees\/regional.php\">four million refugees from Syria<\/a> due to the civil war. Many of these people do not have sufficient food, clothing, or shelter, and they are not receiving enough assistance from neighboring countries due to a lack of resources.<\/p>\n<p>Every human being, regardless of their faith, has a natural right in Islam to food, clothing, and shelter.<\/p>\n<p>Uthman ibn Affan reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ لِابْنِ آدَمَ حَقٌّ فِي سِوَى هَذِهِ الْخِصَالِ بَيْتٌ يَسْكُنُهُ وَثَوْبٌ يُوَارِي عَوْرَتَهُ وَجِلْفُ الْخُبْزِ وَالْمَاءِ<\/p>\n<p><strong>There is no right for the son of Adam except in these things: a house in which he lives, a garment to cover his nakedness, a piece of bread and water.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2341, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/16\/hadith-on-rights-all-people-have-a-right-to-their-basic-needs-of-food-water-shelter-and-clothing\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It is our duty in Islam to help these refugees and asylum seekers to the extent of our capability, just as we would wish someone would help us if we were in their place.<\/p>\n<p>The story of Islam is one of the triumph of faith and brotherhood in the face of persecution. When the Muslims of Mecca, known as the <em>Muhajirun<\/em> (the emigrants), were being tortured and killed for their faith, the Muslims of Medina, known as the <em>Ansar<\/em> (the supporters), brought them into their homes and cared for them as if they were members of their own family.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِّمَّا أُوتُوا وَيُؤْثِرُونَ عَلَىٰ أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ<\/p>\n<p><strong>They love those who emigrated to them and find not any desire in their hearts of what the emigrants were given, but rather give them preference over themselves, even though they are in privation. Whoever is protected from the greediness of his own soul, then those will be successful.<\/strong><\/p>\n<p>Surat Al-Hashr 59:9<\/p><\/blockquote>\n<p>The righteous companions did not consider the emigrants to be a nuisance, but rather they accepted them with open arms and loved them, even giving these refugees preference over their own selves although they were in poverty.<\/p>\n<p>The parable of the believers in support of each other is that of the bricks of a building. Each brick is held up by the others bricks and all of them require each other’s support to remain standing.<\/p>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُؤْمِنَ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا<\/p>\n<p><strong>Verily, the believers are like a structure, each one strengthening the other.<\/strong><\/p>\n<p>Source: Sahih Bukhari 467, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/09\/28\/believers-are-like-a-structure-supporting-each-other\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the parable of the believers in their compassion for one another is that of a body. If one part of the body becomes ill or injured, the entire body responds to heal it.<\/p>\n<p>An-Nu’man ibn Basheer reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ وَالْحُمَّى<\/p>\n<p><strong>The example of the believers in their affection, mercy, and compassion for each other is that of a body. When any limb aches, the whole body reacts with sleeplessness and fever.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5665, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/03\/hadith-on-brotherhood-the-believers-are-like-one-body-in-their-love-mercy-and-compassion-for-each-other\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>We need to realize that our brothers and sisters in Islam are suffering and they need us just as we need them. We should feel pain and anguish when we hear stories of their suffering and this should motivate us to perform constructive action in the form of charity donated through trustworthy and authentic relief organizations.<\/p>\n<p>Allah and His Messenger have promised that whoever helps a person in need in this world will have his need taken care of in the Hereafter. There can be no better reward than for the Day of Resurrection to be made easy for us.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالآخِرَةِ<\/p>\n<p><strong>Whoever relieves the hardship of a believer in this world, Allah will relieve his hardship on the Day of Resurrection. Whoever helps ease someone in difficulty, Allah will make it easy for him in this world and in the Hereafter.<\/strong><\/p>\n<p>Source: Sahih Muslim 2699, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/15\/hadith-on-brotherhood-allah-helps-those-who-help-others-he-makes-easy-the-path-to-paradise-for-those-seeking-knowledge-and-he-gives-no-special-treatment-for-those-with-a-noble-lineage\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَنْظَرَ مُعْسِرًا أَوْ وَضَعَ لَهُ أَظَلَّهُ اللَّهُ يَوْمَ الْقِيَامَةِ تَحْتَ ظِلِّ عَرْشِهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ<\/p>\n<p><strong>Whoever grants respite to someone in difficulty or alleviates him, Allah will shade him on the Day of Resurrection when there is no shade but his.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 1306, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/06\/17\/hadith-on-ease-allah-will-shade-those-who-give-respite-and-grant-relief\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet set for us the most beautiful example in that he would never deny charity to anyone who asked him as long as he was capable of giving it.<\/p>\n<p>Jabir reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ قَطُّ فَقَالَ لَا<\/p>\n<p>The Prophet, peace and blessings be upon him, was never asked anything for which he said no.<\/p>\n<p>Source: Sahih Bukhari 5687, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/05\/hadith-on-charity-the-prophet-never-refused-someone-asking-him-for-charity\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْإِسْلَامِ شَيْئًا إِلَّا أَعْطَاهُ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, was never asked anything for the sake of Islam but that he would give it.<\/p>\n<p>Source: Sahih Muslim 2312, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/13\/hadith-on-generosity-the-messenger-of-allah-was-never-asked-to-give-for-the-sake-of-islam-except-that-he-said-yes\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>If this is the merciful example to which we must aspire, then how can we refuse to give something according to our means to those in terrible suffering?<\/p>\n<p>We are understandably concerned about our Muslim brothers and sisters, but we also have an obligation towards humanity, non-Muslims included. In fact, the Prophet would encourage his companions to give in charity to <em>any<\/em> beggar or needy person who approached them.<\/p>\n<p>Abu Musa reported: Whenever a beggar or a needy person came to the Prophet, peace and blessings be upon him, he would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اشْفَعُوا فَلْتُؤْجَرُوا<\/p>\n<p><strong>Intercede and you will be rewarded.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5681, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/11\/hadith-on-beggars-the-prophet-would-encourage-help-for-beggars-and-needy-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Similarly, Allah commanded us to accept the asylum of unbelievers coming from nations at war with the Muslims. The unbelief of a person is no excuse to deny them asylum or refugee status.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْلَمُونَ<\/p>\n<p><strong>If any one of the idolaters seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know.<\/strong><\/p>\n<p>Surat A-Tawba 9:6<\/p><\/blockquote>\n<p>The truth is that the most righteous people to Allah are those who are the most beneficial to mankind. If we want to earn the love of Allah, then we ought to be charitable to our neighbors regardless of our religion.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَبُّ النَّاسِ إِلَى اللَّهِ أَنْفَعُهُمْ لِلنَّاسِ<\/p>\n<p><strong>The people most beloved to Allah are those who are most beneficial to the people. <\/strong><\/p>\n<p>Source: Mu’jam Al-Awsat 6192, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/22\/hadith-on-virtues-the-most-beloved-to-allah-are-the-most-beneficial-to-the-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Those who deny charity to the vulnerable, particular those in positions of power capable of helping them, are exposing themselves to the anger of Allah and His punishment. The gates of Paradise will be closed for them just as they closed the doors of charity in the world.<\/p>\n<p>Amr ibn Murrah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ إِمَامٍ يُغْلِقُ بَابَهُ دُونَ ذَوِي الْحَاجَةِ وَالْخَلَّةِ وَالْمَسْكَنَةِ إِلَّا أَغْلَقَ اللَّهُ أَبْوَابَ السَّمَاءِ دُونَ خَلَّتِهِ وَحَاجَتِهِ وَمَسْكَنَتِهِ<\/p>\n<p><strong>There is no leader who closes the door to someone in need, one suffering in poverty, except that Allah closes the gates of the heavens for him when he is suffering in poverty.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 1332, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/31\/hadith-on-leadership-muslim-leaders-should-appoint-people-to-take-care-of-the-peoples-needs-or-else-allah-will-neglect-their-needs\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Finally, we need to beware of extremist voices who call not for charity, but rather for more violence. It was such irresponsible calls for violence that caused the refugee crisis in the first place. Allah describes such people are corrupters of the earth, even though they claim to be fighting for the oppressed.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ<\/p>\n<p><strong>When it is said to them: Do not cause corruption on the earth, they say: We are but reformers.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:11<\/p><\/blockquote>\n<p>Indeed, in this regard we need to follow the examples of our righteous predecessors, such as <a href=\"https:\/\/abuaminaelias.com\/patience-of-ahmad-ibn-hanbal-when-persecuted-by-the-caliph\/\">Ahmad ibn Hanbal<\/a>, who endured persecution at the hands of unjust governments, yet they resisted calling for violent rebellion and instead called the people to prayer, patience, humility, and charity.<\/p>\n<p>We ask Allah to relieve our brothers and sisters who are suffering from this crisis and to make the Muslims a light for the world by their kindness, compassion, and good deeds.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever helps ease someone in difficulty, Allah will make it easy for him in this world and in the Hereafter.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[241,17,183,49,32,34,95,37,120,52,207,316,54,62,91,98],"class_list":["post-16910","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-brotherhood-al-ikhwa","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-hypocrisy-al-nifaq","tag-idolatry-shirk","tag-rebels-khawarij","tag-love-al-mahabbah","tag-mecca-makkah","tag-medina-madinah","tag-mercy-al-rahmah","tag-prophetic-biography-sirah","tag-righteous-predecessors-al-salaf-al-salih","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4oK","jetpack-related-posts":[{"id":14876,"url":"https:\/\/www.abuaminaelias.com\/who-implements-hudud-punishments\/","url_meta":{"origin":16910,"position":0},"title":"Who carries out Islamic legal punishments?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"It is forbidden to establish a legal punishment unless...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16910,"position":1},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13078,"url":"https:\/\/www.abuaminaelias.com\/prophet-genocide-banu-qurayza\/","url_meta":{"origin":16910,"position":2},"title":"Did the Prophet commit genocide against Jews?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The aggression of Banu Quraiza was the reason the Muslims attacked them,\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":16910,"position":3},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20895,"url":"https:\/\/www.abuaminaelias.com\/hadith-ghazwa-hind-invasion-india\/","url_meta":{"origin":16910,"position":4},"title":"Hadith Ghazwa-e-Hind: Invasion of India?","author":"Abu Amina Elias","date":"September 3, 2019","format":false,"excerpt":"\"There is weakness in its chain.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16113,"url":"https:\/\/www.abuaminaelias.com\/mercy-towards-prisoners-of-war-in-islam\/","url_meta":{"origin":16910,"position":5},"title":"Mercy towards prisoners of war in Islam","author":"Abu Amina Elias","date":"December 1, 2014","format":false,"excerpt":"“I enjoin you to treat the captives well.”","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16910","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16910"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16910\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16910"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16910"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16910"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}