{"id":16945,"date":"2015-08-31T16:33:07","date_gmt":"2015-08-31T12:33:07","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16945"},"modified":"2018-03-25T16:06:21","modified_gmt":"2018-03-25T12:06:21","slug":"understanding-loyalty-and-disavowal-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/understanding-loyalty-and-disavowal-in-islam\/","title":{"rendered":"Understanding loyalty and disavowal in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Beneficent, the Merciful<\/em><\/p>\n<p>Loyal and disavowal in Islam (<em>al-wala wal bara<\/em>) is an essential doctrine in the orthodox creed, yet many people, including some Muslims, have misunderstood how this concept should be applied within the totality of Islamic teachings. In short, loyalty and disavowal means to be loyal to the community of believers and the teachings upon which it is based, and to disavow the actions of those who oppose Islam and persecute the Muslim community.<\/p>\n<p>Loyalty in Islam (<em>al-wala<\/em>) is the expression of brotherhood, kindness, and compassion Muslims ought to have for one another.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ<\/p>\n<p><strong>The believers are but brothers, so reconcile between your brothers and fear Allah that you may receive mercy.<\/strong><\/p>\n<p>Surat Al-Hujurat 49:10<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ سَيَرْحَمُهُمُ اللَّهُ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ<\/p>\n<p><strong>The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give charity and obey Allah and His Messenger. Allah will have mercy upon them, for Allah is almighty and wise.<\/strong><\/p>\n<p>Surat At-Tawba 9:71<\/p><\/blockquote>\n<p>There are many verses and traditions teaching us to support the believers in our religious practice and daily lives and to come to the aid of those in our community who are suffering.<\/p>\n<p>Nevertheless, Islam calls us to be loyal first and foremost to Allah and His messenger and their <em>values<\/em> and <em>teachings<\/em>, not to any particular person or leader in themselves.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا‏<\/p>\n<p><strong>Help your brother whether he is an oppressor or is being oppressed. <\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, we help the one being oppressed but how do we help an oppressor?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَأْخُذُ فَوْقَ يَدَيْهِ<\/p>\n<p><strong>By seizing his hand.<\/strong><\/p>\n<p>Source: Sahih Bukhari 2312, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/14\/help-the-oppressor-by-preventing-him-from-oppressing-others\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet redefined the tribal slogan, originally meaning <em>my tribe right or wrong<\/em>, to now mean loyalty to justice and righteousness. Loyalty to the Muslims does not mean to overlook or excuse their injustices, but rather to stop them from committing oppression.<\/p>\n<p>Tribalism, the idea that we should support our “side” regardless of considerations of justice, has been totally rejected by Islam.<\/p>\n<p>Jubair ibn Mut’im reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ مِنَّا مَنْ دَعَا إِلَى عَصَبِيَّةٍ وَلَيْسَ مِنَّا مَنْ قَاتَلَ عَلَى عَصَبِيَّةٍ وَلَيْسَ مِنَّا مَنْ مَاتَ عَلَى عَصَبِيَّةٍ<\/p>\n<p><strong>He is not one of us who calls to tribalism. He is not one of us who fights for the sake of tribalism. He is not one of us who dies following the way of tribalism.<\/strong><\/p>\n<p>Source: Sunan Abu Dawud 5102, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/19\/he-is-not-one-of-us-who-calls-to-tribalism\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Islam teaches us be just, fair, and to offer good will towards all people regardless of their religion. We are allowed to have good relations with non-Muslims, to trade and conduct business with them, and to be kind to them, even though we do not associate ourselves with their religion. However, there are times when injustice reaches such a level that we must take a stand and completely disavow ourselves from oppressors and the communities that condone them.<\/p>\n<p>Disavowal in Islam (<em>al-bara<\/em>) is the act of disassociating and withdrawing support for those who oppose our values and persecute our religion.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا بِطَانَةً مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًا وَدُّوا مَا عَنِتُّمْ قَدْ بَدَتِ الْبَغْضَاءُ مِنْ أَفْوَاهِهِمْ وَمَا تُخْفِي صُدُورُهُمْ أَكْبَرُ ۚ قَدْ بَيَّنَّا لَكُمُ الْآيَاتِ ۖ إِن كُنتُمْ تَعْقِلُونَ<\/p>\n<p><strong>O you who believe, do not take as intimates those other than yourselves, for they will not spare you any ruin. They wish you would have hardship. Hatred has already appeared from their mouths, and what their breasts conceal is greater. We have certainly made clear to you the signs, if you will reason.<\/strong><\/p>\n<p>Surat Ali Imran 3:118<\/p><\/blockquote>\n<p>It is clear from this verse, and others, that disavowal is primarily aimed at people whose “hatred has already appeared from their mouths,” meaning they are openly hostile to Islam and the Muslim community. Another verse makes clear that Allah has not forbidden kind and amicable relations with non-Muslims who tolerate Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَّا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَارِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُم مِّن دِيَارِكُمْ وَظَاهَرُوا عَلَىٰ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ وَمَن يَتَوَلَّهُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ<\/p>\n<p><strong>Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes, He does not forbid you from being benevolent towards them and acting justly towards them. Verily, Allah loves those who act justly. Allah only forbids you from those who fight you because of religion and expel you from your homes and aid in your expulsion, He forbids you to make allies of them. Whoever makes allies of them, then it is those who are the wrongdoers.<\/strong><\/p>\n<p>Surah Al-Mumtahina 60:8-9<\/p><\/blockquote>\n<p>Hence, Muslims should practice fairness (<em>qist<\/em>) and benevolence (<em>birr<\/em>) with all non-Muslims who desire good relations.<\/p>\n<p>At-Tabari comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمَّ يُقَاتِلُوكُمْ فِي الدِّينِ مِنْ جَمِيعِ أَصْنَافِ الْمِلَلِ وَالْأَدْيَانِ أَنْ تَبَرُّوهُمْ وَتَصِلُوهُمْ وَتُقْسِطُوا إِلَيْهِمْ<\/p>\n<p>Allah does not forbid you from those who do not fight you because of religion – including all the sects, creeds, and religions – that you behave righteously with them, maintain good relations with them, and act fairly with them.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/14\/at-tabari-behave-well-with-all-sects-creeds-and-religions-who-seek-peace\/\">Tafseer At-Tabari 60:8<\/a><\/p><\/blockquote>\n<p>Islam does not desire for Muslims to have bad relations with non-Muslim communities. Severing and corrupting relations is the hallmark of those who will be judged harshly in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۚ أُولَٰئِكَ هُمُ الْخَاسِرُونَ<\/p>\n<p><strong>Those who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and cause corruption on earth, it is those who are the losers.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:27<\/p><\/blockquote>\n<p>It is preferred for non-Muslim communities to be reconciled with the Muslims. It is a great blessing from Allah when the enemies of Islam have a change of heart and discontinue their hostility towards Muslims.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَسَى اللَّهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً ۚ وَاللَّهُ قَدِيرٌ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ<\/p>\n<p><strong>Perhaps Allah will place affection between you and those who have been your enemies, for Allah is capable and Allah is forgiving and merciful.<\/strong><\/p>\n<p>Surat Al-Mumtahana 60:7<\/p><\/blockquote>\n<p>Moreover, reconciliation between people is a great virtue in Islam, even more so than voluntary prayers, fasting, and acts of charity.<\/p>\n<p>Abu Ad-Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصِّيَامِ وَالصَّلَاةِ وَالصَّدَقَةِ<\/p>\n<p><strong>Shall I not tell you about what is more virtuous in degree than extra fasting, prayer, and charity?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَلَاحُ ذَاتِ الْبَيْنِ فَإِنَّ فَسَادَ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ<\/p>\n<p><strong>Reconciliation between people. Verily, corrupted relations between people is the razor.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 2509, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/08\/hadith-on-reconciliation-peaceful-relations-between-people-is-more-virtuous-than-individual-acts-of-worship\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>In particular, we need to give special care to our family relations. Muslims are required to maintain good relations with their parents and families in every circumstance, even if they are among those who strongly oppose Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ وَإِن جَاهَدَاكَ عَلَىٰ أَن تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۖ وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا ۖ وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ<\/p>\n<p><strong>We have enjoined upon man to care for his parents. His mother carried him, increasing her in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents, for unto Me is the final destination. But if they strive to make you associate with Me that of which you have no knowledge, then do not obey them but accompany them in this world with appropriate kindness and follow the way of those who turn back to Me.<\/strong><\/p>\n<p>Surat Luqman 31:14-15<\/p><\/blockquote>\n<p>Even if our parents strive (<em>jahada<\/em>), or wage jihad, against us for practicing Islam, we must still show them good behavior (<em>ma’ruf<\/em>). Islam teaches us not to simply return good behavior to family members who are good to us, but rather to be good to all of our family members regardless of how they treat us.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْوَاصِلُ بِالْمُكَافِئِ وَلَكِنْ الْوَاصِلُ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا<\/p>\n<p><strong>The one who keep good relations with his family is not the one who recompenses the good done to him. Rather, the one who keeps good relations with his family is the one who continues to be good to them despite having been cut off by them.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5645, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/03\/hadith-on-family-the-truly-righteous-are-good-to-those-who-sever-relations-with-them\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Muslims sometimes face harsh opposition from their family members after they have embraced Islam, in which case we should disavow their actions without disavowing relations with them completely. The Prophet’s family members opposed him and he publicly disavowed their behavior, although he made it clear that he would continue to have good relations with them as best as he could.<\/p>\n<p>Amr ibn Al-‘As reported: I heard the Messenger of Allah, peace and blessings be upon him, saying publicly and not secretly:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ آلَ أَبِي لَيْسُوا بِأَوْلِيَائِي إِنَّمَا وَلِيِّيَ اللَّهُ وَصَالِحُ الْمُؤْمِنِينَ وَلَكِنْ لَهُمْ رَحِمٌ أَبُلُّهَا بِبَلَاهَا يَعْنِي أَصِلُهَا بِصِلَتِهَا<\/p>\n<p><strong>Verily, the relatives of my father are not my allies. Verily, only Allah and the righteous believers are my allies. Yet, they have the bonds of kinship and I will uphold their family ties.<\/strong><\/p>\n<p>Source: Sahih Bukhari 5644, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/05\/12\/hadith-on-family-the-prophets-family-disowned-him-but-he-still-maintained-relations\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The concept of disavowal is sometimes associated with the concept of “hate for the sake of Allah,” which really means to hate sinful deeds but not sinners themselves. Misunderstanding this important point has provoked some Muslims to deliver hateful sermons with inflammatory rhetoric in a manner that Islam does not condone.<\/p>\n<p>In reality, we all have natural love for people, especially for our families, and this type of love towards unbelievers is permissible as long as it does not lead to sin.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَٰكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ ۚ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ<\/p>\n<p><strong>Verily, you cannot guide those whom you love, but rather Allah guides whomever He wills and He knows best those who are guided.<\/strong><\/p>\n<p>Surat Al-Qasas 28:56<\/p><\/blockquote>\n<p>The commentators agree that “those whom you love” in this verse refers specifically to the Prophet’s uncle Abu Talib who, although he supported the Prophet, never embraced Islam and remained an idolater. The Prophet loved him as a member of his family even though he disavowed himself from his uncle&#8217;s idolatrous religion.<\/p>\n<p>Furthermore, we ought to have religious love towards unbelievers which is to love good for them the same as we would love it for ourselves and to treat them the way we would love to be treated.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother or his neighbor what he loves for himself.<\/strong><\/p>\n<p>Source: Sahih Muslim 45, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The righteous predecessors (<em>as-salaf as-salih<\/em>) would disavow themselves from the actions of sinners while at the same time showing them mercy, good will, and an intention to benefit them.<\/p>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ بَعْضُ الصَّالِحِينَ مِنَ السَّلَفِ أَهْلُ الْمَحَبَّةِ لِلَّهِ نَظَرُوا بِنُورِ اللَّهِ وَعَطَفُوا عَلَى أَهْلِ مَعَاصِي اللَّهِ مَقَتُوا أَعْمَالَهُمْ وَعَطَفُوا عَلَيْهِمْ لِيُزِيلُوهُمْ بِالْمَوَاعِظِ عَنْ فِعَالِهِمْ وَأَشْفَقُوا عَلَى أَبْدَانِهِمْ مِنَ النَّارِ وَلَا يَكُونُ الْمُؤْمِنُ مُؤْمِنًا حَقًّا حَتَّى يَرْضَى لِلنَّاسِ مَا يَرْضَاهُ لِنَفْسِهِ<\/p>\n<p>Some of the righteous predecessors said: The people who love Allah look by the light of Allah, and they are compassionate with those who disobey Allah. They hate their actions but show mercy to them so that through their admonitions they might leave their actions. They are afraid that the Hellfire will consume their bodies. The believer will not truly be a believer until he is pleased for people to have what he is pleased for himself.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/08\/ibn-rajab-those-who-love-allah-are-compassionate-with-sinners-and-wish-them-well\/\">Jāmi’ al-‘Ulūm wal-Ḥikam 13<\/a><\/p><\/blockquote>\n<p>Islam never approves of preaching the type of hatred that leads to aggression, malice, and discord.<\/p>\n<p>Lastly, it might be argued by extremists that all of the verses and traditions speaking of good relations with non-Muslims have been &#8220;abrogated&#8221; during the final conflict at the end of the Prophet&#8217;s life. This interpretation is implausible and invalid since it has been authentically confirmed that the Prophet maintained business relationships with non-Muslims from the beginning of his life until the very end.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلَاثِينَ صَاعًا مِنْ شَعِيرٍ<\/p>\n<p>The Prophet, peace and blessings be upon him, passed away while his armor was mortgaged to a Jew for thirty units of barley.<\/p>\n<p>Source: Sahih Bukhari 2759, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/20\/the-prophet-maintained-good-relations-with-non-muslims-throughout-his-entire-life\/\">Muttafaqun Alayhi<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>In sum, the concept of loyalty and disavowal is about staying true to our values and principles. We should be loyal and supportive of those who practice Islam and disavow ourselves from actions with contradict Islam. At the same time we should maintain good relations with others as much as possible, especially our families, even if they are unbelievers. We should hate sin and evil deeds and disassociate ourselves from them, while also loving goodness for sinners and treating them the way we would love to be treated.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The believing men and believing women are allies of one another.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[241,282,18,21,24,26,49,27,30,47,48,52,54,126,298,115,62,98,128],"class_list":["post-16945","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-brotherhood-al-ikhwa","tag-children","tag-community-jamaah","tag-creed-aqidah","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-gentleness-al-rifq","tag-god-fearing-taqwa","tag-hatred-bigdah","tag-jihad","tag-justice-adl","tag-love-al-mahabbah","tag-mercy-al-rahmah","tag-neighbors","tag-parents","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-unbelief-al-kufr","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4pj","jetpack-related-posts":[{"id":17935,"url":"https:\/\/www.abuaminaelias.com\/the-muslims-will-split-into-seventy-three-sects\/","url_meta":{"origin":16945,"position":0},"title":"Muslims will split into seventy three sects","author":"Abu Amina Elias","date":"March 27, 2016","format":false,"excerpt":"\"Indeed, this splitting has happened due to the presence of aggression and hatred.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16523,"url":"https:\/\/www.abuaminaelias.com\/blessed-are-the-strangers-in-islam\/","url_meta":{"origin":16945,"position":1},"title":"Blessed are the strangers in Islam","author":"Abu Amina Elias","date":"April 10, 2015","format":false,"excerpt":"\"Be in this world as if you were a stranger or a traveler along a path.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":16945,"position":2},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13256,"url":"https:\/\/www.abuaminaelias.com\/why-does-islam-allow-polygamy\/","url_meta":{"origin":16945,"position":3},"title":"Why does Islam allow polygamy?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"You will never be able to do perfect justice between wives...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":16945,"position":4},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":16945,"position":5},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16945","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16945"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16945\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16945"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16945"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16945"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}