{"id":16994,"date":"2015-09-15T14:43:27","date_gmt":"2015-09-15T10:43:27","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=16994"},"modified":"2020-07-17T21:37:24","modified_gmt":"2020-07-17T17:37:24","slug":"honor-your-father-and-mother-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/honor-your-father-and-mother-in-islam\/","title":{"rendered":"Honor your father and mother in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam commands us to honor our parents, to obey them, to respect their opinion, and to be kind in general to our family members.<\/p>\n<p>One of the most important concepts for family life in Islam is known as “upholding family ties” (<em>silat ar-rahim<\/em>). The Quran and Sunnah contain many instructions for us to behave well with our family members, even if they are unbelievers. Scholars have compiled these into many works demonstrating the importance of strong family relations.<\/p>\n<p>In fact, Allah will maintain relations with those who are good to their families and He will cut off those who sever relations with their families.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ خَلَقَ الْخَلْقَ حَتَّى إِذَا فَرَغَ مِنْهُمْ قَامَتْ الرَّحِمُ فَقَالَتْ هَذَا مَقَامُ الْعَائِذِ مِنْ الْقَطِيعَةِ قَالَ نَعَمْ أَمَا تَرْضَيْنَ أَنْ أَصِلَ مَنْ وَصَلَكِ وَأَقْطَعَ مَنْ قَطَعَكِ قَالَتْ بَلَى قَالَ فَذَاكِ لَكِ<\/p>\n<p><strong>Verily, Allah made the creation and when he finished, the womb said: In this place, I seek refuge in you from those who sever me. Allah said: Are you not pleased that I keep good relations with those who are good to you and I will cut off whoever severs relations with you? The womb said: Yes, my Lord. Allah said: Thus, you will have it.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اقْرَءُوا إِنْ شِئْتُمْ فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ<\/p>\n<p><strong>Recite the verse if you wish: Will you then, if you were given authority, spread corruption in the land and sever your family ties?<\/strong> (47:22)<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5641 5641, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/09\/17\/spread-fasad-cut-rahim\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Severing family relations is an act of “corruption” (<em>fasad<\/em>) that is the hallmark of the disobedient and sinful.<\/p>\n<p>Healthy family ties begin with “righteousness towards parents” (<em>birr al-walidayn<\/em>). Allah has commanded us in many verses to be excellent to our parents and has indicated the importance of this deed by stating it in association with the pure worship of Allah alone.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا<\/p>\n<p><strong>Worship Allah and associate nothing with him, and be good to parents.<\/strong><\/p>\n<p>Surat al-Nisa 4:36<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا<\/p>\n<p><strong>Say: Come, I will recite what your Lord has made sacred to you. He commands that you do not associate anything with Him, and be good to your parents.<\/strong><\/p>\n<p>Surat al-An’am 6:151<\/p><\/blockquote>\n<p>Allah commands us not even to say “Uff!” to our parents, which is a very minor word of annoyance. Anything worse than that is obviously prohibited. Our respect for our parents should be impeccable in every circumstance, to the best of our ability.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِندَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُل لَّهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُل لَّهُمَا قَوْلًا كَرِيمًا وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُل رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا<\/p>\n<p><strong>Your Lord has decreed that you worship none but him, and be good to your parents. Whether one or both of them reach old age with you, do not say to them a word of annoyance and do not repel them, but rather speak to them a noble word. Lower to them the wing of humility for them, out of mercy, and say: My Lord, have mercy upon them as they brought me up when I was small.<\/strong><\/p>\n<p>Surat al-Isra 17:23-24<\/p><\/blockquote>\n<p>We must be good to our parents even if they are unbelievers and command us to commit sins.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِن جَاهَدَاكَ عَلَىٰ أَن تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۖ وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا ۖ وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ<\/p>\n<p><strong>If they strive to make you associate with Me that of which you have no knowledge, then do not obey them but accompany them in this world with appropriate kindness and follow the way of those who turn back to Me.<\/strong><\/p>\n<p>Surat Luqman 31:14-15<\/p><\/blockquote>\n<p>In other words, even if our parents wage jihad (<em>jaahada<\/em>) against us to make us worship idols, we should not obey them in this particular matter but we should still accompany them kindly and obey them in reasonable matters.<\/p>\n<p>The Prophet (s) demonstrated this behavior in the best way after some members of his family turned against him for preaching Islam. Despite their hostility, he maintained good relations with them to the best of his ability.<\/p>\n<p>Amr ibn al-‘As reported: I heard the Messenger of Allah, peace and blessings be upon him, saying publicly and not secretly:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ آلَ أَبِي لَيْسُوا بِأَوْلِيَائِي إِنَّمَا وَلِيِّيَ اللَّهُ وَصَالِحُ الْمُؤْمِنِينَ وَلَكِنْ لَهُمْ رَحِمٌ أَبُلُّهَا بِبَلَاهَا يَعْنِي أَصِلُهَا بِصِلَتِهَا<\/p>\n<p><strong>Verily, the relatives of my father are not my allies. Verily, only Allah and the righteous believers are my allies. Yet, they have the bonds of kinship and I will uphold their family ties.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5644, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/05\/12\/maintain-relations-kuffar-family\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Upholding family ties does not mean simply returning good behavior when our family members are good to us. Rather, truly upholding family ties means to behave well with them no matter what they do to us.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْوَاصِلُ بِالْمُكَافِئِ وَلَكِنْ الْوَاصِلُ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا<\/p>\n<p>The one who keep good relations with his family is not the one who reciprocates the good done to him. Rather, the one who keeps good relations with his family is the one who continues to be good to them despite having been cut off by them.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5645, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/03\/family-ties-reciprocate\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Our duties to our parents extend even after their death. One of the best ways to honor our parents when they are gone is by being kind to their friends.<\/p>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبَرُّ الْبِرِّ أَنْ يَصِلَ الرَّجُلُ وُدَّ أَبِيهِ<\/p>\n<p><strong>The best act of righteousness is to maintain relations with a man loved by his father<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2552, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/09\/05\/birr-friends-of-parents\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Our supplications for Allah to forgive them and have mercy on them will benefit them even as they are existing in the grave.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَرْفَعُ الدَّرَجَةَ لِلْعَبْدِ الصَّالِحِ فِي الْجَنَّةِ فَيَقُولُ يَا رَبِّ أَنَّى لِي هَذِهِ فَيَقُولُ بِاسْتِغْفَارِ وَلَدِكَ لَكَ<\/p>\n<p><strong>Verily, Allah Almighty will raise the status of his righteous servants in Paradise and they will say: O Lord, what is this? Allah will say: This is due to your child seeking forgiveness for you.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 10232, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/03\/09\/dua-parents-children-jannah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Each particular parent has served us in a special way that only natural fathers and mothers can provide.<\/p>\n<p>We should realize that our fathers have served us so much that we can never fully compensate them. It would only be possible to fully repay our fathers if we found them as a slave and set them free, which is practically impossible.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَجْزِي وَلَدٌ وَالِدًا إِلَّا أَنْ يَجِدَهُ مَمْلُوكًا فَيَشْتَرِيَهُ فَيُعْتِقَهُ<\/p>\n<p><strong>No child can compensate his father unless he finds him as a slave, buys him, and sets him free.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2787, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/13\/compensate-father\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>That father is, in fact, a means for us to enter Paradise just by treating them well and being dutiful to their needs.<\/p>\n<p>Abu Darda reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْوَالِدُ أَوْسَطُ أَبْوَابِ الْجَنَّةِ فَإِنْ شِئْتَ فَأَضِعْ ذَلِكَ الْبَابَ أَوْ احْفَظْهُ<\/p>\n<p><strong>The father is the middle of the gates of Paradise, so keep to this gate or lose it<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1900, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/08\/17\/father-middle-door-paradise\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Such is the great honor a father deserves, yet the mother deserves even more due to the great sacrifices and pain she endured during childbirth.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ<\/p>\n<p><strong>We have enjoined upon man care for his parents. His mother carried him in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents, for unto Me is the final destination.<\/strong><\/p>\n<p>Surat Luqman 31:14<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ إِحْسَانًا ۖ حَمَلَتْهُ أُمُّهُ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا ۚ حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ<\/p>\n<p><strong>We have enjoined upon man to be good to his parents. His mother carried him with hardship and gave birth to him with hardship, and his gestation and weaning is thirty months. He grows until, when he matures and reaches the age of forty years, he says: My Lord, enable me to be grateful for your favor you have bestowed upon me and upon my parents, and to work righteousness of pleasing to you, and to make my offspring righteous for me. Verily, I have repented to you, and I am of the Muslims who surrender to you.<\/strong><\/p>\n<p>Surat al-Ahqaf 46:15<\/p><\/blockquote>\n<p>For this reason, the Prophet (s) declared that our mother is the most deserving of our good company, even before our father.<\/p>\n<p>Abu Huraira reported: A man asked the Messenger of Allah, peace and blessings be upon him, “Who is most deserving of my good company?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُمُّكَ<\/p>\n<p><strong>Your mother.<\/strong><\/p><\/blockquote>\n<p>The man asked, “Then who?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُمُّكَ<\/p>\n<p><strong>Your mother.<\/strong><\/p><\/blockquote>\n<p>The man asked again, “Then who?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُمُّكَ<\/p>\n<p><strong>Your mother.<\/strong><\/p><\/blockquote>\n<p>The man asked again, “Then who?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبُوكَ<\/p>\n<p><strong>Your father.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5626, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/12\/honor-mother-then-father\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The mother’s rights over us are so great that the Prophet (s) once told a man not to join the military expedition so he could return to his parents and serve them, specifically his mother, for Paradise is under her feet.<\/p>\n<p>Abdullah ibn Amr reported: A man came to the Messenger of Allah, peace and blessings be upon him, asking permission to strive in jihad. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> أَحَيٌّ وَالِدَاكَ<\/p>\n<p><strong>Are your parents alive?<\/strong><\/p><\/blockquote>\n<p>He said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَفِيهِمَا فَجَاهِدْ<\/p>\n<p><strong>Then strive in their service.<\/strong><\/p><\/blockquote>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2842, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/31\/jihad-for-your-parents\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَارْجِعْ إِلَى وَالِدَيْكَ فَأَحْسِنْ صُحْبَتَهُمَا<\/p>\n<p><strong>Then return to your parents and treat them with good company.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2549, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ارْجِعْ عَلَيْهِمَا فَأَضْحِكْهُمَا كَمَا أَبْكَيْتَهُمَا<\/p>\n<p><strong>Return to them and make them laugh, just as you made them cry<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 2528, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/03\/parents-make-them-laugh\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Mu’awiyah ibn Jahima reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, I intend to join the expedition and I seek your advice.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ لَكَ مِنْ أُمٍّ<\/p>\n<p><strong>Do you have a mother?<\/strong><\/p><\/blockquote>\n<p>He said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْزَمْهَا فَإِنَّ الْجَنَّةَ تَحْتَ رِجْلَيْهَا<\/p>\n<p><strong>Stay with her, for Paradise is beneath her feet.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3104, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/19\/jannah-is-under-her-feet\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Hence, our duty to our mothers is not optional or merely recommended. It is an obligation and Allah has forbidden us from neglecting our mothers and our parents in general.<\/p>\n<p>Al-Mughirah ibn Sha’bah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ عُقُوقَ الْأُمَّهَاتِ<\/p>\n<p><strong>Verily, Allah has forbidden you from neglecting your duty to your mothers.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī  5630, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/03\/disobedience-to-mothers\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>It should be clear to us now how important it is to obey our parents and treat them well. Conversely, disobedience to parents is among the worst major sins in Islam.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said regarding the major sins:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشِّرْكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَقَوْلُ الزُّورِ<\/p>\n<p><strong>They are associating idols with Allah, disobedience to parents, killing a person, and false testimony<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5632, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/19\/major-sins-shirk-kadhib-murder\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>If the Prophet (s) has associated disobedience to parents with idolatry and falsehood, the worst sins in Islam, then this tells us that disobedience is not a sinful deed we should take lightly.<\/p>\n<p>We ask Allah to bless our parents, to forgive them, to have mercy upon them, and to assist us in fulfilling our duties toward them.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Worship Allah and be good to parents.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[16,282,18,20,22,24,26,37,47,100,54,56,94,298,220,72],"class_list":["post-16994","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-character-akhlaq","tag-children","tag-community-jamaah","tag-creation-al-khalq","tag-excellence-ihsaan","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-idolatry-shirk","tag-jihad","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-obedience-al-taah","tag-parents","tag-supplication-al-dua","tag-truthfulness-al-sidq"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4q6","jetpack-related-posts":[{"id":16945,"url":"https:\/\/www.abuaminaelias.com\/understanding-loyalty-and-disavowal-in-islam\/","url_meta":{"origin":16994,"position":0},"title":"Understanding loyalty and disavowal in Islam","author":"Abu Amina Elias","date":"August 31, 2015","format":false,"excerpt":"\"The believing men and believing women are allies of one another.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15712,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-kindness-to-parents-and-family\/","url_meta":{"origin":16994,"position":1},"title":"Imam al-Nawawi on Kindness to Parents and Family","author":"Abu Amina Elias","date":"May 12, 2014","format":false,"excerpt":"\"Worship Allah... and be kind to parents.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13495,"url":"https:\/\/www.abuaminaelias.com\/everyday-is-mothers-day-in-islam\/","url_meta":{"origin":16994,"position":2},"title":"Every day is Mother’s Day in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Be grateful to Me and to your parents, for unto Me is the final destination.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23271,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-silat-al-rahim\/","url_meta":{"origin":16994,"position":3},"title":"Imam al-Mundhiri on Good Family Relations","author":"Abu Amina Elias","date":"June 1, 2021","format":false,"excerpt":"\"Whoever believes in Allah and the Last Day, let him uphold his family ties.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15251,"url":"https:\/\/www.abuaminaelias.com\/brotherhood-quran-and-sunnah\/","url_meta":{"origin":16994,"position":4},"title":"Brotherhood in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 20, 2014","format":false,"excerpt":"\"The believers are but brothers,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16242,"url":"https:\/\/www.abuaminaelias.com\/every-good-deed-is-charity-in-islam\/","url_meta":{"origin":16994,"position":5},"title":"Every good deed is charity in Islam","author":"Abu Amina Elias","date":"January 26, 2015","format":false,"excerpt":"\"Has not Allah made for you ways to give charity? In every glorification of Allah is charity.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16994","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=16994"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/16994\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=16994"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=16994"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=16994"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}