{"id":17033,"date":"2016-07-04T10:49:17","date_gmt":"2016-07-04T06:49:17","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17033"},"modified":"2025-07-04T11:01:36","modified_gmt":"2025-07-04T07:01:36","slug":"all-human-life-sacred-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/all-human-life-sacred-in-islam\/","title":{"rendered":"All human life is sacred in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam guarantees the right of life for every human being, whether they are Muslims or non-Muslims. Every human life is sacred in Islam and every person has been granted God-given fundamental and universal rights at the time of their birth.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا<\/p>\n<p><strong>We have certainly dignified the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created with definite preference.<\/strong><\/p>\n<p>Surat Al-Isra 17:70<\/p><\/blockquote>\n<p>The dignity that Allah bestowed upon humankind at the time of creation was the blessing of a sacred inviolability which manifests itself as the rights to life, freedom, and property. The right to life has been recognized as the first and most important universal right derived from the Sharia and classical Islamic law.<\/p>\n<p>During his final sermon at the Hajj pilgrimage, the Prophet declared that the lives, property, and honor of all people are sacred in the same sense that Mecca and Islam’s religious symbols are sacred.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said during his farewell sermon:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَيُّ شَهْرٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً<\/p>\n<p><strong>Which month do you believe has the greatest sanctity?<\/strong><\/p><\/blockquote>\n<p>They said, “This month of ours, Dhul Hijjah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَيُّ بَلَدٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً<\/p>\n<p><strong>Which city do you believe has the greatest sanctity? <\/strong><\/p><\/blockquote>\n<p>They said, “This city of ours, Mecca.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَيُّ يَوْمٍ تَعْلَمُونَهُ أَعْظَمُ حُرْمَةً<\/p>\n<p><strong>Which day do you believe has the greatest sanctity?<\/strong><\/p><\/blockquote>\n<p>They said, “This day of ours, Arafat.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ إِلَّا بِحَقِّهَا كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا أَلَا هَلْ بَلَّغْتُ<\/p>\n<p><strong>Verily, Allah the Exalted has made sacred your lives, your wealth, and your honor except by right of justice, just as your day, your city, and your month are sacred. Have I not delivered the message?<\/strong><\/p><\/blockquote>\n<p>Then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيْحَكُمْ أَوْ وَيْلَكُمْ لَا تَرْجِعُنَّ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ<\/p>\n<p><strong>Beware! Do not return to unbelief after me by striking the necks of each other.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6403, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/16\/farewell-sermon-allah-has-made-your-lives-as-sacred-as-mecca-the-hajj-pilgrimage-and-the-month-of-dhul-hijjah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Just as Muslims honor and respect the Hajj pilgrimage and all of Islam’s symbols, Muslims have been commanded to respect the lives and properties of other people in the same way. The Prophet even warned us that reverting to the violent tribalism of pre-Islamic ignorance (<em>al-jahiliya<\/em>) was tantamount to disbelief in Allah and His Messenger.<\/p>\n<p>In fact, respect for the sacred inviolability of humankind is part of the very definition of being a Muslim, meaning “the one from whom people are safe.”<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمُ مَنْ سَلِمَ النَّاسُ مِنْ لِسَانِهِ وَيَدِهِ وَالْمُؤْمِنُ مَنْ أَمِنَهُ النَّاسُ عَلَى دِمَائِهِمْ وَأَمْوَالِهِمْ<\/p>\n<p><strong>The Muslim is the one from whose tongue and hand the people are safe, and the believer is the one people trust with their lives and wealth.<\/strong><\/p>\n<p>Source: Sunan An-Nasa’i 4998, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/10\/30\/the-true-believer-is-peaceful-and-trustworthy\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Muslim jurists from the time of Abu Hanifa and beyond recognized that human beings are granted universal rights by default, simply by virtue of being a human being, the most important of which is the right to life.<\/p>\n<p>As-Sarakhsi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِأَن الله تَعَالَى لما خلق الْإِنْسَان لحمل أَمَانَته أكْرمه بِالْعقلِ والذمة ليَكُون بهَا أَهلا لوُجُوب حُقُوق الله تَعَالَى عَلَيْهِ ثمَّ أثبت لَهُ الْعِصْمَة وَالْحريَّة والمالكية ليبقى فيتمكن من أَدَاء مَا حمل من الْأَمَانَة ثمَّ هَذِه الْحُرِّيَّة والعصمة والمالكية ثَابِتَة للمرء من حِين يُولد الْمُمَيز وَغير الْمُمَيز فِيهِ سَوَاء فَكَذَلِك الذِّمَّة الصَّالِحَة لوُجُوب الْحُقُوق فِيهَا ثَابتا لَهُ من حِين يُولد يَسْتَوِي فِيهِ الْمُمَيز وَغير الْمُمَيز<\/p>\n<p>As Allah the Exalted created humanity to carry His trusts, He dignified them with reason and sacred inviolability in order to be responsible for the duties and rights of Allah placed over them. Then He granted them sanctity, freedom, and property rights for them to continue carrying out their trusts. Hence, this freedom, sanctity, and right of property are granted to a person at the time they are born. Those capable of discernment and those who are not are equal in this regard, so likewise sacred inviolability is established at birth whether they are of sound mind or not.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/09\/29\/as-sarakhsi-on-rights-allah-humans-have-sanctity-freedom-and-property-rights-at-birth\/\">Usul As-Sarakhsi 2\/334<\/a><\/p><\/blockquote>\n<p>In this respect, there is no difference between the life of a Muslim and a non-Muslim since the lives of both are to be protected as a sacred trust. Someone who kills another person is guilty of killing all of humanity whether the victim is a Muslim or not.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنْ أَجْلِ ذَٰلِكَ كَتَبْنَا عَلَىٰ بَنِي إِسْرَائِيلَ أَنَّهُ مَن قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ أَوْ فَسَادٍ فِي الْأَرْضِ فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا وَمَنْ أَحْيَاهَا فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا ۚ<\/p>\n<p><strong>Thus, We decreed upon the children of Israel that whoever kills a soul unless as legal punishment for murder or for corruption in the land, it is as if he had slain mankind entirely. And whoever saves one soul, it is as if he had saved mankind entirely.<\/strong><\/p>\n<p>Surat Al-Ma’idah 5:32<\/p><\/blockquote>\n<p>Ibn Kathir comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ مَنْ قَتَلَ نَفْسًا بِغَيْرِ سَبَب مِنْ قِصَاص أَوْ فَسَاد فِي الْأَرْض وَاسْتَحَلَّ قَتْلَهَا بِلَا سَبَب وَلَا جِنَايَة فَكَأَنَّمَا قَتَلَ النَّاس جَمِيعًا لِأَنَّهُ لَا فَرْق عِنْده بَيْن نَفْس وَنَفْس<\/p>\n<p>The verse means that whoever kills a soul without a just cause such as legal punishment for murder or for causing corruption on earth, then it will be as if he has killed all people because there is no difference between one life and another.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/ibn-kathir-whoever-kills-a-life-unjustly-is-as-if-he-has-killed-all-mankind\/\">Tafseer Ibn Kathir 5:32<\/a><\/p><\/blockquote>\n<p>In this verse, Allah made no distinction between the life of a Muslim and a non-Muslim, a believer or an unbeliever. Life may only be taken as a means of self-defense in a just war, as legal punishment to deter the most dangerous criminals, or to prevent corruption (<em>fasad<\/em>) which, in the Islamic context, is not merely ordinary sin but rather the corruption of tyrants like Pharaoh who committed mass murder and enslavement of entire peoples (28:4).<\/p>\n<p>Even when legal retaliation against criminal activity is justified, Islam encourages us to be merciful and forgiving as long as society is protected from future crimes. The family of the murder victim has the right to request full capital punishment on the perpetrator, or to offer a pardon in the form of a reduced sentence such monetary compensation. Further retaliation beyond what is legally justified is considered sinful transgression, hence, excessive or collective punishment by association is strictly forbidden.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ۗ ذَٰلِكَ تَخْفِيفٌ مِّن رَّبِّكُمْ وَرَحْمَةٌ ۗ فَمَنِ اعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُ عَذَابٌ أَلِيمٌ<\/p>\n<p><strong>Whoever pardons a capital crime from his brother, then it should be followed by good conduct and payment to him in the best manner. This is an alleviation from your Lord and a mercy, but whoever transgresses after that will have a painful punishment.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:178<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۗ وَمَن قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِ سُلْطَانًا فَلَا يُسْرِف فِّي الْقَتْلِ<\/p>\n<p><strong>Do not kill the soul which Allah has made sacred except by right of justice. Whoever is killed unjustly, We have given his heir authority, but let him not exceed the limits in taking life.<\/strong><\/p>\n<p>Surat Al-Isra 17:33<\/p><\/blockquote>\n<p>Islam has great placed emphasis on the value of all life and has issued clear warnings against unjustified violence. For this reason, the true believers are the most reluctant to take life in any situation, doing so only when it is absolutely necessary for the safety of others.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ<\/p>\n<p><strong>The most restrained of the people in killing are the people of faith.<\/strong><\/p>\n<p>Source: Musnad Ahmad 3720, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/27\/hadith-on-mercy-the-most-pardoning-of-people-regarding-killing-are-the-people-of-faith\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Nevertheless, some classical Muslim jurists failed to recognize the universal sanctity of human life. They postulated, incorrectly, that the life of a non-Muslim was not sacred by default and was only made sacred due to a peace treaty with the Muslims. They formulated this legal principle within the rough environment of the ancient world in which the only choice nations had was to conquer others or be conquered themselves. There was little precedent for peaceful coexistence at the time, as these jurists correctly assumed that most neighboring empires harbored hostile intentions, so they developed their law schools within the <em>de facto<\/em> reality of their era. It would have been very difficult for them to imagine the world otherwise and pointless to develop a legal framework for an ideal situation that did not exist. This is not to say that they viewed long-term peaceful relations as undesirable, but rather they viewed it as unrealistic.<\/p>\n<p>Today, some Muslim terrorist groups cite this obsolete legal principle in their propaganda, quoting the writings of classical jurists without any historical or anthropological context, to justify attacks on civilians, women, and children. They argue that non-Muslim life is not sacred in principle and that they have no obligation to recognize the interconnected web of peace treaties and international agreements put forth by so-called “infidel” Muslim rulers.<\/p>\n<p>Such erroneous thinking betrays the farewell address of the Prophet in which he admonished all Muslims in every place, and in forceful terms, that life is sacred and unjust violence is itself infidelity. Moreover, a specific incident occurred in the life of the Prophet which explicitly proves that he considered all life sacred by default.<\/p>\n<p>Al-Miswar ibn Makhramah reported: During the period of ignorance, Al-Mughirah accompanied some people, killed them, and took their wealth and then he later embraced Islam. The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَّا الْإِسْلَامُ فَقَدْ قَبِلْنَا وَأَمَّا الْمَالُ فَإِنَّهُ مَالُ غَدْرٍ لَا حَاجَةَ لَنَا فِيهِ<\/p>\n<p><strong>As for your Islam, we have accepted it. As for the property, it is the wealth of treachery and we have no need for it.<\/strong><\/p>\n<p>Source: Sunan Abu Dawud 2765, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/22\/it-is-forbidden-to-be-treacherous-steal-from-and-murder-a-disbeliever\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Mughirah attacked, robbed, and killed some people in the time of pre-Islamic ignorance, as was not uncommon in the Bedouin culture at the time, and he later converted to Islam. Al-Mughirah was pardoned for his crime only because converting to Islam expiates previous sins; he was given another chance in Islam to redeem himself. The wealth, on the other hand, was rejected by the Prophet due to the lawless method by which it was acquired, demonstrating that the life and property of the unnamed victim, who was most likely an idolater, was sacred and inviolable regardless of their religion.<\/p>\n<p>The truth is that relaxing what should be the cautiously restrained nature of the believer regarding killing, even when apparently justified by precedents in the Islamic law tradition, causes immense danger to the integrity of our religious standing.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَنْ يَزَالَ الْمُؤْمِنُ فِي فُسْحَةٍ مِنْ دِينِهِ مَا لَمْ يُصِبْ دَمًا حَرَامًا<\/p>\n<p><strong>The believer continues to be safe in his religion as long as he does not unlawfully spill blood.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6469, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/12\/12\/the-sanctity-of-life-and-the-evil-of-murder\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Muslim is largely protected from severe punishment in the Hellfire if he or she avoids the major sins, but the sin of murder is so incredibly heinous that it can nearly expel someone from the religion altogether. If we fear Allah with the reverence due to Him, these admonitions should be more than enough to make us doubt the piety of those who kill people in the name of Islam simply because they belong to another religion or nation.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not kill the soul which Allah has made sacred&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[282,133,20,26,132,27,88,135,32,34,37,38,48,120,100,207,54,56,59,291,107,45,148,296,121,72,98,128],"class_list":["post-17033","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-children","tag-covenants","tag-creation-al-khalq","tag-forgiveness-al-maghfirah","tag-freedom-al-huriyyah","tag-god-fearing-taqwa","tag-pilgrimage-hajj","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-justice-adl","tag-rebels-khawarij","tag-manners-al-adab","tag-mecca-makkah","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-peace","tag-pharaoh-firawn","tag-public-trust-al-amanah","tag-quran-exegesis-tafsir","tag-reason-al-aql","tag-sharia","tag-terrorism-al-irhab","tag-truthfulness-al-sidq","tag-unbelief-al-kufr","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4qJ","jetpack-related-posts":[{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":17033,"position":0},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14540,"url":"https:\/\/www.abuaminaelias.com\/verse-of-the-sword-slay-unbelievers\/","url_meta":{"origin":17033,"position":1},"title":"Slay them wherever you find them?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Prophet never forced the religion upon anyone,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17195,"url":"https:\/\/www.abuaminaelias.com\/protection-of-non-muslim-houses-of-worship-in-islam\/","url_meta":{"origin":17033,"position":2},"title":"Protection of non-Muslim houses of worship in Islam","author":"Abu Amina Elias","date":"October 18, 2015","format":false,"excerpt":"\"The houses of worship for non-Muslim citizens should be defended by the believers.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13131,"url":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-a-terrorist\/","url_meta":{"origin":17033,"position":3},"title":"Was Prophet Muhammad a terrorist?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Fight in the way of Allah those who fight you, but do not transgress.\" (2:190)","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":17033,"position":4},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15463,"url":"https:\/\/www.abuaminaelias.com\/methods-islamophobic-propaganda\/","url_meta":{"origin":17033,"position":5},"title":"Methods of anti-Islam propaganda","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"They are those who prefer the worldly life over the Hereafter...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17033","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17033"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17033\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17033"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17033"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17033"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}