{"id":17195,"date":"2015-10-18T15:29:33","date_gmt":"2015-10-18T11:29:33","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17195"},"modified":"2018-03-25T16:06:13","modified_gmt":"2018-03-25T12:06:13","slug":"protection-of-non-muslim-houses-of-worship-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/protection-of-non-muslim-houses-of-worship-in-islam\/","title":{"rendered":"Protection of non-Muslim houses of worship in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam guarantees the protection of Jews, Christians, and other non-Muslims who reside in Muslim lands. Their houses of worship should be defended from attack and their right to worship according to their choice respected. The right to self-defense was granted in Islam in order to protect freedom of religion.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُم بِبَعْضٍ لَّهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا<\/p>\n<p><strong>Were Allah not to check people by means of others, there would have been demolished the monasteries, churches, synagogues, and mosques in which the name of Allah is often mentioned. <\/strong><\/p>\n<p>Surat Al-Hajj 22:40<\/p><\/blockquote>\n<p>Hasan Al-Basri comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُدْفَعُ عَنْ هَدْمِ مُصَلَّيَاتِ أَهْلِ الذِّمَّةِ بِالْمُؤْمِنِينَ<\/p>\n<p>The houses of worship for non-Muslim citizens are defended by the believers.<\/p>\n<p>Source: Ahkam Al-Quran Al-Jassas 5\/83<\/p><\/blockquote>\n<p>Al-Qurtubi comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ ابْنُ خُوَيْزِ مَنْدَادَ تَضَمَّنَتْ هَذِهِ الْآيَةُ الْمَنْعَ مِنْ هَدْمِ كَنَائِسِ أَهْلِ الذِّمَّةِ وَبِيَعِهِمْ وَبُيُوتِ نِيرَانِهِمْ<\/p>\n<p>Ibn Khuwaiz said: Included in this verse is the prohibition of demolishing the churches of non-Muslim citizens, their temples, and their houses of worship.<\/p>\n<p>Source: Tafseer Al-Qurtubi 22:40<\/p><\/blockquote>\n<p>This legal requirement is part of the tolerance, compassion, and good will that Islam teaches concerning other religious groups. The Prophet defined Islam as safety and security for people in general.<\/p>\n<p>Abdullah ibn Amr reported: A man asked, “O Messenger of Allah, whose Islam is best?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَلِمَ النَّاسُ مِنْ لِسَانِهِ وَيَدِهِ<\/p>\n<p><strong>Those from whose tongue and hand people are safe<\/strong>.<\/p>\n<p>Source: Musnad Ahmad 6714, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/10\/19\/hadith-on-islam-the-best-islam-is-to-keep-people-safe-from-bad-words-and-deeds\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Some interpreters have tried to limit the implications of the relevant verse by saying the phrase “in which the name of Allah is often mentioned” refers only to the mosques. However, this would make the grammar of the verse more awkward than it would normally be understood. Many of the foremost commentators conclude that the name of Allah is often mentioned in the synagogues, churches, and mosques.<\/p>\n<p>Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ الضَّحَّاكُ الْجَمِيعُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا<\/p>\n<p>Ad-Dahhak said: In all of them the name of Allah is often mentioned.<\/p>\n<p>Source: Tafseer Ibn Kathir 22:40<\/p><\/blockquote>\n<p>At-Tabari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّوَابُ لَهُدِّمَتْ صَوَامِعُ الرُّهْبَانِ وَبِيَعُ النَّصَارَى وَصَلَوَاتُ الْيَهُودِ وَهِيَ كَنَائِسُهُمْ وَمَسَاجِدُ الْمُسْلِمِينَ الَّتِي يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا لِأَنَّ هَذَا هُوَ الْمُسْتَعْمَلُ الْمَعْرُوفُ فِي كَلَامِ الْعَرَبِ<\/p>\n<p>The correct interpretation is that the monasteries of the monks, the churches of the Christians, the synagogues of the Jews, and the mosques of the Muslims, in which the name of Allah is often mentioned, would have been demolished. This is according to the well-known usage in the Arabic language.<\/p>\n<p>Source: Tafseer At-Tabari 22:40<\/p><\/blockquote>\n<p>In fact, the name “Allah” has been used for God by Arabic-speaking Jews and Christians since the beginning of Islam until today. The recognition that Jews and Christians worship the same God, however flawed their understanding may or may not be, is very significant and thus their worship deserves the protection of law.<\/p>\n<p>Even if we assume that the name of Allah is not invoked in non-Muslim houses of worship, they would still be entitled to the protection granted to them by Islam.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهُوَ سُبْحَانُهُ يَدْفَعُ عَنْ مُتَعَبَّدَاتِهِمُ الَّتِي أُقِرُّوا عَلَيْهَا شَرْعًا وَقَدَرًا فَهُوَ يُحِبُّ الدَّفْعَ عَنْهَا وَإِنْ كَانَ يُبْغِضُهَا كَمَا يُحِبُّ الدَّفْعَ عَنْ أَرْبَابِهَا وَإِنْ كَانَ يُبْغِضُهُمْ وَهَذَا الْقَوْلُ هُوَ الرَّاجِحُ إِنْ شَاءَ اللَّهُ تَعَالَى وَهُوَ مَذْهَبُ ابْنِ عَبَّاسٍ فِي الْآيَةِ<\/p>\n<p>Allah the Exalted defends their houses of worship that have been sanctioned by law and decree. Thus, He loves to defend them even if He might detest something therein, just as He loves to defend their owners even if He might detest something about them. This is the preferred view, if Allah wills, and it is the way of Ibn Abbas regarding the verse.<\/p>\n<p>Source: Ahkam Ahlu Dhimmah 3\/1169<\/p><\/blockquote>\n<p>Hence, the truth or falsehood of the worship performed therein is irrelevant. Allah loves for their worship to be protected in any case.<\/p>\n<p>The general rule in Islam is that any peaceful and law-abiding non-Muslim enjoys the same basic human rights as Muslims. In fact, if any non-Muslim is oppressed by a Muslim, the Prophet will plead on behalf of the non-Muslim against the unjust Muslim on the Day of Judgment.<\/p>\n<p>Sufwan ibn Saleem reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا مَنْ ظَلَمَ مُعَاهِدًا أَوْ انْتَقَصَهُ أَوْ كَلَّفَهُ فَوْقَ طَاقَتِهِ أَوْ أَخَذَ مِنْهُ شَيْئًا بِغَيْرِ طِيبِ نَفْسٍ فَأَنَا حَجِيجُهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>If anyone wrongs a person protected by a covenant, violates his rights, burdens him with more work than he is able to do, or takes something from him without his consent, then I will be his advocate on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan Abu Dawud 3052, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/16\/hadith-on-oppression-the-prophet-will-support-the-oppressed-non-muslims-on-the-day-of-judgment\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Perhaps the best example of strictly safeguarding the rights of non-Muslims in early Islamic history was the practice of Umar Ibn Al-Khattab, the second Caliph of Islam. After defeating the Romans and neutralizing the threat they posed to the Muslim community, Umar promised the Christians in Jerusalem that their lives, their property, their houses of worship, their religious icons, and their entire communities would be protected by the Muslims.<\/p>\n<p>At-Tabari records Umar’s covenant as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بسم اللَّه الرحمن الرحيم هذا ما أعطى عبد اللَّه عمر أمير المؤمنين أهل إيلياء من الأمان أعطاهم أمانا لأنفسهم وأموالهم ولكنائسهم وصلبانهم وسقيمها وبريئها وسائر ملتها أنه لا تسكن كنائسهم ولا تهدم ولا ينتقص منها ولا من حيزها ولا من صليبهم ولا من شيء من أموالهم ولا يكرهون على دينهم ولا يضار أحد منهم<\/p>\n<p>In the name of Allah, the Gracious, the Merciful. This is what is granted of security by the servant of Allah, Umar, the commander of the faithful, to the people of Jerusalem. He grants them safety for their lives, their property, their churches, and their crucifixes, for their ill, their healthy, and their entire community. Their churches will not be occupied, demolished, or reduced in number. Their churches and crucifixes will not be desecrated and neither anything else of their property. They will not be coerced to abandon their religion and none of them will be harmed.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/10\/17\/umar-at-jerusalem-the-covenant-of-protection-between-umar-and-the-christians\/\">Tareekh At-Tabari 2\/449<\/a><\/p><\/blockquote>\n<p>Umar was particularly sensitive to the demands of justice concerning non-Muslims living under his authority. In a famous story, Umar was invited by the patriarch of the Church of the Holy Sepulcher to pray inside the church. Umar refused, however, not out of reluctance to pray inside a church, but rather because he feared some ignorant Muslims might seize the church after him and turn it into a sort of shrine.<\/p>\n<p>Ibn Khaldun reported: Umar ibn Al-Khattab entered the sacred house and came to the Church of the Holy Sepulcher. He sat inside among its companions until the time of prayer arrived. Umar said to patriarch, “I want to pray.” The patriarch said, “Here is your place of prayer,” but Umar refrained from doing so and instead he prayed upon the staircase near a door apart from the church. When Umar finished his prayer, he said to patriarch:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لو صليت داخل الكنيسة أخذها المسلمون بعدي وقالوا هنا صلى عمر<\/p>\n<p>If I prayed inside the church, the Muslims after me would take it and they would say: Umar prayed here.<\/p>\n<p>Source: Ta’reekh Ibn Khaldun 2\/225<\/p><\/blockquote>\n<p>This church still exists today in Jerusalem as the headquarters of the Eastern Orthodox Patriarch of Jerusalem, even though it was under the authority of Muslims for centuries.<\/p>\n<p>To conclude, non-Muslims citizens of Muslim countries should enjoy freedom of religion and worship within the boundaries of civil law. Their houses of worship should be protected and defended from anyone who might want to harm them.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The houses of worship for non-Muslim citizens should be defended by the believers.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[18,132,37,100,54,115,45,91,73,98],"class_list":["post-17195","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-community-jamaah","tag-freedom-al-huriyyah","tag-idolatry-shirk","tag-manners-al-adab","tag-mercy-al-rahmah","tag-people-of-the-book","tag-quran-exegesis-tafsir","tag-righteous-predecessors-al-salaf-al-salih","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4tl","jetpack-related-posts":[{"id":15069,"url":"https:\/\/www.abuaminaelias.com\/customs-and-acts-of-worship-in-islamic-law\/","url_meta":{"origin":17195,"position":0},"title":"Customs and acts of worship in Islamic Law","author":"Abu Amina Elias","date":"December 16, 2013","format":false,"excerpt":"\"With regard to customs, if there is no text to prove that a custom is forbidden, how can it be deemed to be forbidden?\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16920,"url":"https:\/\/www.abuaminaelias.com\/the-meaning-of-spiritual-excellence-in-islam\/","url_meta":{"origin":17195,"position":1},"title":"Spiritual excellence in Islam","author":"Abu Amina Elias","date":"August 29, 2015","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him, for although you do not see Him yet He certainly sees you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":17195,"position":2},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15463,"url":"https:\/\/www.abuaminaelias.com\/methods-islamophobic-propaganda\/","url_meta":{"origin":17195,"position":3},"title":"Methods of anti-Islam propaganda","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"They are those who prefer the worldly life over the Hereafter...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13049,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-kill-apostates\/","url_meta":{"origin":17195,"position":4},"title":"Did the Prophet kill apostates who renounce Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is no compulsion in religion...\" (2:256)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":17195,"position":5},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17195","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17195"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17195\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}