{"id":17207,"date":"2015-10-20T15:48:33","date_gmt":"2015-10-20T11:48:33","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17207"},"modified":"2020-07-18T08:56:04","modified_gmt":"2020-07-18T04:56:04","slug":"equality-under-law-non-muslims","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/equality-under-law-non-muslims\/","title":{"rendered":"Equal protection of law for Muslims and non-Muslims"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam guarantees the protection of civil law for all citizens and visitors in a Muslim country, whether they are Muslims or not. Law protecting citizens from murder, theft, and other crime should apply equally to everyone residing in its jurisdiction.<\/p>\n<p>The mandate of equality can be seen in the strong value Islam places on all human life. The Quran makes no distinction between Muslims and non-Muslims when discussing the legal punishment for murder.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى ۖ الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالْأُنثَىٰ بِالْأُنثَىٰ ۚ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ۗ ذَٰلِكَ تَخْفِيفٌ مِّن رَّبِّكُمْ وَرَحْمَةٌ ۗ فَمَنِ اعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُ عَذَابٌ أَلِيمٌ<\/p>\n<p><strong>O you who believe, prescribed for you is legal retribution for those murdered &#8211; the free for the free, the slave for the slave, and the female for the female. Whoever forgives anything from his brother, then there should be a suitable follow-up and payment to him with good conduct. This is an alleviation from your Lord and a mercy, but whoever transgresses after that will have a painful punishment.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:178<\/p><\/blockquote>\n<p>Based upon the generality of the verse, many of the earliest Muslim authorities granted equal legal protection to Muslims and non-Muslim citizens. Cases of murder were prosecuted in the same way; the victim’s family may request for the perpetrator to be executed, to pay compensation, or to be pardoned for his crime.<\/p>\n<p>Amr ibn Maymun reported: Umar ibn Abdul Aziz was asked about the case of a Muslim man killing a man among the non-Muslim citizens, and Umar replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنِ ادْفَعْهُ إِلَى وَلِيِّهِ فَإِنْ شَاءَ قَتَلَهُ وَإِنْ شَاءَ عَفَا عَنْهُ<\/p>\n<p>He must pay compensation to his guardian. If he wishes, he may request execution in retaliation. And if he wishes, he may pardon him.<\/p>\n<p>Source: Musannaf Abdur Razzaq 17904<\/p><\/blockquote>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إذَا قَتَلَ الْمُسْلِمُ النَّصْرَانِيَّ قُتِلَ بِهِ<\/p>\n<p>If a Muslim kills a Christian, he will be executed in retaliation.<\/p>\n<p>Source: Al-Umm 7\/339<\/p><\/blockquote>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ أَبُو حَنِيفَةَ وَجَمَاعَةٌ مِنْ فُقَهَاءِ الْكُوفِيِّينَ يُقْتَلُ بِهِ<\/p>\n<p>Abu Hanifa and the group of jurists in Kufa said that the Muslim should be executed for killing an unbeliever.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 14<\/p><\/blockquote>\n<p>Regardless of the worldly punishment, the penalty in the Hereafter for murdering a peaceful citizen is the same. The Prophet informed us that whoever kills a citizen will never enter Paradise.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ نَفْسًا مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا يُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا<\/p>\n<p><strong>Whoever kills a person protected by a treaty will never smell the fragrance of Paradise. Verily, its fragrance can be found a distance of forty years of travel.<\/strong><\/p>\n<p>Source: Sahih Bukhari 6516, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/11\/whoever-breaks-a-peace-treaty-will-not-even-smell-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Likewise, many of the early authorities, including the righteous Caliphs, prescribed the same monetary compensation for Muslim and non-Muslim victims.<\/p>\n<p>Az-Zuhri said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ دِيَةَ الْمُعَاهِدِ فِي عَهْدِ أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمْ مِثْلُ دِيَةِ الْحُرِّ الْمُسْلِمِ<\/p>\n<p>The blood money for a non-Muslim citizen during the time of Abu Bakr, Umar, and Uthman was the same as a free Muslim.<\/p>\n<p>Source: Al-Umm 7\/339<\/p><\/blockquote>\n<p>Imam Abu Hanifa said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَدِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ وَالْمَجُوسِيِّ مِثْلُ دِيَةِ الْحُرِّ الْمُسْلِمِ وَعَلَى مَنْ قَتَلَهُ مِنْ الْمُسْلِمِينَ الْقَوَدُ<\/p>\n<p>The blood money of a Jew, a Christian, or a Magian is the same as a free Muslim. Whoever among the Muslims killed him must pay it.<\/p>\n<p>Source: Al-Umm 7\/338<\/p><\/blockquote>\n<p>Ibn Hazm mentions in Al-Muhalla 10\/221 that this was also the opinion of Ibrahim An-Nakhi’i.<\/p>\n<p>The principle of equality of legal protection among all citizens extends to all other crimes, as each human being and citizen has the inherent right to life, property, religion, honor, and dignity. It is unlawful to harm a non-Muslim citizen in any way with deeds or words, as they are to be considered neighbors. The property rights of non-Muslims are protected even for items that are unlawful in Islam but might be permissible in their religion.<\/p>\n<p>Al-Haskafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَضْمَنُ الْمُسْلِمُ قِيمَةَ خَمْرِهِ وَخِنْزِيرِهِ إذَا أَتْلَفَهُ وَتَجِبُ الدِّيَةُ عَلَيْهِ إذَا قَتَلَهُ خَطَأً وَيَجِبُ كَفِّ الْأَذَى عَنْهُ وَتَحْرُمُ غِيبَتُهُ كَالْمُسْلِمِ<\/p>\n<p>A Muslim is liable to pay a non-Muslim for the price of any wine or pork he damages, and he must pay compensation if he kills him in an accident. He must refrain from harming him and dishonoring him in the same way as if he were a Muslim.<\/p>\n<p>Source: Al-Durr Al-Mukhtar 2\/223<\/p><\/blockquote>\n<p>And Ibn &#8216;Abideen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِأَنَّهُ بِعَقْدِ الذِّمَّةِ وَجَبَ لَهُ مَالَنَا فَإِذَا حَرُمَتْ غِيبَةُ الْمُسْلِمِ حَرُمَتْ غِيبَتُهُ بَلْ قَالُوا إنَّ ظُلْمَ الذِّمِّيِّ أَشَدُّ<\/p>\n<p>Due to the covenant of protection, a non-Muslim deserves the same treatment as we do. Thus, since it is forbidden to backbite a Muslim, it is forbidden to backbite him. Rather, some scholars said the oppression of a non-Muslim citizen could be even more sinful.<\/p>\n<p><span style=\"line-height: 1.5;\">Source: Radd Al-Muhtar &#8216;ala Al-Durr Al-Mukhtar 4\/171<\/span><\/p><\/blockquote>\n<p>And Al-Kasani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْهَا عِصْمَةُ الْمَالِ أَنَّهَا تَابِعَةٌ لِعِصْمَةِ النَّفْسِ وَعَنْ سَيِّدِنَا عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ إنَّمَا قَبِلُوا عَقْدَ الذِّمَّةِ لِتَكُونَ أَمْوَالُهُمْ كَأَمْوَالِنَا وَدِمَاؤُهُمْ كَدِمَائِنَا<\/p>\n<p>Among there rights are the inviolability of their wealth, as this follows naturally from the inviolability of their lives. Ali ibn Abi Talib, may Allah be pleased with him, said: Verily, whoever accepts our covenant of protection, then their property is like our property and their lives are like our lives.<\/p>\n<p>Source: Bada&#8217;i As-Sana&#8217;i 7\/111<\/p><\/blockquote>\n<p>And Al-Qarafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَقْدَ الذِّمَّةِ يُوجِبُ حُقُوقًا عَلَيْنَا لَهُمْ لِأَنَّهُمْ فِي جِوَارِنَا وَفِي خَفَارَتِنَا وَذِمَّةِ اللَّهِ تَعَالَى وَذِمَّةِ رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِينِ الْإِسْلَامِ فَمِنْ اعْتَدَى عَلَيْهِمْ وَلَوْ بِكَلِمَةِ سُوءٍ أَوْ غِيبَةٍ فِي عِرْضِ أَحَدِهِمْ أَوْ نَوْعٍ مِنْ أَنْوَاعِ الْأَذِيَّةِ أَوْ أَعَانَ عَلَى ذَلِكَ فَقَدْ ضَيَّعَ ذِمَّةَ اللَّهِ تَعَالَى وَذِمَّةَ رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذِمَّةَ دِينِ الْإِسْلَامِ<\/p>\n<p>The covenant of protection obligates us to grant them rights over us because they are our neighbors and under our care and the protection of Allah the Exalted, the protection of His Messenger, and the religion of Islam. Hence, whoever transgresses against them with even a bad word, or backbiting, or dishonoring one of them, or commits any type of harm against them or lends support for that, then he has violated the covenant of Allah, the covenant of His Messenger, and the religion of Islam.<\/p>\n<p>Source: Al-Furuq 3\/14<\/p><\/blockquote>\n<p>In fact, on the Day of Judgment, the Prophet will plead on behalf of non-Muslims who were oppressed in any way by Muslims.<\/p>\n<p>Sufwan ibn Saleem reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا مَنْ ظَلَمَ مُعَاهِدًا أَوْ انْتَقَصَهُ أَوْ كَلَّفَهُ فَوْقَ طَاقَتِهِ أَوْ أَخَذَ مِنْهُ شَيْئًا بِغَيْرِ طِيبِ نَفْسٍ فَأَنَا حَجِيجُهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>If anyone wrongs a person protected by a covenant, violates his rights, burdens him with more work than he is able to do, or takes something from him without his consent, then I will be his advocate on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan Abu Dawud 3052, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/16\/hadith-on-oppression-the-prophet-will-support-the-oppressed-non-muslims-on-the-day-of-judgment\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Nevertheless, some have argued that Islam has granted less than equal protection to non-Muslim citizens. They cite the following tradition out of context:<\/p>\n<p>Abu Juhaifa reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ<\/p>\n<p>The Prophet, peace and blessings be upon him, judged that a believer should not be killed for killing a disbeliever.<\/p>\n<p>Source: Sahih Bukhari 6517, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>As mentioned by numerous scholars, this tradition refers to an unbeliever who is an enemy combatant in a declared war against the Muslim community. The legal distinctions that some early jurists made between Muslims and non-Muslims in this regard was due to the climate of hostility some non-Muslim nations showed towards Muslims.<\/p>\n<p>Al-Mawsalai Al-Hanafi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُرَادُ بِقَوْلِهِ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ لَا يُقْتَلُ مُسْلِمٌ بِكَافِرٍ الْحَرْبِيُّ<\/p>\n<p>The meaning is of this tradition is that a Muslim is not executed in retaliation for killing a combatant in war.<\/p>\n<p>Source: Al-Ikhtiyar li Ta’leel 506<\/p><\/blockquote>\n<p>And Abu Bakr Al-Jassas comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ قَوْلُهُ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ بِمَنْزِلَةِ قَوْلِهِ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ حَرْبِيٍّ فَلَمْ يَثْبُتْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفْيُ قَتْلِ الْمُؤْمِنِ بِالذِّمِّيِّ<\/p>\n<p>The tradition means that a believer is not killed in retaliation for an unbelieving combatant, for it has not been established that the Prophet nullified the punishment of execution for a believer who kills a non-Muslim citizen.<\/p>\n<p>Source: Ahkam Al-Quran 1\/176<\/p><\/blockquote>\n<p>And Ibn Hajar comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَيْسَ لَهُ قَتْلُ كُلِّ كَافِرٍ بَلْ يَحْرُمُ عَلَيْهِ قَتْلُ الذِّمِّيِّ وَالْمُعَاهَدِ بِغَيْرِ اسْتِحْقَاقٍ<\/p>\n<p>It is not the right of a Muslim to kill every unbeliever. Rather, it is forbidden for him to kill a citizen or protected person without a just cause.<\/p>\n<p>Source: Fath ul-Bari 6517<\/p><\/blockquote>\n<p>Hence, the general rule in Islam is that Muslim and non-Muslim citizens are equally protected by law, since justice can only be justice when applied equally, and any distinction jurists made was from their own judgment of their particular historical circumstances. If applying their rulings literally in the modern context would lead to injustice, then they cannot be considered essential to Islam.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ بَيَّنَ سُبْحَانَهُ بِمَا شَرَعَهُ مِنْ الطُّرُقِ أَنَّ مَقْصُودَهُ إقَامَةُ الْعَدْلِ بَيْنَ عِبَادِهِ وَقِيَامُ النَّاسِ بِالْقِسْطِ فَأَيُّ طَرِيقٍ اُسْتُخْرِجَ بِهَا الْعَدْلُ وَالْقِسْطُ فَهِيَ مِنْ الدِّينِ وَلَيْسَتْ مُخَالِفَةً لَهُ<\/p>\n<p>Allah the Exalted has made clear in his law that the objective is the establishment of justice between his servants and fairness among the people, so whichever path leads to justice and fairness is part of the religion and can never oppose it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/06\/ibn-al-qayyim-on-sharia-justice-is-integral-to-the-religion-of-islam-and-can-never-oppose-it\/\">Turuq Al-Hukmiyyah 13<\/a><\/p><\/blockquote>\n<p>In modern times, Muslim countries have adopted the principle of equality in a broad, legal consensus. The member states of the Organization of Islamic Cooperation ratified a statement which stated this principle as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">البشر جميعاً أسرة واحدة جمعت بينهم العبودية لله والنبوة لآدم وجميع الناس متساوون في أصل الكرامة الإنسانية وفي أصل التكليف والمسؤولية دون تمييز بينهم بسبب العرق أو اللون أو اللغة أو الجنس أو المعتقد الديني أو الانتماء السياسي أو الوضع الاجتماعي أو غير ذلك من الاعتبارات. وأن العقيدة الصحيحة هي الضمان لنمو هذه الكرامة على طريق تكامل الإنسان<\/p>\n<p>All human beings form one family whose members are united by their subordination to Allah and descent from Adam. All people are equal in terms of basic human dignity and basic obligations and responsibilities, without any discrimination on the basis of race, color, language, belief, sex, religion, political affiliation, social status, or other considerations. The true religion is the guarantee for enhancing such dignity along the path to human integrity.<\/p>\n<p>Source: <a href=\"https:\/\/ar.wikipedia.org\/wiki\/%D8%A5%D8%B9%D9%84%D8%A7%D9%86_%D8%A7%D9%84%D9%82%D8%A7%D9%87%D8%B1%D8%A9_%D9%84%D8%AD%D9%82%D9%88%D9%82_%D8%A7%D9%84%D8%A5%D9%86%D8%B3%D8%A7%D9%86_%D9%81%D9%8A_%D8%A7%D9%84%D8%A5%D8%B3%D9%84%D8%A7%D9%85\">Cairo Declaration on Human Rights in Islam<\/a><\/p><\/blockquote>\n<p>Most of these countries also signed the U.N. Universal Declaration of Human Rights which contains similar language.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Islam guarantees the protection of civil law for all citizens and visitors,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[320,12,133,183,26,135,32,34,38,43,48,126,134,115,107,73,328],"class_list":["post-17207","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-abu-bakr","tag-ali-ibn-abi-talib","tag-covenants","tag-day-of-resurrection-yawm-al-qiyammah","tag-forgiveness-al-maghfirah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-imam-abu-hanifah","tag-imam-malik","tag-justice-adl","tag-neighbors","tag-paradise-jannah","tag-people-of-the-book","tag-public-trust-al-amanah","tag-umar-ibn-al-khattab","tag-uthman-ibn-affan"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4tx","jetpack-related-posts":[{"id":17681,"url":"https:\/\/www.abuaminaelias.com\/justice-for-all-humanity-hilf-al-fudul\/","url_meta":{"origin":17207,"position":0},"title":"Cooperation with all humanity for justice, Hilf al-Fudul","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah commands his faithful servants to cooperate in good deeds,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15738,"url":"https:\/\/www.abuaminaelias.com\/muslims-not-punished-for-killing-non-muslims\/","url_meta":{"origin":17207,"position":1},"title":"Muslims not punished for killing non-Muslims?","author":"Abu Amina Elias","date":"May 28, 2014","format":false,"excerpt":"\"The general rule is that all crimes should be prosecuted and punished equally,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":17207,"position":2},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17957,"url":"https:\/\/www.abuaminaelias.com\/protection-of-civilian-non-combatants-in-islam\/","url_meta":{"origin":17207,"position":3},"title":"Protection of civilian non-combatants in Islam","author":"Abu Amina Elias","date":"April 3, 2016","format":false,"excerpt":"\"People do not betray their covenants except that Allah will let their enemies overpower them.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":17207,"position":4},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":17207,"position":5},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17207","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17207"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17207\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17207"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17207"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17207"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}