{"id":17258,"date":"2015-10-29T15:10:25","date_gmt":"2015-10-29T11:10:25","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17258"},"modified":"2020-07-18T08:56:00","modified_gmt":"2020-07-18T04:56:00","slug":"marital-rape-domestic-violence","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/marital-rape-domestic-violence\/","title":{"rendered":"Marital rape and domestic violence in Islamic law"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The concept of rape in marriage is a new problem confronting Muslims in modern times. The term &#8220;rape&#8221; (<em>ightiṣāb<\/em>) in the classical legal literature was applied only to forced sexual relations outside of the marriage contract. Rape in this sense has always been unlawful and prosecuted in the legal category of adultery based upon the Prophet&#8217;s practice and a firm legal consensus.<\/p>\n<p>The original term <em>ightiṣāb <\/em>linguistically means to take something forcefully without having a right to it in the first place. Since a man has the right to have sexual relations with this wife as granted by the marriage contract, he is not taking something for which he inherently has no right. Consent was a moral requirement, but had no legal ramifications. Hence, the ruling of adultery does not apply to the husband in this case.<\/p>\n<p>However, the meaning of &#8220;rape&#8221; has changed with the times, as it now means any forced sexual intercourse even within marriage. The reason for this change is that Western legal traditions shifted the basis of lawful sexual relations from contract to consent. The marriage contract alone originally made sexual relations lawful, but now it is consent that legalizes sexual relations. This gave rise to the concept of marital rape and has influenced the legal discourse in Muslim countries.<\/p>\n<p>The concept of marital rape as a legal category did not appear in any law tradition until the year 1949, which makes it difficult to locate a precedent in pre-modern law. Islamic law developed through the practice of issuing a <em>fatwá<\/em> (legal judgment) as applied to a particular case. If such a case never arose, there would be no point in issuing a judgment about it. In this way, Islamic law was mostly a practical and not theoretical exercise. This means Muslim jurists have not discussed marital rape as such until the modern period.<\/p>\n<p>Nevertheless, forced sexual intercourse within marriage falls under another prohibited legal category in Islamic law: harming the wife. The classical scholars upheld the fundamental right of a wife to be free from harm. If a man forces his wife into sexual intercourse against her will, he can only do so by harming her and this makes his action unlawful. Marital rape, then, is more properly understood as an issue of domestic violence, an issue that was well-known to Muslim jurists since the time of the Prophet until today and for which we have ample precedent.<\/p>\n<p>The principle of removing harm is an essential legal axiom (<em>al-qawāʻid al-fiqhiyya<\/em>) in the orthodox schools of Islamic law, as it forms the basis and rationale of so many rules in Islam.<\/p>\n<p>Ubaida ibn As-Samit reported: The Messenger of Allah, peace and blessings be upon him, issued a decree:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ ضَرَرَ وَلاَ ضِرَارَ<\/p>\n<p><strong>Do not cause harm or return harm.<\/strong><\/p>\n<p>Source: Sunan ibn Majah 2340, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/03\/hadith-on-islamic-law-do-not-be-harmed-or-harm-others\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>And the juristic principle is stated as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الضَّرَر يُزَال<\/p>\n<p>Harm should be removed.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/12\/19\/as-suyuti-on-jurisprudence-the-five-principles-of-the-school-of-imam-ash-shafiee\/\">Al-ashbāh wa-al-naẓāʼir 7<\/a><\/p><\/blockquote>\n<p>The classical scholars often stated this as an explicit right of the wife when discussing the rights and duties of marriage in general.<\/p>\n<p>Al-Qurtubi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لَهُنَّ عَلَى أَزْوَاجِهِنَّ تَرْكُ مُضَارَّتِهِنَّ كَمَا كَانَ ذَلِكَ عَلَيْهِنَّ لِأَزْوَاجِهِنَّ<\/p>\n<p>Their husbands must not harm them, in the same way that they have rights over their wives.<\/p>\n<p>Source: Al-Jāmiʻ li-aḥkām al-Qurʼān 2:228<\/p><\/blockquote>\n<p>And Az-Zamakhshari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يُعَنِّفُ أَحَدُ الزَّوْجَيْنِ صَاحِبَهُ<\/p>\n<p>Neither spouse should be violent against his or her companion.<\/p>\n<p>Source: Al-Kashshāf ʻan ḥaqāʼiq 2:228<\/p><\/blockquote>\n<p>And Al-Baydawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَحُقُوقَهُنَّ الْمَهْرُ وَالْكَفَافُ وَتَرْكُ الضِّرَارِ وَنَحْوُهَا<\/p>\n<p>Among her rights is the dowry, to be free from harm, and so on.<\/p>\n<p>Source: Anwār al-tanzīl 2:228<\/p><\/blockquote>\n<p>And Ar-Razi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِيصَالَ الضَّرَرِ إِلَيْهَا بَيَّنَ أَنَّ لِكُلِّ وَاحِدٍ مِنَ الزَّوْجَيْنِ حَقًّا عَلَى الْآخَرِ<\/p>\n<p>No harm should come to her. It has been clarified that each one of the spouses has a right over the other.<\/p>\n<p>Source: Mafātīḥ al-ghayb 2:228<\/p><\/blockquote>\n<p>We can use such general principles in Islam to develop new rulings for new issues we encounter such as marital rape. This is the method by which Islamic law develops and adapts to local needs if no precedent can be found.<\/p>\n<p>Even so, we are not without specific guidance from the Prophet. In an authentic tradition, the Prophet discusses the case of a wife who refuses to have sexual relations with her husband and from which we can derive some insight:<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ<\/p>\n<p><strong>If a man calls his wife to bed and she refuses for no reason and he spends the night angry with her, then the angels will curse her until the morning.<\/strong><\/p>\n<p>Source: Sahih Bukhari 3065, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/10\/28\/hadith-on-marriage-a-man-has-a-right-to-enjoy-his-wife-but-he-may-not-harm-her\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Some people have cited this tradition in an attempt to prove that Islam condones marital rape, but careful consideration will demonstrate that it is actually a proof against marital rape.<\/p>\n<p>In this very specific situation, the wife refuses to answer her husband&#8217;s request to join him in bed. She does not have a valid excuse to refuse him such as being preoccupied or ill or tired. Rather, she refuses him out of a mean-spirited attitude only. This is a violation of the terms of the marriage contract and therefore a sin, and it might also tempt the husband to satisfy his natural impulse in an unlawful manner. If the husband spends the entire night in his house angry with her, it causes the angels to curse her until the morning.<\/p>\n<p>The Prophet warns such women of the negative moral consequences of this inexplicable behavior, but he gives no concession to the husband to take his right by force. If forced sexual compliance was an acceptable option, we could reasonably infer that the Prophet would have mentioned it here but he did not. Hence, the tradition is an implicit proof against marital rape and, by analogy, against the rape of concubines as well.<\/p>\n<p>The classical scholars determined that a man does not have the right to have sexual relations with his wife if he harms her, as this is a violation of her rights and the Islamic values of mercy and honorable behavior. If he does not fulfill her rights, then she does not need to fulfill his rights.<\/p>\n<p>Al-Bahuti writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِلزَّوْجِ الِاسْتِمْتَاعُ بِزَوْجَتِهِ كُلَّ وَقْتٍ عَلَى أَيِّ صِفَةٍ كَانَتْ … مَا لَمْ يُشْغِلْهَا عَنْ الْفَرَائِضِ أَوْ يَضُرُّهَا فَلَيْسَ لَهُ الِاسْتِمْتَاعُ بِهَا إذَنْ لِأَنَّ ذَلِكَ لَيْسَ مِنْ الْمُعَاشَرَةِ بِالْمَعْرُوفِ وَحَيْثُ لَمْ يَشْغَلْهَا عَنْ ذَلِكَ وَلَمْ يَضُرُّهَا فَلَهُ الِاسْتِمْتَاعُ<\/p>\n<p>It is the right of a husband to enjoy his wife at any time no matter her condition… as long as he does not distract her from her obligations or harm her. In that case, he may not enjoy her since that is not living with her honorably. If he does not distract her from those duties or harm her, then he may enjoy her.<\/p>\n<p>Source: Kashshāf al-qināʻ 5\/188<\/p><\/blockquote>\n<p>Moreover, the wife has the right to seek a divorce if the husband harms her in an intolerable manner. The Prophet once dissolved the marriage of a couple because the wife could no longer tolerate the husband&#8217;s abusive behavior.<\/p>\n<p>Yahya ibn Sa’eed reported: Habeeba bint Sahl was the wife of Thabit ibn Qais and it was mentioned to the Messenger of Allah, peace and blessings be upon him, that they were married and she was his neighbor. Thabit had struck her, so she appeared at the door of the Prophet and she said, “Thabit and I can no longer be married.” The Prophet said to Thabit:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُذْ مِنْهَا وَخَلِّ سَبِيلَهَا<\/p>\n<p><strong>Take what she owes to you and let her go her way.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 2200, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/17\/hadith-on-divorce-the-prophet-divorces-a-woman-from-the-husband-who-beat-her\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Based on such traditions, the scholars provided abused wives with legal protection and the right to seek a divorce in such cases.<\/p>\n<p>As-Sayyid Sabiq writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذهب الإمام مالك أن للزوجة أن تطلب من القاضي التفريق إذا ادعت إضرار الزوج بها إضرارا لا يستطاع معه دوام العشرة بين أمثالهما مثل ضربها أو سبها أو إيذائها بأي نوع من أنواع الايذاء الذي لا يطاق أو إكراهها على منكر من القول أو الفعل<\/p>\n<p>Imam Malik adhered to the opinion that the wife has a right to seek separation by decree of the judge if she claims that the husband has greatly harmed her such that it is not possible for them to continue in marital association. For example, he hits her, abuses her, or harms her in an intolerable way, or he forces her to commit evil in word or deed.<\/p>\n<p>Source: Fiqh al-Sunnah <span style=\"line-height: 1.5;\">2\/289<\/span><\/p><\/blockquote>\n<p>In modern times, these legal precedents have formed the foundation from which jurists in Muslim countries have sought to reform Islamic family law and to remove any loopholes through which men might justify violence against women. The Islamic Charter on Family, which has been endorsed by numerous Muslim authorities including the Grand Mufti of Egypt, states the following:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يجوز مهما بلغت درجة الخلاف بين الزوجين اللجوء إلى استعمال الضرب تجاوزًا للضوابط الشرعية المقررة ومن يخالف هذا المنع يكون مسئولاً مدنيًا وجنائيًا<\/p>\n<p>It is not permissible, no matter the degree of conflict between spouses, to resort to violence in transgression of the established regulations of the law. Whoever violates this prohibition will be held civilly and criminally responsible.<\/p>\n<p>Source: <a href=\"http:\/\/www.iicwc.org\/lagna_I0I\/iicwc\/iicwc.php?id=493\">Mīthāq al-usrah fī al-Islām 65.3<\/a><\/p><\/blockquote>\n<p>We should also not neglect the importance of values-based reasoning as it pertains to law and reform. The values and objective of Islamic law (<em>maqāṣid al-shari&#8217;ah<\/em>) precede the letter of the law and breathe life and purpose into it. In numerous verses and traditions, Islam teaches men to behave in the best manner towards women.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ<\/p>\n<p><strong>Live with women honorably.<\/strong><\/p>\n<p>Surat An-Nisa 4:19<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَخِيَارُكُمْ خِيَارُكُمْ لِنِسَائِهِمْ خُلُقًا<\/p>\n<p><strong>The most complete of the believers in faith are those with the best character, and the best of you are the best in behavior to their women.<\/strong><\/p>\n<p>Source: Sunan At-Tirmidhi 1162, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/10\/hadith-on-women-the-best-of-you-are-the-best-in-character-to-their-women\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَوْصُوا بِالنِّسَاءِ<\/p>\n<p><strong>I enjoin upon you good conduct toward women.<\/strong><\/p>\n<p>Source: Sahih Bukhari 3153, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/10\/allah-created-women-different-from-men-so-respect-these-differences-and-be-kind-to-them\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Expressing these values as the core of our way of life will resonate the strongest with Muslims and others. Common people untrained in Islamic law principles may not be able to articulate or understand a solid legal case against marital rape, but they instinctively know it is wrong because it is not merciful, gentle, kind, or fair. This line of thinking has a much greater potential to reach the masses than the detailed arguments of jurists and academics.<\/p>\n<p>To conclude, marital rape is a new issue that requires careful consideration by contemporary Muslim jurists. The principle of avoiding harm can serve as the basis for developing the law in such a way that vulnerable women will be protected from domestic abuse. We owe it to our sisters in Islam, and women in general, to close any loopholes in current legislation that might allow a husband to hurt his wife.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Live with women honorably.&#8221; (4:19)<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[16,18,437,49,34,153,43,48,100,53,54,55,103,45,440,64,296,179,128],"class_list":["post-17258","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-character-akhlaq","tag-community-jamaah","tag-concubines-al-surriyyah","tag-gentleness-al-rifq","tag-humanity-al-insaaniyyah","tag-al-ijtihad","tag-imam-malik","tag-justice-adl","tag-manners-al-adab","tag-marriage-al-nikah","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-public-welfare-al-maslaha","tag-quran-exegesis-tafsir","tag-rape","tag-reform-islah","tag-sharia","tag-virtue-al-fadilah","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4um","jetpack-related-posts":[{"id":16852,"url":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","url_meta":{"origin":17258,"position":0},"title":"No theology of rape in Islam","author":"Abu Amina Elias","date":"August 20, 2015","format":false,"excerpt":"\"Scholars agree that the rapist must be given legal punishment,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23736,"url":"https:\/\/www.abuaminaelias.com\/custodianship-of-the-right-hand\/","url_meta":{"origin":17258,"position":1},"title":"Custodianship of the Right Hand: Concubinage, Rape, and &#8216;Sexual Slavery&#8217; in Islam","author":"Abu Amina Elias","date":"December 9, 2021","format":false,"excerpt":"\"This paper addresses the allegations...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19511,"url":"https:\/\/www.abuaminaelias.com\/consent-marriage-concubines\/","url_meta":{"origin":17258,"position":2},"title":"Sexual Consent, Marriage, and Concubines in Islam","author":"Abu Amina Elias","date":"April 24, 2018","format":false,"excerpt":"\"...he may not touch her, lie with her, or have intercourse with her unless she consents.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12998,"url":"https:\/\/www.abuaminaelias.com\/islam-and-concubines\/","url_meta":{"origin":17258,"position":3},"title":"What does Islam teach about concubines?","author":"Abu Amina Elias","date":"March 27, 2013","format":false,"excerpt":"\"He may marry from your believing slave girls.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19476,"url":"https:\/\/www.abuaminaelias.com\/ali-ibn-abi-talib-rape-girl\/","url_meta":{"origin":17258,"position":4},"title":"Did &#8216;Ali ibn Abi Talib rape an underage girl?","author":"Abu Amina Elias","date":"April 16, 2018","format":false,"excerpt":"\"Do not cause harm or return harm.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21554,"url":"https:\/\/www.abuaminaelias.com\/nikah-al-misyar-travelers-marriage\/","url_meta":{"origin":17258,"position":5},"title":"Nikah al-Misyar: Is traveler’s marriage permissible?","author":"Abu Amina Elias","date":"January 5, 2020","format":false,"excerpt":"\"All of these categories are not permissible as they contradict the pure law.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17258","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17258"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17258\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17258"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17258"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17258"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}