{"id":17407,"date":"2015-12-08T14:36:36","date_gmt":"2015-12-08T10:36:36","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17407"},"modified":"2021-11-08T10:54:57","modified_gmt":"2021-11-08T06:54:57","slug":"reason-science-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/reason-science-islam\/","title":{"rendered":"Reason and science in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Reason (<em>al-&#8216;aql<\/em>), the God-given ability to acquire knowledge and recognize truth, has been assigned an exalted status in Islam. Rational thought and the resultant disciplines of logical thinking and scientific inquiry are essential for understanding the divine revelation and its relationship to the natural world. In contrast, indulgence in irrationality and unreasonable thinking is a means of disgrace, violence, and destruction.<\/p>\n<p>It is by reason that we may know with certainty that Allah created the world and has subjected its nature to universal laws.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ وَمَا أَنزَلَ اللَّهُ مِنَ السَّمَاءِ مِن مَّاءٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَابَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاءِ وَالْأَرْضِ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ<\/p>\n<p><strong>Verily, in the creation of the heavens and earth, and the alternation of the night and the day, and the ships which sail through the sea with benefits for people, and what Allah has sent down from the heavens of rain, giving life thereby to the earth after its lifelessness and dispersing therein every creature, and in His directing of the winds and the clouds controlled between the heaven and the earth are signs for a people who use reason.<\/strong><\/p>\n<p>Surat al-Baqarah 2:164<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ ۖ وَالنُّجُومُ مُسَخَّرَاتٌ بِأَمْرِهِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ<\/p>\n<p><strong>He has subjected for you the night and day and the sun and moon, and the stars are subjected by His command. Verily, in that are signs for people who reason.<\/strong><\/p>\n<p>Surat al-Nahl 16:12<\/p><\/blockquote>\n<p>It is by reason that we may know the truth of divine revelation and the teachings of all of the prophets.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ أَنزَلْنَا إِلَيْكُمْ كِتَابًا فِيهِ ذِكْرُكُمْ ۖ أَفَلَا تَعْقِلُونَ<\/p>\n<p><strong>We have certainly revealed to you a Book in which is your mention. Then will you not reason?<\/strong><\/p>\n<p>Surat al-Anbiya&#8217; 21:20<\/p><\/blockquote>\n<p>It is by reason that we may recognize right and wrong as it is presented in the scripture and as it is known to the innate instinct (<em>fitrah<\/em>) that Allah embedded within the human soul.<\/p>\n<p>Al-Nawwas ibn Sam’an reported: I asked the Messenger of Allah about righteousness and sin. The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ‏‏<\/p>\n<p><strong>Righteousness is good character and sin is what waivers in your heart and you hate for people to find out about it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2553, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/09\/14\/al-birr-al-husn-al-khuluq\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ<\/p>\n<p><strong>Consult your soul, consult your heart.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 2575, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/06\/25\/consult-conscience-fatwa\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Sufyan ibn ‘Uyaynah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْعَاقِلُ الَّذِي يَعْرِفُ الْخَيْرَ وَالشَّرَّ إِنَّمَا الْعَاقِلُ الَّذِي إِذَا رَأَى الْخَيْرَ اتَّبَعَهُ وَإِذَا رَأَى الشَّرَّ اجْتَنَبَهُ<\/p>\n<p>The reasonable person is not one who merely recognizes good and evil. Rather, the reasonable person is only one who follows good when he sees it and avoids evil when he sees it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/11\/18\/sufyan-aql-maruf-munkar\/\">Ḥilyat al-Awliyā’ 12893<\/a><\/p><\/blockquote>\n<p>Reason is, in fact, the foundation of a righteous Muslim’s character and the pillar upon which the soundness of his or her religion rests.<\/p>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَصْلُ الرَّجُلِ عَقْلُهُ وَحَسَبُهُ دِينُهُ وَمُرُوءَتُهُ خُلُقُهُ<\/p>\n<p>The foundation of a man is his intellect, his honor is in his religion, and his chivalry is in his character.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/06\/20\/umar-aql-deen-akhlaq\/\">Adab al-Dunyā wal-Dīn 1\/17<\/a><\/p><\/blockquote>\n<p>And Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والعقل منبع العلم ومطلعه وأساسه والعلم يجري منه مجرى الثمرة من الشجرة والنور من الشمس والرؤية من العين فكيف لا يشرف ما هو وسيلة السعادة في الدنيا والآخرة أو كيف يستراب فيه<\/p>\n<p>Reason is the source and fountainhead of knowledge, as well as its foundation. Knowledge sprouts from it as the fruit does from a tree, as light comes from the sun, and as vision comes from the eye. How then could that which is the means of happiness in this life and the Hereafter not be considered the most honored? Or how could it be doubted?<\/p>\n<p>Source: Iḥyāʼ Ulūm al-Dīn 1\/83<\/p><\/blockquote>\n<p>The use of reason extends beyond religion to the study of creation and its natural sciences. It was the Prophet Idrees who was the first human to write script and to study the movement of the stars, which led to the development of mathematics and astronomy. Muslims who study science today and intend to benefit humanity by them are actually following the footsteps of the prophets.<\/p>\n<p>Mua’wiya ibn al-Hakam reported: I said, “O Messenger of Allah, among us are men who write script.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ نَبِيٌّ مِنْ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ<\/p>\n<p><strong>There was a prophet among the prophets who wrote script, so whoever writes according to his way is right.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 537, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/12\/31\/natural-science-prophet-idrees\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Al-Qurtubi elaborates on the identity of this prophet, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِدْرِيسُ عَلَيْهِ السَّلَامُ أَوَّلُ مَنْ خَطَّ بِالْقَلَمِ وَأَوَّلُ مَنْ خَاطَ الثِّيَابَ وَلَبِسَ الْمَخِيطَ وَأَوَّلُ مَنْ نَظَرَ فِي عِلْمِ النُّجُومِ وَالْحِسَابِ وَسَيْرِهَا<\/p>\n<p>Idrees, upon him be peace, was the first to write with the pen, the first to sew and stitch his clothing, and the first to study knowledge of the stars, their calculations, and their movements.<\/p>\n<p>Source: al-Jāmiʻ li-Aḥkām al-Qurʼān 19:56<\/p><\/blockquote>\n<p>For this reason, many classical scholars accepted the validity of natural sciences and encouraged their study for the benefit of the community and humanity.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما الطبيعيات فهو بحث عن عالم السماوات وكواكبها وما تحتها من الأجسام المفردة كالماء والهواء والتراب والنار وعن الأجسام المركبة كالحيوان والنبات والمعادن وعن أسباب تغيرها واستحالتها وامتزاجها وذلك يضاهي بحث الطب  عن جسم الإنسان وأعضائه الرئيسة  والخادمة وأسباب استحالة مزاجه وكما ليس من شرط الدين إنكار علم الطب فليس من شرطه أيضاً إنكار ذلك العلم<\/p>\n<p>As for natural sciences, they consist of examining the world of the heavens and the stars and the distinct substances that lie beneath them such as water, air, dirt, and fire, and the contingent substances such as animals, vegetation, and minerals, and the causes that alter them, transform them, and blend them. That is like the doctor’s examination of the human body, its primary and secondary parts, and the causes of change in its disposition. Just as it is not a condition of faith to reject medicine, neither is it a condition of faith to reject this knowledge.<\/p>\n<p>Source: al-Munqidh min al-Dalāl 42<\/p><\/blockquote>\n<p>Muslim scholars throughout history have undertaken the challenge of reconciling reason (<em>aql<\/em>) and revelation (<em>naql<\/em>), the divine scripture with the findings of natural law and science. The health and well-being of Muslim societies depends upon the proper balance of religion and science such that these two great bodies of knowledge and truth perform their necessary social functions in harmony with each other.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْعَقْلُ شَرْطٌ فِي مَعْرِفَةِ الْعُلُومِ وَكَمَالِ وَصَلَاحِ الْأَعْمَالِ وَبِهِ يَكْمُلُ الْعِلْمُ وَالْعَمَلُ لَكِنَّهُ لَيْسَ مُسْتَقِلًّا بِذَلِكَ بَلْ هُوَ غَرِيزَةٌ فِي النَّفْسِ وَقُوَّةٌ فِيهَا بِمَنْزِلَةِ قُوَّةِ الْبَصَرِ الَّتِي فِي الْعَيْنِ فَإِنْ اتَّصَلَ بِهِ نُورُ الْإِيمَانِ وَالْقُرْآنِ كَانَ كَنُورِ الْعَيْنِ إذَا اتَّصَلَ بِهِ نُورُ الشَّمْسِ وَالنَّارِ وَإِنْ انْفَرَدَ بِنَفْسِهِ لَمْ يُبْصِرْ الْأُمُورَ الَّتِي يَعْجِزُ وَحْدَهُ عَنْ دَرْكِهَا … فَالْأَحْوَالُ الْحَاصِلَةُ مَعَ عَدَمِ الْعَقْلِ نَاقِصَةٌ وَالْأَقْوَالُ الْمُخَالِفَةُ لِلْعَقْلِ بَاطِلَةٌ<\/p>\n<p>Reason is a requirement for acquiring knowledge and performing righteous deeds, through which knowledge and deeds are perfected, but it is not enough on its own. Rather, it is a faculty of the soul and an ability like the ability within the eye to see. If it is connected with the light of faith and the Quran, then it is like the eye receiving the light of the sun and torch. If it is left to itself, it cannot gain insight into matters that it cannot know alone… Thus, the circumstances resulting from the denial of reason are defective, and ideas that contradict reason are false.<\/p>\n<p>Source: Majmūʻ al-Fatāwá 3\/338<\/p><\/blockquote>\n<p>And he also writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا جَاءَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّهُ حَقٌّ يُصَدِّقُ بَعْضُهُ بَعْضًا وَهُوَ مُوَافِقٌ لِفِطْرَةِ الْخَلَائِقِ وَمَا جُعِلَ فِيهِمْ مِنْ الْعُقُولِ الصَّرِيحَةِ والقصود الصَّحِيحَة لَا يُخَالِفُ الْعَقْلَ الصَّرِيحَ وَلَا الْقَصْدَ الصَّحِيحَ وَلَا الْفِطْرَةَ الْمُسْتَقِيمَةَ وَلَا النَّقْلَ الصَّحِيحَ الثَّابِتَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>Every reliable narration from the Prophet is the truth and confirms one another. It agrees with the natural instinct of creatures, sound reason that has been placed within them, and noble purposes. It cannot contradict sound reason, nor a noble purpose, nor an upright instinct, nor an authentic and established revelation from the Prophet.<\/p>\n<p>Source: Majmūʻ al-Fatāwá 6\/580<\/p><\/blockquote>\n<p>Indeed, one of the trustworthy methods by which a narration falsely or mistakenly ascribed to the Prophet can be recognized is whether or not it contradicts sound reason.<\/p>\n<p>Ibn al-Jawzi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا رَأَيْتَ الْحَدِيثَ يُبَايِنُ الْمَعْقُولَ أَوْ يُخَالِفُ الْمَنْقُولَ أَوْ يُنَاقِضُ الْأُصُولَ فَاعْلَمْ أَنَّهُ مَوْضُوعٌ<\/p>\n<p>If you find a prophetic narration disagreeing with sound reason, contradicting established revelation, or conflicting with the principles, then know that it is inauthentic.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/01\/19\/ibn-jawzi-weak-mawdu-hadith\/\">Tadrīb al-Rāwī 1\/327<\/a><\/p><\/blockquote>\n<p>Conversely, Allah has blamed those who forsake the use of their God-given reason. Irrationality is the characteristic of unbelief, idolatry, and hypocrisy, as the betrayal of reason hinders the ability of people to recognize the value of religion or causes them to cynically abuse religion for some worldly purpose.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا نَادَيْتُمْ إِلَى الصَّلَاةِ اتَّخَذُوهَا هُزُوًا وَلَعِبًا ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ<\/p>\n<p><strong>When you call to prayer, they take it in ridicule and amusement. That is because they are people who will not reason.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:58<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ الْكِتَابَ ۚ أَفَلَا تَعْقِلُونَ<\/p>\n<p><strong>Do you order righteousness of the people and forget yourselves while you recite the Scripture? Then will you not reason?<\/strong><\/p>\n<p>Surat al-Baqarah 2:44<\/p><\/blockquote>\n<p>The betrayal of reason opens the door to sin and leads people down the paths of destruction. The worst people are those who forgo logic and facts when the truth opposes their desires.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا كَانَ لِنَفْسٍ أَن تُؤْمِنَ إِلَّا بِإِذْنِ اللَّهِ ۚ وَيَجْعَلُ الرِّجْسَ عَلَى الَّذِينَ لَا يَعْقِلُونَ<\/p>\n<p><strong>It is not for a soul to believe except by permission of Allah, and He will disgrace those who will not reason.<\/strong><\/p>\n<p>Surat Yunus 10:100<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ شَرَّ الدَّوَابِّ عِندَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ<\/p>\n<p><strong>Verily, the worst of living creatures in the sight of Allah are the deaf and dumb who will not reason.<\/strong><\/p>\n<p>Surat al-Anfal 8:22<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ<\/p>\n<p><strong>They will say: If only we had been listening or reasoning, we would not be among the companions of the Blaze.<\/strong><\/p>\n<p>Surat al-Mulk 67:10<\/p><\/blockquote>\n<p>In its most evil manifestations, the betrayal of reason leads to violence, bloodshed, and crimes against humanity.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ۖ وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَعْقِلُونَ<\/p>\n<p><strong>Do not kill the soul which Allah has forbidden except by right of justice. This He has enjoined upon you that perhaps you will reason.<\/strong><\/p>\n<p>Surat al-An’am 6:151<\/p><\/blockquote>\n<p>The enemies of Islam in the time of the Prophet not only persecuted and killed practicing Muslims, but they also persecuted their own people. The cause of their oppression was their abandonment of reason.<\/p>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَأْسُهُم بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ<\/p>\n<p><strong>Their violence among themselves is severe. You imagine they are united, but their hearts are divided. That is because they are people who do not reason.<\/strong><\/p>\n<p>Surat al-Hashr 59:14<\/p><\/blockquote>\n<p>Hence, the Prophet warned us of a time that would come in which violence and bloodshed would be widespread because people would no longer apply their ability to reason.<\/p>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ بَيْنَ يَدَيْ السَّاعَةِ لَهَرْجًا<\/p>\n<p><strong>Verily, before the Hour will come an upheaval and killing.<\/strong><\/p><\/blockquote>\n<p>Some of the people said, “O Messenger of Allah, will we be reasonable on that day?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُنْزَعُ عُقُولُ أَكْثَرِ ذَلِكَ الزَّمَانِ وَيَخْلُفُ لَهُ هَبَاءٌ مِنْ النَّاسِ لَا عُقُولَ لَهُمْ<\/p>\n<p><strong>No, reason will be taken away from most people in that era, and insignificant people will remain who do not use their reason.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3959, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/25\/aql-harj-signs-of-the-hour\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Therefore, Muslims should never be blind followers of a nation, a movement, or a charismatic leader who invokes vulgar prejudice, bigotry, and demagoguery. We should always examine the good and evil of every situation in light of the guidance of scripture and our natural moral intuition.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِعَصَبَةٍ أَوْ يَدْعُو إِلَى عَصَبَةٍ أَوْ يَنْصُرُ عَصَبَةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ<\/p>\n<p><strong>Whoever fights under the banner of one who is blind, raging for the sake of tribalism, or calling to tribalism, or supporting tribalism, and is killed will have died upon ignorance.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1848, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/14\/prophet-disavows-tribalism-terrorism\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Hudhayfah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَكُونُوا إِمَّعَةً تَقُولُونَ إِنْ أَحْسَنَ النَّاسُ أَحْسَنَّا وَإِنْ ظَلَمُوا ظَلَمْنَا وَلَكِنْ وَطِّنُوا أَنْفُسَكُمْ إِنْ أَحْسَنَ النَّاسُ أَنْ تُحْسِنُوا وَإِنْ أَسَاءُوا فَلَا تَظْلِمُوا<\/p>\n<p><strong>Do not let yourselves become blind followers, saying that if the people are good then we will be good, and if they are unjust then we will be unjust. Rather, make up your own minds. If the people are good then be good, but if they are evil then do not be unjust.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2007, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/31\/do-not-be-blind-followers\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>The true Muslim strives to apply his or her mind to the study of religion, science, and ethics. Muslims should value knowledge, intelligence, and logical thought as these virtues in no way contradict Islam. Rather, the blessed faculty of reason is fundamental and indispensable to our faith.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The foundation of a man is his intellect,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[16,20,135,32,34,95,48,50,100,55,103,301,148,73,98,179],"class_list":["post-17407","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-character-akhlaq","tag-creation-al-khalq","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-hypocrisy-al-nifaq","tag-justice-adl","tag-knowledge","tag-manners-al-adab","tag-methodology-al-minhaj","tag-public-welfare-al-maslaha","tag-pure-nature-fitrah","tag-reason-al-aql","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4wL","jetpack-related-posts":[{"id":13557,"url":"https:\/\/www.abuaminaelias.com\/suicide-bombings-in-islam\/","url_meta":{"origin":17407,"position":0},"title":"Suicide bombings are unlawful in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill yourselves. Verily, Allah is ever merciful to you.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17756,"url":"https:\/\/www.abuaminaelias.com\/seeking-knowledge-and-learning-for-life-in-islam\/","url_meta":{"origin":17407,"position":1},"title":"Life-long learning in Islam","author":"Abu Amina Elias","date":"February 18, 2016","format":false,"excerpt":"\"It is not befitting for anyone with knowledge to give up learning.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18474,"url":"https:\/\/www.abuaminaelias.com\/the-right-way-to-defend-islam\/","url_meta":{"origin":17407,"position":2},"title":"Defending Islam with grace and sincerity","author":"Abu Amina Elias","date":"June 1, 2017","format":false,"excerpt":"\"Whoever intends justice, then let him imagine himself in the place of his adversary,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18845,"url":"https:\/\/www.abuaminaelias.com\/are-arabs-master-race-in-islam\/","url_meta":{"origin":17407,"position":3},"title":"Are Arabs the master race in Islam?","author":"Abu Amina Elias","date":"February 4, 2018","format":false,"excerpt":"\"There is no favor of an Arab over a foreigner,\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":17407,"position":4},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23609,"url":"https:\/\/www.abuaminaelias.com\/dealing-doubts-islam\/","url_meta":{"origin":17407,"position":5},"title":"Dealing with faith-related doubts in Islam","author":"Abu Amina Elias","date":"October 7, 2021","format":false,"excerpt":"\"We are more likely to doubt than Abraham, when he said: O Lord, show me how You give life to the dead.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17407","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17407"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17407\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17407"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17407"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17407"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}