{"id":17423,"date":"2015-12-17T15:24:17","date_gmt":"2015-12-17T11:24:17","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17423"},"modified":"2025-03-07T16:02:40","modified_gmt":"2025-03-07T12:02:40","slug":"application-of-hudud-punishments-in-sharia-law","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/application-of-hudud-punishments-in-sharia-law\/","title":{"rendered":"Application of hudud punishments in Sharia law"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The <em>hudud<\/em> ordinances and punishments in classical Islamic law, which include flogging, stoning the married adulterer, and capital punishment, have ignited a new controversy in Muslim lands as Islamic political parties have called for their strict and immediate application as state statutory law (<em>qanun<\/em>). This call is largely based upon popular passions, the understandable desire of Muslim masses to be more faithful to Islam, but their reintroduction into state law has been very problematic on many levels. Instead of applying these laws in a literal and decontextualized manner, we should examine the texts in light of the purposes of Islamic law and their historical context before rushing to implement legal punishments that a large number of people, many Muslims included, deem harsh and unnecessary.<\/p>\n<p>Any application of Islamic law must first and foremost address the essential objectives of the law (<em>maqasid al-shari’ah<\/em>). The scholars agree that the <em>hudud<\/em> are legislated to ensure justice between the people and to protect their natural rights to life and property.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ بَيَّنَ سُبْحَانَهُ بِمَا شَرَعَهُ مِنْ الطُّرُقِ أَنَّ مَقْصُودَهُ إقَامَةُ الْعَدْلِ بَيْنَ عِبَادِهِ وَقِيَامُ النَّاسِ بِالْقِسْطِ فَأَيُّ طَرِيقٍ اُسْتُخْرِجَ بِهَا الْعَدْلُ وَالْقِسْطُ فَهِيَ مِنْ الدِّينِ وَلَيْسَتْ مُخَالِفَةً لَهُ<\/p>\n<p>Allah the Exalted has made clear in his law (<em>sharia<\/em>) that the objective is the establishment of justice between his servants and fairness among the people, so whichever path leads to justice and fairness is part of the religion and can never oppose it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/06\/ibn-al-qayyim-on-sharia-justice-is-integral-to-the-religion-of-islam-and-can-never-oppose-it\/\">al-Ṭuruq al-Ḥikmīya 1\/13<\/a><\/p><\/blockquote>\n<p>Any practice that leads to justice and the protection of people’s rights is necessarily a part of Islam, even if it is not based on an explicit text. The question is not whether the <em>hudud<\/em> punishments should be reintroduced as statutory law, but rather: how can classical Islamic law be adapted to meet the needs of justice in modern societies?<\/p>\n<p>Moreover, a literal and decontextualized application of the <em>hudud<\/em> in some Muslim countries has led to injustice as these laws have disproportionately targeted the lower classes and women, and they have been applied without necessary due process and appropriate legal counsel in defense of the accused. It cannot be said that an unjust application of an Islamic law is, in reality, a faithful adherence to Islam.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَكُلُّ مَسْأَلَةٍ خَرَجَتْ عَنْ الْعَدْلِ إلَى الْجَوْرِ وَعَنْ الرَّحْمَةِ إلَى ضِدِّهَا وَعَنْ الْمَصْلَحَةِ إلَى الْمَفْسَدَةِ وَعَنْ الْحِكْمَةِ إلَى الْبَعْثِ فَلَيْسَتْ مِنْ الشَّرِيعَةِ وَإِنْ أُدْخِلَتْ فِيهَا بِالتَّأْوِيلِ<\/p>\n<p>Every matter which abandons justice for tyranny, mercy for cruelty, benefit for corruption, and wisdom for foolishness is not a part of the Sharia even if it was introduced therein by an interpretation.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ibn-al-qayyim-the-sharia-is-based-upon-justice-mercy-welfare-and-wisdom\/\">I’lām al-Muwaqqi’īn 3\/11<\/a><\/p><\/blockquote>\n<p>In other words, if the application of the letter of the law does not result in justice, mercy, benefit, and wisdom, then it cannot properly be considered an Islamic law even if it is based upon an interpretation of the Quran, the Sunnah, and the jurisprudence of the scholars.<\/p>\n<p>The <em>hudud<\/em> punishments are largely a teaching mechanism for society and a deterrent for potential criminals. The law is a teacher and an expression of society’s disapproval of the most major crimes: theft, adultery, and murder.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ يَا أُولِي الْأَلْبَابِ لَعَلَّكُمْ تَتَّقُونَ<\/p>\n<p><strong>There is for you in legal retribution saving of life, O people of understanding, that you may become righteous.<\/strong><\/p>\n<p>Surat al-Baqarah 2:179<\/p><\/blockquote>\n<p>However, the burden of proof classical Islamic law requires to implement the <em>hudud<\/em> punishments is so high, along with other mitigating principles, that many modern Muslim scholars say that these punishments should almost never apply except in the most extreme circumstances. As an example, the requirement of four trustworthy witnesses to establish a crime of adultery is practically impossible to achieve. Thus, the<em> hudud<\/em> should be on the law books as a deterrent and expression of Muslim society’s values, but they are a last resort. They are not necessarily the preferred or exclusive Islamic method of punishing crime.<\/p>\n<p>Historically, this is how the <em>hudud<\/em> punishments were understood and applied in the time of the Prophet and in the great empires that were ruled by Sharia law. In fact, in the entire history of the Ottoman Empire there is only one recorded incident in which an adulterer was stoned to death, and not a single case at all in the history of Syria.<a href=\"#_edn1\" name=\"_ednref1\">[i]<\/a> This fact stands in stark contrast to the political platform of some Islamic parties today that call for immediate, strict, and widespread application of these punishments.<\/p>\n<p>Several mitigating factors contribute to the restriction of the <em>hudud<\/em> punishments. The practice of the Prophet, his companions, and the understanding of the scholars have allowed for many excuses that prohibit the application of the harshest punishments.<\/p>\n<p>As-Suyuti writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><span style=\"line-height: 1.5;\">القاعدة (في الفقه) الحدود تسقط بالشبهات<\/span><\/p>\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5;\">A principle of law states that legal punishments are suspended by doubts.<\/span><\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/16\/hadith-on-punishments-do-not-apply-legal-punishments-if-you-have-an-excuse\/\">al-Ashbāh wal-Naẓāʼir 2\/122<\/a><\/p><\/blockquote>\n<p>In the case of the slightest doubt, the legal punishments are unwarranted and should not be applied. This is because it is better to let a criminal go free than it is to punish an innocent person.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْرَءُوا الْحُدُودَ عَنْ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِنْ كَانَ لَهُ مَخْرَجٌ فَخَلُّوا سَبِيلَهُ فَإِنَّ الْإِمَامَ أَنْ يُخْطِئَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يُخْطِئَ فِي الْعُقُوبَةِ<\/p>\n<p><strong>Avoid applying legal punishment upon the Muslims if you are capable. If the criminal has a way out, then leave him to his way. Verily, it is better for the leader to make a mistake forgiving the criminal than it is for him to make a mistake punishing the innocent.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1424, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/23\/hadith-on-pardon-it-is-better-for-the-leader-to-err-in-forgiveness-than-in-punishment\/\">Sahih <\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Tirmidhi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ رُوِيَ نَحْوُ هَذَا عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَالُوا مِثْلَ ذَلِكَ<\/p>\n<p>It has likewise been narrated from more than one of the companions of the Prophet, peace and blessings be upon him, that they said similar to this.<\/p>\n<p>Source: Sunan al-Tirmidhī 1424<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْفَعُوا الْحُدُودَ مَا وَجَدْتُمْ لَهُ مَدْفَعًا<\/p>\n<p><strong>Avoid applying legal punishments as long as you find an excuse to avoid them.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2545, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/16\/hadith-on-punishments-do-not-apply-legal-punishments-if-you-have-an-excuse\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَئِنْ أُعَطِّلُ الْحُدُودَ بِالشُّبُهَاتِ أَحَبُّ إلَيَّ مِنْ أَنْ أُقِيمَهَا فِي الشُّبُهَاتِ<\/p>\n<p>That I relax the legal punishments is more beloved to me than applying them with doubts.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 27926, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/16\/umar-on-punishment-it-is-better-to-not-punish-a-criminal-than-to-punish-him-with-doubts\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْرَءُوا الْجَلْدَ وَالْقَتْلَ عَنِ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ<\/p>\n<p>Avoid flogging and applying the death penalty upon Muslims as much as you can.<\/p>\n<p>Source: Sunan al-Kubrā 15686, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/06\/21\/ibn-masud-on-pardon-avoid-legal-punishments-on-muslims-as-much-a-possible\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibrahim Al-Nakha’i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْرَءُوا الْحُدُودَ عَنِ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِذَا وَجَدْتُمْ لِلْمُسْلِمِ مَخْرَجًا فَادْرَءُوا عَنْهُ فَإِنَّهُ أَنْ يَخْطَأَ حَاكِمٌ مِنْ حُكَّامِ الْمُسْلِمِينَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يَخْطَأَ فِي الْعُقُوبَةِ<\/p>\n<p>Avoid legal punishments upon the Muslims as much as you are able. If you find a way out for a Muslim, then leave it to him. Verily, for the judge to make a mistake pardoning the Muslims is better than to make a mistake punishing them.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/21\/sufyan-on-apostasy-the-apostate-should-be-imprisoned-but-not-killed\/\">Muṣannaf &#8216;Abd al-Razzāq 18084<\/a><\/p><\/blockquote>\n<p>The thrust of these traditions is that we ought to be finding excuses not to apply the harshest punishments, rather than demanding their uncompromising application. In one incident, the Prophet refused to accept the confession of a man since he never actually stated the crime he committed.<\/p>\n<p>Anas ibn Malik reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, I have committed an offense which deserves legal punishment, so impose it upon me.” The man was present at the prayer and he prayed with the Messenger of Allah. When they finished the prayer, the man repeated his request. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ حَضَرْتَ الصَّلاَةَ مَعَنَا<\/p>\n<p><strong>Were you present with us at the time of prayer?<\/strong><\/p><\/blockquote>\n<p>The man said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ غُفِرَ لَكَ ‏<\/p>\n<p><strong>You have been forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6437, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/12\/it-is-best-to-avoid-legal-punishments-if-given-a-valid-excuse-such-as-a-vague-confession\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It was the practice of the two righteous Caliphs Abu Bakr and Umar to order someone accused of theft to not confess to the crime, in the hope that there would be an acceptable excuse to avoid applying legal punishment and that the criminal would privately repent.<\/p>\n<p>&#8216;Ata reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ مَنْ مَضَى يُؤْتَى بِالسَّارِقِ فَيَقُولُ أَسَرَقْتَ قُلْ لَا وَلَا أَعْلَمُهُ إلَّا سَمَّى أَبَا بَكْرٍ وَعُمَرَ<\/p>\n<p>Those who came before would be presented with someone accused of theft and they would say, “Have you stolen? Say no.” I do not know who did so except Abu Bakr and Umar.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 28014, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/17\/ata-on-punishment-the-judge-would-order-the-accused-to-deny-his-crime\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This is consistent with the teaching that Muslims should cover the faults of others, including their own faults, by not publicizing their sins and crimes. The accused, even if he truly committed the crime, is not lying in this case since he would be acting on the order of the judge.<\/p>\n<p>Regarding capital punishment for murder, the Prophet would always recommend for the families of the victim to pardon the criminal and accept monetary payment, rather than demand execution even though this is their right.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ۗ ذَٰلِكَ تَخْفِيفٌ مِّن رَّبِّكُمْ وَرَحْمَةٌ ۗ فَمَنِ اعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُ عَذَابٌ أَلِيمٌ<\/p>\n<p><strong>Whoever pardons a capital crime from his brother, then it should be followed by good conduct and payment to him in the best manner. This is an alleviation from your Lord and a mercy, but whoever transgresses after that will have a painful punishment.<\/strong><\/p>\n<p>Surat al-Baqarah 2:178<\/p><\/blockquote>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُفِعَ إِلَيْهِ شَيْءٌ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ<\/p>\n<p>I never saw a case involving legal retaliation being referred to the Messenger of Allah, peace and blessings be upon him, except that he would command pardoning the criminal.<\/p>\n<p>Source: Sunan Abī Dāwūd 4497, Source: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/12\/hadith-on-mercy-the-messenger-of-allah-always-recommended-that-people-forgive-their-oppressors\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In one incident, the Prophet blamed a man who stubbornly insisted on demanding execution despite the Prophet’s repeated recommendations to forgive him.<\/p>\n<p>Anas ibn Malik reported: A man came to the Messenger of Allah, peace and blessings be upon him, with the killer of his relative. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْفُ عَنْهُ<\/p>\n<p><strong>Pardon him.<\/strong><\/p><\/blockquote>\n<p>But the man refused. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُذْ الدِّيَةَ<\/p>\n<p><strong>Take the blood money.<\/strong><\/p><\/blockquote>\n<p>But the man refused. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اذْهَبْ فَاقْتُلْهُ فَإِنَّكَ مِثْلُهُ<\/p>\n<p><strong>Go and kill him, for you are like him.<\/strong><\/p><\/blockquote>\n<p>Anas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَخَلَّى سَبِيلَهُ<\/p>\n<p>So the man let him go.<\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 4730, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/10\/30\/hadith-on-punishment-pardon-the-murderer-or-kill-him-and-be-like-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In calling for the <em>hudud<\/em> punishments, Muslims must be careful not to do so in a spirit of vengeance, lest we be infected with the same lust for blood as the criminals themselves. We should be more concerned about mercy for the people, rather than a strict application of justice.<\/p>\n<p>Ibn Taymiyyah commented on the previously cited traditions, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ بَابَ الْإِحْسَانِ إِلَى النَّاسِ وَالْعَفْوِ عَنْهُمْ مُقَدَّمٌ عَلَى بَابِ الْإِسَاءَةِ وَالِانْتِقَامِ<\/p>\n<p>Verily, the matter of benevolence and forgiveness towards people takes precedence over the matter of vengeance and revenge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/03\/01\/ibn-al-qayyim-on-forgiveness-pardon-and-mercy-are-more-beloved-to-allah-than-retribution\/\">Minhāj al-Sunnah 4\/327<\/a><\/p><\/blockquote>\n<p>And Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَفْوُ أَحَبُّ إِلَيْهِ مِنَ الِانْتِقَامِ وَالرَّحْمَةُ أَحَبُّ إِلَيْهِ مِنَ الْعُقُوبَةِ وَالْفَضْلُ أَحَبُّ إِلَيْهِ مِنَ الْعَدْلِ وَالْعَطَاءُ أَحَبُّ إِلَيْهِ مِنَ الْمَنْعِ<\/p>\n<p>Forgiveness is more beloved to Allah than vengeance, mercy is more beloved to Him than punishment, grace is more beloved to Him than justice, and giving is more beloved to Him than withholding.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/03\/01\/ibn-al-qayyim-on-forgiveness-pardon-and-mercy-are-more-beloved-to-allah-than-retribution\/\">Madārij al-Sālikīn 1\/228<\/a><\/p><\/blockquote>\n<p>In light of this, would it not be better for a Muslim society to fail to implement these punishments rather than implement them in an unjust way and thereby ruin the reputation of Islam and its law?<\/p>\n<p>Considering the modern context, we should be warned about neglecting the wisdom of our righteous predecessors who understood well the spiritual priorities of Islam. The <em>hudud<\/em> punishments are not the pillars of Islam, neither are they the defining features of an Islamic state. They were revealed towards the end of the Prophet’s life after the much more important teachings of faith and virtue had been firmly established. Thus, the most important characteristic of an Islamic state is mercy and justice for all of its citizens, as Allah does not support an unjust state even if it might be outwardly “Islamic.”<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُ يَنْصُرُ الدَّوْلَةَ الْعَادِلَةَ وَإِنْ كَانَتْ كَافِرَةً وَلَا يَنْصُرُ الدَّوْلَةَ الظَّالِمَةَ وَإِنْ كَانَتْ مُؤْمِنَةً<\/p>\n<p>Allah will support the just state even if it is led by unbelievers, but He will not support the oppressive state even if it is led by believers.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ibn-taymiyyah-allah-establishes-a-government-of-justice-even-if-it-is-led-by-unbelievers\/\">Majmū&#8217; Fatāwá 28\/63<\/a><\/p><\/blockquote>\n<p>The righteous Caliph Umar ibn Abdul Aziz was wise enough to not apply all of the Islamic laws in his time, since he knew that to do so would cause dissension and a great trial for the people.<\/p>\n<p>Ibn Abdu Rabbih reported: Abdul Malik said to his father Umar ibn Abdul Aziz, “O father, what is the matter that you do not implement the commands? By Allah, I would not mind if it caused discord between us as long as it was the truth.” Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تعجل يا بنيّ فإنّ الله ذمّ الخمر في القرآن مرتين وحرّمها في الثالثة وأنا أخاف أن أحمل الحق على الناس جملة فيدفعونه جملة ويكون من ذلك فتنة<\/p>\n<p>Do not make it so, my son. Verily, Allah blamed wine-drinking in the Quran twice and on the third time He made it unlawful. I fear that if I compelled people to follow the truth all at once, they would reject it all at once and that would cause a tribulation.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/12\/umar-ii-on-gradualism-if-i-force-everyone-to-follow-the-truth-completely-they-will-reject-it-completely\/\">al-ʻIqd al-Farīd 5\/185<\/a><\/p><\/blockquote>\n<p>Islamic laws ought to be introduced with gradualism (<em>tadarruj<\/em>), at the right time and for the right reason. Neglecting the circumstances of the people in the name of supporting the truth can actually cause greater harm to the truth.<\/p>\n<p>In addition, we need to examine the original historical context in which these laws were revealed to see if applying them literally in the modern context of various countries would achieve the objectives of justice and security.<\/p>\n<p>For example, the punishment for theft, which is cutting off the hand of the thief, was revealed in the circumstances of Mecca and Medina over 1400 years ago. Mecca and Medina were travel destinations for traders coming between Syria and Yemen, resulting in many foreigners passing through each city. A visitor might find it easy to steal some property from the local citizens and then quickly disappear along the trade routes. What is more, the two cities did not have the resources to imprison criminals or otherwise apply an effective deterrent against theft. The theft of a horse or a camel in this time would be a catastrophe to its owner, whose lively-hood depended upon them. Hence, the cutting of the hand was practically the only way to deter potential thieves and incapacitate would-be repeat offenders. This was, in fact, a more lenient punishment than other systems that would outright execute a thief.<\/p>\n<p>The question for us today will be: is it necessary to apply this punishment in the modern context in order to achieve the same objective of justice and security? Is there really a perfect analogy (<em>qiyas<\/em>) between the time of the Prophet and the situation today? Certainly, the punishment of cutting the hand is not the only possible punishment for theft. Rather, it is the maximum punishment in the most extreme cases that today we would call grand theft.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمْ تُقْطَعْ يَدُ سَارِقٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَقَلَّ مِنْ ثَمَنِ الْمِجَنِّ حَجَفَةٍ أَوْ تُرْسٍ وَكِلَاهُمَا ذُو ثَمَنٍ<\/p>\n<p>During the time of the Messenger of Allah, peace and blessings be upon him, he would not cut off the hand of the thief who stole less than the price of a shield or coat of armor, and both of them were valuable.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1685, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/19\/hadith-on-theft-the-prophet-would-apply-severe-punishment-for-grand-theft-but-not-for-petty-theft\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This understanding is embedded in the word <em>hudud<\/em> itself, which means “limits” or “boundaries,” setting the ceiling for the maximum punishment allowed by law. It is not lawful to punish a thief with more than this punishment, for it would be unjust to apply this punishment to a petty criminal.<\/p>\n<p>Rafi’ ibn Khadeej reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ<\/p>\n<p><strong>Do not cut the hand of one who steals fruit or steals from palm trees.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1449, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/11\/hadith-on-theft-the-hand-is-not-cut-for-those-who-steal-food-from-trees\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In a well-known precedent, the Caliph Umar ibn al-Khattab suspended the punishment of amputation during a severe famine when people were stealing food for their survival. Umar understood that the context required suspension of the law and that to apply the law in this situation would lead to injustice.<\/p>\n<p>Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يُقْطَعُ فِي عِذْقٍ وَلا عَامِ السَّنَةِ<\/p>\n<p>Do not cut the hand of the thief who steals dates in the year of famine.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/18\/umar-on-justice-do-not-cut-the-hand-of-the-thief-who-steals-food-out-of-starvation\/\">Muṣannaf &#8216;Abd al-Razzāq 18371<\/a><\/p><\/blockquote>\n<p>As-Sa’di reported: I asked Ahmad ibn Hanbal about this narration and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا إذا حملته الحاجة على ذلك والناس في مجاعة وشدة<\/p>\n<p>No, the hand is not cut when there is a need for that and the people are in a severe famine.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 3\/17<\/p><\/blockquote>\n<p>Furthermore, the Prophet would modify the standard punishments when the situation called for it, and he would make sure that the implementation of punishment did not result in excessive cruelty or harm.<\/p>\n<p>Sa’d ibn Ubadah reported: There was a man living among us who had a physical defect and to our surprise we saw him having intercourse with one of the servant girls. Sa’d referred his case to the Messenger of Allah, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اجْلِدُوهُ ضَرْبَ مِائَةِ سَوْطٍ<\/p>\n<p><strong>Strike him with the whip one hundred times.<\/strong><\/p><\/blockquote>\n<p>They said, “O Prophet of Allah, he is too weak for that. If you strike him one hundred times, he might die.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَخُذُوا لَهُ عِثْكَالًا فِيهِ مِائَةُ شِمْرَاخٍ فَاضْرِبُوهُ ضَرْبَةً وَاحِدَةً<\/p>\n<p><b>Then take a branch with one hundred twigs and strike him once.<\/b><\/p>\n<p>Source: Sunan Ibn Mājah 2566, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/02\/06\/hadith-on-adultery-the-punishment-of-lashing-for-adultery-and-modified-punishment-for-the-weak\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>Zaid ibn Aslam reported: A man confessed of adultery in the time of the Messenger of Allah, peace and blessings be upon him. The Prophet called for a whip and he was given a broken whip. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَوْقَ هَذَا<\/p>\n<p><b>Greater than this<\/b>.<\/p><\/blockquote>\n<p>He was brought another whip whose knots had not been cut. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دُونَ هَذَا<\/p>\n<p><b>Lesser than this<\/b>.<\/p><\/blockquote>\n<p>He was brought a whip that had been used and was more flexible. The Prophet gave the order and the man was flogged, then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ قَدْ آنَ لَكُمْ أَنْ تَنْتَهُوا عَنْ حُدُودِ اللَّهِ مَنْ أَصَابَ مِنْ هَذِهِ الْقَاذُورَاتِ شَيْئًا فَلْيَسْتَتِرْ بِسِتْرِ اللَّهِ فَإِنَّهُ مَنْ يُبْدِي لَنَا صَفْحَتَهُ نُقِمْ عَلَيْهِ كِتَابَ اللَّهِ<\/p>\n<p><b>O people, the time has now come for you to observe the limits of Allah. Whoever has had any of these ugly matters befall him should cover them up with the veil of Allah. Whoever reveals to us his sins, then we will act against him according to the Book of Allah<\/b>.<\/p>\n<p>Source: al-Muwaṭṭa&#8217; 1562, Grade: <i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/23\/hadith-on-pardon-it-is-better-for-the-leader-to-err-in-forgiveness-than-in-punishment\/\">Hasan li ghayri<\/a><\/i><\/p><\/blockquote>\n<p>Therefore, if there is a need in society to suspend or modify the harshest of these punishments, then that is perfectly in line with the teachings of Islam. Misapplying the law would be a betrayal of Islam itself.<\/p>\n<p>There are procedural questions that need to be addressed as well. The <em>hudud<\/em> punishments cannot be applied in the absence of a truly independent judiciary. In some Muslim countries applying <em>hudud<\/em> today, the victims are overwhelmingly from the poor, women, and other disadvantaged classes because the judicial institution is biased towards the wealthy and powerful. This violates the spirit of justice behind these laws, as they should apply to the rich and poor equally.<\/p>\n<p>In one incident, some people in the time of the Prophet wanted to intercede for a rich woman who was found guilty of major theft. The Prophet refused their intercession and he warned that a society which fails to apply the law fairly and equally was in danger of destruction.<\/p>\n<p>Aisha reported: The Quraysh had been anxious about a woman who had committed theft and they said, “Who will speak to the Messenger of Allah about her?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ<\/p>\n<p><strong>Do you intercede regarding a punishment prescribed by Allah<\/strong>?<\/p><\/blockquote>\n<p>The Prophet then stood up and addressed the people saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ إِنَّمَا أَهْلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا<\/p>\n<p><strong>O people, those who came before you were destroyed because if a person of high status committed theft among them, they would spare him, but if a person of lower status committed theft, they would apply the punishment upon him. By Allah, if Fatima the daughter of Muhammad were to steal, I would have cut off her hand<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1688, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/19\/hadith-on-justice-the-prophet-would-apply-legal-punishment-equally-among-society-even-upon-his-own-family-members\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet would have applied the same punishment to his beloved family members as he would to any other member of society. By contrast, judicial institutions in parts of the Muslim world are in desperate need of reform and reorganization. If such impartial institutions do not exist in a Muslim society, then how can they possibly implement the <em>hudud <\/em>as intended?<\/p>\n<p>In any case, Muslims have a duty to speak out against the misapplication of <em>hudud<\/em> that has resulted in gross violations of human rights. The law of Islam has a clear purpose and goal in mind regarding criminal punishment and the use of classical legal rulings in a manner unintended by the Law-giver is a betrayal that none of us should accept.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n<p><a href=\"#_ednref1\" name=\"_edn1\">[i]<\/a> Kadri, Sadakat. <em>Heaven on Earth: A Journey Through Shari&#8217;a Law from the Deserts of Ancient Arabia to the Streets of the Modern Muslim World<\/em>. 2012, page 217.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Forgiveness is more beloved to Allah than vengeance,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[320,18,169,26,39,48,404,54,55,91,296,73],"class_list":["post-17423","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-abu-bakr","tag-community-jamaah","tag-ease-yusr","tag-forgiveness-al-maghfirah","tag-imam-ahmad-ibn-hanbal","tag-justice-adl","tag-legal-punishment-al-hudud","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-righteous-predecessors-al-salaf-al-salih","tag-sharia","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4x1","jetpack-related-posts":[{"id":14876,"url":"https:\/\/www.abuaminaelias.com\/who-implements-hudud-punishments\/","url_meta":{"origin":17423,"position":0},"title":"Who carries out Islamic legal punishments?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"It is forbidden to establish a legal punishment unless...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18681,"url":"https:\/\/www.abuaminaelias.com\/was-the-stoning-verse-abrogated\/","url_meta":{"origin":17423,"position":1},"title":"Is the stoning verse missing from the Quran?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The ruling of the verse of stoning is affirmed and its recitation is abrogated.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23559,"url":"https:\/\/www.abuaminaelias.com\/shariah-fiqh-qanun\/","url_meta":{"origin":17423,"position":2},"title":"Sharia, Fiqh, and Islamic law explained","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"To whomever Allah wills goodness, He grants him understanding of the religion.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16284,"url":"https:\/\/www.abuaminaelias.com\/separation-mosque-and-state\/","url_meta":{"origin":17423,"position":3},"title":"Separation of Mosque and State in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Religious values should have a positive influence on the government,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14907,"url":"https:\/\/www.abuaminaelias.com\/most-restrained-killing-believers\/","url_meta":{"origin":17423,"position":4},"title":"Most restrained in killing are believers","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The most restrained of the people in killing are the people of faith.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14928,"url":"https:\/\/www.abuaminaelias.com\/eye-for-an-eye\/","url_meta":{"origin":17423,"position":5},"title":"What is the meaning of &#8216;eye for an eye&#8217;?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"We ordained for them a life for a life, an eye for an eye...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17423","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17423"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17423\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17423"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17423"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17423"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}