{"id":17452,"date":"2015-12-23T14:18:12","date_gmt":"2015-12-23T10:18:12","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17452"},"modified":"2025-02-10T12:18:52","modified_gmt":"2025-02-10T08:18:52","slug":"congratulating-non-muslims-festivals","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/congratulating-non-muslims-festivals\/","title":{"rendered":"Prohibition of congratulating non-Muslims for their festivals"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The issue of whether or not to congratulate non-Muslims during their festivals frequently becomes a topic of controversy when the season arrives. Muslims have to balance the duty to bear witness to our faith while at the same time cultivating good relations with our non-Muslim neighbors. These two concerns sometimes exist in tension and, as in all things, we ought to take a balanced and moderate approach to the issue.<\/p>\n<p>The scholars agreed that it is prohibited for Muslims congratulate non-Muslims only regarding their religious rituals that express what Islam considers to be acts of unbelief.<\/p>\n<p>Ibn a-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا التَّهْنِئَةُ بِشَعَائِرِ الْكُفْرِ الْمُخْتَصَّةِ بِهِ فَحَرَامٌ بِالِاتِّفَاقِ مِثْلَ أَنْ يُهَنِّئَهُمْ بِأَعْيَادِهِمْ وَصَوْمِهِمْ &#8230; وَإِنْ بُلِيَ الرَّجُلُ بِذَلِكَ فَتَعَاطَاهُ دَفْعًا لِشَرٍّ يَتَوَقَّعُهُ مِنْهُمْ فَمَشَى إِلَيْهِمْ وَلَمْ يَقُلْ إِلَّا خَيْرًا وَدَعَا لَهُمْ بِالتَّوْفِيقِ وَالتَّسْدِيدِ فَلَا بَأْسَ بِذَلِكَ<\/p>\n<p>As for offering congratulations for rituals of unbelief specific to another religion, then it is forbidden by agreement, such as congratulating them for their holidays and their fasting… But if a man is tried by that and he anticipates the need to repel some evil from them, then let him walk to them and say nothing but good and supplicate for them to receive guidance and direction. There is no harm in that.<\/p>\n<p>Source: Aḥkām Ahl al-Dhimmah 1\/441<\/p><\/blockquote>\n<p>The prohibition applies to lending support for specific religious doctrines and rituals that contradict Islamic teachings, but Ibn al-Qayyim makes an exception for Muslims to say good and kind words to non-Muslims, even to pray for their guidance and well-being.<\/p>\n<p>In fact, there are three classical opinions, all of them attributed Imam Ahmad bin Hanbal, on the matter of congratulating non-Muslims on their holidays, visiting them, and offering condolences.<\/p>\n<p>Ibn Muflih writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَحْرُمُ الْعِيَادَةُ وَالتَّهْنِئَةُ وَالتَّعْزِيَةُ لَهُمْ كَالتَّصْدِيرِ وَالْقِيَامِ وَكَمُبْتَدِعٍ يَجِبُ هَجْرُهُ وَعَنْهُ يَجُوزُ وَعَنْهُ لِمَصْلَحَةٍ رَاجِحَةٍ كَرَجَاءِ إسْلَامٍ اخْتَارَهُ شَيْخُنَا وَمَعْنَاهُ اخْتِيَارُ الْآجُرِّيِّ وَأَنَّهُ قَوْلُ الْعُلَمَاءِ يُعَادُ وَيُعْرَضُ عَلَيْهِ الْإِسْلَامُ<\/p>\n<p>It is narrated from Ahmad that it is forbidden to visit non-Muslims, congratulate them, or offer condolences for them in the same way it is an obligation to boycott a heretic, and it is narrated that he generally permitted these actions and also that he permitted these on the condition that there is a likely benefit in it, such as the hope they will embrace Islam. This last opinion is preferred by our Sheikh Ibn Taymiyyah as well as Al-Ajurri and it is the opinion of the scholars that they should be visited to be presented with Islam.<\/p>\n<p>Source: al-Furūʻ li Ibn Mufliḥ 6\/270<\/p><\/blockquote>\n<p>Some scholars prohibited congratulating non-Muslims on their holidays, while others allowed it with or without conditions. The clear benefit of maintaining positive relationships with non-Muslims in an increasingly globalized world can no longer be ignored. For this reason, many modern scholars encourage Muslims to offer kind words to their non-Muslim neighbors during the holiday seasons as long as we do not endorse their religious doctrines and rituals.<\/p>\n<p>The basis for this opinion, among others, is that Islam encourages benevolence towards any non-Muslim that has not declared war on Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَّا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَارِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ<\/p>\n<p><strong>Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes, He does not forbid you from being benevolent towards them and acting justly towards them. Verily, Allah loves those who act justly.<\/strong><\/p>\n<p>Surat al-Mumtahanah 60:8<\/p><\/blockquote>\n<p>Ibn al-Jawzi comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذِهِ الْآيَةُ رُخْصَةٌ فِي صِلَةِ الَّذِينَ لَمْ يَنْصِبُوا الْحَرْبَ لِلْمُسْلِمِينَ وَجَوَازِ بِرِّهِمْ وَإِنْ كَانَتِ الْمُوَالَاةُ مُنْقَطِعَةً مِنْهُمْ<\/p>\n<p>This verse is a dispensation to maintain relations with those who have not declared war against the Muslims and permits benevolence towards them even if they are in a separate country from them.<\/p>\n<p>Source: Zād al-Masīr 8\/237<\/p><\/blockquote>\n<p>Muslims are generally commanded to speak good and kind words to people.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقُولُوا لِلنَّاسِ حُسْنًا<\/p>\n<p><strong>And speak to people good words.<\/strong><\/p>\n<p>Surat al-Baqarah 2:83<\/p><\/blockquote>\n<p>Many Muslims today live in pluralistic and multicultural societies in which non-Muslims express their good wishes towards Muslims during the two Eid celebrations. The rule, in this case, is to reciprocate this kindness by sending good wishes to them during their celebrations.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا حُيِّيتُم بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا<\/p>\n<p><strong>When you are greeted with a greeting, greet in return with one better than it or return it in a like manner.<\/strong><\/p>\n<p>Surat al-Nisa 4:86<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ<\/p>\n<p><strong>Is the reward for good anything but good?<\/strong><\/p>\n<p>Surat al-Rahman 55:60<\/p><\/blockquote>\n<p>The scholars also draw a legal analogy (<em>qiyas<\/em>) between the issue of congratulating non-Muslims and other occasions in which Muslims are clearly permitted to be kind to non-Muslims. For example, Muslims are allowed to share food with the people of scriptural religions (5:5).<\/p>\n<p>Moreover, the Prophet commanded Muslims to respect the funerals of all people including non-Muslims.<\/p>\n<p>Amir ibn Rabia reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ<\/p>\n<p><strong>When you see a funeral procession, then stand up for it until it passes or the deceased is placed in the grave.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1245, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/22\/hadith-on-funerals-stand-up-for-a-funeral-out-of-respect-for-the-deceased\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Qais ibn Sa’d reported: A funeral passed by the Messenger of Allah, peace and blessings be upon him, and he stood up. It was said to him, “It is a Jew.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَيْسَتْ نَفْسًا<\/p>\n<p><strong>Was he not a soul?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1250, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/30\/the-prophet-stood-up-for-the-funeral-of-a-jew-out-of-respect-for-his-humanity\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>While Muslims are prohibited from praying for non-Muslims to be forgiven, as this matter is for Allah alone, any other good words of condolences and respect for the deceased’s family are encouraged.<\/p>\n<p>Muslims are allowed to accept the gifts of non-Muslims during their festivals, even if they are idolaters celebrating an idolatrous holiday and particularly if this will establish diplomatic and peaceful relations. The only exception to this rule is that Muslims should not eat their meat if it was slaughtered in the name of a god besides Allah.<\/p>\n<p>Ali ibn Abi Talib reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كِسْرَى أَهْدَى لَهُ فَقَبِلَ وَأَنَّ الْمُلُوكَ أَهْدَوْا إِلَيْهِ فَقَبِلَ مِنْهُمْ<\/p>\n<p>The Prophet, peace and blessings be upon him, was given gifts by Khosrau and he accepted them, and kings would give him gifts and he would accept them.<\/p>\n<p>Source: Sunan al-Tirmidhī 1576, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/12\/23\/hadith-on-gifts-the-prophet-accepted-gifts-from-non-muslim-leaders\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Qabus reported: A woman asked Aisha, “We have a nurse among the Magians and they give us gifts on their festivals.” Aisha said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَّا مَا ذُبِحَ لِذَلِكَ الْيَوْمِ فَلا تَأْكُلُوا وَلَكِنْ كُلُوا مِنْ أَشْجَارِهِمْ<\/p>\n<p>As for the meat they have slaughtered, then do not eat it. Rather, you may eat from the fruit of their trees.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/23\/hadith-on-gifts-permission-to-accept-lawful-gifts-from-idolaters-on-their-festivals\/\">Muṣannaf Ibn Abī Shaybah 31986<\/a><\/p><\/blockquote>\n<p>Abu Barza reported: He had neighbors among the Magians who would give him gifts during their new year celebration and festivals. Abu Barza would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَ مِنْ فَاكِهَةٍ فَكُلُوهُ وَمَا كَانَ مِنْ غَيْرِ ذَلِكَ فَرُدُّوهُ<\/p>\n<p>Whatever they give you of fruits, then eat it. Whatever they give you besides that, then return it.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 23773<\/p><\/blockquote>\n<p>Ibn Taymiyyah comments on these traditions, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فهذا كله يدل على أنه لا تأثير للعيد في المنع من قبول هديتهم بل حكمها في العيد وغيره سواء لأنه ليس في ذلك إعانة لهم على شعائر كفرهم<\/p>\n<p>These narrations demonstrate that non-Muslim festivals do not prevent Muslims from accepting their gifts. Rather, the rule during the festival is the same as other times since it does not involve support for their rituals of unbelief.<\/p>\n<p>Source: Iqtiḍāʼ al-Ṣirāṭ al-Mustaqīm 250<\/p><\/blockquote>\n<p>Furthermore, the Prophet encouraged the Muslims to be kind and gentle in all matters. Kindness is one of the best ways to be a good example of a devout Muslim and to open people’s hearts towards Islam. In contrast, unwarranted harshness makes matters ugly and pushes people away from Islam.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الرِّفْقَ لَا يَكُونُ فِي شَيْءٍ إِلَّا زَانَهُ وَلَا يُنْزَعُ مِنْ شَيْءٍ إِلَّا شَانَهُ<\/p>\n<p><strong>Verily, kindness is not found in anything except that it beautifies it, and it is not removed from anything except that it disgraces it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2594, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/03\/03\/hadith-on-kindness-gentleness-is-beautiful-and-harshness-is-disgraceful\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَكُونُ الْخُرْقُ فِي شَيْءٍ إِلا شَانَهُ وَإِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ<\/p>\n<p><strong>Harshness is not found in anything except that it disgraces it. Verily, Allah is kind and He loves kindness.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 462, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/07\/08\/harshness-is-disgraceful-for-allah-loves-gentleness\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Based upon all this, modern scholars encourage Muslims to be kind to non-Muslims during their festivals and to express good wishes for them on the condition that we do not support any specific religious ritual or doctrine that is idolatrous.<\/p>\n<p>Dar al-Ifta al-Misriyyah, the Egyptian institution that issues learned religious judgments (<em>fatwa<\/em>), concluded their investigation of this issue by stating the following:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومما ذكر من الآيات الكريمة والأحاديث النبوية الشريفة وآراء الفقهاء نرى أنه من الإحسان أن يصل المسلم غير المسلم على كل حال من عيادة وتعزية وتهنئة وإهداء وضيافة وقبول هدية وما إلى ذلك وأن هذا الشأن أحد أشكال الدعوة إلى دين الله بحسن الأخلاق ومكارم الخصال والله تعالى أعلى وأعلم<\/p>\n<p>As for what we have mentioned of noble verses, prophetic traditions, and opinions of the jurists, our view is that it is a matter of benevolence (<em>ihsan<\/em>) that a Muslim maintain good relations with non-Muslims in every circumstance including festivals, condolences, congratulations, giving gifts, hospitality, and accepting gifts. What is more, this is one of the ways to invite them to the religion of Allah by good character and noble manners. And Allah the Exalted knows best.<\/p>\n<p>Source: <a href=\"http:\/\/dar-alifta.org\/ar\/ViewFatwa.aspx?ID=7029&amp;LangID=1\">Dar al-Ifta al-Misriyyah<\/a><\/p><\/blockquote>\n<p>In conclusion, Muslims are permitted to offer kind words and good wishes to non-Muslims during their festivals with the only restriction being that we should not endorse specific acts in their religion that contradict Islam. We are called to be witnesses to the truth of our religion, while at the same time being kind, compassionate, and having good relations with all other people.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Harshness is not found in anything except that it disgraces it.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[61,16,18,165,262,319,49,37,39,100,54,55,93,56,126,115,103,98],"class_list":["post-17452","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-call-to-islam-dawah","tag-character-akhlaq","tag-community-jamaah","tag-consensus-al-ijma","tag-death-mawt","tag-funerals-janazah","tag-gentleness-al-rifq","tag-idolatry-shirk","tag-imam-ahmad-ibn-hanbal","tag-manners-al-adab","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-neighbors","tag-people-of-the-book","tag-public-welfare-al-maslaha","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4xu","jetpack-related-posts":[{"id":13436,"url":"https:\/\/www.abuaminaelias.com\/islam-good-neighborliness-to-all\/","url_meta":{"origin":17452,"position":0},"title":"Islam is good neighborliness to everyone","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"...until he loves for his brother or his neighbor what he loves for himself.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20801,"url":"https:\/\/www.abuaminaelias.com\/islamic-teachings-non-muslims-too\/","url_meta":{"origin":17452,"position":1},"title":"Islamic teachings apply to non-Muslims too","author":"Abu Amina Elias","date":"August 20, 2019","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17207,"url":"https:\/\/www.abuaminaelias.com\/equality-under-law-non-muslims\/","url_meta":{"origin":17452,"position":2},"title":"Equal protection of law for Muslims and non-Muslims","author":"Abu Amina Elias","date":"October 20, 2015","format":false,"excerpt":"\"Islam guarantees the protection of civil law for all citizens and visitors,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13188,"url":"https:\/\/www.abuaminaelias.com\/muslims-hate-infidels-neighbors\/","url_meta":{"origin":17452,"position":3},"title":"Are Muslims supposed to hate the infidels?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":17452,"position":4},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17741,"url":"https:\/\/www.abuaminaelias.com\/force-non-muslims-to-the-side-of-the-road\/","url_meta":{"origin":17452,"position":5},"title":"Force Non-Muslims to the Side of the Road?","author":"Abu Amina Elias","date":"February 15, 2016","format":false,"excerpt":"\"We have been prohibited from harming them without a just cause.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17452","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17452"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17452\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17452"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}