{"id":17536,"date":"2016-01-02T21:50:55","date_gmt":"2016-01-02T17:50:55","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17536"},"modified":"2018-03-25T16:16:14","modified_gmt":"2018-03-25T12:16:14","slug":"moderation-and-balance-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/moderation-and-balance-in-islam\/","title":{"rendered":"Moderation and balance in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam teaches us to be moderate and balanced in all aspects of life, whether it is religion, worship, relationships, ideas, or daily activities. Principled moderation is one of the defining characteristics of good character in Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَذَٰلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِّتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا<\/p>\n<p><strong>Thus, We have made you a justly balanced community that you will be witnesses over the people and the Messenger will be a witness over you.<\/strong><\/p>\n<p>Surat Al-Baqarah 2:143<\/p><\/blockquote>\n<p>Ar-Razi comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ الْوَسَطَ حَقِيقَةٌ فِي الْبُعْدِ عَنِ الطَّرَفَيْنِ وَلَا شَكَّ أَنَّ طَرَفَيِ الْإِفْرَاطِ وَالتَّفْرِيطِ رَدِيئَانِ فَالْمُتَوَسِّطُ فِي الْأَخْلَاقِ يَكُونُ بَعِيدًا عَنِ الطَّرَفَيْنِ فَكَانَ مُعْتَدِلًا فَاضِلًا<\/p>\n<p>The justly balanced (<em>wasat<\/em>) in reality is the furthest point between two extremes. There is no doubt that the two poles of excess and extravagance are destructive, so to be moderate in character is to be furthest from them, which is to be just and virtuous.<\/p>\n<p>Source: al-Tafsīr al-Kabīr 2:143<\/p><\/blockquote>\n<p>Moderation is the center point between two extremes. Every one of our virtues sits at the moderate center of two vices that stray from it. Our goal should be to find that center and always return back to it when we move away from it.<\/p>\n<p>Ibn Manẓūr writes in his classical Arabic dictionary:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ خَصْلَةٍ مَحْمُودَةٍ فَلَهَا طَرَفَانِ مَذْمُومَانِ فَإِنَّ السَّخَاءَ وَسَطٌ بَيْنِ الْبُخْلِ وَالتَّبْذِيرِ وَالشَّجَاعَةَ وَسَطٌ بَيْنِ الْجُبْنِ وَالتَّهَوُّرِ وَالْإِنْسَانُ مَأْمُورٌ أَنْ يَتَجَنَّبَ كُلَّ وَصْفٍ مَذْمُومٍ<\/p>\n<p>Every praiseworthy characteristic has two blameworthy poles. Generosity is the middle between miserliness and extravagance. Courage is the middle between cowardice and recklessness. Humanity has been commanded to avoid every such blameworthy trait.<\/p>\n<p>Source: Lisan al-Arab 15\/209<\/p><\/blockquote>\n<p>Moderation is closely related to balance (<em>tawazun<\/em>) and justice (<em>‘adl<\/em>), as justice implies balancing rights and duties and setting everything in its rightful place. The moderate, just, and correct action in any given situation often involves the balancing a various concerns and seeking the middle ground between them.<\/p>\n<p>Wahb ibn Munnabih, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِكُلِّ شَيْءٍ طَرَفَيْنِ وَوَسَطًا فَإِذَا أَمْسَكْتَ بِأَحَدِ الطَّرَفَيْنِ مَالَ الآخَرُ وَإِذَا أَمْسَكْتَ بِالْوَسَطِ اعْتَدَلَ الطَّرَفَانِ ثُمَّ قَالَ عَلَيْكُمْ بِالأَوْسَطِ مِنَ الأَشْيَاءِ<\/p>\n<p>Verily, everything has two ends and a middle. If you hold one of the ends, the other will be skewed. If you hold the middle, the two ends will be balanced. You must seek the middle ground in all things.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/12\/28\/wahb-on-moderation-everything-has-a-balance-so-seek-the-middle-ground\/\">Hilyat Al-Awliya 4818<\/a><\/p><\/blockquote>\n<p>This understanding of moderation is alluded to in our concept of the straight path to Allah in Islam. The straight path is the one that traverses the middle ground, neither swerving right nor left.<\/p>\n<p>Hudhaifa, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا مَعْشَرَ الْقُرَّاءِ اسْتَقِيمُوا فَقَدْ سُبِقْتُمْ سَبْقًا بَعِيدًا فَإِنْ أَخَذْتُمْ يَمِينًا وَشِمَالاً لَقَدْ ضَلَلْتُمْ ضَلاَلاً بَعِيدًا<\/p>\n<p>O people, remain straight upon the path and you will have taken a great lead, but if you swerve right or left then you will be led far astray.<\/p>\n<p>Source: Sahih Bukhari 6853, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/10\/29\/hadith-on-islamic-moderation-wasitiyyah-the-straight-path-does-not-swerve-right-or-left\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In fact, it is Satan who sets up his partners along the straight path to call people away from it. The devils intend to mislead humanity into the extremes of any direction as long as it is away from the straight and middle path.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, drew a line with his hand and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا سَبِيلُ اللَّهِ مُسْتَقِيمًا<\/p>\n<p><strong>This is the straight path of Allah.<\/strong><\/p><\/blockquote>\n<p>Then the Prophet drew lines to the right and left and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذِهِ السُّبُلُ وَلَيْسَ مِنْهَا سَبِيلٌ إِلَّا عَلَيْهِ شَيْطَانٌ يَدْعُو إِلَيْهِ<\/p>\n<p><strong>These are other paths and there is not a path among them but that a devil is upon it calling to its way.<\/strong><\/p><\/blockquote>\n<p>Then the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ<\/p>\n<p><strong>Verily, this is the straight path, so follow it and do not follow other paths. <\/strong>(6:153)<\/p>\n<p>Source: Musnad Ahmad 4423, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/10\/hadith-on-islam-this-is-the-straight-path-to-allah-so-do-not-follow-the-other-paths-to-which-devils-are-calling\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As such, the principle of moderation should be pervasive in our thought processes and at the forefront of our reasoning in daily life.<\/p>\n<p>We should be moderate when it comes to balancing the duties of religion and the duties of worldly life.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَابْتَغِ فِيمَا آتَاكَ اللَّهُ الدَّارَ الْآخِرَةَ ۖ وَلَا تَنسَ نَصِيبَكَ مِنَ الدُّنْيَا<\/p>\n<p><strong>Seek the home of the Hereafter by that which Allah has given you, but do not forget your share of the world.<\/strong><\/p>\n<p>Surat Al-Qasas 28:77<\/p><\/blockquote>\n<p>Some of the companions complained to the Prophet about the mixed feelings they experienced. When they were in the study circle of the Prophet, their awareness of the Hereafter and its realities would be at its peak, while when they returned to family and work their lives would carry on as usual. The Prophet told them that this was normal and that a Muslim ought to devote time to the Hereafter as well as worldly life.<\/p>\n<p>Hanzalah Al-Usayyidi reported: I said, “O Messenger of Allah, when we are in your presence and are reminded of Hellfire and Paradise, we feel as if we are seeing them with our very eyes, but when we leave you and attend to our wives, our children, and our business, most of these things slip from our minds.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ إِنْ لَوْ تَدُومُونَ عَلَى مَا تَكُونُونَ عِنْدِي وَفِي الذِّكْرِ لَصَافَحَتْكُمْ الْمَلَائِكَةُ عَلَى فُرُشِكُمْ وَفِي طُرُقِكُمْ وَلَكِنْ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً<\/p>\n<p><strong>By Him in whose hand is my soul, if your state of mind remains the same as it is in my presence and you are always occupied with the remembrance of Allah, the angels will shake your hands in your beds and roads. O Hanzalah, rather time should be devoted to this and time should be devoted to that.<\/strong><\/p>\n<p>Source: Sahih Muslim 2750, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/01\/hadith-on-moderation-time-should-be-devoted-to-worldly-affairs-and-the-hereafter-without-neglecting-either-of-them\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As part of this, we should be moderate in our acts of worship such as prayer, fasting, and even charity. For example, our prayers should be recited in a moderate voice, neither too loud nor too soft.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا<\/p>\n<p><strong>Do not recite too loudly in your prayer nor to softly, but seek a way between them.<\/strong><\/p>\n<p>Surat Al-Isra 17:110<\/p><\/blockquote>\n<p>Abu Musa reported: We were with the Prophet, peace and blessings be upon him, during a journey when the people began to exalt Allah loudly. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ فَإِنَّكُمْ لَا تَدْعُونَ أَصَمَّ وَلَا غَائِبًا وَلَكِنْ تَدْعُونَ سَمِيعًا بَصِيرًا<\/p>\n<p><strong>O people, be gentle with yourselves for you are not calling upon one who is deaf or absent. Rather, you are calling upon the Hearing, the Seeing.<\/strong><\/p>\n<p>Source: Sahih Bukhari 3910, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/02\/01\/hadith-on-supplications-do-not-supplicate-so-loudly-for-allah-is-hearing-and-seeing\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet set the example in his leadership of the prayer and Friday sermon. He would lead the pray and deliver a sermon that were long enough for the people to absorb a meaningful lesson or reminder, but not so long that it would case boredom or distress.<\/p>\n<p>Jabir ibn Samurah reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ أُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا<\/p>\n<p>I was praying with the Messenger of Allah, peace and blessings be upon him, and his prayer was of moderate length and his sermon was of moderate length.<\/p>\n<p>Source: Sahih Muslim 866, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/05\/hadith-on-moderation-the-prophets-prayer-and-sermon-were-of-moderate-length-not-too-long-or-too-short\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Regarding voluntary acts of worship, the Prophet encouraged his companions on many occasions to limit their extra worship so that they could take care of their duties to their families as well as maintain their health.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said to me, “O Abdullah, I am told you fast all day and pray all night.” I said, “Of course, O Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا تَفْعَلْ صُمْ وَأَفْطِرْ وَقُمْ وَنَمْ فَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا وَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا<\/p>\n<p><strong>Do not do so. Fast and break your fast, pray in the night and sleep. Verily, your body has a right over you, your eyes have a right over you, and your wife has a right over you.<\/strong><\/p>\n<p>Source: Sahih Bukhari 4903, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/01\/02\/hadith-on-moderation-do-not-worship-to-the-neglect-of-your-body-and-family\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Salman Al-Farisi, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِرَبِّكَ عَلَيْكَ حَقًّا وَلِنَفْسِكَ عَلَيْكَ حَقًّا وَلِأَهْلِكَ عَلَيْكَ حَقًّا فَأَعْطِ كُلَّ ذِي حَقٍّ حَقَّهُ<\/p>\n<p>You have a duty to your Lord, you have a duty to your body, and you have a duty to your family, so you should give each one its rights.<\/p>\n<p>Source: Sahih Bukhari 1867, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/05\/hadith-on-duties-muslims-have-a-duty-to-allah-to-themselves-and-to-their-families-so-give-everyone-their-rights\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>We should be moderate in our charity for much the same reason. We ought to spend enough to help others in need, while still retaining enough to take care of our families and ourselves.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ إِذَا أَنفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا<\/p>\n<p><strong>They are those who, when they spend, are neither extravagant nor miserly, but follow a middle way between them.<\/strong><\/p>\n<p>Surat Al-Furqan 25:67<\/p><\/blockquote>\n<p>We should be moderate in our mannerisms with others, carrying ourselves with tranquility and dignity rather than flamboyance or melancholy.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاقْصِدْ فِي مَشْيِكَ وَاغْضُضْ مِن صَوْتِكَ ۚ إِنَّ أَنكَرَ الْأَصْوَاتِ لَصَوْتُ الْحَمِيرِ<\/p>\n<p><strong>Be moderate in your pace and lower your voice. Verily, the most disagreeable of sounds is the voice of a donkey.<\/strong><\/p>\n<p>Surat Luqman 31:19<\/p><\/blockquote>\n<p>As-Suyuti comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">توسط فيه بين الدبيب والإِسراع وعليك السكينة والوقار<\/p>\n<p>It is a moderate pace between crawling and running, and you must have tranquility and dignity.<\/p>\n<p>Source: Tafsīr al-Jalālayn 31:19<\/p><\/blockquote>\n<p>Finally, we should be moderate in our relationships with others. This includes not only all of the virtues we mentioned that lie between extremes, but also to keep our feelings and emotions in check. We should love for people what we love for ourselves, but not as infatuation that we endorse their sins. And we should hate the sins and evil deeds people commit, but not as malice that we want to harm them.<\/p>\n<p>Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَكُنْ حُبُّكَ كَلَفًا وَلا بُغْضُكَ تَلَفًا<\/p>\n<p>Let not your love be infatuation and let not your hatred be destruction.<\/p><\/blockquote>\n<p>It was said, “How is this?” Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَحْبَبْتَ كَلِفْتَ كَلَفَ الصَّبِيِّ وَإِذَا أَبْغَضْتَ أَحْبَبْتَ لِصَاحِبِكَ التَّلَفَ<\/p>\n<p>When you love someone, you become infatuated like a child. When you hate someone, you love destruction for your companion.<\/p>\n<p>Source: Al-Adab Al-Mufrad 1322, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/03\/umar-on-moderation-let-not-your-love-be-infatuation-and-let-not-your-hatred-be-destruction\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>We need to be moderate particularly when dealing with non-Muslims. Some Muslims go to extremes either in imitating the bad behaviors of non-Muslims, or rejecting their culture and companionship completely. Rather, we ought to have a balanced relationship with them in which we bear witness to our religion with good character.<\/p>\n<p>Ibn Hibban said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا تَغْلَوْا فِي مُقَارَبَتِهِمْ وَلَا تُسْرِفُوا فِي مُبَاعَدَتِهِمْ<\/p>\n<p>Do not exaggerate in seeking nearness to them, nor be excessive in seeking distance from them.<\/p>\n<p>Source: Tafsīr al-Māwardī 60:8<\/p><\/blockquote>\n<p>Moderation and balance are also the characteristics of great leadership. Mu&#8217;awiyah ibn Abi Sufyan was one of the early Caliphs and an accomplished leader who tried to balance the rights and duties of himself with his people. He likened this to a delicate strand of hair that him and his people each held and constantly adjusted, making sure it is was not too loose to become limp and not too tight that it breaks.<\/p>\n<p>Mu’awiyah, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ بَيْنِي وَبَيْنَ النَّاسِ شَعْرَةٌ مَا انْقَطَعَتْ<\/p>\n<p>It is as if there is strand of hair between the people and myself for me to keep straight without breaking it.<\/p><\/blockquote>\n<p>It was said, “How is that?” Mu’awiyah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لأَنَّهُمْ إِنْ مَدُّوهَا خَلَّيْتُهَا وَإِنْ خَلَّوْهَا<\/p>\n<p>When they loosen it, I will tighten it. When they tighten it, I will loosen it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/17\/muawiyah-on-balance-good-leadership-involves-balance-between-the-ruler-and-the-people\/\">Rawḍat al-ʻUqalāʼ 40<\/a><\/p><\/blockquote>\n<p>If the people go to an extreme, the leaders have a duty is to reign them in. And if the leaders go to an extreme, the people have a duty to reign them in. A system of checks and balances between various sections of society and government can help prevent extremism and the oppression that arises from it.<\/p>\n<p>To conclude, moderation is a comprehensive principle in Islam that guides a Muslim in all activities of his or her daily life. It is the avoidance of any type of extremism pleasing to Satan that leads us astray from the straight path. With a renewed understanding of this Islamic teaching, Muslims can help counter the many rising tides of extremism that threaten not only the Muslim community, but all humanity.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The justly balanced is the furthest point between two extremes.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[16,18,169,24,85,123,30,32,34,48,52,100,53,93,115,60,45,68,73,179,332],"class_list":["post-17536","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-character-akhlaq","tag-community-jamaah","tag-ease-yusr","tag-family-ties-sillat-rahim","tag-fasting-al-siyam","tag-friday-prayer-salat-jumuah","tag-hatred-bigdah","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-justice-adl","tag-love-al-mahabbah","tag-manners-al-adab","tag-marriage-al-nikah","tag-moderation-al-wasitiyyah","tag-people-of-the-book","tag-prayer-salat","tag-quran-exegesis-tafsir","tag-satan-al-shaytan","tag-umar-ibn-al-khattab","tag-virtue-al-fadilah","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4yQ","jetpack-related-posts":[{"id":13490,"url":"https:\/\/www.abuaminaelias.com\/did-the-prophet-burn-down-peoples-houses-for-missing-the-prayer\/","url_meta":{"origin":17536,"position":0},"title":"Burn their houses for missing prayer?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not punish with the punishment of Allah the Exalted.\" --Musnad Ahmad 1904","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15973,"url":"https:\/\/www.abuaminaelias.com\/jihad-sixth-pillar-of-islam\/","url_meta":{"origin":17536,"position":1},"title":"Jihad is the sixth pillar of Islam?","author":"Abu Amina Elias","date":"August 2, 2014","format":false,"excerpt":"\"Islam is built upon five pillars...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13448,"url":"https:\/\/www.abuaminaelias.com\/islam-is-a-peace-offering-to-the-world\/","url_meta":{"origin":17536,"position":2},"title":"Islam is a peace offering to the world","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Worship the Most Merciful and spread peace.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":17536,"position":3},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15265,"url":"https:\/\/www.abuaminaelias.com\/lessons-from-the-journey-of-muadh-ibn-jabal-to-yemen\/","url_meta":{"origin":17536,"position":4},"title":"Lessons from the journey of Mu’adh ibn Jabal to Yemen","author":"Abu Amina Elias","date":"January 22, 2014","format":false,"excerpt":"\"Make your character excellent for the people, O Mu’adh ibn Jabal.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13282,"url":"https:\/\/www.abuaminaelias.com\/islam-and-torture\/","url_meta":{"origin":17536,"position":5},"title":"Is torture allowed in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, Allah will torture those who torture people in this world.\" --Sahih Muslim 2613","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17536","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17536"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17536\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17536"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17536"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17536"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}