{"id":17719,"date":"2016-02-13T11:06:45","date_gmt":"2016-02-13T07:06:45","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17719"},"modified":"2021-06-01T15:47:28","modified_gmt":"2021-06-01T11:47:28","slug":"good-character-salvation","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/good-character-salvation\/","title":{"rendered":"Good character, the path to salvation in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Good character, morals, ethics, and manners are fundamental to the religion of Islam and the means by which we can achieve salvation in the life to come. Good character is a major theme in the teachings of the Quran and the traditions of the Prophet. True righteousness is defined by it and the best Muslims are those who practice it. The believers with the most complete faith, who are most beloved by Allah and His Messenger, are those with the best character.<\/p>\n<p>Allah praised the Prophet’s character and set him as the example for all believers to follow<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ<\/p>\n<p><strong>Verily, you are upon great moral character.<\/strong><\/p>\n<p>Surat al-Qalam 68:4<\/p><\/blockquote>\n<p>The commentators say the “great moral character” mentioned in this verse is the Quran, the Prophet, and the religion of Islam itself.<\/p>\n<p>Ibn Kathir comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَعْنَى هَذَا أَنَّهُ عَلَيْهِ السَّلَامُ صَارَ امْتِثَالُ الْقُرْآنِ أَمْرًا وَنَهْيًا سَجِيَّةً لَهُ وَخُلُقًا تَطَبَّعَهُ وَتَرَكَ طَبْعَهُ الْجِبِلِّيَّ فَمَهْمَا أَمَرَهُ الْقُرْآنُ فَعَلَهُ وَمَهْمَا نَهَاهُ عَنْهُ تَرَكَهُ هَذَا مَعَ مَا جَبَلَهُ اللَّهُ عَلَيْهِ مِنَ الْخُلُقِ الْعَظِيمِ مِنَ الْحَيَاءِ وَالْكَرَمِ وَالشَّجَاعَةِ وَالصَّفْحِ وَالْحِلْمِ وَكُلِّ خُلُقٍ جَمِيلٍ<\/p>\n<p>The meaning of this verse is that the Prophet would emulate the Quran in its commands, its prohibitions, and it became his temperament. His character became accustomed to it and he abandoned his visceral carnal nature. Whatever the Quran commanded he did, and whatever it prohibited he abstained. Along with this, Allah ingrained within him great character traits of modesty, generosity, courage, forgiveness, forbearance, and every beautiful trait.<\/p>\n<p>Source: Tafsīr ibn Kathīr 68:4<\/p><\/blockquote>\n<p>The primary mission of the Prophet was to instill good character within the believers in every aspect of their lives.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا بُعِثْتُ لِأُتَمِّمَ صَالِحَ الْأَخْلَاقِ<\/p>\n<p><strong>Verily, I have only been sent to perfect righteous character.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 8729, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/02\/hadith-on-character-the-prophet-was-sent-only-to-teach-righteousness-to-the-believers\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بُعِثْتُ لِأُتَمِّمَ حُسْنَ الْأَخْلَاقِ<\/p>\n<p><strong>I have been sent to perfect good character.<\/strong><\/p>\n<p>Source: al-Muwaṭṭa 1614, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/01\/the-prophet-was-sent-to-perfect-good-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ بَعَثَنِي بِتَمَامِ مكارمِ الأَخْلاقِ وَكَمَالِ مَحَاسِنِ الأَفْعَالِ<\/p>\n<p><strong>Verily, Allah has sent me to perfect noble morals and complete good deeds.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 7073, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/02\/12\/hadith-on-morals-allah-sent-muhammad-to-perfect-good-character-and-ethics\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ad-Dahhak, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّيِّدُ الْحَسَنُ الْخُلُقِ<\/p>\n<p>The head of the matter is good character.<\/p>\n<p>Source: Makārim al-Akhlāq lil-Kharā’iṭī 524<\/p><\/blockquote>\n<p>With respect to Allah, good character means adhering to the sound creed (<em>aqeedah<\/em>) and performing acts of worship (<em>ibadah<\/em>). With respect to people, good character means being just, merciful, forgiving, kind, and patient in our interactions with others (<em>mu’amalat<\/em>).<\/p>\n<p>This comprehensive view of good character colored the Prophet’s preaching in Mecca and throughout his life. The companions would recall how good character was one of the first Islamic teachings they had ever heard.<\/p>\n<p>Ibn Abbas reported: When Abu Dharr heard that the Prophet, peace and blessings be upon him, had appeared in Mecca, he said to his brother, “Ride to this valley and tell me about this man who claims to have received revelation from the heavens. Listen to his words and then inform me.” The man rode along until he arrived in Mecca and he listened to the Prophet, then he returned to Abu Dharr and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأَيْتُهُ يَأْمُرُ بِمَكَارِمِ الْأَخْلَاقِ وَكَلَامًا مَا هُوَ بِالشِّعْرِ<\/p>\n<p>I have seen him order noble morals, and his speech is not that of a poet.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2474, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/02\/12\/hadith-on-character-what-does-the-prophet-teach-to-the-people\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Since good character is so important, behaving in a morally upright manner is a religious obligation. The Prophet commanded Muslims to behave well in every circumstance and with every human being, not simply to those who are close to us.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ<\/p>\n<p><strong>Behave with good character toward the people.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1987, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/17\/hadith-on-character-fear-allah-wherever-you-are-behave-with-good-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Fudail ibn Iyad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا خَالَطْتَ فَخَالِطْ حَسَنَ الْخُلُقِ فَإِنَّهُ لا يَدْعُو إِلا إِلَى خَيْرٍ وَلا تُخَالِطْ سَيِّئَ الْخُلُقِ فَإِنَّهُ لا يَدْعُو إِلا إِلَى شَرٍّ<\/p>\n<p>If you mix with people, then mix with good character for it only invites to good. Do not mix with bad character, for it only invites to evil.<\/p>\n<p>Source: Hilyat al-Awliyā 11728<\/p><\/blockquote>\n<p>Good character is not merely recommended or secondary to issues of doctrine. Rather, good character, morals, ethics, and manners are the spirit that breathes life into our doctrines. It is the very essence of righteousness spoken about all throughout the Quran. It is accessible to our innate rational nature, as Allah has bestowed upon all of us the power to recognize righteousness and sin even without the aid of revelation.<\/p>\n<p>An-Nawwas ibn Sam’an reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ<\/p>\n<p><strong>Righteousness is good character and sin is what waivers in your heart and you hate for people to find out about it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2553, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/09\/13\/righteousness-is-to-have-good-character-sin-is-known-by-human-nature\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ<\/p>\n<p><strong>Consult your soul, consult your heart. Righteousness is what reassures your soul and your heart, and sin is what wavers in your soul and puts tension in your chest, even if the people approve it in their judgments again and again.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 2533, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/25\/hadith-on-righteousness-consult-your-heart-about-righteousness-and-sin-even-if-the-people-give-you-a-judgment\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَبْلُغُ الْعَبْدُ حَقِيقَةَ التَّقْوَى حَتَّى يَدَعَ مَا حَاكَ فِي الصَّدْرِ<\/p>\n<p>The servant will not reach the reality of Godfearing piety (<em>taqwa<\/em>) until he leaves what wavers in his heart.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 8, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/30\/ibn-umar-on-piety-the-reality-of-righteousness-is-to-leave-what-waivers-in-the-heart\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Good character is the result of a pure heart that is free from spiritual diseases like envy, malice, and arrogance. A person with good character had integrity and is not overly attached to worldly things at the expense of righteousness.<\/p>\n<p>Abdullah ibn Amr reported: It was said to the Messenger of Allah, “Which of the people is best?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَخْمُومِ الْقَلْبِ صَدُوقِ اللِّسَانِ<\/p>\n<p><strong>Everyone who is pure of heart and truthful in speech.<\/strong><\/p><\/blockquote>\n<p>They said, “Truthful in speech we know, but what is a pure heart?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُوَ التَّقِيُّ النَّقِيُّ لَا إِثْمَ فِيهِ وَلَا بَغْيَ وَلَا غِلَّ وَلَا حَسَدَ<\/p>\n<p><strong>It is a heart that fears Allah and is clean. There is no sin in it and neither aggression, malice, nor envy.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4216, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/18\/hadith-on-purity-a-pure-heart-is-one-free-of-aggression-rancor-and-envy\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>In another narration, they said, “O Messenger of Allah, who shows a sign of it?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الَّذِي يَشْنَأُ الدُّنْيَا وَيُحِبُّ الآخِرَةَ<\/p>\n<p><strong>Those who dislike the world and love the Hereafter.<\/strong><\/p><\/blockquote>\n<p>They said, “And who shows a sign of it?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُؤْمِنٌ فِي خُلُقٍ حَسَنٍ<\/p>\n<p><strong>A believer with good character.<\/strong><\/p>\n<p>Source: Shu&#8217;b al-Imān 4457, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>From all this, many classical scholars understood that good character is essential and required in Islam, even equivalent to the religion itself.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدِّينُ كُلُّهُ خُلُقٌ فَمَنْ زَادَ عَلَيْكَ فِي الْخُلُقِ زَادَ عَلَيْكَ فِي الدِّينِ<\/p>\n<p>The religion itself is entirely good character, so whoever surpasses you in character has surpassed you in religion.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/07\/ibn-al-qayyim-whoever-surpasses-you-in-good-character-has-surpassed-you-in-religion-and-spirituality\/\">Madārij al-Sālikīn 2\/294<\/a><\/p><\/blockquote>\n<p>Ash-Shatibi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالشَّرِيعَةُ كُلُّهَا إِنَّمَا هِيَ تَخَلُّقٌ بمكارمِ الْأَخْلَاقِ<\/p>\n<p>The Sharia in its entirety only creates noble morals.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/01\/the-prophet-was-sent-to-perfect-good-character\/\">al-Muwāfaqāt 2\/124<\/a><\/p><\/blockquote>\n<p>The true measure of a good Muslim is how good are his or her character and manners, particularly in their relationships with their families. Men are specifically called upon to treat women in the best manner. The honor of a Muslim man is directly proportional to his behavior towards women.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خِيَارُكُمْ أَحَاسِنُكُمْ أَخْلَاقًا<\/p>\n<p><strong>The best of you are those with the best character.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3366, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/26\/hadith-on-character-the-prophet-preached-good-character-so-he-was-never-obscene\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَخِيَارُكُمْ خِيَارُكُمْ لِنِسَائِهِمْ خُلُقًا<\/p>\n<p><strong>The most complete of the believers in faith are those with the most excellent character, and the best of you are the best in behavior to their women.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1162, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/10\/hadith-on-women-the-best-of-you-are-the-best-in-character-to-their-women\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُكُمْ إِسْلَامًا أَحَاسِنُكُمْ أَخْلَاقًا إِذَا فَقُهُوا<\/p>\n<p><strong>The best of you in Islam are those with the best character, if they have understanding.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 9880, Grade:<em><strong> <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/11\/hadith-on-character-the-best-people-in-islam-have-the-best-character-if-they-understand\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">شِرَارُ أُمَّتِي الثَّرْثَارُونَ الْمُشَّدِّقُونَ الْمُتَفَيْهِقُونَ وَخِيَارُ أُمَّتِي أَحَاسِنُهُمْ أَخْلاقًا‏<\/p>\n<p><strong>The most evil in my nation are garrulous, braggarts, and pompous. The best of my nation are those with the best character.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 1308, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/04\/hadith-on-speech-the-worst-muslims-in-this-nation-are-those-who-talk-too-much-and-spread-idle-talk\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَكْمَلِ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَأَلْطَفُهُمْ بِأَهْلِهِ<\/p>\n<p><strong>Verily, the believers with the most complete faith are those with the most excellent character and who are most kind to their families.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2612, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/23\/faith-is-perfected-by-good-character-kindness-to-women-and-family-2\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn Samurah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْفُحْشَ وَالتَّفَحُّشَ لَيْسَا مِنْ الْإِسْلَامِ وَإِنَّ أَحْسَنَ النَّاسِ إِسْلَامًا أَحْسَنُهُمْ خُلُقًا<\/p>\n<p><strong>Verily, obscenity and immorality are not part of Islam. Verily, the best people in Islam are those with the best character.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 20320, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/03\/hadith-on-islam-the-best-muslims-are-those-with-the-best-character\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Ibn Umar reported: A man said, “O Messenger of Allah, which of the believers is best?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحْسَنُهُمْ خُلُقًا<\/p>\n<p><strong>Those with the best character<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 4259, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/13\/hadith-on-wisdom-the-best-believers-have-the-best-character-and-prepare-for-death-by-doing-good-works\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Good character is among the greatest of good deeds to be placed on the scale of a believer on the Day of Judgment, even more so than an abundance of voluntary acts of worship.<\/p>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا شَيْءٌ أَثْقَلُ فِي مِيزَانِ الْمُؤْمِنِ يَوْمَ الْقِيَامَةِ مِنْ خُلُقٍ حَسَنٍ وَإِنَّ اللَّهَ لَيُبْغِضُ الْفَاحِشَ الْبَذِيءَ<\/p>\n<p><strong>Nothing is heavier upon the scale of the believer on the Day of Resurrection than his good character. Verily, Allah hates the shameless, obscene person.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2002, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/31\/hadith-on-character-good-character-is-the-heaviest-on-the-scale-and-allah-hates-shameless-obscenity\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُؤْمِنَ لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ الصَّائِمِ الْقَائِمِ<\/p>\n<p><strong>Verily, the believer may reach through his good character the status of one who regularly fasts and prays at night.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4798, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/11\/21\/good-character-is-equal-to-many-ritual-acts-of-worship\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Usamah ibn Shareek reported: I witnessed the bedouins ask the Prophet, saying, “O Messenger of Allah, what is the best thing a servant may be given?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُلُقٌ حَسَنٌ<\/p>\n<p><strong>Good character.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3436, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/01\/11\/hadith-on-character-good-character-is-the-best-thing-to-be-given-to-people\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>The Prophet informed us that good character is the leading cause of people entering Paradise. On the contrary, character flaws involving bad speech and sexual immorality are the leading cause of people entering the Hellfire.<\/p>\n<p>Abu Huraira reported: The Prophet was asked, “What enters most people into Paradise?” The Messenger of Allah, peace and blessings be upon him said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَقْوَى اللَّهِ وَحُسْنُ الْخُلُقِ<\/p>\n<p><strong>Righteousness and good character.<\/strong><\/p><\/blockquote>\n<p>It was asked, “What enters most people into the Hellfire?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْفَمُ وَالْفَرْجُ<\/p>\n<p><strong>The mouth and the private parts.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2004, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/22\/hadith-on-character-the-reasons-people-go-to-either-paradise-or-hell\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Allah and His Messenger love those with good character. Those who cultivated good character and manners will be the closest to the Prophet and the righteous on the Day of Judgment, whereas those who indulged in bad manners will be the furthest from them.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِأَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحْسَنُكُمْ خُلُقًا<\/p>\n<p><strong>Shall I tell you about the most beloved to me and the closest to my assembly on the Day of Resurrection<\/strong>?<strong> Those with the best character<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 6696, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/02\/hadith-on-character-the-most-beloved-and-closest-to-the-prophet-are-those-with-the-best-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحَاسِنَكُمْ أَخْلَاقًا وَإِنَّ أَبْغَضَكُمْ إِلَيَّ وَأَبْعَدَكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ الثَّرْثَارُونَ وَالْمُتَشَدِّقُونَ وَالْمُتَفَيْهِقُونَ<\/p>\n<p><strong>Verily, the most beloved and nearest to my gathering on the Day of Resurrection are those of you with the best character. Verily, the most reprehensible of you to me and the furthest from my gathering on the Day of Resurrection will be the pompous, the extravagant, and the arrogant.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2018, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/30\/hadith-on-character-the-closest-to-the-prophet-will-be-those-with-the-best-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sahl ibn Sa’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ كَرِيمٌ يُحِبُّ الْكَرَمَ وَمَعَالِيَ الأَخْلاقِ وَيُبْغِضُ سَفْسَافَهَا<\/p>\n<p><b>Verily, Allah is generous and he loves generosity and exalted character, and he detests vanity<\/b>.<\/p>\n<p>Source: Sunan al-Kubrā 19134, Grade: <b><i><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/08\/hadith-on-generosity-allah-is-generous-and-he-loves-generosity-and-good-character\/\">Sahih<\/a><\/i><\/b><\/p><\/blockquote>\n<p>For all of these reasons, the Prophet would supplicate for good character and he encouraged us to ask Allah for good character as well.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي<\/p>\n<p><strong>O Allah, you have made my form excellent, so make my character excellent.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 23871, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/03\/hadith-on-character-the-prophet-would-supplicate-for-good-character\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِنِي لِأَحْسَنِ الْأَعْمَالِ وَأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ وَقِنِي سَيِّئَ الْأَعْمَالِ وَسَيِّئَ الْأَخْلَاقِ لَا يَقِي سَيِّئَهَا إِلَّا أَنْتَ<\/p>\n<p><strong>O Allah, guide me to the best deeds and the best character, for no one guides to the best of them but you. Protect me from evil deeds and evil character, for no one protects from the evil of them but you.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 896, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/04\/01\/hadith-on-prayer-o-allah-guide-me-to-the-most-righteous-deeds-and-character\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَنْعِشْنِي وَأَجِرْنِي وَاهْدِنِي لِصَالِحِ الأَعْمَالِ وَالأَخْلاقِ فَإِنَّهُ لا يَهْدِي لِصَالِحِهَا وَلا يَصْرِفُ عَنِّي سَيِّئَهَا إِلا أَنْتَ<\/p>\n<p><strong>O Allah, refresh me and protect me and guide me to righteous deeds and character, for none can guide to its righteousness and divert its evil but you.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 7812, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/07\/18\/hadith-on-character-the-prophet-supplicates-for-righteousness-after-every-prayer\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ وَالْعِفَّةَ وَالأَمَانَةَ وَحُسْنَ الْخُلُقِ وَالرِّضَا بِالْقَدَرِ‏<\/p>\n<p><strong>O Allah, I ask you for health, abstinence, trustworthiness, good character, and contentment with providence<\/strong>.<\/p>\n<p>Source: al-Adab al-Mufrad 307, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/13\/hadith-of-supplication-i-ask-allah-for-health-abstinence-trustworthiness-good-character-and-satisfaction-with-fate\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>The scholars have written many books and articles about the virtues of good character and their practical manifestations: acts of mercy, justice, fairness, patience, forbearance, modesty, humility, piety, kindness, compassion, and so forth. In each case, good character involves the respect due to Allah, as well as the respect due to human beings and animals as the creations of Allah.<\/p>\n<p>Hasan Al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَخْلاقِ الْمُؤْمِنِ قُوَّةً فِي الدِّينِ وَحَزْمًا فِي لِينٍ وَإِيمَانًا فِي يَقِينٍ وَحِرْصًا عَلَى عِلْمٍ وَشَفَقَةً فِي تَفَقُّهٍ وَقَصْدًا فِي عِبَادَةٍ وَرَحْمَةً لِلْمَجْهُودِ وَإِعْطَاءً لِلسَّائِلِ لا يَحِيفُ عَلَى مَنْ يُبْغِضُ وَلا يَأْثَمُ فِيمَنْ يُحِبُّ فِي الزَّلازِلِ وَقُورٌ وَفِي الرَّخَاءِ شَكُورٌ قَانِعٌ بِالَّذِي لَهُ يَنْطِقُ لِيُفْهِمَ وَيَسْكُتُ لِيَسْلَمَ وَيُقِرُّ بِالْحَقِّ أَنْ يُشْهَدُ عَلَيْهِ<\/p>\n<p>Verily, from the character of the believer is strength in religion, determination with leniency, faith with certainty, eagerness for knowledge, sympathy with understanding, moderation in worship, mercy with effort, giving to those who ask, not wronging the one he hates, not sinning over the one he loves, dignified in turmoil, grateful in ease, content with what he has, speaking to impart understanding, being silent out of caution, and affirming the truth as a witness over him.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/13\/hasan-on-character-a-concise-description-of-the-character-of-a-true-believer\/\">Jāmi’ Bayān al-‘Ilm 622<\/a><\/p><\/blockquote>\n<p>Ibn Taymiyyah summarizes the good character of Islam, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَنْدُبُونَ إِلَى أَنْ تَصِلَ مَنْ قَطَعَكَ وَتُعْطِيَ مَنْ حَرَمَكَ وَتَعْفُوَ عَمَّنْ ظَلَمَكَ‏‏ وَيَأْمُرُونَ بِبِرِّ الْوَالِدَيْنِ وَصِلَةِ الأَرْحَامِ وَحُسْنِ الْجِوَارِ وَالإِحْسِانِ إلَى الْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ وَالرِّفْقِ بِالْمَمْلُوكِ‏ وَيَنْهَوْنَ عَنِ الْفَخْرِ وَالْخُيَلاءِ وَالْبَغْيِ وَالاسْتِطَالَةِ عَلَى الْخَلْقِ بِحَقٍّ أَوْ بِغَيْرِ حَقٍّ وَيَأْمُرُونَ بِمَعَالِي الأَخْلاَقِ وَيَنْهَوْنَ عَنْ سَفْسَاِفِهَا‏‏ وَكُلُّ مَا يَقُولُونَهُ وَيَفْعَلُونَهُ مِنْ هَذَا وَغَيْرِهِ فَإِنَّمَا هُمْ فِيهِ مُتَّبِعُونَ لِلْكِتَابِ وَالسُّنَّةِ وَطَرِيقَتُهُمْ هِيَ دِينُ الإسْلاَمِ الَّذِي بَعَثَ اللهُ بِهِ مُحَمَّدًا صلى الله عليه وسلم<\/p>\n<p>The believers encourage people to reconcile relations with those who have cut them off, to give charity to those who have deprived them, and to forgive those who have oppressed them. They order people to be benevolent with parents, to uphold family ties, to be benevolent with neighbors, to be kind with orphans, travelers, and the poor, and to be gentle with servants. They forbid bragging, arrogance, and transgression. They discourage people from feeling superior over others, rightly or wrongly. They enjoin people to use lofty manners and prohibit them from pursuing trifles. All that they say or do from these virtues and other teachings, in all of it they follow the Quran and the Sunnah. Their path is the religion of Islam with which Allah has sent Muhammad, peace be blessings be upon him.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/07\/ibn-taymiyyah-reconcile-charity-good-character\/\">al-‘Aqīdah al-Wāsiṭīyah 1\/71<\/a><\/p><\/blockquote>\n<p>As Muslims, our duty is to behave well towards Allah by continuously seeking knowledge of the religion and performing acts of worship, while at the same time behaving well towards all people, upholding divine values of justice and mercy, and responding to evil with good.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;I have only been sent to perfect righteous character.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[14,61,16,17,183,85,25,26,114,49,32,48,100,54,292,58,60],"class_list":["post-17719","post","type-post","status-publish","format-standard","hentry","category-featured","tag-arrogance-al-takabbur","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-fasting-al-siyam","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-generosity-al-karam","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-modesty-al-haya","tag-patience-al-sabr","tag-prayer-salat"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4BN","jetpack-related-posts":[{"id":17977,"url":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","url_meta":{"origin":17719,"position":0},"title":"Good character before learning Islamic sciences","author":"Abu Amina Elias","date":"April 5, 2016","format":false,"excerpt":"\"What I learned from Malik's manners was better than his knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":17719,"position":1},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":17719,"position":2},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16223,"url":"https:\/\/www.abuaminaelias.com\/tolerance-with-people-in-islam\/","url_meta":{"origin":17719,"position":3},"title":"Tolerance with people in Islam","author":"Abu Amina Elias","date":"January 20, 2015","format":false,"excerpt":"\"Make things easy and do not make things difficult. Give glad tidings and do not repel people.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20434,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-good-character-akhlaq-adab\/","url_meta":{"origin":17719,"position":4},"title":"Imam al-Mundhiri on Good Character and Manners","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Best of you have the best character.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":17719,"position":5},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17719","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17719"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17719\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17719"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17719"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17719"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}