{"id":17935,"date":"2016-03-27T16:16:19","date_gmt":"2016-03-27T12:16:19","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17935"},"modified":"2023-02-20T10:18:42","modified_gmt":"2023-02-20T06:18:42","slug":"the-muslims-will-split-into-seventy-three-sects","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/the-muslims-will-split-into-seventy-three-sects\/","title":{"rendered":"Muslims will split into seventy three sects"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Sectarianism and partisanship are among the worst sins in Islam. The religion was revealed and bestowed upon humanity to provide principles for mutual respect, cooperation, and brotherhood between different tribes, countries, and nations. When we practice the religion as it should be, it will lead to greater unity within a diversity of people.<\/p>\n<p>On the contrary, when we mix the religion with selfish desires, worldly ambitions, and ignorance it will lead to disunity, sectarianism, and even violence. Allah has blamed those who use the religion as a means to divide people, as they have nothing to do with Islam and are on the verge of falling into idolatry.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا<\/p>\n<p><strong>Hold firmly to the rope of Allah all together and do not become divided.<\/strong><\/p>\n<p>Surat Ali Imran 3:103<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا لَّسْتَ مِنْهُمْ فِي شَيْءٍ ۚ إِنَّمَا أَمْرُهُمْ إِلَى اللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُوا يَفْعَلُونَ<\/p>\n<p><strong>Verily, those who have divided their religion and become sects, you have nothing to do with them. Their affair is only left to Allah, then He will inform them about what they used to do.<\/strong><\/p>\n<p>Surat al-An’am 6:159<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ وَأَقِيمُوا الصَّلَاةَ وَلَا تَكُونُوا مِنَ الْمُشْرِكِينَ مِنَ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا ۖ كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ<\/p>\n<p><strong>Turn in repentance, be mindful, and establish prayer. Do not be among those who commit idolatry, those who divided their religion and became sects, each party rejoicing in itself.<\/strong><\/p>\n<p>Surat Ar-Rum 30:31-32<\/p><\/blockquote>\n<p>We know from the history of other religions besides Islam that splitting into sects is catastrophe. The Muslims will split in the same way, except for those who adhere to the spiritual path of the Prophet, the companions, and the righteous predecessors.<\/p>\n<p>Ibn Kathir comments on these verses, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَهْلُ الْأَدْيَانِ قَبْلَنَا اخْتَلَفُوا فِيمَا بَيْنَهُمْ عَلَى آرَاءٍ وَمِلَلٍ بَاطِلَةٍ وَكُلُّ فُرْقَةٍ مِنْهُمْ تَزْعُمُ أَنَّهُمْ عَلَى شَيْءٍ وَهَذِهِ الْأُمَّةُ أَيْضًا اخْتَلَفُوا فِيمَا بَيْنَهُمْ عَلَى نَحِلٍ كُلُّهَا ضَلَالَةٌ إِلَّا وَاحِدَةً وَهُمْ أَهْلُ السُّنَّةِ وَالْجَمَاعَةِ الْمُتَمَسِّكُونَ بِكِتَابِ اللَّهِ وَسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِمَا كَانَ عَلَيْهِ الصَّدْرُ الْأَوَّلُ مِنَ الصَّحَابَةِ وَالتَّابِعَيْنِ وَأَئِمَّةُ الْمُسْلِمِينَ فِي قَدِيمِ الدَّهْرِ وَحَدِيثِهِ<\/p>\n<p>The followers of other religions before us differed in their opinions and false sects. Each faction among them imagined they were onto something. This nation will also differ due to false ascriptions and each sect is misguided except for one. They are the people of the prophetic tradition and united community (<em>Ahlu Sunnah wal Jama’ah<\/em>), those who hold fast to the book of Allah and the tradition of the Messenger of Allah, peace and blessings be upon him, and what was left by the first generation of companions, their followers, and the leaders of the Muslims in the early and latter times.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 30:31<\/p><\/blockquote>\n<p>The Prophet informed us that the Muslims would split into even more sects than previous nations.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَفَرَّقَتْ الْيَهُودُ عَلَى إِحْدَى وَسَبْعِينَ أَوْ اثْنَتَيْنِ وَسَبْعِينَ فِرْقَةً وَالنَّصَارَى مِثْلَ ذَلِكَ وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلَاثٍ وَسَبْعِينَ فِرْقَةً<\/p>\n<p><strong>The Jews were split into seventy one or seventy two sects, and the Christians were split as well. My nation will split into seventy three sects.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2640, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/27\/hadith-on-sects-the-muslims-will-split-into-seventy-three-sects\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Afw ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">افْتَرَقَتْ الْيَهُودُ عَلَى إِحْدَى وَسَبْعِينَ فِرْقَةً فَوَاحِدَةٌ فِي الْجَنَّةِ وَسَبْعُونَ فِي النَّارِ وَافْتَرَقَتْ النَّصَارَى عَلَى ثِنْتَيْنِ وَسَبْعِينَ فِرْقَةً فَإِحْدَى وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَتَفْتَرِقَنَّ أُمَّتِي عَلَى ثَلَاثٍ وَسَبْعِينَ فِرْقَةً وَاحِدَةٌ فِي الْجَنَّةِ وَثِنْتَانِ وَسَبْعُونَ فِي النَّارِ<\/p>\n<p><strong>The Jews were split into seventy one sects and one of them is in Paradise and seventy are in the Hellfire. The Christians were split into seventy two sects and seventy one are in the Hellfire and one of them is in Paradise. By the one in whose hand is the soul of Muhammad, my nation will split into seventy three sects and one of them is in Paradise and seventy two are in the Hellfire.<\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, who are the ones in Paradise?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْجَمَاعَةُ<\/p>\n<p><strong>They are the united community<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 3992, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/12\/14\/hadith-on-community-the-muslim-nation-will-split-into-sects-all-in-hellfire-except-the-true-community\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَنَا عَلَيْهِ وَأَصْحَابِي<\/p>\n<p><strong>They are those who follow my way and my companions.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2641, Grade: <em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/27\/hadith-on-sects-the-muslims-will-split-into-sects-due-to-their-infectious-desires\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>The “united community” (<em>al-jama’ah<\/em>) are those who follow the prophetic traditions (<em>hadith<\/em>) as well as understanding the principles of law (<em>fiqh<\/em>) and the other relevant Islamic sciences.<\/p>\n<p>At-Tirmidhi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَفْسِيرُ الْجَمَاعَةِ عِنْدَ أَهْلِ الْعِلْمِ هُمْ أَهْلُ الْفِقْهِ وَالْعِلْمِ وَالْحَدِيثِ<\/p>\n<p>The meaning of the united community according to the scholars are the people of jurisprudence, knowledge, and prophetic traditions.<\/p>\n<p>Source: Sunan al-Tirmidhī 2167<\/p><\/blockquote>\n<p>In other words, the united community follows the inherited legacy of the Prophet, his companions, and the righteous scholars. They act upon the wisdom of the prophetic traditions, while understanding them in light of the jurisprudential method and principles derived by the scholars. When appropriate, they apply the values, principles, and their moral reasoning to find Islamic solutions to new social problems.<\/p>\n<p>There are two main causes for people to break away from the united community. First, there are those who abandon the scholarly legacy, such as the violent Kharijites, which leads them to persecute other Muslims in the name of religious reform. These are the religious innovators, those who change the religion and prevent people from practicing it as it should be. Second, there are those who foment aggression and hatred between Muslims for some worldly or political end.<\/p>\n<p>Ash-Shatibi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذِهِ الْفِرَقَ إِنْ كَانَتِ افْتَرَقَتْ بِسَبَبٍ مُوقِعٍ فِي الْعَدَوَاةِ وَالْبَغْضَاءِ فَإِمَّا أَنْ يَكُونَ رَاجِعًا إِلَى أَمْرٍ هُوَ مَعْصِيَةٌ غَيْرُ بِدْعَةٍ وَمِثَالُهُ أَنْ يَقَعَ بَيْنَ أَهْلِ الْإِسْلَامِ افْتِرَاقٌ بِسَبَبٍ دُنْيَوِيٍّ كَمَا يَخْتَلِفُ مَثَلًا أَهْلُ قَرْيَةٍ مَعَ قَرْيَةٍ أُخْرَى بِسَبَبِ تَعَدٍّ فِي مَالٍ أَوْ دَمٍ &#8230; وَأَمَّا أَنْ يَرْجِعَ إِلَى أَمْرٍ هُوَ بِدْعَةٌ كَمَا افْتَرَقَ الْخَوَارِجُ مِنَ الْأُمَّةِ بِبِدَعِهِمُ الَّتِي بَنَوْا عَلَيْهَا فِي الْفِرْقَةِ<\/p>\n<p>Indeed, this splitting has happened due to the presence of aggression and hatred. If that is the case, then it is sinful disobedience and not religious innovation. Its example is what happened to the people of Islam when they split due to worldly reasons, such as the division between one town with another because of transgression in wealth or bloodshed… Another cause of splitting is due to religious innovation, such as the splitting of the Khawarij from the Muslim nation whose sect was based upon their innovation.<\/p>\n<p>Source: Kitāb al-I’tiṣām 2\/702<\/p><\/blockquote>\n<p>Hence, it is not simply loyalty to one of the valid schools of theology that prevents sectarianism, but also loyalty to the moral and ethical values that a sound theology must produce. The saved group is not a geographically contained group, but rather it is a broad community of people who share and fulfill the values of faith. Indeed, there are those whose partisanship for their own school of thought has led them to fanaticism and dividing the Muslims. Their theology might be valid, but their sinful behavior was not.<\/p>\n<p>Most importantly, the threat of selfish desires and whims infecting our understanding of Islam is the greatest danger to the unity of the Muslims.<\/p>\n<p>Mu’awiyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوا عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَإِنَّ هَذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلَى ثَلَاثٍ وَسَبْعِينَ ثِنْتَانِ وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ وَهِيَ الْجَمَاعَةُ<\/p>\n<p><strong>No doubt, the people of the Book before you were split into seventy two sects and this religion will split into seventy three sects and seventy two will be in the Hellfire. Only one will be in Paradise, for they are the united community.<\/strong><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّهُ سَيَخْرُجُ مِنْ أُمَّتِي أَقْوَامٌ تَجَارَى بِهِمْ تِلْكَ الْأَهْوَاءُ كَمَا يَتَجَارَى الْكَلْبُ لِصَاحِبِهِ<\/p>\n<p><strong>There will emerge some people in my nation who will be dominated by these desires just as rabies dominates its patient.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4597, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/27\/hadith-on-sects-the-muslims-will-split-into-sects-due-to-their-infectious-desires\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Just as rabies can infect every vein in a person’s body, our selfish desires have the potential to infect every part of our soul and cloud our understanding of true Islam. Rather, we need to constantly purify our hearts of spiritual diseases through prayer, charity, and good works, in addition to continuously seeking knowledge of Islamic sciences.<\/p>\n<p>In sum, the Prophet told us that the Muslims would split into many different sects while only one would be saved from the Hellfire. The saved group are those who follow the inherited scholarly legacy, the authentic traditions of the Prophet, and the principles and methods derived by the righteous scholars. Not only that, the saved group acts according to the moral values that underpin the sound Islamic creed.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Indeed, this splitting has happened due to the presence of aggression and hatred.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[18,21,288,27,184,30,135,32,39,55,134,115,60,67],"class_list":["post-17935","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-community-jamaah","tag-creed-aqidah","tag-desires-shahawat","tag-god-fearing-taqwa","tag-guidance-al-hidaya","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-imam-ahmad-ibn-hanbal","tag-methodology-al-minhaj","tag-paradise-jannah","tag-people-of-the-book","tag-prayer-salat","tag-repentance-al-tawbah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4Fh","jetpack-related-posts":[{"id":17977,"url":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","url_meta":{"origin":17935,"position":0},"title":"Good character before learning Islamic sciences","author":"Abu Amina Elias","date":"April 5, 2016","format":false,"excerpt":"\"What I learned from Malik's manners was better than his knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15955,"url":"https:\/\/www.abuaminaelias.com\/islam-reason-and-spiritual-freedom\/","url_meta":{"origin":17935,"position":1},"title":"Islam, reason, and spiritual freedom","author":"Abu Amina Elias","date":"August 1, 2014","format":false,"excerpt":"\"Indeed, humans are only favored over beastly animals by their minds which order them to restrain their desires.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20551,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bidah-innovations-lowly-desires\/","url_meta":{"origin":17935,"position":2},"title":"Imam al-Mundhiri on Heretical Innovations, Lowly Desires","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"\"Every innovation is misguidance, every misguidance is in Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16260,"url":"https:\/\/www.abuaminaelias.com\/jihad-against-the-soul-in-islam\/","url_meta":{"origin":17935,"position":3},"title":"Jihad against the soul in Islam","author":"Abu Amina Elias","date":"January 27, 2015","format":false,"excerpt":"\"He has succeeded who purifies the soul,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15209,"url":"https:\/\/www.abuaminaelias.com\/beware-of-satan-and-the-idol-of-desire\/","url_meta":{"origin":17935,"position":4},"title":"Beware of the satanic idol of desire","author":"Abu Amina Elias","date":"January 11, 2014","format":false,"excerpt":"\"Have you seen the one who takes his own desire as his god? Then would you be responsible for him?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13792,"url":"https:\/\/www.abuaminaelias.com\/beware-of-hatred-and-malice-in-islam\/","url_meta":{"origin":17935,"position":5},"title":"Malicious hatred is a spiritual disease in Islam","author":"Abu Amina Elias","date":"June 16, 2013","format":false,"excerpt":"\"Hatred is the razor, it shaves the religion and it does not shave hair.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17935","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17935"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17935\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17935"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17935"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17935"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}