{"id":17957,"date":"2016-04-03T12:26:35","date_gmt":"2016-04-03T08:26:35","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17957"},"modified":"2018-03-25T16:15:01","modified_gmt":"2018-03-25T12:15:01","slug":"protection-of-civilian-non-combatants-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/protection-of-civilian-non-combatants-in-islam\/","title":{"rendered":"Protection of civilian non-combatants in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The term “civilians” (<em>al-madanīyīn<\/em>) is a modern legal category, broadly accepted by Muslims and non-Muslims, referring to non-military persons and non-combatants that are protected from attack by international treaties and law. Some Muslim extremists have attempted to delegitimize this legal term on the grounds that it is not found in classical Islamic law. However, we will find that the concept of civilian protection is firmly established in the scripture and classical writings.<\/p>\n<p>In principle, new terminologies are permissible in Islam as long as they accurately represent the underlying concept.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالِاصْطِلَاحَاتُ لَا مُشَاحَّةَ فِيهَا إِذَا لَمْ تَتَضَمَّنْ مَفْسَدَةً<\/p>\n<p>There is nothing wrong with new terminology as long as it does not include corruption.<\/p>\n<p>Source: Madārij al-Sālikīn 3\/286<\/p><\/blockquote>\n<p>Objecting to the legal category of “civilians” merely because it was not used in the past is not a valid argument against it. Rather, it is a positive development that Muslims and non-Muslims have agreed on mutually beneficial legal meanings. The modern law of civilian protection fulfills the purpose of Islamic law, and this is one way in which the non-Muslims have come closer to Islamic values.<\/p>\n<p>Allah has only allowed Muslims to fight in response to aggression. All categories of people who do not actively engage in an unjust war are immune from attack.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلَا تَعْتَدُوا إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ<\/p>\n<p><strong>Fight in the way of Allah those who fight you but do not transgress. Verily, Allah does not love transgressors.<\/strong><\/p>\n<p>Surat al-Baqarah 2:190<\/p><\/blockquote>\n<p>Ibn Abbas commented on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَقْتُلُوا النِّسَاءَ وَلَا الصِّبْيَانَ وَلَا الشَّيْخَ الْكَبِيرَ وَلَا مَنْ أَلْقَى إِلَيْكُمُ السَّلَمَ وَكَفَ يَدَهُ فَإِنْ فَعَلْتُمْ هَذَا فَقَدَ اعْتَدَيْتُمْ<\/p>\n<p>Do not kill women, or children, or old men, or whoever comes to you with peace and he restrains his hand from fighting, for if you did that you would certainly have transgressed.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/18\/ibn-abbas-on-transgression-do-not-kill-women-children-old-men-or-anyone-who-refuses-to-fight-you\/\">Tafsīr al-Ṭabarī 2:190<\/a><\/p><\/blockquote>\n<p>Umar ibn Abdul Aziz described the categories of protected people, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ ذَلِكَ فِي النِّسَاءِ وَالذُّرِّيَّةِ وَمَنْ لَمْ يَنْصِبْ لَكَ الْحَرَبَ مِنْهُمْ<\/p>\n<p>This refers to women, children, and whoever is not waging war against you among them.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/04\/20\/umar-on-war-no-permission-to-kill-women-children-or-non-combatants\/\">Tafsīr al-Ṭabarī 2:190<\/a><\/p><\/blockquote>\n<p>Among the worst of sinners are those who fought and killed people who never started the fight.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَعْدَى النَّاسِ عَلَى اللَّهِ مَنْ قَتَلَ فِي الْحَرَمِ أَوْ قَتَلَ غَيْرَ قَاتِلِهِ أَوْ قَتَلَ بِذُحُولِ الْجَاهِلِيَّةِ<\/p>\n<p><strong>Verily, the worst transgressors to Allah are those who kill in the sacred mosque, those who kill whoever did not fight him, or those who kill with the vindictiveness of ignorance.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6643, Grade: <em><strong><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/12\/hadith-on-transgression-the-worst-people-are-those-who-kill-peaceful-people\/\">Sahih<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>Abu Shuraih reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْتَى النَّاسِ عَلَى اللَّهِ عَزَّ وَجَلَّ مَنْ قَتَلَ غَيْرَ قَاتِلِهِ<\/p>\n<p><strong>Verily, the most tyrannical of people to Allah the Exalted is he who kills those who did not fight him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 15943, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/12\/22\/hadith-on-bloodshed-the-worst-person-kills-those-who-do-not-fight-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>A minority of jurists from the classical period held the opinion that all unbelievers may be killed due to their unbelief, except for women and children who were taken as slaves. Terrorists who act in the name of Islam use a similar logic to justify their crimes. In fact, the majority of scholars rejected this opinion even in the medieval era.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ كَانَ بَعْضُهُمْ يَرَى إبَاحَةَ قَتْلِ الْجَمِيعِ لِمُجَرَّدِ الْكُفْرِ إلَّا النِّسَاءَ وَالصِّبْيَانَ لِكَوْنِهِمْ مَالًا لِلْمُسْلِمِينَ وَالْأَوَّلُ هُوَ الصَّوَابُ لِأَنَّ الْقِتَالَ هُوَ لِمَنْ يُقَاتِلُنَا إذَا أَرَدْنَا إظْهَارَ دِينِ اللَّهِ<\/p>\n<p>Some jurists are of the opinion that all of them may be killed on the mere ground that they are unbelievers, but they make an exception for women and children since they constitute property for Muslims. However, the first opinion is the correct one because we may only fight those who fight us when we want to make Allah’s religion victorious.<\/p>\n<p>Source: al-Siyāsah al-Shar’īyah 1\/165<\/p><\/blockquote>\n<p>The majority of scholars have held that life itself is one of the values of the Sharia that must be protected. All of the law is towards the end of preserving life, as people have an inherent right to life by default.<\/p>\n<p>An examination of the practice of the Prophet and his companions will reveal a consistent concern for protecting those who do not engage in warfare, explicitly stating that the reason they are protected is because they do not fight.<\/p>\n<p>Rabah ibn Rabi reported: We were with the Messenger of Allah, peace and blessings be upon him, during an expedition. He saw some people gathered around something, so he sent a man and he said, “Go and see for what they have gathered.” The man returned and he said, “It was a woman who has been killed.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَتْ هَذِهِ لِتُقَاتِلَ<\/p>\n<p><strong>She was not fighting.<\/strong><\/p><\/blockquote>\n<p>Khalid ibn Al-Waleed was in the advanced guard, so the Prophet sent a man to him saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَقْتُلَنَّ امْرَأَةً وَلَا عَسِيفًا<\/p>\n<p><strong>Do not kill women or workers.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2669, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/17\/hadith-on-jihad-the-prophet-forbade-killing-women-workers-or-anyone-who-is-not-fighting\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَقْتُلَنَّ ذُرِّيَّةً وَلَا عَسِيفًا<\/p>\n<p><strong>Do not kill children or workers.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2842, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Zaid ibn Wahb reported: Umar ibn Al-Khattab, may Allah be pleased with him, decreed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تَغُلُّوا وَلا تَغْدِرُوا وَلا تُمَثِّلُوا وَلا تَقْتُلُوا وَلِيدًا وَاتَّقُوا اللَّهَ فِي الْفَلاحِينَ الَّذِينَ لا يَنْصُبُونَ لَكُمُ الْحَرْبَ<\/p>\n<p>Do not steal the spoils, do not be treacherous with the enemy, do not mutilate the dead, do not kill children, and fear Allah regarding the farmers who do not wage war against you.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/03\/umar-on-war-fear-allah-regarding-children-and-civilian-non-combatants\/\">Sunan Sa’īd ibn Mansūr 2466<\/a><\/p><\/blockquote>\n<p>Al-Awza’i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُقْتَلُ الْحَرَّاثُ إِذَا عُلِمَ أَنَّهُ لَيْسَ مِنَ الْمُقَاتِلَةِ<\/p>\n<p>Do not kill those who work the fields if it is known that they are not combatants.<\/p>\n<p>Source: Aḥkām Ahl al-Dhimmah 1\/165<\/p><\/blockquote>\n<p>Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَنَا قَوْلُ عُمَرَ وَأَنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَقْتُلُوهُمْ حِينَ فَتَحُوا الْبِلَادَ وَلِأَنَّهُمْ لَا يُقَاتِلُونَ فَأَشْبَهُوا الشُّيُوخَ وَالرُّهْبَانَ<\/p>\n<p>We adhere to the saying of Umar. The companions of the Messenger of Allah, peace and blessings be upon him, did not kill farmers when they liberated the lands because they do not fight. In this, they resemble old men and priests.<\/p>\n<p>Source: al-Mughnī 7617<\/p><\/blockquote>\n<p>In all of these texts and others, clear categories of non-hostiles are described as entitled to protection from attack. The classical jurists classified these people into categories of women, children, workers, old men, priests, and so on. In our times, the term “civilian” is the legal category that includes all of these people.<\/p>\n<p>Civilians should be protected even if they engage in other forms of injustice. Any type of injustice that is less than warfare must be countered with less than warfare. The only justification for fighting and killing anyone is out of necessary self-defense.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأما الباغي من غير قتال فليس في النص أن الله أمر بقتاله بل الكفار إنما يقاتلون بشرط الحراب كما ذهب اليه جمهور العلماء وكما دل عليه الكتاب والسنة<\/p>\n<p>As for the oppressor who does not fight, then there are no texts in which Allah commands him to be fought. Rather, the unbelievers are only fought on the condition they wage war, as mentioned by the majority of scholars and as is evident in the Book and Sunnah.<\/p>\n<p>Source: al-Nubūwāt 1\/140<\/p><\/blockquote>\n<p>Moreover, when terrorists plot attacks against civilian or “soft” targets, they frequently employ methods of deception and treachery in order to get close to their victims. Such acts of betrayal are completely rejected by Islam.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا جَمَعَ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ يَوْمَ الْقِيَامَةِ يُرْفَعُ لِكُلِّ غَادِرٍ لِوَاءٌ فَقِيلَ هَذِهِ غَدْرَةُ فُلاَنِ بْنِ فُلاَنٍ<\/p>\n<p><strong>When Allah gathers together the earlier and later generations on the Day of Resurrection, he will raise a banner for every treacherous person and it will be announced that this is the treachery of this person, the son of this person.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5823, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/22\/hadith-on-treachery-whoever-treacherously-breaks-his-promises-will-be-exposed-on-the-day-of-judgment\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik reported: Umar ibn Al-Khattab, may Allah be pleased with him, wrote to a commander in an army he had dispatched, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ بَلَغَنِي أَنَّ رِجَالًا مِنْكُمْ يَطْلُبُونَ الْعِلْجَ حَتَّى إِذَا أَسْنَدَ فِي الْجَبَلِ وَامْتَنَعَ قَالَ رَجُلٌ مَطْرَسْ يَقُولُ لَا تَخَفْ فَإِذَا أَدْرَكَهُ قَتَلَهُ وَإِنِّي وَالَّذِي نَفْسِي بِيَدِهِ لَا أَعْلَمُ مَكَانَ وَاحِدٍ فَعَلَ ذَلِكَ إِلَّا ضَرَبْتُ عُنُقَهُ<\/p>\n<p>I have heard that it is the habit of some of your men to chase an unbeliever until he takes refuge in a high place. Then a man tells him in Persian not to be afraid and when he comes down they kill him. By him in whose hand is my soul, if I knew a man had done that once I would strike his neck.<\/p><\/blockquote>\n<p>And Ibn Abbas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا خَتَرَ قَوْمٌ بِالْعَهْدِ إِلَّا سَلَّطَ اللَّهُ عَلَيْهِمْ الْعَدُوَّ<\/p>\n<p>People do not betray their covenants except that Allah will let their enemies overpower them.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/03\/13\/umar-on-treachery-if-i-knew-he-had-killed-an-unbeliever-by-treachery-i-would-strike-his-neck\/\">al-Muwaṭṭa 951<\/a><\/p><\/blockquote>\n<p>Muslims are obligated to uphold all agreements and promises with the enemy, even if it leads to a tactical disadvantage. Truth and justice, rather than cunning, are the strongest weapons against any foe.<\/p>\n<p>Muhammad ibn Surqah reported: A man said to ‘Atā, may Allah be pleased with him, “A man was captured by the Daylamites and they said: We will send you back if you give us a covenant and a pledge that you will return with some wealth for us. If he does not go back to them himself and he is not found, then what do you order him to do?” ‘Atā said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَذْهَبُ إِلَيْهِمْ<\/p>\n<p>He should go back to them.<\/p><\/blockquote>\n<p>The man said, “But they are people of idolatry!” ‘Atā said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَفِي بِالْعَهْدِ<\/p>\n<p>He should fulfill the covenant.<\/p><\/blockquote>\n<p>The man said, “But they are people of idolatry!” ‘Atā said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَفِي بِالْعَهْدِ لَهُمْ<\/p>\n<p>He should fulfill their covenant.<\/p><\/blockquote>\n<p>Then he recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْعَهْدَ كَانَ مَسْئُولًا<\/p>\n<p><strong>Verily, the covenant will be questioned.<\/strong> (17:34)<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/03\/ata-on-promises-fulfill-your-pledges-and-covenants-with-the-idolaters\/\">Muṣannaf ‘Abd al-Razzāq 9714<\/a><\/p><\/blockquote>\n<p>In sum, it is incumbent upon Muslims to respect and honor civilian protection in the modern context. Such legal terminology is based upon the clear categories of people whom the Prophet declared immune from attack. Terrorism, in this sense, is a major violation of Islamic law that will make those who commit it into the worst sinners among humanity.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;People do not betray their covenants except that Allah will let their enemies overpower them.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[282,183,32,37,39,43,48,51,100,55,115,62,107,103,121,73,98,128],"class_list":["post-17957","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-children","tag-day-of-resurrection-yawm-al-qiyammah","tag-hereafter-akhirah","tag-idolatry-shirk","tag-imam-ahmad-ibn-hanbal","tag-imam-malik","tag-justice-adl","tag-leadership-imamate","tag-manners-al-adab","tag-methodology-al-minhaj","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-trust-al-amanah","tag-public-welfare-al-maslaha","tag-terrorism-al-irhab","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4FD","jetpack-related-posts":[{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":17957,"position":0},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15738,"url":"https:\/\/www.abuaminaelias.com\/muslims-not-punished-for-killing-non-muslims\/","url_meta":{"origin":17957,"position":1},"title":"Muslims not punished for killing non-Muslims?","author":"Abu Amina Elias","date":"May 28, 2014","format":false,"excerpt":"\"The general rule is that all crimes should be prosecuted and punished equally,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17207,"url":"https:\/\/www.abuaminaelias.com\/equality-under-law-non-muslims\/","url_meta":{"origin":17957,"position":2},"title":"Equal protection of law for Muslims and non-Muslims","author":"Abu Amina Elias","date":"October 20, 2015","format":false,"excerpt":"\"Islam guarantees the protection of civil law for all citizens and visitors,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23559,"url":"https:\/\/www.abuaminaelias.com\/shariah-fiqh-qanun\/","url_meta":{"origin":17957,"position":3},"title":"Sharia, Fiqh, and Islamic law explained","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"To whomever Allah wills goodness, He grants him understanding of the religion.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15796,"url":"https:\/\/www.abuaminaelias.com\/whoever-changes-religion-kill-him\/","url_meta":{"origin":17957,"position":4},"title":"Apostasy: Whoever changes his religion, kill him?","author":"Abu Amina Elias","date":"June 19, 2014","format":false,"excerpt":"\"The most hesitant of people in killing are the people of faith.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":17957,"position":5},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17957","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17957"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17957\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17957"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17957"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17957"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}