{"id":17977,"date":"2016-04-05T11:15:12","date_gmt":"2016-04-05T07:15:12","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=17977"},"modified":"2020-07-17T22:14:50","modified_gmt":"2020-07-17T18:14:50","slug":"good-character-before-islamic-sciences","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","title":{"rendered":"Good character before learning Islamic sciences"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Good character, morals, and manners are the heart of Islam. All of the Islamic sciences are directed towards refining people’s inward and outward behavior and their relationship with Allah and humanity at large. Ethics is its own science in Islam and, in reality, is the most important science to precede all other advanced fields of knowledge.<\/p>\n<p>It has been established from the Prophet (ṣ) and his companions that the transmission of ethical knowledge is an essential objective of the religion of Islam.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا بُعِثْتُ لِأُتَمِّمَ صَالِحَ الْأَخْلَاقِ<\/p>\n<p><strong>Verily, I have only been sent to perfect righteous character.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 8729, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/02\/hadith-on-character-the-prophet-was-sent-only-to-teach-righteousness-to-the-believers\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Dahhak, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّيِّدُ الْحَسَنُ الْخُلُقِ<\/p>\n<p>The head of the matter is good character.<\/p>\n<p>Source: Makārim al-Akhlāq lil-Kharā’iṭī 524<\/p><\/blockquote>\n<p>Hence, every rule, concept, and practice in Islam is meant to ultimately affect our inward and outward behavior.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدِّينُ كُلُّهُ خُلُقٌ فَمَنْ زَادَ عَلَيْكَ فِي الْخُلُقِ زَادَ عَلَيْكَ فِي الدِّينِ<\/p>\n<p>The religion itself is entirely good character, so whoever surpasses you in character has surpassed you in religion.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/07\/ibn-al-qayyim-whoever-surpasses-you-in-good-character-has-surpassed-you-in-religion-and-spirituality\/\">Madārij al-Sālikīn 2\/294<\/a><\/p><\/blockquote>\n<p>And Al-Shatibi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالشَّرِيعَةُ كُلُّهَا إِنَّمَا هِيَ تَخَلُّقٌ بمكارمِ الْأَخْلَاقِ<\/p>\n<p>The Sharia in its entirety only creates noble morals.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/02\/01\/the-prophet-was-sent-to-perfect-good-character\/\">al-Muwāfaqāt 2\/124<\/a><\/p><\/blockquote>\n<p>The companions understood that ethics is a science distinguished but integral to other Islamic sciences. They encouraged their students and the Muslims as a whole to seek knowledge while at the same time learning good character and manners.<\/p>\n<p>&#8216;Imran ibn Muslim reported: Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعَلَّمُوا الْعِلْمَ وَعَلِّمُوهُ النَّاسَ وَتَعَلَّمُوا لَهُ الْوَقَارَ وَالسَّكِينَةَ وَتَوَاضَعُوا لِمَنْ يُعَلِّمُكُمْ عِنْدَ الْعِلْمِ وَتَوَاضَعُوا لِمَنْ تُعَلِّمُوهُ الْعِلْمَ وَلا تَكُونُوا جَبَابِرَةَ الْعُلَمَاءِ فَلا يَقُومُ عِلْمُكُمْ بِجَهْلِكُمْ<\/p>\n<p>Acquire knowledge and teach people. Learn along with it dignity and tranquility and humility for those who teach you and humility for those whom you teach. Do not be tyrannical scholars and thus base your knowledge upon your ignorance.<\/p>\n<p>Source: Shu’b al-Imān 1650, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/04\/25\/umar-on-knowledge-learn-and-teach-others-with-dignity-tranquility-and-humility\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Good character and manners is not something that comes without effort. Just as we study large books of commentary on the Quran and Sunnah, likewise we need to study ethics and etiquette.<\/p>\n<p>Raja’ ibn Haywah reported: Abu Darda, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْعِلْمُ بِالتَّعَلُّمِ وَإِنَّمَا الْحِلْمُ بِالتَّحَلُّمِ<\/p>\n<p>Verily, knowledge only comes by learning and forbearance only comes by cultivating forbearance.<\/p>\n<p>Source: Rawḍat al-ʻUqalā 100, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/07\/26\/abu-ad-darda-on-learning-knowledge-and-forbearance-only-come-from-nurturing-these-qualities\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Character and manners are actually two side of the same coin, two aspects of single ethical reality. Character (<em>al-akhlaq<\/em>) are the qualities that reside in the heart, and manners (<em>al-adab<\/em>) are the outward behavior that people manifest. In other words, good manners is the result of good character. As such, we need to learn about the methods of achieving a pure heart and the social behavior that should follow it.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَحَقِيقَةُ الْأَدَبِ اسْتِعْمَالُ الْخُلُقِ الْجَمِيلِ وَلِهَذَا كَانَ الْأَدَبُ اسْتِخْرَاجَ مَا فِي الطَّبِيعَةِ مِنَ الْكَمَالِ مِنَ الْقُوَّةِ إِلَى الْفِعْلِ<\/p>\n<p>The reality of manners is that it results from beautiful character. Thus, manners is the externalization of the integrity and strength in one’s inward disposition into action.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/12\/ibn-al-mubarak-on-character-we-need-manners-more-than-we-need-knowledge\/\">Madārij al-Sālikīn 2\/361<\/a><\/p><\/blockquote>\n<p>Since ethics has such an important place in Islam, it should be our top concern after learning the basics of Islamic beliefs and worship. It was the practice of the righteous predecessors (<em>al-salaf al-salihin<\/em>) to focus on acquiring good character and manners before seriously approaching the advanced fields of Islamic knowledge related to Quranic exegesis (<em>al-tafsir<\/em>), the Sunnah (<em>al-hadith<\/em>), creed (<em>al-‘aqidah<\/em>), law (<em>al-fiqh<\/em>), biography (<em>al-sirah<\/em>), history (<em>al-tarikh<\/em>), leadership (<em>al-imamah<\/em>), and other subjects.<\/p>\n<p>Malik ibn Anas, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعَلَّمِ الأَدَبَ قَبْلَ أَنْ تَتَعَلَّمَ الْعِلْمَ<\/p>\n<p>Learn good manners before seeking knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/13\/malik-on-manners-learn-good-manners-before-seeking-knowledge\/\">Gharāʼib Mālik ibn Anas 45<\/a><\/p><\/blockquote>\n<p>And Malik said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كانت أمي تعممني وتقول لي اذهب إلى ربيعة فتعلم من أدبه قبل علمه<\/p>\n<p>My mother would dress me up and say to me: Go to Sheikh Rabi’ah and learn from his manners before his knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/04\/25\/umar-on-knowledge-learn-and-teach-others-with-dignity-tranquility-and-humility\/\">Tartīb al-Madārik 1\/130<\/a><\/p><\/blockquote>\n<p>Ibn al-Mubarak, may Allah have mercy on him, said to the people of hadīth:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أنتم إِلَى قَلِيلٍ مِنَ الْأَدَبِ أَحْوَجُ منكم إِلَى كَثِيرٍ مِنَ الْعِلْمِ<\/p>\n<p>You are in greater need of a little manners than a great deal of knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/12\/ibn-al-mubarak-on-character-we-need-manners-more-than-we-need-knowledge\/\">Tārīkh Dimashq 32918<\/a><\/p><\/blockquote>\n<p>And he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">طلبت الأدب ثلاثين سنة وطلبت العلم عشرين سنة وكانوا يطلبون الأدب ثم العلم<\/p>\n<p>I sought manners for thirty years and I sought knowledge for twenty years. The righteous predecessors would seek manners and then seek knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/10\/sufyan-ath-thawri-on-manners-the-righteous-predecessors-would-study-manners-and-worship-before-writing-prophetic-sayings\/\">Ghāyat al-Nihāyah 1\/446<\/a><\/p><\/blockquote>\n<p>Sufyan al-Thawri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ الرَّجُلُ إِذَا أَرَادَ أَنْ يَكْتُبَ الْحَدِيثَ تَأَدَّبَ وَتَعَبَّدَ قَبْلَ ذَلِكَ بِعِشْرِينَ سَنَةً<\/p>\n<p>If a man intended to write the hadīth, he would study good manners and worship for twenty years before doing so.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/10\/sufyan-ath-thawri-on-manners-the-righteous-predecessors-would-study-manners-and-worship-before-writing-prophetic-sayings\/\">Hilyat al-Awliyā 361<\/a><\/p><\/blockquote>\n<p>Al-Layth ibn Sa’d, may Allah have mercy on him, said to the people of Hadith:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعَلَّمُوا الْحِلْمَ قَبْلَ الْعِلْمِ<\/p>\n<p>Learn forbearance before seeking knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/03\/13\/malik-on-manners-learn-good-manners-before-seeking-knowledge\/\">Jāmi’ Bayān al-‘Ilm 581<\/a><\/p><\/blockquote>\n<p>In fact, the righteous predecessors would learn more from a scholar’s manners than they would from his knowledge.<\/p>\n<p>Al-Zuhri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنَّا نَأْتِي الْعَالِمَ فَمَا نَتَعَلَّمُ مِنْ أَدَبِهِ أَحَبُّ إِلَيْنَا مِنْ عِلْمِهِ<\/p>\n<p>We would come to a scholar and what we learned from his manners was more beloved to us than his knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/01\/10\/az-zuhri-on-manners-what-we-learned-from-the-scholars-manners-was-greater-than-their-knowledge\/\">Hilyat al-Awliyā 4575<\/a><\/p><\/blockquote>\n<p>Ibn Wahb, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَعَلَّمْتُ مِنْ أَدَبِ مَالِكٍ أَفْضَلَ مِنْ عِلْمِهِ<\/p>\n<p>What I learned from the manners of Malik was better than his knowledge.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/01\/10\/az-zuhri-on-manners-what-we-learned-from-the-scholars-manners-was-greater-than-their-knowledge\/\">Jāmi’ Bayān al-‘Ilm 581<\/a><\/p><\/blockquote>\n<p>Failure to understand the importance of ethics and its status among the fields of knowledge is causing much misguidance among Muslims today. The reason is that the advanced Islamic sciences contain complicated details related to creed, sects, differences of opinion, and confusing issues that most people do not know about it.<\/p>\n<p>Only those who are strongly grounded in Islamic ethics are able to approach these issues in the best way, without causing confusion among the masses or indulging in fruitless arguments. In contrast, many young people learn a little bit of advanced knowledge, without its requisite manners, and thus they engage in sectarianism and transgression against other Muslims.<\/p>\n<p>The Prophet (ṣ) and righteous scholars warned us that bitter and self-righteous debates in the religion are one of the main causes that lead people astray and foment hatred.<\/p>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا ضَلَّ قَوْمٌ بَعْدَ هُدًى كَانُوا عَلَيْهِ إِلَّا أُوتُوا الْجَدَلَ<\/p>\n<p><strong>No people go astray after being guided except that they indulge in arguments.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet (ṣ) recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُونَ<\/p>\n<p><strong>They strike an example for you only to argue. Rather, they are a quarrelsome people.<\/strong> (43:58)<\/p>\n<p>Source: Sunan al-Tirmidhī 3253, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/06\/hadith-on-arguments-people-go-astray-after-being-guided-because-they-stubbornly-argue\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik ibn Anas, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمِرَاءُ وَالْجِدَالُ فِي الْعِلْمِ يَذْهَبُ بِنُورِ الْعِلْمِ مِنْ قَلْبِ الرَّجُلِ<\/p>\n<p>Disputation and arguments about sacred knowledge cause the light of knowledge to extinguish in a man’s heart.<\/p><\/blockquote>\n<p>And he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمِرَاءُ فِي الْعِلْمِ يُقَسِّي الْقَلْبَ وَيُؤَثِّرُ الضَّغْنَ<\/p>\n<p>Disputation about sacred knowledge causes the heart to harden and results in hatred.<\/p>\n<p>Source: Jāmi&#8217; al-&#8216;Ulūm wal-Ḥikam 1\/248<\/p><\/blockquote>\n<p>The solution is to return to the ethical knowledge in the Quran and Sunnah as the primary Islamic science. The purpose of everything that we learn in Islam is to make us better people, better servants of Allah and better companions to humanity at large. When we understand this, we will be able to confront modern problems and complicated issues without descending into misguidance and hatred.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><a href=\"#_ftnref1\" name=\"_ftn1\"><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;What I learned from Malik&#8217;s manners was better than his knowledge.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[16,18,43,50,100,55,62,45,91,296,73],"class_list":["post-17977","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-character-akhlaq","tag-community-jamaah","tag-imam-malik","tag-knowledge","tag-manners-al-adab","tag-methodology-al-minhaj","tag-prophetic-biography-sirah","tag-quran-exegesis-tafsir","tag-righteous-predecessors-al-salaf-al-salih","tag-sharia","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4FX","jetpack-related-posts":[{"id":21729,"url":"https:\/\/www.abuaminaelias.com\/understanding-sufism-in-islam\/","url_meta":{"origin":17977,"position":0},"title":"Understanding Sufism in Islam","author":"Abu Amina Elias","date":"February 25, 2020","format":false,"excerpt":"\"Sufism is to be mindful of one’s inner-states and adhere to good manners.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":17977,"position":1},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18474,"url":"https:\/\/www.abuaminaelias.com\/the-right-way-to-defend-islam\/","url_meta":{"origin":17977,"position":2},"title":"Defending Islam with grace and sincerity","author":"Abu Amina Elias","date":"June 1, 2017","format":false,"excerpt":"\"Whoever intends justice, then let him imagine himself in the place of his adversary,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":17977,"position":3},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17719,"url":"https:\/\/www.abuaminaelias.com\/good-character-salvation\/","url_meta":{"origin":17977,"position":4},"title":"Good character, the path to salvation in Islam","author":"Abu Amina Elias","date":"February 13, 2016","format":false,"excerpt":"\"I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16544,"url":"https:\/\/www.abuaminaelias.com\/arguing-about-the-religion-in-islam\/","url_meta":{"origin":17977,"position":5},"title":"Arguing about the religion in Islam","author":"Abu Amina Elias","date":"April 11, 2015","format":false,"excerpt":"\"No people go astray after being guided except that they indulge in arguments.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17977","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=17977"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/17977\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=17977"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=17977"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=17977"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}