{"id":18033,"date":"2016-04-12T11:59:29","date_gmt":"2016-04-12T07:59:29","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18033"},"modified":"2021-06-01T15:48:26","modified_gmt":"2021-06-01T11:48:26","slug":"beware-of-envy-and-hatred","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/beware-of-envy-and-hatred\/","title":{"rendered":"Beware of envy and hatred, destroyer of good deeds"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Envy (<em>hasad<\/em>) is a spiritual disease that is the root of numerous sins. It is incompatible with true faith and it has the capacity to nullify a person’s good deeds. A Muslim cannot achieve a pure heart until it is emptied of all envy, hatred, and malice.<\/p>\n<p>The definition of envy is that it is a desire to see someone harmed in something with which Allah has blessed them. The person who envies is, in reality, displeased with the way Allah has distributed his blessings.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ<\/p>\n<p><strong>Do they envy people for what Allah has given them of his bounty?<\/strong><\/p>\n<p>Surat al-Nisā 4:54<\/p><\/blockquote>\n<p>An-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الحسد هو تمني زوال النعمة عن صاحبها سواء كانت نعمة دين أو دنيا<\/p>\n<p>Envy is the desire for someone who has a blessing to be deprived of it, whether it is a religious or worldly blessing.<\/p>\n<p>Source: Sharḥ Riyāḍ al-Sāliḥīn 6\/248<\/p><\/blockquote>\n<p>As-Saffarini writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ الْحَاسِدَ قَدْ سَخِطَ قَضَاءَ اللَّهِ تَعَالَى فَكَرِهَ نِعْمَتَهُ عَلَى عِبَادِهِ<\/p>\n<p>The one who envies has become displeased with the decree of Allah the Exalted, so he hates that Allah has blessed his servants.<\/p>\n<p>Source: Ghidhā al-Albāb 2\/285<\/p><\/blockquote>\n<p>Envy was the original sin in the heavens by which Satan disobeyed Allah for the first time, and the original sin on earth when the son of Adam killed his brother.<\/p>\n<p>Ibn Uyainah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَسَدُ أَوَّلُ ذَنْبٍ عُصِيَ اللَّهُ عَزَّ وَجَلَّ بِهِ فِي السَّمَاءِ يَعْنِي حَسَدَ إِبْلِيسَ آدَمَ وَهُوَ أَوَّلُ ذَنْبٍ عُصِيَ اللَّهُ عَزَّ وَجَلَّ بِهِ فِي الْأَرْضِ وَحَسَدَ ابْنُ آدَمَ أَخَاهُ فَقَتَلَهُ<\/p>\n<p>Envy was the first sin by which Allah the Exalted was disobeyed in the heavens, as Iblīs envied Adam. It was the first sin by which Allah was disobeyed on earth, as the son of Adam killed his brother.<\/p>\n<p>Source: al-Mujālasah wa Jawāhir al-&#8216;Ilm 667<\/p><\/blockquote>\n<p>Envy in this sense is directly related to the desire to harm, to nurture malicious hatred against the person that is envied.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالتَّحْقِيقُ أَنَّ الْحَسَدَ هُوَ الْبُغْضُ وَالْكَرَاهَةُ لِمَا يَرَاهُ مِنْ حُسْنِ حَالِ الْمَحْسُودِ<\/p>\n<p>The reality of envy is that it is the hatred and contempt a person feels when seeing the good condition of the one who is envied.<\/p>\n<p>Source: Majmū’ Fatāwá 10\/111<\/p><\/blockquote>\n<p>The Prophet commanded us not to envy and hate others. Rather, we should love for others what we love for ourselves.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا<\/p>\n<p><strong>Do not hate each other, do not envy each other, do not turn away from each other, but rather be servants of Allah as brothers.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2559, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/10\/03\/brotherhood-means-to-reject-hate-envy-and-cruelty\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Az-Zubair ibn Awwam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَبَّ إِلَيْكُمْ دَاءُ الْأُمَمِ قَبْلَكُمْ الْحَسَدُ وَالْبَغْضَاءُ وَالْبَغْضَاءُ هِيَ الْحَالِقَةُ حَالِقَةُ الدِّينِ لَا حَالِقَةُ الشَّعَرِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلَا أُنَبِّئُكُمْ بِشَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><strong>There have come to you the diseases of the nations before you: envy and hatred, and hatred is the razor. It shaves the religion and it does not shave hair. By the one in whose hand is the soul of Muhammad, you will not believe until you love one another. Shall I tell you something which, if you did, you would love each other? Spread peace between yourselves.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 1415, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/29\/hadith-on-hatred-beware-the-disease-of-hatred-which-afflicted-the-previous-nations-and-destroyed-their-religion\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The best of people and those who will be saved on the Day of Judgment are the people with pure hearts. As envy and hatred are spiritual diseases, we cannot achieve salvation in the Hereafter until we purge our hearts from them.<\/p>\n<p>Abdullah ibn Amr reported: It was said to the Messenger of Allah, “Which of the people is best?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَخْمُومِ الْقَلْبِ صَدُوقِ اللِّسَانِ<\/p>\n<p><strong>Everyone who is pure of heart and truthful in speech.<\/strong><\/p><\/blockquote>\n<p>They said, “Truthful in speech we know, but what is a pure heart?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُوَ التَّقِيُّ النَّقِيُّ لَا إِثْمَ فِيهِ وَلَا بَغْيَ وَلَا غِلَّ وَلَا حَسَدَ<\/p>\n<p><strong>It is a heart that fears Allah and is clean. There is no sin in it and neither aggression, malice, nor envy. <\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4216, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/18\/hadith-on-purity-a-pure-heart-is-one-free-of-aggression-rancor-and-envy\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Al-Arabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَكُونُ الْقَلْبُ سَلِيمًا إذَا كَانَ حَقُودًا حَسُودًا مُعْجَبًا مُتَكَبِّرًا وَقَدْ شَرَطَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْإِيمَانِ أَنْ يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p>The heart cannot be pure if it holds malice, envy, pride, and arrogance. The Prophet made it a requirement of faith that he love for his brother what he loves for himself.<\/p>\n<p>Source: Aḥkām al-Qurʼān 26:89<\/p><\/blockquote>\n<p>Faith itself, which involves accepting and submitting to the providence (<em>qadr<\/em>) of Allah, is contradicted by envy. The faith of a Muslim is spoiled if there is any envy in his or her heart.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلا يَجْتَمِعُ فِي جَوْفِ عَبْدٍ مُؤْمِنٍ الإِيمَانُ وَالْحَسَدُ<\/p>\n<p><strong>Faith and envy are never joined together in the heart of a servant<\/strong>.<\/p>\n<p>Source: Shu’ab al-Imān 6099, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/02\/hadith-on-greed-faith-and-greed-are-never-gathered-together-in-the-heart-of-a-believing-muslim\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يَتِمُّ ذَلِكَ إِلَّا بِتَرْكِ الْحَسَدِ وَالْغِلِّ وَالْحِقْدِ وَالْغِشِّ<\/p>\n<p>Faith is not complete until a Muslim abandons envy, rancor, malice, and malevolence.<\/p>\n<p>Source: Fatḥ al-Bārī 1\/74<\/p><\/blockquote>\n<p>Envy leads to numerous sins with the limbs and, as a result of these sins, a person’s good deeds will be destroyed.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكُمْ وَالْحَسَدَ فَإِنَّ الْحَسَدَ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ أَوْ قَالَ الْعُشْبَ<\/p>\n<p><strong>Beware of envy, for it consumes good deeds just as fire consumes wood or grass.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4903, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/10\/hadith-on-envy-beware-of-envy-because-it-destroys-good-deeds-like-fire-destroys-wood\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَسَدُ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ وَالصَّلَاةُ نُورُ الْمُؤْمِنِ وَالصِّيَامُ جُنَّةٌ مِنَ النَّارِ<\/p>\n<p><strong>Envy consumes good deeds just as fire burns wood. Charity extinguishes sinful deeds just as water extinguishes fire. Prayer is the light of the believer and fasting is his shield from the Hellfire.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4208, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/12\/15\/hadith-on-envy-jealousy-destroys-good-deeds-charity-expiates-sinful-deeds-and-prayer-is-light\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>As envy is related to so many outward sins, it is one the primary evil character traits that we need to avoid. Moreover, a person consumed by envy will not be able to rest and attain peace of mind in this life.<\/p>\n<p>Damura ibn Tha’laba reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَزَالُ النَّاسُ بِخَيْرٍ مَا لَمْ يَتَحَاسَدُوا<\/p>\n<p><strong>The people will remain upon goodness as long as they do not envy each other.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 8079, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/05\/16\/hadith-on-envy-people-will-be-good-as-long-as-they-do-not-envy-one-another\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Ahnaf ibn Qais, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا رَاحَةَ لِحَسُودٍ<\/p>\n<p>There is no rest for the envious.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/03\/08\/ahnaf-on-envy-no-rest-and-relaxation-for-the-envious-and-hateful\/\">Shu’b al-Imān 6123<\/a><\/p><\/blockquote>\n<p>For this reason, the companions were afraid of acquiring much wealth and being exposed to many riches. After the defeat of the Romans and Persians, many of the companions lamented that the wealth they inherited would be a source of envy and therefore misguidance.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا فُتِحَتْ عَلَيْكُمْ فَارِسُ وَالرُّومُ أَيُّ قَوْمٍ أَنْتُمْ<\/p>\n<p><strong>If the treasures of Persia and Rome were opened for you, what kind of people will you be?<\/strong><\/p><\/blockquote>\n<p>Abdur Rahman ibn Awf said, “We will be as Allah has ordered us.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوْ غَيْرَ ذَلِكَ تَتَنَافَسُونَ ثُمَّ تَتَحَاسَدُونَ ثُمَّ تَتَدَابَرُونَ ثُمَّ تَتَبَاغَضُونَ أَوْ نَحْوَ ذَلِكَ ثُمَّ تَنْطَلِقُونَ فِي مَسَاكِينِ الْمُهَاجِرِينَ فَتَجْعَلُونَ بَعْضَهُمْ عَلَى رِقَابِ بَعْضٍ<\/p>\n<p><strong>Perhaps you will be something else. You will compete with each other, then envy each other, then turn away from each other, then hate each other, and so on. Then you will go to the poor emigrants and make some of them masters over others.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2962, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/04\/10\/hadith-on-tribulation-how-will-you-be-when-the-wealth-of-the-world-is-given-to-you\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Umar ibn Al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُفْتَحُ الدُّنْيَا عَلَى أَحَدٍ إِلَّا أَلْقَى اللَّهُ عَزَّ وَجَلَّ بَيْنَهُمْ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَى يَوْمِ الْقِيَامَةِ وَأَنَا أُشْفِقُ مِنْ ذَلِكَ<\/p>\n<p><strong>The world is not opened for anyone but that Allah the Exalted will cast enmity and hatred between them, and I feel pity on them for it.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 94, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/12\/hadith-on-wealth-the-riches-of-the-world-cause-hatred-and-hostility-between-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Rajab reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولما فتحت كنوز كسرى على عمر بن الخطاب رضي الله عنه بكى فقال إن هذا لم يفتح على قوم قط إلا جعل الله بأسهم بينهم<\/p>\n<p style=\"text-align: left;\">When the treasures of Khosrau were opened for Umar ibn Al-Khattab, he wept and he said: Verily, the likes of this were never opened for people except that Allah made it a cause of discord between them.<\/p>\n<p style=\"text-align: left;\">Source: Kashf al-Kurbah 1\/5<\/p>\n<\/blockquote>\n<p>In contrast, those who purify their hearts from envy achieve a high status with Allah and Paradise in the Hereafter, even if they were not considered particularly pious by other people in the world.<\/p>\n<p>Anas ibn Malik reported: We were sitting with the Messenger of Allah, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَطْلُعُ عَلَيْكُمْ الْآنَ رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ<\/p>\n<p><strong>Coming upon you now is a man from the people of Paradise<\/strong>.<\/p><\/blockquote>\n<p>A man from the Ansar came whose beard was disheveled by the water of ablution and he was carrying both of his shoes with his left hand. When the Prophet stood up to leave, Abdullah ibn Amr followed the man and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَاحَيْتُ أَبِي فَأَقْسَمْتُ أَنْ لَا أَدْخُلَ عَلَيْهِ ثَلَاثًا فَإِنْ رَأَيْتَ أَنْ تُؤْوِيَنِي إِلَيْكَ حَتَّى تَمْضِيَ فَعَلْتَ<\/p>\n<p>I am in a dispute with my father and I have sworn not to enter my home for three days. May I stay with you?<\/p><\/blockquote>\n<p>The man said yes. Abdullah stayed three nights with the man but he never saw him praying at night. Whenever he went to bed, he would remember Allah and rest until he woke up for the morning prayer. Abdullah said that he never heard anything but good words from his mouth. When three nights had passed and he did not see anything special about his actions, Abdullah asked him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَبْدَ اللَّهِ إِنِّي لَمْ يَكُنْ بَيْنِي وَبَيْنَ أَبِي غَضَبٌ وَلَا هَجْرٌ ثَمَّ وَلَكِنْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَكَ ثَلَاثَ مِرَارٍ يَطْلُعُ عَلَيْكُمْ الْآنَ رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ فَطَلَعْتَ أَنْتَ الثَّلَاثَ مِرَارٍ فَأَرَدْتُ أَنْ آوِيَ إِلَيْكَ لِأَنْظُرَ مَا عَمَلُكَ فَأَقْتَدِيَ بِهِ فَلَمْ أَرَكَ تَعْمَلُ كَثِيرَ عَمَلٍ فَمَا الَّذِي بَلَغَ بِكَ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ<\/p>\n<p>O servant of Allah, I have not been in dispute with my father nor have I cut relations with him. I heard the Prophet say three times that a man from the people of Paradise was coming to us and then you came. I thought I should stay with you to see what you are doing that I should follow, but I did not see you do anything special. Why did the Prophet speak highly of you?<\/p><\/blockquote>\n<p>The man said, “I am as you have seen.” When Abdullah was about to leave, the man said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا هُوَ إِلَّا مَا رَأَيْتَ غَيْرَ أَنِّي لَا أَجِدُ فِي نَفْسِي لِأَحَدٍ مِنْ الْمُسْلِمِينَ غِشًّا وَلَا أَحْسُدُ أَحَدًا عَلَى خَيْرٍ أَعْطَاهُ اللَّهُ إِيَّاهُ<\/p>\n<p>I am as you have seen, except that I do not find dishonesty in my soul towards the Muslims and I do not envy anyone because of the good that Allah has given them.<\/p><\/blockquote>\n<p>Abdullah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذِهِ الَّتِي بَلَغَتْ بِكَ وَهِيَ الَّتِي لَا نُطِيقُ<\/p>\n<p>This is what you have achieved and it is something we have not accomplished.<\/p>\n<p>Source: Musnad Aḥmad 12286, Source: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/11\/23\/hadith-on-envy-the-man-went-to-paradise-because-he-purified-his-heart-from-malice-and-envy\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The way to purify the heart from envy, as performed by the man of Paradise, is to supplicate for Allah to retain and increase the blessings of the one that is envied. Whatever envy commands us to do, we should do the opposite. If envy urges us to hate someone, we should try to love good for them. If envy encourages us to condemn someone, we should supplicate for them.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><span style=\"line-height: 1.5;\">وأما العمل النافع فيه فهو أن يحكم الحسد فكل ما يتقاضاه الحسد من قول وفعل فينبغي أن يكلف نفسه نقيضه فإن حمله الحسد على القدح في محسوده كلف لسانه المدح له والثناء عليه وإن حمله على التكبر عليه ألزم نفسه التواضع له والاعتذار إليه &#8230; فَهَذِهِ هِيَ أَدْوِيَةُ الْحَسَدِ وَهِيَ نَافِعَةٌ جِدًّا إِلَّا أَنَّهَا مُرَّةٌ عَلَى الْقُلُوبِ جِدًّا وَلَكِنَّ النَّفْعَ فِي الدَّوَاءِ الْمُرِّ<\/span><\/p>\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5;\">As for beneficial deeds, it is to be a judge over envy. For everything that envy brings to court of sayings and deed, he should oblige himself to do its opposite. If envy compels him to disparage the envied, then he should oblige his tongue to praise him and commend him. If envy compels him to be arrogant against him, then he should require himself to be humble before him and apologize to him&#8230; These are the cures for envy and they are very beneficial, although they are very bitter for the heart. Rather, the benefit is in bitter medicine.<\/span><\/p>\n<p>Source: Iḥyāʼ Ulūm al-Dīn 3\/199<\/p><\/blockquote>\n<p>It takes a great amount of humility to intend and to do good for those we envy, but the benefits greatly outweigh the discomfort we feel from it. Hence, it was the habit of the Prophet to perform such supplications and good deeds every morning and evening in order to purify his heart.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ<\/p>\n<p><strong>O boy, if you are able every morning and evening to remove any rancor from your heart towards anyone, then do so.<\/strong><\/p><\/blockquote>\n<p>Then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ وَذَلِكَ مِنْ سُنَّتِي وَمَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجَنَّة<\/p>\n<p><strong>O boy, that is my tradition<\/strong> (<em>sunnah<\/em>) <strong>and whoever revives my tradition has loved me, and whoever loves me will be with me in Paradise<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2678, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/17\/hadith-on-hatred-o-boy-make-sure-your-heart-is-purified-from-rancor-envy-and-malice\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Finally, envy is only permissible in two cases: envy for knowledge and good deeds. This type of envy is not the hateful envy we have described, but rather it is admiration for good qualities.<\/p>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا حَسَدَ إِلَّا عَلَى اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ هَذَا الْكِتَابَ فَقَامَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَتَصَدَّقَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ<\/p>\n<p><strong>There is no envy except in two cases: a man whom Allah has given this Book so he stands to recite it during the day and night, and a man whom Allah has given wealth and he spends it during the day and night.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7091, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/16\/hadith-on-jealousy-there-is-no-envy-except-for-one-who-recites-quran-or-gives-charity\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Fudayl ibn Iyad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْغِبْطَةُ مِنَ الإِيمَانِ وَالْحَسَدُ مِنَ النِّفَاقِ وَالْمُؤْمِنُ يَغْبِطُ وَلا يَحْسِدُ وَالْمُنَافِقُ يَحْسِدُ وَلا يَغْبِطَ وَالْمُؤْمِنُ يَسْتُرُ وَيَعِظُ وَيَنْصَحُ وَالْفَاجِرُ يَهْتِكُ وَيُعَيِّرُ وَيُفْشِي<\/p>\n<p>Admiration is part of faith and envy is part of hypocrisy. The believer admires others and does not envy others, and the hypocrite envies others and does not admire others. The believer overlooks the faults of others, admonishes others, and gives good advice. The hypocrite disgraces others, insults others, and betrays others.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2015\/10\/21\/fudayl-on-faith-the-believer-is-happy-for-others-and-has-good-will-towards-others\/\">Hilyat al-Awliyā 11716<\/a><\/p><\/blockquote>\n<p>We ask Allah to purify our hearts of hatred and envy and to protect our good deeds from these destructive traits, and we ask Allah to fill us with positive admiration for the people of knowledge and righteousness.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Envy consumes good deeds just as fire burns wood,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[14,16,17,18,105,85,27,30,104,95,311,100,56,60,92,254,220,332],"class_list":["post-18033","post","type-post","status-publish","format-standard","hentry","category-featured","tag-arrogance-al-takabbur","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-envy-al-hasad","tag-fasting-al-siyam","tag-god-fearing-taqwa","tag-hatred-bigdah","tag-humility-al-tawaduh","tag-hypocrisy-al-nifaq","tag-malice-hiqd","tag-manners-al-adab","tag-monotheism-tawheed","tag-prayer-salat","tag-providence-al-qada-wal-qadr","tag-provision-al-rizq","tag-supplication-al-dua","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4GR","jetpack-related-posts":[{"id":13792,"url":"https:\/\/www.abuaminaelias.com\/beware-of-hatred-and-malice-in-islam\/","url_meta":{"origin":18033,"position":0},"title":"Malicious hatred is a spiritual disease in Islam","author":"Abu Amina Elias","date":"June 16, 2013","format":false,"excerpt":"\"Hatred is the razor, it shaves the religion and it does not shave hair.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18417,"url":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","url_meta":{"origin":18033,"position":1},"title":"Praying for enemies in Islam","author":"Abu Amina Elias","date":"November 2, 2016","format":false,"excerpt":"\"I was not sent to invoke curses, but rather I was only sent as mercy.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13188,"url":"https:\/\/www.abuaminaelias.com\/muslims-hate-infidels-neighbors\/","url_meta":{"origin":18033,"position":2},"title":"Are Muslims supposed to hate the infidels?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"None of you has faith until he loves for his brother what he loves for himself.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13845,"url":"https:\/\/www.abuaminaelias.com\/purification-heart-and-soul\/","url_meta":{"origin":18033,"position":3},"title":"Purification of the heart and soul in Islam","author":"Abu Amina Elias","date":"June 28, 2013","format":false,"excerpt":"\"He has succeeded who purifies himself...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20451,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-hatred-malice-boycotting\/","url_meta":{"origin":18033,"position":4},"title":"Imam al-Mundhiri on Mutual-Hatred, Grudges, and Boycotting","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Do not hate each other, do not envy each other,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20419,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-tazkiyyah-qalb-hasad\/","url_meta":{"origin":18033,"position":5},"title":"Imam al-Mundhiri on Purifying the Heart from Envy","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Faith and envy do not combine within a believing servant.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18033","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18033"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18033\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18033"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18033"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18033"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}