{"id":18143,"date":"2016-04-25T16:13:19","date_gmt":"2016-04-25T12:13:19","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18143"},"modified":"2022-03-23T11:51:13","modified_gmt":"2022-03-23T07:51:13","slug":"preserving-99-names-of-allah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/preserving-99-names-of-allah\/","title":{"rendered":"Preserving the ninety-nine Names of Allah"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Knowledge of the beautiful names and perfect attributes of Allah must be the beginning point for anyone who desires to learn about his or her Lord. These beautiful names are the supreme source from which the ethical virtues of Islam are derived, as every virtue is merely a reflection of the names and attributes of Allah.<\/p>\n<p>When this is understood, then every Muslim must learn the names of Allah and their implications for our behavior. Whoever takes care to understand and implement the ninety nine names of Allah will enter Paradise.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلَّهِ تِسْعَةٌ وَتِسْعُونَ اسْمًا مَنْ حَفِظَهَا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Allah has ninety nine names and whoever preserves them will enter Paradise.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2677, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/11\/10\/hadith-on-99-names-of-allah-whoever-memorizes-and-acts-upon-them-will-enter-paradise\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Of course, there are names of Allah that are hidden in the Unseen as the words of Allah cannot be limited, but there are ninety nine names explicitly stated or inferred in revelation that should be the focus of our attention. To preserve them means to have faith in them, to call upon Allah by them in prayer, to act by them, to respect their sanctity, and to be a reflection of their virtuous traits.<\/p>\n<p>An-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ حَفِظَهَا وَقِيلَ أَحْصَاهَا عَدَّهَا فِي الدُّعَاءِ بِهَا وَقِيلَ أَطَاقَهَا أَيْ أَحْسَنَ الْمُرَاعَاةَ لَهَا وَالْمُحَافَظَةَ عَلَى مَا تَقْتَضِيهِ وَصَدَّقَ بِمَعَانِيهَا وَقِيلَ مَعْنَاهُ الْعَمَلُ بِهَا وَالطَّاعَةُ بِكُلِّ اسْمِهَا<\/p>\n<p>To preserve them is said to mean to enumerate and count them in one’s supplication by them. It is said it means to persevere in them, to respect them in the best manner, to guard what they require, and to affirm their meanings. And it is said the meaning is to act by them and to obey Allah according to the implications of every name.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 2677<\/p><\/blockquote>\n<p>There are many authentic traditions in which the Prophet told us of the attributes of Allah, his love for their corresponding virtues, and in which encouraged us to act upon them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ إِنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّبًا<\/p>\n<p><strong>O people, Allah is pure and he accepts only what is pure.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1015, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/hadith-on-purity-allah-is-pure-and-good-and-he-accepts-only-what-is-purely-good\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ<\/p>\n<p><strong>Verily, Allah is kind and he loves kindness.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2593, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2010\/10\/01\/allah-is-gentle-and-loves-gentleness\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ جَمِيلٌ يُحِبُّ الْجَمَالَ<\/p>\n<p><strong>Verily, Allah is beautiful and he loves beauty.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/05\/arrogance-prevents-a-person-from-entering-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ كَرِيمٌ يُحِبُّ الْكَرَمَ وَمَعَالِيَ الأَخْلاقِ<\/p>\n<p><strong>Verily, Allah is generous and he loves generosity, and he loves exalted morals.<\/strong><\/p>\n<p>Source: Sunan al-Kubrā 19134, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/04\/08\/hadith-on-generosity-allah-is-generous-and-he-loves-generosity-and-good-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For this reason, the best Muslims are those who emulate the beautiful characteristics of Allah as much as it is possible for them to do so. The attributes of Allah are eternal and inherently good, so we ought to take them as the cherished values upon which we build our communities.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهذا شأن اسمائه الحسنى أحب خلقه اليه من اتصف بموجبها وأبغضهم اليه من اتصف باضدادها ولهذا يبغض الكفور الظالم والجاهل والقاسي القلب والبخيل والجبان والمهين واللئيم وهو سبحانه جميل يحب الجمال عليم يحب العلماء رحيم يحب الراحمين محسن يحب المحسنين شكور يحب الشاكرين صبور يحب الصابرين جواد يحب أهل الجود<\/p>\n<p>This a matter of the beautiful names of Allah. The most beloved creation to him are those who take on the implied characteristics and the most hateful of them are those who take on their opposite characteristics. For this reason, Allah hates unbelief, injustice, ignorance, hard-heartedness, miserliness, cowardice, disgrace, and wickedness. He, glory be to him, is beautiful and he loves the beautiful, he is knowledgeable and he loves the scholars, he is merciful and he loves the merciful, he is excellent and he loves those who act in the best manner, he is appreciative and he loves the grateful, he is patient and he loves the patient, and he is generous and he loves the generous.<\/p>\n<p>Source: ‘Uddat al-Ṣābirīn 1\/282-283<\/p><\/blockquote>\n<p>And Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهذه صفة من صفات الرب جل جلاله فإنه يعطي ولا يأخذ ويطعم ولا يطعم وهو أجود الأجودين وأكرم الأكرمين وأحب الخلق إليه من اتصف بمقتضيات صفاته فإنه كريم يحب الكريم من عباده وعالم يحب العلماء وقادر يحب الشجعان، وجميل يحب الجمال<\/p>\n<p>This attribute of generosity is an attribute of the Lord, the Majestic, for he gives and does not take, he feeds and is not fed. He is the most generous of the generous and the noblest of the noble. The most beloved creation to him are those who take on his necessary characteristics. Indeed, Allah is noble and love nobility from his servants, he is knowledgeable and he loves the scholars, he is powerful and he loves courage, and he is beautiful and he loves beauty.<\/p>\n<p>Source: al-Wābil al-Ṣayyib 1\/34<\/p><\/blockquote>\n<p>To be a reflection of the virtues in the name and attributes of Allah does not mean we have a share in the divinity, as nothing in the creation can be likened to the Creator. Rather, it means that Allah manifests his attributes through us.<\/p>\n<p>For example, if we are merciful to people and creatures, this is simply the mercy of Allah working through us. We do not share in the divinity, although we are a conduit for it.<\/p>\n<p>When we internalize and preserve the names of Allah in the best manner through a process of prayer and spiritual training, our will begins to coincide with the will of Allah and it is as if it is Allah himself acting through us. Allah then protects us from every evil and answers our supplications.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَالَ مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ وَيَدَهُ الَّتِي يَبْطِشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا وَإِنْ سَأَلَنِي لَأُعْطِيَنَّهُ وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ<\/p>\n<p><strong>Allah Almighty said: Whoever shows hostility to a friend of mine, then I have declared war upon him. My servant does not grow closer to me with anything more beloved to me than the duties I have imposed upon him. My servant continues to grow closer to me with extra good works until I love him. When I love him, I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes, and his foot with which he walks. Were he to ask something from me, I would surely give it to him. Were he to ask me for refuge, I would surely grant it to him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6137, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/04\/22\/hadith-on-loyalty-the-description-of-the-loyal-friends-and-allies-of-allah-and-that-allah-will-protect-them\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, if we want to bring our will to coincide with the will of Allah, we need to understand and preserve his beautiful names and perfect attributes.<\/p>\n<p>Al-Ghazali lists the ninety nine names of Allah in al-Maqṣad al-Asná 1\/60:<\/p>\n<ol>\n<li><em>Allāh<\/em> (God) الله<\/li>\n<li><em>Al-Raḥmān<\/em> (The Gracious) الرَّحْمَن<\/li>\n<li><em>Al-Raḥīm<\/em> (The Merciful) الرَّحِيم<\/li>\n<li><em>Al-Mālik<\/em> (The Sovereign) الْملك<\/li>\n<li><em>Al-Qudūs<\/em> (The Holy) القدوس<\/li>\n<li><em>Al-Salām<\/em> (The Peace) السَّلَام<\/li>\n<li><em>Al-Mu’min<\/em> (The Faithful) الْمُؤمن<\/li>\n<li><em>Al-Muhaymin<\/em> (The Protector) الْمُهَيْمِن<\/li>\n<li><em>Al-Azīz<\/em> (The Almighty) الْعَزِيز<\/li>\n<li><em>Al-Jabbār<\/em> (The Compeller) الْجَبَّار<\/li>\n<li><em>Al-Mutakabir<\/em> (The Supreme)المتكبر<\/li>\n<li><em>Al-Khāliq<\/em> (The Creator) الْخَالِق<\/li>\n<li><em>Al-Bārī <\/em>(The Maker) البارئ<\/li>\n<li><em>Al-Muṣawwir<\/em> (The Fashioner) المصور<\/li>\n<li><em>Al-Ghaffār<\/em> (The Forgiving) الْغفار<\/li>\n<li><em>Al-Qahhār<\/em> (The Prevailing) القهار<\/li>\n<li><em>Al-Wahhāb<\/em> (The Bestower) الْوَهَّاب<\/li>\n<li><em>Al-Razzāq<\/em> (The Provider) الرَّزَّاق<\/li>\n<li><em>Al-Fatāh<\/em> (The Opener) الفتاح<\/li>\n<li><em>Al-‘Alīm<\/em> (The Knowing) الْعَلِيم<\/li>\n<li><em>Al-Qābiḍ<\/em> (The Withholder) الْقَابِض<\/li>\n<li><em>Al-Bāsiṭ<\/em> (The Extender) الباسط<\/li>\n<li><em>Al-Khāfiḍ<\/em> (The Humbler) الْخَافِض<\/li>\n<li><em>Al-Rāfi’<\/em> (The Raiser) الرافع<\/li>\n<li><em>Al-Mu’iz<\/em> (The Honorer) المعز<\/li>\n<li><em>Al-Mudhil<\/em> (The Humiliater) المذل<\/li>\n<li><em>Al-Samī’<\/em> (The Hearing) السميع<\/li>\n<li><em>Al-Basīr<\/em> (The Seeing) البصير<\/li>\n<li><em>Al-Ḥakam<\/em> (The Judge) الحكم<\/li>\n<li><em>Al-‘Adl<\/em> (The Just) العدل<\/li>\n<li><em>Al-Laṭīf<\/em> (The Kind) اللطيف<\/li>\n<li><em>Al-Khabīr<\/em> (The Aware) الخبير<\/li>\n<li><em>Al-Ḥalīm<\/em> (The Forbearing) الحليم<\/li>\n<li><em>Al-Aẓīm<\/em> (The Grand) العظيم<\/li>\n<li><em>Al-Ghafūr<\/em> (The Exonerating) الغفور<\/li>\n<li><em>Al-Shakūr<\/em> (The Thankful) الشكور<\/li>\n<li><em>Al-‘Alī <\/em>(The Most High) العلي<\/li>\n<li><em>Al-Kabīr<\/em> (The Greatest) الكبير<\/li>\n<li><em>Al-Ḥafīẓ<\/em> (The Preserver) الحفيظ<\/li>\n<li><em>Al-Muqīt<\/em> (The Nourisher) المقيت<\/li>\n<li><em>Al-Ḥasīb<\/em> (The Reckoner) الحسيب<\/li>\n<li><em>Al-Jalīl<\/em> (The Sublime) الجليل<\/li>\n<li><em>Al-Karīm<\/em> (The Generous) الكريم<\/li>\n<li><em>Al-Raqīb<\/em> (The Watchful) الرقيب<\/li>\n<li><em>Al-Mujīb<\/em> (The Answerer) المجيب<\/li>\n<li><em>Al-Wāsi’<\/em> (The Expander) الواسع<\/li>\n<li><em>Al-Ḥakīm<\/em> (The Wise) الحكيم<\/li>\n<li><em>Al-Wadūd<\/em> (The Loving) الودود<\/li>\n<li><em>Al-Majīd<\/em> (The Glorious) المجيد<\/li>\n<li><em>Al-Bā’ith<\/em> (The Resurrector) الباعث<\/li>\n<li><em>Al-Shahīd<\/em> (The Witness) الشهيد<\/li>\n<li><em>Al-Ḥaqq<\/em> (The Truth) الحق<\/li>\n<li><em>Al-Wakīl<\/em> (The Trustee) الوكيل<\/li>\n<li><em>Al-Qawī<\/em> (The Powerful) القوي<\/li>\n<li><em>Al-Matīn<\/em> (The Strong) المتين<\/li>\n<li><em>Al-Walī<\/em> (The Defender) الولي<\/li>\n<li><em>Al-Ḥamīd<\/em> (The Praiseworthy) الحميد<\/li>\n<li><em>Al-Muḥṣi <\/em>(The Accountant) المحصي<\/li>\n<li><em>Al-Mubdī’<\/em> (The Initiator) المبدئ<\/li>\n<li><em>Al-Mu’īd<\/em> (The Restorer) المعيد<\/li>\n<li><em>Al-Muḥyī<\/em> (The Giver of Life) المحي<\/li>\n<li><em>Al-Mumīt<\/em> (The Causer of Death) المميت<\/li>\n<li><em>Al-Ḥayy<\/em> (The Living) الحي<\/li>\n<li><em>Al-Qayūm<\/em> (The Sustaining) القيوم<\/li>\n<li><em>Al-Wājid<\/em> (The Finder) الواجد<\/li>\n<li><em>Al-Mājid<\/em> (The Magnificent) الماجد<\/li>\n<li><em>Al-Wāhid<\/em> (The One) الواحد<\/li>\n<li><em>Al-Ṣamad<\/em> (The Eternal Refuge) الصمد<\/li>\n<li><em>Al-Qādir<\/em> (The Able) القادر<\/li>\n<li><em>Al-Muqtadir<\/em> (The Determiner) المقتدر<\/li>\n<li><em>Al-Muqaddim<\/em> (The Expediter) المقدم<\/li>\n<li><em>Al-Muakhir<\/em> (The Delayer) المؤخر<\/li>\n<li><em>Al-Awwal<\/em> (The First) الأول<\/li>\n<li><em>Al-Ākhir<\/em> (The Last) الآخر<\/li>\n<li><em>Al-Ẓāhir<\/em> (The Outward) الظاهر<\/li>\n<li><em>Al-Bāṭin<\/em> (The Inward) الباطن<\/li>\n<li><em>Al-Wāli<\/em> (The Governer) الوالي<\/li>\n<li><em>Al-Muta’ālī <\/em>(The Exalted) المتعالي<\/li>\n<li><em>Al-Birr<\/em> (The Righteous) البر<\/li>\n<li><em>Al-Tawwāb<\/em> (The Acceptor of Repentance) التواب<\/li>\n<li><em>Al-Muntaqim<\/em> (The Avenger) المنتقم<\/li>\n<li><em>Al-‘Afūw<\/em> (The Pardoner) العفو<\/li>\n<li><em>Al-Ra’ūf<\/em> (The Kind) الرؤوف<\/li>\n<li><em>Mālik al-Mulk<\/em> (The King of Kings) مالك الملك<\/li>\n<li><em>Dhu al-Jalāl wal-Ikrām<\/em> (The Majestic and Noble) ذو الجلال والإكرام<\/li>\n<li><em>Al-Muqsiṭ<\/em> (The Equitable) المقسط<\/li>\n<li><em>Al-Jāmi’<\/em> (The Gatherer) الجامع<\/li>\n<li><em>Al-Ghanī <\/em>(The Independent) الغني<\/li>\n<li><em>Al-Mughnī<\/em> (The Enricher) المغني<\/li>\n<li><em>Al-Māni’<\/em> (The Preventer) المانع<\/li>\n<li><em>Al-Ḍārr<\/em> (The Causer of Harm) الضار<\/li>\n<li><em>Al-Nāfi’<\/em> (The Causer of Benefit) النافع<\/li>\n<li><em>Al-Nūr<\/em> (The Light) النور<\/li>\n<li><em>Al-Hādī<\/em> (The Guider) الهادي<\/li>\n<li><em>Al-Badī’ (<\/em>The Origin) البديع<\/li>\n<li><em>Al-Bāqi<\/em> (The Remaining) الباقي<\/li>\n<li><em>Al-Wārith<\/em> (The Inheritor) الوارث<\/li>\n<li><em>Al-Rashīd<\/em> (The Director) الرشيد<\/li>\n<li><em>Al-Sabūr<\/em> (The Patient) الصبور<\/li>\n<\/ol>\n<p>We ask Allah to bring us closer to him with the knowledge of his names and to make us his righteous servants through whom he blesses the entire creation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, Allah is beautiful and he loves beauty.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[16,17,20,22,114,49,32,151,48,50,100,54,56,134,60,220,98],"class_list":["post-18143","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-creation-al-khalq","tag-excellence-ihsaan","tag-generosity-al-karam","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-ignorance-al-jahl","tag-justice-adl","tag-knowledge","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-prayer-salat","tag-supplication-al-dua","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4ID","jetpack-related-posts":[{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":18143,"position":0},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19795,"url":"https:\/\/www.abuaminaelias.com\/people-created-in-image-of-allah\/","url_meta":{"origin":18143,"position":1},"title":"People are created in the image of Allah","author":"Abu Amina Elias","date":"June 20, 2018","format":false,"excerpt":"\"Verily, Allah created Adam in His image.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":18143,"position":2},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22759,"url":"https:\/\/www.abuaminaelias.com\/999-of-1000-in-hellfire\/","url_meta":{"origin":18143,"position":3},"title":"Only one out of 1000 are in Paradise?","author":"Abu Amina Elias","date":"December 29, 2020","format":false,"excerpt":"\"Of every thousand, nine hundred and ninety-nine...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16482,"url":"https:\/\/www.abuaminaelias.com\/transcendency-of-allah-in-islam\/","url_meta":{"origin":18143,"position":4},"title":"Transcendency of Allah in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Most Merciful is established upon the Throne.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20861,"url":"https:\/\/www.abuaminaelias.com\/does-allah-exist-in-a-place\/","url_meta":{"origin":18143,"position":5},"title":"Does Allah exist in a place? A man in the sky?","author":"Abu Amina Elias","date":"August 29, 2019","format":false,"excerpt":"\"There is nothing like Him, for He is the Hearing, the Seeing.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18143","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18143"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18143\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18143"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18143"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}