{"id":18161,"date":"2016-05-02T12:09:59","date_gmt":"2016-05-02T08:09:59","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18161"},"modified":"2025-05-15T11:42:01","modified_gmt":"2025-05-15T07:42:01","slug":"follow-your-conscience-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/follow-your-conscience-in-islam\/","title":{"rendered":"Follow your conscience in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The human conscience (<em>al-ḍamīr<\/em>) has an important role to play in the daily life of a believer. It is a natural intuition that resides in the heart by which people can recognize good and evil. It acts as a source of guidance and moral authority for the individual, to be complemented and refined by the wisdom of divine revelation.<\/p>\n<p>The definition of righteousness in Islam is to have good character, a sincere inward disposition and pure heart that motivates one to do good deeds. Through this moral faculty one can recognize sin by how it affects the heart. If a believer is uncomfortable or hesitant to perform a deed and would be ashamed for people to see him doing it, then that is a strong indication that the deed is sinful.<\/p>\n<p>An-Nawwas ibn Sam’an reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ‏‏<\/p>\n<p><strong>Righteousness is good character and sin is what waivers in your heart and you hate for people to find out about it<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2553, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/09\/13\/righteousness-is-to-have-good-character-sin-is-known-by-human-nature\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: A man asked the Prophet, “What is faith?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا سَرَّتْكَ حَسَنَتُكَ وَسَاءَتْكَ سَيِّئَتُكَ فَأَنْتَ مُؤْمِنٌ<\/p>\n<p><strong>If you are happy with your good deeds and saddened by your evil deeds, then you are a believer.<\/strong><\/p><\/blockquote>\n<p>The man said, “O Messenger of Allah, what is sin?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا حَاكَ فِي نَفْسِكَ شَيْءٌ فَدَعْهُ<\/p>\n<p><strong>If something waivers in your soul, then you should abandon it.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 21695, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/01\/25\/hadith-on-sin-if-you-are-happy-with-righteousness-and-unhappy-with-evil-then-you-are-a-believer\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الإِثْمُ حَوَّازُ الْقُلُوبِ وَمَا كَانَ مِنْ نَظْرَةٍ فَإِنَّ لِلشَّيْطَانِ فِيهَا مَطْمَعًا<\/p>\n<p>Sin is disturbing to the heart. There is never a glimpse of it but that Satan has ambition for it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/03\/conscience-sin-agitates-heart\/\">al-Zuhd li-Hannād 935<\/a><\/p><\/blockquote>\n<p>Ibn Sirin, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَرَادَ اللَّهُ بِعَبْدٍ خَيْرًا جَعَلَ لَهُ وَاعِظًا مِنْ قَلْبِهِ يَأْمُرُهُ وَيَنْهَاهُ<\/p>\n<p>If Allah wills good for a servant, He appoints a preacher from his heart to command and prohibit him.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2024\/03\/28\/ibn-sireen-conscience\/\">al-Zuhd li-Aḥmad ibn Ḥanbal 1768<\/a><\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ فِي قَلْبِ كُلِّ مُؤْمِنٍ وَاعِظٌ وَالْوَاعِظُ الْأَمْرُ وَالنَّهْيُ بِتَرْغِيبِ وَتَرْهِيبٍ فَهَذَا الْأَمْرُ وَالنَّهْيُ الَّذِي يَقَعُ فِي قَلْبِ الْمُؤْمِنِ مُطَابِقٌ لِأَمْرِ الْقُرْآنِ وَنَهْيِهِ وَلِهَذَا يَقْوَى أَحَدُهُمَا بِالْآخَرِ<\/p>\n<p>In the heart of every believer is a preacher commanding and prohibiting by inspiring hope and inciting fear. This commanding and prohibiting occurs in the believer’s heart, building upon the commands and prohibitions of the Quran. Hence, each of them strengthens the other.<\/p>\n<p>Source: Majmū’ al-Fatāwá 10\/475<\/p><\/blockquote>\n<p>Believers do not reach the heights of faith until they abandon doubtful and dubious deeds. If our hearts and minds doubt a specific deed, then we should not do it.<\/p>\n<p>Hasan ibn Ali reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ فَإِنَّ الصِّدْقَ طُمَأْنِينَةٌ وَإِنَّ الْكَذِبَ رِيبَةٌ<\/p>\n<p><strong>Leave what makes you doubt for what does not make you doubt. Verily, truth brings peace of mind and falsehood sows doubt<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2518, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/hadith-on-doubt-leave-what-makes-you-doubt-to-what-does-not-make-you-doubt\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَبْلُغُ الْعَبْدُ حَقِيقَةَ التَّقْوَى حَتَّى يَدَعَ مَا حَاكَ فِي الصَّدْرِ<\/p>\n<p>The servant will not reach the reality of piety (<em>taqwā<\/em>) until he abandons what wavers in his heart.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 8<\/p><\/blockquote>\n<p>The moral conscience is part of the natural instinct (<em>al-fiṭrah<\/em>) that Allah embedded within the human soul. The divine revelation only activates the moral awareness inherent within people. The religion builds upon this natural moral awareness and refines it with wisdom and instruction.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ اللَّهِ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ<\/p>\n<p><strong>Direct your face toward the religion inclining to truth. Adhere to the nature of Allah upon which he has created all people. No change should there be in the creation of Allah. That is the correct religion, but most people do not know.<\/strong><\/p>\n<p>Surat al-Rūm 30:30<\/p><\/blockquote>\n<p>This is why Allah constantly refers to goodness as <em>ma’rūf<\/em>, which literally means the good that is well-known and recognized. In contrast, evil is referred to as <em>munkar<\/em>, which literally means evil that is unknown and rejected.<\/p>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِهَذَا سَمَّى اللَّهُ مَا أَمَرَ بِهِ مَعْرُوفًا وَمَا نَهَى عَنْهُ مُنْكَرًا<\/p>\n<p>For this reason, Allah has named what he commanded as well-known (<em>ma’rūf<\/em>), and what he prohibited as unknown (<em>munkar<\/em>).<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/95<\/p><\/blockquote>\n<p>Allah often commands the believers to performs deeds that are <em>ma’rūf<\/em>, good deeds that are not legally specified but whose appropriate context can be inferred by intuition. For example, Allah commands the trustees of property not to release the property to those who will spoil it, but rather to speak to them in a good manner.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقُولُوا لَهُمْ قَوْلًا مَّعْرُوفًا<\/p>\n<p><strong>And say to them an appropriate kind word<\/strong> (<em>ma’rūfa<\/em>).<\/p>\n<p>Surat al-Nisā 4:5<\/p><\/blockquote>\n<p>The commentators disagreed on the exact meaning of <em>ma’rūf<\/em> in this context, but they all understood it to mean a good word and an act of righteousness. The general meaning allows believers to use their instinct to determine the best thing to say when they encounter a similar situation. In other words, do what you know in your heart and mind is right.<\/p>\n<p>Moreover, part of the natural instinct in people is to feel a sense of guilt, shame, and regret when they do something wrong. Allah created this part of the human soul and swears an oath by it to draw our attention to it.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا أُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ<\/p>\n<p><strong>And I swear by the self-reproaching soul…<\/strong><\/p>\n<p>Surat al-Qiyāmah 75:2<\/p><\/blockquote>\n<p>The human heart naturally blames itself when it commits an evil deed, or blames itself for failing to perform a good deed.<\/p>\n<p>Ikramah explained the meaning of the self-reproaching soul, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَلُومُ عَلَى الْخَيْرِ وَالشَّرِّ<\/p>\n<p>It blames itself for good and evil.<\/p><\/blockquote>\n<p>And Mujahid said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَنْدَمُ عَلَى مَا فَاتَ وَتَلُومُ عَلَيْهِ<\/p>\n<p>It regrets what it missed and blames itself.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 75:2<\/p><\/blockquote>\n<p>Hence, the human conscience is a natural sense of justice and righteousness, an inner voice that people should listen to when making judgments in their daily lives. Feelings of guilt, regret, shame, or doubt are strong indicators that a particular deed is sinful. Likewise, feelings of tranquility, satisfaction, and peace of mind are the results of doing good deeds.<\/p>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَفِي الصَّفْحِ وَالْعَفْوِ وَالْحِلْمِ مِنَ الْحَلَاوَةِ وَالطُّمَأْنِينَةِ وَالسَّكِينَةِ وَشَرَفِ النَّفْسِ وَعِزِّهَا وَرِفْعَتِهَا عَنْ تَشَفِّيهَا بِالِانْتِقَامِ<\/p>\n<p>In clemency, forgiveness, and forbearance are the sweetness of faith, peace of mind, and tranquility, as well as the nobility of the soul, its honor, and its ascent over satisfaction with revenge.<\/p>\n<p>Source: Madārij al-Sālikīn 2\/303<\/p><\/blockquote>\n<p>Believers ought to follow their conscience even if it conflicts with the religious verdict (<em>fatwā<\/em>) of a learned scholar (<em>muftī<\/em>). Islam does not encourage people to blindly follow religious leaders when their hearts tell them otherwise.<\/p>\n<p>Abu Tha’laba reported: I said, “O Messenger of Allah, tell me what is lawful and unlawful for me.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْبِرُّ مَا سَكَنَتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا لَمْ تَسْكُنْ إِلَيْهِ النَّفْسُ وَلَمْ يَطْمَئِنَّ إِلَيْهِ الْقَلْبُ وَإِنْ أَفْتَاكَ الْمُفْتُونَ<\/p>\n<p><strong>Righteousness is serenity in the soul and peace of mind in the heart. Sin is not comfortable in the soul and not satisfying to the heart, even if the judge<\/strong> (<em>muftī<\/em>) <strong>gives you approval<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 17396, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/30\/hadith-on-righteousness-beware-of-what-disturbs-the-soul-even-if-scholars-approve-it\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Wabisa ibn Ma’bad reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِئْتَ تَسْأَلُ عَنْ الْبِرِّ وَالْإِثْمِ<\/p>\n<p><strong>Have you come to ask about righteousness and sin<\/strong>?<\/p><\/blockquote>\n<p>I said yes. The Prophet clenched his fist and struck his chest, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ يَا وَابِصَةُ ثَلَاثًا الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ<\/p>\n<p><strong>Consult your soul, consult your heart, O Wabisa. Righteousness is what reassures your soul and your heart, and sin is what wavers in your soul and puts tension in your chest, even if the people approve it in their judgments again and again<\/strong>.<\/p>\n<p>Source: Sunan al-Dārimī 2533, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/06\/25\/hadith-on-righteousness-consult-your-heart-about-righteousness-and-sin-even-if-the-people-give-you-a-judgment\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdur Rahman ibn Mu’awiyah reported: A man asked the Prophet, saying, “O Messenger of Allah, what is lawful and unlawful for me?” The Messenger of Allah, peace and blessings be upon him, struck his chest and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَنْكَرَ قَلْبُكَ فَدَعْهُ<\/p>\n<p><strong>Whatever your heart rejects, then abandon it<\/strong>.<\/p>\n<p>Source: al-Zuhd wal-Raqā’iq 1147, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/05\/01\/hadith-on-conscience-whatever-your-heart-rejects-then-do-not-accept-it\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكُمْ وَحَزَّازَ الْقُلُوبِ وَمَا حَزَّ فِي قَلْبِكِ مِنْ شَيْءٍ فَدَعْهُ<\/p>\n<p>Beware of what disturbs the hearts. If something unsettles your heart, then abandon it.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/95<\/p><\/blockquote>\n<p>The reason scholars are not blindly followed, even if they are very pious and learned, is because everyone makes mistakes. Every judge gives a bad judgment at one time or another, every scholar has a gap in his knowledge. Wise men and women, in fact, are not immune from error. If the statement of a wise person conflicts with our conscience, then we should not accept it.<\/p>\n<p>Abu Idrees reprted: Mu’adh ibn Jabal, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأُحَذِّرُكُمْ زَيْغَةَ الْحَكِيمِ فَإِنَّ الشَّيْطَانَ يَقُولُ فِي الْحَكِيمِ كَلِمَةَ الضَّلالَةِ وَقَدْ يَقُولُ الْمُنَافِقُ كَلِمَةَ الْحَقِّ<\/p>\n<p>I warn you of the deviation of the wise man, for Satan can speak a word of misguidance through the wise man and the hypocrite can speak the truth. Thus, accept the truth for upon the truth is light.<\/p><\/blockquote>\n<p>They said, “How can we know if the wise man, may Allah have mercy on him, has spoken misguidance?” Mu’adh said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هِيَ كَلِمَةٌ تُنْكِرُونَهَا مِنْهُ وَتَقُولُونَ مَا هَذِهِ فَلا يُثْنِيكُمْ فَإِنَّهُ يُوشِكُ أَنْ يَفِئَ وَيُرَاجِعَ بَعْضَ مَا تَعْرِفُونَ وَإِنَّ الْعَمَلَ وَالإِيمَانَ مَكَانَهُمَا إِلَى يَوْمِ الْقِيَامَةِ مَنِ ابْتَغَاهُمَا وَجَدَهُمَا<\/p>\n<p>It is a word you reject from him and you say: What is this? Yet do not turn away from him, for he may retract it and return to some of what you recognize. Verily, the place of faith and deeds is set until the Day of Resurrection, so whoever seeks them will find them.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/05\/01\/muadh-on-conscience-beware-if-a-wise-man-contradicts-your-conscience\/\">Hilyat al-Awliyā 819<\/a><\/p><\/blockquote>\n<p>The moral conscience of the believer is a very important check on the misuse or abuse of the religion. Every person has the potential to misunderstand the wisdom of divine revelation, misinterpret the sacred texts, misapply the principles, or, in the worst case, deliberately use the scripture for an evil purpose. To compensate for this, Allah gave us an innate sense of justice and righteousness to complement our understanding and interpretation of the Quran and Sunnah.<\/p>\n<p>Nevertheless, the human conscience cannot be an absolute moral authority for the believer. It has to be aided by knowledge, reason, and the wisdom of divine revelation. Every person begins life with a pure conscience but external influences, bad characters, and satanic suggestions corrupt the hearts and minds of people. When the hearts are corrupt and the minds are ignorant, the conscience might become a source of misguidance.<\/p>\n<p>Iyad ibn Himar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنِّي خَلَقْتُ عِبَادِي حُنَفَاءَ كُلَّهُمْ وَإِنَّهُمْ أَتَتْهُمْ الشَّيَاطِينُ فَاجْتَالَتْهُمْ عَنْ دِينِهِمْ وَحَرَّمَتْ عَلَيْهِمْ مَا أَحْلَلْتُ لَهُمْ وَأَمَرَتْهُمْ أَنْ لَا يُشْرِكُوا بِي مَا لَمْ أُنْزِلْ بِهِ سُلْطَانًا<\/p>\n<p><strong>Allah said: I have created all of my servants as true believers but devils turn them away from their religion. They make unlawful what is lawful for them, and they command them to associate partners with me although no authority has been revealed for them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2865, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/10\/31\/hadith-on-monotheism-human-beings-were-made-to-worship-allah-but-satan-leads-people-astray\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Everyone has a natural sense of shame that should be a source of moral guidance. But some people suppress their sense of shame again and again until it nearly disappears. When shame is gone, a person will do whatever they want regardless of whether it is good or evil. They will never be restrained by guilt or regret.<\/p>\n<p>Abu Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ إِذَا لَمْ تَسْتَحْيِ فَافْعَلْ مَا شِئْتَ<\/p>\n<p><strong>Verily, among the words people obtained from the prophets are this: If you feel no shame, then do as you wish<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3296, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/05\/22\/hadith-on-shame-a-person-without-shame-will-do-whatever-he-pleases\/\">Sahih <\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thus, the conscience is an important source of moral guidance, but it is not the only source of guidance.<\/p>\n<p>In sum, the believers and human beings more generally are born with a pure conscience that helps them recognize good and evil. The divine revelation activates the conscience of the believers, refines it, and guides it to its best form. At the same time, the conscience is a check on the abuse and misuse of the scripture. The highest level of moral clarity can be achieved when the conscience is brought into harmony and reconciled with the principles of religion.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Leave what makes you doubt for what does not make you doubt.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[16,20,49,48,100,55,93,56,103,301,45,179],"class_list":["post-18161","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-character-akhlaq","tag-creation-al-khalq","tag-gentleness-al-rifq","tag-justice-adl","tag-manners-al-adab","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-public-welfare-al-maslaha","tag-pure-nature-fitrah","tag-quran-exegesis-tafsir","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4IV","jetpack-related-posts":[{"id":20074,"url":"https:\/\/www.abuaminaelias.com\/developing-moral-wisdom-in-islam\/","url_meta":{"origin":18161,"position":0},"title":"Developing moral wisdom in Islam","author":"Abu Amina Elias","date":"January 3, 2019","format":false,"excerpt":"\"Thus, We have ordained a law upon you in the matter,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17719,"url":"https:\/\/www.abuaminaelias.com\/good-character-salvation\/","url_meta":{"origin":18161,"position":1},"title":"Good character, the path to salvation in Islam","author":"Abu Amina Elias","date":"February 13, 2016","format":false,"excerpt":"\"I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14832,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-use-profanity\/","url_meta":{"origin":18161,"position":2},"title":"Did Prophet Muhammad use profanity?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The believer does not use profanity...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22690,"url":"https:\/\/www.abuaminaelias.com\/showing-love-and-affection-to-unbelievers\/","url_meta":{"origin":18161,"position":3},"title":"Showing love and affection to unbelievers","author":"Abu Amina Elias","date":"November 11, 2020","format":false,"excerpt":"\"I do not ask you anything for it, except affection due to relatives.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":18161,"position":4},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21662,"url":"https:\/\/www.abuaminaelias.com\/whoever-knows-himself-knows-his-lord\/","url_meta":{"origin":18161,"position":5},"title":"Whoever knows himself, knows his Lord","author":"Abu Amina Elias","date":"February 11, 2020","format":false,"excerpt":"\"Whoever knows himself, knows his Lord.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18161","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18161"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18161\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}