{"id":18213,"date":"2016-06-04T17:37:51","date_gmt":"2016-06-04T13:37:51","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18213"},"modified":"2020-07-17T21:58:18","modified_gmt":"2020-07-17T17:58:18","slug":"positive-thinking-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/positive-thinking-in-islam\/","title":{"rendered":"Positive thinking and optimism in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Our thoughts have a powerful ability to determine our feelings and emotional states and ultimately affect how we behave, for better or worse. Islam teaches us to direct the act reflection (<em>tafakkur<\/em>), or deep thought, towards the signs of Allah, the names and attributes of Allah, to his blessings and wonders, to hope in the Hereafter, and to optimism. By controlling our thought processes in a positive manner, we can increase the effectiveness of our prayers and worship as well as relieve ourselves from the anger, depression, and anxieties that worldly thoughts induce.<\/p>\n<p>Contrary to popular belief, we have control over which thoughts we choose to follow. We may not have a choice over which particular thought occurs initially in our minds at a given time, but we do have a choice to either ignore it or pursue it.<\/p>\n<p>Our voluntary thoughts are nothing more than inward statements. Hence, the rule is that we should only engage good thoughts or keep our minds silent.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ<\/p>\n<p><strong>Whoever believes in Allah and the Last Day, let him speak goodness or remain silent.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6110, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/06\/03\/hadith-on-neighbors-let-him-not-harm-his-neighbor-let-him-speak-goodness\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sometimes Satan will throw evil suggestions into our minds. These suggestions have no power over us unless we choose to act on them. If we follow an evil or negative train of thought, then it will lead us to a terrible end.<\/p>\n<p>Thus, when we find ourselves caught up in a bad line of thinking, we need to immediately replace these negative thoughts with positive inward statements to cancel their effects.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا<\/p>\n<p><strong>Follow a bad deed with a good deed and it will erase it.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1987, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/17\/hadith-on-character-fear-allah-wherever-you-are-behave-with-good-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Positive thoughts are those that produce good feelings, good deeds, peace of mind, gratitude, tranquility, contentment, and other positive emotional states. These are truthful thoughts about Allah, hope in the Hereafter, the prophets, our blessings, good deeds, and so on. They produce wisdom and enlightenment in the heart.<\/p>\n<p>Negative thoughts are those that produce bad feelings, anger, envy, jealousy, hatred, anxiety, depression, and other negative emotional states. These are thoughts about the world, our wealth, our status, people we do not like or who have wronged us, and so on. The cause of these thoughts is an attachment to the delusions of worldly and materialistic life that cloud the heart and prevent its purification.<\/p>\n<p>Abu Sulaiman, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْفِكْرُ فِي الدُّنْيَا حِجَابٌ عَنِ الآخِرَةِ وَعُقُوبَةٌ لأَهْلِ الْوَلايَةِ وَالْفِكْرَةُ فِي الآخِرَةِ تُورِثُ الْحِكْمَةَ وَتُحْيِي الْقَلْبَ وَمَنْ نَظَرَ إِلَى الدُّنْيَا مُوَلِّيَةً صَحَّ عِنْدَهُ غُرُورُهَا<\/p>\n<p>Thought upon the world is a veil over the Hereafter and a punishment for the people. Thought upon the Hereafter produces wisdom and life in the heart. Whoever looks to the world as his protector will come to accept its delusions.<\/p>\n<p>Source: Hilyat al-Awliyā 14447<\/p><\/blockquote>\n<p>Not all thoughts about the world are evil. Thinking about something Allah blessed us with in the world is good. And we have a duty to take care of our worldly affairs, meet our work obligations, pay our bills, fulfill our trusts, and so on. We should think about these things <em>in so far as they are necessary and beneficial<\/em>.<\/p>\n<p>For example, we may need to think about how we are going to complete a work project. But perhaps at work someone said a mean word to us or did something to annoy us. If we constantly dwell upon that negative interaction, it will only cause harm to us and produce no benefit. It is an unnecessary worldly thought and should be dismissed.<\/p>\n<p>In fact, a step on the road to excellence in Islam is learning to think about only those things that should concern us.<\/p>\n<p>Ali ibn Hussein reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكَهُ مَا لَا يَعْنِيهِ<\/p>\n<p><strong>Verily, part of perfection in Islam is for a person to leave what does not concern him.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2318, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/05\/21\/hadith-on-islam-perfection-in-islam-is-to-leave-what-is-unbeneficial\/\">Sahih li ghayri<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأنفع الدَّوَاء أَن تشغل نَفسك بالفكر فِيمَا يَعْنِيك دون مَالا يَعْنِيك فالفكر فِيمَا لَا يَعْنِي بَاب كل شَرّ وَمن فكّر فِيمَا لَا يعنيه فَاتَهُ مَا يعنيه<\/p>\n<p>The most beneficial remedy is that you preoccupy yourself with thoughts of what should concern you and not those that should not concern you. Thinking about what does not matter to you is the door of every evil. Whoever reflects upon what does not concern him, then he will miss what does concern him.<\/p>\n<p>Source: al-Fawā’id 1\/175<\/p><\/blockquote>\n<p>This means busying ourselves with worldly thoughts only to the extent necessary, and also learning not to worry about matters beyond our circle of influence or control. If we constantly worry or get upset by things we cannot change, that will take our attention away from what we can change.<\/p>\n<p>After understanding the effects of positive and negative thoughts, we then need to direct our thought processes towards positive trains of thought and learn to dismiss negative thoughts before they take us into a downward spiral. Many of the Prophet’s companions considered the skill to direct thought in a positive way as the enlightenment of true faith.<\/p>\n<p>Amir ibn Abdi Qais, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَمِعْتُ غَيْرَ وَاحِدٍ وَلَا اثْنَيْنِ وَلَا ثَلَاثَةٍ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُونَ إِنَّ ضِيَاءَ الْإِيمَانِ أَوْ نُورَ الْإِيمَانِ التَّفَكُّرُ<\/p>\n<p>I heard from more than one or two or three of the companions of Muhammad, peace and blessings be upon him, that they said the radiance or light of faith is in reflection.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/05\/23\/umar-ii-on-thought-thinking-about-the-blessings-of-allah-is-the-best-worship\/\">al-Durr al-Manthūr 3:190<\/a><\/p><\/blockquote>\n<p>Thinking about the blessings of Allah is itself an act of worship that leads to gratitude, contentment, and happiness. It takes no significant effort from us and yet it produces great results in our lives.<\/p>\n<p>Umar ibn Abdul Aziz, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكَلَامُ بِذِكْرِ اللَّهِ عَزَّ وَجَلَّ حَسَنٌ وَالْفِكْرَةُ فِي نِعَمِ اللَّهِ أَفْضَلُ الْعِبَادَةِ<\/p>\n<p>Speaking in remembrance of Allah the Exalted is good, yet thought upon the blessings of Allah is the best act of worship.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/05\/23\/umar-ii-on-thought-thinking-about-the-blessings-of-allah-is-the-best-worship\/\">Tafsīr Ibn Kathīr 3:190<\/a><\/p><\/blockquote>\n<p>All of this points to the fact that the believers should be optimistic and not pessimistic or cynical. There are no omens in Islam (or signs that predict the future), but the believers are always expecting the best from Allah even if they do not know exactly how it will be.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا طِيَرَةَ وَخَيْرُهَا الْفَأْلُ<\/p>\n<p><strong>There are no omens, but the best of it is optimism.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, what is optimism?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكَلِمَةُ الصَّالِحَةُ يَسْمَعُهَا<\/p>\n<p><strong>A righteous word one of you hears.<\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُعْجِبُنِي الْفَأْلُ الْكَلِمَةُ الْحَسَنَةُ الْكَلِمَةُ الطَّيِّبَةُ<\/p>\n<p><strong>I am amazed by optimism, the good word, the kind word<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5422, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/06\/04\/hadith-on-optimism-the-prophet-is-amazed-by-kind-words-of-optimism\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong> <\/a><\/p><\/blockquote>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَفَاءَلُ وَلَا يَتَطَيَّرُ وَيُعْجِبُهُ الِاسْمُ الْحَسَنُ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, was optimistic and he did not see evil omens, and he liked good names.<\/p>\n<p>Source: Musnad Aḥmad 2762, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/06\/16\/hadith-on-optimism-the-prophet-was-optimistic-and-had-good-expectations\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Positive thinking and optimism are most important as they relate to our prayers, supplications, and acts of worship. A prayer or supplication that is offered with certainty that Allah will answer is far more effective and beneficial than a weak prayer. For this reason, the Prophet told us to pray to Allah in the certain knowledge that he will answer.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا دَعَا أَحَدُكُمْ فَلْيَعْزِمْ فِي الدُّعَاءِ وَلاَ يَقُلِ اللَّهُمَّ إِنْ شِئْتَ فَأَعْطِنِي فَإِنَّ اللَّهَ لاَ مُسْتَكْرِهَ لَه<\/p>\n<p><strong>When one of you supplicates, let him be determined in the supplication and he should not say: O Allah, give me if you will. There is no one to coerce Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5979, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/03\/19\/be-determined-in-your-supplications\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْعُوا اللَّهَ وَأَنْتُمْ مُوقِنُونَ بِالْإِجَابَةِ<\/p>\n<p><strong>Call upon Allah with certainty that he will answer you.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3479, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/03\/17\/hadith-on-supplication-call-upon-allah-with-certainty-and-without-heedlessness\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>This means we should pray while believing <em>that<\/em> <em>Allah has already answered us in the best manner<\/em>.<\/p>\n<p>Ibn Hajar comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَعْنَى الْأَمْرِ بِالْعَزْمِ الْجِدُّ فِيهِ وَأَنْ يَجْزِمَ بِوُقُوعِ مَطْلُوبِهِ<\/p>\n<p>The meaning of determination is to be persistent in the supplication and to affirm that what is asked will occur.<\/p>\n<p>Source: Fatḥ al-Bārī 5979<\/p><\/blockquote>\n<p>And An-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُوَ حُسْنُ الظَّنِّ بِاَللَّهِ تَعَالَى فِي الْإِجَابَةِ<\/p>\n<p>It is to have good expectations (<em>ḥusn al-ẓann<\/em>) that Allah the Exalted will answer you.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 2678<\/p><\/blockquote>\n<p>Once we make a supplication, we should affirm it in our hearts and minds that Allah <em>has without a doubt already heard and answered us<\/em>. Let the prayer sink into the bottom of your heart and penetrate your subconscious mind.<\/p>\n<p>Sometimes the answer does not come the way we would expect. But as long as we pray for good and expect good, the answer has already been fulfilled even if we do not know how.<\/p>\n<p>Abu Sa’eed Al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ مُسْلِمٍ يَدْعُو بِدَعْوَةٍ لَيْسَ فِيهَا إِثْمٌ وَلَا قَطِيعَةُ رَحِمٍ إِلَّا أَعْطَاهُ اللَّهُ بِهَا إِحْدَى ثَلَاثٍ إِمَّا أَنْ تُعَجَّلَ لَهُ دَعْوَتُهُ وَإِمَّا أَنْ يَدَّخِرَهَا لَهُ فِي الْآخِرَةِ وَإِمَّا أَنْ يَصْرِفَ عَنْهُ مِنْ السُّوءِ مِثْلَهَا قَالُوا إِذًا نُكْثِرُ قَالَ اللَّهُ أَكْثَرُ<\/p>\n<p><strong>There is no Muslim who supplicates to Allah without sin or cutting family ties in it but that Allah will give him one of three answers: he will hasten fulfillment of his supplication, he will store it for him in the Hereafter, or he will divert an evil from him similar to it<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 10749, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/05\/25\/hadith-on-supplication-allah-will-answer-a-righteous-supplication-in-three-ways\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As long as we continue praying and supplicating, the answer is sure to come even if it is stored for the next life. In contrast, we are in danger of having our prayers unanswered if we get frustrated or stop praying altogether.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُسْتَجَابُ لِأَحَدِكُمْ مَا لَمْ يَعْجَلْ يَقُولُ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي<\/p>\n<p><strong>Every one of you will have his supplications answered as long as he is not impatient and he says: I have supplicated but I was not answered<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5981, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/05\/25\/hadith-on-supplication-every-supplication-is-answered-unless-it-is-sinful-or-impatient\/\">Muttafaqun Alayhi <\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Many of us do not have our prayers answered because we do not pray in a good manner, we pray for sinful things, we do not expect good from Allah, or we simply give up. In this respect, the Prophet is the best role model for us to learn how to pray and what to pray for. The real secret of prayer, though, is that we will get good from Allah to the measure that we expect good from him.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace be and blessings on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ تَعَالَى أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا ذَكَرَنِي<\/p>\n<p><strong>Allah the Exalted says: I am as my servant expects me and I am with him as he remembers me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6970, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/01\/07\/the-virtue-of-remembrance\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ ظَنَّ بِي خَيْرًا فَلَهُ وَإِنْ ظَنَّ شَرًّا فَلَهُ<\/p>\n<p><strong>Allah says: If he thinks good of me, he will have it. And if he thinks evil of me, he will have it<\/strong>.<\/p>\n<p>Musnad Aḥmad 8833, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Our prayers need to be accompanied with certainty and conviction that our good expectations will be fulfilled. We have to constantly reaffirm and reinforce our prayers with the positive thoughts that Allah heard us and has already answered us in the best manner. Thinking well about Allah in this way is another step on the road to excellence in Islam.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ حُسْنَ الظَّنِّ بِاللَّهِ مِنْ حُسْنِ عِبَادَةِ اللَّهِ<\/p>\n<p><strong>Verily, thinking well about Allah is a part of excellent worship of Allah<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3970, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/03\/28\/hadith-on-worship-thinking-good-thoughts-about-allah-is-part-of-excellent-worship\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In sum, Islam teaches us to direct our thoughts towards what is good and to ignore bad thoughts. Like outward statements, thoughts we pursue are simply inward statements that should be good or at least neutral. If we entertain a bad thought, we should follow it with several positive inward statements to cancel its effect. Positive thinking should lead to an optimistic outlook and good expectations in Allah and his mercy. These good expectations are the inner secret that makes our prayers and worship most effective and fulfilling.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;I am as my servant expects Me and I am with him as he remembers Me.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[13,105,22,24,49,322,30,32,100,54,56,134,60,84,66,91,68,220,332],"class_list":["post-18213","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-anger-al-ghadhab","tag-envy-al-hasad","tag-excellence-ihsaan","tag-family-ties-sillat-rahim","tag-gentleness-al-rifq","tag-gratitude-al-shukr","tag-hatred-bigdah","tag-hereafter-akhirah","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-prayer-salat","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-remembrance-dhikr","tag-righteous-predecessors-al-salaf-al-salih","tag-satan-al-shaytan","tag-supplication-al-dua","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4JL","jetpack-related-posts":[{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":18213,"position":0},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15522,"url":"https:\/\/www.abuaminaelias.com\/attributes-of-success-in-the-hereafter\/","url_meta":{"origin":18213,"position":1},"title":"Attributes of success in the Hereafter","author":"Abu Amina Elias","date":"February 24, 2014","format":false,"excerpt":"\"Certainly the believers have succeeded.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16523,"url":"https:\/\/www.abuaminaelias.com\/blessed-are-the-strangers-in-islam\/","url_meta":{"origin":18213,"position":2},"title":"Blessed are the strangers in Islam","author":"Abu Amina Elias","date":"April 10, 2015","format":false,"excerpt":"\"Be in this world as if you were a stranger or a traveler along a path.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16910,"url":"https:\/\/www.abuaminaelias.com\/helping-refugees-and-emigrants-in-islam\/","url_meta":{"origin":18213,"position":3},"title":"Helping refugees and emigrants in Islam","author":"Abu Amina Elias","date":"August 26, 2015","format":false,"excerpt":"\"Whoever helps ease someone in difficulty, Allah will make it easy for him in this world and in the Hereafter.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13762,"url":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","url_meta":{"origin":18213,"position":4},"title":"Salvation for non-Muslims outside of Islam?","author":"Abu Amina Elias","date":"June 8, 2013","format":false,"excerpt":"\"Allah will judge between them on the Day of Resurrection.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16316,"url":"https:\/\/www.abuaminaelias.com\/required-muslims-one-ruler\/","url_meta":{"origin":18213,"position":5},"title":"Muslims must only have one ruler?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not be among those who commit idolatry...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18213","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18213"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18213\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18213"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18213"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}