{"id":18273,"date":"2016-06-14T12:59:45","date_gmt":"2016-06-14T08:59:45","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18273"},"modified":"2025-03-22T10:18:01","modified_gmt":"2025-03-22T06:18:01","slug":"beware-dua-of-the-oppressed","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/beware-dua-of-the-oppressed\/","title":{"rendered":"Beware the Supplication of the Oppressed"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam was revealed to protect the natural rights of all human beings, their inalienable rights to life, property, and freedom. Violating these rights for any reason without a just cause is a major sin and it is a betrayal of Islam if Muslims claim such injustice is legislated by the Quran and Sunnah.<\/p>\n<p>One reason we should be fearful of committing oppression is that Allah will <em>always<\/em> answer the supplication of an oppressed person.<\/p>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ حِجَابٌ<\/p>\n<p><strong>Beware of the supplication of the oppressed, for there is no veil between it and Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4347, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/08\/priorities-islam\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا دَعَوَاتِ الْمَظْلُومِ فَإِنَّهَا تَصْعَدُ إِلَى السَّمَاءِ كَأَنَّهَا شَرَارٌ<\/p>\n<p><strong>Beware of the supplication of the oppressed, for it ascends to Allah as if it were a flare.<\/strong><\/p>\n<p>Source: al-Mustadrak ‘alá al-Ṣaḥīḥayn 81, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/06\/14\/dua-oppressed-ascends-heaven\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Khuzaymah ibn Thabit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا دَعْوَةَ الْمَظْلُومِ فَإِنَّهَا تُحْمَلُ عَلَى الْغَمَامِ يَقُولُ اللَّهُ جَلَّ جَلالُهُ وَعِزَّتِي وَجَلالِي لأَنْصُرَنَّكَ وَلَوْ بَعْدَ حِينٍ<\/p>\n<p><strong>Beware of the supplication of the oppressed, for it is carried above the clouds. Allah Almighty says: By My might and majesty, I will help you in due time<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 3718, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/06\/14\/supplication-oppressed-eventually-answered\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثَةٌ لَا تُرَدُّ دَعْوَتُهُمْ الصَّائِمُ حَتَّى يُفْطِرَ وَالْإِمَامُ الْعَادِلُ وَدَعْوَةُ الْمَظْلُومِ يَرْفَعُهَا اللَّهُ فَوْقَ الْغَمَامِ وَيَفْتَحُ لَهَا أَبْوَابَ السَّمَاءِ وَيَقُولُ الرَّبُّ وَعِزَّتِي لَأَنْصُرَنَّكِ وَلَوْ بَعْدَ حِينٍ<\/p>\n<p><strong>The supplications of three are never turned back: a fasting person until he breaks his fast, a just leader, and the supplication of the oppressed is raised above the clouds by Allah, the gates of heaven open for it and the Lord says: By My might, I will surely help you in due time.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3598, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/05\/03\/three-people-always-answered\/\">Hasan<\/a><\/p><\/blockquote>\n<p>Aslam reported: Umar ibn al-Khattab, may Allah be pleased with him, appointed a client of his named Hunayy to tend the pasture, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا هُنَيُّ ضْمُمْ جَنَاحَكَ عَنِ المُسْلِمِينَ وَاتَّقِ دَعْوَةَ المَظْلُومِ فَإِنَّ دَعْوَةَ المَظْلُومِ مُسْتَجَابَةٌ<\/p>\n<p>O Hunayy, lower your wing for the Muslims and beware the supplication of the oppressed, for the supplication of the oppressed is answered.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3059, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/11\/dua-oppressed-answered\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثَةٌ لَا تُرَدُّ دَعْوَتَهُمُ الْإِمَامُ الْعَادِلُ عَلَى رَعِيَّتِهِ وَالْوَالِدُ عَلَى وَلَدِهِ وَدَعْوَةُ الْمَظْلُومِ<\/p>\n<p>Three supplications are never turned away: a just leader for his subjects, a parent over his child, and the supplication of the oppressed.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/11\/ali-three-dua\/\">Musnad ibn al-Jaʻd 2401<\/a><\/p><\/blockquote>\n<p>If we commit an act of injustice against someone, that person has a free supplication they can use against us. Will they ask Allah to punish us? Will they supplicate for evil against us? When we oppress them, we are actually turning ourselves over to their mercy, and oppressed people are not often interested in compassion or forgiveness for their oppressors.<\/p>\n<p>On the other hand, if we ourselves are the victims of injustice, we can take comfort in the fact that we have a supplication that is guaranteed to be answered. We should use it to supplicate for goodness, rather than wasting it on vengeance.<\/p>\n<p>The supplication of an oppressed person is always answered even if that person is an unbeliever or a sinner. Justice and the fulfillment of human rights are to be enjoyed by all people regardless of their religion.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا دَعْوَةَ الْمَظْلُومِ وَإِنْ كَانَ كَافِرًا فَإِنَّهُ لَيْسَ دُونَهَا حِجَابٌ<\/p>\n<p><strong>Beware of the supplication of the oppressed, even if he is an unbeliever, for there is nothing to block it.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 12549, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/dua-oppressed-kafir\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعْوَةُ الْمَظْلُومِ مُسْتَجَابَةٌ وَإِنْ كَانَ فَاجِرًا فَفُجُورُهُ عَلَى نَفْسِهِ<\/p>\n<p><strong>The supplication of the oppressed is answered, even if he is wicked, for only his wickedness is against himself<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 8795, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/06\/14\/dua-oppressed-wicked\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>A person’s religion or personal sins, then, are no excuse to unjustly harm them in any way. Islam exalts justice as a universal value through which human beings must relate to one another and forbids the oppression of all people.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ وَالْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ<\/p>\n<p><strong>Indeed, Allah commands justice, grace, as well as generosity to close relatives. He forbids indecency, wickedness, and aggression. He instructs you so perhaps you will be mindful.<\/strong><\/p>\n<p>Surat al-Nahl 16:90<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ<\/p>\n<p><strong>O believers! Stand firm for Allah and bear true testimony. Do not let the hatred of a people lead you to injustice. Be just! That is closer to righteousness. And be mindful of Allah. Surely, Allah is All-Aware of what you do.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:8<\/p><\/blockquote>\n<p>Imam al-Qurtubi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَدَلَّتِ الْآيَةُ أَيْضًا عَلَى أَنَّ كُفْرَ الْكَافِرِ لَا يَمْنَعُ مِنَ الْعَدْلِ عَلَيْهِ<\/p>\n<p>This verse shows that the unbelief of the unbeliever does not prevent him from enjoying justice.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 6\/110<\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تبارك وتعالى يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا<\/p>\n<p><strong>Allah Almighty said, &#8216;O My servants, I have forbidden injustice for Myself and I have forbidden it among you, so do not oppress one another.&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2577, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/allah-has-forbidden-oppression\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Jabir ibn &#8216;Abdillah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Beware of committing oppression, for oppression will be darkness on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2578, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/18\/guard-yourself-greed-thulm\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The strength of the Muslim community is in its care for the natural rights of everyone including the weak, the wicked, and the hated. Justice is the true metric by which Allah supports or rejects a community. If our community is weak, then we must critically examine our failure to fulfill justice.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قيل إنَّ اللَّهَ يُقِيمُ الدَّوْلَةَ الْعَادِلَةَ وَإِنْ كَانَتْ كَافِرَةً وَلَا يُقِيمُ الظَّالِمَةَ وَإِنْ كَانَتْ مُسْلِمَةً ويقال الدُّنْيَا تَدُومُ مَعَ الْعَدْلِ وَالْكُفْرِ وَلَا تَدُومُ مَعَ الظُّلْمِ وَالْإِسْلَامِ<\/p>\n<p>It is said that Allah allows the just state to remain even if it is led by unbelievers, but Allah will not allow the oppressive state to remain even if it is led by Muslims. And it is said that the world will endure with justice and unbelief, but it will not endure with oppression and Islam.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/07\/allah-supports-justice-unbelievers\/\">al-Amr bil Ma’rūf 1\/29<\/a><\/p><\/blockquote>\n<p>In sum, Allah will always answer the supplication of the oppressed even if the oppressed person is an unbeliever or sinner. Justice is a universal right for all people in Islam. People have the right to be protected in their lives, wealth, and freedom. If we fail to fulfill their rights, then we have surrendered our fate to their supplication.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Injustice will be darkness on the Day of Resurrection.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[18,183,22,85,27,32,34,37,48,100,60,45,220,73,98],"class_list":["post-18273","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-community-jamaah","tag-day-of-resurrection-yawm-al-qiyammah","tag-excellence-ihsaan","tag-fasting-al-siyam","tag-god-fearing-taqwa","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-idolatry-shirk","tag-justice-adl","tag-manners-al-adab","tag-prayer-salat","tag-quran-exegesis-tafsir","tag-supplication-al-dua","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4KJ","jetpack-related-posts":[{"id":15265,"url":"https:\/\/www.abuaminaelias.com\/lessons-from-the-journey-of-muadh-ibn-jabal-to-yemen\/","url_meta":{"origin":18273,"position":0},"title":"Lessons from the journey of Mu’adh ibn Jabal to Yemen","author":"Abu Amina Elias","date":"January 22, 2014","format":false,"excerpt":"\"Make your character excellent for the people, O Mu’adh ibn Jabal.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20469,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-praying-dua-behind-back\/","url_meta":{"origin":18273,"position":1},"title":"Imam al-Mundhiri on Praying for someone behind their back","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"The angel says: And for you the same.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23861,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-supporting-oppressed\/","url_meta":{"origin":18273,"position":2},"title":"Imam al-Mundhiri on Supporting the Oppressed","author":"Abu Amina Elias","date":"March 18, 2023","format":false,"excerpt":"\"Warning against oppression, the supplication of the oppressed, and forsaking them,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23179,"url":"https:\/\/www.abuaminaelias.com\/eid-dua-taqabbal-allahu-minna-wa-minkum\/","url_meta":{"origin":18273,"position":3},"title":"Eid Supplication: May Allah accept from us and from you","author":"Abu Amina Elias","date":"May 11, 2021","format":false,"excerpt":"\"May Allah accept good deeds from us and from you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25684,"url":"https:\/\/www.abuaminaelias.com\/supplication-oppressed-limits\/","url_meta":{"origin":18273,"position":4},"title":"Supplication Against Oppressors and its Limits","author":"Abu Amina Elias","date":"July 8, 2025","format":false,"excerpt":"\"Whoever pardons and seeks reconciliation, their reward is with Allah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18417,"url":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","url_meta":{"origin":18273,"position":5},"title":"Praying for enemies in Islam","author":"Abu Amina Elias","date":"November 2, 2016","format":false,"excerpt":"\"I was not sent to invoke curses, but rather I was only sent as mercy.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18273","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18273"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18273\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18273"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18273"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18273"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}