{"id":18340,"date":"2016-07-04T10:48:28","date_gmt":"2016-07-04T06:48:28","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18340"},"modified":"2025-07-04T11:03:49","modified_gmt":"2025-07-04T07:03:49","slug":"punished-hellfire-forever","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/punished-hellfire-forever\/","title":{"rendered":"Will people be punished in Hellfire forever?"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The majority of Muslim scholars believe that the Hellfire will exist eternally and that unbelievers will reside within it forever. A minority of scholars, however, believe that the Hellfire will exist eternally, but that eventually it will be emptied of any inhabitants. Both of these views are valid theological opinions that are supported by the Quran, the Sunnah, and views of the Prophet’s (ṣ) companions and early Muslims.<\/p>\n<p>A number of verses speak of the inhabitants of Hellfire “remaining therein” (<em>khalidina fiha<\/em>) and sometimes describe it as “forever” (<em>abada<\/em>). On the surface, these verses seem to describe an eternal punishment.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا<\/p>\n<p><strong>Whoever disobeys Allah and His Messenger, then for him is the fire of Hell. They will abide therein forever.<\/strong><\/p>\n<p>Surat al-Jinn 72:23<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَعَنَ الْكَافِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا خَالِدِينَ فِيهَا أَبَدًا<\/p>\n<p><strong>Verily, Allah has cursed the unbelievers and prepared for them a blaze, abiding therein forever.<\/strong><\/p>\n<p>Surat al-Ahzab 33:64-65<\/p><\/blockquote>\n<p>The Prophet (ṣ) informed us that there will be no death in the Hereafter. The existence of death, coming in symbolic form of ram, will be slaughtered on the Day of Resurrection so that everyone will know that the Hereafter will never end.<\/p>\n<p>Abu Sa’id reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُجَاءُ بِالْمَوْتِ يَوْمَ الْقِيَامَةِ كَأَنَّهُ كَبْشٌ أَمْلَحُ زَادَ أَبُو كُرَيْبٍ فَيُوقَفُ بَيْنَ الْجَنَّةِ وَالنَّارِ وَاتَّفَقَا فِي بَاقِي الْحَدِيثِ فَيُقَالُ يَا أَهْلَ الْجَنَّةِ هَلْ تَعْرِفُونَ هَذَا فَيَشْرَئِبُّونَ وَيَنْظُرُونَ وَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ قَالَ وَيُقَالُ يَا أَهْلَ النَّارِ هَلْ تَعْرِفُونَ هَذَا قَالَ فَيَشْرَئِبُّونَ وَيَنْظُرُونَ وَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ قَالَ فَيُؤْمَرُ بِهِ فَيُذْبَحُ قَالَ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ فَلَا مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ فَلَا مَوْتَ<\/p>\n<p><strong>Death will be brought on the Day of Resurrection in the form of a white ram, and it will be made to stand between Paradise and Hellfire. It will be said to the people of Paradise: Do you recognize this? They will raise their heads looking towards it and they will say: Yes, it is death. Then it will be said to the people of Hellfire: Do you recognize this? They will raise their heads looking towards it and they will say: Yes, it is death. Then the command will be given to slaughter the ram and it will be said: O people of Paradise, there is everlasting life for you and no death! And it will be said: O people of Hellfire, there is everlasting life for you and no death!<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4453, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/18\/no-death-akhirah-eternity\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Even so, the absence of death does not necessarily mean that people will remain in Hellfire forever. Scholars who believe in the eternity of punishment in Hellfire also acknowledge evidence that Muslims and monotheists who committed major sins will be punished in Hellfire for a very long time as means of purification and atonement. They will eventually be taken out of Hellfire and admitted into Paradise.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَام فَبَشَّرَنِي أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِكَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Gabriel, upon him be peace, came to me to give the good news that anyone from my nation who dies without associating partners with Allah will enter Paradise<\/strong>.<\/p><\/blockquote>\n<p>I said, “Even if he commits adultery and theft?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ زَنَى وَإِنْ سَرَقَ<\/p>\n<p><strong>Even if he commits adultery and theft<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1180, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/02\/28\/hadith-on-monotheism-whoever-dies-without-associating-partners-with-allah-will-enter-paradise\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُعَذَّبُ نَاسٌ مِنْ أَهْلِ التَّوْحِيدِ فِي النَّارِ حَتَّى يَكُونُوا فِيهَا حُمَمًا ثُمَّ تُدْرِكُهُمْ الرَّحْمَةُ فَيُخْرَجُونَ وَيُطْرَحُونَ عَلَى أَبْوَابِ الْجَنَّةِ قَالَ فَيَرُشُّ عَلَيْهِمْ أَهْلُ الْجَنَّةِ الْمَاءَ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْغُثَاءُ فِي حِمَالَةِ السَّيْلِ ثُمَّ يَدْخُلُونَ الْجَنَّةَ<\/p>\n<p><strong>People among those who worshiped Allah alone<\/strong> (<em>ahl al-tawhid<\/em>) <strong>will be punished in the Hellfire until they are coals. Then the mercy of Allah will reach them and they will be taken out and presented at the gates of Paradise. The people of Paradise will pour water over them and they will grow just as the stubble carried by the stream grows, then they will enter Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2597, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/08\/11\/tawhid-nar-first-then-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Nawawi commented on these traditions, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهُوَ حُجَّةٌ لِمَذْهَبِ أَهْلِ السَّنَةِ أَنَّ أَصْحَابَ الْكَبَائِرِ لَا يُقْطَعُ لَهُمْ بِالنَّارِ وَأَنَّهُمْ إِنْ دَخَلُوهَا أُخْرِجُوا مِنْهَا وَخُتِمَ لَهُمْ بِالْخُلُودِ فِي الْجَنَّةِ<\/p>\n<p>It is a proof for the people of the prophetic tradition (<em>sunnah<\/em>), that those who commit major sins will not remain in the Hellfire forever. If they enter it, they will be taken out and eventually admitted into Paradise.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 94<\/p><\/blockquote>\n<p>This is an indication of the mercy of Allah and his great wisdom, yet it is a concession that we should not take for granted. Some of the Jews and Christians used this as an excuse to continue committing their sins, saying that they would only have to endure Hellfire for a short while.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً ۚ قُلْ أَتَّخَذْتُمْ عِندَ اللَّهِ عَهْدًا فَلَن يُخْلِفَ اللَّهُ عَهْدَهُ ۖ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ<\/p>\n<p><strong>They say: Never will the Hellfire touch us, except for a number of days. Say: Have you taken a covenant with Allah? For Allah will never break His covenant. Or do you say about Allah that which you do not know?<\/strong><\/p>\n<p>Surat al-Baqarah 2:80<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَاتٍ ۖ وَغَرَّهُمْ فِي دِينِهِم مَّا كَانُوا يَفْتَرُونَ<\/p>\n<p><strong>That is because they say: Never will the Hellfire touch us, except for a number of days. They became deluded in their religion because of what they fabricated.<\/strong><\/p>\n<p>Surat Ali Imran 3:24<\/p><\/blockquote>\n<p>Indeed, some of the Muslims say the same to themselves to rationalize their sins. But we should know that a single moment in the Hellfire is worse than any amount of pleasure we can get out of the world. A person will be dipped in Hellfire only once and due to that pain will forget every good thing he or she ever experienced.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ<\/p>\n<p><strong>The most privileged people in the world among the people of the Hellfire will come on the Day of Resurrection to be dipped in the Hellfire, then it will be said: O son of Adam, did you see any good? Did you get any blessing? He will say: No, by Allah, my Lord!<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2807, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/08\/hereafter-akhirah-yawm-al-qiyamah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>If someone cannot stand even a single moment in Hellfire, then what would it be worth to stay there for one year? Or a hundred years? Or a thousand years? How can a thousand years in Hellfire be described as anything other than an eternity, even if it eventually comes to an end?<\/p>\n<p>Scholars who believe in the eternity of punishment in Hellfire are understandably cautious about overemphasizing the mercy of Allah, since some people will abuse this mercy to commit evil.<\/p>\n<p>However, other scholars cite evidence that indicates all people will eventually come out of the Hellfire. A number of verses appear to limit the length of Hellfire, leaving it up to the judgment of Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ النَّارُ مَثْوَاكُمْ خَالِدِينَ فِيهَا إِلَّا مَا شَاءَ اللَّهُ ۗ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٌ<\/p>\n<p><strong>The Hellfire is your residence, wherein you will remain except as Allah wills. Verily, your Lord is wise and knowing.<\/strong><\/p>\n<p>Surat al-An’am 6:128<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَمَّا الَّذِينَ شَقُوا فَفِي النَّارِ لَهُمْ فِيهَا زَفِيرٌ وَشَهِيقٌ خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ إِلَّا مَا شَاءَ رَبُّكَ ۚ إِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيدُ<\/p>\n<p><strong>As for those who were wretched, they will be in the Hellfire. For them therein is violent exhaling and inhaling, abiding therein as long as the heavens and the earth endure, except as your Lord wills. <\/strong><\/p>\n<p>Surat Hud 11:106-107<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا لِّلطَّاغِينَ مَآبًا لَّابِثِينَ فِيهَا أَحْقَابًا<\/p>\n<p><strong>Verily, Hell has been lying in wait for the transgressors, a place of return, in which they will remain for ages.<\/strong><\/p>\n<p>Surat al-Naba 78:21-23<\/p><\/blockquote>\n<p>Al-Tabari records that the mitigating phrases used in these verses were interpreted by some of the early Muslims to include everyone who will ever enter Hellfire, not only Muslims or monotheists.<\/p>\n<p>Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيَأْتِيَنَّ عَلَى جَهَنَّمَ زَمَانٌ تُخْفِقُ أَبْوَابُهَا لَيْسَ فِيهَا أَحَدٌ وَذَلِكَ بَعْدَ مَا يَلْبَثُونَ فِيهَا أَحْقَابًا<\/p>\n<p>There will come a time when the doors of Hell are blown open and there will be no one left in it. That is after they remain therein for ages.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 11:107<\/p><\/blockquote>\n<p>Those who accepted this view also observed that Allah frequently mentioned the uninterrupted reward of the people of Paradise, but he did not use similar phrases to describe the punishment of Hellfire. In other words, it is confirmed that Paradise is eternal and will last forever, while the same question about Hellfire is left unanswered.<\/p>\n<p>Ibn Zaid, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَخْبَرَنَا بِالَّذِي يَشَاءُ لِأَهْلِ الْجَنَّةِ فَقَالَ<strong> عَطَاءً غَيْرَ مَجْذُوذٍ<\/strong> وَلَمْ يُخْبِرْنَا بِالَّذِي يَشَاءُ لِأَهْلِ النَّارِ<\/p>\n<p>Allah informed us of what he wills for the people of Paradise, so He said: <strong>A gift without end<\/strong>. (11:108) And he did not tell us of what He wills for the people of Hellfire.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 11:107<\/p><\/blockquote>\n<p>Hence, whenever the Quran says &#8220;they will abide therein,&#8221; it is implicitly limited to however long Allah wills it to be. Their remaining in Hellfire &#8220;forever&#8221; is a rhetorical device, meaning they will be in it for ages and ages, and it does not literally mean for all of eternity.<\/p>\n<p>At-Tabari records that some companions of the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِي قَوْلِهِ<strong> إِلَّا مَا شَاءَ رَبُّكَ <\/strong>قَالَ هَذِهِ الْآيَةُ تَأْتِي عَلَى الْقُرْآنِ كُلِّهِ يَقُولُ حَيْثُ كَانَ فِي الْقُرْآنِ <strong>خَالِدِينَ فِيهَا <\/strong>تَأْتِي عَلَيْهِ<\/p>\n<p>In his saying: <strong>Except as your Lord wills<\/strong> (11:107), this verse covers the entire Quran. Wherever it says in the Quran that they will abide therein, it has this meaning.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 11:107<\/p><\/blockquote>\n<p>Ibn al-Qayyim also writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولكن مجرد ذكر الخلود والتأبيد لا يقتضي عدم النهاية بل الخلود هو المكث الطويل<\/p>\n<p>Rather, the mention of eternity (<em>al-khulud<\/em>) and forever (<em>al-ta&#8217;bid<\/em>) by itself does not necessitate that it is without end, as eternity can mean to remain for a long time.<\/p>\n<p>Source: Shifā&#8217; al-&#8216;Alīl 1\/257<\/p><\/blockquote>\n<p>The Prophet (ṣ) also informed us that there will be some people for whom Allah himself will intercede and take them out of the Hellfire. They will eventually be admitted into Paradise to spend eternity therein even though they never did any good deeds at all.<\/p>\n<p>Abu Sa’id reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ شَفَعَتْ الْمَلَائِكَةُ وَشَفَعَ النَّبِيُّونَ وَشَفَعَ الْمُؤْمِنُونَ وَلَمْ يَبْقَ إِلَّا أَرْحَمُ الرَّاحِمِينَ فَيَقْبِضُ قَبْضَةً مِنْ النَّارِ فَيُخْرِجُ مِنْهَا قَوْمًا لَمْ يَعْمَلُوا خَيْرًا قَطُّ قَدْ عَادُوا حُمَمًا فَيُلْقِيهِمْ فِي نَهَرٍ فِي أَفْوَاهِ الْجَنَّةِ يُقَالُ لَهُ نَهَرُ الْحَيَاةِ فَيَخْرُجُونَ كَمَا تَخْرُجُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ أَلَا تَرَوْنَهَا تَكُونُ إِلَى الْحَجَرِ أَوْ إِلَى الشَّجَرِ مَا يَكُونُ إِلَى الشَّمْسِ أُصَيْفِرُ وَأُخَيْضِرُ وَمَا يَكُونُ مِنْهَا إِلَى الظِّلِّ يَكُونُ أَبْيَضَ<\/p>\n<p><strong>Allah Almighty will say: The angels have interceded, the prophets have interceded, the believers have interceded, and none remains to intercede but the Most Merciful of the merciful. He will take a handful from the Hellfire and bring people out of it who never did any good and who had been turned into charcoal. He will cast them into a river named the River of Life on the outskirts of Paradise. They will come out as a seed comes cut from the silt carried by the flood. You see it near a stone or tree. Whatever is exposed to the sun is yellow or green, and whatever is under the shade is white.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, it seems as if you have been tending a flock in the jungle.” The Prophet (ṣ) continued:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَخْرُجُونَ كَاللُّؤْلُؤِ فِي رِقَابِهِمْ الْخَوَاتِمُ يَعْرِفُهُمْ أَهْلُ الْجَنَّةِ هَؤُلَاءِ عُتَقَاءُ اللَّهِ الَّذِينَ أَدْخَلَهُمْ اللَّهُ الْجَنَّةَ بِغَيْرِ عَمَلٍ عَمِلُوهُ وَلَا خَيْرٍ قَدَّمُوهُ ثُمَّ يَقُولُ ادْخُلُوا الْجَنَّةَ فَمَا رَأَيْتُمُوهُ فَهُوَ لَكُمْ فَيَقُولُونَ رَبَّنَا أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ الْعَالَمِينَ فَيَقُولُ لَكُمْ عِنْدِي أَفْضَلُ مِنْ هَذَا فَيَقُولُونَ يَا رَبَّنَا أَيُّ شَيْءٍ أَفْضَلُ مِنْ هَذَا فَيَقُولُ رِضَايَ فَلَا أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا<\/p>\n<p><strong>They will come out like pearls with seals on their necks. The people of Paradise will recognize them and say: They are those who have been freed by Allah, whom Allah has admitted into Paradise without any good deeds they have done nor any good they put forward. Then Allah will say: Enter Paradise and whatever you see therein is yours. They will say: O Lord, you have given us favors that you have not given anyone else among the worlds. Allah will say: I have a favor better than this. They will say: O Lord, what thing could be better than this? Allah will say: It is my satisfaction, for I will never be angry with you after this.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 183, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>We can understand from this tradition that the purpose of Hellfire is to cleanse people of their sins and prepare them for a life of purity in Paradise. It is not simply punishment for the sake of punishment. If there is such hope that even the worst of the worst will eventually enter Paradise, then how about those who have done at least some good deeds in their lives?<\/p>\n<p>Ibn al-Qayyim mentions the arguments of scholars who believe that the punishment of Hellfire will eventually come to an end. In a long chapter, he details twenty five points and pieces of evidence they used to support this interpretation, among them an emphasis on the mercy of Allah and his wisdom.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">النار خلقت تخويفا للمؤمنين وتطهيرا للخاطئين والمجرمين فهي طهرة من الخبث الذي اكتسبته النفس في هذا العالم فان تطهرت هاهنا بالتوبة النصوح والحسنات الماحية والمصائب المكفرة<\/p>\n<p>The Hellfire was created to intimidate the believers and to purify the sinners and criminals. It is a means of purity from filth earned by souls in this world. It is purified in this world by means of repentance, sincerity, good deeds, atonement, calamities, and expiations.<\/p>\n<p>Source: Ḥādī al-Arwāḥ 1\/367<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">العفو أحب إليه سبحانه من الانتقام والرحمة أحب إليه من العقوبة والرضا أحب إليه من الغضب والفضل أحب إليه من العدل<\/p>\n<p>Forgiveness is more beloved to Allah Almighty than vengeance, mercy is more beloved to Him than punishment, satisfaction is more beloved to Him than anger, and favor is more beloved to Him than justice.<\/p>\n<p>Source: Ḥādī al-Arwāḥ 1\/372<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أنه سبحانه وتعالى اخبر إن رحمته وسعت كل شيء فليس شيء من الأشياء إلا وفيه رحمته ولا ينافي هذا<\/p>\n<p>Allah Almighty informed us that His mercy encompasses all things and there is nothing at all but that His mercy is in it and this has not been nullified.<\/p>\n<p>Source: Ḥādī al-Arwāḥ 1\/376<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أنه ليس في حكمة احكم الحاكمين إن يخلق خلقا يعذبهم ابد الآباد عذابا سرمدا لا نهاية له ولا انقطاع أبدا<\/p>\n<p>It is not befitting the wisdom of the Most Wise of judges that He would create someone to punish forever and ever in eternal punishment without any end or disruption.<\/p>\n<p>Source: Ḥādī al-Arwāḥ 1\/378<\/p><\/blockquote>\n<p>Ibn al-Qayyim seemed to be sympathetic to this view, although he never fully endorses it. This view has always been a minority position in Islamic theology although, as he has definitively shown, it is not without a valid basis.<\/p>\n<p>In the end, only Allah knows what will really happen on the Day of Resurrection and how he will deal with the sinners among his creation. We can only interpret the evidence of revelation in the best way we can, as the true extent of the reality of the Hereafter is unknown to us. What we do know for sure is that Allah is just, wise, and merciful. His justice, wisdom, and mercy will be fulfilled in the Hereafter in ways we cannot even imagine.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah informed us that his mercy encompasses all things,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[127,125,20,21,26,135,32,37,48,54,56,134,115,84,45,67,91,70,98],"class_list":["post-18340","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-adultery-zina","tag-gabriel-jibreel","tag-creation-al-khalq","tag-creed-aqidah","tag-forgiveness-al-maghfirah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-idolatry-shirk","tag-justice-adl","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-people-of-the-book","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-quran-exegesis-tafsir","tag-repentance-al-tawbah","tag-righteous-predecessors-al-salaf-al-salih","tag-sincerity-al-ikhlaas","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4LO","jetpack-related-posts":[{"id":21364,"url":"https:\/\/www.abuaminaelias.com\/baby-girl-buried-alive-in-hell\/","url_meta":{"origin":18340,"position":0},"title":"Baby girl buried alive is in Hell?","author":"Abu Amina Elias","date":"October 23, 2019","format":false,"excerpt":"\"For what sin was she killed?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19805,"url":"https:\/\/www.abuaminaelias.com\/curse-the-graves-of-the-unbelievers\/","url_meta":{"origin":18340,"position":1},"title":"Curse the Graves of the Unbelievers?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not abuse the dead and thus hurt the living.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":11513,"url":"https:\/\/www.abuaminaelias.com\/women-majority-hellfire-explanation\/","url_meta":{"origin":18340,"position":2},"title":"Are women the majority in Hellfire?","author":"Abu Amina Elias","date":"November 10, 2012","format":false,"excerpt":"\"Women are the majority of the children of Adam,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13762,"url":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","url_meta":{"origin":18340,"position":3},"title":"Salvation for non-Muslims outside of Islam?","author":"Abu Amina Elias","date":"June 8, 2013","format":false,"excerpt":"\"Allah will judge between them on the Day of Resurrection.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22759,"url":"https:\/\/www.abuaminaelias.com\/999-of-1000-in-hellfire\/","url_meta":{"origin":18340,"position":4},"title":"Only one out of 1000 are in Paradise?","author":"Abu Amina Elias","date":"December 29, 2020","format":false,"excerpt":"\"Of every thousand, nine hundred and ninety-nine...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":18340,"position":5},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18340","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18340"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18340\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18340"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18340"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18340"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}