{"id":18399,"date":"2016-09-06T16:50:54","date_gmt":"2016-09-06T12:50:54","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18399"},"modified":"2020-07-18T09:03:50","modified_gmt":"2020-07-18T05:03:50","slug":"blessings-of-the-day-of-arafat","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/blessings-of-the-day-of-arafat\/","title":{"rendered":"Blessings of the day of Arafat"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The day of ‘Arafat (or &#8216;Arafah) is the 9<sup>th<\/sup> day of the month of Dhul-Hijjah on the Islamic calendar. It occurs near the end of the Hajj pilgrimage as pilgrims stand on the plain of ‘Arafat to perform prayers, supplications, and acts of worship.<\/p>\n<p>About 2 million pilgrims or more attend the plain of ‘Arafat during each annual pilgrimage. This event is the culmination and the climax of the Hajj pilgrimage, the most important ritual for the pilgrims.<\/p>\n<p>Abdu Rahman ibn Ya’mar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَجُّ عَرَفَةُ فَمَنْ أَدْرَكَ لَيْلَةَ عَرَفَةَ قَبْلَ طُلُوعِ الْفَجْرِ مِنْ لَيْلَةِ جَمْعٍ فَقَدْ تَمَّ حَجُّهُ<\/p>\n<p><strong>The Hajj is Arafat. Whoever reaches the night of Arafat before the rising of the sun at dawn the next day, he has completed his pilgrimage.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3016, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/09\/06\/hajj-itself-is-arafah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Prophet (ṣ) likened the day of ‘Arafat to a day of celebration (<em>eid<\/em>). While it is not the day of Eid in a technical sense, it is a celebration in that it signifies the end of the successful completion of the Hajj pilgrimage. It should be a time of joy as well as reverence and devotion.<\/p>\n<p>&#8216;Uqbah ibn &#8216;Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَوْمُ عَرَفَةَ وَيَوْمُ النَّحْرِ وَأَيَّامُ التَّشْرِيقِ عِيدُنَا أَهْلَ الْإِسْلَامِ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ<\/p>\n<p><strong>The day of ‘Arafat, the day of sacrifice, and the three following days<\/strong> (<em>tashriq<\/em>) <strong>are our celebration for the people of Islam. They are days of eating and drinking.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 773, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/14\/no-fasting-eid-fitr-adha-tashriq\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>‘Arafat was the day that Allah completed the religion for Muslims. It is also the day that the Prophet delivered his famous farewell sermon that declared the sanctity of human life and an end to racism.<\/p>\n<p>Umar ibn al-Khattab reported: A man from the Jews said, “O leader of the believers, there is a verse you recite in your book and, had it been revealed to us as Jews, we would have taken that day as a celebration.” Umar said, “Which verse is it?” The man recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمْ الْإِسْلَامَ دِينًا<\/p>\n<p><strong>Today I have completed your religion for you, perfected my favor upon you, and have chosen Islam as your religion.<\/strong> (5:3)<\/p><\/blockquote>\n<p>Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ عَرَفْنَا ذَلِكَ الْيَوْمَ وَالْمَكَانَ الَّذِي نَزَلَتْ فِيهِ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ قَائِمٌ بِعَرَفَةَ يَوْمَ جُمُعَةٍ<\/p>\n<p>I know the day and place in which this verse was revealed to the Prophet, peace and blessings be upon him. It was while he was standing on the day of ‘Arafat on Friday.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 45, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/10\/this-day-completed-your-deen\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>‘Arafat is one of the most blessed times in Islam because Allah frees more Muslims from Hellfire and expiates more sins on this day than any other day.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ فِيهِ عَبْدًا مِنْ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِي بِهِمْ الْمَلَائِكَةَ فَيَقُولُ مَا أَرَادَ هَؤُلَاءِ<\/p>\n<p><strong>There is no day upon which Allah frees more of his servants from the Hellfire than the day of ‘Arafat. He draws near and then he praises them to the angels, saying: What do these want?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1348, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/24\/allah-frees-servants-arafah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ يُبَاهِي مَلَائِكَتَهُ عَشِيَّةَ عَرَفَةَ بِأَهْلِ عَرَفَةَ فَيَقُولُ انْظُرُوا إِلَى عِبَادِي أَتَوْنِي شُعْثًا غُبْرًا<\/p>\n<p><strong>Verily, Allah Almighty boasts to his angels of the pilgrims on the afternoon of the day of Arafat, saying: Look at my servants, coming to me disheveled and dusty.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7049, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/09\/allah-boasts-pilgrims-arafah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>As such, it is one of the best days to strive in worship, good deeds, and specifically to increase our supplications. Among the best supplications to say during ‘Arafat are those declaring the oneness, greatness, and praise of Allah.<\/p>\n<p>&#8216;Amr ibn Shu’ayb reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبِيُّونَ مِنْ قَبْلِي لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ<\/p>\n<p><strong>The best supplication is that which is made on the day of ‘Arafat. The best of it is what was said by myself and the prophets before me: There is no god but Allah alone without any partners, unto him belong the dominion and all praise and he has power over all things.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3585, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/09\/23\/best-dua-yawm-arafah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Pilgrims should also remember to pray for their loved ones, the Muslims, the righteous, and humanity at large. At the same time, Muslims who are not performing the pilgrimage should pray for those who are. If we meet any pilgrims on their journey, we should honor them as they are the guests of Allah.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ لِلْحَاجِّ وَلِمَنِ اسْتَغْفَرَ لَهُ الْحَاجُّ<\/p>\n<p><strong>O Allah, forgive the pilgrims and those for whom the pilgrims seek forgiveness.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 8818, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/09\/07\/hajj-o-allah-forgive-pilgrims\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>And Ka’b, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَاجُّ وَالْمُعْتَمِرُ وَالْمُجَاهِدُ فِي سَبِيلِ اللَّهِ وَفْدُ اللَّهِ سَأَلُوا فَأُعْطُوا وَدَعَوْا فَأُجِيبُوا<\/p>\n<p>The pilgrims and soldiers in the way of Allah are the guests of Allah. If they ask, then give them. If they call you, then answer them.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 4\/191<\/p><\/blockquote>\n<p>It is recommended to fast on the day of ‘Arafat for those not performing the Hajj pilgrimage, as it is a means of expiation and purification from sin.<\/p>\n<p>Abu Qatadah reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “What is your view about fasting on the day of ‘Arafat?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُكَفِّرُ السَّنَةَ الْمَاضِيَةَ وَالْبَاقِيَةَ<\/p>\n<p><strong>It will expiate the sins of the previous and upcoming years.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1162, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/24\/fasting-arafah-ashura\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>It is not recommended to fast on the day of ‘Arafat for those who are performing the Hajj pilgrimage in order for them to have strength to perform more prayers and supplications, but it is still permissible for pilgrims to fast if they wish.<\/p>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَجَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَصُمْهُ  وَمَعَ أَبِي بَكْرٍ فَلَمْ يَصُمْهُ وَمَعَ عُمَرَ فَلَمْ يَصُمْهُ وَمَعَ عُثْمَانَ فَلَمْ يَصُمْهُ وَأَنَا لَا أَصُومُهُ وَلَا آمُرُ بِهِ وَلَا أَنْهَى عَنْهُ<\/p>\n<p>I have performed the Hajj pilgrimage with the Prophet, peace and blessings be upon him, and he did not fast it. I performed it with Abu Bakr and he did not fast, with Umar and he did not fast, and with Uthman and he did not fast. I do not fast it, nor do I command it or prohibit it.<\/p>\n<p>Source: Sunan al-Tirmidhī 751, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/14\/fasting-or-not-arafah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Al-Tirmidhi commented on this topic, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ الْإِفْطَارَ بِعَرَفَةَ لِيَتَقَوَّى بِهِ الرَّجُلُ عَلَى الدُّعَاءِ وَقَدْ صَامَ بَعْضُ أَهْلِ الْعِلْمِ يَوْمَ عَرَفَةَ بِعَرَفَةَ<\/p>\n<p>The practice among the majority of scholars is that it is recommended to not fast on the day of ‘Arafat in order for a man to have strength to supplicate, but some of the scholars would fast on the day of ‘Arafat while at ‘Arafat.<\/p>\n<p>Source: Sunan al-Tirmidhī 750<\/p><\/blockquote>\n<p>In sum, the day of ‘Arafat is among the holiest times of the year in Islam. It commemorates the finality of revelation and the completion of the Hajj pilgrimage. We should increase our good deeds, prayers, and supplications during this time. If we are not present at ‘Arafat, it is best to fast the day in remembrance. If we are on the plain of ‘Arafat, it is best to save our strength for worship.<\/p>\n<p>We ask Allah to bless this day for us and all Muslims everywhere.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The Hajj is ‘Arafat.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[406,313,85,88,34,100,56,60,220,73],"class_list":["post-18399","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-ashura","tag-dhul-hijjah","tag-fasting-al-siyam","tag-pilgrimage-hajj","tag-humanity-al-insaaniyyah","tag-manners-al-adab","tag-monotheism-tawheed","tag-prayer-salat","tag-supplication-al-dua","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4ML","jetpack-related-posts":[{"id":14735,"url":"https:\/\/www.abuaminaelias.com\/blessings-ten-days-dhul-hijjah\/","url_meta":{"origin":18399,"position":0},"title":"Blessings of the first ten days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 14, 2013","format":false,"excerpt":"\"No days more beloved to Allah than these ten days,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":18399,"position":1},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20713,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-ten-days-of-dhul-hijjah\/","url_meta":{"origin":18399,"position":2},"title":"Imam al-Mundhiri on First Ten Days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"Not even jihad in the way of Allah,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14722,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-hajj-and-umrah-pilgrimage\/","url_meta":{"origin":18399,"position":3},"title":"Imam al-Nawawi on Hajj and &#8216;Umrah Pilgrimage","author":"Abu Amina Elias","date":"August 7, 2013","format":false,"excerpt":"\"Proclaim to people the Hajj pilgrimage.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14743,"url":"https:\/\/www.abuaminaelias.com\/recommendation-to-fast-six-days-of-shawwal-after-ramadan\/","url_meta":{"origin":18399,"position":4},"title":"Fasting six days of Shawwal after Ramadan","author":"Abu Amina Elias","date":"August 14, 2013","format":false,"excerpt":"\"It is recommended to fast six days of the month of Shawwal,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22666,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-paying-zakat\/","url_meta":{"origin":18399,"position":5},"title":"Imam al-Mundhiri on Obligatory Charity","author":"Abu Amina Elias","date":"October 19, 2020","format":false,"excerpt":"\"Whoever pays alms on his wealth, his evil will depart from him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18399","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18399"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18399\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18399"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18399"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18399"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}