{"id":18417,"date":"2016-11-02T14:41:04","date_gmt":"2016-11-02T10:41:04","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18417"},"modified":"2018-03-25T16:07:02","modified_gmt":"2018-03-25T12:07:02","slug":"praying-for-enemies-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","title":{"rendered":"Praying for enemies in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It was the practice of the Prophet ﷺ to supplicate and pray to Allah to guide his enemies of Islam and to benefit them in the Hereafter. Islam teaches us to love for others what we love for ourselves. Each one of us wants to be guided and, therefore, we should ask Allah to guide others even if they are unbelievers, sinners, or oppressors.<\/p>\n<p>We should supplicate for guidance and forgiveness for people in general. It is the essence of Allah to be forgiving and mericful, and the angels roam the earth seeking forgiveness for everyone upon it. By expressing mercy and forgiveness in our supplications, we fulfill Allah’s plan for the creation.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمَلَائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَن فِي الْأَرْضِ ۗ أَلَا إِنَّ اللَّهَ هُوَ الْغَفُورُ الرَّحِيمُ<\/p>\n<p><strong>The angels exalt the praise of their Lord and ask forgiveness for those on earth. No doubt, Allah is the Forgiving, the Merciful.<\/strong><\/p>\n<p>Surat al-Shura 42:5<\/p><\/blockquote>\n<p>It was the practice of all of the Prophets to supplicate for their oppressors, although they suffered bodily harm and pain at their hands.<\/p>\n<p>Abdullah ibn Mas’ud reported: I saw the Messenger of Allah, peace and blessings be upon him, tell the story of a prophet who was beaten by his people and he wiped the blood from his face, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ<\/p>\n<p><strong>My Lord, forgive my people for they do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6530, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/06\/03\/the-prophets-prayed-for-allah-to-forgive-those-who-persecuted-them-in-ignorance\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet ﷺ himself said this prayer after being attacked and harmed during the battle of Uhud:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لا يَعْلَمُونَ<\/p>\n<p><strong>O Allah, forgive my people for they do not know.<\/strong><\/p><\/blockquote>\n<p>Abu Hatim, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَعْنِي هَذَا الدُّعَاءُ أَنَّهُ قَالَ يَوْمَ أُحُدٍ لَمَّا شُجَّ وَجْهُهُ<\/p>\n<p>The Prophet said this supplication during the battle of Uhud when they slashed his face.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 985, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/23\/hadith-on-forgiveness-the-prophet-asks-allah-to-forgive-his-oppressors-in-the-battle-of-uhud\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This incident demonstrates the Prophet’s ﷺ strict adherence to ethical virtues despite enduring persecution at the hands of unbelievers.<\/p>\n<p>An-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ مَا كَانُوا عَلَيْهِ صَلَوَاتُ اللَّهِ وَسَلَامُهُ عَلَيْهِمْ مِنَ الْحِلْمِ وَالتَّصَبُّرِ وَالْعَفْوِ وَالشَّفَقَةِ عَلَى قَوْمِهِمْ وَدُعَائِهِمْ لَهُمْ بِالْهِدَايَةِ وَالْغُفْرَانِ وَعُذْرِهِمْ فِي جِنَايَتِهِمْ عَلَى أَنْفُسِهِمْ بِأَنَّهُمْ لَا يَعْلَمُونَ<\/p>\n<p>In this tradition is what the Prophet practiced of forbearance, patience, forgiveness, and compassion for his people, his supplication for them to receive guidance and to be forgiven, and for them to be excused for their sins as they did not know.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 1792<\/p><\/blockquote>\n<p>On several occasions, the companions asked the Prophet ﷺ to supplicate against the enemies of Islam, the very same people who threatened them, hurt them, and caused great suffering. He refused to condemn his enemies to the Hellfire in the hope that one day they might see the light.<\/p>\n<p>Abu Huraira reported: At-Tufail came with his companions and they said, “O Messenger of Allah, the tribe of Daws has disbelieved and rejected you, so pray to Allah against them.” And it was said, “May the tribe of Daws be destroyed!” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ<\/p>\n<p><strong>O Allah, guide the tribe of Daws and bring them to me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4131, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/04\/23\/hadith-on-guidance-the-prophet-supplicates-to-guide-the-unbelievers-not-destroy-them\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: It was said, “O Messenger of Allah, pray against the idolaters!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً<\/p>\n<p><strong>Verily, I was not sent to invoke curses, but rather I was only sent as mercy.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2599, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/04\/07\/the-prophet-is-mercy-to-humanity-not-an-invoker-of-curses\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Jabir reported: It was said, “O Messenger of Allah, the arrows of the tribe of Thaqīf have pierced us, so pray against them!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ ثَقِيفًا<\/p>\n<p><strong>O Allah, guide the tribe of Thaqīf!<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3942, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2016\/09\/21\/hadith-on-enemies-the-prophets-prays-for-his-enemies-to-be-guided\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In one of the most famous examples, the Prophet ﷺ prayed for Allah to guide Umar Ibn Al-Khattab, who at the time was a powerful enemy of Islam.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَعِزَّ الْإِسْلَامَ بِأَحَبِّ هَذَيْنِ الرَّجُلَيْنِ إِلَيْكَ بِأَبِي جَهْلٍ أَوْ بِعُمَرَ بْنِ الْخَطَّابِ<\/p>\n<p><strong>O Allah, strengthen Islam with one of two men whom you love more: Abu Jahl or Umar ibn Al-Khattab.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3681, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/17\/hadith-on-umar-the-prophet-prayed-for-umar-ibn-al-khattab-to-be-converted-to-islam\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Because of the Prophet’s supplication, Umar went on to become one of the greatest of the early Muslims and a role model for the entire Muslim community.<\/p>\n<p>In another story, the Prophet ﷺ was violently rejected by the people of Al-Ṭā’if. They mocked him and ran him out of the city whilst pelting him with stones, to the point that blood soaked his sandals. In this moment, Allah sent to the Angel of the Mountains to him with a choice: If he desired, he could overturn the mountains upon the entire city and destroy all of its inhabitants. The Prophet, peace and blessings be upon him, refused the request, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلْ أَرْجُو أَنْ يُخْرِجَ اللَّهُ مِنْ أَصْلاَبِهِمْ مَنْ يَعْبُدُ اللَّهَ وَحْدَهُ لاَ يُشْرِكُ بِهِ شَيْئًا ‏‏‏<\/p>\n<p><strong>No, rather I hope that Allah will bring from their descendants people who will worship Allah alone without associating partners with him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3059, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/01\/18\/hadith-on-mercy-the-angel-of-the-mountains-offered-to-destroy-the-disbelievers-but-the-prophet-had-mercy-on-them\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>When we refuse to supplicate and pray for the benefit of others, this is usually because our hearts are being influenced and misled by spiritual diseases of hatred, malice, and envy. The cure for these diseases is to do the exact opposite of what they command us; if incite us to curse people, then we should respond by praying for their guidance.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما العمل النافع فيه فهو أن يحكم الحسد فكل ما يتقاضاه الحسد من قول وفعل فينبغي أن يكلف نفسه نقيضه فإن حمله الحسد على القدح في محسوده كلف لسانه المدح له والثناء عليه وإن حمله على التكبر عليه ألزم نفسه التواضع له والاعتذار إليه … فَهَذِهِ هِيَ أَدْوِيَةُ الْحَسَدِ وَهِيَ نَافِعَةٌ جِدًّا إِلَّا أَنَّهَا مُرَّةٌ عَلَى الْقُلُوبِ جِدًّا وَلَكِنَّ النَّفْعَ فِي الدَّوَاءِ الْمُرِّ<\/p>\n<p>As for beneficial deeds, it is to be a judge over envy. For everything that envy brings to court of sayings and deed, he should oblige himself to do its opposite. If envy compels him to disparage the envied, then he should oblige his tongue to praise him and commend him. If envy compels him to be arrogant against him, then he should require himself to be humble before him and apologize to him… These are the cures for envy and they are very beneficial, although they are very bitter for the heart. Rather, the benefit is in bitter medicine.<\/p>\n<p>Source: Iḥyāʼ Ulūm al-Dīn 3\/199<\/p><\/blockquote>\n<p>Indeed, it is a difficult and bitter medicine to swallow when we pray for people who have wronged us and harmed us in terrible ways. Yet, it is for our own good to do so, as the hatred in our hearts is more harmful to ourselves than our prayers are against them.<\/p>\n<p>In fact, it is the Sunnah to cleanse the heart of hatred, malice, and rancor every morning and evening by praying for the benefit of others.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ<\/p>\n<p><strong>Young man, if you are able every morning and evening to remove any rancor from your heart towards anyone, then do so.<\/strong><\/p><\/blockquote>\n<p>Then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بُنَيَّ وَذَلِكَ مِنْ سُنَّتِي وَمَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجَنَّة<\/p>\n<p><strong>Young man, that is my tradition<\/strong> (<em>sunnah<\/em>) <strong>and whoever revives my tradition has loved me, and whoever loves me will be with me in Paradise<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2678, Grade: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/11\/17\/hadith-on-hatred-o-boy-make-sure-your-heart-is-purified-from-rancor-envy-and-malice\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Finally, we ought to understand that supplicating and praying for others is, in reality, to pray for our own selves. Among the rights of Muslim brotherhood is to pray for the Muslims the same way you pray for yourself.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدعاء للأخ في حياته وبعد مماته بِكُلِّ مَا يُحِبُّهُ لِنَفْسِهِ وَلِأَهْلِهِ وَكُلِّ مُتَعَلِّقٍ به فتدعو له كما تدعو لنفسك ولا تفرق بين نفسك وبينه فإن دعاءك له دعاء لنفسك على التحقيق<\/p>\n<p>(Among his rights are) prayer for his brother in his life and after his death for everything that he loves for himself, his family, and everything related to him. Thus, you pray for him as you pray for yourself, without distinction between yourself and him. Indeed, your prayer for him is a prayer for yourself in reality.<\/p>\n<p>Source: Iḥyā’ ‘Ulūm al-Dīn 2\/186<\/p><\/blockquote>\n<p>Even our wayward brothers and sisters in humanity, who may be lost and stumbling, deserve for us to prayer for their guidance, just as we would want them to pray for us if we were lost in misguidance.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;I was not sent to invoke curses, but rather I was only sent as mercy.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[122,105,25,26,184,30,311,100,54,56,58,60,62,220,73],"class_list":["post-18417","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-angels-malaikah","tag-envy-al-hasad","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-guidance-al-hidaya","tag-hatred-bigdah","tag-malice-hiqd","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-patience-al-sabr","tag-prayer-salat","tag-prophetic-biography-sirah","tag-supplication-al-dua","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4N3","jetpack-related-posts":[{"id":25684,"url":"https:\/\/www.abuaminaelias.com\/supplication-oppressed-limits\/","url_meta":{"origin":18417,"position":0},"title":"Supplication Against Oppressors and its Limits","author":"Abu Amina Elias","date":"July 8, 2025","format":false,"excerpt":"\"Whoever pardons and seeks reconciliation, their reward is with Allah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14804,"url":"https:\/\/www.abuaminaelias.com\/sending-blessings-upon-the-prophet-and-his-companions\/","url_meta":{"origin":18417,"position":1},"title":"Sending blessings upon the Prophet and his Companions","author":"Abu Amina Elias","date":"August 26, 2013","format":false,"excerpt":"\"Whoever sends blessings upon me once will have Allah send blessings upon him ten times.\" --Sahih Muslim 408","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14856,"url":"https:\/\/www.abuaminaelias.com\/beware-of-transgression-and-exaggeration-in-supplication\/","url_meta":{"origin":18417,"position":2},"title":"Beware of exaggeration in supplication","author":"Abu Amina Elias","date":"September 2, 2013","format":false,"excerpt":"\"There will be people who will transgress in supplication, so beware not to be one of them.\" --Sunan Abu Dawud 1480","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20469,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-praying-dua-behind-back\/","url_meta":{"origin":18417,"position":3},"title":"Imam al-Mundhiri on Praying for someone behind their back","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"The angel says: And for you the same.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18273,"url":"https:\/\/www.abuaminaelias.com\/beware-dua-of-the-oppressed\/","url_meta":{"origin":18417,"position":4},"title":"Beware the Supplication of the Oppressed","author":"Abu Amina Elias","date":"June 14, 2016","format":false,"excerpt":"\"Injustice will be darkness on the Day of Resurrection.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13014,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-assassinate-critics\/","url_meta":{"origin":18417,"position":5},"title":"Did Prophet Muhammad assassinate his critics?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Faith has prevented treacherous assassination.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18417","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18417"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18417\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18417"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18417"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18417"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}