{"id":18580,"date":"2017-12-05T13:44:23","date_gmt":"2017-12-05T09:44:23","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18580"},"modified":"2021-08-04T08:33:38","modified_gmt":"2021-08-04T04:33:38","slug":"excellent-ablution-wudu-with-evidences","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/excellent-ablution-wudu-with-evidences\/","title":{"rendered":"An excellent ablution (wudu) with evidences"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Ablution (<em>al-wuḍū’<\/em>) is one of our most important acts of worship in Islam. It is the prerequisite for ritual prayer (<em>al-ṣalāt<\/em>), a means of outward and inward purification, and a cause for the expiation of sins. In order to get the most out of this act of worship, we need to know how to perform it in the best way possible.<\/p>\n<p>This article describes the rules for a perfect ablution, which includes its obligatory and recommended elements, while providing the primary evidences from the Sunnah.<\/p>\n<p><strong><u>Using clean water in moderate amounts<\/u><\/strong><\/p>\n<p>Ablution should be performed using pure, clean water in moderate amounts. Water is itself purifying as long as it is not mixed with anything impure.<\/p>\n<p>Abu Sa’eed Al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمَاءَ طَهُورٌ لَا يُنَجِّسُهُ شَيْءٌ<\/p>\n<p><strong>Water is pure and nothing makes it impure.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 66, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/11\/25\/hadith-on-water-pure-water-is-always-clean-and-can-be-used-for-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The general rule is that water is clean enough for ablution as long as it is not mixed with something dirty that changes its smell, taste, or color. In other words, a minuscule amount of impurity or filth that mixes with water will not invalidate it for ablution.<\/p>\n<p>Al-Bayhaqi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اَلْمَاءُ طَاهِرٌ إِلَّا إِنْ تَغَيَّرَ رِيحُهُ أَوْ طَعْمُهُ أَوْ لَوْنُهُ بِنَجَاسَةٍ تَحْدُثُ فِيهِ<\/p>\n<p>Water is pure unless an impurity falls into it that changes its smell, taste, or color.<\/p>\n<p>Source: Bulūgh al-Marām 4<\/p><\/blockquote>\n<p>Ablution should also be performed using small to moderate amounts of water.<\/p>\n<p>Anas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ بِالْمُدِّ وَيَغْتَسِلُ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ<\/p>\n<p>The Prophet, peace and blessings be upon him, would perform ablution with one <em>mudd<\/em> (half of a kilogram) and would perform a ritual bath with one <em>sa’ <\/em>(two kilograms) to five <em>mudd<\/em>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 198, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-amount-of-water-used-for-ablution-and-ritual-bathing\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Bukhari said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَرِهَ أَهْلُ الْعِلْمِ الْإِسْرَافَ فِيهِ وَأَنْ يُجَاوِزَ فِعْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>The scholars disliked extravagance in ablution and to go beyond what was done by the Prophet, peace and blessings be upon him.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 1\/468<\/p><\/blockquote>\n<p>Using too much water in ablution is a form of prohibited extravagance and transgression.<\/p>\n<p>Abdullah ibn Mughaffal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ سَيَكُونُ فِي هَذِهِ الْأُمَّةِ قَوْمٌ يَعْتَدُونَ فِي الطَّهُورِ وَالدُّعَاءِ<\/p>\n<p><strong>There will come some people who will transgress in purification and supplication.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 96, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/06\/hadith-on-transgression-beware-not-to-exaggerate-or-transgress-in-your-prayers\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, passed by Sa’d while he was performing ablution. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا هَذَا السَّرَفُ<\/p>\n<p><strong>What is this extravagance<\/strong>?<\/p><\/blockquote>\n<p>Sa’d said, “Is there extravagance with water in ablution?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ وَإِنْ كُنْتَ عَلَى نَهَرٍ جَارٍ<\/p>\n<p><strong>Yes, even if you were on the banks of a flowing river<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 425, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/19\/hadith-on-water-conserve-water-even-if-you-are-on-the-banks-of-a-running-stream\/\"><strong><em>Sahih<\/em><\/strong> <\/a><\/p><\/blockquote>\n<p><strong><u>Using the toothstick<\/u><\/strong><\/p>\n<p>It is recommended to use the toothstick (<em>siwāk<\/em> or <em>miswāk<\/em>) with every ablution and prayer. One may use a modern toothbrush or rub their teeth with their wet fingers as well.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي أَوْ عَلَى النَّاسِ لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلَاة<\/p>\n<p><strong>Were it not too difficult upon my nation, I would have ordered them to use a toothstick with every prayer<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 847, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/02\/hadith-on-prayer-recommendation-to-use-a-toothbrush-before-prayer\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ<\/p>\n<p><strong>I would have ordered them to use the toothstick with every ablution.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 9612, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>It is also recommended to use the toothstick – or to brush one’s teeth – in five situations: 1) before ablution, 2) before prayer, 3) reciting the Quran, 4) awakening from sleep, and 5) when the taste in the mouth becomes stale.<\/p>\n<p><strong><u>Obligatory elements in ablution<\/u><\/strong><\/p>\n<p>The obligatory elements of ablution are those that are required or else the act is invalid, incomplete, and unacceptable. They are the bare minimum requirements for a valid ablution. To perfect ablution, one must begin by practicing the obligatory elements in the best manner and then gradually incorporating recommended elements into the routine.<\/p>\n<p>Abu Shuja’a writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفروض الوضوء ستة أشياء: النية عند غسل الوجه وغسل الوجه وغسل اليدين مع المرفقين ومسح بعض الرأس وغسل الرجلين إلى الكعبين والترتيب على ما ذكرناه<\/p>\n<p>The obligatory elements of ablution are six things: intention at the time of washing the face, washing the face, washing the hands up to the elbows, wiping part of the head, washing the feet up to the ankles, and performing what we mentioned in order.<\/p>\n<p>Source: al-Ghāyah wal-Taqrīb 1\/3<\/p><\/blockquote>\n<p>The evidence for each of these obligatory elements are as follows:<\/p>\n<p><strong>“Intention at the time of washing the face”<\/strong><\/p>\n<p>The worshiper should have the deliberate intention to perform ablution before starting ablution. If all the obligatory limbs were washed but without an intention to worship, the washing must be renewed.<\/p>\n<p>Umar ibn Al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى<\/p>\n<p><strong>Verily, deeds are only with intentions. Verily, every person will have only what they intended.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 54, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/29\/deeds-are-rewarded-according-to-their-intentions\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>It is not necessary to verbalize the intention by saying, &#8220;I intend to perform ablution.&#8221; It is enough to have awareness and mindfulness of one&#8217;s intended act in the heart.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَفْتَقِرُ إلَى نُطْقِ اللِّسَانِ بِاتِّفَاقِ أَئِمَّةِ الْإِسْلَامِ بَلْ النِّيَّةُ مَحَلُّهَا الْقَلْبُ دُونَ اللِّسَانِ بِاتِّفَاقِهِمْ<\/p>\n<p>(The intention for ablution) is not necessary to state on the tongue with words according to the agreement of the Imams of Islam. Rather, the intention is located in the heart without the tongue according to their consensus.<\/p>\n<p>Source: Majmū’ al-Fatāwá 22\/230<\/p><\/blockquote>\n<p><strong>“Washing the face, hands to the elbows, wiping part of the head, washing feet up to the ankles”<\/strong><\/p>\n<p>These are the most important limbs to wash during ablution. They are based upon the verse of ablution in the Quran and the narration of ablution from Uthman ibn Affan, may Allah be pleased with him.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا ۚ وَإِن كُنتُم مَّرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ۚ مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ<\/p>\n<p><strong>O you who believe, when you rise to perform prayer, wash your faces and your forearms to the elbows and wipe over your heads and wash your feet to the ankles. And if you are in a state of greater impurity<\/strong> (<em>janabah<\/em>), <strong>then purify yourselves. But if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and do not find water, then seek clean earth and wipe over your faces and hands with it. Allah does not intend to make difficulty for you, but He intends to purify you and complete His favor upon you that you may be grateful.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:6<\/p><\/blockquote>\n<p>Humran reported: I saw Uthman request a vessel of water and he poured water over his hands three times and then washed them. Then, he put his right hand in the vessel and rinsed his mouth and sniffed water into his nose. Then, he washed his face three times and his hands up to the elbow three times. Then, he wiped his head and washed his feet three times. Uthman said: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ<\/p>\n<p><strong>He who performed ablution like this ablution of mine and offered two cycles of prayer without allowing his thoughts to be distracted, then his previous sins will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 158, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/06\/hadith-on-ablution-whoever-performs-ablution-and-prayer-perfectly-then-all-his-previous-minor-sins-will-be-forgiven\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Performing what we mentioned in order”<\/strong><\/p>\n<p>Scholars have stipulated that the washing of these limbs should be done in the order they are mentioned in the verse.<\/p>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَبْدَأُ بِمَا بَدَأَ اللَّهُ<\/p>\n<p><strong>We begin as Allah has begun<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2967, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-hajj-we-begin-as-allah-began-in-the-quran\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Prophet (ṣ) said this about performing the Hajj rituals of Al-Safa and Al-Marwah. That is, one should begin at Al-Safa when running between the mountains during Hajj and Umrah, because this is the order in which Allah mentioned them. By analogy, we should likewise follow the sequence of ablution as mentioned in the verse and authentic narrations.<\/p>\n<p>However, some scholars considered following the sequence to be a recommendation and not an obligation.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّرْتِيبُ فِي الْوُضُوءِ وَغَيْرِهِ مِنْ الْعِبَادَاتِ وَالْعُقُودِ النِّزَاعُ فِيهِ مَشْهُورٌ فَمَذْهَبُ الشَّافِعِيِّ وَأَحْمَد يَجِبُ وَمَذْهَبُ مَالِكٍ وَأَبِي حَنِيفَةَ لَا يَجِبُ<\/p>\n<p>The sequence in ablution and other acts of worship and works, the disagreement over it is well-known. The school of Ash-Shafi’ee and Ahmad say it is an obligation, and the school of Malik and Abu Hanifa say it is not an obligation.<\/p>\n<p>Source: Majmū’ al-Fatāwá 21\/407<\/p><\/blockquote>\n<p>Out of precaution and care to perform the best ablution, we should memorize the proper order of washing and make them part of our daily habits.<\/p>\n<p><strong><u>Recommended elements in ablution<\/u><\/strong><\/p>\n<p>The recommended elements of ablution are those that increase the virtue and reward of ablution. They are not obligatory and omitting them does not invalidate the act. However, we should practice all of the recommended elements, as much as we are able, if we want to perform the best ablution possible.<\/p>\n<p>Abu Shuja’a writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وسننه عشرة أشياء التسمية وغسل الكفين قبل إدخالهما الإناء والمضمضة والاستنشاق ومسح الأذنين ظاهرهما وباطنهما بماء جديد وتخليل اللحية الكثة وتخليل أصابع اليدين والرجلين وتقديم اليمنى على اليسرى والطهارة ثلاثا ثلاثا والموالاة<\/p>\n<p>The (recommended) prophetic practices are ten things: beginning with the name of Allah, washing the hands before dipping them into the vessel, rinsing the mouth and sniffing water into the nose, wiping the entire head, wiping the inner and outer parts of the ear with new water, running wet fingers through a thick beard, running wet fingers between fingers and toes, beginning with the right side before the left side, performing the purifying actions three times each, and to do so continuously.<\/p>\n<p>Source: al-Ghāyah wal-Taqrīb 1\/4<\/p><\/blockquote>\n<p>The evidence for each of these recommended elements are as follows:<\/p>\n<p><strong>“Beginning in the name of Allah”<\/strong><\/p>\n<p>It is recommended to begin ablution by saying <em>bismillah<\/em> (&#8220;in the name of Allah&#8221;). This supplication strengthens our mindfulness of the obligatory intention.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ تَعَالَى عَلَيْهِ<\/p>\n<p><strong>There is no prayer for one without ablution, and there is no ablution for one without mentioning the name of Allah before it.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 101, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/10\/25\/hadith-on-wudu-recommendation-to-mention-allah-before-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The phrase “there is no ablution for one without mentioning the name of Allah before it,” is interpreted as encouragement to perfect ablution, not to invalidate the ablution as a whole.<\/p>\n<p>Al-Marghinani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا وضوء لمن لم يسم الله والمراد به نفي الفضيلة والأصح أنها مستحبة<\/p>\n<p>No ablution without mentioning the name of Allah means a negation of perfection, and the more correct opinion is that it is recommended.<\/p>\n<p>Source: al-Hidāyah 1\/15<\/p><\/blockquote>\n<p><strong>“Washing the hands before dipping them in the vessel”<\/strong><\/p>\n<p>It is recommended to wash one’s hands before putting them into the vessel to be used for ablution. It is still good to wash one’s hands before ablution if one is using a moderate amount of running tap water.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلَا يَغْمِسْ يَدَهُ فِي الْإِنَاءِ حَتَّى يَغْسِلَهَا ثَلَاثًا فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ<\/p>\n<p><strong>When one of you awakens from sleep, do not let him dip his hands into the vessel until he washes them three times. Verily, he does not know where his hand spent the night.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 160, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-cleanliness-wash-hands-when-waking-up-and-before-ablution\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Rinsing the mouth and sniffing water into the nose”<\/strong><\/p>\n<p>It is recommended to rinse the mouth, sniff water into the nose and blow it out as part of washing the face. Sniffing water should be done deeply to the point of it nearly dripping into one’s throat, except when fasting. Sniffing water will sting at first for those unaccustomed to it, but one will get used to it and enjoy its benefits. These two acts promote health by cleansing and invigorating the mouth and sinuses.<\/p>\n<p>Laqit ibn Sabirah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَسْبِغْ الْوُضُوءَ وَخَلِّلْ بَيْنَ الْأَصَابِعِ وَبَالِغْ فِي الِاسْتِنْشَاقِ إِلَّا أَنْ تَكُونَ صَائِمًا<\/p>\n<p><strong>Perform ablution thoroughly, run your fingers between your fingers and toes, and sniff water deeply into your nose unless you are fasting.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 788, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/11\/29\/hadith-on-ablution-recommendation-to-sniff-water-deeply-and-rinse-mouth\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Wiping the entire head”<\/strong><\/p>\n<p>It is recommended to wipe the entire head and not simply a part of it.<\/p>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">(أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ بِرَأْسِهِ وَأُذُنَيْهِ ظَاهِرِهِمَا وَبَاطِنِهِمَا (في الوضوء<\/p>\n<p>The Prophet, peace and blessings be upon him, would wipe his head and his ears (in ablution), both inner and outer parts.<\/p>\n<p>Source: Sunan al-Tirmidhī 39, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-wiping-the-head-and-inner-and-outer-ears-in-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Wiping the inner and outer parts of the ear with new water”<\/strong><\/p>\n<p>It is recommended to wet one’s hands again, after wiping the head, to clean the inner and outer parts of the ear.<\/p>\n<p>Abdullah ibn Zaid reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأَى رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ فَأَخَذَ لِأُذُنَيْهِ مَاءً خِلَافَ الْمَاءِ الَّذِي أَخَذَ لِرَأْسِهِ<\/p>\n<p>He saw the Messenger of Allah, peace and blessings be upon him, performing ablution and using water for his ears that was different from what he used for his head.<\/p>\n<p>Source: al-Sunan al-Kubrá 308, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-wiping-the-ears-with-new-water-in-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Running fingers through a thick beard”<\/strong><\/p>\n<p>It is recommended to run one’s fingers through a very thick beard. For those with a light beard, the water should touch the skin on the face.<\/p>\n<p>Uthman ibn Affan reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">(أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخَلِّلُ لِحْيَتَهُ (في الوضوء<\/p>\n<p>The Prophet, peace and blessings be upon him, would run his fingers through his beard during ablution.<\/p>\n<p>Source: Sunan al-Tirmidhī 31, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-running-fingers-through-a-thick-beard-in-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Running fingers between fingers and toes”<\/strong><\/p>\n<p>It is recommended to clean between the fingers and toes when washing the hands and feet.<\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا تَوَضَّأْتَ فَخَلِّلْ بَيْنَ أَصَابِعِ يَدَيْكَ وَرِجْلَيْكَ<\/p>\n<p><strong>When you perform ablution, run your fingers between the fingers on your hands and your toes.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 39, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-run-fingers-between-fingers-and-toes-in-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Beginning with the right side before the left side”<\/strong><\/p>\n<p>It is recommended to begin ablution by washing the right limbs before the left limbs, as it is also recommended in various daily activities such as getting dressed and grooming one&#8217;s self. However, it is disliked to use the right hand to clean one&#8217;s self after using the toilet or performing other filthy actions.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ التَّيَمُّنُ فِي تَنَعُّلِهِ وَتَرَجُّلِهِ وَطُهُورِهِ وَفِي شَأْنِهِ كُلِّهِ<\/p>\n<p>The Prophet, peace and blessings be upon him, liked to begin on his right side when putting on his shoes, combing his hair, performing his ablution, and in all of his affairs.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 166, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-ablution-recommendation-to-begin-acts-on-the-right-side\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong>“Perform the purifying actions three times each”<\/strong><\/p>\n<p>It is recommended to perform each act of washing three times. However, it is permissible to do it only once or twice.<\/p>\n<p>Ali reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثَلَاثًا ثَلَاثًا<\/p>\n<p>The Prophet, peace and blessings be upon him, would perform acts of ablution three times.<\/p>\n<p>Source: Sunan al-Tirmidhī 44, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-ablution-recommendation-to-perform-acts-of-ablution-three-times-each\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>At-Tirmidhi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَمَلُ عَلَى هَذَا عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ أَنَّ الْوُضُوءَ يُجْزِئُ مَرَّةً مَرَّةً وَمَرَّتَيْنِ أَفْضَلُ وَأَفْضَلُهُ ثَلَاثٌ وَلَيْسَ بَعْدَهُ شَيْءٌ<\/p>\n<p>This is practiced by the majority of scholars, that it permissible to perform ablution with one act each, it is better to perform it with two acts each, and it is best to perform it with three acts each; there is nothing better after this.<\/p>\n<p>Source: Sunan al-Tirmidhī 44<\/p><\/blockquote>\n<p><strong>“To do so continuously”<\/strong><\/p>\n<p>It is recommended, and some scholars say it is obligatory, to perform the elements of ablution in quick succession or all at once. One limb should not become dry before starting to wash another.<\/p>\n<p>According to Ahmad Al-Shirbini:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُوَالَاة بَين الْأَعْضَاء فِي التَّطْهِير بِحَيْثُ لَا يجِف الأول قبل الشُّرُوع فِي الثَّانِي<\/p>\n<p>‘Continuously’ means between the limbs during purification, such that the first limb does not become dry before beginning with the second limb.<\/p>\n<p>Source: al-Iqnā’ fī Ḥall Alfāẓ Abī Shujā’ 1\/51<\/p><\/blockquote>\n<p>The evidence for this is that the Prophet (ṣ) told a man to renew his ablution after he noticed that he missed a spot on his skin.<\/p>\n<p>Umar ibn Al-Khattab reported: A man performed ablution and he left out a spot on his foot the size of a fingernail. The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ارْجِعْ فَأَحْسِنْ وُضُوءَكَ<\/p>\n<p><strong>Go back and perform ablution well<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 243, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-ablution-should-be-performed-continuously-and-uninterrupted\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>If continuity was not recommended, the Prophet (ṣ) would have told him to return and simply wash the missing spot. This narration is also evidence that the water should touch every part of the skin on the required limbs.<\/p>\n<p><strong><u>Supplications for ablution<\/u><\/strong><\/p>\n<p>There are two authentic supplications for the worshiper to say, one during ablution and the other after it.<\/p>\n<p>Abu Musa reported: I came to the Messenger of Allah, peace and blessings be upon him, while he was performing ablution. I heard the Prophet supplicating:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِي رِزْقِي<\/p>\n<p><strong>O Allah, forgive my sins, expand my dwelling, and bless me in my provision.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Nasā’ī 9828, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/hadith-on-wudu-supplication-during-performance-of-ablution\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Umar ibn Al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ اللَّهُمَّ اجْعَلْنِي مِنْ التَّوَّابِينَ وَاجْعَلْنِي مِنْ الْمُتَطَهِّرِينَ فُتِحَتْ لَهُ ثَمَانِيَةُ أَبْوَابِ الْجَنَّةِ يَدْخُلُ مِنْ أَيِّهَا شَاءَ<\/p>\n<p><strong>Whoever performs ablution in the best manner and then he says, ‘I bear witness there is no god but Allah alone without any partners, and I bear witness Muhammad is his servant and his messenger, O Allah, make me among those who repent and make me among those who purify themselves,’ then the eight gates of Paradise will be opened for him and he may enter through whichever he wishes<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 55, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/13\/hadith-on-ablution-great-reward-for-perfect-wudu-and-performance-of-sunan-supplication\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The phrase “make me among those who purify themselves,” means purification in a comprehensive sense, both inwardly and outwardly: purification from filth and dirt on the body, spiritual diseases in the heart, evil and vain thoughts in the mind, and sins on the record of deeds.<\/p>\n<p><strong><u>Inward dimensions of ablution<\/u><\/strong><\/p>\n<p>Finally, one should be mindful of the inward dimensions of ablution at each stage of the act. Outward purification of filth should mirror inward purification of the heart from spiritual diseases. The running of water over the limbs is, in a way, symbolic of the cleansing of the heart.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالطِّهَارَةُ لَهَا أَرْبَعُ مَرَاتِبَ الْمَرْتَبَةُ الْأُولَى تَطْهِيرُ الظَّاهِرِ عَنِ الْأَحْدَاثِ وَعَنِ الْأَخْبَاثِ وَالْفَضَلَاتِ الْمَرْتَبَةُ الثَّانِيَةُ تَطْهِيرُ الْجَوَارِحِ عَنِ الْجَرَائِمِ وَالْآثَامِ الْمَرْتَبَةُ الثَّالِثَةُ تَطْهِيرُ الْقَلْبِ عَنِ الْأَخْلَاقِ الْمَذْمُومَةِ وَالرَّذَائِلِ الْمَمْقُوتَةِ الْمَرْتَبَةُ الرَّابِعَةُ تَطْهِيرُ السِّرِّ عَمَّا سوى الله تعالى وهي طهارة الأنبياء صلوات الله عليهم والصديقين<\/p>\n<p>Purification has four levels. The first level is outward purification from bodily waste, filth, and residues. The second level is purification of the limbs from crimes and sins. The third level is purification of the heart from blameworthy character traits and detestable vices. The fourth level is purification of one’s inward being from everything besides Allah Almighty, and it is the purification of the Prophets, peace and blessings be upon him, and the righteous.<\/p>\n<p>Source: Iḥyā’ ‘Ulūm al-Dīn 1\/126<\/p><\/blockquote>\n<p>And Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومهما فَرَغَ مِنْ وُضُوئِهِ وَأَقْبَلَ عَلَى الصَّلَاةِ فَيَنْبَغِي أَنْ يَخْطِرَ بِبَالِهِ أَنَّهُ طَهُرَ ظَاهِرُهُ وَهُوَ موضع نظر الخلق أَنْ يَسْتَحِيَ مِنْ مُنَاجَاةِ اللَّهِ تَعَالَى مِنْ غير تطهير قلبه وهو موضع نظر الرب سبحانه وليحقق طَهَارَةَ الْقَلْبِ بِالتَّوْبَةِ وَالْخُلُوِّ عَنِ الْأَخْلَاقِ الْمَذْمُومَةِ والتخلق بالأخلاق الحميدة أولى<\/p>\n<p style=\"text-align: right;\">وأن من يقتصر على طهارة الظاهر كمن يَدْعُوَ مَلِكًا إِلَى بَيْتِهِ فَتَرَكَهُ مَشْحُونًا بِالْقَاذُورَاتِ وَاشْتَغَلَ بِتَجْصِيصٍ ظَاهِرِ الْبَابِ الْبَرَّانِيِّ مِنَ الدَّارِ وما أجدر مثل هذا الرجل بالتعرض للمقت والبوار<\/p>\n<p>Whenever one finishes his ablution and approaches the prayer, it should occur in his mind that he purified his outward appearance – the place which people observe – and that he should feel shame for confiding in Allah Almighty without purifying his heart, for it is the place observed by the Lord, glory be to Him. And it should occur to him to purify the heart with repentance, expelling blameworthy character traits, and to enculture himself with the essential, praiseworthy character traits.<\/p>\n<p>One who limits himself only to the purification of his outward appearance is like one who invites a king into his house. He leaves the inside laden with rubbish while he busies himself with decorating the main door of the building. How entitled is the likes of this man to be exposed to contempt and ruin!<\/p>\n<p>Source: Iḥyā’ ‘Ulūm al-Dīn 1\/135<\/p><\/blockquote>\n<p>Hence, in order to perfect our ablution, we should strive to meet both its outward and inward objectives. A perfect outward ablution ought to lead to greater purity of heart and righteous deeds, with an aim of achieving complete mindfulness of Allah in all that we do.<\/p>\n<p>We ask Allah to grant us facilitation and ease in performing our acts of worship in the best possible manner.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O you who believe, when you rise to perform prayer, wash your faces and your forearms to the elbows&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[160,16,250,342,41,100,93,60,84,45],"class_list":["post-18580","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-ablution-wudu","tag-character-akhlaq","tag-cleanliness-al-taharah","tag-al-fiqh","tag-imam-al-shafii","tag-manners-al-adab","tag-moderation-al-wasitiyyah","tag-prayer-salat","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-quran-exegesis-tafsir"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4PG","jetpack-related-posts":[{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":18580,"position":0},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23589,"url":"https:\/\/www.abuaminaelias.com\/zaad-al-maad-wudu\/","url_meta":{"origin":18580,"position":1},"title":"Provisions for the Hereafter: Ablution","author":"Abu Amina Elias","date":"September 26, 2021","format":false,"excerpt":"\"He would perform ablution for every prayer most of the time,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13409,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-ablution-wudu\/","url_meta":{"origin":18580,"position":2},"title":"Imam al-Nawawi on Ritual Ablution, al-Wudu","author":"Abu Amina Elias","date":"May 6, 2013","format":false,"excerpt":"\"The radiance of a believer will reach wherever the water of ablution has reached.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16650,"url":"https:\/\/www.abuaminaelias.com\/the-purpose-of-prayer-in-islam\/","url_meta":{"origin":18580,"position":3},"title":"Purpose of prayer in Islam","author":"Abu Amina Elias","date":"June 25, 2015","format":false,"excerpt":"\"Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20698,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-excellent-wudu\/","url_meta":{"origin":18580,"position":4},"title":"Imam al-Mundhiri on Excellent Ablution","author":"Abu Amina Elias","date":"July 30, 2019","format":false,"excerpt":"\"Purity is half of faith,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14337,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-sinfulness-of-vanity-in-clothing\/","url_meta":{"origin":18580,"position":5},"title":"Imam al-Nawawi on Pride and Vanity in Clothing","author":"Abu Amina Elias","date":"July 21, 2013","format":false,"excerpt":"\"Whatever part of the garment is below the two ankles is in the Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18580","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18580"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18580\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18580"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18580"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18580"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}