{"id":18617,"date":"2016-07-04T10:49:10","date_gmt":"2016-07-04T06:49:10","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18617"},"modified":"2025-07-04T11:00:46","modified_gmt":"2025-07-04T07:00:46","slug":"why-two-sheep-for-a-boy-and-one-for-a-girl","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/why-two-sheep-for-a-boy-and-one-for-a-girl\/","title":{"rendered":"Why two sheep for a boy and one for a girl?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The newborn celebration in Islam (<em>al-‘aqiqah<\/em>) is recommended for both boys and girls. One scholarly opinion stipulates that two sheep should be sacrificed for a boy and only one sheep for a girl. It is wrongly inferred from this opinion that boys are more valuable than girls. This interpretation is impossible because it contradicts the Quran, which expresses spiritual value only in terms of righteousness and not gender, race, or any other physical characteristic. Moreover, the alternative scholarly opinion, and arguably the stronger opinion, is that the sacrifice for boys and girls should be the same.<\/p>\n<p>In the Maliki school, the opinion is that one sheep should be sacrificed for each boy and girl, as part of the celebration and to distribute a portion of the meat to the poor in charity.<\/p>\n<p>Nafi’ reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رضي الله عنه لَمْ يَكُنْ يَسْأَلُهُ أَحَدٌ مِنْ أَهْلِهِ عَقِيقَةً إِلَّا أَعْطَاهُ إِيَّاهَا وَكَانَ يَعُقُّ عَنْ وَلَدِهِ بِشَاةٍ شَاةٍ عَنْ الذُّكُورِ وَالْإِنَاثِ<\/p>\n<p>Abdullah ibn Umar, may Allah be pleased with him, was not asked by anyone from his family to provide a newborn celebration but that he would perform it. He would perform a newborn celebration for his child by sacrificing a sheep for each boy and girl.<\/p>\n<p>Source: al-Muwaṭṭa’ 2187, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/01\/13\/hadith-on-aqiqah-recommendation-to-sacrifice-one-sheep-for-each-newborn\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam Malik related a consensus on this point among the people of Medina, which is to say that it was the living practice of the city instituted by the Prophet (ṣ) himself.<\/p>\n<p>Malik said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْأَمْرُ الذي لا اختلاف فيه عِنْدَنَا فِي الْعَقِيقَةِ أَنَّ مَنْ عَقَّ فَإِنَّمَا يَعُقُّ عَنْ وَلَدِهِ عن الذُّكُورِ وَالإِنَاثِ بِشَاةٍ شَاةٍ وَلَيْسَتِ الْعَقِيقَةُ بِوَاجِبَةٍ وَلَكِنَّهَا يُسْتَحَبُّ الْعَمَلُ بِهَا<\/p>\n<p>The matter in which there is no disagreement among us regarding the newborn celebration, is that whoever performs it does so for his child by offering a sheep for each male and female. The newborn celebration is not an obligation, but rather it is recommended to act upon it.<\/p>\n<p>Source: al-Muwaṭṭa’ 2\/206<\/p><\/blockquote>\n<p>The chain of narration upon which Malik relied is considered one of the strongest chains of authority (<em>al-isnad<\/em>) in the Hadith sciences.<\/p>\n<p>As-Safiri writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مذهب البخاري أن أصح الأسانيد ما رواه مالك عن نافع عن ابن عمر<\/p>\n<p>The way of Al-Bukhari is that the most authentic of chains is what is narrated by Malik, from Nafi’, from Ibn Umar.<\/p>\n<p>Source: al-Majālis al-Wa’ẓīyah 1\/335<\/p><\/blockquote>\n<p>Furthermore, Ibn Umar was an authority on the prophetic practice, so his practices are usually attributed to the Prophet (ṣ) himself.<\/p>\n<p>Az-Zurqani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ يعني ابن عمر مَنْ أَشَدِّ الصَّحَابَةِ اتِّبَاعًا لِلسُّنَّةِ فَيَجِبُ نَشْرُهَا &#8230; فَإِنَّ الذَّكَرَ وَالْأُنْثَى فِيهَا سَوَاءٌ<\/p>\n<p>Ibn Umar was the strictest of the companions in following the Sunnah, so it is an obligation to propagate it… for the male and female are the same regarding (the newborn celebration).<\/p>\n<p>Source: Sharḥ al-Zurqānī 3\/149<\/p><\/blockquote>\n<p>And Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَعَنْ مَالِكٍ هُمَا سَوَاءٌ فَيَعُقُّ عَنْ كُلِّ وَاحِدٍ مِنْهُمَا شَاةً<\/p>\n<p>It is related from Malik that the boy and the girl are the same, so the newborn celebration is performed for each of them with one sheep.<\/p>\n<p>Source: Fatḥ al-Bārī 9\/592<\/p><\/blockquote>\n<p>In support of this opinion, Malik refers to another authentic narration which states that the Prophet (ṣ) sacrificed only one ram for each of his grandsons.<\/p>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَقَّ عَنِ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, performed the newborn celebration for Hasan and Hussein by sacrificing a ram for each.<\/p>\n<p>Source: Sunan Abī Dāwūd 2841, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>However, a variant report with an authentic chain states that it was two rams each:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بِكَبْشَيْنِ كَبْشَيْنِ<\/p>\n<p>…with two rams each.<\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 4219<\/p><\/blockquote>\n<p>And there is a further supporting report from Aisha regarding two sheep for a boy:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُمْ عَنْ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, commanded them to sacrifice two sheep of equal age for a boy and one for a girl.<\/p>\n<p>Source: Sunan al-Tirmidhī 1513, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>These conflicting narrations, variously considered sound, are the reason for the scholarly disagreement. Since the reports apparently contradict each other, Malik preferred to give greater weight to equality between genders, which is in agreement with the general principle in the Quran.<\/p>\n<p>Az-Zurqani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَكِنَّ حُجَّةَ مَالِكٍ وَمَنْ وَافَقَهُ أَنَّهُ لَمَّا اخْتَلَفَتِ الرِّوَايَةُ فِيمَا عَقَّ بِهِ عَنِ الْحَسَنَيْنِ تَرَجَّحَ تَسَاوِي الذُّكُورِ وَالْإِنَاثِ بِالْعَمَل<\/p>\n<p>Rather, the argument for Malik and those who agreed with him is that when the reports about the newborn celebration of Hasan and Hussein conflict, he would give preponderance to equality between male and female in practice.<\/p>\n<p>Source: Sharḥ al-Zurqānī 3\/149<\/p><\/blockquote>\n<p>In general, the rules for men and women are the same, with a few exceptions related to the nature of men and women, such as rules for menstruation.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, was asked about a man who finds moisture but he does not remember having a nocturnal emission. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَغْتَسِلُ<\/p>\n<p><strong>He should take a bath.<\/strong><\/p><\/blockquote>\n<p>Umm Sulaim said, “Is it the same for a woman if she sees something like that?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ إِنَّمَا النِّسَاءُ شَقَائِقُ الرِّجَالِ<\/p>\n<p><strong>Yes, for women are only the counterparts of men.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 25663, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/09\/hadith-on-cleanliness-men-and-women-who-have-wet-dreams-should-perform-a-ritual-bath-ghusl\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this tradition, the Prophet (ṣ) stated that the same rule which applied to men also applied to women. Men and women are the same, except when they are different. Hence, Malik gave preponderance to the default position – equality between genders – when the texts contradict each other.<\/p>\n<p>If for the sake of argument, we accept the opinion that a boy is celebrated with two sheep and a girl with one, the reason behind this rule is not stated in the texts. We can only infer and speculate the wisdom behind it.<\/p>\n<p>For certain, it cannot be because boys are better or more valuable than girls. The Quran harshly criticizes the pre-Islamic culture that devalued girls, including the cultural pressure that would encourage men to bury their daughters alive.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا بُشِّرَ أَحَدُهُم بِالْأُنثَىٰ ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ يَتَوَارَىٰ مِنَ الْقَوْمِ مِن سُوءِ مَا بُشِّرَ بِهِ ۚ أَيُمْسِكُهُ عَلَىٰ هُونٍ أَمْ يَدُسُّهُ فِي التُّرَابِ ۗ أَلَا سَاءَ مَا يَحْكُمُونَ<\/p>\n<p><strong>When one of them is told of the birth of a female, his face becomes dark and he suppresses his grief. He hides himself from the people because of the &#8216;bad news&#8217; of which he has been informed. Should he keep her in humiliation or bury her in the ground? No doubt, it is evil they judge.<\/strong><\/p>\n<p>Surat al-Nahl 16:58-59<\/p><\/blockquote>\n<p>It would be nonsensical for the Prophet (ṣ) to institute a practice that would reinforce the cultural prejudice that the Quran was revealed to dismantle. Rather, it is more probable that he stipulated two sheep for boys and one for girls in some specific instances, depending upon the circumstances.<\/p>\n<p>Perhaps the Prophet (ṣ) understood that some men, being newly converted to Islam, were still under pre-Islamic cultural pressure and therefore he lessened the recommended amount of charity, to make the decision to keep the girl easier for them. As such, it was a means of further dismantling this cultural prejudice and not reinforcing it.<\/p>\n<p>In any case, the strongest opinion, from both a textual and principled standpoint, is that boys and girls are celebrated equally as newborns. Not only was this the consensus of the scholars of Medina, it is also in agreement with the Quranic principle of spiritual equality between genders.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Women are only the counterparts of men.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[17,18,342,34,43,48,55,91,128],"class_list":["post-18617","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-charity-al-sadaqah","tag-community-jamaah","tag-al-fiqh","tag-humanity-al-insaaniyyah","tag-imam-malik","tag-justice-adl","tag-methodology-al-minhaj","tag-righteous-predecessors-al-salaf-al-salih","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4Qh","jetpack-related-posts":[{"id":21364,"url":"https:\/\/www.abuaminaelias.com\/baby-girl-buried-alive-in-hell\/","url_meta":{"origin":18617,"position":0},"title":"Baby girl buried alive is in Hell?","author":"Abu Amina Elias","date":"October 23, 2019","format":false,"excerpt":"\"For what sin was she killed?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12916,"url":"https:\/\/www.abuaminaelias.com\/the-martyrdom-of-prophet-muhammad-an-example-of-his-tolerance-and-forgiveness\/","url_meta":{"origin":18617,"position":1},"title":"Martyrdom of Prophet Muhammad: An example of forbearance and forgiveness","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"I never saw a case involving legal retaliation being referred to the Messenger of Allah, peace and blessings be upon him, except that he would command pardoning the criminal.\" --Anas ibn Malik","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12981,"url":"https:\/\/www.abuaminaelias.com\/are-muslims-only-kind-to-believers\/","url_meta":{"origin":18617,"position":2},"title":"Are Muslims only kind to believers?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah does not forbid you from being kind and just...\" (60:8)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17815,"url":"https:\/\/www.abuaminaelias.com\/rights-on-animals-in-islam\/","url_meta":{"origin":18617,"position":3},"title":"Rights of animals in Islam","author":"Abu Amina Elias","date":"February 29, 2016","format":false,"excerpt":"\"In every living being there is a reward for charity.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":24377,"url":"https:\/\/www.abuaminaelias.com\/touching-slave-girls-market\/","url_meta":{"origin":18617,"position":4},"title":"Touching slave girls in the market?","author":"Abu Amina Elias","date":"January 13, 2023","format":false,"excerpt":"\"Proper analysis of these narrations will demonstrate that there was nothing sexual about this practice.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":18617,"position":5},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18617","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18617"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18617\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18617"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18617"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}