{"id":18667,"date":"2018-01-22T11:15:44","date_gmt":"2018-01-22T07:15:44","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18667"},"modified":"2021-08-04T08:39:35","modified_gmt":"2021-08-04T04:39:35","slug":"cleanliness-and-pleasant-appearance-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/cleanliness-and-pleasant-appearance-in-islam\/","title":{"rendered":"Cleanliness and pleasant appearance in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam teaches us to value cleanliness, to practice good hygiene habits, and to take care of our appearance as a courtesy to others. This is especially true for anyone who represents Islam in an official capacity, such as an Imam or a scholar. Physical appearance can be a reflection of what is in the heart, so outward cleanliness must also accompany inward purification of the soul.<\/p>\n<p>The general rule is that we should wear nice clothes, modestly and moderately, when we go to public places like the mosque.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِندَ كُلِّ مَسْجِدٍ وَكُلُوا وَاشْرَبُوا وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ<\/p>\n<p><strong>O children of Adam, take your adornment at every place of prayer. Eat and drink, but not to excess. Verily, He does not love those who commit excess.<\/strong><\/p>\n<p>Surat al-A’raf 7:31<\/p><\/blockquote>\n<p>This verse was revealed about the idolaters who would circumambulate the Ka’bah without wearing any clothes at all.<\/p>\n<p>Ibn Abbas, may Allah be pleased with him, said regarding this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانُوا يَطُوفُونَ بِالْبَيْتِ عُرَاةً فَأَمَرَهُمُ اللَّهُ أَنْ يَلْبَسُوا ثِيَابَهُمْ وَلَا يَتَعَرُّوا<\/p>\n<p>They used to circle the Sacred House while naked, so Allah commanded them to wear their clothes and not to expose their nakedness.<\/p>\n<p>Source: Jāmiʻ al-Bayān ʻan Taʼwīl al-Qurʼān 7:31<\/p><\/blockquote>\n<p>Allah ordered all human beings (the children of Adam) not only to wear clothes, but also to “take your adornment,” which has an even broader meaning.<\/p>\n<p>On this basis, scholars derived that it is recommended to present a pleasant appearance when venturing out into public spaces. This includes wearing nice clothing, having a pleasing scent, and practicing healthy hygiene. It is further emphasized to have such a good appearance on special occasions such as Friday prayer and Eid.<\/p>\n<p>Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِهَذِهِ الْآيَةِ وَمَا وَرَدَ فِي مَعْنَاهَا مِنَ السُّنَّةِ يُسْتَحَبُّ التَّجَمُّلُ عِنْدَ الصَّلَاةِ وَلَا سِيَّمَا يَوْمَ الْجُمُعَةِ وَيَوْمَ الْعِيدِ وَالطِّيبُ لِأَنَّهُ مِنَ الزِّينَةِ وَالسِّوَاكُ لِأَنَّهُ مِنْ تَمَامِ ذَلِكَ<\/p>\n<p>Because of this verse, and what was related with the same meaning in the Sunnah, it is recommended to beautify one’s self at the time of prayer, particularly on Friday and the day of Eid, as well as to apply perfume, as it is part of adornment, and to use the toothstick, as it is the perfection of all that.<\/p>\n<p>Source: Tafsīr al-Qurʼān al-ʻAẓīm 7:31<\/p><\/blockquote>\n<p>Dressing ourselves nicely should match whatever occasion or situation we happen to be in. There are special occasions, such as Friday and Eid, when we should wear our nicest clothes.<\/p>\n<p>Nafi’ reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ ابْنَ عُمَرَ رضي الله عنه كَانَ يَلْبَسُ فِي الْعِيدَيْنِ أَحْسَنَ ثِيَابِهِ<\/p>\n<p>Abdullah ibn Umar, may Allah be pleased with him, would wear his best clothes on the days of the two Eids.<\/p>\n<p>Source: Sunan al-Kubrā 5667, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2014\/07\/26\/hadith-on-eid-recommendation-to-wear-the-best-clothes-on-the-day-of-eid\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>There is also an element of permissible social custom involved in dressing for the occasion. We should dress nicely when we host guests, visit others, or attend public events. What constitutes nice dress also might be different, depending on place and custom, so one should be aware of local customs related to dress and respect them within Islamic norms.<\/p>\n<p>The intention of adhering to this command from Allah is to cultivate gratitude. As Muslims, we should not hide our blessings because Allah loves for us to display our blessings with humility.<\/p>\n<p>Amr in Shu’aib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا فِي غَيْرِ مَخِيلَةٍ وَلَا سَرَفٍ إِنَّ اللَّهَ يُحِبُّ أَنْ تُرَى نِعْمَتُهُ عَلَى عَبْدِهِ<\/p>\n<p><strong>Eat, drink, and give in charity. Wear <\/strong>(nice)<strong> clothing but without pride and extravagance. Verily, Allah loves for his blessings to be seen upon his servants.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6656, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/24\/hadith-on-blessings-enjoy-the-blessings-of-allah-but-without-pride-or-extravagance\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Showing blessings outwardly, in a humble and modest way, is supposed to inspire thankfulness in ourselves and others. It should not be done to put others down, to make others feel badly, or for any other irreligious reason.<\/p>\n<p>Umar ibn Abdul Aziz, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تذاكروا النعم فإن ذكرها شكر<\/p>\n<p>Remind each other of your blessings, for to remember them is to be grateful.<\/p>\n<p>Source: Sirāj al-Mulūk 1\/106<\/p><\/blockquote>\n<p>At the same time, we should not envy others for their blessings and pleasant appearance. We ourselves should remember Allah and be grateful for our own blessings when we see blessings upon others.<\/p>\n<p>There is nothing wrong with wearing nice clothes, while avoiding extravagance, as long as we are not arrogant, proud, or boastful against others because of it. One of the attributes of Allah is beauty and He loves for the believers to reflect that beauty into the world.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ<\/p>\n<p><strong>No one who has the weight of a seed of arrogance in his heart will enter Paradise.<\/strong><\/p><\/blockquote>\n<p>A man said, “But a man loves to have beautiful clothes and shoes.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ جَمِيلٌ يُحِبُّ الْجَمَالَ الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ<\/p>\n<p><strong>Verily, Allah is beautiful and He loves beauty. Arrogance means rejecting the truth and looking down on people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/05\/arrogance-prevents-a-person-from-entering-paradise\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Another purpose of having a pleasant appearance is that it fosters good companionship among righteous people. It makes it easier to be around other believers in the mosque, in public, and in their homes. On the contrary, we should not do anything to repulse others, whether in daily life or religious preaching.<\/p>\n<p>Abu Burda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَسِّرَا وَلَا تُعَسِّرَا وَبَشِّرَا وَلَا تُنَفِّرَا وَتَطَاوَعَا وَلَا تَخْتَلِفَا<\/p>\n<p><strong>Make things easy and do not make things difficult. Give glad tidings and do not repel people. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2873, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/11\/hadith-on-dawah-give-glad-tidings-make-it-easy-and-remain-united\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Leaders and people of influence in the Muslim community must especially follow these instructions, because a repulsive appearance could potentially lead people away from Islam.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهذا القصد واجب على كل عالم تصدي لدعوة الخلق إلى الله عز وجل وهو أن يراعي من ظاهره ما لا يوجب نفرة الناس عنه<\/p>\n<p>This aim (of cleanliness) is an obligation upon every knowledgeable person tasked with presenting the creation with the call to Allah Almighty, that he takes care of his outward appearance so as not to compel people to avoid him.<\/p>\n<p>Source: Iḥyā’ ‘Ulūm al-Dīn 1\/137<\/p><\/blockquote>\n<p>In addition to gratitude and companionship, having a pleasant appearance is part of our instinct. It is human nature to maintain healthy hygiene habits. By promoting outward cleanliness and bodily wellness, we are fulfilling our purpose.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْفِطْرَةُ خَمْسٌ الْخِتَانُ وَالِاسْتِحْدَادُ وَنَتْفُ الْإِبْطِ وَقَصُّ الشَّارِبِ وَتَقْلِيمُ الْأَظْفَارِ<\/p>\n<p><strong>Five acts are a part of natural instinct: circumcision, shaving pubic hair, removing hair from the armpits, shortening the moustache, and clipping the nails.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5939, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/03\/14\/hadith-on-fitrah-five-acts-are-part-of-pure-and-natural-human-instinct\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَشْرٌ مِنْ الْفِطْرَةِ قَصُّ الشَّارِبِ وَإِعْفَاءُ اللِّحْيَةِ وَالسِّوَاكُ وَاسْتِنْشَاقُ الْمَاءِ وَقَصُّ الْأَظْفَارِ وَغَسْلُ الْبَرَاجِمِ وَنَتْفُ الْإِبِطِ وَحَلْقُ الْعَانَةِ وَانْتِقَاصُ الْمَاءِ<\/p>\n<p><b>Ten acts are part of natural instinct: trimming the mustache, letting the beard grow, using the toothstick, sniffing water into the nose, clipping the nails, washing the knuckles, removing hair from the underarms, shaving pubic hair, and cleaning the private parts with water.<\/b><\/p><\/blockquote>\n<p>Mus’ab said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَنَسِيتُ الْعَاشِرَةَ إِلَّا أَنْ تَكُونَ الْمَضْمَضَةَ<\/p>\n<p>I forgot the tenth, except that it might be rinsing the mouth.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 261, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/19\/hadith-on-instinct-ten-acts-of-cleanliness-are-part-of-natural-instinct\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>For this reason, it is an obligation for Muslims to perform a complete ritual bath, which includes cleaning all parts of the body, <em>at least<\/em> once a week if not daily. This is in addition to the regular cleansing as performed in daily ablutions.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَقٌّ لِلَّهِ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَغْسِلُ رَأْسَهُ وَجَسَدَهُ<\/p>\n<p><strong>It is a duty for Allah upon every Muslim to perform a ritual bath at least once every seven days, washing his head and his body<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 856, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/19\/hadith-on-bathing-muslims-should-take-a-ritual-bath-at-least-once-a-week\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>To complement our cleanliness, we should practice good grooming habits, such as taking care of our hair and beard and washing our clothes regularly. On one occasion, the Prophet (ṣ) gently took note of some men in the mosque who were unable or unwilling to practice good hygiene.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, came to us and he saw an unkempt man with dishevelled hair. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَا كَانَ يَجِدُ هَذَا مَا يُسَكِّنُ بِهِ شَعْرَهُ<\/p>\n<p><strong>Could this man find nothing to groom his hair<\/strong>?<\/p><\/blockquote>\n<p>The Prophet saw another man with a dirty garment and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَا كَانَ هَذَا يَجِدُ مَاءً يَغْسِلُ بِهِ ثَوْبَهُ<\/p>\n<p><strong>Could this man find nothing to wash his garment<\/strong>?<\/p>\n<p>Source: Sunan Abī Dāwūd 4062, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/19\/hadith-on-cleanliness-display-a-dignified-and-pleasant-appearance\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even when we are alone, we are never truly alone. Besides Allah, there are always angels with us too, those who record our deeds as well as others. When we practice good hygiene, the angels are more inclined to be near to us and therefore bless us with their presence.<\/p>\n<p>Ibn Abbas reported: It was said to the Prophet, peace and blessings be upon him, “O Messenger of Allah, the Angel Gabriel has been slow to come to you.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِمَ لَا يُبْطِئُ عَنِّي وَأَنْتُمْ حَوْلِي لَا تَسْتَنُّونَ وَلَا تُقَلِّمُونَ أَظْفَارَكُمْ وَلَا تَقُصُّونَ شَوَارِبَكُمْ وَلَا تُنَقُّونَ رَوَاجِبَكُمْ<\/p>\n<p><strong>And why should he not be slow to come to me while you are around me without brushing your teeth, clipping your nails, shortening your moustaches, or cleaning your knuckles<\/strong>?<\/p>\n<p>Source: Musnad Aḥmad 2182, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/19\/hadith-on-gabriel-why-should-he-not-come-when-you-are-unkempt\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>The same bad hygiene practices that offend people, such as smelly breath and dirty skin, also offend the angels. As such, we should always be careful not to offend people with bad odours or an unpleasant appearance because we are also offending the angels around us, thus depriving ourselves of their presence.<\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَكَلَ الْبَصَلَ وَالثُّومَ وَالْكُرَّاثَ فَلَا يَقْرَبَنَّ مَسْجِدَنَا فَإِنَّ الْمَلَائِكَةَ تَتَأَذَّى مِمَّا يَتَأَذَّى مِنْهُ بَنُو آدَمَ<\/p>\n<p><strong>Whoever eats onions, garlic, or leeks should not approach our mosque, for the angels are offended by whatever offends the children of Adam.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 564, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/02\/02\/hadith-on-mosques-do-not-approach-the-mosque-while-you-carry-an-offensive-odor\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Lastly, one should wear nice perfume or deodorant, so as not to give off a foul odour. It was the custom of the Prophets, among other things, to wear perfume modestly and moderately.<\/p>\n<p>Abu Ayyub reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرْبَعٌ مِنْ سُنَنِ الْمُرْسَلِينَ الْحَيَاءُ وَالتَّعَطُّرُ وَالسِّوَاكُ وَالنِّكَاحُ<\/p>\n<p><strong>There are four traditions of the Messengers: Modesty, wearing perfume, using the toothstick, and marriage<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1080, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/18\/hadith-on-manners-the-prophets-have-four-traditions\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>The rules for perfume are slightly different for men and women, owing to the different nature of each gender. Men are recommended to wear strong, pleasant fragrances, while women are recommended to wear subtle fragrances.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ<\/p>\n<p><strong>The perfume of men is that which scent is apparent and color is hidden. The perfume of women is that which scent is hidden and color is apparent<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2787, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/18\/hadith-on-perfume-the-perfume-of-men-and-women\/\">Sahih <\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The reason for these different rules is because men are obligated to lower their gaze from looking at unrelated women and the strong perfume of a woman is more attracting to men than vice versa. However, women are permitted to wear <a href=\"https:\/\/abuaminaelias.com\/can-muslim-women-wear-perfume\/\">whatever fragrances they desire<\/a> around their husbands and family members.<\/p>\n<p>In sum, Muslims ought to present a pleasant outward appearance by wearing nice, clean clothes and practicing good grooming and hygiene habits. These are commandments from Allah and His Messenger, which are intended to cultivate gratitude, as courtesy towards others, and to fulfill the purpose of our human nature. Our sense of fashion should also be limited and directed by modesty and moderation, so as to avoid extravagance and vanity. Outward beauty, moreover, must be complemented by inward purification from spiritual diseases such as pride, arrogance, and envy.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O children of Adam, take your adornment at every place of prayer,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[160,122,14,61,250,101,314,105,342,123,322,100,60,301,84,45,128],"class_list":["post-18667","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-ablution-wudu","tag-angels-malaikah","tag-arrogance-al-takabbur","tag-call-to-islam-dawah","tag-cleanliness-al-taharah","tag-custom-al-urf","tag-eid","tag-envy-al-hasad","tag-al-fiqh","tag-friday-prayer-salat-jumuah","tag-gratitude-al-shukr","tag-manners-al-adab","tag-prayer-salat","tag-pure-nature-fitrah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-quran-exegesis-tafsir","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4R5","jetpack-related-posts":[{"id":16650,"url":"https:\/\/www.abuaminaelias.com\/the-purpose-of-prayer-in-islam\/","url_meta":{"origin":18667,"position":0},"title":"Purpose of prayer in Islam","author":"Abu Amina Elias","date":"June 25, 2015","format":false,"excerpt":"\"Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13845,"url":"https:\/\/www.abuaminaelias.com\/purification-heart-and-soul\/","url_meta":{"origin":18667,"position":1},"title":"Purification of the heart and soul in Islam","author":"Abu Amina Elias","date":"June 28, 2013","format":false,"excerpt":"\"He has succeeded who purifies himself...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18580,"url":"https:\/\/www.abuaminaelias.com\/excellent-ablution-wudu-with-evidences\/","url_meta":{"origin":18667,"position":2},"title":"An excellent ablution (wudu) with evidences","author":"Abu Amina Elias","date":"December 5, 2017","format":false,"excerpt":"\"O you who believe, when you rise to perform prayer, wash your faces and your forearms to the elbows...\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18845,"url":"https:\/\/www.abuaminaelias.com\/are-arabs-master-race-in-islam\/","url_meta":{"origin":18667,"position":3},"title":"Are Arabs the master race in Islam?","author":"Abu Amina Elias","date":"February 4, 2018","format":false,"excerpt":"\"There is no favor of an Arab over a foreigner,\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":18667,"position":4},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":18667,"position":5},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18667","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18667"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18667\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18667"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18667"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18667"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}