{"id":18845,"date":"2018-02-04T15:34:15","date_gmt":"2018-02-04T11:34:15","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18845"},"modified":"2020-07-17T22:12:13","modified_gmt":"2020-07-17T18:12:13","slug":"are-arabs-master-race-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/are-arabs-master-race-in-islam\/","title":{"rendered":"Are Arabs the master race in Islam?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam is egalitarian in the sense that it oppose all forms of racism, tribalism, doctrines, and pernicious ideologies which incite the pride of one class of people against another. The Quran and Sunnah convey a consistent message on the default equality of all people, with righteousness (<em>al-taqwa<\/em>) being the only distinguishing feature that makes someone better than another.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ<\/p>\n<p><strong>Verily, the most noble of you to Allah is the most righteous of you.<\/strong><\/p>\n<p>Surat al-Hujurat 49:13<\/p><\/blockquote>\n<p>Abu Nadrah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ أَلَا إِنَّ رَبَّكُمْ وَاحِدٌ وَإِنَّ أَبَاكُمْ وَاحِدٌ أَلَا لَا فَضْلَ لِعَرَبِيٍّ عَلَى أَعْجَمِيٍّ وَلَا لِعَجَمِيٍّ عَلَى عَرَبِيٍّ وَلَا لِأَحْمَرَ عَلَى أَسْوَدَ وَلَا أَسْوَدَ عَلَى أَحْمَرَ إِلَّا بِالتَّقْوَى أَبَلَّغْتُ<\/p>\n<p><strong>O people, your Lord is one and your father Adam is one. There is no favor of an Arab over a foreigner, nor a foreigner over an Arab, and neither white skin over black skin, nor black skin over white skin, except by righteousness. Have I not delivered the message?<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22978, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/30\/farewell-sermon-your-lord-is-one-your-father-is-one-your-lives-are-sacred\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>These texts, and many others, are explicitly clear in their rejection of hierarchies based upon race or lineage. It is sufficient for the believers to hold fast to their message, regardless of what others might tell them.<\/p>\n<p>Nevertheless, there was a problematic discourse among classical scholars that claims Arabs have ‘favor’ (<em>fadl<\/em>) and &#8216;more virtue&#8217; (<em>afdal<\/em>) over non-Arabs, in direct contradiction of the plain wording of the Quran and Sunnah.<\/p>\n<p>To make matters worse, this discourse was later co-opted by some modern Arab nationalists in the age of race consciousness. It was misrepresented to claim that Islam justifies the superiority of Arabs over all other people, to the point that it is not uncommon to hear some Arabs today refer to a black person as <em>‘abeed<\/em> (slave) or use other derogatory terms. Such racist acts and ideas have no basis in Islam whatsoever.<\/p>\n<p>The primary text around which the classical discourse of &#8216;Arab virtue&#8217; revolved is the following prophetic tradition:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ اصْطَفَى كِنَانَةَ مِنْ وَلَدِ إِسْمَعِيلَ وَاصْطَفَى قُرَيْشًا مِنْ كِنَانَةَ وَاصْطَفَى مِنْ قُرَيْشٍ بَنِي هَاشِمٍ وَاصْطَفَانِي مِنْ بَنِي هَاشِمٍ<\/p>\n<p><strong>Verily, Allah has chosen Kinanah from the sons of Ishmael, and he has chosen the Quraish from Kinanah, and he has chosen the tribe of Hashim from the Quraish, and he has chosen me from the tribe of Hashim.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2276, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/06\/hadith-on-muhammad-allah-had-chosen-the-prophet-from-the-best-descendants-of-ishmael\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>An unbiased reading of this tradition demonstrates that it is quite far-fetched to infer from it the <em>ontological<\/em> superiority of ethnic Arabs in all times and places. Rather, this tradition is similar to what Allah said about other prophets and nations.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ اصْطَفَىٰ آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ<\/p>\n<p><strong>Verily, Allah chose Adam and Noah and the family of Abraham and the family of &#8216;Imran over the worlds.<\/strong><\/p>\n<p>Surat Ali Imran 3:33<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ<\/p>\n<p><strong>O children of Israel, remember My blessing that I have bestowed upon you and that I favored you over the worlds.<\/strong><\/p>\n<p>Surat al-Baqarah 2:47<\/p><\/blockquote>\n<p>Allah favors some nations over others by bestowing divine revelation upon them, but it has nothing to do with race, tribe, or lineage. Allah only favors some nations over others because of their righteous deeds. That favor is lost with the loss of righteousness, which is why the Israelites eventually fell from grace.<\/p>\n<p>Some narrations were also falsely attributed to the Prophet to support a claim of Arab superiority:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خير الناس العرب وخير العجم فارس<\/p>\n<p>The best of the people are the Arabs, and the best of the non-Arabs are the Persians.<\/p><\/blockquote>\n<p>According to Ash-Shawkani in his book al-Fawā&#8217;id al-Majmū&#8217;ah 1\/414, this tradition is fabricated (<em>mawdu&#8217;<\/em>).<\/p>\n<p>Some classical scholars cited the discourse of &#8216;Arab virtue&#8217; as evidence to support a condition of ‘suitability’ (<em>kafa’ah<\/em>) in marriage, meaning they discouraged Arabs from marrying non-Arabs. Even today, there are Muslim sub-cultures that discourage marriage outside of their tribe or race.<\/p>\n<p>Reasonable concerns of cultural and linguistic compatibility in marriage are valid, because a wife and husband should be able to easily relate to each other. However, the only real basic condition for suitability in marriage is the compatibility of religion, not race or anything else.<\/p>\n<p>Imam Malik, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكَفَاءَةُ فِي الدِّينِ لَا غَيْرُ<\/p>\n<p>Suitability for marriage is in religion and nothing else.<\/p><\/blockquote>\n<p>And Ibn Abdul Barr said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا جُمْلَةُ مَذْهَبِ مَالِكٍ وَأَصْحَابِهِ<\/p>\n<p>This is the entire doctrine of Malik and his companions.<\/p>\n<p>Source: al-Mughnī 7\/35<\/p><\/blockquote>\n<p>The preponderance of evidence exposes the undeniable weakness of the view that Arabs are superior by virtue of their ethnicity, as it stands in blunt opposition to the <a href=\"https:\/\/abuaminaelias.com\/islam-is-against-racism-and-bigotry\/\">categorical texts of the Quran and Sunnah<\/a>. Even so, some scholars still made the virtue of Arabs over others a point of discussion in their books.<\/p>\n<p>Ibn Taymiyyah was one such classical scholar who engaged in the discourse of &#8216;Arab virtue.&#8217; While this discourse is precarious, to say the least, his position was far more nuanced than some have understood. He states that the Arabs were only favored over others because of their praiseworthy actions.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وسبب هذا الفضل والله أعلم ما اختصوا به في عقولهم وألسنتهم وأخلاقهم وأعمالهم وذلك أن الفضل إما بالعلم النافع وإما بالعمل الصالح<\/p>\n<p>This reason for this favor, and Allah knows best, is because of the quality of their minds, their language, their character, and their deeds. That is the favor, whether it is by beneficial knowledge or whether it is by righteous deeds.<\/p>\n<p>Source: Iqtiḍā’ al-Ṣirāṭ al-Mustaqīm 1\/447<\/p><\/blockquote>\n<p>In another place, he explicitly denies that this &#8216;favor&#8217; is related to race or skin color:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والفضل إنما هو بالأسماء المحمودة في الكتاب والسنة مثل الإسلام والإيمان والبر والتقوى والعلم والعمل الصالح والإحسان ونحو ذلك لا بمجرد كون الإنسان عربيا أو عجميا أو أسود أو أبيض ولا بكونه قرويا أو بدويا<\/p>\n<p>&#8216;Favor&#8217; is only in accordance with praiseworthy terms in the Book and the Sunnah, such as Islam, faith, benevolence, righteousness, knowledge, righteous deeds, spiritual excellence, and so on. It is not merely because of a human existing as an Arab or foreigner, or with black skin or white skin, or residing in the city or the countryside.<\/p>\n<p>Source: Iqtiḍā’ al-Ṣirāṭ al-Mustaqīm 1\/415<\/p><\/blockquote>\n<p>Hence, even among the classical scholars who engaged in this discourse, there is nothing superior in the genetic make-up or physical lineage of ethnic Arabs to make them better than others. As was mentioned, the only quality to make someone better is righteousness. The most that can be said is that the Arabs were better than other nations at the time Islam was revealed and insofar as they maintain these righteous qualities.<\/p>\n<p>Like the tribes of Israel, the Arabs can also lose their divine favor by neglecting the virtues by which Allah favored them in the first place.<\/p>\n<p>There is nothing in Islam that privileges ethnic Arabs to the exclusion of other Muslims. Being an Arab itself is not a requirement for leadership in Islam.<\/p>\n<p>Abu Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللَّهِ فَإِنْ كَانُوا فِي الْقِرَاءَةِ سَوَاءً فَأَعْلَمُهُمْ بِالسُّنَّةِ فَإِنْ كَانُوا فِي السُّنَّةِ سَوَاءً فَأَقْدَمُهُمْ هِجْرَةً فَإِنْ كَانُوا فِي الْهِجْرَةِ سَوَاءً فَأَقْدَمُهُمْ سِلْمًا وَلَا يَؤُمَّنَّ الرَّجُلُ الرَّجُلَ فِي سُلْطَانِهِ وَلَا يَقْعُدْ فِي بَيْتِهِ عَلَى تَكْرِمَتِهِ إِلَّا بِإِذْنِهِ<\/p>\n<p><strong>The best versed in the recitation of the Quran should lead the prayer. If they are equal in their recitation, then the one most knowledgeable of them in the Sunnah. If are equal in knowledge of the Sunnah, then the one who first performed emigration. If they emigrated at the same time, then the one who first embraced Islam. No man should lead another man in prayer, nor sit in the honored place in his home, unless he has his permission<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 673, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/04\/hadith-on-leadership-the-most-knowledgeable-should-lead-in-prayer\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The most qualified to lead the prayer are those who can best recite the Quran. This only involves knowledge of the Quranic language and modes of recitation (<em>tajwid<\/em>). Indeed, some non-native Arabic speakers are superior in their knowledge of the Quran than native Arabic speakers who only understand their colloquial dialect (<em>&#8216;ammiyah<\/em>).<\/p>\n<p>Perhaps the best example of transcending racism in Islam comes from the great companion Bilal ibn Rabah, may Allah be pleased with him. Bilal was originally an African slave before Islam, the lowest class in Arab society, but after Islam he rose to become a beloved Muslim leader by virtue of his knowledge, piety, and character.<\/p>\n<p>Umar ibn Al-Khattab, may Allah be pleased with him, used to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبُو بَكْرٍ سَيِّدُنَا وَأَعْتَقَ سَيِّدَنَا يَعْنِي بِلَالًا<\/p>\n<p>Abu Bakr is our master and he emancipated our master Bilal.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3544, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/19\/hadith-on-freedom-abu-bakr-emancipated-bilal-who-then-became-a-leader-among-muslims\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Most the distinguished Muslim jurists in the early generations <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/13\/ibn-abu-layli-on-arabs-most-of-the-jurists-were-non-arabs-to-the-displeasure-of-arab-tribalists\/\">were freed slaves or non-Arabs<\/a>. Famous scholars, such as Muhammad ibn Sireen, Tawus, Al-Bukhari, Al-Ghazali, and many others, were of non-Arab descent, yet their scholarly contribution to Islam was greater than the vast majority of ethnic Arabs.<\/p>\n<p>Some people who harness the classical discourse of ‘Arab virtue’ today have employed it towards evil ends by citing mere snippets from an otherwise nuanced discussion. They have perverted the reason that these scholars even discussed it at all.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنما يتم الكلام بأمرين أحدهما أن الذي يجب على المسلم إذا نظر في الفضائل أو تكلم فيها أن يسلك سبيل العاقل الدين الذي غرضه أن يعرف الخير ويتحراه جهده وليس غرضه الفخر على أحد ولا الغمص من أحد<\/p>\n<p>Indeed, this discourse is completed by two matters, one of which is that it is a duty of the Muslim, when he sees virtues or speaks of them, to follow the path of wise men in religion, the purpose of which is to recognize good, to examine it and endeavor to it. Its purpose is not for anyone to be proud over another, or to look down upon another.<\/p>\n<p>Source: Iqtiḍā’ al-Ṣirāṭ al-Mustaqīm 1\/452<\/p><\/blockquote>\n<p>According to Ibn Taymiyyah, the discussion of ‘Arab virtue’ was meant to encourage Muslims to emulate the good traits by which Arabs and their culture were favored: wisdom, knowledge, good deeds, and so on. It was not meant to demean other cultures, races, tribes, or ethnicities, nor was it intended to lend theological support to modern racism and prejudice.<\/p>\n<p>In sum, Islam upholds the inherent equality of tribes, races, and ethnicities. The only quality that makes one better than another is righteousness. The classical discourse of ‘Arab virtue’ is highly problematic in that it is only very loosely based upon the Quran and Sunnah, and it has been utilized by contemporary groups for manifestly harmful reasons, to promote racism both for and against Islam.<\/p>\n<p>As such, Muslims have no need of this discourse, regardless of the erudition of classical scholars who engaged it in the past. Instead, Muslims should adhere only to the clear, explicit language of the Quran and Sunnah expressing the equality of all people and the virtues by which any human being can become righteous.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is no favor of an Arab over a foreigner,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[300,16,342,34,43,50,91,73,179],"class_list":["post-18845","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adam","tag-character-akhlaq","tag-al-fiqh","tag-humanity-al-insaaniyyah","tag-imam-malik","tag-knowledge","tag-righteous-predecessors-al-salaf-al-salih","tag-umar-ibn-al-khattab","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4TX","jetpack-related-posts":[{"id":13585,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-godfearing-piety-taqwa\/","url_meta":{"origin":18845,"position":0},"title":"Imam al-Nawawi on Godfearing Righteousness, Taqwa","author":"Abu Amina Elias","date":"May 21, 2013","format":false,"excerpt":"\"Fear Allah, as is His right.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14427,"url":"https:\/\/www.abuaminaelias.com\/islam-against-racism-bigotry\/","url_meta":{"origin":18845,"position":1},"title":"Islam is against racism and prejudice","author":"Abu Amina Elias","date":"July 25, 2013","format":false,"excerpt":"\"Verily, the most noble of you to Allah is the most righteous of you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16920,"url":"https:\/\/www.abuaminaelias.com\/the-meaning-of-spiritual-excellence-in-islam\/","url_meta":{"origin":18845,"position":2},"title":"Spiritual excellence in Islam","author":"Abu Amina Elias","date":"August 29, 2015","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him, for although you do not see Him yet He certainly sees you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17719,"url":"https:\/\/www.abuaminaelias.com\/good-character-salvation\/","url_meta":{"origin":18845,"position":3},"title":"Good character, the path to salvation in Islam","author":"Abu Amina Elias","date":"February 13, 2016","format":false,"excerpt":"\"I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16070,"url":"https:\/\/www.abuaminaelias.com\/do-muslim-love-death\/","url_meta":{"origin":18845,"position":4},"title":"Do Muslims love death and desire it?","author":"Abu Amina Elias","date":"November 7, 2014","format":false,"excerpt":"\"The believer hates death and I hate to hurt him.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13579,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-sin-of-enjoining-good-but-practicing-evil\/","url_meta":{"origin":18845,"position":5},"title":"Imam al-Nawawi on Enjoining Good but Practicing Evil","author":"Abu Amina Elias","date":"May 20, 2013","format":false,"excerpt":"\"Do you order righteousness for the people and forget yourselves?\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18845","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18845"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18845\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18845"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18845"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18845"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}