{"id":18902,"date":"2018-02-14T16:26:46","date_gmt":"2018-02-14T12:26:46","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18902"},"modified":"2025-04-21T10:44:47","modified_gmt":"2025-04-21T06:44:47","slug":"should-a-muslim-man-marry-a-second-wife","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/should-a-muslim-man-marry-a-second-wife\/","title":{"rendered":"Should a Muslim man marry a second wife?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Polygamy, or more accurately, polygyny (a man marrying up to four wives), is allowed in Islam because there are some circumstances in human history when it is necessary, so it is permissible with conditions, as Islam is suitable for all times and places. It is not an unearned male privilege as it is often misrepresented. It is not a means for men to gain pleasure at the expense of women. It is a great responsibility for which a man will be strictly held accountable on the Day of Judgment.<\/p>\n<p>The key concern related to polygyny, and marriage in general, is that it must be practiced justly and fairly. It should not harm any of the wives involved, neither physically nor emotionally.<\/p>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَىٰ فَانكِحُوا مَا طَابَ لَكُم مِّنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ۚ ذَٰلِكَ أَدْنَىٰ أَلَّا تَعُولُوا<\/p>\n<p><strong>If you fear you might fail to give orphan women their due rights if you were to marry them, then marry other women of your choice—two, three, or four. But if you are afraid you will fail to maintain justice, then content yourselves with one or those bondwomen in your possession. This way you are less likely to commit injustice.<\/strong><\/p>\n<p>Surat al-Nisa&#8217; 4:3<\/p><\/blockquote>\n<p>The great responsibility and trial of marrying additional wives was emphasized again in the same chapter, stating that it is nearly impossible for a man in his heart to love two or more wives equally.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَن تَسْتَطِيعُوا أَن تَعْدِلُوا بَيْنَ النِّسَاءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوهَا كَالْمُعَلَّقَةِ ۚ وَإِن تُصْلِحُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ غَفُورًا رَّحِيمًا<\/p>\n<p><strong>You will never be able to maintain  justice between your wives—no matter how keen you are. So do not totally incline towards one leaving the other in suspense. And if you do what is right and are mindful of Allah, surely Allah is All-Forgiving, Most Merciful.<\/strong><\/p>\n<p>Surat al-Nisa&#8217; 4:129<\/p><\/blockquote>\n<p>Many scholars derived from these two verses that it is recommended (<em>mustahab<\/em>) for a man to marry only one wife at a time, in order to avoid potentially committing injustice against his additional wives.<\/p>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قيل في التفسير أن لا تجوروا في حقوقهن فحرم الزيادة على الاربع وندب إلى الاقتصار على واحدة خوفا من الجور وترك العدل<\/p>\n<p>It is said in explanation of the verse that you may not wrong them in their rights. It is forbidden to marry more than four wives and it is recommended to be limited to one wife out of fear of wronging them or failing to be just.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 16\/144<\/p><\/blockquote>\n<p>Believing men, who sincerely fear Allah, understand the gravity of the situation and would be hesitant to take another wife without a good reason for doing so. In the Hereafter, a man who was unjust between his co-wives will be resurrected with ugly features reflecting his grave sin.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا كَانَ عِنْدَ الرَّجُلِ امْرَأَتَانِ فَلَمْ يَعْدِلْ بَيْنَهُمَا جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ سَاقِطٌ<\/p>\n<p><strong>If a man has two wives and he is not just between them, he will come on the Day of Resurrection with one of his sides collapsed.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1141, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/13\/mustahabb-one-wife\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَتْ لَهُ امْرَأَتَانِ فَمَالَ مَعَ إِحْدَاهُمَا عَلَى الأُخْرَى جَاءَ يَوْمَ الْقِيَامَةِ وَأَحَدُ شِقَّيْهِ سَاقِطٌ<\/p>\n<p><strong>Whoever has two wives and he inclines to one of them over the other, he will come on the Day of Resurrection with one of his sides collapsed.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 4207, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/04\/21\/polygyny-warning\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>That he comes with one of his sides collapsed is a representation of the unbalanced manner in which he treated his co-wives, and it indicates a type of punishment awaiting the wrongdoers. For this reason, several scholars encourage a Muslim man to marry only one wife at a time, to protect himself from such a trial and potential punishment.<\/p>\n<p>Imam al-Shafi’i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأحب له أن يقتصر على واحدة وإن أبيح له أكثر لِقَوْلِهِ تَعَالَى فَإِنْ خِفْتُمْ أَلا تَعْدِلُوا فَوَاحِدَةً<\/p>\n<p>I prefer for a man to limit himself to one wife, even though it is permissible to have more, due to the saying of the Almighty, &#8216;<strong>But if you are afraid you will fail to maintain justice, then content yourselves with one<\/strong>,&#8217; (4:3).<\/p>\n<p>Source: al-Bayān fi madhhab al-Imām al-Shāfiʻī 11\/189<\/p><\/blockquote>\n<p>Imam al-Mawardi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاسْتَحَبَّ الشَّافِعِيُّ أَنْ يَقْتَصِرَ عَلَى وَاحِدَةٍ وَإِنْ أُبِيحَ لَهُ أَكْثَرُ لِيَأْمَنَ الْجَوْرَ بِالْمَيْلِ إِلَى بَعْضِهِنَّ أَوْ بِالْعَجْزِ عَنْ نَفَقَاتِهِنَّ<\/p>\n<p>Al-Shafi’i recommended that a man limit himself to one wife, even though it is permissible for him to marry more, in order to protect himself from wronging them by inclining more to some of them or being unable to spend equally upon them.<\/p>\n<p>Source: al-Ḥāwī al-Kabīr 11\/417<\/p><\/blockquote>\n<p>Imam Ibn Qudamah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والأوْلَى أن لا يَزِيدَ على امرأةٍ واحِدَةٍ ذَكَرَه في المُجَرَّدِ لقولِ اللهِ تعالى فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَوَاحِدَةً ولِقَولِه سُبحانه وَلَنْ تَسْتَطِيعُوا أَنْ تَعْدِلُوا بَينَ النِّسَاءِ وَلَوْ حَرَصْتُمْ<\/p>\n<p>The preference is to not marry more than one wife, as mentioned in Al-Mujarrad, due to the saying of Allah Almighty, &#8216;<strong>But if you are afraid you will fail to maintain justice, then content yourselves with one.<\/strong>&#8216; (4:3). And due to His saying, &#8216;<strong>You will never be able to maintain  justice between your wives—no matter how keen you are.<\/strong>&#8216; (4:129)<\/p>\n<p>Source: al-Sharḥ al-Kabīr 20\/24<\/p><\/blockquote>\n<p>Imam Ibn Khatib commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جُمْهُورُ الْأَصْحَابِ اسْتَحَبُّوا أَنْ لَا يَزِيدَ عَلَى وَاحِدَةٍ<\/p>\n<p>The majority of our scholars recommend not marrying more than one wife.<\/p>\n<p>Source: al-Inṣāf 8\/16<\/p><\/blockquote>\n<p>Imam al-Buhuti commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَ يُسْتَحَبُّ أَنْ لَا يَزِيدَ عَلَى وَاحِدَةٍ إنْ حَصَلَ بِهَا الْإِعْفَافُ لِمَا فِيهِ مِنْ التَّعَرُّضِ لِلْمُحَرَّمِ<\/p>\n<p>It is recommended not to marry more than one wife if he can maintain chastity with her, as it might expose him to what is forbidden.<\/p>\n<p>Source: Kashshāf al-Qinā’ 5\/9<\/p><\/blockquote>\n<p>Moreover, some scholars stipulated that the Sunnah is for a Muslim man to marry one wife, and to only marry another wife if there is an obvious need. The Prophet ﷺ was only married to Khadijah until she passed away. After her death, he took additional wives to meet various needs, including passing on prophetic teachings through them, solidifying familial relationships, and caring for widows, among others.<\/p>\n<p>Imam al-Shirbini writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُسَنُّ أَنْ لَا يَزِيدَ عَلَى امْرَأَةٍ وَاحِدَةٍ مِنْ غَيْرِ حَاجَةٍ ظَاهِرَةٍ<\/p>\n<p>It is the Sunnah not to marry more than one wife without an obvious need.<\/p>\n<p>Source: Mughnī al-Muḥtāj 4\/207<\/p><\/blockquote>\n<p>In some social and historical contexts, polygyny can be beneficial, which is why it is permissible under certain conditions. Some societies have a need to maintain replacement fertility rates, to care for widows, or to bring family lines together through marriage. In these situations, polygyny may even be necessary if it is performed fairly and for a good purpose.<\/p>\n<p>However, not all social and historical contexts are the same. In many situations, polygyny is not recommended if there is no pressing need for it. Scholars have been making this point for at least the last seven hundred years.<\/p>\n<p>Imam Jamal al-Din al-Raymi wrote nearly seven centuries ago:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عِنْدَ الشَّافِعِيِّ وكافة العلماء يجوز للحرِّ أن يجمع بين أربع زوجات حرائر ولا يجوز أن يجمع بين أكثر من أربع ويستحب أن لا يزيد على واحدة لا سيما في زماننا هذا<\/p>\n<p>According to Al-Shafi’i and the rest of the scholars, it is permissible for a free man to marry up to four free women and it is not permissible to marry more than four. It is recommended not to marry more than one wife, especially in these times of ours.<\/p>\n<p>Source: al-Ma’ānī al-Badīʻah 2\/195<\/p><\/blockquote>\n<p>Furthermore, a man must consider the emotional impact that marrying additional wives would have on his first wife, her family, and her children. In this regard, the Prophet ﷺ prohibited Ali from marrying a second wife while his daughter Fatimah was still alive, because of the emotional harm it might do to her.<\/p>\n<p>Al-Miswar ibn Makhramah reported: I heard the Messenger of Allah, peace and blessings be upon him, say upon the pulpit:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ بَنِي هِشَامِ بْنِ الْمُغِيرَةِ اسْتَأْذَنُوا فِي أَنْ يُنْكِحُوا ابْنَتَهُمْ عَلِيَّ بْنَ أَبِي طَالِبٍ فَلَا آذَنُ ثُمَّ لَا آذَنُ ثُمَّ لَا آذَنُ إِلَّا أَنْ يُرِيدَ ابْنُ أَبِي طَالِبٍ أَنْ يُطَلِّقَ ابْنَتِي وَيَنْكِحَ ابْنَتَهُمْ فَإِنَّمَا هِيَ بَضْعَةٌ مِنِّي يُرِيبُنِي مَا أَرَابَهَا وَيُؤْذِينِي مَا آذَاهَا<\/p>\n<p><strong>Verily, the sons of Hisham ibn al-Mughirah have sought my permission to marry their daughters to Ali ibn Abi Talib. I do not give permission, again I do not give permission, and again I do not give permission, unless Ali ibn Abi Talib intends to divorce my daughter and marry their daughters. Verily, she is only a part of me. I am upset by what upsets her, and I am harmed by what harms her.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5230, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/10\/25\/no-second-wife-if-first-harmed\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَنَهَى عَنْ ذَلِكَ لِكَمَالِ شَفَقَتِهِ عَلَى عَلِيٍّ وَعَلَى فَاطِمَةَ وَالثَّانِيَةُ خَوْفُ الْفِتْنَةِ عَلَيْهَا بِسَبَبِ الْغَيْرَةِ<\/p>\n<p>The Prophet prohibited that because of his perfect compassion for Ali and for Fatimah, and secondly because he feared she would be tested with jealousy.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 16\/3<\/p><\/blockquote>\n<p>It is all the more significant that the Prophet ﷺ said this upon the pulpit and not in private, to make it abundantly clear to men that they may not marry a second wife if it harms their first wife. Hence, Ali did not marry additional wives until after Fatimah passed away.<\/p>\n<p>In our times, some impious Muslim men distort the rules and ethics of polygyny in a way that is callous, insensitive, and abusive towards the physical and emotional needs of their wives, as well as their own children and extended families. A man might get bored with his older wife, so he unilaterally decides to marry a second, younger wife against his first wife’s wishes. A man might also contract a <a href=\"https:\/\/www.abuaminaelias.com\/secret-marriages-are-forbidden-in-islam\/\">secret marriage<\/a> in another country without his first wife and children even knowing about it. These are heinous violations of Islamic teachings.<\/p>\n<p>Thus, the most important character trait in a potential husband is whether or not he fears the punishment of Allah if he is unjust to his wife.<\/p>\n<p>Hasan al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">زَوِّجْهَا مَنْ يَخَافُ اللَّهَ فَإِنْ أَحَبَّهَا أَكْرَمَهَا وَإِنْ أَبْغَضَهَا لَمْ يَظْلِمْهَا<\/p>\n<p>Marry your daughter to one who fears Allah. If he loves her, he will honor her. If he hates her, he will not oppress her.<\/p>\n<p>Source: al-‘Iyāl 122<\/p><\/blockquote>\n<p>The husband’s fear of Allah is the first line of protection against marital abuse and domestic violence. Yet this is a qualitative ethical rule, not a quantitative legal rule. Fear of Allah cannot be accurately tested, measured, or guaranteed; a man who fears Allah today may not fear Him tomorrow. Therefore, admonishing men to fear Allah is not sufficient by itself to protect women.<\/p>\n<p>Fortunately, Islam has a solution to this problem, which provides women with an additional layer of legal protection from abusive husbands who do not fear Allah. A wife has the right to stipulate conditions in the marriage contract that safeguard her from commonly reported abusive practices.<\/p>\n<p>&#8216;Uqbah ibn &#8216;Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَقُّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ<\/p>\n<p><strong>The most worthy of conditions to fulfill in marriage are those that permit intimacy.<\/strong><\/p><\/blockquote>\n<p>And Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مَقَاطِعَ الْحُقُوقِ عِنْدَ الشُّرُوطِ وَلَكَ مَا شَرَطْتَ<\/p>\n<p>Verily, rights are at the intersection of conditions. You will have what you accepted as conditions.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2721, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/28\/rights-duties-huquq-nikah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In other words, men only have rights over their wives insofar as they fulfill the conditions of the marriage contract. Marriage is a reciprocal relationship of love and mercy; it is not based upon men dominating their wives or treating them like disposable commodities. If men violate the prenuptial terms of their marriage contract, the marriage can be annulled or divorced.<\/p>\n<p>Abdur Rahman ibn Ghanm reported: I was sitting closely with Umar ibn al-Khattab, may Allah be pleased with him. A man said, “O commander of the faithful, I married this woman and I accepted her condition that she would keep her house. I have settled my affairs such that I am moving residence to a new land.” Umar said, “She has her condition.” The man said, “She has ruined men! No woman wishes to divorce her husband, but she may do so?” Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمُونَ عَلَى شَرْطِهِمْ عِنْدَ مَقَاطِعِ حُقُوقِهِمْ<\/p>\n<p>The Muslims adhere to their conditions at the intersection of their rights.<\/p>\n<p>Source: Sunan Saʻīd ibn Manṣūr 633, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/28\/shurut-nikah-wajib-umar\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>It is permissible for women and their family guardians to stipulate a condition in the marriage contract that the husband may not marry a second wife against her will. If he does so, either in public or in secret, she has the right to divorce him.<\/p>\n<p>Imam Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا تَزَوَّجَهَا وَشَرَطَ لَهَا أَنْ لَا يُخْرِجَهَا مِنْ دَارِهَا أَوْ بَلَدِهَا فَلَهَا شَرْطُهَا … وَإِنْ تَزَوَّجَهَا وَشَرَطَ لَهَا أَنْ لَا يَتَزَوَّجَ عَلَيْهَا فَلَهَا فِرَاقُهُ إذَا تَزَوَّجَ عَلَيْهَا<\/p>\n<p>When he marries her and accepts her conditions that she would not be taken out of her house or her country, then she is entitled to her condition… If he marries her and accepts her condition that he will not marry another wife against her will, then she is entitled to separate from him if he marries another wife.<\/p>\n<p>Source: al-Mughnī 7\/92<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ يَشْتَرِطَ لَهَا أَنْ لَا يُخْرِجَهَا مِنْ دَارِهَا أَوْ بَلَدِهَا أَوْ لَا يُسَافِرَ بِهَا أَوْ لَا يَتَزَوَّجَ عَلَيْهَا وَلَا يَتَسَرَّى عَلَيْهَا فَهَذَا يَلْزَمُهُ الْوَفَاءُ لَهَا بِهِ فَإِنْ لَمْ يَفْعَلْ فَلَهَا فَسْخُ النِّكَاحِ يُرْوَى هَذَا عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ وَسَعْدِ بْنِ أَبِي وَقَّاصٍ وَمُعَاوِيَةَ وَعَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمْ وَبِهِ قَالَ شُرَيْحٌ وَعُمَرُ بْنُ عَبْدِ الْعَزِيزِ وَجَابِرُ بْنُ زَيْدٍ وَطَاوُسٌ وَالْأَوْزَاعِيُّ وَإِسْحَاقُ<\/p>\n<p>If he accepts her conditions that she will not be taken out of her house or her country, or he will not travel with her, or he will not marry another wife against her will, or he will not take a concubine against her will, these conditions must be fulfilled. If he does not do so, the marriage is annulled. This has been narrated from Umar ibn al-Khattab, Sa’d ibn Abi Waqqas, Mu’awiyah, and Amr ibn al-‘As, may Allah be pleased with them. It was said by Shurayh, &#8216;Umar ibn &#8216;Abdul &#8216;Aziz, Jabir ibn Zayd, Tawus, Al-Awza’i, and Ishaq.<\/p>\n<p>Source: al-Mughnī 7\/93<\/p><\/blockquote>\n<p>And Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا شَرَطَ فِي الْعَقْدِ أَنَّهُ لَا يَتَزَوَّجُ عَلَيْهَا وَإِنْ تَزَوَّجَ عَلَيْهَا كَانَ أَمْرُهَا بِيَدِهَا كَانَ هَذَا الشَّرْطُ صَحِيحًا لَازِمًا فِي مَذْهَبِ مَالِك وَأَحْمَد وَغَيْرِهِمَا وَمَتَى تَزَوَّجَ عَلَيْهَا فَأَمْرُهَا بِيَدِهَا إنْ شَاءَتْ أَقَامَتْ وَإِنْ شَاءَتْ فَارَقَتْ وَاَللَّهُ أَعْلَمُ<\/p>\n<p>When he accepts the condition in the marriage contract that he will not marry another wife against her will, if he marries another wife, the matter is in her hands. This condition is valid and required in the school of Malik, Ahmad, and others. Whenever he marries another wife against her will, the matter is in her hands. If she wishes, she can accept it, or if she wishes, she may separate from him. Allah knows best.<\/p>\n<p>Source: Majmūʻ al-Fatāwà 32\/170<\/p><\/blockquote>\n<p>A woman also has the right to divorce her husband if he is physically or emotionally abusive towards her, whether by beating her, burdening her, or neglecting her.<\/p>\n<p>Yahya ibn Sa’id reported: Habibah bint Sahl was the wife of Thabit ibn Qays and it was mentioned to the Messenger of Allah, peace and blessings be upon him, that they were married and she was his neighbor. Thabit had struck her, so she appeared at the door of the Messenger of Allah and she said, “Thabit and I can no longer be married.” The Prophet said to Thabit:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُذْ مِنْهَا وَخَلِّ سَبِيلَهَا<\/p>\n<p><strong>Take what she owes to you and let her go her way.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 2200, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/17\/talaq-darb-husband\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Lastly, it is not enough for a Muslim man to follow the very minimum legal obligations towards his wives while otherwise committing ethical violations against them. He must adhere to Islamic manners and behave with honorable chivalry towards all of the women in his life.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَخِيَارُكُمْ خِيَارُكُمْ لِنِسَائِهِمْ خُلُقًا<\/p>\n<p><strong>The most complete of believers in faith are those with the best character, and the best of you are the best in behavior to their women.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1162, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/10\/best-good-character-women\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In sum, polygyny is allowed in Islam with strict conditions, but it is recommended for a man to marry only one wife at a time. Polygyny is only permissible if a man is fair to his co-wives and he does not harm any of them physically or emotionally. As legal protection, a wife has the right to stipulate in the marriage contract that her husband may not marry another wife against her wishes. She may also divorce her husband if he abuses her, abandons her, or violates any prenuptial agreements.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;You will never be able to maintain  justice between your wives—no matter how keen you are.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[16,24,342,32,39,41,43,48,100,53,62,73,128],"class_list":["post-18902","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-character-akhlaq","tag-family-ties-sillat-rahim","tag-al-fiqh","tag-hereafter-akhirah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-justice-adl","tag-manners-al-adab","tag-marriage-al-nikah","tag-prophetic-biography-sirah","tag-umar-ibn-al-khattab","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4US","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":18902,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18921,"url":"https:\/\/www.abuaminaelias.com\/secret-marriages-are-forbidden-in-islam\/","url_meta":{"origin":18902,"position":1},"title":"Secret marriages are forbidden in Islam","author":"Abu Amina Elias","date":"February 15, 2018","format":false,"excerpt":"\"This is a secret marriage and I do not permit it.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16852,"url":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","url_meta":{"origin":18902,"position":2},"title":"No theology of rape in Islam","author":"Abu Amina Elias","date":"August 20, 2015","format":false,"excerpt":"\"Scholars agree that the rapist must be given legal punishment,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":18902,"position":3},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14966,"url":"https:\/\/www.abuaminaelias.com\/hijab-niqab-standards\/","url_meta":{"origin":18902,"position":4},"title":"Must a Muslim woman cover her face?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Tell the believing women to lower their gaze...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":18902,"position":5},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18902","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18902"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18902\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18902"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18902"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18902"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}