{"id":18983,"date":"2018-03-05T13:39:16","date_gmt":"2018-03-05T09:39:16","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=18983"},"modified":"2020-07-18T09:09:41","modified_gmt":"2020-07-18T05:09:41","slug":"the-perils-of-overeating-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/the-perils-of-overeating-in-islam\/","title":{"rendered":"Perils of overeating in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It is important for Muslims to maintain a moderate diet consisting of healthy foods, in consultation with reliable nutritional and medical experts. Eating too much food, or eating unhealthy food, can be very dangerous to our spiritual and bodily health. The threat is also subtle because almost all types of food are permissible, but extravagance and excess in permissible eating can become sinful.<\/p>\n<p>It was the practice of the Prophet (ṣ) to eat humbly, in what he ate, how he sat as he ate, and in his general attitude towards eating.<\/p>\n<p>Yahya ibn Katheer reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">آكُلُ كَمَا يَأْكُلُ الْعَبْدُ وَأَجْلِسُ كَمَا يَجْلِسُ الْعَبْدُ فَإِنَّمَا أَنَا عَبْدٌ<\/p>\n<p><strong>I eat as the servant eats, and I sit as the servant sits. Verily, I am only a servant.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 5519, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/05\/03\/hadith-on-humility-the-prophet-is-a-humble-servant\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>As the leader of Medina, the Prophet (ṣ) had all the resources of the Muslim community at his disposable, yet even still he would give away whatever food he had in charity before feeding himself and his family.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ بُرٍّ ثَلاَثَ لَيَالٍ تِبَاعًا حَتَّى قُبِضَ<\/p>\n<p>The family of Muhammad, peace and blessings be upon him, never ate to their fill of wheat bread for three consecutive nights, ever since they had come to Medina, until he passed away.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6089, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/15\/the-prophet%E2%80%99s-family-never-ate-their-fill-for-three-days-in-a-row\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Umar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَظَلُّ الْيَوْمَ يَلْتَوِي مَا يَجِدُ دَقَلًا يَمْلَأُ بِهِ بَطْنَهُ<\/p>\n<p>I saw the Messenger of Allah, peace and blessings be upon him, spend the entire day suffering from hunger. He could not find even the worst dates with which to fill his stomach.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2978, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/05\/hadith-on-hunger-the-prophet-would-suffer-from-hunger-all-day\/\">Sahih <\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبِيتُ اللَّيَالِي الْمُتَتَابِعَةَ طَاوِيًا وَأَهْلُهُ لَا يَجِدُونَ عَشَاءً وَكَانَ أَكْثَرُ خُبْزِهِمْ خُبْزَ الشَّعِيرِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would spend several nights in a row with an empty stomach and his family would not find anything for dinner. Most of their bread was made from barley.<\/p>\n<p>Source: Sunan al-Tirmidhī 2360, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/02\/hadith-on-hunger-the-prophet-spent-many-nights-without-eating\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As such, it was not the habit of the Prophet (ṣ) to completely fill his stomach with food or drink during a meal. Sometimes he would abstain willingly as an act of ritual fasting or intermittent fasting, and at other times he went hungry because he preferred the needs of others to his own. The human stomach simply does not need to be filled and should not be filled during every meal.<\/p>\n<p>In the time of the companions, the first trial they experienced was being tested by prosperity, as an abundance of wealth and quality foods filled the marketplaces. People began to eat to their fill on a regular basis and thus the Sunnah of moderate eating was forgotten by many.<\/p>\n<p>‘Urwah reported: Aisha, may Allah be pleased with her, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَوَّلَ بَلاءٍ حَدَّثَ فِي هَذِهِ الأُمَّةِ بَعْدَ قَضَاءِ نَبِيِّهَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشِّبَعُ فَإِنَّ الْقَوْمَ لَمَّا شَبِعَتْ بُطُونَهُمْ سَمِنَتْ أَبْدَانُهُمْ فَتَصَعَّبَتْ قُلُوبُهُمْ وَجَمَحَتْ شَهَوَاتُهُمْ<\/p>\n<p>Verily, the first trial to occur in this nation after the passing of its Prophet, peace and blessings be upon him, was people eating to their fill. For when people fill their stomachs, their bodies are fattened, their hearts are hardened, and their desires are uncontrollable.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/04\/aisha-on-gluttony-the-first-trial-among-muslims-was-eating-too-much\/\">al-Jū’ li-Ibn Abī Dunyā 22<\/a><\/p><\/blockquote>\n<p>Eating too much food causes weight gain and associated health problems, obviously, but it causes spiritual harm as well. Too much food hardens the heart, dulls the mind, increases drowsiness, and makes it even more difficult to control one’s lusts and desires.<\/p>\n<p>For this reason, the Sunnah regarding day-to-day eating is to only eat what is necessary to maintain optimal health and energy. At most, one should fill their stomach with no more than a third of food and a third of water, and leave the remaining third empty. One should not be in the habit of completely filling his or her stomach every day.<\/p>\n<p>Miqdam ibn Ma’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مَلَأَ آدَمِيٌّ وِعَاءً شَرًّا مِنْ بَطْنٍ بِحَسْبِ ابْنِ آدَمَ أُكُلَاتٌ يُقِمْنَ صُلْبَهُ فَإِنْ كَانَ لَا مَحَالَةَ فَثُلُثٌ لِطَعَامِهِ وَثُلُثٌ لِشَرَابِهِ وَثُلُثٌ لِنَفَسِهِ<\/p>\n<p><strong>The son of Adam cannot fill a vessel worse than his stomach, as it is enough for him to take a few bites to straighten his back. If he cannot do it, then he may fill it with a third of his food, a third of his drink, and a third of his breath.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2380, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/21\/hadith-on-eating-the-worst-vessel-to-fill-is-the-stomach-but-leave-one-third-for-food-water-and-air\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This is the general rule of eating in moderation, but there are exceptions for special occasions. During celebrations such as banquets, family dinners, and so on, there is no harm in filling one’s stomach. This is a concession to promote good relationships between members of the community by eating together and sharing meals.<\/p>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَجْتَمِعْ لَهُ غَدَاءٌ وَلَا عَشَاءٌ مِنْ خُبْزٍ وَلَحْمٍ إِلَّا عَلَى ضَفَفٍ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, never combined a dish of his with meat and bread for lunch, nor for dinner, unless he was eating with people.<\/p>\n<p>Source: Musnad Aḥmad 13447, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/26\/hadith-on-food-the-prophet-only-ate-bread-and-meat-with-guests\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik ibn Dinar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا شَبِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُبْزٍ قَطُّ وَلا لَحْمٍ إِلا عَلَى ضَفَفٍ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, never ate to his fill of bread or meat unless he was eating with people.<\/p>\n<p>Source: al-Shamā’il al-Muḥammadīyah 71, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/26\/hadith-on-satiety-the-prophet-never-ate-to-his-fill-unless-with-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aside from these celebratory exceptions, habitually eating too much food on a day-to-day basis is a manifestation of one’s inability to control their desires and their attachment to worldly pleasures.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ وَالْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ<\/p>\n<p><strong>The unbeliever eats with seven intestines, and the believer eats with one intestine.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5079, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/hadith-on-food-the-believers-are-moderate-in-the-amount-they-eat-and-unbelievers-are-extravagant\/\">Mutaffaqun Alayhi <\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The unbeliever, a person who does not believe in the Hereafter, usually has no compelling philosophical reason to restrict his or her food intake and therefore they tend to eat seven times as much food as their body needs. Even many Muslims overeat in this manner. The way to break such a habit of overeating is by gradually eating less and less until the body becomes accustomed to eating a moderate amount of food.<\/p>\n<p>One must also reflect upon the consequences in the next life. People who regularly and extravagantly overeat will be punished with hunger in the Hereafter, as repeated unnecessary satiation leads to all kinds of sins.<\/p>\n<p>Salman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَكْثَرَ النَّاسِ شِبَعًا فِي الدُّنْيَا أَطْوَلُهُمْ جُوعًا يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Verily, the people who ate to their fill the most in this world will be the hungriest on the Day of Resurrection<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 3351, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/hadith-on-food-those-who-eat-the-most-in-this-life-will-be-the-hungriest-in-the-hereafter\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And Abu Ja’far, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا امْتَلأَ الْبَطْنُ طَغَى الْجَسَدُ<\/p>\n<p>When the belly is full, the body will transgress.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/05\/abu-jafar-on-gluttony-if-the-stomach-is-full-the-body-will-sin\/\">al-Jū’ li-Ibn Abī Dunyā 23<\/a><\/p><\/blockquote>\n<p>On the contrary, the true believer recognizes the health and spiritual benefits of moderate eating, because overeating results in sin, transgression, and a waste of resources.<\/p>\n<p>One of the hallmarks of overeating is the development of a large belly or visceral fat, which can be incredibly dangerous to a person’s health. Even so, Muslims should not indulge in so-called ‘fat-shaming’ of others because they have excessive weight, not least because people gain weight for all kinds of hormonal reasons that are not necessarily their fault. Rather, one should gently and sincerely encourage overweight people to lose weight for their own benefit.<\/p>\n<p>On one occasion, the Prophet (ṣ) gently informed a man with a large belly that it would have been better had he offered the extra food in charity instead.<\/p>\n<p>Ja’dah reported: The Prophet, peace and blessings be upon him, saw a man with a large belly. The Prophet pointed to his belly and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ كَانَ هَذَا فِي غَيْرِ هَذَا لَكَانَ خَيْرًا لَكَ<\/p>\n<p><strong>If this had been placed elsewhere, it would have been better for you<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr 2140, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/04\/hadith-on-gluttony-charity-is-better-for-you-than-eating-too-much\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>People say that “to eat well is to live well,” but this attitude is misleading at best. While we should be grateful to Allah when we have enough good food to eat, the habit of overeating is not a blessing and it is actually a punishment.<\/p>\n<p>Al-Hasan reported: Umar ibn al-Khattab, may Allah be pleased with him, saw a man with a large belly and he said, “What is this?” The man said, “It is a blessing from Allah.” Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلْ عَذَابٌ<\/p>\n<p>No, rather it is a punishment.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/04\/umar-on-gluttony-a-large-belly-is-a-punishment-not-a-blessing\/\">Ḥadīth Muḥammad ibn ‘Abd Allāh al-Anṣārī 42<\/a><\/p><\/blockquote>\n<p>The visceral fat buried deep inside a large belly is severely damaging to a person’s health and it subsequently detracts from their ability to exert themselves in acts of worship like the night prayer or community service. In this sense, it is a punishment for overeating.<\/p>\n<p>The righteous replacements (<em>al-abdal<\/em>), who are the true believers existing in each generation, can be recognized by their healthy physical and spiritual habits. They eat moderately, which results in a lean and healthy appearance, they guard their tongues and commit themselves to silent contemplation, they utilize the nighttime for prayer and study, and they are in the regular habit of secluding themselves for private worship.<\/p>\n<p>Sahl al-Tustari, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اجتمع الخير كله في هذه الأربع خصال وبها صار الإبدال إبدالاً إخماص البطون والصمت والسهر والاعتزال عن الناس<\/p>\n<p>All good is combined in these four traits, and by them the righteous replacements became replacements: having slender bellies, silence, sleeplessness, and withdrawing from people.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/04\/sahl-on-spirituality-four-qualities-which-make-a-saint\/\">Qūt al-Qulūb 1\/170<\/a><\/p><\/blockquote>\n<p>The key to their success is their moderate eating, which optimizes their health, regulates their sleep cycles, sharpens their minds, and maximizes their potential.<\/p>\n<p>However, it is not simply overeating that is problematic. Muslims should also avoid junk food in the form of refined white flour, processed foods, and anything with an excessive amount of sugar, salt, fat, and other unhealthy ingredients.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ<\/p>\n<p><strong>O you who have faith, eat from the good things which We have provided for you and be grateful to Allah, if it is Him that you worship.<\/strong><\/p>\n<p>Surat al-Baqarah 2:172<\/p><\/blockquote>\n<p>Good things (<em>tayyibat<\/em>) are all the natural foods that are healthy for our bodies: fruits, vegetables, lean protein, healthy fats, whole grains, seafood, nuts, legumes, and so on.<\/p>\n<p>Today, many types of industrially processed foods and drinks contain refined ingredients that are stripped of their health benefits, such as common store-bought fruit juices in which sugar is added and fiber is taken out. The refined white bread widely eaten today is not the same as the whole wheat bread that was eaten by the Prophet (ṣ) and his companions.<\/p>\n<p>Abu Hazm reported: He asked Sahl, “Did you see refined white flour (<em>al-naqi<\/em>) in the time of the Prophet, peace and blessings be upon him?” Sahl said no. He said, “Would you sift the barley flour?” Sahl said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا وَلَكِنْ كُنَّا نَنْفُخُهُ<\/p>\n<p>No, but we would blow the husks from it.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5094, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/26\/hadith-on-bread-recommendation-against-refined-processed-white-flour\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The so-called <a href=\"https:\/\/www.webmd.com\/diet\/obesity\/features\/truth-about-white-foods#1\">“white foods” or “bad carbs”<\/a>, the overabundance of which are the direct cause of <a href=\"https:\/\/www.webmd.com\/diet\/obesity\/features\/obesity-epidemic-astronomical#1\">many modern health problems<\/a>, were known in the time of the companions and they would not eat them. Refined white flour in their time was expensive and time-consuming to produce, unlike today when it is easily produced by machines. Muslims should avoid these processed foods and eat natural, healthy alternatives instead.<\/p>\n<p>In sum, Muslims should adopt a habit of eating moderately by filling their stomachs with no more than a third of food at each meal, except on special occasions. The foods that they eat should be nutritious, balanced, and wholesome. These prophetic eating practices will help facilitate both bodily health and spiritual growth.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O you who have faith, eat from the good things which We have provided for you,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[85,49,32,34,104,100,60,62,73],"class_list":["post-18983","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-fasting-al-siyam","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-humility-al-tawaduh","tag-manners-al-adab","tag-prayer-salat","tag-prophetic-biography-sirah","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-4Wb","jetpack-related-posts":[{"id":14354,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-good-manners-of-eating-and-drinking\/","url_meta":{"origin":18983,"position":0},"title":"Imam al-Nawawi on Manners of Eating and Drinking","author":"Abu Amina Elias","date":"July 22, 2013","format":false,"excerpt":"\"Let him begin in the name of Allah.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13965,"url":"https:\/\/www.abuaminaelias.com\/morning-meal-as-suhoor\/","url_meta":{"origin":18983,"position":1},"title":"The morning meal before fasting, al-Suhur","author":"Abu Amina Elias","date":"July 10, 2013","format":false,"excerpt":"\"Verily, there is blessing in the morning meal.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14319,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-giving-food-break-fasting\/","url_meta":{"origin":18983,"position":2},"title":"Imam al-Nawawi on Feeding the Breaking Fast","author":"Abu Amina Elias","date":"July 20, 2013","format":false,"excerpt":"\"Verily, the angels send blessings upon the fasting person...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21613,"url":"https:\/\/www.abuaminaelias.com\/new-muslim-woman-married-to-non-muslim-man\/","url_meta":{"origin":18983,"position":3},"title":"New Muslim woman married to non-Muslim man?","author":"Abu Amina Elias","date":"January 19, 2020","format":false,"excerpt":"\"He deserves her as long as he does not take her away from her land.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14837,"url":"https:\/\/www.abuaminaelias.com\/permissible-to-curse-people\/","url_meta":{"origin":18983,"position":4},"title":"Is it permissible to curse people in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not invoke the curse of Allah...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20099,"url":"https:\/\/www.abuaminaelias.com\/visiting-funerals-of-non-muslims\/","url_meta":{"origin":18983,"position":5},"title":"Visiting funerals of non-Muslims","author":"Abu Amina Elias","date":"January 21, 2019","format":false,"excerpt":"\"When you see a funeral procession, then stand up for it,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18983","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=18983"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/18983\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=18983"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=18983"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=18983"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}