{"id":19409,"date":"2016-07-04T10:48:36","date_gmt":"2016-07-04T06:48:36","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19409"},"modified":"2025-07-04T11:02:49","modified_gmt":"2025-07-04T07:02:49","slug":"should-women-pray-in-the-mosque","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/should-women-pray-in-the-mosque\/","title":{"rendered":"Should women pray in the mosque?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It is a virtue for women to pray in congregation with other Muslims, whether another group of women or an entire congregation in the mosque. There is no justification in Islam to prevent women in ordinary circumstances from praying in the mosque and benefiting from lessons taught therein.<\/p>\n<p>However, there is a disagreement among scholars over whether it is better in general for women to pray at home or in the mosque, although the sum of the evidence indicates that the benefit of praying in either place depends upon the circumstances.<\/p>\n<p>Those who hold the opinion that it is better for women to pray at home cite a number of traditions in which the Prophet (ṣ) encouraged women to do so.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَلَاةُ الْمَرْأَةِ فِي بَيْتِهَا أَفْضَلُ مِنْ صَلَاتِهَا فِي حُجْرَتِهَا وَصَلَاتُهَا فِي مَخْدَعِهَا أَفْضَلُ مِنْ صَلَاتِهَا فِي بَيْتِهَا<\/p>\n<p><strong>The prayer of a woman in her house is better than her prayer in her courtyard, and her prayer in her chamber is better than her prayer in her house.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 570, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Scholars agree that it is not required for women to attend the mosque for prayer, which is intended to make it easier for them to fulfill their religious and familial obligations. There are also several circumstances in which it is clearly better for women to pray at home.<\/p>\n<p>For example, a wife who cares for multiple children would find it difficult to attend the mosque for daily prayers. She might have trouble preventing her children from disrupting other worshipers, or she might have other obligations at home that make it better for her to pray in her house, or it might be dangerous for her to travel to the mosque alone.<\/p>\n<p>If there are no problematic factors such as these, women may benefit from praying in the mosque and, to be sure, they should never abandon the mosque entirely in any case. Some scholars are of the opinion that it is better for women to pray in the mosque under normal circumstances, due to the generality of evidence that encourages congregational prayer.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَلَاةُ الْجَمَاعَةِ تَفْضُلُ صَلَاةَ الْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً<\/p>\n<p><strong>Prayer in congregation is better than prayer alone by twenty seven degrees<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 619, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/09\/05\/hadith-on-prayer-congregational-prayer-in-the-mosque-is-twenty-seven-times-greater\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Hazm writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا عُمُومٌ لَا يَجُوزُ أَنْ يُخَصَّ مِنْهُ النِّسَاءُ مِنْ غَيْرِهِنَّ<\/p>\n<p>This tradition is general in meaning. It is not permissible to exclude women from it.<\/p>\n<p>Source: al-Muḥallá 3\/112<\/p><\/blockquote>\n<p>Regardless of either opinion, all scholars agree that women are permitted to attend congregational prayer in the mosque. The fact that the Prophet (ṣ) prohibited men from stopping women from doing so is proof that there is benefit to be earned by their attendance.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَمْنَعُوا النِّسَاءَ حُظُوظَهُنَّ مِنْ الْمَسَاجِدِ إِذَا اسْتَأْذَنُوكُمْ<\/p>\n<p><strong>Do not prevent women from their share of the mosques if they seek your permission.<\/strong><\/p><\/blockquote>\n<p>Bilal ibn Abdullah said, “By Allah, we will prevent them from going!” Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقُولُ أَنْتَ لَنَمْنَعُهُنَّ<\/p>\n<p>I say what was said by the Messenger of Allah, peace and blessings be upon him, and still you say you will prevent them?<\/p>\n<p>Source: Ṣaḥīḥ Muslim 442, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/07\/15\/do-not-prevent-women-from-attending-the-mosque\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this narration, the Prophet (ṣ) tells men not to prevent women from “their share” of the mosque, which implies spiritual benefit from their attendance. The benefit of the mosque is not simply from prayer, but also from women’s fellowship with other sisters in Islam, attending Quran classes, listening to religious lectures, teaching children etiquette in the mosque and cultivating their love for it, and so on. All of these are good reasons for women to attend the mosque.<\/p>\n<p>Moreover, Ibn Umar became angry with his son who stubbornly insisted on preventing women from attending despite the clear directive of the Prophet (ṣ), demonstrating that there is no justification in Islam to keep women away from the mosque for no good reason.<\/p>\n<p>Some scholars hold the opinion that it is only recommended for men to allow women to attend, while others consider the Prophet’s (ṣ) command to be absolute without restriction.<\/p>\n<p>Ibn Hazm writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ اسْتَأْذَنَ الْحَرَائِرُ أَوْ الْإِمَاءُ بُعُولَتَهُنَّ أَوْ سَادَاتِهِنَّ فِي حُضُورِ الصَّلَاةِ فِي الْمَسْجِدِ فَفَرْضٌ عَلَيْهِمْ الْإِذْنُ لَهُنَّ<\/p>\n<p>If a free woman or maid servant asks permission from her husband or her master to attend prayer in the mosque, then it is an obligation upon him to permit her.<\/p>\n<p>Source: al-Muḥallá 3\/104<\/p><\/blockquote>\n<p>We learn from several traditions that women regularly attended the congregational prayer in the time of the Prophet (ṣ). If there was no benefit in it or there was greater benefit in praying at home, we would assume that he would not have allowed it so frequently.<\/p>\n<p>In fact, the Prophet (ṣ) assigned a special door for women to enter the mosque, which shows that in some cases it is expected for women to pray therein.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ تَرَكْنَا هَذَا الْبَابَ لِلنِّسَاءِ<\/p>\n<p><strong>It would be better if you had left this door to the mosque for women.<\/strong><\/p><\/blockquote>\n<p>Nafi’ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَمْ يَدْخُلْ مِنْهُ ابْنُ عُمَرَ حَتَّى مَاتَ<\/p>\n<p>Ibn Umar never again entered through it until the day he died.<\/p>\n<p>Source: Sunan Abī Dāwūd 462, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/26\/hadith-on-mosques-using-a-separate-entrance-to-the-mosque-for-women\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) made sure that women had enough space to pray in the mosque, with a healthy distance between the two genders.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا<\/p>\n<p><strong>The best rows for men are the front rows and the worst are the back rows. The best rows for women are the back rows and the worst are the front rows.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 440, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/21\/hadith-on-prayer-men-should-pray-in-the-front-and-women-pray-in-the-back\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, those who maintain the mosque must provide appropriate space from women to attend and benefit from the mosque. Women deserve to have a rightful place in the houses of Allah just as men do.<\/p>\n<p>That women pray in the back is not a value judgement against them, as some mistakenly understand. The separation of men and women in the mosque is a means of maintaining modesty between the two genders, and the presence of women in the back row is the best place to avoid unwarranted mixing between unrelated men and women.<\/p>\n<p>When women attended prayer with the the Prophet (ṣ), they would be sure to dress appropriately and not to disrupt others by drawing undue attention to themselves.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ نِسَاءَ الْمُؤْمِنَاتِ كُنَّ يُصَلِّينَ الصُّبْحَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَرْجِعْنَ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ لَا يَعْرِفُهُنَّ أَحَدٌ<\/p>\n<p>The believing women would pray the dawn prayer with the Prophet, peace and blessings be upon him. Then, they would return home wrapped in their mantles; they would not be recognized by anyone.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 365, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/26\/hadith-on-fajr-women-would-attend-dawn-prayer-with-the-prophet\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When finishing the prayer, the Prophet (ṣ) would also be sure to wait in his place at the front for some time until the women had the left the mosque.<\/p>\n<p>Umm Salamah reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ إِذَا سَلَّمَ يَمْكُثُ فِي مَكَانِهِ يَسِيرًا كَانَ يُسَلِّمُ فَيَنْصَرِفُ النِّسَاءُ فَيَدْخُلْنَ بُيُوتَهُنَّ مِنْ قَبْلِ أَنْ يَنْصَرِفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>The Prophet, peace and blessings be upon him, would end prayer with salutations of peace and remain in his place for a while. The Prophet would end prayer and the women would depart to enter their homes before he would depart.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 812, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/26\/hadith-on-mosques-the-prophet-lets-women-leave-before-himself\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>All of this evidence and more demonstrates that Muslim women regularly prayed in congregation with the Prophet (ṣ). He would not have allowed it if there was no benefit in it.<\/p>\n<p>Nevertheless, women who attend the mosque should not wear strong perfume that might attract the attention of unrelated men or distract other worshipers.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلَا تَشْهَدْ مَعَنَا الْعِشَاءَ الْآخِرَةَ<\/p>\n<p><strong>Any woman who adorns herself with<\/strong> (strong) <strong>fragrances should not attend the evening prayer with us<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 444, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/24\/hadith-on-perfume-a-woman-should-not-wear-strong-perfumes-in-the-presence-of-strange-men\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thus, if women have the proper intention and they adhere to Islamic etiquette, they may benefit from praying in the mosque, listening to lessons therein, and so on. There is no good reason, in regular circumstances, to deny them their right to worship Allah in the mosque.<\/p>\n<p>Yet women must not abuse their right to attend the mosque, either by neglecting other duties in their home or causing disruption among worshipers. After the passing of the the Prophet (ṣ), Aisha criticized the women of her time who violated the sanctity and solemnity of worship in the mosque.<\/p>\n<p>Aisha, may Allah be pleased with her, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسْجِدَ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ<\/p>\n<p>Were the Messenger of Allah, peace and blessings be upon him, to see what women are doing now, he would have prevented them from attending the mosque, just as the women of the children of Israel were prevented from attending.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 445, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/26\/hadith-on-mosques-women-maintaining-proper-etiquette-in-the-mosque\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Women should keep this important advice in mind as they attend the mosque, lest their neglect of the rules of congregational prayer is counted against them.<\/p>\n<p>Even if it is better for women to pray at home, it is still recommended for them to pray together in a congregation, either as a group of other women or with their family members.<\/p>\n<p>Umm Waraqah, may Allah be pleased with her, had memorized parts of the Quran and would lead her children and female family members in prayer at home. Muslim women who are neighbors can organize mini-congregations among themselves so that they can earn the reward of congregational prayer, even if they do not attend the mosque.<\/p>\n<p>Umm Waraqah reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزُورُهَا فِي بَيْتِهَا وَجَعَلَ لَهَا مُؤَذِّنًا يُؤَذِّنُ لَهَا وَأَمَرَهَا أَنْ تَؤُمَّ أَهْلَ دَارِهَا<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would visit her in her house, he appointed a caller to prayer for her, and he ordered her to lead the people of her household in prayer.<\/p>\n<p>Source: Sunan Abī Dāwūd 591, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/03\/26\/hadith-on-prayer-women-leading-their-household-in-prayer\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Hamid said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ صَلَاةٍ اُسْتُحِبَّ لِلرِّجَالِ الْجَمَاعَةُ فِيهَا اُسْتُحِبَّ الْجَمَاعَةُ فِيهَا لِلنِّسَاءِ فَرِيضَةً كَانَتْ أَوْ نَافِلَةً<\/p>\n<p>It is recommended for men to pray in congregation and it is recommended for women to pray in congregation, whether it is an obligatory or voluntary prayer.<\/p>\n<p>Source: al-Majmūʻ Sharḥ al-Muhadhab 4\/199<\/p><\/blockquote>\n<p>In sum, there are circumstances in which it is better for women to pray at home or in the mosque. Each woman should take note of her own circumstances and do what is in the best interests of herself and her family. The mosque should provide an area for women that meets their needs and their right to attend. Men should also not prevent women from attending congregational prayer without a good reason.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not prevent the maidens of Allah from the mosques of Allah.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[18,24,342,48,51,100,59,60,103,220,128],"class_list":["post-19409","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-community-jamaah","tag-family-ties-sillat-rahim","tag-al-fiqh","tag-justice-adl","tag-leadership-imamate","tag-manners-al-adab","tag-peace","tag-prayer-salat","tag-public-welfare-al-maslaha","tag-supplication-al-dua","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-533","jetpack-related-posts":[{"id":14845,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-walking-to-the-mosque\/","url_meta":{"origin":19409,"position":0},"title":"Imam al-Nawawi on Walking to the Mosque","author":"Abu Amina Elias","date":"August 29, 2013","format":false,"excerpt":"\"Give glad tidings to those who walk to the mosque in darkness,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23619,"url":"https:\/\/www.abuaminaelias.com\/grave-worship-in-islam\/","url_meta":{"origin":19409,"position":1},"title":"Prohibition of grave worship in Islam","author":"Abu Amina Elias","date":"October 19, 2021","format":false,"excerpt":"\"Do not take graves as places of prayer. I forbid you from doing so.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":19409,"position":2},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14049,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-seculsion-in-the-mosque-during-ramadan-itikaf\/","url_meta":{"origin":19409,"position":3},"title":"Imam al-Nawawi on Spiritual Retreat in Ramadan, al-I’tikaf","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Prophet seeks seclusion in the last ten nights.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":10620,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-religion-is-ease-and-moderation-in-performing-acts-of-worship\/","url_meta":{"origin":19409,"position":4},"title":"Imam al-Nawawi on Moderation in Worship","author":"Abu Amina Elias","date":"August 5, 2012","format":false,"excerpt":"\"Your duty is only to perform deeds which are carried out easily.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16602,"url":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","url_meta":{"origin":19409,"position":5},"title":"Worship in the middle night of Sha’ban","author":"Abu Amina Elias","date":"April 23, 2015","format":false,"excerpt":"\"There is a proof for it, so it cannot be rejected.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19409","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19409"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19409\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19409"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19409"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19409"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}