{"id":19412,"date":"2018-03-26T14:39:51","date_gmt":"2018-03-26T10:39:51","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19412"},"modified":"2020-07-17T22:28:21","modified_gmt":"2020-07-17T18:28:21","slug":"few-women-ever-achieved-perfection","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/few-women-ever-achieved-perfection\/","title":{"rendered":"Few women ever achieved perfection?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>There is a prophetic tradition that is cited by opponents of Islam, and some misguided Muslim men, to claim Islam teaches that women are morally inferior to men. Not only is this a tragic misunderstanding and an abuse of the Prophet’s (ṣ) words, it contradicts the reality that many women surpass men in religious virtue.<\/p>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَمَلَ مِنْ الرِّجَالِ كَثِيرٌ وَلَمْ يَكْمُلْ مِنْ النِّسَاءِ إِلَّا آسِيَةُ امْرَأَةُ فِرْعَوْنَ وَمَرْيَمُ بِنْتُ عِمْرَانَ<\/p>\n<p><strong>There were many men who achieved perfection and none were perfect among women except Asiyah, the wife of Pharaoh, and Mary, the daughter of ‘Imran. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3230, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/03\/hadith-on-women-the-virtue-of-great-women-like-maryam-asiya-and-aisha\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The keyword to define and understand in this tradition is the word ‘perfection’ (<em>kamal<\/em>). Does it mean only moral virtues or something else? And does it refer only their time period or to women overall?<\/p>\n<p>According to some scholars, the word ‘perfection’ in this tradition means prophethood. While most prophets were men because the office of prophethood often involves male-appropriate duties, such as preparing a military defense, there were nevertheless some women prophets as well. Therefore, the tradition does not mean that women are morally inferior to men on the whole, but rather only that fewer women received direct divine revelation.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَدَلَّ بِهَذَا الْحَصْرِ عَلَى أَنَّهُمَا نَبِيَّتَانِ لِأَنَّ أَكْمَلَ النَّوْعِ الْإِنْسَانِيِّ الْأَنْبِيَاءُ ثُمَّ الْأَوْلِيَاءُ وَالصِّدِّيقُونَ وَالشُّهَدَاءُ فَلَوْ كَانَتَا غَيْرَ نَبِيَّتَيْنِ لَلَزِمَ أَلَّا يَكُونَ فِي النِّسَاءِ وَلِيَّةٌ وَلَا صِدِّيقَةٌ وَلَا شَهِيدَةٌ وَالْوَاقِعُ أَنَّ هَذِهِ الصِّفَاتِ فِي كَثِيرٍ مِنْهُنَّ مَوْجُودَةٌ فَكَأَنَّهُ قَالَ وَلَمْ يُنَبَّأْ مِنَ النِّسَاءِ إِلَّا فُلَانَةٌ وَفُلَانَةٌ وَلَوْ قَالَ لَمْ تَثْبُتْ صِفَةُ الصِّدِّيقِيَّةِ أَوِ الْوِلَايَةِ أَوِ الشَّهَادَةِ إِلَّا لِفُلَانَةٍ وَفُلَانَةٍ لَمْ يَصِحَّ لِوُجُودِ ذَلِكَ فِي غَيْرِهِنَّ<\/p>\n<p>It is inferred by this limitation (to Asiyah and Mary) that they were both prophets, as the most perfect of human beings are the prophets, then the saints, the truthful, and the martyrs. If they were not both prophets, it must be that there is neither sainthood, nor truthfulness, nor martyrdom among women. The reality is that these characteristics are found in many of them, so it is as if the Prophet said that none among women achieved prophethood except these two. If he had meant that the characteristics of truthfulness, or sainthood, or martyrdom are not found except in these two, that would not be correct as those are found in others besides them.<\/p>\n<p>Source: Fatḥ al-Bārī 5102<\/p><\/blockquote>\n<p>It can also be inferred that Al-Bukhari held this opinion, since he narrated the tradition in his &#8216;book of traditions of the prophets.&#8217;<\/p>\n<p>Some scholars hold the opinion that these two women and others were prophets, since Allah delivered revelation to them or spoke to them through angels.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ نُقِلَ عَنِ الْأَشْعَرِيِّ أَنَّ مِنَ النِّسَاءِ مِنْ نُبِّئَ وَهُنَّ سِتٌّ حَوَّاءُ وَسَارَةُ وَأُمُّ مُوسَى وَهَاجَرُ وَآسِيَةُ وَمَرْيَمُ وَالضَّابِطُ عِنْدَهُ أَنَّ مَنْ جَاءَهُ الْمَلَكُ عَنِ اللَّهِ بِحُكْمٍ مِنْ أَمْرٍ أَوْ نَهْيٍ أَوْ بِإِعْلَامٍ مِمَّا سَيَأْتِي فَهُوَ نَبِيٌّ<\/p>\n<p>It has been related from Al-Ash’ari that those among women who achieved prophethood are six: Hawa’, Sarah, the mother of Moses, Hajar, Asiyah, and Mary. The criterion of prophethood for him is that to whomever an angel came from Allah with a judgment related to a command, a prohibition, or a sign of what is to come, then they are considered to be a prophet.<\/p>\n<p>Source: Fatḥ al-Bārī 5102<\/p><\/blockquote>\n<p>We read instances in the Quran in which Allah revealed something to women and, in this sense, they are prophets. For example, Allah directed the mother of Moses, upon them be peace, to throw her baby into the water to save him from his persecutors, promising to miraculously keep the baby safe from harm.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ<\/p>\n<p><strong>We inspired to the mother of Moses, ‘Nurse him, but when you fear for him, cast him into the river and do not fear and do not grieve. Verily, We will return him to you and will make him one of the messengers.<\/strong><\/p>\n<p>Source: Surat al-Qasas 28:7<\/p><\/blockquote>\n<p>Likewise, Allah sent an angel to Mary, the mother of Jesus, upon them be peace, to deliver her the good news of her miraculous virgin birth.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاتَّخَذَتْ مِن دُونِهِمْ حِجَابًا فَأَرْسَلْنَا إِلَيْهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا<\/p>\n<p><strong>She secluded herself from them behind a veil. Then, We sent to her Our angel in the form of a well-proportioned man.<\/strong><\/p>\n<p>Source: Surat Maryam 19:17<\/p><\/blockquote>\n<p>Scholars consider the fact that an angel spoke to her to be a sign of her prophethood.<\/p>\n<p>Al-Qurtubi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّحِيحُ أَنَّ مَرْيَمَ نَبِيَّةٌ لِأَنَّ اللَّهَ تَعَالَى أَوْحَى إِلَيْهَا بِوَاسِطَةِ الْمَلَكِ<\/p>\n<p>The correct opinion is that Mary is a prophet, as Allah Almighty delivered revelation to her through the medium of an angel.<\/p>\n<p>Source: Fatḥ al-Bārī 5102<\/p><\/blockquote>\n<p>In following verses of the same chapter, which is named after Mary and mentions the stories of other prophets, Allah declares all of them to be those “bestowed favor among the prophets.”<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُولَٰئِكَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِم مِّنَ النَّبِيِّينَ مِن ذُرِّيَّةِ آدَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوحٍ وَمِن ذُرِّيَّةِ إِبْرَاهِيمَ وَإِسْرَائِيلَ وَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَا ۚ إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُ الرَّحْمَٰنِ خَرُّوا سُجَّدًا وَبُكِيًّا<\/p>\n<p><strong>Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam, of those We carried with Noah, of the descendants of Abraham and Israel, and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell down in prostration, weeping.<\/strong><\/p>\n<p>Source: Surat Maryam 19:58<\/p><\/blockquote>\n<p>The implication of this verse, and her name at the top of the chapter, is that Mary was herself among those prophets who were favored with revelation.<\/p>\n<p>Although some scholars disagree whether Asiyah, the wife of Pharaoh, was truly a prophet, she was still a martyr of very high moral status.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ<\/p>\n<p><strong>Allah presents an example of those who had faith, the wife of Pharaoh, when she said, ‘My Lord, build for me a house in Paradise near You and save me from Pharaoh and his deeds, and save me from the oppressors.’<\/strong><\/p>\n<p>Source: Surat al-Tahrim 66:11<\/p><\/blockquote>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ فَضَائِلِ آسِيَةَ امْرَأَةِ فِرْعَوْنَ أَنَّهَا اخْتَارَتِ الْقَتْلَ عَلَى الْمُلْكِ وَالْعَذَابَ فِي الدُّنْيَا عَلَى النَّعِيمِ الَّذِي كَانَتْ فِيهِ<\/p>\n<p>Among the virtues of Asiyah, the wife of Pharaoh, is that she preferred to be killed over having worldly dominion and preferred torment in the world over pleasure in it.<\/p>\n<p>Source: Fatḥ al-Bārī 5102<\/p><\/blockquote>\n<p>One of the main evidences of those who claim no women were ever prophets is the verse in which Allah says that He sent &#8216;men&#8217; as messengers.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا أَرْسَلْنَا مِن قَبْلِكَ إِلَّا رِجَالًا نُّوحِي إِلَيْهِمْ<\/p>\n<p><strong>We did not send anyone as messengers before you except men whom We inspired.<\/strong><\/p>\n<p>Source: Surat al-Nahl 16:43<\/p><\/blockquote>\n<p>However, this verse is referring to ‘messengers,’ which is a category distinct from ‘prophets,’ and so the verse does not adequately support their opinion.<\/p>\n<p>Ibn Hazm said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا لَا حُجَّةَ فِيهِ فَإِنَّ أَحَدًا لَمْ يَدَّعِ فِيهِنَّ الرِّسَالَةَ وَإِنَّمَا الْكَلَامُ فِي النُّبُوَّةِ فَقَطْ<\/p>\n<p>This verse is not an evidence for them, for they were not referred to as being given a message. Rather, the discussion is regarding prophethood only.<\/p>\n<p>Source: Fatḥ al-Bārī 5102<\/p><\/blockquote>\n<p>Unlike prophets, messengers are given revealed scriptures and the authority to abrogate or modify the laws of messengers who came before them. Thus, while all messengers were men, this does not exclude women from being prophets.<\/p>\n<p>Regardless of one’s opinion on the matter, the tradition which states that few women achieved ‘perfection’ should not be understood as indicating the moral inferiority of women. We know from other authentic texts and from lived experience that many women surpass men in religious virtue, and we have many great examples of righteous women in the Quran, Sunnah, and our history. It has also been interpreted that the &#8216;perfection&#8217; of Asiyah and Mary only referred to their time period.<\/p>\n<p>Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَعَلَّ الْمُرَادَ بِذَلِكَ فِي زَمَانِهِمَا فَإِنَّ كُلًّا مِنْهُمَا كَفَلَتْ نَبِيًّا فِي حَالِ صِغَرِهِ فَآسِيَةُ كَفَلَتْ مُوسَى الْكَلِيمَ وَمَرْيَمُ كَفَلَتْ وَلَدَهَا عَبْدَ اللَّهِ وَرَسُولِهِ فَلَا يَنْفِي كَمَالَ غَيْرِهِمَا فِي هَذِهِ الْأُمَّةِ كَخَدِيجَةَ وَفَاطِمَةَ<\/p>\n<p>Perhaps the meaning of that (limitation to Asiyah and Mary) is in their time period. Indeed, both of them were responsible for a prophet in his childhood. Asiyah was responsible for Moses, to whom Allah spoke. Mary was responsible for her boy, the servant of Allah and His messenger. Thus, it does not exclude the perfection of others besides them in this nation, such as Khadijah and Fatimah.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 2\/431<\/p><\/blockquote>\n<p>That only Asiyah and Mary, upon them be peace, achieved perfection means in their specific era, not among women as a whole. Hence, the tradition does not imply the moral inferiority of women at all. For men to think of themselves as morally superior because of their gender is merely repugnant arrogance masquerading as theology.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;We sent to her Our angel in the form of a well-proportioned man.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[16,138,51,100,57,291,196,72,307,179,128],"class_list":["post-19412","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-character-akhlaq","tag-jesus-isa","tag-leadership-imamate","tag-manners-al-adab","tag-moses-musa","tag-pharaoh-firawn","tag-prophetic-virtues","tag-truthfulness-al-sidq","tag-virgin-mary-maryam","tag-virtue-al-fadilah","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-536","jetpack-related-posts":[{"id":11513,"url":"https:\/\/www.abuaminaelias.com\/women-majority-hellfire-explanation\/","url_meta":{"origin":19412,"position":0},"title":"Are women the majority in Hellfire?","author":"Abu Amina Elias","date":"November 10, 2012","format":false,"excerpt":"\"Women are the majority of the children of Adam,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":19412,"position":1},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18928,"url":"https:\/\/www.abuaminaelias.com\/are-men-better-than-women-in-islam\/","url_meta":{"origin":19412,"position":2},"title":"Are men better than women in Islam?","author":"Abu Amina Elias","date":"February 19, 2018","format":false,"excerpt":"\"Verily, women are the counterparts of men.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20053,"url":"https:\/\/www.abuaminaelias.com\/equality-and-equity-in-islam\/","url_meta":{"origin":19412,"position":3},"title":"Equality and equity in Islam","author":"Abu Amina Elias","date":"December 11, 2018","format":false,"excerpt":"\"There are two words for justice in Islam...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14778,"url":"https:\/\/www.abuaminaelias.com\/can-women-take-positions-of-leadership-and-authority-in-islam\/","url_meta":{"origin":19412,"position":4},"title":"Can women be leaders in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"It is permissible to appoint a woman as a judge, which is the opinion of Abu Hanifa.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19409,"url":"https:\/\/www.abuaminaelias.com\/should-women-pray-in-the-mosque\/","url_meta":{"origin":19412,"position":5},"title":"Should women pray in the mosque?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not prevent the maidens of Allah from the mosques of Allah.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19412","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19412"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19412\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19412"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19412"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19412"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}