{"id":19458,"date":"2018-04-04T13:43:50","date_gmt":"2018-04-04T09:43:50","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19458"},"modified":"2020-07-18T09:11:15","modified_gmt":"2020-07-18T05:11:15","slug":"meat-would-not-decay-eve-betrayed-her-husband","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/meat-would-not-decay-eve-betrayed-her-husband\/","title":{"rendered":"Meat would not decay? Eve betrayed her husband?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>There is a prophetic tradition that is cited to erroneously claim a concept of ‘original sin’ in Islam, or a ‘scientific error,’ or an indignity against women. Rather, all of these interpretations are incorrect. A proper interpretation based upon scholarly commentary reveals that the tradition in question is a lesson about overcoming the lower nature of the human soul.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْلَا بَنُو إِسْرَائِيلَ لَمْ يَخْنَزْ اللَّحْمُ وَلَوْلَا حَوَّاءُ لَمْ تَخُنَّ أُنْثَى زَوْجَهَا<\/p>\n<p><strong>Were is not for the children of Israel, meat would not spoil. Were it not for Eve, a wife would not betray her husband.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3152, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/04\/hadith-on-greed-if-meat-did-not-decay-the-rich-would-hoard-it-all\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This tradition refers to the tendency in humankind to succumb to greed or harmful desires, and mention of the tribes of Israel and Eve are concrete examples of such a tendency.<\/p>\n<p>First of all, the tradition does not mean that other people are punished because of the actions of the tribes of Israel or Eve, upon her be peace. There is no concept of ‘original sin’ in Islam, such that people are punished for actions committed by others.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَكْسِبُ كُلُّ نَفْسٍ إِلَّا عَلَيْهَا وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ<\/p>\n<p><strong>No soul earns anything but it is upon itself, and none shall bear the burdens of another.<\/strong><\/p>\n<p>Surat al-An’am 6:164<\/p><\/blockquote>\n<p>Ibn Kathir explains this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِخْبَارٌ عَنِ الْوَاقِعِ يَوْمَ الْقِيَامَةِ فِي جَزَاءِ اللَّهِ تَعَالَى وَحُكْمِهِ وَعَدْلِهِ أَنَّ النُّفُوسَ إِنَّمَا تُجَازَى بِأَعْمَالِهَا إِنْ خَيْرًا فَخَيْرٌ وَإِنْ شَرًّا فَشَرٌّ وَأَنَّهُ لَا يُحْمَلُ مِنْ خَطِيئَةِ أَحَدٍ عَلَى أَحَدٍ وَهَذَا مِنْ عَدْلِهِ تَعَالَى<\/p>\n<p>This verse informs us about the occurrence of the Day of Resurrection, in which are the recompense of Allah Almighty, His judgment, and His justice, that souls will only be recompensed for their own deeds. If deeds are good then the reward is good, and if deeds are evil then the recompense is evil. No one will bear the burden of sin for anyone else, for this is the justice of the Almighty.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 6:164<\/p><\/blockquote>\n<p>The meaning of ‘meat would not spoil’ is that if Allah had not decreed for meat to spoil or decay naturally, the rich and powerful would have hoarded it all for themselves at the expense of the poor.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال وهب بن منبه فِي بَعْضِ الْكُتُبِ لَوْلَا أَنِّي كَتَبْتُ الْفَسَادَ عَلَى الطَّعَامِ لَخَزَنَهُ الْأَغْنِيَاءُ عَنِ الْفُقَرَاءِ<\/p>\n<p>Wahb ibn Munabbih said: It is written in some divine books that had I (Allah) not decreed that meat would spoil, the rich would have hoarded it from the poor.<\/p>\n<p>Source: Fatḥ al-Bārī 3152<\/p><\/blockquote>\n<p>This is not a ‘scientific’ statement explaining <em>how<\/em> meat physically came to be spoiled, but instead it is a spiritual statement about <em>why<\/em> the wisdom of the Creator causes this to occur in nature. Hoarding food from others is a grave sin and the fact that meat spoils naturally prevents people from doing so with greater ease.<\/p>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ احْتَكَرَ عَلَى الْمُسْلِمِينَ طَعَامًا ضَرَبَهُ اللَّهُ بِالْجُذَامِ وَالْإِفْلَاسِ<\/p>\n<p><strong>Whoever hoards food away from the Muslims, then Allah will afflict him with leprosy and poverty<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 2155, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/10\/30\/hadith-on-hoarding-allah-will-punish-those-who-hoard-food-away-from-others\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>As for the ‘betrayal’ of Eve, this does not mean that she committed adultery or intentionally misled her husband. Satan first deceived Eve, who then tempted her husband to disobey Allah by eating from the forbidden tree.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَيْسَ الْمُرَادُ بِالْخِيَانَةِ هُنَا ارْتِكَابَ الْفَوَاحِشِ حَاشَا وَكَلَّا وَلَكِنْ لَمَّا مَالَتْ إِلَى شَهْوَةِ النَّفْسِ مِنْ أَكْلِ الشَّجَرَةِ وَحَسَّنَتْ ذَلِكَ لِآدَمَ عُدَّ ذَلِكَ خِيَانَةً لَهُ وَأَمَّا مَنْ جَاءَ بَعْدَهَا مِنَ النِّسَاءِ فَخِيَانَةُ كُلِّ وَاحِدَةٍ مِنْهُنَّ بِحَسَبِهَا<\/p>\n<p>The meaning of ‘betrayal’ here is not that she committed infidelity, certainly not! Rather, when she inclined to the desire of her soul to eat from the tree and she beautified that for Adam, it was considered a betrayal of him. As for women who came after her, the betrayal of each of them is on account of her deed (that she initiated).<\/p>\n<p>Source: Fatḥ al-Bārī 3152<\/p><\/blockquote>\n<p>The sin of Eve was that she gave into the lower animalistic nature of her soul, which exists within every male or female human being, and she successfully tempted her husband with her desires. For this reason, every woman after her who commits a similar sin is simply following a pattern set by Eve.<\/p>\n<p>This is not to say that women are uniquely evil compared to men, as the story has been interpreted in other religions. On the contrary, this is similar to what occurred with the first son of Adam, Cain, who killed his brother due to jealousy and anger. Every person after him who murders another person is simply following a pattern set by him.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُقْتَلُ نَفْسٌ ظُلْمًا إِلَّا كَانَ عَلَى ابْنِ آدَمَ الْأَوَّلِ كِفْلٌ مِنْ دَمِهَا لِأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ<\/p>\n<p><strong>No soul is wrongfully killed but that some responsibility for its blood is upon the first son of Adam, for he was the first to set the precedent of murder<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3158, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/27\/hadith-on-bloodshed-the-son-of-adam-cain-shares-the-burden-of-every-murder-because-he-started-the-practice-of-unlawful-killing\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>That Cain bears some responsibility for all murders after him does not mean he is being punished for the actions of others, but rather he is being punished for leading others into sin, which is a separate deed in itself.<\/p>\n<p>Whoever leads others to righteousness or sin is recompensed for that particular act of guiding or misguiding, not for the actual deeds of those they influenced.<\/p>\n<p>Jareer reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً كَانَ لَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يُنْتَقَصَ مِنْ أُجُورِهِمْ شَيْءٌ وَمَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يُنْتَقَصَ مِنْ أَوْزَارِهِمْ شَيْءٌ<\/p>\n<p><strong>Whoever institutes a good practice in Islam will have its reward and the reward of whoever acts upon it without detracting from their rewards in the slightest, and whoever institutes an evil practice in Islam will have its sin and the sin of those who act upon it without detracting from their sins in the slightest<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1017, Source: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/08\/hadith-on-guidance-whoever-institutes-good-or-evil-practices-into-islam-will-be-recompensed\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنَ الأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلاَلَةٍ كَانَ عَلَيْهِ مِنَ الإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا ‏‏<\/p>\n<p><strong>Whoever calls to guidance will have a reward similar to those who follow him, without detracting from their reward at all. Whoever calls to misguidance will have sin upon him similar to those who follow him, without detracting from their sins at all<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2674, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/08\/the-consequence-of-calling-to-righteousness-or-sin\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, the lesson of the tradition is that women, like men, have a lower nature which tempts them follow the harmful desires in their souls. They must struggle against such desires, to wage a spiritual <em>jihad<\/em> against them, in order to fulfill their higher nature, to protect themselves, their husbands, and their families.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلْ يَضْبِطْنَ أَنْفُسَهُنَّ وَيُجَاهِدْنَ هَوَاهُنَّ<\/p>\n<p>Rather, women should control themselves and strive against their lowly desires.<\/p>\n<p>Source: Fatḥ al-Bārī 3152<\/p><\/blockquote>\n<p>The story of Adam and Eve and their disobedience to Allah is an archetype for the human race as a whole, both men and women. It was not only Eve who sinned. They both committed sin, as every human being has the capacity to commit sin.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَزَلَّهُمَا الشَّيْطَانُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ<\/p>\n<p><strong>Satan caused them both to slip out of it and removed them from that (garden) in which they had been.<\/strong><\/p>\n<p>Surat al-Baqarah 2:35<\/p><\/blockquote>\n<p>At the same time, they were both forgiven for their sin, as every human being has the potential to be forgiven.<\/p>\n<p>One should also not imagine that the tradition is demeaning to Eve, or women, in any way. In fact, some scholars say that she is called ‘Eve’ (<em>Hawa’<\/em>) because it is linguistically related to ‘life’ (<em>hayy<\/em>), as she is the mother of all human beings.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قِيلَ سُمِّيَتْ بِذَلِكَ لِأَنَّهَا أُمُّ كُلِّ حَيٍّ<\/p>\n<p>It is said that she is called ‘Eve’ because she is the mother of all life.<\/p>\n<p>Source: Fatḥ al-Bārī 3152<\/p><\/blockquote>\n<p>Therefore, Muslims should respect both Adam and Eve because they are, quite literally, our parents.<\/p>\n<p>In sum, the tradition teaches a lesson about the lower nature of humankind, the greed to hoard from others or the propensity to incline to harmful desires. Every person has this lower part of their nature inside of them and must struggle to keep it under control.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;No soul earns anything but it is upon itself,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[300,183,288,184,34,48,100,196,128],"class_list":["post-19458","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-adam","tag-day-of-resurrection-yawm-al-qiyammah","tag-desires-shahawat","tag-guidance-al-hidaya","tag-humanity-al-insaaniyyah","tag-justice-adl","tag-manners-al-adab","tag-prophetic-virtues","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-53Q","jetpack-related-posts":[{"id":19412,"url":"https:\/\/www.abuaminaelias.com\/few-women-ever-achieved-perfection\/","url_meta":{"origin":19458,"position":0},"title":"Few women ever achieved perfection?","author":"Abu Amina Elias","date":"March 26, 2018","format":false,"excerpt":"\"We sent to her Our angel in the form of a well-proportioned man.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":19458,"position":1},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":19458,"position":2},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":11513,"url":"https:\/\/www.abuaminaelias.com\/women-majority-hellfire-explanation\/","url_meta":{"origin":19458,"position":3},"title":"Are women the majority in Hellfire?","author":"Abu Amina Elias","date":"November 10, 2012","format":false,"excerpt":"\"Women are the majority of the children of Adam,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16006,"url":"https:\/\/www.abuaminaelias.com\/prophet-accept-severed-heads\/","url_meta":{"origin":19458,"position":4},"title":"Did the Prophet accept presentation of severed heads?","author":"Abu Amina Elias","date":"August 19, 2014","format":false,"excerpt":"\"A severed head was never presented to the Messenger of Allah.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15139,"url":"https:\/\/www.abuaminaelias.com\/prophet-never-beat-women-servants\/","url_meta":{"origin":19458,"position":5},"title":"The Prophet never beat women, servants, or animals","author":"Abu Amina Elias","date":"January 6, 2014","format":false,"excerpt":"\"Whoever strikes someone will receive retribution...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19458","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19458"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19458\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19458"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19458"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19458"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}