{"id":19476,"date":"2018-04-16T14:48:19","date_gmt":"2018-04-16T10:48:19","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19476"},"modified":"2025-04-16T10:53:47","modified_gmt":"2025-04-16T06:53:47","slug":"ali-ibn-abi-talib-rape-girl","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/ali-ibn-abi-talib-rape-girl\/","title":{"rendered":"Did &#8216;Ali ibn Abi Talib rape an underage girl?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Entire websites and internet forums are dedicated to making Islam appear as evil as possible by misrepresenting, deliberately or not, its sacred texts. Believers should not waste their valuable moments engaging in fruitless online debates with such misguided people. Rather, one should hope some of them will eventually be guided, or at least recant their vilification of Islam, as even the worst enemies of Islam can become the greatest of Muslims.<\/p>\n<p>However, it is a collective obligation for Muslims to answer serious allegations against Islam and to provide accurate information for those in need of it. These anti-Muslim claims are meant to undermine people&#8217;s faith or to demonize the Muslim community in support of a political agenda. Every single accusation or misinterpretation of Islam can be rebutted as long as we are patient enough to search for it.<\/p>\n<p>There are literally thousands of prophetic traditions describing events in an ancient era, which most people do not have sufficient knowledge to properly understand. Some traditions are very clear in the moral lesson they convey to us, even today in translation, while others require substantial study of classical Arabic, anthropology, and history to interpret correctly.<\/p>\n<p>In one such tradition, Ali ibn Abi Talib, may Allah be pleased with him, is described as taking a concubine-wife into his household from among the prisoners of war. This can be difficult to understand if one assumes 21st century &#8216;first-world&#8217; social customs are universal in all times and places.<\/p>\n<p>Buraydah reported: The Prophet, peace and blessings be upon him, sent Ali to Khalid to bring a fifth of the war spoils, and I hated Ali. Ali had taken a ritual bath (after intercourse with a maidservant). I said to Khalid, “Do you not see this?” When we came to the Prophet, I mentioned that to him. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ تُبْغِضْهُ فَإِنَّ لَهُ فِي الْخُمُسِ أَكْثَرَ مِنْ ذَلِكَ<\/p>\n<p><strong>Do not hate him, for he deserved more of the fifth than that.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4350, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Ali had taken a ritual bath to prepare himself for prayer after consummating the marriage to his concubine-wife, who had been a prisoner of war. While the text itself is relatively short, there are three salacious and inappropriate allegations made against Islam on the basis of this narration: 1) Ali had ‘raped’ the maidservant, 2) Ali had intercourse with her while she was underage, and 3) Ali had acted treacherously by taking war spoils without permission.<\/p>\n<p>These allegations are based upon an unwarranted reading of subtext into the narration, an imposition of modern concepts on the pre-modern historical context, and disregard of other teachings in Islam to the contrary. Moreover, the forums that publicize such claims are transparently biased against Islam, beginning with the false premise that Islam is inherently evil and then mining classical texts for &#8216;evidence&#8217; in support. This article will answer each claim.<\/p>\n<p>First, it is not permissible in Islam to mistreat prisoners of war, especially women, children, and those who are not part of the enemy army. Prisoners of war have basic human rights, whether they are Muslims or not. They must be clothed and fed, not abused or tortured.<\/p>\n<p>Abu &#8216;Aziz ibn &#8216;Umayr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَوْصُوا بِالأُسَارَى خَيْرًا<\/p>\n<p><strong>I enjoin you to treat prisoners well.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 22\/393, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/09\/07\/prophet-treat-prisoners-well\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَوْصُوا بِالنِّسَاءِ خَيْرًا<\/p>\n<p><strong>I enjoin you to treat women well.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3153, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/10\/women-created-bent-rib\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Qurtubi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَنَدَبَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّادَةَ إِلَى مَكَارِمِ الْأَخْلَاقِ وَحَضَّهُمْ عَلَيْهَا وَأَرْشَدَهُمْ إِلَى الْإِحْسَانِ وَإِلَى سُلُوكِ طَرِيقِ التَّوَاضُعِ حَتَّى لَا يَرَوْا لِأَنْفُسِهِمْ مَزِيَّةً عَلَى عَبِيدِهِمْ<\/p>\n<p>The Prophet recommended a master to have good character and he emphasized it upon them. He directed them to behave in the best manner and to traverse the path of humility, such that they do not see any privilege for themselves over their slaves.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 4:36<\/p><\/blockquote>\n<p>And Imam al-Halimi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإن اشترى جارية فكرهت أن يمسها أو يضاجعها فلا يمسها ولا يضاجعها ولا يطأها إلا بإذنها<\/p>\n<p>If a female slave is acquired and she dislikes to be touched, or slept with, then he may not touch her, lie with her, or have intercourse with her unless she consents.<\/p>\n<p>Source: Minhāj fī Shu’ab al-Imān 3\/267<\/p><\/blockquote>\n<p>The institution of concubinage was similar to marriage in pre-modern Muslim society. The Arabic word for &#8216;concubinage&#8217; (<em>al-sirr<\/em>) is linguistically related to &#8216;marriage&#8217; (<em>al-nikah<\/em>):<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَمَا قَالُوا سُرِّيَّةٌ والأَصل مِنَ السِّر وَهُوَ النِّكَاحُ<\/p>\n<p>As they say &#8216;a concubine,&#8217; the origin is from the word &#8216;concubinage,&#8217; which is marriage.<\/p>\n<p>Source: Lisān al-&#8216;Arab 4\/304<\/p><\/blockquote>\n<p>A female prisoner of war could become incorporated into a household as a concubine-wife, with rights and privileges that improved her social status. If she gave birth to children, her children would be free and entitled to equal parental care, and as the &#8216;mother of the child&#8217; (<em>umm walad<\/em>), she could not be sold to anyone else or separated from her children.<\/p>\n<p>In this case, Ali was bringing the maidservant into his household by consummating his marriage to her as a concubine-wife and member of the family. In another version of this tradition, a man wrote to the Prophet (ṣ) asking him to send someone to set aside a fifth of the spoils:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَبَعَثَ إِلَيْنَا عَلِيًّا وَفِي السَّبْيِ وَصِيفَةٌ هِيَ أَفْضَلُ مِنْ السَّبْيِ فَخَمَّسَ وَقَسَمَ فَخَرَجَ رَأْسُهُ مُغَطًّى<\/p>\n<p>He sent Ali to us and among the prisoners was a maid-servant (<em>wasifah<\/em>), who was the best of the prisoners. He set aside a fifth, distributed the rest, and he came out to us with his head dripping wet (from a ritual bath).<\/p><\/blockquote>\n<p>They said, “O Abu al-Hasan, what is this?” Ali said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَمْ تَرَوْا إِلَى الْوَصِيفَةِ الَّتِي كَانَتْ فِي السَّبْيِ فَإِنِّي قَسَمْتُ وَخَمَّسْتُ فَصَارَتْ فِي الْخُمُسِ ثُمَّ صَارَتْ فِي أَهْلِ بَيْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ صَارَتْ فِي آلِ عَلِيٍّ وَوَقَعْتُ بِهَا<\/p>\n<p>Have you not seen the maid-servant among the prisoners? Indeed, I have divided the spoils and set aside a fifth. She became part of the fifth, then she became part of the household of the Prophet, peace and blessings be upon him, then she became part of the family of Ali, and I have consummated it with her.<\/p>\n<p>Source: Musnad Aḥmad 22458, Grade: <em>Hasan<\/em><\/p><\/blockquote>\n<p>The young woman is described as a ‘maid-servant’ or ‘lady-in-waiting,’ indicating that she already had a high standing as the servant of a wealthy master or royal court.<\/p>\n<p>By consummating her as a concubine-wife, Ali ensured that her privileged social status would remain and prosper. She would be treated like a wife, part of his family. This arrangement was ultimately in her best interests and infers that the relationship was consensual. Although maid-servants were ‘owned,’ they were not treated as mere property. Their right to fair and kind treatment was acknowledged the same as that of family members.<\/p>\n<p>In this pre-modern socio-historical context, what Ali did was ordinary according to the widely practiced customs of many societies. Today, the institution of concubinage has been abolished with the unanimous abolition of slavery by Muslims, with the understanding that it was intended to be phased out of society, making these practices obsolete in the modern context.<\/p>\n<p>There is no evidence at all that Ali harmed her in any way, but rather, this was a beneficial arrangement for her. It is not plausible that he would rape her, which is to harm her, in direct contradiction of the Prophet’s (ṣ) order to treat prisoners well and the prophetic maxim:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ ضَرَرَ وَلاَ ضِرَارَ<\/p>\n<p><strong>Do not cause harm or return harm.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2340, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/03\/hadith-on-islamic-law-do-not-be-harmed-or-harm-others\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>If a master strikes his maidservant and causes an injury, that maidservant must be set free and the concubinage annulled.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessing be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِنَّ كَفَّارَتَهُ أَنْ يُعْتِقَهُ<\/p>\n<p><strong>Whoever strikes his slave sharply or slaps him, then the expiation for the sin is to emancipate him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1657, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/26\/hadith-on-freedom-the-expiation-for-the-sin-of-beating-a-slave-is-to-free-him\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>It is not permissible in Islam to harm a maidservant with harsh words, let alone physical violence.<\/p>\n<p>Imam al-Razi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ الْإِحْسَانَ إِلَيْهِمْ مِنْ وُجُوهٍ أَحَدُهَا أَنْ لَا يُكَلِّفَهُمْ مَا لَا طَاقَةَ لَهُمْ بِهِ وَثَانِيهَا أَنْ لَا يُؤْذِيهِمْ بِالْكَلَامِ الْخَشِنِ بَلْ يُعَاشِرُهُمْ مُعَاشَرَةً حَسَنَةً وَثَالِثُهَا أَنْ يُعْطِيَهُمْ مِنَ الطَّعَامِ وَالْكُسْوَةِ مَا يَحْتَاجُونَ إِلَيْهِ<\/p>\n<p>Know that good treatment towards servants is from several perspectives: First, that they are not held responsible for what they are incapable of doing. Second, that they are not harmed with rude words. Rather, he should live with them in good company. Third, that they are provided with food and clothing as they need.<\/p>\n<p>Source: Tafsīr al-Rāzī 4:36<\/p><\/blockquote>\n<p>If it is not permissible for a master to physically or emotionally harm a maid-servant, then how could it be permissible for him to rape her?<\/p>\n<p>Second, there is the question of why Ali did not apply the mandatory ‘waiting period’ (<em>istibra’a<\/em>) to discover whether or not she was already pregnant. The most likely explanation is that she had not previously had intercourse with anyone, or she had just recently finished her menstruation cycle.<\/p>\n<p>Imam Ibn Hajar commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَجُوزُ أَنْ تَكُونَ حَاضَتْ عَقِبَ صَيْرُورَتِهَا لَهُ ثُمَّ طَهُرَتْ بَعْدَ يَوْمٍ وَلَيْلَةٍ ثُمَّ وَقَعَ عَلَيْهَا<\/p>\n<p>It is possible that she was menstruating at the end of her arrival with him, then she became ritually pure after a day or a night, and then he consummated (the marriage) with her.<\/p>\n<p>Source: Fatḥ al-Bārī 8\/67<\/p><\/blockquote>\n<p>One interpretation offered by classical commentators is that she ‘had not reached maturity,’ by which they meant she had not begun her regular menstruation cycles.<\/p>\n<p>Imam al-Khattabi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِاحْتِمَالِ أَنْ تَكُونَ عَذْرَاءَ أَوْ دُونَ الْبُلُوغِ أَوْ أَدَّاهُ اجْتِهَادُهُ أَنْ لَا اسْتِبْرَاءَ فِيهَا<\/p>\n<p>For it is possible that she was a virgin, or had not reached maturity, or he used his reasoning in not applying the waiting period for her.<\/p>\n<p>Source: Fatḥ al-Bārī 8\/67<\/p><\/blockquote>\n<p>Some anti-Muslim commenters have seized upon the phrase ‘not reached maturity’ to imply that she was a prepubescent girl. Rather, it refers to the uncommon but possible scenario that she was old enough to be considered an adult but had experienced delayed or late menarche. Moreover, this was only one of the various interpretations they offered, as there could have been other legitimate reasons he did so that are not mentioned in the text.<\/p>\n<p>For some young women, menstruation can occur as late as 16 years of age and still be considered physiologically normal. In the <span style=\"box-sizing: border-box;\">premodern world, such a young woman might be socialized as an adult even though she had not menstruated yet. The maidservant was not described in the narration with an Arabic word meaning ‘child,’ such as <em>tifl<\/em><\/span>, implying that she was considered an adult by their social standards.<\/p>\n<p>Lastly, Islam has rules and guidance for uncomfortable realities in life, such as warfare. An inevitable part of warfare is the acquisition of spoils and the treatment of prisoners of war. International law today has regulations for distributing spoils and handling prisoners of war. Similarly, classical Islamic law developed regulations for these matters based upon the teachings of the Prophet (ṣ).<\/p>\n<p>One-fifth of the spoils of war, which was the property left over by defeated enemies, was to belong to the Prophet (ṣ) and his household for the purpose of redistributing it as charity. It was included in later jurisprudence as the share of spoils belonging to the military commander or Caliph.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمُوا أَنَّمَا غَنِمْتُم مِّن شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِن كُنتُمْ  آمَنتُم بِاللَّهِ وَمَا أَنزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ<\/p>\n<p><strong>Know that whatever spoils you take, one-fifth is for Allah and the Messenger, his close relatives, orphans, the poor, and ˹needy˺ travellers, if you truly believe in Allah and what We revealed to Our servant on that decisive day when the two armies met.<\/strong><\/p>\n<p>Surat al-An’fal 8:41<\/p><\/blockquote>\n<p>This share of the spoils was not intended to enrich the Prophet (ṣ) and his family in a worldly sense. It would be reinvested in the community through various charitable donations.<\/p>\n<p>Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّهُ لَا يَحِلُّ لِي مِمَّا أَفَاءَ اللَّهُ عَلَيْكُمْ قَدْرُ هَذِهِ إِلَّا الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ<\/p>\n<p><strong>O people! Verily, it is not lawful for me to take from the spoils that Allah bestowed upon you so much as the amount of this <\/strong>(hair),<strong> except for a fifth and it will come back to you.<\/strong><\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 4138, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>That it will ‘come back to you’ means it would be redistributed for the benefit of the community. The Prophet (ṣ) would only keep a fraction of it for himself and his family.<\/p>\n<p>Yahya ibn al-Jazzar, may Allah be pleased with him, was asked, “How much of the fifth did he take for himself?” Yahya said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُمُسُ الْخُمُسِ<\/p>\n<p>One-fifth of the fifth.<\/p>\n<p>Source: Sunan al-Nasā&#8217;ī 4144, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Hence, the Prophet (ṣ) sent Ali to collect and distribute this fifth as he saw fit. Buraydah disliked Ali because he thought Ali was doing so treacherously without permission, but the Prophet (ṣ) told him that Ali, in fact, had acquired less for himself than he had a right to take.<\/p>\n<p>Imam Abu Dharr al-Harawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا أَبْغَضَ الصَّحَابِيُّ عَلِيًّا لِأَنَّهُ رَآهُ أَخَذَ مِنَ الْمَغْنَمِ فَظَنَّ أَنَّهُ غَلَّ فَلَمَّا أَعْلَمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَخَذَ أَقَلَّ مِنْ حَقِّهِ أَحَبَّهُ<\/p>\n<p>Indeed, the companion only hated Ali because he saw him take from the spoils and he suspected him of acting treacherously. When the Prophet, peace and blessings be upon him, let him know that he had taken less than he deserved, he loved him.<\/p>\n<p>Source: Fatḥ al-Bārī 8\/67<\/p><\/blockquote>\n<p>In this light, Ali had not acted treacherously or immorally in any sense. He had brought the maidservant into his household as a concubine-wife, as a family member, which ensured the continuation of her privileged social status. She was not a child and she was not raped, nor was she harmed in any way.<\/p>\n<p>Furthermore, the institution of concubinage is no longer valid because of the general abolition of slavery by Muslim jurists, based upon indications in classical Islamic law that slavery, as an aberration of a human being&#8217;s natural free state, was intended to be gradually removed from society.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not cause harm or return harm.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[18,437,24,47,48,51,53,62,103,440,267,128],"class_list":["post-19476","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-community-jamaah","tag-concubines-al-surriyyah","tag-family-ties-sillat-rahim","tag-jihad","tag-justice-adl","tag-leadership-imamate","tag-marriage-al-nikah","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-rape","tag-slavery-al-istibad","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-548","jetpack-related-posts":[{"id":23736,"url":"https:\/\/www.abuaminaelias.com\/custodianship-of-the-right-hand\/","url_meta":{"origin":19476,"position":0},"title":"Custodianship of the Right Hand: Concubinage, Rape, and &#8216;Sexual Slavery&#8217; in Islam","author":"Abu Amina Elias","date":"December 9, 2021","format":false,"excerpt":"\"This paper addresses the allegations...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":19476,"position":1},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17258,"url":"https:\/\/www.abuaminaelias.com\/marital-rape-domestic-violence\/","url_meta":{"origin":19476,"position":2},"title":"Marital rape and domestic violence in Islamic law","author":"Abu Amina Elias","date":"October 29, 2015","format":false,"excerpt":"\"Live with women honorably.\" (4:19)","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19449,"url":"https:\/\/www.abuaminaelias.com\/the-best-of-you-in-islam\/","url_meta":{"origin":19476,"position":3},"title":"Best of believers in Islam described","author":"Abu Amina Elias","date":"March 29, 2018","format":false,"excerpt":"\"Best of you are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":19476,"position":4},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14532,"url":"https:\/\/www.abuaminaelias.com\/fight-people-until-they-become-muslims\/","url_meta":{"origin":19476,"position":5},"title":"Fight people until they become Muslims?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The meaning is to fight those who are waging war...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19476","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19476"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19476\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19476"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19476"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19476"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}