{"id":19511,"date":"2018-04-24T15:37:40","date_gmt":"2018-04-24T11:37:40","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19511"},"modified":"2025-05-05T14:14:59","modified_gmt":"2025-05-05T10:14:59","slug":"consent-marriage-concubines","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/consent-marriage-concubines\/","title":{"rendered":"Sexual Consent, Marriage, and Concubines in Islam"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Consent in lawful sexual relations (that is, a valid marriage) is an important moral consideration in Islam. After all, marriage should be based upon love and mercy, as stated in the Quran, and part of a healthy sexual relationship is the mutual pleasure experienced by both parties. Any form of sexual violence has been and always will be unlawful in Islam.<\/p>\n<p>The concept of ‘consent,’ however, has been transformed by modern developed secular liberal societies into not only a moral consideration, but the primary legal requirement that makes sex lawful. They no longer require a valid marriage contract for sex to be deemed legal and, in many places, adultery is no longer a crime.<\/p>\n<p>This transformation has not only contributed to the proliferation of sexual promiscuity and an epidemic of sexually-transmitted diseases, but also to legal confusion as ‘consent’ is often subjective and is difficult to define and establish as a matter of law. Consent may or may not be stated outright in any sexual encounter; it may be implicitly understood by one party and not another, it may be withdrawn after the fact upon reflection, or it may be lied about. Matters become all the more confusing when the consumption of alcohol and drugs is involved, placing liberal policy-makers in the difficult position of reconciling the legal protection afforded to extramarital sex and alcohol use with the vagueness of consent.<\/p>\n<p>Historically, Muslims considered sex to be lawful in only two cases: marriage and concubinage. Concubinage is no longer valid due to the unanimous abolition of slavery, making marriage the only contemporary lawful outlet for sexual activity. These boundaries are clearly defined and more objective as a legal basis than &#8216;consent.&#8217; Therefore, the discussion of consent as a matter of law is less relevant to Muslims who adhere to Islamic teachings. By confining sex to marriage and avoiding alcohol or drugs, Muslims are secure from the legal and moral anarchy that the sexual revolution has unleashed. And because &#8216;consent&#8217; is a very modern issue in terms of the law, the early Muslims did not discuss it explicitly.<\/p>\n<p>Since mutual pleasure is one of the acknowledged purposes of lawful sex, it naturally cannot be attained by force, compulsion, or violence. Imam al-Shafi&#8217;i, may Allah have mercy on him, has an interesting passage that can possibly shed light upon the unstated views of the earliest jurists. They did not discuss the issue of consent as a legal matter, so we must ‘read between the lines,’ so to speak, to infer what they might have thought about it from a moral perspective. Al-Shafi&#8217;i was asked questions about a man’s responsibility to spend time with his wife or wives, and specifically whether he is required to have intercourse with her at regular intervals. He answered:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَكَذَا لَوْ كَانَتْ مُنْفَرِدَةً بِهِ أَوْ مَعَ أَمَةٍ لَهُ يَطَؤُهَا أُمِرَ بِتَقْوَى اللَّهِ تَعَالَى وَأَنْ لَا يضربهَا فِي الْجِمَاعِ وَلَمْ يُفْرَضْ عَلَيْهِمِنْهُ شَيْءٌ بِعَيْنِهِ إنَّمَا يُفْرَضُ عَلَيْهِ مَا لَا صَلَاحَ لَهَا إلَّا بِهِ مِنْ نَفَقَةٍ وَسُكْنَى وَكِسْوَةٍ وَأَنْ يَأْوِيَ إلَيْهَا فَأَمَّا الْجِمَاعُ فَمَوْضِعُ تَلَذُّذٍ وَلَا يُجْبَرُ أَحَدٌ عَلَيْهِ<\/p>\n<p>Likewise, if he has only one wife or an additional concubine with whom he has intercourse, he is commanded to fear Allah Almighty and to not harm her in regards to intercourse, although nothing specific is obligated upon him. He is only obligated to provide what benefits her such as financial maintenance, residence, clothing, and spending the night with her. As for intercourse, its position is one of pleasure and no one can be forced into it (<em>la yujbaru ahadun ‘alayhi<\/em>).<\/p>\n<p>Source: al-Umm 5\/203<\/p><\/blockquote>\n<p>The main legal takeaway of this passage is that a husband cannot be forced by law to have intercourse with his wife on a consistent basis because a man does not necessarily have control over his ability to achieve an erection. A careful reading of this paragraph, however, reveals a little bit more about how sex was conceived. Al-Shafi&#8217;i commands the husband “to fear Allah” and “to not harm her in regards to intercourse” by abandoning her completely. Ibn Qudamah and others were more strict than him, saying a husband is obligated to satisfy his wife’s sexual needs on a regular basis. Al-Shafi&#8217;i and these jurists acknowledged that not being intimate with her at all would be emotionally harmful.<\/p>\n<p>Furthermore, Al-Shafi&#8217;i’s broad wording at the end of the paragraph (“no one may be forced into it”) seems to be a general observation on the nature of marital sex as a mutually pleasurable activity, especially since he acknowledges that a husband abstaining from sex completely would be harmful to his wife. It was not uncommon for jurists to make a wider point when discussing a specific case or relate it back to their social or moral values. Al-Shafi&#8217;i’s habit was to admonish men to treat women in the best way. When discussing the matter of divorcing a menstruating wife just a few pages earlier, for instance, he says:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ أَمَرَ اللَّهُ تَعَالَى بِالْإِمْسَاكِ بِالْمَعْرُوفِ وَالتَّسْرِيحِ بِالْإِحْسَانِ وَنَهَى عَنْ الضَّرَرِ وَطَلَاقُ الْحَائِضِ ضَرَرٌ عَلَيْهَا<\/p>\n<p>Allah Almighty has commanded good conduct, to release in the best manner, and He has prohibited harm. Divorcing a menstruating woman is harmful to her.<\/p>\n<p>Source: al-Umm 5\/193<\/p><\/blockquote>\n<p>He delivers the legal verdict not as an empty mechanical rule, but rather as one that is rooted in the values of good custom (<em>al-ma’ruf<\/em>), excellent behavior (<em>al-ihsan<\/em>), and avoiding harm. Similarly, we can infer that such values would have informed his answer if he had been asked point-blank about a man physically forcing an unwilling wife or concubine into intercourse. In fact, one of Al-Shafi&#8217;s&#8217;s successors, Imam Abu Abdullah al-Halimi, understood precisely this point in regard to concubinage, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإن اشترى جارية فكرهت أن يمسها أو يضاجعها فلا يمسها ولا يضاجعها ولا يطأها إلا بإذنها<\/p>\n<p>If a female slave is purchased and she dislikes to be touched, or slept with, then he may not touch her, lie with her, or have intercourse with her unless she consents.<\/p>\n<p>Source: Minhāj fī Shu’ab al-Imān 3\/267<\/p><\/blockquote>\n<p>Appreciating this point is important to the way we understand and characterize the historical institution of concubinage, which did not consider &#8216;consent&#8217; as a matter of law. Some academics and anti-Muslim activists accuse Muslims of sanctioning ‘rape’ via concubinage, on the basis that modern notions of consent were absent, but to do so is to inaccurately transpose a very modern legal discussion, in a very modern libertine social context, onto a pre-modern society for whom these issues were not considered important.<\/p>\n<p>The classical jurists likely did not consider consent a legal issue for the same reasons that it is problematic in the modern period: it is notoriously difficult to properly define in law and establish as a fact in court. It is not surprising that jurists living hundreds of years ago did not develop legal answers to issues that did not arise until the last hundred years, under radically different cultural conditions, and are still unsettled to this day.<\/p>\n<p>Moreover, since classical Islamic legal sources say little about consent in sexual relations, it is likely that Muslim women in the pre-modern period did not consider their personal sexual autonomy as a priority, instead focusing on more relevant material issues such as equity in marriage, maintenance rights, protection from abuse and predation, and so on.<\/p>\n<p>The sanctification of personal sexual autonomy is itself a very modern concept that arose with the advent of irreligious political ideologies based upon individual fulfillment, which means such an idea of consent simply did not exist in pre-modern societies at all. We cannot realistically assume pre-modern women were as concerned about ‘consent’ as much as modern women living in an entirely different secular liberal social climate.<\/p>\n<p>Yet Islam, even in its earliest stages, had legal mechanisms to protect women from sexual violence without the need for enshrining consent into law. The principle of ‘no harm’ provided women with protection from male abusers ever since the Prophet (ṣ) decreed it, and it serves as a universal principle from which modern laws can be derived to confront uniquely modern abuses. Unlike consent, which modern societies still struggle to properly define, the prohibition of harm is an objective and comprehensive category that effectively outlaws rape and sexual assault and any future forms these violent crimes may take.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا ضَرَرَ وَلَا ضِرَارَ مَنْ ضَارَّ ضَرَّهُ اللَّهُ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ<\/p>\n<p><strong>Do not cause<\/strong> <strong>harm or return harm. Whoever harms others, Allah will harm him. Whoever is harsh with others, Allah will be harsh with him.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá 11070, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/08\/15\/la-darara-wa-la-dirar\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>It is unlawful for a Muslim man to harm his wife or his concubine, either physically or emotionally, particularly during sexual intercourse. Whoever harms another person, except in order to repel or prevent a greater harm, Allah will inflict him with harm equivalent to his sin on the Day of Judgment. Naturally, one should treat others as he or she would like to be treated in the Hereafter.<\/p>\n<p>On this basis, the jurists derived one of the five essential legal maxims of Islamic law as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الضَّرَر يُزَال<\/p>\n<p>Harm should be removed.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/12\/19\/al-suyuti-five-qawaid-fiqhiyyah\/\">al-Ashbāh wal-Naẓāʼir 1\/7<\/a><\/p><\/blockquote>\n<p>As such, acts of sexual violence and assault, or ‘rape,’ are unlawful in Islam as these are obviously harmful and unnecessary acts. This legal mechanism, and not consent in itself, was the route through which sex crimes, committed in otherwise lawful sexual relationships like marriage or concubinage, were forbidden by Islam.<\/p>\n<p>Al-Nawawi states this general princple:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فان كان يمكن جماعها من غير ضرر بها كان له ذلك وان كان لا يمكن جماعها الا بالاضرار بها لم يجز له جماعها<\/p>\n<p>If it is possible to have intercourse with her without harming her, he may do that. If it is not possible for him to have intercourse with her except by harming her, he does not have permission to have intercourse with her.<\/p>\n<p>Source: al-Majmū&#8217; Sharḥ al-Muhadhab 16\/409<\/p><\/blockquote>\n<p>The Quran and Sunnah are not explicit about the issue of sexual consent with wives and concubines during individual encounters, whether affirming consent as morally necessary or not at all. In this case, we need to read the sources carefully for indications as to whether the Prophet (ṣ) would have allowed a man to coerce his wife or concubine into sex if she had refused or resisted.<\/p>\n<p>For marriage, every potential wife has the right to accept or deny a marriage proposal. The marriage contract is itself a clearly defined legal statement of consent.<\/p>\n<p>Aisha reported: I said, “O Messenger of Allah, should women be asked for their consent before marriage?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ<\/p>\n<p><strong>Yes<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6946, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/wife-consent-nikah\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>As a wife cannot be forced into marriage, she cannot be forced to have sexual relations in a marriage she rejects. But what if a wife refuses lawful sex with her husband after the marriage is already contracted? May he use force to have his way?<\/p>\n<p>While the principle of no harm outlaws such domestic violence, we can infer from other evidence that such permission has not been granted.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ<\/p>\n<p><strong>If a man calls his wife to bed and she refuses <\/strong>(without an excuse)<strong> and he spends the night angry with her, then the angels will curse her until the morning.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3065, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/10\/28\/nikah-huquq-no-harm\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Buhuti commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِلزَّوْجِ الِاسْتِمْتَاعُ بِزَوْجَتِهِ كُلَّ وَقْتٍ عَلَى أَيِّ صِفَةٍ كَانَتْ &#8230; مَا لَمْ يُشْغِلْهَا عَنْ الْفَرَائِضِ أَوْ يَضُرُّهَا فَلَيْسَ لَهُ الِاسْتِمْتَاعُ بِهَا إذَنْ لِأَنَّ ذَلِكَ لَيْسَ مِنْ الْمُعَاشَرَةِ بِالْمَعْرُوفِ وَحَيْثُ لَمْ يَشْغَلْهَا عَنْ ذَلِكَ وَلَمْ يَضُرُّهَا فَلَهُ الِاسْتِمْتَاعُ<\/p>\n<p>A husband has the right to enjoy his wife at any time no matter her circumstances… as long as he does not distract her from her religious obligations or harm her. He may not enjoy her in that case, since that is not living with them &#8216;honorably&#8217; (4:19). If he does not distract her from those duties, nor harm her, then he may enjoy her.<\/p>\n<p>Source: Kashāf al-Qinā’ 5\/188<\/p><\/blockquote>\n<p>If a wife refuses sex with her husband without a good reason, and it causes him to spend the night angry with her, she is subject to moral condemnation by the angels but no allowance is given for him to force himself upon her. She is condemned by the angels if her unwarranted refusal causes her husband distress, but not if her refusal is benign. Scholars have noted that even though she is condemned by the angels, this does not give permission for the husband himself to condemn her.<\/p>\n<p>Ibn Hajar commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا حَدِيثُ الْبَابِ فَلَيْسَ فِيهِ إِلَّا أَنَّ الْمَلَائِكَةَ تَفْعَلُ ذَلِكَ وَلَا يَلْزَمُ مِنْهُ جَوَازُهُ عَلَى الْإِطْلَاقِ<\/p>\n<p>As for the tradition on this topic, there is nothing in it but that the angels do that (cursing). It does not necessitate permission for him in any respect.<\/p>\n<p>Source: Fatḥ al-Bārī 4897<\/p><\/blockquote>\n<p>Implicit in this interpretation is the prohibition of ‘marital rape’ or sexual violence against one’s wife. If it were lawful, one would presume that the Prophet (ṣ) or commentators like Ibn Hajar and Al-Buhuti would have explicitly allowed it as an option when discussing this very scenario. If he may not harm her or even curse her if she refuses to have sex, how then could he assault or rape her?<\/p>\n<p>On the other hand, some scholars said it is also an obligation for a man to reciprocate by fulfilling his wife&#8217;s sexual desires.<\/p>\n<p>Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِأَنَّ النِّكَاحَ شُرِعَ لِمَصْلَحَةِ الزَّوْجَيْنِ وَدَفْعِ الضَّرَرِ عَنْهُمَا وَهُوَ مُفْضٍ إلَى دَفْعِ ضَرَرِ الشَّهْوَةِ عَنْ الْمَرْأَةِ كَإِفْضَائِهِ إلَى دَفْعِ ذَلِكَ عَنْ الرَّجُلِ فَيَجِبُ تَعْلِيلُهُ بِذَلِكَ وَيَكُون النِّكَاحُ حَقًّا لَهُمَا جَمِيعًا<\/p>\n<p>For marriage has been legislated for the welfare of both spouses and to repel harm from them both. It leads to the removal of harmful lusts from the wife, just as that removes it from the husband. Thus, its legal purpose is obligated by that and it is a right for them both in marriage.<\/p>\n<p>Source: al-Mughnī 7\/304<\/p><\/blockquote>\n<p>The matter of concubinage is more troublesome, since a concubine does not necessarily provide written consent to her custodian like a wife does. As noted, Al-Shafi&#8217;i prohibited coerced sex on moral grounds. But what can we infer from the Quran and Sunnah? We must again look for indirect moral indications in the sources to determine if the Prophet (ṣ) would have permitted coerced sex with concubines.<\/p>\n<p>The Quran usually refers to slaves as ‘those whom your right hands possess,’ instead of other Arabic words in use at the time such as <em>‘abd<\/em> or <em>‘abid<\/em> or <em>raqiq<\/em>. This type of phrasing indicated that the master ‘owned’ his slaves (or perhaps more accurately, he was their ‘custodian’), but also that Allah was holding the master responsible for their care and good treatment.<\/p>\n<p>Al-Qurtubi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ مِلْكَ الْيَمِينِ فِي الْعَدْلِ قَائِمٌ بِوُجُوبِ حُسْنِ الْمَلَكَةِ وَالرِّفْقِ بِالرَّقِيق وَأَسْنَدَ تَعَالَى الْمِلْكَ إِلَى الْيَمِينِ إِذْ هِيَ صِفَةُ مَدْحٍ وَالْيَمِينُ مَخْصُوصَةٌ بِالْمَحَاسِنِ لِتَمَكُّنِهَا<\/p>\n<p>The ownership of the right hand, in justice, provides maintenance by obligation of good custodianship and gentleness with slaves. The Almighty attributed ownership to the right hand as it is a praiseworthy attribute, and the right hand specifically has the best qualities to carry it out.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 4:3<\/p><\/blockquote>\n<p>Even the use of the term ‘slave’ was discouraged, instead opting for terms that conveyed a sense of solidarity and familial relationship.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَقُولَنَّ أَحَدُكُمْ عَبْدِي فَكُلُّكُمْ عَبِيدُ اللَّهِ وَلَكِنْ لِيَقُلْ فَتَايَ وَلَا يَقُلْ الْعَبْدُ رَبِّي وَلَكِنْ لِيَقُلْ سَيِّدِي<\/p>\n<p><strong>Do not refer to anyone as ‘my slave,’ for all of you are the slaves of Allah. Rather, you should refer to him as ‘my young man.’ The slave should not refer to anyone as ‘my lord,’ but rather he should refer to him as ‘my master<\/strong>.’<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2414, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/28\/no-servant-called-slave\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Slaves were also described as ‘servants’ (<em>khuddam<\/em>), ‘maid-servants’ (<em>wasifah<\/em>), and other terms that changed the social conception of the institution. The word ‘concubinage’ (<em>al-sirr<\/em>) itself is linguistically related in classical Arabic to ‘marriage’ (<em>al-nikah<\/em>):<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَمَا قَالُوا سُرِّيَّةٌ والأَصل مِنَ السِّر وَهُوَ النِّكَاحُ<\/p>\n<p>As they say ‘a concubine,’ the origin is from the word ‘concubinage,’ which is marriage.<\/p>\n<p>Source: Lisān al-‘Arab 4\/304<\/p><\/blockquote>\n<p>The legal relationship between a master and concubine, which made sexual intercourse lawful, was exclusive to them alone, as if it were a marriage. It was a binding social contract that legalized and regulated sexual activity in the same manner as a marriage contract.<\/p>\n<p>It was not even lawful for a man to engage in sexual intercourse with a slave girl owned by his wife or any other relative, as such a relationship was tantamount to adultery, just as it would be unlawful for him to have intercourse with another relative’s wife.<\/p>\n<p>Habib ibn Salim reported: A man had sexual intercourse with the servant girl of his wife, so the matter was referred to Al-Nu’man ibn Bashir, may Allah be pleased with him. Al-Nu’man said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَقْضِيَنَّ فِيهَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَئِنْ كَانَتْ أَحَلَّتْهَا لَهُ لَأَجْلِدَنَّهُ مِائَةً وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَهُ رَجَمْتُهُ<\/p>\n<p>I will judge him with the judgment of the Messenger of Allah, peace and blessings be upon him. If his wife had given him permission, I will lash him one hundred times. If she did not give him permission, I will stone him to death.<\/p>\n<p>Source: Sunan al-Tirmidhī 1451, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/11\/unlawful-sex-slave-adultery\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Salamah ibn al-Muhabbiq reported: A man had intercourse with the servant girl of his wife, so the matter was referred to the Prophet, peace and blessings be upon him. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ كَانَتْ طَاوَعَتْهُ فَهِيَ لَهُ وَعَلَيْهِ مِثْلُهَا لَهَا وَإِنْ كَانَ اسْتَكْرَهَهَا فَهِيَ حُرَّةٌ وَعَلَيْهِ مِثْلُهَا لَهَا<\/p>\n<p><strong>If she had done so willingly, she belongs to him and he must pay the likes of her price. If he had forced her, she is free and he must pay the likes of her price.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 19556, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/26\/rape-criminal-abuse\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>An insight in this tradition is that the man&#8217;s crime is compounded and his penalty more severe if he had forced his wife&#8217;s slave into sexual intercourse. If the first evil deed is made worse by the second deed, the second deed must be evil in itself. As such, forced intercourse by itself, which is sexual assault, is an immoral action.<\/p>\n<p>Ibn al-Qayyim commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا إذَا اسْتَكْرَهَهَا فَإِنَّ هَذَا مِنْ بَابِ الْمُثْلَةِ فَإِنَّ الْإِكْرَاهَ عَلَى الْوَطْءِ مُثْلَةٌ فَإِنَّ الْوَطْءَ يَجْرِي مَجْرَى الْجِنَايَةِ وَلِهَذَا لَا يَخْلُو عَنْ عُقْرٍ أَوْ عُقُوبَةٍ<\/p>\n<p>As for if he had forced her, then this is a type of abuse as compulsion into sexual intercourse is abuse. Indeed, such intercourse is carried out in the manner of a criminal offence, so for this reason he is not absolved from a fine or legal punishment.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 2\/21<\/p><\/blockquote>\n<p>These narrations demonstrate that it is not simply ownership in itself that legalized sexual relationships with concubines, as if it were merely a matter of property law. Sexual relations were only authorized by custodianship and its accompanying responsibilities of maintenance and good treatment, which served as a legally-binding social contract analogous to a marriage contract.<\/p>\n<p>If a master abused, harmed, or injured his concubine, he would have violated his right to custodianship, the terms of his social contract. He would be required to set her free as a result and be subject to criminal punishment for his abuse.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessing be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِنَّ كَفَّارَتَهُ أَنْ يُعْتِقَهُ<\/p>\n<p><strong>Whoever strikes his slave sharply or slaps him, then the expiation for the sin is to emancipate him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1657, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/26\/hadith-on-freedom-the-expiation-for-the-sin-of-beating-a-slave-is-to-free-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ عُمَرَ بْنَ الْخَطَّابِ رضي الله عنه أَتَتْهُ وَلِيدَةٌ قَدْ ضَرَبَهَا سَيِّدُهَا بِنَارٍ أَوْ أَصَابَهَا بِهَا فَأَعْتَقَهَا<\/p>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, was presented with a servant woman who had been struck by her master with a piece of hot iron or had been injured by it, so he ordered him to emancipate her.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/24\/umar-on-slaves-a-slave-injured-by-their-master-must-be-set-free\/\">al-Muwaṭṭa’ 2\/403<\/a><\/p><\/blockquote>\n<p>Al-Shawkani comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذَهَبَ مَالِكٌ وَالْأَوْزَاعِيُّ وَاللَّيْثُ إلَى عِتْقِ الْعَبْدِ بِذَلِكَ وَيَكُونُ وَلَاؤُهُ لَهُ وَيُعَاقِبُهُ السُّلْطَانُ عَلَى فِعْلِهِ<\/p>\n<p>Malik, Al-Awza’i, and Al-Layth adhered to the opinion that a slave is freed on account of that abuse, he will have his loyalty inheritance, and the authorities will punish the master for what he did.<\/p>\n<p>Source: Nayl al-Awṭār 6\/101<\/p><\/blockquote>\n<p>The key question is this: If a master may not harm or injure his concubine without losing his legal status as master, how then could he possibly rape her? Even small indignities, by comparison, were morally disapproved by the companions. The Caliph Umar once severely rebuked a man who forced his servants to stand while he sat to eat.<\/p>\n<p>Ibn Abbas reported: Umar ibn al-Khattab, may Allah be pleased with him, passed by some people one day who were eating while their servants were standing. Umar said, “Why do I not see your servants eating with you? Do you not desire them?” A man said, “No, by Allah, O leader of the faithful. Rather, we have preference over them.” Umar became very angry, then he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ما لقومٍ يستأثرون على خُدَّامهم فَعَلَ الله تعالى بهم وفَعَلَ<\/p>\n<p>What is the matter with people who prefer themselves over their servants? Allah Almighty will deal with them and it is done!<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/17\/how-you-prefer-yourselves-servants\/\">Musnad al-Fārūq 582<\/a><\/p><\/blockquote>\n<p>It was further recommended for men to either marry their concubines or to give them in marriage to other suitable men, thereby upgrading her social status and ending his legal relationship with her as a concubine. In this way, concubinage was implicitly discouraged by the inverse recommendation to free and marry them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنكِحُوا الْأَيَامَىٰ مِنكُمْ وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ إِن يَكُونُوا فُقَرَاءَ يُغْنِهِمُ اللَّهُ مِن فَضْلِهِ وَاللَّهُ وَاسِعٌ عَلِيمٌ<\/p>\n<p><strong>Marry the unmarried among you and the righteous among your male and female slaves. If they should be poor, Allah will enrich them from His bounty, for Allah is encompassing and knowing.<\/strong><\/p>\n<p>Surat al-Nur 24:32<\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَدَّبَ الرَّجُلُ أَمَتَهُ فَأَحْسَنَ تَأْدِيبَهَا وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا كَانَ لَهُ أَجْرَانِ<\/p>\n<p><strong>If a man teaches his servant girl good manners, educates her in the best manner, then emancipates her and marries her, he will have a double reward.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3262, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/01\/08\/hadith-on-education-double-reward-for-those-who-educate-their-servant-girls-and-marry-them\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The paramount importance that the Prophet (ṣ) placed upon treating concubines well can be seen in the fact that the very last thing he said on his deathbed was to issue a warning about mistreating slaves.<\/p>\n<p>Ali reported: The final statement of the Messenger of Allah, peace and blessings be upon him, was:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّلَاةَ الصَّلَاةَ اتَّقُوا اللَّهَ فِيمَا مَلَكَتْ أَيْمَانُكُمْ<\/p>\n<p><strong>The prayer, the prayer! Fear Allah regarding those whom your right hands possess!<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 5156, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/23\/hadith-on-warning-the-prophets-final-warning-to-the-muslim-nation\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Athir comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُرِيدُ الْإِحْسَانَ إِلَى الرَّقِيقِ وَالتَّخْفِيفَ عَنْهُمْ<\/p>\n<p>He means to treat slaves in the best manner and to lighten their burden.<\/p>\n<p>Source: al-Nihāyah fī Gharīb al-Ḥadīth 4\/358<\/p><\/blockquote>\n<p>The ritual prayer is the most important right due to Allah, and neglecting it is one of the most dangerous forms of sin. Likewise, one of the most dangerous forms of sin against people is to exploit the weak or vulnerable among them, which at the time were slaves and concubines.<\/p>\n<p>To recap, it was unlawful to harm or torture a concubine and to commit such abuse resulted in their freedom, it was discouraged to use archaic and derogatory terms to describe concubines, the mistreatment of concubines was threatened with no less than banishment from Paradise, concubines were entitled to equality with their masters in terms of food and clothing, it was recommended for masters to free and marry their concubines or allow them to marry others, concubinage was more closely analogous in law to marriage than property, and the final warning of the Prophet (ṣ) in his last breath was to be good to concubines and slaves in general. Even the eminent Caliph Umar was incensed by the indignity of observing some servants standing while their masters sat to eat.<\/p>\n<p>In such a moral universe, how could a Muslim then in good conscience coerce a concubine into sex that harmed her emotionally, if not physically?<\/p>\n<p>Yet like the issue of marital rape, we can again infer from another tradition that an incompatible sexual relationship between a master and concubine should have been ended gracefully, not pursued violently.<\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ لَاءَمَكُمْ مِنْ مَمْلُوكِيكُمْ فَأَطْعِمُوهُ مِمَّا تَأْكُلُونَ وَاَكْسُوهُ مِمَّا تَلْبَسُونَ وَمَنْ لَمْ يُلَائِمْكُمْ مِنْهُمْ فَبِيعُوهُ وَلَا تُعَذِّبُوا خَلْقَ اللَّهِ<\/p>\n<p><strong>Whoever is suitable for you among your slaves, then feed them from the same food you eat and clothe them from the same clothes you wear. Whoever is not suitable for you, then sell them off and do not torture the creation of Allah.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 5161, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/04\/23\/hadith-on-servants-do-not-torture-your-slaves-whom-allah-created\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In case a master and concubine cannot form an amicable relationship, he is to sell her to another man who can establish an appropriate relationship with her, with an aim of eventually elevating her social status. In no circumstances may he beat her or ‘torture’ her, physically or emotionally, because he must respect her inherent human dignity as ‘the creation of Allah.’<\/p>\n<p>In sum, Islam has prohibited all forms of sexual violence against women, even if the sexual relationship has a lawful basis. It can be inferred from the Quran and Sunnah that consent was and is an important moral consideration in a healthy and lawful sexual relationship, as was understood by Al-Shafi&#8217;i and others. Consent, as a primary legal requirement, is a distinctly modern phenomenon born out of liberal societies’ abandonment of marriage as the defining pre-condition for lawful sexual intercourse. Transposing this new cultural conception of consent onto pre-modern societies and legal texts has led some writers, including some wayward Muslims, to inaccurately claim that sexual violence is approved by Islam.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;&#8230;he may not touch her, lie with her, or have intercourse with her unless she consents.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[127,16,18,438,437,20,183,49,32,34,38,39,41,43,48,52,100,53,54,134,436,267,73,128],"class_list":["post-19511","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-adultery-zina","tag-character-akhlaq","tag-community-jamaah","tag-compulsion-al-ikraha","tag-concubines-al-surriyyah","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-gentleness-al-rifq","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-justice-adl","tag-love-al-mahabbah","tag-manners-al-adab","tag-marriage-al-nikah","tag-mercy-al-rahmah","tag-paradise-jannah","tag-rape-al-ightisab","tag-slavery-al-istibad","tag-umar-ibn-al-khattab","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-54H","jetpack-related-posts":[{"id":12998,"url":"https:\/\/www.abuaminaelias.com\/islam-and-concubines\/","url_meta":{"origin":19511,"position":0},"title":"What does Islam teach about concubines?","author":"Abu Amina Elias","date":"March 27, 2013","format":false,"excerpt":"\"He may marry from your believing slave girls.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16852,"url":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","url_meta":{"origin":19511,"position":1},"title":"No theology of rape in Islam","author":"Abu Amina Elias","date":"August 20, 2015","format":false,"excerpt":"\"Scholars agree that the rapist must be given legal punishment,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17258,"url":"https:\/\/www.abuaminaelias.com\/marital-rape-domestic-violence\/","url_meta":{"origin":19511,"position":2},"title":"Marital rape and domestic violence in Islamic law","author":"Abu Amina Elias","date":"October 29, 2015","format":false,"excerpt":"\"Live with women honorably.\" (4:19)","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18921,"url":"https:\/\/www.abuaminaelias.com\/secret-marriages-are-forbidden-in-islam\/","url_meta":{"origin":19511,"position":3},"title":"Secret marriages are forbidden in Islam","author":"Abu Amina Elias","date":"February 15, 2018","format":false,"excerpt":"\"This is a secret marriage and I do not permit it.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":19511,"position":4},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19829,"url":"https:\/\/www.abuaminaelias.com\/verse-65-4-child-marriage\/","url_meta":{"origin":19511,"position":5},"title":"Child Marriage in Islam?","author":"Abu Amina Elias","date":"August 13, 2018","format":false,"excerpt":"\"Does verse 65:4 encourage child marriage?\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19511","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19511"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19511\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19511"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}