{"id":19805,"date":"2016-07-04T10:49:09","date_gmt":"2016-07-04T06:49:09","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19805"},"modified":"2025-07-04T14:23:37","modified_gmt":"2025-07-04T10:23:37","slug":"curse-the-graves-of-the-unbelievers","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/curse-the-graves-of-the-unbelievers\/","title":{"rendered":"Curse the Graves of the Unbelievers?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It is not befitting of a Muslim to curse the dead, to disrespect funerals, or to otherwise offend the living with hurtful words about those who have passed away, regardless of the religion of the deceased. Islam teaches us to be kind, merciful, and considerate of other people’s feelings, and even more so when it comes to an event as emotionally painful as someone losing their life.<\/p>\n<p>That said, some inauthentic narrations attributed to the Prophet ﷺ have been cited by anti-Muslim activists, as well as some Muslims, to promote hatred between Muslims and others. These Hadith are weak at best, not to mention that they contradict other established principles.<\/p>\n<p>It is alleged that the Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا مَرَرْتُمْ بِقُبُورِنَا وَقُبُورِكُمْ مِنْ أَهْلِ الْجَاهِلِيَّةِ فَأَخْبِرُوهُمْ أَنَّهُمْ فِي النَّارِ<\/p>\n<p>If you pass by our graves and your graves from the people of ignorance, then inform them that they are in Hellfire.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 847<\/p><\/blockquote>\n<p>This tradition is &#8216;very weak&#8217; according to Shaykh al-Aran’ut in his verification of Sahih Ibn Hibban:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إسناده ضعيف جداً الحارث بن سريج قال ابن معين ليس شيء وقال النسائي ليس بثقة وقال ابن عدي ضعيف يسرق الحديث<\/p>\n<p>Its chain is very weak due to the narrator Al-Harith ibn Surayj. Ibn Ma’in said he is nothing. Al-Nasa’i said he is not reliable. Ibn ‘Adi said he is weak and dishonest in narrating.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3\/127<\/p><\/blockquote>\n<p>A similar Hadith from a different chain states:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَيْثُمَا مَرَرْتَ بِقَبْرِ كَافِرٍ فَبَشِّرْهُ بِالنَّارِ<\/p>\n<p>Whenever you pass by the grave of an unbeliever, then give him glad tidings of Hellfire.<\/p>\n<p>Source: Sunan Ibn Mājah 1573<\/p><\/blockquote>\n<p>The chain of this narration was judged to be &#8216;disconnected&#8217; (<em>mursal<\/em>) by Ibn Abi Hatim in <em>‘Ilal al-Hadith<\/em> 5\/692-693 and Al-Daraqutni in <em>al-‘Ilal <\/em>4\/334. Any disconnected narration is by definition weak and cannot be used by itself to established a rule in Islam. It was also stated by Ibn Kathir in <em>al-Bidayah wal-Nihayah<\/em> 3\/427 that the tradition was “unusual” (<em>gharib<\/em>). The other scholars who authenticated these traditions made an error, and Allah knows best.<\/p>\n<p>Perhaps the strongest indication that these Hadith are inauthentic is that the vast majority of scholars did not act upon them or incorporate them into their books of jurisprudence. It is authentically established that it is permissible to visit the graves of non-Muslims and to weep for them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, visited the grave of his mother and he wept and made others around him weep. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَأْذَنْتُ رَبِّي فِي أَنْ أَسْتَغْفِرَ لَهَا فَلَمْ يُؤْذَنْ لِي وَاسْتَأْذَنْتُهُ فِي أَنْ أَزُورَ قَبْرَهَا فَأُذِنَ لِي فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُ الْمَوْتَ<\/p>\n<p><strong>I asked my Lord for permission to seek forgiveness for her and He did not give me permission, then I asked my Lord for permission to visit her grave and He gave me permission, so visit the graveyards. Verily, it is a reminder of death<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 976, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/11\/hadith-on-graves-permission-to-visit-graves-as-a-reminder-of-death-and-the-hereafter\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Many scholars understood from this tradition that the mother of the Prophet ﷺ died as an idolater, and for that reason he was not allowed to ask for her forgiveness. Some dispute this interpretation, but nevertheless it was interpreted by many as permission to visit the graves of non-Muslims.<\/p>\n<p>The extent of the juristic discussion around visiting of the graves of non-Muslims was whether it was permissible at all and what types of statements are permissible in the presence of the grave.<\/p>\n<p>The Kuwaiti Encyclopedia of Islamic Law sates:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذَكَرَ الشَّافِعِيَّةُ وَالْحَنَابِلَةُ أَنَّ زِيَارَة قَبْرِ الْكَافِرِ جَائِزَةٌ وَقَال الْمَاوَرْدِيُّ تَحْرُمُ زِيَارَةُ قَبْرِ الْكَافِرِ قَال الْحَنَابِلَةُ وَلاَ يُسَلِّمُ مَنْ زَارَ قَبْرَ كَافِرٍ عَلَيْهِ وَلاَ يَدْعُو لَهُ بِالْمَغْفِرَةِ<\/p>\n<p>The Shafi’i and Hanbali scholars mentioned that it is permissible to visit the grave of an unbeliever. Al-Mawardi said it is forbidden to visit the grave of an unbeliever. The Hanbali scholars said one does not greet the grave of the unbeliever with peace, nor supplicate for him to be forgiven.<\/p>\n<p>Source: al-Mawsū’ah al-Fiqhīyah al-Kuwatīyah 24\/89<\/p><\/blockquote>\n<p>It is customary for a Muslim to greet the grave of another Muslim with peace and to supplicate to Allah for their forgiveness. In respect of the Islamic tradition, this is not done in the presence of non-Muslim graves. But this does not preclude us from expressing sadness, saying other kind words, comforting others, or at least maintaining a respectful silence.<\/p>\n<p>Moreover, the established texts and corresponding rules in Islam contradict the the two weak Hadith previously mentioned. It is generally not permissible to speak badly about the dead, especially if this is insensitive to others. If anything is said about the deceased, it should only be about their good qualities.<\/p>\n<p>Aisha reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَسُبُّوا الْأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا<\/p>\n<p><strong>Do not abuse the dead, for they have reached what they put forward.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1329, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/03\/22\/do-not-abuse-the-dead\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet ﷺ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَسُبُّوا الْأَمْوَاتَ فَتُؤْذُوا الْأَحْيَاءَ<\/p>\n<p><strong>Do not abuse the dead and thus hurt the living.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1982, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/07\/03\/do-not-curse-the-dead\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet ﷺ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اذْكُرُوا مَحَاسِنَ مَوْتَاكُمْ وَكُفُّوا عَنْ مَسَاوِيهِمْ<\/p>\n<p><strong>Mention what is good about your dead and refrain from speaking about their evil.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1019, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/07\/03\/janazah-speak-good-silent\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-San’ani commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">النهي عن سبِّ الْأَمْوَاتِ عَامٌّ لِلْكَافِرِ وَغَيْرِهِ<\/p>\n<p>The prohibition of insulting the dead is general, including unbelievers or others.<\/p>\n<p>Source: Subul al-Salām Sharḥ Bulūgh al-Marām 4\/677<\/p><\/blockquote>\n<p>And Shaykh Ibn ‘Uthaymeen commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما لعنه يعني كافراً بعد موته أيجوز أم لا يجوز فقد يقال إنه لا يجوز لقول النبي صلى الله عليه وسلم لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا وهذا عام ثم إنه قد يثير ضغائن وأحقاد من أقاربه وأصحابه وأصدقائه فيكون في ذلك مفسدة ثم إن النبي صلى الله عليه وسلم قال من كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت وأيّ خير في كونك تلعن واحداً كافراً قد مات<\/p>\n<p>As for cursing an unbeliever after his death, is it permissible or not? It may be said that it is not permissible, based on the saying of the Prophet, peace and blessings be upon him, ‘<strong>Do not abuse the dead, for they have reached what they put forward.<\/strong>’ This is general. Then it may stir up grudges and hatred from his relatives, companions, and friends, and that would be harmful. Then the Prophet said, ‘<strong>Whoever has faith in Allah and the Last Day, let him speak goodness or remain silent.<\/strong>’ What good is there in your cursing an unbeliever who has died?<\/p>\n<p>Source: Tafsīr al-&#8216;Uthaymīn 2\/192<\/p><\/blockquote>\n<p>And the Shaykh said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يجوز لعن الكافر المعين إذا كان حياً لكن بعد موته هل يلعن هذا قد يقال إنه لا يلعن بعد الموت &#8230; لكن إذا كان له مبدأ معين كشيوعي يدعو للشيوعية أو نصراني يدعو للنصرانية فهنا نبين ضلاله ونحذر منه أما لعنه فلا فائدة منه لأنه هو كافر مات على الكفر ملعون ما يحتاج ذلك<\/p>\n<p>It is not permissible to curse an unbeliever by name while he is alive, but after his death, may he be cursed? It may be said that he is not cursed after death&#8230; but if he has a specific doctrine, such as a Communist who calls for Communism or a Christian who calls for Christianity, then here we may clarify his misguidance and warn against him. As for cursing him, there is no benefit in that because he is an unbeliever who died in unbelief, he is already cursed and that is not needed.<\/p>\n<p>Source: Liqā’ al-Bāb al-Maftūḥ 166\/19<\/p><\/blockquote>\n<p>The Prophet ﷺ would also respect the funerals of non-Muslims by standing while the bier was passing by. He would not say anything disrespectful to hurt the feelings of those who lost a loved one.<\/p>\n<p>Qays ibn Sa’d reported: A funeral passed by the Messenger of Allah, peace and blessings be upon him, and he stood up. It was said to him, “It is a Jew.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَيْسَتْ نَفْسًا<\/p>\n<p><strong>Was he not a soul?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1250, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/30\/the-prophet-stood-up-for-the-funeral-of-a-jew-out-of-respect-for-his-humanity\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Some scholars derived from this and other narrations that it is recommended to stand for funerals, even for non-Muslims.<\/p>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ أَحْمَدُ وَإِسْحَاقُ وَابْنُ حَبِيبٍ وَابْنُ الْمَاجِشُونِ الْمَالِكِيَّانِ هُوَ مُخَيَّرٌ<\/p>\n<p>Ahmad, Ishaq, Ibn Habib, and Ibn Majishun, the two Maliki scholars, said standing is preferred.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 7\/37<\/p><\/blockquote>\n<p>Under no circumstances at all should a Muslim taunt or curse specific people by name, whether they are dead or alive.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْمُؤْمِنُ بِالطَّعَّانِ وَلَا اللَّعَّانِ وَلَا الْفَاحِشِ وَلَا الْبَذِيءِ<\/p>\n<p><strong>The believer does not insult others, he does not curse others, he is not vulgar, and he is not shameless.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1977, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/06\/09\/believers-curse-taunt-abuse\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Lastly, to “inform” a non-Muslim in their grave that they are in Hellfire is incorrect because it is presumes we know specific matters of the Unseen. Rather, Allah knows best who is in Paradise or Hellfire, and our opinions and judgments do nothing to change their fate.<\/p>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, raised his head from the last bowing in dawn prayer, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ الْعَنْ فُلَانًا وَفُلَانًا وَفُلَانًا<\/p>\n<p><strong>O Allah, curse this person, and this person, and this person.<\/strong><\/p><\/blockquote>\n<p>Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ لَكَ مِنَ ٱلْأَمْرِ شَىْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَـٰلِمُونَ<\/p>\n<p><strong>You have no say in the matter. It is up to Allah to turn to them in mercy or punish them, for they are surely wrongdoers.<\/strong> (3:128)<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4559, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/29\/cursing-by-name-laan\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Shaykh al Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَنْصُوصُ عَنْ أَحْمَدَ الَّذِي قَرَّرَهُ الْخَلَّالُ اللَّعْنُ الْمُطْلَقُ الْعَامُّ لَا الْمُعَيَّنُ كَمَا قُلْنَا فِي نُصُوصِ الْوَعِيدِ وَالْوَعْدِ وَكَمَا نَقُولُ فِي الشَّهَادَةِ بِالْجَنَّةِ وَالنَّارِ فَإِنَّا نَشْهَدُ بِأَنَّ الْمُؤْمِنِينَ فِي الْجَنَّةِ وَأَنَّ الْكَافِرِينَ فِي النَّارِ وَنَشْهَدُ بِالْجَنَّةِ وَالنَّارِ لِمَنْ شَهِدَ لَهُ الْكِتَابُ وَالسُّنَّةُ وَلَا نَشْهَدُ بِذَلِكَ لِمُعَيَّنٍ إِلَّا مَنْ شَهِدَ لَهُ النَّصُّ أَوْ شَهِدَ لَهُ الِاسْتِفَاضَةُ عَلَى قَوْلٍ &#8230; وَكَلَامُ الْخَلَّالِ يَقْتَضِي أَنَّهُ لَا يَلْعَنُ الْمُعَيَّنِينَ مِنْ الْكُفَّارِ<\/p>\n<p>It is explicit from Ahmad, which was confirmed by Al-Khallal, that unconditional cursing can only be done in a generalized way and not against a specific person. As we say regarding the texts warning of Hellfire and promising Paradise, and as we say regarding witnessing if one is in Paradise or Hellfire. For we bear witness that the believers are in Paradise and the unbelievers are in Hellfire, and we bear witness to Paradise and Hellfire for whomever it was testified by the Book and the Sunnah. Yet we cannot testify that for any specific person unless it is testified by a divine text, or it is witnessed by an overwhelming abundance of their statements&#8230; The discourse of Al-Khallal necessitates that unbelievers are not cursed by name.<\/p>\n<p>Source: al-Ādāb al-Shar’īyah 1\/272<\/p><\/blockquote>\n<p>Hence, a Muslim may curse unbelief, sin, and injustice in general terms but without cursing a specific person by name. In the same way, a Muslim knows that believers enter Paradise and unbelievers enter Hellfire in general, but that the ultimate decision belongs to Allah in the Unseen. We cannot make that judgment about any specific person and to do so is to presume about Allah.<\/p>\n<p>We can only judge their outward actions and statements, but perhaps Allah may grant a subtle excuse to a non-Muslim that we could never imagine. The scholars have acknowledged that such exceptions to the general rule are possible.<\/p>\n<p>Imam al-Ghazali writes:<\/p>\n<blockquote>\n<p align=\"right\">إن الرحمة تشمل كثيرا من الأمم السالفة وإن كان أكثرهم يعرضون على النار إما عرضة خفيفة حتى في لحظة أو في ساعة وإما في مدة حتى يطلق عليهم اسم بعث النار بل أقول إن أكثر نصارى الروم والترك في هذا الزمان تشملهم الرحمة إن شاء الله تعالى … بل سمعوا أيضا منذ الصبا أن كذابا ملبسا اسمه محمد ادعى النبوة<\/p>\n<p>I say that Allah’s mercy will encompass many bygone communities as well, even if most of them may be briefly exposed to the Hellfire for a second or an hour or some period of time, by virtue of which they earn the title “party of the Hellfire.” I would say, Allah willing, most Christians of Byzantium and the Turks of this age will be covered by Allah’s mercy… All they have heard since childhood was that some great liar carrying the name Muhammad claimed to be a prophet.<\/p>\n<p>Source: Fayṣal al-Tafriqah 12<\/p><\/blockquote>\n<p>In sum, the two Hadith about &#8216;giving glad tidings&#8217; and &#8216;informing&#8217; non-Muslims in their graves that they are in Hellfire are weak and inauthentic. Most scholars did not act upon them and they contradict the teachings of Islamic etiquette in terms of respecting funerals and human grief. Muslims must acts upon the best manners as confirmed by the Quran and Sunnah, rather than indulge in acts that may, or may not, be merely permissible according to some scholars.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not abuse the dead and thus hurt the living.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[262,342,135,32,39,41,43,100,134],"class_list":["post-19805","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-death-mawt","tag-al-fiqh","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-manners-al-adab","tag-paradise-jannah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-59r","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":19805,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":19805,"position":1},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15738,"url":"https:\/\/www.abuaminaelias.com\/muslims-not-punished-for-killing-non-muslims\/","url_meta":{"origin":19805,"position":2},"title":"Muslims not punished for killing non-Muslims?","author":"Abu Amina Elias","date":"May 28, 2014","format":false,"excerpt":"\"The general rule is that all crimes should be prosecuted and punished equally,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":19805,"position":3},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14966,"url":"https:\/\/www.abuaminaelias.com\/hijab-niqab-standards\/","url_meta":{"origin":19805,"position":4},"title":"Must a Muslim woman cover her face?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Tell the believing women to lower their gaze...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14171,"url":"https:\/\/www.abuaminaelias.com\/islam-forbids-violent-rebellion\/","url_meta":{"origin":19805,"position":5},"title":"Non-Violent Reform of Unjust Muslim Rulers","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"You should listen and obey, even if they strike your back.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19805","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19805"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19805\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19805"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19805"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19805"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}