{"id":19852,"date":"2016-07-04T10:48:27","date_gmt":"2016-07-04T06:48:27","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19852"},"modified":"2025-07-04T11:04:19","modified_gmt":"2025-07-04T07:04:19","slug":"what-happened-at-dhul-khalasah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/what-happened-at-dhul-khalasah\/","title":{"rendered":"What happened at Dhul Khalasah?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam prohibits any military attack against peaceful people, especially women, children, and civilians. The principles of just war are expressed in numerous places in the Quran and Sunnah and classical jurisprudence, and they continue to be upheld in mainstream Islam today. This fact must be appreciated when interpreting the large body of hadith traditions, which are sometimes recorded in truncated form without the larger context.<\/p>\n<p>One incident that has been used to misrepresent Islam is a tradition related to the conflict with the tribe of Daws and their idolatrous temple known as Dhul Khalasah. The Prophet (s) ordered the temple to be destroyed due to their persistent hostility to Islam and attempt to undermine monotheism on the Arabian peninsula.<\/p>\n<p>Jarir ibn Abdullah reported: In the time of ignorance, there was a house named Dhul Khalasah and it was claimed it was the Ka’bah of Yemen. The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ أَنْتَ مُرِيحِي مِنْ ذِي الْخَلَصَةِ<\/p>\n<p><strong>Will you relieve me of Dhul Khalasah?<\/strong><\/p><\/blockquote>\n<p>Jarir said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَنَفَرْتُ إِلَيْهِ فِي مِائَةٍ وَخَمْسِينَ مِنْ أَحْمَسَ فَكَسَرْنَاهُ فَكَسَرْنَاهُ وَقَتَلْنَا مَنْ وَجَدْنَا عِنْدَهُ<\/p>\n<p>I rode to it with one hundred and fifty men from the tribe of Ahmas and we tore it down and killed whoever we found there.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2476, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>The narrators of this tradition would have been familiar with the names mentioned and their unstated details. Two important pieces of context help us see the larger picture of this event: Why was the military attack justified and were civilians killed in the battle?<\/p>\n<p>Jarir’s statement “we killed whoever we found there” is not an absolute statement. Implied in this particular phrase is that combatants were killed as necessary, not that literally everyone there was killed. It is well known that the Prophet (s) would warn his military deputies to fear Allah, which is to say fear committing acts of injustice, and specifically to avoid harming civilians and non-combatants.<\/p>\n<p>Buraydah reported: If the Messenger of Allah, peace and blessings be upon him, sent a commander to the army, he would enjoin him personally to fear Allah and to be good to the Muslims who were with him, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اغْزُوا بِسْمِ اللَّهِ وَفِي سَبِيلِ اللَّهِ قَاتِلُوا مَنْ كَفَرَ اغْزُوا وَلَا تَغُلُّوا وَلَا تَغْدِرُوا وَلَا تُمَثِّلُوا وَلَا تَقْتُلُوا وَلِيدًا<\/p>\n<p><strong>Go forth in the name of Allah and in the way of Allah. Fight against those who deny. Go forth and do not plunder, do not commit treachery, do not mutilate, and do not kill children.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1408, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/16\/hadith-on-jihad-the-prophet-enjoined-honorable-conduct-during-war-and-he-forbade-stealing-treachery-mutilation-and-killing-innocents\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْطَلِقُوا بِاسْمِ اللَّهِ وَبِاللَّهِ وَعَلَى مِلَّةِ رَسُولِ اللَّهِ وَلَا تَقْتُلُوا شَيْخًا فَانِيًا وَلَا طِفْلًا وَلَا صَغِيرًا وَلَا امْرَأَةً وَلَا تَغُلُّوا وَضُمُّوا غَنَائِمَكُمْ وَأَصْلِحُوا وَأَحْسِنُوا إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ<\/p>\n<p><strong>Go forward in the name of Allah, with Allah, and upon the religion of the Messenger of Allah. Do not kill the elderly, children, young people, or women. Do not steal from the spoils but collect them, and behave righteously and in the best manner. Verily, Allah loves those who behave in the best manner.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2608, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/21\/hadith-on-jihad-the-prophet-ordered-his-army-to-protect-civilians-and-reconcile-with-the-enemy\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ امْرَأَةً وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ<\/p>\n<p>A woman was found killed in one of the battles of the Messenger of Allah, peace and blessings be upon him, so the Messenger of Allah condemned the killing of women and children.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2851, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/hadith-on-jihad-the-prophet-condemned-the-killing-of-women-children-and-those-who-do-not-fight\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تَغُلُّوا وَلا تَغْدِرُوا وَلا تُمَثِّلُوا وَلا تَقْتُلُوا وَلِيدًا وَاتَّقُوا اللَّهَ فِي الْفَلاحِينَ الَّذِينَ لا يَنْصُبُونَ لَكُمُ الْحَرْبَ<\/p>\n<p>Do not steal the spoils, do not be treacherous with the enemy, do not mutilate the dead, do not kill children, and fear Allah regarding the farmers who do not wage war against you.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/03\/umar-on-war-fear-allah-regarding-children-and-civilian-non-combatants\/\">Sunan Sa’īd ibn Mansūr 2466<\/a><\/p><\/blockquote>\n<p>And Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> لَا تَقْتُلُوا النِّسَاءَ وَلَا الصِّبْيَانَ وَلَا الشَّيْخَ الْكَبِيرَ وَلَا مَنْ أَلْقَى إِلَيْكُمُ السَّلَمَ وَكَفَ يَدَهُ فَإِنْ فَعَلْتُمْ هَذَا فَقَدَ اعْتَدَيْتُمْ<\/p>\n<p>Do not kill women, children, old men, or whoever comes to you with peace and he restrains his hand from fighting, for if you did so you would have certainly transgressed.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/18\/ibn-abbas-on-transgression-do-not-kill-women-children-old-men-or-anyone-who-refuses-to-fight-you\/\">Tafsīr al-Ṭabarī 2:190<\/a><\/p><\/blockquote>\n<p>Many traditions of this nature establish the principle that civilians, non-combatants, and surrendering soldiers may not be harmed in battle. Jurists and commentators on the tradition of Jarir never understood his statement to mean it is permissible to kill these protected classes of people. Indeed, not even terrorists who claim to be Muslims use the statement of Jarir to justify their misdeeds, instead relying on another train of distorted logic.<\/p>\n<p>Furthermore, the idols at Dhul Khalasah belonged to the tribe of Daws, among others, who was hostile to Islam and was attempting to rival the Ka’bah at Mecca with their idolatrous religion.<\/p>\n<p>Abu Huraira, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذُو الْخَلَصَةِ طَاغِيَةُ دَوْسٍ الَّتِي كَانُوا يَعْبُدُونَ فِي الْجَاهِلِيَّةِ<\/p>\n<p>Dhul Khalasah was an idol of the tribe of Daws which they worshipped in the time of ignorance.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6699, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>The people of Dhul Khalasah referred to their temple as the “Ka’bah of Yemen,” a direct challenge to the holiest site in Islam. The very presence of Muslims worshipping one God in Mecca was an affront to their gods. Daws was also known to be a hostile tribe steeped in the pre-Islamic culture of tribalism, blood feuds, violence, and vengeance.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِمَّنْ أَنْتَ<\/p>\n<p><strong>Who are you from?<\/strong><\/p><\/blockquote>\n<p>I said, “I am from the tribe of Daws.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كُنْتُ أَرَى أَنَّ فِي دَوْسٍ أَحَدًا فِيهِ خَيْرٌ<\/p>\n<p><strong>I have not seen anyone from the tribe of Daws with good in him.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3838, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Despite this, the Prophet (s) refused to condemn the tribe of Daws as a whole and he encouraged his companions to invite them to Islam in a gentle manner.<\/p>\n<p>Abu Huraira reported: The companions said, “O Messenger of Allah, the tribe of Daws has disbelieved and rejected you, so pray to Allah against them.” And it was said, “May the tribe of Daws be destroyed!” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ<\/p>\n<p><strong>O Allah, guide the tribe of Daws and bring them to me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4131, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/hadith-on-guidance-the-prophet-supplicates-to-guide-the-unbelievers-not-destroy-them\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said to them:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ارْجِعْ إِلَى قَوْمِكَ فَادْعُهُمْ إِلَى اللَّهِ وَارْفُقْ بِهِمْ<\/p>\n<p><strong>Return to your people and invite them to Allah, and be gentle with them.<\/strong><\/p>\n<p>Source: Tārīkh Dimashq 24591<\/p><\/blockquote>\n<p>Al-Qari comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ بِوُقُوعِ الْعَذَابِ فَظَنَّ النَّاسُ أَنَّهُ يَدْعُو عَلَيْهِمْ فَقَالَ أَيْ لِكَوْنِهِ رَحْمَةً لِلْعَالَمِينَ وَهُدًى لِلنَّاسِ اللَّهُمَّ اهْدِ دَوْسَا وَائْتِ بِهِمْ<\/p>\n<p>Meaning, the companions wanted them to be punished. The people thought that the Prophet would supplicate against them, but he said, because of his existence as mercy for the worlds and a guide for people, ‘O Allah, guide the tribe of Daws and bring them to me.’<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 6005<\/p><\/blockquote>\n<p>From this we can understand that the Prophet (s) had benevolent intentions towards the tribe of Daws, even though they had malicious intentions towards Islam and Muslims. He ordered the attack on Dhul Khalasah near the end of his life after giving the tribe of Daws many years to hear the message of Islam, without sanctioning violence against their civilians and only as a last resort to secure the right of Muslims to practice monotheism in Arabia.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O Allah, guide the tribe of Daws and bring them to me.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[61,49,37,47,48,54,62,220,121,73,98],"class_list":["post-19852","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-call-to-islam-dawah","tag-gentleness-al-rifq","tag-idolatry-shirk","tag-jihad","tag-justice-adl","tag-mercy-al-rahmah","tag-prophetic-biography-sirah","tag-supplication-al-dua","tag-terrorism-al-irhab","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5ac","jetpack-related-posts":[{"id":14735,"url":"https:\/\/www.abuaminaelias.com\/blessings-ten-days-dhul-hijjah\/","url_meta":{"origin":19852,"position":0},"title":"Blessings of the first ten days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 14, 2013","format":false,"excerpt":"\"No days more beloved to Allah than these ten days,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":19852,"position":1},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21323,"url":"https:\/\/www.abuaminaelias.com\/where-wall-yajuj-majuj\/","url_meta":{"origin":19852,"position":2},"title":"Where is the wall of Gog and Magog?","author":"Abu Amina Elias","date":"September 27, 2019","format":false,"excerpt":"\"When the promise of my Lord comes, He will make it level.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16523,"url":"https:\/\/www.abuaminaelias.com\/blessed-are-the-strangers-in-islam\/","url_meta":{"origin":19852,"position":3},"title":"Blessed are the strangers in Islam","author":"Abu Amina Elias","date":"April 10, 2015","format":false,"excerpt":"\"Be in this world as if you were a stranger or a traveler along a path.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18845,"url":"https:\/\/www.abuaminaelias.com\/are-arabs-master-race-in-islam\/","url_meta":{"origin":19852,"position":4},"title":"Are Arabs the master race in Islam?","author":"Abu Amina Elias","date":"February 4, 2018","format":false,"excerpt":"\"There is no favor of an Arab over a foreigner,\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20713,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-ten-days-of-dhul-hijjah\/","url_meta":{"origin":19852,"position":5},"title":"Imam al-Mundhiri on First Ten Days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"Not even jihad in the way of Allah,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19852","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19852"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19852\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19852"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19852"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19852"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}