{"id":19931,"date":"2018-11-21T23:02:08","date_gmt":"2018-11-21T19:02:08","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=19931"},"modified":"2020-08-16T19:26:06","modified_gmt":"2020-08-16T15:26:06","slug":"are-harsh-insults-and-profanity-allowed-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/are-harsh-insults-and-profanity-allowed-in-islam\/","title":{"rendered":"Harsh insults and profanity allowed in Islam?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam counsels us to follow a better path when people insult us by not responding to them in the same manner, but rather to respond to their evil with good. Gentleness and forbearance are the general rules we need to follow in most situations. But, like most rules, there are a few exceptions when harsh words are warranted.<\/p>\n<p>The general rule (<em>al-asl<\/em>) is established by a report in which the Prophet (s) was insulted and mocked to his face but he responded with forbearance.<\/p>\n<p>Aisha reported: A group of Jews asked permission to visit the Prophet and when they were admitted, they said, “Death be upon you!” I said to them, “Rather, death and the curse of Allah be upon you!” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الْأَمْرِ كُلِّهِ<\/p>\n<p><strong>O Aisha, Allah is gentle and he loves gentleness in all matters.<\/strong><\/p>\n<\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَإِيَّاكِ وَالْعُنْفَ وَالْفُحْشَ<\/p>\n<p><strong>Beware of harsh and profane words.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6528, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/16\/allah-is-kind-and-loves-kindness\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>The Prophet (s) had the power to take revenge for this personal insult but he chose not to do so. Instead, he used the incident as a teaching moment to demonstrate the importance of gentleness in speech.<\/p>\n<p>There are many texts in Islam which command us to use the best words when speaking to others and not to resort to insults, name-calling, and harshness. This is even more important to appreciate when speech is magnified by the internet.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَقُولُوا لِلنَّاسِ حُسْنًا<\/p>\n<p><strong>And speak to people in the best manner.<\/strong><\/p>\n<p>Surat al-Baqarah 2:83<\/p>\n<\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مِّن قَوْمٍ عَسَىٰ أَن يَكُونُوا خَيْرًا مِّنْهُمْ وَلَا نِسَاءٌ مِّن نِّسَاءٍ عَسَىٰ أَن يَكُنَّ خَيْرًا مِّنْهُنَّ ۖ وَلَا تَلْمِزُوا أَنفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ ۖ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ ۚ وَمَن لَّمْ يَتُبْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ<\/p>\n<p><strong>O you who have faith, let not people ridicule another people; perhaps they are better than them. Neither let women ridicule other women; perhaps they are better than them. Do not insult each other, nor mock each other with nicknames. Wretched is the accusation of wickedness after faith, and whoever does not repent has done wrong.<\/strong><\/p>\n<p>Surat al-Hujurat 49:11<\/p>\n<\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">لَيْسَ الْمُؤْمِنُ بِالطَّعَّانِ وَلَا اللَّعَّانِ وَلَا الْفَاحِشِ وَلَا الْبَذِيءِ<\/p>\n<p><strong>The believer does not taunt others, he does not curse others, he does not use profanity, and he does not abuse others.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1977, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/09\/hadith-on-abuse-a-true-believer-does-not-curse-taunt-or-abuse-other-people\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ<\/p>\n<p><strong>Verily, the most hated man to Allah is the one who is fiercest in argument.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2668, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/19\/do-not-argue-harshly\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>It is even prohibited to curse the idols and religions of unbelievers if that would provoke unnecessary and hostile reciprocation from them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَلَا تَسُبُّوا الَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدْوًا بِغَيْرِ عِلْمٍ<\/p>\n<p><strong>Do not curse those they invoke besides Allah, lest they insult Allah in hostility without knowledge.<\/strong><\/p>\n<p>Surat al-An’am 6:108<\/p>\n<\/blockquote>\n<p>Hence, it usually most appropriate for Muslims to use kind, gentle, and measured words in ordinary situations, especially in today’s age when words are beamed around the world at light speed. There are literally <a href=\"https:\/\/yaqeeninstitute.org\/en\/mohammad-elshinawy\/how-the-prophet-muhammad-%EF%B7%BA-rose-above-enmity-and-insult\/\">dozens and dozens of examples<\/a> like these in the Sunnah.<\/p>\n<p>Nevertheless, there are some situations when harsh speech is necessary to defend the truth or the rights of the innocent. These are <em><u>exceptions<\/u><\/em> to the general rule. For instance, the Prophet (s) appointed Hassan to satirize the idolatry of Islam’s enemies.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ لِحَسَّانَ مِنْبَرًا فِي الْمَسْجِدِ فَيَقُومُ عَلَيْهِ يَهْجُو مَنْ قَالَ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would set up a pulpit in the mosque for Hassan and he would stand on it and satirize whoever spoke badly of the Messenger of Allah.<\/p>\n<p>Source: Sunan Abī Dāwūd&nbsp;5015, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/17\/hadith-on-angels-the-holy-spirit-is-with-hassan-as-long-as-he-defends-the-prophet\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا حَسَّانُ اهْجُ الْمُشْرِكِينَ فَإِنَّ جِبْرِيلَ مَعَكَ<\/p>\n<p><strong>O Hassan, satirize the idolaters. Verily, Gabriel is with you<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 18203, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/17\/hadith-on-satire-o-hassan-gabriel-is-with-you\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>This is a concession granted in the extraordinary situation the Muslims experienced at the time. In Medina, they were under constant physical threat from the Meccans and their allies. Hassan’s satirical poetry, which was delivered to a primarily Muslim audience (not over the world-wide web), was meant to strengthen their convictions and boost their confidence by exposing the faults of idolatry.<\/p>\n<p>Even so, the Prophet (s) warned us against transgressing the acceptable use of satire by disparaging entire tribes and groups of people with <em>blanket statements<\/em>.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إِنَّ أَعْظَمَ النَّاسِ فِرْيَةً لَرَجُلٌ هَاجَى رَجُلًا فَهَجَا الْقَبِيلَةَ بِأَسْرِهَا<\/p>\n<p><strong>Verily, the most&nbsp;slanderous among people is a man who censures another man by satirizing the entire tribe.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3761, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/22\/hadith-on-poetry-the-worst-criminal-is-a-poet-who-attacks-an-entire-tribe-or-who-disowns-his-family\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>As such, satire has its limits even as an exception and should not be indulged in without justification and moderation.<\/p>\n<p>In another incident, one of the senior companions used a particularly harsh phrase against an idolater in the midst of a confrontation.<\/p>\n<p>During the war with the Meccans, the Muslims were mostly on the defensive and, as was Arab custom, they wanted to utilize the sanctity of Mecca to perform the lesser pilgrimage. This culminated in the treaty of Hudaybiyyah, which was a ten-year peace treaty between the Muslims and the idolaters.<\/p>\n<p>In this tense negotiation, ‘Urwah ibn Mas’ud (who later became a Muslim) mocked the Muslims by claiming they were undignified and would abandon the Prophet (s) if exposed to danger. Abu Bakr, may Allah be pleased with him, was understandably upset by this and he responded with a well-known Arabic expression:<\/p>\n<blockquote>\n<p style=\"text-align: right\">امْصُصْ بَظْرَ اللاَّتِ أَنَحْنُ نَفِرُّ عَنْهُ وَنَدَعُهُ<\/p>\n<p>Suck the genitals of al-Lat! Would we flee from him and leave?<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2583, Grade: <strong><em>Sahih<\/em><\/strong><\/p>\n<\/blockquote>\n<p>Ibn Hajar comments on this incident, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَكَانَتْ عَادَةُ الْعَرَبِ الشَّتْمُ بِذَلِكَ لَكِنْ بِلَفْظِ الْأُمِّ فَأَرَادَ أَبُو بَكْرٍ الْمُبَالَغَةَ فِي سَبِّ عُرْوَةَ بِإِقَامَةِ مَنْ كَانَ يَعْبُدُ مَقَامَ أُمِّهِ وَحَمَلَهُ عَلَى ذَلِكَ مَا أَغْضَبَهُ بِهِ مِنْ نِسْبَةِ الْمُسْلِمِينَ إِلَى الْفِرَارِ<\/p>\n<p>It was the customs of Arabs to revile each other that way, but by using the word ‘mother’ instead. Abu Bakr intended to use exaggerated rhetoric in his condemnation of ‘Urwah, so he put the idol he worshiped in place of his mother. He was compelled to do that because he was angered by the cowardice that had been attributed to the Muslims.<\/p>\n<p>Source: Fatḥ al-Bārī 2583<\/p>\n<\/blockquote>\n<p>In this specific situation, Abu Bakr was so angered and the circumstances so high-stress that he responded with a harsh phrase that was common in Arab poetry. It was not considered especially vulgar, although it loses something in the translation. The Prophet (s) did not command him to say it, but he did not publicly rebuke him either.<\/p>\n<p>At most, it was permissible for Abu Bakr to use this phrase or at least his frustration was understandable enough not to be publicly criticized for it. ‘Urwah was upset too, of course, but that did not stop him from accepting Islam later.<\/p>\n<p>On other occasions, the Prophet (s) publicly rebuked Abu Bakr for using insulting language as the general rule prohibits using such words.<\/p>\n<p>Abu Huraira reported: A man reviled Abu Bakr while&nbsp;the Prophet, peace and blessings be upon him, was sitting. Then Abu Bakr reviled the man with the same words and the Prophet became angry and he stood to leave. Abu Bakr went to the Prophet and he said, “O Messenger of Allah, the man reviled me and you were sitting, but when I responded you became angry and stood up.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إِنَّهُ كَانَ مَعَكَ مَلَكٌ يَرُدُّ عَنْكَ فَلَمَّا رَدَدْتَ عَلَيْهِ بَعْضَ قَوْلِهِ وَقَعَ الشَّيْطَانُ فَلَمْ أَكُنْ لِأَقْعُدَ مَعَ الشَّيْطَانِ<\/p>\n<p><strong>Verily, there was an angel with you responding on your behalf, but Satan appeared when you responded with the same words as him and I will not sit in the presence of Satan<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 9411, Grade:&nbsp;<em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/09\/02\/hadith-on-satan-the-devil-sits-in-the-presence-of-those-who-curse-each-other\/\">Jayyid<\/a><\/em><\/p>\n<\/blockquote>\n<p>Aisha reported: Abu Bakr once cursed some of his slaves, so the Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا أَبَا بَكْرٍ اللَّعَّانِينَ وَالصِّدِّيقِينَ‏؟‏ كَلاَّ وَرَبِّ الْكَعْبَةِ<\/p>\n<p><strong>O Abu Bakr! Those who curse or those who are true? No, by the Lord of the Ka’bah!<\/strong><\/p>\n<\/blockquote>\n<p>On that day, Abu Bakr freed some of his slaves. Then the Prophet came to him and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">لا أَعُودُ<\/p>\n<p><strong>Do not do it again<\/strong>.<\/p>\n<p>Source: al-Adab al-Mufrad 319, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/15\/hadith-on-curses-the-prophet-reprimands-abu-bakr-for-cursing-his-slaves-so-abu-bakr-emancipates-them\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>When examining the totality of Abu Bakr’s biography, conduct, and character, we can see that he would learn from his mistakes as the Prophet (s) corrected him and those lessons in humility resulted in his honorable and distinguished service as the first Caliph of Islam.<\/p>\n<p>In another report attributed to the Prophet (s), Muslims were told to respond to tribal sloganeering with another well-known Arabic rebuke:<\/p>\n<blockquote>\n<p style=\"text-align: right\">مَنْ تَعَزَّى بِعَزَاءِ الْجَاهِلِيَّةِ فَأَعِضُّوهُ وَلَا تَكْنُوا<\/p>\n<p><strong>Whoever glorifies himself with the glory of ignorance, then tell him to bite it and do not use a metaphor.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 20729<\/p>\n<\/blockquote>\n<p>Questions of authenticity aside, this narration refers to tribal lineage aggrandizing as was done during the period of pre-Islamic ignorance and which was the cause of so much bloodshed. The phrase “bite it” implies his father’s private part, which was a common way of humiliating a tribalist by reminding him of his unimpressive origin, the fallacy of claiming privilege through lineage.<\/p>\n<p>Tribalism at the time was a type of racism, bigotry, and xenophobia, with often violent implications, and therefore it should be rightly shunned by the Muslim society. Muslims used this specific harsh phrase to place a social taboo on tribalism.<\/p>\n<p>Ibn al-Qayyim comments on these traditions, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right\">دَلِيلٌ عَلَى جَوَازِ التَّصْرِيحِ بِاسْمِ الْعَوْرَةِ إِذَا كَانَ فِيهِ مَصْلَحَةٌ &#8230; فَلِكُلِّ مَقَامٍ مَقَالٌ<\/p>\n<p>It is evidence for the permission of explicitly naming the private part if it is in the best interest… for every situation has an appropriate speech.<\/p>\n<p>Source: Zād al-Ma’ād 3\/267<\/p>\n<\/blockquote>\n<p>Indeed, situations might call for different reactions for a variety reasons. Gentleness in the face of abject tyranny is weakness, but harshness in the face of ordinary disagreements is oppressive. It requires the wisdom of scholarship and life-experience to recognize the exceptional circumstances when harsh words are justified. We cannot generalize the permission of harshness when the overwhelming majority of texts counsel otherwise.<\/p>\n<p>In most everyday situations, Muslims should be kind, gentle, and measured in the way they talk to others. This is even more critical in the age of social media, when text-based communication lacks the context of tone, inflection, and other non-verbal cues. Miscommunication using this medium is an ever present danger that can be easily reduced by <em>toning it down<\/em>.<\/p>\n<p>At the same time, lay Muslims should look to the example of recognized senior Imams and scholars for guidance on when harshness is appropriate. Our elders have the wisdom of experience and we should follow their lead. If one is unsure that harshness is called for, then it is better and safer to stay silent.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">رَحِمَ اللَّهُ امْرَأً تَكَلَّمَ فَغَنِمَ أَوْ سَكَتَ فَسَلِمَ<\/p>\n<p><strong>May Allah have mercy on a person who spoke rightly and was rewarded, or who was silent and remained safe<\/strong>.<\/p>\n<p>Source: Shu’b al-Imān 4579,&nbsp;Grade:&nbsp;<em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/29\/hadith-on-speech-may-allah-have-mercy-on-a-person-who-speaks-good-or-stays-silent\/\">Hasan<\/a><\/em><\/p>\n<\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;And speak to people in the best manner.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[320,61,16,25,49,184,37,48,100,54,55,93,56,58,62,103,98,179],"class_list":["post-19931","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-abu-bakr","tag-call-to-islam-dawah","tag-character-akhlaq","tag-forbearance-al-hilm","tag-gentleness-al-rifq","tag-guidance-al-hidaya","tag-idolatry-shirk","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-monotheism-tawheed","tag-patience-al-sabr","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5bt","jetpack-related-posts":[{"id":18474,"url":"https:\/\/www.abuaminaelias.com\/the-right-way-to-defend-islam\/","url_meta":{"origin":19931,"position":0},"title":"Defending Islam with grace and sincerity","author":"Abu Amina Elias","date":"June 1, 2017","format":false,"excerpt":"\"Whoever intends justice, then let him imagine himself in the place of his adversary,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15996,"url":"https:\/\/www.abuaminaelias.com\/allah-loves-gentleness-in-all-things\/","url_meta":{"origin":19931,"position":1},"title":"Allah loves gentleness in all things","author":"Abu Amina Elias","date":"August 6, 2014","format":false,"excerpt":"\"Whoever is given his portion of kindness has been given his portion of goodness.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14950,"url":"https:\/\/www.abuaminaelias.com\/humility-modesty-and-forbearance-in-islam\/","url_meta":{"origin":19931,"position":2},"title":"Humility, modesty, and forbearance in Islam","author":"Abu Amina Elias","date":"November 30, 2013","format":false,"excerpt":"\"Verily, Allah has revealed to me that you must be humble towards one another, so that no one wrongs another or arrogantly boasts to another.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20427,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-kindness-gentleness-hilm\/","url_meta":{"origin":19931,"position":3},"title":"Imam al-Mundhiri on Kindness, Gentleness, and Forbearance","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Allah is kind and he loves kindness in all matters.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13611,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-kindness-tolerance-and-gentleness\/","url_meta":{"origin":19931,"position":4},"title":"Imam al-Nawawi on Forbearance, Clemency, and Gentleness","author":"Abu Amina Elias","date":"May 30, 2013","format":false,"excerpt":"\"Allah is kind and He loves kindness in all matters.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25737,"url":"https:\/\/www.abuaminaelias.com\/qadiyani-ahmadiyyah-are-they-muslims\/","url_meta":{"origin":19931,"position":5},"title":"The Qadiyani Sect: Are they Muslims?","author":"Abu Amina Elias","date":"July 24, 2025","format":false,"excerpt":"\"Invite to the Way of your Lord with wisdom and kind advice,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19931","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=19931"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/19931\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=19931"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=19931"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=19931"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}