{"id":20053,"date":"2018-12-11T14:03:38","date_gmt":"2018-12-11T10:03:38","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20053"},"modified":"2020-07-17T22:06:33","modified_gmt":"2020-07-17T18:06:33","slug":"equality-and-equity-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/equality-and-equity-in-islam\/","title":{"rendered":"Equality and equity in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>People today have a tendency to invoke the word equality on a number of issues, as if it were a synonym for justice. Usually by saying equality they mean all people are equal in basic rights, duties, and dignity, that our justice systems should be fair, impartial, and unbiased. Certainly, people are equal in Islam regarding their right to life, property, and human dignity, regardless of their religion, race, gender, or ethnicity.<\/p>\n<p>That said, the hyper focus on equality to the exclusion of other concepts related to justice can obscure the truth of matters. There are two words for justice in Islam: <em>al-‘Adl<\/em>, which comes from the root meaning “to be equal,” and <em>al-Qist<\/em>, which comes from the root meaning “to distribute.” In English, these terms correlate to equality and equity, and they reflect different but complementary notions of justice.<\/p>\n<p>Many times, an equal distribution is an equitable distribution and therefore it produces justice. The Quran uses these two words together to make this point.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَن تَعْدِلُوا ۚ وَإِن تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا<\/p>\n<p><strong>O you who have faith, stand firm in equity<\/strong> (qist) <strong>as witnesses for Allah, even if it were against yourselves, or your parents, or your relatives. Whether rich or poor, Allah is more worthy of both. Follow not your desires, so that you may be just<\/strong> (ta’dilu).<\/p>\n<p>Surat al-Nisa’ 4:135<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ<\/p>\n<p><strong>O you who have faith, stand firm for Allah as witnesses in equity<\/strong> (<em>qist<\/em>), <strong>and let not the hatred of people cause you to not be just. Be just<\/strong> (<em>‘idlu<\/em>), <strong>for that is nearer to righteousness.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:8<\/p><\/blockquote>\n<p>These two verses are the foundation of the concept of justice in Islam. Our standards of justice should be the same for everyone, regardless of social status, race, religion, ethnicity, gender, and so on. We should not be biased toward our own groups, or even our own selves, in the administration of justice.<\/p>\n<p>Al-Qurtubi comments on the latter verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَدَلَّتِ الْآيَةُ أَيْضًا عَلَى أَنَّ كُفْرَ الْكَافِرِ لَا يَمْنَعُ مِنَ الْعَدْلِ عَلَيْهِ<\/p>\n<p>This verse shows that the unbelief of the unbeliever does not prevent him from being treated with justice.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 5:8<\/p><\/blockquote>\n<p>In general, equality and equity are the same and can be used interchangeably as they are in the Quran. However, it is not always true that setting two things equal to each other produces justice.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَجَعَلَ الظُّلُمَاتِ وَالنُّورَ ۖ ثُمَّ الَّذِينَ كَفَرُوا بِرَبِّهِمْ يَعْدِلُونَ<\/p>\n<p><strong>All praise is due to Allah, who created the heavens and the earth and made darkness and light. Yet those who disbelieve claim equals<\/strong> (<em>ya’dilun<\/em>) <strong>with their Lord.<\/strong><\/p>\n<p>Surat al-An’am 6:1<\/p><\/blockquote>\n<p>In this verse, the same word used to mean justice elsewhere is here used to mean setting up idols as equal to Allah. To claim the Creator is equal to the creation is obviously unjust. As such, equality is not always the same as justice.<\/p>\n<p>The truth of this matter becomes clear when seen in relation to the obligatory alms (<em>al-Zakat<\/em>). The standard 2.5% of surplus wealth to be given yearly in charity should be distributed to the poor and those whom scholars recognize as the most in need; it should not be given to the wealthy. If the rich and poor are treated equally in terms of charity, it would be manifestly unjust to the poor.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَفِي أَمْوَالِهِمْ حَقٌّ لِّلسَّائِلِ وَالْمَحْرُومِ<\/p>\n<p><strong>And in their properties is a right for the needy and deprived.<\/strong><\/p>\n<p>Surat al-Dhariyat 51:19<\/p><\/blockquote>\n<p>The poor are <em>entitled<\/em> to receive enough charity for them to meet their basic needs, while it is a duty upon the wealthiest of us to give them charity. This arrangement is not equal, but it is <em>equitable<\/em> and produces justice.<\/p>\n<p>In our times, it is becoming less clear to people how equality and equity relate to gender issues in Islam. To be sure, men and women are generally equal in rights, duties, and dignity, except in the few cases in which an equal arrangement would not be equitable.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ<\/p>\n<p><strong>The believing men and women are allies of one another.<\/strong><\/p>\n<p>Surat al-Tawbah 9:71<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّن بَعْضٍ<\/p>\n<p><strong>Their Lord responded to them: Never will I cause to be lost the deeds of any among you, whether male or female; you are of one another.<\/strong><\/p>\n<p>Surat Ali Imran 3:195<\/p><\/blockquote>\n<p>Al-Suyuti comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَعْضُكُمْ كَائِنٌ مِنْ بَعْضٍ أَي اَلذُّكُورُ مِنَ اَلْإِنَاثِ وَبِالْعَكْس وَالْجُمْلَةُ مُؤَكِّدَةٌ لِمَا قَبْلَهَا أَي هُمْ سَوَاءٌ فِي اَلْمُجَازَاةِ بِالْأَعْمَالِ<\/p>\n<p>You are as if part of one another, meaning the male is from the female by opposite. The sentence confirms what was before it, that is, they are equal in reward for their actions.<\/p>\n<p>Source: Tafsīr al-Jalālayn 3:195<\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا النِّسَاءُ شَقَائِقُ الرِّجَالِ<\/p>\n<p><strong>Verily, women are the counterparts of men.<\/strong><\/p>\n<p>Source: Musnad Ahmad 25663 Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/09\/hadith-on-cleanliness-men-and-women-who-have-wet-dreams-should-perform-a-ritual-bath-ghusl\/\"><strong>Sahih<\/strong><\/a><\/p><\/blockquote>\n<p>Al-Khattabi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقوله النساء شقائق الرجال أي نظائرهم وأمثالهم في الخلق والطباع فكأنهن شققن من الرجال وفيه من الفقه إثبات القياس والحاق حكم النظير بالنظير وأن الخطاب إذا ورد بلفظ الذكور كان خطابا بالنساء إلا مواضع الخصوص التي قامت أدلة التخصيص فيها<\/p>\n<p>His saying that women are counterparts of men means their equals and their likeness in creation and nature, as if they split off from men. In jurisprudence, it is affirmation of the analogy and equivalence in rulings, equal by equal. Such that if the address is conveyed in the male grammatical form, it is also addressed to women, except for specific topics whose specification is established by evidence.<\/p>\n<p>Source: Ma’ālim al-Sunan 1\/79<\/p><\/blockquote>\n<p>These texts indicate that men and women in Islam are equal as a general rule, with a few exceptions related to physiology (physical strength, menstruation, etc.) or traditional gender roles. For instance, men have historically been the heads of their households because they were responsible for attaining security and income for their families.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنفَقُوا مِنْ أَمْوَالِهِمْ<\/p>\n<p><strong>Men are guardians over women by what Allah has favored some over others and by what they spend of their wealth.<\/strong><\/p>\n<p>Surat al-Nisa 4:34<\/p><\/blockquote>\n<p>The ‘favor’ of men over women refers to the physical strength of men, which is on average much greater than women and which enables men to better perform the hard physical labor and military duties necessary for political and economic security.<\/p>\n<p>In return for fulfilling their duties, women should reasonably obey the limited authority of their husbands.<\/p>\n<p>Al-Qurtubi comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ يَقُومُونَ بِالنَّفَقَةِ عَلَيْهِنَّ وَالذَّبِّ عَنْهُنَّ وَأَيْضًا فَإِنَّ فِيهِمُ الْحُكَّامَ وَالْأُمَرَاءَ وَمَنْ يَغْزُو وَلَيْسَ ذَلِكَ فِي النِّسَاءِ<\/p>\n<p>It means men sustain women by spending upon them and defending them. Likewise, among men are rulers, commanders, and those who wage military campaigns; it is not like that among women.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 4:34<\/p><\/blockquote>\n<p>In a superficial sense, the marriage relationship is unequal because rights and duties are distributed differently, but the distribution is designed to be balanced and equitable. The same principle applies to the law of inheritance.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُوصِيكُمُ اللَّهُ فِي أَوْلَادِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْ<\/p>\n<p><strong>Allah enjoins you regarding your children: for the male one share like two females.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:11<\/p><\/blockquote>\n<p>Again, a superficial reading might mislead some people into thinking this arrangement is unjust because it is unequal. But the inequality of the arrangement is counter-balanced by the added responsibility of the male to provide income for his family; thus, the distribution is unequal but equitable.<\/p>\n<p>The problem Muslims are experiencing in the modern day is that traditional gender roles and economic arrangements have been severely disrupted by modernity. Some people call for the application of classical Islamic law in a new social context that might produce unintended and unequitable outcomes, while others call for the abandonment of Islamic law altogether.<\/p>\n<p>The truth is that fair, impartial, and unbiased justice is the very root and spirit of the law; any law that does not result in outcomes that should be equal, or unequal outcomes that should be equitable, are not part of Islam even if people think that they are.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ بَيَّنَ سُبْحَانَهُ بِمَا شَرَعَهُ مِنْ الطُّرُقِ أَنَّ مَقْصُودَهُ إقَامَةُ الْعَدْلِ بَيْنَ عِبَادِهِ وَقِيَامُ النَّاسِ بِالْقِسْطِ فَأَيُّ طَرِيقٍ اُسْتُخْرِجَ بِهَا الْعَدْلُ وَالْقِسْطُ فَهِيَ مِنْ الدِّينِ وَلَيْسَتْ مُخَالِفَةً لَهُ<\/p>\n<p>Allah Almighty has made clear in his law (<em>shari’ah<\/em>) that the objective is the establishment of justice between His servants and equity among the people, so whichever path leads to justice and equity is part of the religion and can never oppose it.<\/p>\n<p>Source: <a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2013\/05\/06\/ibn-al-qayyim-on-sharia-justice-is-integral-to-the-religion-of-islam-and-can-never-oppose-it\/\">al-Ṭuruq al-Ḥikmīya 13<\/a><\/p><\/blockquote>\n<p>This reality forces a difficult conversation upon Muslims about achieving equitable results in the modern context within a traditional Islamic framework. Islam as a religion does not need to be reformed, but rather the legitimate legal principles of adaptation to changing conditions, which already exist in the classical heritage, need to be courageously renewed again in the quest for a well-ordered, just society.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There are two words for justice in Islam&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[17,18,24,48,100,55,93,103,128],"class_list":["post-20053","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-charity-al-sadaqah","tag-community-jamaah","tag-family-ties-sillat-rahim","tag-justice-adl","tag-manners-al-adab","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-public-welfare-al-maslaha","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5dr","jetpack-related-posts":[{"id":17207,"url":"https:\/\/www.abuaminaelias.com\/equality-under-law-non-muslims\/","url_meta":{"origin":20053,"position":0},"title":"Equal protection of law for Muslims and non-Muslims","author":"Abu Amina Elias","date":"October 20, 2015","format":false,"excerpt":"\"Islam guarantees the protection of civil law for all citizens and visitors,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23736,"url":"https:\/\/www.abuaminaelias.com\/custodianship-of-the-right-hand\/","url_meta":{"origin":20053,"position":1},"title":"Custodianship of the Right Hand: Concubinage, Rape, and &#8216;Sexual Slavery&#8217; in Islam","author":"Abu Amina Elias","date":"December 9, 2021","format":false,"excerpt":"\"This paper addresses the allegations...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14152,"url":"https:\/\/www.abuaminaelias.com\/justice-and-fairness-for-all-in-islam\/","url_meta":{"origin":20053,"position":2},"title":"Justice and fairness for all in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, Allah orders justice and good conduct and giving to relatives,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13256,"url":"https:\/\/www.abuaminaelias.com\/why-does-islam-allow-polygamy\/","url_meta":{"origin":20053,"position":3},"title":"Why does Islam allow polygamy?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"You will never be able to do perfect justice between wives...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14928,"url":"https:\/\/www.abuaminaelias.com\/eye-for-an-eye\/","url_meta":{"origin":20053,"position":4},"title":"What is the meaning of &#8216;eye for an eye&#8217;?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"We ordained for them a life for a life, an eye for an eye...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17681,"url":"https:\/\/www.abuaminaelias.com\/justice-for-all-humanity-hilf-al-fudul\/","url_meta":{"origin":20053,"position":5},"title":"Cooperation with all humanity for justice, Hilf al-Fudul","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah commands his faithful servants to cooperate in good deeds,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20053","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20053"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20053\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20053"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20053"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20053"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}