{"id":20121,"date":"2019-01-23T14:09:38","date_gmt":"2019-01-23T10:09:38","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20121"},"modified":"2023-01-30T11:32:16","modified_gmt":"2023-01-30T07:32:16","slug":"where-is-the-island-of-dajjal","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/where-is-the-island-of-dajjal\/","title":{"rendered":"Where is the island of Dajjal?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Some Muslims hold the belief that the False Messiah (<em>al-Masihah al-Dajjal<\/em>), who will emerge near the end of time as a great tribulation, is currently imprisoned on an unknown island somewhere in the world. This was indeed reported by the companion Tamim al-Dari (ra) and confirmed by the Prophet (s).<\/p>\n<p>Yet since practically all of the ocean has been explored, no one has been able to find the island or the False Messiah. What was the nature of Tamim’s encounter with the False Messiah? Was it a physical encounter or a spiritual vision?<\/p>\n<p>Tamim al-Dari, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أَعْظَمُ إِنْسَانٍ رَأَيْنَاهُ قَطُّ خَلْقًا وَأَشَدُّهُ وِثَاقًا مَجْمُوعَةٌ يَدَاهُ إِلَى عُنُقِهِ  مَا بَيْنَ رُكْبَتَيْهِ إِلَى كَعْبَيْهِ بِالْحَدِيدِ قُلْنَا وَيْلَكَ مَا أَنْتَ قَالَ قَدْ قَدَرْتُمْ عَلَى خَبَرِي فَأَخْبِرُونِي مَا أَنْتُمْ قَالُوا نَحْنُ أُنَاسٌ مِنَ الْعَرَبِ رَكِبْنَا فِي سَفِينَةٍ بَحْرِيَّةٍ فَصَادَفْنَا الْبَحْرَ حِينَ اغْتَلَمَ فَلَعِبَ بِنَا الْمَوْجُ شَهْرًا ثُمَّ أَرْفَأْنَا إِلَى جَزِيرَتِكَ هَذِهِ<\/p>\n<p style=\"text-align: right;\">&#8230;<\/p>\n<p style=\"text-align: right;\">قَالَ وَإِنِّي مُخْبِرُكُمْ عَنِّي إِنِّي أَنَا الْمَسِيحُ وَإِنِّي أُوشِكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ فَأَخْرُجَ فَأَسِيرَ فِي الأَرْضِ فَلاَ أَدَعَ قَرْيَةً إِلاَّ هَبَطْتُهَا فِي أَرْبَعِينَ لَيْلَةً غَيْرَ مَكَّةَ وَطَيْبَةَ فَهُمَا مُحَرَّمَتَانِ عَلَىَّ كِلْتَاهُمَا كُلَّمَا أَرَدْتُ أَنْ أَدْخُلَ وَاحِدَةً أَوْ وَاحِدًا مِنْهُمَا اسْتَقْبَلَنِي مَلَكٌ بِيَدِهِ السَّيْفُ صَلْتًا يَصُدُّنِي عَنْهَا وَإِنَّ عَلَى كُلِّ نَقْبٍ مِنْهَا مَلاَئِكَةً يَحْرُسُونَهَا<\/p>\n<p>We departed hastily until we were admitted into the monastery and found within it a huge man. We had never seen any creation more firmly imprisoned. His hands were tied to his neck and there were iron shackles between his two legs to his ankles. We said: Woe to you! What are you? He said: I will soon tell you about me, but first tell me about you. We said: We are Arabs who have traveled in a seafaring vessel but it happened to be that the sea seized us and the waves shook us for a month, then we sought shore on this island of yours…<\/p>\n<p>The man said: Indeed, I will tell you about myself. I am the messiah. I will soon be permitted to emerge and thus I will go out and march across the land. I will not leave any town but that I will occupy it for forty nights, except for Mecca and Medina. They are both forbidden to me. Every time I want to enter one of them, I will be confronted by an angel with a sword in his hand to obstruct me from them. Indeed, around every vulnerability among them is an angel to guard them.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2942, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>On the basis of this report, many Muslims hold that the False Messiah is literally imprisoned on an island right now, but that Allah has obscured its location by supernatural means. Hence, no one can ever find it until the False Messiah is finally released.<\/p>\n<p>However, this report should reconciled with other equally authentic reports that the False Messiah possibly appeared to the companions in the form of the false prophet Ibn al-Sayyad<\/p>\n<p>Muhammad ibn al-Munkadir reported: I saw Jabir ibn Abdullah, may Allah be pleased with him, swear an oath that Ibn al-Sayyad was the False Messiah (<em>al-Dajjal<\/em>). Jabir said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَلَمْ يُنْكِرْهُ النَّبِيُّ صلى الله عليه وسلم<\/p>\n<p>I heard Umar swear an oath upon that in the presence of the Prophet, peace and blessings be upon him, and he did not reject it.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7355, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>When Umar saw that Ibn al-Sayyad falsely claimed to be a prophet, he immediately asked the Messenger of Allah (s) for permission to kill him. The Prophet (s) refused, though, because if he truly were the False Messiah, he could not be killed until everything that was foretold would come to pass.<\/p>\n<p>Abdullah ibn Umar reported: The Prophet, peace and blessings be upon him, said to Ibn al-Sayyad:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَرِبَتْ يَدَاكَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ<\/p>\n<p>May your hands be dusted! Do you testify that I am the messenger of Allah?<\/p><\/blockquote>\n<p>Ibn al-Sayyad said, “No, rather you testify that I am the messenger of Allah!” Umar ibn al-Khattab said, “O Messenger of Allah, allow me to kill him!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ يَكُنِ الَّذِي تَرَى فَلَنْ تَسْتَطِيعَ قَتْلَهُ<\/p>\n<p><strong>If he is who you think he is, you will never be able to kill him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2924, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعْهُ إِنْ يَكُنْ هُوَ فَلَا تُطِيقُهُ وَإِنْ لَمْ يَكُنْ هُوَ فَلَا خَيْرَ لَكَ فِي قَتْلِهِ<\/p>\n<p><strong>Leave him, for if he truly is him you will have no power to do so. If it is not him, then there is no good for you in killing him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6244, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (s) did not allow Umar to harm him because he was either the False Messiah and thus could not be harmed until the signs of the Hour had come to pass, or he was simply an ordinary blasphemer in which case there was “no good” in killing him. (As a side note, this incident is further evidence that blasphemy is <a href=\"https:\/\/abuaminaelias.com\/islam-between-blasphemy-and-extremism\/\">not automatically punished by death or harm<\/a>).<\/p>\n<p>Nevertheless, some of the senior companions swore an oath to Allah that Ibn al-Sayyad was the False Messiah. So how can the False Messiah appear as both Ibn al-Sayyad and the imprisoned man on the island?<\/p>\n<p>Al-Qari al-Harawi reconciles these two stories by proposing that the outward appearance (<em>thahir<\/em>) of the False Messiah takes different forms, while his essence (<em>batin<\/em>) exists in the Unseen beyond the physical world.<\/p>\n<p>Al-Qari al-Harawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقُولُ وَلَا يُنَافِيهِ قِصَّةُ تَمِيمٍ الدَّارِيِّ إِذْ يُمْكِنُ أَنْ يَكُونَ لَهُ أَبْدَانٌ مُخْتَلِفَةٌ فَظَاهِرُهُ فِي عَالَمِ الْحِسِّ وَالْخَيَالِ دَائِرٌ مَعَ اخْتِلَافِ الْأَحْوَالِ وَبَاطِنُهُ فِي عَالَمِ الْمِثَالِ مُقَيَّدٌ بِالسَّلَاسِلِ وَالْأَغْلَالِ وَلَعَلَّ الْمَانِعَ مِنْ ظُهُورِهِ كَمَالَهُ فِي الْفِتْنَةِ وُجُودُ سَلَاسِلِ النُّبُوَّةِ وَأَغْلَالِ الرِّسَالَةِ<\/p>\n<p>I say (the story of Ibn al-Sayyad) does not contradict the story of Tamim al-Dari, as it could be that the Dajjal has different bodies. Thus his outward appearance in the world of senses and perception operate according to different circumstances. His essence is in the world of apparitions (<em>‘alam al-mithal<\/em>), restricted by chains and shackles. Perhaps what stops him from appearing during tribulation is the presence of prophetic chains and shackles.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 8\/3484<\/p><\/blockquote>\n<p>And Al-Qari al-Harawi further elaborates on the world of apparitions:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الْعُلَمَاءُ بَيْنَ عَالَمِ الْأَجْسَامِ وَعَالَمِ الْأَرْوَاحِ عَالَمٌ آخَرُ يُقَالُ لَهُ عَالَمُ الْمِثَالِ وَهُوَ عَالَمٌ نُورَانِيٌّ شَبِيهٌ بِالْجُسْمَانِيِّ وَالنَّوْمُ سَبَبٌ لِسَيْرِ الرُّوحِ الْمُنَوَّرِ فِي عَالَمِ الْمِثَالِ وَرُؤْيَةِ مَا فِيهِ مِنَ الصُّوَرِ غَيْرِ الْجَسَدَانِيَّةِ<\/p>\n<p>The scholars said that between the physical world and spiritual world is another world called the world of apparitions. It is a luminous world resembling the physical. Sleep is a cause for the enlightened soul to trek into the world of apparitions and to see visions of what is therein of images without physical form.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 9\/3897<\/p><\/blockquote>\n<p>The imprisoned beast that Tamim al-Dari (ra) saw on the island was indeed the False Messiah, but it can be interpreted as an apparition of his essence in the Unseen that was specific to their circumstances. For this reason, no one can find the island today because what Tamim saw was a temporary vision representing a reality in the Unseen non-physical world.<\/p>\n<p>At the same time, the False Messiah, his deputies, or his predecessors, who falsely claim to be prophets, will appear in the physical world in different forms, places, and circumstances.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَكُونُ فِي آخِرِ الزَّمَانِ دَجَّالُونَ كَذَّابُونَ يَأْتُونَكُمْ مِنْ الْأَحَادِيثِ بِمَا لَمْ تَسْمَعُوا أَنْتُمْ وَلَا آبَاؤُكُمْ فَإِيَّاكُمْ وَإِيَّاهُمْ لَا يُضِلُّونَكُمْ وَلَا يَفْتِنُونَكُمْ<\/p>\n<p><strong>There will be impostors <\/strong>(<em>dajjalun<\/em>) <strong>near the end of time, liars who will bring narrations you have never heard, neither you nor your fathers. Beware lest they misguide you and afflict you with trials<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 7, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/01\/hadith-on-dajjal-beware-of-impostors-who-will-fabricate-prophetic-hadith\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّهُ سَيَكُونُ فِي أُمَّتِي ثَلَاثُونَ كَذَّابُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ نَبِيٌّ وَأَنَا خَاتَمُ النَّبِيِّينَ لَا نَبِيَّ بَعْدِي<\/p>\n<p><strong>Verily, there will be thirty liars among my nation, all of them claiming to be a prophet, but I am the seal of the prophets. There is no prophet after me.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2219, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/21\/hadith-on-idolatry-the-hour-will-not-be-established-until-some-muslims-worship-idols\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The final manifestation of the False Messiah will be near the end of time and he will be defeated by Jesus (s) after he returns to earth.<\/p>\n<p>Again, we must reiterate that the primary function of <em>eschatology<\/em>, or the signs of the Hour, is to encourage us to perform good deeds while we can. We should not take our lives, property, and security for granted, because at some point tribulations like the False Messiah will afflict everyone on earth.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَادِرُوا بِالْأَعْمَالِ سَبْعًا هَلْ تَنْتَظِرُونَ إِلَّا فَقْرًا مُنْسِيًا أَوْ غِنًى مُطْغِيًا أَوْ مَرَضًا مُفْسِدًا أَوْ هَرَمًا مُفَنِّدًا أَوْ مَوْتًا مُجْهِزًا أَوْ الدَّجَّالَ فَشَرُّ غَائِبٍ يُنْتَظَرُ أَوْ السَّاعَةَ فَالسَّاعَةُ أَدْهَى وَأَمَرُّ<\/p>\n<p><strong>Hasten to perform good deeds before seven events: Are you waiting for poverty that makes you forgetful? Or wealth that burdens you? Or a debilitating disease or senility? Or an unexpected death or the False Messiah? Or is it evil in the unseen you are waiting for? Or the Hour itself? The Hour will be bitter and terrible.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2306, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/04\/27\/hadith-on-haste-hurry-to-good-deeds-before-disaster-strikes\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>And Al-A’lai writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مقصود هذه الأخبار الحث على البداءة بالأعمال قبل حلول الآجال واغتنام الأوقات قبل هجوم الآفات<\/p>\n<p>The purpose of these reports is to encourage initiative in performing good deeds before our end and to make the most of our time before disaster strikes.<\/p>\n<p>Source: Fayḍ al-Qadīr 3\/195<\/p><\/blockquote>\n<p>It is not for Muslims to attempt to construct a precise timeline of future events, to indulge conspiracy theories, or to speciously connect the specific signs of Hour to current geopolitical events based entirely on their own conjecture.<\/p>\n<p>Sorting through all the reports of the False Messiah can be confusing, since many of them may not be authentic or can be interpreted in different ways. Muslims believe what Tamim (ra) saw was literally physical and still exists today, while others believe it was an ephemeral vision. We can only say Allah knows best what modality it really was, although we all agree upon the truthfulness of the Prophet (s) and his companions.<\/p>\n<p>That said, even the Prophet (s) worried that Muslims would be overwhelmed with too much information regarding the False Messiah and the end times, so he simplified his sign for us. The unmistakable sign of the appearance of the False Messiah will be that he has one eye.<\/p>\n<p>Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي قَدْ حَدَّثْتُكُمْ عَنْ الدَّجَّالِ حَتَّى خَشِيتُ أَنْ لَا تَعْقِلُوا إِنَّ مَسِيحَ الدَّجَّالِ رَجُلٌ قَصِيرٌ أَفْحَجُ جَعْدٌ أَعْوَرُ مَطْمُوسُ الْعَيْنِ لَيْسَ بِنَاتِئَةٍ وَلَا حَجْرَاءَ فَإِنْ أُلْبِسَ عَلَيْكُمْ فَاعْلَمُوا أَنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ<\/p>\n<p><strong>Verily, I have told you so much about the False Messiah that I fear you will not understand. Verily, the False Messiah is a short man, pigeon toed, curly haired, with one eye that is sightless, neither protruding nor sunken. If you are confused about him, then know that your Lord does not have one eye.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4320, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/12\/hadith-on-dajjal-if-you-are-confused-about-the-false-messiah-then-know-allah-is-not-one-eyed\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In sum, the island on which Tamim (ra) saw the False Messiah is unknown to us and will not be definitively discovered, either because it was a spiritual vision specific to Tamim and his companions, or other miraculous means prevent it from being found. Either way, the story of the imprisoned False Messiah is a concrete image for us to represent the Unseen reality that his tribulation will come to pass in the future, so we should focus on making the most of our time on earth by doing good deeds and strengthening our faith.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;What was the nature of Tamim’s encounter with the False Messiah?&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[122,21,183,418,32,55,56,73],"class_list":["post-20121","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-angels-malaikah","tag-creed-aqidah","tag-day-of-resurrection-yawm-al-qiyammah","tag-false-messiah-al-masiha-al-dajjal","tag-hereafter-akhirah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5ex","jetpack-related-posts":[{"id":21491,"url":"https:\/\/www.abuaminaelias.com\/fitnah-al-masiha-al-dajjal\/","url_meta":{"origin":20121,"position":0},"title":"Tribulation of the False Messiah, al-Masiha al-Dajjal","author":"Abu Amina Elias","date":"December 5, 2019","format":false,"excerpt":"\"Know that your Lord does not have one eye.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21235,"url":"https:\/\/www.abuaminaelias.com\/ten-ayat-surah-kahf-dajjal\/","url_meta":{"origin":20121,"position":1},"title":"Ten verses of Surat al-Kahf to protect from Dajjal","author":"Abu Amina Elias","date":"September 20, 2019","format":false,"excerpt":"\"Whoever contemplates them will not be misled by the trials of the False Messiah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17565,"url":"https:\/\/www.abuaminaelias.com\/understanding-signs-of-the-hour\/","url_meta":{"origin":20121,"position":2},"title":"Understanding the signs of the Hour","author":"Abu Amina Elias","date":"January 10, 2016","format":false,"excerpt":"\"People ask you concerning the Hour...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14749,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-tribulations-and-signs-of-the-hour\/","url_meta":{"origin":20121,"position":3},"title":"Imam al-Nawawi on Tribulations and Signs of the Hour","author":"Abu Amina Elias","date":"August 20, 2013","format":false,"excerpt":"\"When trust is lost, then wait for the Hour.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21779,"url":"https:\/\/www.abuaminaelias.com\/can-plague-enter-mecca-and-medina\/","url_meta":{"origin":20121,"position":4},"title":"Can plague enter Mecca and Medina?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The False Messiah will not enter Medina, neither will pestilence.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21125,"url":"https:\/\/www.abuaminaelias.com\/al-mahdi-promised-caliph\/","url_meta":{"origin":20121,"position":5},"title":"Al-Mahdi, the promised Caliph to lead the Ummah","author":"Abu Amina Elias","date":"September 10, 2019","format":false,"excerpt":"\"The Mahdi will be from my offspring, the descendants of Fatimah.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20121","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20121"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20121\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}