{"id":20133,"date":"2019-01-24T11:57:06","date_gmt":"2019-01-24T07:57:06","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20133"},"modified":"2020-07-17T22:01:23","modified_gmt":"2020-07-17T18:01:23","slug":"how-to-repent-from-sin-the-right-way","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/how-to-repent-from-sin-the-right-way\/","title":{"rendered":"How to repent from sin the right way"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Repentance is to turn back to Allah and get back on the straight path after being sidetracked by sin and misguidance. All of us need to repent from our sins, both for specific sins and in a general sense. But what are the conditions of sound repentance? Is it an action or a feeling, or both?<\/p>\n<p>The scholars agreed that it is an obligation to sincerely repent from every sin, both major and minor sins.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا<\/p>\n<p><strong>O you who have faith, repent to Allah with sincere repentance.<\/strong><\/p>\n<p>Surat al-Tahrim 66:8<\/p><\/blockquote>\n<p>Al-Qurtubi comments on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمْرٌ بِالتَّوْبَةِ وَهِيَ فَرْضٌ عَلَى الْأَعْيَانِ فِي كُلِّ الْأَحْوَالِ وَكُلِّ الْأَزْمَانِ<\/p>\n<p>The command to repent is an obligation upon individuals in every circumstance and every time.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 66:8<\/p><\/blockquote>\n<p>The door of repentance, which is to say the opportunity to repent, is available to everyone at every time, except when imminent death is certain or the world ends (signified by the rising of the sun from the west).<\/p>\n<p>Abu Musa reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ اللَّيْلِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا<\/p>\n<p><strong>Verily, Allah Almighty stretches out his hand by night to accept the repentance of those who sin by day, and he stretches out his hand by day to accept the repentance of those who sin by night, until the sun rises from the west.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2759, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/hadith-on-repentance-allah-stretches-out-his-hand-by-night-and-day-for-those-who-repent\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ<\/p>\n<p><strong>Verily, Allah accepts the repentance of his servants so long as they are not on their death bed<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3537, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/hadith-on-repentance-allah-accepts-a-servants-repentance-as-long-as-they-are-not-on-their-death-bed\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>As such, we should not procrastinate in repenting for our sins, because we do not know when the hour of our death will arrive and thereby lose the opportunity to receive the mercy of Allah.<\/p>\n<p>For repentance to be accepted by Allah, it must fulfill a set of conditions as laid out by the scholars.<\/p>\n<p>Al-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ العلماءُ التَّوْبَةُ وَاجبَةٌ مِنْ كُلِّ ذَنْب فإنْ كَانتِ المَعْصِيَةُ بَيْنَ العَبْدِ وبَيْنَ اللهِ تَعَالَى لاَ تَتَعلَّقُ بحقّ آدَمِيٍّ فَلَهَا ثَلاثثَةُ شُرُوط أحَدُها أَنْ يُقلِعَ عَنِ المَعصِيَةِ والثَّانِي أَنْ يَنْدَمَ عَلَى فِعْلِهَا والثَّالثُ أَنْ يَعْزِمَ أَنْ لا يعُودَ إِلَيْهَا أَبَدًا فَإِنْ فُقِدَ أَحَدُ الثَّلاثَةِ لَمْ تَصِحَّ تَوبَتُهُ<\/p>\n<p>The scholars said it is an obligation to repent from every sin. If it is sinful disobedience between a servant and his Lord – unrelated to the right of a human being – then it has three conditions. First, the disobedience is abandoned. Second, one regrets what they have done. Third, one is determined not to repeat it ever again. If one of these three is missing, his repentance is not sound.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/14<\/p><\/blockquote>\n<p>In other words, repentance must include: 1) stop committing the sin, 2) regret having committed the sin, and 3) decide never to go back to the sin again. Thus repentance is the combination of an action, a feeling, and a decision.<\/p>\n<p>If the sin involved solely the rights of Allah (such as prayer and fasting), then repentance is fulfilled by these three conditions alone. Even the worst of all sins and the root of all evil, idolatry (<em>al-shirk<\/em>), will be forgiven by Allah for doing these three things.<\/p>\n<p>However, if the sin involves transgression against another human being (such as theft or murder), then a fourth condition of repentance is added to these three.<\/p>\n<p>Al-Nawawi continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنْ كَانَتِ المَعْصِيةُ تَتَعَلقُ بآدَمِيٍّ فَشُرُوطُهَا أرْبَعَةٌ هذِهِ الثَّلاثَةُ وأَنْ يَبْرَأَ مِنْ حَقّ صَاحِبِها فَإِنْ كَانَتْ مالًا أَوْ نَحْوَهُ رَدَّهُ إِلَيْه<\/p>\n<p>If it is sinful disobedience related to the right of a human being, there is a fourth condition alongside these three. It is that he acquits himself of the right by restoring it to its owner, if it is related to wealth or otherwise.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn 1\/14<\/p><\/blockquote>\n<p>For instance, if someone stole the wealth of his neighbor, he must return his neighbor’s wealth or otherwise justly compensate them in order for his repentance to be accepted. This fourth condition is based upon the fact that a martyr (<em>al-shahid<\/em>), who dies courageously in a good cause for his or her faith, will have all of their sins forgiven except those involving other people, specifically their debts and financial commitments.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُغْفَرُ لِلشَّهِيدِ كُلُّ ذَنْبٍ إِلَّا الدَّيْنَ<\/p>\n<p><strong>The martyr is forgiven for every sin except debt.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1886, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/01\/13\/hadith-on-martyrdom-the-martyr-is-forgiven-except-for-sins-against-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nawawi comments on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَفِيهِ تَنْبِيهٌ عَلَى جَمِيعِ حُقُوقِ الْآدَمِيِّينَ وَأَنَّ الْجِهَادَ وَالشَّهَادَةَ وَغَيْرَهُمَا مِنْ أَعْمَالِ الْبِرِّ لَا يُكَفِّرُ حُقُوقَ الْآدَمِيِّينَ وَإِنَّمَا يُكَفِّرُ حُقُوقَ اللَّهِ تَعَالَى<\/p>\n<p>In this is a warning in regards to all the rights of human beings, that jihad, martyrdom, and other deeds of righteousness do not expiate violations against the rights of human beings. Indeed, they only expiate violations against the rights of Allah Almighty.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 1885<\/p><\/blockquote>\n<p>Hence, even a virtue as great as martyrdom does not absolve one of his or her responsibilities towards others and, therefore, does not guarantee forgiveness for human rights transgressions.<\/p>\n<p>We find many traditions from the Prophet, peace and blessings be upon him, which promise forgiveness of sins for doing acts of worship:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ مَا بَيْنَهُنَّ مَا اجْتُنِبَتْ الْكَبَائِرُ<\/p>\n<p><strong>The five prayers, Friday to Friday, and Ramadan to Ramadan will be expiation for the sins committed between them as long as major sins are avoided.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 233, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/18\/prayer-can-remove-sin\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>These traditions and others like them imply forgiveness for minor sins, mistakes, errors in judgment, and lapses in perfection. They do not require specific acknowledgment, since we commit so many of them each day. But major sins such as idolatry, murder, and theft require specific acknowledgement and restoration of the rights of the victim, if applicable.<\/p>\n<p>Indeed, one must plead for the forgiveness of those he or she has wronged before they are held to account in the Hereafter. In this way, sinning against people can be more dangerous than sinning against Allah alone. People are, after all, much less forgiving than Allah.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَتْ لَهُ مَظْلَمَةٌ لِأَخِيهِ مِنْ عِرْضِهِ أَوْ شَيْءٍ فَلْيَتَحَلَّلْهُ مِنْهُ الْيَوْمَ قَبْلَ أَنْ لَا يَكُونَ دِينَارٌ وَلَا دِرْهَمٌ إِنْ كَانَ لَهُ عَمَلٌ صَالِحٌ أُخِذَ مِنْهُ بِقَدْرِ مَظْلَمَتِهِ وَإِنْ لَمْ تَكُنْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ سَيِّئَاتِ صَاحِبِهِ فَحُمِلَ عَلَيْهِ<\/p>\n<p><strong>Whoever wrongs his brother in his honor or anything else should resolve the matter today before it cannot be resolved with gold and silver coins. If he has good deeds to his credit, they will be taken from him according to the measure of his injustice. If he has no good deeds left, then he will bear the evil deeds of the one he has oppressed<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2317, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/15\/hadith-on-oppression-the-oppressors-good-deeds-will-be-taken-and-he-will-acquire-the-evil-deeds-of-those-he-oppressed\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>For every unrepentant sin we commit against another person, even seemingly trivial deeds like backbiting and gossip, our good deeds will be surrendered to them in the Hereafter or we will bear the burden of their sins as compensation. It is a terrifying prospect.<\/p>\n<p>In fact, some early scholars believed that it was possible for a Muslim&#8217;s entire record of good deeds to be destroyed merely by indulging in backbiting against others.<\/p>\n<p>Al-Qushayri said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قيل يؤتى العبد يَوْم الْقِيَامَة كتابه فلا يرى فِيهِ حسنة فَيَقُول أين صلاتي وصيامي وطاعاتي فيقال ذهب عملك كُلهُ باغتيابك لِلنَّاسِ<\/p>\n<p>It is said that a servant will receive his book of deeds on the Day of Resurrection and he will not see any good in it. He will say: Where are my prayers? Where is my fasting? Where are my acts of obedience? It will be said: All of your good deeds have been lost because you were backbiting against people.<\/p>\n<p>Source: al-Risālah al-Qushayrīyah 1\/291<\/p><\/blockquote>\n<p>We should not assume that our obligations to other human beings will be dropped simply by performing voluntary acts of worship. Rather, the rights of human beings are sacred and cannot be violated without consequence.<\/p>\n<p>Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّهُ حَقٌّ مِنْ حُقُوقِ الْآدَمِيِّينَ وَهِيَ لَا تَسْقُطُ بِالتَّوْبَةِ وَلَا فَرْقَ بَيْنَ الْمَقْتُولِ وَالْمَسْرُوقِ مِنْهُ وَالْمَغْصُوبِ مِنْهُ وَالْمَقْذُوفِ وَسَائِرِ حُقُوقِ الْآدَمِيِّينَ فَإِنَّ الْإِجْمَاعَ مُنْعَقِدٌ عَلَى أَنَّهَا لَا تَسْقُطُ بِالتَّوْبَةِ وَلَا بُدَّ مِنْ أَدَائِهَا إِلَيْهِمْ فِي صِحَّةِ التَّوْبَةِ<\/p>\n<p>Indeed, rights among the rights of human beings are not relinquished by repentance. There is no difference between a victim of murder, theft, assault, slander, or the rest of the rights of human beings. For there is a firmly held consensus that these rights are not relinquished by repentance. They must be restored for repentance to be sound.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 4:92<\/p><\/blockquote>\n<p>And Al-Qurtubi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ كَانَ الذَّنْبُ مِنْ مَظَالِمِ الْعِبَادِ فَلَا تَصِحُّ التَّوْبَةُ مِنْهُ إِلَّا بِرَدِّهِ إِلَى صَاحِبِهِ<\/p>\n<p>If the sin involved an act of wrongdoing against the servants, then repentance is not sound until it is restored to its rightful owner.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 66:8<\/p><\/blockquote>\n<p>And Ibn Mulfih writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ حَقَّ الْمَقْتُولِ لَا يَسْقُطُ بِمُجَرَّدِ التَّوْبَةِ إلَى اللَّهِ عَزَّ وَجَلَّ بَلْ لَا بُدَّ مِنْ الْخُرُوجِ مِنْ مَظْلِمَةِ الْآدَمِيِّينَ<\/p>\n<p>The right of a murdered victim is not relinquished merely by repenting to Allah Almighty. Rather, it must be taken out of the grievances of human beings.<\/p>\n<p>Source: al-Ādāb al-Shar’īyah 1\/59<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا حَقُّ الْمَظْلُومِ فَلَا يَسْقُطُ بِمُجَرَّدِ التَّوْبَةِ وَهَذَا حَقٌّ وَلَا فَرْقَ فِي ذَلِكَ بَيْنَ الْقَاتِلِ وَسَائِرِ الظَّالِمِينَ فَمَنْ تَابَ مِنْ ظُلْمٍ لَمْ يَسْقُطْ بِتَوْبَتِهِ حَقُّ الْمَظْلُومِ لَكِنْ مِنْ تَمَامِ تَوْبَتِهِ أَنْ يُعَوِّضَهُ بِمِثْلِ مَظْلِمَتِهِ<\/p>\n<p>As for the right of the oppressed, this right is not relinquished merely by repentance. There is no difference between a murderer and the rest of the oppressed. Whoever repents from an act of wrongdoing, the right of the oppressed is never relinquished by his repentance alone. Rather, it is among the conditions of his sound repentance that he compensate for the like of his wrong.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 18\/187<\/p><\/blockquote>\n<p>Notice that the scholars have described this issue using broad and inclusive language, such as the “rights of human beings” (<em>huquq al-adamiyyin<\/em>) and “rights of the servants” (<em>huquq al-‘ibad<\/em>). This is because these are universal rights that belong to all human beings by default, such as life, property, and dignity.<\/p>\n<p>When a Muslim fulfills all of the above conditions of repentance, then the sin is expunged from their record of deeds as if one had not sinned at all.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّائِبُ مِنَ الذَّنْبِ كَمَنْ لَا ذَنْبَ لَهُ<\/p>\n<p><strong>The one who completely repented of sin is like one who has not sinned at all.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4250, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/01\/13\/hadith-on-repentance-true-repentance-wipes-away-all-sins\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>We should not take for granted the time we have on earth to acquire this mercy, lest death approach us at any time of any day and from places we would least expect.<\/p>\n<p>We are all going to commit sins, mistakes, errors in judgment, and lapses in perfection, maybe even several times each day. Such is the trial of being human. But it is in the character of believers that, despite how often they might fail and return to a sin, they continue to repent, feel regret, and determine to do better next time.<\/p>\n<p>‘Uqbah ibn ‘Amir reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, one of us has committed a sin.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُكْتَبُ عَلَيْهِ<\/p>\n<p><strong>It will be written against him<\/strong>.<\/p><\/blockquote>\n<p>The man said, “Then he has sought forgiveness and repented.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُغْفَرُ لَهُ وَيُتَابُ عَلَيْهِ<\/p>\n<p><strong>He will be forgiven and his repentance accepted<\/strong>.<\/p><\/blockquote>\n<p>The man said, “Then he returns to committing a sin.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُكْتَبُ عَلَيْهِ<\/p>\n<p><strong>It will be written against him<\/strong>.<\/p><\/blockquote>\n<p>The man said, “Then he has sought forgiveness and repented.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُغْفَرُ لَهُ وَيُتَابُ عَلَيْهِ وَلا يَمَلُّ اللَّهُ حَتَّى تَمَلُّوا<\/p>\n<p><strong>He will be forgiven and his repentance accepted. Allah will not tire of forgiveness unless you tire of asking.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 8918, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/08\/03\/hadith-on-forgiveness-allah-will-not-stop-forgiving-you-unless-you-stop-asking-for-forgiveness\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sufyan al-Thawri reported: It was said to Hasan al-Basri, may Allah have mercy on him, regarding a man who sins and then repents, then sins and repents three more times. Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تِلْكَ أَخْلَاقُ الْمُؤْمِنِ<\/p>\n<p>These are the manners of the believer.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/12\/30\/hasan-on-repentance-the-believers-continue-to-repent-again-and-again\/\">al-Wajīz fī Dhikr al-Majāz 17<\/a><\/p><\/blockquote>\n<p>In sum, Allah is always ready and willing to accept our repentance as long as we do not procrastinate until the moment of our death, which may be at any given time. Repentance is complete if it includes stopping the sin, feeling bad for sinning, determining not to sin again, and restoring the right of a person if they have been violated. Even if we continue to fall back into the same sin, we still need to continue to repent again and again. Allah will never give up on us unless we give up on Him.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O you who have faith, repent to Allah with sincere repentance.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[16,85,26,123,32,34,47,100,54,94,60,306,67,70],"class_list":["post-20133","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-character-akhlaq","tag-fasting-al-siyam","tag-forgiveness-al-maghfirah","tag-friday-prayer-salat-jumuah","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-jihad","tag-manners-al-adab","tag-mercy-al-rahmah","tag-obedience-al-taah","tag-prayer-salat","tag-ramadan","tag-repentance-al-tawbah","tag-sincerity-al-ikhlaas"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5eJ","jetpack-related-posts":[{"id":16650,"url":"https:\/\/www.abuaminaelias.com\/the-purpose-of-prayer-in-islam\/","url_meta":{"origin":20133,"position":0},"title":"Purpose of prayer in Islam","author":"Abu Amina Elias","date":"June 25, 2015","format":false,"excerpt":"\"Verily, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19907,"url":"https:\/\/www.abuaminaelias.com\/if-you-did-not-sin-allah-would-replace-you-with-sinners\/","url_meta":{"origin":20133,"position":1},"title":"If you did not sin, Allah would replace you with sinners","author":"Abu Amina Elias","date":"October 23, 2018","format":false,"excerpt":"\"All of the children of Adam are sinners, and the best sinners are those who repent.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15646,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-repentance-tawbah\/","url_meta":{"origin":20133,"position":2},"title":"Imam al-Nawawi on Repentance, Seeking Forgiveness","author":"Abu Amina Elias","date":"April 15, 2014","format":false,"excerpt":"\"Seek forgiveness from your Lord and repent to Him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23222,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-tawbah-following-sayyiat-hasanat\/","url_meta":{"origin":20133,"position":3},"title":"Imam al-Mundhiri on Repentance, Following Evil with Good","author":"Abu Amina Elias","date":"May 21, 2021","format":false,"excerpt":"\"If you do a bad deed, follow it with a good deed...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15665,"url":"https:\/\/www.abuaminaelias.com\/those-allah-loves-and-does-not-love\/","url_meta":{"origin":20133,"position":4},"title":"Those whom Allah loves and does not love","author":"Abu Amina Elias","date":"April 30, 2014","format":false,"excerpt":"\"Behave well. Verily, Allah loves those who are good.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15796,"url":"https:\/\/www.abuaminaelias.com\/whoever-changes-religion-kill-him\/","url_meta":{"origin":20133,"position":5},"title":"Apostasy: Whoever changes his religion, kill him?","author":"Abu Amina Elias","date":"June 19, 2014","format":false,"excerpt":"\"The most hesitant of people in killing are the people of faith.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20133","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20133"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20133\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20133"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20133"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20133"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}