{"id":20154,"date":"2016-07-04T10:48:38","date_gmt":"2016-07-04T06:48:38","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20154"},"modified":"2025-07-04T11:00:20","modified_gmt":"2025-07-04T07:00:20","slug":"did-the-prophet-try-to-execute-a-man-without-proof","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/did-the-prophet-try-to-execute-a-man-without-proof\/","title":{"rendered":"Did the Prophet try to execute a man without proof?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>There are thousands of traditions reported about the Prophet (s) and interpreting them sometimes requires a deeper reading of a particular text, and its context in history and the whole of Islamic teachings, to acquire understanding of the religion. In general, if we come across a narration that seems confusing on its face, we should assume the best about the Prophet (s) and investigate scholarly interpretations before judging it.<\/p>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا فَظُنُّوا بِهِ الَّذِي هُوَ أَهْنَاهُ وَأَهْدَاهُ وَأَتْقَاهُ<\/p>\n<p>When I narrate to you a tradition from the Messenger of Allah, peace and blessings be upon him, assume from it that he is the most proper, the most guided, and the most righteous.<\/p>\n<p>Source: Sunan Ibn Majāh 20, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/31\/ali-ibn-abu-talib-think-of-the-messenger-of-allah-as-the-best-rightly-guided-and-most-righteous\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>One such narration involves Ali (ra) himself, when the Prophet (s) apparently ordered him to kill a man accused of adultery without the usually required testimony of four public witnesses (an almost impossibly high standard of evidence).<\/p>\n<p>Anas ibn Malik reported: A man was accused of adultery with the concubine mother (<em>umm al-walad<\/em>) of the Messenger of Allah, peace and blessings be upon him, so he ordered Ali to go and strike his neck. Ali came to the man while he was cooling himself in a well. Ali told him to come out and grabbed him by the hand, but when he came out, he saw that he was a eunuch and had no genitalia. Ali refrained from harming him and he went to the Prophet, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا رَسُولَ اللَّهِ إِنَّهُ لَمَجْبُوبٌ مَا لَهُ ذَكَرٌ<\/p>\n<p>O Messenger of Allah, he is a eunuch and he has no genitalia.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2771, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Some people misunderstand a few important points by reading their personal assumptions and biases into this isolated narration. First, concubines are not sex slaves, but rather <a href=\"https:\/\/abuaminaelias.com\/what-does-islam-teach-about-concubines\/\">were analogous to wives with their own set of rights<\/a>, which included not being harmed or compelled into sexual intercourse.<\/p>\n<p>Second, there is the question of why the Prophet (s) did not apply the ordinarily high burden of proof before allegedly sentencing a man to death. Yet the lesson of this tradition is not about law. Imam Muslim, who narrated the tradition, did not include it in his book of legal judgments and so he did not understand it as setting a legal precedent. So what is the lesson?<\/p>\n<p>There are a few possible interpretations of the meaning of this incident, but perhaps the best opinion is that the Prophet (s) had not intended to kill the man at all. He knew the man was innocent of the charge, so he set up a scenario in which Ali and the public would discover the truth for themselves.<\/p>\n<p>Abu Muhammad ibn Hazm writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">من ظن أنه صلى الله عليه وسلم أمر بقتله حقيقة بغير بينة ولا إقرار فقد جهل وإنما كان النبي صلى الله عليه وسلم يعلم أنه بريء مما نسب إليه ورمي به وأن الذي ينسب إليه كذب فأراد صلى الله عليه وسلم إظهار الناس على براءته يوقفهم على ذلك مشاهدة فبعث عليا ومن معه فشاهدوه مجبوبا أي مقطوع الذكر فلم يمكنه قتله لبراءته مما نسب إليه وجعل هذا نظير قصة سليمان في حكمه بين المرأتين المختلفتين في الولد فطلب السكين ليشقه نصفين إلهاما ولظهور الحق<\/p>\n<p>Whoever assumes that the Prophet (s) truly commanded his killing without evidence or due process is ignorant. Indeed, he knew the man was innocent of what he was accused, that those who attributed it to him were lying. He intended to show people his innocence and for them to agree upon it by witnessing to it. He sent Ali and those with him to bear witness that he was a eunuch – his genitalia was cut – so they did not carry out his killing due to what was attributed to him. He made this an equivalent lesson to the story of Solomon in his wisdom between the two women differing over the child, so he brought the knife pretending to cut him into two parts to show them the truth.<\/p>\n<p>Source: Subul al-Hudá wal Rashād 10\/432<\/p><\/blockquote>\n<p>In the famous story of Solomon, peace be upon him, two women both had claimed a child as their own. To resolve the dispute, Solomon ordered his companions to bring a knife and cut the child into two pieces. Upon hearing this, the real mother relented rather that seeing her child killed, thus the true mother was revealed. He had never planned to harm the child.<\/p>\n<p>Likewise, the Prophet (s) initially gave the order to kill the man but, being guided by divine revelation, he knew that the situation would resolve itself on its own. It was a teaching mechanism for Ali, who would later become the fourth of the righteous caliphs and who was famous for his wise judgment. Ali learned not to make assumptions of guilt from hearsay alone.<\/p>\n<p>As in the story of Al-Khidr and Moses in Surat al-Kahf, one should not rush to judgment based merely upon outward appearances, but rather one must gather all the facts (i.e. <em>context<\/em>) before an appropriate conclusion can be made.<\/p>\n<p>In a similar reading, the man had indeed misbehaved by improperly secluding himself with the concubine Maryah but he had not committed adultery, so the Prophet (s) only intended to frighten him for doing so while at the same time publicly proving his innocence.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَأَوَّلَهُ بَعْضُهُمْ عَلَى أَنَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُرِدْ حَقِيقَةَ الْقَتْلِ إِنَّمَا أَرَادَ تَخْوِيفَهُ لِيَزْدَجِرَ عَنْ مَجِيئِهِ إِلَيْهَا قَالَ وَهَذَا كَمَا قَالَ سُلَيْمَانُ لِلْمَرْأَتَيْنِ اللَّتَيْنِ اخْتَصَمَتَا إِلَيْهِ فِي الْوَلَدِ عَلَيَّ بِالسِّكِّينِ حَتَّى أَشُقَّ الْوَلَدَ بَيْنَهُمَا وَلَمْ يُرِدْ أَنْ يَفْعَلَ ذَلِكَ بَلْ قَصَدَ اسْتِعْلَامَ الْأَمْرِ مِنْ هَذَا الْقَوْلِ<\/p>\n<p style=\"text-align: right;\"> وَلِذَلِكَ كَانَ مِنْ تَرَاجِمِ الْأَئِمَّةِ عَلَى هَذَا الْحَدِيثِ بَابُ الْحَاكِمِ يُوهِمُ خِلَافَ الْحَقِّ لَيُتَوَصَّلَ بِهِ إِلَى مَعْرِفَةِ الْحَقِّ فَأَحَبَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَعْرِفَ الصَّحَابَةُ بَرَاءَتَهُ وَبَرَاءَةَ مارية وَعُلِمَ أَنَّهُ إِذَا عَايَنَ السَّيْفَ كَشَفَ عَنْ حَقِيقَةِ حَالِهِ فَجَاءَ الْأَمْرُ كَمَا قَدَّرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>Some interpret the tradition as if the Prophet (s) truly did not intend to kill him. Indeed, he only intended to frighten him as a rebuke for coming near to her. They said it was as Solomon had said to the two women disputing each other about the child: I will bring the knife until I cleave the child in half. He did not intend to do that, but rather his purpose was to make the matter of this statement known.<\/p>\n<p>For this reason, the Imams understood the lesson of this tradition to be that the judge can pretend to believe differently from the truth as a means to arrive at recognition of the truth. The Prophet (s) liked for the innocence of the companion to be made known, as well as the innocence of Maryah. He knew that when the man saw the sword, he would reveal the reality of his condition and thus the matter concluded as the Prophet had estimated.<\/p>\n<p>Source: Zād al-Ma&#8217;ād 5\/15<\/p><\/blockquote>\n<p>In this view, it was from the prophetic wisdom that the Prophet (s) would know that Ali would have discovered the truth and arrived at the correct judgement for himself, thereby exonerating both the man and Maryah of the accusations against them.<\/p>\n<p>We should always assume the best of the Prophet (s) whenever we come across narrations that, on a superficial level, seem to contradict the Quran or the whole of Islamic teachings. The Prophet was divinely inspired and therefore his actions, while sometimes counter-intuitive at first, reveal profound wisdom when fully investigated in context.<\/p>\n<p>As for those who deliberately misrepresent the Sunnah, our only duty is to clearly convey the truth to whomever wishes to know it.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;We should always assume the best of the Prophet (s),&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[127,12,48,55,57,137,128],"class_list":["post-20154","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-adultery-zina","tag-ali-ibn-abi-talib","tag-justice-adl","tag-methodology-al-minhaj","tag-moses-musa","tag-solomon-sulayman","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5f4","jetpack-related-posts":[{"id":20313,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-the-witr-prayer\/","url_meta":{"origin":20154,"position":0},"title":"Imam al-Nawawi on Witr Prayer","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Perform Witr prayer before the morning.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":20154,"position":1},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14832,"url":"https:\/\/www.abuaminaelias.com\/did-prophet-use-profanity\/","url_meta":{"origin":20154,"position":2},"title":"Did Prophet Muhammad use profanity?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The believer does not use profanity...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21204,"url":"https:\/\/www.abuaminaelias.com\/textual-corruption-of-surat-al-asr\/","url_meta":{"origin":20154,"position":3},"title":"Textual corruption of Surat al-‘Asr?","author":"Abu Amina Elias","date":"September 18, 2019","format":false,"excerpt":"\"By the time and calamities of age!\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19476,"url":"https:\/\/www.abuaminaelias.com\/ali-ibn-abi-talib-rape-girl\/","url_meta":{"origin":20154,"position":4},"title":"Did &#8216;Ali ibn Abi Talib rape an underage girl?","author":"Abu Amina Elias","date":"April 16, 2018","format":false,"excerpt":"\"Do not cause harm or return harm.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12649,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-supplications-for-the-prophet-muhammad\/","url_meta":{"origin":20154,"position":5},"title":"Imam al-Nawawi on Sending Blessings upon Muhammad","author":"Abu Amina Elias","date":"January 22, 2013","format":false,"excerpt":"\"Whoever blesses me once will be blessed by Allah ten times.\" --Sahih Muslim 408","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20154","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20154"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20154\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}