{"id":20440,"date":"2019-06-15T17:45:31","date_gmt":"2019-06-15T13:45:31","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20440"},"modified":"2025-03-22T13:25:12","modified_gmt":"2025-03-22T09:25:12","slug":"al-mundhiri-smiles-kalimat-tayyibah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-smiles-kalimat-tayyibah\/","title":{"rendered":"Imam al-Mundhiri on Smiling, Cheerfulness, and Kind Words"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في طلاقة الوجه وطيب الكلام<\/p>\n<p>Inspiration to show a cheerful face and speak kind words.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 3\/421<\/p><\/blockquote>\n<p>Abu Dharr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ<\/p>\n<p><strong>Do not belittle any good deed, even meeting your brother with a cheerful face.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2626, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/06\/22\/all-good-deeds-are-rewarded\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn &#8216;Abdillah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَعْرُوفٍ صَدَقَةٌ وَإِنَّ مِنْ الْمَعْرُوفِ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ وَأَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ أَخِيكَ<\/p>\n<p><strong>Every good deed is charity. Verily, it is a good deed to meet your brother with a smiling face, and to pour what is left from your bucket into your brother&#8217;s vessel.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1970, Grade:<strong><em> <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/24\/kull-maruf-sadaqah-smiling\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ وَأَمْرُكَ بِالْمَعْرُوفِ وَنَهْيُكَ عَنْ الْمُنْكَرِ صَدَقَةٌ وَإِرْشَادُكَ الرَّجُلَ فِي أَرْضِ الضَّلَالِ لَكَ صَدَقَةٌ وَبَصَرُكَ لِلرَّجُلِ الرَّدِيءِ الْبَصَرِ لَكَ صَدَقَةٌ وَإِمَاطَتُكَ الْحَجَرَ وَالشَّوْكَةَ وَالْعَظْمَ عَنْ الطَّرِيقِ لَكَ صَدَقَةٌ وَإِفْرَاغُكَ مِنْ دَلْوِكَ فِي دَلْوِ أَخِيكَ لَكَ صَدَقَةٌ<\/p>\n<p><strong>Smiling in the face of your brother is your charity. Enjoining good and forbidding evil is charity. Guiding a lost man through the land is your charity. Lending your eyesight to a man who cannot see well is your charity. Removing rocks, thorns, and bones from the road is your charity. Pouring your leftovers into your brother’s vessel is your charity.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1956, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/15\/cheerful-face-sadaqah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ تَبَسُّمَكَ فِي وَجْهِ أَخِيكَ صَدَقَةٌ وَإِمَاطَتَكَ الْأَذَى عَنِ الطَّرِيقِ يُكْتَبُ لَكَ صَدَقَةٌ وَإِنَّ إِفْرَاغَكَ فِي دَلْوِ أَخِيكَ صَدَقَةٌ وَأَمْرَكَ بِالْمَعْرُوفِ وَنَهْيَكَ عَنِ الْمُنْكَرِ لَكَ صَدَقَةٌ وَإِرْشَادَكَ الضَّالَّةَ صَدَقَةٌ<\/p>\n<p><strong>Verily, your smile in the face of your brother is charity. Lifting harmful things from the road is recorded for you as charity. Pouring your leftovers into your brother’s vessel is charity. Enjoining good and forbidding evil is your charity. Guiding a lost person is charity.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ lil-Ṭabarānī 8342, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/15\/removing-harm-enjoining-good\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Jurayy reported: I came to the Messenger of Allah, peace and blessings be upon him, and I said, “O Messenger of Allah, we are people of the desert. Teach us something with which Allah will benefit us.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَلَوْ أَنْ تُكَلِّمَ أَخَاكَ وَوَجْهُكَ إِلَيْهِ مُنْبَسِطٌ وَإِيَّاكَ وَإِسْبَالَ الإِزَارِ فَإِنَّهُ مِنَ الْمَخِيلَةِ وَلا يُحِبُّهَا اللَّهُ وَإِنِ امْرُؤٌ شَتَمَكَ بِمَا يَعْلَمُ فِيكَ فَلا تَشْتُمْهُ بِمَا تَعْلَمُ فِيهِ فَإِنَّ أَجْرَهُ لَكَ وَوَبَالَهُ عَلَى مَنْ قَالَهُ<\/p>\n<p><strong>Do not belittle any good deed, even pouring your leftovers into another’s cistern, even speaking to your brother while smiling at him. Beware of trailing your garment; it is a form of vanity that Allah does not approve. If a man insults you with what he knows about you, do not insult him with what you know about him. Verily, you will have a reward, and the penalty is upon the one who spoke it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 522, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/15\/not-belittle-any-sadaqah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ<\/p>\n<p><strong>A kind word is charity.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2989, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/14\/every-joint-charity-due\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Adi ibn Hatim reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ<\/p>\n<p><strong>Guard yourself from the Hellfire, even with half of a date in charity. If he cannot find it, then with a kind word<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6540, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/14\/save-yourself-hellfire-date\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Shurayh reported: He said, “O Messenger of Allah, tell me something that will guarantee Paradise for me.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">طِيبُ الْكَلامِ وَبَذْلُ السَّلامِ وَإِطْعَامُ الطَّعَامِ<\/p>\n<p><strong>Speak kind words, offer peace, and feed the hungry<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 509, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/09\/09\/kind-words-peace-feed\/\"><em>Jayyid<\/em><\/a><\/p><\/blockquote>\n<p>Hani’ ibn Yazid reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ مُوجِبَاتِ الْمَغْفِرَةِ بَذْلُ السَّلامِ وَحُسْنُ الْكَلامِ<\/p>\n<p><strong>Verily, among the deeds that must result in forgiveness are offering peace and good words<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 22\/180, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/02\/17\/salaam-kalimat-tayyibah-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي الْجَنَّةِ غُرْفَةً يُرَى ظَاهِرُهَا مِنْ بَاطِنِهَا وَبَاطِنُهَا مِنْ ظَاهِرِهَا<\/p>\n<p><strong>Verily, in Paradise, are rooms whose outside can be seen from inside and whose inside can be seen from outside.<\/strong><\/p><\/blockquote>\n<p>Abu Musa said, “Who are they for, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِمَنْ أَلَانَ الْكَلَامَ وَأَطْعَمَ الطَّعَامَ وَبَاتَ لِلَّهِ قَائِمًا وَالنَّاسُ نِيَامٌ<\/p>\n<p><strong>For those who speak mildly, feed the hungry, and spend the night standing for the sake of Allah while people sleep<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 6615, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/15\/special-rooms-in-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ali ibn Abi Talib reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي الْجَنَّةِ غُرَفًا تُرَى ظُهُورُهَا مِنْ بُطُونِهَا وَبُطُونُهَا مِنْ ظُهُورِهَا<\/p>\n<p><strong>Verily, in Paradise, are chambers whose outside can be seen from the inside, and whose inside can be seen from the outside.<\/strong><\/p><\/blockquote>\n<p>A man stood up, saying, “Who are they for, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِمَنْ أَطَابَ الْكَلَامَ وَأَطْعَمَ الطَّعَامَ وَأَدَامَ الصِّيَامَ وَصَلَّى لِلَّهِ بِاللَّيْلِ وَالنَّاسُ نِيَامٌ<\/p>\n<p><strong>For those who speak kind words, feed the poor, regularly fast, and pray to Allah at night while people sleep<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1984, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/06\/23\/amazing-paradise-jannah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي الْجَنَّةِ غُرْفَةً يُرَى ظَاهِرُهَا مِنْ بَاطِنِهَا وَبَاطِنُهَا مِنْ ظَاهِرِهَا أَعَدَّهَا اللهُ لِمَنْ أَطْعَمَ الطَّعَامَ وَأَلَانَ الْكَلَامَ وَتَابَعَ الصَّلَاةَ وَقَامَ بِاللَّيْلِ وَالنَّاسُ نِيَامٌ<\/p>\n<p><strong>Verily, in Paradise, are rooms whose outside can be seen from the inside, and whose interior can be seen from the outside. Allah has prepared them for those who feed the hungry, speak mildly, regularly perform prayer, and stand at night while people sleep.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 3466, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/22\/rooms-in-jannah\/\"><em><strong>Sahih li ghayrihi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas reported: A man said to the Prophet, peace and blessings be upon him, “Teach me deeds that will admit me into Paradise.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَطْعِمِ الطَّعَامَ وَأَفْشِ السَّلامَ وَأَطِبِ الْكَلامَ وَصَلِّ بِاللَّيْلِ وَالنَّاسُ نِيَامٌ تَدْخُلُ الْجَنَّةَ بِسَلامٍ<\/p>\n<p><strong>Feed the hungry, spread peace, speak kind words, and pray at night when people sleep. You will enter Paradise in peace<\/strong>.<\/p>\n<p>Source: Musnad al-Bazzār 2497, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/15\/kind-words-in-paradise\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Smiling in the face of your brother is charity,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[16,17,168,85,26,135,32,48,100,134,59,60],"class_list":["post-20440","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-character-akhlaq","tag-charity-al-sadaqah","tag-enjoin-good-amr-bil-maruf","tag-fasting-al-siyam","tag-forgiveness-al-maghfirah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-justice-adl","tag-manners-al-adab","tag-paradise-jannah","tag-peace","tag-prayer-salat"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5jG","jetpack-related-posts":[{"id":20531,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nifaq-two-faces-forked-tongues\/","url_meta":{"origin":20440,"position":0},"title":"Imam al-Mundhiri on Hypocrisy, Two-faces, and Forked-tongues","author":"Abu Amina Elias","date":"June 21, 2019","format":false,"excerpt":"\"We used to consider that hypocrisy.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":20440,"position":1},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20462,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-shaking-hands-greeting\/","url_meta":{"origin":20440,"position":2},"title":"Imam al-Mundhiri on Shaking Hands","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Allah forgives them before they part.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23854,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bribery-hukm\/","url_meta":{"origin":20440,"position":3},"title":"Imam al-Mundhiri on Bribery in Judgment","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Warning against giving and taking bribes, and pursuing either of them.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20443,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-accusing-kufr-takfir\/","url_meta":{"origin":20440,"position":4},"title":"Imam al-Mundhiri on Accusing Believers of Unbelief, Takfir","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Accusing a believer of unbelief is like killing him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23075,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-committing-to-the-quran-reciting-pleasantly\/","url_meta":{"origin":20440,"position":5},"title":"Imam al-Mundhiri on Committing to the Quran, Reciting Pleasantly","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Strive to remember the Quran, for it is quicker to escape the hearts of men than camels.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20440","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20440"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20440\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20440"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20440"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20440"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}