{"id":20451,"date":"2019-06-16T11:18:04","date_gmt":"2019-06-16T07:18:04","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20451"},"modified":"2025-03-22T15:57:37","modified_gmt":"2025-03-22T11:57:37","slug":"al-mundhiri-hatred-malice-boycotting","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-hatred-malice-boycotting\/","title":{"rendered":"Imam al-Mundhiri on Mutual-Hatred, Grudges, and Boycotting"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترهيب من التهاجر والتشاحن والتدابر<\/p>\n<p>Discouragement of boycotting, mutual-hatred, and turning backs on one another.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 3\/454<\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا وَلَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثٍ<\/p>\n<p><strong>Do not hate each other, do not envy each other, do not turn away from each other, but rather be servants of Allah as brothers. It is not lawful for a Muslim to boycott his brother for more than three days.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6065, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/03\/servants-allah-brothers-sisters\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Ayyub reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلَامِ<\/p>\n<p><strong>It is not lawful for a Muslim to boycott his brother for more than three nights, such that they meet each other and turn away. The better of the two is the one who initiates the greeting of peace<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6077, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/05\/better-of-them-salaam\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam Ibn ‘Abdul Barr commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَجْمَعَ الْعُلَمَاءُ عَلَى أَنَّهُ لَا يَجُوزُ لِلْمُسْلِمِ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثٍ إِلَّا أَنْ يَكُونَ يَخَافُ مِنْ مُكَالَمَتِهِ وَصِلَتِهِ مَا يُفْسِدُ عَلَيْهِ دِينَهُ أَوْ يُوَلِّدُ بِهِ عَلَى نَفْسِهِ مَضَرَّةً فِي دِينِهِ أَوْ دُنْيَاهُ فَإِنْ كَانَ ذَلِكَ فَقَدْ رُخِّصَ لَهُ فِي مُجَانَبَتِهِ وَبُعْدِهِ وَرُبَّ صَرْمٍ جَمِيلٍ خَيْرٌ مِنْ مُخَالَطَةٍ مُؤْذِيَةٍ<\/p>\n<p>The scholars agreed that it is not permissible for a Muslim to boycott his brother for more than three days, except if he fears that speaking to them and associating with them may corrupt his religion, or expose himself to harm in his religion or worldly affairs. If that is the case, he is granted a concession allowing him to avoid them and keep away from them, for perhaps cutting off ties with them and gracefully forsaking them will be better than mixing with them in a way that leads to harm.<\/p>\n<p>Source: al-Tamhīd li-Ibn ‘Abd al-Barr 6\/127<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثٍ فَمَنْ هَجَرَ فَوْقَ ثَلَاثٍ فَمَاتَ دَخَلَ النَّارَ<\/p>\n<p><strong>It is not lawful for a Muslim to boycott his brother for more than three days. Whoever boycotts for more than three days and dies, he will enter Hellfire.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4914, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/hellfire-dies-boycotting-akh\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَكُونُ لِمُسْلِمٍ أَنْ يَهْجُرَ مُسْلِمًا فَوْقَ ثَلَاثَةٍ فَإِذَا لَقِيَهُ سَلَّمَ عَلَيْهِ ثَلَاثَ مِرَارٍ كُلُّ ذَلِكَ لَا يَرُدُّ عَلَيْهِ فَقَدْ بَاءَ بِإِثْمِهِ<\/p>\n<p><strong>A Muslim may not boycott another Muslim for more than three days. Then, if he meets him, greets him with peace three times, and he receives no response, the sin falls back on the one still boycotting.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4913, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/after-three-days-sin-backfires\/\">Qawi<\/a><\/em><\/p><\/blockquote>\n<p>Hisham ibn ‘Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ مُسْلِمًا فَوْقَ ثَلَاثِ لَيَالٍ فَإِنَّهُمَا نَاكِبَانِ عَنْ الْحَقِّ مَا دَامَا عَلَى صُرَامِهِمَا وَأَوَّلُهُمَا فَيْئًا يَكُونُ سَبْقُهُ بِالْفَيْءِ كَفَّارَةً لَهُ وَإِنْ سَلَّمَ فَلَمْ يَقْبَلْ وَرَدَّ عَلَيْهِ سَلَامَهُ رَدَّتْ عَلَيْهِ الْمَلَائِكَةُ وَرَدَّ عَلَى الْآخَرِ الشَّيْطَانُ وَإِنْ مَاتَا عَلَى صُرَامِهِمَا لَمْ يَدْخُلَا الْجَنَّةَ جَمِيعًا أَبَدًا<\/p>\n<p><strong>It is not lawful for a Muslim to boycott another Muslim for longer than three nights. Verily, they are both diverting from the truth as long as they are divided. The first of them to return will have his sin expiated by his initiative in returning. If he greets him with peace and he does not accept it, and he rejects his offer of peace, the angels will respond to his greeting of peace and Satan will respond to the other. If they both die while they are divided, they will never enter Paradise together.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16257, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/10\/29\/boycotts-not-enter-jannah-divided\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ الْهَجْرُ فَوْقَ ثَلَاثَةِ أَيَّامٍ فَإِنْ الْتَقَيَا فَسَلَّمَ أَحَدُهُمَا عَلَى الْآخَرِ فَرَدَّ عَلَيْهِ الْآخَرُ السَّلَامَ اشْتَرَكَا فِي الْأَجْرِ وَإِنْ أَبَى الْآخَرُ أَنْ يَرُدَّ السَّلَامَ بَرِئَ هَذَا مِنَ الْإِثْمِ وَبَاءَ بِهِ الْآخَرُ وَقَدْ خَشِيتُ إِنْ مَاتَا وَهُمَا مُتَهَاجِرَانِ أَنْ لَا يَجْتَمِعَا فِي الْجَنَّةِ<\/p>\n<p><strong>It is not lawful to boycott for more than three days. If the two meet and one greets the other with peace and receives a response, they will share the reward. If the other refuses to return his greeting, he is free of sin and it backfires against the one boycotting. I fear that if the two die while boycotting each other, they will not be together in Paradise.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ lil-Ṭabarānī 8930, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/prophet-fears-boycotting\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Fadalah ibn ‘Ubayd reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ هَجَرَ أَخَاهُ فَوْقَ ثَلَاثٍ فَهُوَ فِي النَّارِ إِلَّا أَنْ يَتَدَارَكَهُ اللَّهُ بِكَرَمِهِ<\/p>\n<p><strong>Whoever boycotts his brother for more than three days, he is in the Hellfire unless the generosity of Allah reaches him.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 18\/315, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/boycotts-unless-allah-mercy\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Khirash al-Sulami reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ هَجَرَ أَخَاهُ سَنَةً فَهُوَ كَسَفْكِ دَمِهِ<\/p>\n<p><strong>Whoever boycotts his brother for a year, it is as if he has shed his blood.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4915, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/08\/boycott-year-killing\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn &#8216;Abdillah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الشَّيْطَانَ قَدْ يَئِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ وَلَكِنْ فِي التَّحْرِيشِ بَيْنَهُمْ<\/p>\n<p><strong>Verily, Satan has given up that those who pray will ever worship him, so rather he incites hateful discord between them.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1937, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/26\/shaytan-tahrish-baynakum\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَتَهَاجَرْ رَجُلَانِ قَدْ دَخَلَا فِي الْإِسْلَامِ إِلَّا خَرَجَ أَحَدُهُمَا مِنْهُ حَتَّى يَرْجِعَ وَرُجُوعُهُ أَنْ يَأْتِيَهُ فَيُسَلِّمَ عَلَيْهِ<\/p>\n<p>No two men who have entered Islam boycott each other but that one of them has left it until he returns. His return to Islam is going to him and greeting him with peace.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 8904, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/ibn-masud-boycott-reconcile\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ لَا يُشْرِكُ بِاللَّهِ شَيْئًا إِلَّا رَجُلًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا<\/p>\n<p><strong>The gates of Paradise are opened on Monday and Thursday. Allah forgives every servant who does not associate anything with him, except a man with enmity between himself and his brother. It will be said, &#8216;Delay these two until they reconcile, delay these two until they reconcile<\/strong>.&#8217;<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2565, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/14\/no-jannah-until-islah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَطْلُعُ اللَّهُ إِلَى خَلْقِهِ فِي لَيْلَةِ النِّصْفِ مِنْ شَعْبَانَ فَيَغْفِرُ لِجَمِيعِ خَلْقِهِ إِلا لِمُشْرِكٍ أَوْ مُشَاحِنٍ<\/p>\n<p><strong>Allah looks down at his creation on the middle night of Sha’ban and he forgive all of his creatures, except for an idolater or one harboring hatred.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 5665, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/forgives-shaban-except-mushrik\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَيَطَّلِعُ فِي لَيْلَةِ النِّصْفِ مِنْ شَعْبَانَ فَيَغْفِرُ لِجَمِيعِ خَلْقِهِ إِلَّا لِمُشْرِكٍ أَوْ مُشَاحِنٍ<\/p>\n<p><strong>Verily, Allah looks down in middle night of Sha’ban and He forgives all of His creatures, except for an idolater or one filled with malice.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 1390, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/06\/13\/middle-shaban-forgive\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Tha’labah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا كَانَ لَيْلَةُ النِّصْفِ مِنْ شَعْبَانَ اطَّلَعَ اللهُ إِلَى خَلْقِهِ فَيَغْفِرُ لِلْمُؤْمِنِ وَيُمْلِي لِلْكَافِرِينَ وَيَدَعُ أَهْلَ الْحِقْدِ بِحِقْدِهِمْ حَتَّى يَدَعُوهُ<\/p>\n<p><strong>On the middle night of Sha’ban, Allah looks down upon His creation and He forgives the believers, gives respite to the unbelievers, and He abandons the people of malice to their malice until they give it up.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān lil-Bayhaqī 3551, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/16\/leaves-people-of-grudges\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not hate each other, do not envy each other,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[241,61,16,18,105,26,114,30,135,32,37,100,54,134,59,68,98],"class_list":["post-20451","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-brotherhood-al-ikhwa","tag-call-to-islam-dawah","tag-character-akhlaq","tag-community-jamaah","tag-envy-al-hasad","tag-forgiveness-al-maghfirah","tag-generosity-al-karam","tag-hatred-bigdah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-idolatry-shirk","tag-manners-al-adab","tag-mercy-al-rahmah","tag-paradise-jannah","tag-peace","tag-satan-al-shaytan","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5jR","jetpack-related-posts":[{"id":20419,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-tazkiyyah-qalb-hasad\/","url_meta":{"origin":20451,"position":0},"title":"Imam al-Mundhiri on Purifying the Heart from Envy","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Faith and envy do not combine within a believing servant.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20459,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-reconciliation-between-people\/","url_meta":{"origin":20451,"position":1},"title":"Imam al-Mundhiri on Reconciling People","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Best act of charity is to reconcile people.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":20451,"position":2},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20443,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-accusing-kufr-takfir\/","url_meta":{"origin":20451,"position":3},"title":"Imam al-Mundhiri on Accusing Believers of Unbelief, Takfir","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Accusing a believer of unbelief is like killing him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20469,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-praying-dua-behind-back\/","url_meta":{"origin":20451,"position":4},"title":"Imam al-Mundhiri on Praying for someone behind their back","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"The angel says: And for you the same.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20510,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-gossip-rumors-talebearing\/","url_meta":{"origin":20451,"position":5},"title":"Imam al-Mundhiri on Gossip, Rumors, and Talebearing","author":"Abu Amina Elias","date":"June 18, 2019","format":false,"excerpt":"\"The gossip-monger will not enter Paradise.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20451","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20451"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20451\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20451"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20451"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20451"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}