{"id":20478,"date":"2019-06-17T15:16:08","date_gmt":"2019-06-17T11:16:08","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20478"},"modified":"2025-03-22T09:51:27","modified_gmt":"2025-03-22T05:51:27","slug":"al-mundhiri-love-for-sake-of-allah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-love-for-sake-of-allah\/","title":{"rendered":"Imam al-Mundhiri on Love for the Sake of Allah"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في الحب في الله تعالى<\/p>\n<p>Encouragement to love for the sake of Allah Almighty<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 4\/14<\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَجِدُ أَحَدٌ حَلَاوَةَ الْإِيمَانِ حَتَّى يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ وَحَتَّى أَنْ يُقْذَفَ فِي النَّارِ أَحَبُّ إِلَيْهِ مِنْ أَنْ يَرْجِعَ إِلَى الْكُفْرِ بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ وَحَتَّى يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا<\/p>\n<p><strong>None will taste the sweetness of faith until he loves a person only for the sake of Allah, until he would rather be thrown in the fire than to return to unbelief, and until Allah and his messenger are more beloved to him than anything else<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5694, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/17\/sweetness-of-faith-love\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ بِجَلَالِي الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي<\/p>\n<p><strong>Verily, Allah will say on the Day of Resurrection: Where are those who love each other for the sake of my glory? Today, I will shelter them in my shade on a day when there is no shade but mine<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2566, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/love-each-other-shade-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَرَّهُ أَنْ يَجِدَ حَلاوَةَ الإِيمَانِ فَلْيُحِبَّ الْمَرْءَ لا يُحِبُّهُ إِلا لِلَّهِ عَزَّ وَجَلَّ<\/p>\n<p><strong>Whoever would be pleased to taste the sweetness of faith, let him love a person only for the sake of Allah<\/strong>.<\/p>\n<p>Source: Shu’ab al-Imān 8440, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/sweetness-iman-to-love\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَرَادَ أَنْ يُصِيبَ حَقِيقَةَ الإِيمَانِ فَلْيُحِبَّ الْمَرْءَ لا يُحِبُّهُ إِلا فِي اللَّهِ<\/p>\n<p><strong>Whoever intends to achieve the reality of faith, let him love a person only for the sake of Allah.<\/strong>”<\/p>\n<p>Source: Shu’ab al-Imān 8441, Grade: <strong><em>Sahih li ghayrihi<\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَبْعَةٌ يُظِلُّهُمْ اللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ الْإِمَامُ الْعَادِلُ وَشَابٌّ نَشَأَ بِعِبَادَةِ اللَّهِ وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسَاجِدِ وَرَجُلَانِ تَحَابَّا فِي اللَّهِ اجْتَمَعَا عَلَيْهِ وَتَفَرَّقَا عَلَيْهِ وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّي أَخَافُ اللَّهَ وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لَا تَعْلَمَ يَمِينُهُ مَا تُنْفِقُ شِمَالُهُ وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ<\/p>\n<p><strong>There are seven whom Allah will shade on a day when there is no shade but his. They are a just ruler, a youth who grew up in the worship of Allah, one whose heart is attached to the mosques, two who love each other, meet ,and depart from each other for the sake of Allah, a man who is tempted by a beautiful woman of high status but he rejects her, saying ,’I fear Allah,’ one spends in charity and conceals it such that his right hand does not know what his left hand has given, and one who remembered Allah in private and he wept.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 629, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/08\/seven-shaded-by-allah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ رَجُلَيْنِ تَحَابَّا فِي اللَّهِ بِظَهْرِ الْغَيْبِ إِلا كَانَ أَحَبُّهُمَا إِلَى اللَّهِ أَشَدَّهُمَا حُبًّا لِصَاحِبِهِ<\/p>\n<p><strong>No two men love each other for the sake of Allah, behind their backs, but that the most beloved of them to Allah has the strongest love for his companion.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 5424, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/allah-loves-most-others\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَحَابَّ اثْنَانِ فِي اللَّهِ إِلا كَانَ أَفْضَلَهُمَا أَشَدُّهُمَا حُبًّا لِصَاحِبِهِ<\/p>\n<p><strong>No two persons love each other for the sake of Allah but that the better of the two is the one with the strongest love for his companion<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 571, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/better-person-stronger-love\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Munawi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَشَدُّهُمَا حُبًّا لِصَاحِبِهِ أي في الله تعالى لا لغرض دنيوي وتأكد المحبة من الحقوق التي يوجبها عقد الصحبة والضابط فيه أن يعامله بما يحب أن يعامل به فمن لا يحب لأخيه ما يحب لنفسه فأخوته نفاق وهو عليه في الدنيا والآخرة<\/p>\n<p>‘<strong>The strongest love for his companion<\/strong>,’ meaning, for the sake of Allah Almighty and no other worldly purpose. He affirms love among the rights that are obligatory in a bond of fellowship. The criteria of it is that he treats him as he would love to be treated by him. For whoever does not love for his brother what he loves for himself, his fellowship is hypocrisy and it will be against him in the world and in the Hereafter.<\/p>\n<p>Source: Fayḍ al-Qadīr 5\/435<\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ الأَصْحَابِ عِنْدَ اللَّهِ خَيْرُهُمْ لِصَاحِبِهِ وَخَيْرُ الْجِيرَانِ عِنْدَ اللَّهِ خَيْرُهُمْ لِجَارِهِ<\/p>\n<p><strong>The best companion to Allah is the best to his companions, and the best neighbor to Allah is the best to his neighbors<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1944, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/23\/best-neighbor-companion\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَجُلًا زَارَ أَخًا لَهُ فِي قَرْيَةٍ أُخْرَى فَأَرْصَدَ اللَّهُ لَهُ عَلَى مَدْرَجَتِهِ مَلَكًا فَلَمَّا أَتَى عَلَيْهِ قَالَ أَيْنَ تُرِيدُ قَالَ أُرِيدُ أَخًا لِي فِي هَذِهِ الْقَرْيَةِ قَالَ هَلْ لَكَ عَلَيْهِ مِنْ نِعْمَةٍ تَرُبُّهَا قَالَ لَا غَيْرَ أَنِّي أَحْبَبْتُهُ فِي اللَّهِ عَزَّ وَجَلَّ قَالَ فَإِنِّي رَسُولُ اللَّهِ إِلَيْكَ بِأَنَّ اللَّهَ قَدْ أَحَبَّكَ كَمَا أَحْبَبْتَهُ فِيهِ<\/p>\n<p><strong>A man set out to visit his brother from another town, so Allah sent an angel to watch over his steps. When the angel came to him, he said: Where are you going? The man said: I am visiting a brother of mine in this town. The angel said: Do you have a favor over him to be repaid? He said: No, only that I love him for the sake of Allah Almighty. The angel said: I am a messenger from Allah to tell you that Allah loves you as you love him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2567, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/29\/allah-loves-you-as-you-love-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Ubadah ibn al-Samit reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تعالى حَقَّتْ مَحَبَّتِي لِلْمُتَحَابِّينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَزَاوِرِينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَبَاذِلِينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَوَاصِلِينَ فِيَّ<\/p>\n<p><strong>Allah Almighty said: My love is a right upon those who love each other for my sake. My love is a right upon those who visit each other for my sake. My love is a right upon those who sit together for my sake. My love is a right upon those who maintain relations for my sake<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 21575, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/23\/allah-love-haqq-each-other\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ وَجَبَتْ مَحَبَّتِي لِلْمُتَحَابِّينَ فِيَّ وَالْمُتَجَالِسِينَ فِيَّ وَالْمُتَزَاوِرِينَ فِيَّ وَالْمُتَبَاذِلِينَ فِيَّ<\/p>\n<p><strong>Allah Almighty said:<\/strong> <strong>My love is assured for those who love each other for my sake, who sit together for my sake, who visit each other for my sake, and who spend on each other for my sake<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 21525, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/23\/love-allah-assured-each-other\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْمُتَحَابُّونَ فِي جَلَالِي لَهُمْ مَنَابِرُ مِنْ نُورٍ يَغْبِطُهُمْ النَّبِيُّونَ وَالشُّهَدَاءُ<\/p>\n<p><strong>Allah Almighty said: Those who love each other for the sake of my glory will be upon pulpits of light, admired by the prophets and the martyrs.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2390, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/02\/admired-prophets-martyrs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Amr ibn ‘Abasah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَعَالَى حَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَصَادَقُونَ مِنْ أَجْلِي وَحَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَنَاصَرُونَ مِنْ أَجْلِي<\/p>\n<p><strong>Allah Almighty said: My love is a right upon those who befriend each other for my sake. My love is a right upon those who defend each other for my sake.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Ṣaghīr 1092, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/love-friends-for-his-sake\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ جُلَسَاءَ يَوْمَ الْقِيَامَةِ عَنْ يَمِينِ الْعَرْشِ وَكِلْتَا يَدَيِ اللَّهِ يَمِينٌ عَلَى مَنَابِرَ مِنْ نُورٍ وُجُوهُهُمْ مِنْ نُورٍ لَيْسُوا بِأَنْبِيَاءَ وَلا شُهَدَاءَ وَلا صِدِّيقِينَ<\/p>\n<p><strong>Verily, Allah will have an audience on the Day of Resurrection, sitting at his right side of the Throne, and both sides are honored as the right. They will be upon pulpits of light and there will be light upon their faces, yet they are not prophets, nor martyrs, nor disciples.<\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, who are they?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُتَحَابُّونَ بِجِلالِ اللَّهِ تَعَالَى<\/p>\n<p><strong>Those who loved each other for the glory of Allah Almighty<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr 12524, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/loving-right-side-throne\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ عِبَادِ اللَّهِ لَأُنَاسًا مَا هُمْ بِأَنْبِيَاءَ وَلَا شُهَدَاءَ يَغْبِطُهُمْ الْأَنْبِيَاءُ وَالشُّهَدَاءُ يَوْمَ الْقِيَامَةِ بِمَكَانِهِمْ مِنْ اللَّهِ تَعَالَى<\/p>\n<p><strong>Verily, among the servants of Allah are people who are neither prophets nor martyrs, yet the prophets and martyrs will admire them on the Day of Resurrection due to their position before Allah Almighty<\/strong>.<\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, tell us who they are.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ قَوْمٌ تَحَابُّوا بِرُوحِ اللَّهِ عَلَى غَيْرِ أَرْحَامٍ بَيْنَهُمْ وَلَا أَمْوَالٍ يَتَعَاطَوْنَهَا فَوَاللَّهِ إِنَّ وُجُوهَهُمْ لَنُورٌ وَإِنَّهُمْ عَلَى نُورٍ لَا يَخَافُونَ إِذَا خَافَ النَّاسُ وَلَا يَحْزَنُونَ إِذَا حَزِنَ النَّاسُ<\/p>\n<p><strong>They are people who love each other with the spirit of Allah, despite having no shared family relations or wealth. By Allah, there will be light on their faces and they will be upon light. They will not fear when people are afraid, and they will not be sad when people are grieved.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ<\/p>\n<p><strong>Certainly, the allies of Allah will have no fear, nor will they grieve.<\/strong> (10:62)<\/p>\n<p>Source: Sunan Abī Dāwūd 3527, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/05\/love-allah-no-fear-sadness\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْمُتَحَابُّونَ بِجَلَالِي فِي ظِلِّ عَرْشِي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي<\/p>\n<p><strong>Allah Almighty said: Those who loved each other for the sake of my glory will be in the shade of my throne, on a day there is no shade but mine.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16825, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/loving-believers-shade-arsh\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Malik al-Ashari reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ اسْمَعُوا وَاعْقِلُوا وَاعْلَمُوا أَنَّ لِلَّهِ عَزَّ وَجَلَّ عِبَادًا لَيْسُوا بِأَنْبِيَاءَ وَلَا شُهَدَاءَ يَغْبِطُهُمْ الْأَنْبِيَاءُ وَالشُّهَدَاءُ عَلَى مَجَالِسِهِمْ وَقُرْبِهِمْ مِنَ اللَّهِ<\/p>\n<p><strong>O people, listen, understand, and know that Allah Almighty has servants who are neither prophets, nor martyrs, yet the prophets and martyrs admire them for their position and closeness to Allah.<\/strong><\/p><\/blockquote>\n<p>A man among the bedouins of a distant land came and he waved to the Prophet, saying, “O Prophet of Allah, describe them to us.” The Prophet was pleased by the bedouin’s question, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ نَاسٌ مِنْ أَفْنَاءِ النَّاسِ وَنَوَازِعِ الْقَبَائِلِ لَمْ تَصِلْ بَيْنَهُمْ أَرْحَامٌ مُتَقَارِبَةٌ تَحَابُّوا فِي اللَّهِ وَتَصَافَوْا يَضَعُ اللَّهُ لَهُمْ يَوْمَ الْقِيَامَةِ مَنَابِرَ مِنْ نُورٍ فَيُجْلِسُهُمْ عَلَيْهَا فَيَجْعَلُ وُجُوهَهُمْ نُورًا وَثِيَابَهُمْ نُورًا يَفْزَعُ النَّاسُ يَوْمَ الْقِيَامَةِ وَلَا يَفْزَعُونَ وَهُمْ أَوْلِيَاءُ اللَّهِ الَّذِينَ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ<\/p>\n<p><strong>They are people from faraway lands and different tribes. They have no close familial relationship between them. They sincerely love each other for the sake of Allah. Allah will place them on pulpits of light on the Day of Resurrection and grant them an audience. He will place light on their faces and light on their garments. People will be terrified on the Day of Resurrection, yet they will not be terrified. They are the allies of Allah, upon whom there is no fear or grief.<\/strong> (10:62)<\/p>\n<p>Source: Musnad Aḥmad 22307, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/17\/honor-bestowed-loving-believers\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَحَبَّ عَبْدٌ عَبْدًا فِي اللهِ عَزَّ وَجَلَّ إِلَّا أَكْرَمَهُ اللهُ<\/p>\n<p><strong>A servant does not love another servant for the sake of Allah Almighty but that Allah will honor him<\/strong>.<\/p>\n<p>Source: Shu’ab al-Imān 8601, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/07\/12\/honor-love-sake-of-allah\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحَبَّ لِلَّهِ وَأَبْغَضَ لِلَّهِ وَأَعْطَى لِلَّهِ وَمَنَعَ لِلَّهِ فَقَدْ اسْتَكْمَلَ الْإِيمَانَ<\/p>\n<p><strong>Whoever loves for the sake of Allah, hates for the sake of Allah, gives for the sake of Allah, and withholds for the sake of Allah has perfected the faith<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 4681, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/12\/love-hate-allah-perfect-faith\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Azimabadi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَبْغَضَ لِلَّهِ لَا لِإِيذَاءِ مَنْ أَبْغَضَهُ لَهُ بَلْ لِكُفْرِهِ وَعِصْيَانِهِ<\/p>\n<p>That he hates for the sake of Allah does not mean he harms the one he hates. Rather, the hatred is for his unbelief and disobedience.<\/p>\n<p>Source: ‘Awn al-Ma’būd 4681<\/p><\/blockquote>\n<p>Al-Bara’ ibn ‘Azib reported: We were sitting with the Prophet, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَوْثَق عُرَى الْإِيمَانِ أَنْ تُحِبَّ فِي اللَّهِ وَتُبْغِضَ فِي اللَّهِ<\/p>\n<p><strong>Which handle of Islam is the most trustworthy?<\/strong><\/p><\/blockquote>\n<p>They said, “Prayer.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَسَنَةٌ وَمَا هِيَ بِهَا<\/p>\n<p><strong>It is good, but that is not it.<\/strong><\/p><\/blockquote>\n<p>They said, “Charity.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَسَنَةٌ وَمَا هِيَ بِهَا<\/p>\n<p><strong>It is good, but that is not it<\/strong>.<\/p><\/blockquote>\n<p>They said, “Fasting the month of Ramadan.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَسَنٌ وَمَا هُوَ بِهِ<\/p>\n<p><strong>It is good, but that is not it<\/strong>.<\/p><\/blockquote>\n<p>They said, “The Hajj pilgrimage.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَسَنٌ وَمَا هُوَ بِهِ<\/p>\n<p><strong>It is good, but that is not it.<\/strong><\/p><\/blockquote>\n<p>They said, “Jihad.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَسَنٌ وَمَا هُوَ بِهِ إِنَّ أَوْثَق عُرَى الْإِيمَانِ أَنْ تُحِبَّ فِي اللَّهِ وَتُبْغِضَ فِي اللَّهِ<\/p>\n<p><strong>It is good, but that is not it. Verily, the most trustworthy handle of faith is to love and hate for the sake of Allah.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 18157, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/18\/which-handle-islam-reliable\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: A bedouin asked the Messenger of Allah, peace and blessings be upon him, “When is the Hour?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَعْدَدْتَ لَهَا<\/p>\n<p><strong>What have you prepared for it?<\/strong><\/p><\/blockquote>\n<p>The man said, “Love for Allah and his messenger.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْتَ مَعَ مَنْ أَحْبَبْتَ<\/p>\n<p><strong>You will be with those whom you love<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3435, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/10\/akhirah-those-he-loved\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, what do you say about a man who loves a people but his deeds do not compare to theirs?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَرْءُ مَعَ مَنْ أَحَبَّ<\/p>\n<p><strong>A person will be with those whom he loves<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5817, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/05\/with-those-he-loves-in-jannah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Dharr reported: He said, “O Messenger of Allah, a man loves a people but he cannot do good deeds like they do.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْتَ يَا أَبَا ذَرٍّ مَعَ مَنْ أَحْبَبْتَ<\/p>\n<p><strong>You, O Abu Dharr, will be with those you love.<\/strong><\/p><\/blockquote>\n<p>Abu Dharr said, “I love Allah and his messenger.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّكَ مَعَ مَنْ أَحْبَبْتَ<\/p>\n<p><strong>Verily, you will be with those you love.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 5126, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/18\/abu-dharr-loves-allah-rasul\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;They are the allies of Allah, upon whom there is no fear or grief.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[241,16,183,32,52,100,196],"class_list":["post-20478","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-brotherhood-al-ikhwa","tag-character-akhlaq","tag-day-of-resurrection-yawm-al-qiyammah","tag-hereafter-akhirah","tag-love-al-mahabbah","tag-manners-al-adab","tag-prophetic-virtues"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5ki","jetpack-related-posts":[{"id":20671,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-consistent-good-habits\/","url_meta":{"origin":20478,"position":0},"title":"Imam al-Mundhiri on Consistent Good Habits","author":"Abu Amina Elias","date":"July 16, 2019","format":false,"excerpt":"\"Most beloved deeds to Allah are performed regularly,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":20478,"position":1},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23053,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-istighfar\/","url_meta":{"origin":20478,"position":2},"title":"Imam al-Mundhiri on Seeking Forgiveness from Allah","author":"Abu Amina Elias","date":"April 25, 2021","format":false,"excerpt":"\"I seek forgiveness from Allah Almighty...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23244,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-visiting-righteous\/","url_meta":{"origin":20478,"position":3},"title":"Imam al-Mundhiri on Visiting and Honoring Muslims","author":"Abu Amina Elias","date":"May 28, 2021","format":false,"excerpt":"\"Visit the absent. It will increase your love.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20689,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-good-thoughts-allah\/","url_meta":{"origin":20478,"position":4},"title":"Imam al-Mundhiri on Hope and Good Thoughts of Allah","author":"Abu Amina Elias","date":"July 28, 2019","format":false,"excerpt":"\"I am as My servant expects Me,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20427,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-kindness-gentleness-hilm\/","url_meta":{"origin":20478,"position":5},"title":"Imam al-Mundhiri on Kindness, Gentleness, and Forbearance","author":"Abu Amina Elias","date":"June 15, 2019","format":false,"excerpt":"\"Allah is kind and he loves kindness in all matters.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20478","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20478"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20478\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20478"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20478"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20478"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}