{"id":20526,"date":"2019-06-19T15:28:27","date_gmt":"2019-06-19T11:28:27","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20526"},"modified":"2025-03-22T09:40:16","modified_gmt":"2025-03-22T05:40:16","slug":"al-mundhiri-humility-vanity-arrogance","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-humility-vanity-arrogance\/","title":{"rendered":"Imam al-Mundhiri on Humility, Vanity, and Arrogance"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لترغيب في التواضع والترهيب من الكبر والعجب والافتخار<\/p>\n<p>Encouragement of humility, and discouragement of arrogance, vanity, and pride.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 3\/557<\/p><\/blockquote>\n<p>‘Iyad ibn Himar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا حَتَّى لَا يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ وَلَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ<\/p>\n<p><strong>Verily,<\/strong> <strong>Allah has revealed to me that you must be humble towards one another, so that no one oppresses another or boasts to another<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2865, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/04\/03\/allah-revealed-humble\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلاَّ رَفَعَهُ اللَّهُ<\/p>\n<p><strong>Charity does not decrease wealth, no one forgives another but that Allah increases his honor, and no one humbles himself for the sake of Allah but that Allah raises his status.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2588, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/20\/charity-forgiveness-wealth\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thawban reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ مَاتَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ الْكِبْرِ وَالْغُلُولِ وَالدَّيْنِ دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Whoever dies free of these three, arrogance, usurping the spoils, and debt, he will enter Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1572, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/free-of-kibr-ghulul-dayn\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Tariq ibn Shihab reported: Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّا كُنَّا أَذَلَّ قَوْمٍ فَأَعَزَّنَا اللَّهُ بِالْإِسْلَامِ فَمَهْمَا نَطْلُبُ الْعِزَّةَ بِغَيْرِ مَا أَعَزَّنَا اللَّهُ بِهِ أَذَلَّنَا اللَّهُ<\/p>\n<p>Verily, we were a disgraceful people and Allah honored us with Islam. If we seek honor from anything besides that with which Allah has honored us, Allah will disgrace us.<\/p>\n<p>Source: al-Mustadrak 214, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/23\/umar-honor-islam-nothing-else\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ آدَمِيٍّ إِلا فِي رَأْسِهِ حَكَمَةٌ بِيَدِ مَلَكٍ فَإِذَا تَوَاضَعَ قِيلَ لِلْمَلَكِ ارْفَعْ حَكَمَتَهُ وَإِذَا تَكَبَّرَ قِيلَ لِلْمَلَكِ ضَعْ حَكَمَهُ<\/p>\n<p><strong>There is no human being but that upon his head are reins in the hands of an angel. When he shows humility, the angel is ordered to lift his reins to raise him up<\/strong>.<strong> When he shows arrogance, the angel is ordered to fasten his reins to humble him<\/strong>.<\/p>\n<p>Source: al-Muʻjam al-Kabīr 12771, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/08\/hadith-on-guidance-angels\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ آدَمِيٍّ إِلا فِي رَأْسِهِ حَكَمَةٌ الْحَكَمَةُ بِيَدِ مَلَكٍ فَإِنْ تَوَاضَعَ قِيلَ لِلْمَلَكِ ارْفَعْ حَكَمَتَهُ وَإِنِ ارْتَفَعَ قِيلَ لِلْمَلَكِ ضَعْ حَكَمَتَهُ<\/p>\n<p><strong>There is no human being but that over his head are reins in the hands of an angel. If he is humble, it is said to the angel: Raise up his reins! If he is haughty, it is said to the angel: Lower his reins!<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 7661, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/angels-guided-humility-kibr\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَحَبِّكُمْ إِلَيَّ وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ أَحَاسِنَكُمْ أَخْلَاقًا وَإِنَّ أَبْغَضَكُمْ إِلَيَّ وَأَبْعَدَكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ الثَّرْثَارُونَ وَالْمُتَشَدِّقُونَ وَالْمُتَفَيْهِقُونَ<\/p>\n<p><strong>Verily, the most beloved and nearest to my gathering on the Day of Resurrection are those of you with the best character. Verily, the most reprehensible of you to me and the furthest from my gathering on the Day of Resurrection will be the pompous, the extravagant, and the pretentious<\/strong>.<\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, we know the pompous and the extravagant, but who are the pretentious?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُتَكَبِّرُونَ<\/p>\n<p><strong>The arrogant.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2018, Grade:<strong><em> <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/30\/closest-prophet-best-character\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي فَمَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا قَذَفْتُهُ فِي النَّارِ<\/p>\n<p><strong>Allah Almighty said: Grandeur is my cloak and greatness is my garment. Whoever competes with me in one of these two, I will cast him into the Hellfire<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 4090, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/14\/pride-arrogance-hellfire\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ سُبْحَانَهُ الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي فَمَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا أَلْقَيْتُهُ فِي النَّارِ<\/p>\n<p><strong>Allah Almighty says: Grandeur is my cloak and greatness is my garment. Whoever competes with me in one these two, I will throw him into the Hellfire.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4175, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Fadalah ibn ‘Ubayd reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثَةٌ لَا تَسْأَلْ عَنْهُمْ رَجُلٌ نَازَعَ اللَّهَ عَزَّ وَجَلَّ رِدَاءَهُ فَإِنَّ رِدَاءَهُ الْكِبْرِيَاءُ وَإِزَارَهُ الْعِزَّةُ وَرَجُلٌ شَكَّ فِي أَمْرِ اللَّهِ وَالْقَنُوطُ مِنْ رَحْمَةِ اللَّهِ<\/p>\n<p><strong>Do not ask about three people: a man who competes for the robe of Allah Almighty, for His robe is grandeur and His garment is might, a man who doubts in the matter of Allah, and one who despairs of the mercy of Allah.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 23452, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/do-not-ask-about-three\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Munawi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثَةٌ لَا تَسْأَلْ عَنْهُمْ أَيْ فَإِنَّهُمْ مِنَ الْهَالِكِينَ<\/p>\n<p>Do not ask about three people, meaning, they have been ruined.<\/p>\n<p>Source: Fayḍ al-Qadīr 3521<\/p><\/blockquote>\n<p>Harithah ibn Wahb reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ أَلَا أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُسْتَكْبِرٍ<\/p>\n<p><strong>Shall I not tell you about the inhabitants of Paradise? Every meek, humble person, but if they swore an oath by Allah, he would fulfill it. Shall I not tell you about the inhabitants of Hellfire? Every cruel, rude, and arrogant person.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4634, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/hereafter-jannah-nar-arrogant\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ الْجَوَّاظُ وَلَا الْجَعْظَرِيُّ<\/p>\n<p><strong>He will not enter Paradise who is cruel and hard-hearted<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 4801, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/06\/08\/cruel-not-enter-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Suraqah ibn Ju’shum reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا سُرَاقَةُ أَلَا أُخْبِرُكَ بِأَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ<\/p>\n<p><strong>O Suraqah, shall I tell you about the people of Paradise and Hellfire?<\/strong><\/p><\/blockquote>\n<p>Suraqah said, “Of course, O Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَّا أَهْلُ النَّارِ فَكُلُّ جَعْظَرِيٍّ جَوَّاظٍ مُسْتَكْبِرٍ وَأَمَّا أَهْلُ الْجَنَّةِ فَالضُّعَفَاءُ الْمَغْلُوبُونَ<\/p>\n<p><strong>As for the people of Hellfire, it is every hard-hearted, cruel, and arrogant person. As for the people of Paradise, they are the meek and oppressed<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr 6589, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/cruel-mean-rude-sinners\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hudhayfah ibn al-Yaman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبرُكُمْ بشَرِّ عِبادِ اللَّهِ الْفَظُّ الْمُسْتَكْبرُ أَلَا أُخْبرُكُمْ بخَيْرِ عِبادِ اللَّهِ الضَّعِيفُ الْمُسْتَضْعَفُ ذُو الطِّمْرَيْنِ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبرَّ اللَّهُ قَسَمَهُ<\/p>\n<p><strong>Shall I not tell you about the worst servants of Allah? They are cruel and arrogant. Shall I not tell you about the best servants of Allah? They are weak, persecuted, and down-trodden, yet if they swear an oath by Allah, Allah will fulfill their oath<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 2904, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/best-worst-servants-of-allah\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحَاجَّتْ الْجَنَّةُ وَالنَّارُ فَقَالَتْ النَّارُ أُوثِرْتُ بِالْمُتَكَبِّرِينَ وَالْمُتَجَبِّرِينَ وَقَالَتْ الْجَنَّةُ مَا لِي لَا يَدْخُلُنِي إِلَّا ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَقَالَ لِلنَّارِ إِنَّمَا أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَلِكُلِّ وَاحِدَةٍ مِنْهُمَا مِلْؤُهَا فَأَمَّا النَّارُ فَلَا تَمْتَلِئُ حَتَّى يَضَعَ رِجْلَهُ فَتَقُولُ قَطْ قَطْ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ وَلَا يَظْلِمُ اللَّهُ عَزَّ وَجَلَّ مِنْ خَلْقِهِ أَحَدًا وَأَمَّا الْجَنَّةُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُنْشِئُ لَهَا خَلْقًا<\/p>\n<p><strong>The Hellfire and Paradise disputed each other. Hellfire said: The arrogant and the tyrants will dwell in me. Paradise said: What is the matter with me that only the meek and humble of the people will enter me? Allah said to Paradise: You are My mercy with which I show mercy to those of My servants whom I will. Allah said to Hellfire: You are My punishment with which I punish those of My servants whom I will, and both of you will be full. As for Hellfire, it will not be filled until Allah puts His foot over it and Hellfire will say: Enough! Enough! All of its parts will be filled together and Allah will not wrong any of His creatures. As for Paradise, Allah will create a new creation with which to fill it<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4850, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/jannah-rahmah-nar-adhab\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">احْتَجَّتِ الْجَنَّةُ وَالنَّارُ فَقَالَتِ النَّارُ فِيَّ الْجَبَّارُونَ وَالْمُتَكَبِّرُونَ وَقَالَتِ الْجَنَّةُ فِيَّ ضُعَفَاءُ النَّاسِ وَمَسَاكِينُهُمْ قَالَ فقضى الله بينهما‏ إِنَّكَ الْجَنَّةُ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ وَإِنَّكِ النَّارُ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ وَلِكِلاكُمَا عَلَيَّ مِلْؤُهَا<\/p>\n<p><strong>Paradise and Hellfire argued with each other. The Hellfire said: The tyrants and the arrogant are in me. Paradise said: The meek people and their poor are in me. Allah judged between them: You, Paradise, are my mercy that I bestow upon whomever I will. You, Hellfire, are my punishment with which I punish whomever I will. You will both be filled.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2847, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/paradise-hellfire-argue\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ يَوْمَ الْقِيَامَةِ وَلَا يُزَكِّيهِمْ وَلَا يَنْظُرُ إِلَيْهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ شَيْخٌ زَانٍ وَمَلِكٌ كَذَّابٌ وَعَائِلٌ مُسْتَكْبِرٌ<\/p>\n<p><strong>There are three people to whom Allah will not speak on the Day of Resurrection, nor will he purify them, nor will he look at them, and they will have an agonizing punishment: an old man who commits adultery, a king who lies, and an arrogant dependent<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 107, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/not-purify-three-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرْبَعَةٌ يَبْغُضُهُمْ اللَّهُ عَزَّ وَجَلَّ الْبَيَّاعُ الْحَلَّافُ وَالْفَقِيرُ الْمُخْتَالُ وَالشَّيْخُ الزَّانِي وَالْإِمَامُ الْجَائِرُ<\/p>\n<p><strong>There are four people who are hateful to Allah Almighty: a merchant swearing false oaths, a conceited poor person, an elder who commits adultery, and an unjust leader.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 2576, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/four-people-hateful-to-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Salman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلاثَةٌ لا يَدْخُلُونَ الْجَنَّةَ الشَّيْخُ الزَّانِي وَالإِمَامُ الْكَذَّابُ وَالْعَائِلُ الْمَزْهُوُّ<\/p>\n<p><strong>Three people will not enter Paradise: an elderly person who commits adultery, a dishonest leader, and a conceited dependent.<\/strong><\/p>\n<p>Source: Musnad al-Bazzār 2235, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/three-sinful-people-no-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ إِنْسَانٌ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ كِبْرٍ<\/p>\n<p><strong>No human being will enter Paradise if there is as much as the weight of seed of arrogance in his heart.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6526, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/kibr-habbatin-min-khardalin\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Salaam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَدْخُلُ الْجَنَّةَ مَنْ فِي قَلْبِهِ خَرْدَلَةٌ مِنْ كِبْرٍ<\/p>\n<p><strong>One will not enter Paradise with the weight of a seed of arrogance in his heart.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 21130, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/soul-to-be-pure-of-kibr\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا اسْتَكْبَرَ مَنْ أَكَلَ مَعَهُ خَادِمُهُ وَرَكِبَ الْحِمَارُ بِالأَسْوَاقِ وَاعْتَقَلَ الشَّاةَ فَحَلَبَهَا<\/p>\n<p><strong>He is not arrogant who eats with his servants, rides a donkey in the market, tends to his sheep and milks them<\/strong>.<\/p>\n<p>Source: al-Adab al-Mufrad 547, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/05\/09\/humility-does-his-own-chores\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُحْشَرُ الْمُتَكَبِّرُونَ يَوْمَ الْقِيَامَةِ أَمْثَالَ الذَّرِّ فِي صُوَرِ الرِّجَالِ يَغْشَاهُمْ الذُّلُّ مِنْ كُلِّ مَكَانٍ فَيُسَاقُونَ إِلَى سِجْنٍ فِي جَهَنَّمَ يُسَمَّى بُولَسَ تَعْلُوهُمْ نَارُ الْأَنْيَارِ يُسْقَوْنَ مِنْ عُصَارَةِ أَهْلِ النَّارِ طِينَةَ الْخَبَالِ<\/p>\n<p><strong>The arrogant will be gathered on the Day of Resurrection as tiny particles in the image of men. Disgrace will be cast over them from every place. They will be dragged to a prison in Hell named Balus, to be submerged in the fire of all fires, drinking the bile of the people of Hellfire, driving them into madness.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2492, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/terrifying-punishment-kibr\/https:\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/terrifying-punishment-kibr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ<\/p>\n<p><strong>No one who has the weight of a seed of arrogance in his heart will enter Paradise.<\/strong><\/p><\/blockquote>\n<p>Someone said, “But a man loves to have beautiful clothes and shoes.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ جَمِيلٌ يُحِبُّ الْجَمَالَ الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ<\/p>\n<p><strong>Verily,<\/strong> <strong>Allah is beautiful and he loves beauty. Arrogance means rejecting the truth and looking down on people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/05\/kibr-takabbur-seed-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ النَّارَ أَحَدٌ فِي قَلْبِهِ مِثْقَالُ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ<\/p>\n<p><strong>No one who has the weight of a seed of faith in his heart will enter Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَيْنَمَا رَجُلٌ يَمْشِي فِي حُلَّةٍ تُعْجِبُهُ نَفْسُهُ مُرَجِّلٌ جُمَّتَهُ إِذْ خَسَفَ اللَّهُ بِهِ فَهُوَ يَتَجَلْجَلُ إِلَى يَوْمِ الْقِيَامَةِ<\/p>\n<p><strong>While a man was walking in a fine garment, with his hair groomed and impressed with himself, Allah caused the earth to swallow him. He will be buried until the Day of Resurrection.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5789, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/earth-swallows-man-arrogance\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَيْنَا رَجُلٌ يَجُرُّ إِزَارَهُ إِذْ خُسِفَ بِهِ فَهُوَ يَتَجَلَّلُ فِي الْأَرْضِ إِلَى يَوْمِ الْقِيَامَةِ<\/p>\n<p><strong>While a man was trailing his robe out of vanity, he was suddenly swallowed up and he will be buried in the earth until the Day of Resurrection.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5790, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/earth-swallows-man-vanity\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَيْنَا رَجُلٌ فِيمَنْ كَانَ قَبْلَكُمْ خَرَجَ فِي بُرْدَيْنِ أَخْضَرَيْنِ يَخْتَالُ فِيهِمَا أَمَرَ اللَّهُ الْأَرْضَ فَأَخَذَتْهُ وَإِنَّهُ لَيَتَجَلْجَلُ فِيهَا إِلَى يَوْمِ الْقِيَامَةِ<\/p>\n<p><strong>A man before you left his house wearing two green mantles, boasting in them. Allah commanded the earth to take him. Verily, he will be buried in it until the Day of Resurrection.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 11141, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/earth-swallows-boasting-man\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ لَمْ يَنْظُرْ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever trails his garment in vanity, Allah will not look at him on the Day of Resurrection<\/strong>.<\/p><\/blockquote>\n<p>Abu Bakr said, “One of my robes slides down unless I am cautious about it.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّكَ لَسْتَ تَصْنَعُ ذَلِكَ خُيَلَاءَ<\/p>\n<p><strong>You are not doing it in vanity.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3465, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/11\/trailing-garment-kibr-fakhr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَعَظَّمَ فِي نَفْسِهِ أَوْ اخْتَالَ فِي مِشْيَتِهِ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ<\/p>\n<p><strong>Whoever exalts himself or carries himself with arrogance, he will meet Allah while He is angry with him<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 5959, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/arrogant-meet-allah-wrath\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا مَشَتْ أُمَّتِي بِالْمُطَيْطِيَاءِ وَخَدَمَهَا أَبْنَاءُ الْمُلُوكِ أَبْنَاءُ فَارِسَ وَالرُّومِ سُلِّطَ شِرَارُهَا عَلَى خِيَارِهَا<\/p>\n<p><strong>When my nation walks with a swagger and their servants are the sons of kings, Persians, and Romans, the worst of them will be given authority over the best of them.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2261, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/ummah-ruled-by-evil-if-arrogant\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ لَمْ تَكُونُوا تُذْنِبُونَ خَشِيتُ عَلَيْكُمْ مَا هُوَ أَكْبَرُ مِنْ ذَلِكَ الْعُجْبَ<\/p>\n<p><strong>If you were not already sinning, I would fear for you what is much worse than that: vanity.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 6765, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/19\/danger-delusion-ujb\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Al-Munawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِأَنَّ الْعَاصِيَ يَعْتَرِفُ بِنَقْصِهِ فَتُرْجَى لَهُ التَّوْبَةُ وَالْمُعْجَبُ مَغْرُورٌ بِعَمَلِهِ ، فَتَوْبَتُهُ بَعِيدَةٌ وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا<\/p>\n<p>That is because the disobedient sinner recognizes his faults and hopes for repentance. The vain person is deluded by their own deeds, so their repentance is unlikely. They are ‘<strong>those who think they are doing good deeds.<\/strong>” (18:104)<\/p>\n<p>Source: Fayḍ al-Qadīr 7488<\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَدْ أَذْهَبَ عَنْكُمْ عُبِّيَّةَ الْجَاهِلِيَّةِ وَفَخْرَهَا بِالْآبَاءِ إِنَّمَا هُوَ مُؤْمِنٌ تَقِيٌّ وَفَاجِرٌ شَقِيٌّ النَّاسُ كُلُّهُمْ بَنُو آدَمَ وَآدَمُ خُلِقَ مِنْ تُرَابٍ<\/p>\n<p><strong>Verily, Allah has removed from you the pride of the time of ignorance with its boasting of ancestors. Verily, one is only a righteous believer or a miserable sinner. All of the people are the children of Adam, and Adam was created from dust.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3955, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/06\/28\/all-people-children-adam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah revealed to me that you must be humble,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[122,14,61,16,17,20,183,26,135,32,34,104,100,54,56,134],"class_list":["post-20526","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-angels-malaikah","tag-arrogance-al-takabbur","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-forgiveness-al-maghfirah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-humility-al-tawaduh","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5l4","jetpack-related-posts":[{"id":23844,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fearing-oppressor\/","url_meta":{"origin":20526,"position":0},"title":"Imam al-Mundhiri on Supplications if Fearing an Oppressor","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Encouragement for words to say when fearing an oppressor\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14950,"url":"https:\/\/www.abuaminaelias.com\/humility-modesty-and-forbearance-in-islam\/","url_meta":{"origin":20526,"position":1},"title":"Humility, modesty, and forbearance in Islam","author":"Abu Amina Elias","date":"November 30, 2013","format":false,"excerpt":"\"Verily, Allah has revealed to me that you must be humble towards one another, so that no one wrongs another or arrogantly boasts to another.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20522,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-none-favored-but-righteousness\/","url_meta":{"origin":20526,"position":2},"title":"Imam al-Mundhiri on None Favored but by Righteousness","author":"Abu Amina Elias","date":"June 19, 2019","format":false,"excerpt":"\"It is enough evil to look down upon his brother.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":20526,"position":3},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23257,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-forgiveness-pardon\/","url_meta":{"origin":20526,"position":4},"title":"Imam al-Mundhiri on Forgiving Criminals and Wrongdoers","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"No one forgives another but that Allah increases his honor,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17756,"url":"https:\/\/www.abuaminaelias.com\/seeking-knowledge-and-learning-for-life-in-islam\/","url_meta":{"origin":20526,"position":5},"title":"Life-long learning in Islam","author":"Abu Amina Elias","date":"February 18, 2016","format":false,"excerpt":"\"It is not befitting for anyone with knowledge to give up learning.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20526","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20526"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20526\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20526"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20526"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20526"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}