{"id":20541,"date":"2019-06-22T16:38:06","date_gmt":"2019-06-22T12:38:06","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20541"},"modified":"2025-03-19T11:01:24","modified_gmt":"2025-03-19T07:01:24","slug":"al-mundhiri-following-book-and-sunnah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-following-book-and-sunnah\/","title":{"rendered":"Imam al-Mundhiri on Following the Quran and Sunnah"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في اتباع الكتاب والسنة<\/p>\n<p>Encouragement to follow the Book and the Sunnah.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 1\/77<\/p><\/blockquote>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ عَبْدٌ حَبَشِيٌّ فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ يَرَى اخْتِلَافًا كَثِيرًا وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّهَا ضَلَالَةٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَعَلَيْهِ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ<\/p>\n<p><strong>You must fear Allah, listen to and obey your leaders, even if an Abyssinian slave is put in charge over you. Whoever lives among you will see many disputes. Beware of newly invented matters, for they are misguidance. Whoever sees them must adhere to my Sunnah<\/strong> <strong>and the Sunnah of the upright, guided Caliphs.<\/strong> <strong>Bite onto it with your back teeth<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2676, Grade:<strong><em> <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/05\/follow-sunnah-beware-bidah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Shurayh al-Khuza’i reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبْشِرُوا وَأَبْشِرُوا أَلَيْسَ تَشْهَدُونَ أَنْ لا إِلَهَ إِلا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ<\/p>\n<p><strong>Rejoice! Do you not witness that there is no God but Allah and I am the messenger of Allah?<\/strong><\/p><\/blockquote>\n<p>They said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ هَذَا الْقُرْآنَ سَبَبٌ طَرَفُهُ بِيَدِ اللَّهِ وَطَرَفُهُ بِأَيْدِيكُمْ فَتَمَسَّكُوا بِهِ فَإِنَّكُمْ لَنْ تَضِلُّوا وَلَنْ تَهْلِكُوا بَعْدَهُ أَبَدًا<\/p>\n<p><strong>Verily, this Quran is a rope. One end is in the hand of Allah and the other end is in your hands. Hold fast to it, for you will never be lead astray or ruined ever again.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 122, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/05\/22\/quran-rope-of-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jubayr ibn Mut’am reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَيْسَ تَشْهَدُونَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنِّي رَسُولُ اللَّهِ وَأَنَّ الْقُرْآنَ جَاءَ مِنْ عِنْدِ اللَّهِ<\/p>\n<p><strong>Do you not bear witness that there is no God but Allah without any partner, that I am the messenger of Allah, and that the Quran has come from Allah<\/strong>?<\/p><\/blockquote>\n<p>We said, “Of course.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَبْشِرُوا فَإِنَّ هَذَا الْقُرْآنَ طَرْفُهُ بِيَدِ اللَّهِ وَطَرَفُهُ بِأَيْدِيكُمْ فَتَمَسَّكُوا بِهِ فَإِنَّكُمْ لَنْ تَهْلِكُوا وَلَنْ تَضِلُّوا بَعْدَهُ أَبَدًا<\/p>\n<p><strong>Then rejoice, for one end of this Quran is in the hand of Allah and the other is in your hands, so hold fast to it. Verily, you will never be ruined or led astray ever again.<\/strong><\/p>\n<p>Source: Musnad al-Bazzār 3421, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/12\/05\/hold-fast-to-the-quran\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, addressed the people during the farewell sermon, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ يَئِسَ الشَّيْطَانُ بِأَنْ يُعْبَدَ بِأَرْضِكُمْ وَلَكِنَّهُ رَضِيَ أَنْ يُطَاعَ فِيمَا سِوَى ذَلِكَ مِمَّا تُحَاقِرُونَ مِنْ أَعْمَالِكُمْ فَاحْذَرُوا يَا أَيُّهَا النَّاسُ إِنِّي قَدْ تَرَكْتُ فِيكُمْ مَا إِنِ اعْتَصَمْتُمْ بِهِ فَلَنْ تَضِلُّوا أَبَدًا كِتَابَ اللَّهِ وَسُنَّةَ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ كُلَّ مُسْلِمٍ أَخُو الْمُسْلِمِ الْمُسْلِمُونَ إِخْوَةٌ وَلا يَحِلُّ لامْرِئٍ مِنْ مَالِ أَخِيهِ إِلا مَا أَعْطَاهُ عَنْ طِيبِ نَفْسٍ وَلا تَظْلِمُوا وَلا تَرْجِعُوا مِنْ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ<\/p>\n<p><strong>Satan has despaired that he will ever be worshiped in your lands. Rather, he is pleased for you to obey him in matters beside that, among your deeds you consider insignificant. Beware, O people! Verily, I have left among you what you must hold firmly to, for you will never be led astray again: the Book of Allah and the Sunnah of His Prophet. Verily, a Muslim is the brother of another Muslim, and the Muslims are brothers. It is not lawful for a man to take the wealth of his brother, unless he gives it freely and willingly. You may not wrong each other. Do not turn back to the ways of unbelievers after me, striking the necks of each other.<\/strong><\/p>\n<p>Source: al-Mustadrak 289, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/22\/prophet-leaves-book-sunnah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdur Rahmah ibn Yazid reported: Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الِاقْتِصَادُ فِي السُّنَّةِ أَحْسَنُ مِنْ الِاجْتِهَادِ فِي الْبِدْعَةِ<\/p>\n<p>Moderation in the Sunnah is better than striving in innovation.<\/p>\n<p>Source: al-Mustadrak 289, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/22\/abdullah-moderate-sunnah-bidah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Awf ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَطِيعُونِي مَا كُنْتُ بَيْنَ أَظْهُرِكُمْ وَعَلَيْكُمْ بِآيَاتِ اللَّهِ أَحِلُّوا حَلَالَهُ وَحَرِّمُوا حَرَامَهُ<\/p>\n<p><strong>Obey me as long as I am here with you. You must hold firmly to the verses of Allah. Permit with they permit and forbid what they forbid.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 65, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/22\/hold-fast-to-ayat-of-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Abis ibn Rabi’ah reported: Umar ibn al-Khattab, may Allah be pleased with him, came to the black stone and he kissed it. Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ لَا تَضُرُّ وَلَا تَنْفَعُ وَلَوْلَا أَنِّي رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ مَا قَبَّلْتُكَ<\/p>\n<p>Verily, I know you are only a stone with no power to harm or benefit me. Were it not that I saw the Prophet, peace and blessings be upon him, kiss you, I would not have kissed you.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1520, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/12\/touch-al-hajar-al-aswad\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Mujahid reported: We were with Ibn Umar, may Allah be pleased with him, on a journey. We passed by a place and he kept to the side away from it. He was asked, “Why did you do that?” Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ هَذَا فَفَعَلْتُ<\/p>\n<p>I saw the Messenger of Allah, peace and blessings be upon him, do that, do I did that.<\/p>\n<p>Source: Musnad Aḥmad 4730, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/22\/ibn-umar-strict-adherence\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Nafi’ reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنِ ابْنِ عُمَرَ رضي الله عنه أَنَّهُ كَانَ يَأْتِي شَجَرَةً بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَيَقِيلُ تَحْتَهَا وَيُخْبِرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ<\/p>\n<p>Ibn Umar, may Allah be pleased with him, would come to a tree between Mecca and Medina, and he would take a nap under it. He told people that the Prophet, peace and blessings be upon him, had done so.<\/p>\n<p>Source: Musnad al-Bazzār 1519, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/22\/ibn-umar-as-prophet-napped\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Hold fast to the Quran, for you will never be lead astray,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[241,18,21,88,100,55,73],"class_list":["post-20541","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-brotherhood-al-ikhwa","tag-community-jamaah","tag-creed-aqidah","tag-pilgrimage-hajj","tag-manners-al-adab","tag-methodology-al-minhaj","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5lj","jetpack-related-posts":[{"id":20469,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-praying-dua-behind-back\/","url_meta":{"origin":20541,"position":0},"title":"Imam al-Mundhiri on Praying for someone behind their back","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"The angel says: And for you the same.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20551,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bidah-innovations-lowly-desires\/","url_meta":{"origin":20541,"position":1},"title":"Imam al-Mundhiri on Heretical Innovations, Lowly Desires","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"\"Every innovation is misguidance, every misguidance is in Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":20541,"position":2},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":20541,"position":3},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20531,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nifaq-two-faces-forked-tongues\/","url_meta":{"origin":20541,"position":4},"title":"Imam al-Mundhiri on Hypocrisy, Two-faces, and Forked-tongues","author":"Abu Amina Elias","date":"June 21, 2019","format":false,"excerpt":"\"We used to consider that hypocrisy.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20462,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-shaking-hands-greeting\/","url_meta":{"origin":20541,"position":5},"title":"Imam al-Mundhiri on Shaking Hands","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Allah forgives them before they part.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20541","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20541"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20541\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20541"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20541"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20541"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}