{"id":20555,"date":"2019-06-24T18:30:08","date_gmt":"2019-06-24T14:30:08","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20555"},"modified":"2025-03-19T11:01:31","modified_gmt":"2025-03-19T07:01:31","slug":"al-mundhiri-sincerity-truthfulness-good-intentions","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-sincerity-truthfulness-good-intentions\/","title":{"rendered":"Imam al-Mundhiri on Sincerity, Honesty, and Good Intentions"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في الإخلاص والصدق والنية الصالحة<\/p>\n<p>Encouragement of sincerity, truthfulness, and righteous intention.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 1\/51<\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ<\/p>\n<p><strong>Verily, deeds are only by intentions. Verily, every person will have only what they intended. Whoever emigrated to Allah and his messenger, his emigration is for Allah and his messenger. Whoever emigrated to get something in the world or to marry a woman, his emigration is for that to which he emigrated.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 54, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/29\/deeds-intention-niyyah-ikhlaas\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Firas reported: A man called out, “O Messenger of Allah, what is Islam?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِقَامُ الصَّلاةِ وَإِيتَاءُ الزَّكَاةِ<\/p>\n<p><strong>To perform prayer and give charity<\/strong>.<\/p><\/blockquote>\n<p>The man said, “What is faith?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الإِخْلاصُ<\/p>\n<p><strong>Sincerity<\/strong>.<\/p><\/blockquote>\n<p>The man said, “What is conviction?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّصْدِيقُ بالْقيامةِ<\/p>\n<p><strong>Certainty in the truth of the Resurrection.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 6356, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/islam-iman-and-yaqeen\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلاثٌ لا يُغِلُّ عَلَيْهِنَّ الْمُؤْمِنُ إِخْلاصُ الْعَمَلِ لِلَّهِ وَمُنَاصَحَةُ الْمُسْلِمِينَ وَلُزُومُ جَمَاعَتِهِمْ<\/p>\n<p><strong>There are three by which a believer will not be deceived: sincerity in deeds for Allah, good will to the Muslims, and keeping to their community.<\/strong><\/p>\n<p>Source: Musnad al-Shāmiyyīn 1279, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/02\/07\/nasihah-ikhlaas-protect-deception\/\">Sahih li ghayri<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَضَّرَ اللَّهُ امْرَأً سَمِعَ مَقَالَتِي فَوَعَاهَا وَحَفِظَهَا وَبَلَّغَهَا فَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ مُسْلِمٍ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَمُنَاصَحَةُ أَئِمَّةِ الْمُسْلِمِينَ وَلُزُومُ جَمَاعَتِهِمْ فَإِنَّ الدَّعْوَةَ تُحِيطُ مِنْ وَرَائِهِمْ<\/p>\n<p><strong>May Allah bring happiness to one who hears my words, such that he understands it, memorizes it, and conveys it. Perhaps he will carry understanding to one who has more understanding than he does. Three traits never deceive the heart of a Muslim: sincere deeds for Allah, good will to the leaders of the Muslims, and keeping to their community. Verily, the call to Islam is protected behind them<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2658, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/26\/sunnah-three-qualities-heart-muslim\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sa’d ibn Abi Waqqas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا يَنْصُرُ اللَّهُ هَذِهِ الْأُمَّةَ بِضَعِيفِهَا بِدَعْوَتِهِمْ وَصَلَاتِهِمْ وَإِخْلَاصِهِمْ<\/p>\n<p><strong>Verily, Allah only supports this nation because of their weak and poor, their supplications, their prayers, and their sincerity.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3178, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/ummah-only-supported-ikhlaas\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Dahhak reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ أَنَا خَيْرُ شَرِيكٍ فَمَنْ أَشْرَكَ مَعِيَ شَرِيكًا فَهُوَ لِشَرِيكِي<\/p>\n<p><strong>Allah Almighty says: I am the best partner. Whoever associates another partner with me, it is only done for the sake of my partner.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ أَخْلِصُوا أَعْمَالَكُمْ لِلَّهِ عَزَّ وَجَلَّ فَإِنَّ اللَّهَ لا يَقْبَلُ إِلا مَا أُخْلِصَ لَهُ وَلا تَقُولُوا هَذَا لِلَّهِ وَلِلرَّحِمِ فَإِنَّهَا لِلرَّحِمِ وَلَيْسَ لِلَّهِ مِنْهَا شَيْءٌ وَلا تَقُولُوا هَذَا لِلَّهِ وَلِوُجُوهِكُمْ فَإِنَّهَا لِوُجُوهِكُمْ وَلَيْسَ لِلَّهِ مِنْهَا شَيْءٌ<\/p>\n<p><strong>O people, make your deeds sincere for Allah Almighty. Verily, Allah does not accept any deed unless it is sincerely for him. Do not say: This is for the sake of Allah, and this is for the sake of my relatives. Verily, it was done for your relatives and none of it was for Allah. Do not say: This is for the sake of Allah and for your sake. Verily, it was done for their sake and none of it was for Allah.<\/strong><\/p>\n<p>Source: Sunan al-Dāraquṭnī 111, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/02\/04\/ikhlaas-pure-deeds-allah-alone\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: A man came to the Prophet, peace and blessings be upon him, and he said, “If a man battles for the sake of reward and fame, what do you think he has?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا شَيْءَ لَهُ<\/p>\n<p><strong>He has nothing<\/strong>.<\/p><\/blockquote>\n<p>The man repeated his question three times and the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا شَيْءَ لَهُ<\/p>\n<p><strong>He has nothing<\/strong>.<\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَقْبَلُ مِنْ الْعَمَلِ إِلَّا مَا كَانَ لَهُ خَالِصًا وَابْتُغِيَ بِهِ وَجْهُهُ<\/p>\n<p><strong>Verily, Allah does not accept any good deeds unless they are done sincerely and in pursuit of his countenance.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3140, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/01\/27\/sincerity-allah-only-accepts\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ<\/p>\n<p><strong>Verily, Allah does not look at your appearance or wealth, but rather he looks at your hearts and actions.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2564, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/04\/17\/allah-judge-heart-actions\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّنْيَا مَلْعُونَةُ مَلْعُونٌ مَا فِيهَا إِلا مَا ابْتُغِيَ بِهِ وَجْهُ اللَّهِ عَزَّ وَجَلَّ<\/p>\n<p><strong>The world is cursed and everything in it is cursed, except whatever seeks the countenance of Allah Almighty<\/strong>.<\/p>\n<p>Source: Musnad al-Shāmiyyīn 602, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/world-is-cursed-except-ikhlaas\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَغْزُو جَيْشٌ الْكَعْبَةَ فَإِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ<\/p>\n<p><strong>An army will raid the Ka’bah but when they reach a desert land, all of them will be swallowed by the earth<\/strong>.<\/p><\/blockquote>\n<p>I asked, “O Messenger of Allah, how will all of them be swallowed by the earth while among them are their markets and unrelated people?” The Prophet said<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ ثُمَّ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ<\/p>\n<p><strong>They will all be swallowed up. Then, they will be resurrected for judgment upon their intentions.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2012, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/21\/raised-judged-niyyah-ikhlaas\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا يُبْعَثُ النَّاسُ عَلَى نِيَّاتِهِمْ<\/p>\n<p><strong>Verily, the people will only be raised for judgment based on their intentions.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4229, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/02\/04\/judged-by-niyyah-ikhlaas\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُحْشَرُ النَّاسُ عَلَى نِيَّاتِهِمْ<\/p>\n<p><strong>People will be gathered for judgment based on their intentions.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4230, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/people-resurrected-intentions\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ يعنى إلى الملائكة إِذَا أَرَادَ عَبْدِي أَنْ يَعْمَلَ سَيِّئَةً فَلَا تَكْتُبُوهَا عَلَيْهِ حَتَّى يَعْمَلَهَا فَإِنْ عَمِلَهَا فَاكْتُبُوهَا بِمِثْلِهَا وَإِنْ تَرَكَهَا مِنْ أَجْلِي فَاكْتُبُوهَا لَهُ حَسَنَةً وَإِذَا أَرَادَ أَنْ يَعْمَلَ حَسَنَةً فَلَمْ يَعْمَلْهَا فَاكْتُبُوهَا لَهُ حَسَنَةً فَإِنْ عَمِلَهَا فَاكْتُبُوهَا لَهُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِ مِائَةِ ضِعْفٍ<\/p>\n<p><strong>Allah says to the angels: If my servant intends a bad deed, do not record it unless he does it. If he does it, record it as one bad deed. If he leaves it for my sake, record for him one good deed. If he intends to do a good deed and he does not do it, record for him one good deed. If he does it, record for him ten good deeds like it up to seven-hundred times as much.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7062, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/how-angels-write-deeds\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَجُلٌ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى سَارِقٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدَيْ زَانِيَةٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدَيْ غَنِيٍّ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى غَنِيٍّ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى سَارِقٍ وَعَلَى زَانِيَةٍ وَعَلَى غَنِيٍّ فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ عَلَى سَارِقٍ فَلَعَلَّهُ أَنْ يَسْتَعِفَّ عَنْ سَرِقَتِهِ وَأَمَّا الزَّانِيَةُ فَلَعَلَّهَا أَنْ تَسْتَعِفَّ عَنْ زِنَاهَا وَأَمَّا الْغَنِيُّ فَلَعَلَّهُ يَعْتَبِرُ فَيُنْفِقُ مِمَّا أَعْطَاهُ اللَّهُ<\/p>\n<p><strong>A man intended to give charity, so he went out with his charity and placed it in the hands of a thief. In the morning, people were saying: Charity was given to a thief! The man said: O Allah, praise be to you! The man again intended to give charity, so he went out with his charity and placed it in the hands of an adulteress. In the morning, people were saying: Charity was given to an adulteress in the night! The man said: O Allah, praise be to you for the adulteress! The man again intended to give charity, so he went out with his charity and placed it in the hands of a wealthy person. In the morning, people were saying: Charity was given to a wealthy person! The man said: O Allah, praise be to you for the thief, the adulteress, and the wealthy person! Then, it came to him in a dream and it was said: As for your charity to the thief, perhaps it will cause him to give up stealing. As for the adulteress, perhaps it will cause her to give up adultery. As for the wealthy person, perhaps he will learn a lesson and spend in charity from what Allah has given him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1355, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/02\/19\/sadaqah-thief-prostitute-wealthy\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Kabshah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الدُّنْيَا لِأَرْبَعَةِ نَفَرٍ عَبْدٍ رَزَقَهُ اللَّهُ مَالًا وَعِلْمًا فَهُوَ يَتَّقِي فِيهِ رَبَّهُ وَيَصِلُ فِيهِ رَحِمَهُ وَيَعْلَمُ لِلَّهِ فِيهِ حَقًّا فَهَذَا بِأَفْضَلِ الْمَنَازِلِ وَعَبْدٍ رَزَقَهُ اللَّهُ عِلْمًا وَلَمْ يَرْزُقْهُ مَالًا فَهُوَ صَادِقُ النِّيَّةِ يَقُولُ لَوْ أَنَّ لِي مَالًا لَعَمِلْتُ بِعَمَلِ فُلَانٍ فَهُوَ بِنِيَّتِهِ فَأَجْرُهُمَا سَوَاءٌ وَعَبْدٍ رَزَقَهُ اللَّهُ مَالًا وَلَمْ يَرْزُقْهُ عِلْمًا فَهُوَ يَخْبِطُ فِي مَالِهِ بِغَيْرِ عِلْمٍ لَا يَتَّقِي فِيهِ رَبَّهُ وَلَا يَصِلُ فِيهِ رَحِمَهُ وَلَا يَعْلَمُ لِلَّهِ فِيهِ حَقًّا فَهَذَا بِأَخْبَثِ الْمَنَازِلِ وَعَبْدٍ لَمْ يَرْزُقْهُ اللَّهُ مَالًا وَلَا عِلْمًا فَهُوَ يَقُولُ لَوْ أَنَّ لِي مَالًا لَعَمِلْتُ فِيهِ بِعَمَلِ فُلَانٍ فَهُوَ بِنِيَّتِهِ فَوِزْرُهُمَا سَوَاءٌ<\/p>\n<p><strong>Verily, the world is only has four kinds of people. There is one whom Allah has granted wealth and knowledge, so he fears his Lord in them, upholds family ties, and fulfills the rights of Allah over him. He is be in the best position. There is one whom Allah has granted knowledge without wealth. He has a sincere intention, and he says: If I had wealth, I would have acted like this person. If that is his intention, he will have the same reward as the other. There is one whom Allah has granted wealth without knowledge. He squanders his wealth in ignorance, he does not fear Allah in it, he does not fulfill his duties to his family, and he does not fulfill the rights of Allah over him. He will be in the worst position. There is one whom Allah has granted neither wealth nor knowledge, and he says: If I had wealth, I would have acted like this person. If that is his intention, he will have the same sin as the other<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2325, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/05\/19\/world-four-kinds-of-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Darda reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَتَى فِرَاشَهُ وَهُوَ يَنْوِي أَنْ يَقُومَ يُصَلِّي مِنْ اللَّيْلِ فَغَلَبَتْهُ عَيْنَاهُ حَتَّى أَصْبَحَ كُتِبَ لَهُ مَا نَوَى وَكَانَ نَوْمُهُ صَدَقَةً عَلَيْهِ مِنْ رَبِّهِ عَزَّ وَجَلَّ<\/p>\n<p><strong>Whoever comes to his carpet intending to stand for prayer at night, yet his eyes are overcome with sleep until morning, his intention is recorded for him and his sleep is charity for him from his Lord Almighty.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 1787, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/24\/night-prayer-intention-recorded\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Deeds are only by intentions.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[122,16,17,183,32,246,47,100,56,60,70],"class_list":["post-20555","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-angels-malaikah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-hereafter-akhirah","tag-intention-al-niyyah","tag-jihad","tag-manners-al-adab","tag-monotheism-tawheed","tag-prayer-salat","tag-sincerity-al-ikhlaas"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5lx","jetpack-related-posts":[{"id":15419,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-intention-and-sincerity\/","url_meta":{"origin":20555,"position":0},"title":"Imam al-Nawawi on Sincerity, Good Intentions","author":"Abu Amina Elias","date":"February 4, 2014","format":false,"excerpt":"\"Deeds are only be intentions.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20531,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nifaq-two-faces-forked-tongues\/","url_meta":{"origin":20555,"position":1},"title":"Imam al-Mundhiri on Hypocrisy, Two-faces, and Forked-tongues","author":"Abu Amina Elias","date":"June 21, 2019","format":false,"excerpt":"\"We used to consider that hypocrisy.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":20555,"position":2},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23226,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-weeping-fear-of-allah\/","url_meta":{"origin":20555,"position":3},"title":"Imam al-Mundhiri on Weeping for Fear of Allah","author":"Abu Amina Elias","date":"May 23, 2021","format":false,"excerpt":"\"Two eyes will never be touched by the Hellfire...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20459,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-reconciliation-between-people\/","url_meta":{"origin":20555,"position":4},"title":"Imam al-Mundhiri on Reconciling People","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Best act of charity is to reconcile people.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22666,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-paying-zakat\/","url_meta":{"origin":20555,"position":5},"title":"Imam al-Mundhiri on Obligatory Charity","author":"Abu Amina Elias","date":"October 19, 2020","format":false,"excerpt":"\"Whoever pays alms on his wealth, his evil will depart from him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20555","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20555"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20555\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20555"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20555"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20555"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}