{"id":20598,"date":"2019-06-29T13:31:00","date_gmt":"2019-06-29T09:31:00","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20598"},"modified":"2020-07-18T07:01:28","modified_gmt":"2020-07-18T03:01:28","slug":"reward-for-deeds-same-genus","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/reward-for-deeds-same-genus\/","title":{"rendered":"Reward for deeds is from the same genus"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Among the most important principles of faith in Islam is the belief that the divine recompense for deeds matches the genus of the deeds (<em>al-jaza’ min jins al-‘amal<\/em>). In other words, we will be rewarded or punished by Allah in the Hereafter in the same way that we behaved towards other people in the world.<\/p>\n<p>Many texts in the Quran and Sunnah affirm and express this principle of faith.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جَزَاءً وِفَاقًا إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا<\/p>\n<p><strong>An appropriate recompense. Verily, they did not expect to be held accountable.<\/strong><\/p>\n<p>Surat al-Naba’ 78:26-27<\/p><\/blockquote>\n<p>Qatadah commented on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جَزَاءٌ وَافَقَ أَعْمَالَ الْقَوْمِ<\/p>\n<p>A recompense agrees with the deeds of people.<\/p><\/blockquote>\n<p>And Ibn Zayd said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَمِلُوا شَرًّا فَجُزُوا شَرًّا وَعَمِلُوا حَسَنًا فَجُزُوا حَسَنًا<\/p>\n<p>Those who commit evil deeds are recompensed with evil, and those who do good deeds are recompensed with good.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 78:26<\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ<\/p>\n<p><strong>The recompense of an evil deed is one like it. Whoever forgives and reconciles, his reward is from Allah. Verily, he does not love wrongdoers.<\/strong><\/p>\n<p>Surat al-Shura 42:40<\/p><\/blockquote>\n<p>Shaykh al-Sa’di commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنْ يُعَامِلَ الْعَبْدُ الْخَلْقَ بِمَا يُحِبُّ أَنْ يُعَامِلَهُ اللَّهُ بِهِ فَكَمَا يُحِبُّ أَنْ يَعْفُوَ اللَّهُ عَنْهُ فَلْيَعْفُ عَنْهُمْ وَكَمَا يُحِبُّ أَنْ يُسَامِحَهُ اللَّهُ فَلْيُسَامِحْهُمْ فَإِنَّ الْجَزَاءَ مِنْ جِنْسِ الْعَمَلِ<\/p>\n<p>The servant should treat the creation as one would like to be treated by Allah. As one would like to be forgiven by Allah, let him forgive them. As one would like to be treated with forbearance by Allah, let him be forbearing with them. Indeed, the recompense is of the same genus as the deed.<\/p>\n<p>Source: Tafsīr al-Sa’dī 42:20<\/p><\/blockquote>\n<p>Usamah ibn Zayd reported: The Messenger of Allah, peace and blessings be upon him, said<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ<\/p>\n<p><strong>Verily, Allah is merciful only to his servants who are merciful.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1224, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/allah-only-merciful\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ بِهَا كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever fulfills the needs of his brother, Allah will fulfill his needs. Whoever relieves a Muslim from distress, Allah will relieve him from distress on the Day of Resurrection. Whoever covers the faults of a Muslim, Allah will cover his faults on the Day of Resurrection<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2310, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/06\/muslim-brother-another-muslim\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ مَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَشَقَّ عَلَيْهِمْ فَاشْقُقْ عَلَيْهِ وَمَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَرَفَقَ بِهِمْ فَارْفُقْ بِهِ<\/p>\n<p><strong>O Allah, whoever is given charge over my nation and he is harsh with them, be harsh with him. Whoever is given charge over my nation and he is gentle with them, be gentle with him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1828, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/11\/rulers-as-they-treat-subjects\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ<\/p>\n<p><strong>Allah helps the servant as long as he helps his brother.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَصَرَ أَخَاهُ بِظَهْرِ الْغَيْبِ نَصَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ<\/p>\n<p><strong>Whoever supports his brother behind his back in his absence, Allah will support him in the world and in the Hereafter.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá 16175, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/01\/15\/ikhwan-brotherhood-help-private\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَبُّ النَّاسِ إِلَى اللَّهِ أَنْفَعُهُمْ لِلنَّاسِ<\/p>\n<p><strong>The most beloved people to Allah are those who are most beneficial to people. <\/strong><\/p>\n<p>Source: al-Muʻjam al-Awsaṭ 6192, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/most-beloved-to-allah-beneficial-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Qabisah ibn Jabir reported: Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ لا يَرْحَمُ لا يُرْحَمُ وَلا يُغْفَرُ مَنْ لا يَغْفِرُ وَلا يُعْفَ عَمَّنْ لَمْ يَعْفُ وَلا يُوقَّ مَنْ لا يَتَوَقَّ<\/p>\n<p>Whoever does not show mercy will not receive mercy. Whoever does not forgive others will not be forgiven. Whoever does not pardon others will not be pardoned. Whoever does not protect others will not be protected.<\/p>\n<p>Source: al-Adab al-Mufrad 366, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/07\/06\/umar-mercy-pardon-forgiveness\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Qilabah reported: Abu Darda, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْ كَمَا شِئْتَ كَمَا تَدِينُ تُدَانُ<\/p>\n<p>Be as you will, for as you judge you shall be judged.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/07\/16\/abu-darda-kama-tudeen-tudan\/\">al-Zuhd li-Aḥmad Ibn Ḥanbal 448<\/a><\/p><\/blockquote>\n<p>Abi Hatim reported: Malik ibn Dinar, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَكْتُوبٌ فِي التَّوْرَاةِ كَمَا تَدِينُ تُدَانُ وَكَمَا تَزْرَعُ تَحْصُدُ<\/p>\n<p>It is written in the Torah: As you judge others, so are you judged. As you reap, so shall you sow.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/12\/13\/ibn-dinar-reap-sow-dunya\/\">al-Zuhd li-Abi Ḥātim 78<\/a><\/p><\/blockquote>\n<p>Because Allah rewards or punishes us according to how we behave with other people, the Prophet (ṣ) instituted the legal principle of <em><a href=\"https:\/\/abuaminaelias.com\/muslims-avoid-harming-people-with-their-words-and-deeds\/\">do no harm<\/a><\/em>. That is, it is not permissible to harm any living creature unless it is necessary to secure a greater benefit or avoid a greater harm.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا ضَرَرَ وَلَا ضِرَارَ مَنْ ضَارَّ ضَرَّهُ اللَّهُ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ<\/p>\n<p><strong>Do not cause<\/strong> <strong>harm or return harm. Whoever harms others, Allah will harm him. Whoever is harsh with others, Allah will be harsh with him.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá 11070, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/08\/15\/la-darara-wa-la-dirar\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>As such, there are essentially two paths in life: good and evil. While there are gray-areas or moral conundrums in life as well, many decisions we make boil down to a simple choice between right and wrong. Whatever we decide to do, we will be recompensed in the Hereafter accordingly.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَمْ نَجْعَل لَّهُ عَيْنَيْنِ وَلِسَانًا وَشَفَتَيْنِ وَهَدَيْنَاهُ النَّجْدَيْنِ<\/p>\n<p><strong>Have We not made for him two eyes? And two lips? And shown him the two ways?<\/strong><\/p>\n<p>Surat al-Balad 90:8-10<\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَمَا لا يُجْتَنَى مِنَ الشَّوْكِ الْعِنَبُ لا يَنْزِلُ الْفُجَّارُ مَنَازِلَ الأَبْرَارِ وَهُمَا طَرِيقَانِ فَأَيُّهُمَا أَخَذْتُمْ أَدَّتْكُمْ إِلَيْهِ<\/p>\n<p><strong>As one does not harvest thorns and grapes together, the wicked will not be in the position of the righteous. There are two paths, so whichever path you take will bring you to its outcome.<\/strong><\/p>\n<p>Source: Amthāl al-Ḥadīth 108, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/29\/recompense-deeds-same-genus\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاسْلُكُوا أَيَّ طَرِيقٍ شِئْتُمْ فَأَيُّ طَرِيقٍ سَلَكْتُمْ وَرَدْتُمْ عَلَى أَهْلِهِ<\/p>\n<p><strong>Traverse the path you wish, for whichever path you travel will lead you back to its people<\/strong>.<\/p>\n<p>Source: Ḥilyat al-Awliyā’ 14946, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/29\/traverse-path-you-wish\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Since we are recompensed according to how we treat other people, it only makes sense, then, to treat others as we would like to be treated. This is the sum of every good character trait in Islam.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحَبَّ أَنْ يُزَحْزَحَ عَنْ النَّارِ وَيَدْخُلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَنِيَّتُهُ وَهُوَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><strong>Whoever would love to be delivered from Hellfire and admitted into Paradise, let him meet his end with faith in Allah and the Last Day, and let him treat people as he would love to be treated<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1844, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/10\/treat-people-love-to-be-treated\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Qayyim explains the fuller implications of this principle, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِذَلِكَ كَانَ الْجَزَاءُ مُمَاثِلًا لِلْعَمَلِ مِنْ جِنْسِهِ فِي الْخَيْرِ وَالشَّرِّ فَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ وَمَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ أَقَالَ نَادِمًا أَقَالَهُ اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ وَمَنْ تَتَبَّعَ عَوْرَةَ أَخِيهِ تَتَبَّعَ اللَّهُ عَوْرَتَهُ وَمَنْ ضَارَّ مُسْلِمًا ضَارَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ وَمَنْ خَذَلَ مُسْلِمًا فِي مَوْضِعٍ يَجِبُ نُصْرَتُهُ فِيهِ خَذَلَهُ اللَّهُ فِي مَوْضِعٍ يَجِبُ نُصْرَتُهُ فِيهِ وَمَنْ سَمَحَ سَمَحَ اللَّهُ لَهُ وَالرَّاحِمُونَ يَرْحَمُهُمْ الرَّحْمَنُ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ وَمَنْ أَنْفَقَ أَنْفَقَ عَلَيْهِ وَمَنْ أَوْعَى أَوْعَى عَلَيْهِ وَمَنْ عَفَا عَنْ حَقِّهِ عَفَا اللَّهُ لَهُ عَنْ حَقِّهِ وَمَنْ تَجَاوَزَ تَجَاوَزَ اللَّهُ عَنْهُ وَمَنْ اسْتَقْصَى اسْتَقْصَى اللَّهُ عَلَيْهِ فَهَذَا شَرْعُ اللَّهِ وَقَدَرُهُ وَوَحْيُهُ وَثَوَابُهُ وَعِقَابُهُ كُلُّهُ قَائِمٌ بِهَذَا الْأَصْلِ<\/p>\n<p>For that reason, the recompense of a deed resembles its type of good and evil. Whoever covers the faults of a Muslim, Allah covers his faults. Whoever eases one in difficulty, Allah will make it easy for him in the world and the Hereafter. Whoever relives a believer of hardship in the world, Allah will relieve his hardship on the Day of Resurrection. Whoever cancels a sale someone later regretted, Allah will cancel his slips on the Day of Resurrection. Whoever seeks the faults of his brother, Allah will seek his faults. Whoever harms a Muslim, Allah will harm him. Whoever is harsh, Allah is harsh with him. Whoever abandons a Muslim in a situation in which he needs support, Allah will abandon him in a situation in which he needs support. Whoever is tolerant, Allah is tolerant with him. The Most Merciful will show mercy to the merciful. Indeed, Allah only has mercy on his merciful servants. Whoever spends in charity, He will spend on him. Whoever is miserly, He will be miserly against him. Whoever foregoes one his rights, Allah will forgo one of His rights over him. Whoever overlooks people&#8217;s faults, Allah will overlook his faults. Whoever searches for faults, Allah will make his faults known. This is the law of Allah, His decree, and His revelation. His reward and punishment are entirely based upon this principle.<\/p>\n<p>Source: Iʻlām al-Muwaqqiʻīn 1\/150<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِن الْجَزَاء من جنس الْعَمَل فَمن عَفا عفى الله عَنهُ وَمن سامح اخاه فِي إساءته اليه سامحه الله فِي سيئاته وَمن أغضي وَتجَاوز تجَاوز الله عَنهُ وَمن استقصى استقصى عَلَيْهِ<\/p>\n<p>For the recompense is of the same genus as the deed. Whoever forgives, Allah will forgive him. Whoever is forbearing with the bad deeds of his brother, Allah will be forbearing with his bad deeds. Whoever is silent and overlooks them, Allah will overlook him. Whoever searches for faults, his faults will be found.<\/p>\n<p>Source: Miftāḥ Dār al-Sa’ādah 1\/291<\/p><\/blockquote>\n<p>Shaykh al-Sa’di further connects this principle to the perfection of faith and sincerity to Allah:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكذلك الإحسان إلى الخلق بالقول والفعل والمال والجاه وأنواع المنافع هو من الإيمان ومن دواعي الإيمان والجزاء من جنس العمل فكما أحسن إلى عباد الله وأوصل إليهم من بره ما يقدر عليه أحسن الله إليه أنواعا من الإحسان &#8230; ومن وفق للإحسان في عبادة ربه والإحسان في معاملة الخلق فقد تحقق نصحه<\/p>\n<p>Likewise is good behavior to the creation, in word, deed, wealth, reputation, and all types of benefit, which are part of faith and its concerns. The recompense is from the same genus as the deeds. As one is good to the servants of Allah and approaches them with benevolence – as much as one can – Allah will be good to him with all types of good… Whoever combines excellence in the worship of his Lord and excellence in dealing with the creation, he has fully actualized his sincerity.<\/p>\n<p>Source: Al-Tawḍīḥ wal-Bayān li-Shajarat al-Īmān 1\/79<\/p><\/blockquote>\n<p>In sum, the reward or punishment we receive from Allah in the Hereafter directly mirrors our conduct towards other people in this worldly life. If we are harsh, cruel, and arrogant, Allah will punish us harshly to humble us. If we are kind, gentle, and humble, Allah will reward us by exalting our status in Paradise.<\/p>\n<p>May Allah grant us strength of faith, conviction, and wisdom to apply this principle to the best of our abilities.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah helps a servant as long as he helps his brother.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[14,16,20,183,22,342,25,26,49,330,135,32,104,100,54,134,103,70,73],"class_list":["post-20598","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-arrogance-al-takabbur","tag-character-akhlaq","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-excellence-ihsaan","tag-al-fiqh","tag-forbearance-al-hilm","tag-forgiveness-al-maghfirah","tag-gentleness-al-rifq","tag-good-will-naseehah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humility-al-tawaduh","tag-manners-al-adab","tag-mercy-al-rahmah","tag-paradise-jannah","tag-public-welfare-al-maslaha","tag-sincerity-al-ikhlaas","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5me","jetpack-related-posts":[{"id":16830,"url":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","url_meta":{"origin":20598,"position":0},"title":"Definition of faith in Islam","author":"Abu Amina Elias","date":"August 16, 2015","format":false,"excerpt":"\"Faith is to believe in Allah, His angels, His books...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15522,"url":"https:\/\/www.abuaminaelias.com\/attributes-of-success-in-the-hereafter\/","url_meta":{"origin":20598,"position":1},"title":"Attributes of success in the Hereafter","author":"Abu Amina Elias","date":"February 24, 2014","format":false,"excerpt":"\"Certainly the believers have succeeded.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":20598,"position":2},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":20598,"position":3},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15489,"url":"https:\/\/www.abuaminaelias.com\/nearest-to-allah-and-the-prophet-in-the-hereafter\/","url_meta":{"origin":20598,"position":4},"title":"Nearest to Allah and the Prophet in the Hereafter","author":"Abu Amina Elias","date":"February 17, 2014","format":false,"excerpt":"\"Shall I tell you about the most beloved to me and the closest to my assembly on the Day of Resurrection? They are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15748,"url":"https:\/\/www.abuaminaelias.com\/allah-multiplies-the-reward-for-good-deeds\/","url_meta":{"origin":20598,"position":5},"title":"Allah multiplies the reward for good deeds","author":"Abu Amina Elias","date":"June 9, 2014","format":false,"excerpt":"\"Every deed of the son of Adam is multiplied from ten to seven hundred times.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20598","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20598"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20598\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20598"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20598"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20598"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}