{"id":20664,"date":"2019-07-07T14:08:47","date_gmt":"2019-07-07T10:08:47","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20664"},"modified":"2025-05-13T13:02:26","modified_gmt":"2025-05-13T09:02:26","slug":"forty-hadith-on-knowledge","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-knowledge\/","title":{"rendered":"Forty Hadith on Knowledge"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Updated October 10th, 2024 CE \/ Rabi&#8217; al-Thani 7th, 1446 AH<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 1<br \/>\n<\/strong><strong>Seeking Knowledge is an Obligation طَلَبُ العِلمِ فَرِيضَةٌ<\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ<\/p>\n<p><strong>Seeking knowledge is an obligation upon every Muslim.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 224, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/30\/talab-ilm-wajib-faridah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 2<br \/>\n<\/strong><strong>Wayfaring to Allah السُّلُوك<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلاَئِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ<\/p>\n<p><strong>Whoever travels a path in search of knowledge, Allah will make easy for him a path to Paradise. People do not gather in the houses of Allah, reciting the book of Allah and studying it together, but that tranquility will descend upon them, mercy will cover them, angels will surround them, and Allah will mention them to those near him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade:<strong><em> <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 3<br \/>\nInheritance of the Prophets وَرَثَةُ الأَنبِيَاء<\/strong><\/p>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّ الْمَلَائِكَةَ لَتَضَعُ أَجْنِحَتَهَا رِضًا لِطَالِبِ الْعِلْمِ وَإِنَّ الْعَالِمَ لَيَسْتَغْفِرُ لَهُ مَنْ فِي السَّمَوَاتِ وَمَنْ فِي الْأَرْضِ وَالْحِيتَانُ فِي جَوْفِ الْمَاءِ وَإِنَّ فَضْلَ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِ الْقَمَرِ لَيْلَةَ الْبَدْرِ عَلَى سَائِرِ الْكَوَاكِبِ وَإِنَّ الْعُلَمَاءَ وَرَثَةُ الْأَنْبِيَاءِ وَإِنَّ الْأَنْبِيَاءَ لَمْ يُوَرِّثُوا دِينَارًا وَلَا دِرْهَمًا وَرَّثُوا الْعِلْمَ فَمَنْ أَخَذَهُ أَخَذَ بِحَظٍّ وَافِرٍ<\/p>\n<p><strong>Verily, the angels lower their wings for the seeker of knowledge. The inhabitants of the heavens and earth, even the fish in the depths of the water, seek forgiveness for the scholar. The virtue of the scholar over the worshiper is like the superiority of the moon over the stars. The scholars are the inheritors of the Prophets. They do not leave behind gold or silver coins, but rather they leave behind knowledge. Whoever has taken hold of it has been given an abundant share.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3641, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/20\/heavens-earth-praise-scholars\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 4<br \/>\nVirtue of the Scholar فَضلُ العَالِمِ<\/strong><\/p>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِي عَلَى أَدْنَاكُمْ إِنَّ اللَّهَ وَمَلَائِكَتَهُ وَأَهْلَ السَّمَوَاتِ وَالْأَرَضِينَ حَتَّى النَّمْلَةَ فِي جُحْرِهَا وَحَتَّى الْحُوتَ لَيُصَلُّونَ عَلَى مُعَلِّمِ النَّاسِ الْخَيْرَ<\/p>\n<p><strong>The virtue of the scholar over the worshiper is like my virtue over the least of you. Verily, Allah, his angels, the inhabitants of the heavens and earth, even the ant in his hole and the fish, send blessings upon the one who teaches people what is good<\/strong>.<\/p><\/blockquote>\n<p>Fudayl ibn ‘Iyad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَالِمٌ عَامِلٌ مُعَلِّمٌ يُدْعَى كَبِيرًا فِي مَلَكُوتِ السَّمَوَاتِ<\/p>\n<p>A scholar who works in teaching has a high status in the domain of the heavens.<\/p>\n<p>Source: Sunan al-Tirmidhī 2685, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/01\/knowledge-virtue-scholars-worshipers\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 5<br \/>\nUnderstanding in Religion فِقه في الدِّينِ<\/strong><\/p>\n<p>Mu’awiyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ<\/p>\n<p><strong>If Allah intends goodness for someone, he gives him understanding of the religion<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 71, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/19\/if-allah-intends-good-fiqh\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّمَا الْعِلْمُ بِالتَّعَلُّمِ وَالْفِقْهُ بِالتَّفَقُّهِ وَمَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَإِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ<\/p>\n<p style=\"text-align: left;\"><strong>O people, knowledge only comes by learning and understanding only comes by seeking understanding. For whomever Allah intends good, he gives him understanding of the religion. Verily, only those with knowledge fear Allah among his servants.<\/strong> (35:28)<\/p>\n<p style=\"text-align: left;\">Source: al-Mu’jam al-Kabīr 929, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/05\/only-knowledgable-fear-allah\/\"><em>Hasan<\/em><\/a><\/p>\n<\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 6<br \/>\nGood Character حُسنُ الخُلُق<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُكُمْ إِسْلَامًا أَحَاسِنُكُمْ أَخْلَاقًا إِذَا فَقُهُوا<\/p>\n<p><strong>The best of you in Islam are those with the best character, if they have religious understanding.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 9880, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/11\/good-character-understand-fiqh\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik ibn Anas, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ حَقًّا عَلَى مَنْ طَلَبَ الْعِلْمَ أَنْ يَكُونَ لَهُ وَقَارٌ وَسَكِينَةٌ وَخَشْيَةٌ وَأَنْ يَكُونَ مُتَّبِعًا لآثَارِ مَنْ مَضَى قَبْلَهُ<\/p>\n<p>Verily, it is the duty of a student of knowledge to behave with dignity, tranquility, and reverence, and to follow the way of those who came before him.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/05\/19\/malik-adab-duty-of-students\/\">Jāmi’ Bayān al-‘Ilm 619<\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 7<br \/>\nParable of Rain مَثَلُ غَيْثٍ<\/strong><\/p>\n<p>Abu Musa reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مَثَلَ مَا بَعَثَنِيَ اللَّهُ بِهِ عَزَّ وَجَلَّ مِنْ الْهُدَى وَالْعِلْمِ كَمَثَلِ غَيْثٍ أَصَابَ أَرْضًا فَكَانَتْ مِنْهَا طَائِفَةٌ طَيِّبَةٌ قَبِلَتْ الْمَاءَ فَأَنْبَتَتْ الْكَلَأَ وَالْعُشْبَ الْكَثِيرَ يَرْفَعْ وَكَانَ مِنْهَا أَجَادِبُ أَمْسَكَتْ الْمَاءَ فَنَفَعَ اللَّهُ بِهَا النَّاسَ فَشَرِبُوا مِنْهَا وَسَقَوْا وَرَعَوْا وَأَصَابَ طَائِفَةً مِنْهَا أُخْرَى إِنَّمَا هِيَ قِيعَانٌ لَا تُمْسِكُ مَاءً وَلَا تُنْبِتُ كَلَأً فَذَلِكَ مَثَلُ مَنْ فَقُهَ فِي دِينِ اللَّهِ وَنَفَعَهُ بِمَا بَعَثَنِيَ اللَّهُ بِهِ فَعَلِمَ وَعَلَّمَ وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ<\/p>\n<p><strong>Verily, the parable of the guidance and knowledge that Allah Almighty sent with me is the likeness of rain falling upon the earth. Among them is a good group which receives the water and thus there is abundant growth of herbage and grass. Among them is a barren land which retains the water and thus Allah benefits people from it; they drink from it and graze their animals. And it falls upon another group which is only abysmal; it does not retain water, nor does herbage grow. Such is the parable of one who understands the religion of Allah and benefits from what Allah sent with me; he learns and he teaches. Such is the parable of one who does not raise his head and does not accept the guidance Allah sent with me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 79, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/07\/parable-prophet-hidayah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 8<br \/>\nAdmiration of Quran Reciters الحَسَدُ فِي قِرَاءَةِ القُرْآنِ<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَحَاسُدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَتْلُوهُ آنَاءَ اللَّيْلِ وَالنَّهَارِ يَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ هَذَا لَفَعَلْتُ كَمَا يَفْعَلُ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا يُنْفِقُهُ فِي حَقِّهِ فَيَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ لَفَعَلْتُ كَمَا يَفْعَلُ<\/p>\n<p><strong>There is no envy but in two cases: a man whom Allah has given the Quran and he recites it by night and day, so it is said: If I were given the likes of this, I would act as he has. And a man whom Allah has given wealth and he spends it rightly, so it is said: If I were given the likes of this, I would act as he has.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7232, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/16\/no-hasad-but-two\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا حَسَدَ إِلَّا عَلَى اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ هَذَا الْكِتَابَ فَقَامَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَتَصَدَّقَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ<\/p>\n<p style=\"text-align: left;\"><strong>There is no envy but in two cases: a man whom Allah has given this Book and he stands to recite it by night and day, and a man whom Allah has given wealth and he spends it in charity by night and day.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7529, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/16\/no-hasad-quran-sadaqah\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 9<br \/>\nVirtue of Quran Teachers فَضلُ مَن تَعَلَّمَ القُرْآنَ<\/strong><\/p>\n<p>Uthman bin Affan reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ<\/p>\n<p><strong>The best of you are those who learn the Quran and teach it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5027, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/02\/taalam-al-quran-wa-allamahu\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 10<br \/>\nCalling to Allah الدَّعوَة إِلَى اللَّه<\/strong><\/p>\n<p>Sahl ibn Sa’d reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهِ لَأَنْ يَهْدِيَ اللَّهُ بِكَ رَجُلًا خَيْرٌ لَكَ مِنْ أَنْ يَكُونَ لَكَ حُمْرُ النَّعَمِ<\/p>\n<p><strong>By Allah, that Allah guides a man through you is better for you than a herd of expensive red camels<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2847, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/04\/dawah-hidayah-islam-better\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 11<br \/>\nEven a Single Verse وَلَو آيَةً<\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلِّغُوا عَنِّي وَلَوْ آيَةً وَحَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلَا حَرَجَ وَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ<\/p>\n<p><strong>Convey from me, even a single verse. Narrate from the children of Israel, for there is no blame in it. Whoever deliberately lies about me, let him take his seat in Hellfire<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3274, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/04\/israiliyat-hadith-share-one-ayah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 12<br \/>\nIsraelite Narrations الإسرَائِيلِيَّات<\/strong><\/p>\n<p>Abdullah ibn Amr reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُنَا عَنْ بَنِي إِسْرَائِيلَ حَتَّى يُصْبِحَ مَا يَقُومُ إِلَّا إِلَى عُظْمِ صَلَاةٍ<\/p>\n<p>The Prophet, peace and blessings be upon him, would narrate stories from the children of Israel until the morning came. The Prophet would not stand but for the greatness of prayer.<\/p>\n<p>Source: Sunan Abī Dāwūd 3663, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/04\/israiliyat-hadith-permission-stories\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Shafi’i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنَ الْمَعْلُومِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُجِيزُ التَّحَدُّثَ بِالْكَذِبِ فَالْمَعْنَى حَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ بِمَا لَا تَعْلَمُونَ كَذِبَهُ<\/p>\n<p>It is known that the Prophet (ṣ) did not approve of falsehood. Thus, the meaning is to narrate from the children of Israel what is known not to be false.<\/p>\n<p>Source: Fatḥ al-Bārī 3274<\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 13<br \/>\nSpreading Knowledge نَشر العِلمِ<\/strong><\/p>\n<p>Zayd ibn Thabit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَضَّرَ اللَّهُ امْرَأً سَمِعَ مِنَّا حَدِيثًا فَحَفِظَهُ حَتَّى يُبَلِّغَهُ فَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ وَرُبَّ حَامِلِ فِقْهٍ لَيْسَ بِفَقِيهٍ<\/p>\n<p><strong>May Allah brighten the face of a person who hears a tradition from us and he memorizes it until he can convey it to others. Perhaps he will convey it to one who understands better than him, and perhaps one who conveys knowledge does not understand it himself.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3660, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/04\/hadith-convey-understand-better\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 14<br \/>\nEstablishing Good Precedent مَن سَنَّ سُنَّةً حَسَنَةً<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنَ الأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلاَلَةٍ كَانَ عَلَيْهِ مِنَ الإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا ‏‏<\/p>\n<p><strong>Whoever calls to guidance will have a reward similar to those who follow him, without detracting from their rewards at all. Whoever calls to misguidance will have sin upon him similar to those who follow him, without detracting from their sins at all<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2674, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/08\/calling-righteousness-sin\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 15<br \/>\nReviving the Sunnah مَن أَحيَا سُنَّةً<\/strong><\/p>\n<p>‘Amr ibn ‘Awf reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْلَمْ إِنَّهُ مَنْ أَحْيَا سُنَّةً مِنْ سُنَّتِي قَدْ أُمِيتَتْ بَعْدِي فَإِنَّ لَهُ مِنْ الْأَجْرِ مِثْلَ مَنْ عَمِلَ بِهَا مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ ابْتَدَعَ بِدْعَةَ ضَلَالَةٍ لَا تُرْضِي اللَّهَ وَرَسُولَهُ كَانَ عَلَيْهِ مِثْلُ آثَامِ مَنْ عَمِلَ بِهَا لَا يَنْقُصُ ذَلِكَ مِنْ أَوْزَارِ النَّاسِ شَيْئً<\/p>\n<p><strong>Know that whoever revives a tradition from my Sunnah if it has died out after me, he will have a reward like those who act upon it without diminishing any of their rewards. Whoever innovates a misguided heresy not pleasing to Allah and his messenger, he will have a sin like those who act upon it without diminishing any of the people’s burdens.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2677, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/09\/revive-forgotten-sunnah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p><strong>&#8212;<\/strong><\/p>\n<p style=\"text-align: center;\"><strong>Hadith 16<br \/>\nOngoing Charity صَدَقَةٌ جَارِيَة<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ<\/p>\n<p><strong>When the human being dies, his deeds end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1631, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/23\/deeds-sadaqah-al-jariya\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِمَّا يَلْحَقُ الْمُؤْمِنَ مِنْ عَمَلِهِ وَحَسَنَاتِهِ بَعْدَ مَوْتِهِ عِلْمًا عَلَّمَهُ وَنَشَرَهُ وَوَلَدًا صَالِحًا تَرَكَهُ وَمُصْحَفًا وَرَّثَهُ أَوْ مَسْجِدًا بَنَاهُ أَوْ بَيْتًا لِابْنِ السَّبِيلِ بَنَاهُ أَوْ نَهْرًا أَجْرَاهُ أَوْ صَدَقَةً أَخْرَجَهَا مِنْ مَالِهِ فِي صِحَّتِهِ وَحَيَاتِهِ يَلْحَقُهُ مِنْ بَعْدِ مَوْتِهِ<\/p>\n<p><strong>Verily, among the good deeds that will join a believer after his death are these: knowledge which he taught and spread, a righteous child he leaves behind, a copy of the Quran he leaves for inheritance, a mosque he has built, a house he built for travelers, a well he has dug, and charity distributed from his wealth while he was alive and well. These deeds will join him after his death.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 242, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/05\/21\/types-of-sadaqah-al-jariyyah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 17<br \/>\nIn the Way of Allah فِي سَبِيلِ اللَّهِ<\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ خَرَجَ فِي طَلَبِ الْعِلْمِ كَانَ فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ<\/p>\n<p><strong>Whoever goes out seeking knowledge is in the way of Allah until he returns.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2647, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/02\/20\/seeking-knowledge-jihad\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ دَخَلَ مَسْجِدَنَا هَذَا لِيَتَعَلَّمَ خَيْرًا أَوْ لِيُعَلِّمَهُ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَمَنْ دَخَلَهُ لِغَيْرِ ذَلِكَ كَانَ كَالنَّاظِرِ إِلَى مَا لَيْسَ لَهُ<\/p>\n<p><strong>Whoever enters our mosque in order to teach goodness, or to learn it himself, he is striving in jihad in the way of Allah. Whoever enters it for another reason, he is viewing what does not belong to him<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 8396, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/12\/masjid-learning-jihad\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Bakr ibn Abdur Rahman, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ غَدَا أَوْ رَاحَ إِلَى الْمَسْجِدِ لَا يُرِيدُ غَيْرَهُ لِيَتَعَلَّمَ خَيْرًا أَوْ لِيُعَلِّمَهُ ثُمَّ رَجَعَ إِلَى بَيْتِهِ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ رَجَعَ غَانِمًا<\/p>\n<p>Whoever departs to the mosque in the morning, intending to go nowhere else and to teach goodness, or to learn it himself, and then he returns to his house, he is like one who strives in jihad in the way of Allah and returns with spoils.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/13\/malik-teaching-learning-jihad\/\">al-Muwaṭṭa’ 384<\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 18<br \/>\nContinuous Learning استِدَامَة طَلَبِ العِلم<\/strong><\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَنْ يَشْبَعَ الْمُؤْمِنُ مِنْ خَيْرٍ يَسْمَعُهُ حَتَّى يَكُونَ مُنْتَهَاهُ الْجَنَّةُ<\/p>\n<p><strong>The believer is never satisfied from learning good until he arrives in Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2686, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/20\/believer-learning-khayr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْهُومَانِ لا يَشْبَعَانِ طَالِبُهُمَا طَالِبُ عِلْمٍ وَطَالِبُ الدُّنْيَا<\/p>\n<p><strong>The seekers of two concerns are never satisfied: the seeker of knowledge and the seeker of the world<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 10388, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/02\/18\/seeker-ilm-dunya-not-satisfied\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malik ibn Anas, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَنْبَغِي لأَحَدٍ يَكُونُ عِنْدَهُ الْعِلْمُ أَنْ يَتْرُكَ التَّعَلُّمَ<\/p>\n<p>It is not befitting for anyone with knowledge to give up learning.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/06\/01\/malik-never-stop-learning\/\">Jāmi’ Bayān al-‘Ilm 423<\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 19<br \/>\nWorldly Life is Cursed الدُّنيا مَلعُونَة<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا إِنَّ الدُّنْيَا مَلْعُونَةٌ مَلْعُونٌ مَا فِيهَا إِلَّا ذِكْرُ اللَّهِ وَمَا وَالَاهُ وَعَالِمٌ أَوْ مُتَعَلِّمٌ<\/p>\n<p><strong>Is not the world cursed and everything in it? Except for the remembrance of Allah and what facilitates it, the scholar or the student.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2322, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/20\/dunya-cursed-dhikr-ilm\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 20<br \/>\nHow Knowledge is Lost كَيفَ يُقبَضُ العِلم<\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنْ الْعِبَادِ وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ حَتَّى إِذَا لَمْ يُبْقِ عَالِمًا اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالًا فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ فَضَلُّوا وَأَضَلُّوا<\/p>\n<p><strong>Verily, Allah does not withhold knowledge by snatching it away from his servants, but rather he withholds knowledge by taking the souls scholars, until no scholar remains and people follow ignorant leaders. They are asked and they issue judgments without knowledge. Thus, they are astray and lead others astray<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 100, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/06\/knowledge-death-scholars\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 21<br \/>\nAllah Knows Best اللهُ أَعلَمُ<\/strong><\/p>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَفَاتِيحُ الْغَيْبِ خَمْسٌ لَا يَعْلَمُهَا إِلَّا اللَّهُ لَا يَعْلَمُ مَا تَغِيضُ الْأَرْحَامُ إِلَّا اللَّهُ وَلَا يَعْلَمُ مَا فِي غَدٍ إِلَّا اللَّهُ وَلَا يَعْلَمُ مَتَى يَأْتِي الْمَطَرُ أَحَدٌ إِلَّا اللَّهُ وَلَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِلَّا اللَّهُ وَلَا يَعْلَمُ مَتَى تَقُومُ السَّاعَةُ إِلَّا اللَّهُ<\/p>\n<p><strong>The keys of the Unseen are five and no one knows them but Allah: no one knows what is in the womb but Allah, no one knows what will happen tomorrow but Allah, no one knows when it will rain but Allah, no one knows where he will die but Allah, and no one knows when the Hour will be established but Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6944, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/22\/five-keys-unseen-al-ghayb\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ اتَّقُوا اللهَ مَنْ عَلِمَ مِنْكُمْ شَيْئًا فَلْيَقُلْ بِمَا يَعْلَمُ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللهُ أَعْلَمُ فَإِنَّهُ أَعْلَمُ لِأَحَدِكُمْ أَنْ يَقُولَ لِمَا لَا يَعْلَمُ اللهُ أَعْلَمُ<\/p>\n<p>O people, fear Allah! Whoever among you knows something, let him say what he knows. Whoever does not know, let him say: Allah knows best. Verily, the most knowledgeable of you is one who says when he does not know: Allah knows best.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2798, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/01\/26\/ibn-masud-allahu-alam\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And Ibn Mas&#8217;ud said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ يَكُ يعني قوله صَوَابًا فَمِنْ اللَّهِ وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنْ الشَّيْطَانِ وَاللَّهُ وَرَسُولُهُ بَرِيئَانِ<\/p>\n<p>If my opinion is correct, it is from Allah. If it is mistaken, it is from myself and Satan. Allah and His Messenger are innocent of it.<\/p>\n<p>Source: Sunan Abī Dāwūd 2116, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/06\/02\/ibn-masud-myself-shaytan\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Imam al-Nasafi al-Hanafi, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَجِبُ عَلَيْنَا إذَا سُئِلْنَا عَنْ مَذْهَبِنَا وَمَذْهَبِ مُخَالِفِنَا فِي الْفُرُوعِ أَنْ نُجِيبَ بِأَنَّ مَذْهَبَنَا صَوَابٌ يَحْتَمِلُ الْخَطَأَ وَمَذْهَبَ مُخَالِفِنَا خَطَأٌ يَحْتَمِلُ الصَّوَابَ أَيْ بِنَاءً عَلَى أَنَّ الْمُصِيبَ فِي الْفُرُوعِ وَاحِدٌ وَغَيْرُهُ مُخْطِئٌ مَأْجُورٌ<\/p>\n<p>When we are asked about our way and the way of those who disagree with us in the branches of the religion, it obligatory for us to answer that our way is correct but could be mistaken, and their way is mistaken but could be correct.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/11\/madhhab-abu-hanifa-ikhtilaf\/\">al-Fatāwá al-Fiqhīyah al-Kubrá 4\/313<\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 22<br \/>\nIjtihad (Independent Reasoning) الِاجتِهَادِ<\/strong><\/p>\n<p>Amr ibn al-‘As reported: The Messenger of Allah, peace and blessings be upon him, said;<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهُ أَجْرٌ<\/p>\n<p><strong>If a judge makes a ruling, striving to apply his reasoning and he is correct, he will have two rewards. If a judge makes a ruling, striving to apply his reasoning and he is mistaken, he will have one reward.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7352, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/10\/sincere-ijtihad-rewarded\/\"><strong>Muttafaqun Alayhi<\/strong><\/a><\/p><\/blockquote>\n<p>Al-Harith ibn ‘Amr reported: The Messenger of Allah, peace and blessings be upon him, sent Mu’adh to Yemen and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَيْفَ تَقْضِي<\/p>\n<p><strong>How will you judge?<\/strong><\/p><\/blockquote>\n<p>Mu’adh said, “I will judge according to the Book of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ لَمْ يَكُنْ فِي كِتَابِ اللَّهِ<\/p>\n<p><strong>What if it is not in the Book of Allah?<\/strong><\/p><\/blockquote>\n<p>Mu’adh said, “Then, with the Sunnah of the Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ لَمْ يَكُنْ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p><strong>What if it is not in the Sunnah of the Messenger of Allah?<\/strong><\/p><\/blockquote>\n<p>Mu’adh said, “Then, I will strive to form an opinion.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ<\/p>\n<p><strong>All praise is due to Allah, who has made suitable the messenger of the Messenger of Allah.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1327, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/31\/quran-sunnah-then-ijtihad\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 23<br \/>\nQuestions of Moses أَسئِلَة مُوسَى<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَأَلَ مُوسَى رَبَّهُ عَنْ سِتِّ خِصَالٍ كَانَ يَظُنُّ أَنَّهَا لَهُ خَالِصَةً وَالسَّابِعَةُ لَمْ يَكُنْ مُوسَى يُحِبُّهَا قَالَ يَا رَبِّ أَيُّ عِبَادِكَ أَتْقَى قَالَ الَّذِي يَذْكُرُ وَلا يَنْسَى قَالَ فَأَيُّ عِبَادِكَ أَهْدَى قَالَ الَّذِي يَتْبَعُ الْهُدَى قَالَ فَأَيُّ عِبَادِكَ أَحْكُمُ قَالَ الَّذِي يَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ قَالَ فَأَيُّ عِبَادِكَ أَعْلَمُ قَالَ عَالِمٌ لا يَشْبَعُ مِنَ الْعِلْمِ يَجْمَعُ عِلْمَ النَّاسِ إِِلَى عِلْمِهِ قَالَ فَأَيُّ عِبَادِكَ أَعَزُّ قَالَ الَّذِي إِِذَا قَدَرَ غَفَرَ قَالَ فَأَيُّ عِبَادِكَ أَغْنَى قَالَ الَّذِي يَرْضَى بِمَا يُؤْتَى قَالَ فَأَيُّ عِبَادِكَ أَفْقَرُ قَالَ صَاحِبٌ مَنْقُوصٌ<\/p>\n<p><strong>Moses asked his Lord about six traits he thought he had, but the seventh he did not like. Moses said: O Lord, who is the most Godfearing of Your servants? Allah said: Those who remember and do not forget. Moses said: Who is the most guided of Your servants? Allah said: Those who follow the guidance. Moses said: Who is the best in judgment of Your servants? Allah said: Those who judge people as they would love to be judged themselves. Moses said: Who are the most knowledgeable of Your servants? Allah said: A scholar who is unsatisfied with his knowledge and adds the knowledge of people to his own. Moses said: Who are the most honored of Your servants? Allah said: Those who forgive when they have power over others. Moses said: Who are the richest of Your servants? Allah said: Those who are pleased with what they have. Moses said: Who are the poorest of Your servants? Allah said: Those who desire more than they need.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 6217, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/07\/moses-six-qualities\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 24<br \/>\nAngels Lower Wings المَلَائِكَة لَتَضَعُ أَجنِحَتَهَا<br \/>\n<\/strong><\/p>\n<p>Safwan ibn ‘Assal reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ خَارِجٍ خَرَجَ مِنْ بَيْتِهِ فِي طَلَبِ الْعِلْمِ إِلَّا وَضَعَتْ لَهُ الْمَلَائِكَةُ أَجْنِحَتَهَا رِضًا بِمَا يَصْنَعُ<\/p>\n<p><strong>No one leaves their house in search of knowledge but that angels will lower their wings in approval of what he is doing<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 226, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/11\/angels-lower-wings-ilm\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 25<br \/>\nCondemnation of Status-Seeking and Ostentation ذَمُّ الجَاهِ وَالرِّيَاء<\/strong><\/p>\n<p>Ka’b ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ طَلَبَ الْعِلْمَ لِيُجَارِيَ بِهِ الْعُلَمَاءَ أَوْ لِيُمَارِيَ بِهِ السُّفَهَاءَ أَوْ يَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ أَدْخَلَهُ اللَّهُ النَّارَ<\/p>\n<p><strong>Whoever seeks knowledge to impress the scholars, to argue with the foolish, or to attract the attention of people, Allah will admit him into Hellfire<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2654, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/05\/warning-seek-knowledge-dunya\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 26<br \/>\nNo Price Taken لَا يَأخُذُ عَلَى العِلمِ ثَمَنًا<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَعَلَّمَ عِلْمًا مِمَّا يُبْتَغَى بِهِ وَجْهُ اللَّهِ عَزَّ وَجَلَّ لَا يَتَعَلَّمُهُ إِلَّا لِيُصِيبَ بِهِ عَرَضًا مِنْ الدُّنْيَا لَمْ يَجِدْ عَرْفَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever seeks knowledge that should be sought for the sake of Allah Almighty, but only to gain some worldly benefit, he will never know the fragrance Paradise on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3664, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/20\/study-islam-dunya\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 27<br \/>\nCondemnation of Concealing Knowledge ذَمُّ كِتمَانِ العِلم<br \/>\n<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سُئِلَ عَنْ عِلْمٍ عَلِمَهُ ثُمَّ كَتَمَهُ أُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ<\/p>\n<p><strong>Whoever is asked for knowledge and he conceals it, Allah will clothe him with a bridle of fire on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2649, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/03\/20\/whoever-conceals-knowledge\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 28<br \/>\nPraiseworthy and Blameworthy Knowledge في العِلم المَحمُودِ وَالمَذمُومِ<\/strong><\/p>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَلُوا اللَّهَ عِلْمًا نَافِعًا وَتَعَوَّذُوا بِاللَّهِ مِنْ عِلْمٍ لَا يَنْفَعُ<\/p>\n<p><strong>Ask Allah for beneficial knowledge and seek refuge in Allah from knowledge without benefit.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3843, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/04\/11\/ask-allah-benefit-knowledge\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 29<br \/>\nAbandon Commentary by Opinion  فِي تَركِ التّفسِيرِ بِالظَّنِّ <\/strong><\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ فِي الْقُرْآنِ بِغَيْرِ عِلْمٍ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ<\/p>\n<p><strong>Whoever speaks on the Quran without knowledge, let him take his seat in Hellfire.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2950, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/05\/08\/tafsir-quran-ignorance\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 30<br \/>\nStanding by the United Community فِي لُزُومِ الجَمَاعَة<\/strong><\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَجْمَعُ أُمَّتِي عَلَى ضَلَالَةٍ وَيَدُ اللَّهِ مَعَ الْجَمَاعَةِ<\/p>\n<p><strong>Verily, Allah will not let my nation agree upon misguidance. The hand of Allah is over the united community<\/strong>.<\/p><\/blockquote>\n<p>Al-Tirmidhi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْجَمَاعَةِ عِنْدَ أَهْلِ الْعِلْمِ هُمْ أَهْلُ الْفِقْهِ وَالْعِلْمِ وَالْحَدِيثِ<\/p>\n<p>The interpretation of the united community, according to the scholars, are the people of Fiqh, knowledge, and Hadith.<\/p>\n<p>Source: Sunan al-Tirmidhī 2167, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/05\/01\/ummah-ilm-fiqh-hadith\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 31<br \/>\nKnowledge Better Than Worship فَضلُ العِلمِ خَيرٌمِن فَضلِ العِبَادَةِ<\/strong><\/p>\n<p>Sa’d ibn Abi Waqqas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَضْلُ الْعِلْمِ أَحَبُّ إِلَيَّ مِنْ فَضْلِ الْعِبَادَةِ وَخَيْرُ دِينِكُمُ الْوَرَعُ<\/p>\n<p><strong>The virtue of knowledge is more beloved to me than the virtue of worship, and the best of your religion is piety<\/strong>.<\/p>\n<p>Source: al-Ādāb lil-Bayhaqī 818, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/04\/04\/knowledge-over-ibadah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 32<br \/>\nDisappearance of Quran and Knowledge ذَهَاب القُرْآنِ وَالعِلمِ<\/strong><\/p>\n<p>Ziyad ibn Labid reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذَاكَ عِنْدَ أَوَانِ ذَهَابِ الْعِلْمِ<\/p>\n<p><strong>There will be a time when knowledge disappears<\/strong>.<\/p><\/blockquote>\n<p>Ziyad said, “O Messenger of Allah, how can knowledge disappear when we read the Quran and will teach it to our children until the Day of Resurrection?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَكِلَتْكَ أُمُّكَ زِيَادُ إِنْ كُنْتُ لَأَرَاكَ مِنْ أَفْقَهِ رَجُلٍ بِالْمَدِينَةِ أَوَلَيْسَ هَذِهِ الْيَهُودُ وَالنَّصَارَى يَقْرَءُونَ التَّوْرَاةَ وَالْإِنْجِيلَ لَا يَعْمَلُونَ بِشَيْءٍ مِمَّا فِيهِمَا<\/p>\n<p><strong>May your mother be bereft of you, Ziyad! I thought you were the wisest man in Medina. Do not these Jews and Christians read the Torah and the Gospel, but they do not act upon what is in them?<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4048, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/05\/03\/jahiliyyah-stop-acting-on-quran\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 33<br \/>\nCure for Ignorance شِفَاءُ العِيِّ<\/strong><\/p>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا شِفَاءُ الْعِيِّ السُّؤَالُ<\/p>\n<p><strong>Verily, the only cure for ignorance is to ask questions.<\/strong><\/p><\/blockquote>\n<p>Source: Sunan Abī Dāwūd 336, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/05\/cure-ignorance-ask-questions\/\">Sahih<\/a><\/em><\/strong><\/p>\n<p>Ibn al-Qayyim commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ جَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَهْلَ دَاءً وَجَعَلَ دَوَاءَهُ سُؤَالَ الْعُلَمَاءِ<\/p>\n<p>The Prophet designated ignorance as a disease and he designated the cure as asking the scholars.<\/p>\n<p>Source: al-Jawāb al-Kāfī 1\/8<\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 34<br \/>\nLiability for Malpractice تَضمِينُ المُتَطَبِّب<\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ<\/p>\n<p><strong>Whoever practices medicine without any prior knowledge of medicine will be held liable.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3466, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/03\/19\/doctors-unqualified-malpractice\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أُفْتِيَ بِغَيْرِ عِلْمٍ كَانَ إِثْمُهُ عَلَى مَنْ أَفْتَاهُ وَمَنْ أَشَارَ عَلَى أَخِيهِ بِأَمْرٍ يَعْلَمُ أَنَّ الرُّشْدَ فِي غَيْرِهِ فَقَدْ خَانَهُ<\/p>\n<p><strong>Whoever is given an opinion not based on knowledge, his sin falls upon the one who gave him the opinion. Whoever directs his brother to a matter of which he knows good lies elsewhere, he has betrayed him.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3657, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/09\/fatwa-ignorance-verdict-betrayal\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 35<br \/>\nRefuge from Useless Knowledge الِاستِعَاذَةُ مِن عِلمٍ لَا يَنفَعُ<\/strong><\/p>\n<p>Zayd ibn Arqam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ دَعْوَةٍ لاَ يُسْتَجَابُ لَهَا<\/p>\n<p><strong>O Allah, I seek refuge in you from knowledge that does not benefit, from a heart that is not reverent, from a soul that is not content, and from a supplication that is not answered<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2722, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/22\/seek-refuge-disability-laziness\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 36<br \/>\nBest of Gatherings خَيرُ الجُلَسَاءِ<\/strong><\/p>\n<p>Ibn Abbas reported: It was said, “O Messenger of Allah, which gathering is best?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ذَكَّرَكُمُ اللَّهَ رُؤْيَتُهُ وَزَادَ فِي عِلْمِكُمْ مَنْطِقُهُ وَذَكَّرَكُمْ بِالآخِرَةِ عَمَلُهُ<\/p>\n<p><strong>A gathering of those who inspire you to remember Allah when you see them, whose discourse increases your knowledge, and whose good deeds inspire you to remember the Hereafter.<\/strong><\/p>\n<p>Source: Musnad Abī Ya’lá 2408, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/05\/11\/best-assembly-dhikr-virtue\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 37<br \/>\nThe Reckoning فِي شَأْنِ الْحِسَاب<\/strong><\/p>\n<p>Abu Barzah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَزُولُ قَدَمَا عَبْدٍ يَوْمَ الْقِيَامَةِ حَتَّى يُسْأَلَ عَنْ عُمُرِهِ فِيمَا أَفْنَاهُ وَعَنْ عِلْمِهِ فِيمَ فَعَلَ وَعَنْ مَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَعَنْ جِسْمِهِ فِيمَ أَبْلَاهُ<\/p>\n<p><strong>The feet of a servant will not move on the Day of Resurrection until he is asked about his lifetime and how he used it, his knowledge and how he acted upon it, his wealth and from where he acquired it and how he spent it, and his body and how he exhausted it.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2417, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/06\/life-knowledge-wealth-health\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 38<br \/>\nPrayers for Knowledge أَدعِيَةِ طَلَبِ العِلم<br \/>\n<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا<\/p>\n<p><strong>O Allah, benefit me with what you have taught me, teach me what will benefit me, and increase my knowledge. <\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3599, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/24\/dua-teach-me-beneficial-knowledge\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 39<br \/>\nParable of the Scholar مَثَلُ العَالِم<\/strong><\/p>\n<p>Jundub ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْعَالِمِ الَّذِي يُعَلِّمُ النَّاسَ الْخَيْرَ وَيَنْسَى نَفْسَهُ كَمَثَلِ السِّرَاجِ يُضِيءُ لِلنَّاسِ وَيَحْرِقُ نَفْسَهُ<\/p>\n<p><strong>The parable of the scholar who teaches people virtue but forgets himself, is that of a lamp giving people light while it burns itself.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/06\/hypocrite-preacher-burning-lamp\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 40<br \/>\nCondemnation of Fierce Argumentation ذَمُّ الأَلَدِّ الخَصِمِ<br \/>\n<\/strong><\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ<\/p>\n<p><strong>Verily, the most hated man to Allah is the one who is ‘fiercest in argument.’<\/strong> (2:204)<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2668, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/19\/do-not-argue-harshly\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>&#8212;<\/p>\n<p style=\"text-align: center;\"><strong>Hadith 41<br \/>\nLost Property of the Believer ضَالَّةُ المُؤْمِنِ<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْمُؤْمِنِ فَحَيْثُ وَجَدَهَا فَهُوَ أَحَقُّ بِهَا<\/p>\n<p><strong>The word of wisdom is the lost property of the believer. Wherever he finds it, he is most deserving of it<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2687, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/01\/wisdom-lost-property-believer\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Seeking knowledge is an obligation on every Muslim.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[16,17,282,183,342,184,135,32,41,90,47,50,100,134,115,66,220,329,332],"class_list":["post-20664","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-children","tag-day-of-resurrection-yawm-al-qiyammah","tag-al-fiqh","tag-guidance-al-hidaya","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-imam-al-shafii","tag-innovation-bidah","tag-jihad","tag-knowledge","tag-manners-al-adab","tag-paradise-jannah","tag-people-of-the-book","tag-remembrance-dhikr","tag-supplication-al-dua","tag-temperance-zuhd","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5ni","jetpack-related-posts":[{"id":17756,"url":"https:\/\/www.abuaminaelias.com\/seeking-knowledge-and-learning-for-life-in-islam\/","url_meta":{"origin":20664,"position":0},"title":"Life-long learning in Islam","author":"Abu Amina Elias","date":"February 18, 2016","format":false,"excerpt":"\"It is not befitting for anyone with knowledge to give up learning.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20653,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-knowledge-teaching-learning\/","url_meta":{"origin":20664,"position":1},"title":"Imam al-Mundhiri on Seeking Knowledge, Teaching, and Learning","author":"Abu Amina Elias","date":"July 5, 2019","format":false,"excerpt":"\"Seeking knowledge is an obligation on every Muslim.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15174,"url":"https:\/\/www.abuaminaelias.com\/education-of-women-in-islam\/","url_meta":{"origin":20664,"position":2},"title":"Education of women in Islam","author":"Abu Amina Elias","date":"January 8, 2014","format":false,"excerpt":"\"Say: My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13006,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-seeking-knowledge\/","url_meta":{"origin":20664,"position":3},"title":"Imam al-Nawawi on Seeking Knowledge","author":"Abu Amina Elias","date":"March 27, 2013","format":false,"excerpt":"\"My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17977,"url":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","url_meta":{"origin":20664,"position":4},"title":"Good character before learning Islamic sciences","author":"Abu Amina Elias","date":"April 5, 2016","format":false,"excerpt":"\"What I learned from Malik's manners was better than his knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18837,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-good-character\/","url_meta":{"origin":20664,"position":5},"title":"Forty Hadith on Good Character","author":"Abu Amina Elias","date":"February 1, 2018","format":false,"excerpt":"\"Most complete of believers in faith are those with the best character,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20664","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20664"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20664\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20664"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20664"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20664"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}