{"id":20726,"date":"2016-07-04T10:48:37","date_gmt":"2016-07-04T06:48:37","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20726"},"modified":"2025-07-04T11:00:14","modified_gmt":"2025-07-04T07:00:14","slug":"fasting-on-day-of-arafat-or-not","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","title":{"rendered":"Fasting on the Day of Arafat or not?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Muslims scholars disagree on whether fasting on the day of ‘Arafat is recommend, permissible, or discouraged. Many scholars have held that it is recommended, while others have not encouraged the practice. Each group of scholars brings evidence from the prophetic tradition and practice of the righteous predecessors to support their opinion, which makes it a legitimate difference of opinion. This article will explain the how each group of scholars came to their opinion.<\/p>\n<p>The scholars who recommended fasting on the day of ‘Arafat cite evidence for the general virtue of good deeds in the first ten days of Dhul-Hijjah, as well as some explicit narrations.<\/p>\n<p>Ibn Abbas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا الْعَمَلُ فِي أَيَّامٍ أَفْضَلَ مِنْهَا فِي هَذِهِ<\/p>\n<p><strong>No good deeds are better than what is done in these first ten days of Dhul-Hijjah<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 926, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/28\/virtue-ten-days-of-dhul-hijjah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ أَيَّامٍ أَفْضَلُ عِنْدَ اللَّهِ مِنْ أَيَّامِ عَشْرِ ذِي الْحِجَّةِ<\/p>\n<p><strong>No days are better to Allah than the first ten days of Dhul-Hijjah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3853, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/03\/barakah-dhul-hijjah-arafat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْضَلُ أَيَّامِ الدُّنْيَا أَيَّامُ الْعَشْرِ عَشْرِ ذِي الْحِجَّةِ<\/p>\n<p><strong>The best days in this world are the first ten days of Dhul-Hijjah<\/strong>.<\/p>\n<p>Source: al-Amālī al-Khamīsīyah 1687, Grade: <em>Hasan<\/em><\/p><\/blockquote>\n<p>There is an additional narration from the Prophet (ṣ), authentic according to Imam Muslim, that explicitly singles out the day of ‘Arafat for voluntary fasting.<\/p>\n<p>Abu Qatadah reported: The Prophet, peace and blessings be upon him, was asked about fasting the day of Arafat and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُكَفِّرُ السَّنَةَ الْمَاضِيَةَ وَالْبَاقِيَةَ<\/p>\n<p><strong>It will expiate the sins of the previous and upcoming years.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1162, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/24\/fasting-arafah-ashura\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>On this basis, many scholars among the righteous predecessors recommended fasting this day for Muslims who are not performing the Hajj pilgrimage.<\/p>\n<p>Al-Tirmidhi said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَدِيثُ أَبِي قَتَادَةَ حَدِيثٌ حَسَنٌ وَقْدِ اسْتَحَبَّ أَهْلُ العِلْمِ صِيَامَ يَوْمِ عَرَفَةَ إِلاَّ بِعَرَفَة<\/p>\n<p>The narration of Abu Qatadah is good, and it was recommended by the scholars to fast on the day of ‘Arafat, except for those at ‘Arafat.<\/p>\n<p>Source: Sunan al-Tirmidhī 794<\/p><\/blockquote>\n<p>The recommendation of these scholars to fast the day of ‘Arafat applies to non-pilgrims, those who are not actually at ‘Arafat performing the Hajj pilgrimage.<\/p>\n<p>Ibn Umar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَجَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَصُمْهُ وَمَعَ أَبِي بَكْرٍ فَلَمْ يَصُمْهُ وَمَعَ عُمَرَ فَلَمْ يَصُمْهُ وَمَعَ عُثْمَانَ فَلَمْ يَصُمْهُ وَأَنَا لَا أَصُومُهُ وَلَا آمُرُ بِهِ وَلَا أَنْهَى عَنْهُ<\/p>\n<p>I have performed the Hajj pilgrimage with the Prophet (ṣ) and he did not fast during Arafat. I performed it with Abu Bakr and he did not fast, with Umar and he did not fast, and with Uthman and he did not fast. I do not fast it, nor do I command it or prohibit it.<\/p><\/blockquote>\n<p>Al-Tirmidhi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ الْإِفْطَارَ بِعَرَفَةَ لِيَتَقَوَّى بِهِ الرَّجُلُ عَلَى الدُّعَاءِ وَقَدْ صَامَ بَعْضُ أَهْلِ الْعِلْمِ يَوْمَ عَرَفَةَ بِعَرَفَةَ<\/p>\n<p>The practice among the majority of scholars is that it is recommended to break fasting on the day of Arafat for a man to have strength to supplicate. Some scholars would fast on the day of Arafat while at Arafat.<\/p>\n<p>Source: Sunan al-Tirmidhī 751, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/14\/fasting-or-not-arafah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>A plurality of scholars from the four orthodox schools of Fiqh upheld the recommendation for non-pilgrims to fast on the day of ‘Arafat.<\/p>\n<p>Al-Nawawi, from the school of Al-Shafi’i, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الشَّافِعِيُّ وَالْأَصْحَابُ يُسْتَحَبُّ صَوْمُ يَوْمِ عَرَفَةَ لِغَيْرِ مَنْ هُوَ بِعَرَفَةَ<\/p>\n<p>Al-Shafi’i and our scholars recommended fasting the day of ‘Arafat, for those who are not at ‘Arafat.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 6\/380<\/p><\/blockquote>\n<p>Ibn Qudamah, from the school of Ahmad ibn Hanbal, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهُوَ يَوْمٌ شَرِيفٌ عَظِيمٌ وَعِيدٌ كَرِيمٌ وَفَضْلُهُ كَبِيرٌ وَقَدْ صَحَّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ صِيَامَهُ يُكَفِّرُ سَنَتَيْنِ<\/p>\n<p> The day of ‘Arafat is tremendous in nobility, an honored celebration, and a great virtue. It has been authentically narrated from the Prophet (s) that fasting this day expiates two years of (minor) sins.<\/p>\n<p>Source: al-Mughnī 3\/179<\/p><\/blockquote>\n<p>Al-Kasani, from the Hanafi school, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا صَوْمُ يَوْمِ عَرَفَةَ فَفِي حَقِّ غَيْرِ الْحَاجِّ مُسْتَحَبٌّ لِكَثْرَةِ الْأَحَادِيثِ الْوَارِدَةِ بِالنَّدْبِ إلَى صَوْمِهِ<\/p>\n<p>As for fasting on the day of ‘Arafat, it is a recommended duty on non-pilgrims, due to the many narrations that encourage its fasting.<\/p>\n<p>Source: Badāʼi’ al-Ṣanāʼi’ 2\/79<\/p><\/blockquote>\n<p>Nevertheless, this view was not universally held by the righteous predecessors or the latter jurists. This is because the Prophet (ṣ) declared that the day of ‘Arafat is a celebration (<em>eid<\/em>) and fasting is not permitted on a day of celebration.<\/p>\n<p>‘Uqbah ibn ‘Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَوْمُ عَرَفَةَ وَيَوْمُ النَّحْرِ وَأَيَّامُ التَّشْرِيقِ عِيدُنَا أَهْلَ الْإِسْلَامِ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ<\/p>\n<p><strong>The day of Arafat, the day of sacrifice, and the three following days of al-Tashriq<\/strong> <strong>are celebrations for the people of Islam. They are days of eating and drinking.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 773, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/14\/no-fasting-eid-fitr-adha-tashriq\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Khalil al-Jundi, from the Maliki school, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال المازري كَشَكِّهِ فِي صَوْمِ يَوْمِ عَرَفَةَ هَلْ هُوَ العيد<\/p>\n<p>Al-Maziri said there is a doubt in fasting the day of ‘Arafat. Is it a celebration?<\/p>\n<p>Source: Mukhtaṣar Khalīl 1\/20<\/p><\/blockquote>\n<p>According to Ibn Rushd, also from the Maliki school, the disagreement is over the conflicting narrations about whether a non-pilgrim should fast on the day of ‘Arafat or treat it as a celebration without fasting:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا اخْتِلَافُهُمْ فِي يَوْمِ عَرَفَةَ فَلِأَنَّ النَّبِيَّ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ أَفْطَرَ يَوْمَ عَرَفَةَ &#8230; وَلِذَلِكَ اخْتَلَفَ النَّاسُ فِي ذَلِكَ وَاخْتَارَ الشَّافِعِيُّ الْفِطْرَ فِيهِ لِلْحَاجِّ وَصِيَامَهُ لِغَيْرِ الْحَاجِّ جَمْعًا بَيْنَ الْأَثَرَيْنِ<\/p>\n<p>As for the disagreement over fasting the day of ‘Arafat, that is because the Prophet (ṣ) did not fast it… For that reason, people disagreed over it… Al-Shafi’i preferred for pilgrims not to fast and non-pilgrims to fast, in an effort to reconcile the two reports.<\/p>\n<p>Source: Bidāyat al-Mujtahid 2\/70<\/p><\/blockquote>\n<p>Those who do not encourage fasting also pointed to potential weakness in the narration of Abu Qatadah in Sahih Muslim. Al-Bukhari did not consider it authentic, and Al-Tirmidhi graded it as “good” (<em>hasan<\/em>), which is less than authentic.<\/p>\n<p>Al-Tabari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَثَبَتَ عِنْدَكَ عَنْ جَمَاعَةٍ مِنَ السَّلَفِ كَرَاهَتُهُمْ صَوْمَ ذَلِكَ الْيَوْمِ لِكُلِّ أَحَدٍ فِي كُلِّ مَوْضِعٍ وَكُلِّ بُقْعَةٍ مِنْ بِقَاعِ الْأَرْضِ وَإِنْكَارُ بَعْضِهِمُ الْخَبَرَ الَّذِي رُوِيَ عَنْ أَبِي قَتَادَةَ<\/p>\n<p>It has been confirmed for you that a group of the righteous predecessors discouraged fasting on the day of ‘Arafat for everyone, in any situation, in any location on the earth. Some of them rejected the report narrated from Abu Qatadah.<\/p>\n<p>Source: Tahdhīb al-Āthār 1\/361<\/p><\/blockquote>\n<p>In sum, scholars among the righteous predecessors recommended fasting on the day of ‘Arafat for non-pilgrims, but discouraged it for pilgrims during Hajj. Other scholars among them discouraged fasting on this day in any case. Whichever opinion Muslims decide to follow, they should do so sincerely for the sake of Allah in an attempt to best follow the Sunnah and acknowledge that the matter is a legitimate scholarly disagreement.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is a doubt in fasting the day of ‘Arafat. Is it a celebration?&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[406,380,85,342,88,38,39,41,43,55,365,91],"class_list":["post-20726","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-ashura","tag-discouraged-al-makruh","tag-fasting-al-siyam","tag-al-fiqh","tag-pilgrimage-hajj","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-methodology-al-minhaj","tag-recommendation-al-mustahab","tag-righteous-predecessors-al-salaf-al-salih"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5oi","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":20726,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21111,"url":"https:\/\/www.abuaminaelias.com\/fasting-muharram-day-of-ashura\/","url_meta":{"origin":20726,"position":1},"title":"Fasting in Al-Muharram and Day of &#8216;Ashura","author":"Abu Amina Elias","date":"September 7, 2019","format":false,"excerpt":"\"Best fast after Ramadan is in the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":20726,"position":2},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16602,"url":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","url_meta":{"origin":20726,"position":3},"title":"Worship in the middle night of Sha’ban","author":"Abu Amina Elias","date":"April 23, 2015","format":false,"excerpt":"\"There is a proof for it, so it cannot be rejected.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14735,"url":"https:\/\/www.abuaminaelias.com\/blessings-ten-days-dhul-hijjah\/","url_meta":{"origin":20726,"position":4},"title":"Blessings of the first ten days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 14, 2013","format":false,"excerpt":"\"No days more beloved to Allah than these ten days,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":20726,"position":5},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20726","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20726"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20726\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20726"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20726"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20726"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}