{"id":20801,"date":"2019-08-20T13:00:27","date_gmt":"2019-08-20T09:00:27","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20801"},"modified":"2025-03-01T11:44:27","modified_gmt":"2025-03-01T07:44:27","slug":"islamic-teachings-non-muslims-too","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/islamic-teachings-non-muslims-too\/","title":{"rendered":"Islamic teachings apply to non-Muslims too"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>A common question Muslims have when reading the Quran and Sunnah is whether or not the lesson applies to non-Muslims. The text sometimes uses general language (people, neighbors, children of Adam, etc.) and sometimes uses specific language (Muslims, believers, brothers, etc.). Some religious rules are definitely specific to Muslims, such as funeral rites, but if the text only refers to Muslims, does that mean non-Muslims are always excluded?<\/p>\n<p>In a moral sense, Muslims should love good for non-Muslims the same as they love for themselves. This comprehensive principle means Muslims should have good will in general towards non-Muslims.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 13, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/18\/love-brother-neighbor-self\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even though this tradition uses the word ‘brother,’ which is usually understood to mean brothers in Islam, many scholars interpret it as inclusive of all people, both to brothers (and sisters) in Islam and to brothers (and sisters) in humanity. All human beings are related to each other through common descent from Adam and Eve (peace be upon them).<\/p>\n<p>Ibn Hajar al-Haytami commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الظاهر أن التعبير بـالأخ هنا جري على الغالب لأنه ينبغي لكل مسلم أن يحب للكفار الإسلام وما يتفرع عليه من الكمالات<\/p>\n<p>It is apparent that the expression ‘brother’ here is used in a general sense, as every Muslim should love for unbelievers to receive Islam and the virtues derived from it.<\/p>\n<p>Source: al-Fatḥ al-Mubīn 1\/305<\/p><\/blockquote>\n<p>Hence, this text might use specific language but it is inclusive of all people. Many times the Prophet (ṣ) was speaking to a group of Muslim men, so the language he used appears specific to Muslim men although the lesson is still applicable to Muslim women and non-Muslims.<\/p>\n<p>This interpretive principle makes sense when understood through the three categories of protected non-Muslims: 1) non-Muslims who are citizens of a Muslim country (<em>al-dhimmi<\/em>), 2) non-Muslims who have a peace treaty with a Muslim country (<em>al-mu’ahid<\/em>), and 3) non-Muslims granted diplomatic immunity or a visa to lawfully enter a Muslim country (<em>al-musta’min<\/em>).<\/p>\n<p>Each of these three categories of peaceful non-Muslims is entitled to legal and moral protection analogous to a Muslim believer. The Prophet (ṣ) was clear that such protection is sacred and inviolable.<\/p>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ نَفْسًا مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا يُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا<\/p>\n<p><strong>Whoever kills a person protected by a treaty will never smell the fragrance of Paradise. Verily, its fragrance can be found from a distance of forty years of travel<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6516, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/06\/11\/break-peace-treaty-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ<\/p>\n<p><strong>Whoever kills a person protected by a treaty, without a just cause, Allah has forbidden Paradise for him<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 2760, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/21\/break-peace-treaty-no-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ظَلَمَ مُعَاهِدًا أَوْ انْتَقَصَهُ أَوْ كَلَّفَهُ فَوْقَ طَاقَتِهِ أَوْ أَخَذَ مِنْهُ شَيْئًا بِغَيْرِ طِيبِ نَفْسٍ فَأَنَا حَجِيجُهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever wrongs a person protected by a covenant, violates his rights, burdens him with more work than he is able to do, or takes something from him without his consent, I will be his prosecutor on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3052, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/16\/prophet-testifies-dhimmi\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>There are many authentic narrations from the Prophet (ṣ) that convey this meaning, so much so that scholars considered them to be mass-transmitted, indisputably true (<em>mutawatir<\/em>). According to Al-Mawwaq:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تواترت الأحاديث بالنهي عن ظلمهم<\/p>\n<p>The narrations that prohibit wronging them have been unanimously reported.<\/p>\n<p>Source: al-Tāj wal-Iklīl 4\/601<\/p><\/blockquote>\n<p>When a non-Muslim is granted legal protection from a Muslim authority – either as citizens, allies, or guests – their lives, property, and reputations may not be harmed in any way. It is not even permissible to curse them or backbite them, which is to speak badly of them in their absence.<\/p>\n<p>Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما الذمي فكالمسلم فيما يرجع إلى المنع من الإيذاء لأن الشرع عصم عرضه ودمه وماله &#8230; الصواب تحريم غيبة الذمي<\/p>\n<p>As for the non-Muslim under protection, he is like the Muslim in regards to the prohibition of harm, as the divine law has made his reputation, life, and property inviolable… The correct opinion is that it is forbidden to backbite a protected non-Muslim.<\/p>\n<p>Source: al-Zawājir ʻan Iqtirāf al-Kabā’ir 2\/27<\/p><\/blockquote>\n<p>And Ibn al-Humam writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وتثبت أحكام الذمي في حقه &#8230; وجوب كف الأذى عنه فتحرم غيبته كما تحرم غيبة المسلم فضلا عما يفعله السفهاء من صفعه وشتمه في الأسواق ظلما وعدوانا<\/p>\n<p>It is established in the rulings of a protected non-Muslim and his rights… that it is obligatory to refrain from harming him and it is forbidden to backbite him, just as it is forbidden to backbite a Muslim, unlike what is done by fools who unjustly and with hostility slap him or insult him in the marketplace.<\/p>\n<p>Source: Fatḥ al-Qadīr 6\/24<\/p><\/blockquote>\n<p>And Ibn ‘Abidin writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إذَا صَارَ ذِمِّيًّا &#8230; وَيَجِبُ كَفِّ الْأَذَى عَنْهُ وَتَحْرُمُ غِيبَتُهُ كَالْمُسْلِمِ لِأَنَّهُ بِعَقْدِ الذِّمَّةِ وَجَبَ لَهُ مَالَنَا فَإِذَا حَرُمَتْ غِيبَةُ الْمُسْلِمِ حَرُمَتْ غِيبَتُهُ بَلْ قَالُوا إنَّ ظُلْمَ الذِّمِّيِّ أَشَدُّ<\/p>\n<p>If one becomes a protected non-Muslim… it is obligatory to refrain from harming him and it is forbidden to backbite him, as it is for a Muslim, because of the covenant of protection. He is entitled to our wealth (in charity or welfare) and if it is forbidden to backbite a Muslim, it is also forbidden to backbite him. Rather, some scholars said that wronging a protected non-Muslim is even worse.<\/p>\n<p>Source: al-Durr al-Mukhtār 4\/171<\/p><\/blockquote>\n<p>And Al-Buhuti writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومن لعن ذميا معينا أدب لأنه معصوم وعرضه محرم &#8230; ولعل المراد أن يلعن فاعل ذلك الذنب على العموم مثل أن يقول لعن الله فاعل كذا أما لعنة معين بخصوصه فالظاهر أنها لا تجوز<\/p>\n<p>Whoever curses a protected non-Muslim by name should be disciplined, as his reputation is inviolable and forbidden… Perhaps the intended meaning is that one may use a general wording to curse someone who commits a sin, such as saying: May Allah curse the doer of this sin! As for cursing a specific person by name, it is obvious that it is not permissible.<\/p>\n<p>Source: Kashshāf al-Qinā’ ‘an al-Iqnā’ 6\/125-126<\/p><\/blockquote>\n<p>And Zakariyya al-Ansari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَغِيبَةُ الْكَافِرِ مُحَرَّمَةٌ إنْ كَانَ ذِمِّيًّا &#8230; بل تجب بذلا لنصيحة الغير وتحذيره من الشر<\/p>\n<p>Backbiting an unbeliever is forbidden if he is under protection… Rather, it is an obligation to offer sincere advice to others and to warn them from evil.<\/p>\n<p>Source: Asnā al-Muṭālib 3\/117<\/p><\/blockquote>\n<p>As we can see, a protected non-Muslim has the same legal status as a Muslim in regards to safety from harm to their lives, property, and reputations.<\/p>\n<p>Some scholars extended the protection of non-Muslims to economic activity, such that it is impermissible to undermine their sales or unlawfully outbid them.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَسُومُ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ<\/p>\n<p><strong>A man must not undermine the transactions of his brother.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1408, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/20\/do-not-undermine-nikah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even though ‘brother’ is used in this tradition, which generally means Muslim brothers (and sisters), jurists extended the principle to include the three categories of protected non-Muslims.<\/p>\n<p>Al-Jamal commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالذِّمِّيُّ وَالْمُعَاهِدُوَالْمُسْتَأْمَنُ مِثْلُ الْمُسْلِمِ وَخَرَجَ الْحَرْبِيُّ وَالْمُرْتَدُّ<\/p>\n<p>The non-Muslim citizen, the non-Muslim in a peace treaty, and the non-Muslim granted immunity are all like the Muslim in this regard, excluding the combatant and renegade apostate.<\/p>\n<p>Source: Ḥāshiyāt al-Jamal ʻalá Sharḥ al-Manhaj 3\/90<\/p><\/blockquote>\n<p>Only combatants in an active war (<em>al-harbi<\/em>) and renegade apostates (<em>al-murtad<\/em>) forfeit their legal protection because they are, by definition, engaged in violence against the Muslim community.<\/p>\n<p>In sum, non-Muslims in the three legally protected categories enjoy a status similar to Muslims in regard to basic moral behavior and safety from harm. Most non-Muslims in the world fall into one of the three categories, as citizenship, international peace treaties, and diplomatic immunity are global norms. For this reason, Muslims should treat such non-Muslims with good manners, beautiful character, and principled integrity as taught in the Quran and Sunnah.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;None of you has faith until he loves for his brother what he loves for himself.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[384,391,241,16,383,133,386,183,330,385,387,388,32,48,52,100,361,134,59,115,389,390,189,98,381,393,392],"class_list":["post-20801","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-backbiting-al-ghibah","tag-bloodshed-safk-al-dima","tag-brotherhood-al-ikhwa","tag-character-akhlaq","tag-civil-protection-al-dhimmah","tag-covenants","tag-curses-al-laan","tag-day-of-resurrection-yawm-al-qiyammah","tag-good-will-naseehah","tag-guarding-the-tongue-hafz-al-lisan","tag-haram","tag-harm-al-darar","tag-hereafter-akhirah","tag-justice-adl","tag-love-al-mahabbah","tag-manners-al-adab","tag-obligations-al-faraid","tag-paradise-jannah","tag-peace","tag-people-of-the-book","tag-property-al-mal","tag-reputation-al-ard","tag-trade-al-baya","tag-unbelief-al-kufr","tag-war-al-harb","tag-warning-al-nadhr","tag-wrongdoing-al-thulm"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5pv","jetpack-related-posts":[{"id":17452,"url":"https:\/\/www.abuaminaelias.com\/congratulating-non-muslims-festivals\/","url_meta":{"origin":20801,"position":0},"title":"Prohibition of congratulating non-Muslims for their festivals","author":"Abu Amina Elias","date":"December 23, 2015","format":false,"excerpt":"\"Harshness is not found in anything except that it disgraces it.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17741,"url":"https:\/\/www.abuaminaelias.com\/force-non-muslims-to-the-side-of-the-road\/","url_meta":{"origin":20801,"position":1},"title":"Force Non-Muslims to the Side of the Road?","author":"Abu Amina Elias","date":"February 15, 2016","format":false,"excerpt":"\"We have been prohibited from harming them without a just cause.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20176,"url":"https:\/\/www.abuaminaelias.com\/expel-jews-christians-arabian-peninsula\/","url_meta":{"origin":20801,"position":2},"title":"Expel Jews and Christians from Arabian Peninsula?","author":"Abu Amina Elias","date":"February 10, 2019","format":false,"excerpt":"\"Allah does not forbid you from those who did not fight you,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13626,"url":"https:\/\/www.abuaminaelias.com\/greeting-non-muslims-salaam\/","url_meta":{"origin":20801,"position":3},"title":"Can Muslims greet non-Muslims with peace?","author":"Abu Amina Elias","date":"June 2, 2013","format":false,"excerpt":"\"This is an assurance of security for the people of our covenant.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":20801,"position":4},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":20801,"position":5},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20801","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20801"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20801\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}