{"id":20841,"date":"2019-08-28T16:09:54","date_gmt":"2019-08-28T12:09:54","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20841"},"modified":"2021-10-20T10:55:21","modified_gmt":"2021-10-20T06:55:21","slug":"tawassul-prophets-saints-graves","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/tawassul-prophets-saints-graves\/","title":{"rendered":"Tawassul: Seeking help from prophets and saints?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p><em>Tawassul<\/em> (using means to draw closer to Allah) is one of the most controversial subjects in Islam. Muslims are confused about this topic because the line between legitimate tawassul and seeking help from deceased or absent righteous people (known as <em>al-istighathah<\/em>) has been blurred by numerous spiritual movements. They conflate the issue of legitimate tawassul with istighathah of people in the grave, while they are two different issues.<\/p>\n<p>Is it permissible to seek the help of righteous people who are in their graves? Is such an act an authentic form of tawassul?<\/p>\n<p>First of all, Allah has commanded the believers to perform tawassul as a means drawing closer to Him.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَ<\/p>\n<p><strong>O you who have faith, fear Allah and seek means to approach Him.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:35<\/p><\/blockquote>\n<p>Al-Tabari commented on the interpretation of this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاطْلُبُوا الْقُرْبَةَ إِلَيْهِ بِالْعَمَلِ بِمَا يُرْضِيهِ والْوَسِيلَةُ هِيَ الْفَعِيلَةُ مِنْ قَوْلِ الْقَائِلِ تَوَسَّلْتُ إِلَى فُلَانٍ بِكَذَا بِمَعْنَى تَقَرَّبْتُ إِلَيْهِ<\/p>\n<p>Pursue nearness to Allah by deeds pleasing to Him. The means of approach (<em>al-wasilah<\/em>) is the action of one who says: I approached so-and-so by such-and-such, meaning I came close to him.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 5:35<\/p><\/blockquote>\n<p>Tawassul understood as such is to draw close to Allah and ask him by means of something. There are three types of tawassul that Muslim scholars unanimously agree upon: 1) asking Allah by His names and attributes, 2) asking Allah by our good deeds, and 3) asking Allah by supplication of a righteous, living, and present person. These three types are legislated by many texts of the Quran and Sunnah, so there is no need to prove their validity here.<\/p>\n<p>The problem is that there is a another, more controversial type of tawassul involving deceased righteous people at their graves. Some classical scholars legitimated this type of tawassul, which involves asking Allah “by the right” or “by the status” of the deceased by their graves, believing that Allah alone causes benefit and harm; the righteous person in the grave is not asked for help.<\/p>\n<p>According to the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوَّلُهَا يعني الاِسْتِغَاثَة بِالْخَلْق أَنْ يَسْأَل اللَّهَ بِالْمُتَوَسَّل بِهِ تَفْرِيجَ الْكُرْبَةِ وَلاَ يَسْأَل الْمُتَوَسَّل بِهِ شَيْئًا كَقَوْل الْقَائِل اللَّهُمَّ بِجَاهِ رَسُولِكَ فَرِّجْ كُرْبَتِي وَهُوَ عَلَى هَذَا سَائِلٌ لِلَّهِ وَحْدَهُ وَمُسْتَغِيثٌ بِهِ وَلَيْسَ مُسْتَغِيثًا بِالْمُتَوَسَّل بِهِ وَقَدِ اتَّفَقَ الْفُقَهَاءُ عَلَى أَنَّ هَذِهِ الصُّورَةَ لَيْسَتْ شِرْكًا لأِنهَا اسْتِغَاثَةٌ بِاَللَّهِ تَبَارَكَ وَتَعَالَى وَلَيْسَتِ اسْتِغَاثَةً بِالْمُتَوَسَّل بِهِ وَلَكِنَّهُمُ اخْتَلَفُوا فِي الْمَسْأَلَةِ مِنْ حَيْثُ الْحِل وَالْحُرْمَةِ<\/p>\n<p>The first way of seeking the aid of created beings is to ask Allah by means of someone to relieve a hardship. He does not ask anything from the one who is used as a means, such as saying: O Allah, I ask You by the status of Your messenger to relieve my hardship. In this way he asks Allah alone and seeks His aid, and he does not seek aid from the one who is used as a means. The jurists agree that this form of seeking aid is not idolatry, as aid is sought from Allah Almighty and aid is not sought from the one who is used as a means. However, they disagreed over whether this is permissible or forbidden.<\/p>\n<p>Source: al-Mawsū&#8217;at al-Fiqhīyah al-Kuwaytīyah 4\/24<\/p><\/blockquote>\n<p>In other words, some scholars permitted making tawassul by asking Allah by means of those in the grave, especially the Prophet (ṣ), <em>but<\/em> <em>they should not directly ask the one in the grave for help<\/em>. This is a key point, because in this from of tawassul, the scholars require that the worshiper knows it is Allah Almighty who is asked by means of the person. Allah alone has power to benefit or harm.<\/p>\n<p>This form of tawassul is most commonly associated with the Prophet (ṣ) in discussions about visiting his grave. For instance, Al-Nawawi writes about what the scholars of his school permitted:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ يَرْجِعُ إلَى مَوْقِفِهِ الْأَوَّلِ قُبَالَةَ وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَتَوَسَّلُ بِهِ فِي حَقِّ نَفْسِهِ وَيَسْتَشْفِعُ بِهِ إلَى رَبِّهِ سُبْحَانَهُ وَتَعَالَى وَمِنْ أَحْسَنِ مَا يَقُولُ مَا حَكَاهُ الْمَاوَرْدِيُّ وَالْقَاضِي أَبُو الطَّيِّبِ وَسَائِرُ أَصْحَابِنَا عَنْ الْعُتْبِيِّ مُسْتَحْسِنِينَ لَهُ قَالَ<\/p>\n<p style=\"text-align: right;\">كُنْت جَالِسًا عِنْدَ قَبْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ أَعْرَابِيٌّ فَقَالَ السَّلَامُ عَلَيْك يَا رَسُولَ اللَّهِ سَمِعْت اللَّهَ يَقُولُ <strong>وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جَاءُوكَ فَاسْتَغْفَرُوا اللَّهَ وَاسْتَغْفَرَ لهم الرسول لوجدوا الله توابا رحيما<\/strong> وَقَدْ جِئْتُك مُسْتَغْفِرًا مِنْ ذَنْبِي مُسْتَشْفِعًا بِك إلَى رَبِّي<\/p>\n<p>Then, the pilgrim returns to his place in front of the Messenger of Allah (ṣ) and he uses him as a means by his right and he seeks intercession with his Lord Almighty by him. Among the best of what to say is related by Al-Mawardi, Al-Qadi Abu al-Tayyib, and the rest of our scholars from Al-‘Utbi. He said:<\/p>\n<p>I was sitting at the grave of the Messenger of Allah (ṣ) and a bedouin came and said: Peace be upon you, O Messenger of Allah. I heard Allah say, ‘<strong>If they had come to you when they wronged themselves and sought forgiveness from Allah and the Messenger sought forgiveness for them, they would have found Allah to be relenting and merciful<\/strong>,’ (4:64). I have come seeking forgiveness for my sin and seeking intercession with my Lord by you.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 8\/274<\/p><\/blockquote>\n<p>Al-Nawawi later says that the pilgrim should face Mecca (<em>al-qiblah<\/em>) when making supplication, indicating that the supplication is for Allah and not to the Prophet (ṣ) himself.<\/p>\n<p>Scholars like Al-Nawawi permitted such tawassul using specific formulas that were free of idolatry, although other scholars considered this tawassul to be discouraged or prohibited.<\/p>\n<p>Imam Abu Hanifa, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَنْبَغِي لِأَحَدٍ أَنْ يَدْعُوَ اللَّهَ إلَّا بِهِ<\/p>\n<p>No one should call upon Allah except by Him.<\/p>\n<p>Source: al-Durr al-Mukhtār 6\/396<\/p><\/blockquote>\n<p>And Ibn Abi al-&#8216;Izz commented on al-Aqidah al-Tahawiyyah, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ كَانَ يعنى الْحَلِف بِغَيْر اللَّهِ مُرَادُهُ الْإِقْسَامَ عَلَى اللَّهِ فَذَلِكَ مَحْذُورٌ أَيْضًا لِأَنَّ الْإِقْسَامَ بِالْمَخْلُوقِ عَلَى الْمَخْلُوقِ لَا يَجُوزُ فَكَيْفَ عَلَى الْخَالِقِ &#8230; وَلِهَذَا قَالَ أَبُو حَنِيفَةَ وَصَاحِبَاهُ رَضِيَ اللَّهُ عَنْهُمْ يُكْرَهُ أَنْ يَقُولَ الدَّاعِي أَسْأَلُكَ بِحَقِّ فُلَانٍ أَوْ بِحَقِّ أَنْبِيَائِكَ وَرُسُلِكَ وَبِحَقِّ الْبَيْتِ الْحَرَامِ<\/p>\n<p>If one&#8217;s swearing by other than Allah is intended to adjure Allah, that is also forbidden, as stating an oath by a created being for a created being is not permissible, so how can it be for the Creator? &#8230; For this reason, Abu Hanifa and his companions, may Allah be pleased with him, disapproved of a supplicant saying: I ask You by the right of so-and-so, or by the right of Your prophets and messengers, or by the right of the sacred house.<\/p>\n<p>Source: Sharḥ al-&#8216;Aqīdah al-Ṭaḥāwịyah 1\/297<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا هُوَ الَّذِي قَالَ أَبُو حَنِيفَةَ وَأَصْحَابُهُ إنَّهُ لَا يَجُوزُ وَنَهَوْا عَنْهُ حَيْثُ قَالُوا لَا يُسْأَلُ بِمَخْلُوقِ وَلَا يَقُولُ أَحَدٌ أَسْأَلُك بِحَقِّ أَنْبِيَائِك<\/p>\n<p>This is what was said by Abu Hanifa and his companions. It is not permissible and they prohibited it, such that they said Allah is not asked by created beings, nor does one say: I ask You by the right of Your prophets.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/202<\/p><\/blockquote>\n<p>And Ibn Mawdud writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُكْرَهُ أَنْ يَدْعُوَ اللَّهَ إِلَّا بِهِ فَلَا يَقُولُ أَسْأَلُكَ بِفُلَانٍ أَوْ بِمَلَائِكَتِكَ أَوْ بِأَنْبِيَائِكَ وَنَحْوِ ذَلِكَ لِأَنَّهُ لَا حَقَّ لِلْمَخْلُوقِ عَلَى الْخَالِقِ<\/p>\n<p>It is disapproved to call upon Allah unless by Him. Thus, one does not say: I ask You by such person, or by Your angels, or by Your prophets, and so on, as created beings have no such right over the Creator.<\/p>\n<p>Source: al-Ikhtiyār li-Ta’līl al-Mukhtār 4\/164<\/p><\/blockquote>\n<p>These scholars cited as evidence, among other things, the statement of the Prophet, peace and blessings be upon him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ حَلَفَ بِغَيْرِ اللَّهِ فَقَدْ أَشْرَكَ<\/p>\n<p><strong>Whoever swears by other than Allah has committed an act of idolatry.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3251, Grade: <strong><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/09\/swearing-oath-shirk\/\">Sahih<\/a><\/strong><\/p><\/blockquote>\n<p>Although what is intended by this statement is lesser idolatry, Allah knows best, not greater idolatry that removes one from the fold of Islam. Hence, this type of tawassul is controversial and therefore it is better to avoid it, as it is a doubtful matter.<\/p>\n<p>It can also be very dangerous for lay Muslims who are not aware of the specific limits that these scholars placed upon this practice. Indulging and exaggerating in this controversial tawassul at the graves eventually leads to supplication to the righteous themselves, seeking their help, and a cult of grave-worshiping centered upon various spiritual personalities. Indeed, some Muslims have formed entire movements around not simply asking Allah by means of his Prophet (ṣ), but of asking the Prophet (ṣ) or their perceived-saints directly for their help.<\/p>\n<p>This type of tawassul is not actually tawwasul. Rather, it is istighathah, seeking the help or refuge of created beings. It is unanimously prohibited by the majority of Muslim scholars throughout history, as mentioned in the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرَّابِعُ يعني التوسل التَّحْرِيمُ وَذَلِكَ إِذَا اسْتَغَاثَ بِمَنْ لاَ يَمْلِكُ فِي الأْمُورِ الْمَعْنَوِيَّةِ بِالْقُوَّةِ أَوِ التَّأْثِيرِ سَوَاءٌ كَانَ الْمُسْتَغَاثُ بِهِ إِنْسَانًا أَوْ جِنًّا أَوْ مَلَكًا أَوْ نَبِيًّا فِي حَيَاتِهِ أَوْ بَعْدَ مَمَاتِهِ قال الله تعالى <strong>وَلاَ تَدْعُ مِنْ دُونِ اللَّهِ مَا لاَ يَنْفَعُكَ وَلاَ يَضُرُّكَ<\/strong><\/p>\n<p>The fourth type of seeking means (<em>tawassul<\/em>) is forbidden, which is to seek the aid of one who has no control, power, or effect over matters in which his help is sought, whether one whose aid is sought is a human, a jinn, an angel, a prophet in his life or after his death. Allah said: <strong>Do not call upon those besides Allah who cannot benefit or harm you.<\/strong> (10:106)<\/p>\n<p>Source: al-Mawsū&#8217;at al-Fiqhīyah al-Kuwaytīyah 4\/22<\/p><\/blockquote>\n<p>And Ibn Khuzaymah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفَلَيْسَ الْعِلْمُ مُحِيطًا أَنَّهُ غَيْرُ جَائِزٍ أَنْ يَأْمُرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالتَّعَوُّذِ بِخَلْقِ اللَّهِ مِنْ شَرِّ خَلْقِهِ هَلْ سَمِعْتُمْ عَالِمًا يُجِيزُ أَنْ يَقُولَ الدَّاعِي أَعُوذُ بِالْكَعْبَةِ مِنْ شَرِّ خَلْقِ اللَّهِ أَوْ يُجِيزُ أَنْ يَقُولَ أَعُوذُ بِالصَّفَا وَالْمَرْوَةِ أَوْ أَعُوذُ بِعَرَفَاتٍ وَمِنًى مِنْ شَرِّ مَا خَلَقَ اللَّهُ هَذَا لَا يَقُولُهُ وَلَا يُجِيزُ الْقَوْلَ بِهِ مُسْلِمٌ يَعْرِفُ دِينَ اللَّهِ مُحَالٌ أَنْ يَسْتَعِيذَ مُسْلِمٌ بِخَلْقِ اللَّهِ مِنْ شَرِّ خَلْقِهِ<\/p>\n<p>Is it not understood that it is not possible the Prophet (ṣ) commanded seeking refuge in the creation of Allah from the evil of His creation? Have you heard a scholar permit a supplicant to say: I seek refuge in the Ka&#8217;bah from the evil Allah has created? Or permit one to say: I seek refuge in Safa and Marwah, or I seek refuge in Arafat and Mina from the evil Allah has created? This would not be said or permitted by a Muslim who knows the religion of Allah. It is impossible for a Muslim to seek refuge in the creation of Allah from the evil of His creation.<\/p>\n<p>Source: al-Tawḥīd 1\/401<\/p><\/blockquote>\n<p>Muslims who engage in this type of practice are at risk of committing greater idolatry (<em>al-shirk al-akbar<\/em>), which removes one from the fold of Islam, as this practice outwardly resembles idolatry. Supplication (<em>dua<\/em>), which is calling upon someone for supernatural help, is an act of worship and should only be done for Allah alone. Even so, Muslims who mistakenly do this should not be deemed unbelievers.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ أَضَلُّ مِمَّن يَدْعُو مِن دُونِ اللَّهِ مَن لَّا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَن دُعَائِهِمْ غَافِلُونَ<\/p>\n<p><strong>Who is more astray than one who calls upon other than Allah, those who cannot answer him until the Day of Resurrection and are unaware of their supplications?<\/strong><\/p>\n<p>Surat al-Ahqaf 46:5<\/p><\/blockquote>\n<p>Al-Nu’man ibn Bashir reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّعَاءُ هُوَ الْعِبَادَةُ<\/p>\n<p><strong>Supplication is the essence of worship.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet (ṣ) recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ رَبُّكُمْ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ<\/p>\n<p><strong>Your Lord says: Call upon Me and I will answer you. Verily, those who disdain My worship will enter Hell in humiliation.<\/strong> (40:60)<\/p>\n<p>Source: Sunan al-Tirmidhī 3247, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/04\/11\/dua-essence-ibadah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ مَاتَ وَهْوَ يَدْعُو مِنْ دُونِ اللَّهِ نِدًّا دَخَلَ النَّارَ<\/p>\n<p><strong>Whoever dies while calling upon a partner besides Allah will enter Hellfire.<\/strong><\/p><\/blockquote>\n<p>And Abdullah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ مَاتَ وَهْوَ لَا يَدْعُو لِلَّهِ نِدًّا دَخَلَ الْجَنَّةَ<\/p>\n<p>Whoever dies without calling upon a partner alongside Allah will enter Paradise.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4227, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/28\/whoever-dies-dua-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا سَأَلْتَ فَاسْأَلْ اللَّهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ<\/p>\n<p><strong>If you ask, ask from Allah. If you seek help, seek help from Allah. <\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2516, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/29\/mindful-allah-he-will-protect-you\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Ubadah ibn al-Samit reported: Abu Bakr said, “Come, let us seek the aid of the Messenger of Allah, peace and blessings be upon him.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُقَامُ لِي إِنَّمَا يُقَامُ لِلَّهِ تَبَارَكَ وَتَعَالَى<\/p>\n<p><strong>That is not done for me. Verily, that is only done for Allah Almighty.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22097, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/28\/seek-divine-help-from-allah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ لا يُسْتَغَاثُ بِى إِنَّما يُسْتَغَاثُ بالله<\/p>\n<p><strong>My aid is not to be sought. Verily, one only seeks the aid of Allah.<\/strong><\/p>\n<p>Source: Majma&#8217; al-Zawāʼid 10\/126<\/p><\/blockquote>\n<p>And Ibn Abi al&#8217;-Izz writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالدُّعَاءُ مِنْ أَفْضَلِ الْعِبَادَاتِ وَالْعِبَادَاتُ مَبْنَاهَا عَلَى السُّنَّةِ وَالِاتِّبَاعِ لَا عَلَى الْهَوَى وَالِابْتِدَاعِ<\/p>\n<p>Supplication is the greatest act of worship, and acts of worship must be based upon conformity to the Sunnah, not upon whims and innovations.<\/p>\n<p>Source: Sharḥ al-&#8216;Aqīdah al-Ṭaḥāwịyah 1\/297<\/p><\/blockquote>\n<p>Supplication is the most basic and primal of all acts of worship, and supplicating to others in a way only Allah deserves is an act of idolatry and unbelief. Doing so sets up intermediaries or rivals to the worship of Allah, whereas the fundamental belief in Islam is that every believer has a direct connection to his or her Creator through prayer.<\/p>\n<p>In fact, idolatry was introduced to humankind when people started to glorify their ancestors, build statues of them, worship at their graves, and ascribe divine qualities to them. The truth is that the deceased can no longer help the living.<\/p>\n<p>‘Ata’ reported: Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَارَتْ الْأَوْثَانُ الَّتِي كَانَتْ فِي قَوْمِ نُوحٍ فِي الْعَرَبِ بَعْدُ أَسْمَاءُ رِجَالٍ صَالِحِينَ مِنْ قَوْمِ نُوحٍ فَلَمَّا هَلَكُوا أَوْحَى الشَّيْطَانُ إِلَى قَوْمِهِمْ أَنْ انْصِبُوا إِلَى مَجَالِسِهِمْ الَّتِي كَانُوا يَجْلِسُونَ أَنْصَابًا وَسَمُّوهَا بِأَسْمَائِهِمْ فَفَعَلُوا فَلَمْ تُعْبَدْ حَتَّى إِذَا هَلَكَ أُولَئِكَ وَتَنَسَّخَ الْعِلْمُ عُبِدَتْ<\/p>\n<p>All of the idols among the people of Noah appeared among the Arabs later. They were the names of righteous men among the people of Noah. When they passed away, Satan inspired in their people to build statues in the places they used to sit and name them by their names. They did so and they were not worshiped until the first generation passed away and knowledge was lost; then they were worshiped.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4636, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/28\/ibn-abbas-origin-shirk\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ أَنْوَاعِهِ يعني الشرك طَلَبُ الْحَوَائِجِ مِنَ الْمَوْتَى وَالِاسْتِغَاثَةُ بِهِمْ وَالتَّوَجُّهُ إِلَيْهِمْ وَهَذَا أَصْلُ شِرْكِ الْعَالَمِ فَإِنَّ الْمَيِّتَ قَدِ انْقَطَعَ عَمَلُهُ وَهُوَ لَا يَمْلِكُ لِنَفْسِهِ ضَرَّا وَلَا نَفْعًا فَضْلًا عَمَّنِ اسْتَغَاثَ بِهِ وَسَأَلَهُ قَضَاءَ حَاجَتِهِ أَوْ سَأَلَهُ أَنْ يَشْفَعَ لَهُ إِلَى اللَّهِ فِيهَا<\/p>\n<p>Among the types of idolatry are seeking one’s needs from the dead, seeking their aid, and turning to them. This is the origin of idolatry in the world. Indeed, the deeds of the deceased have been put to an end and they have no control for themselves to cause harm or benefit, especially one who seeks their aid and asks them to fulfill their needs or asks them to intercede with Allah for them.<\/p>\n<p>Source: Madārij al-Sālikīn 1\/353<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمْ يَقُلْ أَحَدٌ مِنْ عُلَمَاءِ الْمُسْلِمِينَ إنَّهُ يُسْتَغَاثُ بِشَيْءِ مِنْ الْمَخْلُوقَاتِ فِي كُلِّ مَا يُسْتَغَاثُ فِيهِ بِاَللَّهِ تَعَالَى لَا بِنَبِيِّ وَلَا بِمَلَكِ وَلَا بِصَالِحِ وَلَا غَيْرِ ذَلِكَ بَلْ هَذَا مِمَّا يُعْلَمُ بِالِاضْطِرَارِ مِنْ دِينِ الْإِسْلَامِ أَنَّهُ لَا يَجُوزُ إطْلَاقُهُ<\/p>\n<p>No one among the Muslim scholars ever said that the aid of created beings should be sought in matters in which the aid of Allah Almighty should be sought, not by a prophet, nor an angel, nor a righteous person, nor anyone else. This is among what must be necessarily known about the religion of Islam, that it is absolutely impermissible.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/103<\/p><\/blockquote>\n<p>And Ibn &#8216;Aqil said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهم كفار عندي بهذه الأوضاع مثل تعظيم القبور وإكرامها بما نهى الشرع عنه من إيقاد النيران وتقبيلها وتخليفها وخطاب الموتى بالألواح وكتب الرقاع فيها يا مولاي أفعل بي كذا وكذا<\/p>\n<p>They are unbelievers, in my view, because of these practices, such as glorifying the graves and honoring them by what is prohibited in the divine law, lighting fires on them, kissing them, covering them with perfume, addressing the dead for their needs and writing requests upon them, saying: O my master, do such-and-such for me.<\/p>\n<p>Source: Talbīs Iblīs 1\/354<\/p><\/blockquote>\n<p>And Al-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإخلاص التوحيد لا يتم إلا بأن يكون الدعاء كله لله والنداء والاستغاثة والرجاء واستجلاب الخير واستدفاع الشر له ومنه لا لغيره ولا من غيره<\/p>\n<p>The purity of monotheism is not complete until supplication is entirely for Allah, as well as calling upon Him, seeking His aid, hoping in Him, seeking benefit and protection from Him, not for anyone else and not from anyone else.<\/p>\n<p>Source: al-Durr al-Naḍīd 17<\/p><\/blockquote>\n<p>And Rashid Rida writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ جَعَلَ بَيْنَهُ وَبَيْنَ اللهِ وَاسِطَةً فِي الْعِبَادَةِ كَالدُّعَاءِ فَقَدْ عَبَدَ هَذِهِ الْوَاسِطَةَ مِنْ دُونِ اللهِ لِأَنَّ هَذِهِ الْوَسَاطَةَ تُنَافِي الْإِخْلَاصَ لَهُ وَحْدَهُ<\/p>\n<p>Whoever makes an intermediary between himself and Allah, in worship such as supplication, he has worshiped that intermediary besides Allah, as this intermediary has nullified the purity of his worship for Allah alone.<\/p>\n<p>Source: Tafsīr al-Manār 3\/285<\/p><\/blockquote>\n<p>For this reason, the Prophet (ṣ), the companions, and the righteous predecessors were strictly cautious about glorifying graves and making them into places of worship.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ<\/p>\n<p><strong>Allah has cursed the Jews and Christians, who have taken the graves of their prophets as places of worship<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1324, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/22\/allah-cursed-graves-masajid\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ شِرَارِ النَّاسِ مَنْ تُدْرِكُهُ السَّاعَةُ وَهُمْ أَحْيَاءٌ وَمَنْ يَتَّخِذُ الْقُبُورَ مَسَاجِدَ<\/p>\n<p><strong>Verily, the worst of people are those upon whom the Hour will be established while they are alive, and those who take graves as places of worship<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 4132, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/28\/worst-people-graves-masajid\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Marthad reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَجْلِسُوا عَلَى الْقُبُورِ وَلَا تُصَلُّوا إِلَيْهَا<\/p>\n<p><strong>Do not sit upon the graves and do not pray towards them<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 972, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/18\/graves-not-sit-pray\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: Umar ibn Al-Khattab, may Allah be pleased with him, saw me while I was praying near a grave and he raised his voice, saying, “The grave!” I thought he said something else, so I looked toward the sky. Umar came to me and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا أَقُولُ الْقَبْرُ لا تُصَلِّ إِلَيْهِ<\/p>\n<p>Indeed, I said the grave. Do not pray towards it.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 1524, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/10\/02\/anas-do-not-pray-to-graves\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Burdah reported: Abu Musa al-Ashari, may Allah be pleased with him, instructed us at the time of his death, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا انْطَلَقْتُمْ بِجِنَازَتِي فَأَسْرِعُوا الْمَشْيَ وَلَا يَتَّبِعُنِي مُجَمَّرٌ وَلَا تَجْعَلُوا فِي لَحْدِي شَيْئًا يَحُولُ بَيْنِي وَبَيْنَ التُّرَابِ وَلَا تَجْعَلُوا عَلَى قَبْرِي بِنَاءً وَأُشْهِدُكُمْ أَنَّنِي بَرِيءٌ مِنْ كُلِّ حَالِقَةٍ أَوْ سَالِقَةٍ أَوْ خَارِقَةٍ<\/p>\n<p>You should hasten with my funeral procession. Do not follow me in suspense, do not put anything in my grave that will come between me and the dust, and do not build anything over my grave. Bear witness that I am free of those women who shave their heads, tear their clothes, and strike their faces.<\/p><\/blockquote>\n<p>They said, “Have you heard something about this?” Abu Musa said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>Yes, from the Messenger of Allah, peace and blessings be upon him.<\/p>\n<p>Source: Musnad Aḥmad 19053, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>It is permissible to visit graves, but only to remember death and the Hereafter and to weaken one’s attachment to the world. One should not go to the graveyard to perform acts of worship or to exaggerate in honoring and glorifying their occupants.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا فَإِنَّهَا تُزَهِّدُ فِي الدُّنْيَا وَتُذَكِّرُ الْآخِرَةَ<\/p>\n<p><strong>I prohibited you from visiting graves, but visit them now. Verily, they will weaken your attachment to the world and remind you of the Hereafter<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 1571, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/08\/visit-graves-remember-akhirah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Those who justify calling upon the deceased and seeking their help, claiming they have supernatural powers in the world, cite many weak narrations, but some of their evidences are authentic. However, the evidence they cite is proof against their position, not for them.<\/p>\n<p>Firstly, they cite the fact that Umar ibn al-Khattab used to ask the Prophet (ṣ) to supplicate to Allah for rain and later asked his uncle Al-Abbas to supplicate for rain.<\/p>\n<p>Anas ibn Malik reported: If a drought became threatening, Umar ibn al-Khattab, may Allah be pleased with him, would ask Al-Abbas to supplicate for Allah to send rain. Umar would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنَّا كُنَّا نَتَوَسَّلُ إِلَيْكَ بِنَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَسْقِينَا وَإِنَّا نَتَوَسَّلُ إِلَيْكَ بِعَمِّ نَبِيِّنَا<\/p>\n<p>O Allah, we used to ask our Prophet, peace and blessings be upon him, to supplicate for rain and you would bless us with rain. Now we ask the uncle of our Prophet to supplicate for rain.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 964, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/tawassul-call-upon-prophet-after-death\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This narration only proves that Umar asked the Prophet (ṣ) for his supplication during his lifetime, but not after his death. If asking the Prophet (ṣ) for his supplication were permissible after his death, Umar would have continued to ask him instead of Al-Abbas.<\/p>\n<p>Ibn Taymiyyah commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا التَّوَسُّلُ بِدُعَائِهِ وَشَفَاعَتِهِ كَمَا قَالَ عُمَرُ فَإِنَّهُ تَوَسَّلَ بِدُعَائِهِ لَا بِذَاتِهِ وَلِهَذَا عَدَلُوا عَنْ التَّوَسُّلِ بِهِ إلَى التَّوَسُّلِ بِعَمِّهِ الْعَبَّاسِ وَلَوْ كَانَ التَّوَسُّلُ هُوَ بِذَاتِهِ لَكَانَ هَذَا أَوْلَى مِنْ التَّوَسُّلِ بِالْعَبَّاسِ فَلَمَّا عَدَلُوا عَنْ التَّوَسُّلِ بِهِ إلَى التَّوَسُّلِ بِالْعَبَّاسِ عُلِمَ أَنَّ مَا يُفْعَلُ فِي حَيَاتِهِ قَدْ تَعَذَّرَ بِمَوْتِهِ بِخِلَافِ التَّوَسُّلِ الَّذِي هُوَ الْإِيمَانُ بِهِ وَالطَّاعَةُ لَهُ فَإِنَّهُ مَشْرُوعٌ دَائِمًا<\/p>\n<p>As for using the supplication and intercession of the Prophet (ṣ) as a means, as Umar said, he used his supplication as a means and not his person. For this reason, they abandoned using him as a means for instead using his uncle Al-Abbas as a means. If using him as a means was done by his person, he would be more deserving of it than using Al-Abbas as a means. When they left using him as a means for using Al-Abbas as a means, it was known that what they did in his life became impossible after his death, unlike using him as a means by having faith in him and obeying him, which are legislated for all times.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/201<\/p><\/blockquote>\n<p>And Ibn Abi al-&#8216;Izz writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَاهُ بِدُعَائِهِ هُوَ رَبَّهُ وَشَفَاعَتِهِ وَسُؤَالِهِ لَيْسَ الْمُرَادُ أَنَّا نُقْسِمُ عَلَيْكَ بِهِ أَوْ نَسْأَلُكَ بِجَاهِهِ عِنْدَكَ إِذْ لَوْ كَانَ ذَلِكَ مُرَادًا لَكَانَ جَاهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْظَمَ وَأَعْظَمَ مِنْ جَاهِ الْعَبَّاسِ<\/p>\n<p>Umar would use his supplication to his Lord, his intercession, and his asking as a means (in his lifetime). He does not mean: We swear an oath to You by him, or we ask You by his status with You. If that is what was intended, then surely the status of the Prophet (ṣ) is greater than the status of Al-Abbas.<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwịyah 1\/299<\/p><\/blockquote>\n<p>Another narration wrongly cited to justify seeking help from the inhabitants of graves was reported by Malik al-Dar as follows: The people were afflicted with drought in the time of Umar ibn al-Khattab. A man went to the grave of the Prophet, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا رَسُولَ اللهِ اسْتَسْقِ اللهَ لِأُمَّتِكَ فَإِنَّهُمْ قَدْ هَلَكُوا<\/p>\n<p>O Messenger of Allah, ask Allah to make it rain for your nation, for they have been ruined!<\/p><\/blockquote>\n<p>The Prophet came to him in a dream and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ائْتِ عُمَرَ فَأَقْرِئْهُ السَّلَامَ وَأَخْبِرْهُ أَنَّكُمْ مُسْقَوْنَ<\/p>\n<p>Go to Umar and greet him with peace. Tell him you will be given rain.<\/p>\n<p>Source: Dalā’il al-Nubuwwah lil-Bayhaqī 7\/47<\/p><\/blockquote>\n<p>It was narrated by Al-Bayhaqi, Ibn Abi Shaybah, Al-Tabarani, and Ibn Kathir. The authenticity of this narration is in dispute because of the narrator Malik al-Dar, although he was the treasurer for Umar. Even if it was authentic, as mistakenly judged by many scholars, it does not prove the permissibility of seeking help (<em>istighatha<\/em>) directly from the Prophet (ṣ), rather it is a proof against this position.<\/p>\n<p>Al-Haythami mentioned this narration and commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَوَاهُ الطَّبَرَانِيُّ فِي الْكَبِيرِ وَمَالِكُ الدَّارِ لَمْ أَعْرِفْهُ<\/p>\n<p>It was reported by Al-Tabarani in his great collection and I do not know of Malik al-Dar.<\/p>\n<p>Source: Majma’ al-Zawā’id 3\/125<\/p><\/blockquote>\n<p>Likewise, Al-Mundhiri narrated it and commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَوَاهُ الطَّبَرَانِيّ فِي الْكَبِير وَرُوَاته إِلَى مَالك الدَّار ثِقَات مَشْهُورُونَ وَمَالك الدَّار لَا أعرفهُ<\/p>\n<p>It was reported by Al-Tabarani in his great collection. Its narration up to Malik al-Dar is well-known to be reliable, yet I do not know of Malik al-Dar.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 2\/29<\/p><\/blockquote>\n<p>The meaning of Malik al-Dar being “unknown” is that his status as a reliable narrator is unknown (<em>majhul al-hal<\/em>), not that his person or biography was not known to them.<\/p>\n<p>Shaykh al-Albani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عدم التسليم بصحة هذه القصة لأن مالك الدار غير معروف العدالة والضبط وهذان شرطان أساسيان في كل سند صحيح كما تقرر في علم المصطلح<\/p>\n<p>The authenticity of this story is not acceptable because Malik al-Dar is not known to be reliable and precise. These are two conditions upon which to establish an authentic chain as confirmed in the terminology of hadith science.<\/p>\n<p>Source: al-Tawassul 1\/118<\/p><\/blockquote>\n<p>Ibn Hajar, as well as others, introduced the report as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وروى بن أَبِي شَيْبَةَ بِإِسْنَادٍ صَحِيحٍ مِنْ رِوَايَةِ أَبِي صَالِحٍ السَّمَّانِ عَنْ مَالِكٍ الدَّارِيِّ<\/p>\n<p>It was narrated by Ibn Aby Shaybah with an authentic chain from the reports of Abu Salih al-Samman from Malik al-Dar&#8230;<\/p>\n<p>Source: Fatḥ al-Bārī 2\/495<\/p><\/blockquote>\n<p>This is a subtle way of saying that the reliability of Malik al-Dar as a narrator is not firmly established.<\/p>\n<p>Shaykh al-Albani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولا ينافي هذا قول الحافظ ابن حجر بإسناد صحيح من رواية أبي صالح السمان لأننا نقول إنه ليس نصاً في تصحيح جميع السند بل إلى أبي صالح فقط ولولا ذلك لما ابتدأ هو الإسنادَ من عند أبي صالح، ولقال رأساً عن مالك الدار وإسناده صحيح ولكنه تعمد ذلك<\/p>\n<p>This does not negate the statement of Al-Hafiz Ibn Hajar, ‘&#8230;with an authentic chain from the reports of Abu Salih al-Samman,’ because we say he does not explicitly authenticate the entire chain. Rather, only up to Abu Salih. If that were the case, he would not have begun with the chain from Abu Salih. He would have begun with the top from Malik al-Dar, but he did not do that.<\/p>\n<p>Source: al-Tawassul 1\/118<\/p><\/blockquote>\n<p>Therefore, the chain of his narration does not meet the rigorous criteria for use as proof in vital matters of creed and worship. It was not included in the major sources of the Sunnah such as the six books (<em>kutub al-sittah<\/em>). It also not appropriate to take a lesser known narration and expand its interpretation and rulings to justify numerous innovated practices.<\/p>\n<p>If it the narration of Malik al-Dar is authentic, for the sake of argument, it does not show that the companion sought help from the Prophet (ṣ) directly or supplicated <em>to<\/em> him. He merely addressed him, which is permissible. He asked him to supplicate for Allah to make it rain and the Prophet (ṣ) told him in a dream to go to Umar instead. The Prophet (ṣ) himself did not make it rain, nor did the rain start until after the companion went to Umar and then Umar asked Al-Abbas to pray for rain, as has preceded. If going to the grave of the Prophet (ṣ) and asking him for his supplication were the best course of action or prescribed by the Sunnah, Umar would have been the first to do it, yet he did not.<\/p>\n<p>For this reason, Ibn Hajar mentioned this narration amongst other stronger narrations that prove the validity of asking the Imam to pray to Allah for rain. He also abridged the narration by stopping at the Prophet’s alleged statement, “Go to Umar…” without adding the rest of it, since this was the only part relevant to his argument. He included all of these narrations under the chapter heading:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">باب سؤال الناس الإمام الاستسقاء إذا قحطوا<\/p>\n<p>Chapter: People asking the Imam to pray for rain during a drought.<\/p><\/blockquote>\n<p>The point of mentioning it was to validate the practice of asking the living Imam to pray for rain. Ibn Hajar certainly did not think the narration of Malik al-Dar was a proof for <em>istighatha<\/em> or asking the dead for supernatural help. This innovated understanding was introduced by misguided people later and Malik al-Dar is innocent of it, may Allah be pleased with him.<\/p>\n<p>Another narration wrongly cited to justify supplicating to the deceased is the story of the blind man who asked the Prophet (ṣ) for his supplication and intercession.<\/p>\n<p>Uthman ibn Hunayf reported: A man with damaged eyesight came to the Prophet, peace and blessings be upon him, and he said, “Supplicate for Allah to heal me.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ شِئْتَ دَعَوْتُ وَإِنْ شِئْتَ صَبَرْتَ فَهُوَ خَيْرٌ لَكَ<\/p>\n<p><strong>I will supplicate for you if you wish, or it is better for you to be patient if you wish.<\/strong><\/p><\/blockquote>\n<p>The man said, “Supplicate for me.” The Prophet ordered him to perform ablution in the best manner and to supplicate with these words:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ مُحَمَّدٍ نَبِيِّ الرَّحْمَةِ إِنِّي تَوَجَّهْتُ بِكَ إِلَى رَبِّي فِي حَاجَتِي هَذِهِ لِتُقْضَى لِيَ اللَّهُمَّ فَشَفِّعْهُ فِيَّ<\/p>\n<p>O Allah, I ask You and turn to You by Your Prophet, Muhammad the Prophet of Mercy. I turn by you to my Lord to fulfill this need of mine. O Allah, accept his intercession for me.<\/p>\n<p>Source: Sunan al-Tirmidhī 3578, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/22\/tawassul-prophet-dua-in-life\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Again, this narration only proves that it was permissible to ask the Prophet (ṣ) for his supplication during his lifetime, not after his death. Moreover, the Prophet (ṣ) told the blind man it was better for him to be patient and rely upon Allah directly, rather than using himself as a means.<\/p>\n<p>Ibn Taymiyyah commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فقد علمنا أن عمر وأكابر الصحابة لم يروا هذا مشروعاً بعد مماته صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كما كان يشرع في حياته بل كانوا في الاستسقاء في حياته يتوسلون به فلما مات لم يتوسلوا<\/p>\n<p>We know that Umar and the senior companions did not consider this to be legislated after the death of the Prophet (ṣ) as it was during his life. Rather, they used to ask him to supplicate for rain and use him as a means, but after he died they no longer used him as a means.<\/p>\n<p>Source: Qāʻidah Jalīlah fī al-Tawassul wal-Wasīlah 1\/228<\/p><\/blockquote>\n<p>It also makes no rational sense to ask for help from the deceased in their graves, instead of asking directly from Allah who has power over all things. Allah is always more powerful and more merciful than anyone whom we can ask.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَدْعُو مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُ وَمَا لَا يَنفَعُهُ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ<\/p>\n<p><strong>He calls upon other than Allah one who cannot harm or benefit him. That is extremely misguided.<\/strong><\/p>\n<p>Surat al-Hajj 22:12<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْعَجَبُ مِنْ ذِي عَقْلٍ سَلِيمٍ يَسْتَوْحِي مَنْ هُوَ مَيِّتٌ وَيَسْتَغِيثُ بِهِ وَلَا يَسْتَغِيثُ بِالْحَيِّ الَّذِي لَا يَمُوتُ فَيَقُولُ أَحَدُهُمْ إذَا كَانَتْ لَك حَاجَةٌ إلَى مَلِكٍ تَوَسَّلْت إلَيْهِ بِأَعْوَانِهِ فَهَكَذَا يَتَوَسَّلُ إلَيْهِ بِالشُّيُوخِ وَهَذَا كَلَامُ أَهْلِ الشِّرْكِ وَالضَّلَالِ<\/p>\n<p>It is strange for one of sound mind to resort to one who has died and to seek his aid, but not seek the aid of the Living who does not die. One of them says: If you have a need, use them as a means of help. Likewise, he uses scholars as a means. These are the words of the people of idolatry and misguidance.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 18\/322<\/p><\/blockquote>\n<p>Is it permissible to ask the Prophet (ṣ) for his supplication or intercession at his grave? The righteous predecessors, the four Imams, and their worthy successors never prescribed this practice. Rather, it was something Muslims began to do in later generations.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِندَ اللَّهِ<\/p>\n<p><strong>They worship besides Allah those who cannot harm them or benefit them, and they say: These are our intercessors with Allah.<\/strong><\/p>\n<p>Surat Yunus 10:18<\/p><\/blockquote>\n<p>Al-Razi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَنَظِيرُهُ فِي هَذَا الزَّمَانِ اشْتِغَالُ كَثِيرٍ مِنَ الْخَلْقِ بِتَعْظِيمِ قُبُورِ الْأَكَابِرِ عَلَى اعْتِقَادِ أَنَّهُمْ إِذَا عَظَّمُوا قُبُورَهُمْ فَإِنَّهُمْ يَكُونُونَ شُفَعَاءَ لَهُمْ عِنْدَ اللَّهِ<\/p>\n<p>The equivalent in this time is preoccupation with the creation by glorifying the graves of elders, believing that if they glorify their graves they will intercede with Allah for them.<\/p>\n<p>Source: Tafsīr al-Rāzī 10:18<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولا أحد من الأنبياء قبله شرعوا للناس أن يدعوا الملائكة والأنبياء والصالحين ويستشفعوا بهم لا بعد مماتهم ولا في مغيبهم<\/p>\n<p>No one among the prophets before him (ṣ) legislated for people to call upon the angels, the prophets, or the righteous, or to ask for their intercession, not after their death nor in their absence.<\/p>\n<p>Source: Qāʻidah Jalīlah fī al-Tawassul wal-Wasīlah 1\/26<\/p><\/blockquote>\n<p>And Ibn Abdul Hadi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنما تكلم العلماء والسلف في الدعاء للرسول صلى الله عليه وسلم عند قبره منهم من نهى عن الوقوف للدعاء له دون السلام عليه ومنهم من رخص في هذا وهذا ومنهم من نهى عن هذا وهذا وأما دعاؤه هو وطلب استغفاره وشفاعته بعد موته فهذا لم ينقل عن أحد من أئمة المسلمين لا من الأئمة الأربعة ولا غيرهم بل الأدعية التي ذكروها خالية من ذلك<\/p>\n<p>Indeed, the scholars and the righteous predecessors only discussed supplication for the Messenger of Allah (ṣ) by his grave. Among them are those who prohibited standing to supplicate for him without sending peace upon him, and among them are those who granted such-and-such concessions, and among them are those who prohibited such-and-such. As for seeking his supplication, forgiveness, and intercession after his death, this has not been reported from any of the Imams of the Muslims, not from the four Imams or others. Rather, the supplications which they mentioned were free of that.<\/p>\n<p>Source: al-Ṣārim al-Munkī fī al-Radd ʻalá al-Subkī 1\/136<\/p><\/blockquote>\n<p>In conclusion, tawassul is acceptable in three specific forms: 1) asking Allah by His names and attributes, 2) asking Allah by our good deeds, and 3) asking Allah by the supplication of a righteous, living, and present person. Some scholars allowed tawassul by the ‘right’ or ‘status’ of prophets and saints in their graves, but other scholars prohibited it for good reason. Through this route, many harmful spiritual beliefs and cults of personality have led some Muslims astray from actualizing the truth of Islamic monotheism. They should be called back to the right way with beautiful preaching and good manners.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O you who have faith, fear Allah and seek means to approach Him.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[122,398,20,183,262,396,399,342,394,88,387,388,135,32,37,38,90,326,425,100,54,56,302,134,115,60,196,395,45,148,400,66,67,91,397,70,220,73,98,393,332],"class_list":["post-20841","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-angels-malaikah","tag-benefit-al-nafa","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-disapproved-al-makruh","tag-exaggeration-al-ghuluw","tag-al-fiqh","tag-graves-al-qubur","tag-pilgrimage-hajj","tag-haram","tag-harm-al-darar","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-innovation-bidah","tag-jinn","tag-kabah","tag-manners-al-adab","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-noah-nuh","tag-paradise-jannah","tag-people-of-the-book","tag-prayer-salat","tag-prophetic-virtues","tag-prophets-al-anbiya","tag-quran-exegesis-tafsir","tag-reason-al-aql","tag-refuge-al-taawwudh","tag-remembrance-dhikr","tag-repentance-al-tawbah","tag-righteous-predecessors-al-salaf-al-salih","tag-rights-al-huquq","tag-sincerity-al-ikhlaas","tag-supplication-al-dua","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr","tag-warning-al-nadhr","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5q9","jetpack-related-posts":[{"id":24398,"url":"https:\/\/www.abuaminaelias.com\/tawassul-asking-by-the-prophet\/","url_meta":{"origin":20841,"position":0},"title":"Tawassul: Asking by the Prophet or from the Prophet?","author":"Abu Amina Elias","date":"February 21, 2025","format":false,"excerpt":"\"The difference between the two matters is agreed upon by the Muslims.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":11235,"url":"https:\/\/www.abuaminaelias.com\/is-prophet-muhammad-better-than-other-prophets-making-no-distinction-between-the-prophets-of-allah\/","url_meta":{"origin":20841,"position":1},"title":"Prophet Muhammad is better than other Prophets?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"No servant should say that I am better than Jonah son of Mata.\" [Sahih Bukhari, Book 5, Number 627]","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23683,"url":"https:\/\/www.abuaminaelias.com\/asking-dead-for-dua\/","url_meta":{"origin":20841,"position":2},"title":"Asking the deceased for supplications or intercession?","author":"Abu Amina Elias","date":"November 7, 2021","format":false,"excerpt":"\"If you ask, ask from Allah. If you seek help, seek help from Allah.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19412,"url":"https:\/\/www.abuaminaelias.com\/few-women-ever-achieved-perfection\/","url_meta":{"origin":20841,"position":3},"title":"Few women ever achieved perfection?","author":"Abu Amina Elias","date":"March 26, 2018","format":false,"excerpt":"\"We sent to her Our angel in the form of a well-proportioned man.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23619,"url":"https:\/\/www.abuaminaelias.com\/grave-worship-in-islam\/","url_meta":{"origin":20841,"position":4},"title":"Prohibition of grave worship in Islam","author":"Abu Amina Elias","date":"October 19, 2021","format":false,"excerpt":"\"Do not take graves as places of prayer. I forbid you from doing so.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15166,"url":"https:\/\/www.abuaminaelias.com\/love-in-the-quran-and-sunnah\/","url_meta":{"origin":20841,"position":5},"title":"Love in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 7, 2014","format":false,"excerpt":"\"The believers are only brothers,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20841","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20841"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20841\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}