{"id":20861,"date":"2019-08-29T16:43:16","date_gmt":"2019-08-29T12:43:16","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=20861"},"modified":"2025-07-18T11:20:52","modified_gmt":"2025-07-18T07:20:52","slug":"does-allah-exist-in-a-place","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/does-allah-exist-in-a-place\/","title":{"rendered":"Does Allah exist in a place? A man in the sky?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Some people are confused about belief in Allah, or God, as if the believers think there is literally a man sitting on a cloud in the sky. The favorite insult of atheists against believers is that we allegedly believe, in their vulgar words, in a ‘sky-daddy’ (Allah is far above what they claim!). Indeed, some religions have conceived of the Creator in these human-like terms, but the theology of Islam is more sophisticated than these crude caricatures.<\/p>\n<p>It is a fundamental belief in Islam that the Creator is unlike anything in His creation and is not subject to natural laws or limits like all other created beings.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ<\/p>\n<p><strong>There is nothing like Him, for He is the Hearing, the Seeing. <\/strong><\/p>\n<p>Source: Surat al-Shura 42:11<\/p><\/blockquote>\n<p>This verse is instructive because it affirms the Creator&#8217;s complete uniqueness, even as it describes Him as &#8216;Hearing&#8217; and &#8216;Seeing.&#8217; The verse is understood to mean that the &#8216;hearing&#8217; attributed to the Creator is perfect, limitless, flawless, and infinite, unlike that of human beings or creatures. The only commonality between the ‘hearing’ of the Creator and of the creation is the word itself, not the realities that they describe.<\/p>\n<p>Words have different meanings based on their usage. One could say a human has a &#8216;leg,&#8217; or a chair has a &#8216;leg,&#8217; or a pair of pants has a &#8216;leg,&#8217; or a race may be divided into &#8216;legs.&#8217; In each case, the word leg could refer to a limb or an inanimate object, depending on the context. Likewise, words such as &#8216;Hand&#8217; when applied to the Creator, have a unique meaning that does not imply human-like limbs.<\/p>\n<p>The same principle applies to descriptions of Allah that might imply a place, such as His being ‘above’ the creation. The word ‘above’ does not refer to a place or spatial direction within creation, implying Allah is limited, but rather to the exaltedness of His attributes and His transcendence over creation.<\/p>\n<p>Imam al-Tahawi stated in his orthodox creed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَعَالَى عَنِ الْحُدُودِ وَالْغَايَاتِ وَالْأَرْكَانِ وَالْأَعْضَاءِ وَالْأَدَوَاتِ لَا تَحْوِيهِ الْجِهَاتُ السِّتُّ كَسَائِرِ الْمُبْتَدَعَاتِ<\/p>\n<p>He is exalted above any limits, ends, supports, limbs, or tools. He is not contained by six directions like the rest of created things.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/\">al-‘Aqīdah al-Ṭaḥāwịyah<\/a><\/p><\/blockquote>\n<p>Imam Ibn Abi al-‘Izz commented on this statement:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَوْلُ الشَّيْخِ رَحِمَهُ اللَّهُ لَا تَحْوِيهِ الْجِهَاتُ السِّتُّ كَسَائِرِ الْمُبْتَدَعَاتِ هُوَ حَقٌّ بِاعْتِبَارِ أَنَّهُ لَا يُحِيطُ بِهِ شَيْءٌ مِنْ مَخْلُوقَاتِهِ بَلْ هُوَ مُحِيطٌ بِكُلِّ شَيْءٍ وَفَوْقَهُ وَهَذَا الْمَعْنَى هُوَ الَّذِي أَرَادَهُ الشَّيْخُ رَحِمَهُ اللَّهُ لِمَا يَأْتِي فِي كَلَامِهِ أَنَّهُ تَعَالَى مُحِيطٌ بِكُلِّ شَيْءٍ وَفَوْقَهُ &#8230; عُلِمَ أَنَّ مُرَادَهُ أَنَّ اللَّهَ تَعَالَى لَا يَحْوِيهِ شَيْءٌ وَلَا يُحِيطُ بِهِ شَيْءٌ كَمَا يَكُونُ لِغَيْرِهِ مِنَ الْمَخْلُوقَاتِ وَأَنَّهُ تَعَالَى هُوَ الْمُحِيطُ بِكُلِّ شَيْءٍ الْعَالِي عَنْ كُلِّ شَيْءٍ<\/p>\n<p>The statement of the Shaykh, may Allah have mercy on him, ‘He is not contained by the six directions like the rest of created beings,’ is true in the sense that no creatures surround Him. Rather, He surrounds all things and is above them. This is what was meant by the Shaykh, as what he said later is that He is exalted, surrounding all things and is above them… It is understood that he means Allah is exalted, not contained or surrounded by anything, while all other creations besides Him are. He is exalted, surrounding all things and higher than all things.<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwịyah 1\/267<\/p><\/blockquote>\n<p>Therefore, when the believers say Allah is ‘above’ the creation, this does not mean a place or direction above the creation. It means Allah’s attributes are exalted above all creation, and He surrounds all creation, the true modality of which is unknown to us.<\/p>\n<p>Some of the early Muslims explicitly rejected the idea that Allah is contained in a time or ‘place,’ based upon the Prophet&#8217;s ﷺ words.<\/p>\n<p>Abu Salih reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ<\/p>\n<p><strong>O Allah, you are the First, there is nothing before you. You are the Last, there is nothing after you. You are the Manifest, there is nothing above you. You are the Hidden, there is nothing beyond you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2713, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/01\/29\/sleep-right-side-supplication-dua\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Bayhaqi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاسْتَدَلَّ بَعْضُ أَصْحَابِنَا فِي نَفْيِ الْمَكَانِ عَنْهُ &#8230; وَإِذَا لَمْ يَكُنْ فَوْقَهُ شَيْءٌ وَلَا دُونَهُ شَيْءٌ لَمْ يَكُنْ فِي مَكَانٍ<\/p>\n<p>Some of our scholars cited this as evidence of negating a &#8216;place&#8217; for Him… If there is nothing above or below Him, then He is not in a &#8216;place.&#8217;<\/p>\n<p>Source: Kitāb al-Asmā’ wal-Ṣifāt 2\/287<\/p><\/blockquote>\n<p>How then does Allah exist if not in time or space? It is difficult for us, as human beings, to conceive of a reality that transcends time and space, since we are all confined by these limitations. Such divine realities are proven by divine revelation but are beyond the ability of human reason to fully comprehend.<\/p>\n<p>Muslim scholars adhere to the principle of ‘unknown modality’ (<em>bi la kayf<\/em>), which means not asking ‘how’ realities of the Unseen truly are. When it comes to the texts of the Quran and Sunnah that describe Allah as ‘rising above the Throne,’ Muslim scholars accept them as describing an actual reality of which the modality is unknown and, indeed, cannot ever be known.<\/p>\n<p>Abdullah ibn Nafi’ reported: Malik, may Allah have mercy on him, was asked about the saying of Allah:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى<\/p>\n<p><strong>The Most Merciful rose above the Throne<\/strong> (20:5).<\/p><\/blockquote>\n<p>The man said, “How is his rising?” Malik said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَيْفَ اسْتَوَى فَقَالَ اسْتِوَاؤُهُ مَعْلُومٌ وَكَيْفِيَّتُهُ مَجْهُولَةٌ وَسُؤَالُكُ عَنْ هَذَا بِدْعَةٌ<\/p>\n<p>The rising is acknowledged, its modality is unknown, and asking about it is an innovation.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/01\/27\/malik-asma-wa-sifat-kayfiyyah\/\">al-Istidhkār 2\/529<\/a><\/p><\/blockquote>\n<p>Imam Ibn &#8216;Abdul Barr commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أهل السّنة مجمعون على الْإِقْرَار بِالصِّفَاتِ الورادة فِي الْكتاب وَالسّنة وَحملهَا على الْحَقِيقَة لَا على الْمجَاز إِلَّا أَنهم لم يكيفوا شَيْئا من ذَلِك<\/p>\n<p>The people of the Sunnah agreed upon affirming the divine attributes as related in the Book and the Sunnah, interpreting them as reality and not as a metaphor, except that they do not ask ‘how’ is the modality of any of that.<\/p>\n<p>Source: al-‘Ulūw lil-‘Alī al-Ghaffār 1\/250<\/p><\/blockquote>\n<p>And Imam al-Bayhaqi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَعَلَى مِثْلِ هَذَا دَرَجَ أَكْثَرُ عُلَمَائِنَا فِي مَسْأَلَةِ الِاسْتِوَاءِ وَفِي مَسْأَلَةِ الْمَجِيءِ وَالْإِتْيَانِ وَالنِّزُولِ<\/p>\n<p>Most of our scholars followed this example in the issue of the divine attribute of ‘rising,’ as well as the issues of ‘coming,’ ‘going,’ and ‘descending.&#8217;<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/24\/malik-kayfiyyah-creed\/\">al-I’tiqād lil-Bayhaqī 1\/116<\/a><\/p><\/blockquote>\n<p>Thus, for any scriptural texts that describe Allah in ways that might imply a time or place within creation, the wording of these texts is accepted, not denied, while their modality is not interpreted or sought, as Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا ٱللَّهُ<\/p>\n<p><strong>But none grasps their full meaning except Allah.<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:7<\/p><\/blockquote>\n<p>And the Prophet ﷺ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا<\/p>\n<p><strong>Allah has remained silent upon matters as mercy for you, not out of forgetfulness, so do not search them out.<\/strong><\/p>\n<p>Source: Sunan al-Dāraquṭnī 4316, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/03\/hudud-fard-limits\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Allah deliberately did not reveal the modality of many matters in the Unseen because knowing these things would not have any practical benefit. This knowledge would not change our laws, moral values, or acts of worship.<\/p>\n<p>In another example, a tradition describes Allah as ‘descending’ in the last third of the night to draw near to those who perform prayer at night.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ يَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ<\/p>\n<p><strong>Our Lord descends to the lowest heaven in the last third of every night, and He says, &#8216;Who is calling upon me that I may answer him? Who is asking from me that I may give him? Who is seeking my forgiveness that I may forgive him?&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1145, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/24\/allah-descends-last-third-night\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam Ibn Abi al-‘Izz commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سُئِلَ أَبُو حَنِيفَةَ رَضِيَ اللَّهُ عَنْهُ بَعْد رِوَايَتِهِ حَدِيث النُّزُولِ فَقَالَ يَنْزِلُ بِلَا كَيْفٍ<\/p>\n<p>Abu Hanifa, may Allah be pleased with him, was asked after relating the narration of &#8216;descending&#8217; and he said, &#8216;The descending is in a modality unknown.&#8217;<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwịyah 1\/269<\/p><\/blockquote>\n<p>This tradition encourages the night prayer (<em>tahajjud<\/em>) and informs us that Allah draws near to us, indicating his love for us, when we perform night prayer. It is not the purpose of such traditions to describe the &#8216;modality&#8217; in which Allah descends, which, as we said, is not related to a spatial direction.<\/p>\n<p>Islam rejects any notion of anthropomorphism (<em>tajsim<\/em>) or that the &#8216;modality&#8217; of Allah’s existence and attributes are in any way like human beings or creatures. Islam firmly rejects any such equivalency between the Creator and anything in the creation.<\/p>\n<p>Equating the Creator to creation, by attributing flawed human attributes to Him, is the very essence of idolatry, the greatest mortal sin in Islam.<\/p>\n<p>Imam al-Maqrizi al-Shafi’i writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعلم أن حقيقة الشرك تشبيه الخالق بالمخلوق وتشبيه المخلوق بالخالق أمّا الخالق فإن المشرك شبّه المخلوق بالخالق في خصائص الإلهيّة وهي التفرّد بملك الضّر والنفع والعطاء والمنع فمن علّق ذلك بمخلوق فقد شبهه بالخالق تعالى وسوّى بين التراب وربّ الأرباب فأي فجور وذنب أعظم من هذا<\/p>\n<p>Know that the essence of idolatry is to liken the Creator to the creation, and to liken the creation to the Creator. As for the Creator, the idolater likens the creation to the Creator in specific characteristics of Divinity, which are the uniqueness of controlling harm, benefit, giving, and withholding. Thus, whoever attributes that to a created being has likened it to the Almighty Creator, making equality between the dust and the Lord of lords. What wickedness and sin are greater than this?<\/p>\n<p>Source: Tajrīd al-Tawḥīd al-Mufīd 1\/27<\/p><\/blockquote>\n<p>This is the key point that is misunderstood by atheists, and even many of the people of the Book, Jews, and Christians: Allah is nothing like His creation. Rather, Allah is only described by words that might imply time or place due to the limitations of human language. Still, believers understand that the modality or &#8216;how&#8217; these realities exist can never be known to us.<\/p>\n<p>We know for sure that Allah is unlike His creation. Allah is perfect in every way, and whatever we imagine about Allah, the truth is always <em>Allahu Akbar<\/em> (Allah is Greater) than anything our minds can conceive.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is nothing like Him, for He is the Hearing, the Seeing.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[20,21,38,43,50,55,372,115,402,403],"class_list":["post-20861","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-creation-al-khalq","tag-creed-aqidah","tag-imam-abu-hanifah","tag-imam-malik","tag-knowledge","tag-methodology-al-minhaj","tag-allah-names-asma-ul-husna","tag-people-of-the-book","tag-throne-al-arsh","tag-unseen-al-ghayb"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5qt","jetpack-related-posts":[{"id":15719,"url":"https:\/\/www.abuaminaelias.com\/the-oneness-of-lordship-tawheed-ar-rububiyyah\/","url_meta":{"origin":20861,"position":0},"title":"Oneness of Lordship (tawheed ar-rububiyyah)","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, your Lord is Allah...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":20861,"position":1},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":20861,"position":2},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15796,"url":"https:\/\/www.abuaminaelias.com\/whoever-changes-religion-kill-him\/","url_meta":{"origin":20861,"position":3},"title":"Apostasy: Whoever changes his religion, kill him?","author":"Abu Amina Elias","date":"June 19, 2014","format":false,"excerpt":"\"The most hesitant of people in killing are the people of faith.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16482,"url":"https:\/\/www.abuaminaelias.com\/transcendency-of-allah-in-islam\/","url_meta":{"origin":20861,"position":4},"title":"Transcendency of Allah in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Most Merciful is established upon the Throne.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23609,"url":"https:\/\/www.abuaminaelias.com\/dealing-doubts-islam\/","url_meta":{"origin":20861,"position":5},"title":"Dealing with faith-related doubts in Islam","author":"Abu Amina Elias","date":"October 7, 2021","format":false,"excerpt":"\"We are more likely to doubt than Abraham, when he said: O Lord, show me how You give life to the dead.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20861","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=20861"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/20861\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=20861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=20861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=20861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}