{"id":21111,"date":"2019-09-07T11:27:59","date_gmt":"2019-09-07T07:27:59","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21111"},"modified":"2025-07-03T14:00:59","modified_gmt":"2025-07-03T10:00:59","slug":"fasting-muharram-day-of-ashura","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/fasting-muharram-day-of-ashura\/","title":{"rendered":"Fasting in Al-Muharram and Day of &#8216;Ashura"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>There is great virtue in increasing our voluntary fasts during the sacred month of Al-Muharram, and specifically fasting on the day of &#8216;Ashura, which is the tenth day of Al-Muharram. Not only will a Muslim be rewarded greatly for fasting, but also fasting the day of &#8216;Ashura will expiate the minor sins committed in the previous year.<\/p>\n<p>The Prophet ﷺ that best month for voluntary fasting is the month of Al-Muharram. This month is the first of the Hijri calendar and one of the four traditionally sacred months.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ صِيَامُ شَهْرِ اللَّهِ الْمُحَرَّمِ<\/p>\n<p><strong>The best fast after the month of Ramadan is fasting in the month of Allah, al-Muharram.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1163, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/11\/27\/best-after-ramadan-muharram\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The most important day to fast in Al-Muharram is the day of &#8216;Ashura, as the Prophet ﷺ was keen to fast this day as much as he was to fast in Ramadan.<\/p>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَرَّى صِيَامَ يَوْمٍ فَضَّلَهُ عَلَى غَيْرِهِ إِلَّا هَذَا الْيَوْمَ يَوْمَ عَاشُورَاءَ وَهَذَا الشَّهْرَ يَعْنِي شَهْرَ رَمَضَانَ<\/p>\n<p>I did not see the Prophet, peace and blessings be upon him, as eager to fast a day and preferring it over others except for this day of &#8216;Ashura and this month of Ramadan.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2006, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/04\/15\/prophet-eager-fast-ashura\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The day of &#8216;Ashura is distinguished in Al-Muharram as the day Allah saved Moses, upon him be peace, and the Israelites from Pharaoh, when Allah miraculously parted the sea for them and drowned the pursuing army.<\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, came to Medina and he found the Jews fasting on the day of &#8216;Ashura. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا هَذَا الْيَوْمُ الَّذِي تَصُومُونَهُ<\/p>\n<p><strong>What is this day you are fasting<\/strong>?<\/p><\/blockquote>\n<p>They said, “This is a great day in which Allah saved Moses and his people, and he drowned Pharaoh and his people. Moses fasted on it due to gratitude, so we also fast on it.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَنَحْنُ أَحَقُّ وَأَوْلَى بِمُوسَى مِنْكُمْ<\/p>\n<p><strong>We are more deserving and are closer to Moses than you<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2004, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/11\/02\/hadith-on-ashura-moses-fasted\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The day of &#8216;Ashura corresponds to Yom Kippur in Judaism. The meaning of Muslims being closer to Moses, upon him be peace, is that true believers adhere to the divine revelation as it was communicated to him, but Jewish theology had strayed over time from his original teachings.<\/p>\n<p>Imam al-Harawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ بِمُتَابَعَتِهِ يعنى موسى عليه السلام فَإِنَّا مُوَافِقُونَ لَهُ فِي أُصُولِ الدِّينِ وَمُصَدِّقُونَ لِكِتَابِهِ فِي تَبْيِينِ الْيَقِينِ وَأَنْتُمْ مُخَالِفُونَ لَهُمَا فِي التَّغْيِيرِ وَالتَّحْرِيفِ وَالتَّعَلُّقِ بِالْأَمْرِ الْمَشُوبِ بِالتَّزْيِيفِ<\/p>\n<p> Closer in following Moses, that is, we agree with him in the fundamentals of the religion and believe in his Book with clear certainty, whereas you disagree with them in changing and distorting and clinging to matters tainted with falsification.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 4\/1426<\/p><\/blockquote>\n<p>The Prophet ﷺ implemented fasting on the day of &#8216;Ashura differently than as practiced by the Jews, to make clear to everyone that Islam is a new and independent divine revelation from Allah, with its own rituals, scripture, and symbols. Islam is not a sect or extension of Judaism, Christianity, Arab idolatry, or any other religion.<\/p>\n<p>The majority of scholars hold that the day of &#8216;Ashura is the tenth day of Al-Muharram, but others considered it to be the ninth or eleventh.<\/p>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَوْمِ عَاشُورَاءَ يَوْمُ الْعَاشِرِ يعنى من الْمُحَرَّمِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, ordered fasting on the day of &#8216;Ashura, the tenth of al-Muharram.<\/p>\n<p>Source: Sunan al-Tirmidhī 755, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/09\/07\/fasting-9th-10th-muharram\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Tirmidhi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ صُومُوا التَّاسِعَ وَالْعَاشِرَ وَخَالِفُوا الْيَهُودَ وَبِهَذَا الْحَدِيثِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ<\/p>\n<p>It is reported from Ibn Abbas that he said to fast on the ninth and tenth of the month and to do so differently from the Jews, and this is the same as was said by Al-Shafi’i, Ahmad, and Ishaq.<\/p>\n<p>Source: Sunan al-Tirmidhī 2\/120<\/p><\/blockquote>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ أَصْحَابُنَا عَاشُورَاءُ هُوَ الْيَوْمُ الْعَاشِرُ مِنْ الْمُحَرَّمِ وَتَاسُوعَاءُ هُوَ التَّاسِعُ مِنْهُ هَذَا مَذْهَبُنَا وَبِهِ قَالَ جُمْهُورُ الْعُلَمَاءِ<\/p>\n<p>Our scholars said &#8216;Ashura is the tenth day of al-Muharram and Tasu&#8217;a&#8217; is the ninth day. This is our way, as it is for the majority of scholars.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 6\/383<\/p><\/blockquote>\n<p>The Prophet ﷺ ordered fasting on this day, by which he meant a voluntary and recommended fast, not an obligation.<\/p>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ عَاشُورَاءَ يَوْمٌ مِنْ أَيَّامِ اللَّهِ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ<\/p>\n<p><strong>Verily, &#8216;Ashura is a day among the days of Allah. Whoever wishes to fast may do so, and whoever wishes to break his fast may do so<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1126, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/13\/recommendation-fast-day-of-ashura\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The reward for fasting the day of &#8216;Ashura is the expiation of one’s minor sins, mistakes, and shortcomings throughout the previous year.<\/p>\n<p>Abu Qatadah reported: The Prophet, peace and blessings be upon him, was asked about fasting the day of &#8216;Ashura, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُكَفِّرُ السَّنَةَ الْمَاضِيَةَ<\/p>\n<p><strong>It will expiate the sins of the past year<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1162, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/24\/fasting-arafah-ashura\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It is important to note that this expiation is for <em>minor sins<\/em>, which do not require specific repentance. Major sins like murder, theft, and adultery require specific repentance and in some cases legal action. One should not imagine that fasting the day of &#8216;Ashura is an excuse to misbehave throughout the year.<\/p>\n<p>It is the Sunnah to fast the day prior to &#8216;Ashura along with it, which is the ninth of the month. Thus, one is recommended to fast both the ninth and tenth of Al-Muharram.<\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَئِنْ بَقِيتُ إِلَى قَابِلٍ لَأَصُومَنَّ التَّاسِعَ يعنى من الْمُحَرَّمِ<\/p>\n<p><strong>If I live until next year, I will certainly fast the ninth day of al-Muharram.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1134, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/04\/26\/sawm-9th-muharram-ashura\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Hakam ibn al-A’raj reported: I went to Ibn Abbas and I said, “Tell me about fasting the day of &#8216;Ashura.” Ibn Abbas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا رَأَيْتَ هِلاَلَ الْمُحَرَّمِ فَاعْدُدْ وَأَصْبِحْ يَوْمَ التَّاسِعِ صَائِمًا<\/p>\n<p>When you see the crescent of the month of al-Muharram, count the days and wake up to fast on the ninth day.<\/p><\/blockquote>\n<p>I said, “Is this how the Messenger of Allah, peace and blessings be upon him, fasted it?” Ibn Abbas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ<\/p>\n<p>Yes.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1133, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/31\/fasting-ashura-9th-muharram\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الشَّافِعِيُّ وَأَصْحَابُهُ وَأَحْمَدُ وَإِسْحَاقُ وَآخَرُونَ يُسْتَحَبُّ صَوْمُ التَّاسِعِ وَالْعَاشِرِ جَمِيعًا لِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَامَ الْعَاشِرَ وَنَوَى صِيَامَ التَّاسِعِ<\/p>\n<p>Al-Shafi’i, his companions, Ahmad, Ishaq, and others said it is recommended to fast the ninth and tenth of al-Muharram together, as the Prophet fasted the tenth and intended to fast the ninth.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 8\/12<\/p><\/blockquote>\n<p>Some scholars also included the eleventh day of Al-Muharram, so in their view it is recommended to fast three days on the ninth, tenth, and eleventh.<\/p>\n<p>Imam Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَصِيَامُ عَاشُورَاءَ عَلَى ثَلَاثِ مَرَاتِبَ أَدْنَاهَا أَنْ يُصَامَ وَحْدَهُ وَفَوْقَهُ أَنْ يُصَامَ التَّاسِعُ مَعَهُ وَفَوْقَهُ أَنْ يُصَامَ التَّاسِعُ وَالْحَادِي عَشَرَ وَاللَّهُ أَعْلَمُ<\/p>\n<p>The fast of &#8216;Ashura has three levels: the lowest is to fast one day, the next is to fast the ninth day along with it, and the next is to fast the ninth, tenth, and eleventh days. Allah knows best.<\/p>\n<p>Source: Fatḥ al-Bārī 4\/246<\/p><\/blockquote>\n<p>In any case, the most important of the days is &#8216;Ashura, so if one is going to fast any day of Al-Muharram, it should be the tenth days.<\/p>\n<p>May Allah empower us to sincerely fast in this blessed month of Al-Muharram and on this blessed day of &#8216;Ashura.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Best fast after Ramadan is in the month of Allah, al-Muharram.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[127,413,406,391,85,342,322,39,41,411,404,415,100,360,408,57,115,291,306,365,67,179],"class_list":["post-21111","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-adultery-zina","tag-al-muharram","tag-ashura","tag-bloodshed-safk-al-dima","tag-fasting-al-siyam","tag-al-fiqh","tag-gratitude-al-shukr","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-israelites-banu-israil","tag-legal-punishment-al-hudud","tag-major-sins","tag-manners-al-adab","tag-minor-sins-al-saghair","tag-miracles-al-mujizah","tag-moses-musa","tag-people-of-the-book","tag-pharaoh-firawn","tag-ramadan","tag-recommendation-al-mustahab","tag-repentance-al-tawbah","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5uv","jetpack-related-posts":[{"id":20283,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-voluntary-sunan-fasting\/","url_meta":{"origin":21111,"position":0},"title":"Imam al-Nawawi on Voluntary Sunan Fasting","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Best fast after Ramadan is the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14743,"url":"https:\/\/www.abuaminaelias.com\/recommendation-to-fast-six-days-of-shawwal-after-ramadan\/","url_meta":{"origin":21111,"position":1},"title":"Fasting six days of Shawwal after Ramadan","author":"Abu Amina Elias","date":"August 14, 2013","format":false,"excerpt":"\"It is recommended to fast six days of the month of Shawwal,\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":21111,"position":2},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14735,"url":"https:\/\/www.abuaminaelias.com\/blessings-ten-days-dhul-hijjah\/","url_meta":{"origin":21111,"position":3},"title":"Blessings of the first ten days of Dhul-Hijjah","author":"Abu Amina Elias","date":"August 14, 2013","format":false,"excerpt":"\"No days more beloved to Allah than these ten days,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14319,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-giving-food-break-fasting\/","url_meta":{"origin":21111,"position":4},"title":"Imam al-Nawawi on Feeding the Breaking Fast","author":"Abu Amina Elias","date":"July 20, 2013","format":false,"excerpt":"\"Verily, the angels send blessings upon the fasting person...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21843,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-fasting-in-ramadan\/","url_meta":{"origin":21111,"position":5},"title":"Imam al-Mundhiri on Fasting in Ramadan","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Allah has people He redeems in every day and night of Ramadan.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21111","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21111"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21111\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21111"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21111"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21111"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}