{"id":21142,"date":"2019-09-11T12:36:37","date_gmt":"2019-09-11T08:36:37","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21142"},"modified":"2025-05-05T15:19:14","modified_gmt":"2025-05-05T11:19:14","slug":"obedience-to-unjust-muslim-rulers","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/obedience-to-unjust-muslim-rulers\/","title":{"rendered":"Obedience to Unjust Muslim Rulers"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Obedience to Muslim rulers, even if they are sinful, has been an important principle of creed since the time of the righteous predecessors. But it is one that some people do not understand well, either exploiting it for some political agenda or rejecting it altogether.<\/p>\n<p>The Sunnah and the way of righteous predecessors strike a balance between civil obligations to the government, civil obligations to the common citizenry, and our moral obligations as Muslims. Islam does not advocate violent rebellion according to the whims of the citizenry, nor does it approve of every action taken by a Muslim ruler.<\/p>\n<p>The default rule (<em>asl<\/em>) is that Muslim leaders must be obeyed in all matters of civil law, as long as we are not ordered to commit sins, in which case we disobey such orders to commit sins. Even so, the sinful actions of a Muslim leader are not an excuse to violate basic laws and norms of civil society. We are still obligated to obey lawful orders and regulations, despite the government&#8217;s malpractice in other areas.<\/p>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ ۖ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا<\/p>\n<p><strong>O believers! Obey Allah and obey the Messenger and those in authority among you. Should you disagree on anything, then refer it to Allah and His Messenger, if you truly believe in Allah and the Last Day. This is the best and fairest resolution.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:59<\/p><\/blockquote>\n<p>Ali reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا طَاعَةَ فِي مَعْصِيَةٍ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ<\/p>\n<p><strong>There is no obedience to anyone if it is disobedience to Allah. Verily, obedience is only in good conduct<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7257, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/17\/no-obedience-creator\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Authority not only applies to the highest executive in the country, but also to anyone invested with lawful and proper authority: local Imams, teachers, doctors, police officers, and so on. If disobedience to them is necessary to avoid a sin, it should be done so civilly and without violence.<\/p>\n<p>This principle of obedience is also true for Muslims who are visiting or residing in non-Muslim countries, as a visa or citizenship in such countries is a type of contract that must be upheld.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ<\/p>\n<p><strong>O believers! Honour your obligations.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:1<\/p><\/blockquote>\n<p>The meaning of ‘obedience to the ruler’ is not related to the individual personality of the ruler, but rather to the civil laws that maintain order in society. In the past, the ruler was considered the source of the law, but in most countries today, the bureaucratic state has replaced any particular individual. As the Emperor Napoleon allegedly said, “I am the state.”<\/p>\n<p>This means that ‘obeying the ruler’ in our context means obeying state laws and statutes against crimes like murder, theft, and assault, as well as state regulations such as traffic laws, housing laws, and safety standards. It is not obedience to the <em>personality<\/em> of the ruler, who may in fact be very sinful in his private life, but rather it is obedience to the <em>legal apparatus<\/em> of which he is at the top, as long as we are not forced by them to commit sins. This obedience ensures that society will not descend into chaos and lawlessness.<\/p>\n<p>With regard to governments and rulers, Muslim scholars tend to follow three types of approach: 1) sincerely adhering to Islamic teachings, whether or not it pleases the government or the citizenry, 2) adapting Islamic teachings to fit a government agenda, or 3) adapting Islamic teachings to fit a populist movement.<\/p>\n<p>Shaykh Ibn ‘Uthaymeen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">العلماء ثلاثة أقسام عالم مِلَّةْ وعالم دولة وعالم أمة<\/p>\n<p style=\"text-align: right;\">أما عالم الملة فهو الذي ينشر دين الإسلام ويفتي بدين الإسلام عن علم ولا يبالي بما دل عليه الشرع أوافق أهواء الناس أم لم يوافق وأما عالم الدولة فهو الذي ينظر ماذا تريد الدولة فيفتي بما تريد الدولة ولو كان في ذلك تحريف كتاب الله وسنة رسوله صلى الله عليه وسلم وأما عالم الأمة فهو الذي ينظر ماذا يرضى الناس إذا رأى الناس على شيء أفتي بما يرضيهم ثم يحاول أن يحرف نصوص الكتاب والسنة من أجل موافقة أهواء الناس<\/p>\n<p style=\"text-align: right;\">نسأل الله أن يجعلنا من علماء الملة العاملين بها<\/p>\n<p>The scholars are divided into three types: religious scholars, government scholars, and populist scholars.<\/p>\n<p>As for the religious scholar, it is one who spreads the religion of Islam and issues verdicts based on knowledge of it. It does not matter to him whether the evidences of the law agree with the whims of people or not. As for the government scholar, it is one who considers what the government wants and issues verdicts accordingly, even if that distorts the Book of Allah and the Sunnah of the Messenger of Allah. As for the populist scholar, it is one who considers what pleases people. If he sees people doing something, he issues verdicts to satisfy them and attempts to distort the texts of the Book and Sunnah to make them agree with the whims of the people.<\/p>\n<p>We ask Allah to make us among the religious scholars, acting in accordance with them.<\/p>\n<p>Source: Sharḥ Riyāḍ al-Ṣāliḥīn 4\/307-308<\/p><\/blockquote>\n<p>As such, the proper Islamic approach in any context is to sincerely follow the Quran and Sunnah wherever they lead, whether it supports a government agenda, a populist agenda, or neither.<\/p>\n<p>Populism can be a potently dangerous threat to society if the whims of the citizenry are aggravated to the point that they take up violence against the government. The Prophet ﷺ warned us not to fall for the siren call of rebellion, as long as we are able to practice Islam safely in our countries.<\/p>\n<p>Hudhayfa ibn al-Yaman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَكُونُ بَعْدِي أَئِمَّةٌ لَا يَهْتَدُونَ بِهُدَايَ وَلَا يَسْتَنُّونَ بِسُنَّتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ<\/p>\n<p><strong>Rulers after me will come who do not follow my guidance and my Sunnah<\/strong>. <strong>Some of their men will have the hearts of devils in a human body.<\/strong><\/p><\/blockquote>\n<p>I said, “O Messenger of Allah, what should I do if I live to see that time?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَسْمَعُ وَتُطِيعُ لِلْأَمِيرِ وَإِنْ ضُرِبَ ظَهْرُكَ وَأُخِذَ مَالُكَ فَاسْمَعْ وَأَطِعْ<\/p>\n<p><strong>You should listen and obey them even if the ruler strikes your back and takes your wealth, even still listen and obey.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1847, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/tyrant-strike-back-patience\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Awf ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خِيَارُ أَئِمَّتِكُمْ الَّذِينَ تُحِبُّونَهُمْ وَيُحِبُّونَكُمْ وَيُصَلُّونَ عَلَيْكُمْ وَتُصَلُّونَ عَلَيْهِمْ وَشِرَارُ أَئِمَّتِكُمْ الَّذِينَ تُبْغِضُونَهُمْ وَيُبْغِضُونَكُمْ وَتَلْعَنُونَهُمْ وَيَلْعَنُونَكُمْ<\/p>\n<p><strong>The best of your rulers are those whom you love and they love you, who pray for you and you pray for them. The worst of your rulers are those whom you hate and they hate you, whom you curse and they curse you.<\/strong><\/p><\/blockquote>\n<p>It was said, “Shall we confront them with swords?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا مَا أَقَامُوا فِيكُمْ الصَّلَاةَ وَإِذَا رَأَيْتُمْ مِنْ وُلَاتِكُمْ شَيْئًا تَكْرَهُونَهُ فَاكْرَهُوا عَمَلَهُ وَلَا تَنْزِعُوا يَدًا مِنْ طَاعَةٍ<\/p>\n<p><strong>No, as long as they establish prayer among you. If you find something hateful in them, you should hate their actions but not withdraw your hand from obedience.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1855, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/hate-tyrant-deeds-rebellion\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Umm Salamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَتَكُونُ أُمَرَاءُ فَتَعْرِفُونَ وَتُنْكِرُونَ فَمَنْ عَرَفَ بَرِئَ وَمَنْ أَنْكَرَ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ<\/p>\n<p><strong>There will be rulers from whom you will see both goodness and corruption. One who recognizes their evil and hates it will maintain his innocence, but one who is pleased with it and follows them will be sinful.<\/strong><\/p><\/blockquote>\n<p>It was said, “Shall we not fight them?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا مَا صَلَّوْا<\/p>\n<p><strong>No, as long as they pray.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1854, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/muslim-tyrants-not-rebellion\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Adi ibn Hatim reported: We said, “O Messenger of Allah, we do not ask you about obedience to Godfearing rulers, but rather those who do this and that,” and he mentioned their evil. The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا اللَّهَ وَاسْمَعُوا وَأَطِيعُوا<\/p>\n<p><strong>Fear Allah, listen, and obey.<\/strong><\/p>\n<p>Source: al-Sunnah li-Ibn Abī ‘Āṣim 1069, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/06\/fear-allah-listen-obey\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْمَعْ وَأَطِعْ فِي عُسْرِكَ وَيُسْرِكَ وَمَكْرَهِكَ وَأَثَرَةٍ عَلَيْكَ وَإِنْ أَكَلُوا مَالَكَ وَضَرَبُوا ظَهْرَكَ إِلَّا أَنْ تَكُونَ مَعْصِيَةً لِلَّهِ بَوَاحًا<\/p>\n<p><strong>Listen and obey authorities in hardship, in ease, and in what you dislike, even if they give undue preference over you, even if they consume your property and they strike your back, unless they order flagrant disobedience to Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 4566, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/06\/sabr-unless-disobedient\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>The wisdom behind these traditions is that violent rebellion, which is a <em>civil war<\/em>, is almost certainly worse than the oppression of any government ruler. The long record of failed rebellions and harmful civil wars has led later scholars to reach a consensus on the prohibition of insurrection.<\/p>\n<p>Imam al-Nawawi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْخُرُوجُ عَلَيْهِمْ وَقِتَالُهُمْ فَحَرَامٌ بِإِجْمَاعِ الْمُسْلِمِينَ وَإِنْ كَانُوا فَسَقَةً ظَالِمِينَ وَقَدْ تَظَاهَرَتِ الْأَحَادِيثُ بِمَعْنَى مَا ذَكَرْتُهُ وَأَجْمَعَ أَهْلُ السُّنَّةِ أَنَّهُ لَا يَنْعَزِلُ السُّلْطَانُ بِالْفِسْقِ &#8230; وَسَبَبُ عَدَمِ انْعِزَالِهِ وَتَحْرِيمِ الْخُرُوجِ عَلَيْهِ مَا يَتَرَتَّبُ عَلَى ذَلِكَ مِنَ الْفِتَنِ وَإِرَاقَةِ الدِّمَاءِ وَفَسَادِ ذَاتِ الْبَيْنِ فَتَكُونُ الْمَفْسَدَةُ فِي عَزْلِهِ أَكْثَرَ مِنْهَا فِي بَقَائِهِ<\/p>\n<p>As for rebelling against the ruler and fighting him, it is forbidden by consensus of the Muslims, even if he is sinful and oppressive. I have mentioned the traditions that demonstrate this meaning. The people of the Sunnah have agreed that the ruler should not be removed due to his sinfulness… His removal and rebellion against him is forbidden because of what that entails of tribulations, bloodshed, and corruption, for the harm in removing the ruler is greater than letting him remain.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ Muslim 12\/229<\/p><\/blockquote>\n<p>Imam Ahmad ibn Hanbal said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ خَرَجَ عَلَى إِمَامِ الْمُسْلِمِينَ وَقَدْ كَانَ النَّاسُ اجْتَمَعُوا عَلَيْهِ وَأَقَرُّوا لَهُ بِالْخِلَافَةِ بِأَيِّ وَجْهٍ كَانَ بِالرِّضَا أَوْ بِالْغَلَبَةِ فَقَدْ شَقَّ هَذَا الْخَارِجُ عَصَا الْمُسْلِمِينَ وَخَالَفَ الْآثَارَ عَنْ رَسُولِ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَإِنْ مَاتَ الْخَارِجُ عَلَيْهِ مَاتَ مِيتَةَ جَاهِلِيَّةٍ وَلَا يَحِلُّ قِتَالُ السُّلْطَانِ وَلَا الْخُرُوجُ عَلَيْهِ لِأَحَدٍ مِنَ النَّاسِ فَمَنْ فَعَلَ ذَلِكَ فَهُوَ مُبْتَدِعٌ عَلَى غَيْرِ السُّنَّةِ وَالطَّرِيقِ<\/p>\n<p>Whoever rebels against the leader of the Muslims, while the people have gathered around him and acknowledged his Caliphate by any means, whether by consent or by force, then this rebel has split the unity of the Muslims and opposed the reports of the Messenger of Allah. If the rebel dies, he dies a death of ignorance. It is not lawful for anyone to fight the ruler or to rebel. Whoever does that is a heretical innovator who is not following the Sunnah and the path.<\/p>\n<p>Source: Sharḥ Uṣul I’tiqād Ahl al-Sunnah lil-Lālakā’ī 1\/175<\/p><\/blockquote>\n<p>And Imam Ahmad said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يحل قتال السُّلْطَان وَلَا الْخُرُوج عَلَيْهِ لأحد من النَّاس فَمن فعل ذَلِك فَهُوَ مُبْتَدع على غير السّنة<\/p>\n<p>It is not lawful for anyone to fight the ruler or rebel against him. Whoever does so is a heretical innovator who is not upon the Sunnah.<\/p>\n<p>Source: Uṣūl al-Sunnah 1\/46<\/p><\/blockquote>\n<p>This matter is so important that the righteous predecessors included it in their treatises on sound creed and Islamic theology, such as what was written by Imam al-Tahawi:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا نَرَى الْخُرُوجَ عَلَى أَئِمَّتِنَا وَوُلَاةِ أُمُورِنَا وَإِنْ جَارُوا وَلَا نَدْعُو عَلَيْهِمْ وَلَا نَنْزِعُ يَدًا مِنْ طَاعَتِهِمْ وَنَرَى طَاعَتَهُمْ مِنْ طَاعَةِ اللَّهِ عَزَّ وَجَلَّ فَرِيضَةً مَا لَمْ يَأْمُرُوا بِمَعْصِيَةٍ وَنَدْعُو لَهُمْ بِالصَّلَاحِ وَالْمُعَافَاةِ<\/p>\n<p>We do not rebel against our leaders or those in charge of our affairs, even if they are tyrannical. We do not supplicate against them, nor withdraw from obedience to them. We view obedience to them as obedience to Allah Almighty, an obligation, as long as they do not order disobedience to Allah. We supplicate on their behalf for righteousness and wellness.<\/p>\n<p>Source: al-ʻAqīdah al-Ṭaḥāwīyah 1\/68<\/p><\/blockquote>\n<p>It is true that some of the companions and righteous predecessors supported rebellions against some of the early Caliphs. This was from their <em>ijtihad<\/em> (personal reasoning), which may or may not be correct. Only those who are invested with authority over constitutional matters of government (<em>Ahl al-Hall wal-‘Aqd<\/em>), as many of them were, can decide if the evil of a rebellion outweighs the evil of a particular ruler; it is not a decision to be made by populist preachers or the common citizenry.<\/p>\n<p>As for the traditions of the Prophet ﷺ on this matter, they counsel patience in the face of unjust rulers, and this is the general rule for common Muslims.<\/p>\n<p>Furthermore, Muslims should provide sincere advice to the rulers and wish for their well-being in this life and in the Hereafter. This is very difficult to do for an oppressive Muslim ruler, and many of us may not be prepared to wish them well, perhaps understandably so, but this is the standard set by Islam nevertheless.<\/p>\n<p>Tamim al-Dari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الدِّينَ النَّصِيحَةُ<\/p>\n<p><strong>Verily, the religion is sincerity.<\/strong><\/p><\/blockquote>\n<p>We said, “To whom?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلَّهِ وَكِتَابِهِ وَرَسُولِهِ وَأَئِمَّةِ الْمُؤْمِنِينَ وَعَامَّتِهِمْ وَأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ<\/p>\n<p><strong>To Allah, His Book, His Messenger, the leaders of the Muslims, and their common people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 55, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/23\/deen-al-nasihah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>For this reason, as stated by Imam al-Tahawi, the Companions and righteous predecessors generally did not supplicate or pray against the rulers even when they were sinful. In fact, some of them made it a point to supplicate for guidance on their behalf.<\/p>\n<p>Anas ibn Malik reported: The eminent among the Companions of the Messenger of Allah, peace and blessings be upon him, prohibited us, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَسُبُّوا أُمَرَاءَكُمْ وَلَا تَغِشُّوهُمْ وَلَا تَبْغَضُوهُمْ وَاتَّقُوا اللَّهَ وَاصْبِرُوا فَإِنَّ الْأَمْرَ قَرِيبٌ<\/p>\n<p>Do not curse your leaders, do not deceive them, and do not hate them. Fear Allah and be patient, for the matter is close at hand.<\/p>\n<p>Source: al-Sunnah li-Ibn Abī ‘Āṣim 1015, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/02\/21\/companions-muslim-rulers\/\">Jayyid<\/a><\/p><\/blockquote>\n<p>Al-Fudayl ibn ‘Iyad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ لِي دَعْوَةً مُسْتَجَابَةً مَا جَعَلْتُهَا إِلَّا فِي إِمَامٍ فَصَلَاحُ الْإِمَامِ صَلَاحُ الْبِلَادِ وَالْعِبَادِ<\/p>\n<p>If I had one supplication to be answered, I would make it for no one but the ruler. If the ruler is righteous, it will lead to the righteousness of the country and the people.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/07\/20\/fudayl-dua-muslim-imams\/\">Siyar A’lām al-Nubalā 8\/434<\/a><\/p><\/blockquote>\n<p>Malik ibn Dinar, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَرَأْتُ فِي الْحِكْمَةِ أَنَّ اللَّهَ يَقُولُ أَنَا اللَّهُ مَالِكُ الْمُلُوكِ قُلُوبُ الْمُلُوكِ بِيَدِي فَمَنْ أَطَاعَنِي جَعَلْتُهُمْ عَلَيْهِ رَحْمَةً وَمَنْ عَصَانِي جَعَلْتُهُمْ عَلَيْهِ نِقْمَةً فَلَا تَشْغَلُوا أَنْفُسَكُمْ بِسَبِّ الْمُلُوكِ وَلَكِنْ تُوبُوا إِلَى أَعْطَفِهِمْ عَلَيْكُمْ<\/p>\n<p>I have found in the Wisdom that Allah says: I am Allah, the King of kings. The hearts of the kings are in My hand. Whoever obeys Me, I will make them merciful to him, and whoever disobeys Me, I will make them malicious to him. Do not be preoccupied with cursing the kings, but rather repent to Me and I will make them compassionate to you.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/06\/do-not-curse-rather-tawbah\/\">al-Tawbah li-Ibn Abī al-Dunyā 103<\/a><\/p><\/blockquote>\n<p>Imam Ibn Abi al-‘Izz commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا وَلِيُّ الْأَمْرِ فَقَدْ يَأْمُرُ بِغَيْرِ طَاعَةِ اللَّهِ فَلَا يُطَاعُ إِلَّا فِيمَا هُوَ طَاعَةٌ لِلَّهِ وَرَسُولُهُ وَأَمَّا لُزُومُ طَاعَتِهِمْ وَإِنْ جَارُوا فَلِأَنَّهُ يَتَرَتَّبُ عَلَى الْخُرُوجِ مِنْ طَاعَتِهِمْ مِنَ الْمَفَاسِدِ أَضْعَافُ مَا يَحْصُلُ مِنْ جَوْرِهِمْ بَلْ فِي الصَّبْرِ عَلَى جَوْرِهِمْ تَكْفِيرُ السَّيِّئَاتِ وَمُضَاعَفَةُ الْأُجُورِ فَإِنَّ اللَّهَ تَعَالَى مَا سَلَّطَهُمْ عَلَيْنَا إِلَّا لِفَسَادِ أَعْمَالِنَا وَالْجَزَاءُ مِنْ جِنْسِ الْعَمَلِ فَعَلَيْنَا الِاجْتِهَادُ فِي الِاسْتِغْفَارِ وَالتَّوْبَةِ وَإِصْلَاحِ الْعَمَلِ<\/p>\n<p>As for those given authority, if their orders are not in obedience to Allah, then there is no obedience unless it is in obedience to Allah and His Messenger. As for adhering to their obedience, even if they are tyrannical, it is because the corruption of rebelling against their authority is greater than enduring their tyranny. Rather, there must be patience with their tyranny, as it is an expiation of sins and multiplication of reward. For Allah Almighty has not given them authority over us except for the corruption of our deeds, as the recompense is of the same kind of deeds. We must strive to seek forgiveness, to repent, and to perform righteous deeds.<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwīyah 2\/543<\/p><\/blockquote>\n<p>Imam al-Barbahari commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإِذَا رَأَيْتَ الرَّجُلَ يَدْعُو عَلَى السُّلْطَانِ فاعْلَمْ أَنَّه صَاحِبُ هَوىً وإِذَا سَمِعْتَ الرَّجُلَ يَدْعُو للسُّلْطَانِ بالصَّلَاحِ فاعْلَمْ أَنَّه صَاحِبُ سُنَّةٍ إِنْ شَاءَ اللهُ<\/p>\n<p>If you see a man supplicating against the ruler, then know he is a follower of his whims. If you hear a man supplicating for the ruler’s improvement, then know he is a follower of the Sunnah, if Allah wills.<\/p>\n<p>Source: Sharḥ al-Sunnah lil-Barbahārī 1\/113<\/p><\/blockquote>\n<p>Indeed, if a ruler is guided to the right decision, or at least away from a bad one, it will benefit the entire country. That is why the Companions and righteous predecessors would supplicate for the rulers to be improved, despite their sins.<\/p>\n<p>It should also be appreciated that Muslim rulers are Muslims like everyone else, in the sense that unfairness to them is just as bad as unfairness to any other Muslim. Al-Hajjaj ibn Yusuf, for instance, was a draconian ruler in early Islamic history, and he was hated by many for his policies. Yet, the eminent scholar Muhammad ibn Sirin warned that slandering or even backbiting such a hated ruler is still considered sinful.<\/p>\n<p>‘Awf reported: I entered the home of Ibn Sirin, may Allah have mercy on him, and I began discussing the sins of the ruler Al-Hajjaj. Ibn Sirin said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِن اللَّه تَعَالَى حكم عدل فكما يأخذ من الْحَجَّاج يأخذ للحجاج وإنك إِذَا لقيت اللَّه عَزَّ وَجَلَّ غدا كَانَ أصغر ذنب أصبته أشد عليك من أَعْظَم ذنب أصابه الْحَجَّاج<\/p>\n<p>Verily, Allah Almighty is a just judge. Just as he passes judgment against Al-Hajjaj, he will pass judgment in favor of Al-Hajjaj. If you were to meet Allah tomorrow, the smallest sin you committed would be worse for you than the greatest sin Al-Hajjaj committed against you.<\/p>\n<p>Source: al-Risālah al-Qushayrīyah 1\/291<\/p><\/blockquote>\n<p>Even so, the sins of the ruler are magnified, as their actions are far-reaching and can affect entire countries for generations to come. They should be reminded that by their leadership they are in a precarious position with regards to the Reckoning on the Day of Resurrection.<\/p>\n<p>Ma’qil ibn Yasar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ عَبْدٍ اسْتَرْعَاهُ اللَّهُ رَعِيَّةً فَلَمْ يَحُطْهَا بِنَصِيحَةٍ إِلَّا لَمْ يَجِدْ رَائِحَةَ الْجَنَّةِ<\/p>\n<p><strong>No servant is given authority by Allah, but he does not fulfill its duties sincerely, except that he will never smell the fragrance of Paradise.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7150, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/06\/12\/dishonest-leaders-smell-jannah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ مَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَشَقَّ عَلَيْهِمْ فَاشْقُقْ عَلَيْهِ وَمَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَرَفَقَ بِهِمْ فَارْفُقْ بِهِ<\/p>\n<p><strong>O Allah, whoever is given charge over my nation and he is harsh with them, be harsh with him. Whoever is given charge over my nation and he is gentle with them, be gentle with him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1828, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/11\/rulers-as-they-treat-subjects\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This is why it is disapproved for anyone to seek a position of leadership. Instead, the most qualified person should be called to serve without requesting it for themselves.<\/p>\n<p>Advising the rulers, like advising ordinary Muslims, should first be done in private if possible. This is to protect their reputations and avoid unnecessarily agitating the citizenry.<\/p>\n<p>‘Iyad ibn Ghanam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَتْ عِنْدَهُ نَصِيحَةٌ لِذِي سُلْطَانٍ فَلْيَأْخُذْ بِيَدِهِ فَلْيَخْلُو بِهِ فَإِنْ قَبِلَهَا قَبِلَهَا وَإِنْ رَدَّهَا كَانَ قَدْ أَدَّى الَّذِي عَلَيْهِ<\/p>\n<p><strong>Whoever has advice for the ruler, let him take his hand and give it privately. If he accepts it, then he accepts it. If he rejects it, the duty upon him has been fulfilled.<\/strong><\/p>\n<p>Source: al-Sunnah li-Ibn Abī ‘Āṣim 1098, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/03\/06\/nasihah-imams-private\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Shafi’i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ وَعَظَ أَخَاهُ سِرًّا فَقَدْ نَصَحَهُ وَزَانَهُ وَمَنْ وَعَظَهُ عَلانِيَةً فَقَدْ فَضَحَهُ وَخَانَهُ<\/p>\n<p>Whoever admonishes his brother in private has been sincere to him and protected his reputation. Whoever admonishes him in public has humiliated him and betrayed him.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/01\/21\/shafiee-advice-private\/\">Ḥilyat al-Awliyā’ 9\/140<\/a><\/p><\/blockquote>\n<p>As this is the proper first step of criticism, one should not assume that scholars who do not ‘speak out’ about various issues have not already addressed them in private. We should usually give our scholars the benefit of the doubt on this matter.<\/p>\n<p>But if a Muslim ruler is generally doing a good job, then they should definitely not be criticized publicly in a way that belittles or humiliates their status, as Allah will retaliate against such humiliation.<\/p>\n<p>Ziyad ibn Kusayb reported: I was with Abu Bakrah under the pulpit of Abdullah ibn Amr, may Allah be pleased with him, while he was delivering a sermon wearing a fine garment. Abu Bilal said, &#8216;Look at our leader wearing the clothes of wickedness!&#8217; Abu Bakrah said, &#8216;Be quiet! I heard the Prophet, peace and blessings be upon him, say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَهَانَ سُلْطَانَ اللَّهِ فِي الْأَرْضِ أَهَانَهُ اللَّهُ<\/p>\n<p><strong>Whoever belittles the authority of Allah on earth, Allah will belittle him.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2224, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/30\/allah-humiliate-reject-sultan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Belittling a ruler who is otherwise doing a good job will weaken the confidence of the citizens under their authority, which may have detrimental effects on society and their ability to enact beneficial policies.<\/p>\n<p>This tradition has been incorrectly transcribed in the published manuscript of Riyad al-Salihin, missing the important qualification “authority of Allah”:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">من أهان السلطان أهانه الله<\/p>\n<p>Whoever belittles the authority, Allah will belittle him.<\/p>\n<p>Source: Riyāḍ al-Ṣāliḥīn (Dar Ibn Kathir, 2007) 1\/216 #672<\/p><\/blockquote>\n<p>Hence, this unqualified text is an error, and it does not prove that any authority should be immune from all criticism, public or not. Rather, it is among the greatest acts of jihad to speak a word of truth and justice in front of a tyrant.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْظَمِ الْجِهَادِ كَلِمَةَ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ<\/p>\n<p><strong>Verily, among the greatest acts of jihad is a word of justice in front of a tyrannical ruler.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2174, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/13\/greatest-jihad-word-haqq-truth\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In keeping with Islamic principles, this word of truth should be done in private first, but sometimes a situation can become so grievous that the oppressed must make their case in public.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَّا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَن ظُلِمَ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا<\/p>\n<p><strong>Allah does not like public mention of evil except by one who was wronged. <\/strong><\/p>\n<p>Surat al-Nisa’ 4:148<\/p><\/blockquote>\n<p>Such public rebuke is not to be taken lightly and should be a last resort, when all other avenues of redressing wrongs have been exhausted.<\/p>\n<p>To sum, obedience to authorities is an obligation upon Muslims as long as we are not ordered to commit sins. If we are compelled to commit sins, we must act with non-violent civil disobedience. Muslims should try to follow the Quran and Sunnah as best as possible, without being biased towards the government or populist movements. Public criticism of rulers should be avoided except when absolutely necessary or appropriate.<\/p>\n<p>Violent rebellion is likewise forbidden for common Muslims, and it may only be collectively considered as a last resort by scholars and authorities who are entrusted with the constitutional matters of their government (<em>Ahl al-Hall wal-‘Aqd<\/em>).<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There is no obedience if it is disobedience to Allah,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[384,391,420,321,18,165,21,183,433,434,342,49,330,32,153,41,47,48,50,51,100,94,60,432,91,68,296,70,431,220,371,179,435,392],"class_list":["post-21142","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-backbiting-al-ghibah","tag-bloodshed-safk-al-dima","tag-caliphs-al-khulafa","tag-clothing-al-malabis","tag-community-jamaah","tag-consensus-al-ijma","tag-creed-aqidah","tag-day-of-resurrection-yawm-al-qiyammah","tag-disobedience-al-isyan","tag-al-fatwa","tag-al-fiqh","tag-gentleness-al-rifq","tag-good-will-naseehah","tag-hereafter-akhirah","tag-al-ijtihad","tag-imam-al-shafii","tag-jihad","tag-justice-adl","tag-knowledge","tag-leadership-imamate","tag-manners-al-adab","tag-obedience-al-taah","tag-prayer-salat","tag-privacy-al-sirriyah","tag-righteous-predecessors-al-salaf-al-salih","tag-satan-al-shaytan","tag-sharia","tag-sincerity-al-ikhlaas","tag-slander-al-buhtan","tag-supplication-al-dua","tag-ummah","tag-virtue-al-fadilah","tag-wellness-al-afiyyah","tag-wrongdoing-al-thulm"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5v0","jetpack-related-posts":[{"id":14171,"url":"https:\/\/www.abuaminaelias.com\/islam-forbids-violent-rebellion\/","url_meta":{"origin":21142,"position":0},"title":"Non-Violent Reform of Unjust Muslim Rulers","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"You should listen and obey, even if they strike your back.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":21142,"position":1},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23308,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-obedience-sultan\/","url_meta":{"origin":21142,"position":2},"title":"Imam al-Nawawi on Obedience to Muslim authorities","author":"Abu Amina Elias","date":"June 6, 2021","format":false,"excerpt":"\"...obey Allah, obey the Messenger, and those in authority over you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16830,"url":"https:\/\/www.abuaminaelias.com\/the-definition-of-faith-in-islam\/","url_meta":{"origin":21142,"position":3},"title":"Definition of faith in Islam","author":"Abu Amina Elias","date":"August 16, 2015","format":false,"excerpt":"\"Faith is to believe in Allah, His angels, His books...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17977,"url":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","url_meta":{"origin":21142,"position":4},"title":"Good character before learning Islamic sciences","author":"Abu Amina Elias","date":"April 5, 2016","format":false,"excerpt":"\"What I learned from Malik's manners was better than his knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16602,"url":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","url_meta":{"origin":21142,"position":5},"title":"Worship in the middle night of Sha’ban","author":"Abu Amina Elias","date":"April 23, 2015","format":false,"excerpt":"\"There is a proof for it, so it cannot be rejected.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21142","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21142"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21142\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21142"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}