{"id":21235,"date":"2019-09-20T18:00:59","date_gmt":"2019-09-20T14:00:59","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21235"},"modified":"2020-07-17T21:52:46","modified_gmt":"2020-07-17T17:52:46","slug":"ten-ayat-surah-kahf-dajjal","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/ten-ayat-surah-kahf-dajjal\/","title":{"rendered":"Ten verses of Surat al-Kahf to protect from Dajjal"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Surat al-Kahf, the Quranic chapter named after the young companions of the cave, has been noted by scholars for its unique virtues. It is recommended to read it at least once a week on Friday. Even just ten verses of it can provide protection from the False Messiah (<em>al-Masiha al-Dajjal<\/em>), the greatest tribulation to afflict humankind throughout our entire history.<\/p>\n<p>Abu Darda reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْكَهْف عُصِمَ مِنْ الدَّجَّالِ<\/p>\n<p><strong>Whoever memorizes ten verses from the beginning of Surat al-Kahf<\/strong> <strong>will be immune to the False Messiah<\/strong>.<\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنْ آخِرِ الْكَهْفِ<\/p>\n<p><strong>From the last ten verses of Surat al-Kahf.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 809, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/03\/dajjal-ten-verses-kahf\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>One might wonder how this surah can provide protection from the Dajjal. Moreover, is it the first or last ten verses, as both versions have been authentically reported?<\/p>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قِيلَ سَبَبُ ذَلِكَ مَا فِي أَوَّلِهَا مِنَ الْعَجَائِبِ وَالْآيَاتِ فَمَنْ تَدَبَّرَهَا لَمْ يُفْتَتَنْ بِالدَّجَّالِ وَكَذَا فِي آخِرِهَا<\/p>\n<p>It is said the reason for this is that the beginning of it contains wonders and signs. Whoever contemplates them will not be misled by the trials of the False Messiah. It is likewise for the last verses of it.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 809<\/p><\/blockquote>\n<p>Ten verses from the beginning or end of Surat al-Kahf mention matters that are relevant to understanding and preparing for the tribulation of the Dajjal. It is <em>reflection<\/em> upon these meanings in the surah, not simply reciting them outwardly, that provide us with protection.<\/p>\n<p>In the beginning of the surah, Allah introduces the story of the youth of the cave. They were young believers who fled their comfortable homes in the city, to take refuge in a rugged mountain cave, because they were being persecuted for praying to Allah alone and not to the idols of their people.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذْ أَوَى الْفِتْيَةُ إِلَى الْكَهْفِ فَقَالُوا رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا<\/p>\n<p><strong>When the youth retreated to the cave and they said: Our Lord, grant us mercy from you and facilitate right guidance for us in our affair.<\/strong><\/p>\n<p>Surat al-Kahf 18:10<\/p><\/blockquote>\n<p>Al-Tabari explained these verses, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوَى الْفِتْيَةُ أَصْحَابُ الْكَهْفِ إِلَى كَهْفِ الْجَبَلِ هَرَبًا بِدِينِهِمْ إِلَى اللَّهِ &#8230; وَقَالُوا يَسِّرْ لَنَا بِمَا نَبْتَغِي وَمَا نَلْتَمِسُ مِنْ رِضَاكَ وَالْهَرَبِ مِنَ الْكُفْرِ بِكَ وَمِنْ عِبَادَةِ الْأَوْثَانِ الَّتِي يَدْعُونَا إِلَيْهَا قَوْمُنَا<\/p>\n<p>The young companions of the cave sought refuge in the cave, fleeing with their religion to Allah… They said: Make easy for us what we seek, what we traverse for the sake of Your pleasure, our flight from unbelief for Your sake and from our people who worship idols and call upon them.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 18:10<\/p><\/blockquote>\n<p>These young believers made the incredible sacrifice of emigrating, or performing <em>hijrah<\/em>, to the mountains for the sake of their religion. In this way, they resembled the companions who emigrated to the Prophet (ṣ) in Medina or the Israelites who fled with Moses (ṣ) from Pharaoh.<\/p>\n<p>When the Dajjal appears, the believers will be put to a similar test, as he will threaten and kill all those who worship Allah alone without any partners. The Prophet (ṣ) warned us that some of us will surely witness this trial.<\/p>\n<p>Umm Sharik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيَفِرَّنَّ النَّاسُ مِنْ الدَّجَّالِ فِي الْجِبَالِ<\/p>\n<p><strong>The people will flee from the False Messiah into the mountains<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2945, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/dajjal-people-flee-to-mountains\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنْ الْفِتَنِ<\/p>\n<p><strong>Soon the best property of a Muslim will be a flock of sheep he takes to the top of a mountain, or in the valleys of rainfall, fleeing with his religion from tribulations.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 19, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/07\/10\/fitnah-flee-to-mountains\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, as we reflect upon the companions of the cave and their faith, we should seek refuge in Allah from ever experiencing a trial in our religion such as theirs. We should ask ourselves: If the Dajjal came out tomorrow, would our faith be strong enough for us to do what we must do to protect it? Would we flee our homes for the sake of our faith, to a new country or even into the barren wilderness?<\/p>\n<p>Such reflections are good reminders of our constant need to strengthen our faith, to mentally and spiritually prepare for the trials that will inevitably afflict every human being.<\/p>\n<p>The end of Surat al-Kahf mentions the worst fate anyone could ever earn in the Hereafter, to have all of their deeds rejected by Allah while they spent a lifetime imagining they were on the right path.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ نُنَبِّئُكُم بِالْأَخْسَرِينَ أَعْمَالًا الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا<\/p>\n<p><strong>Shall I tell you about those with the greatest loss in their deeds? Those whose effort was wasted in the worldly life, while they thought they were doing the best of works.<\/strong><\/p>\n<p>Surat al-Kahf 18:104<\/p><\/blockquote>\n<p>This is a terrifying prospect, one that should make us continually reform ourselves and seek forgiveness from Allah, rather than deluding ourselves into thinking we are the pinnacle of creation.<\/p>\n<p>In the same way, the Dajjal will confuse people’s sense of right and wrong, making good appear as evil and evil appear as good. He will promise to people a way to Paradise, which is in reality a path to Hellfire, and he will threaten people with a path to Hellfire, which is in reality a way to Paradise.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُحَدِّثُكُمْ حَدِيثًا عَنْ الدَّجَّالِ مَا حَدَّثَ بِهِ نَبِيٌّ قَوْمَهُ إِنَّهُ أَعْوَرُ وَإِنَّهُ يَجِيءُ مَعَهُ بِمِثَالِ الْجَنَّةِ وَالنَّارِ فَالَّتِي يَقُولُ إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أُنْذِرُكُمْ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ<\/p>\n<p><strong>Shall I not tell you about the False Messiah of which no prophet has told his people before? Verily, he is blind in one eye. He will come with the likeness of paradise and fire. He will bring it and say it is paradise, yet it is actually fire. Verily, I have warned you just as Noah had warned his people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3160, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-false-messiah-fake-paradise\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When the believers are confronted with this trial, they must put their faith in Allah, close their eyes, lower their heads, and enter into his fire. Allah promises that the believers will be saved from his fire, just as He had also saved Abraham (ṣ) from his people.<\/p>\n<p>Hudhayfa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَنَا أَعْلَمُ بِمَا مَعَ الدَّجَّالِ مِنْهُ مَعَهُ نَهْرَانِ يَجْرِيَانِ أَحَدُهُمَا رَأْيَ الْعَيْنِ مَاءٌ أَبْيَضُ وَالْآخَرُ رَأْيَ الْعَيْنِ نَارٌ تَأَجَّجُ فَإِمَّا أَدْرَكَنَّ أَحَدٌ فَلْيَأْتِ النَّهْرَ الَّذِي يَرَاهُ نَارًا وَلْيُغَمِّضْ ثُمَّ لْيُطَأْطِئْ رَأْسَهُ فَيَشْرَبَ مِنْهُ فَإِنَّهُ مَاءٌ بَارِدٌ وَإِنَّ الدَّجَّالَ مَمْسُوحُ الْعَيْنِ عَلَيْهَا ظَفَرَةٌ غَلِيظَةٌ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ كَاتِبٍ وَغَيْرِ كَاتِبٍ<\/p>\n<p><strong>I surely know what the False Messiah will have with him. He will have two flowing rivers, one that appears to be clear water and another that appears to be blazing fire. If one of you sees that, let him go to the river of fire, lower his gaze, put his head down, and drink from it, for it will be cool water. The False Messiah has one covered eye with thick skin over it. Written between his eyes is the word of unbelief. Every believer will be able to read it, whether he is literate or not.<\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعَهُ جَنَّةٌ وَنَارٌ فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ<\/p>\n<p><strong>He will have paradise and fire with him.<\/strong> <strong>His fire is Paradise, and his paradise is Hellfire<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2934, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/dajjal-false-messiah-evil-good\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This flipping of good and evil is the essence of Satan’s tactics and, as such, it will reach its peak with the Dajjal and his deluded followers.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَاللَّهِ لَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِّن قَبْلِكَ فَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَهُوَ وَلِيُّهُمُ الْيَوْمَ وَلَهُمْ عَذَابٌ أَلِيمٌ<\/p>\n<p><strong>By Allah, We had sent messengers to the nations before you, but Satan beautified their sinful deeds for them. He is their ally today and they will have an agonizing punishment.<\/strong><\/p>\n<p>Surat al-Nahl 16:63<\/p><\/blockquote>\n<p>Then, the question is: Do I know enough about my faith to be immune from Satanic trickery? And if I do know enough, do I still have enough strength of conviction to be able to walk into his fire, believing in Allah’s promise?<\/p>\n<p>These are just a few reflections upon Surat al-Kahf and its relevance to the tribulation of the Dajjal. The chapter reminds us of the afflictions endured by believers before us, and the deception of appearances that may be in front of us. These lesson and the guidance of the surah as a whole, when internalized by the believers, will offer protection from the tremendous trials to come.<\/p>\n<p>For this reason, we should recite <a href=\"https:\/\/www.youtube.com\/watch?v=Fu_VA0mIl10\">the entire surah<\/a> and reflect upon it at least once a week on Friday, or if not the entire surah, then at least <a href=\"https:\/\/www.youtube.com\/watch?v=2sLHH8S9D7U\">ten verses from either the beginning or the end<\/a>.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever contemplates them will not be misled by the trials of the False Messiah.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[334,429,418,449,446,135,32,37,411,50,316,408,56,57,302,134,58,291,62,374,45,376,448,68,405,445,447,179],"class_list":["post-21235","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-certainty-al-yaqin","tag-emigration-al-hijrah","tag-false-messiah-al-masiha-al-dajjal","tag-falsehood-al-kadhib","tag-al-fitnah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-idolatry-shirk","tag-israelites-banu-israil","tag-knowledge","tag-medina-madinah","tag-miracles-al-mujizah","tag-monotheism-tawheed","tag-moses-musa","tag-noah-nuh","tag-paradise-jannah","tag-patience-al-sabr","tag-pharaoh-firawn","tag-prophetic-biography-sirah","tag-punishment-al-uqubah","tag-quran-exegesis-tafsir","tag-recitation-al-tilawah","tag-reflection-al-tafakkur","tag-satan-al-shaytan","tag-signs-of-the-hour-ashrat-al-saah","tag-surah-al-kahf","tag-trials-al-balaa","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5wv","jetpack-related-posts":[{"id":21491,"url":"https:\/\/www.abuaminaelias.com\/fitnah-al-masiha-al-dajjal\/","url_meta":{"origin":21235,"position":0},"title":"Tribulation of the False Messiah, al-Masiha al-Dajjal","author":"Abu Amina Elias","date":"December 5, 2019","format":false,"excerpt":"\"Know that your Lord does not have one eye.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14891,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-special-verses-of-the-quran\/","url_meta":{"origin":21235,"position":1},"title":"Imam al-Nawawi on Special Verses of the Quran","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"I will teach you the greatest chapter in the Quran....\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12950,"url":"https:\/\/www.abuaminaelias.com\/light-surah-al-kahf-jumuah\/","url_meta":{"origin":21235,"position":2},"title":"Light for reciting Surat al-Kahf on Friday","author":"Abu Amina Elias","date":"March 15, 2013","format":false,"excerpt":"\"Whoever recites Surat al-Kahf on Friday will have light...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13539,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-reading-the-quran\/","url_meta":{"origin":21235,"position":3},"title":"Imam al-Nawawi on Reading and Reciting the Quran","author":"Abu Amina Elias","date":"May 16, 2013","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21323,"url":"https:\/\/www.abuaminaelias.com\/where-wall-yajuj-majuj\/","url_meta":{"origin":21235,"position":4},"title":"Where is the wall of Gog and Magog?","author":"Abu Amina Elias","date":"September 27, 2019","format":false,"excerpt":"\"When the promise of my Lord comes, He will make it level.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19903,"url":"https:\/\/www.abuaminaelias.com\/nuh-flood-global-or-local\/","url_meta":{"origin":21235,"position":5},"title":"Was Noah&#8217;s flood global or local in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Islam does not necessitate belief in a global flood,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21235","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21235"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21235\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21235"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21235"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}