{"id":21247,"date":"2016-07-04T10:48:26","date_gmt":"2016-07-04T06:48:26","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21247"},"modified":"2025-07-04T11:04:24","modified_gmt":"2025-07-04T07:04:24","slug":"blind-man-kills-concubine-blasphemy","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/blind-man-kills-concubine-blasphemy\/","title":{"rendered":"Blind man kills his concubine for blasphemy?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>There is a hadith in which a blind man allegedly kills his concubine for insulting the Prophet (ṣ) and then he was not punished for it. It is often cited by hardline Muslims in support of harsh anti-blasphemy laws and, perhaps ironically, by anti-Muslim activists to accuse Islam of being violent. Blasphemy is most definitely a tremendous sin to Allah, but does it warrant killing without due process?<\/p>\n<p>There are good reasons to question the authenticity of the hadith based upon both its chain of narrators and its content. But first it should be clearly understood that not every hadith is authentic, and even hadith that do come through a sound chain are not always actionable. They might be context-dependent, specific to a certain situation, or legally abrogated.<\/p>\n<p>Ibn Wahb, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْلَا مَالِكٌ وَاللَّيْثُ هَلَكْتُ كُنْتُ أَظُنُّ كُلَّ مَا جَاءَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفْعَلُ بِهِ<\/p>\n<p>Were it not for Malik and Al-Layth, I would have been ruined. I used to believe that everything narrated about the Prophet, peace and blessings be upon him, should be acted upon.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/14\/ibn-wahb-fiqh-malik-layth\/\">Siyar Aʻlām al-Nubalāʼ 8\/148<\/a><\/p><\/blockquote>\n<p>And Ibn Abi Layla said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَفْقَهُ الرَّجُلُ فِي الْحَدِيثِ حَتَّى يَأْخُذَ مِنْهُ وَيَدَعَ<\/p>\n<p>A man does not understand the prophetic traditions unless he knows what to take from them and what to leave.<\/p>\n<p>Source: Jāmiʻ Bayān al-ʻIlm wa Faḍlihi 1207<\/p><\/blockquote>\n<p>Hadith must be interpreted according to the moral, legal, theological, and methodological principles of Islam. They cannot be acted upon at face-value according to one’s own personal understanding.<\/p>\n<p>As for the problematic hadith in question, the abridged text is as follows:<\/p>\n<p>Ibn Abbas reported: A blind man had a concubine who used to disparage and slander the Prophet (ṣ). The man forbade her and rebuked her, but she did not stop. One night she again slandered and disparaged the Prophet (ṣ), so he stabbed her in the stomach and killed her. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلاَ اشْهَدُوا أَنَّ دَمَهَا هَدَرٌ<\/p>\n<p>Bear witness there is no retaliation for her life.<\/p>\n<p>Source: Sunan Abī Dāwūd 4361<\/p><\/blockquote>\n<p>This hadith is weak because it comes through a questionable chain of authority and it apparently contradicts well-established moral and legal principles in Islam. The implication some people have wrongly inferred from the narration – that an extrajudicial killing for blasphemy is permissible – is a serious mistake.<\/p>\n<p>As for the chain of authorities, every version of the story originates with Uthman ibn Muslim al-Shuhham narrating from ‘Ikramah, may Allah have mercy on them. There are no other credible chains to support this story.<\/p>\n<p>Uthman al-Shuhham was considered reliable by some scholars, but plenty of others criticized and rejected his narrations. He narrated very few hadith as compared to other narrators, whom he usually narrated from Muslim ibn Abi Bakrah, and even fewer hadith from ‘Ikramah. He is in no way an agreed upon narrator.<\/p>\n<p>Al-Dhahabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال يحيى القطان يعرف من حديثه وينكر وقال النسائي ليس بالقوى<\/p>\n<p>Yahya al-Qattan said: His narrations are sometimes acknowledged or rejected. Al-Nasa’i said: He is not strong.<\/p>\n<p>Source: Mīzān al-I’tidāl 3\/60<\/p><\/blockquote>\n<p>And Al-Mughaltay writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقال أبو أحمد الحاكم عثمان بن مسلم أبو سلمة الشحام ليس بالمتين عندهم<\/p>\n<p>Abu Ahmad al-Hakim said Uthman ibn Muslim, Abu Salamah, is not solid in their view.<\/p>\n<p>Source: Ikmāl Tahdhīb al-Kamāl 9\/194<\/p><\/blockquote>\n<p>And Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكذا أبو أحمد وقال ليس بالمتين عندهم وقال الدارقطني بصري يعتبر به<\/p>\n<p>Likewise was said by Abu Ahmad that he is not solid in their view. Al-Daraqutni said he is a Basran in need of further consideration.<\/p>\n<p>Source: Tahdhīb al-Tahdhīb 7\/161<\/p><\/blockquote>\n<p>And Al-Arna’ut writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي عثمان كلام ينزله عن رتبة الصحيح<\/p>\n<p>There is a discussion on Uthman about lowering him from the level of soundness.<\/p>\n<p>Source: Takhrīj al-Musnad 34\/131<\/p><\/blockquote>\n<p>Ibn ‘Adi also mentioned him in his book of weak narrators, although he did not consider him weak per se, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عُثْمَانُ الشَّحَّامُ لَيْسَ لَهُ كَثِيرُ حَدِيثٍ وَمَا رَأَى بِهِ بَأْسًا فِي رِوَايَاتِهِ<\/p>\n<p>Uthman al-Shuhham does not have many traditions, but there is no objection seen in his narrations.<\/p>\n<p>Source: al-Kāmil fī Ḍuʻafā’ al-Rijāl 6\/293<\/p><\/blockquote>\n<p>However, just because Ibn ‘Adi saw nothing wrong in his narrations does not mean he considered him above scrutiny.<\/p>\n<p>Imam Muslim included only one narration of Uthman al-Shuhham from Muslim ibn Abi Bakrah in his Sahih collection. This indicates that Imam Muslim considered his chain from Ibn Abi Bakrah to be authentic, but he did not narrate his chain from ‘Ikramah. Thus, the presence of Uthman al-Shuhham in the Sahih does not mean every narration from him was considered authentic by Imam Muslim.<\/p>\n<p>Hence, the problematic hadith of the blind man is based on the authority of a questionable narrator, who narrated an unusually small number of hadith, who was criticized and rejected by some scholars, and whose narrations are otherwise not widely-regarded as legal evidence. On this basis alone, Muslims are not required at all to accept the authenticity of the story or the legal ruling it supports.<\/p>\n<p>If, for the sake of argument, Uthman al-Shuhham’s chain from &#8216;Ikramah is sound and the story is true, there are certainly missing details from the text that are needed to properly contextualize it. An anomalous (<em>shadh<\/em>) narration cannot overrule many more verses of the Quran and authentic hadith.<\/p>\n<p>It is a well-established rule in Islam that legal punishments such as executions, flogging, or imprisonment can only be carried out by executive authorities.<\/p>\n<p>Ibn Muflih writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحْرُمُ إقَامَةُ حَدٍّ إلَّا لِإِمَامٍ أَوْ نَائِبِهِ<\/p>\n<p>It is forbidden to establish a legal punishment unless it is done by the leader or his deputy.<\/p>\n<p>Source: al-Furū’ wa Taṣḥīḥ al-Furū’ 10\/29<\/p><\/blockquote>\n<p>And according to the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّفَقَ الْفُقَهَاءُ عَلَى أَنَّهُ لاَ يُقِيمُ الْحَدَّ إلا الإمام أَوْ نَائِبُهُ وَذَلِكَ لِمَصْلَحَةِ الْعِبَادِ وَهِيَ صِيَانَةُ أَنْفُسِهِمْ وَأَمْوَالِهِمْ وَأَعْرَاضِهِمْ<\/p>\n<p>The jurists came to a consensus that a legal punishment may not be implemented unless by the leader or his deputy. That is in the best interest of people, which is to safeguard their lives, their property, and their reputations.<\/p>\n<p>Source: al-Mawsū’at al-Fiqhīyah al-Kuwaytīyah 17\/144<\/p><\/blockquote>\n<p>This principle, known in the West as due process, is essential to civil society. Citing the hadith of the blind man to circumvent it is a very dangerous proposition.<\/p>\n<p>If the incident did in fact occur, then the slander (<em>waqi’<\/em>) and disparagement (<em>shatm<\/em>) committed by the woman must have been done in manner that was aiding or inciting enemy forces, as the Muslims in Medina at the time were fighting a defensive war against the idolaters of Mecca.<\/p>\n<p>Ibn Taymiyyah considered the possibility of this interpretation, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الوجه الثالث أن هذا وإن كان حدا فهو قتل حربي أيضا فصار بمنزلة قتل حربي تحتم قتله وهذا يجوز قتله لكل أحد<\/p>\n<p>A third view is that, if this was a legal punishment, then it was also the killing of a combatant. Thus, she had the status of an enemy combatant who must be killed. This type of killing is permissible for anyone.<\/p>\n<p>Source: al-Ṣārim al-Maslūl 1\/286<\/p><\/blockquote>\n<p>The Prophet (ṣ) did not kill people just for insulting him. Many people insulted him, cursed him, and harmed him, yet he was forgiving, patient, and forbearing. The <a href=\"https:\/\/abuaminaelias.com\/muslims-avoid-harming-people-with-their-words-and-deeds\/\">legal maxim of no-harm<\/a> requires that one can only harm others if it is necessary to avoid a greater harm.<\/p>\n<p>The Prophet (ṣ) also would not have allowed a man to designate himself as judge, jury, and executioner. If the Prophet (ṣ) did in fact pardon the man for killing his concubine, it could only have been in such a case that she was aiding or inciting the enemy. No one needs permission from authorities to fight or kill someone who is waging war against them.<\/p>\n<p>As for the legal implications of the hadith – the context in which it is usually cited – is it really necessary in Islam to punish blasphemers with death?<\/p>\n<p>Al-San’ani commented on the hadith of the blind man specifically, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ كَانَ مُسْلِمًا كَانَ سَبُّهُ لَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِدَّةً &#8230; وَنَقَلَ ابْنُ الْمُنْذِرِ عَنْ الْأَوْزَاعِيِّ وَاللَّيْثِ أَنَّهُ يُسْتَتَابُ<\/p>\n<p>If it was a Muslim who cursed the Prophet (ṣ) as an act of apostasy… it has been transmitted by Ibn al-Mundhir from Al-Awza’i and Al-Layth that they should be imprisoned until they repent.<\/p>\n<p>Source: Subul al-Salām 2\/384<\/p><\/blockquote>\n<p>Blasphemy committed by a Muslim, in the eyes of the jurists, was equal to treason or sedition, that is, incitement to violently overthrow the social order established upon Islamic law. However, some scholars, including the Caliph Umar (ra), lightened the sentence of apostasy in certain situations.<\/p>\n<p>Anas ibn Malik reported: I said, “O commander of the faithful, some people have turned renegade against Islam and joined the idolaters. What is to be done to them other than killing?” Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَنْ أَكُونَ أَخَذْتُهُمْ سِلْمًا أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ مِنْ صَفْرَاءَ أَوْ بَيْضَاءَ<\/p>\n<p>That I take hold of them on peaceful terms is more beloved to me than everything over which the sun rises, from the horizon to the zenith.<\/p><\/blockquote>\n<p>I said, “O commander of the faithful, what would you do if you took hold of them?” Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ عَارِضًا عَلَيْهِمُ الْبَابَ الَّذِي خَرَجُوا مِنْهُ أَنْ يَدْخُلُوا فِيهِ فَإِنْ فَعَلُوا ذَلِكَ قَبِلْتُ مِنْهُمْ وَإِلَّا اسْتَوْدَعْتُهُمُ السِّجْنَ<\/p>\n<p>I would offer them the door through which they exited, that they would enter it again. If they did so, I would accept it from them; otherwise I would keep them in prison.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 18696, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/13\/umar-riddah-murtad-silm\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ma’mar reported: Some residents of the peninsula told me that some people had embraced Islam, but it was not long until they became apostates. Maymun ibn Mihran wrote to Umar Ibn Abdul Aziz, may Allah have mercy on him, regarding them and Umar wrote back saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رُدَّ عَلَيْهِمُ الْجِزْيَةَ وَدَعْهُمْ<\/p>\n<p>Let them return to paying tribute and leave them alone.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 18102<\/p><\/blockquote>\n<p>&#8216;Amr ibn Qays reported: Ibrahim al-Nakha&#8217;i, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُرْتَدّ يُسْتَتَابُ أَبَدًا<\/p>\n<p>The apostate is imprisoned indefinitely until he repents.<\/p><\/blockquote>\n<p>And Sufyan al-Thawri said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا الَّذِي نَأْخُذُ بِهِ<\/p>\n<p>This is what we adhere to.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 18697<\/p><\/blockquote>\n<p>Abu Razin reported: Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تُحْبَسُ وَلَا تُقْتَلُ الْمَرْأَةُ تَرْتَدُّ<\/p>\n<p>The female apostate is imprisoned and is not killed for her apostasy.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 18731<\/p><\/blockquote>\n<p>Al-Layth reported: &#8216;Ata&#8217;, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُرْتَدَّةِ لَا تُقْتَلُ<\/p>\n<p>The female apostate is not killed.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 28995<\/p><\/blockquote>\n<p>Abu Harrah reported: Al-Hasan, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَرْأَةِ تَرْتَدُّ عَنِ الْإِسْلَامِ لَا تُقْتَلُ تُحْبَسُ<\/p>\n<p>The woman who renegades against Islam is not killed. She is imprisoned.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 28997<\/p><\/blockquote>\n<p>There was no absolute consensus that the death penalty was mandated in every case of apostasy or blasphemy, which indicates that it is more likely subject to discretionary punishment (<em>ta’zir<\/em>). The authorities can lighten the sentence if this is in the best interests of Muslim society and achieves the objectives of Islamic law, one of which is mercy for the creation.<\/p>\n<p>Ibrahim al-Nakha&#8217;i said specifically in the context of apostasy:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْرَءُوا الْحُدُودَ عَنِ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِذَا وَجَدْتُمْ لِلْمُسْلِمِ مَخْرَجًا فَادْرَءُوا عَنْهُ فَإِنَّهُ أَنْ يَخْطَأَ حَاكِمٌ مِنْ حُكَّامِ الْمُسْلِمِينَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يَخْطَأَ فِي الْعُقُوبَةِ<\/p>\n<p>Avoid legal punishments upon the Muslims as much as you can. If you find a way out for a Muslim, leave him to his way. For a Muslim judge to err in pardoning the criminal is better than to err in punishing him.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 18698<\/p><\/blockquote>\n<p>If blasphemy was committed by a non-Muslim, the jurists also did not agree that the death penalty was mandatory. Al-San’ani continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَعَنْ الْحَنَفِيَّةِ أَنَّهُ يُعَزَّرُ الْمُعَاهَدُ وَلَا يُقْتَلُ وَاحْتَجَّ الطَّحَاوِيُّ بِأَنَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَقْتُلْ الْيَهُودَ الَّذِي قَالُوا السَّامُّ عَلَيْك<\/p>\n<p>It is narrated from the Hanafi scholars that the covenanted person is given a discretionary punishment and is not killed. Al-Tahawi cited as evidence that the Prophet (ṣ) did not kill the Jews who came to him and they said (in a play on words): Death be upon you!<\/p>\n<p>Source: Subul al-Salām 2\/385<\/p><\/blockquote>\n<p>Indeed, one can find many instances in the biography of the Prophet (ṣ) when he was merciful, forgiving, and patient with those who directly insulted him.<\/p>\n<p>Aisha reported: A group of Jews asked permission to visit the Prophet and when they were admitted, they said, “Death be upon you!” I said to them, “Rather, death and the curse of Allah be upon you!” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الْأَمْرِ كُلِّهِ<\/p>\n<p><strong>O Aisha, Allah is gentle and he loves gentleness in all matters.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6528, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/16\/allah-is-kind-and-loves-kindness\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَائِشَةُ عَلَيْكِ بِالرِّفْقِ وَإِيَّاكِ وَالْعُنْفَ وَالْفُحْشَ<\/p>\n<p><strong>O Aisha, you must be gentle and beware of harsh and profane words.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5683, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Mercy and patience with blasphemy was the general rule applied by the Prophet (ṣ), while legal punishment was the exception only when it was compounded by high crimes of apostasy, treason, warfare, sedition, or incitement.<\/p>\n<p>In sum, the hadith of the blind man summarily killing his concubine without due process is a weak narration due to the doubtfulness of Uthman al-Shuhham. If the incident really did take place, then it can only be interpreted in accordance with moral and legal principles established by an enormity of other sound texts. No one may carry out legal punishments without properly constituted authority, and blasphemy by itself is not punishable with death.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;There are good reasons to question the authenticity of the hadith&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[383,437,133,342,25,49,38,404,316,54,55,444,58,115,62,103,431],"class_list":["post-21247","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-civil-protection-al-dhimmah","tag-concubines-al-surriyyah","tag-covenants","tag-al-fiqh","tag-forbearance-al-hilm","tag-gentleness-al-rifq","tag-imam-abu-hanifah","tag-legal-punishment-al-hudud","tag-medina-madinah","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-misconceptions","tag-patience-al-sabr","tag-people-of-the-book","tag-prophetic-biography-sirah","tag-public-welfare-al-maslaha","tag-slander-al-buhtan"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5wH","jetpack-related-posts":[{"id":16173,"url":"https:\/\/www.abuaminaelias.com\/islam-between-blasphemy-extremism\/","url_meta":{"origin":21247,"position":0},"title":"Islam between blasphemy and extremism","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Be patient over what they say...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12998,"url":"https:\/\/www.abuaminaelias.com\/islam-and-concubines\/","url_meta":{"origin":21247,"position":1},"title":"What does Islam teach about concubines?","author":"Abu Amina Elias","date":"March 27, 2013","format":false,"excerpt":"\"He may marry from your believing slave girls.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19511,"url":"https:\/\/www.abuaminaelias.com\/consent-marriage-concubines\/","url_meta":{"origin":21247,"position":2},"title":"Sexual Consent, Marriage, and Concubines in Islam","author":"Abu Amina Elias","date":"April 24, 2018","format":false,"excerpt":"\"...he may not touch her, lie with her, or have intercourse with her unless she consents.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23736,"url":"https:\/\/www.abuaminaelias.com\/custodianship-of-the-right-hand\/","url_meta":{"origin":21247,"position":3},"title":"Custodianship of the Right Hand: Concubinage, Rape, and &#8216;Sexual Slavery&#8217; in Islam","author":"Abu Amina Elias","date":"December 9, 2021","format":false,"excerpt":"\"This paper addresses the allegations...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19476,"url":"https:\/\/www.abuaminaelias.com\/ali-ibn-abi-talib-rape-girl\/","url_meta":{"origin":21247,"position":4},"title":"Did &#8216;Ali ibn Abi Talib rape an underage girl?","author":"Abu Amina Elias","date":"April 16, 2018","format":false,"excerpt":"\"Do not cause harm or return harm.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":24377,"url":"https:\/\/www.abuaminaelias.com\/touching-slave-girls-market\/","url_meta":{"origin":21247,"position":5},"title":"Touching slave girls in the market?","author":"Abu Amina Elias","date":"January 13, 2023","format":false,"excerpt":"\"Proper analysis of these narrations will demonstrate that there was nothing sexual about this practice.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21247","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21247"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21247\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21247"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21247"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21247"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}