{"id":21296,"date":"2019-09-25T18:47:42","date_gmt":"2019-09-25T14:47:42","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21296"},"modified":"2025-03-02T16:35:21","modified_gmt":"2025-03-02T12:35:21","slug":"principles-of-enjoining-good-forbidding-evil","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/principles-of-enjoining-good-forbidding-evil\/","title":{"rendered":"Whoever sees evil, change it with his hand"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Enjoining good and forbidding evil is one of the essential teachings of Islam. It is the pillar of a justly-ordered society and the guardian of true faith. Everyone is obligated to acknowledge good and reject evil in their hearts, at the very least.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ<\/p>\n<p><strong>Whoever among you sees evil, let him change it with his hand. If he is unable to do so, then with his tongue. If he is unable to do so, then with his heart, and that is the weakest level of faith<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 49, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/26\/whoever-sees-evil-change-it\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The lowest level of faith is to reject evil in one’s heart and it is an obligation at all times. As for changing evil with one’s tongue, or words, and with one’s hand, or by direct action, it is only an obligation for those who are able to carry out its duties according to proper methods, principles, and objectives.<\/p>\n<p>Ibn Rajab commented on the many hadith of this nature, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَدَلَّتْ هَذِهِ الْأَحَادِيثُ كُلُّهَا عَلَى وُجُوبِ إِنْكَارِ الْمُنْكَرِ بِحَسَبِ الْقُدْرَةِ عَلَيْهِ وَأَمَّا إِنْكَارُهُ بِالْقَلْبِ لَا بُدَّ مِنْهُ فَمَنْ لَمْ يُنْكِرْ قَلْبُهُ الْمُنْكَرَ دَلَّ عَلَى ذَهَابِ الْإِيمَانِ مِنْ قَلْبِهِ &#8230; وَأَمَّا الْإِنْكَارُ بِاللِّسَانِ وَالْيَدِ فَإِنَّمَا يَجِبُ بِحَسَبِ الطَّاقَةِ<\/p>\n<p>All of these traditions indicate that it is an obligation to condemn evil by the measure of one&#8217;s ability. As for condemnation in the heart, it is always required. Whoever does not condemn evil in his heart, it is a sign that faith has vanished from his heart&#8230; As for condemnation of the tongue and hand, it is only obligatory within one&#8217;s capacity.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/245<\/p><\/blockquote>\n<p>The scholars have said that enjoining good and forbidding evil is based upon three principles, or prerequisite and necessary conditions:<\/p>\n<ol>\n<li>Knowledge<\/li>\n<li>Gentleness<\/li>\n<li>Patience<\/li>\n<\/ol>\n<p>It is not appropriate for someone to enjoin good or forbid evil unless they have knowledge of Islamic rulings and their relevancy to real-life situations, they are able to be patient and forbearing with the harm this duty entails, and they are gentle with people as much as possible.<\/p>\n<p>Sufyan al-Thawri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَأْمُرُ بِالْمَعْرُوفِ وَلا يَنْهَى عَنِ الْمُنْكَرِ إِلا مَنْ كَانَ فِيهِ خِصَالٌ ثَلاثٌ رَفِيقٌ بِمَا يَأْمُرُ رَفِيقٌ بِمَا يَنْهَى عَدْلٌ بِمَا يَأْمُرُ عَدْلٌ بِمَا يَنْهَى عَالِمٌ بِمَا يَأْمُرُ عَالِمٌ بِمَا يَنْهَى<\/p>\n<p>No one may enjoin good or forbid evil except for one who has three qualities: gentleness in what he enjoins and forbids, justice in what he enjoins and forbids, and knowledge of what he enjoins and forbids.<\/p>\n<p>Source: al-Amr bil-Maʻrūf lil-Khallāl 1\/24<\/p><\/blockquote>\n<p>And Al-Qadi Abu Ya’la said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَأْمُرُ بِالْمَعْرُوفِ وَيَنْهَى عَنْ الْمُنْكَرِ إلَّا مَنْ كَانَ فَقِيهًا فِيمَا يَأْمُرُ بِهِ فَقِيهًا فِيمَا يَنْهَى عَنْهُ رَفِيقًا فِيمَا يَأْمُرُ بِهِ رَفِيقًا فِيمَا يَنْهَى عَنْهُ حَلِيمًا فِيمَا يَأْمُرُ بِهِ حَلِيمًا فِيمَا يَنْهَى عَنْهُ<\/p>\n<p>No one may enjoin good and forbid evil unless he understands what he enjoins and forbids, he is gentle in what he enjoins and forbids, and he shows forbearance in what he enjoins and forbids.<\/p>\n<p>Source: al-Amr bil Ma’rūf li-Ibn Taymīyyah 1\/21<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فلا بد من هذه الثلاثة العلم والرفق والصبر العلم قبل الأمر والنهي والرفق معه والصبر بعده<\/p>\n<p>One who enjoins good must have three qualities: knowledge, gentleness, and patience. Knowledge comes before it, gentleness comes during it, and patience comes after it.<\/p>\n<p>Source: al-Amr bil Ma’rūf li-Ibn Taymīyyah 1\/20<\/p><\/blockquote>\n<p>The scholars set these three conditions because, in addition to being mentioned many times in the Quran and Sunnah, they further facilitate the ultimate objective in Islam of reforming and purifying souls on their journey to Allah into the Hereafter. If someone tries to enjoin good while lacking one of these qualities, they will likely end up making the situation worse for themselves and others.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولهذا قيل ليكن أمرك بالمعروف ونهيك عن المنكر غير منكر وإذا كان هو من أعظم الواجبات والمستحبات فالواجبات والمستحبات لا بد أن تكون المصلحة فيها راجحة على المفسدة<\/p>\n<p>Based on this, it is said to let not your enjoining good and forbidding evil be evil itself. As it is among the greatest of obligatory and recommended deeds, thus the benefit of obligatory and recommended deeds must outweigh their harm.<\/p>\n<p>Source: al-Amr bil Ma’rūf li-Ibn Taymīyyah 1\/10<\/p><\/blockquote>\n<p>Being able to balance all considerations of time and place in sound knowledge, graceful patience, and compassionate gentleness is the essence of wisdom, as put by Ibn al-Qayyim:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحِكْمَةُ إِذًا فِعْلُ مَا يَنْبَغِي عَلَى الْوَجْهِ الَّذِي يَنْبَغِي فِي الْوَقْتِ الَّذِي يَنْبَغِي<\/p>\n<p>Wisdom is to act as one should, in the manner that one should, in the time that one should.<\/p>\n<p>Source: Madārij al-Sālikīn 3\/449<\/p><\/blockquote>\n<p>One who enjoins good should have a sound understanding of Islamic teachings on the issues at hand, in addition to the specific circumstances regarding people, their customs, their perceptions, and so on. Enjoining good is an act of worship done for the sake of Allah, so the good of it will be diminished or entirely nullified if it is done in ignorance.<\/p>\n<p>Umar ibn Abdul Aziz, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَعَبَّدَ بِغَيْرِ عِلْمٍ كَانَ مَا يُفْسِدُ أَكْثَرَ مِمَّا يُصْلِحُ<\/p>\n<p>Whoever worships without knowledge will cause more harm than good.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/01\/13\/action-without-knowledge-harmful\/\">Sunan al-Dārimī 308<\/a><\/p><\/blockquote>\n<p>One who enjoins good should be gentle to those whom he enjoins, meaning to only use such sternness or force as is necessary to achieve the desired outcome of reformation. The quality of gentleness makes the difference between a beautiful and graceful deed done for the sake of Allah, or an ugly and disgraceful deed done for the sake of one’s ego.<\/p>\n<p>Aisha reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الرِّفْقَ لَا يَكُونُ فِي شَيْءٍ إِلَّا زَانَهُ وَلَا يُنْزَعُ مِنْ شَيْءٍ إِلَّا شَانَهُ<\/p>\n<p><strong>Verily, kindness is not found in anything but that it beautifies it, and it is not removed from anything but that it disgraces it<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2594, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/03\/03\/rifq-beautiful-disgraceful\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) was very gentle and charitable whenever he needed to criticize or correct someone’s behavior. His habit was to make a general point of correction, without specifying or naming the person, in hopes of salvaging that person’s reputation. The reputations of the believers, like their lives and property, are sacred.<\/p>\n<p>Aisha reported: If the Prophet, peace and blessings be upon him, heard something bad about a man, he would not name them by saying, “What is the matter with this person that he says this?” Rather, the Prophet (ṣ) would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا بَالُ أَقْوَامٍ يَقُولُونَ كَذَا وَكَذَا<\/p>\n<p><strong>What is the matter with some people who say this<\/strong>?<\/p>\n<p>Source: Sunan Abī Dāwūd 4788, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/05\/hadith-on-manners-the-prophet-would-criticize-people-without-publicly-naming-them\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When further criticism was warranted to achieve the intended result, the Prophet (ṣ) would use mild and measured language to correct a person’s behavior. He would neither outright condemn Muslims or believers for their moral shortcomings, nor would he use foul, vulgar, offensive, or ugly language.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, would not revile others, he would not use profanity, and he would not curse others. If he wanted to criticize one of us, he would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا لَهُ تَرِبَ جَبِينُهُ<\/p>\n<p><strong>What is the matter with him? His forehead be dusted!<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5684, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/30\/how-prophet-criticized-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The companions likewise followed the Prophet’s (ṣ) example in correcting people as gently as they could, only being harsh with those who committed brazen sins and violations of other’s rights in public.<\/p>\n<p>Ahmad ibn Hanbal reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ أَصْحَابُ ابْنُ مَسْعُودٍ رضي الله عنه إِذَا مَرُّوا بِقَوْمٍ يَرَوْنَ مِنْهُمْ مَا يَكْرَهُونَ يَقُولُونَ مَهْلا رَحِمَكُمُ اللَّهُ<\/p>\n<p>The companions of Ibn Mas’ud, may Allah be pleased with him, if they passed by people from whom they saw something they disapproved, they would say: Take it easy, may Allah have mercy on you.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/12\/13\/ibn-masud-enjoining-gentle\/\">al-Amr bil-Maʻrūf lil-Khallāl 1\/25<\/a><\/p><\/blockquote>\n<p>And Imam Ahmad said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَأْمُرُ بِالرِّفْقِ وَالْخُضُوعِ إِنْ أَسْمَعُوهُ مَا يَكْرَهُ لَا يَغْضَبُ فَيَكُونُ يُرِيدُ يَنْتَصِرُ لِنَفْسِهِ<\/p>\n<p>One should enjoin good with gentleness and humility. If they make him hear what he dislikes, he should not get angry such that he wants to avenge himself.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/09\/25\/ahmad-enjoin-maruf-rifq\/\">al-Amr bil-Maʻrūf lil-Khallāl 1\/28<\/a><\/p><\/blockquote>\n<p>And he also said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">النَّاسُ مُحْتَاجُونَ إِلَى مُدَارَاةٍ وَرِفْقِ الْأَمْرِ بِالْمَعْرُوفِ بِلَا غِلْظَةٍ إِلَّا رَجُلًا مُعْلِنًا بِالْفِسْقِ فَلَا حُرْمَةَ لَهُ &#8230; يَأْمُرُ بِالرِّفْقِ وَالْخُضُوعِ فَإِنْ أَسْمَعُوهُ مَا يَكْرَهُ لَا يَغْضَبُ فَيَكُونُ يُرِيدُ يَنْتَصِرُ لِنَفْسِهِ<\/p>\n<p>People are in need of courtesy and gentleness in enjoining good, without harshness, except for a man who brazenly sins in public, for he has no sanctity.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/256<\/p><\/blockquote>\n<p>As for patience and forbearance, it was the quality of the Prophets, peace and blessings be upon them all, to endure the harms of their people to whom they delivered the message of Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ إِبْرَاهِيمَ لَحَلِيمٌ أَوَّاهٌ مُّنِيبٌ<\/p>\n<p><strong>Verily, Abraham was forbearing, compassionate, and repentant.<\/strong><\/p>\n<p>Surat Hud 11:75<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ<\/p>\n<p><strong>They said: We will surely be patient with the harm you cause us, and let them rely upon Allah those who would rely.<\/strong><\/p>\n<p>Surat Ibrahim 14:12<\/p><\/blockquote>\n<p>One who enjoins good must be gentle to avoid provoking the harmful reactions of those whom he enjoins, but it is to be expected that such harm is inevitable in some cases. This means that the believer should advise others and neither reciprocate their harm and insults, nor retaliate against them for the sake of his or her own ego.<\/p>\n<p>Amr ibn al-‘As, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْحَلِيمُ مَنْ يَحْلُمُ عَمَّنْ يَحْلُمُ عَنْهُ وَيُجَاهِلُ مَنْ جَاهَلَهُ وَلَكِنَّ الْحَلِيمَ مَنْ يَحْلُمُ عَمَّنْ يَحْلُمُ عَنْهُ وَيَحْلُمُ عَمَّنْ جَاهَلَهُ<\/p>\n<p>The truly forbearing one is not one who is forbearing to those who tolerate him but insults whoever insults him. Rather, the truly forbearing one is forbearing to both those who tolerate him and to those who insult him.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/12\/30\/amr-on-true-forbearance\/\">al-Mudārāh al-Nās 6<\/a><\/p><\/blockquote>\n<p>Artah ibn al-Mundhir, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُؤْمِنُ لَا يَنْتَصِرُ لِنَفْسِهِ يَمْنَعُهُ مِنْ ذَلِكَ الْقُرْآنُ وَالسُّنَّةُ فَهُوَ مُلْجَمٌ<\/p>\n<p>The believer does not take vengeance for himself. He is prevented from doing so by the Quran and Sunnah. He has been restrained.<\/p>\n<p>Source: al-Amr bil-Maʻrūf lil-Khallāl 1\/29<\/p><\/blockquote>\n<p>Enjoining good should always been done with a sincere intention for the sake of Allah, not as a pretext to vent personal grudges or any other egotistically driven motive. Sometimes one who enjoins good is motivated by hope of reward or fear of punishment, but an even better motive is good will and mercy towards the believers and the pure love of Allah and love for the sake of Allah.<\/p>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ الْأَمْرَ بِالْمَعْرُوفِ وَالنَّهْيَ عَنِ الْمُنْكَرِ تَارَةً يَحْمِلُ عَلَيْهِ رَجَاءُ ثَوَابِهِ وَتَارَةً خَوْفُ الْعِقَابِ فِي تَرْكِهِ وَتَارَةً الْغَضَبُ لِلَّهِ عَلَى انْتِهَاكِ مَحَارِمِهِ وَتَارَةً النَّصِيحَةُ لِلْمُؤْمِنِينَ وَالرَّحْمَةُ لَهُمْ وَرَجَاءُ إِنْقَاذِهِمْ مِمَّا أَوْقَعُوا أَنْفُسَهُمْ فِيهِ مِنَ التَّعَرُّضِ لِغَضَبِ اللَّهِ وَعُقُوبَتِهِ فِي الدُّنْيَا وَالْآخِرَةِ وَتَارَةً يَحْمِلُ عَلَيْهِ إِجْلَالُ اللَّهِ وَإِعْظَامُهُ وَمَحَبَّتُهُ &#8230; وَمَنْ لَحَظَ هَذَا الْمَقَامَ وَالَّذِي قَبْلَهُ هَانَ عَلَيْهِ كُلُّ مَا يَلْقَى مِنَ الْأَذَى فِي اللَّهِ تَعَالَى وَرُبَّمَا دَعَا لِمَنْ آذَاهُ<\/p>\n<p>Know that enjoining good and forbidding evil is at times done out of motivation to seek reward from Allah, at times done for the fear of His punishment for leaving it, at times done for anger for the sake of Allah in violating His sacred limits, at times done with good will for the believers, mercy for them, and hope in their salvation from what might afflict them of the wrath of Allah and His punishment in the world and in the Hereafter, and at times it is done out of motivation to glorify Allah, to honor Him, and to love Him&#8230; Whoever considers these last two positions, it will be easy for him every time he endures harm for the sake of Allah Almighty, and perhaps he will even supplicate for the benefit of those who harm him.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/255<\/p><\/blockquote>\n<p>Islam is based upon sincere good will (<em>nasihah<\/em>) towards the believers and human beings in general, which is to desire and intend good for them. Enjoining good always involves giving advice and therefore must be based on this type of sincerity. Believers should love for others what they love for themselves.<\/p>\n<p>Jarir ibn Abdullah reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ<\/p>\n<p>I pledged allegiance to the Messenger of Allah, peace and blessings be upon him, to establish prayer, to give charity, and to be sincere to every Muslim.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 57, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/11\/15\/bayaa-nasihah-all-muslims\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُؤْمِنِينَ قَوْمٌ نَصَحَةُ بَعْضِهِمْ لِبَعْضٍ مُتَوَادُّونَ وَإِنْ بَعَدَتْ دِيَارُهُمْ وَأَبْدَانُهُمْ وَإِنَّ الْمُنَافِقِينَ قَوْمٌ غَشَشَةُ بَعْضِهِمْ لِبَعْضٍ<\/p>\n<p>Verily, the believers are people with good will and love for each other, even if their lands and countries are far apart. The hypocrites are people with malevolence for each other.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/10\/03\/ali-nasihah-believers-good-will\/\">Tārīkh Dimashq 23310<\/a><\/p><\/blockquote>\n<p>Even when it comes to non-Muslims and unbelievers, Muslims should be merciful to them and present Islam to them in the best possible manner, as mercy and concern for all beings is at the heart of Allah’s message.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرَّاحِمُونَ يَرْحَمُهُمْ الرَّحْمَنُ ارْحَمُوا مَنْ فِي الْأَرْضِ يَرْحَمْكُمْ مَنْ فِي السَّمَاءِ<\/p>\n<p><strong>The merciful will be shown mercy by the Most Merciful. Be merciful to those on the earth and the One in the heavens will have mercy upon you<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1924, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/11\/16\/irhamu-man-fil-ard\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this regard, it should be appreciated that changing evil “with one’s hand” refers to <em>direct action<\/em> and not brute force or violence, unless defending oneself and others from aggression becomes legal and is necessary as a last resort.<\/p>\n<p>Imam Ahmad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّغْيِيرُ بِالْيَدِ لَيْسَ بِالسَّيْفِ وَالسِّلَاحِ<\/p>\n<p>Changing evil with one&#8217;s hand does not necessarily mean with a sword or weapons.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/248<\/p><\/blockquote>\n<p>At the same time, Muslims should not be reckless in enjoining good if it might bring excessive harm to oneself and others. This principle is most clearly understood in relation to tyrannical rulers. If one can safely correct their behavior and condemn their evil, without inciting a civil war or greater persecution, it is an obligation to do so. But if confronting the ruler would likely result in bodily harm to oneself and the community, it is no longer an obligation and may even be prohibited.<\/p>\n<p>Sa’id ibn Jubayr reported: I asked Ibn Abbas, may Allah be pleased with him, “Shall I enjoin good and forbid evil upon the ruler?” Ibn Abbas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ خِفْتَ أَنْ يَقْتُلَكَ فَلَا<\/p>\n<p>If you fear he will kill you, then no.<\/p><\/blockquote>\n<p>Then, I asked him again and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَفِيمَا بَيْنَكَ وَبَيْنَهُ<\/p>\n<p>If you must do so, then do it between you and him privately.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/09\/25\/ibn-abbas-confront-rulers\/\">al-Amr bil-Maʻrūf li-Ibn Abī Dunyā 80<\/a><\/p><\/blockquote>\n<p>Ibn Rajab commented on this narration, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْخُرُوجُ عَلَيْهِمْ بِالسَّيْفِ فَيُخْشَى مِنْهُ الْفِتَنُ الَّتِي تُؤَدِّي إِلَى سَفْكِ دِمَاءِ الْمُسْلِمِينَ نَعَمْ إِنْ خَشِيَ فِي الْإِقْدَامِ عَلَى الْإِنْكَارِ عَلَى الْمُلُوكِ أَنْ يُؤْذِيَ أَهْلَهُ أَوْ جِيرَانَهُ لَمْ يَنْبَغِ لَهُ التَّعَرُّضُ لَهُمْ حِينَئِذٍ لِمَا فِيهِ مِنْ تَعَدِّي الْأَذَى إِلَى غَيْرِهِ كَذَلِكَ قَالَ الْفُضَيْلُ بْنُ عِيَاضٍ وَغَيْرُهُ وَمَعَ هَذَا فَمَتَى خَافَ مِنْهُمْ عَلَى نَفْسِهِ السَّيْفَ أَوِ السَّوْطَ أَوِ الْحَبْسَ أَوِ الْقَيْدَ أَوِ النَّفْيَ أَوْ أَخْذَ الْمَالِ أَوْ نَحْوَ ذَلِكَ مِنَ الْأَذَى سَقَطَ أَمْرُهُمْ وَنَهْيُهُمْ وَقَدْ نَصَّ الْأَئِمَّةُ عَلَى ذَلِكَ مِنْهُمْ مَالِكٌ وَأَحْمَدُ وَإِسْحَاقُ وَغَيْرُهُمْ<\/p>\n<p>As for rebellion against the rulers with the sword, then it should be feared that they will cause trials leading to the shedding of Muslim blood. Yes, if it is feared that boldness in condemning the rulers will harm his people and his neighbors, it is not appropriate for him to confront them if it involves causing harm to others. Such was said by Al-Fudayl ibn &#8216;Iyad and others. Along with this, if he fears they will put him to the sword, or whip, or prison, or shackle, or banishment, or seizure of property, and other types of harm like that, then the obligation to enjoin good and forbid evil upon them is dropped. The Imams were explicit about that, among them Malik, Ahmad, Ishaq, and others.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/249<\/p><\/blockquote>\n<p>The issue of confronting tyrannical rulers best illustrates the need to wisely consider the harms and benefits of direct action or speech. There are plenty of examples in Islamic history, and human history in general, when zealous revolutionaries incited a civil war in their countries and made a very bad situation even worse than it had been before.<\/p>\n<p>Hasan al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ النَّاسَ إِذَا ابْتُلُوا مِنْ قِبَلِ سُلْطَانِهِمْ صَبَرُوا مَا لَبِثُوا أَنْ يُفْرَجَ عَنْهُمْ وَلَكِنَّهُمْ يَجْزَعُونَ إِلَى السَّيْفِ فَيُوَكَّلُونَ إِلَيْهِ فَوَاللَّهِ مَا جَاءُوا بِيَوْمِ خَيْرٍ قَطُّ<\/p>\n<p>If people had patience when they are afflicted with trials from their ruler, it would not be long before Allah gives them a way out. Yet they rush to their swords, so they are left to their swords. By Allah, not even for a single day did they bring any good.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/08\/hassan-left-to-their-swords\/\">al-Ṭabaqāt al-Kubrá 8789<\/a><\/p><\/blockquote>\n<p>This is not to say that confronting unjust authorities should never be done. On the contrary, it is among the best acts of jihad to <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/13\/greatest-jihad-word-haqq-truth\/\">speak truth to a tyrant<\/a> and it is an obligation for those who can reasonably do so. That said, the position of most scholars is that political violence almost always leads to greater evil than the original tyrant. The priority should be the pragmatic safety and well-being of the community, not an abstract commitment to a ruling ideology or Utopian society.<\/p>\n<p>Enjoining good and forbidding evil is a trial, so it should not be rushed into without the prerequisite faith, knowledge, and character. A believer ends up harming themselves or others when they confront a trial without being prepared to endure it or manage its fallout.<\/p>\n<p>Hudhayfah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ<\/p>\n<p><strong>It is not befitting for a believer to humiliate himself.<\/strong><\/p><\/blockquote>\n<p>They said, “How does he humiliate himself?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَتَعَرَّضُ مِنْ الْبَلَاءِ لِمَا لَا يُطِيقُ<\/p>\n<p><strong>He confronts a trial he cannot endure.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2254, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/02\/05\/believers-not-seek-hardship\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Rajab commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّمَا يَدُلُّ عَلَى أَنَّهُ إِذَا عَلِمَ أَنَّهُ لَا يُطِيقُ الْأَذَى وَلَا يَصْبِرُ عَلَيْهِ فَإِنَّهُ لَا يَتَعَرَّضُ حِينَئِذٍ لِلْآمِرِ وَهَذَا حَقٌّ<\/p>\n<p>Indeed, it only indicates that if one knows he cannot endure the harm and be patent with it, then in that case one who would enjoin good should not confront it. This is the truth.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/251<\/p><\/blockquote>\n<p>Lastly, it is a fact that we will sometimes be confronted with evil that we have no power to change at all, whether it is because we as individuals are in a weak position, or the community as a whole is failing in the collective obligation to forbid evil, or the supporters of evil are too numerous to counter. In such a case, the least we can do, and perhaps the only thing we can do, is to hate the evil we see in our hearts.<\/p>\n<p>Umm Salamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَتَكُونُ أُمَرَاءُ فَتَعْرِفُونَ وَتُنْكِرُونَ فَمَنْ عَرَفَ بَرِئَ وَمَنْ أَنْكَرَ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ<\/p>\n<p><strong>There will be rulers from whom you will see both goodness and corruption. One who recognizes their evil and hates it will maintain his innocence, but one who is pleased with it and follows them will be sinful.<\/strong><\/p><\/blockquote>\n<p>It was said, “Shall we not fight them?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا مَا صَلَّوْا<\/p>\n<p><strong>No, as long as they pray.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1854, Grade: <strong><em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/09\/15\/hadith-on-tyranny-whoever-sees-an-unjust-ruler-and-hates-his-evil-will-maintain-his-innocence\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُوشِكُ مَنْ عَاشَ مِنْكُمْ أَنْ يَرَى مُنْكَرًا لا يَسْتَطِيعُ فِيهِ غَيْرَ أَنْ يَعْلَمَ اللَّهُ مِنْ قَلْبِهِ أَنَّهُ لَهُ كَارِهٌ<\/p>\n<p>Soon one of you who lives long enough will see evil he cannot change, yet Allah knows that he hates it in his heart.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/12\/13\/ibn-masud-evil-hate-heart\/\">al-Amr bil-Maʻrūf li-Ibn Abī Dunyā 79<\/a><\/p><\/blockquote>\n<p>In sum, enjoining good and forbidding evil should only be done by those who can do so with a sincere intention, knowledge, gentleness, patience, and forbearance. It is only an obligation upon Muslims in so far as they are able to properly effect change, although true believers must always hate evil in their heart. Enjoining good involves the careful consideration of priorities, benefits, and harms, with the objective being to protect the Muslim community’s physical, mental, and spiritual well-being in this life and in the Hereafter.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever among you sees evil, let him change it with his hand.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[167,13,61,16,17,18,456,168,446,25,49,27,330,388,32,352,104,95,39,43,246,48,50,51,52,100,54,55,58,196,395,103,365,64,65,390,457,91,70,220,447,179],"class_list":["post-21296","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-abraham-ibrahim","tag-anger-al-ghadhab","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-community-jamaah","tag-corruption-al-fasad","tag-enjoin-good-amr-bil-maruf","tag-al-fitnah","tag-forbearance-al-hilm","tag-gentleness-al-rifq","tag-god-fearing-taqwa","tag-good-will-naseehah","tag-harm-al-darar","tag-hereafter-akhirah","tag-hope-al-raja","tag-humility-al-tawaduh","tag-hypocrisy-al-nifaq","tag-imam-ahmad-ibn-hanbal","tag-imam-malik","tag-intention-al-niyyah","tag-justice-adl","tag-knowledge","tag-leadership-imamate","tag-love-al-mahabbah","tag-manners-al-adab","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-patience-al-sabr","tag-prophetic-virtues","tag-prophets-al-anbiya","tag-public-welfare-al-maslaha","tag-recommendation-al-mustahab","tag-reform-islah","tag-reliance-tawakkul","tag-reputation-al-ard","tag-revenge","tag-righteous-predecessors-al-salaf-al-salih","tag-sincerity-al-ikhlaas","tag-supplication-al-dua","tag-trials-al-balaa","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5xu","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":21296,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":21296,"position":1},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14049,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-seculsion-in-the-mosque-during-ramadan-itikaf\/","url_meta":{"origin":21296,"position":2},"title":"Imam al-Nawawi on Spiritual Retreat in Ramadan, al-I’tikaf","author":"Abu Amina Elias","date":"July 14, 2013","format":false,"excerpt":"\"The Prophet seeks seclusion in the last ten nights.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":21296,"position":3},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":21296,"position":4},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":21296,"position":5},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21296","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21296"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21296\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21296"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21296"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21296"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}