{"id":21323,"date":"2019-09-27T14:12:00","date_gmt":"2019-09-27T10:12:00","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21323"},"modified":"2020-07-17T22:03:25","modified_gmt":"2020-07-17T18:03:25","slug":"where-wall-yajuj-majuj","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/where-wall-yajuj-majuj\/","title":{"rendered":"Where is the wall of Gog and Magog?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>One of the signs of the Hour to occur near the end of time is the emergence of two powerful nations known as Gog and Magog (<em>Ya’juj wa Ma’juj<\/em>). Their trial will cause much harm to the people of the earth. The Quran also describes the righteous ruler Dhul al-Qarnayn as building a wall to prevent them from emerging.<\/p>\n<p>If Gog and Magog are still behind the wall mentioned in the Quran, where are they today and where is their wall?<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَتَّىٰ إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ وَجَدَ مِن دُونِهِمَا قَوْمًا لَّا يَكَادُونَ يَفْقَهُونَ قَوْلًا قَالُوا يَا ذَا الْقَرْنَيْنِ إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِي الْأَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلَىٰ أَن تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ فَأَعِينُونِي بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا آتُونِي زُبَرَ الْحَدِيدِ ۖ حَتَّىٰ إِذَا سَاوَىٰ بَيْنَ الصَّدَفَيْنِ قَالَ انفُخُوا ۖ حَتَّىٰ إِذَا جَعَلَهُ نَارًا قَالَ آتُونِي أُفْرِغْ عَلَيْهِ قِطْرًا فَمَا اسْطَاعُوا أَن يَظْهَرُوهُ وَمَا اسْتَطَاعُوا لَهُ نَقْبًا قَالَ هَٰذَا رَحْمَةٌ مِّن رَّبِّي ۖ فَإِذَا جَاءَ وَعْدُ رَبِّي جَعَلَهُ دَكَّاءَ ۖ وَكَانَ وَعْدُ رَبِّي حَقًّا<\/p>\n<p><strong>Until when he reached a pass between two mountains, he found people who could hardly understand his words. They said, ‘O Dhul Qarnayn, Gog and Magog are causing corruption in the land. Shall we pay you tribute if you build a barrier between us?’ He said, ‘What my Lord has established for me is better, but help me with labor. I will make a dam between you. Bring me sheets of iron,’ until he had leveled them between the two mountain walls. He said, ‘Blow,’ until he had made it like fire. He said, ‘Bring it to me that I will may molten copper over it.’ Thus, Gog and Magog were unable to pass over it, nor were they able to penetrate it. He said, ‘This is a mercy from my Lord, but when the promise of my Lord comes, He will make it level; the promise of my Lord is ever true.’<\/strong><\/p>\n<p>Surat al-Kahf 18:93-99<\/p><\/blockquote>\n<p>Some people interpret Dhul al-Qarnayn’s prediction of the wall collapsing as the emergence of Gog and Magog near the end of time. However, other scholars interpreted this prediction as an event that has already occurred.<\/p>\n<p>Ibn Khaldun writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي وسط هذا الجزء التّاسع هو السّدّ الّذي بناه الإسكندر كما قلناه والصّحيح من خبره في القرآن<\/p>\n<p>In the ninth part of this kingdom lies the wall built by Alexander, as we have said, and the truth of the matter is reported in the Quran.<\/p>\n<p>Source: Tārīkh Ibn Khaldūn 1\/100<\/p><\/blockquote>\n<p>Indeed, there is evidence from the Sunnah that the wall was already beginning to crumble in the time of the Prophet (ṣ).<\/p>\n<p>Zaynab bint Jahsh reported: The Prophet, peace and blessings be upon him, came to visit me one day while he was frightened and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ<\/p>\n<p><strong>There is no God but Allah! Woe to the Arabs from an evil drawing near! An opening has been made today in the barrier Gog and Magog like this.<\/strong><\/p><\/blockquote>\n<p>The Prophet made a circle with this thumb and finger. I said, “O Messenger of Allah, will we perish while there are still righteous people among us?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ إِذَا كَثُرَ الْخَبَثُ<\/p>\n<p><strong>Yes, if wickedness prevails<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3168, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/20\/hadith-on-magog-the-righteous-will-perish-when-evil-dominates-the-world\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For this reason, some scholars considered the event mentioned by Dhul al-Qarnayn to be related to the catastrophic invasion of Muslim lands by the Mongols and Tartars, a disaster from which the strength of the Muslim world never fully recovered.<\/p>\n<p>Ibn &#8216;Ashur commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يُعْرَفُ بِالضَّبْطِ وَقْتُ انْطِلَاقِهِمْ مِنْ بِلَادِهِمْ وَلَا سَبَبُ ذَلِكَ وَيُقَدَّرُ أَنَّ انْطِلَاقَهُمْ كَانَ أَوَاخِرَ الْقَرْنِ السَّادِسِ الْهِجْرِيِّ وَتَشَتَّتُ مُلْكِ الْعَرَبِ بِأَيْدِي الْمَغُولِ وَالتَّتَرِ مِنْ خُرُوجِ جَنْكِيزْ خَانَ الْمَغُولِيِّ وَاسْتِيلَائِهِ عَلَى بُخَارَى سَنَةَ سِتَّ عَشْرَةَ وَسِتِّمَائَةٍ مِنَ الْهِجْرَةِ<\/p>\n<p>It is not known exactly what time they would be released from their lands, nor the cause of it. It is estimated that their release was during the latter of the sixth century Hijri. The Arab kingdoms were scattered at the hands of the Mongols and Tartars since the emergence of Ghengis Khan and his occupation of Bukhara in the year 616 Hijri.<\/p>\n<p>Source: al-Taḥrīr wal-Tanwīr 17\/33<\/p><\/blockquote>\n<p>There is an opinion that the prediction of Dhul al-Qarnayn and the emergence of Gog and Magog are the same event. They believe that the wall still exists and is holding back these nations until today. This belief seemed more plausible when the world had not been so thoroughly explored as it has been now. With no physical evidence to suggest its continued existence in our times, it is worth considering whether or not this belief is required by the Quran and Sunnah.<\/p>\n<p>As an alternative explanation, some scholars have suggested that the collapse of the wall and their emergence near the end of time are two separate events. The wall has already been destroyed and Gog and Magog went through it, while they and their predecessors will emerge again one last time before the Hour.<\/p>\n<p>Shaykh al-Sa’di wrote a treatise on this topic specifically, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أن انفتاح يأجوج ومأجوج وخروجهم الابتدائي قد وقع وحصل منهم الإفساد في الأرض على الناس عموماً وعلى المسلمين والعرب خصوصاً كفتنة التتار في المشرق وغزوات المجار في بلاد أوربه وأن خروجهم في آخر الزمان الموصوف في حديث النواس بن سمعان بعد فتنة المسيح الدجال لا يدل على أنهم لم يخرجوا قبل ذلك إذ المراد بالخروج التحول من محل إلى محلٍ آخر وليس ابتداء الخروج<\/p>\n<p>The opening of Gog and Magog and their first emergence has already happened, and they caused corruption on the earth against people generally, and against Muslims and Arabs specifically, such as the trials of the Tartars, in the east, and the battles in European lands. Their emergence at the end of time, as described in the tradition of Al-Nawwas ibn Sim’an, is after the trial of the False Messiah. There is no indication that they have not emerged before that, as the meaning of ‘emerge’ is to transfer from one location to another. It will not be the first time they have emerged.<\/p>\n<p>Source: Risālatān fī Fitnat al-Dajjāl wa Yājūj wa Mājūj 1\/51-52<\/p><\/blockquote>\n<p>Some scholars cite a tradition on the authority of Abu Huraira as evidence the wall still exists, that the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ يَأْجُوجَ وَمَأْجُوجَ لَيَحْفِرُونَ السَّدَّ كُلَّ يَوْمٍ حَتَّى إِذَا كَادُوا يَرَوْنَ شُعَاعَ الشَّمْسِ قَالَ الَّذِي عَلَيْهِمْ ارْجِعُوا فَسَتَحْفِرُونَهُ غَدًا فَيَعُودُونَ إِلَيْهِ كَأَشَدِّ مَا كَانَ حَتَّى إِذَا بَلَغَتْ مُدَّتُهُمْ<\/p>\n<p>Verily, Gog and Magog are digging at the wall every day until they almost see the rays of the sun. One of them says: Go back and we will dig tomorrow. They return to it even stronger than before until their term arrives.<\/p>\n<p>Source: Musnad Aḥmad 10632<\/p><\/blockquote>\n<p>They consider the chain of authorities for this tradition to be authentic. However, Shaykh al-Wadi’i mentioned this tradition in his book of traditions with authentic chains but hidden defects in their text. This requires a high level of mastery over the prophetic traditions to be able to notice such defects. He cites Ibn Kathir, who said that it contradicts the Quran:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإسناده جيد قوي ولكن متنه في رفعه نكارة لان ظاهر الآية يقتضي أنهم لم يتمكنوا من ارتقائه ولا من نقبه لإحكام بنائه وصلابته وشدته ولكن هذا قد روي عن كعب الأحبار &#8230; ولعل أبا هريرة تلقاه من كعب فانه كان كثيراً ما كان يجالسه ويحدثه فحدث به أبو هريرة فتوهم بعض الرواة عنه انه مرفوع فرفعه والله اعلم<\/p>\n<p>Its chain is very good and strong, but there is a defect in its content because the verse apparently necessitates that they did not have power to overcome its elevation, nor penetrate it, due to the perfection of its foundation, firmness, and strength. Rather, this tradition was narrated from Ka’b al-Ahbar… Perhaps Abu Huraira received it from Ka’b, for there were many who sat with him and narrated from him, so Abu Huraira narrated it and some of the sub-narrators mistakenly thought he attributed it to the Prophet (ṣ) and so they did as well. Allah knows best.<\/p>\n<p>Source: Aḥādīth Mu’allah Ẓāhiruhā al-Ṣiḥḥah 1\/427<\/p><\/blockquote>\n<p>As Ka’b al-Ahbar was an authority on the Israelite traditions (<em>isra’iliyyat<\/em>), it is possible that it originated from his study of Jewish and Christian scriptures, and it was later accidentally attributed to the Prophet (ṣ). In that case, it cannot be considered as strong enough evidence to establish an obligatory belief in Islamic creed.<\/p>\n<p>In sum, the Quran and Sunnah do not necessitate the belief that the wall currently exists with Gog and Magog still behind it. Some scholars have understood these divinely-revealed texts as referring to two distinctly different events. The wall has long been destroyed, even though these powerful nations still have yet to reappear at the end of time.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;When the promise of my Lord comes, He will make it level.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[456,418,459,411,54,444,45,405,393],"class_list":["post-21323","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-corruption-al-fasad","tag-false-messiah-al-masiha-al-dajjal","tag-gog-magog-yajuj-wa-majuj","tag-israelites-banu-israil","tag-mercy-al-rahmah","tag-misconceptions","tag-quran-exegesis-tafsir","tag-signs-of-the-hour-ashrat-al-saah","tag-warning-al-nadhr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5xV","jetpack-related-posts":[{"id":22759,"url":"https:\/\/www.abuaminaelias.com\/999-of-1000-in-hellfire\/","url_meta":{"origin":21323,"position":0},"title":"Only one out of 1000 are in Paradise?","author":"Abu Amina Elias","date":"December 29, 2020","format":false,"excerpt":"\"Of every thousand, nine hundred and ninety-nine...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20171,"url":"https:\/\/www.abuaminaelias.com\/thamud-historical-error-quran\/","url_meta":{"origin":21323,"position":1},"title":"Thamud is an historical error in the Quran?","author":"Abu Amina Elias","date":"February 10, 2019","format":false,"excerpt":"\"The Quran does not make any claim about the historicity of specific sites,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23075,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-committing-to-the-quran-reciting-pleasantly\/","url_meta":{"origin":21323,"position":2},"title":"Imam al-Mundhiri on Committing to the Quran, Reciting Pleasantly","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Strive to remember the Quran, for it is quicker to escape the hearts of men than camels.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13539,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-reading-the-quran\/","url_meta":{"origin":21323,"position":3},"title":"Imam al-Nawawi on Reading and Reciting the Quran","author":"Abu Amina Elias","date":"May 16, 2013","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21204,"url":"https:\/\/www.abuaminaelias.com\/textual-corruption-of-surat-al-asr\/","url_meta":{"origin":21323,"position":4},"title":"Textual corruption of Surat al-‘Asr?","author":"Abu Amina Elias","date":"September 18, 2019","format":false,"excerpt":"\"By the time and calamities of age!\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23070,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-recitation-quran\/","url_meta":{"origin":21323,"position":5},"title":"Imam al-Mundhiri on Reciting the Quran","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21323","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21323"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21323\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21323"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21323"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21323"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}