{"id":21405,"date":"2019-10-30T13:56:27","date_gmt":"2019-10-30T09:56:27","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21405"},"modified":"2020-07-18T07:01:13","modified_gmt":"2020-07-18T03:01:13","slug":"was-the-universe-created-by-chance","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/was-the-universe-created-by-chance\/","title":{"rendered":"Was the universe created by chance?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Perhaps the most compelling proof for the existence of the Creator is the presence of many manifestations of design in creation. We can look at all of the wonders around us and intuitively understand that they were brought into being by an agent for a reason. This is known as the <em>teleological argument<\/em>, or argument from design.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ<\/p>\n<p><strong>Verily, in the creation of the heavens and earth, and the changing of night and day, are signs for those who understand, who remember Allah while standing, sitting, or lying on their sides and reflect upon the creation of the heavens and earth, saying: Our Lord, You have not created this all without purpose. Glory be to You, so save us from the punishment of Hellfire.<\/strong><\/p>\n<p>Surat Ali ‘Imran 3:190-191<\/p><\/blockquote>\n<p>The signs of Allah in creation are literally endless. They extend from the farthest reaches of the universe – the celestial bodies, stars, and galaxies – to the innermost components of our being – our consciousness, physical bodies, and even our DNA.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ<\/p>\n<p><strong>We will show them Our signs in the horizons and within themselves until it is clear to them that it is the Truth. Is it not enough that your Lord is a witness over all things?<\/strong><\/p>\n<p>Surat Fussilat 41:53<\/p><\/blockquote>\n<p>The only reasonable conclusion to make is that the universe was designed by the Creator, who has the perfect attributes of absolute knowledge, wisdom, and power.<\/p>\n<p>Al-Razi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ الْإِقْرَارَ بِوُجُودِ الصَّانِعِ بَدِيهِيٌّ هُوَ أَنَّ الْفِطْرَةَ شَاهِدٌ بِأَنَّ حُدُوثَ دَارٍ مَنْقُوشَةٍ بِالنُّقُوشِ الْعَجِيبَةِ مَبْنِيَّةٍ عَلَى التَّرْكِيبَاتِ اللَّطِيفَةِ الْمُوَافِقَةِ لِلْحُكْمِ وَالْمَصْلَحَةِ يَسْتَحِيلُ إِلَّا عِنْدَ وُجُودِ نَقَّاشٍ عَالِمٍ وَبَانٍ حَكِيمٍ<\/p>\n<p>The establishment of the existence of the Maker intuitively is that human nature bears witness that the occurrence of a designed abode with wondrous designs, built upon subtle components in harmony with wisdom and benefits, is impossible unless there existed One with knowledge and obvious wisdom to design it.<\/p>\n<p>Source: Tafsīr al-Rāzī 14:10<\/p><\/blockquote>\n<p>Highlighting the signs of the Creator in creation is the preferred method of arguing for the indisputable power of Allah, because it requires no special theological or philosophical training, it conforms intuitively to human nature, and it is accessible to every human being. The Quran focuses on this method over other arguments for the existence of the Creator.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إثْبَاتُ الصَّانِعِ بِطَرِيقِ الْآيَاتِ هُوَ الْوَاجِبَ كَمَا نَزَلَ بِهِ الْقُرْآنُ وَفَطَرَ اللَّهُ عَلَيْهِ عِبَادَهُ وَإِنْ كَانَتْ الطَّرِيقَةُ الْقِيَاسِيَّةُ صَحِيحَةً لَكِنَّ فَائِدَتَهَا نَاقِصَةٌ &#8230; فَالْمَخْلُوقَاتُ كُلُّهَا آيَاتٌ لِلْخَالِقِ<\/p>\n<p>Affirming the Creator by means of signs is an obligation, as it has been revealed in the Quran and Allah has made it instinctual to His servants. Though deductive arguments may be correct, their usefulness is lacking… For everything in creation is a sign of the Creator.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/48<\/p><\/blockquote>\n<p>And Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذِهِ الْأَنْهَارُ السَّارِحَةُ مِنْ قطر إلى قطر للمنافع وَمَا ذَرَأَ فِي الْأَرْضِ مِنَ الْحَيَوَانَاتِ الْمُتَنَوِّعَةِ والنبات المختلف الطعوم والأرايج وَالْأَشْكَالِ وَالْأَلْوَانِ مَعَ اتِّحَادِ طَبِيعَةِ التُّرْبَةِ وَالْمَاءِ استدل على وُجُودَ الصَّانِعِ وَقُدْرَتَهُ الْعَظِيمَةَ وَحِكْمَتَهُ وَرَحْمَتَهُ بِخَلْقِهِ وَلُطْفَهُ بِهِمْ وَإِحْسَانَهُ إِلَيْهِمْ وَبِرَّهُ بِهِمْ لَا إِلَهَ غَيْرُهُ وَلَا رَبَّ سِوَاهُ، عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ وَالْآيَاتُ فِي الْقُرْآنِ الدَّالَّةُ عَلَى هذا المقام كثيرة جدا<\/p>\n<p>The running rivers that travel from area to area with benefit, and what Allah has produced from the earth of various animals and plants of different tastes, scents, shapes, and colors, and the unity of the soil and water; all this demonstrates the existence of the Creator and His awesome power, His wisdom and mercy with His creation, His kindness, good treatment, and benevolence with them. There is no God besides Him. There is no Lord like Him. I depend upon Him and I turn to Him. The verses in the Quran indicating this are very plentiful.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 2:21<\/p><\/blockquote>\n<p>This line of thinking is enough for most people to arrive at knowledge and recognition of the Creator, His limitless power, and His absolute right to be worshiped alone without any partner.<\/p>\n<p>However, the philosophers and atheists will counter the teleological argument by proposing that the universe came into being by a chance occurrence of blind natural forces. One of their favorite examples is the so-called ‘infinite monkey theorem,’ which is the idea that if a monkey were to press random keys on a typewriter for an infinite amount of time, he would eventually produce the works of famed English playwright William Shakespeare. This theorem is invalid for two reasons, theoretical and practical: 1), an actual infinite cannot exist in the contingent universe, and 2) the odds of the monkey producing even a small portion of Shakespeare’s work is infinitesimally small and therefore equivalent to zero.<\/p>\n<p>Mathematicians from Aristotle until today hold that an <em>actual infinite<\/em>, which is a completed series of natural numbers, is impossible in the real world. Any series of natural numbers that exists can always be continued by adding one more number, which means it will always remain incomplete, but infinite is by definition complete. In contrast, an incomplete, never-ending series is called a theoretical or <em>potential infinite<\/em>, which exists as an abstract concept but has no tangible manifestation.<\/p>\n<p>Al-Ghazali, in his refutation of the philosophers, asks us to consider the revolution of the planets around the sun. At any given time, the natural number of their revolutions is either even or odd. It cannot be neither even or odd, nor both even and odd at the same time. Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أن دورات الفلك إن لم تكن متناهية فهي إما شفع وإما وتر وإما لا شفع ولا وتر وإما شفع ووتر معاً وهذه الأقسام الأربعة محال فالمفضي إليها محال إذ يستحيل عدد لا شفع ولا وتر أو شفع ووتر<\/p>\n<p>If the revolution of celestial bodies have no end, then they are numbered as even, odd, neither, or both. These four cases are not possible, so what they necessitate is also not possible. For it is impossible that a number is neither even nor odd, or even and odd simultaneously.<\/p>\n<p>Source: al-Iqtiṣād fī al-I’tiqād 1:28-29<\/p><\/blockquote>\n<p>An actual infinite is by definition neither even nor odd, a state of being that cannot exist in nature. This contradiction means that an actual infinite is impossible.<\/p>\n<p>The infinite monkey theorem is predicated on the incorrect assumption that the monkey can complete an actual infinite series of key presses. However, the monkey can never reach infinite because he can always press one more key. The monkey is only a potential infinite, an imaginary number that has no basis in concrete reality. The universe simply cannot contain an actual infinite, nor can it be one itself.<\/p>\n<p>Moreover, the infinite monkey theorem is further invalidated when one considers the practical magnitude of the randomness involved. The first page of Shakespeare’s famous play Romeo &amp; Juliet contains 1,972 characters including spaces and punctuation. An English typewriter has 26 letters, a comma, a period, a semicolon, two brackets, and the space key, for a total of 32 characters, all of which are used on the first page of Romeo &amp; Juliet.<\/p>\n<p>The odds of the monkey pressing the correct key on the first attempt is 1 out of 32, the second attempt is 1 out of 1,024 (1\/32 x 1\/32), and the third attempt is 1 out of 32,768 (1\/32 x 1\/32 x 1\/32). In other words, the monkey will fail 32,767 times to get even the first three characters correct. The odds of failure increase exponentially with each subsequent character. If we extrapolate this out to the 1,972 characters on the first page, the odds of the monkey getting it right are less than roughly 1 out of 10 the 1000<sup>th <\/sup>power.<\/p>\n<p>To put this in perspective, the monkey will only produce the <em>first page<\/em> of Romeo &amp; Juliet one time after 10¹°°° attempts, which is 1 followed by a thousand zeroes. This number is so minuscule that there exists no word in our scientific language to describe it, because nothing in the universe manifests at this level of magnitude. Scientists estimate that there are about 3.28 x 10⁸° particles (protons, electrons, etc.) in the entire visible universe (46.5 billion light-years across). We simply know of no smaller order of magnitude than this, but it is not even remotely close to the chances of the monkey typing a single page of Shakespeare. In mathematics, a number so infinitesimally small is considered <em>negligible<\/em> in any formula, which means it functions as if it were zero or nothing.<\/p>\n<p>The fact is that the monkey will never reach infinite in the real world and he will never randomly produce the complexity needed to write even one page of Shakespeare, let alone his entire corpus. If the words of a man cannot be created by chance, how can it be true for the entire universe in all of its glory, its celestial bodies, its creatures, and its endless wonders?<\/p>\n<p>The philosophers and atheists will also counter the teleological argument from another angle, by proposing purely naturalistic causes to explain clear instances of design in creation. That is, they will claim that either the universe was indeed designed, but by ‘nature’ and not Allah, or that the universe was not designed at all.<\/p>\n<p>Ibn al-Qayyim responds to the first point in this manner:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اخبريني عَن هَذِه الطبيعة اهي ذَات قَائِمَة بِنَفسِهَا لَهَا علم وقدرة على هَذِه الافعال العجيبة ام لَيست كَذَلِك بل عرض وَصفَة قَائِمَة بالمطبوع تَابِعَة لَهُ مَحْمُولَة فِيهِ فَإِن قَالَت لَك بل هِيَ ذَات قَائِمَة بِنَفسِهَا لَهَا الْعلم التَّام وَالْقُدْرَة والارادة وَالْحكمَة فَقل لَهَا هَذَا هُوَ الْخَالِق البارئ المصور فَلم تسمينه طبيعية<\/p>\n<p>Tell me about this nature: Does it sustain itself? Does it have knowledge and power over these wondrous actions? Or is it not like that but rather it only appears to inherently sustain itself? If they say it surely sustains itself and has complete knowledge, power, will, and wisdom, then say to them that this is the Creator, the Designer, the Fashioner, so why do you refer to Him as nature?<\/p>\n<p>Source: Miftāḥ Dār al-Sa&#8217;ādah 1\/261<\/p><\/blockquote>\n<p>If they say ‘nature’ exhibits the attributes of Allah, such as absolute will, knowledge, power, and wisdom, then they are simply describing the reality of Allah without crediting Him as the Creator. Ibn Taymiyyah notes that the presence of these attributes in creation reflects their perfect existence within the Creator:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا ثَبَتَ لِلْمَخْلُوقِ مِنْ الْكَمَالِ الَّذِي لَا نَقْصَ فِيهِ كَالْحَيَاةِ وَالْعِلْمِ وَالْقُدْرَةِ فَالْخَالِقُ أَوْلَى بِذَلِكَ مِنْهُ<\/p>\n<p>Whatever is affirmed in the creation of intact attributes, which have no deficiency, such as life, knowledge, and ability, then the Creator is more worthy of these than them.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/48<\/p><\/blockquote>\n<p>The features of design in creation lead us to logically infer that they were designed by the necessary being (<em>wajib al-wujud<\/em>) who demonstrates unmatched power and intelligence. Claiming that ‘nature’ has these attributes, but should not be worshiped, is a merely rhetorical shift.<\/p>\n<p>On the other hand, if they say that &#8216;nature&#8217; has none of these qualities at all, then it is flatly counter-intuitive to people of sound mind. Everyone knows that something with the features of design must have a designer. Ibn al-Qayyim continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِن قَالَت تِلْكَ بل الطبيعة عرض مَحْمُول مفتقر الى حَامِل وَهَذَا كُله فعلهَا بِغَيْر علم مِنْهَا وَلَا إِرَادَة وَلَا قدرَة وَلَا شُعُور اصلا وَقد شوهد من آثارها مَا شوهد فَقل لَهَا هَذَا مَالا يصدقهُ ذُو عقل سليم كَيفَ تصدر هَذِه الافعال العجيبة وَالْحكم الدقيقة الَّتِي تعجز عقول الْعُقَلَاء عَن مَعْرفَتهَا وَعَن الْقُدْرَة عَلَيْهَا مِمَّن لَا عقل لَهُ وَلَا قدرَة وَلَا حِكْمَة وَلَا شُعُور<\/p>\n<p>If they say no, rather nature is a quality lacking agency and all of its actions are without knowledge, will, power, or awareness at its source and only its effects can be witnessed, then say to them that this cannot be believed by any person of sound reason. How do these wondrous actions and perfect subtleties, which cannot be fully known or measured by the brightest of minds, proceed from one without sense, power, wisdom, or awareness?<\/p>\n<p>Source: Miftāḥ Dār al-Sa&#8217;ādah 1\/261<\/p><\/blockquote>\n<p>It is entirely unreasonable to assume that the universe appeared by chance, without an agent or designer. Our instinct is to acknowledge the designs of a designer, whether it is merely a pocket watch or the entire earth in all of its splendor. Anything else is a denial of human nature and rational thinking.<\/p>\n<p>In sum, the teleological argument is a strong proof for the existence and agency of the Creator. It is the preferred method of inspiring faith in Allah, before resorting to more philosophical methods of reasoning. The ‘infinite monkey theorem’ put forth by atheists is invalid according to theoretical and practical mathematics. The purely naturalist explanations of design in creation also fail to acknowledge the divine attributes (will, knowledge, power, etc.) that logically must reside within the Creator.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;We will show them Our signs in the horizons and within themselves&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[20,21,135,32,50,54,55,56,92,301,148],"class_list":["post-21405","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-creation-al-khalq","tag-creed-aqidah","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-knowledge","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-monotheism-tawheed","tag-providence-al-qada-wal-qadr","tag-pure-nature-fitrah","tag-reason-al-aql"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5zf","jetpack-related-posts":[{"id":13343,"url":"https:\/\/www.abuaminaelias.com\/what-are-the-islamic-evidences-for-the-existence-of-the-creator\/","url_meta":{"origin":21405,"position":0},"title":"Evidence for the existence of the Creator in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do they not see that We made the night for resting therein and the day giving sight?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15719,"url":"https:\/\/www.abuaminaelias.com\/the-oneness-of-lordship-tawheed-ar-rububiyyah\/","url_meta":{"origin":21405,"position":1},"title":"Oneness of Lordship (tawheed ar-rububiyyah)","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, your Lord is Allah...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":21405,"position":2},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23635,"url":"https:\/\/www.abuaminaelias.com\/tawhid-worship-allah-alone\/","url_meta":{"origin":21405,"position":3},"title":"Necessity of worshiping Allah alone","author":"Abu Amina Elias","date":"October 23, 2021","format":false,"excerpt":"If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘Allah.’","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22796,"url":"https:\/\/www.abuaminaelias.com\/nur-aql-iman\/","url_meta":{"origin":21405,"position":4},"title":"The Parable of Light, Reason, and Faith","author":"Abu Amina Elias","date":"January 18, 2021","format":false,"excerpt":"\"Light upon light,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21379,"url":"https:\/\/www.abuaminaelias.com\/who-created-allah-the-creator\/","url_meta":{"origin":21405,"position":5},"title":"If Allah created everything, who created Allah?","author":"Abu Amina Elias","date":"October 24, 2019","format":false,"excerpt":"\"It is known by necessity and human nature that the question is invalid.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21405","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21405"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21405\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21405"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21405"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21405"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}