{"id":21491,"date":"2019-12-05T14:53:26","date_gmt":"2019-12-05T10:53:26","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21491"},"modified":"2020-07-18T07:01:10","modified_gmt":"2020-07-18T03:01:10","slug":"fitnah-al-masiha-al-dajjal","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/fitnah-al-masiha-al-dajjal\/","title":{"rendered":"Tribulation of the False Messiah, al-Masiha al-Dajjal"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The greatest trial to afflict the believers and humankind on earth is the tribulation of the False Messiah (<em>al-Masiha al-Dajjal<\/em>) occurring in the end of days. Jesus (ṣ), who is the true Messiah, will be returned as a miracle to lead the believers to victory over the Dajjal. Every believer needs to equip themselves with sound knowledge and strong faith in anticipation of this most terrible event.<\/p>\n<p>The most important sign of the Dajjal is his appearance of one eye and the word of unbelief (<em>ka-fa-ra<\/em>) written across his forehead. Every believer at the time will be able to miraculously recognize these signs and determine the real identity of the Dajjal.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا بُعِثَ نَبِيٌّ إِلَّا أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَإِنَّ بَيْنَ عَيْنَيْهِ مَكْتُوبٌ كَافِرٌ<\/p>\n<p><strong>No prophet was sent but that he warned his nation of the one-eyed liar. Verily, he is blind in one eye and your Lord is not. Verily, between his two eyes is written the word of unbelief.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6712, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/19\/dajjal-false-messiah-blind-one-eye\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hudhayfa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَنَا أَعْلَمُ بِمَا مَعَ الدَّجَّالِ مِنْهُ مَعَهُ نَهْرَانِ يَجْرِيَانِ أَحَدُهُمَا رَأْيَ الْعَيْنِ مَاءٌ أَبْيَضُ وَالْآخَرُ رَأْيَ الْعَيْنِ نَارٌ تَأَجَّجُ فَإِمَّا أَدْرَكَنَّ أَحَدٌ فَلْيَأْتِ النَّهْرَ الَّذِي يَرَاهُ نَارًا وَلْيُغَمِّضْ ثُمَّ لْيُطَأْطِئْ رَأْسَهُ فَيَشْرَبَ مِنْهُ فَإِنَّهُ مَاءٌ بَارِدٌ وَإِنَّ الدَّجَّالَ مَمْسُوحُ الْعَيْنِ عَلَيْهَا ظَفَرَةٌ غَلِيظَةٌ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ كَاتِبٍ وَغَيْرِ كَاتِبٍ<\/p>\n<p><strong>I surely know what the False Messiah will have with him. He will have two flowing rivers, one that appears to be clear water and another that appears to be blazing fire. If one of you sees that, let him go to the river of fire, lower his gaze, put his head down, and drink from it, for it will be cool water. The False Messiah has one covered eye with thick skin over it. Written between his eyes is the word of unbelief. Every believer will be able to read it, whether he is literate or not.<\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعَهُ جَنَّةٌ وَنَارٌ فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ<\/p>\n<p><strong>He will have paradise and fire with him.<\/strong> <strong>His fire is Paradise, and his paradise is Hellfire<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2934, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/dajjal-false-messiah-evil-good\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It is possible that the one-eye is not only physical, but also symbolic. Many Satanic cults and ‘mystery’ or occult religions utilize ancient symbols of idolatry, such as the Eye of Horus or the Eye of Ra. In any case, the true believers who have knowledge will immediately be able to detect this sign and the word of unbelief across his forehead, however it manifests in reality, whether they can read or not.<\/p>\n<p>There are many narrations that mention specific incidents surrounding the Dajjal, such as when or where he appears and so on. Some of these narrations are of questionable authenticity and cannot be relied upon, and some of this content is mixed with baseless conspiracies about geopolitics and the Illuminati. We should only adhere to claims about the Dajjal that can be verified and confirmed from reliable sources.<\/p>\n<p>If the believers only know one thing about the Dajjal, the Prophet (ṣ) told us it should be that he will falsely claim to be God although he only has one eye.<\/p>\n<p>‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي قَدْ حَدَّثْتُكُمْ عَنْ الدَّجَّالِ حَتَّى خَشِيتُ أَنْ لَا تَعْقِلُوا إِنَّ مَسِيحَ الدَّجَّالِ رَجُلٌ قَصِيرٌ أَفْحَجُ جَعْدٌ أَعْوَرُ مَطْمُوسُ الْعَيْنِ لَيْسَ بِنَاتِئَةٍ وَلَا حَجْرَاءَ فَإِنْ أُلْبِسَ عَلَيْكُمْ فَاعْلَمُوا أَنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ<\/p>\n<p><strong>Verily, I have told you so much about the False Messiah that I fear you will not understand. Verily, the False Messiah is a short man, pigeon toed, curly haired, with one eye that is blind, neither protruding nor sunken. If you are confused about him, then know that your Lord does not have one eye.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4320, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/12\/dajjal-allah-blind-one-eye\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It is not important for us to know the specific details of when or where he appears, but rather to be able to identify the general signs and trends that will accompany his arrival.<\/p>\n<p>An essential characteristic of the days preceding and during the tribulation of the Dajjal are the inversion of right and wrong. Good will appear as evil, and evil will appear as good. Salvation (Paradise) will appear as damnation (Hellfire), and damnation will appear as salvation.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُحَدِّثُكُمْ حَدِيثًا عَنْ الدَّجَّالِ مَا حَدَّثَ بِهِ نَبِيٌّ قَوْمَهُ إِنَّهُ أَعْوَرُ وَإِنَّهُ يَجِيءُ مَعَهُ بِمِثَالِ الْجَنَّةِ وَالنَّارِ فَالَّتِي يَقُولُ إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أُنْذِرُكُمْ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ<\/p>\n<p><strong>Shall I not tell you about the False Messiah of which no prophet has told his people before? Verily, he is blind in one eye. He will come with the likeness of paradise and fire. He will bring it and say it is paradise, but it is fire. Verily, I have warned you just as Noah had warned his people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3160, Grade: <strong><em><u><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-false-messiah-fake-paradise\/\">Muttafaqun Alayhi<\/a><\/u><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَمَامَ الدَّجَّالِ سِنِينَ خَدَّاعَةً يُكَذَّبُ فِيهَا الصَّادِقُ وَيُصَدَّقُ فِيهَا الْكَاذِبُ وَيُخَوَّنُ فِيهَا الْأَمِينُ وَيُؤْتَمَنُ فِيهَا الْخَائِنُ وَيَتَكَلَّمُ فِيهَا الرُّوَيْبِضَةُ<\/p>\n<p><strong>Verily, preceding the False Messiah will be years of deception, in which the truthful are belied, the liars are believed, the trustworthy are discredited, the treacherous are trusted, and the disgraceful speak.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 13298, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/11\/20\/dajjal-false-messiah-years-deceit\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>The years leading up to the Dajjal will initially seem prosperous and this mistaken perception will be aggravated by some hypocrite Muslims, but eventually there will be a tremendous upheaval that will affect everyone in the Muslim nation and the world.<\/p>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ فِتْنَةُ السَّرَّاءِ دَخَنُهَا مِنْ تَحْتِ قَدَمَيْ رَجُلٍ مِنْ أَهْلِ بَيْتِي يَزْعُمُ أَنَّهُ مِنِّي وَلَيْسَ مِنِّي وَإِنَّمَا أَوْلِيَائِي الْمُتَّقُونَ ثُمَّ يَصْطَلِحُ النَّاسُ عَلَى رَجُلٍ كَوَرِكٍ عَلَى ضِلَعٍ ثُمَّ فِتْنَةُ الدُّهَيْمَاءِ لَا تَدَعُ أَحَدًا مِنْ هَذِهِ الْأُمَّةِ إِلَّا لَطَمَتْهُ لَطْمَةً فَإِذَا قِيلَ انْقَضَتْ تَمَادَتْ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا حَتَّى يَصِيرَ النَّاسُ إِلَى فُسْطَاطَيْنِ فُسْطَاطِ إِيمَانٍ لَا نِفَاقَ فِيهِ وَفُسْطَاطِ نِفَاقٍ لَا إِيمَانَ فِيهِ فَإِذَا كَانَ ذَاكُمْ فَانْتَظِرُوا الدَّجَّالَ مِنْ يَوْمِهِ أَوْ مِنْ غَدِهِ<\/p>\n<p><strong>There will come a trial which appears pleasant. Its murkiness is due to the coming of a man from my household who imagines that he is part of me but he is not, for my allies are only the righteous who fear Allah. Then the people will gather under a man unstable like a hip bone over a rib. Then there will be an enormous trial which not leave anyone from this nation unaffected, and just when people say it is finished it will be extended further. During this trial a man will be a believer in the morning and an unbeliever by evening, such that people will be in two camps: the camp of faith without hypocrisy and the camp of hypocrisy without faith. When that happens, then expect the False Messiah to emerge that day or the next<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 4242, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/11\/15\/trial-affect-entire-ummah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Dajjal will be aided by the remaining members of the notorious Khawarij sect, who are the premier hypocrites of this Ummah and the leaders of persecution, bloodshed, and illegitimate violence. They claim to adhere to the Quran but it does not go beyond their throats, meaning it has no genuine effect on their hearts and minds.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَيَخْرُجُ أُنَاسٌ مِنْ أُمَّتِي مِنْ قِبَلِ الْمَشْرِقِ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ كُلَّمَا خَرَجَ مِنْهُمْ قَرْنٌ قُطِعَ كُلَّمَا خَرَجَ مِنْهُمْ قَرْنٌ قُطِعَ<\/p>\n<p><strong>There will emerge from the east some people from my nation who recite the Quran but it will not go beyond their throats. Every time a faction of them emerges it will be cut off<\/strong>.<\/p><\/blockquote>\n<p>The Prophet (ṣ) repeated this and on the tenth time he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلَّمَا خَرَجَ مِنْهُمْ قَرْنٌ قُطِعَ حَتَّى يَخْرُجَ الدَّجَّالُ فِي بَقِيَّتِهِمْ<\/p>\n<p><strong>Every time a faction of them emerges it will be cut off, until the False Messiah emerges from their remnants<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 27767, Grade: <strong><em><u><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/06\/23\/dajjal-emerges-khawarij\/\">Sahih<\/a><\/u><\/em><\/strong><\/p><\/blockquote>\n<p>The Dajjal will be surrounded by a powerful army, make use of sophisticated anti-Islam propaganda, and likely have access to the latest technologies, potent ceremonial black magic, influence over jinn, and immense wealth. He will perform many false miracles and wonders, whether by technology or magic, to persuade people to his satanic cause; only those with the strongest faith will be able to resist.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَأْتِي الدَّجَّالُ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ فَيَنْزِلُ بَعْضَ السِّبَاخِ الَّتِي تَلِي الْمَدِينَةَ فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ وَهُوَ خَيْرُ النَّاسِ أَوْ مِنْ خِيَارِ النَّاسِ فَيَقُولُ أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ فَيَقُولُ الدَّجَّالُ أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ هَلْ تَشُكُّونَ فِي الْأَمْرِ فَيَقُولُونَ لَا فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ وَاللَّهِ مَا كُنْتُ فِيكَ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ فَلَا يُسَلَّطُ عَلَيْهِ<\/p>\n<p><strong>The False Messiah will come and he will be forbidden from entering the boundary of Medina. He will descend upon some of the salty barren areas around Medina. On that day, a man among the best of the people will come out and say: I testify that you are the same impostor whom the Messenger of Allah, peace and blessings be upon him, told us about. The False Messiah will say: Do you all think if I killed you and brought you back to life, would you have any doubt in the matter? The man will say no. Then, he will kill the man and bring him back to life and the man will say when he is alive again: By Allah, I have never seen so clearly as I do today! The False Messiah will intend to kill him, for he has no authority over him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6713, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/12\/05\/dajjal-false-messiah-miracles\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, the Prophet (ṣ) commanded the believers in general to retreat and escape from his powerful propaganda machine.<\/p>\n<p>‘Imran ibn Husayn reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَمِعَ بِالدَّجَّالِ فَلْيَنْأَ عَنْهُ فَوَاللَّهِ إِنَّ الرَّجُلَ لَيَأْتِيهِ وَهُوَ يَحْسِبُ أَنَّهُ مُؤْمِنٌ فَيَتَّبِعُهُ مِمَّا يَبْعَثُ بِهِ مِنْ الشُّبُهَاتِ<\/p>\n<p><strong>Whoever hears news of the False Messiah, let him flee from him. By Allah, a man will go to him considering himself a believer, but will instead follow him because of doubts he will present.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4319, Grade: <strong><em><u><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/12\/flee-dajjal-false-messiah\/\">Sahih<\/a><\/u><\/em><\/strong><\/p><\/blockquote>\n<p>In fact, many of the believers will run away from cities and take refuge in the wilderness, rather than expose themselves to his persecution.<\/p>\n<p>Umm Sharik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيَفِرَّنَّ النَّاسُ مِنْ الدَّجَّالِ فِي الْجِبَالِ<\/p>\n<p><strong>The people will flee from the False Messiah into the mountains<\/strong>.<\/p><\/blockquote>\n<p>She said, “O Messenger of Allah, where will the Arabs be on that day?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ قَلِيلٌ<\/p>\n<p><strong>They will be few<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2945, Grade: <strong><em><u><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/dajjal-people-flee-to-mountains\/\">Sahih<\/a><\/u><\/em><\/strong><\/p><\/blockquote>\n<p>The Dajjal and his allies will use their abilities to specifically target the most vulnerable segments of society, particularly women. The believing men will go to great lengths to protect their families from his deceitful propaganda.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَنْزِلُ الدَّجَّالُ فِي هَذِهِ السَّبَخَةِ بِمَرِّقَنَاةَ فَيَكُونُ أَكْثَرَ مَنْ يَخْرُجُ إِلَيْهِ النِّسَاءُ حَتَّى إِنَّ الرَّجُلَ لَيَرْجِعُ إِلَى حَمِيمِهِ وَإِلَى أُمِّهِ وَابْنَتِهِ وَأُخْتِهِ وَعَمَّتِهِ فَيُوثِقُهَا رِبَاطًا مَخَافَةَ أَنْ تَخْرُجَ إِلَيْهِ<\/p>\n<p><strong>The False Messiah will come upon this marsh of Marriqanat<\/strong> (near Medina).<strong> Most of those who go out to him will be women, until a man goes back to his wife, his mother, his daughter, his sister, and his aunt to shackle them tightly, fearing they would go out to him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 5330, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/08\/10\/dajjal-targets-women-family\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The tribulation of the Dajjal will be the most momentous religio-political event in human history, greater in magnitude than even the persecution of the Israelites by Pharaoh or the 20th century Holocaust.<\/p>\n<p>‘Imran ibn Husayn reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ السَّاعَةِ خَلْقٌ أَكْبَرُ مِنْ الدَّجَّالِ<\/p>\n<p><strong>Nothing between the creation of Adam until the establishment of the Hour is a greater tribulation than the affair of the False Messiah<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2946, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-tribulation-false-messiah-greatest\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For this reason, the Prophet (ṣ) encouraged us to seek refuge in Allah from the trial of the Dajjal after every prayer.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا تَشَهَّدَ أَحَدُكُمْ فَلْيَسْتَعِذْ بِاللَّهِ مِنْ أَرْبَعٍ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ<\/p>\n<p><strong>When one of you finishes his testimony at the end of prayer, let him seek refuge in Allah from four trials, saying: O Allah, I seek refuge in you from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil trial of the False Messiah<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1311, Grade:<strong><em> <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/29\/seek-refuge-after-prayer\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) also encouraged us to memorize and recite the first and last ten verses of Surat al-Kahf, as these contain lessons that will help us in preparation for the Dajjal.<\/p>\n<p>Abu Darda reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْكَهْف عُصِمَ مِنْ الدَّجَّالِ<\/p>\n<p><strong>Whoever memorizes ten verses from the beginning of Surat al-Kahf<\/strong> <strong>will be immune to the False Messiah<\/strong>.<\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنْ آخِرِ الْكَهْفِ<\/p>\n<p><strong>From the last ten verses of Surat al-Kahf.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 809, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/03\/dajjal-ten-verses-kahf\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>One might wonder how this surah can provide protection from the Dajjal. Moreover, is it the first or last ten verses, as both versions have been authentically reported?<\/p>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قِيلَ سَبَبُ ذَلِكَ مَا فِي أَوَّلِهَا مِنَ الْعَجَائِبِ وَالْآيَاتِ فَمَنْ تَدَبَّرَهَا لَمْ يُفْتَتَنْ بِالدَّجَّالِ وَكَذَا فِي آخِرِهَا<\/p>\n<p>It is said the reason for this is that the beginning of it contains wonders and signs. Whoever contemplates them will not be misled by the trials of the False Messiah. It is likewise for the last verses of it.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 809<\/p><\/blockquote>\n<p>Ten verses from the beginning or end of Surat al-Kahf mention matters that are relevant to understanding and preparing for the tribulation of the Dajjal. It is <em><a href=\"https:\/\/abuaminaelias.com\/ten-ayat-surah-kahf-dajjal\/\">reflection upon these meanings<\/a><\/em> in the surah, not simply reciting them outwardly, that provide us with protection.<\/p>\n<p>Once the Dajjal is on the scene, people will no longer have an opportunity to strengthen their faith or escape his persecution if they had not already prepared themselves.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثٌ إِذَا خَرَجْنَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدَّجَّالُ وَدَابَّةُ الْأَرْضِ<\/p>\n<p><strong>When three signs appear, no soul will benefit from its faith if it did not already believe or earn good by its faith: the rising of the sun from the west, the False Messiah, and the beast from the earth.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 158, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/12\/iman-no-benefit-after-three\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As such, we should be prompt in strengthening our faith, seeking beneficial knowledge, and doing good deeds before this inevitable disaster takes place.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَادِرُوا بِالْأَعْمَالِ سِتًّا الدَّجَّالَ وَالدُّخَانَ وَدَابَّةَ الْأَرْضِ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَأَمْرَ الْعَامَّةِ وَخُوَيْصَّةَ أَحَدِكُمْ<\/p>\n<p><strong>Hasten to perform good deeds before six events: the False Messiah, the smoke, the beast from the earth, the rising of the sun from the west, and the general turmoil of the masses and individuals.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2947, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/18\/hasten-good-deeds-six\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَادِرُوا بِالْأَعْمَالِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا أَوْ يُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا يَبِيعُ دِينَهُ بِعَرَضٍ مِنْ الدُّنْيَا<\/p>\n<p><strong>Hasten to perform good deeds before a tribulation comes like the dark part of the night, in which a man will be a believer in the morning and an unbeliever in the evening, or he will be a believer in the evening and an unbeliever in the morning. He would sell his faith for some goods in the world.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 118, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/10\/good-deeds-before-hour\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Qadi Iyad commented on these traditions, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَرَهُمْ أَنْ يُبَادِرُوا بِالْأَعْمَالِ قَبْلَ نُزُولِ هَذِهِ الْآيَاتِ فَإِنَّهَا إِذَا نَزَلَتْ دَهَشَتْهُمْ وَشَغَلَتْهُمْ عَنِ الْأَعْمَالِ أَوْ سُدَّ عَلَيْهِمْ بَابُ التَّوْبَةِ وَقَبُولِ الْأَعْمَالِ<\/p>\n<p>The Prophet (ṣ) commanded them to hasten to perform good deeds before the appearance of these signs, for when they appear they will be stunned and distracted from performing good deeds, or they might lose the opportunity to repent and have their deeds accepted.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 5465<\/p><\/blockquote>\n<p>Even if we are fortunate enough to live in a time and place that is protected from the tribulation of the Dajjal, reflecting upon all of these facts should increase our gratitude and motivation to do good, as the believers of that time will endure hardships beyond what we can imagine.<\/p>\n<p>In sum, the Dajjal will appear near the end of time as the last and greatest test of faith from Allah that humankind will experience. The Dajjal will be known by his one eye and the word of unbelief written across his forehead, which every believer will miraculously be able to read. The years before the Dajjal and during his reign will be characterized as an inversion of morality, in which good is considered evil and evil is considered good. The Dajjal will be assisted by powerful propaganda, technology, black magic, and military might, targeting the most vulnerable members of society.<\/p>\n<p>The believers who see the Dajjal should flee from him; some of them will even enter the wilderness or mountains rather than join him. We should seek refuge in Allah from the Dajjal after every prayer, as mentioned by the Prophet (ṣ), as well as regularly reflect upon the first and last ten verses of Surat al-Kahf. Awareness of this tribulation should increase our gratitude to Allah for our safety and prosperity, while also motivating us to strengthen our faith and do good deeds in preparation for this climactic event.<\/p>\n<p>May Allah protect us and the believers from the tribulation of the Dajjal.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Know that your Lord does not have one eye.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[391,460,418,446,322,394,135,32,95,37,326,120,50,461,316,408,302,134,60,365,400,405,220,445,447,98,128],"class_list":["post-21491","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-bloodshed-safk-al-dima","tag-doubts-al-shubuhat","tag-false-messiah-al-masiha-al-dajjal","tag-al-fitnah","tag-gratitude-al-shukr","tag-graves-al-qubur","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-hypocrisy-al-nifaq","tag-idolatry-shirk","tag-jinn","tag-rebels-khawarij","tag-knowledge","tag-magic-al-sihr","tag-medina-madinah","tag-miracles-al-mujizah","tag-noah-nuh","tag-paradise-jannah","tag-prayer-salat","tag-recommendation-al-mustahab","tag-refuge-al-taawwudh","tag-signs-of-the-hour-ashrat-al-saah","tag-supplication-al-dua","tag-surah-al-kahf","tag-trials-al-balaa","tag-unbelief-al-kufr","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5AD","jetpack-related-posts":[{"id":21235,"url":"https:\/\/www.abuaminaelias.com\/ten-ayat-surah-kahf-dajjal\/","url_meta":{"origin":21491,"position":0},"title":"Ten verses of Surat al-Kahf to protect from Dajjal","author":"Abu Amina Elias","date":"September 20, 2019","format":false,"excerpt":"\"Whoever contemplates them will not be misled by the trials of the False Messiah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20121,"url":"https:\/\/www.abuaminaelias.com\/where-is-the-island-of-dajjal\/","url_meta":{"origin":21491,"position":1},"title":"Where is the island of Dajjal?","author":"Abu Amina Elias","date":"January 23, 2019","format":false,"excerpt":"\"What was the nature of Tamim’s encounter with the False Messiah?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17565,"url":"https:\/\/www.abuaminaelias.com\/understanding-signs-of-the-hour\/","url_meta":{"origin":21491,"position":2},"title":"Understanding the signs of the Hour","author":"Abu Amina Elias","date":"January 10, 2016","format":false,"excerpt":"\"People ask you concerning the Hour...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21779,"url":"https:\/\/www.abuaminaelias.com\/can-plague-enter-mecca-and-medina\/","url_meta":{"origin":21491,"position":3},"title":"Can plague enter Mecca and Medina?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The False Messiah will not enter Medina, neither will pestilence.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14749,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-tribulations-and-signs-of-the-hour\/","url_meta":{"origin":21491,"position":4},"title":"Imam al-Nawawi on Tribulations and Signs of the Hour","author":"Abu Amina Elias","date":"August 20, 2013","format":false,"excerpt":"\"When trust is lost, then wait for the Hour.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21125,"url":"https:\/\/www.abuaminaelias.com\/al-mahdi-promised-caliph\/","url_meta":{"origin":21491,"position":5},"title":"Al-Mahdi, the promised Caliph to lead the Ummah","author":"Abu Amina Elias","date":"September 10, 2019","format":false,"excerpt":"\"The Mahdi will be from my offspring, the descendants of Fatimah.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21491","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21491"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21491\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21491"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21491"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21491"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}