{"id":21511,"date":"2019-12-09T16:42:14","date_gmt":"2019-12-09T12:42:14","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21511"},"modified":"2025-06-24T16:35:49","modified_gmt":"2025-06-24T12:35:49","slug":"slave-girls-naked-breasts","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/slave-girls-naked-breasts\/","title":{"rendered":"Slave girls showing their breasts?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>We may find classical rulings that could disturb some Muslims, or be exploited by Islam’s enemies, if they are not placed in historical context or the reasoning behind such rulings is not clearly explained.<\/p>\n<p>One such ruling is the concession of some scholars to allow slave women to uncover their hair, unlike the general practice today, or to uncover their chests, although in many social contexts bare breasts are not inherently sexual like they are today.<\/p>\n<p>The scholars who allowed this were clear that the purpose was ease the duties performed by slaves, out of compassion for them, but not to expose them to lustful gazes as some might imagine.<\/p>\n<p>Ibn al-Nahhas explains the three views of the jurists:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ويحرم النظر إلى ما بين سرة الأمة وركبتيها على الأصح عند الرافعي ويكره إلى ما سوى ذلك والوجه الثاني يحرم النظر إلى ما يبدو حال المهنة والثالث أنها كالحرة<\/p>\n<p>It is forbidden to stare at a slave woman between her navel to her knees, which is the correct view according to Ibn al-Rafi’i, but it is discouraged to look at anything else. The second view is that it is forbidden to stare at what might be revealed while she is working. The third view is that she is like a freewoman.<\/p>\n<p>Source: Tanbīh al-Ghāfilīn 1\/313<\/p><\/blockquote>\n<p>Although some scholars of the first opinion allowed slave women to uncover their chests, they distill disapproved of men from looking at them, while others considered it to be strictly illegal  to look at what be revealed as they work. None of them said it was morally acceptable to stare at slave women out of lust.<\/p>\n<p>In the time of the Companions, slave women often worked in the fields during hot days, performed errands in the market, or breastfed infants. The jurists allowed them to uncover themselves, as an exception to the general rule, to make their work easier. Moreover, women exposing their chests as not considered inherently sexual, as it still is in some parts of the world today.<\/p>\n<p>Even so, many Hanbali scholars agreed with this third view, that slave woman’s dress code is like a free woman, as Imam Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَسَوَّى بَعْضُ أَصْحَابِنَا بَيْنَ الْحُرَّةِ وَالْأَمَةِ لِقَوْلِهِ تَعَالَى وَلا يُبْدِينَ زِينَتَهُنَّ وَلِأَنَّ الْعِلَّةَ فِي تَحْرِيمِ النَّظَرِ الْخَوْفُ مِنْ الْفِتْنَةِ وَالْفِتْنَةُ الْمَخُوفَةُ تَسْتَوِي فِيهَا الْحُرَّةُ وَالْأَمَةُ فَإِنَّ الْحُرِّيَّةَ حُكْمٌ لَا يُؤَثِّرُ فِي الْأَمْرِ الطَّبِيعِيِّ<\/p>\n<p>Some of our scholars said there is no difference between the freewoman and slave women, due to the saying of the Almighty, ‘<strong>And do not show their beauty,<\/strong>’ (24:31). As the legal cause in the prohibition of gazing is fear of temptation, and temptation is feared equally between freewomen and slave women, for the ruling of freedom does not affect the matter of human nature.<\/p>\n<p>Source: Mughni 7\/103<\/p><\/blockquote>\n<p>Imam Ibn Hazm likewise agreed, citing lack of definitive proof for making any distinction between free and slave women:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهِيَ (الْعَوْرَة) مِنْ الْمَرْأَةِ جَمِيعُ جِسْمِهَا حَاشَا الْوَجْهِ وَالْكَفَّيْنِ فَقَطْ الْحُرُّ وَالْعَبْدُ وَالْحُرَّةُ وَالْأَمَةُ سَوَاءٌ فِي كُلِّ ذَلِكَ وَلَا فَرْقَ … وَأَمَّا الْفَرْقُ بَيْنَ الْحُرَّةِ وَالْأَمَةِ فَدِينُ اللَّهِ تَعَالَى وَاحِدٌ وَالْخِلْقَةُ وَالطَّبِيعَةُ وَاحِدَةٌ كُلُّ ذَلِكَ فِي الْحَرَائِرِ وَالْإِمَاءِ سَوَاءٌ حَتَّى يَأْتِيَ نَصٌّ فِي الْفَرْقِ بَيْنَهُمَا فِي شَيْءٍ فَيُوقَفُ عِنْدَهُ<\/p>\n<p>The nakedness of a woman is her entire body excluding the face and palms only. The free man and male servant, the free woman and maidservant are equal in this respect; there is no difference… As for differentiating between the free woman and maidservant, then the religion of Allah Almighty is one, creation and nature are one. All of that in respect to free women and maidservants is the same, unless there is an explicit text to distinguish between them in any way such that it can be applied.<\/p>\n<p>Source: al-Muḥallá 2\/241 and 248<\/p><\/blockquote>\n<p>Ibn Abi Huraira, the son of the most prolific Hadith narrator, also agreed the dress code for free and slave women was the same:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عورتها كعورة الْحرَّة<\/p>\n<p>Her ‘nakedness’ (<em>‘awrah<\/em>) is like that of a free woman.<\/p>\n<p>Source: Ikhtilāf al-A&#8217;immah lil-Ibn Hubayrah<\/p><\/blockquote>\n<p>Other scholars allowed slave women to uncover their head, legs, and shins, but not their breasts, because these parts would usually be exposed while they worked.<\/p>\n<p>Imam al-Shashi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمن أَصْحَابنَا من قَالَ جَمِيع بدنهَا عَورَة إِلَّا مَوضِع التقليب مِنْهَا فِي الشّعْر كالرأس والساعد والساق وَمِنْهُم من قَالَ عورتها كعورة الْحرَّة إِلَّا أَنه يجوز لَهَا كشف رَأسهَا<\/p>\n<p>Some of our scholars said her entire body is ‘nakedness’ except for areas covered with hair like the head, forearms, and shins. Some said her ‘nakedness’ is like a free woman, except that they allowed her to uncover her head.<\/p>\n<p>Source: Ḥilyat al-&#8216;Ulamā&#8217; fī Ma&#8217;rifat Madhāhib al-Fuqahā’ 2\/54<\/p><\/blockquote>\n<p>The difference of opinions originates in a verse commanding the Prophet’s ﷺ wives to veil, which some exegetes understood to be exclusively for freewomen.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّبِيُّ قُل لِّأَزْوَاجِكَ وَبَنَاتِكَ وَنِسَاءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِن جَلَابِيبِهِنَّ ذَٰلِكَ أَدْنَىٰ أَن يُعْرَفْنَ فَلَا يُؤْذَيْنَ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا<\/p>\n<p><strong>O Prophet, tell your wives, your daughters, and the believing women to draw their cloaks over themselves. That is more suitable, such that they will be acknowledged and not harmed. Allah is ever forgiving and merciful.<\/strong><\/p>\n<p>Surat al-Ahzab 33:59<\/p><\/blockquote>\n<p>However, other exegetes were quick to point out that the verse makes no distinction.<\/p>\n<p>Imam Abu Hayyan commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالظَّاهِرُ أَنَّ قَوْلَهُ وَنِساءِالْمُؤْمِنِينَ يَشْمَلُ الْحَرَائِرَ وَالْإِمَاءَ وَالْفِتْنَةُ بِالْإِمَاءِ أَكْثَرُ لِكَثْرَةِ تَصَرُّفِهِنَّ بِخِلَافِ الْحَرَائِرِ فَيَحْتَاجُ إِخْرَاجُهُنَّ مِنْ عُمُومِ النِّسَاءِ إلى دليل واضح<\/p>\n<p>The apparent meaning of His saying ‘<strong>the believing women<\/strong>’ includes free women and maidservants. The temptation from maidservants is even greater because of their frequent activity, unlike free women. Excluding them from the generality of women requires clear evidence.<\/p>\n<p>Source: al-Baḥr al-Muḥīṭ 8\/504<\/p><\/blockquote>\n<p>Imam Ibn al-Qattan agreed with this view:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فعلى هذا لا فرق بين الحرائر والإِماء في الآية وإنما معناها الأمر بالتستر والتعفف فلا يعرض لهن بأذى إذا عرفن قد قصدن التستر بخلاف المتبرجات بالزينة المتعرضات لأهل الفسوق<\/p>\n<p>Upon this, there is no difference between free women and maidservants in respect to the verse. Indeed, the meaning is to command veiling and chastity, such that they are not exposed to harm when their intention to veil is recognized, as opposed to sinful women who beautify themselves for adultery.<\/p>\n<p>Source: Aḥkām al-Naẓar 1\/228<\/p><\/blockquote>\n<p>Shaykh al-Albani likewise documented the weakness of several narrations attributing this meaning to the verse, concluding:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومن العجائب أن يغتر بعض المفسرين بهذه الروايات الضعيفة فيذهبوا بسببها إلى تقييد قوله تعالى وَنِسَاءِ الْمُؤْمِنِينَ بالحرائر دون الإماء وبنوا على ذلك أنه لا يجب على الأمة ما يجب على الحرة من ستر الرأس والشعر بل بالغ بعض المذاهب فذكر أن عورتها مثل عورة الرجل من السرة إلى الركبة… وهذا مع أنه لا دليل عليه من كتاب أو سنة<\/p>\n<p>It is strange that some exegetes are fooled by these weak narrations, such that they adhere to the view restricting His saying ‘<strong>the believing women<\/strong>’ as free women to the exclusion of maidservants, and based upon this that maidservants do not have the obligation to cover their head and hair like free women. Rather, some of the legal schools exaggerate to the point that they mention her nakedness is like the nakedness of men, only from the navel to the knee… Despite this, there is no evidence for it in the Book and the Sunnah.<\/p>\n<p>Source: Jilbāb al-Mar’ah 1\/91-92<\/p><\/blockquote>\n<p>Some scholars cited the statements of the Messenger of Allah, peace and blessings be upon him, to support this position:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ تُقْبَلُ صَلاَةُ الْحَائِضِ إِلاَّ بِخِمَارٍ يَعْنِي الْمَرْأَةَ الْبَالِغَ<\/p>\n<p><strong>The prayer of a adult woman is not accepted unless she wears a veil.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 377, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/04\/05\/salat-nisa-hijab-wajib\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam Azimabadi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاسْتَدَلَّ بِهَذَا الْحَدِيثِ مَنْ سوى بين الحرة والأمة وهو قول فِي الْعَوْرَةِ لِعُمُومِ ذِكْرِ الْحَائِضِ وَلَمْ يُفَرِّقْ بَيْنَ الْحُرَّةِ وَالْأَمَةِ<\/p>\n<p>This Hadith was used as evidence who said there is not different between free and slave women in regards to ‘nakedness,’ due to the generality of adult women. They did not make a distinction between free and slave women.<\/p>\n<p>Source: ‘Awn al-Maʻbūd 2\/243<\/p><\/blockquote>\n<p>Nevertheless, the scholars who stipulated a different dress code only allowed slave woman to do so to the extent necessary. In general, the dress code of all women is the same, except for the concession to make work easier for slave women.<\/p>\n<p>Shaykh Wahbah al-Zuhayli explains:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أما الإماء فلم يكلفهن الشرع بالتستر الكامل دفعا للحرج والمشقة في التقنع وتيسيرا لهن القيام بخدمات السادة هذا رأي الجمهور<\/p>\n<p>As for slave women, the Law-giver did not obligate them to fully veil to prevent harm and the hardship of covering, making it easy for them to fulfill the duties of their master. This is the opinion of the majority.<\/p>\n<p>Source: Tafsīr al-Munīr 22\/108<\/p><\/blockquote>\n<p>This ruling was not certainly not to ‘parade’ their nakedness around for men to ogle, as many jurists did not allow their chests to be uncovered at all.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأصل أن عورة الأمة كعورة الحرة كما أن عورة العبد كعورة الحر لكن لما كانت مظنة المهنة والخدمة وحرمتها تنقص عن حرمة الحرة رخص لها في إبداء ما تحتاج إلى إبدائه … فأما الظهر والصدر فباق على الأصل<\/p>\n<p>The default position is that the ‘nakedness’ of a maidservant is like a free woman, just as the nakedness of a male servant is like a free man. When she takes on an occupation and duties, her prohibitions are reduced in comparison to a free woman, as a concession to her in showing only what needs to be shown… As for the back and chest, it remains in the default position.<\/p>\n<p>Source: Sharḥ al-ʻUmdah 1\/275<\/p><\/blockquote>\n<p>In other words, slave women should veil like free women except to the extent their work duties require.<\/p>\n<p>Some exegetes further claimed that the verse was only revealed for free women to veil, so as not to be harassed in public, but does this imply slave women could be harassed?<\/p>\n<p>Imam Ibn Hazam rejects this interpretation:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَنَحْنُ نَبْرَأُ مِنْ هَذَا التَّفْسِيرِ الْفَاسِدِ &#8230; وَإِنَّ تَعَرُّضَ الْحُرَّةِ فِي التَّحْرِيمِ كَتَعَرُّضِ الْأَمَةِ وَلَا فَرْقَ<\/p>\n<p>We disassociate from this corrupt explanation… Harassing freewomen is forbidden just as it is for slave women. There is no difference.<\/p>\n<p>Source: al-Muḥallá 2\/249<\/p><\/blockquote>\n<p>Al-‘Allamah al-Shintiqi concurs:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي الجملة فلا إشكال في أمر الحرائر بمخالفة زي الإماء ليهابهن الفساق ودفع ضرر الفساق عن الإماء<\/p>\n<p>In summary, there is no problem in the matter of freewomen dressing differently than slave women, so that the wicked will avoid them, but slave women must also be defended from harm.<\/p>\n<p>Source: Aḍwāʼ al-Bayān fī Īḍāḥ al-Qurʼān 6\/647<\/p><\/blockquote>\n<p>As such, the verse does not allow slave women to be harassed, or any women for that matter.<\/p>\n<p>Even so, many scholars who accepted these concessions dress code still did not allow slave women to show their naked breasts, chests, or backs.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأصل أن عورة الأمة كعورة الحرة كما أن عورة العبد كعورة الحر لكن لما كانت مظنة المهنة والخدمة وحرمتها تنقص عن حرمة الحرة رخص لها في إبداء ما تحتاج إلى إبدائه … فأما الظهر والصدر فباق على الأصل<\/p>\n<p>The default position is that the nakedness of a maidservant is like a free woman, just as the nakedness of a male servant is like a free man. When she takes on an occupation and duties, her prohibitions are reduced in comparison to a free woman, as a concession to her in showing only what needs to be shown… As for the back and chest, it remains in the default position.<\/p>\n<p>Source: Sharḥ al-ʻUmdah 1\/275<\/p><\/blockquote>\n<p>It as essential distinction to make is that the ruling on uncovering for slave women does not allow a man to gaze at her lustfully. The general rule, confirmed decisively in the Quran and Sunnah, is that is sinful to stare at a woman with lust, except for one’s spouse.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُل لِّلْمُؤْمِنِينَ يَغُضُّوا۟ مِنْ أَبْصَـٰرِهِمْ وَيَحْفَظُوا۟ فُرُوجَهُمْ ذَٰلِكَ أَزْكَىٰ لَهُمْ إِنَّ ٱللَّهَ خَبِيرٌۢ بِمَا يَصْنَعُونَ<\/p>\n<p><strong>O Prophet! Tell the believing men to lower their gaze and guard their chastity. That is purer for them. Surely, Allah is All-Aware of what they do.<\/strong><\/p>\n<p>Surat al-Nur 24:31<\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْعَيْنَيْنِ النَّظَرُ وَزِنَى<\/p>\n<p><strong>The adultery of the two eyes is a lustful stare.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6612, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/09\/decreed-portion-of-zina\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْعَيْنَانِ تَزْنِيَانِ وَالْيَدَانِ تَزْنِيَانِ وَالرِّجْلَانِ تَزْنِيَانِ وَالْفَرْجُ يَزْنِ<\/p>\n<p><strong>The two eyes commit adultery, the two hands commit adultery, the two legs commit adultery, and the genitals commit adultery.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 3912, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/07\/05\/limbs-adultery\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Alqamah ibn al-Huwayrith reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">زِنَى الْعَيْنَيْنِ النَّظَرُ<\/p>\n<p><strong>The adultery of the two eyes is the lustful gaze.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 18\/8, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/07\/05\/staring-with-lust\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jarir reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظَرِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي<\/p>\n<p>I asked the Messenger of Allah, peace and blessings be upon him, about accidentally glancing at a woman. The Prophet ordered me to look the other way.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2159, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/02\/accidental-glance-woman\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Buraydah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُتْبِعْ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الْأُولَى وَلَيْسَتْ لَكَ الْآخِرَةُ<\/p>\n<p><strong>Do not follow an accidental glance at a woman with another. Verily, you are excused for the first one but not for the second.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2777, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/02\/not-second-glance-woman\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ali reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُتْبِعِ النَّظْرَةَ النَّظْرَةَ الْأُولَى لَكَ وَالْآخِرَةُ عَلَيْكَ<\/p>\n<p><strong>Do not follow one glance at a woman with another. You are excused for the first but the second will be counted against you.<\/strong><\/p>\n<p>Source: Sharḥ Mushkil al-Āthār 1866, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/11\/30\/second-stares-sinful\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ الْفَضْلُ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَتْ امْرَأَةٌ مِنْ خَشْعَمَ فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ وَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الْآخَرِ<\/p>\n<p>Al-Fadl was riding with the Messenger of Allah, peace and blessings be upon him, and a woman from Khash’am came. Al-Fadl began to stare at her and she stared at him. The Prophet made Al-Fadl turn his face in the other direction.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1442, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/07\/11\/hijab-not-stare-at-women\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Annas reported: A woman would pray behind the Messenger of Allah, peace and blessings be upon him, who was the most beautiful of all people. Some men would come early to be in the first row, so as not to gaze at her. Some of them would come late to be in the last row. When they bowed, they would look at her between their limbs. Allah Almighty revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِينَ مِنْكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَأْخِرِينَ<\/p>\n<p><strong>We surely know who comes first among you and We surely know who comes last.<\/strong>” (15:24)<\/p>\n<p>Source: Sunan al-Tirmidhī 3122, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/27\/allah-knows-which-men-gaze\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Rayhanah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حُرِّمَتِ النَّارُ عَلَى عَيْنٍ غَضَّتْ عَنْ مَحَارِمِ اللهِ<\/p>\n<p><strong>The Hellfire is forbidden for the eye that lowers its gaze from what Allah has forbidden.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Nasā’ī 8818, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/22\/three-eyes\/\">Hasan li ghayrihi<\/a><\/em><\/p><\/blockquote>\n<p>Mu’awiyah ibn Jaydah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثَةٌ لَا تَرَى أَعْيُنُهُمُ النَّارَ عَيْنٌ حَرَسَتْ فِي سَبِيلِ اللهِ وَعَيْنٌ بَكَتْ مِنْ خَشْيَةِ اللهِ وَعَيْنٌ غَضَّتْ عَنْ مَحَارِمِ اللهِ<\/p>\n<p><strong>Three eyes will never see the Hellfire, an eye standing guard in the way of Allah, an eye weeping from the fear of Allah, and an eye lowering its gaze from what Allah has forbidden.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 19\/416, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/23\/guarding-weeping-lowering-gaze\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Qabus reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرْسَلَ امْرَأَةً إِلَى عَائِشَةَ فَرَأَتْ جَارِيَةً لَهَا جَمَّةٌ، فَقَالَتْ لَوِ اسْتَتَرَتْ هَذِهِ كَانَ أَحْرَى بِهَا فَقَالَتْ إِنَّهَا لَمْ تَحِضْ وَلَا بَدَا بَعْدُ الْحَيْضُ<\/p>\n<p>A woman was sent to Aisha and see saw a servant-girl with long hair. She said, ‘It would be more suitable for this girl to veil.’ Aisha said, ‘She has not menstruated, and it is only necessary after menstruation.”<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 6214<\/p><\/blockquote>\n<p>All of these Hadith make no distinction between free and slave women. It is forbidden to stare at a woman lustfully, regardless of her social status.<\/p>\n<p>Some scholars believed the prohibition of staring applied to women as well.<\/p>\n<p>Imam Ibn ‘Abd al-Barr writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكما لا يجُوزُ للرَّجُلِ أن ينظُرَ إلى المرأةِ فكذلك لا يجُوزُ للمَرأةِ أن تنظُرَ إلى الرَّجُلِ<\/p>\n<p>Just as it is not allowed for a man to stare at a woman, likewise it is not allowed for a woman to stare at a man.<\/p>\n<p>Source: al-Tamhīd 12\/113<\/p><\/blockquote>\n<p>Imam al-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّحِيحُ الَّذِي عَلَيْهِ جُمْهُورُ الْعُلَمَاءِ وَأَكْثَرُ الصَّحَابَةِ أَنَّهُ يَحْرُمُ عَلَى الْمَرْأَةِ النَّظَرُ إِلَى الْأَجْنَبِيِّ كَمَا يَحْرُمُ عَلَيْهِ النَّظَرُ إِلَيْهَا<\/p>\n<p>The correct opinion, as practiced by the majority of scholars and most of the Companions, is that it is forbidden for a woman to stare at an unrelated man, just as it is forbidden to stare at her.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 10\/96<\/p><\/blockquote>\n<p>Imam al-Nawawi, even though he allowed slave women to uncover, nevertheless prohibited staring at them with lust. After detailing the exception to slave women’s dress code, among others, he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَكِنْ يَحْرُمُ النَّظَرُ إِلَى الْأَمْرَدِ وَغَيْرِهِ بِالشَّهْوَةِ، وَكَذَا النَّظَرُ إِلَى الْمَحَارِمِ وَسَائِرِ الْمَذْكُورَاتِ فِي الضَّرْبِ السَّابِقِ بِالشَّهْوَةِ حَرَامٌ قَطْعًا<\/p>\n<p>But it is forbidden to gaze at beardless young men and others with lust. Likewise, gazing with lust at relatives, and the rest of things mentioned in the previous section, is absolutely forbidden.<\/p>\n<p>Source: Rawḍat al-Ṭālibīn 7\/24<\/p><\/blockquote>\n<p>Imam Ibn Hajar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اخْتَارَ النَّوَوِيُّ أَنَّ الْأَمَةَ كَالْحُرَّةِ فِي تَحْرِيمِ النَّظَرِ إلَيْهَا<\/p>\n<p>Al-Nawawi preferred the slave women to be like the free woman in regards to the prohibition of staring at them.<\/p>\n<p>Source: Talkhīṣ al-Ḥabīr 3\/312<\/p><\/blockquote>\n<p>Therefore, no permission was given by any scholars to stare lustfully at slave women, even when they were uncovered while working.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَذَلِكَ الْأَمَةُ إذَا كَانَ يُخَافُ بِهَا الْفِتْنَةُ كَانَ عَلَيْهَا أَنْ تُرْخِيَ مِنْ جِلْبَابِهَا وَتَحْتَجِبَ وَوَجَبَ غَضُّ الْبَصَرِعَنْهَا وَمِنْهَا وَلَيْسَ فِي الْكِتَابِ وَالسُّنَّةِ إبَاحَةُ النَّظَرِ إلَى عَامَّةِ الْإِمَاءِ وَلَا تَرْكُ احْتِجَابِهِنَّ وَإِبْدَاءُ زِينَتِهِنَّ<\/p>\n<p>Likewise, if there is temptation to stare at slave women, she must wear her cloak and veil herself as it is an obligation to lower the gaze from her as she must as well. There is nothing in the Book or the Sunnah to permit staring at slave women in general, nor for them to leave veiling and reveal their beauty.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 15\/373<\/p><\/blockquote>\n<p>Imam Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمْ يُطْلِقْ اللَّهُ وَرَسُولُهُ لِلْأَعْيُنِ النَّظَرَ إلَى الْإِمَاءِ الْبَارِعَاتِ الْجَمَالِ وَإِذَا خَشِيَ الْفِتْنَةَ بِالنَّظَرِ إلَى الْأَمَةِ حَرُمَ عَلَيْهِ بِلَا رَيْبٍ وَإِنَّمَا نَشَأَتْ الشُّبْهَةُ أَنَّ الشَّارِعَ شَرَعَ لِلْحَرَائِرِ أَنْ يَسْتُرْنَ وُجُوهَهُنَّ عَنْ الْأَجَانِبِ وَأَمَّا الْإِمَاءُ فَلَمْ يُوجِبْ عَلَيْهِنَّ ذَلِكَ، لَكِنَّ هَذَا فِي إمَاءِ الِاسْتِخْدَامِ وَالِابْتِذَالِ<\/p>\n<p>Allah and His Messenger did not permit the eyes to look at beautiful female slaves. If a man fears temptation by looking at a female slave, it is undoubtedly forbidden. The doubt arises because the Lawgiver has prescribed for free women to cover their faces from strangers, but as for female slaves, He did not require that of them. However, this applies to female slaves who are serving and assisting.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 2\/47<\/p><\/blockquote>\n<p>Shaykh Ibn ‘Uthaymeen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">في النَّظر خوف الفتنة ولا فرق في هذا بين النِّساء الحرائر والنِّساء الإماء. وقوله صحيح بلا شكٍّ، وهو الذي يجب المصير إليه<\/p>\n<p>With regards to gazing at women in fear of temptation, there is no difference between freewomen and slave women. This is the correct opinion, no doubt. It is obligatory to adhere to it.<\/p>\n<p>Source: Sharḥ al-Mumti’ ‘alá Zād al-Mustaqni’ 2\/158<\/p><\/blockquote>\n<p>Hence, slave women were given a concession to uncover more so than free women, but the jurists granted this concession to make their duties easier to fulfill. They would often work on hot days, breast feed, and run errands, so full veiling would be hard on them. This ruling was meant as an act of mercy, not lust.<\/p>\n<p>Some scholars supported their view that slave women were forbidden from veiling due to the report of Umar ibn al-Khattab:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ رَأَى عُمَرُ أَمَةً لَنَا مُتَقَنِّعَةً فَضَرَبَهَا وَقَالَ لَا تَشَبَّهِي بِالْحَرَائِرِ<\/p>\n<p>Umar saw one of our maidservants wearing a veil and he flogged her. Umar said, ‘Do not resemble free women.’<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 6\/236<\/p><\/blockquote>\n<p>Imam al-Bayhaqi commented|:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْآثَارُ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ فِي ذَلِكَ صَحِيحَةٌ، وَإِنَّهَا تَدُلُّ عَلَى أَنَّ رَأْسَهَا وَرَقَبَتَهَا وَمَا يَظْهَرُ مِنْهَا فِي حَالِ الْمِحْنَةِ لَيْسَ بِعَوْرَةٍ<\/p>\n<p>The report of Umar, may Allah be pleased with him, is authentic. It demonstrates that her head, her neck, and what is shown while she is working, is not ‘nakedness.’<\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 2\/320<\/p><\/blockquote>\n<p>The Imam confirms that the rationale for slave women uncovering more than free women is because the were in the working class. This is a merciful ruling to make their duties easier.<\/p>\n<p>In contrast, Imam Ibn Qattan did not acknowledge its authenticity:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هذا نصُّه وليس بصحيح ولا فيه أكثر من إنكاره عليها أن تتزيَّا بزي يظن يها من أجله أنها حرة<\/p>\n<p>This was explicitly reported from Umar and it is not authentic. It contains nothing more than his condemnation of her for wearing attire to make others assume she was a free woman.<\/p>\n<p>Source: Aḥkām al-Naẓar 1\/230<\/p><\/blockquote>\n<p>In any case, the policy of Umar was intended to preserve legal categories related to social status at the time. Slave women were often given lesser legal punishments than free women, they had different duties and allegiance to their master, slave women who dressed like free women could potentially mislead others by accessing restricted space, and so on. In a way, it resembles the uniforms worn today to distinguish employees from customers.<\/p>\n<p>That said, Umar’s policy was based upon governance considerations, not absolute divine law. It was appropriate for his social context, in his view.<\/p>\n<p>Later scholars discouraged this policy when the social context changed or the ruling of slave women uncovering was abused by lustful men, unlike the Companions who were masters at controlling their lusts and lowering their gaze.<\/p>\n<p>Imam al-Qurtubi, who lived in the 13<sup>th<\/sup> century, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ قِيلَ إِنَّهُ يَجِبُ السَّتْرُ وَالتَّقَنُّعُ الْآنَ فِي حَقِّ الْجَمِيعِ مِنَ الْحَرَائِرِ وَالْإِمَاءِ وَهَذَا كَمَا أَنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنَعُوا النِّسَاءَ الْمَسَاجِدَ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ قَوْلِهِ لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ<\/p>\n<p>It is said that now it must be a duty to cover and veil for all free and slave women. This is like the Companions of the Messenger of Allah when they prohibited women from the based after the Messenger of Allah passed away, despite his saying, ‘Do not prevent the female servants of Allah from attending the mosques.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 14\/244<\/p><\/blockquote>\n<p>The Imam cites the statement of Aisha, may Allah be pleased with her:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسْجِدَ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ<\/p>\n<p>Were the Messenger of Allah, peace and blessings be upon him, to see what women are now doing, he would have prevented them from attending the mosque, just as the women of the children of Israel were prevented from attending!<\/p>\n<p>Source: Ṣaḥīḥ Muslim 445, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/03\/26\/women-adab-masjid\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The reasoning here is that, although women are allowed to attend the mosques in general, the later generations of women began to abuse that privilege in many ways, so the Companions temporarily banned them from attending. In the same way, the concession for women to uncover was intended to ease their burden, but when it began to be abused, scholars called for its prohibition.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah likewise prohibited the concession with Turkish slave girls who entered Muslim society and began flaunting their beauty, in opposition to the intention of the ruling:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ كَانَتْ الْإِمَاءُ عَلَى عَهْدِ الصَّحَابَةِ يَمْشِينَ فِي الطُّرُقَاتِ مُنْكْشِفَاتٍ الرُّءُوسَ وَيَخْدِمْنَ الرِّجَالَ مَعَ سَلَامَةِ الْقُلُوبِ فَلَوْ أَرَادَ الرَّجُلُ أَنْ يَتْرُكَ الْإِمَاءَ التُّرْكِيَّاتِ الْحِسَانَ يَمْشِينَ بَيْنَ النَّاسِ فِي مِثْلِ هَذِهِ الْبِلَادِ وَالْأَوْقَاتِ كَمَا كَانَ أُولَئِكَ الْإِمَاءُ يَمْشِينَ كَانَ هَذَا مِنْ بَابِ الْفَسَادِ<\/p>\n<p>Maidservants, in the time of the Companions, used to walk in the streets with their heads uncovered and would serve men who had no ill intentions in their hearts. If a man were to let attractive Turkish maidservants walk among people in the likes of this time and place, as these maidservants had done, this would be a type of corruption.<\/p>\n<p>Source: Majmū’ al-Fatāwá 15\/418<\/p><\/blockquote>\n<p>This clearly demonstrates that classical rulings are subject to change due to their context. If the intended outcome is not being achieved, or even leads to corruption, a new appropriate ruling must replace it.<\/p>\n<p>Imam Ibn al-Qayyim warns scholars who simply repeat rulings found in scholarly heritage with no regard to changing circumstances:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ أَفْتَى النَّاسَ بِمُجَرَّدِ الْمَنْقُولِ فِي الْكُتُبِ عَلَى اخْتِلَافِ عُرْفِهِمْ وَعَوَائِدِهِمْ وَأَزْمِنَتِهِمْ وَأَمْكِنَتِهِمْ وَأَحْوَالِهِمْ وَقَرَائِنِ أَحْوَالِهِمْ فَقَدْ ضَلَّ وَأَضَلَّ وَكَانَتْ جِنَايَتُهُ عَلَى الدِّينِ أَعْظَمَ مِنْ جِنَايَةِ مَنْ طَبَّبَ النَّاسَ<\/p>\n<p>Whoever gives people verdicts based on what is transmitted in books, despite their differing customs, traditions, times, places, circumstances, and conditions, has gone astray and led others astray, and his crime against the religion is greater than the crime of one who mistreats people with medicine.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 3\/66<\/p><\/blockquote>\n<p>Such an ignorant and reckless approach to declaring rulings in Islam is extremely dangerous, even worse than a doctor committing malpractice. A doctor might harm the body, but a misguided scholar harms the eternal soul.<\/p>\n<p>In today’s cultures across the world, a woman’s breasts are considered inherently sexual, even though in many ancient cultures they may not have been. As such, the classical ruling of slave women uncovering is not appropriate in the modern period. It is also obsolete anyway as the Muslims have abolished slavery.<\/p>\n<p>In sum, some scholars allowed slave women to uncover more parts of their body, such as the head, arms, shins, and chest. This was intended to make it easier for the working classes to fulfill their duties. None of the scholars permitted looking at slave women, or any woman, with lust, according to the well-established teachings of the Quran and Sunnah. Other classical scholars advocated for an equal dress code for free and slave women. Today, the jurisprudence on slavery is irrelevant due to widespread abolition in the Muslim countries.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;O Prophet, tell your wives, your daughters, and the believing women&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[331,462,437,20,169,342,39,43,48,100,444,292,60,45,365,267,73,294,128],"class_list":["post-21511","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-chastity-al-hisn","tag-concessions-al-rukhsah","tag-concubines-al-surriyyah","tag-creation-al-khalq","tag-ease-yusr","tag-al-fiqh","tag-imam-ahmad-ibn-hanbal","tag-imam-malik","tag-justice-adl","tag-manners-al-adab","tag-misconceptions","tag-modesty-al-haya","tag-prayer-salat","tag-quran-exegesis-tafsir","tag-recommendation-al-mustahab","tag-slavery-al-istibad","tag-umar-ibn-al-khattab","tag-veiling-hijab","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5AX","jetpack-related-posts":[{"id":24377,"url":"https:\/\/www.abuaminaelias.com\/touching-slave-girls-market\/","url_meta":{"origin":21511,"position":0},"title":"Touching slave girls in the market?","author":"Abu Amina Elias","date":"January 13, 2023","format":false,"excerpt":"\"Proper analysis of these narrations will demonstrate that there was nothing sexual about this practice.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16852,"url":"https:\/\/www.abuaminaelias.com\/no-theology-of-rape-in-islam\/","url_meta":{"origin":21511,"position":1},"title":"No theology of rape in Islam","author":"Abu Amina Elias","date":"August 20, 2015","format":false,"excerpt":"\"Scholars agree that the rapist must be given legal punishment,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14966,"url":"https:\/\/www.abuaminaelias.com\/hijab-niqab-standards\/","url_meta":{"origin":21511,"position":2},"title":"Must a Muslim woman cover her face?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Tell the believing women to lower their gaze...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15738,"url":"https:\/\/www.abuaminaelias.com\/muslims-not-punished-for-killing-non-muslims\/","url_meta":{"origin":21511,"position":3},"title":"Muslims not punished for killing non-Muslims?","author":"Abu Amina Elias","date":"May 28, 2014","format":false,"excerpt":"\"The general rule is that all crimes should be prosecuted and punished equally,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23559,"url":"https:\/\/www.abuaminaelias.com\/shariah-fiqh-qanun\/","url_meta":{"origin":21511,"position":4},"title":"Sharia, Fiqh, and Islamic law explained","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"To whomever Allah wills goodness, He grants him understanding of the religion.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25318,"url":"https:\/\/www.abuaminaelias.com\/manhaj-of-the-salaf\/","url_meta":{"origin":21511,"position":5},"title":"Following the Way of the Salaf","author":"Abu Amina Elias","date":"May 30, 2025","format":false,"excerpt":"\"The best people are those of my generation, then those who come after them...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21511","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21511"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21511\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21511"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}