{"id":21526,"date":"2019-12-23T14:50:04","date_gmt":"2019-12-23T10:50:04","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21526"},"modified":"2020-07-18T07:01:06","modified_gmt":"2020-07-18T03:01:06","slug":"jinn-demons-paranormal-activity","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/jinn-demons-paranormal-activity\/","title":{"rendered":"Jinn, demons, and paranormal activity"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Every culture across the world has stories about ethereal or inter-dimensional beings who exist beyond the material world. People might understand them as ghosts (spirits of dead people), demons (malevolent spirits), or even aliens from another planet. Many people have also documented their experiences with paranormal activity, in which the ordinary laws of nature appear to bend or break. The Quran and Sunnah explain that these phenomena are caused by the <em>jinn<\/em>.<\/p>\n<p>The jinn are a species of intelligent creatures who were created by Allah from an intense, smokeless fire. They exist in the Unseen realm of creation, another dimension without physical or material form. Many jinn are merely creatures like any other animal, but Satan, or <em>Iblis<\/em>, is the leader of the evil jinn.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا بَنِي آدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطَانُ كَمَا أَخْرَجَ أَبَوَيْكُم مِّنَ الْجَنَّةِ يَنزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْآتِهِمَا ۗ إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ ۗ إِنَّا جَعَلْنَا الشَّيَاطِينَ أَوْلِيَاءَ لِلَّذِينَ لَا يُؤْمِنُونَ<\/p>\n<p><strong>O children of Adam, let not Satan tempt you as he had expelled your parents from the garden, stripping their clothes to reveal their nakedness. He and his tribe see you from where you do not see them. Verily, We have appointed devils as the allies of those who do not have faith.<\/strong><\/p>\n<p>Surat al-A’raf 7:27<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْجَانَّ خَلَقْنَاهُ مِن قَبْلُ مِن نَّارِ السَّمُومِ<\/p>\n<p><strong>We created the jinn before from a scorching fire.<\/strong><\/p>\n<p>Surat al-Hijr 15:27<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَخَلَقَ الْجَانَّ مِن مَّارِجٍ مِّن نَّارٍ<\/p>\n<p><strong>He created the jinn from a mixture of fire.<\/strong><\/p>\n<p>Surat al-Rahman 55:15<\/p><\/blockquote>\n<p>Ibn Abbas commented on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّهَا نَارٌ لَا دُخَانَ لَهَا وَالصَّوَاعِقُ تَكُونُ مِنْهَا<\/p>\n<p>It is a fire without smoke and lightning bolts come from it.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 55:15<\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خُلِقَتْ الْمَلَائِكَةُ مِنْ نُورٍ وَخُلِقَ الْجَانُّ مِنْ مَارِجٍ مِنْ نَارٍ وَخُلِقَ آدَمُ مِمَّا وُصِفَ لَكُمْ<\/p>\n<p><strong>The angels were created from light, the jinn were created from a mixture of fire, and Adam was created as has been described for you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2996, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/12\/23\/angels-jinn-insan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمَارِجُ اللَّهَبُ الْمُخْتَلِطُ بِسَوَادِ النَّارِ<\/p>\n<p>The mixture is a flame blended in the blackness of fire.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 2996<\/p><\/blockquote>\n<p>From these descriptions, it is clear that the jinn do not have physical bodies like the rest of creatures, although the exact scientific modality (<em>kayfiyyah<\/em>) of their existence remains unknown. Science by definition can only study physical, tangible objects, so it has little to tell us about the nature of jinn.<\/p>\n<p>The jinn can see us and interact with us, while we cannot see them unless they materialize in a form of their choosing. Different species of jinn have the power to shape-shift or assume various corporeal forms to affect the physical world.<\/p>\n<p>Abu Tha’labah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْجِنُّ عَلَى ثَلَاثَةِ أَصْنَافٍ صِنْفٌ كِلَابٌ وَحَيَّاتٌ وَصِنْفٌ يَطِيرُونَ فِي الْهَوَاءِ وَصِنْفٌ يَحُلُّونَ وَيَظْعَنُونَ<\/p>\n<p><strong>The jinn have three forms: one form like dogs and snakes, one form flies through the air, and one form comes and goes.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 6156, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/12\/22\/three-forms-jinn\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Many people have encountered ‘ghosts’ or ‘poltergeists’ with the appearance of dead loved ones or people from the past. Many other people witness ‘aliens’ and ‘UFOs’ which they think are creatures from another planet. In reality, these experiences are caused by mischievous jinn who take on these forms as a trick.<\/p>\n<p>Jinn also have the ability to appear in people&#8217;s dreams, but they are unable to take the form of the Prophet (ṣ).<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي<\/p>\n<p><strong>Whoever sees me in a dream has truly seen me, for Satan cannot assume my form<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6592, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/24\/seeing-muhammad-in-your-dreams\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Like human beings, there are both good and evil jinn. They can choose to have faith in Allah and perform good deeds, or to disbelieve in Allah and follow the commands of their chief, Satan.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ ۖ فَمَنْ أَسْلَمَ فَأُولَٰئِكَ تَحَرَّوْا رَشَدًا<\/p>\n<p><strong>The jinn said: Among us are those who surrender to Allah and those who are unjust. Whoever surrenders to Allah, they have taken the right course.<\/strong><\/p>\n<p>Surat al-Jinn 72:14.<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنزِلَ مِن بَعْدِ مُوسَىٰ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَىٰ طَرِيقٍ مُّسْتَقِيمٍ<\/p>\n<p><strong>The jinn said: Our people, we have heard a book revealed after Moses, confirming what is in your hands, guiding to the truth and guiding to a straight path.<\/strong><\/p>\n<p>Surat al-Ahqaf 46:30<\/p><\/blockquote>\n<p>The evil jinn are ordered by Iblis to whisper dark thoughts into the minds of people. Every person has been assigned a devil-companion (<em>qarin<\/em>) who tries to exploit the weaknesses of humankind by suggesting they act upon their sinful temptations, although Allah has protected His Messengers from their negative influence.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدتُّكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِيَ عَلَيْكُم مِّن سُلْطَانٍ إِلَّا أَن دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي ۖ فَلَا تَلُومُونِي وَلُومُوا أَنفُسَكُم<\/p>\n<p><strong>Satan will say when the matter is concluded: Indeed, Allah promised you the truth but I promised you and betrayed you. I had no authority over you except that I called you and you answered me. Do not blame me, but rather blame yourselves.<\/strong><\/p>\n<p>Surat Ibrahim 14:22<\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنْ الْجِنِّ<\/p>\n<p><strong>Each one of you has a devil-companion from the jinn over him<\/strong>.<\/p><\/blockquote>\n<p>They said, “Even you, O Messenger of Allah?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِيَّايَ إِلَّا أَنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ فَلَا يَأْمُرُنِي إِلَّا بِخَيْرٍ<\/p>\n<p><strong>Even me, yet Allah helped me against him until he embraced Islam. He does not order me to do anything but good<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2814, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/04\/20\/shaytan-satan-qareen-whispering\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلشَّيْطَانِ لَمَّةً بِابْنِ آدَمَ وَلِلْمَلَكِ لَمَّةً فَأَمَّا لَمَّةُ الشَّيْطَانِ فَإِيعَادٌ بِالشَّرِّ وَتَكْذِيبٌ بِالحَقِّ وَأَمَّا لَمَّةُ الْمَلَكِ فَإِيعَادٌ بِالخَيْرِ وَتَصْدِيقٌ بِالحَقِّ فَمَنْ وَجَدَ ذَلِكَ فَلْيَعْلَمْ أَنَّهُ مِنَ اللهِ فَلْيَحْمَدِ اللَّهَ وَمَنْ وَجَدَ الأُخْرَى فَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ<\/p>\n<p><strong>Verily, Satan has influence with the son of Adam and the angel has influence. As for the influence of Satan, he promises evil and denies the truth. As for the influence of the angel, he promises goodness and affirms the truth. Whoever finds this goodness, let him know that it is from Allah and let him praise Allah. Whoever finds something else, let him seek refuge in Allah from the accursed Satan.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet (ṣ) recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُم بِالْفَحْشَاءِ وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا<\/p>\n<p><strong>Satan threatens you with poverty and commands evil, but Allah promises you forgiveness and favor from Him<\/strong>. (2:268)<\/p>\n<p>Source: Sunan al-Tirmidhī 2988, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/08\/14\/waswas-angels-devils\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Because jinn have an ethereal existence, they are in closer proximity to the angels and can sometimes overhear bits of their discourse. This is how fortune-tellers, soothsayers, and black magicians can acquire some knowledge of the future. But the jinn who support these soothsayers are evil, so they mix the little truth they give them with many lies.<\/p>\n<p>Aisha reported: Some people asked the Messenger of Allah, peace and blessings be upon him, about soothsayers. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسُوا بِشَيْءٍ<\/p>\n<p><strong>They are nothing<\/strong>.<\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, sometimes they speak about things that come true.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تِلْكَ الْكَلِمَةُ مِنْ الْجِنِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِي أُذُنِ وَلِيِّهِ قَرَّ الدَّجَاجَةِ فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍ<\/p>\n<p><strong>Those are the words snatched by the jinn, who whisper it into the ears of their friends and it is mixed with more than one hundred lies<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5859, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/01\/29\/soothsayers-jinn-mix-lies\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The jinn can only acquire such knowledge if Allah allows them to do so, since Allah is in full control of the heavens and earth. If Allah wills, He can banish them from the heavens with fiery projectiles.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا<\/p>\n<p><strong>The jinn said: We used to sit to listen, but whoever listens now will find a flame lying in wait.<\/strong><\/p>\n<p>Surat al-Jinn 72:9<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَجَعَلْنَاهَا رُجُومًا لِّلشَّيَاطِينِ<\/p>\n<p><strong>We have adorned the lowest heavens with lamps and have made them missiles against the devils.<\/strong><\/p>\n<p>Surat al-Mulk 67:5<\/p><\/blockquote>\n<p>Just as the jinn were created by a fire unlike the ordinary fire we experience, the shooting stars that are thrown at them are unlike the ordinary meteors and space rocks we can identify. Again, the scientific modality of these matters is unknown because they exist in a realm inaccessible and imperceptible to us.<\/p>\n<p>We are all exposed to the whispering of devils among jinn in our daily lives, as we struggle with ordinary day-to-day temptations to commit sins. We are also potentially vulnerable to black magicians who contact the jinn via Satanic rituals and command them to attack and harass their chosen victims. Yet protecting ourselves from them is easy as long as we remain vigilant in the remembrance of Allah.<\/p>\n<p>The key to protecting ourselves from evil jinn is to not assign importance to them by cursing them or trying to ‘defeat’ them. Rather, it is best to ignore them by returning our mindfulness and awareness to Allah. If we leave them alone, they will leave us alone. Simply saying the name of Allah, just by itself, has the power to banish Satan.<\/p>\n<p>Abu al-Malih reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَقُلْ تَعِسَ الشَّيْطَانُ فَإِنَّكَ إِذَا قُلْتَ ذَلِكَ تَعَاظَمَ حَتَّى يَكُونَ مِثْلَ الْبَيْتِ وَيَقُولُ بِقُوَّتِي وَلَكِنْ قُلْ بِسْمِ اللَّهِ فَإِنَّكَ إِذَا قُلْتَ ذَلِكَ تَصَاغَرَ حَتَّى يَكُونَ مِثْلَ الذُّبَابِ<\/p>\n<p><strong>Do not say: May Satan perish. Verily, if you say that he will swell up with pride until he is as big as a house and he says: By my might! Rather, you should say: In the name of Allah. Verily, if you say that he will shrink until he is as small as a fly<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 4982, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/24\/not-curse-shaytan-dhikr-allah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تَسُبُّوا الشَّيْطَانَ وَتَعَوَّذُوا بِاللَّهِ مِنْ شَرِّهِ<\/p>\n<p><strong>Do not curse Satan, but rather seek refuge in Allah from his evil.<\/strong><\/p>\n<p>Source: al-Mukhalliṣīyāt 1572, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/06\/28\/not-curse-shaytan-refuge-allah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ يَعْنِي إِذَا خَرَجَ مِنْ بَيْتِهِ بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ يُقَالُ لَهُ كُفِيتَ وَوُقِيتَ وَتَنَحَّى عَنْهُ الشَّيْطَانُ<\/p>\n<p><strong>Whoever says when he leaves his house, ‘In the name of Allah, I trust in Allah for there is no power or might but with Allah,’ then it will be said to him that you have been sufficed and protected, and the devils will be far from him<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3426, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/19\/dua-leaving-house-shaytan\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Jabir reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الشَّيْطَانَ إِذَا سَمِعَ النِّدَاءَ بِالصَّلَاةِ ذَهَبَ حَتَّى يَكُونَ مَكَانَ الرَّوْحَاءِ<\/p>\n<p><strong>Verily, when Satan hears the call to prayer, he flees to a very distant place.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 388, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/28\/shaytan-flees-from-adhan\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Quran is likewise our most powerful defense against the evil jinn. In particular, the chapters of Surat al-Baqarah, Surat al-Falaq, and Surat al-Nas are especially potent in warding off demonic entities.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, entrusted me to protect the charity of Ramadan. Someone came to me and began taking from the food. I took hold of him and I said, “I will certainly take you to the Messenger of Allah!” Abu Huraira told the story to the Prophet and he said, “The man told me that when I go to bed, I should recite the verse of the throne (2:255). Allah would appoint a protector with me and no devil would come near to me until morning.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَدَقَكَ وَهُوَ كَذُوبٌ ذَاكَ شَيْطَانٌ<\/p>\n<p><strong>He told you the truth, although he is a liar. That was Satan<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4723, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/12\/22\/ayat-al-kursi-protection-shaytan\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> إِنَّ الشَّيْطَانَ يَنْفِرُ مِنْ الْبَيْتِ الَّذِي تُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ<\/p>\n<p><strong>Verily, Satan flees from the house in which Surat al-Baqarah is recited<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 780, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/28\/shaytan-runs-surah-baqarah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Nu’man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْآيَتَانِ خُتِمَ بِهِمَا سُورَةُ الْبَقَرَةِ لَا تُقْرَآنِ فِي دَارٍ ثَلَاثَ لَيَالٍ فَيَقْرَبُهَا شَيْطَانٌ<\/p>\n<p><strong>Satan does not come near a house in which the last two verses of Surat al-Baqarah have been recited for three nights.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 782, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/06\/shaytan-last-two-ayah-baqarah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Sa’id reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ الْجَانِّ وَعَيْنِ الْإِنْسَانِ حَتَّى نَزَلَتْ الْمُعَوِّذَتَانِ فَلَمَّا نَزَلَتَا أَخَذَ بِهِمَا وَتَرَكَ مَا سِوَاهُمَا<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would seek refuge from jinn and the evil eye of man, until the two chapters of refuge were revealed, Surat al-Falaq and al-Nas. After they were revealed, he took both of them and left everything else.<\/p>\n<p>Source: Sunan al-Tirmidhī 2058, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/03\/two-surahs-refuge-falaq-nas\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>‘Uqbah ibn ‘Amir reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ أَنْزَلَ اللَّهُ عَلَيَّ آيَاتٍ لَمْ يُرَ مِثْلُهُنَّ قُلْ أَعُوذُ بِرَبِّ النَّاسِ إِلَى آخِرِ السُّورَةِ وَ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ إِلَى آخِرِ السُّورَةِ<\/p>\n<p><strong>Allah has revealed verses the likes of which you have never seen, ‘Say: I seek refuge in the Lord of the people,’<\/strong> (114:1) <strong>and, ‘Say; I seek refuge in the Lord of the daybreak<\/strong>.&#8217; (113:1)<\/p>\n<p>Source: Sunan al-Tirmidhī 2902, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/27\/virtues-surah-nas-falaq\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imams and scholars will use the Quran to treat a person who is being harassed or controlled by jinn. However, for any true case of possession in need of an exorcism, which is a documented but very rare phenomenon, we must consult religious, medical, and psychological experts for their advice on a holistic treatment plan.<\/p>\n<p>Lastly, we should not be paranoid over the jinn, just as we should not be afraid of ordinary animals. In fact, the jinn are usually more afraid of us than we are of them, but they become emboldened when they sense our fear.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا<\/p>\n<p><strong>Among humankind were men who sought refuge in the men of the jinn, but it only increased their burden.<\/strong><\/p>\n<p>Surat al-Jinn 72:6<\/p><\/blockquote>\n<p>‘Ikramah commented on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ الْجِنُّ يَفْرَقُونَ مِنَ الْإِنْسِ كَمَا يَفْرَقُ الْإِنْسُ مِنْهُمْ أَوْ أَشَدَّ وَكَانَ الْإِنْسُ إِذَا نَزَلُوا وَادِيًا هَرَبَ الْجِنُّ فَيَقُولُ سَيِّدُ الْقَوْمِ نَعُوذُ بِسَيِّدِ أَهْلِ هَذَا الْوَادِي فَقَالَ الْجِنُّ نَرَاهُمْ يَفْرَقُونَ مِنَّا كَمَا نَفْرَقُ مِنْهُمْ فَدَنَوْا مِنَ الْإِنْسِ فَأَصَابُوهُمْ بِالْخَبَلِ وَالْجُنُونِ<\/p>\n<p>The jinn used to leave when people came, just as people used to run away from them or even more so. When humans descended into a valley, the jinn would flee but the chief of the people would say: We seek refuge with the chief of this valley. The jinn would say: We saw them running away from us just as we ran from them. Thus, the jinn would come close to the humans and afflict them with insanity and madness.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 72:6<\/p><\/blockquote>\n<p>The jinn would be afraid when a group of people came into their valley, but once they saw how much the people feared them, the jinn realized they could harass them without consequence. Giving such importance to the jinn only inflates their egos. Instead, we can use the name of Allah to banish any evil jinn at any time.<\/p>\n<p>In sum, the jinn are a species of intelligent creatures who exist beyond the physical world, in a manner that is scientifically unknown. Some of them can materialize in a form of their choosing, sometimes impersonating people or pretending to be frightening monsters. Like humans, they can be good or evil. The evil jinn, at the behest of their leader Satan, whisper evil suggestions into the hearts and minds of people. Soothsayers, fortune-tellers, and black magicians can also harness the abilities of evil jinn through ceremonial magic, although such power comes at the price of their souls. We can protect ourselves from these evil forces by being vigilant in remembering Allah, following the teachings of Islam, frequently mentioning the name of Allah, and reciting the Quran.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Satan and his tribe see you from where you do not see them.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[300,122,464,17,20,386,463,26,34,326,461,100,57,372,196,306,376,400,66,68,220,450,465,466,403],"class_list":["post-21526","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-adam","tag-angels-malaikah","tag-call-to-prayer-al-adhan","tag-charity-al-sadaqah","tag-creation-al-khalq","tag-curses-al-laan","tag-dreams-al-ruyaa","tag-forgiveness-al-maghfirah","tag-humanity-al-insaaniyyah","tag-jinn","tag-magic-al-sihr","tag-manners-al-adab","tag-moses-musa","tag-allah-names-asma-ul-husna","tag-prophetic-virtues","tag-ramadan","tag-recitation-al-tilawah","tag-refuge-al-taawwudh","tag-remembrance-dhikr","tag-satan-al-shaytan","tag-supplication-al-dua","tag-surah-al-baqarah","tag-surah-al-falaq","tag-surah-al-nas","tag-unseen-al-ghayb"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Bc","jetpack-related-posts":[{"id":23084,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-baqarah-ali-imran\/","url_meta":{"origin":21526,"position":0},"title":"Imam al-Mundhiri on Surat al-Baqarah and Ali &#8216;Imran","author":"Abu Amina Elias","date":"April 28, 2021","format":false,"excerpt":"\"Recite Surat al-Baqarah in your houses...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12950,"url":"https:\/\/www.abuaminaelias.com\/light-surah-al-kahf-jumuah\/","url_meta":{"origin":21526,"position":1},"title":"Light for reciting Surat al-Kahf on Friday","author":"Abu Amina Elias","date":"March 15, 2013","format":false,"excerpt":"\"Whoever recites Surat al-Kahf on Friday will have light...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14891,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-special-verses-of-the-quran\/","url_meta":{"origin":21526,"position":2},"title":"Imam al-Nawawi on Special Verses of the Quran","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"I will teach you the greatest chapter in the Quran....\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23079,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-fatihah\/","url_meta":{"origin":21526,"position":3},"title":"Imam al-Mundhiri on Virtues of Surat al-Fatihah","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"All praise is due to Allah, the Lord of the worlds,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13539,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-reading-the-quran\/","url_meta":{"origin":21526,"position":4},"title":"Imam al-Nawawi on Reading and Reciting the Quran","author":"Abu Amina Elias","date":"May 16, 2013","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21235,"url":"https:\/\/www.abuaminaelias.com\/ten-ayat-surah-kahf-dajjal\/","url_meta":{"origin":21526,"position":5},"title":"Ten verses of Surat al-Kahf to protect from Dajjal","author":"Abu Amina Elias","date":"September 20, 2019","format":false,"excerpt":"\"Whoever contemplates them will not be misled by the trials of the False Messiah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21526","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21526"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21526\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21526"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21526"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21526"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}