{"id":21554,"date":"2020-01-05T14:07:37","date_gmt":"2020-01-05T10:07:37","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21554"},"modified":"2020-07-17T22:29:29","modified_gmt":"2020-07-17T18:29:29","slug":"nikah-al-misyar-travelers-marriage","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/nikah-al-misyar-travelers-marriage\/","title":{"rendered":"Nikah al-Misyar: Is traveler’s marriage permissible?"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The traveler’s marriage (<em>nikah al-misyar<\/em>) is a marital arrangement in which a prospective wife agrees to a limited set of rights as compared to a full, ordinary marriage. She may forego her entitlement to financial maintenance, residence, and regular companionship, while the husband may enjoy sexual intimacy with her whenever he visits her. What is the status of this arrangement in Islam?<\/p>\n<p>This type of marriage is highly controversial for good reason, as it is being abused in practice. It was originally designed to accommodate men who travel often or may not have the resources for a full marriage, while also providing divorcees and widows with much-needed companionship. These are valid concerns that need suitable answers and any roadblock preventing good people from enjoying the full benefits of marriage should be removed. However, the practice of <em>misyar<\/em> has failed to resolve these social problems and, in addition to being of questionable legitimacy in Islam, has instead created even more unintended harm.<\/p>\n<p>The basis of <em>misyar<\/em> is the idea that a woman may consent to a limited amount of rights in her marriage contract. A similar arrangement in the time of the Salaf was known as ‘daytime marriage’ (<em>nikah al-nahariyyat<\/em>), in which a husband only visited his wife during the day or an otherwise limited amount of time. Some early scholars saw nothing wrong with this, but others viewed it as morally objectionable.<\/p>\n<p>Hisham reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنِ ابْنِ سِيرِينَ أَنَّهُ كَانَ يَكْرَهُ نِكَاحَ النَّهَارِيَّاتِ<\/p>\n<p>Ibn Sirin disapproved of the daytime marriage.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 16560<\/p><\/blockquote>\n<p>Shu’bah reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنْ حَمَّادٍ أَنَّهُ كَرِهَهُ<\/p>\n<p>Hammad disapproved of it.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 16562<\/p><\/blockquote>\n<p>Another arrangement more closely tied to today’s <em>misyar<\/em> were marriages in which a husband restricted the amount of financial rights his wife would enjoy. Some early Muslim scholars likewise found this distasteful and problematic.<\/p>\n<p>Ma’mar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنِ الزُّهْرِيِّ كَانَ يُسْأَلُ عَنِ الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ فَيَشْتَرِطُ عَلَيْهَا أَنْ لَا يَأْتِيَهَا كَذَا وَكَذَا وَلَا يُنْفِقُ عَلَيْهَا إِلَّا شَيْئًا مَعْلُومًا وَكَانَ يَكْرَهُهُ<\/p>\n<p>Al-Zuhri was asked about a man who marries a woman on condition that he would not come to her at certain times and would not spend on her except for a specific amount, and he disapproved of it.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 16564<\/p><\/blockquote>\n<p>Compounding the problem today is that many <em>misyar<\/em> marriages are kept secret, either from the first wife or their own family members. These marriages meet the minimum requirements of legal validity according to most scholars (a guardian and two credible witnesses), but they are otherwise concealed from the public.<\/p>\n<p>The secret nature of any marital relationship casts doubt upon its legitimacy. It is almost certainly immoral, even though it may not be strictly illegal. Indeed, people often keep secrets because their conscience has detected something blameworthy and shameful. Most scholars viewed secret marriages as <em>makruh<\/em>, that is, morally disapproved, while a significant number of scholars considered them to be <em>haram<\/em>, forbidden and sinful.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعْلِنُوا هَذَا النِّكَاحَ وَاجْعَلُوهُ فِي الْمَسَاجِدِ وَاضْرِبُوا عَلَيْهِ بِالدُّفُوفِ<\/p>\n<p><strong>Announce this marriage publicly, conduct it in the mosque, and strike the drums for it.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1089, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/10\/10\/hadith-on-marriage-declare-marriage-publicly-not-in-secret\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Muhammad ibn Hatib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَصْلُ مَا بَيْنَ الْحَرَامِ وَالْحَلَالِ الدُّفُّ وَالصَّوْتُ<\/p>\n<p><strong>The difference between an unlawful and lawful marriage is the beating of drums and the raising of voices.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1088, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/02\/15\/hadith-on-marriage-a-lawful-marriage-must-be-announced-publicly\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ الشَّارِعَ اشْتَرَطَ لِلنِّكَاحِ شُرُوطًا زَائِدَةً عَلَى الْعَقْدِ تَقْطَعُ عَنْهُ شُبَهَ السِّفَاحِ كَالْإِعْلَامِ وَالْوَلِيِّ وَمَنْعِ امْرَأَةٍ أَنْ تَلِيَهُ بِنَفْسِهَا وَنَدَبَ إلَى إظْهَارِهِ حَتَّى اُسْتُحِبَّ فِيهِ الدُّفُّ وَالصَّوْتُ وَالْوَلِيمَةُ<\/p>\n<p>The Lawgiver has set conditions for marriage, in addition to the contract, in order to cut off any suspicion of promiscuity, such as the announcement, the guardian, and preventing a woman from conducting it by herself. It is encouraged to publicize it, even recommended to beat the drums, raise voices, and hold a banquet.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 3\/113<\/p><\/blockquote>\n<p>At best, one can say that a secret or concealed marriage is morally reprehensible but legally valid, meaning a Muslim will not be punished by law for doing it but will be divinely rewarded for <em>not<\/em> doing it. None of the great Imams ever morally blessed a secret marriage. They only differed over the degree to which it should be discouraged, with some considering it as an act of outright adultery.<\/p>\n<p>As for <em>misyar<\/em> today, leading scholars have issued verdicts against the practice. Shaykh al-Albani considered <em>misyar<\/em> marriage to be forbidden for two reasons. First, it contradicts the purpose of marriage as Allah expressed in the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا لِّتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ<\/p>\n<p><strong>Among His signs is that He created mates for you from among yourselves that you may seek repose with them, and He placed love and mercy between you. Verily, in that are signs for people who reflect.<\/strong><\/p>\n<p>Surat al-Rum 30:21<\/p><\/blockquote>\n<p>A <em>misyar<\/em> marriage is often temporary, since as many as a staggering <a href=\"https:\/\/www.thenational.ae\/traditional-temporary-marriages-are-now-a-permanent-problem-1.316300\">80% of them end in divorce<\/a>, whereas regular marriage is supposed to be a stable environment for raising children. This shocking divorce-rate goes against the basic objective of marriage, which is to build a functional and righteous family over the long-term.<\/p>\n<p>Second, the <em>misyar<\/em> was not designed for raising children and thus it is an ineffective institution for families. Shaykh al-Albani said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أنه قد يقدَّر للزوج أولاد من هذه المرأة وبسبب البعد عنها وقلة مجيئه إليها سينعكس ذلك سلباً على أولاده في تربيتهم وخلقهم<\/p>\n<p>It may be divinely decreed that the husband has children from this wife. Because of the long distance from her and the infrequency of his coming to her, that will have negative repercussions on his children in regards to their upbringing and their character.<\/p>\n<p>Source: Aḥkām al-Ta&#8217;addud fī Ḍaw&#8217; al-Kitāb wal-Sunnah 2\/29<\/p><\/blockquote>\n<p>Put differently, a <em>misyar<\/em> marriage is usually temporary, childless, and based upon lust, rather than encouraging responsible procreation. If it does result in children, their father cannot realistically contribute to their education and upbringing. These children will grow up in fatherless homes for all practical purposes, which is very unfair to them and shifts the burden for their care onto others.<\/p>\n<p>Senior scholars such as Shaykh Ibn ‘Uthaymin and Grand Mufti Shaykh Bin Baz permitted <em>misyar<\/em> at first, but they later changed their views when the harmful social consequences became apparent to them. Shayhk Bin Baz was asked about <em>misyar<\/em> marriage specifically and he replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الواجب على كل مسلم أن يتزوج الزواج الشرعي وأن يحذر ما يخالف ذلك سواء سمي زواج مسيار أو غير ذلك ومن شرط الزواج الشرعي الإعلان فإذا كتمه الزوجان لم يصح لأنه والحال ما ذكر أشبه بالزنى<\/p>\n<p>It is an obligation upon every Muslim to conduct a marriage lawfully and to beware of anything else, whether it is called ‘traveler’s marriage’ or otherwise. Among the lawful conditions of marriage is that it be announced publicly. If the two spouses conceal it, it is not valid because the situation described resembles adultery.<\/p>\n<p>Source: Majmūʻ Fatāwá wa Maqālāt Mutanawwiʻah 20\/432<\/p><\/blockquote>\n<p>The Shaykh was also asked about the various types of secret and controversial marriages practiced by Muslims today (<em>sirri<\/em>, <em>mut’ah<\/em>, <em>misyar<\/em>, <em>‘urfi<\/em>) and he issued a sweeping verdict as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هذه الأنواع كلها لا تجوز لكونها مخالفة للشرع المطهر إنما النكاح الشرعي هو المعلن المشتمل على أركان النكاح وشروطه المعتبرة شرعا<\/p>\n<p>All of these categories are not permissible as they contradict the pure law. Indeed, lawful marriage is to be announced and inclusive of the pillars of marriage and its legal conditions.<\/p>\n<p>Source: Majmūʻ Fatāwá wa Maqālāt Mutanawwiʻah 20\/428<\/p><\/blockquote>\n<p>It is clear that a minimalist approach to legal validity in marriage fails to achieve the purpose for which marriage was legislated by Allah in the first place. Not only that, <em>misyar<\/em> is an ideal vehicle for sexual predators, groomers, swingers, criminals, and abusers to indulge their darkest fantasies under the thin veneer of Islamic legitimacy.<\/p>\n<p>To be fair, proponents of <em>misyar<\/em> marriage consider it a creative solution to real social problems, such as extravagant wedding demands, loneliness of divorcees and widows, and sexual frustration of single men. These are all important issues, but the solution does not lie in legal stratagems or loopholes as a means to side-step the serious prohibition of adultery. Rather, the answer is to revive the pure Sunnah in regards to these issues: discouraging exorbitant dowries and extravagant weddings, removing the stigma of remarriage from divorcees and widows, implementing a routine of fasting as a cure for sexual frustration, and generally promoting a family-friendly marriage culture.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;All of these categories are not permissible as they contradict the pure law.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[16,282,18,24,85,342,32,48,53,444,91,72,128],"class_list":["post-21554","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-character-akhlaq","tag-children","tag-community-jamaah","tag-family-ties-sillat-rahim","tag-fasting-al-siyam","tag-al-fiqh","tag-hereafter-akhirah","tag-justice-adl","tag-marriage-al-nikah","tag-misconceptions","tag-righteous-predecessors-al-salaf-al-salih","tag-truthfulness-al-sidq","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5BE","jetpack-related-posts":[{"id":21566,"url":"https:\/\/www.abuaminaelias.com\/triple-talaq-nikah-halala\/","url_meta":{"origin":21554,"position":0},"title":"Triple Talaq and Nikah Halala are major sins","author":"Abu Amina Elias","date":"January 7, 2020","format":false,"excerpt":"\"They used to severely punish whoever divorced his wife three times in one sitting.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18921,"url":"https:\/\/www.abuaminaelias.com\/secret-marriages-are-forbidden-in-islam\/","url_meta":{"origin":21554,"position":1},"title":"Secret marriages are forbidden in Islam","author":"Abu Amina Elias","date":"February 15, 2018","format":false,"excerpt":"\"This is a secret marriage and I do not permit it.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19476,"url":"https:\/\/www.abuaminaelias.com\/ali-ibn-abi-talib-rape-girl\/","url_meta":{"origin":21554,"position":2},"title":"Did &#8216;Ali ibn Abi Talib rape an underage girl?","author":"Abu Amina Elias","date":"April 16, 2018","format":false,"excerpt":"\"Do not cause harm or return harm.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13019,"url":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-pedophile\/","url_meta":{"origin":21554,"position":3},"title":"Was Prophet Muhammad a pedophile?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Prophet never struck a woman...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19511,"url":"https:\/\/www.abuaminaelias.com\/consent-marriage-concubines\/","url_meta":{"origin":21554,"position":4},"title":"Sexual Consent, Marriage, and Concubines in Islam","author":"Abu Amina Elias","date":"April 24, 2018","format":false,"excerpt":"\"...he may not touch her, lie with her, or have intercourse with her unless she consents.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19829,"url":"https:\/\/www.abuaminaelias.com\/verse-65-4-child-marriage\/","url_meta":{"origin":21554,"position":5},"title":"Child Marriage in Islam?","author":"Abu Amina Elias","date":"August 13, 2018","format":false,"excerpt":"\"Does verse 65:4 encourage child marriage?\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21554","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21554"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21554\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21554"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21554"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21554"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}