{"id":21566,"date":"2020-01-07T15:17:50","date_gmt":"2020-01-07T11:17:50","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21566"},"modified":"2020-07-17T21:47:16","modified_gmt":"2020-07-17T17:47:16","slug":"triple-talaq-nikah-halala","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/triple-talaq-nikah-halala\/","title":{"rendered":"Triple Talaq and Nikah Halala are major sins"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Triple talaq or ‘instant divorce’ is a sinful form of divorce in which the husband divorces his wife with three pronouncements, activating the rule that his divorce is irrevocable and eliminating the possibility of reconciliation or remarriage. His wife may only remarry him later if she first consummates a marriage to another man, sincerely desiring to marry her second husband and sincerely intending permanence with him, but then happens to get divorced again. This is a very high standard to meet and it is extremely unlikely that anyone could legitimately overturn an irrevocable triple divorce in ordinary circumstances.<\/p>\n<p>A divorce by triple pronouncement is effectively permanent, but some Muslims have tried to side-step this rule by engaging in an unlawful temporary marriage for the purpose of reuniting the original couple (<em>nikah al-tahlil<\/em> in Arabic, or <em>nikah halala<\/em> in Urdu). The unfair cultural stigma against divorced women, the fear that they will never again remarry, drives them to engage in this abhorrent practice in order to return to the husband who first irrevocably divorced her. There are even so-called <em>halala<\/em> ‘services’ and websites that are used to exploit these vulnerable women for monetary gain and sexual pleasure.<\/p>\n<p>Islam strongly opposes <em>nikah halala<\/em> as well as the triple divorce that necessarily precedes it. They are both major sins that will result in divine punishment in the Hereafter for those who commit them and do not repent.<\/p>\n<p>As for triple divorce, the Prophet (ṣ) condemned it as belittling the Book of Allah. Some scholars even went so far as to claim it is an innovated, and thus heretical, form of divorce (<em>tallaq al-bid’ah<\/em>).<\/p>\n<p>Mahmud ibn Labid reported: The Messenger of Allah, peace and blessings be upon him, was informed about a man who pronounced divorce to his wife three times at once. The Prophet stood in anger and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُلْعَبُ بِكِتَابِ اللَّهِ وَأَنَا بَيْنَ أَظْهُرِكُمْ<\/p>\n<p><strong>Do they play with the Book of Allah while I am among you?<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3401, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/06\/prophet-angered-by-triple-talaq\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Qayyim commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ اللَّهَ تَعَالَى إنَّمَا شَرَعَ الطَّلَاقَ مَرَّةً بَعْدَ مَرَّةٍ وَلَمْ يَشْرَعْهُ كُلَّهُ مَرَّةً وَاحِدَةً فَمَنْ جَمَعَ الثَّلَاثَ فِي مَرَّةٍ وَاحِدَةٍ فَقَدْ تَعَدَّى حُدُودَ اللَّهِ وَظَلَمَ نَفْسَهُ وَلَعِبَ بِكِتَابِ اللَّهِ<\/p>\n<p>Indeed, Allah Almighty legislated divorce for one time after another and He did not legislate all of them be pronounced in a single sitting. Whoever pronounces three in one sitting has transgressed the limits of Allah, wronged himself, and played with the book of Allah.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 3\/35<\/p><\/blockquote>\n<p>And Al-San’ani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَدِيثُ دَلِيلٌ عَلَى أَنَّ جَمْعَ الثَّلَاثِ التَّطْلِيقَاتِ بِدْعَةٌ<\/p>\n<p>The tradition is evidence that pronouncing three divorces at once is a heretical innovation.<\/p>\n<p>Source: Subul al-Salām 2\/254<\/p><\/blockquote>\n<p>It is permissible for the ruler to impose discretionary legal punishment (<em>al-ta’zir<\/em>) upon a man who divorces his wife in this disgraceful manner.<\/p>\n<p>Anas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ عُمَرُ بْنُ الْخَطَّابِ رضي الله عنه  إِذَا أُتِيَ بِرَجُلٍ طَلَّقَ امْرَأَتَهُ ثَلَاثًا أَوْجَعَ ظَهْرَهُ<\/p>\n<p>Whenever a man was brought to Umar ibn al-Khattab, may Allah be pleased with him, who had divorced his wife three times in one sitting, he would flog his back.<\/p>\n<p>Source: Sharḥ Maʻānī al-Āthār 4488, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/07\/umar-talaq-triple-divorce\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And Al-Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانُوا يُنَكِّلُونَ مَنْ طَلَّقَ ثَلَاثًا فِي مَقْعَدٍ وَاحِدٍ<\/p>\n<p>They used to make an example by severely punishing whoever divorced his wife three times in one sitting.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 17794<\/p><\/blockquote>\n<p>Based upon this strong evidence – the condemnation of the Prophet (ṣ) and the legal punishment implemented by Umar – the best opinion is that triple divorce is unlawful, forbidden, and sinful (<em>haram<\/em>). In any case, triple divorce has never been classified as permissible (<em>halal<\/em>) in the sense of wholesome (<em>tayyib<\/em>). All of the people of knowledge agree it is wrong; they only disagree over the extent to which it is sinful, with some saying it is only morally reprehensible (<em>makruh<\/em>).<\/p>\n<p>In contrast, the Sunnah method of divorce is to pronounce a divorce only once while the wife is not menstruating. The wife is then moved to a separate room or house for her waiting period (<em>‘iddah<\/em>), during which avenues of reconciliation can be explored if possible.  At the end of the waiting period, the husband may either take her back or part with her amicably.<\/p>\n<p>This slower, drawn out process allows the couple to rethink their situation and hold discussions with family members. Unlike triple divorce, the waiting period gives them time to settle their differences in case the divorce was pronounced in a state of anger, misunderstanding, or clouded judgment.<\/p>\n<p>Imam Ahmad, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">طَلاقُ السُّنَّةِ واحدةٌ<\/p>\n<p>The method of divorce in the Sunnah is to do so once at a time.<\/p>\n<p>Source: al-Inṣāf 22\/169<\/p><\/blockquote>\n<p>Ibn Taymiyyah further elaborates on the prophetic method of divorce, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالطَّلَاقُ الْمُبَاحُ بِاتِّفَاقِ الْعُلَمَاءِ هُوَ أَنْ يُطَلِّقَ الرَّجُلُ امْرَأَتَهُ طَلْقَةً وَاحِدَةً إذَا طَهُرَتْ مِنْ حَيْضَتِهَا بَعْدَ أَنْ تَغْتَسِلَ وَقَبْلَ أَنْ يَطَأَهَا ثُمَّ يَدَعَهَا فَلَا يُطَلِّقَهَا حَتَّى تَنْقَضِيَ عِدَّتُهَا وَهَذَا الطَّلَاقُ يُسَمَّى طَلَاقَ السُّنَّةِ فَإِنْ أَرَادَ أَنْ يَرْتَجِعَهَا فِي الْعِدَّةِ فَلَهُ ذَلِكَ بِدُونِ رِضَاهَا وَلَا رِضَا وَلِيِّهَا وَلَا مَهْرٍ جَدِيدٍ وَإِنْ تَرَكَهَا حَتَّى تَقْضِيَ الْعِدَّةَ فَعَلَيْهِ أَنْ يُسَرِّحَهَا بِإِحْسَانِ فَقَدْ بَانَتْ مِنْهُ فَإِنْ أَرَادَ أَنْ يَتَزَوَّجَهَا بَعْدَ انْقِضَاءِ الْعِدَّةِ جَازَ لَهُ ذَلِكَ لَكِنْ يَكُونُ بِعَقْدِ كَمَا لَوْ تَزَوَّجَهَا ابْتِدَاءً<\/p>\n<p>The permissible divorce, by consensus of the scholars, is that a man divorces his wife with one pronouncement when she is in a state of non-menstruating ritual purity, after she performed her ritual bath and before he has intercourse with her. Then, he leaves her and does not release her until her waiting period is complete. This divorce is called ‘the prophetic divorce’ (<em>tallaq al-sunnah<\/em>). If he wants to take her back during the waiting period, he may do so without obtaining permission from her or her guardian or paying a new dowry. If he avoids her until after the waiting period is finished, he must let her go in the best manner and she is fully separated from him. If he wants to marry her after completion of the waiting period, that is permissible for him but it must be with a new contract as if he were marrying her for the first time.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 33\/5<\/p><\/blockquote>\n<p>The Sunnah method of divorce emphasizes the Islamic value of ‘excellence’ (<em>al-ihsan<\/em>). It imposes its conditions in order to give the couple every chance to save their marriage, or at least to end the relationship without hatred, malice, or grudges.<\/p>\n<p>Since the widespread use of triple divorce in our times, many women are put into the difficult situation of either enduring the unfair stigma of being a divorcee or resorting to <em>nikah halala<\/em> to return to their first marriage. However, the Prophet (ṣ) condemned and forbade <em>nikah halala<\/em>, likening it to illegal fornication and adultery.<\/p>\n<p>Abdullah ibn Mas’ud reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُحِلَّ وَالْمُحَلَّلَ لَهُ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, cursed the one who marries a woman to overturn an irrevocable divorce (<em>al-muhill<\/em>) and the man for whom it is done.<\/p>\n<p>Source: Sunan al-Tirmidhī 1120, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/06\/condemnation-nikah-halala\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Nafi’ reported: A man came to Ibn Umar, may Allah be pleased with him, and he asked about a man who divorces his wife three times, then he marries her to his brother, without any prior agreement from him, in order to make her lawful to him again. Does she become lawful to the first husband? Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِلَّا نِكَاحَ رَغْبَةٍ كُنَّا نَعُدُّ هَذَا سِفَاحًا عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>No, unless it is a marriage she had desired. We used to consider this illegal fornication in the time of the Messenger of Allah, peace and blessings be upon him.<\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 14189, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/07\/nikah-halala-is-zina\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Triple divorce and <em>nikah halala<\/em> are twin evils that cannot be separated, as one necessarily leads to the other. For this reason, among others, many Muslim countries have <a href=\"https:\/\/www.khaleejtimes.com\/international\/india\/uae-pakistan-among-19-countries-that-have-abolished-triple-talaq\">abolished triple divorce<\/a> in practice, including Egypt, Algeria, Iraq, Jordan, Kuwait, Lebanon, Libya, Morocco, Sudan, Syria, Tunisia, UAE, Yemen, Indonesia, Malaysia, Pakistan, and Bangladesh.<\/p>\n<p>The important legal question we need to answer is whether or not triple divorce should be a formally recognized method of irrevocable divorce. For Muslims living in a country that bans the practice, they must follow the law of their land. But what about other countries or minority contexts without a Sharia council? Do three pronouncements of divorce always result in irrevocability, or should they count as one revocable divorce?<\/p>\n<p>This issue is a famous difference of opinion among the scholars throughout Islamic history. Ibn Tamiyyah even spent months in prison for his verdict on this matter. The majority of scholars hold that three pronounced divorces in one sitting, even though it is forbidden and sinful, is still legally binding and therefore irrevocable. A minority opinion disagrees and only counts three pronounced divorces as one revocable divorce.<\/p>\n<p>Ibn Rushd writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جُمْهُورُ فُقَهَاءِ الْأَمْصَارِ عَلَى أَنَّ الطَّلَاقَ بِلَفْظِ الثَّلَاثِ حُكْمُهُ حُكْمُ الطَّلْقَةِ الثَّالِثَةِ وَقَالَ أَهْلُ الظَّاهِرِ وَجَمَاعَةٌ حُكْمُهُ حُكْمُ الْوَاحِدَةِ وَلَا تَأْثِيرَ لِلَّفْظِ فِي ذَلِكَ<\/p>\n<p>The majority of jurists hold that divorce by three words has the ruling of the third divorce. The literalists and another group hold that the ruling has only one divorce and those extra words do not take effect.<\/p>\n<p>Source: Bidāyat al-Mujtahid 3\/74<\/p><\/blockquote>\n<p>Ibn Taymiyyah further elaborates on the different opinions, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهَذَا لِلْعُلَمَاءِ مِنْ السَّلَفِ وَالْخَلَفِ فِيهِ ثَلَاثَةُ أَقْوَالٍ &#8230; أَحَدُهَا أَنَّهُ طَلَاقٌ مُبَاحٌ لَازِمٌ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَد فِي الرِّوَايَةِ الْقَدِيمَةِ عَنْهُ اخْتَارَهَا الخرقي<\/p>\n<p style=\"text-align: right;\">الثَّانِي أَنَّهُ طَلَاقٌ مُحَرَّمٌ لَازِمٌ وَهُوَ قَوْلُ مَالِكٍ وَأَبِي حَنِيفَةَ وَأَحْمَد فِي الرِّوَايَةِ الْمُتَأَخِّرَةِ عَنْهُ اخْتَارَهَا أَكْثَرُ أَصْحَابِهِ وَهَذَا الْقَوْلُ مَنْقُولٌ عَنْ كَثِيرٍ مِنْ السَّلَفِ مِنْ الصَّحَابَةِ وَالتَّابِعِينَ وَاَلَّذِي قَبْلَهُ مَنْقُولٌ عَنْ بَعْضِهِمْ<\/p>\n<p style=\"text-align: right;\"> الثَّالِثُ أَنَّهُ مُحَرَّمٌ وَلَا يَلْزَمُ مِنْهُ إلَّا طَلْقَةٌ وَاحِدَةٌ وَهَذَا الْقَوْلُ مَنْقُولٌ عَنْ طَائِفَةٍ مِنْ السَّلَفِ وَالْخَلَفِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلُ الزُّبَيْرِ بْنِ الْعَوَّامِ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَيُرْوَى عَنْ عَلِيٍّ وَابْنِ مَسْعُودٍ وَابْنِ عَبَّاسٍ الْقَوْلَانِ وَهُوَ قَوْلُ كَثِيرٍ مِنْ التَّابِعِينَ وَمَنْ بَعْدَهُمْ<\/p>\n<p>The scholars among the predecessors and latter times have three opinions in this regard… First, that triple divorce is allowed and binding. It is the opinion of Al-Shafi’i, Ahmad in a narration of his older opinion, and it was preferred by Al-Kharqi.<\/p>\n<p>Second, that it is forbidden but binding. It is the opinion of Malik, Abu Hanifa, Ahmad in a narration of his latest opinion, and it was preferred by most of the companions. This opinion was transmitted from many of the righteous predecessors among the companions and successors, while that mentioned previously was transmitted by some of them.<\/p>\n<p>Third, that it is forbidden and not binding upon him except as one revocable divorce. This opinion was transmitted by a group of the predecessors among the companions of the Messenger of Allah (ṣ) such as Al-Zubayr ibn al-‘Awwam and Abdur Rahman ibn ‘Awf. It was narrated from Ali, Ibn Mas’ud, and Ibn Abbas as one of two opinions, and it is the opinion of many among the successors and those after them.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 33\/8<\/p><\/blockquote>\n<p>The latter opinion, although it was a minority among the righteous predecessors, is nevertheless supported by a strong case from the Quran and Sunnah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا الْعِدَّةَ ۖ وَاتَّقُوا اللَّهَ رَبَّكُمْ<\/p>\n<p><strong>O Prophet, when you divorce women, then divorce them by their waiting periods, count the period, and fear Allah your Lord.<\/strong><\/p>\n<p>Surat al-Talaq 65:1<\/p><\/blockquote>\n<p>Each divorce should be followed by a waiting period of three months (or three menstrual cycles). This allows for the possibility of reconciliation or mediation through family members, while it also confirms a possible pregnancy so any children can be properly attributed to their biological father.<\/p>\n<p>Shaykh Ibn ‘Uthaymin commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والطلاق الثاني يقع لغير العدة لأن العدة تبدأ من الطلاق الأول والطلاق الثاني لا يغير العدة فيكون طلاقاً لغير عدة<\/p>\n<p>The second divorce occurred without a waiting period because the period was initiated by the first divorce. The second divorce does not change the obligation of the waiting period, such that it is a divorce without a period.<\/p>\n<p>Source: Sharḥ al-Mumti&#8217; 13\/41<\/p><\/blockquote>\n<p>Triple divorce bypasses the clearly-stated intention of the Lawgiver that divorces should be followed by the waiting period.<\/p>\n<p>There is strong evidence from the Sunnah that triple divorce in the time of the Prophet (ṣ) was only counted as one divorce, and this continued throughout the Caliphate of Abu Bakr until Umar imposed irrevocability upon triple divorce as a means to discourage husbands from indulging in it.<\/p>\n<p>Ibn Abbas reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ الطَّلَاقُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَسَنَتَيْنِ مِنْ خِلَافَةِ عُمَرَ طَلَاقُ الثَّلَاثِ وَاحِدَةً فَقَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّ النَّاسَ قَدْ اسْتَعْجَلُوا فِي أَمْرٍ قَدْ كَانَتْ لَهُمْ فِيهِ أَنَاةٌ فَلَوْ أَمْضَيْنَاهُ عَلَيْهِمْ فَأَمْضَاهُ عَلَيْهِمْ<\/p>\n<p>Triple divorce in the time of the Messenger of Allah, peace and blessings be upon him, Abu Bakr, and two years of the Caliphate of Umar was considered to be only one divorce. Umar ibn al-Khattab said, ‘Verily, the people have become hasty in a matter for which they should take care. If only we imposed it upon them.’ Thus, Umar imposed it upon them.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1472, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/06\/divorce-triple-talaq\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Ja’far commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَذَهَبَ قَوْمٌ إِلَى أَنَّ الرَّجُلَ إِذَا طَلَّقَ امْرَأَتَهُ ثَلَاثًا مَعًا فَقَدْ وَقَعَتْ عَلَيْهَا وَاحِدَةٌ إِذَا كَانَتْ فِي وَقْتِ سُنَّةٍ وَذَلِكَ أَنْ تَكُونَ طَاهِرًا فِي غَيْرِ جِمَاعٍ وَاحْتَجُّوا فِي ذَلِكَ بِهَذَا الْحَدِيثِ<\/p>\n<p>Some people held that a man who divorces his wife three times together is only counted against her once, if it is done during the time stipulated by the Sunnah, that she be in a state of ritual purity in which there was no intercourse. They cited this tradition as evidence.<\/p>\n<p>Source: Sharḥ Maʻānī al-Āthār 4473<\/p><\/blockquote>\n<p>It is important to appreciate the reason Umar imposed irrevocability on triple divorce. The popular misconception is that Umar allegedly ‘permitted’ or ‘sanctioned’ triple divorce, while in reality he imposed irrevocability on it <em>as a punishment<\/em>. He wanted husbands to be deterred from pronouncing triple divorce. The policy was meant to suppress triple divorce, not encourage it.<\/p>\n<p>Ibn al-Qayyim commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأَى أَمِيرُ الْمُؤْمِنِينَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّاسَ قَدْ اسْتَهَانُوا بِأَمْرِ الطَّلَاقِ وَكَثُرَ مِنْهُمْ إيقَاعُهُ جُمْلَةً وَاحِدَةً فَرَأَى مِنْ الْمَصْلَحَةِ عُقُوبَتَهُمْ بِإِمْضَائِهِ عَلَيْهِمْ لِيَعْلَمُوا أَنَّ أَحَدَهُمْ إذَا أَوْقَعَهُ جُمْلَةً بَانَتْ مِنْهُ الْمَرْأَةُ وَحُرِّمَتْ عَلَيْهِ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ نِكَاحَ رَغْبَةٍ يُرَادُ لِلدَّوَامِ لَا نِكَاحَ تَحْلِيلٍ فَإِنَّهُ كَانَ مِنْ أَشَدِّ النَّاسِ فِيهِ فَإِذَا عَلِمُوا ذَلِكَ كَفُّوا عَنْ الطَّلَاقِ الْمُحَرَّمِ فَرَأَى عُمَرُ أَنَّ هَذَا مَصْلَحَةٌ لَهُمْ فِي زَمَانِهِ<\/p>\n<p>The commander of the faithful, Umar, may Allah be pleased with him, saw that people were making light of the matter of divorce and many of them would pronounce it altogether in one sitting. He viewed it as in the best interest to punish them by imposing it upon them, that they would know if one of them irrevocably pronounced it altogether to the wife, she would be forbidden for him to remarry until she had married another husband in a marriage she desired and intended permanently, not simply intending to make him lawful to her again (<em>nikah tahlil<\/em>). Indeed, he was the most strict of people in the matter. If they knew that, they would refrain from an irrevocable divorce. Umar believed this was in their best interest in his time.<\/p>\n<p>Grade: I’lām al-Muwaqqi’īn 3\/35<\/p><\/blockquote>\n<p>And Ibn Taymiyyah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّهُ لَمَّا رَأَى النَّاسَ قَدْ أَكْثَرُوا مِمَّا حَرَّمَهُ اللَّهُ عَلَيْهِمْ مِنْ جَمْعِ الثَّلَاثِ وَلَا يَنْتَهُونَ عَنْ ذَلِكَ إلَّا بِعُقُوبَةِ رَأَى عُقُوبَتَهُمْ بِإِلْزَامِهَا لِئَلَّا يَفْعَلُوهَا<\/p>\n<p>When Umar saw people had started to do more of what Allah forbade them of combining three divorces, and that they would not stop unless they were punished, he considered their punishment to be its imposition so that they would no longer do it.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 33\/15-16<\/p><\/blockquote>\n<p>Hence, the juristic verdict (<em>ijtihad<\/em>) of Umar was an intelligent application of the legal principle of ‘blocking the means to evil’ (<em>sadd al-dhari’ah<\/em>). Umar also flogged men who pronounced triple divorce, so it is obvious he was in no way tolerating the practice. Indeed, he considered it a major sin.<\/p>\n<p>There is more evidence in the Sunnah, with a slightly weaker chain of authorities, that the Prophet (ṣ) considered a triple divorce to be counted as one divorce.<\/p>\n<p>Yazid ibn Rukanah reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رُكَانَةَ إِنَّمَا طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَجَعَلَهَا النَّبِيُّ صلى الله عليه وسلم وَاحِدَةً<\/p>\n<p>Rukanah had divorced his wife irrevocably and the Prophet, peace and blessings be upon him, only counted it as one divorce.<\/p>\n<p>Source: Sunan Abī Dāwūd 2196, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/06\/triple-talaq-one-divorce\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>This fact is further supported by the verdicts of a number of early scholars among the companions, successors, and their students who followed this precedent.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَفْتَى بِأَنَّهَا وَاحِدَةٌ الزُّبَيْرُ بْنُ الْعَوَّامِ وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ حَكَاهُ عَنْهُمَا ابْنُ وَضَّاحٍ وَعَنْ عَلِيٍّ كَرَّمَ اللَّهُ وَجْهَهُ وَابْنِ مَسْعُودٍ رِوَايَتَانِ كَمَا عَنْ ابْنِ عَبَّاسٍ وَأَمَّا التَّابِعُونَ فَأَفْتَى بِهِ عِكْرِمَةُ رَوَاهُ إسْمَاعِيلُ بْنُ إبْرَاهِيمَ عَنْ أَيُّوبَ عَنْهُ وَأَفْتَى بِهِ طَاوُسٌ وَأَمَّا تَابِعُو التَّابِعِينَ فَأَفْتَى بِهِ مُحَمَّدُ بْنُ إِسْحَاقَ حَكَاهُ الْإِمَامُ أَحْمَدُ وَغَيْرُهُ عَنْهُ وَأَفْتَى بِهِ خِلَاسُ بْنُ عَمْرٍو وَالْحَارِثُ الْعُكْلِيُّ وَأَمَّا أَتْبَاعُ تَابِعِي التَّابِعِينَ فَأَفْتَى بِهِ دَاوُد بْنُ عَلِيٍّ وَأَكْثَرُ أَصْحَابِهِ حَكَاهُ عَنْهُمْ أَبُو الْمُفْلِسِ وَابْنُ حَزْمٍ وَغَيْرُهُمَا وَأَفْتَى بِهِ بَعْضُ أَصْحَابِ مَالِكٍ حَكَاهُ التِّلْمِسَانِيُّ فِي شَرْحِ تَفْرِيعِ ابْنِ الْجَلَّابِ قَوْلًا لِبَعْضِ الْمَالِكِيَّةِ<\/p>\n<p>It was judged to count as one divorce by Al-Zubayr ibn al-‘Awwam and Abdur Rahman ibn ‘Awf, as related by Ibn Wadah. It was narrated from Ali, may Allah ennoble his countenance, and Ibn Mas’ud in one of two narrations, similar to Ibn Abbas. As for the successors, it was judged so by ‘Ikramah, as narrated by Isma’il ibn Ibrahim from Ayyub, and it was judged so by Tawus. As for the students of the successors, it was judged so by Muhammad ibn Ishaq, as related by Imam Ahmad and others. It was judged so by Khilas ibn ‘Amr and Al-Harith al-‘Ukli. As for their students, it was judged so by Dawud ibn Ali and most of his students, as related from them by Abu al-Muflis, Ibn Hazm, and others. It was judged so by some of the students of Malik, as related by Al-Tilmisani in Sharh Tafri’ ibn al-Jallab as an opinion of some in the Maliki school.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 3\/34<\/p><\/blockquote>\n<p>And Al-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَذَهَبَتْ طَائِفَةٌ مِنْ أَهْلِ الْعِلْمِ إلَى أَنَّ الطَّلَاقَ لَا يَتْبَعُ الطَّلَاقَ بَلْ يَقَعُ وَاحِدَةً فَقَطْ وَقَدْ حَكَى ذَلِكَ صَاحِبُ الْبَحْرِ عَنْ أَبِي مُوسَى وَرِوَايَةً عَنْ عَلِيٍّ عَلَيْهِ السَّلَامُ وَابْنِ عَبَّاسٍ وَطَاوُسٍ وَعَطَاءٍ وَجَابِرِ بْنِ زَيْدٍ وَالْهَادِي وَالْقَاسِمِ وَالْبَاقِرِ وَالنَّاصِرِ وَأَحْمَدَ بْنِ عِيسَى وَعَبْدِ اللَّهِ بْنِ مُوسَى بْنِ عَبْدِ اللَّهِ وَرِوَايَةً عَنْ زَيْدِ بْنِ عَلِيٍّ وَإِلَيْهِ ذَهَبَ جَمَاعَةٌ مِنْ الْمُتَأَخِّرِينَ مِنْهُمْ ابْنُ تَيْمِيَّةَ وَابْنُ الْقَيِّمِ وَجَمَاعَةٌ مِنْ الْمُحَقِّقِينَ<\/p>\n<p>A group of the people of knowledge held that divorce cannot follow divorce. Rather, it can only occur once at a time. That was related by the author of al-Bahr from Abu Musa and a narration from Ali, upon him be peace, Ibn Abbas, Tawus, ‘Ata’, Jabir ibn Zayd, Al-Hadi, Al-Qasim, Al-Baqir, Al-Nasir, Ahmad ibn ‘Isa, Abdullah ibn Musa ibn Abdullah, and a narration from Zayd ibn Ali. A group of later scholars adopted it, among them Ibn Taymiyyah, Ibn al-Qayyim, and a group of researchers.<\/p>\n<p>Source: Nayl al-Awṭār 6\/274<\/p><\/blockquote>\n<p>Some people claim there is a ‘consensus’ (<em>ijma’<\/em>) on the irrevocability of triple divorce. It is the historical majority opinion, to be sure, as most of the companions and righteous predecessors followed the verdict of Umar. This is why Ibn Taymiyyah was sent to jail for advocating this position, because he allegedly violated an immaculate consensus. But the truth is that there has always been a legitimate difference of opinion on this issue, as mentioned by Ibn Hajar:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّهُ مَذْهَبٌ شَاذٌّ فَلَا يُعْمَلُ بِهِ وَأجِيب بِأَنَّهُ نقل عَن عَليّ وبن مَسْعُودٍ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ مِثْلُهُ نقل ذَلِك بن مُغِيثٍ فِي كِتَابِ الْوَثَائِقِ لَهُ وَعَزَاهُ لِمُحَمَّدِ بْنِ وَضَّاحٍ وَنَقَلَ الْغَنَوِيُّ ذَلِكَ عَنْ جَمَاعَةٍ مِنْ مَشَايِخِ قُرْطُبَةَ كَمُحَمَّدِ بْنِ تَقِيِّ بْنِ مَخْلَدٍ وَمُحَمَّدِ بْنِ عَبْدِ السَّلَامِ الْخُشَنِيِّ وَغَيْرِهِمَا وَنَقله بن الْمُنْذر عَن أَصْحَاب بن عَبَّاسٍ كَعَطَاءٍ وَطَاوُسٍ وَعَمْرِو بْنِ دِينَارٍ وَيُتَعَجَّبُ من بن التِّينِ حَيْثُ جَزَمَ بِأَنَّ لُزُومَ الثَّلَاثِ لَا اخْتِلَافَ فِيهِ وَإِنَّمَا الِاخْتِلَافُ فِي التَّحْرِيمِ مَعَ ثُبُوت الِاخْتِلَاف كَمَا ترى<\/p>\n<p>In regards to the claim that the opinion is odd and cannot be acted upon, the answer is that it has been transmitted from Ali, Ibn Mas’ud, Abdur Rahman ibn ‘Awf, and Al-Zubayr all the same. That was transmitted by Ibn Mughith in his Kitab al-Watha’iq and he ascribed it to Muhammad ibn Wadah. Al-Ghanawi transmitted that from a group of elders in Cordoba, such as Muhammad ibn Taqi ibn Makhlad, Muhammad ibn Abdul Salaam al-Khushani, and others. It was transmitted by Ibn al-Mundhir from the companions of Ibn Abbas such as ‘Ata’, Tawus, and ‘Amr ibn Dinar. It is strange for Ibn al-Tin to claim with certainty that there is no difference over the irrevocability of three divorces and the difference is only over its prohibition, despite the established difference as you see.<\/p>\n<p>Source: Fatḥ al-Bārī 9\/363<\/p><\/blockquote>\n<p>Another angle from which to analyze the debate is the use of legal analogy (<em>al-qiyas<\/em>). Those who hold to the irrevocability of triple divorce compared it to oaths and vows that must be fulfilled, while those who disagree compared it to self-imposed conditions that can be annulled.<\/p>\n<p>Ibn Rushd writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ شَبَّهَ الطَّلَاقَ بِالْأَفْعَالِ الَّتِي يُشْتَرَطُ فِي صِحَّةِ وُقُوعِهَا كَوْنُ الشُّرُوطِ الشَّرْعِيَّةِ فِيهَا كَالنِّكَاحِ وَالْبُيُوعِ قَالَ لَا يَلْزَمُ وَمَنْ شَبَّهَهُ بِالنُّذُورِ وَالْأَيْمَانِ الَّتِي مَا الْتَزَمَ الْعَبْدُ مِنْهَا لَزِمَهُ عَلَى أَيِّ صِفَةٍ كَانَ أَلْزَمَ الطَّلَاقَ كَيْفَمَا أَلْزَمَهُ الْمُطَلِّقُ نَفْسَهُ<\/p>\n<p>Those who likened divorce to acts for which legal conditions are imposed to be valid, such as marriage or trade, they said the third pronouncement is not binding. Those who likened it to vows and oaths, in which whatever a servant imposes upon himself must be done in any case, they said the third divorce is binding whenever he obligates it upon himself in absolute terms.<\/p>\n<p>Source: Bidāyat al-Mujtahid 3\/74<\/p><\/blockquote>\n<p>If triple divorce is considered a self-imposed condition, then a husband who said it in anger or later regretted it can take it back.<\/p>\n<p>Some scholars tried to reconcile the two opinions by making it conditional upon the husband’s intention instead of his actual wording. If he intended a triple divorce, it stand irrevocably, but if he if only intended one divorce, it remains revocable.<\/p>\n<p>Sa’id said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ نَوَى وَاحِدَةً فَوَاحِدَةٌ وَإِنْ نَوَى ثَلَاثًا فَثَلَاثٌ<\/p>\n<p>If the husband intended one divorce, it remains one. If he intended three divorces, it remains three.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 18142<\/p><\/blockquote>\n<p>This is a reasonable interpretation meant to bridge the two sides, and it allows a husband to take back his triple divorce if he regretted it shortly thereafter.<\/p>\n<p>Still, the real world social consequences of any policy cannot be ignored. This matter should not be confined to the realm of abstract academic debate, as it has a serious effect on people’s lives and well-being. Might the logic of blocking the means by imposing irrevocability cause some unintended harm down the line?<\/p>\n<p>Ibn Rushd writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَأَنَّ الْجُمْهُورَ غَلَّبُوا حُكْمَ التَّغْلِيظِ فِي الطَّلَاقِ سَدًّا لِلذَّرِيعَةِ وَلَكِنْ تَبْطُلُ بِذَلِكَ الرُّخْصَةُ الشَّرْعِيَّةُ وَالرِّفْقُ الْمَقْصُودُ فِي ذَلِكَ أَعْنِي فِي قَوْله تَعَالَى لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا<\/p>\n<p>It is as if the majority let the strict opinion prevail as a way of blocking the means (to discourage triple divorce), but that would invalidate the legal concession and its gentle intent. I mean in the words of the Almighty: <strong>Perhaps Allah will bring something new after that matter<\/strong> (65:1).<\/p>\n<p>Source: Bidāyat al-Mujtahid 3\/74<\/p><\/blockquote>\n<p>Imposing irrevocability on triple divorce invalidates the concession – the possibility of reconciliation and return (<em>raj&#8217;i<\/em>) – that is obviously desired by Allah. Today, it may no longer be an effective mechanism to deter triple divorce, while at the same time it undermines the slower, gentler manner in which a divorce should be carried out.<\/p>\n<p>Scholars today ought to carefully consider the purpose of Umar in imposing irrevocability on triple divorce. His judgment to block the means surely applied to his time, because his people probably had the good sense and piety to take his deterrent to heart. In our times, however, husbands are abusing triple divorce in horrific ways, causing broken families and deplorable <em>nikah halala<\/em> ‘services’ to proliferate at an alarming rate. The irrevocability of triple divorce no longer deters people, but rather it only emboldens them.<\/p>\n<p>As such, it may be the wisest course of action to adopt the legitimate opinion of the minority and thereby cut off the key source facilitating the loathsome practice of <em>nikah halala<\/em>. The fact that most Muslim authorities today adopt Ibn Taymiyyah&#8217;s revival of this opinion, a decision for which he was unjustly imprisoned but refused to relent, is a testament to his visionary scholarship and principled integrity.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;They used to severely punish whoever divorced his wife three times in one sitting.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[160,320,468,462,165,467,22,24,434,342,32,153,38,39,41,43,404,100,53,444,469,103,124,91,359,70,73,128],"class_list":["post-21566","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-ablution-wudu","tag-abu-bakr","tag-analogy-al-qiyas","tag-concessions-al-rukhsah","tag-consensus-al-ijma","tag-divorce-al-tallaq","tag-excellence-ihsaan","tag-family-ties-sillat-rahim","tag-al-fatwa","tag-al-fiqh","tag-hereafter-akhirah","tag-al-ijtihad","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-legal-punishment-al-hudud","tag-manners-al-adab","tag-marriage-al-nikah","tag-misconceptions","tag-oaths","tag-public-welfare-al-maslaha","tag-reconciliation","tag-righteous-predecessors-al-salaf-al-salih","tag-ritual-bath-al-ghusl","tag-sincerity-al-ikhlaas","tag-umar-ibn-al-khattab","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5BQ","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":21566,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21541,"url":"https:\/\/www.abuaminaelias.com\/muslim-womens-right-to-divorce\/","url_meta":{"origin":21566,"position":1},"title":"Muslim women’s right to divorce","author":"Abu Amina Elias","date":"January 1, 2020","format":false,"excerpt":"\"Settlement is best.\" (4:128)","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16462,"url":"https:\/\/www.abuaminaelias.com\/charms-talismans-and-amulets-in-islam\/","url_meta":{"origin":21566,"position":2},"title":"Charms, talismans, and amulets in Islam","author":"Abu Amina Elias","date":"March 31, 2015","format":false,"excerpt":"\"Whoever hangs something as a charm will be entrusted to it.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18902,"url":"https:\/\/www.abuaminaelias.com\/should-a-muslim-man-marry-a-second-wife\/","url_meta":{"origin":21566,"position":3},"title":"Should a Muslim man marry a second wife?","author":"Abu Amina Elias","date":"February 14, 2018","format":false,"excerpt":"\"You will never be able to maintain  justice between your wives—no matter how keen you are.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":21566,"position":4},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":21566,"position":5},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21566","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21566"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21566\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21566"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21566"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21566"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}