{"id":21592,"date":"2020-01-16T15:10:58","date_gmt":"2020-01-16T11:10:58","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21592"},"modified":"2025-04-21T13:16:34","modified_gmt":"2025-04-21T09:16:34","slug":"obedience-to-parents-limits","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/obedience-to-parents-limits\/","title":{"rendered":"Obedience to Parents and its Limits"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The parent-child relationship is the pillar of family life and the basic building block of civilization. Islam teaches us to cultivate positive, healthy, and functional relations between parents and their children. Part of this imperative is to balance the rights and duties of both parents and children. Children have a duty to support their parents and obey all their reasonable requests, while parents need to give their children room to grow and develop their unique personalities.<\/p>\n<p>Righteousness to parents (<em>birr al-walidayn<\/em>) is a core concept in Islamic ethics. In many verses and traditions, good conduct towards one’s parents is mentioned right alongside the worship of Allah.<\/p>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا<\/p>\n<p><strong>Worship Allah alone and associate none with Him, and be kind to parents.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:36<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوٓا۟ إِلَّآ إِيَّاهُ وَبِٱلْوَٰلِدَيْنِ إِحْسَـٰنًا إِمَّا يَبْلُغَنَّ عِندَكَ ٱلْكِبَرَ أَحَدُهُمَآ أَوْ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفٍّۢ وَلَا تَنْهَرْهُمَا وَقُل لَّهُمَا قَوْلًۭا كَرِيمًۭا<\/p>\n<p><strong>For your Lord has decreed that you worship none but Him, and honour your parents. If one or both of them reach old age in your care, never say to them even ‘ugh,’ nor yell at them. Rather, address them respectfully.<\/strong><\/p>\n<p>Surat al-Isra’ 17:23<\/p><\/blockquote>\n<p>The close proximity of these commands shows their importance in the hierarchy of Islamic priorities. Indeed, disobedience to parents (<em>‘uquq<\/em>) is considered one of the major sins, and displeasing one’s parents without a just cause threatens one’s relationship with Allah.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said regarding the major sins:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشِّرْكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَقَوْلُ الزُّورِ<\/p>\n<p><strong>They are associating idols with Allah, disobedience to parents, killing a person, and false testimony.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5977, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/19\/major-sins-shirk-kadhib-murder\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رِضَى الرَّبِّ فِي رِضَى الْوَالِدِ وَسَخَطُ الرَّبِّ فِي سَخَطِ الْوَالِدِ<\/p>\n<p><strong>The pleasure of the Lord is in the pleasure of the parents, and the displeasure of the Lord is in the displeasure of the parents<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1899, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/04\/25\/parents-pleasure-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>However, like most rules in Islam, there are exceptions to the general command of obedience. In every circumstance, it is not permissible to obey one’s parents if they command us to do something sinful.<\/p>\n<p>Ali reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا طَاعَةَ فِي مَعْصِيَةٍ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ<\/p>\n<p><strong>There is no obedience to anyone if it is disobedience to Allah. Verily, obedience is only in good conduct<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7257, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/17\/no-obedience-creator\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The standard of obedience is ‘good conduct’ (<em>ma’ruf<\/em>), that which is lawful, reasonable, and good. This principle applies to any relationship. It is not allowed for a Muslim to obey anyone – a parent, a teacher, an Imam, a political leader – if it involves sinning against Allah or His creation.<\/p>\n<p>Even so, the parental relationship is a special one. Many of the early Muslims had non-Muslim parents who opposed their embrace of Islam or even fought against them. Allah told these Muslims to obey their non-Muslim parents in reasonable matters anyway, even to be grateful to them and to treat them with good manners.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ وَإِن جَاهَدَاكَ عَلَىٰ أَن تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۖ وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا<\/p>\n<p><strong>We have commanded people to honour their parents. Their mothers bore them through hardship upon hardship, and their weaning takes two years. So be grateful to Me and your parents. To Me is the final return. But if they pressure you to associate with Me what you have no knowledge of, do not obey them. Still keep their company in this world courteously, and follow the way of those who turn to Me in devotion. Then to Me you will all return, and then I will inform you of what you used to do.<\/strong><\/p>\n<p>Surat Luqman 31:14-15<\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَلْزَمُ الْإِنْسَانَ طَاعَةُ وَالِدِيهِ فِي غَيْرِ الْمَعْصِيَةِ وَإِنْ كَانَا فَاسِقَيْنِ وَهُوَ ظَاهِرُ إطْلَاقِ أَحْمَدَ وَهَذَا فِيمَا فِيهِ مَنْفَعَةٌ لَهُمَا وَلَا ضَرَرَ فَإِنْ شَقَّ عَلَيْهِ وَلَمْ يَضُرَّهُ وَجَبَ وَإِلَّا فَلَا<\/p>\n<p>The human being must obey his parents in matters that are not sinful, even if they are both wicked. It is apparent verdict of Ahmad. This is in regards to what benefits them both and is not harmful. Even if it is difficult for him but does not harm him, it is an obligation; otherwise, it is not.<\/p>\n<p>Source: Fatāwá al-Kubrá 5\/381<\/p><\/blockquote>\n<p>This demonstrates that children always have a duty to their parents, even those who are sinners or unbelievers. Children should obey their parents in matters that benefit both of them, but parents may not order their children to harm themselves or others. Only in the most extreme circumstances, such as violence or intolerable abuse, should the parental-child relationship be severed.<\/p>\n<p>Obedience to Muslim parents also has its reasonable limits. It is not an absolute right that parents can hold over their children.<\/p>\n<p>Imam Ibn Daqiq comments:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا يَجِبُ عَلَى الْوَلَدِ طَاعَتُهُمَا فِي كُلِّ مَا يَأْمُرَانِ بِهِ وَلَا فِي كُلِّ مَا يَنْهَيَانِ عَنْهُ بِاتِّفَاقِ الْعُلَمَاءِ<\/p>\n<p>It is not an obligation upon children to obey both of their parents in every matter they command or prohibit, by agreement of the scholars.<\/p>\n<p>Source: Iḥkām al-Aḥkām 2\/275<\/p><\/blockquote>\n<p>The fact of the matter is that some parents are overly controlling and demanding, sometimes <span style=\"box-sizing: border-box;\">referred to as &#8216;tiger parenting.&#8217;<\/span> They can even be cruel and abusive to their children. The right of parents to obedience is predicated on the assumption that parents, with their wisdom and experience, intend what is best for their children. But not all parents are good parents. Is it a sin to disobey some of their unreasonable demands? What is the meaning of disobedience?<\/p>\n<p>The scholars came to a consensus that obedience to parents is not a limitless right, but they disagreed over the definition of disobedience. Imam Ibn al-Salah defined disobedience as anything that harms the parents:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأما أَن العقوق مَا هُوَ فَإنَّا قَائِلُونَ فِيهِ العقوق الْمحرم كل فعل يتَأَذَّى بِهِ الْوَالِد<\/p>\n<p>As for disobedience, what is it? We say forbidden disobedience is every deed that causes harm to the parent.<\/p>\n<p>Source: Fatāwá Ibn al-Ṣalāḥ 1\/201<\/p><\/blockquote>\n<p>Other scholars defined it as disobeying any of their commands as long as they are not sinful, which would appear to give broad leeway for parents to control their children’s lives arbitrarily. Imam Ibn al-Salah disagrees with this definition by pointing out instances in which disobeying one&#8217;s parents is permissible:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قيل طَاعَة الْوَالِدين وَاجِبَة فِي كل مَا لَيْسَ بِمَعْصِيَة وَمُخَالفَة أَمرهمَا فِي كل ذَلِك عقوق &#8230; فَإِن هَذَا كَلَام مُطلق وَفِيمَا ذكرته بَيَان لتقييد ذَلِك الْمُطلق وَالله أعلم<\/p>\n<p>It is said that obedience to parents is obligatory in every matter that is not sinful and contradicting their commands in any of that is disobedience… This statement is absolute and what we have mentioned clarifies that the absolute is restricted. Allah knows best.<\/p>\n<p>Source: Fatāwá Ibn al-Ṣalāḥ 1\/201<\/p><\/blockquote>\n<p>Imam al-Subki agreed with this definition and added the condition that children should give their parents the benefit of the doubt when matters are unclear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِن ضَابِط العقوق إيذاؤهما بِأَيّ نوع كَانَ من أَنْوَاع الْأَذَى قل أَو كثر نهيا عَنهُ أَو لم ينهيا أَو يخالفهما فِيمَا يأمران أَو ينهيان بِشَرْط انْتِفَاء الْمعْصِيَة فِي الْكل وَحكى قَول الْغَزالِيّ أَن أَكثر الْعلمَاء على وجوب طاعتهما فِي الشُّبُهَات وَوَافَقَهُمَا عَلَيْهِ<\/p>\n<p>The criterion of disobedience is anything that harms both parents, whether small or great, whether they prohibit it or not, or it conflicts with their commands or prohibitions, on the condition that it is not sinful in any case. Al-Ghazali related the opinion of most scholars that it is an obligation to obey them and to agree with them in doubtful matters.<\/p>\n<p>Source: ‘Umdat al-Qārī 22\/86<\/p><\/blockquote>\n<p>A clear example of when scholars did not obligate obedience to parents is when parents ask their children to divorce their spouse. It might be wise or even recommended, but it is not an obligation to follow through. It certainly cannot be used by parents as a means to punish their children.<\/p>\n<p>Sindi reported: A man asked Imam Ahmad, “My father has ordered me to divorce my wife.” Ahmad said, “Do not divorce her.” He said, “Did not Umar command his son Abdullah to divorce his wife?” Ahmad said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَتَّى يَكُونَ أَبُوك مِثْلَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ<\/p>\n<p>Is your father like Umar, may Allah be pleased with him?<\/p><\/blockquote>\n<p>Imam Ibn Muflih commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ أَمَرَهُ أَبُوهُ بِطَلَاقِ امْرَأَتِهِ لَمْ يَجِبْ ذَكَرَهُ أَكْثَرُ الْأَصْحَابِ<\/p>\n<p>If his father commands him to divorce his wife, it is not an obligation to do so as mentioned by most of our scholars.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/16\/ahmad-tallaq-parental-request\/\">al-Ādāb al-Shar’īyah 1\/447<\/a><\/p><\/blockquote>\n<p>Hence, while Umar ibn al-Khattab ordered his son to divorce his wife, and he complied, this scenario does not apply to every case. There are times when parents are unreasonable, uninformed, or have malicious intent, so children do not need to obey their requests. This is true for both women and men.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إذَا تَزَوَّجَتْ لَمْ يَجِبْ عَلَيْهَا أَنْ تُطِيعَأَبَاهَا وَلَا أُمَّهَا فِي فِرَاقِ زَوْجِهَا وَلَا فِي زِيَارَتِهِمْ وَلَا يَجُوزُ فِي نَحْوِ ذَلِكَ بَلْ طَاعَةُ زَوْجِهَا عَلَيْهَا إذَا لَمْ يَأْمُرْهَا بِمَعْصِيَةِ اللَّهِ أَحَقُّ مِنْ طَاعَةِ أَبَوَيْهَا &#8230; وَإِذَا كَانَتْ الْأُمُّ تُرِيدُ التَّفْرِيقَ بَيْنَهَا وَبَيْنَ زَوْجِهَا فَهِيَ مِنْ جِنْسِ هَارُوتَ وَمَارُوتَ لَا طَاعَةَ لَهَا فِي ذَلِكَ وَلَوْ دَعَتْ عَلَيْهَا<\/p>\n<p>If a woman is married, it is not obligatory for her to obey her father or mother in regards to separating from her husband, nor in visiting them, nor is anything like that permissible. Rather, obedience to the husband takes precedence over obedience to her parents, as long as he does not command her to disobey Allah… If the mother wants to separate her from her husband, then she is in the category of Harut and Marut. There is no obedience to her in that, even if she supplicates against her daughter.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 33\/112<\/p><\/blockquote>\n<p>Harut and Marut were the two angels Allah sent to teach black magic to the Israelites as a test of their faith. Their magic was used to separate a husband from his wife. Ibn Taymiyyah considered a parent who maliciously tries to ruin their child’s marriage to be like those who followed Harut and Marut.<\/p>\n<p>Parents may also not command their children to marry someone they do not like. This is true for both men and women.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ لِأَحَدِ الْأَبَوَيْنِ أَنْ يُلْزِمَ الْوَلَدَ بِنِكَاحِ مَنْ لَا يُرِيدُ وَأَنَّهُ إذَا امْتَنَعَ لَا يَكُونُ عَاقًّا وَإِذَا لَمْ يَكُنْ لِأَحَدِ أَنْ يُلْزِمَهُ بِأَكْلِ مَا يَنْفِرُ عَنْهُ مَعَ قُدْرَتِهِ عَلَى أَكْلِ مَا تَشْتَهِيهِ نَفْسُهُ كَانَ النِّكَاحُ كَذَلِكَ وَأَوْلَى<\/p>\n<p>It is not for either parent to require the child to marry someone they do not want, and if the child refuses they are not being disobedient. If it is not for anyone to require someone to eat what they detest, despite their ability to eat what they desire themselves, then marriage is likewise even more so.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 32\/30<\/p><\/blockquote>\n<p>Marriage is very important to young people, as it is their opportunity to find companionship and build a family. Children should listen to the wisdom and experience of their parents, while parents should allow their children reasonable freedom to make their own choices.<\/p>\n<p>In sum, children have a duty to obey their parents in matters of good conduct, that which is beneficial and not sinful, harmful, or unreasonable. Parents have a reciprocal responsibility to allow their children to grow and develop on their own terms, as long as their path is lawful and good. In ideal circumstances, parents and children should come to an agreement that satisfies the needs and desires of everyone.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;And be good to your parents&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[122,391,282,20,433,22,449,24,342,322,32,39,411,461,100,56,94,298,397,220,73],"class_list":["post-21592","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-angels-malaikah","tag-bloodshed-safk-al-dima","tag-children","tag-creation-al-khalq","tag-disobedience-al-isyan","tag-excellence-ihsaan","tag-falsehood-al-kadhib","tag-family-ties-sillat-rahim","tag-al-fiqh","tag-gratitude-al-shukr","tag-hereafter-akhirah","tag-imam-ahmad-ibn-hanbal","tag-israelites-banu-israil","tag-magic-al-sihr","tag-manners-al-adab","tag-monotheism-tawheed","tag-obedience-al-taah","tag-parents","tag-rights-al-huquq","tag-supplication-al-dua","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Cg","jetpack-related-posts":[{"id":16994,"url":"https:\/\/www.abuaminaelias.com\/honor-your-father-and-mother-in-islam\/","url_meta":{"origin":21592,"position":0},"title":"Honor your father and mother in Islam","author":"Abu Amina Elias","date":"September 15, 2015","format":false,"excerpt":"\"Worship Allah and be good to parents.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14163,"url":"https:\/\/www.abuaminaelias.com\/obeying-law-non-muslim-countries\/","url_meta":{"origin":21592,"position":1},"title":"Obeying the law in Non-Muslim countries","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Listening to and obeying the ruler is an obligation...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23261,"url":"https:\/\/www.abuaminaelias.com\/limits-of-retaliation-in-islam\/","url_meta":{"origin":21592,"position":2},"title":"Limits of retaliation and retribution in Islam","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Do not be treacherous to the one who betrays you.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21613,"url":"https:\/\/www.abuaminaelias.com\/new-muslim-woman-married-to-non-muslim-man\/","url_meta":{"origin":21592,"position":3},"title":"New Muslim woman married to non-Muslim man?","author":"Abu Amina Elias","date":"January 19, 2020","format":false,"excerpt":"\"He deserves her as long as he does not take her away from her land.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23308,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-obedience-sultan\/","url_meta":{"origin":21592,"position":4},"title":"Imam al-Nawawi on Obedience to Muslim authorities","author":"Abu Amina Elias","date":"June 6, 2021","format":false,"excerpt":"\"...obey Allah, obey the Messenger, and those in authority over you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16100,"url":"https:\/\/www.abuaminaelias.com\/collective-punishment-is-a-crime-in-islam\/","url_meta":{"origin":21592,"position":5},"title":"Collective punishment is a crime in Islam","author":"Abu Amina Elias","date":"November 27, 2014","format":false,"excerpt":"\"None shall bear the burdens of another.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21592","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21592"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21592\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21592"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21592"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21592"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}