{"id":21630,"date":"2020-01-28T13:54:21","date_gmt":"2020-01-28T09:54:21","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21630"},"modified":"2025-06-29T10:46:48","modified_gmt":"2025-06-29T06:46:48","slug":"mindfulness-in-the-quran-and-sunnah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/mindfulness-in-the-quran-and-sunnah\/","title":{"rendered":"Mindfulness in the Quran and Sunnah"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Mindfulness (<em>al-muraqabah<\/em>) in Islam is a spiritual state in which a believer is conscious of the awareness of Allah Almighty over his inward states and outward actions. It is when the heart and mind are occupied with the remembrance of Allah and are before Him in the present moment, in contrast to when the heart and mind are in a state of wandering, negligence, or forgetfulness.<\/p>\n<p>The basis of mindfulness is the knowledge that Allah Almighty is watching over us at every moment, seeing our deeds, knowing our feelings, and hearing our innermost thoughts. It is the believer’s realization of Allah’s beautiful name ‘the Watchful’ (<em>Al-Raqib<\/em>).<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا<\/p>\n<p><strong>Verily, Allah is ever watchful over you.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:1<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي أَنفُسِكُمْ فَاحْذَرُوهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ حَلِيمٌ<\/p>\n<p><strong>Know that Allah knows what is within yourselves, so beware of Him, and know that Allah is Forgiving and Forbearing.<\/strong><\/p>\n<p>Surat al-Baqarah 2:235<\/p><\/blockquote>\n<p>Ibn al-Qayyim defined <em>muraqabah<\/em> as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَوَامُ عِلْمِ الْعَبْدِ وَتَيَقُّنِهِ بِاطِّلَاعِ الْحَقِّ سُبْحَانَهُ وَتَعَالَى عَلَى ظَاهِرِهِ وَبَاطِنِهِ<\/p>\n<p>Continuous knowledge and conviction of the servant in the awareness of the Truth, glory be to Him, over his outward and inward states.<\/p>\n<p>Source: Madārij al-Sālikīn 2\/65<\/p><\/blockquote>\n<p>And he also provided another definition:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقِيلَ الْمُرَاقَبَةُ مُرَاعَاةُ الْقَلْبِ لِمُلَاحَظَةِ الْحَقِّ مَعَ كُلِّ خَطْرَةٍ وَخُطْوَةٍ<\/p>\n<p>It is said that &#8216;mindfulness&#8217; is to observe the heart, in awareness of the Truth, with every thought and step.<\/p>\n<p>Source: Madārij al-Sālikīn 2\/66<\/p><\/blockquote>\n<p>And again:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَوَامُ مُلَاحَظَةِ الْمَقْصُودِ أَيْ دَوَامُ حُضُورِ الْقَلْبِ مَعَهُ<\/p>\n<p>Continuous awareness of the objective, meaning, continuous presence of heart with Him.<\/p>\n<p>Source: Madārij al-Sālikīn 2\/66<\/p><\/blockquote>\n<p>Implied in the Arabic term <em>muraqabah<\/em> is a mutual-interaction between two parties. Allah is always aware of us, so when we are aware of Him, we are aware of each other. In other words, we are mindful when we are conscious of Allah’s awareness of our innermost being. This means not only must we be mindful of Allah, but also mindful of our human ego (<em>nafs<\/em>) and its tendency to stray into mindlessness (<em>ghaflah<\/em>).<\/p>\n<p>Mindfulness is equivalent to the virtue of spiritual excellence (<em>al-ihsan<\/em>), defined as worshiping Allah as if one can see Him. In its purest form, it is the highest spiritual state that a believer can achieve.<\/p>\n<p>Umar ibn al-Khattab reported: Angel Gabriel came to the Messenger of Allah, peace and blessings be upon him, and he asked, “What is excellence?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْإِحْسَان أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ<\/p>\n<p><strong>Excellence is to worship Allah as if you see Him, for if you do not see Him, He surely sees you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 8, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/01\/25\/jibreel-islam-iman-ihsan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Qushayri commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">المراقبة علم العبد باطلاع الرب سبحانه وتعالى عَلَيْهِ واستدامته لِهَذَا العلم مراقبة لربه وَهَذَا أصل كُل خير لَهُ ولا يكاد يصل إِلَى هذه الرتبة إلا بَعْد فراغه من المحاسبة &#8230; فيعلم أَنَّهُ سبحانه عَلَيْهِ رقيب ومن قلبه قريب يعلم أحواله ويرى أفعاله ويسمع أقواله<\/p>\n<p>Mindfulness is the knowledge of a servant that the Almighty Lord is aware of him. Persistence in this knowledge is mindfulness of one’s Lord. This is the origin of every virtue. One can hardly achieve this rank unless he exhausts himself in self-discipline… So he knows that his Almighty Lord is watchful over him and is close to his heart. He knows his inner-states, He sees his actions, and He hears his words.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/329<\/p><\/blockquote>\n<p>Mindfulness is to be aware of one’s feelings, thoughts, and ‘self-talk’ (<em>hadith al-nafs<\/em>) in relation to Allah. A mindful believer is careful not to engage negative thoughts by talking about them to himself.<\/p>\n<p>Abu al-‘Abbas reported: I asked Ja’far ibn Nasir, may Allah have mercy on him, about mindfulness. Ja’far said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مراعاة السر لملاحظة الحق سبحانه مَعَ كُل خطرة<\/p>\n<p>It is to be watchful over one’s innermost being, due to awareness of the Almighty Lord, with every thought.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/01\/26\/jafar-muraqabah-mindfulness\/\">al-Risālat al-Qushayrīyah 1\/331<\/a><\/p><\/blockquote>\n<p>And Al-Qushayri writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ بَعْضهم من راقب اللَّه تَعَالَى فِي خواطره عصمه اللَّه تَعَالَى فِي جوارحه<\/p>\n<p>Some of the predecessors said: Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/330<\/p><\/blockquote>\n<p>Instead of talking to ourselves about random thoughts that arise in the mind, we instead train ourselves through mindfulness practice to observe our thoughts and, if we choose, allow them to drift away by returning our awareness to Allah. We want to be in control of our mind, not let it control us by taking us down an unwanted train of thought.<\/p>\n<p>Another perspective from which to view mindfulness is ‘presence’ (<em>al-hudur<\/em>) in the heart and mind.<\/p>\n<p>Al-Qusharyi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الحضور فَقَدْ يَكُون حاضرا بالحق لأنه إِذَا غاب عَنِ الخلق حضر بالحق &#8230; وَذَلِكَ لاستيلاء ذكر الحق عَلَى قلبه فَهُوَ حاضر بقلبه بَيْنَ يدي ربه تَعَالَى فعلى حسب غيبته عَنِ الخلق يَكُون حضوره بالحق<\/p>\n<p>As for presence, it is that one is present with the Truth, as being absent from the creation is being present with the Truth&#8230; That is due to one&#8217;s heart being occupied by remembrance of the Truth, such that one is present before his Almighty Lord. To the extent one is absent from the creation, one is present with the Truth.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/174<\/p><\/blockquote>\n<p>A wandering mind is not aware, observing, or engaged in the present moment (<em>al-waqt<\/em>), but is instead thinking or talking to oneself about the past, the future, or something else. Mindfulness practice trains us to re-center our wandering minds upon Allah by quieting our self-talk.<\/p>\n<p>Al-Qushayri reported: Abu Bakr al-Farisi, may Allah have mercy on him, was asked about the practice of inward silence. Abu Bakr said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ترك الاشتغال بالماضي والمستقبل<\/p>\n<p>It is to abandon preoccupation with the past and the future.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/08\/06\/qushayri-presence-muraqabah\/\">al-Risālat al-Qushayrīyah 1\/247<\/a><\/p><\/blockquote>\n<p>Islamic mindfulness focuses our awareness upon Allah in the present moment. However, there are times when we must attend to the affairs of creation and our attention is inevitably focused on those needs. This is not blameworthy, as it is necessary, and the skill of mindfulness we cultivate through the remembrance of Allah will in turn benefit our worldly affairs, including our physical, mental, and emotional well-being.<\/p>\n<p>Al-Qushayri writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ يقال لرجوع العبد إِلَى أحساسه بأحوال نَفْسه وأحوال الخلق إنه حضر أي رجع عَن غيبته فهذا يَكُون حضور بخلق<\/p>\n<p>It is also said to refer to the servant’s sensory experience of his personal condition and the condition of the creation, that he is present, meaning he has returned from absence. This is presence with the creation.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/174<\/p><\/blockquote>\n<p>This is the key difference between Islamic mindfulness and secular mindfulness. Islam teaches us to be aware of ourselves in relation to Allah, whereas secular mindfulness teaches people to be more aware of themselves without any particular religious belief. Secular mindfulness has proven worldly benefits, of course, but it will not benefit in the Hereafter unless it is accompanied by faith.<\/p>\n<p>Through mindfulness practice, the believer establishes the habit of being reminded of Allah in all of his activities, whether in worship or in relatively mundane acts such as getting dressed in the morning.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">العاقل لا يغفل عن ذكر الآخرة في لحظة فإنها مصيره ومستقره فيكون له في كل ما يراه من ماء أو نار أو غيرهما عبرة وموعظة فإن المرء ينظر بحسب همته<\/p>\n<p>The wise person is not unmindful of remembering the Hereafter at any time, as it is his final destination and resting place. In everything he sees of water, fire, or anything else, it is a lesson and admonition, for a man looks at things according to his concerns.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/139<\/p><\/blockquote>\n<p>That is, if our ultimate concern is truly to meet Allah in the Hereafter and we train ourselves to be mindful of this concern, we will see signs of it constantly throughout our day. One of the most obvious signs, especially for right-handed people, is the right hand itself. Allah informs us that the righteous believers will be given their book of deeds in the right hand on the Day of Judgement.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا<\/p>\n<p><strong>As for one given his book in his right hand, he will soon be judged with an easy accounting.<\/strong><\/p>\n<p>Surat al-Inshiqaq 84:7-8<\/p><\/blockquote>\n<p>For this reason, Al-Ghazali recommended for a worshiper, who begins ablution with his right hand as prescribed in the Sunnah, to remember Allah and recall the Hereafter by saying to himself:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللهم أعطني كتابي بيميني وحاسبني حساباً يسيراً<\/p>\n<p>O Allah, give me my book of deeds in my right hand, and judge me with an easy accounting.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/134<\/p><\/blockquote>\n<p>Hence, the right hand becomes an ever-present reminder for the believer of his desire to be judged among the righteous in the Hereafter. This is why the Prophet (ṣ) generally began all activities with his right hand.<\/p>\n<p>Aisha reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ التَّيَمُّنُ فِي تَنَعُّلِهِ وَتَرَجُّلِهِ وَطُهُورِهِ وَفِي شَأْنِهِ كُلِّهِ<\/p>\n<p>The Prophet, peace and blessings be upon him, liked to begin on his right side when putting on his shoes, combing his hair, performing his ablution, and in all of his affairs.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 166, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/01\/beginning-deeds-yamin-yameen\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Whether in acts of worship or mundane tasks, beginning with the right hand is a habit designed to increase our mindfulness of Allah in our daily lives and to remind us of our responsibility to prepare for the life to come.<\/p>\n<p>The same principle is true for the various daily routines performed by the Prophet (ṣ) throughout his day, including his many specific supplications for certain tasks. These very deliberate procedures, when performed mindfully, help us live in a structured and guided manner in remembrance of Allah, unlike animals who are accustomed to following their whims and fleeting desires.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولا تظنن أن أفعاله صلى الله عليه وسلم في جميع حركاته كانت خارجة عن وزن وقانون وترتيب بل جميع الأمور الاختيارية التي ذكرناها يتردد فيها الفاعل بين قسمين أو أقسام كان لا يقدم على واحد معين بالاتفاق بل بمعنى يقتضي الإقدام والتقديم فإن الاسترسال مهملاً كما يتفق سجية البهائم وضبط الحركات بموازين المعاني سجية أولياء الله تعالى &#8230; فنعوذ بالله أن يكون زمام حركاتنا وسكناتنا في يد الشيطان بواسطة الهوى<\/p>\n<p>Do not think the actions of the Prophet (ṣ) in all of his movements were without significance, rules, or procedures. Rather, all the preferred matters we have mentioned are habitually done in two or more ways, not because of one specific consensus, but rather a reason necessitating such procedure and giving it precedence. For to proceed neglectfully is like the disposition of animals, but the governance of movements by significant meanings is the disposition of the allies of Allah Almighty… We seek refuge in Allah that control of our movement and stillness be in the hands of devils by means of our whims.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/142<\/p><\/blockquote>\n<p>When we practice habits in the Sunnah with mindfulness, these are daily reminders of Allah and the Hereafter. They train us to go through life deliberately in opposition to whim, not like those with wandering minds who aimlessly go through life on ‘auto-pilot,’ so to speak.<\/p>\n<p>In sum, mindfulness is the state of awareness of oneself in relation to Allah. In its purest form, it is the highest spiritual state that a believer can achieve. Mindfulness involves being present with one’s heart and mind before Allah in the moment, as opposed to thinking about the past, future, or anything else. Mindful believers learn how to silence the ‘self-talk’ within their inner beings by habitually redirecting their attention to Allah Almighty. Mindfulness attained through prayer and meditation is further extended to the entire life of the believer through the habits, routines, and supplications of the Sunnah.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, Allah is ever watchful over you.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[160,125,317,183,22,32,50,100,470,372,60,400,66,68,472,220,471],"class_list":["post-21630","post","type-post","status-publish","format-standard","hentry","category-featured","tag-ablution-wudu","tag-gabriel-jibreel","tag-animals","tag-day-of-resurrection-yawm-al-qiyammah","tag-excellence-ihsaan","tag-hereafter-akhirah","tag-knowledge","tag-manners-al-adab","tag-mindfulness-muraqabah","tag-allah-names-asma-ul-husna","tag-prayer-salat","tag-refuge-al-taawwudh","tag-remembrance-dhikr","tag-satan-al-shaytan","tag-spirituality-al-tasawwuf","tag-supplication-al-dua","tag-whims-al-hawa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5CS","jetpack-related-posts":[{"id":21642,"url":"https:\/\/www.abuaminaelias.com\/how-to-achieve-mindfulness-in-islam\/","url_meta":{"origin":21630,"position":0},"title":"How to achieve mindfulness in Islam","author":"Abu Amina Elias","date":"February 2, 2020","format":false,"excerpt":"\"Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22738,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-dhikr-wa-dua\/","url_meta":{"origin":21630,"position":1},"title":"Imam al-Mundhiri on Remembrance of Allah","author":"Abu Amina Elias","date":"December 23, 2020","format":false,"excerpt":"\"The spoils of the gatherings of remembrance is Paradise.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":24261,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-muraqaba\/","url_meta":{"origin":21630,"position":2},"title":"Forty Hadith on Mindfulness","author":"Abu Amina Elias","date":"October 3, 2024","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14180,"url":"https:\/\/www.abuaminaelias.com\/worship-allah-in-fear-of-hellfire-and-hope-of-paradise\/","url_meta":{"origin":21630,"position":3},"title":"Worshiping Allah in fear and hope","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"They arise from their beds and they supplicate their Lord in fear and hope, and they spend from what We have provided them.\" --Surah As-Sajda 32:16","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22840,"url":"https:\/\/www.abuaminaelias.com\/held-accountable-thoughts\/","url_meta":{"origin":21630,"position":4},"title":"Are we held accountable for our thoughts?","author":"Abu Amina Elias","date":"February 14, 2021","format":false,"excerpt":"\"Allah has pardoned my nation for what occurs within themselves...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15200,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-dhikr-adhkar\/","url_meta":{"origin":21630,"position":5},"title":"Imam al-Nawawi on Remembrance of Allah","author":"Abu Amina Elias","date":"January 9, 2014","format":false,"excerpt":"\"Remember Me and I will remember you.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21630","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21630"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21630\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21630"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21630"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21630"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}