{"id":21642,"date":"2020-02-02T14:13:22","date_gmt":"2020-02-02T10:13:22","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21642"},"modified":"2025-06-29T10:47:39","modified_gmt":"2025-06-29T06:47:39","slug":"how-to-achieve-mindfulness-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/how-to-achieve-mindfulness-in-islam\/","title":{"rendered":"How to achieve mindfulness in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Mindfulness in Islam (<em>muraqabah<\/em>) is the state of being aware of oneself in relation to Allah. It is the opposite of heedlessness, negligence, and forgetfulness (<em>ghaflah<\/em>). We all know that we need to be more mindful in our prayers, acts of worship, and daily life, but what exactly can we do to cultivate this positive state of being?<\/p>\n<p>Mindfulness is a skill like any other skill, so it takes practice and self-discipline to strengthen it over the long term. The principal tool for cultivating mindfulness is a specific meditation exercise designed to train ourselves to catch our wandering mind and return it back to Allah. But this practice must be coupled with knowledge of the nature of thought itself, to increase our awareness of how thoughts work and what we can do to better control our reaction to them.<\/p>\n<p>Al-Ghazali explains this meditation as it was practiced in classical Islam:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثم يخلو بنفسه في زواية مع الاقتصار على الفرائض والرواتب ويجلس فارغ القلب مجموع الهم ولا يفرق فكره بقراءة قرآن ولا بالتأمل في تفسير ولا بكتب حديث ولا غيره بل يجتهد أن لا يخطر بباله شيء سوى الله تعالى فلا يزال بعد جلوسه في الخلوة قائلاً بلسانه الله الله على الدوام مع حضور القلب &#8230; وعند ذلك إذا صدقت إرادته وصفت همته وحسنت مواظبته فلم تجاذبه شهواته ولم يشغله حديث النفس بعلائق الدنيا تلمع لوامع الحق في قلبه<\/p>\n<p>Then let him seclude himself in his private nook, limiting himself to the religious obligations and supererogatory acts. Let him sit and empty his heart of every concern: neither scattered thoughts of reciting the Quran, nor pondering over its explanation, nor the books of prophetic traditions, nor anything else. Let him strive to not think of anything concerning his affair except for Allah Almighty, continuing to sit in seclusion while saying the name of Allah constantly, with presence of heart… Upon that, if his intentions are true, his concerns are in order, and his diligence is improved, then he will not gravitate to his base desires and will not be preoccupied with idle self-talk (<em>hadith al-nafs<\/em>) related to the world. The reality of the Truth will shine in his heart.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/19<\/p><\/blockquote>\n<p>In other words, a Muslim should go into their room alone with the intention of silencing the mind from random thoughts and self-talk. This could be done in as little as 5-10 minutes a day. One should focus on Allah as the object of attention, being aware of ourselves in relation to Him, and becoming accustomed to <em>feeling<\/em> this state of mindfulness. This exercise will not only enrich our spiritual lives, but it will also benefit our physical, mental, and emotional well-being.<\/p>\n<p>Thoughts will begin to emerge during meditation in a five-step process:<\/p>\n<ol>\n<li>\n<blockquote><p><em>Hajis<\/em>, a sudden fleeting thought.<\/p><\/blockquote>\n<\/li>\n<li>\n<blockquote><p><em>Khatir<\/em>, a thought given our attention.<\/p><\/blockquote>\n<\/li>\n<li>\n<blockquote><p><em>Hadith al-Nafs<\/em>, self-talk or talking to oneself about the thought.<\/p><\/blockquote>\n<\/li>\n<li>\n<blockquote><p><em>Ham<\/em>, decision to act upon the thought.<\/p><\/blockquote>\n<\/li>\n<li>\n<blockquote><p><em>‘Azm<\/em>, determination to act upon the thought.<\/p><\/blockquote>\n<\/li>\n<\/ol>\n<p>As we meditate, we are observing our thoughts from a neutral perspective as they unfold during this process. Ideally, we would like to be able to notice our thoughts in the initial stages of <em>hajis<\/em> and <em>khatir<\/em>, before they become more developed and we start talking to ourselves. Once the mind begins to wander in this manner, as it naturally will do, one should return to a state of mindfulness by saying the name of Allah or another supplication from the Sunnah.<\/p>\n<p>Sometimes the Prophet (ṣ) would become distracted and forget Allah for a brief moment, so he would ask forgiveness from Allah as a way to <em>anchor<\/em> his mindfulness and restore his remembrance.<\/p>\n<p>Al-Aghar al-Muzani reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لَأَسْتَغْفِرُ اللَّهَ فِي الْيَوْمِ مِائَةَ مَرَّةٍ<\/p>\n<p><strong>Verily, at times there is fog over my heart, so I seek the forgiveness of Allah one hundred times in a day<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2702, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/prophet-anchors-muraqabah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قِيلَ الْمُرَادُ الْفَتَرَاتُ وَالْغَفَلَاتُ عَنِ الذِّكْرِ الَّذِي كَانَ شَأْنُهُ الدَّوَامَ عَلَيْهِ فَإِذَا فتَرَ عَنْهُ أَوْ غَفَلَ عَدَّ ذَلِكَ ذَنْبًا وَاسْتَغْفَرَ مِنْهُ<\/p>\n<p>It is said that it means the Prophet (ṣ) had intervals of distraction from remembrance of Allah, as remembrance was his normal state of affairs. When he had a period of inattention or distraction, he would consider that a sin and seek forgiveness for it.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 2702<\/p><\/blockquote>\n<p>When we are in mindfulness meditation, we can use similar phrases from the Sunnah – a name of Allah, a supplication, and so on – to return our attention to Allah as soon as we notice our mind wandering. This is called <em>anchoring<\/em> our mindfulness, because over time our minds will associate these phrases with the feeling of being mindful. Every time we bring back our wandering mind via anchoring, it is like doing a mental push-up. It strengthens our mindfulness as if it were a muscle in the brain. It is as simple as that.<\/p>\n<p>Ibn al-Qayyim describes a way we can practice this type of anchoring in our mindfulness meditation:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا ذِكْرُ الرِّعَايَةِ فَمِثْلُ قَوْلِ الذَّاكِرِ اللَّهُ مَعِي وَاللَّهُ نَاظِرٌ إِلَيَّ اللَّهُ شَاهِدِي وَنَحْوُ ذَلِكَ مِمَّا يُسْتَعْمَلُ لِتَقْوِيَةِ الْحُضُورِ مَعَ اللَّهِ وَفِيهِ رِعَايَةٌ لِمَصْلَحَةِ الْقَلْبِ وَلِحِفْظِ الْأَدَبِ مَعَ اللَّهِ وَالتَّحَرُّزِ مِنَ الْغَفْلَةِ وَالِاعْتِصَامِ مِنَ الشَّيْطَانِ وَالنَّفْسِ<\/p>\n<p>As for the remembrance of watchfulness, it is like the worshiper saying: Allah is with me, Allah is looking at me, Allah is observing me, and other such words used to strengthen one&#8217;s presence with Allah. In it is care for the well-being of the heart, maintaining good manners with Allah, being wary of mindlessness, and seeking protection from Satan and the lower-self.<\/p>\n<p>Source: Madārij al-Sālikīn 2\/406<\/p><\/blockquote>\n<p>The purpose of meditation is not to suppress our thoughts, as this is impossible and counterproductive. Rather, the goal is to become aware of our thoughts as they arise, observe them, and allow them to drift away as we return our attention to Allah. Thoughts are like waves. They will inevitably appear, but they will go away if you leave them alone. Once you engage them or try to push them away, it only makes the waves more turbulent.<\/p>\n<p>Ibn al-Qayyim likened random thoughts in the wandering mind to pedestrians who will eventually go away if you ignore them:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ وُرُودَ الْخَاطِرِ لَا يَضُرُّ وَإِنَّمَا يَضُرُّ اسْتِدْعَاؤُهُ وَمُحَادَثَتُهُ فَالْخَاطِرُ كَالْمَارِّ عَلَى الطَّرِيقِ فَإِنْ تَرَكْتَهُ مَرَّ وَانْصَرَفَ عَنْكَ<\/p>\n<p>Know that passing thoughts are not harmful. Indeed, they are only harmful if they are sought and engaged. For a thought is like a passerby on the road; if you ignore him, he will pass by and depart from you.<\/p>\n<p>Source: al-Jawāb al-Kāfī 1\/157<\/p><\/blockquote>\n<p>In this sense, we are not defined by our thoughts and we should not identify ourselves with our thoughts, a realization psychologists call <em>cognitive defusion<\/em>. Thoughts arise naturally, sometimes from the depths of the ego (<em>nafs<\/em>) but other times from the inspiration of angels or Satan.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ خَلَقْنَا الْإِنسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ<\/p>\n<p><strong>We have created humanity and We know what his soul <\/strong>(<em>nafs<\/em>)<strong> whispers to him. We are closer to him than his jugular vein.<\/strong><\/p>\n<p>Surat Qaf 50:16<\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلشَّيْطَانِ لَمَّةً بِابْنِ آدَمَ وَلِلْمَلَكِ لَمَّةً فَأَمَّا لَمَّةُ الشَّيْطَانِ فَإِيعَادٌ بِالشَّرِّ وَتَكْذِيبٌ بِالحَقِّ وَأَمَّا لَمَّةُ الْمَلَكِ فَإِيعَادٌ بِالخَيْرِ وَتَصْدِيقٌ بِالحَقِّ فَمَنْ وَجَدَ ذَلِكَ فَلْيَعْلَمْ أَنَّهُ مِنَ اللهِ فَلْيَحْمَدِ اللَّهَ وَمَنْ وَجَدَ الأُخْرَى فَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ<\/p>\n<p><strong>Verily, Satan has influence with the son of Adam and the angel has influence. As for the influence of Satan, he promises evil and denies the truth. As for the influence of the angel, he promises goodness and affirms the truth. Whoever finds this goodness, let him know that it is from Allah and let him praise Allah. Whoever finds something else, let him seek refuge in Allah from the accursed Satan.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet (ṣ) recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُم بِالْفَحْشَاءِ وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا<\/p>\n<p><strong>Satan threatens you with poverty and commands evil, but Allah promises you forgiveness and favor from him<\/strong>. (2:268)<\/p>\n<p>Source: Sunan al-Tirmidhī 2988, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/08\/14\/waswas-angels-devils\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Many of our thoughts originate from such external sources in the most literal sense. Evil thoughts encouraging us to sin or terrifying us come from the devilish jinn. Therefore, we should not view them as residing within our essence, nor should we negatively judge ourselves simply for experiencing them.<\/p>\n<p>Based upon this insight, our mindfulness meditation trains us to put distance between ourselves and our thoughts, so that we can better observe them and control our reaction to them. This is called finding the <em>reaction space<\/em>. If a thought is beneficial, we can pursue it on our own terms. If a thought is harmful, we can ignore it by returning our attention to Allah via anchoring.<\/p>\n<p>Having access to the reaction space is a blessing from Allah, whereas lacking this space give Satan an advantage over us.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّأَنِّي مِنَ اللَّهِ وَالْعَجَلَةُ مِنَ الشَّيْطَانِ<\/p>\n<p><strong>Deliberation is from Allah, and recklessness is from Satan<\/strong>.<\/p>\n<p>Source: al-Sunan al-Kubrá 18651, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/09\/15\/calmness-allah-haste-shaytan\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Ta’anni <\/em>(deliberation) means to be careful and to take one’s time to react properly. <em>‘Ajalah<\/em> (recklessness) means to react in a careless, rash, and knee-jerk fashion. As we train ourselves to observe our thoughts in mindfulness meditation, this will help us expand the reaction space and thereby apply appropriate deliberation before we act. It will prevent us from reacting in an extreme way to strong emotional states like anger or grief.<\/p>\n<p>According to some of the early Muslims, learning to be mindful of Allah with regards to our innermost thoughts is the key to earning His protection from evil in the world and the Hereafter.<\/p>\n<p>Al-Qushayri writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ بَعْضهم من راقب اللَّه تَعَالَى فِي خواطره عصمه اللَّه تَعَالَى فِي جوارحه<\/p>\n<p>Some of the predecessors said: Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/330<\/p><\/blockquote>\n<p>In sum, mindfulness of Allah can be cultivated through a specific meditation designed to help us control how we react to our thoughts. The core insights of this practice include knowledge of how thoughts develop, anchoring mindfulness by using supplications to return our attention to Allah, cognitive defusion or dissociating our identity from our thoughts, and expanding the reaction space or the amount of time between thought and reaction. This practice can enrich our spiritual lives, as well as benefit our physical, mental, and emotional well-being.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[122,476,288,32,34,100,470,58,358,84,477,400,66,68,478,70,220,435,471,332],"class_list":["post-21642","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-angels-malaikah","tag-deliberation-al-taanni","tag-desires-shahawat","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-manners-al-adab","tag-mindfulness-muraqabah","tag-patience-al-sabr","tag-praise-al-hamd","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-recklessness-al-ajalah","tag-refuge-al-taawwudh","tag-remembrance-dhikr","tag-satan-al-shaytan","tag-seeking-forgiveness-al-istighfar","tag-sincerity-al-ikhlaas","tag-supplication-al-dua","tag-wellness-al-afiyyah","tag-whims-al-hawa","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5D4","jetpack-related-posts":[{"id":21630,"url":"https:\/\/www.abuaminaelias.com\/mindfulness-in-the-quran-and-sunnah\/","url_meta":{"origin":21642,"position":0},"title":"Mindfulness in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 28, 2020","format":false,"excerpt":"\"Verily, Allah is ever watchful over you.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14180,"url":"https:\/\/www.abuaminaelias.com\/worship-allah-in-fear-of-hellfire-and-hope-of-paradise\/","url_meta":{"origin":21642,"position":1},"title":"Worshiping Allah in fear and hope","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"They arise from their beds and they supplicate their Lord in fear and hope, and they spend from what We have provided them.\" --Surah As-Sajda 32:16","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16920,"url":"https:\/\/www.abuaminaelias.com\/the-meaning-of-spiritual-excellence-in-islam\/","url_meta":{"origin":21642,"position":2},"title":"Spiritual excellence in Islam","author":"Abu Amina Elias","date":"August 29, 2015","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him, for although you do not see Him yet He certainly sees you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16677,"url":"https:\/\/www.abuaminaelias.com\/depression-anxiety-islam\/","url_meta":{"origin":21642,"position":3},"title":"Overcoming depression and anxiety with Islam","author":"Abu Amina Elias","date":"July 6, 2015","format":false,"excerpt":"\"There is good for a believer in every matter.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21729,"url":"https:\/\/www.abuaminaelias.com\/understanding-sufism-in-islam\/","url_meta":{"origin":21642,"position":4},"title":"Understanding Sufism in Islam","author":"Abu Amina Elias","date":"February 25, 2020","format":false,"excerpt":"\"Sufism is to be mindful of one’s inner-states and adhere to good manners.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21680,"url":"https:\/\/www.abuaminaelias.com\/understanding-the-soul-in-islam\/","url_meta":{"origin":21642,"position":5},"title":"Understanding the soul in Islam","author":"Abu Amina Elias","date":"February 13, 2020","format":false,"excerpt":"\"Whoever knows himself, knows his Lord.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21642","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21642"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21642\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21642"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21642"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21642"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}