{"id":21662,"date":"2020-02-11T11:49:35","date_gmt":"2020-02-11T07:49:35","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21662"},"modified":"2020-07-17T21:39:16","modified_gmt":"2020-07-17T17:39:16","slug":"whoever-knows-himself-knows-his-lord","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/whoever-knows-himself-knows-his-lord\/","title":{"rendered":"Whoever knows himself, knows his Lord"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>True self-knowledge is essential for one to establish a relationship with the Creator. The human soul contains mysteries that, when discovered, reveal the nature of Allah to us and allow us to grow closer to Him.<\/p>\n<p>A classic Arabic proverb states:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ عَرَفَ نَفْسَهُ فَقَدْ عَرَفَ رَبَّهُ<\/p>\n<p>Whoever knows himself, knows his Lord.<\/p>\n<p>Source: Ḥilyat al-Awliyā’ 10\/208<\/p><\/blockquote>\n<p>This saying is sometimes incorrectly ascribed to the Prophet (ṣ), but in reality is was more likely a statement of one of the early Muslims. Nevertheless, it was widely circulated among them and commented upon by later scholars, demonstrating that the wisdom it contains was acknowledged and appreciated.<\/p>\n<p>There are many interpretations and insights derived from this proverb and this article will not survey them all. Instead, this article will highlight the way this proverb relates to one’s purification of the heart and the soul.<\/p>\n<p>When Allah created humanity, He placed a portion of His spirit within us. The spirit of Allah, in this context, means the spirit created by Allah and owned by Allah, not part of the essence of Allah. Humanity is honored with this unique capacity, facilitated by the spirit, to connect with the Divine through worshiping Him and voluntarily submitting to His will.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ سَوَّاهُ وَنَفَخَ فِيهِ مِن رُّوحِهِ ۖ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۚ قَلِيلًا مَّا تَشْكُرُونَ<\/p>\n<p><strong>Then, He fashioned him and blew into him from His spirit. He made for you hearing, seeing, and hearts, yet little are you grateful. <\/strong><\/p>\n<p>Surat al-Sajdah 32:8<\/p><\/blockquote>\n<p>Al-Baydawi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِضَافَةً إِلَى نَفْسِهِ تَشْرِيفًا لَهُ وَإِشْعَارًا بِأَنَّهُ خَلْقٌ عَجِيبٌ وَأَنَّ لَهُ شَأْنًا لَهُ مُنَاسَبَةٌ مَا إِلَى الْحَضْرَةِ الرُّبُوبِيَّةِ وَلِأَجْلِهِ قِيلَ مَنْ عَرَفَ نَفْسَهُ فَقَدْ عَرَفَ رَبَّهُ<\/p>\n<p>It adds nobility to himself and indicates that humanity is a wondrous creation, that his prestige is appropriate enough to enter the presence of the Lord. For this reason, it is said: Whoever knows himself, knows his Lord.<\/p>\n<p>Source: Tafsīr al-Bayḍāwī 32:8<\/p><\/blockquote>\n<p>The spirit of Allah within human beings is reflected in our motivation to reach Him, to uncover the mysteries of His creation, and to be vehicles through which the will of Allah is accomplished, manifested in His attributes of mercy, justice, and wisdom. It is in the essential nature (<em>fitrah<\/em>) of human beings to incline towards His worship and to aspire towards higher levels of consciousness in our journey towards Him.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فمن عرف سر الروح فقد عرف نفسه وإذا عرف نفسه فقد عرف ربه وإذا عرف نفسه وربه عرف أنه أمر رباني بطبعه وفطرته وأنه في العالم الجسماني غريب وأن هبوطه إليه لم يكن بمقتضى طبعه في ذاته<\/p>\n<p>Whoever knows the mysteries of the spirit, knows himself. If he knows himself, he knows his Lord. If he knows himself and his Lord, he knows his matter is heavenly in his nature and his instinct, and that he is a stranger in the corporeal world, that his decent into it is not as a result of his nature in itself.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/382<\/p><\/blockquote>\n<p>In other words, humankind is not merely a glorified animal or a clump of cells. Inside every person is the potential to become a true servant of the Almighty Lord, to reflect His attributes off the mirror of their pure hearts into the world. For this reason, one who awakens the spirit of Allah within themselves will act under the guidance of Allah, as if it were Allah Himself acting through them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَالَ وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ وَيَدَهُ الَّتِي يَبْطِشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا<\/p>\n<p><strong>Allah said: My servant does not grow closer to me with anything more beloved to Me than the duties I have imposed upon him. My servant continues to grow closer to Me with extra good works until I love him. When I love him, I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes, and his foot with which he walks.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6137, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/22\/saints-loyal-friends-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When one comes to know this fundamental truth about human nature, they have come to know a corollary truth about the Creator.<\/p>\n<p>From another perspective, the state of our hearts and spiritual flaws is an indication of our relationship with the Creator. The more effort we put into striving in worship and refining our character, the closer we grow to Allah. In contrast, giving into sin and indulging the lowest parts of the ego distances us from Allah.<\/p>\n<p>Sahl ibn Abdullah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا عَرَفَ نَفْسَهُ عَرَفَ مَقَامَهُ مِنْ رَبِّهِ وَإِذَا عَرَفَ عَقْلَهُ عَرَفَ حَالَهُ فِيمَا بَيْنَهُ وَبَيْنَ رَبِّهِ<\/p>\n<p>If one knows himself, one knows his status with his Lord. If one knows his mind, one knows his state between him and his Lord.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/02\/09\/sahl-muraqabah-knows-himself\/\">Ḥilyat al-Awliyā’ 10\/201<\/a><\/p><\/blockquote>\n<p>As such, we should construct our personal identities around what the Creator has decreed to be good. We should allow Allah to define who we are, and as a result, Allah will reward us in the best manner.<\/p>\n<p>Sahl was asked about the saying, “Whoever knows himself, knows his Lord.” Sahl said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ عَرَّفَ نَفْسَهُ لِرَبِّهِ عَرَّفَ رَبَّهُ لِنَفْسِهِ<\/p>\n<p>Whoever defines himself for the sake of his Lord, his Lord defines him for the sake of himself.<\/p>\n<p>Source: Ḥilyat al-Awliyā’ 10\/208<\/p><\/blockquote>\n<p>Based upon this revealed knowledge, one who truly knows the spiritual condition of their soul, on a personal and individual level, should be mindful of it and practice self-discipline (<em>muhasabah<\/em>). We should aspire to bring out the heavenly aspects that are ingrained within the nature of our souls, an objective of tremendous importance in our religion.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهو الذي إذا عرفه الإنسان فقد عرف نفسه وإذا عرف نفسه فقد عرف ربه وهو الذي إذا جهله الإنسان فقد جهل نفسه وإذا جهل نفسه فقد جهل ربه &#8230; ومن لم يعرف قلبه ليراقبه ويراعيه ويترصد لما يلوح من خزائن الملكوت عليه وفيه فهو ممن قال الله تعالى فيه نسوا الله فأنساهم أنفسهم أولئك هم الفاسقون فمعرفة القلب وحقيقة أوصافه أصل الدين وأساس طريق السالكين<\/p>\n<p>The heart is that by which a human being comes to know himself. If he comes to know himself, he knows his Lord. It is that by which a human being is ignorant of himself. If he is ignorant of himself, he is ignorant of his Lord… Whoever does not know his heart, to be mindful of it, to be watchful over it, and to observe what shines over it and through it of heavenly treasures, he is one of those about whom Allah Almighty said: <strong>They forgot Allah, so He made them forget themselves, those are truly wicked<\/strong>, (59:19). Thus, knowledge of the heart, its realities, and its qualities is the foundation of the religion and the basis of spiritual seeking.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3:2-3<\/p><\/blockquote>\n<p>And Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولن تصل أيها الطالب إلى القيام بأوامر الله تعالى إلا بمراقبة قلبك وجوارحك في لحظاتك وأنفاسك<\/p>\n<p>O seeker, you will never be able to establish the commands of Allah Almighty unless you are mindful of your heart, your limbs, your every moment, and your every breath.<\/p>\n<p>Source: Bidāyat al-Hidāyah 1\/28<\/p><\/blockquote>\n<p>To inspire the emergence of our heavenly nature, we need to study the lives of the Prophets and the righteous predecessors, to internalize their moral worldview, and to realign ourselves towards the disposition we were meant to be. Once we have sufficiently centered ourselves within the knowledge of this heavenly nature, we can actually begin to glean moral knowledge from our personal God-given conscience.<\/p>\n<p>Al-Nawwas ibn Sam’an reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ<\/p>\n<p><strong>Righteousness is good character, and sin is what waivers in your heart and you hate for people to find out about it<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2553, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/09\/13\/al-birr-al-husn-al-khuluq\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Mulaqqin reported: Al-Ahnaf ibn Qays, may Allah have mercy on him, was asked, “From whom did you learn sacred knowledge?” Al-Ahnaf said, “From myself.” It was said, “And how is that?” Al-Ahnaf said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا كرهتُ شيئًا من غيري لم أفعل باحد مثله<\/p>\n<p>If I hated something did by another, I would never do the same to anyone else.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/04\/09\/ahnaf-knowledge-learn-treat\/\">al-Tawḍīḥ li-Sharḥ al-Jāmi’ al-Ṣaḥīḥ 2\/512<\/a><\/p><\/blockquote>\n<p>Put differently, when we have returned to our pure and original heavenly nature, we will naturally identify what is good and bad by how our personal conscience reacts to it. This is because when the heart is full of the spirit of Allah, the spirit guides the heart towards the morally upright path. Abu Talib al-Makki likewise explained the meaning of the classic proverb, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَاهُ إِذَا عَرَفْتَ صِفَاتِ نَفْسِكَ فِي مُعَامَلَةِ الْخَلْقِ وَأَنَّكَ تَكْرَهُ الِاعْتِرَاضَ عَلَيْكَ فِي أَفْعَالِكَ وَأَنْ يُعَابَ عَلَيْكَ مَا تَصْنَعُهُ عَرَفْتَ مِنْهَا صِفَاتِ خَالِقِكَ وَأَنَّهُ يَكْرَهُ ذَلِكَ فَارْضَ بِقَضَائِهِ وَعَامِلْهُ بِمَا تُحِبُّ أَنْ تُعَامَلَ بِهِ<\/p>\n<p>The expression means if you know the qualities of yourself in dealing with the creation, that you hate what counts against you regarding your deeds, that what you do casts blame against you, you will know by that the qualities of your Creator and that He hates those bad deeds, so be content with His decree and deal with Him as you would like to be dealt with by Him.<\/p>\n<p>Source: al-Ḥāwī li-Fatāwī 2\/288<\/p><\/blockquote>\n<p>Allah rewards or punishes us in the same way we treated His creation. If we were good to them, Allah will be good to us. If we were evil to them, Allah will punish us with a just recompense. Thus, when we have access to our purified conscience, guided by revealed religious knowledge, we know intuitively how Allah wants us to behave with His creation, as we should love for others what we love for ourselves.<\/p>\n<p>For instance, sound human nature is repulsed by the ugliness of arrogance. A truly self-introspective person instinctively recognizes that they have no reason to be arrogant, nor are they pleased with it. When one realizes they have no justification to boast, they also realize that only Allah deserves to be absolutely glorified by His creation.<\/p>\n<p>Al-Bukhari reported: Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَرَدْتَ أَنْ تَذْكُرَ عُيُوبَ صَاحِبِكَ فَاذْكُرْ عُيُوبَ نَفْسِكَ<\/p>\n<p>If you intend to mention the faults of your companions, then remember the faults in yourself.<\/p>\n<p>Source: al-Adab al-Mufrad 328, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2018\/12\/30\/ibn-abbas-remember-your-faults\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>And Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ يَعْرِفَ نَفْسَهُ وَيَعْرِفَ رَبَّهُ تَعَالَى وَيَكْفِيهِ ذَلِكَ فِي إِزَالَةِ الْكِبْرِ فَإِنَّهُ مَهْمَا عَرَفَ نَفْسَهُ حَقَّ الْمَعْرِفَةِ عَلِمَ أنه أذل من كل ذليل وأقل من كل قليل وأنه لا يليق به إلا التواضع والذلة والمهانة وَإِذَا عَرَفَ رَبَّهُ عَلِمَ أَنَّهُ لَا تَلِيقُ الْعَظَمَةُ وَالْكِبْرِيَاءُ إِلَّا بِاللَّهِ<\/p>\n<p>One who knows himself, knows his Lord Almighty, and that is enough to remove arrogance. No matter what he truly knows about himself, he will know that he is abased in every way, he is small in every way. There is nothing appropriate for him but to be humble, meek, and unassuming. If he knows his Lord, he will know that glory and grandeur are not befitting for anyone but Allah.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/358<\/p><\/blockquote>\n<p>In sum, authentic knowledge of the human soul leads to better knowledge of Allah. One who knows the heavenly nature inherent within their soul will know the divine attributes of its Creator. Every person has the created spirit of Allah within themselves and can potentially activate it by following the path of purification set forth by the Prophets and the righteous predecessors.<\/p>\n<p>One who achieves a higher level of consciousness in relation to Allah, who aligns themselves with their heavenly nature, under guidance of divine revelation, has the ability to glean moral knowledge from their own personal conscience. At the same time, one who knows the character flaws within themselves has no choice but to be humble before the Creator and His creation.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever knows himself, knows his Lord.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[14,16,480,20,322,34,104,48,50,100,54,470,301,84,66,91,479,472],"class_list":["post-21662","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-arrogance-al-takabbur","tag-character-akhlaq","tag-contentment-al-qanaah","tag-creation-al-khalq","tag-gratitude-al-shukr","tag-humanity-al-insaaniyyah","tag-humility-al-tawaduh","tag-justice-adl","tag-knowledge","tag-manners-al-adab","tag-mercy-al-rahmah","tag-mindfulness-muraqabah","tag-pure-nature-fitrah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-remembrance-dhikr","tag-righteous-predecessors-al-salaf-al-salih","tag-self-discipline-al-muhasabah","tag-spirituality-al-tasawwuf"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Do","jetpack-related-posts":[{"id":21680,"url":"https:\/\/www.abuaminaelias.com\/understanding-the-soul-in-islam\/","url_meta":{"origin":21662,"position":0},"title":"Understanding the soul in Islam","author":"Abu Amina Elias","date":"February 13, 2020","format":false,"excerpt":"\"Whoever knows himself, knows his Lord.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17756,"url":"https:\/\/www.abuaminaelias.com\/seeking-knowledge-and-learning-for-life-in-islam\/","url_meta":{"origin":21662,"position":1},"title":"Life-long learning in Islam","author":"Abu Amina Elias","date":"February 18, 2016","format":false,"excerpt":"\"It is not befitting for anyone with knowledge to give up learning.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20664,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-knowledge\/","url_meta":{"origin":21662,"position":2},"title":"Forty Hadith on Knowledge","author":"Abu Amina Elias","date":"July 7, 2019","format":false,"excerpt":"\"Seeking knowledge is an obligation on every Muslim.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16260,"url":"https:\/\/www.abuaminaelias.com\/jihad-against-the-soul-in-islam\/","url_meta":{"origin":21662,"position":3},"title":"Jihad against the soul in Islam","author":"Abu Amina Elias","date":"January 27, 2015","format":false,"excerpt":"\"He has succeeded who purifies the soul,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13557,"url":"https:\/\/www.abuaminaelias.com\/suicide-bombings-in-islam\/","url_meta":{"origin":21662,"position":4},"title":"Suicide bombings are unlawful in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill yourselves. Verily, Allah is ever merciful to you.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13006,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-seeking-knowledge\/","url_meta":{"origin":21662,"position":5},"title":"Imam al-Nawawi on Seeking Knowledge","author":"Abu Amina Elias","date":"March 27, 2013","format":false,"excerpt":"\"My Lord, increase me in knowledge.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21662","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21662"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21662\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21662"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21662"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21662"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}