{"id":21680,"date":"2020-02-13T14:58:43","date_gmt":"2020-02-13T10:58:43","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21680"},"modified":"2020-07-17T21:39:13","modified_gmt":"2020-07-17T17:39:13","slug":"understanding-the-soul-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/understanding-the-soul-in-islam\/","title":{"rendered":"Understanding the soul in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Self-knowledge is vital to the spiritual development of every Muslim believer. One must know the make-up of his or her psyche in order to optimally improve it. Islam provides us with a blueprint of the human soul for this very purpose.<\/p>\n<p>The psyche (inner-self) of an individual is composed of four parts: the heart (<em>qalb<\/em>), the spirit (<em>ruh<\/em>), the self or ego (<em>nafs<\/em>), and the mind (<em>‘aql<\/em>). Each part reflects a different aspect of the psyche, although they interact with each other in ways that overlap.<\/p>\n<p>In ordinary language, each term can refer to the composite whole of the psyche, so one may speak of their “heart” or “self” to mean their entire inner-being. But for the purpose of spiritual development, it is important to highlight the subtle distinctions between these terms.<\/p>\n<p>Imam al-Ghazali explains the different meanings of these four terms in <em>Kitab Sharh ‘Aja’ib al-Qalb<\/em> of his magnum opus. Each term has more than one meaning depending on the context in which it is used. Like Al-Ghazali, our interest should be in how distinguishing the parts of the psyche can support our quest to purify our souls.<\/p>\n<p>The first term “heart” can refer to the corporeal heart, the physical organ within the chest that pumps blood throughout the body. It can also refer to the ethereal heart, the inner-most consciousness that is the essence of the human being.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والمعنى الثاني هو لطيفة ربانية روحانية لها بهذا القلب الجسماني تعلق وتلك اللطيفة هي حقيقة الإنسان وهو المدرك العالم العارف من الإنسان وهو المخاطب والمعاقب والمعاتب والمطالب<\/p>\n<p>The second meaning of heart is a subtle, heavenly, and spiritual substance it has, which is related to the physical heart. This subtle substance is the true essence of the human being. It is the conscious, knowing, and perceiving part of the human being. It is addressed, punished, blamed, and accountable.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/3<\/p><\/blockquote>\n<p>The ethereal heart should be our most important concern, because no one will benefit on the Day of Judgment unless they bring a pure heart with them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ<\/p>\n<p><strong>A Day in which wealth and children will not benefit, except one who comes to Allah with a pure heart.<\/strong><\/p>\n<p>Surat al-Shu’ara 26:88-89<\/p><\/blockquote>\n<p>Both the physical and ethereal hearts are essential for the health of the human being. If the physical heart is damaged or malfunctioning, it can quickly lead to sudden death. If the ethereal heart is corrupted by spiritual diseases, it will lead to a type of spiritual death and damnation in the Hereafter.<\/p>\n<p>Al-Nu’man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ أَلَا وَهِيَ الْقَلْبُ<\/p>\n<p><strong>Verily, in the body is a piece of flesh which, if sound, the entire body is sound, and if corrupt, the entire body is corrupt. Truly, it is the heart.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 52, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/14\/halal-haram-clear\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, the matters of the heart are among the most important branches of knowledge in the entire religion. Purifying the heart of internal sins like arrogance, malice, and envy is paramount to our success in this life and the next. We can better understand how to purify the heart by recognizing the ways that the other parts of the psyche influence it.<\/p>\n<p>The second term “spirit” can refer to the life-force that permeates and animates the body. When the spirit is removed, the body will die. It can also refer to the higher-self, the capacity of a human being to receive divine inspiration (<em>ilham<\/em>) and guidance from Allah.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">المعنى الثاني هو اللطيفة العالمة المدركة من الإنسان وهو الذي شرحناه في أحد معاني القلب &#8230; وهو أمر عجيب رباني تعجز أكثر العقول والأفهام عن درك حقيقته<\/p>\n<p>The second meaning of spirit is the subtle, knowing, conscious substance of the human being, which we have explained is one of the meanings of the heart… It is a wondrous, heavenly matter. Most people of intellect and understanding are unable to conceive of its reality.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/3<\/p><\/blockquote>\n<p>The modality in which the spirit animates the body is one of the universe’s greatest mysteries. Being an aspect of the Unseen, it cannot be studied or known by the standard scientific method.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَسْأَلُونَكَ عَنِ الرُّوحِ ۖ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا<\/p>\n<p><strong>They ask you about the spirit. Say: The spirit is among the affairs of my Lord, you have been given little knowledge of it. <\/strong><\/p>\n<p>Surat al-Isra’ 17:85<\/p><\/blockquote>\n<p>The spirit has a lordly and heavenly quality (<em>rabbani<\/em>), meaning it is the aspect of the psyche that reflects the attributes of the Creator. Allah blew His created spirit into human beings, resulting in their ability to see, to hear, and to perceive with their hearts.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ سَوَّاهُ وَنَفَخَ فِيهِ مِن رُّوحِهِ ۖ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۚ قَلِيلًا مَّا تَشْكُرُونَ<\/p>\n<p><strong>Then, He fashioned him and blew into him from His spirit. He made for you hearing, seeing, and hearts, yet little are you grateful.<\/strong><\/p>\n<p>Surat al-Sajdah 32:8<\/p><\/blockquote>\n<p>Al-Baydawi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِضَافَةً إِلَى نَفْسِهِ تَشْرِيفًا لَهُ وَإِشْعَارًا بِأَنَّهُ خَلْقٌ عَجِيبٌ وَأَنَّ لَهُ شَأْنًا لَهُ مُنَاسَبَةٌ مَا إِلَى الْحَضْرَةِ الرُّبُوبِيَّةِ وَلِأَجْلِهِ قِيلَ مَنْ عَرَفَ نَفْسَهُ فَقَدْ عَرَفَ رَبَّهُ<\/p>\n<p>It adds nobility to himself and indicates that humanity is a wondrous creation, that his prestige is appropriate enough to enter the presence of the Lord. For this reason, it is said: Whoever knows himself, knows his Lord.<\/p>\n<p>Source: Tafsīr al-Bayḍāwī 32:8<\/p><\/blockquote>\n<p>Allah is perfect in His hearing, seeing, and knowing, as well as His justice, mercy, and kindness. Human beings also have these attributes, albeit in smaller finite measure. When a believer is kind, for example, he or she is merely reflecting the attribute of kindness found within the Creator. In this way, one who truly knows themselves will know their Lord.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فمن عرف سر الروح فقد عرف نفسه وإذا عرف نفسه فقد عرف ربه وإذا عرف نفسه وربه عرف أنه أمر رباني بطبعه وفطرته وأنه في العالم الجسماني غريب وأن هبوطه إليه لم يكن بمقتضى طبعه في ذاته<\/p>\n<p>Whoever knows the mysteries of the spirit, knows himself. If he knows himself, he knows his Lord. If he knows himself and his Lord, he knows his matter is heavenly in his nature and his instinct, and that he is a stranger in the corporeal world, that his decent into it is not as a result of his nature in itself.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/382<\/p><\/blockquote>\n<p>Everyone has the natural capacity to activate and cultivate the spirit, their higher level of consciousness in relation to Allah. Like a mirror, a pure heart reflects divine light from the spirit into the world. In order to achieve such a pure heart, one must follow the influence of the spirit upon the heart, as opposed to the whims of the lower-self.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فالقلب في حكم مرآة قد اكتنفته هذه الأمور المؤثرة فيه وهذه الآثار على التواصل واصلة إلى القلب أما الآثار المحمودة التي ذكرناها فإنها تزيد مرآة القلب جلاء وإشراقاً ونوراً وضياءً حتى يتلألأ فيه جلية الحق وينكشف فيه حقيقة الأمر المطلوب في الدين<\/p>\n<p>For the heart is in the position of a mirror that is surrounded by influences and these effects proceed in succession to the heart. As for praiseworthy influences that we have mentioned, they will polish the mirror of the heart and increase it in brilliance, light, and radiance until the clarity of the Truth shines from within it and the reality of the matter sought in religion is unveiled within it.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/12<\/p><\/blockquote>\n<p>The third term “self” can refer to a person’s identity or the composite whole of their psyche. This is how the term is commonly used in ordinary language. As a specific term, the self can refer to the lower-self, ego, or id, which is the receptacle of basic sensations, emotions, and instincts like fear, aggression, and carnal desire.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أحدهما أنه يراد به المعنى الجامع لقوة الغضب والشهوة في الإنسان على ما سيأتي شرحه وهذا الاستعمال هو الغالب على أهل التصوف لأنهم يريدون بالنفس الأصل الجامع للصفات المذمومة من الإنسان فيقولون لا بد من مجاهدة النفس وكسرها<\/p>\n<p>One of the intended meanings of ‘self’ is the combination of faculties of anger and appetite in the human being, and based on this it will be explained. This usage is prevalent among the scholars of spirituality (<em>ahl al-tasawwuf<\/em>), that they mean by ‘self’ the combined origin of blameworthy traits within the human being, such that they say one must strive against the self and break it.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/4<\/p><\/blockquote>\n<p>The lower-self is not evil in itself, as these most basic feelings in our psyche are critical to our survival. However, unlike the spirit, the lower-self has a tendency to follow its harmful whims (<em>hawa’<\/em>) and lusts (<em>shahawat<\/em>), a weakness that is the primary weapon of Satan. The imperative of the believer is to reign in the lower-self and bring it under control of the higher-self.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ<\/p>\n<p><strong>As for him who feared to stand before his Lord and he restrained his ego from his whims, Paradise will be his refuge.<\/strong><\/p>\n<p>Surat al-Nazi&#8217;at 79:40<\/p><\/blockquote>\n<p>For this reason, many scholars referred to the ‘self’ as an enemy against which we should wage spiritual war. The true jihad, in fact, is to fight in jihad against the lower-self and its whims.<\/p>\n<p>Fadalah ibn ‘Ubayd reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُجَاهِدُ مَنْ جَاهَدَ نَفْسَهُ<\/p>\n<p><strong>The one who strives in jihad is he who strives against his ego<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1621, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/13\/mujahid-jihad-against-his-soul\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It is in this context that Sahl ibn Abdullah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا عَرَفَ الْعَدُوَّ عَرَفَ رَبَّهُ<\/p>\n<p>If one knows the enemy, one knows his Lord.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/02\/09\/sahl-muraqabah-knows-himself\/\">Ḥilyat al-Awliyā’ 10\/201<\/a><\/p><\/blockquote>\n<p>That is, if one truly understands why their lower-self is their enemy, they have come to realize what their Lord expects of them and their need to cultivate their higher-self.<\/p>\n<p>It is common for Imams to begin sermons by seeking refuge in Allah from the evil of our own selves. The Prophet (ṣ) himself did so and taught his companions to do likewise.<\/p>\n<p>‘Imran ibn Husayn reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَلْهِمْنِي رُشْدِي وَأَعِذْنِي مِنْ شَرِّ نَفْسِي<\/p>\n<p><strong>O Allah, inspire me with guidance and protect me from the evil of my ego.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3483, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/03\/how-many-gods-worship-now\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>In this supplication, the Prophet (ṣ) is asking for Allah to inspire him with the spirit and in opposition to his lower-self. This demonstrates our need to follow the influence of the spirit in order to purify our hearts and protect us from the harmful whims of the ego.<\/p>\n<p>The fourth term “mind” likewise has various shades of meaning that overlap with the other terms. It is generally distinguished from the other terms as the intellectual capacity of human beings to reason, think, know, contemplate, reflect, and understand.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والعقل قد يطلق ويراد به صفة العالم وقد يطلق ويراد به محل الإدراك<\/p>\n<p>The ‘mind’ is applied to mean the quality of knowing and it is applied to mean the seat of consciousness.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/4<\/p><\/blockquote>\n<p>The mind is very important because it is the receptacle of conscious thought, where reflection takes place and ideas are contemplated and understood. It is considered to be one of the pillars of being human.<\/p>\n<p>Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَصْلُ الرَّجُلِ عَقْلُهُ وَحَسَبُهُ دِينُهُ وَمُرُوءَتُهُ خُلُقُهُ<\/p>\n<p>The foundation of a man is his mind, his honor is in his religion, and his manhood is in his character.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/06\/20\/umar-aql-deen-akhlaq\/\">Adab al-Dunyā wal-Dīn 1\/17<\/a><\/p><\/blockquote>\n<p>The mind influences the heart by the conscious thoughts we choose to entertain. We are not responsible and do not have control over automatic or involuntary thoughts, which arise from the lower-self or the whispering of Satan. Rather, we are responsible and have control over the thoughts we deliberately engage. Gaining mastery over our conscious thoughts and changing negative thought-patterns is a psychological skill called <em>cognitive restructuring<\/em>, which can be cultivated through <a href=\"https:\/\/abuaminaelias.com\/how-to-achieve-mindfulness-in-islam\/\">mindfulness practice<\/a>.<\/p>\n<p>Many scholars consider the foundation of spiritual wayfaring (<em>suluk<\/em>) to be mindfulness over one&#8217;s own thoughts, as Ibn al-Qayyim mentioned:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا كَثِيرٌ مِنْ أَرْبَابِ السُّلُوكِ بَنَوْا سُلُوكَهُمْ عَلَى حِفْظِ الْخَوَاطِرِ وَأَنْ لَا يُمَكِّنُوا خَاطِرًا يَدْخُلُ قُلُوبَهُمْ حَتَّى تَصِيرَ الْقُلُوبُ فَارِغَةً قَابِلَةً لِلْكَشْفِ وَظُهُورِ حَقَائِقِ الْعُلْوِيَّاتِ فِيهَا<\/p>\n<p>Many of the masters of spiritual wayfaring based their journeying upon guarding their thoughts, that they would not enable a thought to enter their hearts until the hearts were ready and accepting for unveiling and the presence of higher realities within it.<\/p>\n<p>Source: al-Dā&#8217; wal-Dawā&#8217; 1\/158<\/p><\/blockquote>\n<p>All evil deeds are preceded by evil thoughts, and all harmful thoughts can cause physical and emotional distress, such as depression and anxiety. Good thoughts come from the higher-self, and bad thoughts comes from the lower-self or Satan. These thoughts can have a profound effect on the feelings we experience and the actions we undertake, so one must learn the mindfulness skill of shutting down bad trains of thought as they arise.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ الْخَطْرَةَ تَنْقَلِبُ وَسْوَسَةً وَالْوَسْوَسَةُ تَصِيرُ إِرَادَةً وَالْإِرَادَةُ تَقْوَى فَتَصِيرُ عَزِيمَةً ثُمَّ تَصِيرُ فِعْلًا ثُمَّ تَصِيرُ صِفَةً لَازِمَةً وَهَيْئَةً ثَابِتَةً رَاسِخَةً وَحِينَئِذٍ يَتَعَذَّرُ الْخُرُوجُ مِنْهُمَا كَمَا يَتَعَذَّرُ الْخُرُوجُ مِنْ صِفَاتِهِ الْقَائِمَةِ بِهِ<\/p>\n<p>For a thought turns into a suggestion, and a suggestion becomes an intention, and an intention strengthens until it becomes a determination, then it becomes an action, then it becomes a necessary description, a form established and grounded. In that case, it becomes impossible to expel them just as it is impossible to expel an enduring characteristic.<\/p>\n<p>Source: al-Dā&#8217; wal-Dawā&#8217; 1\/158<\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فى ذكر طريق يوصل إلى الاستقامة فى الأحوال والأقوال والأعمال وهى شيئان أحدهما حراسة الخواطر وحفظها والحذر من إهمالها والاسترسال معها فإن أصل الفساد كله من قبلها يجيء لأنها هى بذر الشيطان والنفس فى أَرض القلب<\/p>\n<p>In mentioning the path to integrity (<em>istiqamah<\/em>) in one’s states, words, and deeds, there are two matters. The first is to guard one’s thoughts and protect them, to beware of neglecting them and indulging with them. Indeed, it is the origin of every evil before it comes to be, as they are the seed of Satan and the lower-self in the soil of the heart.<\/p>\n<p>Source: Ṭarīq al-Hijratayn 1\/175<\/p><\/blockquote>\n<p>One cannot be truly mindful of Allah until they are mindful of the types of thoughts they choose to engage. Learning to be mindful of our thoughts is vital for us to be protected by Allah in our physical, mental, and spiritual health.<\/p>\n<p>Al-Qushayri writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ بَعْضهم من راقب اللَّه تَعَالَى فِي خواطره عصمه اللَّه تَعَالَى فِي جوارحه<\/p>\n<p>Some of the predecessors said: Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/330<\/p><\/blockquote>\n<p>To recap, the human psyche is composed of the heart, spirit, self or ego, and mind. The heart is the core-being and the most important of these parts. The spirit is the higher-self that influences the heart to be righteous, reflect divine qualities, and do good deeds. The ego is the lower-self that is the receptacle of basic instincts and has a tendency to follow its whims. The mind is the rational faculty and receptacle of thought, contemplation, and understanding.<\/p>\n<p>The believer’s most important goal in this life is to purify the heart by tapping into the influence of the spirit, in opposition to the influence of the lower-self, which is the weapon of Satan and an enemy to the human being. The mind plays a significant role in this struggle, as it contains thoughts from both the higher-self and lower-self. Through mindfulness skills and Islamic knowledge, one must learn to identify and cultivate good thoughts from the spirit, while ignoring and disengaging evil thoughts from the lower-self and Satan.<\/p>\n<p>This esoteric science is confusing to many people, even scholars of Islam, because the four terms – heart, spirit, self, mind – are used in everyday speech to refer to the composite whole: the human psyche or inner-self. In this sense, they are all synonymous terms for the same thing, but for the purpose of spiritual development, understanding the subtle distinctions between them is crucial to our success.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فهذه أربعة معان يطلق عليها الألفاظ الأربعة ومعنى خامس وهي اللطيفة العالمة المدركة من الإنسان والألفاظ الأربعة بجملتها تتوارد عليها &#8230; وأكثر العلماء قد التبس عليهم اختلاف هذه الألفاظ وتواردها فتراهم يتكلمون في الخواطر ويقولون هذا خاطر العقل وهذا خاطر الروح وهذا خاطر القلب وهذا خاطر النفس وليس يدري الناظر اختلاف معاني هذه الأسماء<\/p>\n<p>These four meanings are applied to the four words, and a fifth meaning is the subtle, knowing, conscious substance of the human being and all four words correspond to it as a whole&#8230; Most of the scholars obscure them, disagreeing over these words and what they correspond with. So you will see them speaking about thoughts and saying, ‘This is a thought of the mind. This is a thought of the spirit. This is a thought of the heart. This is a thought of the self,’ and the bystander does not know the different meanings of these terms.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/4-5<\/p><\/blockquote>\n<p>Muslims are in serious need of clarity through these terms in regards to the nature of the human soul and the means of purification as laid down by the Prophets and the righteous predecessors. The only people who succeed in the Hereafter are the believers who come to Allah with pure hearts, achieved by filling the mind with thoughts from the spirit and disengaging whimsical thoughts from the lower-self. We have already lost the battle to Satan if we do not even know that such purification is required or we do not implement the practical methods by which such purification can be actualized.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever knows himself, knows his Lord.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[183,288,322,32,34,48,100,54,470,56,84,148,91,68,472,471],"class_list":["post-21680","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-day-of-resurrection-yawm-al-qiyammah","tag-desires-shahawat","tag-gratitude-al-shukr","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-justice-adl","tag-manners-al-adab","tag-mercy-al-rahmah","tag-mindfulness-muraqabah","tag-monotheism-tawheed","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-reason-al-aql","tag-righteous-predecessors-al-salaf-al-salih","tag-satan-al-shaytan","tag-spirituality-al-tasawwuf","tag-whims-al-hawa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5DG","jetpack-related-posts":[{"id":16260,"url":"https:\/\/www.abuaminaelias.com\/jihad-against-the-soul-in-islam\/","url_meta":{"origin":21680,"position":0},"title":"Jihad against the soul in Islam","author":"Abu Amina Elias","date":"January 27, 2015","format":false,"excerpt":"\"He has succeeded who purifies the soul,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18161,"url":"https:\/\/www.abuaminaelias.com\/follow-your-conscience-in-islam\/","url_meta":{"origin":21680,"position":1},"title":"Follow your conscience in Islam","author":"Abu Amina Elias","date":"May 2, 2016","format":false,"excerpt":"\"Leave what makes you doubt for what does not make you doubt.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17033,"url":"https:\/\/www.abuaminaelias.com\/all-human-life-sacred-in-islam\/","url_meta":{"origin":21680,"position":2},"title":"All human life is sacred in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill the soul which Allah has made sacred...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21729,"url":"https:\/\/www.abuaminaelias.com\/understanding-sufism-in-islam\/","url_meta":{"origin":21680,"position":3},"title":"Understanding Sufism in Islam","author":"Abu Amina Elias","date":"February 25, 2020","format":false,"excerpt":"\"Sufism is to be mindful of one’s inner-states and adhere to good manners.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21642,"url":"https:\/\/www.abuaminaelias.com\/how-to-achieve-mindfulness-in-islam\/","url_meta":{"origin":21680,"position":4},"title":"How to achieve mindfulness in Islam","author":"Abu Amina Elias","date":"February 2, 2020","format":false,"excerpt":"\"Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13893,"url":"https:\/\/www.abuaminaelias.com\/the-ruling-on-abortion-in-islam\/","url_meta":{"origin":21680,"position":5},"title":"What does Islam teach about abortion?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill your children for fear of poverty...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21680","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21680"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21680\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21680"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21680"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21680"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}