{"id":21729,"date":"2020-02-25T15:47:28","date_gmt":"2020-02-25T11:47:28","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21729"},"modified":"2021-11-10T10:39:23","modified_gmt":"2021-11-10T06:39:23","slug":"understanding-sufism-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/understanding-sufism-in-islam\/","title":{"rendered":"Understanding Sufism in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Sufism (<em>tasawwuf<\/em>) is a confusing subject for many Muslims, as the term is defined and applied differently by various schools of thought. This confusion obscures an important branch of knowledge in Islam, namely, the science of purifying the heart. Muslims need clarity on this topic in order to sift the authentic Islamic Sufism from the specious claims of pretenders.<\/p>\n<p>The generation immediately following the righteous predecessors began using the term ‘Sufism’ to refer to groups of Muslims who devoted themselves to ascetic piety and psychological knowledge of spiritual realities. This term, like other terms of Islamic sciences (<em>fiqh<\/em>, <em>tafsir<\/em>, <em>‘aqidah<\/em>, etc.), was not established in the time of the Prophet (ṣ) but became necessary later to distinguish this branch of knowledge and protect it from heretical innovations.<\/p>\n<p>Al-Qushayri writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعلموا رحمكم اللَّه تَعَالَى أَن الْمُسْلِمِينَ بَعْد رَسُول اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يتسم أفاضلهم فِي عصرهم بتسمية علم سِوَى صحبة رَسُول اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إذ لا فضيلة فوقها فقيل لَهُمْ الصَّحَابَة ولما أدركهم أهل العصر الثَّانِي سمى من صحب الصَّحَابَة التابعين ورأوا ذَلِكَ أشرف سمة ثُمَّ قيل لمن بعدهم أتباع التابعين ثُمَّ أختلف النَّاس وتباينت المراتب فقيل لخواص النَّاس مِمَّن لَهُمْ شدة عناية بأمر الدين الزهاد والعباد ثُمَّ ظهرت البدع وحصل التداعي بَيْنَ الفرق فَكُل فريق أدعوا أَن فيهم زهدا فانفرد خواص أهل السنة المراعون أنفاسهم مَعَ اللَّه تعالي الحافظون قلوبهم عَن طوارق الغفلة باسم التصوف واشتهر هَذَا الاسم لهؤلاء الأكابر قبل المائتين من الهجرة<\/p>\n<p>Know, may Allah Almighty have mercy on you, that the Muslims after the Messenger of Allah, peace and blessings be upon him, the best of them in their time were not given a special name by which they were known other than ‘the companions’ (<em>sahabah<\/em>) of the Messenger of Allah, as there was no one better than them. They were simply called the companions. Those who accompanied the companions in the second generation were called ‘the followers’ (<em>tabi’in<\/em>) and they viewed this as the most noble of titles. Those after them were called ‘the followers of the followers’ (<em>tabi’ tabi’in<\/em>). Then, people differed and varied in position. The elite of the people, who had an intense concern for religious matters, were called ‘ascetics’ and ‘worshipers.’ Then, innovations appeared, resulting in contention between the parties. Each party claimed the ascetics belonged to them. So the elite among the people of Sunnah, who held their every breath accountable to Allah Almighty and guarded their hearts from the calamities of mindlessness, were distinguished by the name ‘Sufism.’ This name became well-known to these great ones before the end of the second Hijri century.<\/p>\n<p>Source: al-Risālat al-Qushayrīyah 1\/34<\/p><\/blockquote>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَّا لَفْظُ الصُّوفِيَّةِ فَإِنَّهُ لَمْ يَكُنْ مَشْهُورًا فِي الْقُرُونِ الثَّلَاثَةِ وَإِنَّمَا اُشْتُهِرَ التَّكَلُّمُ بِهِ بَعْدَ ذَلِكَ وَقَدْ نُقِلَ التَّكَلُّمُ بِهِ عَنْ غَيْرِ وَاحِدٍ مِنْ الْأَئِمَّةِ وَالشُّيُوخِ كَالْإِمَامِ أَحْمَد بْنِ حَنْبَلٍ وَأَبِي سُلَيْمَانَ الداراني وَغَيْرِهِمَا وَقَدْ رُوِيَ عَنْ سُفْيَانَ الثَّوْرِيِّ أَنَّهُ تَكَلَّمَ بِهِ وَبَعْضُهُمْ يَذْكُرُ ذَلِكَ عَنْ الْحَسَنِ الْبَصْرِيِّ<\/p>\n<p>As for the term ‘Sufism’ (<em>sufiyyah<\/em>), it was not well-known in the first three generations and it only became prevalent in the discourse after that. It has been transmitted in the discourse of more than one of the Imams and Shaykhs, such as Imam Ahmad ibn Hanbal, Abu Sulayman al-Darani, and others. It has been narrated from Sufyan al-Thawri that he used it in his discourse and that was also mentioned from Al-Hasan al-Basri.<\/p>\n<p>Source: <span style=\"color: #000000;\">Majmū&#8217; al-Fatāwá <\/span>11\/5<\/p><\/blockquote>\n<p>And Ibn Khaldun writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هذا العلم يعنى التصوّف من العلوم الشّرعيّة الحادثة في الملّة وأصله أنّ طريقة هؤلاء القوم لم تزل عند سلف الأمّة وكبارها من الصّحابة والتّابعين ومن بعدهم طريقة الحقّ والهداية وأصلها العكوف على العبادة والانقطاع إلى الله تعالى والإعراض عن زخرف الدّنيا وزينتها والزّهد فيما يقبل عليه الجمهور من لذّة ومال وجاه والانفراد عن الخلق في الخلوة للعبادة وكان ذلك عامّا في الصّحابة والسّلف<\/p>\n<p>This knowledge of Sufism is among the sciences of the revealed law in the religion. Its origins that the way of these people continued with the righteous predecessors of the Ummah and the great ones among the companions, the followers, and those after them. It is the path of truth and guidance, founded upon commitment to worship and dedication to Allah Almighty, turning away from the splendor of the world and its temptations, abstaining from the pleasure, property, and status sought by the masses, and practicing isolation from the creation in seclusion for worship. That was generally practiced among the companions and righteous predecessors.<\/p>\n<p>Source: Tārīkh Ibn Khaldūn 1\/611<\/p><\/blockquote>\n<p>Al-Qushayri’s epistle, <em>Risalat al-Qushayriyyah<\/em>, documents the science of Sufism that developed in those early generations. It is unclear how the term Sufism originated. Some theorize that it was derived from the root word for purity (<em>safa<\/em>), others say it was derived from the word for wool (<em>sawf<\/em>) to express their ascetic lifestyle, and others say it is related to the companions of the bench (<em>ashab al-suffa<\/em>) beside the Prophet’s mosque (ṣ).<\/p>\n<p>Al-Qushayri records several definitions of Sufism given by the original Sufis, many of which are esoteric and mystical. They would often define Sufism, sometimes vaguely, with a particular characteristic that most stuck out to them. Perhaps the best and most concise definitions were given by Abu Muhammad al-Jurayr, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التصوف الدخول فِي كُل خلق سنى والخروج من كُل خلق دنى<\/p>\n<p>Sufism is to acquire every sublime character trait and to expel every lowly character trait.<\/p>\n<p>Source:  Risalat 2\/441<\/p><\/blockquote>\n<p>And Al-Jurayri said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التصوف مراقبة الأحوال ولزوم الأدب<\/p>\n<p>Sufism is to be mindful of one’s inner-states and adhere to good manners.<\/p>\n<p>Source: Risalat 2\/443<\/p><\/blockquote>\n<p>Sufism, as a technical Islamic science, is spiritual self-development through the knowledge of stations (<em>maqamat<\/em>) and states (<em>ahwal<\/em>). A station is a form of righteous behavior that a Muslim actualizes by striving in worship, such as repentance (<em>tawbah<\/em>), consciousness of Allah (<em>taqwa<\/em>), trust in Allah (<em>tawakkul<\/em>), gratitude to Allah (<em>shukr<\/em>), and mindfulness of Allah (<em>muraqabah<\/em>). A state is how a Muslim temporarily feels in the present moment, such as hope, fear, joy, and sorrow. It is said that the states are like flashes (<em>lawa&#8217;ih<\/em>) and surprises (<em>bawadih<\/em>).<\/p>\n<p>The original Sufis, through this knowledge, documented the methods by which a Muslim could purify his or her heart from spiritual diseases like envy, malice, and arrogance. As such, Sufism is the collective synthesis of theology, psychology, and ethics. It has also been called the science of purifying the soul (<em>tazkiyyat al-nafs<\/em>), noble morals (<em>makarim al-akhlaq<\/em>), and spiritual wayfaring (<em>‘ilm al-suluk<\/em>). This knowledge is at the heart of the entire religion.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِسْبَالُ الْخُلُقِ عَلَى الْخَلْقِ بَسْطًا وَهَذَا حَقِيقَةُ التَّصَوُّفِ فَإِنَّهُ كَمَا قَالَ أَبُو بَكْرٍ الْكَتَّانِيُّ التَّصَوُّفُ خُلُقٌ فَمَنْ زَادَ عَلَيْكَ فِي الْخُلُقِ زَادَ عَلَيْكَ فِي التَّصَوُّفِ فَإِنَّ حُسْنَ الْخُلُقِ وَتَزْكِيَةَ النَّفْسِ بِمَكَارِمِ الْأَخْلَاقِ يَدُلُّ عَلَى سَعَةِ قَلْبِ صَاحِبِهِ وَكَرَمِ نَفْسِهِ وَسَجِيَّتِهِ<\/p>\n<p>Conferring ethics upon the creation by means of inspiring hope, this is the reality of Sufism. It is as was said by Abu Bakr al-Kattani: Sufism is good character, so whoever surpasses you in good character has surpassed you in Sufism. Indeed, good character and purification of the soul by noble character traits indicates the effort put in by the heart of a person, the magnanimity of his soul and his disposition.<\/p>\n<p>Source: Madārij al-Sālikīn 1\/462<\/p><\/blockquote>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهَذِهِ كَلِمَاتٌ مُخْتَصَرَاتٌ فِي أَعْمَالِ الْقُلُوبِ الَّتِي قَدْ تُسَمَّى الْمَقَامَاتِ وَالْأَحْوَالَ وَهِيَ مِنْ أُصُولِ الْإِيمَانِ وَقَوَاعِدِ الدِّينِ<\/p>\n<p>These abridged terms are in regards to the deeds of the heart, which are known as ‘stations and states.’ They are among the foundations of faith and principles of the religion.<\/p>\n<p>Source: <span style=\"color: #000000;\">Majmū&#8217; al-Fatāwá <\/span>10\/5<\/p><\/blockquote>\n<p>And Shaykh Siddiq Hasan Khan writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">علم السلوك هو معرفة النفس ما لها وما عليها من الوجدانيات ويسمى بعلم الأخلاق وبعلم التصوف أيضا<\/p>\n<p>The science of spiritual wayfaring is to know the soul, the psychological states it has and that act against it. It is also known as the science of ethics and the science of Sufism.<\/p>\n<p>Source: Abjad al-‘Ulūm 1\/419<\/p><\/blockquote>\n<p>Classic literature in the genre includes Al-Qushayri&#8217;s epistle, Al-Ghazali&#8217;s magnum opus <em>Ihya&#8217; &#8216;Ulum al-Din<\/em>, Abu Talib al-Makki&#8217;s <em>Qut al-Qulub<\/em>, Al-Harawi&#8217;s <em>Manazil al-Sa&#8217;irin<\/em> and its commentary <em>Madarij al-Salikin<\/em> by Ibn al-Qayyim.<\/p>\n<p>Sufism, as a term, is used for matters that can be either consistent or contradictory to Islam. Not all Sufis and Sufism are bad and against Islam, but neither are they always good. We should not wholesale condemn Sufis and Sufism, yet also not praise every uncritical use of the term.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَطَائِفَةٌ ذَمَّتْ الصُّوفِيَّةَ وَالتَّصَوُّفَ وَقَالُوا إنَّهُمْ مُبْتَدِعُونَ خَارِجُونَ عَنْ السُّنَّةِ وَنُقِلَ عَنْ طَائِفَةٍ مِنْ الْأَئِمَّةِ فِي ذَلِكَ مِنْ الْكَلَامِ مَا هُوَ مَعْرُوفٌ وَتَبِعَهُمْ عَلَى ذَلِكَ طَوَائِفُ مِنْ أَهْلِ الْفِقْهِ وَالْكَلَامِ وَطَائِفَةٌ غَلَتْ فِيهِمْ وَادَّعَوْا أَنَّهُمْ أَفْضَلُ الْخَلْقِ وَأَكْمَلُهُمْ بَعْدَ الْأَنْبِيَاءِ وَكِلَا طَرَفَيْ هَذِهِ الْأُمُورِ ذَمِيمٌ<\/p>\n<p style=\"text-align: right;\">وَالصَّوَابُ أَنَّهُمْ مُجْتَهِدُونَ فِي طَاعَةِ اللَّهِ كَمَا اجْتَهَدَ غَيْرُهُمْ مِنْ أَهْلِ طَاعَةِ اللَّهِ فَفِيهِمْ السَّابِقُ الْمُقَرَّبُ بِحَسَبِ اجْتِهَادِهِ وَفِيهِمْ الْمُقْتَصِدُ الَّذِي هُوَ مِنْ أَهْلِ الْيَمِينِ وَفِي كُلٍّ مِنْ الصِّنْفَيْنِ مَنْ قَدْ يَجْتَهِدُ فَيُخْطِئُ وَفِيهِمْ مَنْ يُذْنِبُ فَيَتُوبُ أَوْ لَا يَتُوبُ وَمِنْ الْمُنْتَسِبِينَ إلَيْهِمْ مَنْ هُوَ ظَالِمٌ لِنَفْسِهِ عَاصٍ لِرَبِّهِ وَقَدْ انْتَسَبَ إلَيْهِمْ طَوَائِفُ مِنْ أَهْلِ الْبِدَعِ وَالزَّنْدَقَةِ وَلَكِنْ عِنْدَ الْمُحَقِّقِينَ مِنْ أَهْلِ التَّصَوُّفِ لَيْسُوا مِنْهُمْ<\/p>\n<p>A group of scholars censured Sufis and Sufism, and they said they are innovators who abandon the Sunnah. It is known to have been transmitted from a group of Imams of theology in that regard, and groups of jurists and theologians followed them in that. A group exaggerated regarding them and claimed they were the best of creation and the most perfect after the Prophets. Both have been extreme and blameworthy in these matters.<\/p>\n<p>The correct opinion is that the Sufis are those who strive to obey Allah just as others strive to be people who obey Allah. Among them are the foremost and nearest to Allah by the measure of their efforts. Among them are those who take a middle path among the people of the right hand. In each of these categories they strive and they err. Among them are those who commit sins and then repent, or do not repent. Among those attributed to them are those who wrong themselves by disobeying their Lord. Attributed to them are groups of innovators and heretics but, according to the truthful verifiers, the (true) people of Sufism are not among them.<\/p>\n<p>Source: <span style=\"color: #000000;\">Majmū&#8217; al-Fatāwá <\/span>11\/17<\/p><\/blockquote>\n<p>In our times, the term ‘Sufism’ has been so widely misapplied that it may no longer be helpful to use it. Many Sufi orders or fraternities have developed their own unique set of beliefs and practices, some of which are questionable, and these self-proclaimed Sufis often exaggerate the status of their Shaykhs. However, the original science of Sufism is essential to Islam and must be preserved, whether we call it Sufism or use another term.<\/p>\n<p>True Sufis can be distinguished from pretend Sufis through their adherence to the outward revealed law and creed. The outward form is a reflection of the inward essence, so any believing Muslim must always adhere to the outward law regardless of their inward purity.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَأَمَّا الْمُسْتَقِيمُونَ مِنْ السَّالِكِينَ كَجُمْهُورِ مَشَايِخِ السَّلَفِ مِثْلِ الْفُضَيْل بْنِ عِيَاضِ وَإِبْرَاهِيمَ بْنِ أَدْهَمَ وَأَبِي سُلَيْمَانَ الداراني وَمَعْرُوفٍ الْكَرْخِي وَالسَّرِيِّ السقطي والْجُنَيْد بْنِ مُحَمَّدٍ وَغَيْرِهِمْ مِنْ الْمُتَقَدِّمِينَ وَمِثْلِ الشَّيْخِ عَبْدِ الْقَادِرِ وَالشَّيْخِ حَمَّادٍ وَالشَّيْخِ أَبِي الْبَيَانِ وَغَيْرِهِمْ مِنْ الْمُتَأَخِّرِينَ فَهُمْ لَا يُسَوِّغُونَ لِلسَّالِكِ وَلَوْ طَارَ فِي الْهَوَاءِ أَوْ مَشَى عَلَى الْمَاءِ أَنْ يَخْرُجَ عَنْ الْأَمْرِ وَالنَّهْيِ الشَّرْعِيَّيْنِ بَلْ عَلَيْهِ أَنْ يَفْعَلَ الْمَأْمُورَ وَيَدَعَ الْمَحْظُورَ إلَى أَنْ يَمُوتَ وَهَذَا هُوَ الْحَقُّ الَّذِي دَلَّ عَلَيْهِ الْكِتَابُ وَالسُّنَّةُ وَإِجْمَاعُ السَّلَفِ<\/p>\n<p>As for the upright among the spiritual wayfarers, such as the majority of Shaykhs among the righteous predecessors, they are the likes of Al-Fudayl ibn ‘Iyad, Ibrahim ibn Adham, Abu Sulayman al-Darani, Ma’ruf al-Karkhi, Al-Sarri al-Saqati, Al-Junayd ibn Muhamad, and others from the earliest generations. And they are the likes of Shaykh Abdul Qadir, Shaykh Hammad Abu al-Bayan, and others from the later generations. They would never justify for a wayfarer, even if he were to fly through the air or walk on water, to abandon the commands and prohibitions of the revealed law. Rather, it is duty upon him to do what has been commanded and leave what is forbidden until he dies. This is the truth which is indicated by the Book, the Sunnah, and the consensus of the righteous predecessors.<\/p>\n<p>Source: <span style=\"color: #000000;\">Majmū&#8217; al-Fatāwá <\/span>10\/516<\/p><\/blockquote>\n<p>Hence, adherence to the outward law and creed is an indication of sincerity. This is the standard by which Sufis should be judged, even if they can perform apparent miracles and great magical feats.<\/p>\n<p>The path of Sufism or spiritual wayfaring can also be followed in degrees. Some Muslims are satisfied to meet their obligations and do some recommendations, both inwardly and outwardly, while others strive to do every obligation and recommendation to the best of their ability.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالسُّلُوكُ سُلُوكَانِ سُلُوكُ الْأَبْرَارِ أَهْلِ الْيَمِينِ وَهُوَ أَدَاءُ الْوَاجِبَاتِ وَتَرْكُ الْمُحَرَّمَاتِ بَاطِنًا وَظَاهِرًا وَالثَّانِي سُلُوكُ الْمُقَرَّبِينَ السَّابِقِينَ وَهُوَ فِعْلُ الْوَاجِبِ وَالْمُسْتَحَبِّ بِحَسَبِ الْإِمْكَانِ وَتَرِك الْمَكْرُوهِ وَالْمُحَرَّمِ<\/p>\n<p>Wayfaring is of two types. The wayfaring of the righteous, the people of the right hand, is to fulfill the obligations and abandon the forbidden matters, inwardly and outwardly. The second is the wayfaring of the foremost and nearest to Allah, which is to do what is obligatory and recommended as much as possible and to abandon discouraged and forbidden matters.<\/p>\n<p>Source: <span style=\"color: #000000;\">Majmū&#8217; al-Fatāwá <\/span>10\/463<\/p><\/blockquote>\n<p>As Muslim believers, it is sufficient for us to meet our obligations and do some recommendations. This is praiseworthy and not blameworthy in the least. However, we only have one chance in this life to reach the highest level of Paradise (<em>Jannat al-Firdaws<\/em>). Through the knowledge of original Sufism, we have the opportunity to reach higher levels of consciousness and mindfulness of Allah, such that our hearts will be in the purest state possible when we meet Him.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Sufism is to be mindful of one’s inner-states and adhere to good manners.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[16,441,165,342,27,322,352,100,470,134,84,365,65,67,91],"class_list":["post-21729","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-character-akhlaq","tag-companions-al-sahabah","tag-consensus-al-ijma","tag-al-fiqh","tag-god-fearing-taqwa","tag-gratitude-al-shukr","tag-hope-al-raja","tag-manners-al-adab","tag-mindfulness-muraqabah","tag-paradise-jannah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-recommendation-al-mustahab","tag-reliance-tawakkul","tag-repentance-al-tawbah","tag-righteous-predecessors-al-salaf-al-salih"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Et","jetpack-related-posts":[{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":21729,"position":0},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16602,"url":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","url_meta":{"origin":21729,"position":1},"title":"Worship in the middle night of Sha’ban","author":"Abu Amina Elias","date":"April 23, 2015","format":false,"excerpt":"\"There is a proof for it, so it cannot be rejected.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17977,"url":"https:\/\/www.abuaminaelias.com\/good-character-before-islamic-sciences\/","url_meta":{"origin":21729,"position":2},"title":"Good character before learning Islamic sciences","author":"Abu Amina Elias","date":"April 5, 2016","format":false,"excerpt":"\"What I learned from Malik's manners was better than his knowledge.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16284,"url":"https:\/\/www.abuaminaelias.com\/separation-mosque-and-state\/","url_meta":{"origin":21729,"position":3},"title":"Separation of Mosque and State in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Religious values should have a positive influence on the government,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":21729,"position":4},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16910,"url":"https:\/\/www.abuaminaelias.com\/helping-refugees-and-emigrants-in-islam\/","url_meta":{"origin":21729,"position":5},"title":"Helping refugees and emigrants in Islam","author":"Abu Amina Elias","date":"August 26, 2015","format":false,"excerpt":"\"Whoever helps ease someone in difficulty, Allah will make it easy for him in this world and in the Hereafter.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21729","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21729"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21729\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21729"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21729"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21729"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}