{"id":21839,"date":"2020-04-30T11:31:27","date_gmt":"2020-04-30T07:31:27","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=21839"},"modified":"2025-03-19T11:21:11","modified_gmt":"2025-03-19T07:21:11","slug":"al-mundhiri-on-virtues-of-fasting","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-virtues-of-fasting\/","title":{"rendered":"Imam al-Mundhiri on Virtues of Fasting"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في الصوم مطلقاً وما جاء في فضله<\/p>\n<p>Encouragement to perform fasting and what has been related of its virtues.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 2\/79<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلاَّ الصِّيَامَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ‏ وَالصِّيَامُ جُنَّةٌ وَإِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلاَ يَرْفُثْ وَلاَ يَصْخَبْ فَإِنْ سَابَّهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا إِذَا أَفْطَرَ فَرِحَ وَإِذَا لَقِيَ رَبَّهُ فَرِحَ بِصَوْمِهِ<\/p>\n<p style=\"text-align: left;\"><strong>Allah Almighty said, ‘Every deed of the son of Adam is for him, except for fasting. It is for Me and I will reward it.’ Fasting is a shield, so when one of you fasts, he may not be obscene or boisterous. If someone insults him or fights him, let him say: Indeed, I am fasting. By the One in whose hand is the soul of Muhammad, the breath coming from the mouth of a fasting person is more pleasant to Allah than the scent of musk. The fasting person has two moments of relief he enjoys: when he breaks his fast he is joyful, and when he meets his Lord he is joyful for his fasting.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1904, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/07\/many-virtues-fasting-shield-musk\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">‏قال اللَّهُ عَزَّ وَجَلَّ يَتْرُكُ طَعَامَهُ وَشَرَابَهُ وَشَهْوَتَهُ مِنْ أَجْلِي الصِّيَامُ لِي وَأَنَا أَجْزِي بِهِ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا<\/p>\n<p><strong>Allah Almighty said, ‘He abandons his food, drink, and desires for My sake. Fasting is for Me and I will reward it, a single good deed up to ten times the like of it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1894, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p style=\"text-align: left;\">And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ الْحَسَنَةُ عَشْرُ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ قَالَ اللَّهُ عَزَّ وَجَلَّ إِلاَّ الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِنْ أَجْلِي<\/p>\n<p><strong>Every deed of the son of Adam is multiplied, a single deed as ten times the like of it up to seven hundred times. Allah Almighty said, ‘Except for fasting, as it is for Me and I will reward it. He leaves his desires and his food for My sake.’<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1151, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p><span style=\"font-size: 15px;\">Sahl ibn Sa’d reported: The Prophet, peace and blessings be upon him, said:<\/span><\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي الْجَنَّةِ بَابًا يُقَالُ لَهُ الرَّيَّانُ يَدْخُلُ مِنْهُ الصَّائِمُونَ يَوْمَ الْقِيَامَةِ لَا يَدْخُلُ مِنْهُ أَحَدٌ غَيْرُهُمْ يُقَالُ أَيْنَ الصَّائِمُونَ فَيَقُومُونَ لَا يَدْخُلُ مِنْهُ أَحَدٌ غَيْرُهُمْ فَإِذَا دَخَلُوا أُغْلِقَ فَلَمْ يَدْخُلْ مِنْهُ أَحَدٌ<\/p>\n<p><strong>Verily, there is a gate in Paradise called al-Rayyan, through which only those who fasted will enter on the Day of Resurrection. No one else will enter it along with them. It will be said: Where are those who fasted? They will stand and no one will enter it along with them. When they enter it, it will be closed and no one else will go through it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1896, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/02\/gate-paradise-fasting\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Jabir reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الصِّيَامُ جُنَّةٌ يَسْتَجِنُّ بِهَا الْعَبْدُ مِنَ النَّارِ<\/p>\n<p><strong>Verily, fasting is only a shield by which the servant seeks protection from the Hellfire.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 15264, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/fasting-shield-from-al-nar\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصِّيَامُ جُنَّةٌ وَهُوَ حِصْنٌ مِنْ حُصُونِ الْمُؤْمِنِ وَكُلُّ عَمَلٍ لِصَاحِبِهِ ويقول الله وَالصِّيَامُ لِي وَأَنَا أَجْزِي بِهِ<\/p>\n<p><strong>Fasting is a shield and a fortress among the fortresses of the believer. Every deed is for its companion, but Allah says: Except fasting, as it is for me and I will reward it.<\/strong><\/p>\n<p>Source: Musnad al-Shāmīyīn 3381, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/06\/25\/fasting-fortress-shield-believers\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Uthman ibn Abi al-‘As reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصِّيَامُ جُنَّةٌ مِنْ النَّارِ كَجُنَّةِ أَحَدِكُمْ مِنْ الْقِتَالِ<\/p>\n<p><strong>Fasting is a shield from the Hellfire, just like a shield of yours in battle.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 1639, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/08\/fasting-shield-battle\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ الصَّوْمُ جُنَّةٌ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ وَصَلَاةُ الرَّجُلِ مِنْ جَوْفِ اللَّيْلِ<\/p>\n<p><strong>Shall I not tell you about the gates of goodness? Fasting is a shield, charity extinguishes sins as water extinguishes fire, and the prayer of a man in the late night.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2616, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/20\/islam-pillar-prayer-summit-jihad\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصِّيَامُ وَالْقُرْآنُ يَشْفَعَانِ لِلْعَبْدِ يَوْمَ الْقِيَامَةِ يَقُولُ الصِّيَامُ أَيْ رَبِّ مَنَعْتُهُ الطَّعَامَ وَالشَّهَوَاتِ بِالنَّهَارِ فَشَفِّعْنِي فِيهِ وَيَقُولُ الْقُرْآنُ مَنَعْتُهُ النَّوْمَ بِاللَّيْلِ فَشَفِّعْنِي فِيهِ قَالَ فَيُشَفَّعَانِ<\/p>\n<p><strong>Fasting and the Quran will intercede for the servant on the Day of Resurrection. Fasting will say: O Lord, I prevented him from food and drink during the day, so let me intercede for him. The Quran will say: O Lord, I prevented him from sleeping during the night, so let me intercede for him. Thus, they will both intercede for him<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 6589, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/24\/sawm-siyam-quran-intercede\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hudhayfah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ حَسَنٌ ابْتِغَاءَ وَجْهِ اللَّهِ خُتِمَ لَهُ بِهَا دَخَلَ الْجَنَّةَ وَمَنْ صَامَ يَوْمًا ابْتِغَاءَ وَجْهِ اللَّهِ خُتِمَ لَهُ بِهَا دَخَلَ الْجَنَّةَ وَمَنْ تَصَدَّقَ بِصَدَقَةٍ ابْتِغَاءَ وَجْهِ اللَّهِ خُتِمَ لَهُ بِهَا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Whoever declares there is no God but Allah seeking the countenance of Allah as his last deed, he will enter Paradise. Whoever fasts a day seeking the countenance of Allah as his last deed, he will enter Paradise. Whoever gives in charity seeking the countenance of Allah as his last deed, he will enter Paradise<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 22813, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/03\/16\/hereafter-last-deeds-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا عَدْلَ لَهُ<\/p>\n<p><strong>You must fast, for there is nothing equal to it<\/strong>.<\/p>\n<p>Source: Sunan al-Nasā’ī 2223, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/06\/20\/nothing-like-fasting\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعَّدَ اللَّهُ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا<\/p>\n<p><strong>Whoever fasts a day in the way of Allah, Allah will move his face away from the Hellfire by a distance of seventy years<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2840, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/24\/muslim-who-fasts-distant-hellfire\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعَّدَ اللَّهُ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا<\/p>\n<p><strong>Whoever fasts a day in the way of Allah Almighty, by that day Allah will deliver his face from the Hellfire a distance of seventy years of travel.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 2244, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/04\/23\/fasting-distances-seventy-autumns\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Amr ibn ‘Abasah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعُدَتْ مِنْهُ النَّارُ مَسِيرَةَ مِائَةِ عَامٍ<\/p>\n<p><strong>Whoever fasts a day in the way of Allah, Allah will distance him from the Hellfire by a distance of one hundred years of travel.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 3249, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/allah-distances-siyam\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ جَعَلَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ خَنْدَقًا كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ<\/p>\n<p><strong>Whoever fasts a day in the way of Allah, Allah will make a trench between him and the Hellfire whose distance is like that between the heavens and the earth.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1624, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/06\/12\/fasting-protection-nar-jahannam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Zayd ibn Khalid reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ فَطَّرَ صَائِمًا كَانَ لَهُ مِثْلُ أَجْرِهِ غَيْرَ أَنَّهُ لَا يَنْقُصُ مِنْ أَجْرِ الصَّائِمِ شَيْئًا<\/p>\n<p><strong>Whoever helps break the fast of a fasting person, he will have the same reward as him without decreasing anything from the reward of the fasting person.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 807, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/23\/breaks-fast-same-reward\/\"><b><i>Sahih<\/i><\/b><\/a><\/p><\/blockquote>\n<p>Umm ‘Umarah bint Ka’b reported: The Prophet, peace and blessings be upon him, entered her home and she served him food. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلِي<\/p>\n<p><strong>Will you eat?<\/strong><\/p><\/blockquote>\n<p>She said, “Indeed, I am fasting.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الصَّائِمَ تُصَلِّي عَلَيْهِ الْمَلَائِكَةُ إِذَا أُكِلَ عِنْدَهُ حَتَّى يَفْرُغُوا<\/p>\n<p><strong>Verily, angels send blessings upon a fasting person when others eat in their presence until they finish.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 785, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/20\/angels-bless-fasting-feed-others\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, came to the home of Sa’d ibn ‘Ubadah, who presented him with bread and olive oil. The Prophet ate them and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْطَرَ عِنْدَكُمْ الصَّائِمُونَ وَأَكَلَ طَعَامَكُمْ الْأَبْرَارُ وَصَلَّتْ عَلَيْكُمْ الْمَلَائِكَةُ<\/p>\n<p><strong>The fasting have broken their fast with you, the righteous have eaten your food, and the angels send blessings upon you.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3854, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/20\/angels-bless-food-break-fast\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Fasting is a shield from the Hellfire, just like a shield of yours in battle.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[183,262,85,135,32,481,100,56,134,306,179],"class_list":["post-21839","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-fasting-al-siyam","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-intercession-al-shafaah","tag-manners-al-adab","tag-monotheism-tawheed","tag-paradise-jannah","tag-ramadan","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Gf","jetpack-related-posts":[{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":21839,"position":0},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21843,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-fasting-in-ramadan\/","url_meta":{"origin":21839,"position":1},"title":"Imam al-Mundhiri on Fasting in Ramadan","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Allah has people He redeems in every day and night of Ramadan.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20283,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-on-voluntary-sunan-fasting\/","url_meta":{"origin":21839,"position":2},"title":"Imam al-Nawawi on Voluntary Sunan Fasting","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"Best fast after Ramadan is the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14045,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-fasting-ramadan\/","url_meta":{"origin":21839,"position":3},"title":"Imam al-Nawawi on Fasting in Ramadan","author":"Abu Amina Elias","date":"July 13, 2013","format":false,"excerpt":"\"O you who have faith, decreed upon you is fasting,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21111,"url":"https:\/\/www.abuaminaelias.com\/fasting-muharram-day-of-ashura\/","url_meta":{"origin":21839,"position":4},"title":"Fasting in Al-Muharram and Day of &#8216;Ashura","author":"Abu Amina Elias","date":"September 7, 2019","format":false,"excerpt":"\"Best fast after Ramadan is in the month of Allah, al-Muharram.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13906,"url":"https:\/\/www.abuaminaelias.com\/the-purpose-of-fasting-in-islam\/","url_meta":{"origin":21839,"position":5},"title":"The purpose of fasting in Islam","author":"Abu Amina Elias","date":"July 4, 2013","format":false,"excerpt":"\"Fasting is a shield from the Hellfire.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21839","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=21839"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/21839\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=21839"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=21839"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=21839"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}