{"id":22548,"date":"2020-07-18T18:44:30","date_gmt":"2020-07-18T14:44:30","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22548"},"modified":"2021-06-07T15:44:56","modified_gmt":"2021-06-07T11:44:56","slug":"tawhid-tawheed-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","title":{"rendered":"Understanding monotheism in Islam"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islamic monotheism is the foundation of Islam upon which all other teachings and practices must be based. The word “monotheism” (<em>tawhid<\/em>) comes from the root <em>wa-ha-da<\/em> from which we derive the word “one” and which is a verbal noun meaning “to make one.” From this perspective, monotheism in Islam is to declare the Creator to be one in respect to His Lordship, His absolute right to be worshiped, and His divine names and attributes, as well as to negate any comparison between Him and His creation. This concept makes Islam unique among all religions of the world, since every other religion devotes some aspects of worship or divinity to created beings.<\/p>\n<p>Muslim scholars have traditionally expressed the requirements of monotheism as three categories:<\/p>\n<ol>\n<li>Oneness of Lordship (<em>tawhid al-rubbubiyyah<\/em>),<\/li>\n<li>Oneness of Godship (<em>tawhid al-uluhiyyah<\/em>),<\/li>\n<li>Oneness of Names and Attributes (<em>tawhid al-asma’ wal-sifat<\/em>).<\/li>\n<\/ol>\n<p>Ibn Abi al-‘Izz comments on the sound creed of Imam al-Tahawi, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالتَّوْحِيدُ أَوَّلُ الْأَمْرِ وَآخِرُهُ أَعْنِي تَوْحِيدَ الْإِلَهِيَّةِ فَإِنَّ التَّوْحِيدَ يَتَضَمَّنُ ثَلَاثَ أَنْوَاعٍ أَحَدُهَا الْكَلَامُ فِي الصِّفَاتِ وَالثَّانِي تَوْحِيدُ الرُّبُوبِيَّةِ وَبَيَانُ أَنَّ اللَّهَ وَحْدَهُ خَالِقُ كُلِّ شَيْءٍ وَالثَّالِثُ تَوْحِيدُ الْإِلَهِيَّةِ وَهُوَ اسْتِحْقَاقُهُ سُبْحَانَهُ وَتَعَالَى أَنْ يُعْبَدَ وَحْدَهُ لَا شَرِيكَ لَهُ<\/p>\n<p>Monotheism is the beginning of the matter and its end, meaning the oneness of divinity. Monotheism includes three aspects: first, theology of the attributes (of Allah); second, the oneness of Lordship and clarity that Allah alone created everything; third, the oneness of Godship, which is His worthiness to be worshiped alone without any partner, glory be to Him and exalted is He.<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwīyah 1\/24<\/p><\/blockquote>\n<p>These three categories are not mutually exclusive, but rather their meanings overlap each other. They are simply three different perspectives from which to observe Allah. However, all three must be present in our lives, inwardly and outwardly, if we want to truly submit ourselves to the perfect will of our Creator.<\/p>\n<p>Allah must be known through the Name and Attributes with which He described Himself in the Quran and Sunnah. For this knowledge, we cannot depend upon flawed philosophical reasoning to ‘derive’ the attributes of God, but instead we can only acquire this knowledge through divine revelation from a trustworthy messenger. We have such a credible source in Prophet Muhammad, the Messenger of Allah, peace and blessings be upon him.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ<\/p>\n<p><strong>Allah, there is no God but Him. To Him belong the best names. <\/strong><\/p>\n<p>Surat Ta Ha 20:8<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلَّهِ تِسْعَةٌ وَتِسْعُونَ اسْمًا مَنْ حَفِظَهَا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Allah has ninety-nine names and whoever preserves them will enter Paradise<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6597, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/11\/10\/99-names-allah-asma-al-husna\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, Allah has perfect names (<em>asma’<\/em>) and flawless attributes (<em>sifat<\/em>) that belong only to Him and not to anything else in existence. For example, Allah is exclusively the Creator (<em>Al-Khaliq<\/em>) in the absolute sense of the word. Every other creature who creates things in this world only does so by the will and ability given to them by the uncreated Creator. Likewise, Allah is exclusively the Most Merciful (<em>Al-Rahman<\/em>). People can surely be merciful too, but their mercy first originated with Allah. And, unlike the perfect mercy of the Most Merciful, the mercy of people is always flawed to some degree.<\/p>\n<p>Conversely, believers must negate any comparison, similarity, or likeness between Allah and His creation. Allah is perfect, complete, and absolute in a manner befitting His majesty and to an extent which the human mind cannot fully comprehend.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ<\/p>\n<p><strong>There is no one comparable to Him.<\/strong><\/p>\n<p>Surat al-Ikhlas 112:4<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاطِرُ السَّمَاوَاتِ وَالْأَرْضِ ۚ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا وَمِنَ الْأَنْعَامِ أَزْوَاجًا ۖ يَذْرَؤُكُمْ فِيهِ ۚ لَيْسَ كَمِثْلِهِ شَيْءٌ ۖ وَهُوَ السَّمِيعُ الْبَصِيرُ<\/p>\n<p><strong>He is the Originator of the heavens and the earth. He has made for you mates among yourselves and mates among the cattle, by which He multiplies you. There is nothing like Him, for He is the Hearing and the Seeing.<\/strong><\/p>\n<p>Surat al-Shura 42:11<\/p><\/blockquote>\n<p>This verse expresses the principle of negating comparisons (<em>tamthil<\/em>) to Allah and His creation with respect to the language used to described Him. One of Allah’s beautiful names in the verse is the Hearing (<em>Al-Sami’<\/em>), and while hearing is a human attribute, it is understood that Allah’s Hearing is perfect, flawless, and absolute. Creatures can only hear because Allah granted them the capacity to hear, and no creature can hear anything with the same perfection as Allah. Only the linguistic vehicle of ‘hearing’ and other words is similar; not the different realities which they describe when applies to the Creator or His creation.<\/p>\n<p>After establishing the foundation of Allah’s Names, the two other categories of monotheism further reflect the meaning of Allah’s most important names: the Lord (<em>al-Rabb<\/em>) and the God (<em>Allah<\/em>).<\/p>\n<p>As for the Lord, it is required for the believers to declare Allah’s Lordship over all creation and existence. The name ‘the Lord’ does not only imply ownership and control, but also of providing for the general welfare and development of His creatures. The Lord creates, guides, rears, sustains, nourishes, matures, and fosters growth for the servants whom He has created; therefore, He has the absolute right to command obedience.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ يُغْشِي اللَّيْلَ النَّهَارَ يَطْلُبُهُ حَثِيثًا وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ ۗ أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ ۗ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ<\/p>\n<p><strong>Verily, your Lord is Allah who created the heavens and earth in six days and then established Himself above the Throne. He covers the night with the day, chasing it rapidly, and the sun, the moon, and the stars are subjected to His command. Unquestionably, for Him is the creation and the commandment. Blessed is Allah, the Lord of the worlds.<\/strong><\/p>\n<p>Surah al-A’raf 7:45<\/p><\/blockquote>\n<p>Al-Raghib al-Asfahani discusses the linguistic origin of the name ‘Lord,’ writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرَّبُّ في الأصل التربية وهو إنشاء الشيء حالا فحالا إلى حدّ التمام &#8230; ولا يقال الرّبّ مطلقا إلا لله تعالى المتكفّل بمصلحة الموجودات<\/p>\n<p>The word ‘lord’ originates from ‘rearing,’ which is one who builds something up from one state to the next until it reaches the limit of completion… None may be called ‘Lord’ in an absolute sense except Allah Almighty, who is responsible for the well-being of all existence.<\/p>\n<p>Source: al-Mufradāt fī Gharīb al-Qur’ān 1\/336<\/p><\/blockquote>\n<p>The reality of Allah’s Lordship is established by the numerous signs that He placed within the creation pointing to His power, will, and wisdom. Some theologians call this the <em>teleological reality<\/em>, that nature exhibits clear evidence of purpose and design.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ<\/p>\n<p><strong>Verily, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding, who remember Allah while standing or sitting or lying on their sides and give thought to the creation of the heavens and the earth, saying: Our Lord, You did not create this aimlessly, exalted are You above such a thing, so protect us from the punishment of the Fire.<\/strong><\/p>\n<p>Surat Ali &#8216;Imran 3:190-191<\/p><\/blockquote>\n<p>Ibn Kathir discussed the indisputable evidence proving the Lordship of the Creator at length and summarized them, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَذَلِكَ هَذِهِ الْأَنْهَارُ السَّارِحَةُ مِنْ قُطْرٍ إِلَى قُطْرٍ لِمَنَافِعِ الْعِبَادِ وَمَا ذَرَأَ فِي الْأَرْضِ مِنَ الْحَيَوَانَاتِ الْمُتَنَوِّعَةِ وَالنَّبَاتِ الْمُخْتَلِفِ الطُّعُومِ وَالْأَرَايِيحِ وَالْأَشْكَالِ وَالْأَلْوَانِ مَعَ اتِّحَادِ طَبِيعَةِ التُّرْبَةِ وَالْمَاءِ عَلِمَ وُجُودَ الصَّانِعِ وَقُدْرَتَهُ الْعَظِيمَةَ وَحِكْمَتَهُ وَرَحْمَتَهُ بِخَلْقِهِ وَلُطْفَهُ بِهِمْ وَإِحْسَانَهُ إِلَيْهِمْ وَبِرَّهُ بِهِمْ لَا إِلَهَ غَيْرُهُ وَلَا رَبَّ سِوَاهُ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ وَالْآيَاتُ فِي الْقُرْآنِ الدَّالَّةُ عَلَى هَذَا الْمَقَامِ كَثِيرَةٌ جِدًّا<\/p>\n<p>Whoever thinks about the running rivers that travel from area to area bringing benefit, whoever ponders over what Allah has created on earth; various animals and plants of different tastes, scents, shapes and colors that are a result of unity between land and water. Whoever thinks about all of this then he will realize that these facts testify to the existence of the Creator, His perfect ability, wisdom, mercy, kindness, generosity and His overall compassion for His creation. There is no deity worthy of worship except Allah, nor is there a Lord besides Him, upon Him we rely and to Him we turn in repentance. There are numerous verses in the Quran on this subject.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 2:21<\/p><\/blockquote>\n<p>Denying these plain facts of existence is the essence of unbelief or disbelief in Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ<\/p>\n<p><strong>How can you disbelieve in Allah while you were lifeless and He gave life to you? Then, you will die and be brought back to life and returned to Him.<\/strong><\/p>\n<p>Surat al-Baqarah 2:28<\/p><\/blockquote>\n<p>The Quranic word for ‘unbelief’ (<em>kufr<\/em>) comes from the root <em>ka-fa-ra<\/em> meaning “to cover or hide,” as if those who disbelieve in Allah are ignoring His signs and blessings upon them. This is why <em>kufr<\/em> can also mean ingratitude, simply denying Allah&#8217;s many favors. Nevertheless, Allah patiently gives people a lifetime of opportunity to reflect upon the creation and discover the truth before their judgment on the Day of Resurrection.<\/p>\n<p>Having established Allah as Lord of creation, it logically follows that our Lord is the only one in existence who is worthy of worship. Allah created us, provides for us, guides us, and grants us all kinds of blessings for which we should be grateful. We must reciprocate His good will by worshiping Him alone with any partners.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَّكُمْ ۖ فَلَا تَجْعَلُوا لِلَّهِ أَندَادًا وَأَنتُمْ تَعْلَمُونَ<\/p>\n<p><strong>O people, worship your Lord who created you and those before you that you may become righteous, He who made the earth as a bed and the sky as a ceiling and sent down water from the sky by which fruits are brought out as your provision. Do not appoint partners with Allah while you know better.<\/strong><\/p>\n<p>Surat al-Baqarah 2:21<\/p><\/blockquote>\n<p>Worship is more than performing empty rituals, as some people misunderstand, but rather has much greater depth in Islam. Everything we do that is beloved and pleasing to Allah is an act of worship, including charity, seeking knowledge, and generally being a force for good in the creation.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْعِبَادَة هِيَ اسْم جَامع لكل مَا يُحِبهُ الله ويرضاه من الْأَقْوَال والأعمال الْبَاطِنَة وَالظَّاهِرَة فَالصَّلَاة وَالزَّكَاة وَالصِّيَام وَالْحج وَصدق الحَدِيث وَأَدَاء الْأَمَانَة وبرّ الْوَالِدين وصلَة الْأَرْحَام وَالْوَفَاء بالعهود وَالْأَمر بِالْمَعْرُوفِ وَالنَّهْي عَن الْمُنكر وَالْجهَاد للْكفَّار وَالْمُنَافِقِينَ وَالْإِحْسَان للْجَار واليتيم والمسكين وَابْن السَّبِيل والمملوك من الْآدَمِيّين والبهائم وَالدُّعَاء وَالذكر وَالْقِرَاءَة وأمثال ذَلِك من الْعِبَادَة<\/p>\n<p>Worship is a comprehensive term for everything Allah loves and is pleased with, among statements and deeds, inwardly and outwardly. Thus, prayer, charity, fasting, performing the Hajj pilgrimage, speaking truthfully, fulfilling the trust, righteousness with parents, maintaining family ties, upholding promises, enjoining good, forbidding evil, striving against unbelievers and hypocrites, being good to neighbors, orphans, the poor, the wayfarer, and servants, among humanity and animals, supplicating, practicing remembrance, reciting the Quran, and so on. All of these are acts of worship.<\/p>\n<p>Source: al-‘Ubūdīyah 1\/44<\/p><\/blockquote>\n<p>It is exactly because Allah is the Lord that he is, in fact, <em>Allah<\/em>. The name Allah literally means “the God” or “the one worthy of worship.” Ibn Abbas explains the meaning, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهِ ذُو الْأُلُوهِيَّةِ وَالْمَعْبُودِيَّةِ عَلَى خَلْقِهِ أَجْمَعِينَ<\/p>\n<p>Allah is the one who possesses divinity and the right to be worshiped over all of His creation.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 1:1<\/p><\/blockquote>\n<p>As such, believers are required to pray to Allah alone, perform religious rituals for Allah alone, and otherwise devote all religious actions to Him without giving a share to any other created being. In other words, if someone prays to Allah sometimes but prays to another person at other times, they have made a “partner” in their worship of Allah. In the same way, if someone ascribes divine attributes to a created being that only belong to Allah, he has made a partner alongside Allah. This is nothing less than idolatry.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَن كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا<\/p>\n<p><strong>Whoever hopes to meet His Lord, let him perform righteous deeds and associate no one in the worship of his Lord.<\/strong><\/p>\n<p>Surat al-Kahf 18:110<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ مَنْ عَمِلَ عَمَلًا أَشْرَكَ فِيهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ<\/p>\n<p><strong>Allah Almighty said: Verily, I have no need of any partners. Whoever performs a deed in which he associates another besides Me, I will abandon him and his partner.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2985, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/18\/shirk-abandon-mushrikin-idols\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For this reason, the Quranic word for idolatry (<em>shirk<\/em>) comes from the root <em>sh-ra-ka<\/em> meaning “to share.” Someone who “shares” the divine Names and Attributes of Allah to a created being or “shares” in acts of worship to a created being, they have taken that being as a “partner” or idol. They do not necessarily need to be overtly praying to a statue in order to idolize something.<\/p>\n<p>Idolatry of the heart is the foundation of every other evil deed in existence: arrogance, greed, envy, malice, worldliness, pettiness, and so on. It also militates against the purpose of creation to begin with, which is for us to surrender to the perfect will of our Creator. This is why it is the worst of all sins. Allah has said He will never forgive someone who stubbornly commits idolatry and dies without repenting from it.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ ۚ وَمَن يُشْرِكْ بِاللَّهِ فَقَدِ افْتَرَىٰ إِثْمًا عَظِيمًا<\/p>\n<p><strong>Verily, Allah does not forgive anyone who associates with Him but He forgives what is less than that for whomever He wills. Whoever associates with Allah has fabricated a tremendous sin.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:48<\/p><\/blockquote>\n<p>Abu Bakrah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ ثَلَاثًا<\/p>\n<p><strong>Shall I not tell you about the worst of major sins? They are three.<\/strong><\/p><\/blockquote>\n<p>They said, “Of course, O Messenger of Allah.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ<\/p>\n<p><strong>They are to associate partners with Allah and to dishonor parents.<\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) was reclining and he sat up, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا وَقَوْلُ الزُّورِ<\/p>\n<p><strong>And surely to speak falsely.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2511, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/21\/three-worst-major-sins\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In sum, Islamic monotheism is based upon the oneness of Allah’s Lordship, Godship, and Names and Attributes. Allah is the unique and perfect Creator, who has no likeness with His creation, who is their Lord, Owner, Nourisher, Sustainer, and Provider, thus, He alone deserves to be worshiped by them without any partner. Each of these three categories reinforces and overlaps with the others in a unified theological worldview.<\/p>\n<p>This understanding of monotheism can be found all throughout the Quran in every chapter. It was the message of all of the Prophets mentioned in the Bible, as well as other Prophets whose names were lost to history.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمْ كُنتُمْ شُهَدَاءَ إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِن بَعْدِي قَالُوا نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ إِلَٰهًا وَاحِدًا وَنَحْنُ لَهُ مُسْلِمُونَ<\/p>\n<p><strong>Or were you witnesses when death approached Jacob, when he said to his sons: What will you worship after me? They said: We will worship your God and the God of your fathers, Abraham and Ishmael and Isaac, one God. We surrender to His will as Muslims.<\/strong><\/p>\n<p>Surat al-Baqarah 2:133<\/p><\/blockquote>\n<p>Al-Tabari explains what the sons of Jacob, peace be upon them, pledged to their father, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إلها واحدا أي ن خلص له العبادة ونوحد له الربوبية فلا نشرك به شيئا ولا نتخذ دونه ربا<\/p>\n<p>One God, meaning that worship is sincerely purified for Him, we single Him out for Lordship, we associate nothing with Him, and we do not take anyone besides Him as a Lord.<\/p>\n<p>Source: Tafsir Tabari 2:133<\/p><\/blockquote>\n<p>The first and greatest chapter of the Quran, <em>Surat al-Fatihah<\/em>, is the prayer every Muslim must recite daily in ritual prayers. It contains the most succinct statement of Islamic monotheism:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ<\/p>\n<p><strong>You alone we worship. You alone we ask for help.<\/strong><\/p>\n<p>Surat al-Fatihah 1:5<\/p><\/blockquote>\n<p>These two sentences are both expressions of Allah’s Godship and Lordship, respectively. Ibn Taymiyyah comments on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْأَوَّلُ مِنْ مَعْنَى الْأُلُوهِيَّةِ وَالثَّانِي مِنْ مَعْنَى الرُّبُوبِيَّةِ إذْ الْإِلَهُ هُوَ الَّذِي يُؤَلَّهُ فَيُعْبَدُ مَحَبَّةً وَإِنَابَةً وَإِجْلَالًا وَإِكْرَامًا وَالرَّبُّ هُوَ الَّذِي يُرَبِّي عَبْدَهُ فَيُعْطِيهِ خَلْقَهُ ثُمَّ يَهْدِيهِ إلَى جَمِيعِ أَحْوَالِهِ مِنْ الْعِبَادَةِ وَغَيْرِهَا<\/p>\n<p>The first statement is the meaning of Godship. The second statement is among the meanings of Lordship, as ‘the God’ is He who is characterized by divinity and is worshiped with love, penitence, majesty, and nobility. The Lord is He who rears His servant and grants him his form, then guides him to all his activities of worship or otherwise.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/22<\/p><\/blockquote>\n<p>It is this understanding of monotheism for which Islam was revealed, as the message of previous Prophets had been lost to history or distorted by their followers, and it is upon this creed that Muslims will succeed in this life and in the Hereafter. It is the most basic fundamental teaching of the religion which should be instilled into our children and preached to the public at large. This theology makes Islam the only truly monotheistic religion left in the world, as all the others wrongly give some share of Allah’s divinity or worship to created beings.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;You alone we worship. You alone we ask for help.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[527],"tags":[167,17,20,21,22,184,37,484,483,336,47,52,56,372,60,92,254,45,148,67,70,98],"class_list":["post-22548","post","type-post","status-publish","format-standard","hentry","category-featured","tag-abraham-ibrahim","tag-charity-al-sadaqah","tag-creation-al-khalq","tag-creed-aqidah","tag-excellence-ihsaan","tag-guidance-al-hidaya","tag-idolatry-shirk","tag-isaac","tag-ishmael","tag-jacob-yaqub","tag-jihad","tag-love-al-mahabbah","tag-monotheism-tawheed","tag-allah-names-asma-ul-husna","tag-prayer-salat","tag-providence-al-qada-wal-qadr","tag-provision-al-rizq","tag-quran-exegesis-tafsir","tag-reason-al-aql","tag-repentance-al-tawbah","tag-sincerity-al-ikhlaas","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5RG","jetpack-related-posts":[{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":22548,"position":0},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19852,"url":"https:\/\/www.abuaminaelias.com\/what-happened-at-dhul-khalasah\/","url_meta":{"origin":22548,"position":1},"title":"What happened at Dhul Khalasah?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"O Allah, guide the tribe of Daws and bring them to me.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23635,"url":"https:\/\/www.abuaminaelias.com\/tawhid-worship-allah-alone\/","url_meta":{"origin":22548,"position":2},"title":"Necessity of worshiping Allah alone","author":"Abu Amina Elias","date":"October 23, 2021","format":false,"excerpt":"If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘Allah.’","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16482,"url":"https:\/\/www.abuaminaelias.com\/transcendency-of-allah-in-islam\/","url_meta":{"origin":22548,"position":3},"title":"Transcendency of Allah in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Most Merciful is established upon the Throne.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14729,"url":"https:\/\/www.abuaminaelias.com\/is-it-permissible-to-kill-dogs-in-islam\/","url_meta":{"origin":22548,"position":4},"title":"Killing dogs in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Five animals are harmful and are lawful to kill while in a state of pilgrimage: a snake, a speckled crow, a rat, a biting dog, and a kite.\" --Sahih Muslim 1198","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15651,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-integrity-istiqamah\/","url_meta":{"origin":22548,"position":5},"title":"Imam al-Nawawi on Integrity, Steadfastness","author":"Abu Amina Elias","date":"April 16, 2014","format":false,"excerpt":"\"Remain upright as you are commanded.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22548","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22548"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22548\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22548"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22548"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22548"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}