{"id":22636,"date":"2020-10-04T18:57:20","date_gmt":"2020-10-04T14:57:20","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22636"},"modified":"2025-03-19T11:17:42","modified_gmt":"2025-03-19T07:17:42","slug":"al-mundhiri-on-the-call-to-prayer","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-the-call-to-prayer\/","title":{"rendered":"Imam al-Mundhiri on the Call to Prayer"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في الأذان وما جاء في فضله‎<\/p>\n<p>Encouragement to perform the call to prayer and its virtues.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 1\/174<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الْأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عَلَيْهِ لَاسْتَهَمُوا وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لَأَتَوْهُمَا وَلَوْ حَبْوًا<\/p>\n<p><strong>If people knew the virtues in the call to prayer and the first row of prayer and that they could not get it but by drawing lots, they would surely draw lots. If they knew the virtue in joining prayer at the beginning of its time, they would race to it. If they knew the virtue in prayer at evening and at dawn, they would surely come even if they had to crawl.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 590, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/07\/01\/people-race-salat-masjid\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Abdur Rahman reported: Abu Sa’id al-Khudri, may Allah be pleased with him, said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي أَرَاكَ تُحِبُّ الْغَنَمَ وَالْبَادِيَةَ فَإِذَا كُنْتَ فِي غَنَمِكَ أَوْ بَادِيَتِكَ فَأَذَّنْتَ بِالصَّلَاةِ فَارْفَعْ صَوْتَكَ بِالنِّدَاءِ فَإِنَّهُ لَا يَسْمَعُ مَدَى صَوْتِ الْمُؤَذِّنِ جِنٌّ وَلَا إِنْسٌ وَلَا شَيْءٌ إِلَّا شَهِدَ لَهُ يَوْمَ الْقِيَامَةِ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>I see you love sheep and the desert. When you are among your sheep or in your desert and announce the call to prayer, raise your voice with the call. Verily, the sound of the caller’s voice is not heard by any jinn, nor human, nor anything but that it will testify for him on the Day of Resurrection. I heard it from the Messenger of Allah, peace and blessings be upon him.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 584, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/29\/adhan-call-salat-raise-voice\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَغْفِرُ اللهُ لِلْمُؤَذِّنِ مُنْتَهَى أَذَانِهِ وَيَسْتَغْفِرُ لَهُ كُلُّ رَطْبٍ وَيَابِسٍ سَمِعَ صَوْتَهُ<\/p>\n<p><strong>Allah forgives the callers to prayer when they end their call, and every creature on land or sea who hears his voice seeks forgiveness for him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6202, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/04\/allah-forgives-adhan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُؤَذِّنُ يُغْفَرُ لَهُ مَدَى صَوْتِهِ وَيَشْهَدُ لَهُ كُلُّ رَطْبٍ وَيَابِسٍ وَشَاهِدُ الصَّلَاةِ يُكْتَبُ لَهُ خَمْسٌ وَعِشْرُونَ صَلَاةً وَيُكَفَّرُ عَنْهُ مَا بَيْنَهُمَا<\/p>\n<p><strong>The caller to prayer is forgiven as far as his voice is heard. Every creature on land or sea will testify for him. Whoever is present at the prayer will have a reward multiplied by twenty five time and his sins will be expiated between two prayers.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 515, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/04\/greater-rewards-salat-adhan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Bara’ ibn ‘Azib reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصَّفِّ الْمُقَدَّمِ وَالْمُؤَذِّنُ يُغْفَرُ لَهُ بِمَدِّ صَوْتِهِ وَيُصَدِّقُهُ مَنْ سَمِعَهُ مِنْ رَطْبٍ وَيَابِسٍ وَلَهُ مِثْلُ أَجْرِ مَنْ صَلَّى مَعَهُ<\/p>\n<p><strong>Verily, the angels send blessings upon those in the first row of prayer. The caller to prayer is forgiven for as far as his voice reaches and his truthfulness is affirmed by whichever creature hear him, wet or dry. He will have a reward similar to those who pray with him<\/strong>.<\/p>\n<p>Source: Sunan al-Nasā’ī 646, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/29\/callers-to-prayer-rewarded\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُؤَذِّنُ يُغْفَرُ لَهُ مَدَى صَوْتِهِ وَأَجْرُهُ مِثْلُ أَجْرِ مَنْ صَلَّى مَعَهُ<\/p>\n<p><strong>The caller to prayer is forgiven for as far as his voice reaches, and his reward is similar to those who pray with him.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 7942, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/04\/adhan-prayer-rewarded\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْإِمَامُ ضَامِنٌ وَالْمُؤَذِّنُ مُؤْتَمَنٌ اللَّهُمَّ أَرْشِدْ الْأَئِمَّةَ وَاغْفِرْ لِلْمُؤَذِّنِينَ<\/p>\n<p><strong>The Imam is responsible for the prayer and the caller to prayer is a trustee. O Allah, guide the Imams and forgive the callers.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 207, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/29\/guide-imams-forgive-callers\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الشَّيْطَانَ إِذَا سَمِعَ النِّدَاءَ بِالصَّلَاةِ ذَهَبَ حَتَّى يَكُونَ مَكَانَ الرَّوْحَاءِ<\/p>\n<p><strong>Verily, when Satan hears the call to prayer, he flees to a very distant place.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 388, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/28\/shaytan-flees-from-adhan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Mu’awiyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>The callers to prayer will have the longest necks of the people on the Day of Resurrection<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 387, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/18\/adhan-master-yawm-al-qiyamah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقِيلَ مَعْنَاهُ أَنَّهُمْ سَادَةٌ وَرُؤَسَاءٌ وَالْعَرَبُ تَصِفُ السَّادَةَ بِطُولِ الْعُنُقِ<\/p>\n<p>It is said that it means they are masters and chiefs, as the Arabs would describe mastership as having a long neck.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 387<\/p><\/blockquote>\n<p>Abu Huraira reported: We were with the Messenger of Allah, peace and blessings be upon him, when Bilal stood to announce the prayer, then he was silent. The Prophet said, “<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ مِثْلَ هَذَا يَقِينًا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Whoever says the likes of this with conviction, he will enter Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 674, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/04\/adhan-yaqeen-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Uqbah ibn ‘Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَعْجَبُ رَبُّكَ مِنْ رَاعِي غَنَمٍ فِي رَأْسِ شَظِيَّةِ الْجَبَلِ يُؤَذِّنُ بِالصَّلَاةِ وَيُصَلِّي فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا إِلَى عَبْدِي هَذَا يُؤَذِّنُ وَيُقِيمُ الصَّلَاةَ يَخَافُ مِنِّي قَدْ غَفَرْتُ لِعَبْدِي وَأَدْخَلْتُهُ الْجَنَّةَ<\/p>\n<p><strong>Your Lord delights in a shepherd who announces the call to prayer on the peak of a mountain and he prays. Allah Almighty says: Behold My servant who calls to prayer, performs prayer, and fears Me. I have forgiven My servant and admitted him into Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 666, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/11\/lord-delight-salat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Salman al-Farsi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا كَانَ الرَّجُلُ بِأَرْضِ قِيٍّ فَحَانَتِ الصَّلَاةُ فَلْيَتَوَضَّأْ فَإِنْ لَمْ يَجِدْ مَاءً فَلْيَتَيَمَّمْ فَإِنْ أَقَامَ صَلَّى مَعَهُ مَلَكَاهُ وَإِنْ أَذَّنَ وَأَقَامَ صَلَّى خَلْفَهُ مِنْ جُنُودِ اللَّهِ مَا لَا يُرَى طَرَفَاهُ<\/p>\n<p><strong>If a man is in a deserted land and the time of prayer arrives, let him perform ablution. If he does not find water, let him perform dry ablution. If he performs the prayer, two angels pray with him. If he announces the call to prayer and performs the prayer, behind him will be angels among the armies of Allah whose great numbers cannot be seen<\/strong>.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 1955, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/29\/angels-pray-with-him\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا سَمِعْتُمُ النِّدَاءَ فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ<\/p>\n<p><b>When you hear the call to prayer, say something similar to what the caller has said.<\/b>”<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 580, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/04\/repeat-adhan\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا سَمِعْتُمْ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ ثُمَّ صَلُّوا عَلَيَّ فَإِنَّهُ مَنْ صَلَّى عَلَيَّ صَلَاةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا ثُمَّ سَلُوا اللَّهَ لِي الْوَسِيلَةَ فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ لَا تَنْبَغِي إِلَّا لِعَبْدٍ مِنْ عِبَادِ اللَّهِ وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ فَمَنْ سَأَلَ لِي الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ<\/p>\n<p><strong>When you hear the caller to prayer, repeat what he says and then send blessings upon me. Verily, whoever sends blessings upon me, Allah will send blessings upon him ten times. Then, ask Allah to grant me the means of approach, for it is a station in Paradise not befitting but for one servant among the servants of Allah. I hope I am that one servant. Whoever asks Allah to grant me the means of approach, the intercession is permitted for him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 384, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/29\/dua-for-adhan\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever hears the call to prayer and says, ‘O Allah, Lord of this perfect call and established prayer, give Muhammad the privilege and honor of intercession, and raise him to the praiseworthy status that You have promised him,’ then my intercession will be allowed for him on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 589, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/04\/24\/supplication-prophet-intercession\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Sa’d ibn Abi Waqqas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولًا وَبِالْإِسْلَامِ دِينًا غُفِرَ لَهُ ذَنْبُهُ<\/p>\n<p><strong>Whoever says when he hears the call to prayer, ‘I testify there is no God but Allah alone, without any partner, and Muhammad is His servant and His messenger, I am pleased with Allah as a Lord, with Muhammad as a messenger, and with Islam as a religion,’ then his sins will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 386, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/05\/dua-forgiveness-adhan\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: A man said, “O Messenger of Allah, the callers to prayer have been favored over us.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْ كَمَا يَقُولُونَ فَإِذَا انْتَهَيْتَ فَسَلْ تُعْطَهْ<\/p>\n<p><strong>Say as they have said. When you have finished, ask Allah and you will receive.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 524, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/12\/29\/repeat-adhan-then-dua\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا نُودِيَ لِلصَّلَاةِ فُتِحَتْ أَبْوَابُ السَّمَاءِ وَاسْتُجِيبَ الدُّعَاءُ وَلَا يُرَدُّ الدُّعَاءُ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ<\/p>\n<p><strong>When the call to prayer is announced, the gates of heaven are opened and the supplication is answered. The supplication between the call to prayer and the commencement is never turned back.<\/strong><\/p>\n<p>Source: al-Du’ā’ li-Ṭabarāni 485, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/05\/dua-between-adhan-iqamah\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The caller to prayer is forgiven for as far as his voice reaches,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[122,317,464,32,100,134,60,373,179],"class_list":["post-22636","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-angels-malaikah","tag-animals","tag-call-to-prayer-al-adhan","tag-hereafter-akhirah","tag-manners-al-adab","tag-paradise-jannah","tag-prayer-salat","tag-reward-al-ajr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5T6","jetpack-related-posts":[{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":22636,"position":0},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23251,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nawafil-salat\/","url_meta":{"origin":22636,"position":1},"title":"Imam al-Mundhiri on Voluntary Sunan Prayers","author":"Abu Amina Elias","date":"May 30, 2021","format":false,"excerpt":"\"Whoever perseveres in performing twelve raka'at...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22648,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-five-salawat\/","url_meta":{"origin":22636,"position":2},"title":"Imam al-Mundhiri on the Five Obligatory Prayers","author":"Abu Amina Elias","date":"October 5, 2020","format":false,"excerpt":"\"Verily, every prayer makes the sins before you fall away.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23064,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-shuhh-and-bukhl\/","url_meta":{"origin":22636,"position":3},"title":"Imam al-Mundhiri on Greed and Miserliness","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Greed and faith can never be combined in the heart.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":22636,"position":4},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23079,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-fatihah\/","url_meta":{"origin":22636,"position":5},"title":"Imam al-Mundhiri on Virtues of Surat al-Fatihah","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"All praise is due to Allah, the Lord of the worlds,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22636","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22636"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22636\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22636"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22636"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22636"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}