{"id":22648,"date":"2020-10-05T17:11:09","date_gmt":"2020-10-05T13:11:09","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22648"},"modified":"2025-03-19T11:18:08","modified_gmt":"2025-03-19T07:18:08","slug":"al-mundhiri-five-salawat","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-five-salawat\/","title":{"rendered":"Imam al-Mundhiri on the Five Obligatory Prayers"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في الصلوات الخمس والمحافظة عليها والإيمان بوجوبها<\/p>\n<p>Encouragement to perform the five prayers, to guard over them, and to have faith in their obligation.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 1\/229<\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ عَلَى أَنْ يُعْبَدَ اللَّهُ وَيُكْفَرَ بِمَا دُونَهُ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَحَجِّ الْبَيْتِ وَصَوْمِ رَمَضَانَ<\/p>\n<p><strong>Islam is built upon five: to worship Allah and to disbelieve in what is worshiped besides him, to establish prayer, to give charity, to perform Hajj pilgrimage to the house, and to fast the month of Ramadan<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 8, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/17\/five-pillars-of-islam\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتُمْ لَوْ أَنَّ نَهَرًا بِبَابِ أَحَدِكُمْ، يَغْتَسِلُ فِيهِ كُلَّ يَوْمٍ خَمْسًا مَا تَقُولُ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ‏<\/p>\n<p><strong>If there was a river at your door and he took a bath in it five times a day, would you notice any dirt on him?<\/strong><\/p><\/blockquote>\n<p>They said, “Not a trace of dirt would be left.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَذَلِكَ مِثْلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللَّهُ بِهَا الْخَطَايَا<\/p>\n<p><strong>That is the parable of the five prayers by which Allah removes sins.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 505, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/04\/five-prayers-remove-sins-like-water\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ مَا بَيْنَهُنَّ مَا اجْتُنِبَتْ الْكَبَائِرُ<\/p>\n<p><strong>The five prayers, Friday to Friday, and Ramadan to Ramadan will expiate the sins committed between them, as long as major sins are avoided<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 233, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/18\/prayer-fasting-ramadan-friday\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّلَوَاتُ الْخَمْسُ كَفَّارَاتُ مَا بَيْنَهُمَا أَرَأَيْتَ لَوْ أَنَّ رَجُلًا كَانَ لَهُ مُعْتَمَلٌ بَيْنَ مَنْزِلِهِ ومُعْتَمَلِهِ خَمْسَةُ أَنْهَارٍ فَإِذَا انْطَلَقَ إِلَى مُعْتَمَلِهِ عَمِلَ مَا شَاءَ اللهُ فَأَصَابَهُ الْوَسَخُ أَوِ الْعَرَقُ فَكُلَّمَا مَرَّ بِنَهَرٍ اغْتَسَلَ مَا كَانَ ذَلِكَ مُنَقِّيًا مِنْ دَرَنِهِ فَكَذَلِكَ الصَّلَوَاتُ كُلَّمَا عَمِلَ خَطِيئَةً أَوْ مَا شَاءَ اللهُ ثُمَّ صَلَّى صَلَاةً اسْتَغْفَرَ غُفِرَ لَهُ مَا كَانَ قَبْلَهَا<\/p>\n<p><strong>The five prayers expiate the sins between them. You see that if there were five rivers between a working man’s house and his place of work, he would depart for work as much as Allah willed and he would be covered in dirt or grime. Every time he passed by a river it would cleanse him from that filth. Likewise, each time he commits a sin or as much as Allah willed, then he prayed for forgiveness, he would be forgiven just as he had been before it.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 5444, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/05\/five-salawat-rivers\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الصَّلَوَاتِ الْخَمْسِ كَمَثَلِ نَهْرٍ جَارٍ غَمْرٍ عَلَى بَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ<\/p>\n<p><strong>The parable of the five prayers is that of a river running at your door in which he cleanses himself five times a day<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 668, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/19\/parable-five-prayers-river\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحْتَرِقُونَ تَحْتَرِقُونَ فَإِذَا صَلَّيْتُمُ الْفَجْرَ غَسَلَتْهَا ثُمَّ تَحْتَرِقُونَ تَحْتَرِقُونَ فَإِذَا صَلَّيْتُمُ الظُّهْرَ غَسَلَتْهَا ثُمَّ تَحْتَرِقُونَ تَحْتَرِقُونَ فَإِذَا صَلَّيْتُمُ الْعَصْرَ غَسَلَتْهَا ثُمَّ تَحْتَرِقُونَ تَحْتَرِقُونَ فَإِذَا صَلَّيْتُمُ الْمَغْرِبَ غَسَلَتْهَا ثُمَّ تَحْتَرِقُونَ تَحْتَرِقُونَ فَإِذَا صَلَّيْتُمُ الْعِشَاءَ غَسَلَتْهَا ثُمَّ تَنَامُونَ فَلَا يُكْتَبُ عَلَيْكُمْ شَيْءٌ حَتَّى تَسْتَيْقِظُونَ<\/p>\n<p><strong>You are exposed to fire, you are exposed to fire! If you perform the dawn prayer, it will cleanse you. Then, you are exposed to fire, you are exposed to fire! If you perform the noon prayer, it will cleanse you. Then, you are exposed to fire, you are exposed to fire! If you pray the mid-day prayer, it will cleanse you. Then, you are exposed to fire, you are exposed to fire! If you pray the sunset prayer, it will cleanse you. Then, you are exposed to fire, you are exposed to fire! If you pray the evening prayer, it will cleanse you. Then, when you sleep, nothing will be written against you until you wake up.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 2224, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/05\/five-salawat-protect-nar\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ مَلَكًا يُنَادِي عِنْدَ كُلِّ صَلاةٍ يَا بَنِي آدَمَ قُومُوا إِلَى نِيرَانِكُمُ الَّتِي أَوْقَدْتُمُوهَا عَلَى أَنْفُسِكُمْ فَأَطْفِئُوهَا بِالصَّلاةِ<\/p>\n<p><strong>Verily, Allah has an angel announce at the time of every prayer: O children of Adam, stand for your fires that you have put forward by your sins and extinguish them with prayer.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 9686, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/12\/10\/angel-announces-every-prayer\/\">Hasan li ghayrihi<\/a><\/em><\/p><\/blockquote>\n<p>‘Amr ibn Murrah reported: A man came to the Prophet, peace and blessings be upon him, and he said, “O Messenger of Allah, what do you think if I testify there is no God but Allah and you are the Messenger of Allah, I perform the five prayers, I pay the obligatory alms, I fast the month of Ramadan and stand for prayer in it. Among whom will I be?” The Prophet said, “<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنَ الصِّدِّيقِينَ وَالشُّهَدَاءِ<\/p>\n<p><strong>Among the truthful and the martyrs.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3492, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/ramadan-truthful-and-martyrs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Salman al-Farisi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُسْلِمَ يُصَلِّي وَخَطَايَاهُ مَرْفُوعَةٌ عَلَى رَأْسِهِ كُلَّمَا سَجَدَ تَحَاطَّتْ فَيَفْرُغُ حِينَ يَفْرُغُ مِنْ صَلَاتِهِ وَقَدْ تَحَاتَتْ خَطَايَاهُ<\/p>\n<p><strong>Verily, the Muslim prays while his sins hang over his head. Every time he prostrates, some of them fall down. When he finishes his prayer, his sins will have fallen away.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 6125, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/05\/salat-removes-sins-leaves\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Uthman ibn Affan reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ تَعَالَى فَالصَّلَوَاتُ الْمَكْتُوبَاتُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ<\/p>\n<p><strong>Whoever perfects his ablution as Allah Almighty has commanded him, the prescribed prayers will be an expiation for what occurs between them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 231, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/30\/perfect-wudu-five-salawat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Ayyub reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ كُلَّ صَلَاةٍ تَحُطُّ مَا بَيْنَ يَدَيْهَا مِنْ خَطِيئَةٍ<\/p>\n<p><strong>Verily, every prayer makes the sins before you fall away.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 23503, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/10\/05\/every-salat-expiates-sins\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, every prayer makes the sins before you fall away.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[160,362,464,353,123,354,100,60,306],"class_list":["post-22648","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-ablution-wudu","tag-bad-deeds-al-sayyiat","tag-call-to-prayer-al-adhan","tag-expiation-al-kaffarah","tag-friday-prayer-salat-jumuah","tag-good-deeds-al-hasanat","tag-manners-al-adab","tag-prayer-salat","tag-ramadan"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Ti","jetpack-related-posts":[{"id":22666,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-paying-zakat\/","url_meta":{"origin":22648,"position":0},"title":"Imam al-Mundhiri on Obligatory Charity","author":"Abu Amina Elias","date":"October 19, 2020","format":false,"excerpt":"\"Whoever pays alms on his wealth, his evil will depart from him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":22648,"position":1},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":22648,"position":2},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21850,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fasting-evil-words-deeds\/","url_meta":{"origin":22648,"position":3},"title":"Imam al-Mundhiri on Fasting from Evil Words and Deeds","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Do not insult anyone while you are fasting.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23251,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nawafil-salat\/","url_meta":{"origin":22648,"position":4},"title":"Imam al-Mundhiri on Voluntary Sunan Prayers","author":"Abu Amina Elias","date":"May 30, 2021","format":false,"excerpt":"\"Whoever perseveres in performing twelve raka'at...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13567,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-salat-salah-salawat\/","url_meta":{"origin":22648,"position":5},"title":"Imam al-Nawawi on Five Daily Prayers","author":"Abu Amina Elias","date":"May 19, 2013","format":false,"excerpt":"\"The parable of the five prayers is that of a river running...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22648","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22648"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22648\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22648"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22648"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22648"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}