{"id":22690,"date":"2020-11-11T17:26:03","date_gmt":"2020-11-11T13:26:03","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22690"},"modified":"2020-11-12T02:21:03","modified_gmt":"2020-11-11T22:21:03","slug":"showing-love-and-affection-to-unbelievers","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/showing-love-and-affection-to-unbelievers\/","title":{"rendered":"Showing love and affection to unbelievers"},"content":{"rendered":"<p style=\"text-align: center\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The word ‘love’ has many different definitions and subdivisions. Scholars of Islam have divided the types love into a variety of categories according to different perspectives. However, our discourse is often confused because we use a single word ‘love’ (<em>hubb<\/em>) to mean different things in different contexts. Does Islam teach us to love the unbelievers or to show them affection? It depends upon what definition of love we are using.<\/p>\n<p>It is permissible in Islam to show affection (<em>mawaddah<\/em>) to neighborly non-hostile unbelievers by speaking kind words to them, giving them gifts, and so on, as long as we do not express love for the aspects of their religions or deeds that contradict Islam. This is a type of permissible ‘natural love’ that all human beings experience, such as with their parents, coworkers, and friends.<\/p>\n<p>Ibn al-Qayyim defines this permissible type of love, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right\">وَهِيَ الْمَحَبَّةُ الطَّبِيعِيَّةُ وَهِيَ مَيْلُ الْإِنْسَانِ إِلَى مَا يُلَائِمُ طَبْعَهُ كَمَحَبَّةِ الْعَطْشَانِ لِلْمَاءِ وَالْجَائِعِ لِلطَّعَامِ وَمَحَبَّةِ النَّوْمِ وَالزَّوْجَةِ وَالْوَلَدِ فَتِلْكَ لَا تُذَمُّ إِلَّا إِذَا أَلْهَتْ عَنْ ذِكْرِ اللَّهِ وَشَغَلَتْ عَنْ مَحَبَّتِهِ<\/p>\n<p>Natural love (<em>al-mahabbat al-tib’iyyah<\/em>) is what the human inclines to by his nature, such as the thirsty one’s love for water, the hungry one’s love for food, love for sleep, a wife, or a child. This love is not blameworthy unless it diverts from the remembrance of Allah and distracts from His love.<\/p>\n<p>Source: al-Jawāb al-Kāfī 1\/190<\/p>\n<\/blockquote>\n<p>There are several examples from the life of the Prophet (ṣ) in which he had natural love for his family, relatives, and other non-Muslims. The most obvious instance was his relationship to his uncle Abu Talib, who had raised him and protected him but who died as an idolater.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said to his uncle Abu Talib as he was dying:<\/p>\n<blockquote>\n<p style=\"text-align: right\">قُلْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ لَكَ بِهَا يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Say there is no God but Allah, and I will testify for you on the Day of Resurrection.<\/strong><\/p>\n<\/blockquote>\n<p>Abu Talib said, “Were the Quraysh not to blame me and say only anxiety made him do that, I would delight your eyes.” Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ<\/p>\n<p><strong>Verily, you do not guide those you love, rather only Allah guides whom He wills<\/strong>. (28:56)<\/p>\n<p>Source: Ṣaḥīḥ Muslim 25, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/04\/guidance-abu-talib-kafir-mushrik\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>The Prophet (ṣ) clearly loved his uncle with the natural love of a relative and Abu Talib loved him as well, which demonstrates that it is permissible for us to show such reciprocal affection. It would be unjust to return familial kindness shown by non-Muslim family members with hostility or indifference.<\/p>\n<p>Shaykh Abu Faysal al-Badrani cited this example, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right\">تجوز مودة الكافر للمؤمن ولا يُلام المسلم على ذلك إذا لم يكن سبب هذه المودة سبب محرم وقد كان أبو طالب يحب النبي صلى الله عليه وسلم<\/p>\n<p>It is permissible for an unbeliever to show affection to a believer and there is no blame upon a Muslim for that, as long as the means of this affection are not unlawful means. Abu Talib used to love the Prophet, peace and blessings be upon him.<\/p>\n<p>Source: al-Walāʼ wal-Barāʼ wal-ʻAdāʼ fī al-Islām 1\/47<\/p>\n<\/blockquote>\n<p>In another verse, the Prophet (ṣ) was commanded to convey the message of Islam to his tribe and to ask for no earthly reward in return, except for the expectation that they would maintain ties of reciprocal affection as family members.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">قُل لَّا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِي الْقُرْبَىٰ<\/p>\n<p><strong>Say: I do not ask you anything for it, except affection due to relatives.<\/strong><\/p>\n<p>Source: Surat al-Shura 42:23<\/p>\n<\/blockquote>\n<p>Shaykh Abu Faysal al-Badrani cited this verse and commented on the issue, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right\">طلب مودة الكفار غير المحاربين واستدعاؤها بسبب شرعي جائز بلا شك كالهدية وحسن التعامل ونحوهما هذا وإن كان يندر أن يحبك الكفار وأنت تقيم فيهم الشريعة كما ينبغي<\/p>\n<p>Seeking affection of the unbelievers, except for those who wage war, and inviting it by legislated means is permissible without a doubt, such as giving gifts, dealing with them kindly, and so on. This is even if the unbeliever’s love for you is rare as you uphold the divine law among them as it should be.<\/p>\n<p>Source: al-Walāʼ wal-Barāʼ wal-ʻAdāʼ fī al-Islām 1\/47<\/p>\n<\/blockquote>\n<p>The prohibition of showing affection to unbelievers only applies to those who are hostile to Islam or who are otherwise committing acts of oppression against others, as Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِم بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُم مِّنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ<\/p>\n<p><strong>O you who have faith, do not take My enemies and your enemies as allies, meeting them with affection, while they have disbelieved in the truth that has come to you and expelled you and the Messenger.<\/strong><\/p>\n<p>Surat al-Mumtahanah 60:1<\/p>\n<\/blockquote>\n<p>In the same chapter, Allah makes a clear distinction between hostile and peaceful non-Muslims:<\/p>\n<blockquote>\n<p style=\"text-align: right\">إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُم مِّن دِيَارِكُمْ وَظَاهَرُوا عَلَىٰ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ ۚ وَمَن يَتَوَلَّهُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ<\/p>\n<p><strong>Verily, Allah only forbids you from those who fought you for the sake of religion, expelled you from your homes, and aided your expulsion, that you take them as allies. Whoever takes them as allies, they are certainly wrongdoers.<\/strong><\/p>\n<p>Surat al-Mumtahanah 60:9<\/p>\n<\/blockquote>\n<p>Moreover, when the Prophet (ṣ) entered a town, he would ask Allah to make him and his companions beloved to its inhabitants, even though they were unbelievers, as a way to bring them closer to Islam.<\/p>\n<p>Ibn Umar reported: We were traveling with the Messenger of Allah, peace and blessings be upon him, and when he saw a town he wanted to enter, he would say three times:<\/p>\n<blockquote>\n<p style=\"text-align: right\">اللَّهُمَّ بَارِكْ لَنَا فِيهَا اللَّهُمَّ ارْزُقْنَا جَنَاهَا وَحَبِّبْنَا إِلَى أَهْلِهَا وَحَبِّبْ صَالِحِي أَهْلِهَا إِلَيْنَا<\/p>\n<p><strong>O Allah, bless us in it. O Allah, provide us with its fruits, make us beloved to its people, and make the righteous of its people beloved to us.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 4755, Grade:&nbsp;<em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/11\/11\/prophets-dua-for-new-town\/\">Jayyid<\/a><\/em><\/p>\n<\/blockquote>\n<p>Shaykh Ibn Uthaymeen commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right\">أن الإنسان لا حرج عليه أن يطلب محبة الناس أي أن يحبوه سواء كانوا مسلمين أو كفاراً حتى نقول لا حرج عليه أن يطلب محبة الكفار له &#8230; ومن المعلوم أنه إذا برهم بالهدايا أو الصدقات فسوف يحبونه أو عدل فيهم فسوف يحبونه والمحذور أن تحبهم أنت<\/p>\n<p>There is no blame upon a human being for seeking the love of people, that they love him, whether they are Muslims or unbelievers. Even we say there is no blame upon him if he seeks for unbelievers to love him… It is well-known that when he is kind to them by giving gifts or acts of charity, they will eventually love him, or if he establishes justice among them, they will eventually love him, but be cautious not to love them yourself.<\/p>\n<p>Source: Sharḥ al-Arbaʻīn 1\/322<\/p>\n<\/blockquote>\n<p>The Shaykh’s comment “be cautious not to love them yourself” is a reference to the type of impermissible love that might divert someone from the remembrance of Allah or His religion. Of course, the Prophet (ṣ) loved guidance and blessings for the inhabitants of the town, as is evident by his traveling there to deliver the message of Islam to them.<\/p>\n<p>Some of the Prophet’s (ṣ) companions continued his tradition of seeking the love of unbelievers as a way to draw them nearer to the truth of Islam. Indeed, a faithful Muslim of good character who encounters ordinary neutral non-Muslims may always win them over by their sincerity and exceptional manners.<\/p>\n<p>Abu Huraira, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">مَا سَمِعَ بِي أَحَدٌ يَهُودِيٌّ وَلا نَصْرَانِيٌّ إِلا أَحَبَّنِي<\/p>\n<p>None of the Jews or Christians heard of me but that they loved me.<\/p>\n<p>Source: al-Adab al-Mufrad 34, Grade:&nbsp;<em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/abu-huraira-converts-his-mother\/\">Hasan<\/a><\/em><\/p>\n<\/blockquote>\n<p>All of this is to say that reciprocating love and affection to unbelievers is permissible and not blameworthy in the slightest, as long as the limits of Islam are respected. This is the ruling in respect to the natural love experienced by every human being.<\/p>\n<p>At a higher and much more important level than natural love is the religious love (<em>al-mahabbat al-diniyyah<\/em>) that expresses itself in good will towards all creation, believers and unbelievers. The believers should hold this desire to guide and benefit all people irrespective of their religion or deeds.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right\">لا يَبْلُغُ عَبْدٌ حَقِيقَةَ الإِيمَانِ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ مِنَ الْخَيْرِ<\/p>\n<p><strong>The servant does not attain the reality of faith until he loves for people what he loves for himself of goodness<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 238, Grade:&nbsp;<strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/29\/reality-faith-love-others\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>The key to understanding this concept is to appreciate the grammatical structure of this profound prophetic statement. The Prophet (ṣ) did not say love people, as if to imply love for everything about them, but rather he said to love goodness <em>for<\/em> people. The preposition here qualifies the intended meaning. This is the believer’s unconditional love to see goodness reach all other human beings regardless of the identity of those who receive such goodness.<\/p>\n<p>Shaykh Hamza Muhammad Qasim commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right\">الأولى أن يحمل قوله حتى يحب لأخيه على عموم الأخوة حتى يشمل الكافر و المسلم فيحب لأخيه الكافر ما يحب لنفسه من الدخول في الإسلام ولذلك ندب الدعاء له بالهداية وقد كان النبي صلى الله عليه وسلم يدعو لكفار قريش بالخير و يحبه لهم و يقول اللهم اهد قومي فإنهم لا يعلمون ومما يؤكد أن المراد محبة الخير للناس جميعاً لا فرق بين مسلم وكافر قوله صلى الله عليه وسلم أفضل الإيمان أن تحب للناس ما تحب لنفسك و تكره لهم ما تكره لنفسك<\/p>\n<p>The Prophet’s (ṣ) saying to love for his brother what he loves for himself is interpreted as universal brotherhood, such that it includes the unbeliever and the Muslim, and he should love for his brother, the unbeliever, what he loves for himself which is his entering Islam. For this reason it is recommended to supplicate for their guidance. The Prophet invited the unbelievers of the Quraysh to goodness and he loved good for them. He would say: O Allah, guide my people for they do not know. This confirms that the meaning is to love good for all people. There is no difference between a Muslim and an unbeliever in his saying that the best of faith is to love for people what you love for yourself and to hate for people what you hate for yourself.<\/p>\n<p>Source: Manār al-Qārī 1\/91<\/p>\n<\/blockquote>\n<p>By contrast, the believers must purge their hearts of any malice, ill will, or desire to harm others, whether it is against believers or unbelievers. It is the prophetic Sunnah to purify one’s soul of such spiritual diseases and to achieve a sound heart (<em>salamat al-sadr<\/em> or <em>al-qalb al-salim<\/em>).<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ<\/p>\n<p><strong>Young man, if you are able every morning and evening to remove any malice in your heart towards anyone, do so<\/strong>.<\/p>\n<\/blockquote>\n<p>Then, the Prophet said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right\">يَا بُنَيَّ وَذَلِكَ مِنْ سُنَّتِي وَمَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجَنَّة<\/p>\n<p><strong>Young man, that is my Sunnah<\/strong>.&nbsp;<strong>Whoever revives my Sunnah has loved me, and whoever loves me will be with me in Paradise<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2678, Grade:&nbsp;<em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/17\/tazkiyyat-al-nafs-hasad-hiqd\/\">Hasan<\/a><\/em><\/p>\n<\/blockquote>\n<p>The Prophet (ṣ) warned us against the presence of ‘malice’ (<em>ghish<\/em>) in the heart, which is the opposite of ‘good will’ (<em>nasihah<\/em>). He also made clear that a believer should not have malice towards “anyone,” which includes unbelievers.<\/p>\n<p>Shaykh ‘Ali al-Qari commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right\">لِأَحَدٍ وَهُوَ عَامٌّ لِلْمُؤْمِنِ وَالْكَافِرِ فَإِنَّ نَصِيحَةَ الْكَافِرِ أَنْ يَجْتَهِدَ فِي إِيمَانِهِ وَيَسْعَى فِي خَلَاصِهِ مِنْ وَرْطَةِ الْهَلَاكِ بِالْيَدِ وَاللِّسَانِ وَالتَّأَلُّفِ بِمَا يَقْدِرُ عَلَيْهِ مِنَ الْمَالِ &#8230; أَيْ خُلُوُّ الْقَلْبِ مِنَ الْغِشِّ<\/p>\n<p>Towards ‘anyone’ means it is general for the believer and the unbeliever. For good will towards the unbeliever is striving to bring him to faith and to lend effort to free him from the traps leading to destruction, by hand or by word, and to show mutual affection (<em>ta’alluf<\/em>) to the extent possible by gifting property… meaning, empty the heart of malice.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 1\/262<\/p>\n<\/blockquote>\n<p>The effort to purify the heart from malice can be very difficult, to be sure, as Allah tests us with the injustice of oppressors. Nevertheless, one ought to make the mindful effort to turn away from evil thoughts of hatred and vengeance, by consciously cultivating good will and compassion as a regular exercise every morning and evening.<\/p>\n<p>In sum, it is permissible to show unbelievers natural love and reciprocal affection on condition it does not violate any Islamic teachings or embolden wrongdoing. A believer does not love the religions or deeds of unbelievers, but he or she may love them and show mutual affection to them as parents, children, friends, and colleagues. These positive interactions may be a very effective way to share Islam with our non-Muslim families and neighbors.<\/p>\n<p>Greater even than simple affection is the unconditional love of goodness the believer must have for every person, the believer or the unbeliever, the righteous or the wicked. This is love not based upon a person’s identity or as an act of reciprocation, but rather it is pure love for the sake of Allah, the love to see His message, guidance, and mercy prevail upon the earth. Without a doubt, this divine love is the mighty foundation of His religion and the pure way of His Prophets.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;I do not ask you anything for it, except affection due to relatives.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[6],"tags":[61,16,17,24,26,330,388,30,37,48,52,311,100,54,62,84,66,70,98,392],"class_list":["post-22690","post","type-post","status-publish","format-standard","hentry","category-righteousness-al-birr","tag-call-to-islam-dawah","tag-character-akhlaq","tag-charity-al-sadaqah","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-good-will-naseehah","tag-harm-al-darar","tag-hatred-bigdah","tag-idolatry-shirk","tag-justice-adl","tag-love-al-mahabbah","tag-malice-hiqd","tag-manners-al-adab","tag-mercy-al-rahmah","tag-prophetic-biography-sirah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-remembrance-dhikr","tag-sincerity-al-ikhlaas","tag-unbelief-al-kufr","tag-wrongdoing-al-thulm"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5TY","jetpack-related-posts":[{"id":12981,"url":"https:\/\/www.abuaminaelias.com\/are-muslims-only-kind-to-believers\/","url_meta":{"origin":22690,"position":0},"title":"Are Muslims only kind to believers?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah does not forbid you from being kind and just...\" (60:8)","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16113,"url":"https:\/\/www.abuaminaelias.com\/mercy-towards-prisoners-of-war-in-islam\/","url_meta":{"origin":22690,"position":1},"title":"Mercy towards prisoners of war in Islam","author":"Abu Amina Elias","date":"December 1, 2014","format":false,"excerpt":"“I enjoin you to treat the captives well.”","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15170,"url":"https:\/\/www.abuaminaelias.com\/religious-love-and-human-love-in-islam\/","url_meta":{"origin":22690,"position":2},"title":"Religious love and human love in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"In Islam, it is important for us to understand the difference between religious love and human love.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13131,"url":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-a-terrorist\/","url_meta":{"origin":22690,"position":3},"title":"Was Prophet Muhammad a terrorist?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Fight in the way of Allah those who fight you, but do not transgress.\" (2:190)","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25737,"url":"https:\/\/www.abuaminaelias.com\/qadiyani-ahmadiyyah-are-they-muslims\/","url_meta":{"origin":22690,"position":4},"title":"The Qadiyani Sect: Are they Muslims?","author":"Abu Amina Elias","date":"July 24, 2025","format":false,"excerpt":"\"Invite to the Way of your Lord with wisdom and kind advice,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16945,"url":"https:\/\/www.abuaminaelias.com\/understanding-loyalty-and-disavowal-in-islam\/","url_meta":{"origin":22690,"position":5},"title":"Understanding loyalty and disavowal in Islam","author":"Abu Amina Elias","date":"August 31, 2015","format":false,"excerpt":"\"The believing men and believing women are allies of one another.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22690","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22690"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22690\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22690"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22690"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22690"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}