{"id":22742,"date":"2020-12-24T12:20:22","date_gmt":"2020-12-24T08:20:22","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22742"},"modified":"2020-12-24T12:40:46","modified_gmt":"2020-12-24T08:40:46","slug":"prophets-dream-akhirah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/prophets-dream-akhirah\/","title":{"rendered":"The Prophet’s wondrous dream of the Hereafter"},"content":{"rendered":"<p style=\"text-align: center;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Some prophetic traditions are of such immense importance that every Muslim should read them and reflect deeply upon them. One such hadith was frequently used by Ibn Taymiyyah and his student Ibn al-Qayyim to teach the foundations of the Sunnah in the clearest and most concise manner.<\/p>\n<p>In this hadith, the Prophet (ṣ) describes to us a vision he saw in a dream that contains many beneficial lessons and reinforces the sounds principles of Islamic creed, worship, and ethics. In this dream, he saw many people of his nation struggling in the dreadful scenes of the Day of Resurrection, and their good deeds came to intercede for them and admit them into Paradise.<\/p>\n<p>Abdur Rahman ibn Samurah reported: The Messenger of Allah, peace and blessings be upon him, came out to us and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي رَأَيْتُ الْبَارِحَةَ عَجَبًا رَأَيْتُ رَجُلًا مِنْ أُمَّتِي قَدِ احْتَوَشَتْهُ مَلَائِكَةٌ فَجَاءَهُ وُضُوؤُهُ فَاسْتَنْقَذَهُ مِنْ ذَلِكَ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي قَدِ احْتَوَشَتْهُ الشَّيَاطِينُ فَجَاءَهُ ذِكْرُ اللَّهِ فَخَلَّصَهُ مِنْهُمْ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَلْهَثُ عَطَشًا مِنَ الْعَطَشِ فَجَاءَهُ صِيَامُ رَمَضَانَ فَسَقَاهُ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي بَيْنَ يَدَيْهِ ظُلْمَةٌ وَمِنْ خَلْفِهِ ظُلْمَةٌ وَعَنْ يَمِينِهِ ظُلْمَةٌ وَعَنْ شِمَالِهِ ظُلْمَةٌ وَمِنْ فَوْقِهِ ظُلْمَةٌ وَمِنْ تَحْتِهِ ظُلْمَةٌ فَجَاءَهُ حَجُّهُ وَعُمْرَتُهُ فَاسْتَخْرَجَاهُ مِنَ الظُّلْمَةِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي جَاءَهُ مَلَكُ الْمَوْتِ يَقْبِضُ رُوحَهُ فَجَاءَهُ بِرُّهُ بِوَالِدَيْهِ فَرَدَّهُ عَنْهُ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يُكَلِّمُ الْمُؤْمِنِينَ وَلَا يُكَلِّمُوهُ فَجَاءَتْهُ صِلَةُ الرَّحِمِ فَقَالَتْ إِنَّ هَذَا وَاصِلٌ كَانَ وَاصِلًا لِرَحِمِهِ فَكَلَّمَهُمْ وَكَلَّمُوهُ وَصَارَ مَعَهُمْ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَأْتِي النَّاسَ وَهُمْ حِلَقٌ فَكُلَّمَا أَتَى عَلَى حَلْقَةٍ طُرِدَ فَجَاءَهُ اغْتِسَالُهُ مِنَ الْجَنَابَةِ فَأَخَذَهُ بِيَدِهِ فَأَجْلَسَهُ مَعَهُمْ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَتَّقِي وَهَجَ النَّارِ بِيَدَيْهِ عَنْ وَجْهِهِ فَجَاءَتْهُ صَدَقَتُهُ وَصَارَتْ ظِلًّا عَلَى رَأْسِهِ وَسِتْرًا عَلَى وَجْهِهِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي جَاءَتْهُ زَبَانِيَةُ الْعَذَابِ فَجَاءَهُ أَمْرُهُ بِالْمَعْرُوفِ وَنَهْيُهُ عَنِ الْمُنْكَرِ فَاسْتَنْقَذَهُ مِنْ ذَلِكَ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي هَوَى فِي النَّارِ فَجَاءَتْهُ دُمُوعُهُ الَّتِي بَكَى مِنْ خَشْيَةِ اللَّهِ فَأَخْرَجَتْهُ مِنَ النَّارِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي قَدْ هَوَتْ صَحِيفَتُهُ إِلَى شِمَالِهِ فَجَاءَهُ خَوْفُهُ مِنَ اللَّهِ فَأَخَذَ صَحِيفَتَهُ فَجَعَلَهَا فِي يَمِينِهِ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَرْعَدُ كَمَا تَرْعَدُ السَّعَفَةُ فَجَاءَهُ حُسْنُ ظَنِّهِ بِاللَّهِ فَسَكَّنَ رِعْدَتَهُ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي يَزْحَفُ عَلَى الصِّرَاطِ مَرَّةً وَيَجْثُو مَرَّةً وَيَتَعَلَّقُ مَرَّةً فَجَاءَتْهُ صَلَاتُهُ عَلَيَّ فَأَخَذَتْ بِيَدِهِ فَأَقَامَتْهُ عَلَى الصِّرَاطِ حَتَّى جَاوَزَ وَرَأَيْتُ رَجُلًا مِنْ أُمَّتِي انْتَهَى إِلَى أَبْوَابِ الْجَنَّةِ فَغُلِّقَتِ الْأَبْوَابُ دُونَهُ فَجَاءَتْهُ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَأَخَذَتْهُ بِيَدِهِ فَأَدْخَلَتْهُ الْجَنَّةَ<\/p>\n<p><strong>Verily, I saw something wondrous last night. I saw a man of my nation as angels were holding him back, and his ablution came to save him from that. I saw a man of my nation surrounded by devils, and the remembrance of Allah came to free him from them. I saw a man of my nation suffering from extreme thirst, and his fasting in Ramadan came to give him drink. I saw a man of my nation with darkness before him, darkness behind him, darkness to his right, darkness to his left, darkness above him, and darkness below him, and his pilgrimages came to bring him out of darkness. I saw a man of my nation to whom the angel of death came to take his soul, and his righteousness to his parents came and turned the angel back. I saw a man of my nation to whom the believers would not speak, and his maintenance of family ties came and it said, ‘Verily, he is one who has maintained family ties, so speak to him,’ and he became one of them. I saw a man of my nation come to people sitting in circles and every circle he came to drove him away, and his ritual bath from major impurity led him by the hand and seated him next to them. I saw a man of my nation shielding his face from the heat of the Hellfire, and his charity came to give him shade and cover his face. I saw a man of my nation to whom the angels of punishment came, and his enjoining good and forbidding evil came to save him from that. I saw a man of my nation falling into the Hellfire, and the tears which he shed for reverence of Allah came to pull him out of the Fire. I saw a man of my nation whose scroll fell into his left hand, and his fear of Allah came to place his scroll in his right hand. I saw a man of my nation swaying in the wind like a palm tree, and his good thoughts of Allah came to calm his shaking. I saw a man of my nation crawling across the bridge over Hell, at times kneeling, at times clinging to it, and his blessings over me came to take him by the hand and stand him up upon the bridge until he passed over it. I saw a man of my nation who was stopped at the gates of Paradise and every gate was locked for him, and his testimony that there is no God but Allah came to take him by the hand and lead him into Paradise.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 39, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/12\/24\/prophets-astonishing-dream\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this tradition, we learn about the salvific power of monotheism, ablution, ritual bathing, prayer, charity, fasting, pilgrimage, remembrance of Allah, righteousness to parents, maintaining family ties, enjoining good, fearing and revering Allah, thinking well of Allah, weeping for the sake of Allah, and sending blessings upon the Prophet (ṣ). All of these deeds were the reason these believers entered Paradise and were saved from damnation. We also learn important points of sound creed, such as the reality of angels and devils, the Hereafter, Paradise, Hellfire, the bridge over Hell, and the scrolls of our deeds, which contain our sins both great and small.<\/p>\n<p>As the Prophet’s (ṣ) vision contains so many powerful lessons for us, Ibn al-Qayyim strongly encourages every Muslim to commit it to memory, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي هذا الحديث العظيم الشريف القدر الذي ينبغي لكل مسلم أن يحفظه<\/p>\n<p>In this great and noble tradition is immense value, which every Muslim should memorize.<\/p>\n<p>Source: al-Wābil al-Ṣayyib 1\/82<\/p><\/blockquote>\n<p>Although some scholars do not consider the chain of narrators to be sound, Ibn Taymiyyah correctly notes that everything in the hadith is confirmed in the Quran and authentic Sunnah. Ibn Taymiyyah said regarding its authenticity:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أصول السنة تشهد له وهو من أحسن الأحاديث<\/p>\n<p>The foundations of the Sunnah testify to it and it is among the best of prophetic traditions.<\/p>\n<p>Source: al-Mustadrak &#8216;alá al-Majmū&#8217; 1\/99<\/p><\/blockquote>\n<p>Ibn al-Qayyim likewise writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكان شيخ الإسلام ابن تيمية قدس الله روحه يعظم شأن هذا الحديث وبلغني عنه أنه كان يقول شواهد الصحة عليه<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah, may Allah sanctify his soul, stressed the importance of this tradition and I heard him used to say: Its soundness has corroborating evidence.<\/p>\n<p>Source: al-Wābil al-Ṣayyib 1\/83<\/p><\/blockquote>\n<p>As such, this tradition is an excellent example of the grading use by scholars known as <em>sahih li ghayrihi <\/em>(authentic due to external evidence) or <em>lahu shawahid <\/em>(it has corroborating evidence). The chain of narrators may not be the strongest, but all of the lessons contained within it are supported by the Quran and authentic Sunnah.<\/p>\n<p>The tradition also gives us a model for when it is appropriate to cite hadith whose chains of authority are weak or less than strictly ‘authentic’ (<em>sahih<\/em>). Since some traditions of this nature may be true and beneficial, although transmitted to us by a weaker chain, many scholars permitted their use in teaching as long as it confirms what has already been established by stronger texts. Just because the chain has weakness does not necessitate that the tradition is false, useless, or without benefit. Indeed, a weaker text, as in this case, may even convey correct Islamic beliefs in a clearer and more concise manner than texts with stronger chains.<\/p>\n<p>That said, let the believers reflect upon the perils of the Day of Resurrection and the virtuous deeds that can save them from its terrors. The Prophet’s (ṣ) wondrous dream provides us with an exemplary roadmap for avoiding the punishments of the Hereafter and guiding us into the eternal gardens of Paradise.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, I saw something wondrous last night!&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[160,122,17,183,262,168,24,85,27,349,88,135,32,56,134,298,60,306,66,359,68,371,327],"class_list":["post-22742","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-ablution-wudu","tag-angels-malaikah","tag-charity-al-sadaqah","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-enjoin-good-amr-bil-maruf","tag-family-ties-sillat-rahim","tag-fasting-al-siyam","tag-god-fearing-taqwa","tag-good-assumption-husn-al-dhann","tag-pilgrimage-hajj","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-monotheism-tawheed","tag-paradise-jannah","tag-parents","tag-prayer-salat","tag-ramadan","tag-remembrance-dhikr","tag-ritual-bath-al-ghusl","tag-satan-al-shaytan","tag-ummah","tag-umrah-pilgrimage"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5UO","jetpack-related-posts":[{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":22742,"position":0},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20541,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-following-book-and-sunnah\/","url_meta":{"origin":22742,"position":1},"title":"Imam al-Mundhiri on Following the Quran and Sunnah","author":"Abu Amina Elias","date":"June 22, 2019","format":false,"excerpt":"\"Hold fast to the Quran, for you will never be lead astray,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21364,"url":"https:\/\/www.abuaminaelias.com\/baby-girl-buried-alive-in-hell\/","url_meta":{"origin":22742,"position":2},"title":"Baby girl buried alive is in Hell?","author":"Abu Amina Elias","date":"October 23, 2019","format":false,"excerpt":"\"For what sin was she killed?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14722,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-hajj-and-umrah-pilgrimage\/","url_meta":{"origin":22742,"position":3},"title":"Imam al-Nawawi on Hajj and &#8216;Umrah Pilgrimage","author":"Abu Amina Elias","date":"August 7, 2013","format":false,"excerpt":"\"Proclaim to people the Hajj pilgrimage.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20617,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-purification-of-the-heart\/","url_meta":{"origin":22742,"position":4},"title":"Forty Hadith on Purification of the Heart","author":"Abu Amina Elias","date":"June 30, 2019","format":false,"excerpt":"\"Wealth and poverty are in the heart.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":22742,"position":5},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22742","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22742"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22742\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22742"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22742"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22742"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}