{"id":22759,"date":"2020-12-29T10:32:19","date_gmt":"2020-12-29T06:32:19","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22759"},"modified":"2020-12-29T12:22:01","modified_gmt":"2020-12-29T08:22:01","slug":"999-of-1000-in-hellfire","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/999-of-1000-in-hellfire\/","title":{"rendered":"Only one out of 1000 are in Paradise?"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>In an authentic tradition, we are informed that when the Reckoning begins on the Day of Resurrection, the initial judgment against people will be that nine hundred and ninety-nine out of a thousand are sentenced to the Hellfire. This is alarming, to say the least. But does it mean only one out of every thousand people will ever enter Paradise?<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ عَزَّ وَجَلَّ يَا آدَمُ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ يَقُولُ أَخْرِجْ بَعْثَ النَّارِ‏ قَالَ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ‏ قَالَ فَذَاكَ حِينَ يَشِيبُ الصَّغِيرُ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ<\/p>\n<p><strong>Allah Almighty will say: O Adam! Adam will say: I am at Your service and Your call. Allah will say: Bring them out to the Hellfire. Adam will say: Who will be brought out to the Hellfire? Allah will say: Of every thousand, nine hundred and ninety-nine. That is when the hair of the young will turn gray, every pregnant woman will suffer miscarriage, and you will see people drunk while they are not intoxicated. Rather, the punishment of Allah is severe. <\/strong><\/p><\/blockquote>\n<p>That was very hard on the companions and they said, “O Messenger of Allah, who is that one man?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبْشِرُوا فَإِنَّ مِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفًا وَمِنْكُمْ رَجُلٌ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ<\/p>\n<p><strong>Rejoice, for among Gog and Magog are a thousand and among you is one man. By the One in whose hand is my soul, I hope you will be a quarter of the people of Paradise.<\/strong><\/p><\/blockquote>\n<p>They praised Allah and exalted Him, then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ<\/p>\n<p><strong>By the One in whose hand is my soul, I hope you will be a third of the people of Paradise.<\/strong><\/p><\/blockquote>\n<p>They praised Allah and exalted Him, then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ إِنَّ مَثَلَكُمْ فِي الأُمَمِ كَمَثَلِ الشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوْ كَالرَّقْمَةِ فِي ذِرَاعِ الْحِمَارِ<\/p>\n<p><strong>By the One in whose hand is my soul, I hope you will be half of the people of Paradise. Verily, your likeness among the nations is that of a white hair on the skin of a black ox or a strip on the foreleg of a donkey.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 222, Grade: <strong><em>Muttafaqun Alayhi<\/em><\/strong><\/p><\/blockquote>\n<p>As Abu Sa’id al-Khudri noted, the announcement of so many people sentenced to Hellfire was very difficult for the companions to hear, and perhaps even more so for us. We have been told many times elsewhere that the mercy of Allah is vast, so are only a tiny fraction of humanity going to Paradise?<\/p>\n<p>It is important to bring other texts of hope to balance the texts of fear, as well as to provide additional information to see the complete picture. We should not cite one text in isolation if it might make people despair. The scene described by the Prophet (ṣ) here is at the beginning of the Reckoning, before any intercession occurs to save people from their sentence.<\/p>\n<p>‘Ali al-Qari commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ قِيلَ هُمُ الَّذِينَ يَسْتَوْجِبُونَ النَّارَ بِذُنُوبِهِمْ يُتْرَكُونَ فِيهَا بِقَدْرِ ذُنُوبِهِمْ وَيَجُوزُ أَنْ يُصْرَفُوا عَنْ طَرِيقِ جَهَنَّمَ بِالشَّفَاعَةِ ذَكَرَهُ ابْنُ الْمَلَكِ رَحِمَهُ اللَّه وَيَجُوزُ أَنْ يَخْلُصُوا مِنْهَا بَعْدَ دُخُولِهَا بِالشَّفَاعَةِ<\/p>\n<p>Nine hundred ninety-nine out of a thousand, it is said they are those have made Hellfire necessary upon them because of their sins and they are left therein by the measure of their sins. It is possible that they will be diverted from the path to Hell by the intercession, as mentioned by Ibn al-Malak, may Allah have mercy on him. It is possible that they will be freed after entering it by the intercession.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 8\/3504<\/p><\/blockquote>\n<p>It is the belief of the people of Sunnah that sinful believers might be sentenced to Hellfire initially or cast into it as a temporary punishment to purify them of their sins, eventually being admitted into Paradise because of their faith, imperfect though it was.<\/p>\n<p>Indeed, Imam Muslim records a hopeful tradition in his collection from the same companion, Abu Sai’d al-Khudri, before he narrates the fearful text of nine hundred ninety-nine in Hellfire.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُدْخِلُ اللَّهُ أَهْلَ الْجَنَّةِ الْجَنَّةَ يُدْخِلُ مَنْ يَشَاءُ بِرَحْمَتِهِ وَيُدْخِلُ أَهْلَ النَّارِ النَّارَ ثُمَّ يَقُولُ انْظُرُوا مَنْ وَجَدْتُمْ فِي قَلْبِهِ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ فَيُخْرَجُونَ مِنْهَا حُمَمًا قَدْ امْتَحَشُوا فَيُلْقَوْنَ فِي نَهَرِ الْحَيَاةِ أَوْ الْحَيَا فَيَنْبُتُونَ فِيهِ كَمَا تَنْبُتُ الْحِبَّةُ إِلَى جَانِبِ السَّيْلِ أَلَمْ تَرَوْهَا كَيْفَ تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً<\/p>\n<p><strong>Allah will admit the people of Paradise into Paradise among whomever He wills, due to His mercy, and He will admit the people of Hellfire into Hellfire, then Allah will say: Look for those with faith in their hearts as much as a seed and bring them out. Then, they will be brought out having been burned and turned into charcoal. They will be cast into the river of life and will sprout just as a seed in the silt is carried away by the flood. Have you not seen that it comes out yellow and entwined<\/strong>?<\/p>\n<p>Source: Ṣaḥīḥ Muslim 184, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/believers-nar-forever\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Bringing the two texts together, we find the proper balance of fear and hope. Yes, at the initial Reckoning, a great number of people, even among believers, will be sentenced to Hellfire because of their sins. But those who had even a little faith, despite its significant deficiencies, will be purified by the Hellfire and then enter Paradise.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَخْرُجُ مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ شَعِيرَةً ثُمَّ يَخْرُجُ مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ بُرَّةً ثُمَّ يَخْرُجُ مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ ذَرَّةً<\/p>\n<p><strong>One will be taken out of the Hellfire who said there is no God but Allah and he had good in his heart like the weight of a grain of barley. Then, one will be taken out of Hellfire who said there is no God but Allah and he had good in this heart like the weight of a grain of wheat. Then, one will be taken out of Hellfire who said there is no God but Allah and he had good in his heart like the weight of a speck.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 44, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/10\/09\/believers-eventually-taken-out\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُعَذَّبُ نَاسٌ مِنْ أَهْلِ التَّوْحِيدِ فِي النَّارِ حَتَّى يَكُونُوا فِيهَا حُمَمًا ثُمَّ تُدْرِكُهُمْ الرَّحْمَةُ فَيُخْرَجُونَ وَيُطْرَحُونَ عَلَى أَبْوَابِ الْجَنَّةِ قَالَ فَيَرُشُّ عَلَيْهِمْ أَهْلُ الْجَنَّةِ الْمَاءَ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْغُثَاءُ فِي حِمَالَةِ السَّيْلِ ثُمَّ يَدْخُلُونَ الْجَنَّةَ<\/p>\n<p><strong>Some people among those who worshiped Allah alone will be punished in Hellfire until they are coals. Then, the mercy of Allah will reach them and they will be taken out and presented at the gates of Paradise. The people of Paradise will pour water over them and they will grow just as the stubble carried by the stream grows; then, they will enter Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2597, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/08\/11\/tawhid-nar-first-then-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَام فَبَشَّرَنِي أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِكَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ<\/p>\n<p><strong>Gabriel, upon him be peace, came to me to give the good news that anyone from my nation who dies without associating partners with Allah will enter Paradise<\/strong>.<\/p><\/blockquote>\n<p>I said, “Even if he commits adultery and theft?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ زَنَى وَإِنْ سَرَقَ<\/p>\n<p><strong>Even if he commits adultery and theft<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1180, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/28\/hereafter-faith-eventually-jannah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهُوَ حُجَّةٌ لِمَذْهَبِ أَهْلِ السَّنَةِ أَنَّ أَصْحَابَ الْكَبَائِرِ لَا يُقْطَعُ لَهُمْ بِالنَّارِ وَأَنَّهُمْ إِنْ دَخَلُوهَا أُخْرِجُوا مِنْهَا وَخُتِمَ لَهُمْ بِالْخُلُودِ فِي الْجَنَّةِ<\/p>\n<p>This tradition is a proof for the people of the Sunnah, that those who commit major sins will not remain in the Hellfire forever. If they enter it, they will be taken out and eventually admitted into Paradise.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 94<\/p><\/blockquote>\n<p>All of this is from the mercy of Allah, which He bestows upon whomever He wishes among His servants. Be warned, however, not to take this blessing for granted like the people of the Book before us. They had this knowledge that the believers will not be punished in Hellfire forever, but they used it as an excuse to persist in sin.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً ۚ قُلْ أَتَّخَذْتُمْ عِندَ اللَّهِ عَهْدًا فَلَن يُخْلِفَ اللَّهُ عَهْدَهُ ۖ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ<\/p>\n<p><strong>They said: The Hellfire will never touch us except for a number of days. Say: Do you have a covenant from Allah? For Allah never violates His covenant, or do you say about Allah what you do not know?<\/strong><\/p>\n<p>Surat al-Baqarah 2:80<\/p><\/blockquote>\n<p>We know in a general sense that sinful believers will be taken out of Hellfire eventually, but we cannot guarantee for ourselves that we will be among them. We cannot even guarantee that we will die with enough faith to save us from eternal punishment!<\/p>\n<p>Moreover, there is no possible pleasure in this world derived from sin that will be worth spending even a moment in Hell. A person who is touched by the Hellfire will <em>immediately<\/em> regret all of the evil things they did and forget all of the pleasures they used to enjoy.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ هَلْ مَرَّ بِكَ شِدَّةٌ قَطُّ فَيَقُولُ لَا وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤْسٌ قَطُّ وَلَا رَأَيْتُ شِدَّةً قَطُّ<\/p>\n<p><strong>The most privileged people in the world among the people of Hellfire will come on the Day of Resurrection to be dipped in Hellfire, then it will be said: O son of Adam, did you see any good? Did you get any blessing? He will say: No, by Allah, my Lord! Then, the most miserable people in the world among the people of Paradise will come on the Day of Resurrection to be dipped in Paradise, then it will be said: O son of Adam, did you see any hardship? Did you have any distress? He will say: No, by Allah, my Lord! I did not once see hardship or distress.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2807, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/08\/akhirah-privileged-miserable\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Again, we return to the need to balance fear and hope. If we only cite the tradition of nine hundred ninety-nine out of a thousand sentenced to Hellfire, it will certainly make some people despair, which is harmful to their faith. We should complement these dire warnings with reminders of the mercy of Allah and the various avenues to earn His forgiveness.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Of every thousand, nine hundred and ninety-nine&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[300,183,459,135,32,481,54,56,134,115,358,374,373,220],"class_list":["post-22759","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-adam","tag-day-of-resurrection-yawm-al-qiyammah","tag-gog-magog-yajuj-wa-majuj","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-intercession-al-shafaah","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-people-of-the-book","tag-praise-al-hamd","tag-punishment-al-uqubah","tag-reward-al-ajr","tag-supplication-al-dua"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5V5","jetpack-related-posts":[{"id":18340,"url":"https:\/\/www.abuaminaelias.com\/punished-hellfire-forever\/","url_meta":{"origin":22759,"position":0},"title":"Will people be punished in Hellfire forever?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Allah informed us that his mercy encompasses all things,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15093,"url":"https:\/\/www.abuaminaelias.com\/the-world-is-nothing-compared-to-the-hereafter\/","url_meta":{"origin":22759,"position":1},"title":"This world is nothing compared to the Hereafter","author":"Abu Amina Elias","date":"December 23, 2013","format":false,"excerpt":"\"What is the example of this worldly life...?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20526,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-humility-vanity-arrogance\/","url_meta":{"origin":22759,"position":2},"title":"Imam al-Mundhiri on Humility, Vanity, and Arrogance","author":"Abu Amina Elias","date":"June 19, 2019","format":false,"excerpt":"\"Allah revealed to me that you must be humble,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21839,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-virtues-of-fasting\/","url_meta":{"origin":22759,"position":3},"title":"Imam al-Mundhiri on Virtues of Fasting","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Fasting is a shield from the Hellfire, just like a shield of yours in battle.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":11513,"url":"https:\/\/www.abuaminaelias.com\/women-majority-hellfire-explanation\/","url_meta":{"origin":22759,"position":4},"title":"Are women the majority in Hellfire?","author":"Abu Amina Elias","date":"November 10, 2012","format":false,"excerpt":"\"Women are the majority of the children of Adam,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13762,"url":"https:\/\/www.abuaminaelias.com\/salvation-outside-islam\/","url_meta":{"origin":22759,"position":5},"title":"Salvation for non-Muslims outside of Islam?","author":"Abu Amina Elias","date":"June 8, 2013","format":false,"excerpt":"\"Allah will judge between them on the Day of Resurrection.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22759","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22759"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22759\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22759"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}