{"id":22796,"date":"2021-01-18T17:09:00","date_gmt":"2021-01-18T13:09:00","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22796"},"modified":"2025-01-27T12:57:46","modified_gmt":"2025-01-27T08:57:46","slug":"nur-aql-iman","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/nur-aql-iman\/","title":{"rendered":"The Parable of Light, Reason, and Faith"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The parable of light in the Quran contains deep and multi-layered meanings from different perspectives. One of the most important ways to understand this parable is in regards to the complementary relationship of reason to divine revelation.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ ۚ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ ۖ الْمِصْبَاحُ فِي زُجَاجَةٍ ۖ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ ۚ نُّورٌ عَلَىٰ نُورٍ ۗ يَهْدِي اللَّهُ لِنُورِهِ مَن يَشَاءُ ۚ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ<\/p>\n<p><strong>Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass, the glass as if it were a pearly white star lit from the oil of a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire. Light upon light. Allah guides to His light whom He wills. And Allah presents parables to people, for Allah knows all things.<\/strong><\/p>\n<p>Surat al-Nur 24:35<\/p><\/blockquote>\n<p>The imagery of light can represent many things: guidance, life, religion, faith, divine revelation, the Prophets, the Quran, and so on. Each different manifestation of light reinforces the others, for instance, one who is guided by the Quran is further guided by the Sunnah. In this way, the light that comes from Allah is “light upon light.”<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فدين الله عز وجل نور وكتابه نور ورسوله نور وداره التي أعدها لأوليائه نور يتلألأ وهو تبارك وتعالى نور السماوات والأرض ومن أسمائه النور وأشرقت الظلمات لنور وجهه<\/p>\n<p>The religion of Allah Almighty is light. His Book is light. His messenger is light. The abode prepared for His allies shines with light. He, Almighty, is the light of the heavens and the earth, His name is the Light, and darkness is dispelled by the light of His Face.<\/p>\n<p>Source: al-Wābil al-Ṣayyib 1\/50<\/p><\/blockquote>\n<p>One significant source of light comes from reason, logic, and rational thinking, which is rooted in the pure nature (<em>fitrah<\/em>) that Allah created within people. It is by reason that human beings start to transcend the animalistic nature within themselves, recognize divine revelation, and choose to willingly follow the commands of Allah in opposition to their worldly desires.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأما الْإِنْسَان فَإِن دَرَجَته متوسطة بَين الدرجتين وَكَأَنَّهُ مركب من بهيمية وملكية والأغلب عَلَيْهِ فِي بداية أمره البهيمية إِذْ لَيْسَ لَهُ أَولا من الْإِدْرَاك إِلَّا الْحَواس الَّتِي يحْتَاج فِي الْإِدْرَاك بهَا إِلَى طلب الْقرب من المحسوس بالسعي وَالْحَرَكَة إِلَى أَن يشرق عَلَيْهِ بِالآخِرَة نور الْعقل<\/p>\n<p>As for the human being, his degree is midway between two degrees, as if he were composed of animalistic and angelic natures. The animalistic nature predominates at the beginning of his life, since his perception is only by senses which require by his perception to exert effort and movement in seeking nearness to what he senses, until later on the light of reason dawns upon him.<\/p>\n<p>Source: al-Maqṣad al-Asnā 1\/48<\/p><\/blockquote>\n<p>Reason, however, is not infallible, nor is it sufficient in itself as a guide for all things. Our minds have a limit to what they can comprehend or perceive, in the same way our eyes have a limit to what they can see and our ears have a limit to how distantly they can hear.<\/p>\n<p>Al-Shafi’I, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إن للعقل حدّاً ينتهي إليه كما أن للبصر حدّاً ينتهي إليه<\/p>\n<p>Verily, the mind has a limit at which it ends, just as eyesight has a limit at which it ends.<\/p>\n<p>Source: Manāqib al-Shāfiʻī lil-Bayhaqī 1\/280<\/p><\/blockquote>\n<p>Reason must be complemented by guidance from divine revelation, as Allah knows us better than we know ourselves. People have a tendency to rationalize their bad behavior, so guidance from Allah and His Prophets provide us with guardrails to keep our reason upon the straight path and within the limits of decency.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْلَم أَن الْعقل لن يَهْتَدِي إِلَّا بِالشَّرْعِ وَالشَّرْع لم يتَبَيَّن إِلَّا بِالْعقلِ فالعقل كالأس وَالشَّرْع كالبناء وَلنْ يُغني أس مَا لم يكن بِنَاء وَلنْ يثبت بِنَاء مَا لم يكن أس وَأَيْضًا فالعقل كالبصر وَالشَّرْع كالشعاع وَلنْ يُغني الْبَصَر مَا لم يكن شُعَاع من خَارج وَلنْ يُغني الشعاع مَا لم يكن بصر &#8230; وَأَيْضًا فالعقل كالسراج وَالشَّرْع كالزيت الَّذِي يمده فَمَا لم يكن زَيْت لم يحصل السراج وَمَا لم يكن سراج لم يضىء الزَّيْت وعَلى هَذَا نبه الله سُبْحَانَهُ بقوله تَعَالَى الله نور السَّمَوَات وَالْأَرْض إِلَى قَوْله نور على نور فالشرع عقل من خَارج وَالْعقل شرع من دَاخل وهما متعاضدان بل متحدان<\/p>\n<p>Know that reason cannot be guided except by the Law, and the Law cannot be clarified except by reason. Reason is like a foundation and the Law is like a building. The foundation by itself is not enough without the building, and the building cannot stand without the foundation. Also, reason is like eyesight and the Law is like a ray of light. Eyesight is not enough without a ray of light from outside, and a ray of light is not enough without eyesight… Also, reason is like a lamp and the Law is like oil which burns within it. Oil is not anything if it does not have the lamp, and the lamp is not anything without oil to illuminate it. For this reason, Allah Almighty informed us in His saying, “<strong>Allah is the Light of the heavens and the earth<\/strong>,” up to His saying, “<strong>Light upon light<\/strong>.” Thus, the Law is reason from the outside and reason is law from the inside. They both reinforce each other. Rather, they are united.<\/p>\n<p>Source: Ma&#8217;ārij al-Quds 1\/57<\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهكذا المؤمن قلبه مضيئ يكاد يعرف الحق بفطرته وعقله ولكن لا مادة له من نفسه فجاءت مادة الوحي فباشرت قلبه وخالطت بشاشته فازداد نوراً بالوحي على نوره الذي فطره الله تعالى عليه فاجتمع له نور الوحي إلى نور الفطرة نور على نور<\/p>\n<p>Likewise, the heart of the believer is illuminated such that he nearly recognizes the truth by his pure nature and reason alone, but he has no fuel by himself. The fuel comes in the form of revelation, giving glad tidings to his heart and mixing with his radiance. Thus, the light of revelation is added to the light upon which Allah Almighty constituted him. The light of revelation is combined with the light of his pure nature, “<strong>Light upon light<\/strong>.”<\/p>\n<p>Source: al-Wābil al-Ṣayyib 1\/53<\/p><\/blockquote>\n<p>Reason is essential because it is through our minds that we recognize the validity of divine revelation. The only way to be sure the message of the Prophets is authentic is to evaluate them according to sound reason. We will find that their teachings are wise and rationally justified.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قِيلَ لِبَعْضِ الْأَعْرَابِ وَقَدْ أَسْلَمَ لَمَّا عَرَفَ دَعْوَتَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَيِّ شَيْءٍ أَسْلَمْتَ وَمَا رَأَيْتَ مِنْهُ مِمَّا دَلَّكَ عَلَى أَنَّهُ رَسُولُ اللَّهِ قَالَ مَا أَمَرَ بِشَيْءٍ فَقَالَ الْعَقْلُ لَيْتَهُ نَهَى عَنْهُ وَلَا نَهَى عَنْ شَيْءٍ فَقَالَ الْعَقْلُ لَيْتَهُ أَمَرَ بِهِ وَلَا أَحَلَّ شَيْئًا فَقَالَ الْعَقْلُ لَيْتَهُ حَرَّمَهُ وَلَا حَرَّمَ شَيْئًا فَقَالَ الْعَقْلُ لَيْتَهُ أَبَاحَهُ<\/p>\n<p>It was said to one of the Bedouins who embraced Islam, when he recognized the call of the Prophet, peace and blessings be upon him, “What made you become a Muslim? What did you see in him that told you he is the Messenger of Allah?” The Bedouin said, “The Prophet did not command anything that my reason said should be prohibited. He did not prohibit anything that my reason said should be commanded. He did not allow anything that my reason said should be forbidden. And he did not forbid anything that my reason said should be allowed.<\/p><\/blockquote>\n<p>Ibn al-Qayyim continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَانْظُرْ إِلَى هَذَا الْأَعْرَابِيِّ وَصِحَّةِ عَقْلِهِ وَفِطْرَتِهِ وَقُوَّةِ إِيمَانِهِ وَاسْتِدْلَالِهِ عَلَى صِحَّةِ دَعْوَتِهِ بِمُطَابَقَةِ أَمْرِهِ لِكُلِّ مَا حَسُنَ فِي الْعَقْلِ<\/p>\n<p>Look at this Bedouin, his sound mind and his pure nature, the strength of his faith, and his conclusion that the authenticity of the Prophet’s call is due to its correspondence with everything the mind knows is good.<\/p>\n<p>Source: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/10\/25\/ibn-qayyim-reason-nature\/\">Madārij al-Sālikīn 1\/250<\/a><\/p><\/blockquote>\n<p>So it is that Allah created light within every human being as part of their pure nature. Then, Allah sent Prophets to complete and perfect the light of their pure nature. Whoever accepts the light of His Prophets will be guided to eternal felicity in the Hereafter, and whoever corrupts their pure nature by worldly desires and rejects His light will be led astray forever.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ خَلْقَهُ فِي ظُلْمَةٍ فَأَلْقَى عَلَيْهِمْ مِنْ نُورِهِ فَمَنْ أَصَابَهُ مِنْ ذَلِكَ النُّورِ اهْتَدَى وَمَنْ أَخْطَأَهُ ضَلَّ<\/p>\n<p><strong>Verily, Allah Almighty created His creation in darkness and He cast over them His light. Whoever is touched by that light is guided, and whoever misses it is led astray.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2642, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/04\/05\/pens-dried-qadr-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Qayyim comments on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهذا النور الذي ألقاه عليهم سبحانه وتعالى هو الذي أحياهم وهداهم فأصابت الفطرة منه حظها ولكن لما لم يستقل بتمامه وكماله أكمله لهم وأتمه بالروح الذي ألقاه على رسله عليهم الصلاة والسلام والنور الذي أوحاه إليهم فأدركته الفطرة بذلك النور السابق الذي حصل لها يوم إلقاء النور فانضاف نور الوحي والنبوة إلى نور الفطرة نور على نور<\/p>\n<p>This is light which He, Glory be to Him Almighty, casts over one, giving them life and guidance. The pure nature receives a share of it, but it is not complete by itself. Its perfection and completion are achieved for them by the spirit, which He cast upon His messengers, blessings and peace be upon them. The light which He inspired in them reaches the pure nature, by that preceding light which it acquired on the day the light was cast. The light of revelation and prophecy are added to the light of pure nature, “<strong>Light upon light<\/strong>.”<\/p>\n<p>Source: al-Wābil al-Ṣayyib 1\/61<\/p><\/blockquote>\n<p>In sum, reason and revelation are two sources of guidance that depend upon one another. Reason is needed to acknowledge the validity of revelation, and revelation is need to strengthen the weaknesses of reason. Reason is further required to clarify aspects of the Law and properly apply its timeless principles to the peculiarities of new situations.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Light upon light,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[20,184,32,41,50,56,372,486,301,148],"class_list":["post-22796","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-creation-al-khalq","tag-guidance-al-hidaya","tag-hereafter-akhirah","tag-imam-al-shafii","tag-knowledge","tag-monotheism-tawheed","tag-allah-names-asma-ul-husna","tag-parables-al-amthal","tag-pure-nature-fitrah","tag-reason-al-aql"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5VG","jetpack-related-posts":[{"id":15166,"url":"https:\/\/www.abuaminaelias.com\/love-in-the-quran-and-sunnah\/","url_meta":{"origin":22796,"position":0},"title":"Love in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 7, 2014","format":false,"excerpt":"\"The believers are only brothers,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20537,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-keeping-good-company-avoiding-bad-company\/","url_meta":{"origin":22796,"position":1},"title":"Imam al-Mundhiri on Keeping Good Company, Avoiding Bad Company","author":"Abu Amina Elias","date":"June 22, 2019","format":false,"excerpt":"\"Best gatherings make room for the most people.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23070,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-recitation-quran\/","url_meta":{"origin":22796,"position":2},"title":"Imam al-Mundhiri on Reciting the Quran","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20478,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-love-for-sake-of-allah\/","url_meta":{"origin":22796,"position":3},"title":"Imam al-Mundhiri on Love for the Sake of Allah","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"They are the allies of Allah, upon whom there is no fear or grief.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13567,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-salat-salah-salawat\/","url_meta":{"origin":22796,"position":4},"title":"Imam al-Nawawi on Five Daily Prayers","author":"Abu Amina Elias","date":"May 19, 2013","format":false,"excerpt":"\"The parable of the five prayers is that of a river running...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13539,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-the-virtue-of-reading-the-quran\/","url_meta":{"origin":22796,"position":5},"title":"Imam al-Nawawi on Reading and Reciting the Quran","author":"Abu Amina Elias","date":"May 16, 2013","format":false,"excerpt":"\"The best of you are those who learn the Quran and teach it.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22796","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22796"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22796\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22796"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22796"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22796"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}