{"id":22840,"date":"2021-02-14T14:26:57","date_gmt":"2021-02-14T10:26:57","guid":{"rendered":"https:\/\/abuaminaelias.com\/?p=22840"},"modified":"2021-02-14T14:51:56","modified_gmt":"2021-02-14T10:51:56","slug":"held-accountable-thoughts","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/held-accountable-thoughts\/","title":{"rendered":"Are we held accountable for our thoughts?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>All of us will experience involuntary thoughts, unwanted thoughts, and evil suggestions that originate from Satan or the ego. We will also engage thoughts within ourselves as deliberate and voluntary acts of the heart and mind. To what extent are we held accountable to Allah for these thoughts?<\/p>\n<p>The occurrence of initial involuntary thoughts (<em>khawatir<\/em>) are forgiven by Allah according to the authentic Sunnah and the consensus of Muslim scholars, as long as we do not act upon these thoughts or speak of them aloud.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ تَجَاوَزَ لِأُمَّتِي مَا حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ يَتَكَلَّمُوا أَوْ يَعْمَلُوا بِهِ<\/p>\n<p><strong>Verily, Allah has pardoned my nation for what occurs within themselves, as long as they do not speak of it or act upon it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6664, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/09\/allah-forgives-bad-thoughts\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The meaning of “what occurs within themselves” are these involuntary thoughts that begin as suggestions from Satan or the ego. We are not held accountable or harmed by these thoughts if we do not allow them to settle within ourselves.<\/p>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الطَّحَاوِيُّ وَأَهْلُ اللُّغَةِ يُرِيدُونَ بِغَيْرِ اخْتِيَارِهَا كَمَا قَالَ اللَّهُ تَعَالَى وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ والله اعلم<\/p>\n<p>Al-Tahawi and the scholars of language said that what is intended are thoughts without choice, as Allah Almighty said: <strong>We know what his soul whispers to him<\/strong> (50:16). Allah knows best.<\/p>\n<p>Source: Ṣaḥīḥ Muslim bi-Sharḥ al-Nawawī 127<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال العلماء المراد به الخواطر التي لا تستقرّ<\/p>\n<p>The scholars said what is intended are initial thoughts which are not settled.<\/p>\n<p>Source: al-Adhkār 1\/345<\/p><\/blockquote>\n<p>We will surely experience evil suggestions from Satan or whimsical desires from the ego that tempt us to disobey Allah and commit sins. Part of the test of this life is being able to choose which thoughts we act upon or ignore.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ وُرُودَ الْخَاطِرِ لَا يَضُرُّ وَإِنَّمَا يَضُرُّ اسْتِدْعَاؤُهُ وَمُحَادَثَتُهُ فَالْخَاطِرُ كَالْمَارِّ عَلَى الطَّرِيقِ فَإِنْ تَرَكْتَهُ مَرَّ وَانْصَرَفَ عَنْكَ<\/p>\n<p>Know that passing thoughts are not harmful. Indeed, they are only harmful if they are sought after and engaged. For a thought is like a passerby on the road; if you ignore him, he will depart from you.<\/p>\n<p>Source: al-Jawāb al-Kāfī 1\/157<\/p><\/blockquote>\n<p>Hence, the correct method to deal with bad initial thoughts is not to engage or try to suppress them, but rather to remember Allah and redirect our minds to more beneficial cognitions, as if these thoughts were bystanders along the road. If we stop to talk to them, they will remain in our minds, but if we move onto better thoughts, they will be left behind.<\/p>\n<p>Perhaps the best example of these types of thoughts is what scholars refer to as “backbiting with the heart” (<em>al-ghibah bil-qalb<\/em>). As we know, it is forbidden to express bad assumptions about other Muslims outwardly with words, but it is also forbidden to speak to ourselves inwardly in a way that engages these thoughts containing bad assumptions.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ<\/p>\n<p><strong>O you who have faith, avoid much assumption for some assumption is sinful.<\/strong><\/p>\n<p>Surat al-Hujurat 49:12<\/p><\/blockquote>\n<p>Assumption in this verse is a conscious, voluntary thought that we unjustly hold about another person. It begins as an initial involuntary prompting but then we choose whether or not to engage this thought. The mental processes of thinking (<em>fikr<\/em>) and talking to ourselves (<em>hadith al-nafs<\/em>) are intentional actions of the heart. As such, Allah holds us accountable for these thoughts if we allow them to settle inside ourselves by indulging them.<\/p>\n<p>Al-Nawawi explains this principle, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعلم أن سوء الظنّ حرام مثل القول فكما يحرم أن تحدّث غيرك بمساوئ إنسان يحرم أن تحدّث نفسك بذلك وتسئ الظنّ به &#8230; فأما الخواطر وحديث النفس إذا لم يستقرَّ ويستمرّ عليه صاحبُه فمعفوٌ عنه باتفاق العلماء لأنه لا اختيارَ له في وقوعه ولا طريقَ له إلى الانفكاك عنه<\/p>\n<p>Know that bad assumptions are forbidden the same as words, for just as it is forbidden to speak about another person in an evil manner, it is forbidden to speak to yourself with that and to cultivate bad assumptions… As for initial thoughts and suggestions of the ego, if they are not settled or elongated by their owner, they are forgiven by the consensus of the scholars, as he had no choice in their occurrence and no way to detach himself from them.<\/p>\n<p>Source: al-Adhkār 1\/344-345<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قالوا وسواءٌ كان ذلك الخاطِرُ غِيبة أو كفراً أو غيرَه فمن خطرَ له الكفرُ مجرّد خَطَرٍ من غير تعمّدٍ لتحصيله ثم صَرفه في الحال فليس بكافر ولا شئ عليه<\/p>\n<p>The scholars said whether an initial thought was backbiting, or unbelief, or otherwise, whoever experiences unbelief merely as an initial thought without deliberately acquiring it and then he divests himself of that state, he is not an unbeliever and there is nothing held against him.<\/p>\n<p>Source: al-Adhkār 1\/345<\/p><\/blockquote>\n<p>In general, any statement that would be forbidden to say out loud is forbidden to say to yourself in your heart, whether it is a thought containing envy, malice, greed, lust, or any other blameworthy characteristic. Such negative statements we make to ourselves are damaging and poisonous to our souls, for they will eventually transform into outward actions.<\/p>\n<p>The truth is that every human being is influenced by thoughts from an angel, a devil, or the ego. The angel prompts us to perform good deeds and acts of obedience to Allah, the devil prompts us to perform evil deeds and acts of disobedience to Allah, and the ego prompts us to satisfy the whims, desires, and lusts of the animalistic part of our souls.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلشَّيْطَانِ لَمَّةً بِابْنِ آدَمَ وَلِلْمَلَكِ لَمَّةً فَأَمَّا لَمَّةُ الشَّيْطَانِ فَإِيعَادٌ بِالشَّرِّ وَتَكْذِيبٌ بِالحَقِّ وَأَمَّا لَمَّةُ الْمَلَكِ فَإِيعَادٌ بِالخَيْرِ وَتَصْدِيقٌ بِالحَقِّ فَمَنْ وَجَدَ ذَلِكَ فَلْيَعْلَمْ أَنَّهُ مِنَ اللهِ فَلْيَحْمَدِ اللَّهَ وَمَنْ وَجَدَ الأُخْرَى فَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ<\/p>\n<p><strong>Verily, Satan has influence with the son of Adam and the angel has influence. As for the influence of Satan, he promises evil and denies the truth. As for the influence of the angel, he promises goodness and affirms the truth. Whoever finds this goodness, let him know that it is from Allah and let him praise Allah. Whoever finds something else, let him seek refuge in Allah from the accursed Satan.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2988, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/08\/14\/waswas-angels-devils\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In order to succeed, we must learn to expand the space for angels to enter our hearts and restrict the space for devils to enter it. Part of this is training the mind to notice and evaluate initial thoughts as they occur, then pursue or ignore them as is appropriate. For just as angels refuse to enter a house in which is an undomesticated dog, how could they enter a heart that is cluttered by evil thoughts?<\/p>\n<p>Be aware that one who experiences suggestions from the devil should seek refuge in Allah by not giving attention to the evil suggestion directly. Engaging this evil thought or trying to suppress it actually makes it stronger. Instead, one must learn to refocus themselves on Allah and other beneficial cognitions.<\/p>\n<p>Ibn Taymiyyah explains this concept with a parable, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إذا هاش عليك كلب الغنم فلا تشتغل بمحاربته ومدافعته وعليك بالراعي فاستغث به فهو يصرف عنك الكلب ويكفيكه<\/p>\n<p>If the shepherd’s dog troubles you, do not busy yourself warring and defending against it. You must appeal to the shepherd, who will direct the dog away from you and suffice you.<\/p>\n<p>Source: Asrār al-Ṣalāt li-Ibn al-Qayyim 1\/76<\/p><\/blockquote>\n<p>In other words, do not fight against evil thoughts or give them attention, but rather restore your presence of heart with Allah and center your mindfulness upon Him.<\/p>\n<p>The ability to distinguish between the prompting of devils and the prompting of angels is an essential aspect of the esoteric sciences of Islam. Through prayer, meditation, reflection, and seeking this knowledge from the righteous predecessors, a believer can acquire this skill of cultivating positive thoughts and disregarding evil thoughts as a means to purify the heart.<\/p>\n<p>In fact, these matters of the heart and mind are the pinnacle of all religious knowledge, as every outward aspect of Islam is intended to serve the internal reformation of the believers. The scholars refer to this knowledge as “unveiling” (<em>mukashafah<\/em>), because through it one can lift the barriers that prevent us from seeing Reality as it is.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">علم المكاشفة وهو علم الباطن وذلك غاية العلوم فقد قال بعض العارفين من لم يكن له نصيب من هذا العلم أخاف عليه سوء الخاتمة &#8230; ومعرفة القلب وكيفية تصادم جنود الملائكة والشياطين فيه ومعرفة الفرق بين لمة الملك ولمة الشيطان<\/p>\n<p>The knowledge of unveiling is the internal science, which is the culmination of all sciences. Some of the gnostics said: I fear an evil ending for one who has no share of this knowledge… It is the realization of the heart and the modality by which the legions of angels and devils clash within it, and the realization of the difference between the troop of angels and the troop of devils.<\/p>\n<p>Source: Iḥyā’ ‘Ulūm al-Dīn 1\/19-20<\/p><\/blockquote>\n<p>In sum, there is an important distinction between involuntary thoughts from Satan or the ego and voluntary thoughts we choose to cultivate within ourselves. The key to spiritual success is to train ourselves to notice and pursue positive thoughts from the angels, and to notice and ignore negative thoughts from Satan or the ego. This ability is the fruit of all Islamic sciences and it is an invaluable means of purifying our hearts in preparation for our inevitable meeting with Allah.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Allah has pardoned my nation for what occurs within themselves&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[122,384,16,165,288,105,26,349,50,311,100,470,84,400,66,68,98],"class_list":["post-22840","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-angels-malaikah","tag-backbiting-al-ghibah","tag-character-akhlaq","tag-consensus-al-ijma","tag-desires-shahawat","tag-envy-al-hasad","tag-forgiveness-al-maghfirah","tag-good-assumption-husn-al-dhann","tag-knowledge","tag-malice-hiqd","tag-manners-al-adab","tag-mindfulness-muraqabah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-refuge-al-taawwudh","tag-remembrance-dhikr","tag-satan-al-shaytan","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Wo","jetpack-related-posts":[{"id":21642,"url":"https:\/\/www.abuaminaelias.com\/how-to-achieve-mindfulness-in-islam\/","url_meta":{"origin":22840,"position":0},"title":"How to achieve mindfulness in Islam","author":"Abu Amina Elias","date":"February 2, 2020","format":false,"excerpt":"\"Whoever is mindful of Allah Almighty in his thoughts, Allah will protect him in his limbs.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21680,"url":"https:\/\/www.abuaminaelias.com\/understanding-the-soul-in-islam\/","url_meta":{"origin":22840,"position":1},"title":"Understanding the soul in Islam","author":"Abu Amina Elias","date":"February 13, 2020","format":false,"excerpt":"\"Whoever knows himself, knows his Lord.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18213,"url":"https:\/\/www.abuaminaelias.com\/positive-thinking-in-islam\/","url_meta":{"origin":22840,"position":2},"title":"Positive thinking and optimism in Islam","author":"Abu Amina Elias","date":"June 4, 2016","format":false,"excerpt":"\"I am as my servant expects Me and I am with him as he remembers Me.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":24261,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-muraqaba\/","url_meta":{"origin":22840,"position":3},"title":"Forty Hadith on Mindfulness","author":"Abu Amina Elias","date":"October 3, 2024","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21630,"url":"https:\/\/www.abuaminaelias.com\/mindfulness-in-the-quran-and-sunnah\/","url_meta":{"origin":22840,"position":4},"title":"Mindfulness in the Quran and Sunnah","author":"Abu Amina Elias","date":"January 28, 2020","format":false,"excerpt":"\"Verily, Allah is ever watchful over you.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15209,"url":"https:\/\/www.abuaminaelias.com\/beware-of-satan-and-the-idol-of-desire\/","url_meta":{"origin":22840,"position":5},"title":"Beware of the satanic idol of desire","author":"Abu Amina Elias","date":"January 11, 2014","format":false,"excerpt":"\"Have you seen the one who takes his own desire as his god? Then would you be responsible for him?\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22840","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=22840"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/22840\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=22840"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=22840"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=22840"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}