{"id":23006,"date":"2021-04-19T12:45:43","date_gmt":"2021-04-19T08:45:43","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23006"},"modified":"2025-03-17T11:43:26","modified_gmt":"2025-03-17T07:43:26","slug":"forty-hadith-on-ramadan","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-ramadan\/","title":{"rendered":"Forty Hadith on Ramadan"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p><strong><u>Beginning of Ramadan<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">‏إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ السَّمَاءِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِين‏<\/p>\n<p><strong>When the month of Ramadan begins, the gates of the heaven are opened, the gates of Hellfire are closed, and the devils are chained.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1899, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/03\/gates-heaven-open-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Talhah ibn ‘Ubayd reported: Whenever the Messenger of Allah, peace and blessings be upon him, saw the crescent moon, he would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ<\/p>\n<p><strong>O Allah, bring it over us with blessings and faith, safety and Islam. My Lord and your Lord is Allah<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3451, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/03\/16\/new-moon-faith-salaam-iman\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ وَالتَّوْفِيقِ لِمَا تُحِبُّ وَتَرْضَى رَبُّنَا وَرَبُّكَ اللَّهُ<\/p>\n<p><strong>O Allah, bring it over us with safety and faith, security and Islam, guidance to what You love and is pleasing to You. Our Lord and your Lord is Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 888, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/16\/dua-seeing-crescent-moon\/\"><em><strong>Sahih li ghayrihi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said when the month of Ramadan began:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذَا الشَّهْرَ قَدْ حَضَرَكُمْ وَفِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ مَنْ حُرِمَهَا فَقَدْ حُرِمَ الْخَيْرَ كُلَّهُ وَلَا يُحْرَمُ خَيْرَهَا إِلَّا مَحْرُومٌ<\/p>\n<p><strong>Verily, this month has presented itself to you. There is a night within it that is better than a thousand months. Whoever is deprived of it has been deprived of all good. None is deprived of its good but that he is truly deprived.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 1644, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/laylat-al-qadar-thousand-months\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said when the month of Ramadan arrived:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ جَاءَكُمْ رَمَضَانُ شَهْرٌ مُبَارَكٌ افْتَرَضَ اللَّهُ عَلَيْكُمْ صِيَامَهُ تُفْتَحُ فِيهِ أَبْوَابُ الْجَنَّةِ وَيُغْلَقُ فِيهِ أَبْوَابُ الْجَحِيمِ وَتُغَلُّ فِيهِ الشَّيَاطِينُ فِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ مَنْ حُرِمَ خَيْرَهَا قَدْ حُرِمَ<\/p>\n<p><strong>The month of Ramadan has come, a blessed month in which Allah Almighty has obligated you to fast. In it the gates of the heavens are opened, the gates of Hellfire are closed, the devils are chained, and in it is a night that is better than a thousand months. Thus, whoever is deprived of its good is truly deprived.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7148, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/24\/ramadan-blessed-mercy\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا كَانَ أَوَّلُ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ صُفِّدَتْ الشَّيَاطِينُ وَمَرَدَةُ الْجِنِّ وَغُلِّقَتْ أَبْوَابُ النَّارِ فَلَمْ يُفْتَحْ مِنْهَا بَابٌ وَفُتِّحَتْ أَبْوَابُ الْجَنَّةِ فَلَمْ يُغْلَقْ مِنْهَا بَابٌ وَيُنَادِي مُنَادٍ يَا بَاغِيَ الْخَيْرِ أَقْبِلْ وَيَا بَاغِيَ الشَّرِّ أَقْصِرْ وَلِلَّهِ عُتَقَاءُ مِنْ النَّارِ وَذَلكَ كُلُّ لَيْلَةٍ<\/p>\n<p><strong>On the first night of the month of Ramadan, the devils are chained and the jinn are restrained, the gates of Hellfire are closed and none of its gates are opened, the gates of Paradise are opened and none of its gates are closed, and a heavenly caller announces: O seeker of good, come near! O seeker of evil, stop short! Allah has those He saves from the Hellfire, and that is during every night.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 682, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/06\/27\/allah-saves-people-ramadan\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, would deliver a sermon when the month of Ramadan arrived, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا الشَّهْرُ الْمُبَارَكُ الَّذِي فَرَضَ اللهُ صِيَامَهُ وَلَمْ يَفْرِضْ قِيَامَهُ أَلَا إِنَّ الصِّيَامَ لَيْسَ مِنَ الطَّعَامِ وَالشَّرَابِ وَلَكِنْ مِنَ الْكَذِبِ وَالْبَاطِلِ وَاللَّغْوِ<\/p>\n<p>This is the blessed month in which Allah has obligated fasting and not obligated night prayers. Certainly, fasting is not merely from food and drink, but rather from lying, falsehood, and vain talk.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/ali-khutbah-ramadan\/\">al-Sunan al-Kubrá lil-Bayhaqī 7955<\/a><\/p><\/blockquote>\n<p><strong><u>Greatness of Ramadan<\/u><\/strong><\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ عَلَى أَنْ يُعْبَدَ اللَّهُ وَيُكْفَرَ بِمَا دُونَهُ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَحَجِّ الْبَيْتِ وَصَوْمِ رَمَضَانَ<\/p>\n<p><strong>Islam is built upon five: to worship Allah and to disbelieve in what is worshiped besides him, to establish prayer, to give charity, to perform Hajj pilgrimage to the house, and to fast the month of Ramadan<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 8, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/17\/five-pillars-of-islam\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: A bedouin came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, show me a deed by which I may enter Paradise.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ الْمَكْتُوبَةَ وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ وَتَصُومُ رَمَضَانَ<\/p>\n<p><strong>Worship Allah and never associate anything with Him, establish the prescribed prayers, give the obligatory charity, and fast of the month of Ramadan.<\/strong><\/p><\/blockquote>\n<p>The man said, “By Him in whose hand is my soul, I will never add anything to it, nor will I lessen anything from it.” When the man turned his back, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا<\/p>\n<p><strong>Whoever is pleased to see a man from the people of Paradise, let him look at this one.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1397, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/27\/essentials-pillars-islam\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Amr ibn Murrah reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “O Messenger of Allah, what do you think if I testify there is no God but Allah and you are the Messenger of Allah, I perform the five prayers, I pay the obligatory alms, I fast the month of Ramadan and stand for prayer in it. Among whom will I be?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنَ الصِّدِّيقِينَ وَالشُّهَدَاءِ<\/p>\n<p><strong>Among the truthful and the martyrs.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3492, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/ramadan-truthful-and-martyrs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: There were two men from the tribe of Quda’ah who embraced Islam with the Messenger of Allah, peace and blessings be upon him. One of them was martyred and the other lived for another year. Talha said, “I had a dream of Paradise and I saw the one who lived longer enter Paradise before the martyr. I was amazed by that and when I woke up, I mentioned it to the Prophet.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَيْسَ قَدْ صَامَ بَعْدَهُ رَمَضَانَ وَصَلَّى سِتَّةَ آلَافِ رَكْعَةٍ أَوْ كَذَا وَكَذَا رَكْعَةً صَلَاةَ السَّنَةِ<\/p>\n<p style=\"text-align: left;\"><strong>Did he not fast the month of Ramadan after him? And he performed six thousand or so bowings in prayer throughout the year?<\/strong><\/p>\n<p>Source: Musnad Aḥmad 8399, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/04\/22\/long-life-good-deeds\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu al-Muntafiq reported: I said, “O Messenger of Allah, teach me what will save me from the punishment of Allah and admit me into Paradise.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْبُدِ اللَّهَ وَلا تُشْرِكْ بِهِ شَيْئًا وَأَقِمِ الصَّلاةَ الْمَكْتُوبَةَ وَأَدِّ الزَّكَاةَ الْمَفْرُوضَةَ وَحُجَّ وَاعْتَمِرْ وَصُمْ رَمَضَانَ وَانْظُرْ مَا تُحِبُّ لِلنَّاسِ أَنْ يَأْتُوهُ إِلَيْكَ فَافْعَلْهُ بِهِمْ وَمَا تَكْرَهُ أَنْ يَأْتُوهُ إِلَيْكَ فَذَرْهُمْ مِنْهُ<\/p>\n<p><strong>Worship Allah and do not associate anything with Him, establish the prescribed prayers, give the obligatory charity, perform the Hajj and Umrah pilgrimages, and fast the month of Ramadan. Look at the way you would love people to treat you and do so to them, and whatever you would hate for them to do to you, spare them of it.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 19\/210, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/29\/treat-people-as-you-like-to-be-treated\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said in his farewell sermon:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقُوا اللَّهَ رَبَّكُمْ وَصَلُّوا خَمْسَكُمْ وَصُومُوا شَهْرَكُمْ وَأَدُّوا زَكَاةَ أَمْوَالِكُمْ وَأَطِيعُوا ذَا أَمْرِكُمْ تَدْخُلُوا جَنَّةَ رَبِّكُمْ<\/p>\n<p><strong>Fear Allah your Lord, pray your five prayers, fast your month of Ramadan, give charity from your wealth, and obey those in authority over you. You will enter the Paradise of your Lord<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 616, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/fear-allah-pray-obey-leaders\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا صَلَّتِ الْمَرْأَةُ خُمُسَهَا وَصَامَتْ شَهْرَهَا وَحَصَّنَتْ فَرْجَهَا وَأَطَاعَتْ بَعْلَهَا دَخَلَتْ مِنْ أَيِّ أَبْوَابِ الْجَنَّةِ شَاءَتْ<\/p>\n<p><strong>If a woman prays her five prayers, fasts her month of Ramadan, guards her chastity, and obeys her husband, she will enter Paradise from any gate she wishes.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 4163, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/08\/wife-does-duty-enters-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَمْسٌ مَنْ جَاءَ بِهِنَّ مَعَ إِيمَانٍ دَخَلَ الْجَنَّةَ مَنْ حَافَظَ عَلَى الصَّلَوَاتِ الْخَمْسِ عَلَى وُضُوئِهِنَّ وَرُكُوعِهِنَّ وَسُجُودِهِنَّ وَمَوَاقِيتِهِنَّ وَصَامَ رَمَضَانَ وَحَجَّ الْبَيْتَ إِنْ اسْتَطَاعَ إِلَيْهِ سَبِيلًا وَأَعْطَى الزَّكَاةَ طَيِّبَةً بِهَا نَفْسُهُ وَأَدَّى الْأَمَانَةَ<\/p>\n<p><strong>Whoever comes with five deeds, along with faith, will enter Paradise: one who preserves the five prayers, their ablution, their bowings, their prostrations, and their timings, who fasts the month of Ramadan, who performs Hajj pilgrimage to the House if he can find the means, who gives charity with a cheerful soul, and one who fulfills the trust.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 429, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/01\/27\/five-deeds-to-enter-jannah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الإِسْلامُ أَنْ تَعْبُدَ اللَّهَ وَلا تُشْرِكَ بِهِ شَيْئًا وَتُقِيمَ الصَّلاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْيُ عَنِ الْمُنْكَرِ وَتَسْلِيمُكَ عَلَى أَهْلِكَ فَمَنِ انْتَقَصَ شَيْئًا مِنْهُنَّ فَهُوَ سَهْمٌ فِي الإِسْلامِ يَدَعُهُ وَمَنْ تَرَكَهُنَّ كُلَّهُنَّ فَقَدْ وَلَّى الإِسْلامَ ظَهْرَهُ<\/p>\n<p><strong>Islam is to worship Allah without associating a partner with Him, to establish prayer, to give charity, to fast the month of Ramadan, to perform pilgrimage to the House, to enjoin good and forbid evil, and to greet your people with peace. Whoever neglects anything from them has abandoned a part of Islam, and whoever neglects all of them has thrown Islam behind his back.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān lil-Bayhaqī 8844, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/26\/neglect-part-islam\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>Forgiveness and Reward in Ramadan<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ مَا بَيْنَهُنَّ مَا اجْتُنِبَتْ الْكَبَائِرُ<\/p>\n<p><strong>The five prayers, Friday to Friday, and Ramadan to Ramadan will be expiation for the sins between them, so long as major sins are avoided.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 233, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/09\/18\/prayer-fasting-ramadan-friday-expiate-sin\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ<\/p>\n<p><strong>Whoever fasts the month of Ramadan due to faith and seeking reward, his previous sins will be forgiven. Whoever stands in prayer during the Night of Decree due to faith and seeking reward, his previous sins will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1901, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/18\/siyam-salat-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, encouraged standing for night prayer in the month of Ramadan, without imposing it on them. The Prophet would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ<\/p>\n<p><strong>Whoever stands in prayer during Ramadan due to faith and seeking reward, his previous sins will be forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2009, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/08\/01\/qiyam-al-layl-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ رَمَضَانَ وَعَرَفَ حُدُودَهُ وَتَحَفَّظَ مِمَّا كَانَ يَنْبَغِي لَهُ أَنْ يَتَحَفَّظَ فِيهِ كَفَّرَ مَا قَبْلَهُ<\/p>\n<p><strong>Whoever fasts the month of Ramadan, acknowledging its limits and guarding it as it should be, then it will expiate the sins which came before it.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 11310, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/15\/ramadan-expiation\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abdur Rahman ibn Awf reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ رَمَضَانَ شَهْرٌ افْتَرَضَ اللَّهُ عَزَّ وَجَلَّ صِيَامَهُ وَإِنِّي سَنَنْتُ لِلْمُسْلِمِينَ قِيَامَهُ فَمَنْ صَامَهُ إِيمَانًا وَاحْتِسَابًا خَرَجَ مِنْ الذُّنُوبِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ<\/p>\n<p><strong>Verily, Ramadan is a month in which Allah Almighty has obligated its fasting. I have instituted for Muslims the<\/strong> <strong>practice of prayer at night. Thus, whoever fasts it with faith and expecting reward will be rid of sins like the day he was born from his mother.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 1688, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/06\/05\/fast-ramadan-sins-forgiven\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ عُتَقَاءَ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ يعني في رمضان لِكُلِّ عَبْدٍ مِنْهُمْ دَعْوَةٌ مُسْتَجَابَةٌ<\/p>\n<p><strong>Verily, Allah has people He redeems in every day and night of Ramadan, and every servant among them has a supplication that will be answered.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7450, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/every-muslim-dua-ramadan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ مَنْ قَامَ مَعَ الإِمَامِ يعنى في رمضان حَتَّى يَنْصَرِفَ كُتِبَ لَهُ قِيَامُ لَيْلَةٍ<\/p>\n<p><strong>Verily, whoever stands for prayer in Ramadan with the Imam until he is finished, it will be recorded as if he prayed the entire night.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 806, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/05\/09\/taraweeh-ramadan-imam-salat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ عُمْرَةً فِي رَمَضَانَ حَجَّةٌ<\/p>\n<p><strong>Verily, the Umrah pilgrimage during Ramadan is equal to Hajj<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1782, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/07\/ramadan-umrah-hajj\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>Reciting the Quran in Ramadan<\/u><\/strong><\/p>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ النَّاسِ وَكَانَ أَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ وَكَانَ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ فَيُدَارِسُهُ القُرْآنَ فَلَرَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَجْوَدُ بِالخَيْرِ مِنَ الرِّيحِ المُرْسَلَةِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, was the most generous of people and he was even more generous in Ramadan when Gabriel would meet him. He would meet him every night of Ramadan to study the Quran. Thus, the Prophet would be more generous than a nourishing wind.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1902, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/05\/prophet-most-generous-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Fatimah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَسَرَّ إِلَيَّ إِنَّ جِبْرِيلَ كَانَ يُعَارِضُنِي الْقُرْآنَ كُلَّ سَنَةٍ مَرَّةً وَإِنَّهُ عَارَضَنِي الْعَامَ مَرَّتَيْنِ وَلَا أُرَاهُ إِلَّا حَضَرَ أَجَلِي<\/p>\n<p><strong>Gabriel would come to me to revise the Quran once every year. This year he revised with me twice. I do not think it means anything but that my term will come to an end.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3623, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/11\/ramadan-jibreel-quran-twice\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira, may Allah be pleased with him said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ يَعْرِضُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنَ كُلَّ عَامٍ مَرَّةً فَعَرَضَ عَلَيْهِ مَرَّتَيْنِ فِي الْعَامِ الَّذِي قُبِضَ فِيهِ وَكَانَ يَعْتَكِفُ كُلَّ عَامٍ عَشْرًا فَاعْتَكَفَ عِشْرِينَ فِي الْعَام الَّذِي قُبِضَ فِيهِ<\/p>\n<p>The Prophet, peace and blessings be upon him, would review the Quran once every year in Ramadan, and he reviewed it twice in the year he passed away. The Prophet would retreat in the mosque for ten days every year, and he secluded himself for twenty days in the year he passed away.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4998, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/11\/prophet-revises-quran-itikaf\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha, may Allah be pleased with her, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَعْلَمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحَ وَلَا صَامَ شَهْرًا كَامِلًا قَطُّ غَيْرَ رَمَضَانَ<\/p>\n<p>I have not known the Messenger of Allah, peace and blessings be upon him, to read the entire Quran in a single night, nor to spend the whole night in prayer until the morning, nor to spend an entire month in fasting, except during the month of Ramadan.<\/p>\n<p>Source: Sunan al-Nasā’ī 1641, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/07\/worship-all-night-in-ramadan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Wathila ibn al-Asqa’ reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُنْزِلَتْ صُحُفُ إِبْرَاهِيمَ عَلَيْهِ السَّلَام فِي أَوَّلِ لَيْلَةٍ مِنْ رَمَضَانَ وَأُنْزِلَتْ التَّوْرَاةُ لِسِتٍّ مَضَيْنَ مِنْ رَمَضَانَ وَالْإِنْجِيلُ لِثَلَاثَ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ وَأُنْزِلَ الْفُرْقَانُ لِأَرْبَعٍ وَعِشْرِينَ خَلَتْ مِنْ رَمَضَانَ<\/p>\n<p><strong>The scriptures of Abraham, upon him be peace, were revealed on the first night of Ramadan. The Torah was revealed after six nights of Ramadan had passed, the Gospel was revealed after thirteen nights of Ramadan had passed, and the Quran was revealed after twenty-four nights of Ramadan had passed.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16984, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/07\/09\/sacred-scriptures-revealed-ramadan\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><strong><u>Safeguarding the Fast<\/u><\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً<\/p>\n<p><strong>Take the pre-fasting meal, for surely there are blessings in the pre-fasting meal.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1923, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/eat-blessed-suhur\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, invited me to the pre-fasting meal during Ramadan and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ<\/p>\n<p><strong>Onward to the blessed meal!<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2344, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/10\/come-to-blessed-suhur\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Sahl ibn Sa’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ<\/p>\n<p><strong>People will continue in goodness as long as they hasten to break their fast.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1957, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/15\/hurry-to-break-fast\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ<\/p>\n<p><strong>Whoever does not leave evil words and deeds while fasting, Allah does not need him to leave food and drink<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1903, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/08\/06\/true-fasting-leave-bad-words\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَصْبَحَ أَحَدُكُمْ يَوْمًا صَائِمًا فَلَا يَرْفُثْ وَلَا يَجْهَلْ فَإِنْ امْرُؤٌ شَاتَمَهُ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي صَائِمٌ إِنِّي صَائِمٌ<\/p>\n<p><strong>When one of you wakes up in the morning for fasting, then he should not use obscene language or behave foolishly. If anyone abuses him or fights with him, he should say twice: Indeed, I am fasting.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1151, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/24\/fasting-bad-behavior-arguments\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الصِّيَامَ لَيْسَ مِنَ الأَكْلِ وَالشُّرْبِ فَقَطْ إِنَّمَا الصِّيَامُ مِنَ اللَّغُوِ وَالرَّفَثِ فَإِنْ سَابَّكَ أَحَدٌ أَوْ جَهِلَ عَلَيْكَ فَقُلْ إِنِّي صَائِمٌ<\/p>\n<p><strong>Verily, fasting is not only from eating and drinking. Rather, fasting is from vanity and obscenity. If someone abuses you or acts foolish against you, then say: Indeed, I am fasting.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3479, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/06\/23\/siyam-sawm-lies-obscenity-sins\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُسَابَّ وَأَنْتَ صَائِمٌ فَإِنْ سَابَّكَ أَحَدٌ فَقُلْ إِنِّي صَائِمٌ وَإِنْ كُنْتَ قَائِمًا فَاجْلِسْ<\/p>\n<p><strong>Do not insult anyone while you are fasting. If anyone insults you, then say: Indeed, I am fasting. If you are standing, then sit down.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Khuzaymah 1994, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2020\/04\/30\/do-not-insult-while-fasting\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, ascended the pulpit and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">آمِينَ آمِينَ آمِينَ<\/p>\n<p><strong>Amin, amin, amin<\/strong>.<\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, you ascended the pulpit and said amin, amin, amin.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ جِبْرِيلَ أَتَانِي فَقَالَ مَنْ أَدْرَكَ شَهْرَ رَمَضَانَ وَلَمْ يُغْفَرْ لَهُ فَدَخَلَ النَّارَ فَأَبْعَدَهُ اللَّهُ قُلْ آمِينَ فَقُلْتُ آمِينَ وَمَنْ أَدْرَكَ أَبَوَيْهِ أَوْ أَحَدَهُمَا فَلَمْ يَبَرَّهُمَا فَمَاتَ فَدَخَلَ النَّارَ فَأَبْعَدَهُ اللَّهُ قُلْ آمِينَ فَقُلْتُ آمِينَ وَمَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيْكَ فَمَاتَ فَدَخَلَ النَّارَ فَأَبْعَدَهُ اللَّهُ قُلْ آمِينَ فَقُلْتُ آمِينَ<\/p>\n<p><strong>Verily, Gabriel came to me and he said: Whoever reaches the month of Ramadan and he is not forgiven, then he will enter Hellfire and Allah will cast him far away, so say amin. I said amin. Whoever sees his parents in their old age, one or both of them, and he does not honor them and he dies, then he will enter Hellfire and Allah will cast him far away, so say amin. I said amin. Whoever has your name mentioned in his presence and he does not send blessings upon you and he dies, then he will enter Hellfire and Allah will cast him far away, so say amin. I said amin.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 907, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/07\/15\/ramadan-prophet-says-ameen-minbar\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَرَغِمَ أَنْفُ رَجُلٍ دَخَلَ عَلَيْهِ رَمَضَانُ ثُمَّ انْسَلَخَ قَبْلَ أَنْ يُغْفَرَ لَهُ<\/p>\n<p><strong>May he be humbled, who enters the month of Ramadan and it passes before he is forgiven. <\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3545, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/bless-prophet-ramadan-parents\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَسِيَ وَهُوَ صَائِمٌ فَأَكَلَ أَوْ شَرِبَ فَلْيُتِمَّ صَوْمَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ<\/p>\n<p><strong>Whoever eats or drinks forgetfully while he is fasting, let him complete his fast, for Allah has fed him and given him drink.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1933, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/24\/accidentally-break-fast-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَفْطَرَ فِي شَهْرِ رَمَضَانَ نَاسِيًا لا قَضَاءَ عَلَيْهِ وَلا كَفَّارَةَ<\/p>\n<p><strong>Whoever breaks his fast forgetfully in the month of Ramadan, there is no compensation or expiation for it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3521, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/05\/31\/accidental-no-make-up\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: A man came to the Messenger of Allah, peace and blessings be upon him, and he said, “I am ruined, O Messenger of Allah!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا أَهْلَكَكَ<\/p>\n<p><strong>What has ruined you?<\/strong><\/p><\/blockquote>\n<p>The man said, “I was intimate with my wife during Ramadan.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً<\/p>\n<p><strong>Can you find a slave to set free?<\/strong><\/p><\/blockquote>\n<p>The man said no. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ<\/p>\n<p><strong>Are you able to fast two months in a row?<\/strong><\/p><\/blockquote>\n<p>The man said no. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهَلْ تَجِدُ مَا تُطْعِمُ سِتِّينَ مِسْكِينًا<\/p>\n<p><strong>Can you find sixty poor people to feed?<\/strong><\/p><\/blockquote>\n<p>The man said no. Then the man sat down and someone came to the Prophet with a basket of dates. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَصَدَّقْ بِهَذَا<\/p>\n<p><strong>Give these dates in charity<\/strong>.<\/p><\/blockquote>\n<p>The man said, “Is there anyone poorer than us? There is no family between the two plains of Medina that is poorer than mine.” The Prophet laughed until we could see his back teeth and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اذْهَبْ فَأَطْعِمْهُ أَهْلَكَ<\/p>\n<p><strong>Go and feed your family<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1936, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/25\/fasting-expiation-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>Night of Decree (<em>Laylat al-Qadr<\/em>)<\/u><\/strong><\/p>\n<p>‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, came out to inform people about the Night of Decree in Ramadan, but two Muslim men were insulting each other. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي خَرَجْتُ لِأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ وَإِنَّهُ تَلَاحَى فُلَانٌ وَفُلَانٌ فَرُفِعَتْ وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ الْتَمِسُوهَا فِي السَّبْعِ وَالتِّسْعِ وَالْخَمْسِ<\/p>\n<p><strong>Verily, I have come out to tell you about the Night of Decree, but two men were insulting each other. Thus, its knowledge was taken away and perhaps it is better for you. Look for it during the seventh, ninth, or fifth night of the last ten nights.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 49, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/ramadan-knowledge-night-decree\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ يَعْنِي لَيْلَةَ الْقَدْرِ فَإِنْ ضَعُفَ أَحَدُكُمْ أَوْ عَجَزَ فَلَا يُغْلَبَنَّ عَلَى السَّبْعِ الْبَوَاقِي<\/p>\n<p><strong>Look for the Night of Decree in the last ten nights of Ramadan. If one of you is weak or unable, then do not be overcome by the remaining seven nights.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1165, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/07\/laylat-al-qadar-seven-nights\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said regarding the Night of Decree:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْلَةٌ طَلْقَةٌ لا حَارَّةٌ وَلا بَارِدَةٌ تُصْبِحُ الشَّمْسُ يَوْمَهَا حَمْرَاءَ ضَعِيفَةً<\/p>\n<p><strong>It is a calm night, neither hot nor cold, and the sun rises upon its day red and faint.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Khuzaymah 2192, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/07\/25\/laylat-al-qadr-peaceful-calm\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: I said, “O Messenger of Allah, if I know which night is the Night of Decree, what should I say during it?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُولِي اللَّهُمَّ إِنَّكَ عُفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي<\/p>\n<p><strong>Say: O Allah, You are pardoning. You love to forgive, so forgive me<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3513, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/07\/12\/laylat-al-qadr-dua-ramadan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>Retreat (<em>al-‘Itikaf<\/em>)<\/u><\/strong><\/p>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, would retreat to the mosque in the last ten nights of Ramadan.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2025, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/29\/itikaf-ramadan-last-ten\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha, may Allah be pleased with her, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْعَشْرُ شَدَّ مِئْزَرَهُ وَأَحْيَا لَيْلَهُ وَأَيْقَظَ أَهْلَهُ<\/p>\n<p>When the last ten days of Ramadan arrived, the Prophet, peace and blessings be upon him, would tighten his belt, spend the night in worship, and awaken his family.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2024, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/07\/worship-jihad-ten-nights-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, Aisha said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيْرِهِ<\/p>\n<p>The Prophet, peace and blessings be upon him, would exert himself in worship during the last ten nights of Ramadan more so than any other time.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1175, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>End of Ramadan Charity (<em>Zakat al-Fitr<\/em>)<\/u><\/strong><\/p>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْعَبْدِ وَالْحُرِّ وَالذَّكَرِ وَالْأُنْثَى وَالصَّغِيرِ وَالْكَبِيرِ مِنْ الْمُسْلِمِينَ وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلَاةِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, made it an obligation to pay charity at the end of Ramadan, a portion of dates or barely, upon the slave and the freeman, the male and female, the young and the old among the Muslims. The Prophet ordered it to be given before people go out for the Eid prayer.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1503, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/18\/zakat-al-fitr-ramadan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ زَبِيبٍ<\/p>\n<p>We would bring for Zakat al-Fitr a portion of food, or a portion of barley, or a portion of dates, or a portion of cheese, or a portion of raisins.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1506, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/10\/one-sa-food-zakat-al-fitr\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ طُهْرَةً لِلصَّائِمِ مِنْ اللَّغْوِ وَالرَّفَثِ وَطُعْمَةً لِلْمَسَاكِينِ مَنْ أَدَّاهَا قَبْلَ الصَّلَاةِ فَهِيَ زَكَاةٌ مَقْبُولَةٌ وَمَنْ أَدَّاهَا بَعْدَ الصَّلَاةِ فَهِيَ صَدَقَةٌ مِنْ الصَّدَقَاتِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, obligated Zakat al-Fitr as purification of the fasting person from vain talk and misbehavior, as food for the poor. Whoever pays it before the Eid prayer, it is accepted as Zakat. Whoever pays it after the Eid prayer, it is part of voluntary charity.<\/p>\n<p>Source: Sunan Abī Dāwūd 1609, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/10\/zakat-al-fitr-purification\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Waki’ ibn al-Jarrah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">زَكَاةُ الْفِطْرِ لِشَهْرِ رَمَضَانَ كَسَجْدَتِي السَّهْوِ لِلصَّلَاةِ تَجْبُرُ نُقْصَانَ الصَّوْمِ كَمَا يَجْبُرُ السُّجُودُ نُقْصَانَ الصَّلَاةِ<\/p>\n<p>Zakat al-Fitr is to the month of Ramadan like the prostration of forgetfulness is to prayer. It makes up for deficiencies in fasting just as the prostration makes up for deficiencies in prayer.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/08\/waki-zakat-al-fitr-sujud-sahw\/\">al-Majmū’ Sharḥ al-Muhadhab 6\/140<\/a><\/p><\/blockquote>\n<p><strong><u>Fasting After Ramadan<\/u><\/strong><\/p>\n<p>Abu Ayyub reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ الدَّهْرِ<\/p>\n<p><strong>Whoever fasts the month of Ramadan and then follows it with six days of fasting in the month of Shawwal, it will be as if he fasted for the entire year.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1164, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/17\/fasting-ramadan-six-shawwal\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thawban reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صِيَامُ رَمَضَانَ بِعَشَرَةِ أَشْهُرٍ وَصِيَامُ السِّتَّةِ أَيَّامٍ بِشَهْرَيْنِ فَذَلِكَ صِيَامُ السَّنَةِ<\/p>\n<p><strong>Fasting the month of Ramadan is like ten months of fasting and fasting six days of Shawwal is like two months of fasting. Thus, they are like fasting for a year.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Khuzaymah 2115, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/17\/fasting-ramadan-six-days-shawwal\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Qatadah reported: The Prophet, peace and blessings be upon him, was asked about fasting on Monday. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذَاكَ يَوْمٌ وُلِدْتُ فِيهِ وَيَوْمٌ بُعِثْتُ أَوْ أُنْزِلَ عَلَىَّ فِيهِ‏ صَوْمُ ثَلاَثَةٍ مِنْ كُلِّ شَهْرٍ وَرَمَضَانَ إِلَى رَمَضَانَ صَوْمُ الدَّهْرِ<\/p>\n<p><strong>That is the day I was born and the day I was sent with revelation. Fasting three days of every month and Ramadan after Ramadan is like fasting for a lifetime.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1162, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/15\/fast-monday-three-per-month\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">شَهْرُ الصَّبْرِ يعني رمضان وَثَلاَثَةُ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صَوْمُ الدَّهْرِ<\/p>\n<p><strong>Fasting the month of patience, Ramadan, and three days from every month is like fasting a lifetime<\/strong>.<\/p>\n<p>Source: Sunan al-Nasā’ī 2408, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/07\/03\/fasting-ramadan-three-days\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ صِيَامُ شَهْرِ اللَّهِ الْمُحَرَّمِ<\/p>\n<p><strong>The best fast after the month of Ramadan is fasting in the month of Allah, al-Muharram.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1163, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/27\/best-after-ramadan-muharram\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The gates of the heaven are opened, the gates of Hellfire are closed,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[167,125,17,331,356,168,353,85,26,132,123,114,354,385,88,135,32,100,53,56,315,377,134,298,58,59,60,107,306,68,242,478,267,509,220,327,364],"class_list":["post-23006","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-abraham-ibrahim","tag-gabriel-jibreel","tag-charity-al-sadaqah","tag-chastity-al-hisn","tag-congregational-prayer-salat-al-jamaah","tag-enjoin-good-amr-bil-maruf","tag-expiation-al-kaffarah","tag-fasting-al-siyam","tag-forgiveness-al-maghfirah","tag-freedom-al-huriyyah","tag-friday-prayer-salat-jumuah","tag-generosity-al-karam","tag-good-deeds-al-hasanat","tag-guarding-the-tongue-hafz-al-lisan","tag-pilgrimage-hajj","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-manners-al-adab","tag-marriage-al-nikah","tag-monotheism-tawheed","tag-night-of-decree-laylat-al-qadr","tag-night-prayer-tahajjud","tag-paradise-jannah","tag-parents","tag-patience-al-sabr","tag-peace","tag-prayer-salat","tag-public-trust-al-amanah","tag-ramadan","tag-satan-al-shaytan","tag-scriptures-kutub","tag-seeking-forgiveness-al-istighfar","tag-slavery-al-istibad","tag-spiritual-retreat-al-itikaf","tag-supplication-al-dua","tag-umrah-pilgrimage","tag-voluntary-prayer-salat-al-nafilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5Z4","jetpack-related-posts":[{"id":22648,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-five-salawat\/","url_meta":{"origin":23006,"position":0},"title":"Imam al-Mundhiri on the Five Obligatory Prayers","author":"Abu Amina Elias","date":"October 5, 2020","format":false,"excerpt":"\"Verily, every prayer makes the sins before you fall away.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":23006,"position":1},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23248,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-salat-al-duha\/","url_meta":{"origin":23006,"position":2},"title":"Imam al-Mundhiri on Forenoon Prayer, Salat al-Duha","author":"Abu Amina Elias","date":"May 30, 2021","format":false,"excerpt":"\"It is the prayer of the penitent.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13567,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-salat-salah-salawat\/","url_meta":{"origin":23006,"position":3},"title":"Imam al-Nawawi on Five Daily Prayers","author":"Abu Amina Elias","date":"May 19, 2013","format":false,"excerpt":"\"The parable of the five prayers is that of a river running...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21843,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-fasting-in-ramadan\/","url_meta":{"origin":23006,"position":4},"title":"Imam al-Mundhiri on Fasting in Ramadan","author":"Abu Amina Elias","date":"April 30, 2020","format":false,"excerpt":"\"Allah has people He redeems in every day and night of Ramadan.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13859,"url":"https:\/\/www.abuaminaelias.com\/blessings-of-the-month-of-ramadan\/","url_meta":{"origin":23006,"position":5},"title":"Blessings of the month of Ramadan","author":"Abu Amina Elias","date":"June 29, 2013","format":false,"excerpt":"\"Whoever fasts the month of Ramadan...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23006","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23006"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23006\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23006"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23006"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23006"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}