{"id":23056,"date":"2021-04-26T13:32:52","date_gmt":"2021-04-26T09:32:52","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23056"},"modified":"2025-03-19T11:25:03","modified_gmt":"2025-03-19T07:25:03","slug":"al-mundhiri-on-dua-to-allah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-dua-to-allah\/","title":{"rendered":"Imam al-Mundhiri on Supplication to Allah"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في كثرة الدعاء وما جاء في فضله<\/p>\n<p>Encouragement to supplicate often and what has been related of its virtue.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 2\/312<\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تبارك وتعالى يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا يَا عِبَادِي كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ يَا عِبَادِي كُلُّكُمْ جَائِعٌ إِلَّا مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ يَا عِبَادِي كُلُّكُمْ عَارٍ إِلَّا مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ يَا عِبَادِي إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ يَا عِبَادِي إِنَّكُمْ لَنْ تَبْلُغُوا ضَرِّي فَتَضُرُّونِي وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ يَا عِبَادِي إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ ثُمَّ أُوَفِّيكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ<\/p>\n<p><strong>Allah Almighty said: O My servants, I have forbidden injustice for Myself and I have forbidden it among you, so do not oppress one another. O My servants, all of you are astray except for those I have guided, so seek guidance from Me and I shall guide you. O My servants, all of you are hungry except for those I have fed, so seek food from Me and I shall feed you. O My servants, all of you are naked except for those I have clothed, so seek clothing from Me and I shall clothe you. O My servants, you sin by night and day and I forgive all sins, so seek forgiveness from Me and I shall forgive you. O My servants, you are unable to harm Me and you are unable to bring benefit to Me. O My servants, were the first of you and the last of you, the human of you and the jinn of you, to be as pious as the most pious heart of anyone of you, that would not increase My dominion at all. O My servants, were the first of you and the last of you, the human of you and the jinn of you, to be as wicked as the most wicked heart of anyone of you, that would not decrease My dominion at all. O My servants, were the first of you and the last of you, the human of you and the jinn of you, to rise up in one place and make a request of Me, and were I to give everyone what he requested, that would not diminish what I have any more than a needle would diminish the sea if put into it. O My servants, it is only your deeds that I record and then recompense for you. Let him who finds good praise Allah, and let him who finds something else blame no one but himself<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2577, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/allah-has-forbidden-oppression\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللهَ يَقُولُ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي<\/p>\n<p><strong>Allah says: I am as My servant expects of Me, and I am with him when he calls upon Me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2675, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/26\/allah-with-dua\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nu’man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّعَاءُ هُوَ الْعِبَادَةُ<\/p>\n<p><strong>Supplication is worship itself.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ رَبُّكُمْ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ<\/p>\n<p><strong>Your Lord said: Call upon Me and I will respond to you. Verily, those who disdain My worship will enter Hell in humiliation.<\/strong> (40:60)<\/p>\n<p>Source: Sunan al-Tirmidhī 3247, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/11\/dua-essence-ibadah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَرَّهُ أَنْ يَسْتَجِيبَ اللَّهُ لَهُ عِنْدَ الشَّدَائِدِ وَالْكَرْبِ فَلْيُكْثِرْ الدُّعَاءَ فِي الرَّخَاءِ<\/p>\n<p><strong>Whoever would be pleased for Allah to answer him during times of hardship and difficulty, let him supplicate often during times of ease<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3382, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/08\/13\/dua-ease-answer-hardship\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ تَعَالَى مِنْ الدُّعَاءِ<\/p>\n<p><strong>Nothing is more honorable to Allah Almighty than supplication.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3370, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/06\/17\/nothing-nobler-to-allah-dua\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى يَا ابْنَ آدَمَ إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ عَلَى مَا كَانَ فِيكَ وَلَا أُبَالِي<\/p>\n<p><strong>Allah Almighty said: O son of Adam, if you call upon Me and place your hope in Me, I will forgive you despite what is within you and I will not hesitate.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3540, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/12\/31\/son-of-adam-forgiven\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا عَلَى الْأَرْضِ مُسْلِمٌ يَدْعُو اللَّهَ بِدَعْوَةٍ إِلَّا آتَاهُ اللَّهُ إِيَّاهَا أَوْ صَرَفَ عَنْهُ مِنْ السُّوءِ مِثْلَهَا مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رَحِمٍ<\/p>\n<p><strong>There is no Muslim on earth who calls upon Allah in supplication but that Allah will grant it to him or divert some evil away from him, so long as he does not ask for something sinful or to cut off family ties<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3573, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/25\/divert-evil-by-dua\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ مُسْلِمٍ يَنْصِبُ وَجْهَهُ لِلَّهِ عَزَّ وَجَلَّ فِي مَسْأَلَةٍ إِلَّا أَعْطَاهَا إِيَّاهُ إِمَّا أَنْ يُعَجِّلَهَا لَهُ وَإِمَّا أَنْ يَدَّخِرَهَا لَهُ<\/p>\n<p><strong>No Muslim sets his face towards Allah Almighty in some matter but that he will be given a response, whether it comes quickly or is stored for later.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 9785, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/26\/every-dua-responded\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ مُسْلِمٍ يَدْعُو بِدَعْوَةٍ لَيْسَ فِيهَا إِثْمٌ وَلَا قَطِيعَةُ رَحِمٍ إِلَّا أَعْطَاهُ اللَّهُ بِهَا إِحْدَى ثَلَاثٍ إِمَّا أَنْ تُعَجَّلَ لَهُ دَعْوَتُهُ وَإِمَّا أَنْ يَدَّخِرَهَا لَهُ فِي الْآخِرَةِ وَإِمَّا أَنْ يَصْرِفَ عَنْهُ مِنْ السُّوءِ مِثْلَهَا<\/p>\n<p><strong>There is no Muslim who calls upon Allah, without sin or cutting family ties, but that Allah will give him one of three answers: He will quickly fulfill his supplication, He will store it for him in the Hereafter, or He will divert an evil from him similar to it<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 11133, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/05\/25\/supplication-answered-three-ways\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p style=\"text-align: right;\">Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ فُتِحَ لَهُ مِنْكُمْ بَابُ الدُّعَاءِ فُتِحَتْ لَهُ أَبْوَابُ الرَّحْمَةِ وَمَا سُئِلَ اللَّهُ شَيْئًا يَعْنِي أَحَبَّ إِلَيْهِ مِنْ أَنْ يُسْأَلَ الْعَافِيَةَ إِنَّ الدُّعَاءَ يَنْفَعُ مِمَّا نَزَلَ وَمِمَّا لَمْ يَنْزِلْ فَعَلَيْكُمْ عِبَادَ اللَّهِ بِالدُّعَاءِ<\/p>\n<p><strong>Whoever among you has the door of supplication opened for him, the door of mercy is opened for him as well. Allah is not asked for anything more beloved to Him than to be asked for wellness<\/strong>. <strong>Supplication benefits by what is sent down and what is not sent down. O servants of Allah, you must supplicate<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3548, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/15\/dua-door-of-rahmah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Salman al-Farsi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ حَيِيٌّ كَرِيمٌ يَسْتَحْيِي إِذَا رَفَعَ الرَّجُلُ إِلَيْهِ يَدَيْهِ أَنْ يَرُدَّهُمَا صِفْرًا خَائِبَتَيْنِ<\/p>\n<p><strong>Verily, Allah is conscientious and generous. He would be shy, when a man raises his hands to Him, to turn them away empty and disappointed<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3556, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/04\/13\/dua-allah-shy-empty-handed\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ رَحِيمٌ حَيِيٌّ كَرِيمٌ يَسْتَحِي مِنْ عَبْدِهِ أَنْ يَرْفَعَ إِلَيْهِ يَدَيْهِ ثُمَّ لَا يَضَعُ فِيهِمَا خَيْرًا<\/p>\n<p><strong>Verily, Allah is merciful, conscientious, and generous. He would be shy for His servant to raise his hands to Him and then not place any goodness in either of them.<\/strong><\/p>\n<p>Source: al-Mustadrak ʻalá al-Ṣaḥīḥayn 1832, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/26\/allah-shy-dua\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said,<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَزَلَتْ بِهِ فَاقَةٌ فَأَنْزَلَهَا بِالنَّاسِ لَمْ تُسَدَّ فَاقَتُهُ وَمَنْ نَزَلَتْ بِهِ فَاقَةٌ فَأَنْزَلَهَا بِاللَّهِ فَيُوشِكُ اللَّهُ لَهُ بِرِزْقٍ عَاجِلٍ أَوْ آجِلٍ<\/p>\n<p><strong>Whoever is afflicted by a pressing need and complains to people, his need will never be satisfied. Whoever is afflicted by a pressing need and complains to Allah, eventually Allah will provide for him, sooner or later<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2326, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/05\/13\/dua-complain-to-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thawban reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ يَزِيدُ فِي الْعُمْرِ إِلاَّ الْبِرُّ وَلاَ يَرُدُّ الْقَدَرَ إِلاَّ الدُّعَاءُ وَإِنَّ الرَّجُلَ لَيُحْرَمُ الرِّزْقَ لِلْخَطِيئَةِ يَعْمَلُهَا<\/p>\n<p><strong>The span of life is not increased but by righteousness, and the divine decree is not repelled but by supplication. Verily, a man is deprived of provision due to the sins he commits.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 90, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/25\/qadr-increase-life-span-repel\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Salman al-Farsi reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَرُدُّ الْقَضَاءَ إِلَّا الدُّعَاءُ وَلَا يَزِيدُ فِي الْعُمْرِ إِلَّا الْبِرُّ<\/p>\n<p><strong>Nothing repels the divine decree but supplication, and nothing increases life span but righteousness<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2139, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/25\/qadr-dua-repel-divine-decree\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Supplication is worship itself,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[362,183,169,24,26,114,349,354,184,370,135,32,352,54,292,92,478,220,489,435],"class_list":["post-23056","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-bad-deeds-al-sayyiat","tag-day-of-resurrection-yawm-al-qiyammah","tag-ease-yusr","tag-family-ties-sillat-rahim","tag-forgiveness-al-maghfirah","tag-generosity-al-karam","tag-good-assumption-husn-al-dhann","tag-good-deeds-al-hasanat","tag-guidance-al-hidaya","tag-hardship-al-usr","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-hope-al-raja","tag-mercy-al-rahmah","tag-modesty-al-haya","tag-providence-al-qada-wal-qadr","tag-seeking-forgiveness-al-istighfar","tag-supplication-al-dua","tag-surah-ghafir","tag-wellness-al-afiyyah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-5ZS","jetpack-related-posts":[{"id":20469,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-praying-dua-behind-back\/","url_meta":{"origin":23056,"position":0},"title":"Imam al-Mundhiri on Praying for someone behind their back","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"The angel says: And for you the same.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23053,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-istighfar\/","url_meta":{"origin":23056,"position":1},"title":"Imam al-Mundhiri on Seeking Forgiveness from Allah","author":"Abu Amina Elias","date":"April 25, 2021","format":false,"excerpt":"\"I seek forgiveness from Allah Almighty...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20671,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-consistent-good-habits\/","url_meta":{"origin":23056,"position":2},"title":"Imam al-Mundhiri on Consistent Good Habits","author":"Abu Amina Elias","date":"July 16, 2019","format":false,"excerpt":"\"Most beloved deeds to Allah are performed regularly,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23844,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fearing-oppressor\/","url_meta":{"origin":23056,"position":3},"title":"Imam al-Mundhiri on Supplications if Fearing an Oppressor","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Encouragement for words to say when fearing an oppressor\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23854,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bribery-hukm\/","url_meta":{"origin":23056,"position":4},"title":"Imam al-Mundhiri on Bribery in Judgment","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Warning against giving and taking bribes, and pursuing either of them.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23064,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-shuhh-and-bukhl\/","url_meta":{"origin":23056,"position":5},"title":"Imam al-Mundhiri on Greed and Miserliness","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Greed and faith can never be combined in the heart.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23056","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23056"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23056\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23056"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23056"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23056"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}