{"id":23067,"date":"2021-04-27T14:42:53","date_gmt":"2021-04-27T10:42:53","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23067"},"modified":"2025-03-19T11:27:52","modified_gmt":"2025-03-19T07:27:52","slug":"al-mundhiri-fulfilling-needs-bringing-happiness","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fulfilling-needs-bringing-happiness\/","title":{"rendered":"Imam al-Mundhiri on Fulfilling Needs, Bringing Happiness"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّرْغِيب فِي قَضَاء حوائج الْمُسلمين وَإِدْخَال السرُور عَلَيْهِم<\/p>\n<p>Encouragement to fulfill the needs of the Muslims and bring happiness to them.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 3\/262<\/p><\/blockquote>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يُسْلِمُهُ مَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ بِهَا كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>The Muslim is a brother to another Muslim. He does not wrong him, nor surrender him. Whoever fulfills the needs of his brother, Allah will fulfill his needs. Whoever relieves a Muslim from distress, Allah will relieve him from distress on the Day of Resurrection. Whoever covers the faults of a Muslim, Allah will cover his faults on the Day of Resurrection<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2422, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/12\/06\/muslim-brother-another-muslim\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَبُّ النَّاسِ إِلَى اللَّهِ أَنْفَعُهُمْ لِلنَّاسِ وَأَحَبُّ الأَعْمَالِ إِلَى اللَّهِ سُرُورٌ تُدْخِلُهُ عَلَى مُسْلِمٍ أَوْ تَكْشِفُ عَنْهُ كُرْبَةً أَوْ تَقْضِي عَنْهُ دِينًا أَوْ تَطْرُدُ عَنْهُ جُوعًا وَلَأَنْ أَمْشِيَ مَعَ أَخِيهِ فِي حَاجَةٍ أَحَبُّ إِلَيَّ مِنْ أَنْ أَعْتَكِفَ فِي هَذَا الْمَسْجِدِ يَعْنِي مَسْجِدَ الْمَدِينَةِ شَهْرًا وَمَنْ كَفَّ غَضَبَهُ سَتَرَ اللَّهُ عَوْرَتَهُ وَمَنْ كَظَمَ غَيْظَهُ وَلَوْ شَاءَ أَنْ يُمْضِيَهُ أَمْضَاهُ مَلأَ اللَّهُ عَزَّ وَجَلَّ قَلْبَهُ أَمْنًا يَوْمَ الْقِيَامَةِ وَمَنْ مَشَى مَعَ أَخِيهِ فِي حَاجَةٍ حَتَّى أَثْبَتَهَا لَهُ أَثْبَتَ اللَّهُ عَزَّ وَجَلَّ قَدَمَهُ عَلَى الصِّرَاطِ يَوْمَ تَزِلُّ فِيهِ الأَقْدَامُ<\/p>\n<p><strong>The most beloved people to Allah are those who are most beneficial to people. The most beloved deed to Allah is to make a Muslim happy, or to remove one of his troubles, or to forgive his debt, or to feed his hunger. That I walk with a brother regarding a need is more beloved to me than that I seclude myself in this mosque in Medina for a month. Whoever swallows his anger, then Allah will conceal his faults. Whoever suppresses his rage, even though he could fulfill his anger if he wished, then Allah will secure his heart on the Day of Resurrection. Whoever walks with his brother regarding a need until he secures it for him, then Allah Almighty will make his footing firm across the bridge on the day when the footings are shaken.<\/strong><\/p>\n<p>Source: al-Muʻjam al-Awsaṭ 6026, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/most-beloved-to-allah-beneficial-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالآخِرَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالآخِرَةِ وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلاَئِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ<\/p>\n<p><strong>Whoever relieves the hardship of a believer in this world, Allah will relieve his hardship on the Day of Resurrection. Whoever helps ease one in difficulty, Allah will make it easy for him in this world and in the Hereafter. Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and in the Hereafter. Allah helps the servant as long as he helps his brother. Whoever travels a path in search of knowledge, Allah will make easy for him a path to Paradise. People do not gather in the houses of Allah, reciting the book of Allah and studying it together, but that tranquility will descend upon them, mercy will cover them, angels will surround them, and Allah will mention them to those near him. Whoever is slow to good deeds will not be hastened by his lineage<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ أَقْوَامًا اخْتَصَّهُمْ بِالنِّعَمِ لِمَنَافِعِ الْعِبَادِ وَيُقِرُّهَا فِيهِمْ مَا بَذَلُوهَا فَإِذَا مَنَعُوهَا نَزَعَهَا عَنْهُمْ وَحَوَّلَهَا إِلَى غَيْرِهِمْ<\/p>\n<p><strong>Verily, Allah has people for whom He has assigned blessings to benefit His servants. He consolidates their blessings as long as they offer them to others. If they refuse to give them, He takes them away and directs them to others<\/strong>.<\/p>\n<p>Source: Shu’ab al-Imān 7144, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/12\/14\/allah-blesses-as-long-as-give\/\">Hasan li ghayrihi<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ عَبْدٍ أَنْعَمَ اللهُ عَلَيْهِ نِعْمَةً فَأَسْبَغَهَا عَلَيْهِ إِلَّا جَعَلَ إِلَيْهِ شَيْئًا مِنْ حَوَائِجِ النَّاسِ فَإِنْ تَبَرَّمَ بِهِمْ فَقَدْ عَرَّضَ تِلْكَ النِّعْمَةَ لِلزَّوَالِ<\/p>\n<p><strong>None among the servants are bestowed a blessing from Allah and He makes it abundant upon him but that He will appoint to him something of the needs of people. If he is irritated with them, he risks the disappearance of that blessing.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 7254, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/vanish-if-not-good\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَزَالُ اللَّهُ فِي حَاجَةِ الْعَبْدِ مَا دَامَ فِي حَاجَةِ أَخِيهِ<\/p>\n<p><strong>Allah continues to fulfill the needs of the servant as long as he fulfills the needs of his brother.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 4664, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/09\/14\/sadaqah-allah-help-others\/\">Sahih li ghayri<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Musa reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ<\/p>\n<p><strong>Charity is a duty upon every Muslim<\/strong>.<\/p><\/blockquote>\n<p>They said, “What if he has nothing?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَعْمَلُ بِيَدَيْهِ فَيَنْفَعُ نَفْسَهُ وَيَتَصَدَّقُ<\/p>\n<p><strong>Then he should work with his hands to benefit himself and give in charity.<\/strong><\/p><\/blockquote>\n<p>They said, “What if he cannot do so?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيُعِينُ ذَا الْحَاجَةِ الْمَلْهُوفَ<\/p>\n<p><strong>Then he should help a depressed, needy person.<\/strong><\/p><\/blockquote>\n<p>They said, “What if he cannot do so?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَأْمُرُ بِالْخَيْرِ أَوْ قَالَ بِالْمَعْرُوفِ<\/p>\n<p><strong>Then he should enjoin goodness and virtue<\/strong>.<\/p><\/blockquote>\n<p>They said, “What if he cannot do so?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيُمْسِكُ عَنْ الشَّرِّ فَإِنَّهُ لَهُ صَدَقَةٌ<\/p>\n<p><strong>Then he should refrain from evil, for that will be his charity<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6022, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/charity-due-every-muslim\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, was asked, “Which deeds are best?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِدْخَالُكَ السُّرُورَ عَلَى مُؤْمِنٍ أَشْبَعْتَ جَوْعَتَهُ أَوْ كَسَوْتَ عُرْيَهُ أَوْ قَضَيْتَ لَهُ حَاجَةً<\/p>\n<p><strong>To bring happiness to a believer, to satisfy his hunger, to clothe his nakedness, or to fulfill his needs.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 5081, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/best-deeds-happiness\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Whoever fulfills the needs of his brother, Allah will fulfill his needs.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[122,13,398,499,241,17,321,495,183,496,168,498,135,32,497,50,134],"class_list":["post-23067","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-angels-malaikah","tag-anger-al-ghadhab","tag-benefit-al-nafa","tag-bridge-over-hell-al-sirat","tag-brotherhood-al-ikhwa","tag-charity-al-sadaqah","tag-clothing-al-malabis","tag-covering-faults","tag-day-of-resurrection-yawm-al-qiyammah","tag-debt-al-dayn","tag-enjoin-good-amr-bil-maruf","tag-food-al-taam","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-hunger-al-juu","tag-knowledge","tag-paradise-jannah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-603","jetpack-related-posts":[{"id":20462,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-shaking-hands-greeting\/","url_meta":{"origin":23067,"position":0},"title":"Imam al-Mundhiri on Shaking Hands","author":"Abu Amina Elias","date":"June 16, 2019","format":false,"excerpt":"\"Allah forgives them before they part.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20469,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-praying-dua-behind-back\/","url_meta":{"origin":23067,"position":1},"title":"Imam al-Mundhiri on Praying for someone behind their back","author":"Abu Amina Elias","date":"June 17, 2019","format":false,"excerpt":"\"The angel says: And for you the same.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20419,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-tazkiyyah-qalb-hasad\/","url_meta":{"origin":23067,"position":2},"title":"Imam al-Mundhiri on Purifying the Heart from Envy","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"\"Faith and envy do not combine within a believing servant.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20531,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nifaq-two-faces-forked-tongues\/","url_meta":{"origin":23067,"position":3},"title":"Imam al-Mundhiri on Hypocrisy, Two-faces, and Forked-tongues","author":"Abu Amina Elias","date":"June 21, 2019","format":false,"excerpt":"\"We used to consider that hypocrisy.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20522,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-none-favored-but-righteousness\/","url_meta":{"origin":23067,"position":4},"title":"Imam al-Mundhiri on None Favored but by Righteousness","author":"Abu Amina Elias","date":"June 19, 2019","format":false,"excerpt":"\"It is enough evil to look down upon his brother.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23854,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bribery-hukm\/","url_meta":{"origin":23067,"position":5},"title":"Imam al-Mundhiri on Bribery in Judgment","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Warning against giving and taking bribes, and pursuing either of them.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23067","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23067"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23067\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23067"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23067"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23067"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}