{"id":23070,"date":"2021-04-27T18:09:59","date_gmt":"2021-04-27T14:09:59","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23070"},"modified":"2025-03-19T11:22:57","modified_gmt":"2025-03-19T07:22:57","slug":"al-mundhiri-recitation-quran","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-recitation-quran\/","title":{"rendered":"Imam al-Mundhiri on Reciting the Quran"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّرْغِيب فِي قِرَاءَة الْقُرْآن فِي الصَّلَاة وَغَيرهَا وَفضل تعلمه وتعليمه وَالتَّرْغِيب فِي سُجُود التِّلَاوَة<\/p>\n<p>Encouragement to recite the Quran in prayer and elsewhere, the virtue of teaching and learning it, and encouragement to performs prostrations of recitation.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 2\/225<\/p><\/blockquote>\n<p>Uthman bin Affan reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ<\/p>\n<p><strong>The best of you are those who learn the Quran and teach it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5027, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/02\/taalam-al-quran-wa-allamahu\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا لَا أَقُولُ الم حَرْفٌ وَلَكِنْ أَلِفٌ حَرْفٌ وَلَامٌ حَرْفٌ وَمِيمٌ حَرْفٌ<\/p>\n<p><strong>Whoever recites a letter from the Book of Allah, he will receive one good deed as ten good deeds like it. I do not say that Alif Lam Mim is one letter, but rather Alif is a letter, Lam is a letter, and Mim is a letter<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2910, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/16\/one-harf-ten-hasanat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلاَئِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ<\/p>\n<p><strong>People do not gather in the houses of Allah, reciting the book of Allah and studying it together, but that tranquility will descend upon them, mercy will cover them, angels will surround them, and Allah will mention them to those near him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Uqbah ibn ‘Amir reported: The Messenger of Allah, peace and blessings be upon him, came out to us while we were in the shelter. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْمٍ إِلَى بُطْحَانَ أَوْ إِلَى الْعَقِيقِ فَيَأْتِيَ مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلَا قَطْعِ رَحِمٍ<\/p>\n<p><strong>Which of you would love to go out in the morning each day to Buthan or ‘Aqiq and bring with him two mature she-camels, without sinning or severing family ties?<\/strong><\/p><\/blockquote>\n<p>We said, “O Messenger of Allah, we would love that.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفَلَا يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمُ أَوْ يَقْرَأُ آيَتَيْنِ مِنْ كِتَابِ اللهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ وَثَلَاثٌ خَيْرٌ لَهُ مِنْ ثَلَاثٍ وَأَرْبَعٌ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنَ الْإِبِلِ<\/p>\n<p><strong>Does not one of you go out in the morning to the mosque to learn or recite two verses from the Book of Allah Almighty? It is better for him than two camels, three is better than three, four is better than four and whatever number of camels.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 803, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/quran-better-than-world\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Musa al-Ashari reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ مَثَلُ التَّمْرَةِ لاَ رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ<\/p>\n<p><strong>The parable of the believer who recites the Quran is that of a citrus fruit, which tastes good and has a pleasant scent. The parable of the believer who does not recite the Quran is that of a date, which has no scent but tastes good. The parable of a hypocrite who recites the Quran is that of basil, which has a pleasant scent but tastes bitter. The parable of the hypocrite who does not recite the Quran is that of a vine, which has no scent and tastes bitter<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5059, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/02\/example-recite-quran\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الْأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ طَعْمُهَا طَيِّبٌ وَلَا رِيحَ لَهَا وَمَثَلُ الْفَاجِرِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْفَاجِرِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ طَعْمُهَا مَرٌّ وَلَا رِيحَ لَهَا وَمَثَلُ الْجَلِيسِ الصَّالِحِ كَمَثَلِ صَاحِبِ الْمِسْكِ إِنْ لَمْ يُصِبْكَ مِنْهُ شَيْءٌ أَصَابَكَ مِنْ رِيحِهِ وَمَثَلُ جَلِيسِ السُّوءِ كَمَثَلِ صَاحِبِ الْكِيرِ إِنْ لَمْ يُصِبْكَ مِنْ سَوَادِهِ أَصَابَكَ مِنْ دُخَانِهِ<\/p>\n<p><strong>The parable of the believer who recites the Quran is that of citron, who fragrance and taste are pleasant. The parable of the believer who does not recite the Quran is that of a date-fruit, whose taste is sweet and has no fragrance. The parable of the wicked who recites the Quran is that of basil, whose fragrance is pleasant and taste is bitter. The parable of the wicked who does not recite the Quran is that of a vine, whose taste is bitter and has no fragrance. The parable of good company is that of a seller of musk; he will smell its fragrance even if he does not buy anything. The parable of bad company is that of a blacksmith; he will smell its smoke even if he is not touched by its ashes.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4829, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/22\/parable-reciters-good-company\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ حَافِظٌ لَهُ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَمَثَلُ الَّذِي يَقْرَأُ وَهُوَ يَتَعَاهَدُهُ وَهُوَ عَلَيْهِ شَدِيدٌ فَلَهُ أَجْرَانِ<\/p>\n<p><strong>The example of one who recites the Quran and memorizes it is that of one with the ‘righteous and noble scribes’ <\/strong>(80:15).<strong> The example of one who recites the Quran and is committed to it, although it is difficult for him, is that of one with a double reward<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4937, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/11\/quran-reciters-scribes\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: I said, “O Messenger of Allah, instruct me.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوْصَيْكَ بِتَقْوَى اللَّهِ عَزَّ وَجَلَّ فَإِنَّهُ أَزْيَنُ لأَمْرِكَ كُلِّهِ<\/p>\n<p><strong>I advise you to be mindful of Allah Almighty, for it will beautify all of your affairs<\/strong>.<\/p><\/blockquote>\n<p>I said, “Tell me more.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَلَيْكَ بِتِلاوَةِ الْقُرْآنِ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ فَإِنَّهُ ذِكْرٌ لَكَ فِي السَّمَاءِ وَنُورٌ لَكَ فِي الأَرْضِ<\/p>\n<p><strong>You must recite the Quran and remember Allah Almighty, for you will be mentioned in heaven and you will have light upon earth<\/strong>.<\/p>\n<p>Source: Shu’ab al-Imān 4592, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/03\/10\/wisdom-abu-dharr\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْقُرْآنُ مُشَفَّعٌ وَمَا حِلٌ مُصَدَّقٌ مَنْ جَعَلَهُ إِمَامَهُ قَادَهُ إِلَى الْجَنَّةِ وَمَنْ جَعَلَهُ خَلْفَ ظَهْرِهِ سَاقَهُ إِلَى النَّارِ<\/p>\n<p><strong>The Quran is an intercessor and a truthful prosecutor. Whoever puts it in front of himself, it will lead him to Paradise. Whoever throws it behind his back, it will drive him into the Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 124, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/03\/23\/quran-truthful-prosecutor\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ<\/p>\n<p><strong>Recite the Quran, for on the Day of Resurrection it will come as an intercessor for its reciters. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 804, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/31\/al-baqarah-ali-imran-barakah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَجِيءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ فَيَقُولُ يَا رَبِّ حَلِّهِ فَيُلْبَسُ تَاجَ الْكَرَامَةِ ثُمَّ يَقُولُ يَا رَبِّ زِدْهُ فَيُلْبَسُ حُلَّةَ الْكَرَامَةِ ثُمَّ يَقُولُ يَا رَبِّ ارْضَ عَنْهُ فَيَرْضَى عَنْهُ فَيُقَالُ لَهُ اقْرَأْ وَارْقَ وَتُزَادُ بِكُلِّ آيَةٍ حَسَنَةً<\/p>\n<p style=\"text-align: left;\"><strong>The Quran will be brought on the Day of resurrection and it will say for its reciter: O Lord, decorate him. So he will be clothed with a crown of nobility. Then it will say: O Lord, give him more. So he will be clothed with a suit of nobility. Then it will say: O Lord, be pleased with him. So Allah will be pleased with him and He will say: Recite and rise up, be increased in goodness for every verse<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2915, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/11\/quran-let-him-be-clothed-nobility\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُقَالُ لِصَاحِبِ الْقُرْآنِ اقْرَأْ وَارْتَقِ وَرَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَتَكَ عِنْدَ آخِرِ آيَةٍ تَقْرَأُ بِهَا<\/p>\n<p><strong>It will be said to the companion of the Quran: Recite and ascend as you recited in the world. Verily, your rank is determined by the last verse you recite.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2914, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/16\/recite-ascend-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا حَسَدَ إِلَّا عَلَى اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ هَذَا الْكِتَابَ فَقَامَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَتَصَدَّقَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ<\/p>\n<p><strong>There is no envy but in two cases: a man whom Allah has given this Book and he stands to recite it by night and day, and a man whom Allah has given wealth and he spends it in charity by night and day<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7529, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/16\/no-hasad-quran-sadaqah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَحَاسُدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَتْلُوهُ آنَاءَ اللَّيْلِ وَالنَّهَارِ يَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ هَذَا لَفَعَلْتُ كَمَا يَفْعَلُ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا يُنْفِقُهُ فِي حَقِّهِ فَيَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ لَفَعَلْتُ كَمَا يَفْعَلُ<\/p>\n<p><strong>There is no envy but in two cases: a man whom Allah has given the Quran and he recites it by night and day, so it is said: If I were given the likes of this, I would act as he has. And a man whom Allah has given wealth and he spends it rightly, so it is said: If I were given the likes of this, I would act as he has.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7232, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/16\/no-hasad-but-two\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الصِّيَامُ وَالْقُرْآنُ يَشْفَعَانِ لِلْعَبْدِ يَوْمَ الْقِيَامَةِ يَقُولُ الصِّيَامُ أَيْ رَبِّ مَنَعْتُهُ الطَّعَامَ وَالشَّهَوَاتِ بِالنَّهَارِ فَشَفِّعْنِي فِيهِ وَيَقُولُ الْقُرْآنُ مَنَعْتُهُ النَّوْمَ بِاللَّيْلِ فَشَفِّعْنِي فِيهِ قَالَ فَيُشَفَّعَانِ<\/p>\n<p><strong>Fasting and the Quran will intercede for the servant on the Day of Resurrection. Fasting will say: O Lord, I prevented him from food and drink during the day, so let me intercede for him. The Quran will say: O Lord, I prevented him from sleeping during the night, so let me intercede for him. Thus, they will both intercede for him<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 6626, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/06\/24\/sawm-siyam-quran-intercede\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Usayd ibn Hudayr reported: He said, “O Messenger of Allah, while I was reciting Surat al-Baqarah in the night, I heard a loud noise behind me and I thought my horse had escaped.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اقْرَأْ يَا أَبَا عَتِيكٍ<\/p>\n<p><strong>Recite, O Abu ‘Atik.<\/strong><\/p><\/blockquote>\n<p>Then, I turned to behold the likeness of a lamp hanging between the heavens and the earth, as the Prophet was saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اقْرَأْ يَا أَبَا عَتِيكٍ<\/p>\n<p><strong>Recite, O Abu ‘Atik.<\/strong><\/p><\/blockquote>\n<p>He said, “O Messenger of Allah, how can I keep going?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تِلْكَ الْمَلَائِكَةُ نَزَلَتْ لِقِرَاءَةِ سُورَةِ الْبَقَرَةِ أَمَا إِنَّكَ لَوْ مَضَيْتَ لَرَأَيْتَ الْعَجَائِبَ<\/p>\n<p><strong>These angels descended for your recitation of Surat al-Baqarah. If you had continued, you would have seen wonders.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 779, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/angels-descend-quran\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ أَهْلِينَ مِنْ النَّاسِ<\/p>\n<p><strong>Verily, Allah has His own people among humanity.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, who are they?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ أَهْلُ الْقُرْآنِ أَهْلُ اللَّهِ وَخَاصَّتُهُ<\/p>\n<p><strong>They are the people of the Quran, the people of Allah and His chosen ones<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 215, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/06\/06\/ahl-quran-ahl-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Imran ibn Husayn reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَرَأَ الْقُرْآنَ فَلْيَسْأَلْ اللَّهَ بِهِ فَإِنَّهُ سَيَجِيءُ أَقْوَامٌ يَقْرَءُونَ الْقُرْآنَ يَسْأَلُونَ بِهِ النَّاسَ<\/p>\n<p><strong>Whoever reads the Quran, let him ask Allah by it. Verily, people will come who recite the Quran and ask people by it.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2917, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/06\/13\/ask-allah-by-quran\/\">Sahih li ghayri<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Buraydah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْقُرْآنَ يَلْقَى صَاحِبَهُ يَوْمَ الْقِيَامَةِ حِينَ يَنْشَقُّ عَنْهُ قَبْرُهُ كَالرَّجُلِ الشَّاحِبِ فَيَقُولُ لَهُ هَلْ تَعْرِفُنِي فَيَقُولُ مَا أَعْرِفُكَ فَيَقُولُ أَنَا صَاحِبُكَ الْقُرْآنُ الَّذِي أَظْمَأْتُكَ فِي الْهَوَاجِرِ وَأَسْهَرْتُ لَيْلَكَ وَإِنَّ كُلَّ تَاجِرٍ مِنْ وَرَاءِ تِجَارَتِهِ وَإِنَّكَ الْيَوْمَ مِنْ وَرَاءِ كُلِّ تِجَارَةٍ فَيُعْطَى الْمُلْكَ بِيَمِينِهِ وَالْخُلْدَ بِشِمَالِهِ وَيُوضَعُ عَلَى رَأْسِهِ تَاجُ الْوَقَارِ وَيُكْسَى وَالِدَاهُ حُلَّتَيْنِ لَا يُقَوَّمُ لَهُمَا أَهْلُ الدُّنْيَا فَيَقُولَانِ بِمَ كُسِينَا هَذَا فَيُقَالُ بِأَخْذِ وَلَدِكُمَا الْقُرْآنَ ثُمَّ يُقَالُ لَهُ اقْرَأْ وَاصْعَدْ فِي دَرَجِ الْجَنَّةِ وَغُرَفِهَا فَهُوَ فِي صُعُودٍ مَا دَامَ يَقْرَأُ هَذًّا كَانَ أَوْ تَرْتِيلًا<\/p>\n<p><strong>Verily, the Quran will meet its companion on the Day of Resurrection, when his grave is cleaved open, as a pale man, saying: Do you recognize me? He will say: I do not recognize you. The pale man will say: I am your companion, the Quran, who made you thirsty in the midday heat and sleepless at night, for every trader is beyond his trade and today you are beyond every transaction. He will be given the dominion in his right hand and eternal life in his left hand. A crown of dignity will be placed on his head and his parents will be clothed in two garments, which no people from the world could ever afford. They will say: Why have you dressed us with this? It will be said: Your child held to the Quran. Then it will be said to him: Recite and ascend the levels of Paradise and its chambers! He will continue to ascend as long as he recites, whether slowly or quickly.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22950, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/02\/09\/tremendous-rewards\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Mu’adh al-Juhani reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَرَأَ الْقُرْآنَ وَعَمِلَ بِمَا فِيهِ أُلْبِسَ وَالِدَاهُ تَاجًا يَوْمَ الْقِيَامَةِ ضَوْءُهُ أَحْسَنُ مِنْ ضَوْءِ الشَّمْسِ فِي بُيُوتِ الدُّنْيَا لَوْ كَانَتْ فِيكُمْ فَمَا ظَنُّكُمْ بِالَّذِي عَمِلَ بِهَذَا<\/p>\n<p><strong>Whoever recites the Quran and acts according to what is in it, his parents will be crowned on the Day of Resurrection with a light brighter than the light of the sun in your worldly houses, were it among you. What do you think of one who acts upon this?<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1453, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/05\/12\/parents-hafiz-quran-crown\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَرَأَ عَشْرَ آيَاتٍ فِيٍ لَيْلَةٍ لَمْ يُكْتَبْ مِنَ الْغَافِلِينَ<\/p>\n<p><strong>Whoever recites ten verses in the night will never be recorded among the negligent.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān 2003, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/ten-verses-at-night\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ حَافَظَ عَلَى هَؤُلاءِ الصَّلَوَاتِ الْمَكْتُوبَاتِ لَمْ يُكْتَبْ مِنَ الْغَافِلِينَ وَمَنْ قَرَأَ فِي لَيْلَةٍ مِائَةَ أَيَّةٍ لَمْ يُكْتَبْ مِنَ الْغَافِلِينَ<\/p>\n<p><strong>Whoever guards these prescribed prayers, he will not be recorded as negligent. Whoever recites one hundred verses in the night, he will not be recorded as negligent.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Khuzaymah 1082, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/12\/guarding-five-prayers-reciting\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَامَ بِعَشْرِ آيَاتٍ لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ وَمَنْ قَامَ بِمِائَةِ آيَةٍ كُتِبَ مِنْ الْقَانِتِينَ وَمَنْ قَامَ بِأَلْفِ آيَةٍ كُتِبَ مِنْ الْمُقَنْطِرِينَ<\/p>\n<p><strong>Whoever stands to pray with ten verses will never be recorded among the negligent. Whoever stands with a hundred verses will recorded among those devoutly obedient to Allah. Whoever stands with a thousand verses will be recorded among those with tremendous rewards<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 1398, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/06\/14\/prayer-at-night\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا قَرَأَ ابْنُ آدَمَ السَّجْدَةَ فَسَجَدَ اعْتَزَلَ الشَّيْطَانُ يَبْكِي يَقُولُ يَا وَيْلِي أُمِرَ ابْنُ آدَمَ بِالسُّجُودِ فَسَجَدَ فَلَهُ الْجَنَّةُ وَأُمِرْتُ بِالسُّجُودِ فَأَبَيْتُ فَلِي النَّارُ<\/p>\n<p><strong>When the son of Adam recites a verse of prostration and he prostrates, Satan withdraws and he weeps and he says: Woe to me! The son of Adam was commanded to prostrate and he prostrated, so he will go to Paradise. I was commanded to prostrate and I refused, so I will go to Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 81, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/06\/03\/sajdah-sujud-shaytan-weeps\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: A man came to the Prophet, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا رَسُولَ اللهِ رَأَيْتُنِي اللَّيْلَةَ وَأَنَا نَائِمٌ كَأَنِّي كُنْتُ أُصَلِّي خَلْفَ شَجَرَةٍ فَسَجَدْتُ فَسَجَدَتِ الشَّجَرَةُ لِسُجُودِي فَسَمِعْتُهَا وَهِيَ تَقُولُ اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْرًا وَضَعْ عَنِّي بِهَا وِزْرًا وَاجْعَلْهَا لِي عِنْدَكَ ذُخْرًا وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ<\/p>\n<p>O Messenger of Allah, I saw while I was sleeping night as if I were praying behind a tree. I prostrated and the tree prostrated along with me. I heard it saying: O Allah, write a reward for me with You, remove my burdens, store it for me with You, and accept it from me as You accepted it from your servant David.<\/p><\/blockquote>\n<p>Ibn Abbas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَقَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجْدَةً ثُمَّ سَجَدَ<\/p>\n<p>Then, the Prophet recited a verse of prostration and prostrated.<\/p>\n<p>Source: Sunan al-Tirmidhī 3424, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/dua-to-be-like-dawud\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The best of you are those who learn the Quran and teach it.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[122,303,27,32,95,377,486,134,60,500,68,501],"class_list":["post-23070","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-angels-malaikah","tag-david-dawud","tag-god-fearing-taqwa","tag-hereafter-akhirah","tag-hypocrisy-al-nifaq","tag-night-prayer-tahajjud","tag-parables-al-amthal","tag-paradise-jannah","tag-prayer-salat","tag-prostration-al-sujud","tag-satan-al-shaytan","tag-surah-abasa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-606","jetpack-related-posts":[{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":23070,"position":0},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23251,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nawafil-salat\/","url_meta":{"origin":23070,"position":1},"title":"Imam al-Mundhiri on Voluntary Sunan Prayers","author":"Abu Amina Elias","date":"May 30, 2021","format":false,"excerpt":"\"Whoever perseveres in performing twelve raka'at...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23075,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-committing-to-the-quran-reciting-pleasantly\/","url_meta":{"origin":23070,"position":2},"title":"Imam al-Mundhiri on Committing to the Quran, Reciting Pleasantly","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"Strive to remember the Quran, for it is quicker to escape the hearts of men than camels.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23079,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-fatihah\/","url_meta":{"origin":23070,"position":3},"title":"Imam al-Mundhiri on Virtues of Surat al-Fatihah","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"All praise is due to Allah, the Lord of the worlds,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20717,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-siwak-miswak-oral-hygiene\/","url_meta":{"origin":23070,"position":4},"title":"Imam al-Mundhiri on Siwak and Oral Hygiene","author":"Abu Amina Elias","date":"August 5, 2019","format":false,"excerpt":"\"Toothstick is cleansing for the mouth, pleasing to the Lord.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20658,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-arguing-bickering-quarreling\/","url_meta":{"origin":23070,"position":5},"title":"Imam al-Mundhiri on Arguing, Bickering, and Quarreling","author":"Abu Amina Elias","date":"July 5, 2019","format":false,"excerpt":"\"No people are led astray but that they indulged in arguments.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23070","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23070"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23070\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23070"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23070"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23070"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}