{"id":23222,"date":"2021-05-21T23:41:51","date_gmt":"2021-05-21T19:41:51","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23222"},"modified":"2025-03-19T11:29:07","modified_gmt":"2025-03-19T07:29:07","slug":"al-mundhiri-tawbah-following-sayyiat-hasanat","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-tawbah-following-sayyiat-hasanat\/","title":{"rendered":"Imam al-Mundhiri on Repentance, Following Evil with Good"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في التوبة والمبادرة بها وإتباع السيئة الحسنة<\/p>\n<p>Encouragement to repent, taking initiative in it, and following an evil deed with a good deed.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 4\/45<\/p><\/blockquote>\n<p>Abu Musa reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ اللَّيْلِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا<\/p>\n<p><strong>Verily, Allah Almighty stretches out His hand by night to accept the repentance of those who sin by day, and He stretches out His hand by day to accept the repentance of those who sin by night, until the sun rises from the west.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2759, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/tawbah-by-night-and-day\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said,<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا تَابَ اللَّهُ عَلَيْهِ<\/p>\n<p><strong>Whoever repents before the sun rises from the west, Allah will accept his repentance.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2703m Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/repentance-sun-rises-from-west\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Safwan ibn ‘Assal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ قِبَلِ مَغْرِبِ الشَّمْسِ بَابًا مَفْتُوحًا عَرْضُهُ سَبْعُونَ سَنَةً فَلَا يَزَالُ ذَلِكَ الْبَابُ مَفْتُوحًا لِلتَّوْبَةِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ نَحْوِهِ فَإِذَا طَلَعَتْ مِنْ نَحْوِهِ لَمْ يَنْفَعْ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا<\/p>\n<p><strong>Verily, towards the Western sun is an open gate the length of which is seventy years of travel, It will continue to be open for repentance until the sun rises from there. When the sun rises from there, the faith of any soul will not benefit it had it not had faith earlier or earned goodness from its faith.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4070, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/sun-rises-west\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَخْطَأْتُمْ حَتَّى تَبْلُغَ خَطَايَاكُمْ السَّمَاءَ ثُمَّ تُبْتُمْ لَتَابَ عَلَيْكُمْ<\/p>\n<p><strong>If your sins were to reach to the heavens and then you repented, Allah would still accept your repentance.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4248, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/13\/if-your-sins-reached-the-heavens\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ ابْنِ آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ<\/p>\n<p><strong>All of the children of Adam are sinners, and the best sinners are those who repent.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2499, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/20\/best-sinners-repentance\/\">Qawwi <\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَذْنَبَ عَبْدٌ ذَنْبًا فَقَالَ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي فَقَالَ تَبَارَكَ وَتَعَالَى أَذْنَبَ عَبْدِي ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَيْ رَبِّ اغْفِرْ لِي ذَنْبِي فَقَالَ تَبَارَكَ وَتَعَالَى عَبْدِي أَذْنَبَ ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَيْ رَبِّ اغْفِرْ لِي ذَنْبِي فَقَالَ تَبَارَكَ وَتَعَالَى أَذْنَبَ عَبْدِي ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ اعْمَلْ مَا شِئْتَ فَقَدْ غَفَرْتُ لَكَ<\/p>\n<p><strong>A servant committed a sin and he said: O Allah, forgive my sin! Allah Almighty said: My servant has committed a sin and he knows he has a Lord who forgives sins and holds him accountable. Then the servant returned to his sin and he said: O Allah, forgive my sin! Allah said: My servant has committed a sin and he knows he has a Lord who forgives sins and holds him accountable. Then the servant returned to his sin and he said: O Allah, forgive my sin! Allah said: My servant has committed a sin and he knows he has a Lord who forgives sins and holds him accountable, so do what you will for I have forgiven you<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7507, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/14\/allah-continues-forgive\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْعَبْدَ إِذَا أَخْطَأَ خَطِيئَةً نُكِتَتْ فِي قَلْبِهِ نُكْتَةٌ سَوْدَاءُ فَإِذَا هُوَ نَزَعَ وَاسْتَغْفَرَ وَتَابَ سُقِلَ قَلْبُهُ وَإِنْ عَادَ زِيدَ فِيهَا حَتَّى تَعْلُوَ قَلْبَهُ وَهُوَ الرَّانُ الَّذِي ذَكَرَ اللَّهُ كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ<\/p>\n<p style=\"text-align: left;\"><strong>Verily, when the servant commits a sin, a black mark appears upon his heart. If he abandons the sin, seeks forgiveness, and repents, then his heart will be polished. If he returns to the sin, the blackness will be increased until it overcomes his heart. It is the covering that Allah has mentioned: No, rather a covering is over their hearts from what they have earned<\/strong>. (83:14)<\/p>\n<p>Source: Sunan al-Tirmidhī 3334, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/13\/black-spot-heart-tawbah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Quraysh said to the Prophet, peace and blessings be upon him, “Call upon your Lord to turn mount Safa into gold for us and we will have faith in you.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَفْعَلُونَ<\/p>\n<p><strong>And you will do so<\/strong>?<\/p><\/blockquote>\n<p>They said yes. The Prophet supplicated to Allah and Gabriel came to him and he said, “Verily, your Lord Almighty greets you with peace. He says that if you wish, I will turn the mount of Safa into gold for them, but whoever among them disbelieves after that will be punished with a great punishment like no one else in the worlds. And if you wish, the door of repentance and mercy will be opened for them.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلْ بَابُ التَّوْبَةِ وَالرَّحْمَةِ<\/p>\n<p><strong>Rather, the door of repentance and mercy<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 2166, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/02\/05\/rather-bab-tawbah-rahmah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ<\/p>\n<p><strong>Verily, Allah accepts the repentance of his servants, as long as they are not on their death bed<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3537, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/27\/repentance-accepted-death-bed\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: I said, “O Messenger of Allah, instruct me.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْبُدِ اللَّهَ كَأَنَّكَ تَرَاهُ وَاعْدُدْ نَفْسَكَ مِنَ الْمَوْتَى وَاذْكُرِ اللَّهَ عِنْدَ كُلِّ حَجَرٍ وَشَجَرٍ وَإِذَا عَمِلْتَ السَّيِّئَةَ فَاعْمَلْ بِجَنْبِهَا حَسَنَةً السِّرُّ بِالسِّرِّ وَالْعَلَانِيَةُ بِالْعَلَانِيَةِ<\/p>\n<p><strong>Worship Allah as if you can see Him and consider yourself already dead. Remember Allah by every rock and tree. If you commit a bad deed, accompany it with a good deed, secretly in secret and publicly in public.<\/strong><\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 34325, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/every-rock-and-tree\/\">Hasan li ghayrihi<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّائِبُ مِنَ الذَّنْبِ كَمَنْ لَا ذَنْبَ لَهُ<\/p>\n<p><strong>The one who completely repented of sin is like one without sin.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 4250, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/01\/13\/true-repentance-erases-sins\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">النَّدَمُ تَوْبَةٌ<\/p>\n<p><strong>Regret is part of repentance<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 4252, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/13\/regret-part-of-tawbah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَحَدٌ أَغْيَرَ مِنْ اللَّهِ وَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلَا أَحَدٌ أَحَبَّ إِلَيْهِ الْمَدْحُ مِنْ اللَّهِ<\/p>\n<p><strong>No one has a greater sense of honor than Allah, so He has made obscenities unlawful in public and in private. And no one loves to be praised more than Allah<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4637, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/02\/06\/gheerah-fahishah-haram-hamd\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ لَوْ لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ فَيَسْتَغْفِرُونَ اللَّهَ فَيَغْفِرُ لَهُمْ<\/p>\n<p><strong>By the One in whose hand is my soul, if you did not sin, Allah would replace you with people who would sin, and they would seek forgiveness from Allah and He would forgive them<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 2749, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/16\/tawbah-repentance-replace-you\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Imran ibn Husayn reported: A woman of Juhaynah came to the Prophet of Allah, peace and blessings be upon him, while she was pregnant from adultery. She said, “O Prophet of Allah, I have committed a legal offense, so impose it upon me.” The Prophet called for her guardian and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَأْتِنِي بِهَا<\/p>\n<p><strong>Be kind to her and when she gives birth, bring her to me.<\/strong><\/p><\/blockquote>\n<p>He did so and the Prophet ordered for her shroud to be wrapped over her, then her ordered her to be stoned and he prayed over her. Umar said, “Do you prayer over one who committed adultery?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ تَوْبَةً أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ تَعَالَى<\/p>\n<p><strong>She had repented with such repentance that, if it had been divided between seventy people of Medina, it would have reached beyond them. Have you found any repentance better than this, that she gave up her life for Allah Almighty?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1696, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/great-tawbah-zina\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ قَتَلَ تِسْعَةً وَتِسْعِينَ إِنْسَانًا ثُمَّ خَرَجَ يَسْأَلُ فَأَتَى رَاهِبًا فَسَأَلَهُ فَقَالَ لَهُ هَلْ مِنْ تَوْبَةٍ قَالَ لَا فَقَتَلَهُ فَجَعَلَ يَسْأَلُ فَقَالَ لَهُ رَجُلٌ ائْتِ قَرْيَةَ كَذَا وَكَذَا فَأَدْرَكَهُ الْمَوْتُ فَنَاءَ بِصَدْرِهِ نَحْوَهَا فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ الْعَذَابِ فَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَقَرَّبِي وَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَبَاعَدِي وَقَالَ قِيسُوا مَا بَيْنَهُمَا فَوُجِدَ إِلَى هَذِهِ أَقْرَبَ بِشِبْرٍ فَغُفِرَ لَهُ<\/p>\n<p><strong>There was a man among the children of Israel who had killed ninety nine people. Then he set out seeking repentance. He came upon a monk and he asked him if his repentance would be accepted. The monk said no, so the man killed him. He continued asking until another man advised him to go to a certain village. He set out for it but death overtook him on the way. As he died, he turned his chest toward the village. The angel of mercy and the angel of punishment argued about him among themselves. Allah ordered his destination to move closer to him and his old village to move away. Then, Allah ordered the angels to measure the distance between his body and the two villages. He was found to be one span closer to his destination, so he was forgiven.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3470, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/man-repented-hundred-murders\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace be and blessings on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ تَعَالَى أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا ذَكَرَنِي فَإِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلَإٍ ذَكَرْتُهُ فِي مَلَإٍ خَيْرٍ مِنْهُمْ وَإِنْ تَقَرَّبَ إِلَيَّ بِشِبْرٍ تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا تَقَرَّبْتُ إِلَيْهِ بَاعًا وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً<\/p>\n<p style=\"text-align: left;\"><strong>Allah Almighty says: I am as My servant expects of Me and I am with him as he remembers Me. If he remembers Me in himself, I will remember him in Myself. If he mentions Me in a gathering, I will mention him in a greater gathering. When he draws near Me by the span of his hand, I draw near him by the length of a cubit. When he draws near Me by the length of a cubit, I draw near him by the length of a fathom. When he comes to Me walking, I come to him running<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7405, Grade:<strong><em> <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/07\/good-thoughts-about-allah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Shurayh reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللهُ تَعَالَى يَا ابْنَ آدَمَ قُمْ إِلَيَّ أَمْشِ إِلَيْكَ وَامْشِ إِلَيَّ أُهَرْوِلْ إِلَيْكَ<\/p>\n<p><strong>Allah Almighty said: O Son of Adam, stand for Me and I will walk to you. Walk to Me and I will run to you.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 15925, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/walk-to-me\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ حِينَ يَتُوبُ إِلَيْهِ مِنْ أَحَدِكُمْ كَانَ عَلَى رَاحِلَتِهِ بِأَرْضِ فَلاَةٍ فَانْفَلَتَتْ مِنْهُ وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ مِنْهَا فَأَتَى شَجَرَةً فَاضْطَجَعَ فِي ظِلِّهَا قَدْ أَيِسَ مِنْ رَاحِلَتِهِ فَبَيْنَا هُوَ كَذَلِكَ إِذَا هُوَ بِهَا قَائِمَةً عِنْدَهُ فَأَخَذَ بِخِطَامِهَا ثُمَّ قَالَ مِنْ شِدَّةِ الْفَرَحِ اللَّهُمَّ أَنْتَ عَبْدِي وَأَنَا رَبُّكَ أَخْطَأَ مِنْ شِدَّةِ الْفَرَحِ<\/p>\n<p><strong>Allah is more delighted at the repentance of His servant than one of you who lost his riding animal on a journey in a barren land while it carries his food and drink.<\/strong> <strong>He loses all hope as he comes to a tree to lie down in its shade, despairing over his animal, but suddenly he finds it standing over him. He takes hold of its reins and then he greatly rejoices, saying: O Allah, You are my servant and I am your Lord! He makes a mistake due to his great joy.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2747, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/04\/15\/delighted-tawbah-muslims-desert\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحْسَنَ فِيمَا بَقِيَ غُفِرَ لَهُ مَا مَضَى وَمَنْ أَسَاءَ فِيمَا بَقِيَ أُخِذَ بِمَا مَضَى وَمَا بَقِيَ<\/p>\n<p><strong>Whoever does a good deed in what remains of his life, he will be forgiven for what has passed. Whoever does an evil deed in what remains of his life, he will be seized for what has passed and what remains.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 6806, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/hasanat-expiates-past-sins\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>‘Uqbah ibn ‘Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مَثَلَ الَّذِي يَعْمَلُ السَّيِّئَاتِ ثُمَّ يَعْمَلُ الْحَسَنَاتِ كَمَثَلِ رَجُلٍ كَانَتْ عَلَيْهِ دِرْعٌ ضَيِّقَةٌ قَدْ خَنَقَتْهُ ثُمَّ عَمِلَ حَسَنَةً فَانْفَكَّتْ حَلْقَةٌ ثُمَّ عَمِلَ حَسَنَةً أُخْرَى فَانْفَكَّتْ حَلْقَةٌ أُخْرَى حَتَّى يَخْرُجَ إِلَى الْأَرْضِ<\/p>\n<p><strong>Verily, the parable of one who commits a sin and then performs is a good is that of a man wearing a tightened coat of mail strangling him. Then, he performs a good deed and one of its rings loosens, then he performs another good deed and another ring loosens, until he is set free to walk the earth.<\/strong><\/p><\/blockquote>\n<p>Source: Musnad Aḥmad 17307, Source: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/parable-good-after-evil\/\">Hasan<\/a><\/em><\/p>\n<p>Mu’adh ibn Jabal reported: He intended to travel, so he said, “O Prophet of Allah, instruct me.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْبُدِ اللَّهَ لا تُشْرِكْ بِهِ شَيْئًا<\/p>\n<p><strong>Worship Allah and associate nothing with him<\/strong>.<\/p><\/blockquote>\n<p>Mu’adh said, “O Prophet of Allah, tell me more.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَسَأْتَ فَأَحْسِنْ<\/p>\n<p><strong>If you do a bad deed, then do a good deed<\/strong>.<\/p><\/blockquote>\n<p>Mu’adh said, “O Messenger of Allah, tell me more.” The Prophet said;<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَقِمْ وَلْيَحْسُنْ خُلُقُكَ<\/p>\n<p><strong>Have integrity and make your character excellent<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 529, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/03\/09\/upright-good-character\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقِ اللَّهِ حَيْثُمَا كُنْتَ وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ<\/p>\n<p><strong>Fear<\/strong> <strong>Allah wherever you are, follow a bad deed with a good deed and it will erase it, and behave with good character towards people<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1987, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/17\/akhlaq-fear-allah-wherever\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُوصِيكَ بِتَقْوَى اللَّهِ فِي سِرِّ أَمْرِكَ وَعَلَانِيَتِهِ وَإِذَا أَسَأْتَ فَأَحْسِنْ وَلَا تَسْأَلَنَّ أَحَدًا شَيْئًا وَإِنْ سَقَطَ سَوْطُكَ وَلَا تَقْبِضْ أَمَانَةً وَلَا تَقْضِ بَيْنَ اثْنَيْنِ<\/p>\n<p><strong>I instruct you to fear Allah in your private and public affairs. If you do a bad deed, then do a good deed. Do not ask anyone for anything, even if you drop your whip. Do not violate what is entrusted, and do not take a position as judge between two people.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 21573, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/11\/taqwa-public-private\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Dharr reported: I said, “O Messenger of Allah, instruct me.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا عَمِلْتَ سَيِّئَةً فَأَتْبِعْهَا حَسَنَةً تَمْحُهَا<\/p>\n<p><strong>If you do a bad deed, follow it with a good deed to wipe it out.<\/strong><\/p><\/blockquote>\n<p>I said, “O Messenger of Allah, is it a good deed to declare there is no God but Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هِيَ أَفْضَلُ الْحَسَنَاتِ<\/p>\n<p><strong>It is among the best of good deeds.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 20959, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/09\/hasanat-la-ilaha-illa-allah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: A man kissed a woman and he came to the Prophet, peace and blessings be upon him, and mentioned it to him. The verse was revealed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقِمْ الصَّلَاةَ طَرَفَيْ النَّهَارِ وَزُلَفًا مِنْ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ<\/p>\n<p><strong>Perform prayer at the two ends of the day and in the first hours of the night. Verily, good deeds remove evil deeds.<\/strong> (11:114)<\/p><\/blockquote>\n<p>The man said, “O Messenger of Allah, is it for me only?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِمَنْ عَمِلَ بِهَا مِنْ أُمَّتِي<\/p>\n<p><strong>It is for all who act upon it from my nation.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4687, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/31\/hasanat-remove-sayyiat\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Tawil reported: He came to the Messenger of Allah, peace and blessings be upon him, and he said, “What do you think of a man who commits every sin, leaving nothing of them. Is there repentance for him?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَسْلَمْتَ<\/p>\n<p><strong>Have you embraced Islam?<\/strong><\/p><\/blockquote>\n<p>He said, “As for me, I testify there is no God but Allah, along without any partners, and that you are the Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ تَفْعَلُ الْخَيْرَاتِ وَتَتْرُكُ السَّيِّئَاتِ فَيَجْعَلُهُنَّ اللهُ لَكَ خَيْرَاتٍ كُلَّهُنَّ<\/p>\n<p><strong>Yes, perform good deeds and leave evil deeds, then Allah will turn all of them into good deeds for you.<\/strong><\/p><\/blockquote>\n<p>He said, “And my treachery and wickedness?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ<\/p>\n<p><strong>Yes<\/strong>.<\/p>\n<p>Source: al-Mu’jam al-Kabīr 7235, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/21\/islam-plus-hasanat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;If you do a bad deed, follow it with a good deed&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[127,122,391,16,183,262,22,26,27,511,32,363,411,404,316,54,408,56,486,358,60,107,374,66,67,478,405,220,488,512,371,98,179],"class_list":["post-23222","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-adultery-zina","tag-angels-malaikah","tag-bloodshed-safk-al-dima","tag-character-akhlaq","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-excellence-ihsaan","tag-forgiveness-al-maghfirah","tag-god-fearing-taqwa","tag-hearts-al-qulub","tag-hereafter-akhirah","tag-integrity-al-istiqamah","tag-israelites-banu-israil","tag-legal-punishment-al-hudud","tag-medina-madinah","tag-mercy-al-rahmah","tag-miracles-al-mujizah","tag-monotheism-tawheed","tag-parables-al-amthal","tag-praise-al-hamd","tag-prayer-salat","tag-public-trust-al-amanah","tag-punishment-al-uqubah","tag-remembrance-dhikr","tag-repentance-al-tawbah","tag-seeking-forgiveness-al-istighfar","tag-signs-of-the-hour-ashrat-al-saah","tag-supplication-al-dua","tag-surah-al-mutaffifin","tag-surah-hud","tag-ummah","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-62y","jetpack-related-posts":[{"id":23053,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-istighfar\/","url_meta":{"origin":23222,"position":0},"title":"Imam al-Mundhiri on Seeking Forgiveness from Allah","author":"Abu Amina Elias","date":"April 25, 2021","format":false,"excerpt":"\"I seek forgiveness from Allah Almighty...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23079,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-fatihah\/","url_meta":{"origin":23222,"position":1},"title":"Imam al-Mundhiri on Virtues of Surat al-Fatihah","author":"Abu Amina Elias","date":"April 27, 2021","format":false,"excerpt":"\"All praise is due to Allah, the Lord of the worlds,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15646,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-repentance-tawbah\/","url_meta":{"origin":23222,"position":2},"title":"Imam al-Nawawi on Repentance, Seeking Forgiveness","author":"Abu Amina Elias","date":"April 15, 2014","format":false,"excerpt":"\"Seek forgiveness from your Lord and repent to Him.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23084,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-surah-al-baqarah-ali-imran\/","url_meta":{"origin":23222,"position":3},"title":"Imam al-Mundhiri on Surat al-Baqarah and Ali &#8216;Imran","author":"Abu Amina Elias","date":"April 28, 2021","format":false,"excerpt":"\"Recite Surat al-Baqarah in your houses...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20551,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bidah-innovations-lowly-desires\/","url_meta":{"origin":23222,"position":4},"title":"Imam al-Mundhiri on Heretical Innovations, Lowly Desires","author":"Abu Amina Elias","date":"June 24, 2019","format":false,"excerpt":"\"Every innovation is misguidance, every misguidance is in Hellfire.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20133,"url":"https:\/\/www.abuaminaelias.com\/how-to-repent-from-sin-the-right-way\/","url_meta":{"origin":23222,"position":5},"title":"How to repent from sin the right way","author":"Abu Amina Elias","date":"January 24, 2019","format":false,"excerpt":"\"O you who have faith, repent to Allah with sincere repentance.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23222","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23222"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23222\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23222"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23222"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23222"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}