{"id":23248,"date":"2021-05-30T13:35:30","date_gmt":"2021-05-30T09:35:30","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23248"},"modified":"2025-03-19T11:18:50","modified_gmt":"2025-03-19T07:18:50","slug":"al-mundhiri-salat-al-duha","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-salat-al-duha\/","title":{"rendered":"Imam al-Mundhiri on Forenoon Prayer, Salat al-Duha"},"content":{"rendered":"<p>In the Name of Allah, the Gracious, the Merciful<\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترغيب في صلاة الضحى<\/p>\n<p>Encouragement to perform the forenoon prayer.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 1\/264<\/p><\/blockquote>\n<p>Abu Huraira reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوْصَانِي خَلِيلِي صلى الله عليه وسلم بِثَلَاثٍ لَا أَدَعُهُنَّ حَتَّى أَمُوتَ صَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَصَلَاةِ الضُّحَى وَنَوْمٍ عَلَى وِتْرٍ<\/p>\n<p>My dear friend the Prophet, peace and blessings be upon him, advised me to do three deeds and I will never abandon them until I die: to fast three days of every month, to perform forenoon prayer, and to sleep after performing the Witr prayer.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1178, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/11\/11\/three-regular-practices\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُصْبِحُ عَلَى كُلِّ سُلَامَى مِنْ أَحَدِكُمْ صَدَقَةٌ فَكُلُّ تَسْبِيحَةٍ صَدَقَةٌ وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنْ الْمُنْكَرِ صَدَقَةٌ وَيُجْزِئُ مِنْ ذَلِكَ رَكْعَتَانِ يَرْكَعُهُمَا مِنْ الضُّحَى<\/p>\n<p><strong>Upon every one of your joints in the morning is charity due. Every glorification of Allah is charity. Every praise of Allah is charity. Every declaration of the oneness of Allah is charity. Every exaltation of Allah is charity. Enjoining good and forbidding evil is charity. It is enough of that to perform two cycles of prayer in the forenoon.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 755, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/26\/every-morning-joints-owe\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Buraydah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِي الْإِنْسَانِ ثَلَاثُ مِائَةٍ وَسِتُّونَ مَفْصِلًا فَعَلَيْهِ أَنْ يَتَصَدَّقَ عَنْ كُلِّ مَفْصِلٍ مِنْهُ بِصَدَقَةٍ<\/p>\n<p><strong>Inside the human being are three hundred and sixty joints, upon each of them charity is due.<\/strong><\/p><\/blockquote>\n<p>They said, “Who can do that, O Prophet of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">النُّخَاعَةُ فِي الْمَسْجِدِ تَدْفِنُهَا وَالشَّيْءُ تُنَحِّيهِ عَنْ الطَّرِيقِ فَإِنْ لَمْ تَجِدْ فَرَكْعَتَا الضُّحَى تُجْزِئُكَ<\/p>\n<p><strong>It is spittle in the mosque you clean, or something in the road you move to the side. If you cannot find anything, it is enough to perform two cycles of forenoon prayer.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 5242, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/18\/sadaqah-due-every-joint\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Darda reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوْصَانِي حَبِيبِي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ لَنْ أَدَعَهُنَّ مَا عِشْتُ بِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَصَلَاةِ الضُّحَى وَبِأَنْ لَا أَنَامَ حَتَّى أُوتِرَ<\/p>\n<p>My beloved friend, the Prophet, peace and blessings be upon him, instructed me with three deeds I will never leave for as long as I live: fasting three days a month, performing forenoon prayer, and not sleeping until performing Witr prayer.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 722, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/siyam-salat-al-duha-witr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, dispatched a company. They acquired spoils and rushed back to tell people about how close was their battle, how many their spoils, and how quickly they returned. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَدُلُّكُمْ عَلَى أَقْرَبَ مِنْهُ مَغْزًى وَأَكْثَرَ غَنِيمَةً وَأَوْشَكَ رَجْعَةً مَنْ تَوَضَّأَ ثُمَّ غَدَا إِلَى الْمَسْجِدِ لِسُبْحَةِ الضُّحَى فَهُوَ أَقْرَبُ مَغْزًى وَأَكْثَرُ غَنِيمَةً وَأَوْشَكُ رَجْعَةً<\/p>\n<p><strong>Shall I not tell you what is closer than a battle, more plentiful than spoils, and a swifter return? One who performs ablution, then goes to the mosque in the morning to glorify Allah in the forenoon. It is a closer battle, more plentiful spoils, and a swifter return.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6638, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/duha-better-than-spoils\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, dispatched a company who acquired a great amount of spoils and returned quickly. A man said, “O Messenger of Allah, we have not a company of our people return more quickly with greater spoils!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِأَسْرَعَ كَرَّةً وَأَعْظَمَ غَنِيمَةً مِنْ هَذَا الْبَعْثِ رَجُلٌ تَوَضَّأَ فِي بَيْتِهِ فَأَحْسَنَ وُضُوءَهُ ثُمَّ تَحَمَّلَ إِلَى الْمَسْجِدِ فَصَلَّى فِيهِ الْغَدَاةَ ثُمَّ عَقَّبَ بِصَلَاةِ الضُّحَى فَقَدْ أَسْرَعَ الْكَرَّةَ وَأَعْظَمَ الْغَنِيمَةَ<\/p>\n<p><strong>Shall I not inform you of a swifter return and greater spoils than this company? It is a man who performs ablution in the best manner, then sets out to the mosque to pray in it in the morning and ending with forenoon prayer. He has a swifter return and greater spoils.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 2535, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/salat-al-duha-fi-masjid\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Prophet, peace and blessings be upon him, dispatched a company to Najd and they acquired many spoils and rushed back. A man who did not go with them said, “We have not seen a company return more swiftly and with better spoils than this one!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلاَ أَدُلُّكُمْ عَلَى قَوْمٍ أَفْضَلُ غَنِيمَةً وَأَسْرَعُ رَجْعَةً قَوْمٌ شَهِدُوا صَلاَةَ الصُّبْحِ ثُمَّ جَلَسُوا يَذْكُرُونَ اللَّهَ حَتَّى طَلَعَتِ الشَّمْسُ فَأُولَئِكَ أَسْرَعُ رَجْعَةً وَأَفْضَلُ غَنِيمَةً<\/p>\n<p><strong>Shall I not tell you about a people with better spoils and a swifter return? People who attend the dawn prayer, then sit remembering Allah until the sun rises. These have a swifter return and better spoils.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3561, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/dhikr-better-spoils\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Uqbah ibn ‘Amir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللهَ يَقُولُ يَا ابْنَ آدَمَ اكْفِنِي أَوَّلَ النَّهَارِ بِأَرْبَعِ رَكَعَاتٍ أَكْفِكَ بِهِنَّ آخِرَ يَوْمِكَ<\/p>\n<p><strong>Verily, Allah Almighty says: O son of Adam, suffice Me with four cycles of prayer at the beginning of the morning and by them I will suffice you for the rest of your day.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 17390, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/duha-four-rakaat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Darda reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تَبَارَكَ وَتَعَالَى ابْنَ آدَمَ ارْكَعْ لِي أَرْبَعَ رَكَعَاتٍ مِنْ أَوَّلِ النَّهَارِ أَكْفِكَ آخِرَهُ<\/p>\n<p><strong>Allah Almighty said: Son of Adam, bow to Me in four cycles of prayer<\/strong> <strong>at the beginning of the day and I will suffice you for the rest of it<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 475, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/10\/04\/salat-al-duha-four-rakaat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Nu’aym ibn Hammar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ لَا تُعْجِزْنِي مِنْ أَرْبَعِ رَكَعَاتٍ فِي أَوَّلِ نَهَارِكَ أَكْفِكَ آخِرَهُ<\/p>\n<p><strong>Allah Almighty says: O son of Adam, do not be frustrated to perform four cycles of prayer for me at the beginning of your day. I will suffice you for the rest of it.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1289, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/salat-al-duha-enough\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ خَرَجَ مِنْ بَيْتِهِ مُتَطَهِّرًا إِلَى صَلَاةٍ مَكْتُوبَةٍ فَأَجْرُهُ كَأَجْرِ الْحَاجِّ الْمُحْرِمِ وَمَنْ خَرَجَ إِلَى تَسْبِيحِ الضُّحَى لَا يَنْصِبُهُ إِلَّا إِيَّاهُ فَأَجْرُهُ كَأَجْرِ الْمُعْتَمِرِ<\/p>\n<p><strong>Whoever leaves his house with ritual purification for a prescribed prayer, his reward will be like one performing a Hajj pilgrimage in a state of sanctity. Whoever leaves to glorify Allah in the forenoon, laboring only for this purpose, his reward will be like one performing the Umrah pilgrimage.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1288, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/salat-like-hajj-umrah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُحَافِظُ عَلَى صَلَاةِ الضُّحَى إِلَّا أَوَّابٌ وَهِيَ صَلَاةُ الْأَوَّابِينَ<\/p>\n<p><strong>None preserve the forenoon prayer but the penitent. It is the prayer of the penitent.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Khuzaymah 1224, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/salat-al-duha-tawbah\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;It is the prayer of the penitent.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[160,17,250,356,517,515,85,26,357,88,47,355,60,67,378,220,327,364,516],"class_list":["post-23248","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-ablution-wudu","tag-charity-al-sadaqah","tag-cleanliness-al-taharah","tag-congregational-prayer-salat-al-jamaah","tag-salat-al-fajr","tag-exaltation-al-takbir","tag-fasting-al-siyam","tag-forgiveness-al-maghfirah","tag-glorification-al-tasbih","tag-pilgrimage-hajj","tag-jihad","tag-mosques-al-masajid","tag-prayer-salat","tag-repentance-al-tawbah","tag-sleep-al-nawm","tag-supplication-al-dua","tag-umrah-pilgrimage","tag-voluntary-prayer-salat-al-nafilah","tag-salat-al-witr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-62Y","jetpack-related-posts":[{"id":20316,"url":"https:\/\/www.abuaminaelias.com\/al-nawawi-forenoon-prayer-salat-duha\/","url_meta":{"origin":23248,"position":0},"title":"Imam al-Nawawi on Forenoon Prayer, Salat al-Duha","author":"Abu Amina Elias","date":"April 26, 2019","format":false,"excerpt":"\"It is enough to perform two cycles of forenoon prayer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23254,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-witr-prayer\/","url_meta":{"origin":23248,"position":1},"title":"Imam al-Mundhiri on the Witr Prayer","author":"Abu Amina Elias","date":"May 31, 2021","format":false,"excerpt":"\"Verily, Allah is numerically odd and He loves what is odd in number.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23251,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-nawafil-salat\/","url_meta":{"origin":23248,"position":2},"title":"Imam al-Mundhiri on Voluntary Sunan Prayers","author":"Abu Amina Elias","date":"May 30, 2021","format":false,"excerpt":"\"Whoever perseveres in performing twelve raka'at...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":23248,"position":3},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22648,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-five-salawat\/","url_meta":{"origin":23248,"position":4},"title":"Imam al-Mundhiri on the Five Obligatory Prayers","author":"Abu Amina Elias","date":"October 5, 2020","format":false,"excerpt":"\"Verily, every prayer makes the sins before you fall away.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14885,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-on-congregational-prayer\/","url_meta":{"origin":23248,"position":5},"title":"Imam al-Nawawi on Congregational Prayer","author":"Abu Amina Elias","date":"September 5, 2013","format":false,"excerpt":"\"One of you continues to be in prayer as long as he is waiting for prayer.\" --Sunan Abu Dawud 547","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23248","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23248"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23248\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23248"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23248"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23248"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}