{"id":23261,"date":"2021-05-31T06:29:31","date_gmt":"2021-05-31T02:29:31","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23261"},"modified":"2021-05-31T06:58:37","modified_gmt":"2021-05-31T02:58:37","slug":"limits-of-retaliation-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/limits-of-retaliation-in-islam\/","title":{"rendered":"Limits of retaliation and retribution in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Legal retaliation for crimes and offenses is permissible in Islam, even though pardon and forgiveness is highly recommended, yet it is very common for Muslims to transgress the limits and end up even worse than the people who originally wronged them. It is a trait of ignorance in today’s culture that one believes if he is wronged, he has unrestricted permission to retaliate by every possible means.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالْأَنفَ بِالْأَنفِ وَالْأُذُنَ بِالْأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ ۚ فَمَن تَصَدَّقَ بِهِ فَهُوَ كَفَّارَةٌ لَّهُ ۚ وَمَن لَّمْ يَحْكُم بِمَا أَنزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ<\/p>\n<p><strong>We ordained for them therein a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds is legal retribution. But whoever gives up his right as charity, it is an expiation for him. Whoever does not judge by what Allah has revealed, then it is those who are the wrongdoers.<\/strong><\/p>\n<p>Surah al-Ma’idah 5:45<\/p><\/blockquote>\n<p>The phrase “eye for an eye” is not necessarily literal, but rather an expression meaning the punishment must fit the crime. For instance, an eye for two eyes, so to speak, would overstep the bounds and be a greater act of oppression than the original crime.<\/p>\n<p>Sufyan al-Thawri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ أَخَذَ مِنْكَ دِينَارًا فَلَا تَأْخُذْ مِنْهُ إِلَّا دِينَارًا وَإِنْ أَخَذَ مِنْكَ شَيْئًا فَلَا تَأْخُذْ مِنْهُ إِلَّا مِثْلَ ذَلِكَ الشَّيْءِ<\/p>\n<p>If someone takes a coin from you, then only take a coin from him. If someone takes something from you, then do not take anything but the equal of that thing.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 14\/406<\/p><\/blockquote>\n<p>Allah said in another verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنِ اعْتَدَىٰ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَىٰ عَلَيْكُمْ ۚ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ<\/p>\n<p><strong>Whoever transgresses against you, then transgress against him in like manner. And fear Allah and know that Allah is with those who fear Him.<\/strong><\/p>\n<p>Surat al-Baqarah 2:194<\/p><\/blockquote>\n<p>Allah permits legal retaliation in this verse, but He also warns us to fear Him since human beings have a tendency, in their thirst for revenge, to go beyond what is legally allowed.<\/p>\n<p>Al-Qurtubi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ ظَلَمَكَ فَخُذْ حَقَّكَ مِنْهُ بِقَدْرِ مَظْلِمَتِكَ وَمَنْ شَتَمَكَ فَرُدَّ عَلَيْهِ مِثْلَ قَوْلِهِ وَمَنْ أَخَذَ عِرْضَكَ فَخُذْ عِرْضَهَ لَا تَتَعَدَّى إِلَى أَبَوَيْهِ وَلَا إِلَى ابْنِهِ أَوْ قَرِيبِهِ وَلَيْسَ لَكَ أَنْ تَكْذِبَ عَلَيْهِ وَإِنْ كَذَبَ عَلَيْكَ فَإِنَّ الْمَعْصِيَةَ لَا تُقَابَلُ بِالْمَعْصِيَةِ<\/p>\n<p>Whoever oppresses you, then you may take your rights from him according to the measure of his oppression. Whoever abuses you, then you may respond similar to his saying. Whoever takes from your honor, then you may take from his honor. But do not transgress against his parents or his sons or his relatives. It is not your right to lie against him if he has lied against you. Indeed, an act of sinful disobedience cannot be met with further disobedience.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 2:194<\/p><\/blockquote>\n<p>And Ibn al-&#8216;Arabi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَكِنْ لَيْسَ لَك أَنْ تَكْذِبَ عَلَيْهِ وَإِنْ كَذَبَ عَلَيْك فَإِنَّ الْمَعْصِيَةَ لَا تُقَابَلُ بِالْمَعْصِيَةِ<\/p>\n<p>Rather, it is not for you to lie against him even if he lies against you, for a sinful act of disobedience cannot be met with further disobedience.<\/p>\n<p>Source: Aḥkām al-Qurʼān 1\/159<\/p><\/blockquote>\n<p>And Ibn Kathir commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَرَ بِالْعَدْلِ حَتَّى فِي الْمُشْرِكِينَ &#8230; أمر لهم بطاعة الله وتقواه، وإخباره بِأَنَّهُ تَعَالَى مَعَ الَّذِينَ اتَّقَوْا بِالنَّصْرِ وَالتَّأْيِيدِ في الدنيا والآخرة<\/p>\n<p>Allah ordered justice even with the idolaters… He ordered them to obey Allah and to fear Him, informing them that the Almighty is with those who fear Him by supporting and strengthening them in this world and in the Hereafter.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 1\/390<\/p><\/blockquote>\n<p>In other words, retaliation for wrongdoing must be legal, proportionate, and only against the offender himself, not his family, tribe, relatives, or fellow citizens. The retaliation must also be inherently lawful, in obedience to Allah, and not a sinful disobedient act. For example, it is forbidden in itself to lie or slander someone, so lying and slandering is not a permissible form of retaliation even if one is the victim of it.<\/p>\n<p>Likewise, treacherous behavior is sinful in itself and is not an appropriate response to being the victim of treachery, because treachery is always sinful in every case.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَخُنْ مَنْ خَانَكَ<\/p>\n<p><strong>Do not be treacherous to the one who betrays you.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1264, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/do-not-reciprocate-treachery\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The same principle applies to killing civilians, women, and children, since the Prophet (ṣ) condemned the killing of workers, servants, monks, women, children, and anyone who is not a hostile combatant in war.<\/p>\n<p>Abdullah ibn Umar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ<\/p>\n<p>A woman was found killed in one of the battles of the Messenger of Allah, peace and blessings be upon him, so the Prophet condemned the killing of women and children.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3014, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/jihad-killing-women-children\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) even refused to mutilate the dead corpses of idolaters after his own beloved uncle Hamza, may Allah be pleased with him, was mutilated by them, because mutilation is inherently unlawful. The main culprit, Hind bint ‘Utbah, eventually was forgiven and entered Islam as well.<\/p>\n<p>Ibn Taymiyyah illustrates this same principle using the example of telling lies, slander, and pronouncing excommunication (<em>takfir<\/em>):<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فلهذا كان أهل العلم والسنة لا يكفّرون من خالفهم وإن كان ذلك المخالف يكفرهم لأن الكفر حكم شرعي فليس للإنسان أن يعاقب بمثله ‌كمن ‌كذب ‌عليك وزنى بأهلك ليس لك أن تكذب عليه وتزني بأهله لأن الكذب والزنا حرام لحق الله وكذلك التكفير حق لله فلا يكفر إلا من كفره الله ورسوله<\/p>\n<p>For this reason, the scholars of the Sunnah would not excommunicate those who opposed them even if their opponents excommunicated them, as unbelief is a divine legal judgment and it is not for the human to punish with the likes of it. Such as one who lies against you or commits adultery with your relatives, it is not for you to lie against them or commit adultery with their relatives, as lies and adultery are forbidden by the right of Allah. Likewise, excommunication is the right of Allah and none may excommunicate anyone except those whom Allah and His Messenger have excommunicated.<\/p>\n<p>Source: al-Istighāthah bil-Radd &#8216;alá al-Bakrī 1\/252<\/p><\/blockquote>\n<p>Moreover, this principle of respecting the limits of retaliation applies to the sins of the tongue, such as cursing, backbiting, and supplicating against others.<\/p>\n<p>Aisha reported: Something of hers was stolen, so she began to supplicate against the thief. The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُسَبِّخِي عَنْهُ<\/p>\n<p><strong>Do not lighten his sin.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4909, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/31\/lessen-crimes\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Subki commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فان السب والسرقة يوزنان يوم القيامة فإذا كان السب أقل من السرقة خفت جريمة السارق ورجع صاحب الحق بما بقي له وإذا كانت السرقة أقل من السب عاد السارق على الساب بما بقى له من الحق<\/p>\n<p>For the curse and the theft will be weighed on the Day of Resurrection. If the curse is lesser than the theft, the crime of the thief is lessened and the rights are restored to the victim from what remains. If the theft is lesser than the curse, the thief will have his remaining rights restored from the one who cursed him.<\/p>\n<p>Source: al-Manhal al-ʻAdhib al-Mawrūd 8\/161<\/p><\/blockquote>\n<p>Imagine that a victim of theft wrongfully curses the thief so much that the victim will actually owe some of their good deeds to the thief on the Day of Resurrection!<\/p>\n<p>In this way, it is possible for victims of wrongdoing to become even worse than the people who first oppressed them. Likewise for rulers whose crimes seem great in the eyes of the masses.<\/p>\n<p>Ribah ibn ‘Ubaydah reported: I was sitting with Umar ibn Abdul Aziz, may Allah have mercy on him, when the ruler Al-Hajjaj was mentioned, so I reviled and denounced him. Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَهْلا يَا رَبَاحُ إِنَّهُ بَلَغَنِي أَنَّ الرَّجُلَ لَيُظْلَمُ بِالْمَظْلَمَةِ فَلا يَزَالُ الْمَظْلُومُ يَشْتِمُ الظَّالِمَ وَيَنْتَقِصُهُ حَتَّى يَسْتَوْفِيَ حَقَّهُ فَيكُونُ لِلظَّالِمِ عَلَيْهِ الْفَضْلُ<\/p>\n<p>Calm down, O Ribah! Verily, I have heard that a man might be oppressed with a great wrong, and he continues to revile and belittle his oppressor until he forfeits his right and he owes his oppressor even more.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/10\/27\/umar-ii-curses-becomes-worse\/\">al-Zuhd wal-Raqā’iq 667<\/a><\/p><\/blockquote>\n<p>‘Awf reported: I entered the home of Ibn Sirin, may Allah have mercy on him, and I began discussing the sins of the ruler Al-Hajjaj. Ibn Sirin said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِن اللَّه تَعَالَى حكم عدل فكما يأخذ من الْحَجَّاج يأخذ للحجاج وإنك إِذَا لقيت اللَّه عَزَّ وَجَلَّ غدا كَانَ أصغر ذنب أصبته أشد عليك من أَعْظَم ذنب أصابه الْحَجَّاج<\/p>\n<p>Verily, Allah Almighty is a just judge. Just as he passes judgment against Al-Hajjaj, he will pass judgment in favor of Al-Hajjaj. If you were to meet Allah tomorrow, the smallest sin you committed would be worse for you than the greatest sin Al-Hajjaj committed against you.<\/p><\/blockquote>\n<p>Al-Qushayri commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قيل يؤتى العبد يَوْم الْقِيَامَة كتابه فلا يرى فِيهِ حسنة فَيَقُول أين صلاتي وصيامي وطاعاتي فيقال ذهب عملك كُلهُ باغتيابك لِلنَّاسِ<\/p>\n<p>It is said that a servant will receive his book of deeds on the Day of Resurrection and he will not see any good in it. He will say: Where are my prayers? Where is my fasting? Where are my acts of obedience? It will be said: All of your good deeds have been lost because you were backbiting against people.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/04\/07\/ibn-sireen-rulers-your-sins\/\">al-Risālah al-Qushayrīyah 1\/291<\/a><\/p><\/blockquote>\n<p>Al-Hajjaj ibn Yusuf was a ruthless Caliph in the era of the Umayyads. Yet, Umar ibn Abdul Aziz and Ibn Sirin, both well-respected for their piety, warned people against excessively cursing and reviling him, as even Al-Hajjaj has rights that must be respected despite his brutal leadership. Indeed, our own sins, no matter how small, are more harmful to our Hereafter than anything an oppressor could do to us in this life.<\/p>\n<p>In sum, legal retaliation is permissible in Islam on the condition that it is lawful, not sinful in itself, and proportional to the original crime or wrong. Despite this, it is highly recommended to forgive the criminal or offender if doing so does not further endanger the public. Transgressing these limits has the potential to severely backfire on the victim. Even the sins of the tongue have the potential to render a victim worse off than his own oppressor on the Day of Resurrection.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not be treacherous to the one who betrays you.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[4],"tags":[127,384,282,386,183,99,449,27,385,32,37,47,48,404,397,220,98,128,332],"class_list":["post-23261","post","type-post","status-publish","format-standard","hentry","category-noble-quran","tag-adultery-zina","tag-backbiting-al-ghibah","tag-children","tag-curses-al-laan","tag-day-of-resurrection-yawm-al-qiyammah","tag-excommunication-takfir","tag-falsehood-al-kadhib","tag-god-fearing-taqwa","tag-guarding-the-tongue-hafz-al-lisan","tag-hereafter-akhirah","tag-idolatry-shirk","tag-jihad","tag-justice-adl","tag-legal-punishment-al-hudud","tag-rights-al-huquq","tag-supplication-al-dua","tag-unbelief-al-kufr","tag-women-nisa","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-63b","jetpack-related-posts":[{"id":25684,"url":"https:\/\/www.abuaminaelias.com\/supplication-oppressed-limits\/","url_meta":{"origin":23261,"position":0},"title":"Supplication Against Oppressors and its Limits","author":"Abu Amina Elias","date":"July 8, 2025","format":false,"excerpt":"\"Whoever pardons and seeks reconciliation, their reward is with Allah.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14928,"url":"https:\/\/www.abuaminaelias.com\/eye-for-an-eye\/","url_meta":{"origin":23261,"position":1},"title":"What is the meaning of &#8216;eye for an eye&#8217;?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"We ordained for them a life for a life, an eye for an eye...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15738,"url":"https:\/\/www.abuaminaelias.com\/muslims-not-punished-for-killing-non-muslims\/","url_meta":{"origin":23261,"position":2},"title":"Muslims not punished for killing non-Muslims?","author":"Abu Amina Elias","date":"May 28, 2014","format":false,"excerpt":"\"The general rule is that all crimes should be prosecuted and punished equally,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17033,"url":"https:\/\/www.abuaminaelias.com\/all-human-life-sacred-in-islam\/","url_meta":{"origin":23261,"position":3},"title":"All human life is sacred in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not kill the soul which Allah has made sacred...\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14152,"url":"https:\/\/www.abuaminaelias.com\/justice-and-fairness-for-all-in-islam\/","url_meta":{"origin":23261,"position":4},"title":"Justice and fairness for all in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, Allah orders justice and good conduct and giving to relatives,\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17207,"url":"https:\/\/www.abuaminaelias.com\/equality-under-law-non-muslims\/","url_meta":{"origin":23261,"position":5},"title":"Equal protection of law for Muslims and non-Muslims","author":"Abu Amina Elias","date":"October 20, 2015","format":false,"excerpt":"\"Islam guarantees the protection of civil law for all citizens and visitors,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23261","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23261"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23261\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23261"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23261"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23261"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}