{"id":23529,"date":"2021-09-04T19:35:26","date_gmt":"2021-09-04T15:35:26","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23529"},"modified":"2021-09-05T08:06:27","modified_gmt":"2021-09-05T04:06:27","slug":"anti-racism-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/","title":{"rendered":"Racial justice in the Quran and Sunnah"},"content":{"rendered":"<div id=\"ez-toc-container\" class=\"ez-toc-v2_0_75 counter-hierarchy ez-toc-counter ez-toc-grey ez-toc-container-direction\">\n<p class=\"ez-toc-title\" style=\"cursor:inherit\">Table of Contents<\/p>\n<label for=\"ez-toc-cssicon-toggle-item-689a5f020adb2\" class=\"ez-toc-cssicon-toggle-label\"><span class=\"\"><span class=\"eztoc-hide\" style=\"display:none;\">Toggle<\/span><span class=\"ez-toc-icon-toggle-span\"><svg style=\"fill: #999;color:#999\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" class=\"list-377408\" width=\"20px\" height=\"20px\" viewBox=\"0 0 24 24\" fill=\"none\"><path d=\"M6 6H4v2h2V6zm14 0H8v2h12V6zM4 11h2v2H4v-2zm16 0H8v2h12v-2zM4 16h2v2H4v-2zm16 0H8v2h12v-2z\" fill=\"currentColor\"><\/path><\/svg><svg style=\"fill: #999;color:#999\" class=\"arrow-unsorted-368013\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" width=\"10px\" height=\"10px\" viewBox=\"0 0 24 24\" version=\"1.2\" baseProfile=\"tiny\"><path d=\"M18.2 9.3l-6.2-6.3-6.2 6.3c-.2.2-.3.4-.3.7s.1.5.3.7c.2.2.4.3.7.3h11c.3 0 .5-.1.7-.3.2-.2.3-.5.3-.7s-.1-.5-.3-.7zM5.8 14.7l6.2 6.3 6.2-6.3c.2-.2.3-.5.3-.7s-.1-.5-.3-.7c-.2-.2-.4-.3-.7-.3h-11c-.3 0-.5.1-.7.3-.2.2-.3.5-.3.7s.1.5.3.7z\"\/><\/svg><\/span><\/span><\/label><input type=\"checkbox\"  id=\"ez-toc-cssicon-toggle-item-689a5f020adb2\"  aria-label=\"Toggle\" \/><nav><ul class='ez-toc-list ez-toc-list-level-1 ' ><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-1\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#Introduction\" >Introduction<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-2\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#The_Oneness_of_Humanity\" >The Oneness of Humanity<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-3\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#Love_of_Neighbor_Reconciliation_and_Redemption\" >Love of Neighbor, Reconciliation and Redemption<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-4\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#Universal_Justice\" >Universal Justice<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-5\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#The_Arrogance_of_Satan\" >The Arrogance of Satan<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-6\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#Racism_Tribalism_and_Violence\" >Racism, Tribalism, and Violence<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-7\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#Non-Violence_in_Spirit_Rhetoric_and_Action\" >Non-Violence in Spirit, Rhetoric, and Action<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-4'><a class=\"ez-toc-link ez-toc-heading-8\" href=\"https:\/\/www.abuaminaelias.com\/anti-racism-in-islam\/#Conclusion_A_Victory_of_Hearts_and_Minds\" >Conclusion: A Victory of Hearts and Minds<\/a><\/li><\/ul><\/nav><\/div>\n<h4><span class=\"ez-toc-section\" id=\"Introduction\"><\/span>Introduction<span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Racism is one of the most destructive forces at work in the modern world. It divides communities, justifies arbitrary discrimination and oppression, and even leads to senseless violence. It is incumbent upon every Muslim to reject racist attitudes within themselves and their communities. What does Islam teach us in this regard?<\/p>\n<p>First, we must have a clear understanding of what we mean when we use the term “racism” in order to evaluate its place in Islam. According to sociologist Navid Ghani:<\/p>\n<blockquote><p>Racism generally means believing that a person&#8217;s behavior is determined by stable inherited characteristics deriving from separate racial stocks; each of these distinctive attributes is then evaluated in relation to ideas of superiority and inferiority. This implies that there is a social construction in which certain groups of people are superior to others.<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p><\/blockquote>\n<p>Racism is fundamentally a belief that manifests itself in different ways, either through an individual&#8217;s behavior or an institutional system. The concept of “race” is, in reality, based upon long-discredited pseudoscientific pursuits such as eugenics. The modern scientific consensus is that human beings belong to the same species.  There are no meaningful biological differences between humans that would warrant legal, moral, or spiritual discrimination. However, the term “race” as used by many people today does not refer to this original biological distinction, but instead to human differences based on ethnicity, physical appearance (i.e. skin color, hair texture), national origin, or culture.<\/p>\n<p>Most people understand racism as prejudice or antagonism against others on the basis of perceived race, but the term has been redefined by some modern academics to mean “prejudice plus power,” adding an institutional component. Racism, in this view, is one directional: it can only be committed by those in power, whereas in the traditional definition of racism any person can hold racist attitudes and beliefs. This new stipulative definition of racism, influenced by postmodern philosophies of language, obscures and confuses more than it enlightens. It has been criticized because “it relies on a simplistic conception of power as a zero sum game. It does not account for unevenness in prejudicial attitudes, or the relationship between beliefs and actions.”<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a>  One can observe heated debates today over “racism” that are intractable because participants are using completely different definitions of the word without realizing it. This paper does not engage the debate over racial disparities, policing, or privilege, but rather it establishes the indisputable theological foundation from which this discussion must take place.<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<p>For our purposes, we understand racism in its traditional sense as an individual belief in the superiority of one race or ethnicity over another, because this is the false belief that precedes and justifies systems of oppression. When an institutional component is present, it can be called “systemic racism” or “institutional racism.” Thus, in the traditional definition, any individual can be racist and any ethnic group can potentially be the victim of racism. Since racism is the belief in one’s own racial superiority over others, it must be fought primarily in the realm of ideas. Racism is the combination of arrogance in the heart and false beliefs in the mind, which means every racist can be reformed if they are persuaded to change. The goal, then, is not so much anti-racist (against people) as it is anti-racism (against ideas).<\/p>\n<p>The creed of Islam provides the theological foundation for combatting racism as it exists in the hearts and minds of people. The great civil rights activist, Malcolm X, recognized the powerful spiritual resources in Islam when he witnessed true multiracial brotherhood in Mecca:<\/p>\n<blockquote><p>America needs to understand Islam, because this is the one religion that erases from its society the race problem. Throughout my travels in the Muslim world, I have met, talked to, and even eaten with people who in America would have been considered ‘white’ but the ‘white’ attitude was removed from their minds by the religion of Islam. I have never before seen sincere and true brotherhood practiced by all colors together, irrespective of their color.<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p><\/blockquote>\n<p>This essay details the tenets of Islam that are directly relevant to the issue of racism. Many of these precepts are also shared by Jews, Christians, and other religions, traditions, and philosophies. The following sections will explain the theological concepts of the oneness of humankind, religious love for our neighbors, universal justice, the mortal vice of arrogance, the paradigm of tribalism and violence (which is the essence of racism), and comprehensive non-violent resistance to forms of oppression based upon racism.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"The_Oneness_of_Humanity\"><\/span><strong>The Oneness of Humanity<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>The most important concept in the struggle against racism is the creedal belief of humanity’s shared origin from our common parents, Adam and Eve. Regardless of our differences in skin color, ethnicity, politics, or even religion, every human being has a fundamental connection to every other human being that is embedded in the creation itself and proclaimed by the laws of nature and divine revelation.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُم مِّن نَّفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا<\/p>\n<p><strong>O people, be mindful of your Lord who created you from a single soul and from it created its mate, and from it spread many men and women. Be mindful of Allah, by whom you ask each other and maintain family ties. Verily, Allah is ever watching over you.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:1<\/p><\/blockquote>\n<p>Addressing all people and not only Muslims, this verse declares that humankind, with all of its diversity, originated from a single set of parents. For this reason, it is in the name of God that we declare our oaths and in His name we justify the human rights “we ask of each other.” According to the great companion Ibn Abbas, what we “ask each other” is, in fact, that we be:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تعاطفون به<\/p>\n<p> …compassionate to each other.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 4:1<\/p><\/blockquote>\n<p>It is the undeniable mutual human connection that justifies and, indeed, demands that we show grace, sympathy, and fairness to one another in the same way we would like such treatment for ourselves.<\/p>\n<p>Logically, then, the only morally relevant characteristic a human being possesses is the content of their character and not the color of their skin or anything else. So important is this human origin story and its powerful implications that the Prophet (ṣ) strongly emphasized it in his farewell sermon, his final message to the world:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ أَلَا إِنَّ رَبَّكُمْ وَاحِدٌ وَإِنَّ أَبَاكُمْ وَاحِدٌ أَلَا لَا فَضْلَ لِعَرَبِيٍّ عَلَى أَعْجَمِيٍّ وَلَا لِعَجَمِيٍّ عَلَى عَرَبِيٍّ وَلَا لِأَحْمَرَ عَلَى أَسْوَدَ وَلَا أَسْوَدَ عَلَى أَحْمَرَ إِلَّا بِالتَّقْوَى أَبَلَّغْتُ<\/p>\n<p><strong>O people, your Lord is one and your father Adam is one. There is no favor of an Arab over a foreigner, nor a foreigner over an Arab, and neither white skin over black skin, nor black skin over white skin, except by righteousness. Have I not delivered the message?<\/strong><\/p>\n<p>Source: Musnad Aḥmad 23489, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/12\/30\/lord-father-adam-one\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This message was indeed a sharp paradigm shift from the Arab tribal allegiances in the time of pre-Islamic ignorance, such tribalism which was nothing more than pre-modern racism. No longer would the moral worth of a human being be judged by their lineage, ethnicity, or appearance, but rather only by their righteousness with Allah and His Creation. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ قَدْ أَذْهَبَ عَنْكُمْ عُبِّيَّةَ الْجَاهِلِيَّةِ وَتَعَاظُمَهَا بِآبَائِهَا فَالنَّاسُ رَجُلَانِ بَرٌّ تَقِيٌّ كَرِيمٌ عَلَى اللَّهِ وَفَاجِرٌ شَقِيٌّ هَيِّنٌ عَلَى اللَّهِ وَالنَّاسُ بَنُو آدَمَ وَخَلَقَ اللَّهُ آدَمَ مِنْ تُرَابٍ<\/p>\n<p><strong>O people, Allah has removed the slogans of ignorance from you and the exaltation of its forefathers. The people are only two kinds: either a righteous, Godfearing believer dignified to Allah, or a wicked, miserable sinner insignificant to Allah. The people are all the children of Adam and Adam was created from dust. <\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3270, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/01\/11\/all-people-children-of-adam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْظُرْ فَإِنَّكَ لَيْسَ بِخَيْرٍ مِنْ أَحْمَرَ وَلَا أَسْوَدَ إِلَّا أَنْ تَفْضُلَهُ بِتَقْوَى<\/p>\n<p><strong>Behold! Verily, you have no virtue over one with white skin or black skin, except by favor of righteousness.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 21407, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/01\/04\/racism-no-favor-skin-color\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَنْسَابَكُمْ هَذِهِ لَيْسَتْ بِسِبَابٍ عَلَى أَحَدٍ وَإِنَّمَا أَنْتُمْ وَلَدُ آدَمَ لَيْسَ لِأَحَدٍ عَلَى أَحَدٍ فَضْلٌ إِلَّا بِالدِّينِ أَوْ عَمَلٍ صَالِحٍ حَسْبُ الرَّجُلِ أَنْ يَكُونَ فَاحِشًا بَذِيًّا بَخِيلًا جَبَانًا<\/p>\n<p><strong>Verily, these lineages of yours give no cause over anyone. All of you are only the children of Adam. No one is better than another except by religion and good deeds. It is enough sin for a man to be obscene, a spreader of gossip, miserly, or cowardly.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 17313, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/01\/04\/none-superior-except-good\/\"><em><strong>Sahih li ghayrihi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Mulla &#8216;Ali al-Qari comments on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّكُمْ فِي الِانْتِسَابِ إِلَى أَبٍ وَاحِدٍ بِمَنْزِلَةٍ وَاحِدَةٍ &#8230; ثُمَّ اعْلَمْ أَنَّ التَّفَاضُلَ لَيْسَ بِالنَّسَبِ وَلَكِنْ بِالتَّقْوَى<\/p>\n<p>All of you are related to one father, in one position&#8230; Then, know that superiority is not by lineage, but rather by righteousness.<\/p>\n<p>Source: Mirqāt al-Mafātīḥ 7\/3078<\/p><\/blockquote>\n<p>Likewise, Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَقُولُ الرَّجُلُ لِلرَّجُلِ أَنَا أَكْرَمُ مِنْكَ فَلَيْسَ أَحَدٌ أَكْرَمَ مِنْ أَحَدٍ إِلا بِتَقْوَى اللَّهِ<\/p>\n<p>A man might say to another man, ‘I am more noble than you,’ yet no one is more noble except by the mindfulness of Allah.<\/p>\n<p>Source: al-Adab al-Mufrad 898, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/07\/04\/none-made-noble-except-taqwa\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The natural human differences people have come to associate with the social construct of “race,” such as skin color, hair texture, and other benign characteristics, are in reality part of the divine plan. Allah intended for humans to be different, not because He wanted to make one “race” of humans superior to another, but rather to display the glory and wisdom of the Creator for all to see.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ<\/p>\n<p><strong>O people, We have created you from male and female and made you into people and tribes that you may know one another. Verily, the most noble of you to Allah is the most righteous of you.<\/strong><\/p>\n<p>Surat al-Hujurat 49:13<\/p><\/blockquote>\n<p>Al-Tabari explains this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِيَعْرِف بَعْضكُمْ بَعْضًا فِي قُرْب الْقَرَابَة مِنْهُ وَبُعْده لَا لِفَضِيلَةٍ لَكُمْ فِي ذَلِكَ وَقُرْبَة تُقَرِّبكُمْ إِلَى اللَّه بَلْ أَكْرَمَكُمْ عِنْد اللَّه أَتْقَاكُمْ<\/p>\n<p>…that you may know each other as relatives and thereafter, not for your superiority in that or that your relations bring you closer to Allah. No, rather the most noble to Allah are the most righteous of you.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 49:13<\/p><\/blockquote>\n<p>Where would be the splendor of the Creator had all human beings looked the same, talked the same, and thought the same? Al-Ghazali expresses a similar sentiment on the unity of humanity:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَفَاوُتَ فِي أَنْسَابِكُمْ لِاجْتِمَاعِكُمْ فِي أَصْلٍ وَاحِدٍ<\/p>\n<p>There is no fault between your lineages, since all of you come from the same single source.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/375<\/p><\/blockquote>\n<p>It is also reported that this verse was revealed on the day Mecca was liberated from the idolatrous aristocracy. Bilal ibn Rabah, the noble companion and former slave, was appointed to deliver the call to prayer and a man objected, “This black slave will announce prayer at the Ka’bah?” Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ<\/p>\n<p><strong>Verily, the most noble of you to Allah is the most righteous of you.<\/strong><\/p>\n<p>Surat al-Hujurat 49:13<\/p><\/blockquote>\n<p>Shaykh al-Muḥasibi added:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فيعرف أن أصله وأصل بني آدم كلهم واحد<\/p>\n<p>It is known that his origin and the origin of all the children of Adam are one and the same.<\/p>\n<p>Source: Al-Ri’āyat li-Ḥuqūq Allāh 1\/363<\/p><\/blockquote>\n<p>Unlike the period of barbarism before Islam, the Prophet’s (ṣ) divine message completely rejected the notion that any person could be considered sub-human. Despite the unjust social disadvantages Bilal suffered in the time of pre-Islamic racism and slavery, it was by his righteousness alone that he rose to become a revered leader in the Muslim community. The second righteous Caliph, Umar ibn al-Khattab, would say about him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبُو بَكْرٍ سَيِّدُنَا وَأَعْتَقَ سَيِّدَنَا يَعْنِي بِلَالًا<\/p>\n<p>Abu Bakr is our master and he emancipated our master Bilal.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3754, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/19\/bilal-from-slave-to-master\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It was Abu Bakr who had purchased Bilal and set him free. Islam established the creed that the downtrodden who might be considered the lowest caste in their societies could actually become the greatest in the sight of Allah and the Muslim community.<\/p>\n<p style=\"text-align: right;\">In truth, the diversity of humankind is a clear sign of Allah’s majesty, as He said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافُ أَلْسِنَتِكُمْ وَأَلْوَانِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّلْعَالِمِينَ<\/p>\n<p><strong>Among His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Verily, in that are signs for those with knowledge. <\/strong><\/p>\n<p>Surat al-Rum 30:22<\/p><\/blockquote>\n<p>And the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ تَعَالَى خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيعِ الْأَرْضِ فَجَاءَ بَنُو آدَمَ عَلَى قَدْرِ الْأَرْضِ فَجَاءَ مِنْهُمْ الْأَحْمَرُ وَالْأَبْيَضُ وَالْأَسْوَدُ وَبَيْنَ ذَلِكَ وَالسَّهْلُ وَالْحَزْنُ وَالْخَبِيثُ وَالطَّيِّبُ<\/p>\n<p style=\"text-align: left;\"><strong>Verily, Allah Almighty created Adam from a handful which He took from the earth, so the children of Adam come in accordance with the earth. Some come with red skin, white skin, or black skin, and whatever is in between: smooth and rough, bad and good.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2955, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/06\/12\/all-created-from-adam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>All of this is to say that human beings enjoy a degree of dignity simply for being human, as Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا<\/p>\n<p><strong>We have certainly honored the children of Adam and carried them on the land and sea and provided good things for them, and We favored them over much of what We have created, with decisive preference. <\/strong><\/p>\n<p>Surat al-Isra’ 17:70<\/p><\/blockquote>\n<p>It is a self-evident truth that every person is born with inherent dignity equal to any other person, regardless of their class, their lineage, their tribe, or their “race.” The eminent civil rights leader Malcolm X, who adopted the Muslim name El-Hajj Malik El-Shabazz, was a victim of white supremacist racism during his entire life, from his tragic childhood to his incarceration, even at one point considering white people to be devils incarnate. But it was his remarkable spiritual transformation after performing the Ḥajj pilgrimage to Mecca that solidified his legacy as a true leader. Upon meeting white Muslims at Ḥajj, his great epiphany began with his realization of “the Oneness of Man under One God.”  He had finally found the truth that the violence of white supremacy had obscured his whole life, writing, “The brotherhood! The people of all races, colors, from all over the world coming together as one! It has proved to me the power of the One God.”<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a> Malcolm excitedly wrote to his family, friends, and colleagues back home, saying:<\/p>\n<blockquote><p>I could see from this, that perhaps if white Americans could accept the Oneness of God, then perhaps, too, they could accept in reality the Oneness of Man, and cease to measure, and hinder, and harm others in terms of their ‘differences’ in color.<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/p><\/blockquote>\n<p>When he saw the lived reality of monotheism (<em>tawhid<\/em>), it completely erased the hatred he used to harbor towards white people as a whole. It gave him hope and showed him the path of redemption for America’s wrongs was rooted in faith in the God of Abraham.<\/p>\n<p>Racial justice and healing must begin on a level playing field for everyone, and this is what is meant by “equality” as applied to race. It is not to say all people are the same, of course they are not. Instead, it is to declare that everyone starts their lives with equal moral worth, that all people deserve equal protection of the law and are entitled to equal opportunities for social advancement.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"Love_of_Neighbor_Reconciliation_and_Redemption\"><\/span><strong>Love of Neighbor, Reconciliation and Redemption<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>Since all human beings are irrevocably connected in their origin, all ethics must be based in reciprocity and good will. What we love for ourselves, we must love for others as well. Neighborliness, which is people living amicably together in close proximity, is the elemental relationship of a just society. There is no good reason, in principle, why people of different races or ethnicities cannot live together in peace. Yet, racists insist on segregating people on the basis of race and they might even invoke the slogan, “Separate but equal,” in a vain attempt to provide a thin veneer of justice. But the truth is that, when it comes to race, separate is not and can never be equal. Rather, full integration of people as loving neighbors, without regard to race or the unreasonable demand to abandon one’s ethnic culture through assimilation, is the only way to ensure equal protection and opportunity for everyone, especially the disenfranchised.<\/p>\n<p>Such as it is, anti-racism activism must adopt an end-goal vision of the neighborly society in which all members love for each other what they love for themselves. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you will have faith until he loves for his brother what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 13, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/18\/love-brother-neighbor-self\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَتَّى يُحِبَّ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>Until he loves for his neighbor what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 45, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/18\/love-brother-neighbor-self\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And in another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ وَحَتَّى يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ عَزَّ وَجَلَّ<\/p>\n<p style=\"text-align: left;\"><strong>None of you have faith until he loves for people what he loves for himself, and until he loves a person only for the sake of Allah Almighty.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 13875, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/27\/until-he-loves-for-people\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The principle of ethical reciprocity holds true for both Muslims and non-Muslims, blacks and whites, friends and foes alike. Shaykh Hamzah Muhammad Qasim, one of the leading contemporary scholars of Medina, commented on these traditions, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حتى يحب لأخيه على عموم الأخوة حتى يشمل الكافر والمسلم فيحب لأخيه الكافر ما يحب لنفسه من الدخول في الإسلام ولذلك ندب الدعاء له بالهداية وقد كان النبي صلى الله عليه وسلم يدعو لكفار قريش بالخير ويحبه لهم ويقول اللهم اهد قومي فإنهم لا يعلمون ومما يؤكد أن المراد محبة الخير للناس جميعاً لا فرق بين مسلم وكافر قوله صلى الله عليه وسلم أفضل الإيمان أن تحب للناس ما تحب لنفسك وتكره لهم ما تكره لنفسك<\/p>\n<p>The Prophet’s (ṣ) saying to love for his brother what he loves for himself is interpreted as universal brotherhood, such that it includes the unbeliever and the Muslim, and he should love for his brother, the unbeliever, what he loves for himself, which is his entering Islam. For this reason it is recommended to supplicate for their guidance. The Prophet (ṣ) invited the unbelievers of the Quraysh to goodness and he loved good for them. He would say, ‘O Allah, guide my people for they do not know.’ This confirms that the meaning is to love good for all people. There is no distinction between a Muslim and an unbeliever in his saying that the best of faith is to love for people what you love for yourself and to hate for people what you hate for yourself.<\/p>\n<p>Source: Manār al-Qārī 1\/91<\/p><\/blockquote>\n<p>That is, when faith is perfected, the believers love even for their enemies what they love for themselves, praying for their guidance, hoping for their repentance, and persuading them to follow the path of righteousness. If it is a virtue to respond in good will to our adversaries, how much more deserving are our peaceful neighbors?<\/p>\n<p>Muslims, indeed all people, have a duty to take care of their neighbors within the limits of their capacity. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ الأَصْحَابِ عِنْدَ اللَّهِ خَيْرُهُمْ لِصَاحِبِهِ وَخَيْرُ الْجِيرَانِ عِنْدَ اللَّهِ خَيْرُهُمْ لِجَارِهِ<\/p>\n<p><strong>The best companion to Allah is the best to his companions, and the best neighbor to Allah is the best to his neighbors.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1944, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/23\/best-neighbor-companion\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) said three times:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهِ لَا يُؤْمِنُ<\/p>\n<p><strong>By Allah, he does not have faith!<\/strong><\/p><\/blockquote>\n<p>It was said, “Who is it, O Messenger of Allah?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الَّذِي لَا يَأْمَنُ جَارُهُ بَوَايِقَهُ<\/p>\n<p><strong>He whose neighbor is not safe from his harm.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6016, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/12\/not-believer-neighbor-unsafe\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ مَنْ لَا يَأْمَنُ جَارُهُ بَوَائِقَهُ<\/p>\n<p><strong>He will not enter Paradise whose neighbor is not secure from his evil.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 46, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/11\/harms-neighbor-not-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet (s) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا هُوَ بِمُؤْمِنٍ مَنْ لَمْ يَأْمَنْ جَارُهُ بَوَائِقَهُ<\/p>\n<p><strong>He is not a believer whose neighbor is not safe from his harm.<\/strong><\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 24836, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/23\/not-true-believe-harm-neighbor\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا آمَنَ بِي مَنْ بَاتَ شَبْعَانًا وَجَارُهُ جَائِعٌ إِلَى جَنْبِهِ وَهُوَ يَعْلَمُ بِهِ<\/p>\n<p><strong>He is not a believer whose stomach is filled while the neighbor to his side goes hungry.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr 751, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/23\/not-believer-neighbors-hungry\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>These are Islamic duties whether our neighbors are Muslims or not. Just as there is no religious distinction in these basic duties between neighbors in Islam, there is no racial distinction either.<\/p>\n<p>The most important component of the neighborly relationship is love, but we clarify here what is meant by “love,” since there are many different kinds of love. This type of neighborly and religiously-inspired love is to love good for people the same as we love for ourselves. It may manifest as warmth and affection to be sure, but not necessarily so, for one may strongly dislike a cruel neighbor while at the same time wishing for Allah to guide them and bless them, as he himself would love to be guided and blessed.  This love is the basis of civilizational progress and human cooperation. Raghib al-Iṣfahani tells us:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكل قوم إذا تحابوا تواصلوا وإذا تواصلوا تعاونوا وإذا تعاونوا عملوا وإذا عملوا عمروا وإذا عمروا عمروا<\/p>\n<p>For every people, if they love each other, they will form a connection to each other. If they are connected, they will cooperate with each other. If they cooperate, they will work together. If they work together, they will build civilization, and if they build civilization, they will prosper.<\/p>\n<p>Source: Al-Dharīʻah ilá Makārim al-Sharīʻah 1\/257<\/p><\/blockquote>\n<p>In truth, neighborly love is essential for human flourishing and such love makes no distinction with regards to race or religion. It is not the same as warmth or affection, because showing affection to wrongdoers either emboldens their sins or oppresses their victims. Rather, neighborly love is the manifestation of goodwill, as a benevolent and sincere intention. Righting the wrongs of past racism, and healing the wounds still suffered today, can only truly be based on the spirit of love and not the thirst for vengeance.<\/p>\n<p>An Islamic form of anti-racism activism must be guided by neighborly love, which sets out a vision for what the post-racism world might look like. The end game is redemption and reconciliation, the development of a beloved community united by the monotheistic belief that all people have been created equal. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصِّيَامِ وَالصَّلَاةِ وَالصَّدَقَةِ<\/p>\n<p><strong>Shall I not tell you of what is better in degree than extra fasting, prayer, and charity?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course!” The Prophet (s) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَلَاحُ ذَاتِ الْبَيْنِ فَإِنَّ فَسَادَ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ<\/p>\n<p><strong>Reconciliation between people. Verily, corrupted relations between people is the razor.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2509, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/08\/islah-dhat-bayn-better\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) also encouraged the believers to love one another and he warned him about the destructive effects of hatred:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ لا تَدْخُلُوا الْجَنَّةَ حَتَّى تُسْلِمُوا وَلا تُسْلِمُوا حَتَّى تَحَابُّوا وَأَفْشُوا السَّلامَ تَحَابُّوا وَإِيَّاكُمْ وَالْبُغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ لا أَقُولُ لَكُمْ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ<\/p>\n<p><strong>By the one in whose hand is my soul, you will not enter Paradise until you submit to Allah and you will not submit until you love one another. Spread peace and you will love one another. Beware of hatred, for it is the razor. I do not say that it shaves hair, but rather it shaves away the religion.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad 260, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/02\/spread-love-peace-beware-hatred\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>It is this religious-type of love, an expression of goodwill and good intentions, selfless and humble, which is sincere for the sake of Allah and seeks no worldly gain other than to earn Allah’s pleasure; this type of love forms the basis for the society in which we all want to live as equals. The classical scholar, Najm al-Din al-Ṭufi, speaks to the transformative power of religious love to remake society along the lines willed by the Creator:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فمقصوده ائتلاف قلوب الناس وانتظام أحوالهم وهو قاعدة الإسلام الكبرى التي أوصى الله عزَّ وجلَّ بها &#8230; وبيان ذلك أنه إذا أحبَّ كل واحد من الناس لباقيهم ما يحب لنفسه أحسن إليهم ولم يؤذهم لأنه هو يحب لنفسه أن يُحسَنَ إليه ولا يُؤذَى وإذا أحسن إليهم ولم يؤذهم أحبوه فتسري بذلك المحبة بين الناس وبسريان المحبة بينهم يسرى الخير ويرتفع الشر وبذلك ينتظم أمر المعاش والمعاد وتصلح أحوال العباد<\/p>\n<p>The objective of this prophetic tradition is to unite the hearts of people and rectify their circumstances, and it is a major principle in Islam that Allah Almighty has enjoined… In clarification of that, if every person loved for others what he loves for himself, he would treat them in the best manner, he would not harm them because he loves for himself to be treated well, and he himself would not be harmed. If he treats them well and does not harm those whom he loves, then love will emanate from that between people, and with the emanation of love between them will be the emanation of good and the removal of evil, and with that the rectification of daily life and habits and the improvement of people’s circumstances.<\/p>\n<p>Source: al-Ta’yīn fī Sharḥ al-Arba’īn 1\/124-125<\/p><\/blockquote>\n<p>Grounding our anti-racism activism in religious love does not mean pacifism or acquiescence, nor does it preclude taking legal measures or legitimate self-defense. The eminent civil rights leader, Dr. Martin Luther King Jr., consistently explained this important distinction:<\/p>\n<blockquote><p><em>Agape<\/em> (“love”) is understanding, creative, and redemptive good will for all men. Biblical theologians would say it is the love of God working in the minds of men. It is an overflowing love which seeks nothing in return. And when you come to love on this level you begin to love men not because they are likable, not because they do things that attract us, but because God loves them and here we love the person who does the evil deed while hating the deed that the person does. It is the type of love that stands at the center of the movement that we are trying to carry on in the Southland.<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/p><\/blockquote>\n<p>He expounds on this principle again in another place, “In speaking of love at this point, we are not referring to some sentimental or affectionate emotion. It would be nonsense to urge men to love their oppressors in an affectionate sense… the best way to assure oneself that love is disinterested is to have love for the enemy-neighbor from whom you can expect no good in return, but only hostility and persecution.”<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a> Dr. King is expressing here the proverb, “Hate the sin, love the sinner.” This principle is not foreign to Islam at all. Rather, it was an opinion among the righteous predecessors. As recorded by Ibn Rajab:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ بَعْضُ الصَّالِحِينَ مِنَ السَّلَفِ أَهْلُ الْمَحَبَّةِ لِلَّهِ نَظَرُوا بِنُورِ اللَّهِ وَعَطَفُوا عَلَى أَهْلِ مَعَاصِي اللَّهِ مَقَتُوا أَعْمَالَهُمْ وَعَطَفُوا عَلَيْهِمْ لِيُزِيلُوهُمْ بِالْمَوَاعِظِ عَنْ فِعَالِهِمْ وَأَشْفَقُوا عَلَى أَبْدَانِهِمْ مِنَ النَّارِ وَلَا يَكُونُ الْمُؤْمِنُ مُؤْمِنًا حَقًّا حَتَّى يَرْضَى لِلنَّاسِ مَا يَرْضَاهُ لِنَفْسِهِ<\/p>\n<p>Some of the predecessors said: The people who love Allah look by the light of Allah and they are compassionate with those who disobey Allah. They hate their actions but show mercy to them so that through their warnings they might leave their actions. They are afraid that the Hellfire will consume their bodies. The believer will not truly be a believer until he is pleased for people to have what he is pleased for himself.<\/p>\n<p>Source: Jāmiʿ al-ʿUlūm wal-Ḥikam 1\/308<\/p><\/blockquote>\n<p>We find this principle in action during several events in the lives of the Prophets, most notably when Joseph forgave his brothers even after they sold him into slavery, saying to them:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ ۖ يَغْفِرُ اللَّهُ لَكُمْ ۖ وَهُوَ أَرْحَمُ الرَّاحِمِينَ<\/p>\n<p><strong>No blame is upon you today. May Allah forgive you, for He is the Most Merciful of the merciful.  <\/strong><\/p>\n<p>Surat Yusuf 12:92<\/p><\/blockquote>\n<p>Prophet Muhammad (ṣ) cited this Quranic verse verbatim when he forgave his own people after decades of persecution:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَقُولُ كَمَا قَالَ يُوسُفُ لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ<\/p>\n<p><strong>I say to you as Joseph said: No blame is upon you today. May Allah forgive you, for He is the Most Merciful of the merciful.  <\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá 18275, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/12\/prophet-compassion-enemies\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, in our case, we can express the religious love of good will towards racists, hoping for their repentance and change of heart, while at the same time rejecting, resisting, and opposing their racism and, if necessary, denying them the warmth of affection (<em>mawaddah<\/em>). As put by Dr. King, “We are out to defeat injustice and not white persons who may be unjust.”<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p>\n<p>In sum, the virtue of neighborly love serves two important purposes in the anti-racism movement, as a vision and a method. The vision is the end-goal of a neighborly society where all races and ethnicities live together in harmony and cooperation for the common good. The method is the adoption of nonviolent tactics that seek to persuade rather than coerce, to redeem rather than take revenge, and to reconcile rather than humiliate. For a victory for racial justice is not found in the false zero-sum game of one race dominating another or exacting revenge for past wrongs, but instead the real triumph is the establishment of safe multiracial neighborhoods, with good-paying jobs, quality education, and equal opportunities for all to prosper together and freely worship their Creator.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"Universal_Justice\"><\/span><strong>Universal Justice<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>Neighborly love is, of course, the ideal towards which we should strive in our anti-racism work, but the reality of life is that some people do not love each other and they might never be able to bring themselves to show goodwill to those they hate. Hence, society is in need of universal standards of justice that apply across the board, without regard to race, religion, or gender. Rāghib al-Iṣfahānī makes this profoundly important point, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أحد أسباب نظام أمور الناس المحبة ثم العدل ولو تحاب الناس وتعاملوا بالمحبة لاستغنوا بها عن العدل فقد قيل العدل خليفة المحبة يستعمل حيث لا توجد المحبة<\/p>\n<p>One of the means of ordering the affairs of people is love, then justice. If people loved each other and dealt with each other in love, there would be no need for justice. As it is said: Justice is the successor of love. It is applied whenever love is not found.<\/p>\n<p>Source: Al-Dharīʻah ilá Makārim al-Sharīʻah 1\/257<\/p><\/blockquote>\n<p>Love comes from the heart and it is simply not possible to reach the heart of every person, especially those consumed by malice and envy. In that case, justice must be enacted so that the basic human rights of all people may be secured.<\/p>\n<p>The Quran has two words for justice: <em>al-’Adl<\/em> and <em>al-Qist<\/em>. The first type of justice is the justice of equality, embodied by the equal protection that the law must provide to all of its citizens, Muslims or non-Muslims, black or white and all colors in between. The second type of justice is the fairness of distribution, embodied by the Islamic pillar of Zakat, which redistributes a reasonable amount of wealth from the rich to the poor.<\/p>\n<p>As for the justice of equality, Allah commands impartiality in its administration such that no one is favored over another in their basic rights. As the ancient proverb states, “Justice is blind,” meaning, an honest judge will hear the merits of a case and issue a ruling to the aggrieved party without considering at all the race, religion, or social status of the plaintiffs or defendants.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ<\/p>\n<p><strong>Verily, Allah orders justice and good conduct and giving to relatives and He forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded.<\/strong><\/p>\n<p>Surat al-Nahl 16:90<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَن تَعْدِلُوا<\/p>\n<p><strong>O you who have faith, be persistently standing firm in justice as witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. Follow not your desires, lest you not be just.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:135<\/p><\/blockquote>\n<p>And the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تبارك وتعالى يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا<\/p>\n<p><strong>Allah Almighty said: O My servants, I have forbidden injustice for Myself and I have forbidden it among you, so do not oppress one another.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2577, <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/allah-has-forbidden-oppression\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) likewise praised those who uphold justice and detailed their divine reward as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِينٌ الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا<\/p>\n<p><strong>Verily, those who were just will be in the presence of Allah, upon pulpits of light, near the right hand of the Merciful, the Exalted, and both of His sides are honorable. They are those who practiced justice in their judgments, with their families, and in all that they did.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1827, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/04\/just-right-hand-al-rahman\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>One of the primary obstacles to justice exploited by Satan is the hatred that exists between people. In the time of the Prophet (ṣ) and his companions in Medina, the idolaters of Mecca had barred the Muslims from completing the pilgrimage to the Ka’bah, a clearly unjust act of aggression. Even after the Muslims eventually won control of Mecca, several Muslims did not forget the injustice they endured and perhaps thirsted for revenge, but Allah warned the Muslims not to late hatred motivate them to reciprocate injustice.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ أَن صَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ أَن تَعْتَدُوا ۘ وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ ۖ وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَ<\/p>\n<p><strong>Do not let hatred of people for having obstructed you from the Sacred Mosque lead you to transgress. Cooperate in righteousness and piety, but do not cooperate in sin and aggression.<\/strong><\/p>\n<p>Source: Surat al-Ma’idah 5:2<\/p><\/blockquote>\n<p>This means that any retaliation against oppressors, which is permissible although forgiveness is always recommended when possible, must be enacted within the confines of the Sacred Law. As explained by Shaykh al-Sa’di commenting on this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإن العبد عليه أن يلتزم أمر الله ويسلك طريق العدل ولو جُنِي عليه أو ظلم واعتدي عليه فلا يحل له أن يكذب على مَنْ كذب عليه أو يخون مَنْ خانه<\/p>\n<p>For the servant must follow the command of Allah and traverse the path of justice. If a crime is committed, a wrong, or a transgression against oneself, it is not lawful for him to tell lies against one who lied against him, nor to act treacherously against one who was treacherous against him.<\/p>\n<p>Source: Tafsīr al-Sa’dī 5:2<\/p><\/blockquote>\n<p>This principle must be well-understood, that the Muslim nation is a nation of laws; vigilante justice or reciprocating sin with sin is not justice at all. Even so, patient restraint and forgiveness of injustice is always recommended if the offense can be reasonably endured, as Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ<\/p>\n<p><strong>Whoever is patient and forgives, that is surely of the matters requiring firm resolve.<\/strong><\/p>\n<p>Surat al-Shura 42:43<\/p><\/blockquote>\n<p>Forgiveness opens up the possibility of reconciliation, leading to mutual love between the oppressed and their former oppressors, which is the ultimate goal of a truly just society.<\/p>\n<p>So corrupting is the influence of malicious hatred on religion that the Prophet (ṣ) cautioned us, as cited earlier, that it is a “razor” that shaves away the religion, meaning it could progressively corrode a believer’s character until their very faith is at risk. Indeed, Allah repeats this warning twice in the same chapter:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ ۖ<\/p>\n<p><strong>O you who have faith, be persistently standing firm for Allah as witnesses in justice, and do not let the hatred of people stop you from being just. Be just, for that is closer to righteousness.<\/strong><\/p>\n<p>Surat al-Ma’idah 5:8<\/p><\/blockquote>\n<p>The implications of these admonitions is that justice is a universal value, applying the same to all human beings. Al-Qurtubi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ودلّت الآية أيضاً على أن كفر الكافر لا يمنع من العدل عليه<\/p>\n<p>This verse also shows that the unbelief of the unbeliever does not prevent him from benefitting from justice.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 5:8<\/p><\/blockquote>\n<p>People deserve basic rights &#8211; such as life, property, and safety &#8211; just for being a child of Adam. There can be no two-tiered justice system in Islam, favoring Muslims over non-Muslims, let alone one race over another.<\/p>\n<p>The truth is that some standards of justice preceded revelation, can be recognized by reason, and are embedded within the creation, what some philosophers refer to as “natural law,” which in reality is simply another manifestation of Allah’s divine attribute of justice. This natural justice is a basis for common ground between all people of different religions and races. A clear example is found in the pre-Islamic Meccan pact known as the Hilf al-Fudul (“alliance of the virtuous”). The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ شَهِدْتُ فِي دَارِ عَبْدِ اللَّهِ بْنِ جُدْعَانَ حِلْفًا مَا أُحِبُّ أَنَّ لِيَ بِهِ حُمْرَ النَّعَمِ وَلَوْ أُدْعَى بِهِ فِي الإِسْلامِ لأَجَبْتُ<\/p>\n<p><strong>I witnessed a pact of justice in the house of Abdullah ibn Jud’an that was more beloved to me than a herd of expensive red camels. If I were called to it now in the time of Islam, I would respond.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá 13080, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/06\/prophet-universal-justice\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Even before Islam, the Meccan idolaters knew that murder, theft, and other crimes are wrong. The revelation of the Quran was brought down to affirm these universal facts known by reason and to fill in the details when reason is insufficient. Every human being, of whichever race or creed or social status, can agree upon such basic standards of justice. In this regard, the Prophet (ṣ) declared:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ حِلْفٍ كَانَ فِي الْجَاهِلِيَّةِ لَمْ يَزِدْهُ الْإِسْلَامُ إِلَّا شِدَّةً أَوْ حِدَّةً<\/p>\n<p><strong>Every just pact from the time of ignorance is not increased by Islam but in strength and affirmation.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 2909, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/15\/every-treaty-justice-affirmed\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Muslims ought to reach out to non-Muslims, and different races to each other, for the sake of the common good.<\/p>\n<p>Even the Caliph of the Muslims must resolve his disputes with non-Muslims in a properly constituted court of law operating under the principle of impartial due process. The Caliph Umar ibn al-Khattab was presented with a dispute between a Muslim and a Jew. Umar believed that the truth was on the side of the Jew, so he passed judgment in his favor. The Jew said to him, “By Allah, you have judged with the truth!” Umar rapped him with his whip and he said, “How do you know it?” The Jew said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إنَّا نَجِدُ فِي التَّوْرَاةِ لَيْسَ قَاضٍ يَقْضِي بِالْحَقِّ إِلَّا كَانَ عَنْ يَمِينِهِ مَلَكٌ وَعَنْ شِمَالِهِ مَلَكٌ يُسَدِّدَانِهِ وَيُوَفِّقَانِهِ لِلْحَقِّ مَا دَامَ مَعَ الْحَقِّ فَإِذَا تَرَكَ الْحَقَّ عَرَجَا وَتَرَكَاهُ<\/p>\n<p>Verily, we find written in the Torah that none judges with the truth but that there is an angel on his right and an angel on his left to keep him steady and guided in the truth. If he abandons the truth, then they will ascend and abandon him.<\/p>\n<p>Source: al-Muwaṭṭa’ 1425, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/08\/11\/umar-khalifah-favors-jew\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn ‘Abdul Barr commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَفِي هَذَا الْحَدِيثِ مِنَ الْفِقْهِ أَنَّ الْمُسْلِمَ وَالْكَافِرَ وَالذِّمِّيَّ فِي الْحُكْمِ بَيْنَهُمَا وَالْفَصْلِ بَيْنَ الْمُسْلِمِينَ سَوَاءٌ<\/p>\n<p>In this narration is the legal principle that the Muslim, the unbeliever, and the covenanted citizen are equal to Muslims in judgments and decrees.<\/p>\n<p>Source: al-Istidhkār 7\/98<\/p><\/blockquote>\n<p>Muslims must also provide for the welfare of their non-Muslim citizens and neighbors. In another incident, Umar passed by the door of some people, over which was an old blind man asking for charity. Umar tapped him on the shoulder from behind and he said, “From which people of the Book are you?” The man said, “I am a Jew.” Umar said, “What has forced you into what I see here?” The man said, “I am begging so I can pay tribute, for my needs and my old age.” Umar took him by the hand, went with him to his house, and he offered him some charity. Then, he sent him to the public treasury and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْظُرْ هَذَا وَضُرَبَاءَهُ فَوَاللَّهِ مَا أَنْصَفْنَاهُ أَن أكلنَا شبيته ثُمَّ نَخُذُلُهُ عِنْدَ الْهَرَمِ إِنَّمَا الصَّدقَات للْفُقَرَاء وَالْمَسَاكِين وَالْفُقَرَاءُ هُمُ الْمُسْلِمُونَ وَهَذَا مِنَ الْمَسَاكِينِ مِنْ أَهْلِ الْكِتَابِ<\/p>\n<p>Look at this man and his taxes! By Allah, we have not been fair to him that we have eaten and then abandoned him in his old age. Verily, charity is for the poor and the needy. The poor are the Muslims and this man is among the needy from the people of the Book.<\/p>\n<p>Source: al-Kharrāj li-Abī Yūsuf 1\/139<\/p><\/blockquote>\n<p>Umar exempted him from paying tribute and from his taxes.  Needless to say, if religion makes no difference in the fundamental right to access charity and social welfare, race makes no difference either.<\/p>\n<p>Following the example of ‘Umar, the Caliph Ali Abi Talib once saw a Christian man wearing his lost armor and he decided to take up the matter in court, so he brought the dispute to the judge Shurayḥ. Ali said, “This is my armor and I have not sold it or given it away.” The judge said to the Christian, “What do you say about what the commander of the believers has said?” The Christian said, “It is my armor, but I do not consider the commander of the believers to be a liar.” The judge turned to Ali and he said, “O commander of the believers, do you have any proof?” Ali laughed and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَصَابَ شُرَيْحٌ مَا لِي بَيِّنَةٌ<\/p>\n<p>Shurayḥ is correct. I do not have any proof.<\/p>\n<p>Source: al-Bdāyah wal-Nihāyah 11\/107<\/p><\/blockquote>\n<p>Thus, the judge Shurayh ruled in favor of the Christian.<\/p>\n<p>These incidents demonstrate that authentic justice is blind to color, race, religion, or social status. As the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ<\/p>\n<p><strong>Verily, Allah does not look at your appearance or wealth, but rather He looks at your hearts and actions.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2564, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/17\/allah-judge-heart-actions\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When Malcolm X was performing his Hajj pilgrimage in Mecca, he saw first-hand how Muslims of all races were united by their belief in the One True God, writing:<\/p>\n<blockquote><p>The colorblindness of the Muslim world&#8217;s religious society and the colorblindness of the Muslim world&#8217;s human society: these two influences had each day been making a greater impact, and an increasing persuasion against my previous way of thinking.<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a><\/p><\/blockquote>\n<p>Malcolm also wrote long letters to his friends to convey new insights he acquired from first real taste of true Islam. In charting a new course for Black America’s struggle against racial injustice, he boldly stated, “I’m for truth, no matter who tells it. I’m for justice, no matter who it is for or against. I’m a human being first and foremost, and as such I’m for whoever and whatever benefits humanity as a whole.”<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a> This truth was an anathema to many of the radical activists with whom he previously associated, who had developed an ideology and theology of racial animus. Colorblind justice was Malcolm’s new operating principle and it is one of the most powerful turning points in his spiritual transformation and the legacy he left behind.<\/p>\n<p>That said, while the principle of colorblind jurisprudence is sound, there are times when people only pay lip-service to the ideal as a way to dismiss valid concerns about racial disparities and their systemic causes. Dr. Martin Luther King Jr. highlighted this hypocrisy near the end of his career, even after the landmark 1964 Civil Rights Act had already been passed into law:<\/p>\n<blockquote><p>The majority of white Americans consider themselves sincerely committed to justice for the Negro. They believe that American society is essentially hospitable to fair play and to steady growth toward a middle-class Utopia embodying racial harmony. But unfortunately this is a fantasy of self-deception and comfortable vanity. Overwhelmingly America is still struggling with irresolution and contradictions.<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p><\/blockquote>\n<p>The real progress towards racial justice over the years should not be belittled or taken for granted, but Dr. King was correct that the passage of the Civil Rights Act, while a tremendous victory for justice and a model anti-discrimination statute for the world, did not necessarily produce by itself the equity it was meant to achieve. Law, without a spiritual culture, it not enough. This unfortunate situation is true even today, as disparities in the treatment of racial minorities can be measured by data and a plethora of anecdotes. The majority of American white people do want to build a society that treats minorities fairly, but generations of compounding injustice cannot simply be remedied by the passage of a single law or by rhetoric alone. Nonetheless, a truly colorblind society, in which all races are treated equally by law and culture, must be the ideal towards which we strive, however imperfectly. Justice requires not that we discard the ideal of colorblindness because it is difficult, but rather that we demand its full and rightful implementation precisely because it is the truth revealed by the Creator.<\/p>\n<p>A final point in regards to universal justice is to dissect the anatomy of racism and to understand the dynamics that propel it. Racism is always justified by the twin evils of prejudice and stereotypes. Prejudice is “an unfair and unreasonable opinion or feeling, especially when formed without enough thought or knowledge.” A stereotype is “a set idea that people have about what someone or something is like, especially an idea that is wrong.” In other words, prejudice is to pre-judge someone’s character or moral worth based on the false image of stereotypes, to treat an individual as an avatar of a racial collective.<\/p>\n<p>In early American history, a common stereotype against black people was that they were sub-human, less intelligent, and more prone to criminality than white people; black people were less “evolved” than the allegedly superior white race. This stereotype was then used to justify all kinds of nefarious prejudice like the infamous “Jim Crow” laws of the deep south, which mandated racial segregation, arbitrary discrimination, and afforded black people lesser protections of the law. Such pernicious anti-black stereotypes are proven false by reason, revelation, and experience, rendering their prejudice absolutely unjustifiable.<\/p>\n<p>In Islam, prejudice can never be justified against an individual because of their immutable characteristics, their tribe, or even their religious affiliation. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَكْسِبُ كُلُّ نَفْسٍ إِلَّا عَلَيْهَا ۚ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ<\/p>\n<p><strong>No soul earns anything except it is upon itself, and none shall bear the burdens of another.<\/strong><\/p>\n<p>Surat al-An’am 6:164<\/p><\/blockquote>\n<p>Ibn Kathīr commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُحْمَلُ مِنْ خَطِيئَةِ أَحَدٍ عَلَى أَحَدٍ وَهَذَا مِنْ عَدْلِهِ تَعَالَى<\/p>\n<p>No one will bear the burden of sin for anyone else, for this is the justice of the Exalted.<\/p>\n<p>Source:  Tafsīr Ibn Kathīr 6:164<\/p><\/blockquote>\n<p>Regarding the people of the Book, Jews and Christians, Allah makes a clear distinction between the righteous and the hypocrites:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسُوا سَوَاءً ۗ مِّنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَهُمْ يَسْجُدُونَ<\/p>\n<p><strong>They are not all the same. Among the people of the Book is an upright community, reciting the verses of Allah in the night and prostrating in prayer.<\/strong><\/p>\n<p style=\"text-align: left;\">Surat Ali ‘Imran 3:113<\/p>\n<\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ أَهْلِ الْكِتَابِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍ يُؤَدِّهِ إِلَيْكَ<\/p>\n<p><strong>Among the people of the Book are those who, if you trust them with a great amount of wealth, they will return it to you.<\/strong><\/p>\n<p>Surat Ali ‘Imran 3:75<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِن قَوْمِ مُوسَىٰ أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ<\/p>\n<p><strong>Among the people of Moses is a community guided by truth and by it establishes justice.<\/strong><\/p>\n<p>Surat al-A’raf 7:159<\/p><\/blockquote>\n<p>The vast array of human experiences precludes one from making any stereotypical assumptions about a person because of their racial or religious identity. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ<\/p>\n<p><strong>O you who have faith, give up much assumption, for some assumption is sin.<\/strong><\/p>\n<p>Surat al-Hujurat 49:12<\/p><\/blockquote>\n<p>And the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ وَلَا تَحَسَّسُوا وَلَا تَجَسَّسُوا وَلَا تَنَافَسُوا وَلَا تَحَاسَدُوا وَلَا تَبَاغَضُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا<\/p>\n<p><strong>Beware of assumption, for assumption is the most false of tales. Do not seek out faults, do not spy on each other, do not contend with each other, do not envy each other, do not hate each other, and do not turn away from each other. Rather, be servants of Allah as brothers.  <\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6066, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/10\/04\/dhann-biggest-lie\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Racial stereotypes are particularly insidious, since they have been used throughout history to sustain some of the worst forms of oppression known to humankind. On the contrary, every individual deserves to be judged by the merits of their character and deeds, not by their outwardly identifying characteristics or by some crude mental caricature.<\/p>\n<p>Prejudice amounts to collective guilt and punishment against people for crimes they did not commit; a monstrous injustice. Collective punishment was the characteristic of pre-Islamic ignorance, such as the war between the tribes of Quraysh and Bakr. One tribe killed the member of another, so the aggrieved tribe retaliated under the principle of “man for man,”  meaning they would not prosecute the one who committed the murder, but rather kill a random member of the other tribe, thereby perpetuating a cycle of violence. This faux-justice is the quality of unbelief and idolatry. For this reason, the Prophet (ṣ) declared in his final sermon:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ وَلَا يُؤْخَذُ الرَّجُلُ بِجَرِيرَةِ أَبِيهِ وَلَا بِجَرِيرَةِ أَخِيهِ<\/p>\n<p><strong>Do not return to unbelief after me by striking the necks of each other. No man is to be punished for the crimes of his father or his brother.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 4131, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/19\/no-collective-punishment-retaliation-vengeance\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>A person is to be judged morally according to their character and legally according to their deeds. The Prophet (ṣ) even condemned wholesale rhetorical jabs as heinous lies and slander:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَعْظَمَ النَّاسِ فِرْيَةً لَرَجُلٌ هَاجَى رَجُلًا فَهَجَا الْقَبِيلَةَ بِأَسْرِهَا<\/p>\n<p><strong>Verily, the most libelous among people is a man who insults another man by satirizing the entire tribe.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3761, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/22\/poetry-shir-entire-tribe\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Malcolm X’s pivot to the universal justice of Islam was predicated on the rejection of what he called “blanket indictments” of people, which are the type of sweeping stereotypes that rationalize prejudice and discrimination. He explained his change of heart, writing:<\/p>\n<blockquote><p>In the past, yes, I have made sweeping indictments of all white people. I never will be guilty of that again, as I know now that some white people are truly sincere, that some truly are capable of being brotherly toward a black man. The true Islam has shown me that a blanket indictment of all white people is as wrong as when whites make blanket indictments against blacks.<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p><\/blockquote>\n<p>Similarly, Malcolm told an audience at the University of Ghana’s Great Hall, “I&#8217;m not anti-American, and I didn&#8217;t come here to condemn America. I want to make that very clear! I came here to tell the truth, and if the truth condemns America, then she stands condemned!”<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a>  Malcolm had every reason to hate America and white people, with all the racial injustice he suffered and witnessed. However, his love for truth and justice was his greatest motivating factor, not hatred for any group of people or country, as he began to see the vision of a potential future in which black and white people could be at peace. Perhaps his own homeland of America, which had wronged him so viciously, might one day be able to atone for its sin of racism.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"The_Arrogance_of_Satan\"><\/span><strong>The Arrogance of Satan<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>Much of the modern discussion around racism explores its “structural” aspects, or how it might operate on a wider societal level, but it is important to understand that racism is fundamentally a defect in the individual human soul, rooted in the deadly sin of arrogance (<em>kibr<\/em>). This is in direct contrast to the Islamic virtue of humility (<em>tawadu’<\/em>), which prohibits the believers from looking down upon people or boasting to others about their alleged superiority.<\/p>\n<p>Satan (<em>Iblis<\/em>) was, in fact, the first creation of Allah to sin by arrogance and envy; therefore, he could be rightly considered the original supremacist or racist. Allah created Adam and commanded all the angels and natural forces to ‘prostrate’ to him, just as Allah subjected the Sun, the Moon, the wind, and the rain in the service of human life. However, Satan disobeyed the order of Allah out of his arrogance and envy for Adam, considering himself to be superior to a human creation formed from mere clay.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَىٰ وَاسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ<\/p>\n<p><strong>When We said to the angels, ‘Prostrate before Adam,’ so they prostrated, except for Satan. He refused, was arrogant, and became one of the unbelievers. <\/strong><\/p>\n<p>Surat al-Baqarah 2:34<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ مَا مَنَعَكَ أَلَّا تَسْجُدَ إِذْ أَمَرْتُكَ ۖ قَالَ أَنَا خَيْرٌ مِّنْهُ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ<\/p>\n<p><strong>Allah said, ‘What stopped you from prostrating when I commanded you?’ Satan said, ‘I am better than him. You created me from fire and created him from clay.’<\/strong><\/p>\n<p>Surat al-A’raf 7:12<\/p><\/blockquote>\n<p>The fatal thought that crossed the mind of Satan, which Allah has associated with unbelief, was this, “I am better than him,” the very same kind of thinking that animates racism in all of its forms. Al-Ghazali commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنما ضرب إبليس مثلاً لهذا وما حكاه من أحواله إلا ليعتبر به فإنه قال أنا خير منه وهذا الكبر بالنسب &#8230; فحمله ذلك على أن يمتنع من السجود الذي أمره الله تعالى به<\/p>\n<p>Indeed, the example of Iblis is given in this regard and nothing is related about him but that it is to be taken as a lesson. He said, ‘I am better than him,’ and this is the arrogance of lineage… so it made him say that and refuse to prostrate as Allah Almighty had commanded him.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/347<\/p><\/blockquote>\n<p>So dangerous is this spiritual disease that the Prophet (ṣ) warned us:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ<\/p>\n<p><strong>Whoever has the weight of a mustard seed of arrogance in his heart, Allah will throw him down on his face in Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/05\/kibr-takabbur-seed-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Let every believer take heed!<\/p>\n<p>In the time of the Prophet (ṣ), the most prominent form of racism or supremacism was tied to lineage, with various tribes considering themselves better than others by virtue of their ancestors and bloodlines. Islam was revealed to do away which such ignorance, and to replace it with colorblind justice. As the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَدْ أَذْهَبَ عَنْكُمْ عُبِّيَّةَ الْجَاهِلِيَّةِ وَفَخْرَهَا بِالْآبَاءِ إِنَّمَا هُوَ مُؤْمِنٌ تَقِيٌّ وَفَاجِرٌ شَقِيٌّ النَّاسُ كُلُّهُمْ بَنُو آدَمَ وَآدَمُ خُلِقَ مِنْ تُرَابٍ<\/p>\n<p><strong>Verily, Allah has removed from you the pride of the time of ignorance with its boasting of ancestors. Verily, one is only a righteous believer or a miserable sinner. All of the people are the children of Adam, and Adam was created from dust.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3955, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/06\/28\/all-people-children-adam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Lineage carries no special significance in Islam in regards to the moral worth of the individual, as the Prophet (ṣ) declared:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ<\/p>\n<p><strong>Whoever is slow to good deeds will not be hastened by his lineage.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Ghazali even asserts that the Prophet’s (ṣ) own noble Hashimite lineage has no intrinsic value without being accompanied by righteous deeds:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ شَرُفُوا بِالطَّاعَةِ وَالْعِلْمِ وَالْخِصَالِ الحميدة لا بالنسب فليتشرف بما شرفوا به<\/p>\n<p>They were noble because of their obedience to Allah, their knowledge, and their praiseworthy characteristics, not because of their lineage. Let one who seeks nobility do so in the way they were noble.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/375<\/p><\/blockquote>\n<p>We can see the echoes of modern racism, based on skin color, in the time of the Prophet (ṣ) himself. In a report with some weakness in the chain,  the companion Abu Dharr faulted Bilal about his mother, saying as an insult, “O son of a black woman!” Bilal told the Prophet (ṣ) what he said and he became angry. When Abu Dharr saw the Prophet (ṣ) again, he could tell he was not pleased. The Prophet (ṣ) said to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْتَ الَّذِي تُعَيِّرُ بِلَالًا بِأُمِّهِ وَالَّذِي أَنْزَلَ الْكِتَابَ عَلَى مُحَمَّدٍ مَا لِأَحَدٍ عَلَيَّ فَضْلٌ إِلَّا بِعَمَلٍ<\/p>\n<p><strong>Have you faulted Bilal because of his mother? By the One who revealed the Book to Muhammad, no one is better than anyone else except by good deeds.<\/strong><\/p>\n<p>Source: Shu’ab al-Īmān 4772<\/p><\/blockquote>\n<p>Al-Ghazali commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فانظر كيف نبهه رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ رأى لنفسه فضلاً بكونه ابن بيضاء وأن ذلك خطأ وجهل<\/p>\n<p>Look at how the Messenger of Allah (ṣ) warned him, that he viewed himself as better due to his being the son of a white woman, and that it was sinful and ignorant.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/352<\/p><\/blockquote>\n<p>Racism in the classical American experience was an off-shoot of the arrogance of lineage. Whereas tribalists viewed themselves as superior because of their tribes, racists of previous centuries invented the pseudo-scientific social construct of “race” or allegedly meaningful biological differences between people with different skin colors. Reflect on how Al-Ghazali describes the tribalists of his era, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَسْتَحْقِرُ مَنْ لَيْسَ لَهُ ذَلِكَ النَّسَبُ وَإِنْ كَانَ أَرْفَعَ مِنْهُ عَمَلًا وَعِلْمًا وَقَدْ يتكبر بعضهم فيرى أن الناس له أموال وعبيد ويأنف من مخالطتهم ومجالستهم<\/p>\n<p>…those who look down upon those without such lineage, even if they are above him in deeds and knowledge. He is so arrogant against some of them that he views people as his property and slaves, scorning to mix with them or sit with them.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/352<\/p><\/blockquote>\n<p>How relevant are these words nearly a thousand years later! For American racists indeed took black people as their slaves and property on the basis of their perceived racial inferiority, and when slavery was abolished with great bloodshed, racism continued in the form of Jim Crow laws prohibiting blacks and whites from mixing in marriage, railcars, diners, and even water fountains. These tremendous injustices were fueled by the arrogance of the human soul, which preceded all of the institutional structures put into place to uphold racial discrimination and segregation.<\/p>\n<p>One can be arrogant against Allah and His Messengers by refusing to obey their commands and prohibitions, but racism is usually found in the arrogance of human beings against one another. Al-Ghazali explains this form of pride:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">القسم الثالث التكبر على العباد وذلك بأن يستعظم نفسه ويستحقر غيره فتأبى نفسه عن الانقياد لهم وتدعوه إلى الترفع عليهم فيزدريهم ويستصغرهم ويأنف عن مساواتهم<\/p>\n<p>The third type of arrogance is against the servants, which is that he exalts himself and looks down upon others. So his ego refuses to be led by them, calling him to view himself as above them, belittling them, and scorning equality with them.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/346<\/p><\/blockquote>\n<p>The key point here is that arrogance, like racism, militates against equality, for one whose heart is infected by it views himself as entitled to special treatment and privileges to the exclusion of others.<\/p>\n<p>Jim Crow was the epitome of racial inequality in America, giving privileges to whites at the expense of blacks. As the tide began to turn against Jim Crow, culminating in pivotal events like the Montgomery Bus Boycott, racists strained to uphold their system under the flimsy pretense of “separate but equal,” in an attempt to maintain their racial hierarchy even though it flew in the face of the God-given truth written in their own scriptures. Nevertheless, the U.S. Supreme Court correctly and unanimously ruled in the 1954 landmark decision <em>Brown v. Board of Education<\/em> that separate is not equal and is thus a flagrant violation of the colorblind-spirit in the Constitution’s 14th amendment equal protection clause. It was a victory on the path to a more just society, yet what must be appreciated by such history is that arrogance, and its impulse to inequality, lied beneath all of the unjust laws disenfranchising black people. People with hearts darkened by the scourge of arrogance created the systems of inequality, so only people with hearts enlightened by virtues of humility and religious love can reform or dismantle them.<\/p>\n<p>The inverse of arrogance is the humility that must follow from belief in the Creator. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا حَتَّى لَا يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ وَلَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ<\/p>\n<p><strong>Verily, Allah has revealed to me that you must be humble towards one another, so that no one oppresses another or boasts to another.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2865, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/03\/allah-revealed-humble\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And he (ṣ) defined its opposite, arrogance, by saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ<\/p>\n<p><strong>Arrogance is to reject the truth and to look down upon people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 91, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/05\/kibr-takabbur-seed-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>What perhaps many Muslims do not realize is that these prophetic sayings apply to everyone, including looking down upon unbelievers. Even the scholars are not immune from arrogance creeping into their hearts, so what is the cure? Al-Ghazali explains:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكيف يغنيه أن يخطر بباله خطر العلم وهو يعلم أن خطر الفاسق والمبتدع أكثر فاعلم أن ذلك إنما يمكن بالتفكر في خطر الخاتمة بل لو نظر إلى كافر لم يمكنه أن يتكبر عليه إذ يتصور أن يسلم الكافر فيختم له بالإيمان ويضل هذا العالم فيختم له بالكفر والكبير من هو كبير عند الله في الآخرة &#8230; فكم من مسلم نظر إلى عمر رضي الله عنه قبل إسلامه فاستحقره وازدراه لكفره وقد رزقه الله الإسلام وفاق جميع المسلمين إلا أبا بكر وحده<\/p>\n<p>How can one be free of the peril of his situation, the peril of knowledge, while he knows the perils of sin and heresy are even greater? Know that is only possible by reflecting upon the perils of the end of matters. Rather, were he to look at an unbeliever, he could never be arrogant against him as it is conceivable that the unbeliever eventually embraces Islam and thus ends his life with faith, while this scholar is led astray and thus ends his life with unbelief. The truly great are only those who are great to Allah in the Hereafter&#8230; How many Muslims looked down upon Umar before he embraced Islam and despised him and scorned him for his unbelief, yet Allah had provided him with Islam and he rose above all other Muslims except for Abu Bakr alone.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/364<\/p><\/blockquote>\n<p>No believer can guarantee Paradise for himself or herself, nor do they know the secrets of the hearts or the imminent decree of Providence. For many people appear outwardly evil but seal their lives in righteousness, while others appear righteous but seal their lives in sin. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ<\/p>\n<p><strong>Verily, a man may appear to people as doing the deeds of the people of Paradise, yet he is among the people of Hellfire. Verily, a man may appear to people as doing the deeds of the people of Hellfire, yet he is among the people of Paradise. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2898, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/18\/qadr-amal-bil-khawatim\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Consider how many Muslims may have looked down upon ‘Umar when he was an idolater, while he ended up dying as the great and beloved Caliph? Or how many Muslims looked down upon Malcolm X in his earlier period of criminality, while Allah eventually guided his heart, honored him with a visit to His House, and solidified his legacy as el-Hajj Malik el-Shabazz? The moral chasm between a sincere believer and an obstinate unbeliever could not be wider, as there is no greater consequential choice in this life than between monotheism and idolatry, but Islam still prohibits us from looking down upon unbelievers.<\/p>\n<p>If an unbeliever went to Hell and then you yourself followed him into Hell, would you have any reason to brag over him? How much more foolish is it, then, to look down upon people because of their immutable characteristics like skin color, tribe, or ethnicity? Hence, there is absolutely no justification for thinking oneself superior to anyone, for no man or woman is safe from the plotting of Satan until they meet Allah in the Hereafter.<\/p>\n<p>Humility, in the perfect sense described here, is unfortunately a very rare occurrence. Even in the time of the Prophet’s wife Aisha, she lamented the lack of humility among her people:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّكُمْ لَتُغْفِلُونَ أَفْضَلَ الْعِبَادَةِ التَّوَاضُعَ<\/p>\n<p>Verily, you are neglecting the best act of worship: humility.<\/p>\n<p>Source: al-Zuhd wal-Raqā’iq 391, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/11\/22\/aisha-best-worship-humility\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Not only does the absence of this virtue lead to the gross forms of racism found in so many Muslim-majority contexts, it further obstructs a believer from advancing their spiritual states. Al-Suyuti considered such humility to be the cornerstone of religious progress, writing that one should:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأعتقد أَنَّك لست بِخَير من أحد وَلَو كَانَ بِحَسب الظَّاهِر من كَانَ فَإنَّك لَا تَدْرِي مَا الخاتمة لَك<\/p>\n<p>…believe you are not better than anyone, despite appearing so in comparison to them, because you do not know your own ending.<\/p>\n<p>Source: Itmām al-Dirāyah li-Qurrāʼ al-Niqāyah 1:164<\/p><\/blockquote>\n<p>Precarious, then, is the situation of the world and its people, who look down upon others for whatever preposterous reason, since it results in the invalidity of all good deeds. Al-Ghazali warns us bluntly:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومن اعتقد جزما أنه فوق أحد من عباد الله فقد أحبط بجهله جميع عمله فإن الجهل أفحش المعاصي وأعظم شيء يبعد العبد عن الله<\/p>\n<p>Whoever firmly believes that he is above anyone among the servants of Allah, he has nullified all of his good deeds by his ignorance, for ignorance is the most obscene type of sinful disobedience and the worst thing to distance a servant from Allah.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/350<\/p><\/blockquote>\n<p>And so it is, that one of the most dangerous things a person can say to themselves is, “I am better than him,” thereby imitating Satan, the sworn enemy of humankind. Racism thrives on hearts sullied by the tarnish of arrogance. The light of pure human nature (<em>fitrah<\/em>) guided by sound reason and divine revelation have become repulsive to them, leaving behind only a dark and untamed fire to wreak havoc on society and their own souls.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"Racism_Tribalism_and_Violence\"><\/span><strong>Racism, Tribalism, and Violence<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>We have seen that racism is located in the deadly sin of arrogance, which is found within the deepest recesses of the human soul. But this by itself does not adequately explain the specifics of racism in various contexts, since it is only the manifestation of a certain kind of arrogance. We need a better explanatory paradigm of the dynamics of racism at play to help identify its essence within different communities. The Islamic concept of “tribalism” (<em>‘aṣbiyyah<\/em>) expresses perfectly the nature of racism on the social and macro levels. Racism is tribalism.<\/p>\n<p>Tribalism is the tendency of communities to prefer their own people at the expense of universal justice. The companion Wathilah ibn Al-Asqa’ asked the Prophet, saying, “O Messenger of Allah, is it part of tribalism that a man loves his people?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا وَلَكِنْ مِنْ الْعَصَبِيَّةِ أَنْ يُعِينَ الرَّجُلُ<\/p>\n<p><strong>No, rather it is tribalism that he supports his people in wrongdoing.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3949, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/18\/tribalism-support-injustice\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Hence, tribalism is not merely the ordinary love one feels for their own people, but rather an exaggerated love for the in-group, and inverse malicious hatred towards the out-group. Although distinctions between ethnic groups are normal, the dynamics of tribalism work like this: the in-group feels a sense of inherent superiority towards out-groups, an exaggerated form of self-love, that justifies the oppression and violation of the out-group’s natural rights. This paradigm applies not only to racism, but to other forms of injustice, whether it is one religious group harming another under the banner of pseudo-faith, one cultural group harming another under the banner of xenophobia, or one nation harming another under the banner of nationalism.<\/p>\n<p>In every instance, the out-group becomes the dehumanized victim of prejudice and stereotypes, which then rationalizes whatever evil is intended for them. The theoretical concept of tribalism can also provide us with a method to identify racism (or similar ideologies) in various cultural contexts and even new forms of racism yet to be invented, since the idea gets to the very heart of the matter, which is the manifestation of tribalist arrogance.<\/p>\n<p>Not only are the out-groups victims of mere prejudice, which at best is an annoyance, but tribalism in its fullest sense also includes an element of violence. It resembles the cycle of revenge-murder that plagued Arabia before the advent of Islam. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قُتِلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ يَدْعُو عَصَبِيَّةً أَوْ يَنْصُرُ عَصَبِيَّةً فَقِتْلَةٌ جَاهِلِيَّةٌ<\/p>\n<p><strong>Whoever is killed under the banner of blind following, who calls to tribalism or supports tribalism, then he has died upon ignorance.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1850, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/03\/dies-upon-tribalism-ignorance\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Such people have been described as “blind,” in reference to the fact that the light of faith and the darkness of tribal arrogance cannot coexist within a human heart. One of them will eventually expel the other. For this reason, the Prophet (ṣ) disowned himself from anyone of his nation who succumbs to this spiritual disease:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ مِنَّا مَنْ دَعَا إِلَى عَصَبِيَّةٍ وَلَيْسَ مِنَّا مَنْ قَاتَلَ عَلَى عَصَبِيَّةٍ وَلَيْسَ مِنَّا مَنْ مَاتَ عَلَى عَصَبِيَّةٍ<\/p>\n<p style=\"text-align: left;\"><strong>He is not one of us who calls to tribalism. He is not one of us who fights for the sake of tribalism. He is not one of us who dies following the way of tribalism.<\/strong><\/p>\n<p style=\"text-align: left;\">Source: Sunan Abī Dāwūd 5121, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/19\/not-one-of-us-who-calls-to-tribalism\/\">Sahih<\/a><\/em><\/strong><\/p>\n<\/blockquote>\n<p>Ibn Taymiyyah commented on this statement, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بين بهذا الحديث أن تعصب الرجل لطائفة مطلقا فعل أهل الجاهلية محذور مذموم بخلاف منع الظالم وإعانة المظلوم من غير عدوان فإنه حسن بل واجب<\/p>\n<p>This tradition clarifies that a man’s unqualified solidarity with his faction is an act of ignorance, prohibited and blameworthy, with the exception of stopping the oppressor or helping the oppressed without enmity, which is good or rather obligatory.<\/p>\n<p>Source: Fayḍ al-Qadīr 5\/386<\/p><\/blockquote>\n<p>No person may be harmed for their simple association with a designated ethnic out-group. Reflect upon the example of Moses in the Quran. When he was in Egypt, the Pharaoh had enslaved his people and compelled them into crushing forced labor:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ<\/p>\n<p><strong>…slaughtering your sons and keeping your women alive.<\/strong><\/p>\n<p>Surat al-Baqarah 2:49<\/p><\/blockquote>\n<p>Their aim was to keep the Israelites as permanent slaves, killing their boys so that no fighting force might be mustered by which to liberate themselves. Despite the enormity of the Pharaoh’s crimes, this in no way justified the killing of ordinary Egyptian citizens. Moses, in fact, witnessed a brawl of sorts between a man of his people and an Egyptian, who at the time was his enemy. He struck the offending party so strongly that he accidentally killed him, a serious mistake for which He repented to Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَدَخَلَ الْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَٰذَا مِن شِيعَتِهِ وَهَٰذَا مِنْ عَدُوِّهِ ۖ فَاسْتَغَاثَهُ الَّذِي مِن شِيعَتِهِ عَلَى الَّذِي مِنْ عَدُوِّهِ فَوَكَزَهُ مُوسَىٰ فَقَضَىٰ عَلَيْهِ ۖ قَالَ هَٰذَا مِنْ عَمَلِ الشَّيْطَانِ ۖ إِنَّهُ عَدُوٌّ مُّضِلٌّ مُّبِينٌ قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ<\/p>\n<p><strong>Moses entered the city at a time of inattention by its people and found therein two men fighting: one from his faction and one from his enemy. The one from his people called for help against his enemy, so Moses struck him and killed him. Moses said, ‘This is from the work of Satan, for he is clearly a misguiding enemy.’ Moses said, ‘My Lord, I have wronged myself, so forgive me,’ and Allah forgave him. Verily, He is the Forgiving, the Merciful. Moses said, ‘My Lord, for the favor you have bestowed upon me, I will never support the criminals.’ <\/strong><\/p>\n<p>Surat al-Qasas 28:15-17<\/p><\/blockquote>\n<p>Even though the Egyptian was from the out-group, his murder, intentional or not, was nevertheless an unlawful act. Al-Ḥasan al-Baṣrī commented on this passage:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لم يكن يحلّ قتل الكافر يومئذٍ في تلك الحال لأنها كانت حال كفّ عن القتال<\/p>\n<p>It was not lawful to kill the unbeliever on that day, in this situation, as the circumstances warranted restraint from fighting.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 28:15<\/p><\/blockquote>\n<p>Pharaoh and his deputies were the true criminals in this instance, not the regular citizens of Egypt. Once again we reiterate the legal principle that only a criminal, and no one else, may be punished for their crimes. No one may be the subject of collective punishment, as Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ<\/p>\n<p><strong>Do not kill the soul which Allah has forbidden, except by right of justice. <\/strong><\/p>\n<p>Surat al-Isra’ 17:33<\/p><\/blockquote>\n<p>Al-Ṭabarī further commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا تَقْتُل بِالْمَقْتُولِ ظُلْمًا غَيْر قَاتِله وَذَلِكَ أَنَّ أَهْل الْجَاهِلِيَّة كَانُوا يَفْعَلُونَ ذَلِكَ إِذَا قَتَلَ رَجُل رَجُلًا عَمَدَ وَلِيّ الْقَتِيل إِلَى الشَّرِيف مِنْ قَبِيلَة الْقَاتِل فَقَتَلَهُ بِوَلِيِّهِ وَتَرْك الْقَاتِل فَنَهَى اللَّه عَزَّ وَجَلَّ عَنْ ذَلِكَ عِبَاده<\/p>\n<p>Do not kill in retaliation for an unjust murder anyone except the murderer himself, for the people of ignorance used to do that. If a man killed another man from an opposing tribe, the patron of the murdered man would kill a notable man from the other tribe. Thus, Allah Almighty prohibited this for His servants.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 17:33<\/p><\/blockquote>\n<p>In this is the refutation of militant groups falsely claiming the mantle of Islam, who authorize acts of terrorism against innocent civilians as an act of collective punishment. Likewise, the classical racists in America were known for their lynch mobs, killing black men under the flimsiest of pretenses, burning crosses in the yards of black homes to intimidate their residents, and leveraging the tools of law enforcement to punish black people for their rebellion against chattel slavery and Jim Crow. The Nazi party similarly cited pseudo-scientific racism, buoyed by crass prejudice, stereotypes, and grievances, to commit genocide against a number of out-groups, most notably the Jews of Europe. Racism, as a form of tribalism, is indelibly linked to unjust violence, it is the rationale for violence, and for this reason the term “racism” has carried heavy moral weight in the American lexicon for some time.<\/p>\n<p>The Prophet (ṣ) gave us a parable to understand the nature of tribalism, and racism, which is worthy of our reflection:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَعَانَ قَوْمَهُ عَلَى ظُلْمٍ فَهُوَ كَالْبَعِيرِ الْمُتَرَدِّي يَنْزِعُ بِذَنَبِهِ<\/p>\n<p><strong>Whoever supports his people in oppression is like a dead camel that falls into a well and is pulled out by its tail.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 4292, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/13\/parable-tribalism-dead-camel\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imagine the scenery here: The well is literally the life-blood of the community. If a camel fell inside, it would almost certainly die. We are left with the rotting, bloated corpse of an animal poisoning the only water source, a ghastly sight, and those charged with the unfortunate task of removing it must pull it out by its tail, enduring the foul stench of death every step of the way.<\/p>\n<p>Similarly, racism contaminates the health of the community and threatens its very survival. Yet, as one may know from experience, those who spend enough time among noxious odors will eventually become accustomed to them, no longer repulsed by the smell as if it were not there. Racists, as it were, do not recoil at the stink of their own racism, while those in the out-groups are disgusted by their self-evidently wicked deeds.<\/p>\n<p>My people, right or wrong. My country, right or wrong. Such are the slogans of those who are infected by the arrogance of tribalism. Islam redefined these sentiments in a way to make them compatible with universal justice. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا‏<\/p>\n<p><strong>Help your brother, whether he is an oppressor or is oppressed.<\/strong><\/p><\/blockquote>\n<p>It was said, “O Messenger of Allah, we help the oppressed, but how do we help an oppressor?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَأْخُذُ فَوْقَ يَدَيْهِ<\/p>\n<p><strong>By seizing his hand.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2444, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/14\/support-wrongdoers-stop-them\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ كَانَ ظَالِمًا فَلْيَنْهَهُ فَإِنَّهُ لَهُ نَصْرٌ<\/p>\n<p><strong>If he is oppressing others, then stop him, for that is supporting him. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2584, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/12\/support-oppressed-stop-oppressor\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>If one truly wishes to help their own people, they must speak against their wrongdoings and stop them inasmuch as they are able. Racists not only oppress out-groups, but the seeds of arrogance they cultivate within themselves will ruin them in the Hereafter. They need to be admonished and guided to the truth, for their own sake as much as for those they harm in this life.<\/p>\n<p>Another key aspect about tribalism, and racism, is that it depends upon exaggerating the virtues of one’s own people and the vices of others. Ibn Muflih notes this connection in his chapter on tribalism, citing the statement of the Prophet (ṣ):<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِيَّاكُمْ وَالْغُلُوَّ فِي الدِّينِ فَإِنَّهُ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ الْغُلُوُّ فِي الدِّينِ<\/p>\n<p><strong>O people, beware of exaggeration in religion, for those who came before you were ruined by exaggeration in religion.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3029, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/22\/nations-destroyed-deen-extremism\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam Ahmad was asked about this tradition and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَغْلُو فِي كُلِّ شَيْءٍ حَتَّى الْحُبُّ وَالْبُغْضُ<\/p>\n<p>Do not exaggerate in anything, even in love and hatred.<\/p>\n<p>Source: al-Ādāb al-Shar’īyah 1\/52<\/p><\/blockquote>\n<p>Racists have a pretentious love for themselves and, inversely, a pernicious hatred for out-groups. Love and hatred are not simply emotions but also intentions, whether for good or evil. We ought to never let our feelings for our own people, or others, divert us from obedience to Allah and His justice.<\/p>\n<p>Moreover, no single person, or group of people, are worthy of absolute love or hatred. A righteous person might stumble into evil deeds, sins which we are obligated to hate, or a wicked person might be guided to repentance, a virtue which we are obligated to love. The Prophet (ṣ) said in regards to our natural feelings of love and hate:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحْبِبْ حَبِيبَكَ هَوْنًا مَا عَسَى أَنْ يَكُونَ بَغِيضَكَ يَوْمًا مَا وَأَبْغِضْ بَغِيضَكَ هَوْنًا مَا عَسَى أَنْ يَكُونَ حَبِيبَكَ يَوْمًا مَا<\/p>\n<p><strong>Love whom you love mildly, perhaps he will become hateful to you someday. Hate whom you hate mildly, perhaps he will become your beloved someday.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1997, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/26\/love-hate-moderation\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hatred of evil instinctively results in some resentment towards those who commit it, but never should it transgress the bounds of good intentions towards humanity. Therefore, the believers may never despise any ethnic out-group, whether individually or collectively, in a manner that denies universal justice and the religious love of neighbors.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"Non-Violence_in_Spirit_Rhetoric_and_Action\"><\/span><strong>Non-Violence in Spirit, Rhetoric, and Action<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>Having correctly identified the spiritual disease beneath racism, arrogance, and the social dynamics at work, tribalism, our next concern should be an appropriate methodology by which to remedy these scourges of humanity. The most effective way to combat racism is through a non-violent strategy, which consists of three dimensions: 1) non-violence of the spirit, 2) non-violence in rhetoric, and 3) non-violence in action.<\/p>\n<p>Non-violence in the fullest sense here, as is commonly misunderstood, is not passive acquiescence to injustice and tyranny. Rather, it is spiritually assertive and even aggressive at times, undercutting the moral authority of oppressors, and winning the hearts and minds of the public to the truth. Violence has its limited role in Islam, either through just war (<em>jihad<\/em>), self-defense, or criminal punishment; in these legally permissible instances of violence, the evil of this violence contains within it the greater public good, such that a greater harm is repelled by a lesser harm.<\/p>\n<p>When it comes to racism, the struggle is less often on the battlefield than it is in the court of public opinion, as a concerted effort to repeal unjust legislation or dispel nefarious cultural norms. The fight is not so much anti-racist as it is anti-racism, for every racist holds within themselves to potential to turns their hearts towards universal justice and love for their neighbors as commanded by Allah. As the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ قُلُوبَ بَنِي آدَمَ كُلَّهَا بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ كَقَلْبٍ وَاحِدٍ يُصَرِّفُهُ حَيْثُ يَشَاءُ<\/p>\n<p><strong>Verily, the hearts of the children of Adam, all of them, are between the two fingers of the Merciful as one heart. He directs them wherever He wills.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2654, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/09\/hearts-fingers-rahman\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Non-Violence of the Spirit<\/em><\/p>\n<p>The most important objective of the believers, upon which hinges their salvation or damnation in the Hereafter, is to purify their hearts from all kinds of spiritual diseases. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ<\/p>\n<p><strong>The Day when wealth or children will not avail anyone, but only one who comes to Allah with a pure heart. <\/strong><\/p>\n<p>Surah al-Shu’ara 26:88-89<\/p><\/blockquote>\n<p>One of the principal ailments in this regard is malicious hatred, which is not simply one’s natural resentment towards evildoers or righteous indignation, but a type of hatred that crosses the line into a desire to destroy others. The Prophet (ṣ) warned his companions:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَيُصِيبُ أُمَّتِي دَاءُ الأُمَمِ<\/p>\n<p><strong>Verily, my nation will be afflicted by the diseases of nations.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, what are the diseases of nations?” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأَشَرُ وَالْبَطَرُ وَالتَّدَابُرُ وَالتَّنَافُسُ فِي الدُّنْيَا وَالتَّبَاغُضُ وَالْبُخْلُ حَتَّى يَكُونَ الْبَغْيُّ ثُمَّ يَكُونَ الْهَرْجُ<\/p>\n<p><strong>Insolence, hubris, turning their backs to one another, competing for worldly possessions, hating each other, and miserliness, until there will be oppression and then there will be bloodshed.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 9249, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/12\/30\/hadith-on-vices-the-prophet-warns-against-the-disease-of-nations\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>He warned them first about the spiritual diseases of arrogance and malice which <em>precede<\/em> oppression and bloodshed. As such, the struggle against injustice and racism must pinpoint their root causes in human hearts afflicted with impurities.<\/p>\n<p>Al-Ghazali describes the nature of a pure heart:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كل عبد سلم عَن الْغِشّ والحقد والحسد وَإِرَادَة الشَّرّ قلبه وسلمت عَن الآثام والمحظورات جوارحه وَسلم عَن الانتكاس والانعكاس صِفَاته فَهُوَ الَّذِي يَأْتِي الله تَعَالَى بقلب سليم<\/p>\n<p>Every servant whose heart is free of deceit, malice, envy, and evil intentions, and is free of the prohibited sins of the limbs, and is free of the fluctuation and reversal of these characteristics of his, he is one who comes to Allah Almighty with a pure heart.<\/p>\n<p>Source: Al-Maqṣad al-Asná 1\/70<\/p><\/blockquote>\n<p>The diseases of deceit (<em>ghish<\/em>), malice (<em>hiqd<\/em>), and envy (<em>hasad<\/em>) all amount to the intention to do evil (<em>iradat al-sharr<\/em>) towards another person, even if they are an unbeliever or an oppressor. Sometimes self-defense or legal retaliation is warranted, which is in some sense an act of harm towards the wrongdoer, but the intention of the believers ought to be the public good resulting from warding off their harm, not in itself the desire to harm others. For when the wrongdoer ceases their wrongdoing, there is no longer any justification to harm them, neither by way of revenge or spite.<\/p>\n<p>The state of one’s spirit can be detected in the type of prayers they say to Allah. Pure hearts understand that it is better to ask Allah to guide unbelievers and sinners, rather than to curse them or condemn them to Hell. Such was the way of the Prophet (ṣ) himself. It was said, “O Messenger of Allah, pray against the idolaters!” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً<\/p>\n<p><strong>Verily, I was not sent to invoke curses, but rather I was only sent as mercy.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2599, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/07\/mercy-to-the-worlds\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ إِنَّمَا أَنَا رَحْمَةٌ مُهْدَاةٌ<\/p>\n<p><strong>O people, I am only a mercy and a guide.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 15, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/12\/muhammad-mercy-guide\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>On another occasion it was said, “O Messenger of Allah, the arrows of the tribe of Thaqif have pierced us, so pray against them!” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ ثَقِيفًا<\/p>\n<p><strong>O Allah, guide the tribe of Thaqif!<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3942, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/09\/21\/prophet-prays-thaqif-guided\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) told the story of another Prophet who was beaten by his people. As the blood dripped from his face, he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ<\/p>\n<p><strong>My Lord, forgive my people for they do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6929, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/06\/03\/know-not-what-they-do\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ), in fact, said this as well at the battle of Uhud when his face had been slashed and he was bleeding. Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فِيهِ مَا كَانُوا عَلَيْهِ صَلَوَاتُ اللَّهِ وَسَلَامُهُ عَلَيْهِمْ مِنَ الْحِلْمِ وَالتَّصَبُّرِ وَالْعَفْوِ وَالشَّفَقَةِ عَلَى قَوْمِهِمْ وَدُعَائِهِمْ لَهُمْ بِالْهِدَايَةِ وَالْغُفْرَانِ وَعُذْرِهِمْ فِي جِنَايَتِهِمْ عَلَى أَنْفُسِهِمْ بِأَنَّهُمْ لَا يَعْلَمُونَ<\/p>\n<p>It contains what the Prophet (ṣ) practiced of forbearance, patience, forgiveness, and compassion for his people, his supplication for them to receive guidance and to be forgiven, and for them to be excused for their sins as they did not know.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 12\/150<\/p><\/blockquote>\n<p>In one openly public demonstration, some of the companions came to the Prophet (ṣ) and they said, “O Messenger of Allah, the tribe of Daws has disobeyed and rejected you, so pray to Allah against them!” In response, the Prophet turned to face the <em>Qiblah<\/em> and he raised his hands as if he was about to pray. All of the people watching thought he was going to pray against Daws, but the Prophet (ṣ) said a different prayer:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ<\/p>\n<p><strong>O Allah, guide the tribe of Daws and bring them to me!<\/strong><\/p>\n<p>Source: Al-Adab al-Mufrad 611, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/dua-hidayah-kafirun-kuffar\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This large public event sent the clear message to the Prophet’s companions that prayer for the guidance of unbelievers and sinners was better than prayer against them.<\/p>\n<p>All of these incidents show that the Prophet (ṣ) was motivated by goodwill for wrongdoers and his desire to see them guided and reformed, even as they hurt him and his people. It is ill-advised, in general, to damn people to Hell, as the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَلَاعَنُوا بِلَعْنَةِ اللَّهِ وَلَا بِغَضَبِهِ وَلَا بِالنَّارِ<\/p>\n<p><strong>Do not invoke the curse of Allah upon each other, nor His wrath, nor the Hellfire.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1976, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/24\/do-not-invoke-nar-jahannam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>For if Allah answers your condemnation and punishes the wrongdoers, how does that benefit you in any way in the Hereafter? If you were punished in Hell alongside your oppressor, would that satisfy you in any way? Would it not be better for you had Allah saved others by your prayers, rather than destroyed them?<\/p>\n<p>The achievement of this pure state depends upon the ability to direct one’s natural anger into positive action, which is in fact the meaning of true strength. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ<\/p>\n<p><strong>The strong are not the best wrestlers. Verily, the strong are only those who control themselves when they are angry.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6114, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/10\/06\/strong-control-anger\/\">Mutaffaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) asked:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَعُدُّونَ الصُّرَعَةَ فِيكُمْ<\/p>\n<p><strong>Whom do you consider to be a fighter among you?<\/strong><\/p><\/blockquote>\n<p>They said, “One whom men cannot wrestle down.” The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ بِذَلِكَ وَلَكِنَّهُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ<\/p>\n<p><strong>It is not so. Rather, it is one who controls himself when angry.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2608, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/21\/real-strength-control-anger\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Dr. King echoed a similar sentiment as he made the case for non-violent resistance, “This is ultimately the way of the strong man.”<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a> Anger is inevitable when one sees injustice in the world and it even indicates that one has light of faith in their hearts, as the believers must love justice as Allah loves it, but anger is a force that must be controlled and channeled in the proper manner. As such, any movement for racial justice must be founded upon the love of good for neighbors and universal justice, not merely on animosity for past injustices, for only the light of faith can accomplish what the passions of the human soul cannot.<\/p>\n<p>Moreover, such lofty aspirations require the believers to value a culture of forgiveness and grace, which can imagine that even the most vehement racist may be compelled by benevolence to abandon their racism. Forgiveness, in addition, ensures one will have their status raised by Allah in the Hereafter. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا<\/p>\n<p><strong>No one forgives another but that Allah increases his honor.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2588, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/09\/20\/charity-forgiveness-wealth\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As if that alone were not enough, it should be appreciated that the malice of one who holds it is, in reality, more harmful to oneself than the one who is hated. By reigning in the fires of anger, which produce malice, and practicing regular forgiveness by praying for the guidance of wrongdoers, the heart is freed from these burdens in this life and their dreadful consequences in the Hereafter. Ibn Muflih cites the poet:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمَّا عَفَوْتُ وَلَمْ أَحْقِدْ عَلَى أَحَدٍ أَرَحْتُ نَفْسِي مِنْ هَمِّ الْعَدَاوَاتِ<\/p>\n<p>When I had forgiven and held no malice towards anyone, my soul was relieved from the worries of enmity.<\/p>\n<p>Source: Al-Ādāb al-Sharʻīyah 1\/53<\/p><\/blockquote>\n<p>In other words, it is in our own best interests to replace our malicious hatred with the light of faith, regardless of what the oppressor is doing.<\/p>\n<p>This was the spirit of racial movements in America that had successfully confronted racial chattel slavery and Jim Crow. One of the most important civil rights figures at the turn of the 20th century, Booker T. Washington, eloquently expresses the idea in his autobiography:<\/p>\n<blockquote><p>&#8230;I would permit no man, no matter what his color might be, to narrow and degrade my soul by making me hate him. With God&#8217;s help, I believe that I have completely rid myself of any ill feeling toward the Southern white man for any wrong that he may have inflicted upon my race. I am made to feel just as happy now when I am rendering service to Southern white men as when the service is rendered to a member of my own race. I pity from the bottom of my heart any individual who is so unfortunate as to get into the habit of holding race prejudice.<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a><\/p><\/blockquote>\n<p>The imperative to purify the heart of malice is critical in any context, as it is the duty of every believer, but it is especially more significant if one hopes to challenge the hegemony of ‘the powers that be’ in any lasting way, for it lays the mighty foundation from which righteous words and actions will prevail.<\/p>\n<p><em>Non-Violence of Rhetoric<\/em><\/p>\n<p>As the objective of racial justice can only be fully achieved by changing hearts and minds, reformers must craft a careful rhetorical strategy to avoid inciting racial animus and to appeal to the angelic (<em>rabbani<\/em>) nature of the human soul, both because it prevents the hearts of the audience from being polluted by malice and it has the potential to persuade neutral bystanders, as well any racists, to join in opposition to racism. Words are but mere reflections of what is in the heart and they mutually affect each other, for better or worse.<\/p>\n<p>Soaring and inspiring rhetoric proceeds from a pure heart and leads to righteous action, whereas violent and harsh rhetoric proceeds from a dark heart and leads to ruin. Since the boundary between inciting malice or righteous indignation is subtle and hidden from most people, it is upon the leaders of a movement to wisely choose the right words, in the right place, and at the right time with these aims in mind.<\/p>\n<p>We know from divine revelation that Allah has appointed angels to record everything we say on the scrolls of our deeds, which will be presented to us on the Day of Resurrection. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَّا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ<\/p>\n<p><strong>He does not utter a word but that there is an observer over him prepared.<\/strong><\/p>\n<p>Surat Qaf 50:18<\/p><\/blockquote>\n<p>Every word, then, is consequential in eternity, and seemingly insignificant bursts of anger or negligence can result in disaster, in both this life and the next. The Prophet (ṣ) warned:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ يَنْزِلُ بِهَا فِي النَّارِ أَبْعَدَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ<\/p>\n<p><strong>Verily, the servant may speak a single word for which he plummets into the Hellfire farther than the distance between East and West:<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6477, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/09\/fall-into-hell-one-word\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Qayyim rightly asks:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكم من حرب جرتها كلمة واحدة<\/p>\n<p>How many wars were started because of a single word?<\/p>\n<p>Source: Badāʼiʻ al-Fawāʼid 2\/273<\/p><\/blockquote>\n<p>The rhetoric we use cannot be taken lightly, for it is literally a matter of Heaven or Hell.<\/p>\n<p>Directness, even harshness, may be warranted in specific circumstances, such as when tyrannical authorities must be called to account. Such is an act of jihad, according to the Prophet (ṣ):<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْظَمِ الْجِهَادِ كَلِمَةَ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ<\/p>\n<p><strong>Verily, among the greatest acts of jihad is a word of justice in front of a tyrannical ruler.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2174, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/13\/greatest-jihad-word-haqq-truth\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>However, this requires wisdom, as we have said, and its place is directly in front of the obstinate oppressor, not as a general message to the public on social media, and even so it must be done with dignified manners and in a way so as not to poison the hearts. As a general rule, Allah disapproves of harshness in public speaking, as the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ<\/p>\n<p><strong>Verily, the most hated man to Allah is the one who is fiercest in argument.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2668, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/09\/19\/do-not-argue-harshly\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Nor should we rage publicly about the situation of the world as an act of mere venting our emotions, without considering the enormous consequences in the Hereafter. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يُبْغِضُ كُلَّ جَعْظَرِيٍّ جَوَّاظٍ سَخَّابٍ بِالأَسْوَاقِ جِيفَةٍ بِاللَّيْلِ حِمَارٍ بِالنَّهَارِ عَالِمٍ بِأَمْرِ الدُّنْيَا جَاهِلٍ بِأَمْرِ الآخِرَةِ<\/p>\n<p><strong>Verily, Allah hates every rude, harsh person, shouting in the markets, foul by night and foolish by day, knowing the affairs of the world and ignorant of the Hereafter.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 72, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/03\/06\/allah-hates-ignorant-obnoxious\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Our rhetoric must also be based upon the truth, both the existential divine truth and the truth about any particular worldly matter. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ<\/p>\n<p><strong>O you who have faith, fear Allah and be among the truthful.<\/strong><\/p>\n<p>Source: Surat al-Tawbah 9:119<\/p><\/blockquote>\n<p>The danger here is that the media landscape, both mainstream and social, is dominated by people who are not guided by faith, but rather by their political ideologies. The ever-present temptation is to react instantly with confirmation bias, to immediately interpret events to support a pre-existing narrative, rather than an objective analysis of facts. For this reason, one must be careful about sharing information on social media without confirming the details from trustworthy sources. The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَفَى بِالْمَرْءِ كَذِبًا أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ<\/p>\n<p><strong>It is enough falsehood for someone to speak of everything he hears.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 5, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/11\/18\/falsehood-repeat-everything\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When a person or an incident is unjustly labeled as racist, this is damaging to the cause of racial justice because it produces cynicism in the people whose minds need to be changed. If everything is racist, then nothing is racist; the term loses its moral authority.<\/p>\n<p>What is more, media narratives that are promoted by elite corporate and political organizations ought to be viewed with suspicion, as they have vested worldly interests in adopting certain self-serving worldviews. Malcolm X warned us about the power of the media to invert reality:<\/p>\n<blockquote><p>The press is so powerful in its image-making role, it can make a criminal look like he&#8217;s the victim and make the victim look like he&#8217;s the criminal. This is the press, an irresponsible press. It will make the criminal look like he&#8217;s the victim and make the victim look like he&#8217;s the criminal. If you aren&#8217;t careful, the newspapers will have you hating the people who are being oppressed and loving the people who are doing the oppressing&#8230; That&#8217;s the image-making press. That thing is dangerous if you don&#8217;t guard yourself against it. It&#8217;ll make you love the criminal, as I say, and make you hate the one who&#8217;s the victim of the criminal.<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a><\/p><\/blockquote>\n<p>These words were as true then as they are now. Since the media has this ability to make evil look good and good look evil, we need to be wary of the echo-chamber effect, in which a person is repeatedly exposed only to one-sided narratives and thus is presented with a distorted picture of reality. On the contrary, as racism is only truly overcome by reconciliation and a victory of hearts and minds, biased narratives about racism, whether exaggerating it or denying it, are harmful to this goal.<\/p>\n<p>That said, the rhetoric employed by a movement is essential to its success, as it would be to any political campaign. From our religious perspective, then, speeches and public outreach need to account for the nature of the human soul, with its propensity to give itself over to anger, malice, and evil intentions, all of which are detrimental to people in the next life, let alone in the world. Our words ought to be noble and refined, honest and sincere, reminding of Allah and calling others to His straight path, piercing through the shell of worldliness to release the light of faith within the heart of every man and woman.<\/p>\n<p><em>Non-Violence in Action<\/em><\/p>\n<p>The adoption of principled non-violence on spiritual and rhetorical levels must necessarily be followed through by non-violence in action. This tactic does not preclude immediate self-defense or legal retaliation for wrongs, but anything less should be patiently endured for the sake of the greater good. This is, of course, much easier said than done. Not only is this non-violence more conducive to reconciliation and changing minds, it is more importantly the way of reform applied by the Prophets and their righteous followers.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ<\/p>\n<p><strong>Not equal are the good deed and the bad. Repel evil by that which is better, and thereupon the one whom between you and him is hostility will become as though he was a devoted friend.<\/strong><\/p>\n<p>Source: Surat Fussilat 41:34<\/p><\/blockquote>\n<p>Now, this principle of repelling evil with good exists at the three levels under discussion: repelling evil thoughts within the heart with good thoughts rooted in faith, repelling evil words with graceful and honest speech, and repelling evil actions with better actions. By combining these three elements in opposition to racism, it is possible to positively influence the hearts of those who have been beguiled by their arrogance, and to recruit new members into the anti-racism collective. Ibn al-Qayyim describes the persuasive power of this principle:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإنه كل من سمع أنه محسن إلى ذلك الغير وهو مسيء إليه وجد قلبه ودعاءه وهمته مع المحسن على المسيء وذلك أمر فطري فطر الله عباده فهو بهذا الإحسان قد استخدم عسكرا لا يعرفهم ولا يعرفونه<\/p>\n<p>For all who hear that one is good to others and is treated badly in return, he will find his heart, his call, and his concerns in support of the good doer over the wrongdoer. That is a matter of natural instinct (<em>fitri<\/em>) upon which Allah constituted His servants. By this good behavior, soldiers will be employed for him whom he does not know and they do not know him.<\/p>\n<p>Source: Badāʼiʻ al-Fawāʼid 2\/244<\/p><\/blockquote>\n<p>One might recall the success of non-violent technique in America, when civil rights activists protested Jim Crow laws and were met by unjust state-sanctioned violence. The televised images of innocent black people being brutalized by police had a powerful effect on the American public, convincing many people of the injustices embedded within Jim Crow and its racial ideology.<\/p>\n<p>There are several texts in the Quran and Sunnah that confirm the virtue of non-violent resistance in its rightful circumstances. Allah praises the believers:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَٰئِكَ لَهُمْ عُقْبَى الدَّارِ<\/p>\n<p><strong>…who are patient, seeking the countenance of their Lord, and establish prayer and spend from what We have provided for them, secretly and publicly, and repel evil with good, for those will have the good end.<\/strong><\/p>\n<p>Source: Surat al-Ra’d 13:22<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ ۚ نَحْنُ أَعْلَمُ بِمَا يَصِفُونَ<\/p>\n<p><strong>Repel evil with what is better. We are most knowing of what they describe.<\/strong><\/p>\n<p>Surat al-Mu’minun 23:96<\/p><\/blockquote>\n<p>The Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الْوَاصِلُ بِالْمُكَافِئِ وَلَكِنْ الْوَاصِلُ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا<\/p>\n<p><strong>The one who keeps good relations with family is not the one who is reciprocated. Rather, the one who keeps good relations with family is one who does so despite being cut off by them. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5991, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/03\/silat-al-rahim-reciprocate\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صِلْ مَنْ قَطَعَكَ وَأَعْطِ مَنْ حَرَمَكَ وَاعْفُ عَمَّنْ ظَلَمَكَ<\/p>\n<p><strong>Reconcile with whoever cuts you off, give to whoever deprives you, and forgive whoever wrongs you.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 17452, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/29\/reconcile-cuts-you-off\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ عَبْدٍ ظُلِمَ بِمَظْلَمَةٍ فَيُغْضِي عَنْهَا لِلَّهِ عَزَّ وَجَلَّ إِلَّا أَعَزَّ اللَّهُ بِهَا نَصْرَهُ<\/p>\n<p><strong>No servant is afflicted by wrongdoing and he overlooks it for the sake of Allah but that Allah Almighty will support him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 9624, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/01\/three-get-what-they-deserve\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Abdullah ibn Amr reports that Allah described the Prophet (ṣ) in the Torah, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَحِرْزًا لِلأُمِّيِّينَ أَنْتَ عَبْدِي وَرَسُولِي سَمَّيْتُكَ الْمُتَوَكِّلَ لَيْسَ بِفَظٍّ وَلاَ غَلِيظٍ وَلاَ صَخَّابٍ فِي الأَسْوَاقِ وَلاَ يَدْفَعُ بِالسَّيِّئَةِ السَّيِّئَةَ وَلَكِنْ يَعْفُو وَيَغْفِرُ<\/p>\n<p><strong>I have called you a trustworthy man who is neither rude nor loud in the markets, nor does he return evil with evil, but rather he pardons and forgives.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2125, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/15\/prophet-described-tawrat-torah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha similarly described the Prophet (ṣ), saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمْ يَكُنْ فَاحِشًا وَلَا مُتَفَحِّشًا وَلَا صَخَّابًا فِي الْأَسْوَاقِ وَلَا يَجْزِي بِالسَّيِّئَةِ السَّيِّئَةَ وَلَكِنْ يَعْفُو وَيَصْفَحُ<\/p>\n<p>He was not indecent, he was not obscene, he would not shout in the markets, and he would not respond to an evil deed with an evil deed, but rather he would pardon and overlook.<\/p>\n<p>Source: Sunan al-Tirmidhī 2016, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/12\/01\/hilm-evil-with-evil-forgive\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>All of these texts are expressions of the virtue of humility previously mentioned, as stated by Al-Ghazali:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْهَا أَنْ يَتَوَاضَعَ بِالِاحْتِمَالِ إِذَا سُبَّ وَأُوذِيَ وأخذ حقه فذلك هو الأصل<\/p>\n<p>Among the traits of humility is to endure insults, harm, and the violation of one’s rights, and this is the basis of it.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/356<\/p><\/blockquote>\n<p>The principle of non-violence should be understood within the context of the Islamic obligation to enjoin good and forbid evil (<em>al-amr bil-ma&#8217;ruf wal-nahi &#8216;an al-munkar<\/em>). It is true that whoever sees evil is obligated to resist it to the best of their ability, as the Prophet (ṣ) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ<\/p>\n<p><strong>Whoever among you sees evil, let him change it with his hand. If he is unable to do so, then with his tongue. If he is unable to do so, then with his heart, and that is the weakest level of faith.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 49, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/26\/whoever-sees-evil-change-it\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Resistance to evil is confirmed, but how evil may be resisted requires further explanation. Resisting “by the hand” does not necessitate a violent or forceful response. Imam Ahmad commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">التَّغْيِيرَ بِالْيَدِ لَا يَسْتَلْزِمُ الْقِتَالَ &#8230; التَّغْيِيرُ بِالْيَدِ لَيْسَ بِالسَّيْفِ وَالسِّلَاحِ<\/p>\n<p>Changing by the hand does not necessarily mean fighting&#8230; changing evil by the hand is not by swords and weapons.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/248<\/p><\/blockquote>\n<p>There is also the practical matter that rebelling against a powerful government exposes oneself to serious danger, as Ahmad said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَتَعَرَّضُ لِلسُّلْطَانِ فَإِنَّ سَيْفَهُ مَسْلُولٌ<\/p>\n<p>Do not confront the ruler, for his sword is unsheathed.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 2\/249<\/p><\/blockquote>\n<p>Resistance should not be for the sake of itself, but rather to achieve a legitimate objective. Throwing oneself into danger without a reasonable expectation of success does nothing good for the cause.<\/p>\n<p>Many times, indeed most of the time, non-violence is the most effective response to wrongdoing, rather than taking up arms. The Prophet (ṣ) warned us about bloodshed to come:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلَاهَا فِي النَّارِ اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِ<\/p>\n<p><strong>There will be a tribulation that will wipe out the Arabs, in which those killed on both sides are in the Hellfire. In that time, the spoken word will be stronger than the sword.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6980, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/30\/fitnah-lisan-better-sayf\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In such a situation, despite the presence of a violent conflict, the appropriate response is to wage jihad by the tongue, that is, through writing, speaking, and educating. As the classic proverb suggests, “The pen is mightier than the sword.” This is especially true when the purpose of the struggle is to change hearts and minds, rather than to enact revenge.<\/p>\n<p>The American civil rights movement successfully employed a number of non-violent techniques such as boycotts, peaceful marches, and educational initiatives. These actions can serve as a model for opposing racism in the modern day, particularly now that powerful information tools are available to spread the message of universal justice and neighborly love to the far ends of the earth.<\/p>\n<p>In regards to forbidding evil, it has conditions like most other acts in Islam. One cannot simply take it upon oneself to resist injustice without knowing the purpose and limits of resistance. The early scholar of the righteous predecessors, Sufyan al-Thawri, described these conditions as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَأْمُرُ بِالْمَعْرُوفِ وَلا يَنْهَى عَنِ الْمُنْكَرِ إِلا مَنْ كَانَ فِيهِ خِصَالٌ ثَلاثٌ رَفِيقٌ بِمَا يَأْمُرُ رَفِيقٌ بِمَا يَنْهَى عَدْلٌ بِمَا يَأْمُرُ عَدْلٌ بِمَا يَنْهَى عَالِمٌ بِمَا يَأْمُرُ عَالِمٌ بِمَا يَنْهَى<\/p>\n<p>No one may enjoin good or forbid evil except for one who has three qualities: gentleness in what he enjoins and forbids, justice in what he enjoins and forbids, and knowledge of what he enjoins and forbids.<\/p>\n<p>Source: al-Amr bil-Maʻrūf lil-Khallāl 32<\/p><\/blockquote>\n<p>Ibn Taymiyyah mentions narrations in this regard and he concludes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا بُدَّ مِنْ هَذِهِ الثَّلَاثَةِ الْعِلْمُ وَالرِّفْقُ وَالصَّبْرُ الْعِلْمُ قَبْلَ الْأَمْرِ وَالنَّهْيُ وَالرِّفْقُ مَعَهُ وَالصَّبْرُ بَعْدَهُ<\/p>\n<p>One who enjoins good must have three qualities: knowledge, gentleness, and patience. Knowledge comes before it, gentleness comes during it, and patience comes after it.<\/p>\n<p>Source: Majmū’ al-Fatāwà 28\/137<\/p><\/blockquote>\n<p>Put differently, one must be gentle in their resistance, which is to say one must use the least amount of force as is necessary; one must be knowledgeable of the purpose of resistance, to achieve reform and not revenge; one must be just when resisting evil, because injustice itself is never an acceptable response to injustice; and one must be patient and forbearing, as resistance inevitably provokes a hostile response. It is necessary to craft a wise strategy containing these three elements, as the purpose of forbidding evil is to stop evil by causing as little harm as possible, not to satisfy the ego’s desire for vengeance. Ibn Taymiyyah warns us:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قِيلَ لِيَكُنْ أَمْرُك بِالْمَعْرُوفِ وَنَهْيُك عَنْ الْمُنْكَرِ غَيْرَ مُنْكَرٍ وَإِذَا كَانَ هُوَ مِنْ أَعْظَمِ الْوَاجِبَاتِ والمستحبات فَالْوَاجِبَاتُ والمستحبات لَا بُدَّ أَنْ تَكُونَ الْمَصْلَحَةُ فِيهَا رَاجِحَةً عَلَى الْمَفْسَدَةِ<\/p>\n<p>It is said: Let not your enjoining good and forbidding evil be itself evil. As it is among the greatest of obligatory and recommended deeds, thus the benefit of obligatory and recommended deeds must outweigh their harm.<\/p>\n<p>Source: Majmū’ al-Fatāwà 28\/126<\/p><\/blockquote>\n<p>Any action that perpetuates the cycle of revenge violence, thereby causing more harm than good, is categorically rejected in Islam.<\/p>\n<p>Further to this point, we should be clear about the limits of “eye for an eye,” or the idea that the punishment should fit the crime. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنِ اعْتَدَىٰ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَىٰ عَلَيْكُمْ ۚ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ<\/p>\n<p><strong>Whoever transgresses against you, then transgress against him in like manner. And fear Allah and know that Allah is with those who fear Him.<\/strong><\/p>\n<p>Surat al-Baqarah 2:194<\/p><\/blockquote>\n<p>Retaliation by law is permissible, even though in many cases it is better not to bring charges in court. However, it is never allowed to respond to an evil with a deed that is inherently unlawful in every circumstance. Al-Qurtubi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ ظَلَمَكَ فَخُذْ حَقَّكَ مِنْهُ بِقَدْرِ مَظْلِمَتِكَ وَمَنْ شَتَمَكَ فَرُدَّ عَلَيْهِ مِثْلَ قَوْلِهِ وَمَنْ أَخَذَ عِرْضَكَ فَخُذْ عِرْضَهَ لَا تَتَعَدَّى إِلَى أَبَوَيْهِ وَلَا إِلَى ابْنِهِ أَوْ قَرِيبِهِ وَلَيْسَ لَكَ أَنْ تَكْذِبَ عَلَيْهِ وَإِنْ كَذَبَ عَلَيْكَ فَإِنَّ الْمَعْصِيَةَ لَا تُقَابَلُ بِالْمَعْصِيَةِ<\/p>\n<p>Whoever oppresses you, then you may take your rights from him according to the measure of his oppression. Whoever insults you, then you may respond similar to his saying. Whoever takes from your honor, then you may take from his honor. But do not transgress against his parents or his sons or his relatives. It is not your right to lie against him if he has lied against you. Indeed, a sin should not be met with another sin.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 2:194<\/p><\/blockquote>\n<p>Al-Ghazali expresses the same limiting principle:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْلَمْ أَنَّ كُلَّ ظُلْمٍ صَدَرَ مِنْ شَخْصٍ فَلَا يَجُوزُ مُقَابَلَتُهُ بِمِثْلِهِ فَلَا تَجُوزُ مُقَابَلَةُ الْغِيبَةِ بِالْغِيبَةِ وَلَا مُقَابَلَةُ التَّجَسُّسِ بِالتَّجَسُّسِ وَلَا السَّبُّ بِالسَّبِّ وَكَذَلِكَ سَائِرُ الْمَعَاصِي وإنما القصاص والغرامة على قدر ما ورد الشرع به<\/p>\n<p>Know that for every wrong act committed by a person, it is not permissible to confront him with the same as it. It is not permissible to confront backbiting with backbiting, or to confront spying with spying, nor insult with insult. Likewise for the rest of the acts of sinful disobedience. Indeed, retaliation and penalty are only in accordance with the measure stipulated by the Law.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/179<\/p><\/blockquote>\n<p>Ibn Taymiyyah similarly reiterates this principle:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">من كذب عليك وزنى بأهلك ليس لك أن تكذب عليه وتزني بأهله لأن الكذب والزنا حرام لحق الله<\/p>\n<p>If someone lies against you or commits adultery with your family, it would not be permissible for you to lie against him or commit adultery with his family. Adultery and falsehood are unlawful by the right of Allah.<\/p>\n<p>Source: Al-Istighāthah fī al-Radd ’alà al-Bakrī 1\/252<\/p><\/blockquote>\n<p>All of this is in agreement with the Prophet’s (ṣ) instruction:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَخُنْ مَنْ خَانَكَ<\/p>\n<p><strong>Do not be treacherous to the one who betrays you<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1264, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/do-not-reciprocate-treachery\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This is because treachery and betrayal are inherently evil and are never permissible under any circumstances.<\/p>\n<p>Even in cases in which legal retaliation is completely justified, it is recommended to forgive and pardon the wrongdoer as long as it does not result in greater harm. Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُم بِهِ ۖ وَلَئِن صَبَرْتُمْ لَهُوَ خَيْرٌ لِّلصَّابِرِينَ<\/p>\n<p><strong>If you punish, then punish by the measure you were punished, but if you are patient, the best outcome is for the patient.<\/strong><\/p>\n<p>Surat al-Nahl 16:126<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ<\/p>\n<p><strong>The retribution for a harmful act is a harmful one like it, but whoever pardons and makes reconciliation, his reward is with Allah. Verily, He does not love wrongdoers.<\/strong><\/p>\n<p>Surat al-Shura 42:40-43<\/p><\/blockquote>\n<p>We must remember that every racist is a flawed human being, just like ourselves, who has the capacity to turn towards their better nature. By viewing them as patients in need of treatment, rather than as devils in need of annihilation, it not only protects our own hearts from the detrimental effects of malice, but also enables us to improve our societies. Their perspectives and concerns should not be dismissed out of hand, for there is benefit in listening to the “other side,” as difficult as that may be. Dr. King spoke about the value of listening to his adversaries:<\/p>\n<blockquote><p>Here is the true meaning and value of compassion and nonviolence, when it helps us to see the enemy&#8217;s point of view, to hear his questions, to know his assessment of ourselves. For from his view we may indeed see the basic weaknesses of our own condition, and if we are mature, we may learn and grow and profit from the wisdom of the brothers who are called the opposition.<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a><\/p><\/blockquote>\n<p>Indeed, Al-Ghazali says nearly the same thing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ يَسْتَفِيدَ مَعْرِفَةَ عُيُوبِ نَفْسِهِ مِنْ أَلْسِنَةِ أَعْدَائِهِ فَإِنَّ عَيْنَ السُّخْطِ تُبْدِي الْمَسَاوِيَا وَلَعَلَّ انْتِفَاعَ الْإِنْسَانِ بِعَدُوٍّ مشاحن يذكره عُيُوبَهُ أَكْثَرُ مِنِ انْتِفَاعِهِ بِصَدِيقٍ مُدَاهِنٍ يُثْنِي عَلَيْهِ وَيَمْدَحُهُ وَيُخْفِي عَنْهُ عُيُوبَهُ<\/p>\n<p>One may gain advantage in learning his own faults by the tongues of his enemies, for the eye of hostility brings out defects. Perhaps a man may benefit more from a hateful enemy mentioning his faults than he benefits from a flattering friend who commends him and praises him, thereby obscuring his faults.<\/p>\n<p>Source: Iḥyā’ ’Ulūm al-Dīn 3\/65<\/p><\/blockquote>\n<p>We cannot simply write off people as hopeless if they do not immediately see our point of view. There is always hope that common ground might be achieved, if not complete agreement. As Allah ﷻ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَسَى اللَّهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً ۚ وَاللَّهُ قَدِيرٌ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ<\/p>\n<p><strong>Perhaps Allah will place affection between you and those among them who have been your enemies. Allah is powerful, and Allah is forgiving and merciful.<\/strong><\/p>\n<p>Surat al-Mumtahanah 60:7<\/p><\/blockquote>\n<p>Instead of giving up on the way of non-violence, we might be required to listen to our adversaries, to understand their perspective, or to survey them in polls and focus groups. If a particular rhetorical or activist strategy fails to persuade the intended audience, it should be reevaluated, improved, or discarded. But if the goal of persuasion and reconciliation is abandoned completely, then the scourge of racism and its chief proponent, Satan himself, will rejoice in our surrender.<\/p>\n<h4><span class=\"ez-toc-section\" id=\"Conclusion_A_Victory_of_Hearts_and_Minds\"><\/span><strong>Conclusion: A Victory of Hearts and Minds<\/strong><span class=\"ez-toc-section-end\"><\/span><\/h4>\n<p>Racism, as ordinarily defined, is the belief that one race or ethnicity is superior to another, an idea that has long been used to justify prejudice, discrimination, oppression, and violence. While modern racism originated from pseudo-scientific concepts of human biological difference or eugenics, it continues on today in many forms as a tribal in-group\/out-group dynamic in which the out-groups are treated with a lesser standard of justice than the in-groups. In other words, the in-groups do not treat the out-groups the way they would like to be treated.<\/p>\n<p>Islam provides use with the solid theological foundation from which to dismantle racist beliefs through the cleansing of individual souls as a precursor to social reform. All human beings are connected by common descent from Adam and Eve and therefore have a firm basis from which we can live together not only as neighbors who tolerate one another, but who actually love good for each other. There is a universal standard of justice embedded in the creation, what some have called “natural law,” that sanctifies basic human rights, thereby frustrating the arrogance of Satan and the tribalist impulse at the heart of racism. Since racism is a false belief in the heart, it must be resisted by means of persuasion and “repelling evil with good,” a type of spiritually aggressive but physically non-violent program rooted in the Islamic virtues of goodwill, reconciliation, and humility, with the ultimate goal of winning a victory for hearts and minds<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n<p><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Navid Ghani, &#8220;Racism&#8221; in the <em>Encyclopedia of Race, Ethnicity, and Society<\/em> (Los Angeles: SAGE Publications, 2008), 1113.<\/p>\n<p><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Robert W. Sussman, <em>The Myth of Race: The Troubling Persistence of an Unscientific Idea<\/em> (Cambridge, Massachusetts : Harvard University Press, 2014), 1-2.<\/p>\n<p><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> The majority of scholarship on race in American academia is informed by Critical Race Theory (CRT), an approach which suffers methodological problems including an unreliable epistemology, a purposeful lack of objectivity, postmodern redefinition of commonly used terms, and the assumption that racism by itself sufficiently explains every social disparity. Most importantly, CRT does not have the necessary theological and spiritual foundation from which to properly oppose racism as traditionally understood. Rather than affirming or denying the claims of CRT, the aim of this paper is to present the approach to racism as found in Islam’s source-texts, the Quran and Sunnah, which must be the non-negotiable starting point for Muslims to engage, confirm, or deny CRT-inspired scholarship and activism.<\/p>\n<p><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Malcolm X, Alex Haley, and Gary Yonge, <em>The Autobiography of Malcolm X<\/em> (London : Penguin, 2007), 454.<\/p>\n<p><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> <em>The Autobiography of Malcolm X<\/em>, 452.<\/p>\n<p><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> <em>The Autobiography of Malcolm X<\/em>, 455.<\/p>\n<p><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Martin Luther King Jr., “The Power of Nonviolence,” in <em>A Testament of Hope: The Essential Writings and Speeches of Martin Luther King Jr.<\/em> (New York: New York, HarperOne, 1991), 13.<\/p>\n<p><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Martin Luther King Jr., “An Experiment in Love,” in <em>A Testament of Hope<\/em>, 19.<\/p>\n<p><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Martin Luther King Jr., “An Experiment in Love,” in <em>A Testament of Hope<\/em>, 18.<\/p>\n<p><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> <em>The Autobiography of Malcolm X<\/em>, 453.<\/p>\n<p><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> <em>The Autobiography of Malcolm X<\/em>, 483.<\/p>\n<p><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Martin Luther King Jr., “Where do we go from here: Chaos or community?” in <em>A Testament of Hope<\/em>, 557.<\/p>\n<p><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> <em>The Autobiography of Malcolm X<\/em>, 479.<\/p>\n<p><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> <em>The Autobiography of Malcolm X<\/em>, 471.<\/p>\n<p><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Martin Luther King Jr., “An Experiment in Love,” in <em>A Testimony of Hope<\/em>, 17.<\/p>\n<p><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> Booker T. Washington, <em>Up from Slavery: An Autobiography<\/em> (New York: Doubleday, 1901), 165.<\/p>\n<p><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Malcolm X, <em>Malcolm X Speaks: Selected Speeches and Statements<\/em> (New York, NY: Merit Publishers, 1965), 100.<\/p>\n<p><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> &#8220;Beyond Vietnam&#8221;: Speech at Riverside Church Meeting, New York, N.Y., April 4, 1967.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;No one is better than anyone else, except by religion or good deeds.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[14,168,49,34,104,48,56,126,62,68],"class_list":["post-23529","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-arrogance-al-takabbur","tag-enjoin-good-amr-bil-maruf","tag-gentleness-al-rifq","tag-humanity-al-insaaniyyah","tag-humility-al-tawaduh","tag-justice-adl","tag-monotheism-tawheed","tag-neighbors","tag-prophetic-biography-sirah","tag-satan-al-shaytan"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-67v","jetpack-related-posts":[{"id":14427,"url":"https:\/\/www.abuaminaelias.com\/islam-against-racism-bigotry\/","url_meta":{"origin":23529,"position":0},"title":"Islam is against racism and prejudice","author":"Abu Amina Elias","date":"July 25, 2013","format":false,"excerpt":"\"Verily, the most noble of you to Allah is the most righteous of you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17588,"url":"https:\/\/www.abuaminaelias.com\/ignorance-tribalism-racism\/","url_meta":{"origin":23529,"position":1},"title":"Tribalism and racism is ignorance in Islam","author":"Abu Amina Elias","date":"January 10, 2016","format":false,"excerpt":"\"O you who believe, be persistently standing firm in justice...\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23736,"url":"https:\/\/www.abuaminaelias.com\/custodianship-of-the-right-hand\/","url_meta":{"origin":23529,"position":2},"title":"Custodianship of the Right Hand: Concubinage, Rape, and &#8216;Sexual Slavery&#8217; in Islam","author":"Abu Amina Elias","date":"December 9, 2021","format":false,"excerpt":"\"This paper addresses the allegations...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18845,"url":"https:\/\/www.abuaminaelias.com\/are-arabs-master-race-in-islam\/","url_meta":{"origin":23529,"position":3},"title":"Are Arabs the master race in Islam?","author":"Abu Amina Elias","date":"February 4, 2018","format":false,"excerpt":"\"There is no favor of an Arab over a foreigner,\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20053,"url":"https:\/\/www.abuaminaelias.com\/equality-and-equity-in-islam\/","url_meta":{"origin":23529,"position":4},"title":"Equality and equity in Islam","author":"Abu Amina Elias","date":"December 11, 2018","format":false,"excerpt":"\"There are two words for justice in Islam...\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16945,"url":"https:\/\/www.abuaminaelias.com\/understanding-loyalty-and-disavowal-in-islam\/","url_meta":{"origin":23529,"position":5},"title":"Understanding loyalty and disavowal in Islam","author":"Abu Amina Elias","date":"August 31, 2015","format":false,"excerpt":"\"The believing men and believing women are allies of one another.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23529","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23529"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23529\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23529"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23529"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23529"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}