{"id":23559,"date":"2016-07-04T10:48:19","date_gmt":"2016-07-04T06:48:19","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23559"},"modified":"2025-07-04T11:04:29","modified_gmt":"2025-07-04T07:04:29","slug":"shariah-fiqh-qanun","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/shariah-fiqh-qanun\/","title":{"rendered":"Sharia, Fiqh, and Islamic law explained"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>There are three words for law in Islam: Sharia, Fiqh, and Qanun. Each of these words represent a different aspect of the word “law” as used in English. The public is further confused because academics or even Muslims tend to use the term “Islamic law” without distinguishing between these three types of law. It is important for Muslims to know the differences between these terms and how they function together to build a cohesive and stable Islamic society, but more importantly to guide souls safely into the Hereafter.<\/p>\n<p><em>Sharia<\/em> literally means ‘the path to the watering-hole,’ such as a place where animals would go to drink. This conveys the sense of the life-giving nature of righteous law as revealed by Allah in the Quran and Sunnah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِّنَ الْأَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ لَا يَعْلَمُونَ<\/p>\n<p><strong>Thus, We have ordained a law for you in the matter, so follow it and do not follow the whims of those who do not know.<\/strong><\/p>\n<p>Surat al-Jathiyah 45:18<\/p><\/blockquote>\n<p>The Sharia is rational and is based upon clear objectives (<em>maqasid<\/em>) that are the foundations of human welfare and civilization. As the verse states, Sharia stands in opposition to human whims and selfish desires, which are the main cause of disorder and destruction in this life and in the Hereafter.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لكننا نعنى بالمصلحة المحافظة على مقصود الشرع ومقصود الشرع من الخلق خمسة وهو أن يحفظ عليهم دينهم وأنفسهم وعقلهم ونسلهم ومالهم فكل ما يتضمن حفظ هذه الأصول الخمسة فهو مصلحة وكل ما يفوت هذه الأصول الخمسة فهو مفسدة<\/p>\n<p>By welfare we mean preservation of the objectives of the Sharia. The objectives of the Sharia are five in creation: the protection of religion, life, intellect, family relations, and property. Everything that advances the protection of these five fundamentals is considered benefit, and everything that fails to protect these five fundamentals is considered corruption.<\/p>\n<p>Source: al-Mustasfá min ʻIlm al-Uṣūl 1\/174<\/p><\/blockquote>\n<p>Not everything Muslims refer to as ‘Sharia’ is actually the Sharia as revealed by Allah, because like many Islamic terms, over time its applied meaning has been obscured or misappropriated.<\/p>\n<p>Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ الشَّرِيعَةَ مَبْنَاهَا وَأَسَاسُهَا عَلَى الْحِكَمِ وَمَصَالِحِ الْعِبَادِ فِي الْمَعَاشِ وَالْمَعَادِ وَهِيَ عَدْلٌ كُلُّهَا وَرَحْمَةٌ كُلُّهَا وَمَصَالِحُ كُلُّهَا وَحِكْمَةٌ كُلُّهَا فَكُلُّ مَسْأَلَةٍ خَرَجَتْ عَنْ الْعَدْلِ إلَى الْجَوْرِ وَعَنْ الرَّحْمَةِ إلَى ضِدِّهَا وَعَنْ الْمَصْلَحَةِ إلَى الْمَفْسَدَةِ وَعَنْ الْحِكْمَةِ إلَى الْبَعْثِ فَلَيْسَتْ مِنْ الشَّرِيعَةِ وَإِنْ أُدْخِلَتْ فِيهَا بِالتَّأْوِيلِ<\/p>\n<p>Verily, the Sharia is founded upon wisdom and welfare for the servants in this life and the afterlife. In its entirety it is justice, mercy, benefit, and wisdom. Every matter which abandons justice for tyranny, mercy for cruelty, benefit for corruption, and wisdom for foolishness is not a part of the Sharia even if it was introduced therein by an interpretation.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/07\/ibn-qayyim-maqasid-al-shariah\/\">I’lām al-Muwaqqi’īn 3\/11<\/a><\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَدْ بَيَّنَ سُبْحَانَهُ بِمَا شَرَعَهُ مِنْ الطُّرُقِ أَنَّ مَقْصُودَهُ إقَامَةُ الْعَدْلِ بَيْنَ عِبَادِهِ وَقِيَامُ النَّاسِ بِالْقِسْطِ فَأَيُّ طَرِيقٍ اُسْتُخْرِجَ بِهَا الْعَدْلُ وَالْقِسْطُ فَهِيَ مِنْ الدِّينِ وَلَيْسَتْ مُخَالِفَةً لَهُ<\/p>\n<p>Allah Almighty has made clear by many of His laws that the purpose is to establish justice between His servants and for people to behave fairly. Whichever path leads to justice and fairness is part of the religion and does not contradict it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/06\/ibn-al-qayyim-sharia-justice\/\">al-Ṭuruq al-Ḥikmīya 1\/13<\/a><\/p><\/blockquote>\n<p>In the technical usage of Muslim scholars, the Sharia contains three elements that comprise the totality of the religion: creed (<em>aqa’id<\/em>), law (<em>ahkam<\/em>), and ethics (<em>akhlaq<\/em>); that is, the Sharia is theology, jurisprudence, and morality.<\/p>\n<p>According to the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالشَّرْعُ فِي اصْطِلاَحِ عُلَمَاءِ الاسلام هُوَ مَا سَنَّهُ اللَّهُ لِعِبَادِهِ مِنْ أَحْكَامٍ عَقَائِدِيَّةٍ أَوْ عَمَلِيَّةٍ أَوْ خُلُقِيَّةٍ<\/p>\n<p>The ‘Law’ in the terminology of the scholars of Islam is what Allah has instituted for His servants of rules in regards to creedal beliefs, practical conduct, and morality.<\/p>\n<p>Source: al-Mawsū’at al-Fiqhīyah al-Kuwaytīyah 1\/16<\/p><\/blockquote>\n<p>These three elements govern all aspects of human living: creed guides the mind and its relationship with the Creator, law guides the behavior of individuals and societies, and morality guides the application of law and the life of the human heart. As such, the Sharia is the religion of Islam in its totality, both its inward and outward aspects, its explicit rules and its derivative principles.<\/p>\n<p>A common and erroneous misconception exists among the public, both Muslims and non-Muslims, that the Sharia is a revolutionary ideology similar to Communism. Militant Muslim groups, in the name of implementing Sharia, have destabilized much of the Muslim world and killed many Muslims in the name of their ideology. Evidence that this is an innovated understanding of Islam is the adoption of the Western term ‘ideology’ into Arabic as <em>aydiyulujiyyah<\/em>, which was directly borrowed from secular political discourse.<\/p>\n<p>The truth is that the ‘ideological’ understanding of the Sharia is hyper-focused on worldly matters, geopolitics, and a desire to seize power from what they consider to be ‘infidel’ Muslim governments. While Islam opposes injustice anywhere in the world, it cannot be opposed to the neglect of its spiritual and ethical underpinnings, nor is there any firm precedent in Islam for instigating civil wars, terrorist bombings, and social unrest, all of which disrupt the primary goal of Islam to worship Allah in safety and peace.<\/p>\n<p>On the contrary, the Prophet (ṣ) himself was offered kingship in this world and he refused, preferring instead to focus upon worshipping his Lord and serving His will on earth by preaching the message of the One True God.<\/p>\n<p>Abu Huraira reported: The Angel Gabriel was with the Prophet, peace and blessings be upon him, and he looked towards the sky as an angel descended. Gabriel said, “Verily, this angel has not come down since the day he was created.” The angel said, “O Muhammad, your Lord has sent me to you with the offer that I make you a prophet-king or a servant-messenger.” Gabriel said, “Be humble before your Lord, O Muhammad.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بَلْ عَبْدًا رَسُولًا<\/p>\n<p><strong>Rather, I will be a servant-messenger<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 7120, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/03\/29\/prophet-choose-servant-not-king\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Leadership and political power are only important in so far as they protect the rights of Muslims to practice Islam freely and the rights of non-Muslims to accept Islam freely, as well as their security, welfare, and the rest of the Sharia’s objectives. Government is not an end in itself, rather it is a means to an end: the worship of Allah alone and the well-being of His creation.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ قَوْلَ الْقَائِلِ إِنَّ مَسْأَلَةَ الْإِمَامَةِ أَهَمُّ الْمَطَالِبِ فِي أَحْكَامِ الدِّينِ وَأَشْرَفُ مَسَائِلِ الْمُسْلِمِينَ كَذِبٌ بِإِجْمَاعِ الْمُسْلِمِينَ سُنِّيِّهِمْ وَشِيعِيِّهِمْ بَلْ هَذَا كُفْرٌ فَإِنَّ الْإِيمَانَ بِاللَّهِ وَرَسُولِهِ أَهَمُّ مِنْ مَسْأَلَةِ الْإِمَامَةِ وَهَذَا مَعْلُومٌ بِالِاضْطِرَارِ مِنْ دِينِ الْإِسْلَامِ<\/p>\n<p>One who says the matter of government is the most important objective in the rulings of the religion and the most noble matter to the Muslims, he has lied according to the consensus of the Muslims, both the Sunnis and the Shia. Rather, this is unbelief. For faith in Allah and His Messenger are a more important matter than government. This is known by necessity in the religion of Islam.<\/p>\n<p>Source: Minhāj al-Sunnah al-Nabawīyah 1\/75<\/p><\/blockquote>\n<p>Since militant groups, who are terrorizing and killing all who oppose them, have misappropriated the term ‘Sharia’ to refer to their innovated methodology of social reform, and ‘Sharia’ has become a terrifying word in the minds of many non-Muslims, it is incumbent upon Muslims to restore the true meaning of Sharia in the minds of the public, both for the benefit of Muslims and non-Muslims.<\/p>\n<p><em>Fiqh<\/em>, the next type of law in Islam, literally means ‘understanding.’ As a technical term used by Muslims jurists, it refers to the legal rulings derived directly from the Quran and Sunnah (the Sharia) or the consensus of the Prophet’s (ṣ) companions, as well as other rules derived from secondary principles like legal analogy (<em>qiyas<\/em>) or consideration of public welfare (<em>maslahah<\/em>).<\/p>\n<p>According to the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْفِقْهُ حِفْظُ طَائِفَةٍ مِنْ الأحكام الشَّرْعِيَّةِ الْعَمَلِيَّةِ الْوَارِدَةِ فِي الْكِتَابِ أَوِ السُّنَّةِ أَوْ وَقَعَ الإْجْمَاعُ عَلَيْهَا أَوِ اسْتُنْبِطَتْ بِطَرِيقِ الْقِيَاسِ الْمُعْتَبَرِ شَرْعًا أَوْ بِأَيِّ دَلِيلٍ آخَرَ يَرْجِعُ إِلَى هَذِهِ الأدلة<\/p>\n<p>Fiqh is adhering to the collection of legal rulings in regards to conduct as transmitted from the Book, or the Sunnah, or the occurrence of consensus, or derivation by way of legally valid analogy, or by other evidence that refers back to those primary evidences.<\/p>\n<p>Source: al-Mawsū’at al-Fiqhīyah al-Kuwaytīyah 1\/14<\/p><\/blockquote>\n<p>Thus, Fiqh contains the rulings of Sharia – those understood directly from the divinely revealed texts of the Quran and Sunnah without any need for interpretation – as well as human efforts to apply principles of jurisprudence to establish rules when the texts are unclear or could be interpreted in different ways.<\/p>\n<p>For this reason, true Sharia rulings of the religion are absolutely clear to all Muslims. Everyone knows that idolatry, murder, adultery, and theft are unlawful in Islam. But there are also gray areas of law, legal questions that appeared later in Islamic history, for which scholars of Fiqh must apply legal principles to guide the community towards the will of Allah as best as they understand it.<\/p>\n<p>Al-Nu’man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَلَالُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا مُشَبَّهَاتٌ لَا يَعْلَمُهَا كَثِيرٌ مِنْ النَّاسِ<\/p>\n<p><strong>The lawful is clear and the unlawful is clear, and between the two of them are doubtful matters about which many people do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 52, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/02\/14\/halal-haram-clear\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>When confronted by ambiguous legal questions not directly answered by the divine texts, Muslims must ask trustworthy scholars of Fiqh for clarification and guidance. A qualified scholar who issues a legal verdict (<em>fatwa<\/em>) on a specific case is known as a <em>Mufti<\/em>. This plurality of applications is the origin of the different schools of Fiqh (<em>madha’hib<\/em>) in Islam: the Hanafi, Shafi’i, Maliki, and Hanbali doctrines, as well as others that were lost to history. These schools all agree on the fundamental prescriptions of the Sharia, but they disagree on details not clearly answered by divine revelation.<\/p>\n<p>Nevertheless, we consider the four Imams of these schools, Muslim court judges, and all scholars who sincerely strive to properly apply Islamic legal principles to be rewarded by Allah even if they are mistaken. If they are correct in their judgments, they are given a double reward.<\/p>\n<p>Amr ibn al-‘As reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهُ أَجْرٌ<\/p>\n<p><strong>If a judge makes a ruling, striving to apply his reasoning<\/strong> <strong>and he is correct, he will have two rewards. If a judge makes a ruling, striving to apply his reasoning and he is mistaken, he will have one reward<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7352, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/10\/sincere-ijtihad-rewarded\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Such scholars and judges, who must be highly qualified in their respective fields, are rewarded once for their efforts and twice if they happen to be correct. This is a process known as <em>ijtihad<\/em>, which is governed by rigorous scholarly criteria. It is not correct to say that Fiqh is merely a human endeavor and may be disregarded, rather it is an attempt by inheritors of the prophetic duties to expand upon the application of divine principles; their efforts must be respected, even if one disagrees with the conclusion of a particular jurist.<\/p>\n<p><em>Qanun<\/em>, the third type of law, is an Arabic word that appears to have been absorbed from the late Greek word <em>kanṓn<\/em> (“rule”), from which we get the modern English word ‘canon’ as in a set of laws or texts. Sulayman the First, who was the tenth ruler of the Ottoman Caliphate, was known as <em>al-Qanuni<\/em> (“lawgiver”) due to his successful synthesis of the Sharia, as interpreted by the Hanafi school, with Ottoman customary laws. The empire he oversaw governed at least twenty-five million people.<\/p>\n<p>In the principles of Islamic jurisprudence (<em>usul al-fiqh<\/em>), laws based on Qanun could be synonymous with social customs (<em>&#8216;urf<\/em>), which is a recognized source of law when the Sharia texts are silent. The legal principle governing customs, and by extension customary or discretionary laws, is that all customs are permissible unless there is evidence in the Sharia to forbid them.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْعَادَاتُ فَهِيَ مَا اعْتَادَهُ النَّاسُ فِي دُنْيَاهُمْ مِمَّا يَحْتَاجُونَ إلَيْه وَالْأَصْلُ فِيهِ عَدَمُ الْحَظْرِ فَلَا يَحْظُرُ مِنْهُ إلَّا مَا حَظَرَهُ اللَّهُ وَرَسُولُهُ ، وَذَلِكَ لِأَنَّ الْأَمْرَ وَالنَّهْيَ هُما شَرَع اللَّهُ تَعَالَى وَالْعِبَادَةُ لَا بُدَّ أَنْ تَكُونَ مَأْمُورًا بِهَا فَمَا لَمْ يَثْبُتْ أَنَّهُ مَأْمُورٌ كَيْفَ يُحْكَمُ عَلَيْهِ بِأَنَّهُ عِبَادَةٌ وَمَا لَمْ يَثْبُتْ مِنْ الْعَادَاتِ أَنَّهُ مَنْهِيٌّ عَنْهُ كَيْفَ يُحْكَمُ عَلَيْهِ أَنَّهُ مَحْظُورٌ<\/p>\n<p>With regard to customs, they are things that people are used to doing in their worldly affairs. The basic principle concerning them is that they are not forbidden. None of that is forbidden except what Allah and His Messenger have forbidden. That is because commands and prohibitions have to do with the religion of Allah, and acts of worship must necessarily be enjoined. If something is not proven to have been enjoined, then how can it be deemed an act of worship? With regard to customs, if there is no text to prove that a custom is forbidden, how can it be deemed to be forbidden?<\/p>\n<p>Source: Majmu‘ al-Fatawa 29\/16-17<\/p><\/blockquote>\n<p>In other words, all acts of worship are impermissible unless proven by the Sharia to be lawful, and all social customs are permissible unless proven by the Sharia to be unlawful.<\/p>\n<p>A modern example would be laws governing vehicle traffic; nothing explicit is mentioned about them in the Quran and Sunnah, obviously, since such vehicles did not exist at the time. However, the principles of the Sharia, such as the welfare of the public, inspire the institution of such customary laws to make the roads safe for passengers. Even though they are “secular” laws, that is, not explicitly religious in origin, they still have a basis in the objectives of the Sharia and are therefore valid and must be obeyed by Muslim and non-Muslim citizens.<\/p>\n<p>A final point of great importance is to appreciate how the technical terms used by later scholars might differ from the linguistic meaning found in the Quran and Sunnah. Fiqh is such an example of this shift in language. In the time of the Prophet (ṣ), Fiqh and its derivatives simply meant understanding the religion in its complete sense, inwardly and outwardly. Later on, scholars used the term Fiqh to designate the specific branch of knowledge governing the outward rules of the religion.<\/p>\n<p>Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولقد كان اسم الفقه في العصر الأول مطلقاً على علم طريق الآخرة ومعرفة دقائق آفات النفوس ومفسدات الأعمال وقوة الإحاطة بحقارة الدنيا وشدة التطلع إلى نعيم الآخرة واستيلاء الخوف على القلب &#8230; دون تفريعات الطلاق والعتاق واللعان والسلم والإجارة فذلك لا يحصل به إنذار ولا تخويف بل التجرد له على الدوام يقسي القلب وينزع الخشية منه<\/p>\n<p>The term <em>Fiqh<\/em> in the first generation was used for knowledge of the path to the Hereafter, recognizing the subtleties of the souls, deeds that corrupt them, the capacity to comprehend the base nature of the world, strong aspirations for the pleasures of the Hereafter, and fear of Allah overtaking the heart… It did not primarily mean the complex rules of divorce, emancipation of slaves, oaths over accusations of adultery, pre-delivery of merchandise, or rental agreements, for that does not achieve admonition, nor fear of Allah. Rather, incessantly pursuing such rulings hardens the heart and removes the awe of Allah from it.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/32<\/p><\/blockquote>\n<p>As Al-Ghazali notes, overemphasis on the technical field of Fiqh, to the neglect of Islam’s theological and moral teachings, is detrimental to the life of the heart.<\/p>\n<p>An example of possible confusion by this shift in terminology is when the Prophet (ṣ) said Allah grants Fiqh to someone for whom He intends good, by which he means an inclusive understanding of the religion, its rules, its theology, its principles, its morals, and its connection to our ultimate fate in the Hereafter. Fiqh (“understanding the religion”), as used in the Quran and Sunnah, means actualizing the comprehensive Sharia, inwardly and outwardly, as well as its derivative principles.<\/p>\n<p>Mu’awiyah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ<\/p>\n<p><strong>To whomever Allah wills goodness, He grants him understanding <\/strong>(<em>yufaqqihhu<\/em>) <strong>of the religion<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 71, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/08\/20\/if-allah-intends-good-fiqh\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The outward rules contained in technical Fiqh are certainly part of the religion and it is a collective obligation upon Muslims to retain this knowledge. But not recognizing the linguistic shift in the term obscures essential parts of the religion from the public. Some Muslims mistakenly think the religion is almost entirely technical Fiqh, its outward rules, which leads them to neglect Islam’s ethical, spiritual, and psychological insights.<\/p>\n<p>In sum, the three types of law in Islam are Sharia, Fiqh, and Qanun. Sharia is the foundation based upon the decisive inward and outward rules instituted by the Quran and Sunnah covering theology, ethics, and law. Fiqh is the additional human attempt to expand the application of the Sharia to new contexts or questions unanswered by the divine texts. Qanun is customary and discretionary law that is not directly derived from Sharia or Fiqh, but which serves the objectives of the Sharia and contains no elements the Sharia might consider unlawful. Understanding these three types of law and their mutual interaction is critical for Muslims to reassert the relevance of Islamic law in the modern age.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;To whomever Allah wills goodness, He grants him understanding of the religion.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[279],"tags":[468,125,122,420,16,441,165,21,101,24,342,153,38,39,41,43,48,51,100,54,389,103,148,529,296],"class_list":["post-23559","post","type-post","status-publish","format-standard","hentry","category-wisdom-hikmah","tag-analogy-al-qiyas","tag-gabriel-jibreel","tag-angels-malaikah","tag-caliphs-al-khulafa","tag-character-akhlaq","tag-companions-al-sahabah","tag-consensus-al-ijma","tag-creed-aqidah","tag-custom-al-urf","tag-family-ties-sillat-rahim","tag-al-fiqh","tag-al-ijtihad","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-justice-adl","tag-leadership-imamate","tag-manners-al-adab","tag-mercy-al-rahmah","tag-property-al-mal","tag-public-welfare-al-maslaha","tag-reason-al-aql","tag-religion-al-deen","tag-sharia"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-67Z","jetpack-related-posts":[{"id":16284,"url":"https:\/\/www.abuaminaelias.com\/separation-mosque-and-state\/","url_meta":{"origin":23559,"position":0},"title":"Separation of Mosque and State in Islam?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Religious values should have a positive influence on the government,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14876,"url":"https:\/\/www.abuaminaelias.com\/who-implements-hudud-punishments\/","url_meta":{"origin":23559,"position":1},"title":"Who carries out Islamic legal punishments?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"It is forbidden to establish a legal punishment unless...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":23559,"position":2},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17258,"url":"https:\/\/www.abuaminaelias.com\/marital-rape-domestic-violence\/","url_meta":{"origin":23559,"position":3},"title":"Marital rape and domestic violence in Islamic law","author":"Abu Amina Elias","date":"October 29, 2015","format":false,"excerpt":"\"Live with women honorably.\" (4:19)","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14966,"url":"https:\/\/www.abuaminaelias.com\/hijab-niqab-standards\/","url_meta":{"origin":23559,"position":4},"title":"Must a Muslim woman cover her face?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Tell the believing women to lower their gaze...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":23559,"position":5},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23559","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23559"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23559\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23559"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23559"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23559"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}