{"id":23619,"date":"2021-10-19T17:45:39","date_gmt":"2021-10-19T13:45:39","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23619"},"modified":"2021-10-24T12:11:01","modified_gmt":"2021-10-24T08:11:01","slug":"grave-worship-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/grave-worship-in-islam\/","title":{"rendered":"Prohibition of grave worship in Islam"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Islam prohibits grave worship in the strongest of terms. The term ‘grave worship’ means performing ritual acts of worship by the graves and not worshipping the graves themselves. The reason for this severe prohibition is because worship at graves is the precursor of idolatry. It is supplemented by prohibitions of plastering over graves, decorating them, or otherwise giving them undue reverence. Rather, Muslims must understand the purpose of visiting graves and adhere to Islamic etiquette when they do so.<\/p>\n<p>Building places of prayer and worship (<em>masajid<\/em>) over graves is one of the principal means by which idolatry was introduced to humankind. Such idolatry infiltrated some of the people of the Book, Jews and Christians, despite their primary commandment in the Torah to worship Allah alone and not to make graven images of anything (Exodus 20:3-4).<\/p>\n<p>Aisha reported: Umm Habibah and Umm Salamah mentioned a church they saw in Abyssinia that had graven images in it. They mentioned it to the Prophet, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أُولَئِكَ إِذَا كَانَ فِيهِمُ الرَّجُلُ الصَّالِحُ فَمَاتَ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا وَصَوَّرُوا فِيهِ تِلْكَ الصُّوَرَ فَأُولَئِكَ شِرَارُ الخَلْقِ عِنْدَ اللَّهِ يَوْمَ القِيَامَةِ<\/p>\n<p><strong>Verily, when a righteous man among them would die, they would build a place of worship over his grave and carve these images within it. They will be the worst to Allah on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 427, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/09\/08\/shirk-grave-worship\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Abdul Barr explained the reasoning for this prohibition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَذِّرُ أَصْحَابَهُ وَسَائِرَ أُمَّتِهِ مِنْ سُوءِ صَنِيعِ الْأُمَمِ قَبْلَهُ الَّذِينَ صَلَّوْا إِلَى قُبُورِ أَنْبِيَائِهِمْ وَاتَّخَذُوهَا قِبْلَةً وَمَسْجِدًا كَمَا صَنَعَتِ الْوَثَنِيَّةُ بِالْأَوْثَانِ الَّتِي كَانُوا يَسْجُدُونَ إِلَيْهَا وَيُعَظِّمُونَهَا وَذَلِكَ الشِّرْكُ الْأَكْبَرُ فَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخْبِرُهُمْ بِمَا فِي ذَلِكَ مِنْ سُخْطِ اللَّهِ وَغَضَبِهِ وَأَنَّهُ مِمَّا لَا يَرْضَاهُ خَشْيَةً عَلَيْهِمُ امْتِثَالَ طُرُقِهِمْ<\/p>\n<p>The Messenger of Allah (ṣ) warned his companions and the rest of his nation from the evil deeds of nations who prayed over the graves of their prophets and took them as directions and places of prayer, just as the idolaters used to prostrate to them and revere them. That is the greater idolatry (<em>al-shirk al-akbar<\/em>). The Prophet (ṣ) told them that it displeases Allah, angers Him, and He is not pleased with it, fearing that they would mimic their ways.<\/p>\n<p>Source: al-Tamhīd 5\/45<\/p><\/blockquote>\n<p>Several authentic reports from the Prophet (ṣ) and his companions stress the importance of prohibiting places of worship in or around graves.<\/p>\n<p>Jundub reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّ مَنْ كَانَ قَبْلَكُمْ كَانُوا يَتَّخِذُونَ قُبُورَ أَنْبِيَائِهِمْ وَصَالِحِيهِمْ مَسَاجِدَ أَلاَ فَلاَ تَتَّخِذُوا الْقُبُورَ مَسَاجِدَ إِنِّي أَنْهَاكُمْ عَنْ ذَلِكَ<\/p>\n<p><strong>Verily, those before you would take the graves of their prophets and righteous as places of prayer. Do not take graves as places of prayer. I forbid you from doing so.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 532, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/21\/allah-is-khalil-prophet\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Umar reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اجْعَلُوا فِي بُيُوتِكُمْ مِنْ صَلاَتِكُمْ وَلاَ تَتَّخِذُوهَا قُبُورًا<\/p>\n<p><strong>Perform your voluntary prayers in your houses, and do not take your houses as graves.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 432, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/13\/nafl-salat-at-home\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>To take “your houses as graves” means to not perform any prayers in your home, since prayer at graves is prohibited and a house without prayer is like a graveyard. It is recommended to perform regular voluntary prayers at home, especially the Sunan prayers.<\/p>\n<p>Abu Sa’id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْأَرْضُ كُلُّهَا مَسْجِدٌ إِلَّا الْمَقْبَرَةَ وَالْحَمَّامَ<\/p>\n<p><strong>The entire earth has been made a place of prayer,<\/strong> <strong>except for graveyards and washrooms<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 317, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/03\/23\/whole-earth-is-a-masjid-mosque\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this tradition, prayer at graves has been associated with prayer in filthy places like toilets and bathrooms. Furthermore, the people who pray in or around graves have been described as the worst of humankind.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ شِرَارِ النَّاسِ مَنْ تُدْرِكُهُ السَّاعَةُ وَهُمْ أَحْيَاءٌ وَمَنْ يَتَّخِذُ الْقُبُورَ مَسَاجِدَ<\/p>\n<p><strong>Verily, the worst of people are those upon whom the Hour is established while they are alive, and those who take graves as places of worship<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 4132, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/28\/worst-people-graves-masajid\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The companions of the Prophet (ṣ) were keen to uphold this prohibition, as they knew it was essential to implement the established Islamic legal principle of blocking all means (<em>sadd al-dhara’i’<\/em>) that could lead to idolatry, unbelief, or sinful acts.<\/p>\n<p>Anas ibn Malik reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُصَلَّى بَيْنَ الْقُبُورِ<\/p>\n<p>The Prophet, peace and blessings be upon him, prohibited praying amongst the graves.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 1698, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/14\/salat-qabr-qubur-haram\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: Umar ibn al-Khattab, may Allah be pleased with him, saw me while I was praying near a grave and he raised his voice, saying, “The grave!” I thought he said something else, so I looked toward the sky. Umar came and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا أَقُولُ الْقَبْرُ لا تُصَلِّ إِلَيْهِ<\/p>\n<p>Indeed, I said the grave! Do not pray towards it.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 1524, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/10\/02\/anas-do-not-pray-to-graves\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Qatadah reported: Anas ibn Malik, may Allah be pleased with him, passed by a graveyard of Ramad while they were building a mosque over it. Anas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ يُكْرَهُ أَنْ يُبْنَى مَسْجِدٌ فِي وَسَطِ الْقُبُورِ<\/p>\n<p>It is hated to build a mosque in the midst of graves.<\/p>\n<p>Source: Shu’ab al-Imān 2679, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/15\/haram-masjid-qubur\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Jurayj reported: I said to ‘Ata’, may Allah have mercy on him, “Do you disapprove of us praying in the midst of graves or in a mosque pointing towards a grave?” ‘Ata’ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ كَانَ يُنْهَى عَنْ ذَلِكَ<\/p>\n<p>Yes, that has been prohibited.<\/p><\/blockquote>\n<p>I said, “What do you think if there is a small space between me and it, or in a mosque elevated by a cubit?” ‘Ata’ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُكْرَهُ أَنْ يُصَلَّى وَسَطَ الْقُبُورِ<\/p>\n<p>It is hateful to pray in the midst of graves.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/15\/ata-tawus-masajid-qubur\/\">Muṣannaf ‘Abd al-Razzāq 1579<\/a><\/p><\/blockquote>\n<p>Tawus, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَعْلَمُهُ إِلَّا كَانَ يَكْرَهُ الصَّلَاةَ وَسَطَ الْقُبُورِ كَرَاهَةً شَدِيدَةً<\/p>\n<p>I do not know anything about it except that prayer in the midst of graves is severely disapproved.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 1592<\/p><\/blockquote>\n<p>Abu Marthad reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَجْلِسُوا عَلَى الْقُبُورِ وَلَا تُصَلُّوا إِلَيْهَا<\/p>\n<p><strong>Do not sit upon the graves and do not pray towards them<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 972, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/02\/18\/graves-not-sit-pray\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Qurtubi comments on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أي لا تتخذوها قبلة فتصلّوا عليها أو إليها كما فعل اليهود والنصارى فيؤدي إلى عبادة من فيها كما كان السبب في عبادة الأصنام فحذّر النبيّ صلى الله عليه وسلم عن مثل ذلك، وسَدَّ الذرائع المؤدّية إلى ذلك<\/p>\n<p>Meaning, do not take them as a direction of prayer such that you pray over or towards them, as is done by the Jews and Christians, for this leads to the worship of those in them and is a cause for the worship of idols. The Prophet (ṣ) warned against the likes of these and blocked the means leading to it.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 10\/380<\/p><\/blockquote>\n<p>And Ibn Qudamah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِأَنَّ تَخْصِيصَ الْقُبُورِ بِالصَّلَاةِ عِنْدَهَا يُشْبِهُ تَعْظِيمَ الْأَصْنَامِ بِالسُّجُودِ لَهَا وَالتَّقَرُّبِ إلَيْهَا وَقَدْ رَوَيْنَا أَنَّ ابْتِدَاءَ عِبَادَةِ الْأَصْنَامِ تَعْظِيمُ الْأَمْوَاتِ بِاتِّخَاذِ صُوَرِهِمْ وَمَسْحِهَا وَالصَّلَاةِ عِنْدَهَا<\/p>\n<p>Taking graves as a special place for prayer resembles the veneration of idols by prostrating to them and coming near to them. We have reported that the worship of idols began by venerating the dead, making graven images of them, wiping over them, and praying beside them.<\/p>\n<p>Source: al-Mughnī 2\/379<\/p><\/blockquote>\n<p>Among the rulings intended to block grave worship is the prohibition of plastering, decorating, or building structures over graves, as these lead to undue veneration of them.<\/p>\n<p>Abu Sai’d al-Khudri reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَهَى نَبِيُّ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ يُبْنَى عَلَى الْقُبُورِ أَوْ يُقْعَدَ عَلَيْهَا أَوْ يُصَلَّى عَلَيْهَا<\/p>\n<p>The Prophet of Allah, peace and blessings be upon him, prohibited building over graves, sitting upon them, or praying over them.<\/p>\n<p>Source: Musnad Abī Ya’lá 1020, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/14\/haram-build-sit-salat-graves\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُجَصَّصَ الْقُبُورُ وَأَنْ يُكْتَبَ عَلَيْهَا وَأَنْ يُبْنَى عَلَيْهَا وَأَنْ تُوطَأَ<\/p>\n<p>The Prophet, peace and blessings be upon him, prohibited plastering over graves, writing upon them, building over them, and treading upon them.<\/p>\n<p>Source: Sunan al-Tirmidhī 1052, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/11\/11\/plastering-writing-qabr-qubur\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The leading jurists allowed small concessions to put clay over graves or to mark them without falling into extravagance and ostentation.<\/p>\n<p>Al-Tirmidhi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ رَخَّصَ بَعْضُ أَهْلِ العِلْمِ مِنْهُمْ الحَسَنُ البَصْرِيُّ فِي تَطْيِينِ القُبُورِ وقَالَ الشَّافِعِيُّ لاَ بَأْسَ أَنْ يُطَيَّنَ القَبْرُ<\/p>\n<p>Some of the scholars granted a concession, among them Al-Hasan al-Basri, to put clay over the graves. Al-Shafi’i said: There is nothing wrong with putting clay over a grave.<\/p>\n<p>Source: Sunan al-Tirmidhī 2\/360<\/p><\/blockquote>\n<p>Again, these small concessions cannot be expanded into absolute permission to build ornate structures over graves. The companions were concerned about their own graves being turned into places of worship, such that they ordered their students to conduct a humble funeral and make a simple grave for them.<\/p>\n<p>Thamamah ibn Shufayy reported: We were with Fadalah ibn ‘Ubayd in the land of the Romans by a place known as Rudis. One of our companions passed away, so Fadalah ordered his grave to be levelled flat. Then, Fadalah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِتَسْوِيَتِهَا<\/p>\n<p>I heard the Messenger of Allah, peace and blessings be upon him, ordering them to be leveled.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 968, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/24\/flat-level-earth\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Burdah reported: Abu Musa al-Ashari, may Allah be pleased with him, instructed us at the time of his death, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا انْطَلَقْتُمْ بِجِنَازَتِي فَأَسْرِعُوا الْمَشْيَ وَلَا تُتْبِعُونِي بِجَمْرٍ وَلَا تَجْعَلُوا عَلَى لَحْدِي شَيْئًا يَحُولُ بَيْنِي وَبَيْنَ التُّرَابِ وَلَا تَجْعَلُوا عَلَى قَبْرِي بِنَاءً وَأُشْهِدُكُمْ أَنِّي بَرِيءٌ مِنْ كُلِّ حَالِقَةٍ أَوْ سَالِقَةٍ أَوْ خَارِقَةٍ<\/p>\n<p>You should hasten with my funeral procession. Do not follow me in suspense, do not put anything in my grave that will come between me and the dust, and do not build anything over my grave. Bear witness that I am free of those women who shave their heads, tear their clothes, and strike their faces.<\/p><\/blockquote>\n<p>They said, “Have you heard something about this?” Abu Musa said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>Yes, from the Messenger of Allah, peace and blessings be upon him.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 3150, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/06\/03\/abu-musa-humble-janazah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>If one cannot perform the funeral prayer in the mosque, then it can be offered by the gravesite if necessary. This is an exception to the general rule for special situations, such as when the deceased are buried before the prayer over them can be performed in the mosque.<\/p>\n<p>Abu Huraira reported: A black woman used to maintain the mosque and one day the Messenger of Allah, peace and blessings be upon him, missed her and asked about her. They said, “She has died.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفَلَا كُنْتُمْ آذَنْتُمُونِي<\/p>\n<p><strong>You would not announce it to me? <\/strong><\/p><\/blockquote>\n<p>It was as if they considered her insignificant. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دُلُّونِي عَلَى قَبْرِهَا<\/p>\n<p><strong>Show me to her grave. <\/strong><\/p><\/blockquote>\n<p>They led him to it and he prayed over her, then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذِهِ الْقُبُورَ مَمْلُوءَةٌ ظُلْمَةً عَلَى أَهْلِهَا وَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُنَوِّرُهَا لَهُمْ بِصَلَاتِي عَلَيْهِمْ<\/p>\n<p><strong>Verily, these graves are filled with darkness over their inhabitants. Allah Almighty illuminates them by my prayers over them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 956, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/03\/prophet-prays-servant\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Nafi’ reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ صَلَّيْنَا عَلَى عَائِشَةَ وَأُمِّ سَلَمَةَ وَسَطَ الْبَقِيعِ قَالَ وَالْإِمَامُ يَوَمَ صَلَّيْنَا عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَبُو هُرَيْرَةَ وَحَضَرَ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ<\/p>\n<p>We performed the funeral prayer over Aisha and Umm Salamah in the midst of Al-Baqi’ cemetery. The Imam on that day who prayed over Aisha, may Allah be pleased with her, was Abu Huraira, and Abdullah ibn Umar was present for it.<\/p>\n<p>Source: Muṣannaf ‘Abd al-Razzāq 1593<\/p><\/blockquote>\n<p>These instances were not regular occurrences among the Prophet (ṣ) and his companions, as the Prophet (ṣ) only did so because the woman had been buried before her prayer could be performed over her properly. Rather, these were concessions for a situation in which it was not possible to perform the funeral prayer in the mosque or for some other valid reason. It is not permissible to take a concession and expand it into absolute permission or recommendation.<\/p>\n<p>It is allowed for Muslims to visit graves if they adhere to proper Islamic etiquette. The purpose of visiting the grave of friends, family members, or righteous people is not to acquire ‘blessings’ (<em>barakah<\/em>) from them. Rather, the purpose is to remember death and the Hereafter, which softens the heart and is an important component of purification of the soul, and to benefit them with our supplications.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُ الْمَوْتَ<\/p>\n<p><strong>Visit the graveyards. Verily, it is a reminder of death<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 976, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/11\/visit-graves-reminder\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) had originally prohibited his companions from visiting graves at the beginning of Islam when they were still learning the fundamentals of monotheism (<em>tawhid<\/em>) and faith. Once he was satisfied that they had enough knowledge, he allowed them to visit graves for these beneficial purposes.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا فَإِنَّهَا تُزَهِّدُ فِي الدُّنْيَا وَتُذَكِّرُ الْآخِرَةَ<\/p>\n<p><strong>I had prohibited you from visiting graves, but you may visit them now. Verily, they will weaken your attachment to the world and remind you of the Hereafter<\/strong>.<\/p>\n<p>Source: Sunan Ibn Mājah 1571, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/06\/08\/visit-graves-remember-akhirah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ ثُمَّ بَدَا لِي فَزُورُوهَا فَإِنَّهَا تُرِقُّ الْقَلْبَ وَتُدْمِعُ الْعَيْنَ وَتُذَكِّرُ الْآخِرَةَ فَزُورُوا وَلَا تَقُولُوا هُجْرًا<\/p>\n<p><strong>I had prohibited you from visiting the graves, but it occurred to me that now that you may visit them. Verily, they soften the heart, shed tears in the eyes, and remind of the Hereafter. Thus, visit them and do not say anything obscene.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 7198, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/19\/visiting-graves-softens-heart\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>It is not permissible to recite the Quran over the graveyards since this resembles prayer within them. This prohibition is due to concern for strictly adhering to the authenticate Sunnah and not introducing any unconfirmed acts of worship. All of the reports which mention this are too weak to be used as evidence for a prescribed act of worship, even though several scholars have allowed it.<\/p>\n<p>Shaykh Bin Baz writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تشرع قراءة سورة يس ولا غيرها من القرآن على القبر بعد الدفن ولا عند الدفن ولا تشرع القراءة في القبور لأن النبي صلى الله عليه وسلم لم يفعل ذلك ولا خلفاؤه الراشدون كما لا يشرع الأذان ولا الإقامة في القبر بل كل ذلك بدعة &#8230; وهكذا لا يشرع غرس الشجر على القبور لا الصبار ولا غيره ولا زرعها بشعير أو حنطة أو غير ذلك لأن الرسول صلى الله عليه وسلم لم يفعل ذلك في القبور ولا خلفاؤه الراشدون رضي الله عنهم<\/p>\n<p>It is not legislated to recite Surat Ya Sin or anything else from the Quran over a grave after burial, nor at the time of burial. It is not legislated to recite the Quran in graveyards as the Prophet (ṣ) did not do so, nor did the rightly-guided Caliphs, just as it is not legislated to perform the call to prayer or commence it by a grave. Rather, all of that is an innovation… Likewise, it is not legislated to plant trees over graves, nor cactus, nor anything else, nor to sow them with wheat or barely, as the Messenger of Allah (ṣ) did not do that at the graves, nor did the rightly-guided Caliphs, may Allah be pleased with them.<\/p>\n<p>Source: Majmūʻ Fatāwá al-Shaykh ibn Bāz 13\/203<\/p><\/blockquote>\n<p>The greatest enormity committed at the graves is when Muslims mistakenly supplicate <em>to<\/em> the inhabitants of the grave under the false belief that these saints or righteous people have supernatural powers to benefit them. The truth is that the dead do not have any power to benefit or harm anyone as they have passed on to the other side, nor can any living person claim powers that belong only to Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ تَدْعُونَ مِن دُونِهِ مَا يَمْلِكُونَ مِن قِطْمِيرٍ إِن تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ ۖ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ<\/p>\n<p><strong>Those you call upon besides Him do not own even the skin of a date-stone. If you call upon them, they do not hear you, and if they did hear you, they could not answer you. On the Day of Resurrection, they will deny your idolatry.<\/strong><\/p>\n<p>Surat al-Fatir 35:14<\/p><\/blockquote>\n<p>It is an act of extreme selfishness and foolishness to visit graves with the intention of acquiring some blessings from their inhabitants by directly supplicating to them. Not only can these inhabitants not bring them any benefit, they will disown them and their supplications on the Day of Judgment. Detailed information about using the dead as a means (<em>tawassul<\/em>) can be found in the article <em><a href=\"https:\/\/www.abuaminaelias.com\/tawassul-prophets-saints-graves\/\">Tawassul: Seeking help from prophets and saints?<\/a><\/em>.<\/p>\n<p>In contrast, the Sunnah of visiting graves to is supplicate to Allah <em>for<\/em> the inhabitants to be benefited and forgiven.<\/p>\n<p>Buraydah reported: The Messenger of Allah, peace and blessings be upon him, used to teach them as they went to visit the graves, saying to their inhabitants:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللهُ لَلَاحِقُونَ أَسْأَلُ اللهَ لَنَا وَلَكُمُ الْعَافِيَةَ<\/p>\n<p><strong>Peace be upon you, O people of this abode, from the believers and the Muslims. We will soon, if Allah wills, be joining you. I ask Allah to grant well-being to us and to you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 975, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/09\/01\/dua-visiting-graves\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Uthman ibn Affan reported: The Prophet, peace and blessings be upon him, when he finished burying the deceased, he would stand over them and say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَغْفِرُوا لِأَخِيكُمْ وَسَلُوا لَهُ بِالتَّثْبِيتِ فَإِنَّهُ الْآنَ يُسْأَلُ<\/p>\n<p><strong>Seek forgiveness for your brothers and ask Allah to keep them firm, for they are being questioned now.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3321, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/08\/06\/dua-qabr-janazah\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>How angry will the inhabitants of the grave be on the Day of Judgment with those who supplicated to them directly? Those who supplicated to them committed a grave sin in their name and they did not even ask Allah to benefit or forgive the grave’s inhabitants, rather they only wanted to get something for themselves!<\/p>\n<p>In response to these decisive texts and rulings, some Muslims will argue that the condition of the grave of the Prophet (ṣ) itself proves that mosques can be built over anyone’s grave. This is an invalid argument if one understands the Prophet’s (ṣ) own supplication and instructions in regards to his grave, as well as the history of how the mosque expanded around it to include it.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ لَا تَجْعَلْ قَبْرِي وَثَنًا لَعَنَ اللَّهُ قَوْمًا اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ<\/p>\n<p><strong>O Allah, do not turn my grave into an idol that is worshiped. Allah has cursed people who take the graves of their prophets as places of worship.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7352, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/09\/20\/do-not-make-my-grave-idol\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ تَجْعَلُوا بُيُوتَكُمْ قُبُورًا وَلاَ تَجْعَلُوا قَبْرِي عِيدًا<\/p>\n<p><strong>Do not turn your houses into graves, and do not turn my grave into a place of festivity.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2044, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/16\/la-qabr-eid\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In the Prophet’s (ṣ) final days on earth, he warned us that Allah had cursed the nations before us because they built places of worship over their prophets and righteous people. Because of this, the grave of the Prophet (ṣ) at first was kept simple and separate from his mosque.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said during his illness from which he did not recover:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ<\/p>\n<p><strong>Allah has cursed the Jews and Christians, who have taken the graves of their prophets as places of worship<\/strong>.<\/p><\/blockquote>\n<p>Aisha, may Allah be pleased with her, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَوْلَا ذَاكَ أُبْرِزَ قَبْرُهُ غَيْرَ أَنَّهُ خُشِيَ أَنْ يُتَّخَذَ مَسْجِدًا<\/p>\n<p>Were it not for that, his grave would have been in a prominent place, but it was feared that it would be taken as a place of worship.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1390, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/22\/allah-cursed-graves-masajid\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The leading scholars of the righteous predecessors were very concerned that ignorant Muslims would eventually take his grave as a place of worship and commit all kinds of forbidden acts around it. If this was their attitude towards the grave of the Prophet (ṣ) himself, it also applies to any other prophet or righteous person.<\/p>\n<p>Imam al-Shafi’i was quoted in this regard:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأكره ان يعظم مخلوق حتي يجعل قبره مسجدا مخافة الفتنة عليه وعلي من بعده من الناس<\/p>\n<p>I hate to venerate created beings such that one makes his grave into a place of prayer, fearing a trial for them, as well as any person after him.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 5\/314<\/p><\/blockquote>\n<p>The reason that the grave of the Prophet (ṣ) now exists within his mosque is not because it was done so by his companions or the leading scholars among the righteous predecessors. Rather, as the Muslim Ummah grew in size, the mosque needed to be expanded to accommodate more people for prayers.<\/p>\n<p>In response to this need, the Caliph Al-Waleed ibn Abdul Malik ordered the demolition of the original mosque and its expansion to include the apartment of Aisha in which the Prophet (ṣ) was buried. Al-Waleed was mistaken in his judgment, even though he thought it was good at the time, and his decision was disapproved by the leading scholars of Medina.<\/p>\n<p>Ibn Jarir reported: In the month of Rabia&#8217; al-Awwal, the Caliph al-Waleed wrote to Umar ibn Abdul Aziz ordering him to dismantle the mosque of the Prophet and add the apartments of the wives of the Prophet (ṣ) to it in order to make space in the surrounding vicinity. Umar gathered the leading jurists and the people of Medina and he read the letter of the commander of the faithful Al-Waleed. They were very distressed by that and they said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذِهِ حُجَرٌ قَصِيرَةُ السُّقُوفِ وَسُقُوفُهَا مِنْ جَرِيدِ النَّخْلِ وَحِيطَانُهَا مِنَ اللَّبِنِ وَعَلَى أَبْوَابِهَا الْمُسُوحُ وَتَرْكُهَا عَلَى حَالِهَا أَوْلَى لِيَنْظُرَ إِلَيْهَا الْحُجَّاجُ وَالزُّوَّارُ وَالْمُسَافِرُونَ وَإِلَى بُيُوتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَنْتَفِعُوا بِذَلِكَ وَيَعْتَبِرُوا بِهِ وَيَكُونَ ذَلِكَ أَدْعَى لَهُمْ إِلَى الزُّهْدِ فِي الدُّنْيَا<\/p>\n<p>These apartments have small roofs made of palm leaves, its walls are mud, and its doors are sackcloth. It is better to leave them as they are for pilgrims, visitors, and travelers to look at the houses of the Prophet, peace and blessings be upon him, to benefit by that and take lessons, by which they are called to renounce the worldly life.<\/p><\/blockquote>\n<p>Umar wrote to Al-Waleed with what the jurists mentioned and Al-Waleed wrote back ordering him to demolish and rebuild the mosque as he mentioned:<\/p>\n<p>Thus, Umar had no choice but to dismantle it and incorporate the apartments of the Prophet, the apartment of Aisha, and include the grave within the mosque.<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَمْ يَجِدْ عُمَرُ بُدًّا مِنْ هَدْمِهَا فَأَدْخَلَ فِيهِ الْحُجْرَةَ النَّبَوِيَّةَ حُجْرَةَ عَائِشَةَ فَدَخَلَ الْقَبْرُ فِي الْمَسْجِدِ<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 9\/74<\/p><\/blockquote>\n<p>And Ibn Kathir reports:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُحْكَى أَنَّ سَعِيدَ بْنَ الْمُسَيِّبِ أَنْكَرَ إِدْخَالَ حُجْرَةِ عَائِشَةَ فِي الْمَسْجِدِ كَأَنَّهُ خَشِيَ أَنْ يُتَّخَذَ الْقَبْرُ مَسْجِدًا<\/p>\n<p>It is narrated from Sa’id ibn al-Musayyib that he denounced the incorporation of the apartment of Aisha within the mosque, as he feared the grave would be taken as a place of prayer.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 9\/75<\/p><\/blockquote>\n<p>As can be seen, the incorporation of the Prophet’s (ṣ) grave within his mosque was not approved by his companions or many leading scholars of the righteous predecessors. Therefore, the state of the mosque as it exists today or in the past is not a valid proof that mosques can be built over graves.<\/p>\n<p>Shaykh Bin Baz writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هنا شبهة يشبه بها عباد القبور وهي وجود قبر النبي صلى الله عليه وسلم في مسجده والجواب عن ذلك أن الصحابة رضي الله عنهم لم يدفنوه في مسجده وإنما دفنوه في بيت عائشة رضي الله عنها فلما وسع الوليد بن عبد الملك مسجد النبي صلى الله عليه وسلم في آخر القرن الأول أدخل الحجرة في المسجد وقد أساء في ذلك وأنكر عليه بعض أهل العلم ولكنه اعتقد أن ذلك لا بأس به من أجل التوسعة فلا يجوز لمسلم أن يحتج بذلك على بناء المساجد على القبور أو الدفن في المساجد لأن ذلك مخالف للأحاديث الصحيحة ولأن ذلك أيضا من وسائل الشرك بأصحاب القبور<\/p>\n<p>There is a specious argument of those who worship at graves. It is the presence of the grave of the Prophet (ṣ) in his mosque. The answer to this is that the companions, may Allah be pleased with them, did not bury him in the mosque. They only buried him in the house of Aisha. When Al-Waleed ibn Abdul Malik expanded the mosque of the Prophet after the first generation, the apartments were incorporated into the mosque. He was wrong in that and it was condemned by some of the scholars, but he believed that there was nothing wrong with it due to the need for expansion. It is not permissible for a Muslim to cite this as proof for building mosques over graves or burying people in mosques, as that contradicts the authentic prophetic traditions and that it is a means leading to idolatry with the inhabitants of the graves.<\/p>\n<p>Source: Majmūʻ Fatāwá al-Shaykh ibn Bāz 13\/235<\/p><\/blockquote>\n<p>In fact, the companions and the righteous predecessors took steps to separate the Prophet’s (ṣ) grave from his mosque as much as possible, by building walls all around it so that people behind his grave would be praying towards these walls and not in front of his grave.<\/p>\n<p>Al-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولما احتاجت الصَّحَابَةُ رِضْوانُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ وَالتَّابِعُونَ إِلَى الزِّيَادَةِ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ كَثُرَ الْمُسْلِمُونَ وَامْتَدَّتِ الزِّيَادَةُ إِلَى أَنْ دَخَلَتْ بُيُوتُ أُمَّهَاتِ الْمُؤْمِنِينَ فِيهِ وَمِنْهَا حُجْرَةُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا مَدْفِنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَاحِبَيْهِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا بَنَوْا عَلَى الْقَبْرِ حِيطَانًا مُرْتَفِعَةً مُسْتَدِيرَةً حَوْلَهُ لِئَلَّا يَظْهَرَ فِي الْمَسْجِدِ فَيُصَلِّيَ إِلَيْهِ الْعَوَامُّ وَيُؤَدِّي الْمَحْذُورَ<\/p>\n<p>When the companions, may Allah be pleased with them all, and the successors needed to add to the mosque of the Prophet (ṣ), as the number of Muslims increased, the addition was spread out to include the houses of the mothers of the believers within it, among which is the apartment of Aisha in which the Prophet (ṣ) is buried, along with his two companions Abu Bakr and Umar. They built high, round walls around it so that it could not be seen in the mosque such that common people would pray towards it and thus commit forbidden acts.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 5\/14<\/p><\/blockquote>\n<p>Today, many ornate graves and shrines dedicated to various prophets, saints, and righteous people exist all over the Muslim world under the banner of Sufism, although the earliest Sufis did not do these things. These structures were built in disobedience to Allah and His Messenger (ṣ), but the question remains: What is the legal process for these graves to be changed or modified to conform to the Sunnah?<\/p>\n<p>The most important point of note is that changing or modifying existing structures over graves can only be carried out by legitimate Muslim government authorities. No individual or sectarian group has the right to vandalize or damage these structures.<\/p>\n<p>Ali ibn Abi Talib said to one of his companions:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا تَدَعَ تِمْثَالًا إِلَّا طَمَسْتَهُ وَلَا قَبْرًا مُشْرِفًا إِلَّا سَوَّيْتَهُ<\/p>\n<p>Shall I not send you upon the mission with which the Messenger of Allah, peace and blessings be upon him, sent me? Do not leave a graven image but that you efface it, and do not leave a built over grave but that you level it.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 969, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/14\/graven-images-high-graves\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ali, may Allah be pleased with him, was given authority to carry out this mission. He did not do so of his own accord.<\/p>\n<p>Ibn ‘Allan commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إلا سويته أي بالأرض ففيه أن التصوير للصورة المحرمة من المنكرات الذي على ولاة الأمور إزالتها والله أعلم<\/p>\n<p>‘But that you level it,’ meaning with the earth. In this regard, crafting graven images is forbidden amongst the evil deeds that those in authority have a duty to remove. Allah knows best.<\/p>\n<p>Source: Dalīl al-Fāliḥīn 8\/513<\/p><\/blockquote>\n<p>And Shaykh Ibn ‘Uthaymeen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أن يكون القبر سابقاً على المسجد بحيث يبنى المسجد على القبر فالواجب هجر هذا المسجد وعدم الصلاة وعلى من بناه أن يهدمه فإن لم يفعل وجب على ولي أمر المسلمين أن يهدمه<\/p>\n<p>If the grave had been there before the mosque, such that the mosque was built over the grave, then it is an obligation to abandon this mosque and not pray in it. Whoever built it must dismantle it. If he does not do so, then it is an obligation upon Muslim authorities to dismantle it.<\/p>\n<p>Source: Majmū’ Fatāwá wa Rasā’il 12\/373<\/p><\/blockquote>\n<p>The only people who are allowed to change or modify existing structures over graves are the owners themselves or proper Muslim authorities. Anyone else may only preach the Sunnah to these people in hopes that their hearts and minds will be guided.<\/p>\n<p>The campaign of bombings against mosques within which are graves is a truly disgusting evil and a betrayal of Allah and His Messenger (ṣ). These criminal acts against innocent people are carried out by sectarian groups with no authority whatsoever. They must be harshly condemned by every Muslim, indeed by every human being, no matter the alleged ‘good intentions’ that these wicked lawbreakers claim for themselves.<\/p>\n<p>What is more, these bombings are vile transgressions against the dead just as they are against the living. The inhabitants of the grave are desecrated in a horrendous manner, by fire and explosives, which is just as evil to do to them as if they were alive.<\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا<\/p>\n<p><strong>Breaking the bones of a dead person is like breaking them when he is alive.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3207, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/11\/11\/graves-desecrating-dead\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The proper procedure for changing or modifying structures over graves was carried about by Umar in the time of his Caliphate. The companions came across the body of the Prophet Daniel (ṣ), which people were wrongly using as a means to seek blessings. Umar ordered them to remove the body and rebury it in respect to the deceased, while keeping the location unknown so that it would never again become a place of worship.<\/p>\n<p>Anas reported: When they liberated Tustar, they found a man with a long nose in a coffin. The people were seeking victory and seeking rain through him. Abu Musa wrote to Umar ibn al-Khattab, may Allah be pleased with him, about that. Umar wrote back, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذَا نَبِيٌّ مِنَ الْأَنْبِيَاءِ وَالنَّارُ لَا تَأْكُلُ الْأَنْبِيَاءَ وَالْأَرْضُ لَا تَأْكُلُ الْأَنْبِيَاءَ<\/p>\n<p>Indeed, this man is one of the prophets. Fire and earth do not consume the bodies of the prophets.<\/p><\/blockquote>\n<p>Umar wrote further:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْظُرْ أَنْتَ وَأَصْحَابُكَ فَادْفِنُوهُ فِي مَكَانٍ لَا يَعْلَمُهُ أَحَدٌ غَيْرُكُمَا<\/p>\n<p>Look for him, you and your companions, and bury him in a place no one knows but the two of you.<\/p><\/blockquote>\n<p>Anas said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَذَهَبْتُ أَنَا وَأَبُو مُوسَى فَدَفَنَّاهُ<\/p>\n<p>Then I went with Abu Musa and we reburied him.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/14\/umar-grave-daniel\/\">Muṣannaf Ibn Abī Shaybah 33819<\/a><\/p><\/blockquote>\n<p>The companions asked for instructions from the commander of the faithful, Umar, before taking any action. As such, individual Muslims have no authority to change or modify structures built over graves. They may only preach the Sunnah to these wayward Muslims in hopes of guiding them to the right path, or to petition the government to take lawful action whilst respecting the bodies of the deceased.<\/p>\n<p>Lastly, some Muslims wrongly use the story of the people of the cave in the Quran to justify building mosques over graves.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الَّذِينَ غَلَبُوا عَلَىٰ أَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِم مَّسْجِدًا<\/p>\n<p><strong>Those who prevailed in the matter said: We will take a place of worship over them.<\/strong><\/p>\n<p>Surat al-Kahf 18:21<\/p><\/blockquote>\n<p>It is not the purpose of this verse to deliver a legal ruling on the status of building mosques over graves. This is why the verse was not mentioned at all in Abu Bakr ibn ‘Arabi’s <em>Ahkam al-Quran<\/em>, his famous extraction of the legal rulings of the Quran. In the flow of the story, it is evident that the notoriety of the people of the cave reached such a degree that their graves were wrongly taken as a place of worship.<\/p>\n<p>Shaykh al-Sa’id commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهذه الحالة محظورة نهى عنها النبي صلى الله عليه وسلم وذم فاعليها ولا يدل ذكرها هنا على عدم ذمها فإن السياق في شأن تعظيم أهل الكهف والثناء عليهم وأن هؤلاء وصلت بهم الحال إلى أن قالوا ابنوا عليهم مسجداً<\/p>\n<p>This is something forbidden. The Prophet (ṣ) prohibited it and blamed those who do it. Its mention here does not indicate that it is not blameworthy. Rather, the context of the matter is the veneration for the people of the cave and praise for them reached the point that these people decided to build a place of prayer over them.<\/p>\n<p>Source: Tafsīr al-Sa’dī 1\/473<\/p><\/blockquote>\n<p>For this reason, Al-Qurtubi also commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال علماؤنا وهذا يحرم على المسلمين أن يتّخذوا قبور الأنبياء والعلماء مساجد<\/p>\n<p>Our scholars said it is forbidden for Muslims to take graves of the prophets and scholars as places of prayer.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 10\/380<\/p><\/blockquote>\n<p>Likewise, Ibn Kathir commented after mentioning the Prophet’s (ṣ) prohibition of grave worship:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ رُوِّينَا عَنْ أَمِيرِ الْمُؤْمِنِينَ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ لَمَّا وَجَدَ قَبْرَ دَانْيَالَ فِي زَمَانِهِ بِالْعِرَاقِ أَمَرَ أَنْ يُخْفَى عَنِ النَّاسِ<\/p>\n<p>We have narrated from the commander of the faithful, Umar ibn al-Khattab, may Allah be pleased with him, that when they found the grave of Daniel in his time in Iraq, he ordered that it be hidden from people.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 5\/134<\/p><\/blockquote>\n<p>The evidence presented in this article is clear and decisive, all praise is due to Allah. Some Muslims may bring forth loose arguments and weak reports to justify the elaborate Sufi rituals they have innovated in regards to visiting graves. However, the religion of Islam is based upon proof from the Quran and Sunnah, not on unconfirmed anecdotes, mystical experiences, or the opinions of later scholars, not matter how great their status is among the people. Muslims must follow the truth wherever it leads, even if the majority of people are against it. If we truly love the Messenger of Allah (ṣ), we would strictly adhere to his Sunnah and avoid all innovated ways of worship.<\/p>\n<p>In sum, grave worship is severely prohibited in Islam because it is one of the leading causes of idolatry among humankind. The Prophet (ṣ) and his companions were very strict about blocking all the means that could lead to the worship of created beings. Many Muslims have fallen into sin by committing great excesses at gravesites. Even so, the method of rectification is to change hearts and minds through wise and beautiful preaching, with gentleness and sincerity, not through harshness, malice, or violence.<\/p>\n<p><em>Success comes from Allah, and Allah know best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Do not take graves as places of prayer. I forbid you from doing so.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[12,420,399,26,394,387,511,32,37,41,51,316,56,355,115,60,62,84,66,91,478,220,531,329,121,504,73,98,435,128,332],"class_list":["post-23619","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-ali-ibn-abi-talib","tag-caliphs-al-khulafa","tag-exaggeration-al-ghuluw","tag-forgiveness-al-maghfirah","tag-graves-al-qubur","tag-haram","tag-hearts-al-qulub","tag-hereafter-akhirah","tag-idolatry-shirk","tag-imam-al-shafii","tag-leadership-imamate","tag-medina-madinah","tag-monotheism-tawheed","tag-mosques-al-masajid","tag-people-of-the-book","tag-prayer-salat","tag-prophetic-biography-sirah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-remembrance-dhikr","tag-righteous-predecessors-al-salaf-al-salih","tag-seeking-forgiveness-al-istighfar","tag-supplication-al-dua","tag-surah-ya-sin","tag-temperance-zuhd","tag-terrorism-al-irhab","tag-torah-al-tawrah","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr","tag-wellness-al-afiyyah","tag-women-nisa","tag-worldly-life"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-68X","jetpack-related-posts":[{"id":20841,"url":"https:\/\/www.abuaminaelias.com\/tawassul-prophets-saints-graves\/","url_meta":{"origin":23619,"position":0},"title":"Tawassul: Seeking help from prophets and saints?","author":"Abu Amina Elias","date":"August 28, 2019","format":false,"excerpt":"\"O you who have faith, fear Allah and seek means to approach Him.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17195,"url":"https:\/\/www.abuaminaelias.com\/protection-of-non-muslim-houses-of-worship-in-islam\/","url_meta":{"origin":23619,"position":1},"title":"Protection of non-Muslim houses of worship in Islam","author":"Abu Amina Elias","date":"October 18, 2015","format":false,"excerpt":"\"The houses of worship for non-Muslim citizens should be defended by the believers.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15863,"url":"https:\/\/www.abuaminaelias.com\/blessings-night-of-decree-laylat-al-qadr\/","url_meta":{"origin":23619,"position":2},"title":"Blessings of the Night of Decree, Laylat al-Qadr","author":"Abu Amina Elias","date":"July 19, 2014","format":false,"excerpt":"\"The Night of Decree is better than a thousand months.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19805,"url":"https:\/\/www.abuaminaelias.com\/curse-the-graves-of-the-unbelievers\/","url_meta":{"origin":23619,"position":3},"title":"Curse the Graves of the Unbelievers?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Do not abuse the dead and thus hurt the living.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16920,"url":"https:\/\/www.abuaminaelias.com\/the-meaning-of-spiritual-excellence-in-islam\/","url_meta":{"origin":23619,"position":4},"title":"Spiritual excellence in Islam","author":"Abu Amina Elias","date":"August 29, 2015","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him, for although you do not see Him yet He certainly sees you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23683,"url":"https:\/\/www.abuaminaelias.com\/asking-dead-for-dua\/","url_meta":{"origin":23619,"position":5},"title":"Asking the deceased for supplications or intercession?","author":"Abu Amina Elias","date":"November 7, 2021","format":false,"excerpt":"\"If you ask, ask from Allah. If you seek help, seek help from Allah.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23619","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23619"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23619\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23619"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23619"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23619"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}