{"id":23635,"date":"2021-10-23T15:12:28","date_gmt":"2021-10-23T11:12:28","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23635"},"modified":"2021-11-08T10:16:00","modified_gmt":"2021-11-08T06:16:00","slug":"tawhid-worship-allah-alone","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/tawhid-worship-allah-alone\/","title":{"rendered":"Necessity of worshiping Allah alone"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The religion of Islam is based upon the core principle of monotheism (<em>tawhid<\/em>), which means to worship Allah alone exclusively and not to worship anything else besides Him. It is not enough for Muslims to simply believe in the Almighty Creator. The Arab idolaters believed that Allah was the Creator but they committed idolatry by worshiping their false gods. Rather, it is imperative that all acts of worship are directed to Allah according to the guidance of the authentic Sunnah of His Prophet (ṣ).<\/p>\n<p>The command to worship Allah alone is recited by Muslims several times a day in <em>Surat al-Fatihah<\/em>, a chapter known as the “foundation of the Book” and which must be recited in every single ritual prayer:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ<\/p>\n<p><strong>You alone we worship, You alone we ask for help.<\/strong><\/p>\n<p>Surat al-Fatihah 1:5<\/p><\/blockquote>\n<p>In fact, the meaning of the name “Allah” is the only true God who deserves to be worshipped.<\/p>\n<p>Ibn Abbas explained the name of Allah, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُ ذُو الْأُلُوهِيَّةِ وَالْمَعْبُودِيَّةِ عَلَى خَلْقِهِ أَجْمَعِينَ<\/p>\n<p>Allah is the One who possess divinity (<em>al-uluhiyyah<\/em>) and the right to be worshipped over all of His creation.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 1:1<\/p><\/blockquote>\n<p>Worshiping Allah alone is the <em>only<\/em> reason for which human beings and jinn have been created. It is the purpose for which the Prophets and Messengers were sent to warn us of Hellfire as punishment for committing idolatry (<em>shirk<\/em>) and to give us glad tidings of Paradise as a reward for actualizing monotheism.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ<\/p>\n<p><strong>I have not created humans or jinn but to worship Me.<\/strong><\/p>\n<p>Surat al-Dhariyat 51:56<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولًا أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ<\/p>\n<p><strong>We have certainly sent a Messenger of every nation, saying: Worship Allah and avoid false gods.<\/strong><\/p>\n<p>Surat al-Nahl 16:36<\/p><\/blockquote>\n<p>Given its great importance as the foundation of Islam and the purpose of creation, Muslim scholars have detailed the requirements of monotheism within three categories:<\/p>\n<ol>\n<li>Oneness of Lordship (<em>tawhid al-rubbubiyyah<\/em>),<\/li>\n<li>Oneness of Godship (<em>tawhid al-uluhiyyah<\/em>),<\/li>\n<li>Oneness of Names and Attributes (<em>tawhid al-asma’ wal-sifat<\/em>).<\/li>\n<\/ol>\n<p>Ibn Abi al-‘Izz commented on the <a href=\"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/\">creed of Imam al-Tahawi<\/a>, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالتَّوْحِيدُ أَوَّلُ الْأَمْرِ وَآخِرُهُ أَعْنِي تَوْحِيدَ الْإِلَهِيَّةِ فَإِنَّ التَّوْحِيدَ يَتَضَمَّنُ ثَلَاثَ أَنْوَاعٍ أَحَدُهَا الْكَلَامُ فِي الصِّفَاتِ وَالثَّانِي تَوْحِيدُ الرُّبُوبِيَّةِ وَبَيَانُ أَنَّ اللَّهَ وَحْدَهُ خَالِقُ كُلِّ شَيْءٍ وَالثَّالِثُ تَوْحِيدُ الْإِلَهِيَّةِ وَهُوَ اسْتِحْقَاقُهُ سُبْحَانَهُ وَتَعَالَى أَنْ يُعْبَدَ وَحْدَهُ لَا شَرِيكَ لَهُ<\/p>\n<p>Monotheism is the beginning of the matter and its end, meaning the Oneness of Divinity. Monotheism includes three aspects: First, theology of the Attributes of Allah. Second, the Oneness of Lordship and clarity that Allah alone created everything. Third, the Oneness of Godship, which is His worthiness to be worshiped alone without any partner, glory be to Him and exalted is He.<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwīyah 1\/24<\/p><\/blockquote>\n<p>The author introduces monotheism by its essence, which is the unique divinity of Allah. This category of ‘Godship’ is the most neglected by humankind, as nearly every religion in the world other than Islam devotes some kind of worship or undue veneration to created beings. This false worship of theirs is called ‘making a partner with Allah’ or &#8216;associating with Allah,&#8217; that is, to commit idolatry with Him.<\/p>\n<p>Idolatry is the foundation of every evil in the world, just as monotheism is the foundation of every good. A human being who commits idolatry turns away from the purpose for which he or she is created, and it is in the name of idolatrous religions and ideologies that great slaughter, corruption, and wickedness are spread upon the earth.<\/p>\n<p>For this reason, Allah has warned us that He will not forgive anyone who commits idolatry in worship and does not repents from it. They will be punished in Hellfire and remain therein forever.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ ۚ وَمَن يُشْرِكْ بِاللَّهِ فَقَدِ افْتَرَىٰ إِثْمًا عَظِيمًا<\/p>\n<p><strong>Verily, Allah does not forgive idolatry that is committed with Him, but He forgives what is less than that for whomever He wills. Whoever commits idolatry with Allah, he has fabricated a tremendous sin. <\/strong><\/p>\n<p>Surat al-Nisa’ 4:48<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَن كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا<\/p>\n<p><strong>Thus, whoever hopes in the meeting with his Lord, let him work righteousness and not associate anyone in the worship of his Lord.<\/strong><\/p>\n<p>Surat al-Kahf 18:110<\/p><\/blockquote>\n<p>The matter of idolatry and monotheism must not be belittled by the Muslims, for it is the commanding principle of Islam and distinguishes it from all other religions that promote worship of the creation.<\/p>\n<p>A widespread misconception amongst the Muslims today is that the Meccan polytheists, to whom the Prophet (ṣ) was sent and the Quran was revealed, had only denied the Lordship of the Creator (<em>al-rububiyyah<\/em>) and this denial alone was their idolatry for which they were condemned to Hellfire. Therefore, they say, it is impossible for a Muslim who outwardly declares there is no God but Allah to fall into idolatry or associate partners with Allah in worship. This is an enormous mistake.<\/p>\n<p>Even the greatest of Messengers, Abraham, upon him be peace, sought refuge in Allah from idolatry in fear of himself or his descendants worshiping idols:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الْأَصْنَامَ<\/p>\n<p><strong>When Abraham said: My Lord, make this country secure and keep me and my children away from worshiping idols.<\/strong><\/p>\n<p>Surat Ibrahim 14:35<\/p><\/blockquote>\n<p>And Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الشِّرْكَ فَزِعَتْ مِنْهُ السَّمَاوَاتُ وَالْأَرْضُ وَالْجِبَالُ وَجَمِيعُ الْخَلَائِقِ إِلَّا الثَّقَلَيْنِ وَكَادَتْ أَنْ تَزُولَ مِنْهُ لِعَظَمَةِ اللَّهِ وَكَمَا لَا يَنْفَعُ مَعَ الشِّرْكِ إِحْسَانُ الْمُشْرِكِ كَذَلِكَ نَرْجُو أَنْ يَغْفِرَ اللَّهُ ذُنُوبَ الْمُوَحِّدِينَ<\/p>\n<p>Verily, idolatry terrifies the heavens, the earth, the mountains, and all of creation except for the worlds of men and jinn. They nearly quake from the greatness of Allah, as goodness with idolatry will not benefit the idolater. Thus, we hope that Allah will forgive the sins of the monotheists.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/24\/ibn-abbas-shirk\/\">Tafsīr al-Ṭabarī 19:90<\/a><\/p><\/blockquote>\n<p>On the contrary, Allah confirms that the Meccan polytheists did indeed recognize Him as their sole Creator and Provider, which is part of His Lordship. They were well-aware that their idols were not creators, providers, or almighty lords.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْ مَن يَرْزُقُكُم مِّنَ السَّمَاءِ وَالْأَرْضِ أَمَّن يَمْلِكُ السَّمْعَ وَالْأَبْصَارَ وَمَن يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَمَن يُدَبِّرُ الْأَمْرَ ۚ فَسَيَقُولُونَ اللَّهُ ۚ فَقُلْ أَفَلَا تَتَّقُونَ<\/p>\n<p><strong>Say, ‘Who provides for you from the heavens and the earth? Or who controls the hearing and the seeing? Or who brings out the living from the dead and brings out the dead from the living and who arranges the affairs?’ They will say, ‘Allah.’ Thus, say, ‘Will you not fear Him?’<\/strong><\/p>\n<p>Surat Yunus 10:31<\/p><\/blockquote>\n<p>Al-Razi commented on these verses, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ بَيَّنَ تَعَالَى أَنَّ الرَّسُولَ عَلَيْهِ السَّلَامُ إِذَا سَأَلَهُمْ عَنْ مُدَبِّرِ هَذِهِ الْأَحْوَالِ فَسَيَقُولُونَ إِنَّهُ اللَّه سُبْحَانَهُ وَتَعَالَى وَهَذَا يَدُلُّ عَلَى أَنَّ الْمُخَاطَبِينَ بِهَذَا الْكَلَامِ كَانُوا يَعْرِفُونَ اللَّه وَيُقِرُّونَ بِهِ وَهُمُ الَّذِينَ قَالُوا فِي عِبَادَتِهِمْ لِلْأَصْنَامِ إِنَّهَا تُقَرِّبُنَا إِلَى اللَّه زُلْفَى وَإِنَّهُمْ شُفَعَاؤُنَا عِنْدَ اللَّه وَكَانُوا يَعْلَمُونَ أَنَّ هَذِهِ الْأَصْنَامَ لَا تَنْفَعُ وَلَا تَضُرُّ فَعِنْدَ ذَلِكَ قَالَ لِرَسُولِهِ عَلَيْهِ السَّلَامُ فَقُلْ أَفَلا تَتَّقُونَ يَعْنِي أَفَلَا تَتَّقُونَ أَنْ تَجْعَلُوا هَذِهِ الْأَوْثَانَ شُرَكَاءَ للَّه فِي الْمَعْبُودِيَّةِ مَعَ اعْتِرَافِكُمْ بِأَنَّ كُلَّ الْخَيْرَاتِ فِي الدُّنْيَا وَالْآخِرَةِ إِنَّمَا تَحْصُلُ مِنْ رَحْمَةِ اللَّه وَإِحْسَانِهِ وَاعْتِرَافِكُمْ بِأَنَّ هَذِهِ الْأَوْثَانَ لَا تَنْفَعُ وَلَا تَضُرُّ أَلْبَتَّةَ<\/p>\n<p>Then, the Almighty made clear that if the Messenger (ṣ) asked them who arranged these matters, they will say Allah Almighty indeed. This indicates that those addressed by this speech acknowledged and affirmed it was Allah, yet they said in their worship of the idols, ‘They bring us closer to Allah and they are our intercessors with Allah.’ They knew that these idols did not benefit or harm, thus at that He commanded His Messenger (ṣ) to say, ‘Will you not fear Him?’ meaning, will you not fear that you make these idols into partners with Allah in worship, despite your acknowledgment that all good in the world and the Hereafter is only achieved by the mercy of Allah and His benevolence, and your acknowledgment that these idols do not benefit or harm at all?<\/p>\n<p>Source: Tafsīr al-Rāzī 17\/247<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُل لِّمَنِ الْأَرْضُ وَمَن فِيهَا إِن كُنتُمْ تَعْلَمُونَ سَيَقُولُونَ لِلَّهِ ۚ قُلْ أَفَلَا تَذَكَّرُونَ<\/p>\n<p><strong>Say, ‘To whom belongs the earth and whoever is upon it if you know?’ They will say, ‘Allah.’ Then will you not remember?<\/strong><\/p>\n<p>Surat al-Mu’minun 23:84-85<\/p><\/blockquote>\n<p>Ibn Kathir commented on these verses, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُقَرِّرُ تَعَالَى وَحْدَانِيَّتَهُ وَاسْتِقْلَالَهُ بِالْخَلْقِ وَالتَّصَرُّفِ والملك ليرشد إلى أنه الله الَّذِي لَا إِلَهَ إِلَّا هُوَ وَلَا تَنْبَغِي الْعِبَادَةُ إِلَّا لَهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَلِهَذَا قَالَ لِرَسُولِهِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقُولَ لِلْمُشْرِكِينَ الْعَابِدِينَ مَعَهُ غَيْرَهُ الْمُعْتَرِفِينَ لَهُ بِالرُّبُوبِيَّةِ وَأَنَّهُ لَا شَرِيكَ لَهُ فِيهَا وَمَعَ هَذَا فَقَدَ أَشْرَكُوا مَعَهُ فِي الْإِلَهِيَّةِ فَعَبَدُوا غَيْرَهُ مَعَهُ مَعَ اعْتِرَافِهِمْ أَنَّ الَّذِينَ عَبَدُوهُمْ لَا يَخْلُقُونَ شَيْئًا وَلَا يَمْلِكُونَ شيئا ولا يستبون بِشَيْءٍ بَلِ اعْتَقَدُوا أَنَّهُمْ يُقَرِّبُونَهُمْ إِلَيْهِ زُلْفَى مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى اللَّهِ زُلْفى<\/p>\n<p>The Almighty affirmed His Oneness and exclusivity in creation, control, and ownership to demonstrate that He is Allah, other than whom there is no God. None deserves to be worshiped but Him alone without any partners with Him. For this reason, He commanded His Messenger Muhammad (ṣ) to say to the idolaters who worshiped those alongside Him, who acknowledged His Lordship, that He has no partners in it. Despite this, they associated partners with Him in Divinity, so they worshiped others alongside Him while knowing that these things they worshiped do not create anything, nor own anything, nor control anything. Rather, they believed they brought them closer to Him, saying, ‘We do not worship them but that they bring us closer to Allah.’ (39:3)<\/p>\n<p>Source: Tafsīr Ibn Kathīr 5\/425<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ<\/p>\n<p><strong>If you asked them, ‘Who created the heavens and the earth and subjected the sun and the moon?’ They will surely say, ‘Allah.’ Then how are they deluded?<\/strong><\/p>\n<p>Surat al-‘Ankabut 29:61<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ<\/p>\n<p><strong>If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘Allah.’ Say, ‘All praise is due to Allah,’ but most of them do not know.<\/strong><\/p>\n<p>Surat Luqman 31:25<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ<\/p>\n<p><strong>If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘Allah.’<\/strong><\/p>\n<p>Surat al-Zumar 39:38<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ<\/p>\n<p><strong>If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘They were created by the Almighty, the Knowing.’<\/strong><\/p>\n<p>Surat al-Zukhruf 43:9<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ<\/p>\n<p><strong>If you asked them, ‘Who created them?’ They will surely say, ‘Allah.’ Then how are they deluded?<\/strong><\/p>\n<p>Surat al-Zukhruf 43:87<\/p><\/blockquote>\n<p>Ibn Kathir commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُمْ يَعْتَرِفُونَ أَنَّهُ الْخَالِقُ لِلْأَشْيَاءِ جَمِيعِهَا وَحْدَهُ لَا شَرِيكَ لَهُ فِي ذَلِكَ وَمَعَ هَذَا يَعْبُدُونَ مَعَهُ غَيْرَهُ مِمَّنْ لَا يَمْلِكُ شَيْئًا وَلَا يَقْدِرُ عَلَى شَيْءٍ<\/p>\n<p>They recognized that He was the Creator of all things alone, without any partners for Him in that, yet despite this they worshiped others alongside Him who do not own anything or have power over anything.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 7\/223<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِقْرَارُ الْمُشْرِكِ بِأَنَّ اللَّهَ رَبُّ كُلِّ شَيْءٍ وَمَلِيكُهُ وَخَالِقُهُ لَا يُنْجِيهِ مِنْ عَذَابِ اللَّهِ إنْ لَمْ يَقْتَرِنْ بِهِ إقْرَارُهُ بِأَنَّهُ لَا إلَهَ إلَّا اللَّهُ فَلَا يَسْتَحِقُّ الْعِبَادَةَ أَحَدٌ إلَّا هُوَ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَيَجِبُ تَصْدِيقُهُ فِيمَا أَخْبَرَ وَطَاعَتُهُ فِيمَا أَمَرَ فَلَا بُدَّ مِنْ الْكَلَامِ فِي هَذَيْنِ الْأَصْلَيْنِ الْأَصْلُ الْأَوَّلُ تَوْحِيدُ الْإِلَهِيَّةِ فَإِنَّهُ سُبْحَانَهُ أَخْبَرَ عَنْ الْمُشْرِكِينَ كَمَا تَقَدَّمَ بِأَنَّهُمْ أَثْبَتُوا وَسَائِطَ بَيْنَهُمْ وَبَيْنَ اللَّهِ يَدْعُونَهُمْ وَيَتَّخِذُونَهُمْ شُفَعَاءَ بِدُونِ إذْنِ اللَّهِ<\/p>\n<p>Thus, the idolaters affirmed that Allah is the Lord of all things, their Master, and their Creator, but it did not save them from the punishment of Allah as it was not paired with affirmation that there is nothing worthy of worship but Allah and none deserves to be worshipped but Him, and that Muhammad is the Messenger of Allah. One is obligated to believe in him in what he delivered and obey him in what he commanded. The statement of these two principles must contain the primary principle: the Oneness of Divinity. For the Almighty informed of the idolaters, as has preceded, that they established intermediaries between them and Allah, calling upon them and taking them as intercessors without the permission of Allah.<\/p>\n<p>Source: <span style=\"color: #000000;\">Majmū&#8217; al-Fatāwá <\/span>3\/105<\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والإلهية التى دعت الرسل أممهم إلى توحيد الرب بها هى العبادة والتأليه ومن لوازمها توحيد الربوبية الذى أقر به المشركون فاحتج الله عليهم به فإنه يلزم من الإقرار به الإقرار بتوحيد الإلهية<\/p>\n<p>The Oneness of Godship is that to which the Messengers called their nations, the Oneness of the Lord, which is to worship and deify Him. From its necessities is the Oneness of Lordship, which the idolaters affirmed and thus Allah used as proof against them, for whoever affirms it must necessarily affirm the Oneness of Godship.<\/p>\n<p>Source: Ighāthat al-Lahfān fī Maṣāʼid al-Shayṭān 2\/135<\/p><\/blockquote>\n<p>And Al-Maqrizi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولا ريب أن توحيد الربوبية لم ينكره المشركون بل أقرّوا بأنه سبحانه وحده خالقهم وخالق السماوات والأرض والقائم بمصالح العالم كله وإنما أنكروا توحيد الإلهيّة والمحبّة &#8230; فلما سووا غيره به في هذا التّوحيد كانوا مشركين<\/p>\n<p>There is no doubt that the idolaters did not reject the Oneness of Lordship. Rather, they affirmed that the Almighty created them, created the heavens and the earth, and sustains the well-being of the entire world. Indeed, they only rejected the Oneness of Godship and love… So when they equated others with Him in this Oneness, they became idolaters.<\/p>\n<p>Source: Tajrīd al-Tawḥīd al-Mufīd 1\/7<\/p><\/blockquote>\n<p>Hence, the Meccan polytheists affirmed the Lordship of Allah but this is did not prevent them from falling into idolatry. They were considered by Allah to be idolaters because they refused to worship Allah alone, instead worshiping Him sometimes and worshiping false gods at other times, and they would even pray to Allah alone if they were in severe distress or danger.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ<\/p>\n<p><strong>When they board the ship, they call upon Allah sincerely in religion, but when He safely brings them to land, at once they commit idolatry.<\/strong><\/p>\n<p>Surat al-‘Ankabut 29:65<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَن تَدْعُونَ إِلَّا إِيَّاهُ ۖ فَلَمَّا نَجَّاكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ ۚ وَكَانَ الْإِنسَانُ كَفُورًا<\/p>\n<p><strong>When harm touches you at sea, gone are those you call upon besides Him. When He brings you safely to land, you turn away. Man is ever ungrateful.<\/strong><\/p>\n<p>Surat al-Isra 17:67<\/p><\/blockquote>\n<p>Al-Qurtubi commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمَعْنَى فِي هَذِهِ الْآيَةِ أَنَّ الْكُفَّارَ إِنَّمَا يَعْتَقِدُونَ فِي أَصْنَامِهِمْ أَنَّهَا شَافِعَةٌ وَأَنَّ لَهَا فَضْلًا وَكُلُّ وَاحِدٍ مِنْهُمْ بِالْفِطْرَةِ يَعْلَمُ عِلْمًا لَا يَقْدِرُ عَلَى مُدَافَعَتِهِ أَنَّ الْأَصْنَامَ لَا فِعْلَ لَهَا فِي الشَّدَائِدِ الْعِظَامِ<\/p>\n<p>The meaning of this verse is that the unbelievers only believed their idols were intercessors and they were favored, but each of them knew by natural instinct, with knowledge that cannot be suppressed, that the idols had no ability in times of great hardship.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 10\/291<\/p><\/blockquote>\n<p>It was likewise the belief of the people to whom Abraham, upon him be peace, was sent that their idols had no power of Lordship whatsoever. These idolaters knew their idols could not hear or speak or benefit or harm, yet they only worshiped them because it was an inherited social custom.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاتْلُ عَلَيْهِمْ نَبَأَ إِبْرَاهِيمَ إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا تَعْبُدُونَ قَالُوا نَعْبُدُ أَصْنَامًا فَنَظَلُّ لَهَا عَاكِفِينَ قَالَ هَلْ يَسْمَعُونَكُمْ إِذْ تَدْعُونَ أَوْ يَنفَعُونَكُمْ أَوْ يَضُرُّونَ قَالُوا بَلْ وَجَدْنَا آبَاءَنَا كَذَٰلِكَ يَفْعَلُونَ<\/p>\n<p><strong>Recite to them the news of Abraham, when he said to his father and his people: What do you worship? They said: We worship idols and are devoted to them. Abraham said: Do they hear your supplications or benefit you or harm you? They said: No, but we found our forefathers doing the same.<\/strong><\/p>\n<p>Surat al-Shu’ara 26:69-74<\/p><\/blockquote>\n<p>Al-Baghawi commented on these verses, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَاهُ إِنَّهَا لَا تَسْمَعُ قَوْلًا وَلَا تَجْلِبُ نَفْعًا وَلَا تَدْفَعُ ضَرًّا لَكِنِ اقْتَدَيْنَا بِآبَائِنَا فِيهِ إِبْطَالُ التَّقْلِيدِ فِي الدِّينِ<\/p>\n<p>Meaning, they do not hear words, nor bring benefit, nor repel harm, but rather we followed our forefathers. In this is the falsehood of blind following in religion.<\/p>\n<p>Source: Tafsīr al-Baghawī 6\/117<\/p><\/blockquote>\n<p>Like the Meccan idolaters, the people of Abraham admitted their idols were powerless before the Almighty, but they rejected their Messenger only because he commanded them to worship Allah alone and abandon their inherited traditions.<\/p>\n<p>Even Iblees, Satan himself, acknowledges that Allah is the only Lord of His creation, but obviously merely knowing or admitting this fact does not make him a believer. He is an unbeliever because he refused to obey Allah and worship Him.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِّنكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ<\/p>\n<p><strong>Like the example of Satan when he says to man, ‘Disbelieve!’ but when he disbelieves, he says, ‘I have nothing to do with you. Indeed, I fear Allah, the Lord of the worlds!’<\/strong><\/p>\n<p>Surat al-Hashr 59:16<\/p><\/blockquote>\n<p>Allah informs us again that most of the Meccans believed in Him but they would associate partners with Him in worship.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا يُؤْمِنُ أَكْثَرُهُم بِاللَّهِ إِلَّا وَهُم مُّشْرِكُونَ<\/p>\n<p><strong>Most of them do not believe in Allah but that they commit idolatry. <\/strong><\/p>\n<p>Surat Yusuf 12:106<\/p><\/blockquote>\n<p>Mujahid commented on this verse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيمَانُهُمْ قَوْلُهُمُ اللَّهُ خَالِقُنَا وَيَرْزُقُنَا وَيُمِيتُنَا فَهَذَا إِيمَانٌ مَعَ شِرْكِ عِبَادَتِهِمْ غَيْرَهُ<\/p>\n<p>Their faith was their saying Allah created us, provides for us, and causes our deaths. Yet this was faith along with associating others in their worship of Him.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 12:106<\/p><\/blockquote>\n<p>And Qatadah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ي إِيمَانِهِمْ هَذَا إِنَّكَ لَسْتَ تَلْقَى أَحَدًا مِنْهُمْ إِلَّا أَنْبَأَكَ أَنَّ اللَّهَ رَبُّهُ وَهُوَ الَّذِي خَلَقَهُ وَرَزَقَهُ وَهُوَ مُشْرِكٌ فِي عِبَادَتِهِ<\/p>\n<p>Their faith was this: you would not meet one of them but that he would tell you Allah is his Lord who created him and provided for him, yet he was an idolater in his worship.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 12:106<\/p><\/blockquote>\n<p>They associated partners with Allah in their worship of Him. The command from Allah to worship Him alone was what they denied and the reason they persecuted the Prophet (ṣ) and the Muslims, not because of the Lordship of Allah.<\/p>\n<p>Even if some of these idolaters declared independent lordship for their idols, which some of them certainly did among the hundreds of idols worshiped around Mecca, their strongest objection to Islam was the command to worship Allah alone, not merely to declare Allah as the only independent Lord and Creator.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ<\/p>\n<p><strong>The unbelievers say: This is a sorcerer, a liar! Has he made all the gods into one God? This is something strange!<\/strong><\/p>\n<p>Surat Sad 38:4-5<\/p><\/blockquote>\n<p>The Meccan polytheists also acknowledged the Lordship of Allah in their call during the Hajj pilgrimage (<em>talbiyyah<\/em>), but then they would still falsely ascribe partners to Him.<\/p>\n<p>Ibn Abbas reported: The idolaters would say, “O Allah, at Your service! You have no partners!” The Messenger of Allah, peace and blessings be upon him, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيْلَكُمْ قَدْ قَدْ<\/p>\n<p><strong>Woe to you! Stop here! Stop here!<\/strong><\/p><\/blockquote>\n<p>Then, they would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِلَّا شَرِيكًا هُوَ لَكَ تَمْلِكُهُ وَمَا مَلَكَ<\/p>\n<p>&#8230;except for partners You own and do not own You.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1185, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/09\/28\/mushrikun-believe-allah-is-rabb\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Thus, it is clear that the Meccans were idolaters because they refused to worship Allah alone, not that they rejected the Lordship of Allah or denied that He was the Almighty Creator. It is not enough for Muslims to believe Allah is the Lord and to worship Him until they also reject all created objects that are worshiped alongside Him.<\/p>\n<p>Tariq ibn Ashyam reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَفَرَ بِمَا يُعْبَدُ مِنْ دُونِ اللَّهِ حَرُمَ مَالُهُ وَدَمُهُ وَحِسَابُهُ عَلَى اللَّهِ<\/p>\n<p><strong>Whoever says there is no God but Allah, and disbelieves in what is worshiped besides Allah, his property and his life are sacred and he will be held accountable to Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 23, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/22\/shirk-tawhid-reject-false-gods\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ مَنْ عَمِلَ عَمَلًا أَشْرَكَ فِيهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ<\/p>\n<p><strong>Allah Almighty said: Verily, I have no need of any partners. Whoever performs a deed in which he associates another besides Me, I will abandon him and his partner.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2985, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/18\/shirk-abandon-mushrikin-idols\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Today, some Muslims are committing many impermissible acts resembling idolatry at graves, shrines, and other places where they call upon created beings in prayer, seek refuge and deliverance (<em>istighatha<\/em>) in them, and believe they have supernatural powers only befitting to Allah, or they circumambulate graves, or they sacrifice their animals to others besides Allah, or they make vows and oaths in the name of other than Allah, and so on. These Muslims have been lied to by charlatans falsely claiming sainthood (<em>wilayah<\/em>) or even prophethood (<em>nubuwwah<\/em>) for themselves in order to swindle the ignorant masses of their charitable donations.<\/p>\n<p>These false saints do not take their religion from the proofs of the Quran and the Sunnah and the trustworthy scholars, but rather from foreign philosophies, misconstrued evidence, unconfirmed anecdotes, exaggerated mystical experiences, or false miracles that they perform by their worship of devils among the jinn. The Prophet (ṣ) warned us that such liars would appear among us and lead part of his nation into idolatry.<\/p>\n<p>Thawban reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَقُومُ السَّاعَةُ حَتَّى تَلْحَقَ قَبَائِلُ مِنْ أُمَّتِي بِالْمُشْرِكِينَ وَحَتَّى يَعْبُدُوا الْأَوْثَانَ وَإِنَّهُ سَيَكُونُ فِي أُمَّتِي ثَلَاثُونَ كَذَّابُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ نَبِيٌّ وَأَنَا خَاتَمُ النَّبِيِّينَ لَا نَبِيَّ بَعْدِي<\/p>\n<p><strong>The Hour will not be established until tribes from my nation join the idolaters and they worship idols. Verily, there will be thirty liars among my nation, all of them claiming to be a prophet, but I am the seal of the Prophets. There is no prophet after me.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2219, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/21\/signs-hour-idol-worship\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>As such, the claim that Muslims could never fall into the idolatry of worship is a fraud concocted by those who liberally introduce heretical beliefs and practices into the Muslim Ummah. The nation of Muhammad (ṣ) will never fall into idolatry as a whole, since there will always be groups of Muslims calling to the pure truth, but some Muslims will commit idolatry because of the fabrications of these false prophets and fake saints.<\/p>\n<p>It is our duty to warn such Muslims of the grievous errors that they commit under the pretense of these false beliefs that they have been taught. However, it is not the right of any individual Muslim to declare another individual Muslim to be an unbeliever or an idolater (<em>takfir<\/em>), even if they apparently say or do things that outwardly resemble unbelief and idolatry. It is most certainly unlawful to engage in violence against anyone on this pretext.<\/p>\n<p>Abu Dharr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَرْمِي رَجُلٌ رَجُلًا بِالْفُسُوقِ وَلَا يَرْمِيهِ بِالْكُفْرِ إِلَّا ارْتَدَّتْ عَلَيْهِ إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ<\/p>\n<p><strong>A man does not accuse another man of wickedness or unbelief but that it will be turned against him, if his companion is innocent<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6045, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/excommunication-takfir-charges-backfire\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كذلك من دعا غير الله وحج إلى غير الله هو أيضًا مشرك، والذي فعله كفر لكن قد لا يكون عالمًا بأن هذا شرك محرم كما أن كثيرًا من الناس دخلوا في الإسلام من التتار وغيرهم وعندهم أصنام لهم صغار من لبد وغيره وهم يتقربون إليها ويعظمونها ولا يعلمون أن ذلك محرم فكثير من أنواع الشرك قد يخفى على بعض من دخل في الإسلام ولا يعلم أنه شرك<\/p>\n<p>Thus, whoever calls upon other than Allah, or performs pilgrimage for other than Allah, he is also an idolater who has committed unbelief, but he may not know that it is forbidden idolatry. Just as many people entered Islam among the Tartars and others while they had small idols with them made from wool or otherwise. They would perform acts of devotion to them and venerate them, but they did not know that was forbidden. So many types of idolatry are obscured from some who enter Islam and they do not know it is idolatry.<\/p>\n<p>Source: al-Ikhnā&#8217;īyah 1\/206<\/p><\/blockquote>\n<p>Mistakenly accusing a Muslim of being an unbeliever or an idolater makes the charge rebound against the accuser, a very serious threat from the Prophet (ṣ) not to indulge in this behavior lightly. There are many legitimate excuses, such as honest ignorance, that might prevent Allah from charging a misguided Muslim with heresy or idolatry on the Day of Resurrection, even if they mistakenly commit such grave sins. It is best to preach to them with wisdom and good manners and to leave the judgment of such individuals to Allah alone in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ<\/p>\n<p><strong>Verily, those who have faith, the Jews, the Sabians, the Christians, the Magians, and those who commit idolatry, Allah will judge between them on the Day of Resurrection. Allah is a witness over all things.<\/strong><\/p>\n<p>Surat al-Hajj 22:17<\/p><\/blockquote>\n<p>This point should be appreciated in our times especially since many people in the Muslim world are impoverished and unable to read and research the Quran and Sunnah in Arabic for themselves, so they can only rely upon scholars (<em>taqlid<\/em>) who might be corrupt or misguided. They simply do not have access to genuine knowledge, or they are unable to differentiate the true scholars from the pretenders. May Allah guide them and all believers to the straight path.<\/p>\n<p>In sum, the religion of Islam is based upon worshiping Allah alone without any partners. It is not enough for people to achieve salvation if they believe in the Creator but worship Him along with some other created beings. This was the faith of the Meccan polytheists whom Allah repeatedly condemned as idolaters in His Book, even though they sometimes worshiped Him and prayed to Him. Likewise, it is a catastrophe for Muslims to believe Allah is the Creator but to worship others alongside Him in the name of Sufism or false sainthood. We must devote all of our acts of worship to Allah alone, lest we fall into the unforgiveable sin of idolatry.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you asked them, ‘Who created the heavens and the earth?’ They will surely say, ‘Allah.’<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[167,61,20,183,262,449,88,135,32,37,151,90,326,50,461,207,408,56,372,134,115,358,60,254,301,400,67,373,68,405,220,393],"class_list":["post-23635","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-abraham-ibrahim","tag-call-to-islam-dawah","tag-creation-al-khalq","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-falsehood-al-kadhib","tag-pilgrimage-hajj","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-idolatry-shirk","tag-ignorance-al-jahl","tag-innovation-bidah","tag-jinn","tag-knowledge","tag-magic-al-sihr","tag-mecca-makkah","tag-miracles-al-mujizah","tag-monotheism-tawheed","tag-allah-names-asma-ul-husna","tag-paradise-jannah","tag-people-of-the-book","tag-praise-al-hamd","tag-prayer-salat","tag-provision-al-rizq","tag-pure-nature-fitrah","tag-refuge-al-taawwudh","tag-repentance-al-tawbah","tag-reward-al-ajr","tag-satan-al-shaytan","tag-signs-of-the-hour-ashrat-al-saah","tag-supplication-al-dua","tag-warning-al-nadhr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-69d","jetpack-related-posts":[{"id":22548,"url":"https:\/\/www.abuaminaelias.com\/tawhid-tawheed-in-islam\/","url_meta":{"origin":23635,"position":0},"title":"Understanding monotheism in Islam","author":"Abu Amina Elias","date":"July 18, 2020","format":false,"excerpt":"\"You alone we worship. You alone we ask for help.\"","rel":"","context":"In &quot;Featured&quot;","block_context":{"text":"Featured","link":"https:\/\/www.abuaminaelias.com\/category\/featured\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16556,"url":"https:\/\/www.abuaminaelias.com\/key-to-paradise-in-islam\/","url_meta":{"origin":23635,"position":1},"title":"Key to Paradise in Islam","author":"Abu Amina Elias","date":"April 20, 2015","format":false,"excerpt":"\"Whoever disbelieves in false gods and believes in Allah has grasped the most trustworthy handhold which will never break,\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15069,"url":"https:\/\/www.abuaminaelias.com\/customs-and-acts-of-worship-in-islamic-law\/","url_meta":{"origin":23635,"position":2},"title":"Customs and acts of worship in Islamic Law","author":"Abu Amina Elias","date":"December 16, 2013","format":false,"excerpt":"\"With regard to customs, if there is no text to prove that a custom is forbidden, how can it be deemed to be forbidden?\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16482,"url":"https:\/\/www.abuaminaelias.com\/transcendency-of-allah-in-islam\/","url_meta":{"origin":23635,"position":3},"title":"Transcendency of Allah in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Most Merciful is established upon the Throne.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16920,"url":"https:\/\/www.abuaminaelias.com\/the-meaning-of-spiritual-excellence-in-islam\/","url_meta":{"origin":23635,"position":4},"title":"Spiritual excellence in Islam","author":"Abu Amina Elias","date":"August 29, 2015","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him, for although you do not see Him yet He certainly sees you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14180,"url":"https:\/\/www.abuaminaelias.com\/worship-allah-in-fear-of-hellfire-and-hope-of-paradise\/","url_meta":{"origin":23635,"position":5},"title":"Worshiping Allah in fear and hope","author":"Abu Amina Elias","date":"July 15, 2013","format":false,"excerpt":"\"They arise from their beds and they supplicate their Lord in fear and hope, and they spend from what We have provided them.\" --Surah As-Sajda 32:16","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23635","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23635"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23635\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23635"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23635"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23635"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}