{"id":23683,"date":"2021-11-07T11:38:10","date_gmt":"2021-11-07T07:38:10","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23683"},"modified":"2021-11-08T10:31:18","modified_gmt":"2021-11-08T06:31:18","slug":"asking-dead-for-dua","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/asking-dead-for-dua\/","title":{"rendered":"Asking the deceased for supplications or intercession?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>A common practice throughout the Muslim world is asking the deceased for their supplications or intercession by their graves. This is a religious innovation that was not present at the time of the companions and the righteous predecessors. It is also a very spiritually dangerous practice because, besides being an innovation, persistently asking the deceased for favors or benefits could reach the level of greater idolatry.<\/p>\n<p>The general rule is that the deceased do not hear the living, so they are incapable of answering any request made of them. Everyone understands naturally that ordinary interaction with the deceased is no longer possible.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا يَسْتَوِي الْأَحْيَاءُ وَلَا الْأَمْوَاتُ ۚ إِنَّ اللَّهَ يُسْمِعُ مَن يَشَاءُ ۖ وَمَا أَنتَ بِمُسْمِعٍ مَّن فِي الْقُبُورِ<\/p>\n<p><strong>The living and the dead are not the same. Verily, Allah will make hear whomever He wills, but you cannot make those in the grave hear.<\/strong><\/p>\n<p>Surat al-Fatir 35:22<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ وَلَا تُسْمِعُ الصُّمَّ الدُّعَاءَ إِذَا وَلَّوْا مُدْبِرِينَ<\/p>\n<p><strong>Verily, you cannot make the dead hear, nor can you make the deaf hear the call when they turn away.<\/strong><\/p>\n<p>Surat al-Naml 27:80<\/p><\/blockquote>\n<p>The deceased can no longer perform good deeds because their term has ended. The only way for a person to earn good deeds after death is by ongoing charity, leaving behind knowledge in books and lectures, or having the righteous pray to Allah for them.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ<\/p>\n<p><strong>When the human being dies, his deeds end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1631, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/10\/23\/sadaqah-al-jariyah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>There are some miraculous exceptions to this general rule that are mentioned in the authentic Sunnah. They do not normally apply to all cases and should not be expanded without proof.<\/p>\n<p>Aws ibn Aws reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> فَأَكْثِرُوا عَلَيَّ مِنْ الصَّلَاةِ فِيهِ فَإِنَّ صَلَاتَكُمْ مَعْرُوضَةٌ عَلَيَّ<\/p>\n<p><strong>Send blessings upon me often, for your blessings are presented to me.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 1047, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/bless-prophet-friday\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلَّا رَدَّ اللَّهُ عَلَيَّ رُوحِي حَتَّى أَرُدَّ عَلَيْهِ السَّلَامَ<\/p>\n<p><strong>None of you greet me with peace but that Allah returns my spirit, that I may return his greeting of peace.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2041, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/22\/greeting-visit-qabr-madinah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>According to this narration, the Prophet (ṣ) can only answer our greetings because his soul is returned to him for this purpose. Otherwise, his soul has left his body and he can no longer do anything we ask from him like any other deceased person.<\/p>\n<p>Shaykh Ibn Uthaymeen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فالأصل أنهم لا يسمعون لأن أرواحهم قد فارقت أجسادهم، لكن ما جاءت به السنة لابد من الإيمان به<\/p>\n<p>The default is that those in the graves do not hear because their souls have been separated from their bodies, but what else has come in the Sunnah must be believed in.<\/p>\n<p>Source: Liqāʼ al-Bāb al-Maftūḥ 25\/222<\/p><\/blockquote>\n<p>For this reason, it is prohibited from asking anyone deceased or absent for help because they are no longer able to help us as they could when they were alive. It is not permissible to cite miraculous exceptions as if they were the general rule.<\/p>\n<p>Abu Bakr, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ مُحَمَّدًا قَدْ مَاتَ وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَيٌّ لَا يَمُوتُ<\/p>\n<p>Whoever among you worships Muhammad, peace and blessings be upon him, then Muhammad has died. Whoever worships Allah, then Allah is alive and cannot die.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1241, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/10\/whoever-worships-muhammad\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Qadi Abu Ya’la was asked about calling out to Muhammad or Ali ibn Abi Talib and he replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إن قصد الاستعانة فهو مخطىء لأن الغوث من الله تعالى فقال وهما ميتان فلا يصح الغوث منهما ولأنه يجب تقديم الله على غيره<\/p>\n<p>If what is intended is seeking their help, this is a mistake as aid is only sought from Allah Almighty and they are both deceased. It is not correct to seek aid from either of them as one should give preference to Allah above all others.<\/p>\n<p>Source: Badā’i’ al-Fawā’id 4\/40<\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ طَلَبَ شَفَاعَتِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ بَعْدَ مَوْتِهِ وَعِنْدَ قَبْرِهِ لَيْسَ مَشْرُوعًا عِنْدَ أَحَدٍ مِنْ أَئِمَّةِ الْمُسْلِمِينَ وَلَا ذَكَرَ هَذَا أَحَدٌ مِنْ الْأَئِمَّةِ الْأَرْبَعَةِ وَأَصْحَابِهِ الْقُدَمَاءِ وَإِنَّمَا ذَكَرَ هَذَا بَعْضُ الْمُتَأَخِّرِينَ<\/p>\n<p>Indeed, requesting his intercession, his supplication, and his seeking forgiveness after his death or by his grave was not legislated by anyone among the Imams of the Muslims, nor was it mentioned by the four Imams and the first generation of companions. Rather, it was mentioned by some of the later scholars.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/241<\/p><\/blockquote>\n<p>The practice of asking the deceased for their supplication or intercession is a forbidden innovation. If the companions and the righteous predecessors did not ask the Prophet (ṣ) for his supplication or intercession, then this likewise applies for anyone else after him.<\/p>\n<p>Some of the scholars allowed asking Allah “by the right” or “by the status” of the Prophet (ṣ), but this was not universally accepted. Even though this type of supplication was allowed, it was a supplication <em>to<\/em> Allah by the Prophet (ṣ) and not a request directly to him. Other scholars disallowed it in order to block the means of religious innovations or even idolatry.<\/p>\n<p>Imam Abu Hanifa, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَنْبَغِي لِأَحَدٍ أَنْ يَدْعُوَ اللَّهَ إلَّا بِهِ<\/p>\n<p>No one should call upon Allah except by Him.<\/p>\n<p>Source: al-Durr al-Mukhtār 6\/396<\/p><\/blockquote>\n<p>The key distinction between lawful and unlawful using of the Prophet (ṣ) as a means (<em>tawassul<\/em>) is whether or not Allah is invoked rather than him. Some scholars allowed calling upon Allah by the Prophet (ṣ), but all of them agree it is not permissible to call upon him directly or ask for his help.<\/p>\n<p>According to the Kuwaiti Encyclopedia of Fiqh:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرَّابِعُ يعني التوسل التَّحْرِيمُ وَذَلِكَ إِذَا اسْتَغَاثَ بِمَنْ لاَ يَمْلِكُ فِي الأْمُورِ الْمَعْنَوِيَّةِ بِالْقُوَّةِ أَوِ التَّأْثِيرِ سَوَاءٌ كَانَ الْمُسْتَغَاثُ بِهِ إِنْسَانًا أَوْ جِنًّا أَوْ مَلَكًا أَوْ نَبِيًّا فِي حَيَاتِهِ أَوْ بَعْدَ مَمَاتِهِ<\/p>\n<p>The fourth type of seeking means (<em>tawassul<\/em>) is forbidden, which is to seek the aid of one who has no control, power, or effect over matters in which his help is sought, whether one whose aid is sought is a human, a jinn, an angel, or a prophet in his life or after his death.<\/p>\n<p>Source: al-Mawsū’at al-Fiqhīyah al-Kuwaytīyah 4\/22<\/p><\/blockquote>\n<p>None of the companions or righteous predecessors called upon the deceased for help after their deaths. Any narrations that might suggest they did are either weak, fabricated, or misinterpreted. Rather, we should follow what is established in the Quran and authentically reported from them. The details of this issue have been mentioned in the article <em><a href=\"https:\/\/www.abuaminaelias.com\/tawassul-prophets-saints-graves\/\">Tawassul: Seeking help from prophets and saints?<\/a><\/em>.<\/p>\n<p>Some misguided Muslims obscure the important difference between permissible or debatable <em>tawassul<\/em> and calling upon the Prophet (ṣ) or other saints for their help, asking for their supplication or intercession, and so on. This is very dangerous because calling upon other than Allah for supernatural help is the essence of idolatry.<\/p>\n<p>Al-Nu’man ibn Bashir reported: The Prophet, peace and blessings be upon him, said,<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّعَاءُ هُوَ الْعِبَادَةُ<\/p>\n<p><strong>Supplication is worship itself.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ رَبُّكُمْ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ<\/p>\n<p><strong>Your Lord said: Call upon Me and I will respond to you. Verily, those who disdain My worship will enter Hell in humiliation.<\/strong> (40:60)<\/p>\n<p>Source: Sunan al-Tirmidhī 3247, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/11\/dua-essence-ibadah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّعَاءُ مُخُّ الْعِبَادَةِ<\/p>\n<p><strong>Supplication is the essence of worship.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3371, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/07\/dua-essence-of-ibadah\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَدْعُ مِن دُونِ اللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَ ۖ فَإِن فَعَلْتَ فَإِنَّكَ إِذًا مِّنَ الظَّالِمِينَ وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِن يُرِدْكَ بِخَيْرٍ فَلَا رَادَّ لِفَضْلِهِ<\/p>\n<p><strong>Do not call upon those besides Allah who cannot benefit you or harm you. If you did so, you would surely be a wrongdoer. If Allah touches you with harm, none can remove it but Him. If He intends for you good, none can repel His grace. <\/strong><\/p>\n<p>Surat Yunus 10:106-107<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ أَضَلُّ مِمَّن يَدْعُو مِن دُونِ اللَّهِ مَن لَّا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَن دُعَائِهِمْ غَافِلُونَ وَإِذَا حُشِرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ<\/p>\n<p><strong>Who is more astray than those who call upon others besides Allah, who cannot answer them until the Day of Resurrection and who are unaware of their supplications? When He gathers the people, they will be enemies to each other and they will deny their worship.<\/strong><\/p>\n<p>Surat al-Ahqaf 46:5-6<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ تَدْعُونَ مِن دُونِهِ مَا يَمْلِكُونَ مِن قِطْمِيرٍ إِن تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ ۖ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ<\/p>\n<p><strong>Those you call upon besides Him do not own even the skin of a date-stone. If you call upon them, they do not hear you, and if they did hear you, they could not answer you. On the Day of Resurrection, they will deny your idolatry.<\/strong><\/p>\n<p>Surat al-Fatir 35:14<\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا سَأَلْتَ فَاسْأَلْ اللَّهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ<\/p>\n<p><strong>If you ask, ask from Allah. If you seek help, seek help from Allah.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2516, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/29\/mindful-allah-he-will-protect-you\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالدُّعَاءُ كُلُّ ذَلِكَ مَحْضُ حَقِّ اللَّهِ لَا يَصْلُحُ وَلَا يَنْبَغِي لِسِوَاهُ مِنْ مَلَكٍ مُقَرَّبٍ وَلَا نَبِيٍّ مُرْسَلٍ<\/p>\n<p>Supplication and all those acts of worship are the exclusive right of Allah. It is not correct or befitting for anyone besides Him, neither for an angel close to Him nor a prophet sent by Him.<\/p>\n<p>Source: al-Jawāb al-Kāfī 1\/135<\/p><\/blockquote>\n<p>Supplication is equated with ‘worship’ in the Quran because it involves utmost love, fear, hope, humility, and reverence, which are all acts of the heart that should only be directed to Allah in an absolute sense. Directing these inward actions to other than Allah, even to the Prophet (ṣ) himself, contradicts the purpose for which we were created. Allah gave us hearts to be attached to Him first and foremost, not to His creation.<\/p>\n<p>Moreover, it does not matter whether this calling upon other than Allah is justified by terms like ‘seeking aid’ (<em>istighatha<\/em>) or ‘seeking intercession’ (<em>istishfa’<\/em>) or &#8216;seeking help&#8217; (<em>madad<\/em>) and so on. The judgment of a deed is based on its reality and essence, not on euphemisms. The sinfulness of ‘usury’ (<em>riba<\/em>) does not change if we call it ‘interest’ or anything else. The same is true for idolatry.<\/p>\n<p>Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ الشِّرْكِ أَنْ يَدْعُوَ الْعَبْدُ غَيْرَ اللَّهِ كَمَنْ يَسْتَغِيثُ فِي الْمَخَاوِفِ وَالْأَمْرَاضِ والفاقات بِالْأَمْوَاتِ وَالْغَائِبِينَ فَيَقُولُ يَا سَيِّدِي الشَّيْخُ فُلَانٌ لِشَيْخِ مَيِّتٍ أَوْ غَائِبٍ فَيَسْتَغِيثُ بِهِ وَيَسْتَوْصِيه وَيَطْلُبُ مِنْهُ مَا يَطْلُبُ مِنْ اللَّهِ مِنْ النَّصْرِ وَالْعَافِيَةِ فَإِنَّ هَذَا مِنْ الشِّرْكِ الَّذِي حَرَّمَهُ اللَّهُ وَرَسُولُهُ بِاتِّفَاقِ الْمُسْلِمِينَ<\/p>\n<p>Part of idolatry is for the servant to call upon other than Allah, such as one who seeks deliverance with the dead or absent in times of fear, illness, or loss. Thus, he says, ‘O my master, Shaykh so-and-so!’ to a Shaykh who is deceased or absent, seeking deliverance in him and goodness from him, requesting from him what is requested from Allah such as victory and well-being. Indeed, this is idolatry which Allah and His Messenger have forbidden by consensus of the Muslims.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 11\/663-664<\/p><\/blockquote>\n<p>The excuses provided by those who call upon the Prophet (ṣ) and deceased saints is that they are only seeking intercession or using them as a means to approach Allah. These are similar to the excuses used by the Arab idolaters to justify their idol worship.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ<\/p>\n<p><strong>Those who take protectors besides Him say, ‘We do not worship them but to bring us closer to Allah.’ Verily, Allah will judge between them in what they used to differ. Verily, Allah does not guide a liar, an unbeliever.<\/strong><\/p>\n<p>Surat al-Zumar 39:3<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِندَ اللَّهِ ۚ قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ<\/p>\n<p><strong>They worship those besides Him who cannot harm them, nor benefit them, and they say, ‘These are our intercessors with Allah.’ Say, ‘Do you inform Allah about what He does not know in the heavens and the earth?’ Glory be to Him and Exalted is He above what they associate with Him.<\/strong><\/p>\n<p>Surat Yunus 10:18<\/p><\/blockquote>\n<p>Ibn Taymiyyah commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولهذا كان من أتباع هؤلاء من يسجد للشمس والقمر والكواكب ويدعوها كما يدعو الله تعالي ويصوم لها وينسك لها ويتقرب إليها ثم يقول إن هذا ليس بشرك وإنما الشرك إذا اعتقدت أنها هي المدبرة لي فإذا جعلتها سبباً وواسطة لم أكن مشركاً ومن المعلوم بالاضطرار من دين الإسلام أن هذا شرك فهذا ونحوه من التوحيد الذي بعث الله به رسله وهم لا يدخلونه في مسمي التوحيد الذي اصطلحوا عليه<\/p>\n<p>For this reason, those who followed them prostrated to the sun, the moon, and the stars, calling upon them as they would call upon Allah Almighty, fasting for them and performing rites and acts of devotion for them. Then they would say, ‘This is not idolatry! It is only idolatry if I believe they are in control of me. If I take them as means and intermediaries, I cannot be an idolater.’ It is well-known by necessity in the religion of Islam that this is idolatry. This and the like of it is the alleged ‘monotheism’ for which Allah sent His Messengers. They were not included in the category of ‘monotheism’ in its technical sense.<\/p>\n<p>Source: Darʼ Taʻāruḍ al-ʻAql wal-Naql 1\/227-228<\/p><\/blockquote>\n<p>And Al-Razi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَنَظِيرُهُ فِي هَذَا الزَّمَانِ اشْتِغَالُ كَثِيرٍ مِنَ الْخَلْقِ بِتَعْظِيمِ قُبُورِ الْأَكَابِرِ عَلَى اعْتِقَادِ أَنَّهُمْ إِذَا عَظَّمُوا قُبُورَهُمْ فَإِنَّهُمْ يَكُونُونَ شُفَعَاءَ لَهُمْ عِنْدَ اللَّه<\/p>\n<p>The equivalent in our era is the preoccupation of many with created beings by venerating the graves of eminent ones, believing that if they venerate their graves, then they will be their intercessors with Allah.<\/p>\n<p>Source: Tafsīr al-Rāzī 17\/227<\/p><\/blockquote>\n<p>Once again, the judgment of a deed is based on its reality and essence, not on what people call it. It is not enough to believe Allah is the Almighty Creator, but one must worship Him alone according to the Sunnah of His Messenger (ṣ). No matter what convoluted theological arguments, weak narrations, or mystical experiences are used to justify calling upon other than Allah, it will never change the fact that Allah and His Messenger (ṣ) have described this act as idolatry.<\/p>\n<p>The greater intercession on the Day of Judgment is an honor given to the Prophet (ṣ) for his nation, but is only allowed for those with whom Allah is pleased. It is not the “right” of any created beings. The proper way to earn this intercession is to worship Allah alone with sincerity according to the Sunnah of His Messenger (ṣ) and to send blessings upon him and supplicate to Allah <em>for<\/em> him, not supplicate <em>to<\/em> him.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَسعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ خَالِصًا مِنْ قَلْبِهِ<\/p>\n<p><strong>The most blessed of people to have my intercession on the Day of Resurrection are those who say there is no God but Allah, sincerely from the heart<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 99, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/02\/17\/ikhlaas-shafaa-sincere-believers\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever hears the call to prayer and says, ‘O Allah, Lord of this perfect call and established prayer, give Muhammad the means of nearness and the most excellent reward, and raise him to the praiseworthy station that You have promised him,’ then my intercession will be allowed for him on the Day of Resurrection<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 614, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/24\/dua-adhan-intercession\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ruwayfah ibn Thabit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ صَلَّى عَلَى مُحَمَّدٍ وَقَالَ اللهُمَّ أَنْزِلْهُ الْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ يَوْمَ الْقِيَامَةِ وَجَبَتْ لَهُ شَفَاعَتِي<\/p>\n<p><strong>Whoever sends blessings upon Muhammad by saying, ‘O Allah, grant him the seat near You on the Day of Resurrection,’ then my intercession is ensured for him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16991, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/27\/dua-for-shafaa\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَلُوا اللَّهَ لِي الْوَسِيلَةَ فَإِنَّهُ لَمْ يَسْأَلْهَا لِي عَبْدٌ فِي الدُّنْيَا إِلَّا كُنْتُ لَهُ شَهِيدًا أَوْ شَفِيعًا يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Ask Allah to grant me the means of approach. Verily, a servant does not ask for it in the world but that I will be a witness for him or intercede for him on the Day of Resurrection.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Awsaṭ 633, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/27\/ask-for-maqam-mahmud\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Hence, the Prophet (ṣ) prescribed sincerity to Allah, worshipping Him alone, and asking <em>from<\/em> Him. He taught us to seek the greater intercession by supplicating to Allah for blessings upon him. This is the true means by which to earn his intercession, not by innovated means such as calling upon him directly or asking from him. Indeed, religious innovations only distance oneself from the mercy of Allah.<\/p>\n<p>It is our duty to warn such Muslims of the grievous errors that they commit under the pretense of these false beliefs and practices that they have been taught. However, it is not the right of any individual Muslim to declare another individual Muslim to be an unbeliever or an idolater (<em>takfir<\/em>), even if they apparently say or do things that outwardly resemble unbelief and idolatry. It is most certainly unlawful to engage in violence against anyone on this pretext.<\/p>\n<p>Abu Dharr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَرْمِي رَجُلٌ رَجُلًا بِالْفُسُوقِ وَلَا يَرْمِيهِ بِالْكُفْرِ إِلَّا ارْتَدَّتْ عَلَيْهِ إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ<\/p>\n<p><strong>A man does not accuse another man of wickedness or unbelief but that it will be turned against him, if his companion is innocent<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6045, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/excommunication-takfir-charges-backfire\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كذلك من دعا غير الله وحج إلى غير الله هو أيضًا مشرك، والذي فعله كفر لكن قد لا يكون عالمًا بأن هذا شرك محرم كما أن كثيرًا من الناس دخلوا في الإسلام من التتار وغيرهم وعندهم أصنام لهم صغار من لبد وغيره وهم يتقربون إليها ويعظمونها ولا يعلمون أن ذلك محرم فكثير من أنواع الشرك قد يخفى على بعض من دخل في الإسلام ولا يعلم أنه شرك<\/p>\n<p>Thus, whoever calls upon other than Allah, or performs pilgrimage for other than Allah, he is also an idolater who has committed unbelief, but he may not know that it is forbidden idolatry. Just as many people entered Islam among the Tartars and others while they had small idols with them made from wool or otherwise. They would perform acts of devotion to them and venerate them, but they did not know that was forbidden. So many types of idolatry are obscured from some who enter Islam and they do not know it is idolatry.<\/p>\n<p>Source: al-Ikhnā’īyah 1\/206<\/p><\/blockquote>\n<p>Mistakenly accusing a Muslim of being an unbeliever or an idolater makes the charge rebound against the accuser, a very serious threat from the Prophet (ṣ) not to indulge in this behavior lightly. There are many legitimate excuses, such as honest ignorance, that might prevent Allah from charging a misguided Muslim with heresy or idolatry on the Day of Resurrection, even if they mistakenly commit such grave sins. It is best to preach to them with wisdom and good manners and to leave the judgment of such individuals to Allah alone in the Hereafter.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ<\/p>\n<p><strong>Verily, those who have faith, the Jews, the Sabians, the Christians, the Magians, and those who commit idolatry, Allah will judge between them on the Day of Resurrection. Allah is a witness over all things.<\/strong><\/p>\n<p>Surat al-Hajj 22:17<\/p><\/blockquote>\n<p>This point should be appreciated in our times especially since many people in the Muslim world are impoverished and unable to read and research the Quran and Sunnah in Arabic for themselves, so they can only rely upon scholars (<em>taqlid<\/em>) who might be corrupt or misguided. They simply do not have access to genuine knowledge, or they are unable to differentiate the true scholars from the pretenders. May Allah guide them and all believers to the straight path.<\/p>\n<p>In sum, the deceased no longer have the ability to affect the world of the living. Calling upon them for help, asking for their supplication, or seeking their intercession are heretical innovations that have no basis in the authentic Sunnah or the understanding of the righteous predecessors. Rather, one should only call upon Allah for supernatural help as this is the essence of true worship.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;If you ask, ask from Allah. If you seek help, seek help from Allah.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[320,464,262,319,394,37,38,90,481,100,60,220,403],"class_list":["post-23683","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-abu-bakr","tag-call-to-prayer-al-adhan","tag-death-mawt","tag-funerals-janazah","tag-graves-al-qubur","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-innovation-bidah","tag-intercession-al-shafaah","tag-manners-al-adab","tag-prayer-salat","tag-supplication-al-dua","tag-unseen-al-ghayb"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-69Z","jetpack-related-posts":[{"id":24398,"url":"https:\/\/www.abuaminaelias.com\/tawassul-asking-by-the-prophet\/","url_meta":{"origin":23683,"position":0},"title":"Tawassul: Asking by the Prophet or from the Prophet?","author":"Abu Amina Elias","date":"February 21, 2025","format":false,"excerpt":"\"The difference between the two matters is agreed upon by the Muslims.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20841,"url":"https:\/\/www.abuaminaelias.com\/tawassul-prophets-saints-graves\/","url_meta":{"origin":23683,"position":1},"title":"Tawassul: Seeking help from prophets and saints?","author":"Abu Amina Elias","date":"August 28, 2019","format":false,"excerpt":"\"O you who have faith, fear Allah and seek means to approach Him.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23619,"url":"https:\/\/www.abuaminaelias.com\/grave-worship-in-islam\/","url_meta":{"origin":23683,"position":2},"title":"Prohibition of grave worship in Islam","author":"Abu Amina Elias","date":"October 19, 2021","format":false,"excerpt":"\"Do not take graves as places of prayer. I forbid you from doing so.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20099,"url":"https:\/\/www.abuaminaelias.com\/visiting-funerals-of-non-muslims\/","url_meta":{"origin":23683,"position":3},"title":"Visiting funerals of non-Muslims","author":"Abu Amina Elias","date":"January 21, 2019","format":false,"excerpt":"\"When you see a funeral procession, then stand up for it,\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15489,"url":"https:\/\/www.abuaminaelias.com\/nearest-to-allah-and-the-prophet-in-the-hereafter\/","url_meta":{"origin":23683,"position":4},"title":"Nearest to Allah and the Prophet in the Hereafter","author":"Abu Amina Elias","date":"February 17, 2014","format":false,"excerpt":"\"Shall I tell you about the most beloved to me and the closest to my assembly on the Day of Resurrection? They are those with the best character.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22747,"url":"https:\/\/www.abuaminaelias.com\/benefits-sunan-adhan\/","url_meta":{"origin":23683,"position":5},"title":"Benefits of the Sunan of Adhan, call to prayer","author":"Abu Amina Elias","date":"December 27, 2020","format":false,"excerpt":"\"I am pleased with Allah as Lord,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23683","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23683"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23683\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23683"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23683"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}