{"id":23706,"date":"2021-11-15T11:38:00","date_gmt":"2021-11-15T07:38:00","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23706"},"modified":"2021-11-16T11:47:23","modified_gmt":"2021-11-16T07:47:23","slug":"al-sawad-al-azam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","title":{"rendered":"Follow the great majority of Muslims today?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>In Islam, we must always follow the great majority of the people of truth, who first and foremost are the companions of the Messenger of Allah (ṣ), their students (<em>tabi’in<\/em>), and the students of their students (<em>tabi’ tabi’in<\/em>). These are the three best generations in Islam and they were all united upon religious truth. But some Muslims have a misconception that we should follow the greatest majority of Muslims, or those who claim to be Muslims, in any given time period. This is serious mistake.<\/p>\n<p>The origin of this misconception is the interpretation of a prophetic tradition that orders us to follow ‘the great majority’ (<em>al-sawad al-a’dham<\/em>). Several scholars considered this tradition to be weak and unreliable.<\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أُمَّتِي لَنْ تَجْتَمِعَ عَلَى ضَلاَلَةٍ فَإِذَا رَأَيْتُمُ اخْتِلاَفًا فَعَلَيْكُمْ بِالسَّوَادِ الأَعْظَمِ<\/p>\n<p><strong>Verily, my nation will not unite upon misguidance. If you see differences, you must follow the great majority.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3950<\/p><\/blockquote>\n<p>Ibn Kathir judged this narration to be weak in <em>Bidayat al-Nihayah<\/em> 19\/39 as well as Al-Albani in <em>Silsilat al-Da’ifah<\/em> 2896. Ibn al-Qaysarani said in <em>Dhakirat al-Huffaz<\/em> 1\/493 that the chain contains two weak narrators. Abu Hatim said the sub-narrator Abu Khalaf is ‘rejected’ (<em>munkar<\/em>) as recorded by Al-Mizzi in <em>Tahdhib al-Kamal<\/em> 33\/286. The narration was recorded in Ibn ‘Adi’s compilation of weak narrations known as <em>Al-Kamil fi al-Du’afa’<\/em> 8\/38. Ibn Hajar al-‘Asqalani analyzed it various chains of authority in <em>Muwafaqat al-Khubar al-Khabar<\/em> 1\/113-114 and found them all to be weak. However, Al-Arna’ut stated in his verification of <em>Siyar A&#8217;lam al-Nubala&#8217;<\/em> 12\/197 that the multiple chains strengthened each other enough to make it a credible proof, and some scholars accepted it at face-value regardless.<\/p>\n<p>Nevertheless, it is true that was should join the ‘united community’ (<em>al-jama’ah<\/em>) also known as the ‘saved group’ (<em>firqat al-najiyah<\/em>). All of these titles refer primarily to the companions and the immediate generations following them, known as the righteous predecessors (<em>al-salaf al-salih<\/em>), as well as the later scholars who emulate their beliefs and practices. The tradition does not refer to the majority of Muslims in any given era, as after the companions many heresies and religious innovations became widespread.<\/p>\n<p>Ibn Kathir commented on this narration, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ كَانَ أَهْلُ الْحَقِّ فِي الصَّدْرِ الْأَوَّلِ هُمْ أَكْثَرَ الْأُمَّةِ فَكَانَ لَا يُوجَدُ فِيهِمْ مُبْتَدِعٌ لَا فِي الْأَقْوَالِ وَلَا الْأَفْعَالِ وَفِي الْأَعْصَارِ الْمُتَأَخِّرَةِ فَقَدْ يَجْتَمِعُ الْجَمُّ الْغَفِيرُ عَلَى بِدْعَةٍ وَقَدْ يَخْلُو الْحَقُّ فِي بَعْضِ الْأَزْمَانِ الْمُتَأَخِّرَةِ عَنْ عِصَابَةٍ يَقُومُونَ بِهِ<\/p>\n<p>The people of truth in the beginning were the majority of the Ummah. One would not find innovations among them, neither in words nor deeds. In the later eras, numerous groups united upon innovation. The truth vanished in some of the later times due to the partisanship they established.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah19\/39<\/p><\/blockquote>\n<p>And Al-Barbahari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فقد بين رسول الله صلى الله عليه وسلم لأمته السنة وأوضحها لأصحابه وهم الجماعة وهم السواد الأعظم والسواد الأعظم الحق وأهله فمن خالف أصحاب رسول الله صلى الله عليه وسلم في شيء من أمر الدين فقد كفر<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, clarified the Sunnah for his nation and explained it to his companions. They are the united community. They are the great majority, and the &#8216;great majority&#8217; is the truth and its people. Whoever opposes the companions of the Messenger of Allah in any religious matters has committed unbelief.<\/p>\n<p>Source: Sharḥ al-Sunnah 1\/37<\/p><\/blockquote>\n<p>Thus, the original ‘great majority’ was the companions and the righteous predecessors, while after their time many groups of innovators appeared such as the Khawarij, the Mu’tazilah, the Qadariyyah, the Jabbariyyah, the Murji’ah, the Jahmiyyah, and the sectarian partisans of the Ash’ariyyah and Maturidiyyah, although not all of the Ash&#8217;ari or Maturidi scholars were sectarian since they took the Quran and Sunnah as their ultimate reference to the best of their knowledge. In fact, many Ash&#8217;ari and Maturidi scholars throughout history have been praised and widely accepted for their beneficial works in the service of Islam. May Allah have mercy on them.<\/p>\n<p>The promise of the Prophet (ṣ) that his nation would never unite upon misguidance refers to the upright scholars who follow his Sunnah and the way of his companions and the righteous predecessors. It does not refer to the majority of Muslims in any given time period. Heretics and innovators are not part of his Ummah in the proper sense.<\/p>\n<p>And Al-Shatibi commented on this narration, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَعْنَى قَوْلِهِ لَنْ تَجْتَمِعَ أُمَّتِي لَنْ يَجْتَمِعَ عُلَمَاءُ أُمَّتِي عَلَى ضَلَالَةٍ<\/p>\n<p>The meaning of his statement, ‘My nation will never unite upon misguidance,’ is that the scholars of my nation will never unite upon misguidance.<\/p>\n<p>Source: al-Iʻtiṣām 2\/771<\/p><\/blockquote>\n<p>And Ibn Battal commented, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقال آخرون الجماعة التى أمر رسول الله بلزومها هم جماعة الصحابة الذين قاموا بالدين بعد مضيّه صلى الله عليه وسلم<\/p>\n<p>Other scholars said the ‘united community’ which the Messenger of Allah commanded holding onto is the united community of the companions who established the religion after his passing, peace and blessings be upon him.<\/p>\n<p>Source: Sharḥ Ṣaḥīḥ al-Bukhārī li-Ibn Baṭṭāl 10\/35<\/p><\/blockquote>\n<p>This is why the true Muslims are called ‘the people of the Sunnah and the united community’ (<em>Ahl al-Sunnah wal-Jama’ah<\/em>). They are united upon the Sunnah of the Prophet (ṣ). The truth of Islam is the basis of their unity and not unity for the sake of itself. It does not mean they are the greatest in number at any given time or place, because unity upon anything other than the Sunnah is simply false and dangerous misguidance.<\/p>\n<p>It is confirmed in the authentic Sunnah that the companions and their immediate successors are the best of the Muslim nation, so the only way to protect ourselves from the deviance of various heretical sects is to strictly follow their example in beliefs and practices.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَجِيءُ مِنْ بَعْدِهِمْ قَوْمٌ تَسْبِقُ شَهَادَتُهُمْ أَيْمَانَهُمْ وَأَيْمَانُهُمْ شَهَادَتَهُمْ<\/p>\n<p><strong>The best people are those of my generation, then those who come after them, then those who come after them. Then, there will come people after them whose testimony precedes their oaths and their oaths precede their testimony<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6429, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/14\/sahabah-tabieen-salaf-salih\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet (ṣ) told us that his nation would split into seventy or more sects and only one of these groups, the ‘saved sect,’ would enter Paradise. This ‘saved sect’ are those who follow his companions and their immediate successors, the righteous predecessors.<\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِنَّ بَنِي إِسْرَائِيلَ تَفَرَّقَتْ عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلَاثٍ وَسَبْعِينَ مِلَّةً كُلُّهُمْ فِي النَّارِ إِلَّا مِلَّةً وَاحِدَةً<\/p>\n<p><strong>Verily, the children of Israel split into seventy-two sects and my nation will split into seventy-three sects; all of them are in the Hellfire except for one denomination.<\/strong><\/p><\/blockquote>\n<p>They said, “Who are they, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَنَا عَلَيْهِ وَأَصْحَابِي<\/p>\n<p><strong>Those who follow my way and my companions<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2641, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/12\/14\/seventy-three-sects-sahaba\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Al-Tirmidhi commented on one of these variant narrations, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَفْسِيرُ الْجَمَاعَةِ عِنْدَ أَهْلِ الْعِلْمِ هُمْ أَهْلُ الْفِقْهِ وَالْعِلْمِ وَالْحَدِيثِ<\/p>\n<p>The meaning of the ‘united community’ according to the scholars are the people of jurisprudence (<em>fiqh<\/em>), knowledge, and prophetic traditions (<em>hadith<\/em>).<\/p>\n<p>Source: Sunan al-Tirmidhī 2167<\/p><\/blockquote>\n<p>The great Imams of Fiqh are Abu Hanifa, Malik ibn Anas, Al-Shafi’i, Ahmad ibn Hanbal, and their students. The great Imams of Hadith are Al-Bukhari, Muslim, Al-Tirmidhi, Abu Dawud, Al-Nasa’i, Ibn Majah, and others. These eminent scholars are the link between ourselves, the companions, and the righteous predecessors.<\/p>\n<p>As can be seen from the predication of the Prophet (ṣ), the group of Muslims upon the truth will indeed be outnumbered by the many sects that became prevalent after the time of the righteous predecessors and new sects that have continued to emerge until today. The only Muslims worthy of the title ‘the united community’ or ‘the great majority’ or ‘the saved sect’ are those who follow the original united community, even if they are alone in doing so.<\/p>\n<p>Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ جُمْهُورَ الْجَمَاعَةِ هِيَ الَّتِي تُفَارِقُ الْجَمَاعَةَ إِنَّمَا الْجَمَاعَةُ مَا وَافَقَ طَاعَةَ اللَّهِ وَإِنْ كُنْتَ وَحْدَكَ<\/p>\n<p>Verily, the majority of groups have left the united community. The united community is only the one that conforms to the obedience of Allah, even if you are by yourself.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/11\/14\/ibn-masud-jamaah-alone\/\">Sharḥ Uṣūl I’tiqād Ahl al-Sunnah wal-Jamā’ah 160<\/a><\/p><\/blockquote>\n<p>Ibn al-Qayyim commented on this narration, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ الْإِجْمَاعَ وَالْحُجَّةَ وَالسَّوَادَ الْأَعْظَمَ هُوَ الْعَالِمُ صَاحِبُ الْحَقِّ وَإِنْ كَانَ وَحْدَهُ وَإِنْ خَالَفَهُ أَهْلُ الْأَرْضِ<\/p>\n<p>Know that the consensus, the proof, and the ‘great majority’ is one who knows the people of truth, even if he is alone and even if the people of the earth oppose him.<\/p>\n<p>Source: I&#8217;lām al-Muwaqqi&#8217;īn 4\/397<\/p><\/blockquote>\n<p>And Ishaq ibn Rawhuway said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ سَأَلْتَ الْجُهَّالَ مَنِ السَّوَادُ الْأَعْظَمُ قَالُوا جَمَاعَةُ النَّاسِ وَلَا يَعْلَمُونَ أَنَّ الْجَمَاعَةَ عَالِمٌ مُتَمَسِّكٌ بِأَثَرِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَطَرِيقِهِ فَمَنْ كَانَ مَعَهُ وَتَبِعَهُ فَهُوَ الْجَمَاعَةُ وَمَنْ خَالَفَهُ فِيهِ تَرَكَ الْجَمَاعَةُ<\/p>\n<p>If some of the ignorant ask, ‘Who are the great majority?’ They will say, ‘The large group of people.’ They do not know that the ‘united community’ is a scholar who holds onto the reports from the Prophet, peace and blessings be upon him, and his path. Whoever is with him and follows him is the ‘united community’ and whoever opposes him has left the united community.<\/p>\n<p>Source: Ḥilyat al-Awliyā’ 9\/238<\/p><\/blockquote>\n<p>Let it be known that the truth is made clear by the texts of the Quran and Sunnah and not by personalities or sectarian affiliations. The Messenger of Allah (ṣ) is the only one who does not err in his actions or statements about the religion. One must study the truth from these sources to learn who follows it and not to judge the truth on the basis of blindly following (<em>taqlid<\/em>) charismatic personalities.<\/p>\n<p>Ali, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْحَقَّ والباطل لا يُعْرَفان بأقدار الرِّجَالِ اعْرِفِ الْحَقَّ تَعْرِفْ أَهْلَهُ واعْرِفِ الباطل تَعْرِفْ من أتاه<\/p>\n<p>Verily, the truth and falsehood are not recognized by the measure of men. Know the truth and you will recognize its people. Know falsehood and you will recognize one who brings it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/11\/14\/ali-know-truth\/\">Ansāb al-Ashrāf 358<\/a><\/p><\/blockquote>\n<p>The good news is that at least some Muslims will always be united upon the Sunnah and the way of the companions and righteous predecessors. They will call people to Islam (<em>da’wah<\/em>) according to their methodology and they will be well-known among the strands of Islam, even if they are a minority and are scorned by the majority of Muslims.<\/p>\n<p>Abu Umamah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الدِّينِ ظَاهِرِينَ لَعَدُوِّهِمْ قَاهِرِينَ لَا يَضُرُّهُمْ مَنْ خَالَفَهُمْ إِلَّا مَا أَصَابَهُمْ مِنْ لَأْوَاءَ حَتَّى يَأْتِيَهُمْ أَمْرُ اللهِ وَهُمْ كَذَلِكَ<\/p>\n<p><strong>A group of my nation will continue to be victorious upon the religion, overpowering their enemies. None who oppose them will harm them, except what afflicts them of difficult circumstances, until Allah brings his command while they are like so.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22320, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/22\/group-muslims-always-victorious\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Our imperative, then, is to find this rightly-guided group who calls to the Quran, the Sunnah, and the way of the righteous predecessors, and to abandon all the other groups who call to various heresies and innovations in the religion.<\/p>\n<p>In sum, the ‘great majority’ whom we are commanded to follow are the companions, the righteous predecessors, and the later scholars who strictly followed them, even if they are not the majority of people in a given era. Even if there is only one scholar or one Muslim who follows their way, they are the true ‘united community’ regardless of their numbers.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The united community is only the one that conforms to the obedience of Allah,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[441,21,342,184,135,32,38,39,41,43,90,50,55,444,134,91],"class_list":["post-23706","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-companions-al-sahabah","tag-creed-aqidah","tag-al-fiqh","tag-guidance-al-hidaya","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-innovation-bidah","tag-knowledge","tag-methodology-al-minhaj","tag-misconceptions","tag-paradise-jannah","tag-righteous-predecessors-al-salaf-al-salih"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6am","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":23706,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":23706,"position":1},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":23706,"position":2},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25318,"url":"https:\/\/www.abuaminaelias.com\/manhaj-of-the-salaf\/","url_meta":{"origin":23706,"position":3},"title":"Following the Way of the Salaf","author":"Abu Amina Elias","date":"May 30, 2025","format":false,"excerpt":"\"The best people are those of my generation, then those who come after them...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15796,"url":"https:\/\/www.abuaminaelias.com\/whoever-changes-religion-kill-him\/","url_meta":{"origin":23706,"position":4},"title":"Apostasy: Whoever changes his religion, kill him?","author":"Abu Amina Elias","date":"June 19, 2014","format":false,"excerpt":"\"The most hesitant of people in killing are the people of faith.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":23706,"position":5},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23706","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23706"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23706\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23706"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23706"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23706"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}