{"id":23718,"date":"2021-11-17T11:05:57","date_gmt":"2021-11-17T07:05:57","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23718"},"modified":"2021-11-17T13:52:46","modified_gmt":"2021-11-17T09:52:46","slug":"tabarruk-bil-saliheen","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/tabarruk-bil-saliheen\/","title":{"rendered":"Seeking blessings from relics of the righteous?"},"content":{"rendered":"<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It is a common practice, especially in Sufi orders, to seek blessings (<em>tabarruk<\/em>) from the relics (<em>athar<\/em>) of their ‘saints’ (<em>awliya’<\/em>) such as their clothing, their hair, or their ablution. However, there is no proof in the Quran, the Sunnah, or the actions of the companions and righteous predecessors for seeking blessings from relics other than those of the Prophet (ṣ) himself. Rather, seeking blessings from the relics of anyone else is a blameworthy innovated practice and it has opened the door to much exaggeration around the status of saints and pious scholars.<\/p>\n<p>It is true that the Prophet (ṣ) performed miracles, by the permission of Allah, and part of his miracles were that the traces of his body, clothing, hair, and so on were blessed. The companions would collect these relics because there was indeed blessings contained within them.<\/p>\n<p>Abdullah ibn Mas’ud reported: We were on a journey with the Messenger of Allah, peace and blessings be upon him, and we ran short of water. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اطْلُبُوا فَضْلَةً مِنْ مَاءٍ<\/p>\n<p><strong>Bring the remaining water.<\/strong><\/p><\/blockquote>\n<p>They brought a vessel with a little water in it. The Prophet placed his hands in the vessel, then he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حَيَّ عَلَى الطَّهُورِ الْمُبَارَكِ وَالْبَرَكَةُ مِنْ اللَّهِ<\/p>\n<p><strong>Come to the blessed purification, a blessing from Allah<\/strong>.<\/p><\/blockquote>\n<p>Ibn Mas’ud said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَقَدْ رَأَيْتُ الْمَاءَ يَنْبُعُ مِنْ بَيْنِ أَصَابِعِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَقَدْ كُنَّا نَسْمَعُ تَسْبِيحَ الطَّعَامِ وَهُوَ يُؤْكَلُ<\/p>\n<p>I saw the water emanating from between the Prophet’s fingers, and we heard his food glorifying Allah as he ate it.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3579, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/02\/11\/prophet-performs-miracles\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The water that was touched by the Prophet (ṣ), for example, was miraculously multiplied and so the companions would collect it and seek blessings from it. Nevertheless, this act of seeking blessings from relics only applies to the Prophet (ṣ) and nobody else after him.<\/p>\n<p>Shaykh Ibn Uthaymeen writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أما غيره صلى الله عليه وسلم فإنه لا يتبرك بشيء من هذا منه فلا يتبرك بثياب الإنسان ولا بشعره ولا بأظفاره ولا بشيء من متعلقاته إلا النبي صلى الله عليه<\/p>\n<p>As for other than the Prophet, peace and blessings be upon him, then blessings are not sought from any of these. They are not sought by the clothes of human beings, nor their hair, nor their fingernails, nor anything else related to that except the Prophet.<\/p>\n<p>Source: Sharḥ Riyāḍ al-Ṣāliḥīn 4\/243<\/p><\/blockquote>\n<p>The proof that these miraculous relics were only left behind by the Prophet (ṣ) is that the companions never sought blessings from the relics of each other, even though Abu Bakr, Umar, Uthman, Ali, and the rest of the ten promised Paradise were the best of this Ummah.<\/p>\n<p>Abdur Rahman ibn ‘Awf reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبُو بَكْرٍ فِي الْجَنَّةِ وَعُمَرُ فِي الْجَنَّةِ وَعُثْمَانُ فِي الْجَنَّةِ وَعَلِيٌّ فِي الْجَنَّةِ وَطَلْحَةُ فِي الْجَنَّةِ وَالزُّبَيْرُ فِي الْجَنَّةِ وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فِي الْجَنَّةِ وَسَعْدٌ فِي الْجَنَّةِ وَسَعِيدٌ فِي الْجَنَّةِ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ فِي الْجَنَّةِ<\/p>\n<p><strong>Abu Bakr is in Paradise. Umar is in Paradise. Uthman is in Paradise. Ali is in Paradise. Talhah is in Paradise. Al-Zubayr is in Paradise. Abdur Rahman ibn ‘Awf is in Paradise. Sa’d is in Paradise. Sa’id is in Paradise. Abu ‘Ubaydah ibn al-Jarrah is in Paradise<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 3747, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/06\/ten-sahabah-promised-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ali ibn Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِخَيْرِ هَذِهِ الْأُمَّةِ بَعْدَ نَبِيِّهَا أَبُو بَكْرٍ أَلَا أُخْبِرُكُمْ بِخَيْرِ هَذِهِ الْأُمَّةِ بَعْدَ أَبِي بَكْرٍ عُمَرُ<\/p>\n<p>Shall I not tell you about the best of this nation after its Prophet? It is Abu Bakr. Shall I not tell you about the best of this nation after Abu Bakr? It is Umar.<\/p>\n<p>Source: Musnad Aḥmad 833, Grade <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/06\/ali-best-ummah-abu-bakr-umar\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Hence, despite their status as the greatest companions of the Ummah, they never sought blessings from the relics of one another, nor did they allow others to do so.<\/p>\n<p>Several scholars did allow seeking blessings from the relics of the righteous, but they came to this ruling by making an analogy between the Prophet (ṣ) and the pious saints. This analogy does not hold up because the Prophet (ṣ) was blessed unlike anyone else. The companions understood this and so they did not seek blessings from the relics of each other.<\/p>\n<p>Shaykh Ahmad Hutaybah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أما التبرك بآثار غير النبي صلى الله عليه وسلم فلا يجوز لأنه قياس مع الفارق فلا أحد يساويه صلى الله عليه وسلم والصحابة الذين يتبركون به صلى الله عليه وسلم وبآثاره لم يكونوا يتبركون بأثر أحد بعده ولو جاز ذلك لفعلوه لكنهم لم يفعلوا ذلك وإنما اكتفوا بما كان عندهم عن النبي صلى الله عليه وسلم فلم يقل أحد منهم تبرك بأثر أبي بكر وهو أفضل الأمة بعد النبي صلى الله عليه وسلم ولا بأثر عمر ولا بأثر عثمان ولا علي رضي الله تبارك وتعالى عنهم<\/p>\n<p>As for seeking blessings from other than the Prophet, peace and blessings be upon him, then it is not permissible because the analogy is not comparable. No one is equal to the Prophet and the companions who sought blessings from his relics did not seek blessings with the relics of anyone else after him. If it were permissible, the would have done so but they did not do that. Indeed, they were sufficed by what they had from the Prophet and none of them ever said to seek blessings from the relics of Abu Bakr, although he is the best of the Ummah after the Prophet, nor with the relics of Umar, nor Uthman, nor Ali.<\/p>\n<p>Source: Fatḥ al-Majīd Sharḥ Kitāb al-Tawḥīd 10\/6<\/p><\/blockquote>\n<p>Many of the companions and righteous predecessors were even reluctant for people to ask for their supplications, even though it is definitely permissible, for fear that it might lead to exaggeration of their status. They were, in fact, incredibly humble during their lives even though we know today how virtuous and praiseworthy they are in reality.<\/p>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكان كثيرٌ منَ السلفِ يَكرهُ أن يُطلَبَ منهُ الدُّعاءُ ويقولُ لمن يسألهُ الدُّعاء أَمِنِّي أنا ومِمَّنْ رُويَ عنهُ ذلك عمرُ بنُ الخطابِ وحذيفةُ بن اليمان رضي الله عنهما وكذلك مالكُ بنُ دينارٍ وكان النخعي يَكرهُ أن يُسألَ الدُّعاء<\/p>\n<p>Many of the righteous predecessors disliked to be asked for their supplication. They would say to one who asked for their supplication, ‘From me?’ That was narrated about Umar ibn al-Khattab and Hudhayfah ibn al-Yaman, may Allah be pleased with them. Likewise from Malik ibn Dinar. Al-Nakha’i used to dislike being asked for his supplication.<\/p>\n<p>Source: Sharḥ al-Ḥadīth Mā Dhi&#8217;bān Jā&#8217;i&#8217;ān 1\/88<\/p><\/blockquote>\n<p>Since they were reluctant even for people to ask for their supplications, they were surely even more opposed to people seeking blessings from their relics. For this reason, one cannot find a single authentic narration that they ever allowed anyone to seek blessings from their relics.<\/p>\n<p>Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقد كان عمر وغيره من الصحابة والتابعين رضي الله عنهم يكرهون أن يطلب الدعاء منهم ويقولون أأنبياء نحن فدل على أن هذه المنزلة لا تنبغي إلا للأنبياء عليهم السلام وكذلك التبرك بالآثار فإنما كان يفعله الصحابة رضي الله عنهم مع النبي صلى الله عليه وسلم ولم يكونوا يفعلونه مع بعضهم ببعض ولا يفعله التابعون مع الصحابة مع علو قدرهم فدل على أن هذا لا يفعل إلا مع النبي صلى الله عليه وسلم مثل التبرك بوضوئه وفضلاته وشعره وشرب فضل شرابه وطعامه<\/p>\n<p>Umar and others among the companions and successors, may Allah be pleased with them, disliked to be asked for their supplication. They would say, ‘Are we prophets?’ This is evidence that this position is only appropriate for the Prophets, upon them be peace. Likewise, seeking blessings from their relics. Indeed, the companions only did that with the Prophet and they did not do it with each other, nor did the successors do so with the companions despite their high status. This is evidence that it is not to be done except with the Prophet such as seeking blessings from his ablution, his remaining water, his hair, by drinking his left over drinks, or by his food.<\/p>\n<p>Source: al-Ḥikam al-Jadīrah bil-Idhā‘ah 1\/46<\/p><\/blockquote>\n<p>According to Imam al-Shatibi, the total lack of evidence in regards to the companions seeking blessings from relics other than the Prophet (ṣ) indicates that this matter was a complete consensus among them.<\/p>\n<p>Al-Shatibi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ الصَّحَابَةَ رَضِيَ اللَّهُ عَنْهُمْ بَعْدَ مَوْتِهِ عَلَيْهِ السَّلَامُ لَمْ يَقَعْ مِنْ أَحَدٍ مِنْهُمْ شَيْءٌ مِنْ ذَلِكَ بِالنِّسْبَةِ إِلَى مَنْ خَلَّفَهُ إِذْ لَمْ يَتْرُكِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَهُ فِي الْأُمَّةِ أَفْضَلَ مِنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ فَهُوَ كَانَ خَلِيفَتَهُ وَلَمْ يُفْعَلْ بِهِ شَيْءٌ مِنْ ذَلِكَ وَلَا عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا وَهُوَ كَانَ فِي الْأُمَّةِ بَعْدَهُ ثُمَّ كَذَلِكَ عُثْمَانُ ثُمَّ عَلِيٌّ ثُمَّ سَائِرُ الصَّحَابَةِ الَّذِينَ لَا أَحَدَ أَفْضَلَ مِنْهُمْ فِي الْأُمَّةِ ثُمَّ لَمْ يَثْبُتْ لِوَاحِدٍ مِنْهُمْ مَنْ طَرِيقٍ صَحِيحٍ مَعْرُوفٍ أَنَّ مُتَبَرِّكًا تَبَرَّكَ بِهِ عَلَى أَحَدٍ تِلْكَ الْوُجُوهِ أَوْ نَحْوِهَا بَلِ اقْتَصَرُوا فِيهِمْ عَلَى الِاقْتِدَاءِ بِالْأَفْعَالِ وَالْأَقْوَالِ وَالسِّيَرِ الَّتِي اتَّبَعُوا فِيهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ إِذًا إِجْمَاعٌ مِنْهُمْ عَلَى تَرْكِ تِلْكَ الْأَشْيَاءِ كُلِّهَا<\/p>\n<p>The companions, may Allah be pleased with them, after the death of the Prophet, upon him be peace, none of that occurred among them in regards to those who succeeded him. As the Prophet left no one behind in the Ummah better than Abu Bakr and he was the Caliph. None of that was done with him, nor with Umar who was the best of the Ummah after him, then likewise with Uthman, then Ali, then the rest of the companions for whom there was none better than them in the Ummah. Thus, it is not confirmed by any authentic, well-known route of transmission that they sought blessings from anyone in this manner. Rather, they restricted themselves to the example, deeds, statements, and way of life followed by the Prophet. It is a consensus among them that they left all of these things.<\/p>\n<p>Source: al-Iʻtiṣām 1\/482<\/p><\/blockquote>\n<p>There is an isolated narration that claims Imam al-Shafi’i sought blessings from one of the relics of Imam Ahmad, but this narration is weak and unreliable. Neither is it a legal proof since the basis of divine law is evidence from the Quran and Sunnah.<\/p>\n<p>Shaykh Hasan Abdul Ghaffar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال المانعون هذه القصة لا تثبت عن الشافعي بحال من الأحوال؛ لأن إسنادها مظلم<\/p>\n<p>Those who prohibit seeking blessings from relics say this story is not confirmed from Al-Shafi’i under any circumstances because its chain of narrators is tainted.<\/p>\n<p>Source: Sharḥ Kitāb al-Durr al-Naḍīd 6\/7<\/p><\/blockquote>\n<p>In addition to the innovated nature of seeking out relics from pious people, it facilitates exaggeration (<em>ghuluw<\/em>) even to the point of potential idolatry, especially if supernatural powers only befitting to Allah are ascribed to fallible human beings.<\/p>\n<p>Shaykh Bin Baz writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يجوز التبرك بأحد غير النبي صلى الله عليه وسلم لا بوضوئه ولا بشعره ولا بعرقه ولا بشيء من جسده بل هذا كله خاص بالنبي صلى الله عليه وسلم لما جعل الله في جسده وما مسه من الخير والبركة ولهذا لم يتبرك الصحابة رضي الله عنهم بأحد منهم لا في حياته ولا بعد وفاته صلى الله عليه وسلم لا مع الخلفاء الراشدين ولا مع غيرهم فدل ذلك على أنهم قد عرفوا أن ذلك خاص بالنبي صلى الله عليه وسلم دون غيره ولأن ذلك وسيلة إلى الشرك وعبادة غير الله سبحانه<\/p>\n<p>It is not permissible to seek blessings from anyone besides the Prophet, peace and blessings be upon him. Not from their ablution, nor their hair, nor their sweat, nor anything from their bodies. Rather, all of that was specific to the Prophet as Allah made goodness and blessings from his body or whatever he touched. For this reason, the companions, may Allah be pleased with him, did not seek blessings from anyone amongst them, not during their lives or after the death of the Prophet, not with the rightly-guided Caliphs or anyone else besides them. This indicates that they knew it was specific to the Prophet to the exclusion of anyone else and because it is a means leading to idolatry and the worship of other than Allah Almighty.<\/p>\n<p>Source: Majmūʻ Fatāwá wa Maqālāt Mutanawwiʻah 7\/65<\/p><\/blockquote>\n<p>Since many great scholars like Al-Nawawi and Ibn Hajar did allow seeking blessings from the relics of the righteous, we cannot say that it is idolatry in itself. Rather, it is a mistake and we ask to Allah reward them for their striving in knowledge (<em>ijtahid<\/em>) despite this error. But it is still an innovation, since the companions never allowed it, and there is no such thing as a “good” innovation in Islam. Every innovation is misguidance and every misguidance is in the Hellfire.<\/p>\n<p>The lay Muslims who follow this mistaken opinion have expanded it beyond its original scope and have committed great exaggerations in the religion, which is why scholars have strictly prohibited it.<\/p>\n<p>Shaykh Hasan Abdul Ghaffar writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فقالوا والتبرك بذوات الصالحين وسيلة للغلو فيهم ومعلوم بينا أن أول شرك حدث في البشرية كان بسبب الغلو في الصالحين وذلك عندما غلا قوم نوح عليه السلام في ودٍ وسواع ويغوث ويعوق ونسراً وقالوا هؤلاء رجال صالحون فلا بد أن نجعل لهم تماثيل حتى نتذكرهم ونقتدي بأفعالهم وعبادتهم وصلاحهم وورعهم ثم تدرج الغلو حتى اعتقدوا فيهم ما لا يعتقد إلا في الله ثم عبدوهم من دون الله جل وعلا<\/p>\n<p>They said seeking blessings with the righteous is a means of exaggeration with them and we have clarified that the first to contrive idolatry among humankind was due to exaggeration with the righteous, such as when the people of Noah, upon him be peace, exaggerated with Wad, Suwa’, Yaghuth, Ya’uq, and Nasra. They said these were righteous men and we must make statues of them to remember them and follow them in their deeds, worship, righteousness, and devotion. Then, the exaggeration grew gradually until they believed about them what should only be believed about Allah, then they worshipped them besides Allah Almighty.<\/p>\n<p>Source: Sharḥ Kitāb al-Durr al-Naḍīd 6\/6<\/p><\/blockquote>\n<p>The idols of the people of Noah (ṣ) were originally righteous men, so their people built statues to honor and remember them, but Satan slowly encouraged their exaggeration of them until later generations worshipped them as idols. This is why exaggeration in religion is extremely dangerous, it is a slippery slope, and it must be stopped at its source according to the sound legal principle of ‘blocking the means to sin’ (<em>sadd al-dhara’i’<\/em>).<\/p>\n<p>In addition, every innovation, no matter how small or apparently good, replaces an authentic Sunnah like it, because innovation (<em>bid’ah<\/em>) is the opposite of the Sunnah.<\/p>\n<p>Ghudayf ibn al-Harith reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَحْدَثَ قَوْمٌ بِدْعَةً إِلَّا رُفِعَ مِثْلُهَا مِنْ السُّنَّةِ<\/p>\n<p><strong>People do not contrive an innovation in religion but that it removes a Sunnah like it.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16970, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/12\/05\/bidah-replaces-sunnah\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Hence, you will see Muslims relying upon the relics of the righteous instead of seeking blessings and nearness to Allah by the confirmed acts of worship like prayer, charity, remembrance, and reciting the Quran. Whenever they busy themselves with these false relics, they are neglecting what will actually bring them closer to Allah.<\/p>\n<p>Furthermore, since seeking blessings from the relics of the righteous is an innovation in the religion, even though it may appear small or good, small innovations eventually lead to even greater and worse innovations.<\/p>\n<p>Al-Barbahari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">واحذر صغار المحدثات من الأمور فإن صغير البدع يعود حتى يصير كبيرا وكذلك كل بدعة أحدثت في هذه الأمة كان أولها صغيرا يشبه الحق فاغتر بذلك من دخل فيها ثم لم يستطع الخروج منها فعظمت وصارت دينا يدان به فخالف الصراط المستقيم فخرج من الإسلام<\/p>\n<p>Beware of small newly-invented matters, for the small innovations add up until they become great. Likewise, every contrived innovation in this Ummah began first as something small resembling the truth and was considered so by those who accepted it. Then, they were unable to come out of it and it grew larger and became another religion that was practiced. They opposed the straight path and thus exited Islam.<\/p>\n<p>Source: Sharḥ al-Sunnah 1\/37-38<\/p><\/blockquote>\n<p>This is precisely what has happened with the practice of seeking blessings from the relics of the righteous. Today, you will find many impostors who claim exaggerated titles for themselves and pretend to be the pious saints and allies of Allah. It is a sign of the heretical innovators, then, that one of them observes others seeking blessings from his relics and he is pleased with that and does not prohibit them, unlike the great humility shown by Abu Bakr, Umar, and the best of the companions of this Ummah.<\/p>\n<p>In sum, seeking blessings (<em>tabarruk<\/em>) from the relics (<em>athar<\/em>) of the righteous is an innovation in Islam. It was only applicable to the Prophet (ṣ) himself because of the miracles Allah bestowed upon him. The best of the companions never sought blessings from the relics of each other, nor did they allow others to do so, and the odd narrations about some Imams doing so are not authentic.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;People do not contrive an innovation in religion but that it removes a Sunnah like it.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[160,320,12,324,420,441,498,184,135,39,41,90,408,134,196,395,91,73,328,393],"class_list":["post-23718","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-ablution-wudu","tag-abu-bakr","tag-ali-ibn-abi-talib","tag-blessings-al-barakah","tag-caliphs-al-khulafa","tag-companions-al-sahabah","tag-food-al-taam","tag-guidance-al-hidaya","tag-hellfire-jahannam","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-innovation-bidah","tag-miracles-al-mujizah","tag-paradise-jannah","tag-prophetic-virtues","tag-prophets-al-anbiya","tag-righteous-predecessors-al-salaf-al-salih","tag-umar-ibn-al-khattab","tag-uthman-ibn-affan","tag-warning-al-nadhr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6ay","jetpack-related-posts":[{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":23718,"position":0},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":23718,"position":1},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":23718,"position":2},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23179,"url":"https:\/\/www.abuaminaelias.com\/eid-dua-taqabbal-allahu-minna-wa-minkum\/","url_meta":{"origin":23718,"position":3},"title":"Eid Supplication: May Allah accept from us and from you","author":"Abu Amina Elias","date":"May 11, 2021","format":false,"excerpt":"\"May Allah accept good deeds from us and from you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23589,"url":"https:\/\/www.abuaminaelias.com\/zaad-al-maad-wudu\/","url_meta":{"origin":23718,"position":4},"title":"Provisions for the Hereafter: Ablution","author":"Abu Amina Elias","date":"September 26, 2021","format":false,"excerpt":"\"He would perform ablution for every prayer most of the time,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21566,"url":"https:\/\/www.abuaminaelias.com\/triple-talaq-nikah-halala\/","url_meta":{"origin":23718,"position":5},"title":"Triple Talaq and Nikah Halala are major sins","author":"Abu Amina Elias","date":"January 7, 2020","format":false,"excerpt":"\"They used to severely punish whoever divorced his wife three times in one sitting.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23718","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23718"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23718\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23718"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23718"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23718"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}