{"id":23842,"date":"2023-03-16T18:43:53","date_gmt":"2023-03-16T14:43:53","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=23842"},"modified":"2025-03-19T11:06:40","modified_gmt":"2025-03-19T07:06:40","slug":"al-mundhiri-positions-of-power","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/al-mundhiri-positions-of-power\/","title":{"rendered":"Imam al-Mundhiri on Seeking Positions of Power"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Imam al-Mundhiri recorded the chapter in his book Inspiring Hope and Inciting Fear:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الترهيب من تولي السلطنة والقضاء والإمارة<\/p>\n<p>Warning against seeking authority, a position as judge, or leadership.<\/p>\n<p>Source: al-Targhīb wal-Tarhīb 3\/154<\/p><\/blockquote>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ فَالْإِمَامُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهُوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهُوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ وَالْمَرْأَةُ رَاعِيَةٌ عَلَى أَهْلِ بَيْتِ زَوْجِهَا وَوَلَدِهِ وَهِيَ مَسْئُولَةٌ عَنْهُمْ وَعَبْدُ الرَّجُلِ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مَسْئُولٌ عَنْهُ أَلَا فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ<\/p>\n<p><strong>Every one of you is a shepherd and is responsible for his flock. The leader of people is a guardian and is responsible for his subjects. A man is the guardian of his family and he is responsible for them. A woman is the guardian of her husband’s home and his children and she is responsible for them. The servant of a man is a guardian of the property of his master and he is responsible for it. No doubt, every one of you is a shepherd and is responsible for his flock.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7138, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/07\/03\/shepherd-flock\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللهَ سَائِلٌ كُلَّ رَاعٍ عَمَّا اسْتَرْعَاهُ أَحَفِظَ ذَلِكَ أَمْ ضَيَّعَ حَتَّى يُسْأَلَ الرَّجُلُ عَلَى أَهْلِ بَيْتِهِ<\/p>\n<p><strong>Verily, every caretaker will be asked about those under his care. Did he preserve that or squander it? Even a man will be asked about the people of his household.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Nasā’ī 9129, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/03\/16\/allah-asks\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ<\/p>\n<p><strong>Whoever accepts an appointment as a judge, it is as if he has been slaughtered without a knife<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 3571, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/10\/tremendous-responsibility-judges\/\">Qawi<\/a><\/em><\/p><\/blockquote>\n<p>Buraydah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْقُضَاةُ ثَلَاثَةٌ قَاضِيَانِ فِي النَّارِ وَقَاضٍ فِي الْجَنَّةِ رَجُلٌ قَضَى بِغَيْرِ الْحَقِّ فَعَلِمَ ذَاكَ فَذَاكَ فِي النَّارِ وَقَاضٍ لَا يَعْلَمُ فَأَهْلَكَ حُقُوقَ النَّاسِ فَهُوَ فِي النَّارِ وَقَاضٍ قَضَى بِالْحَقِّ فَذَلِكَ فِي الْجَنَّةِ<\/p>\n<p><strong>The judges are three kinds: two judges are in Hellfire and one judge is in Paradise. A man who judges without the truth while he knows it, he is in Hellfire. A judge who has no knowledge and violates the rights of people, he is in Hellfire. A judge who judges with the truth, he is in Paradise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1322, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/01\/24\/three-types-qadi\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Awf ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ شِئْتُمْ أَنْبَأْتُكُمْ عَنِ الْإِمَارَةِ وَمَا هِيَ أَوَّلُهَا مَلَامَةٌ وَثَانِيهَا نَدَامَةٌ وثَالِثُهَا عَذَابٌ يَوْمَ الْقِيَامَةِ إِلَّا مَنْ عَدَلَ<\/p>\n<p><strong>If you wish, shall I not tell you what is leadership? The first of it is blameworthy, the second of it is regret, and the third of it is punishment, unless he is just.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 18\/71, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/03\/16\/stages-of-leading\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Umamah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ رَجُلٍ يَلِي أَمْرَ عَشَرَةٍ فَمَا فَوْقَ ذَلِكَ إِلَّا أَتَى اللهَ مَغْلُولًا يَوْمَ الْقِيَامَةِ يَدُهُ إِلَى عُنُقِهِ فَكَّهُ بِرُّهُ أَوْ أَوْبَقَهُ إِثْمُهُ أَوَّلُهَا مَلَامَةٌ وَأَوْسَطُهَا نَدَامَةٌ وَآخِرُهَا خِزْيٌ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>No man is given authority over ten people or more but that he will come to Allah on the Day of Resurrection with his hands in shackles up to his neck. His freedom is his righteousness, or his imprisonment is his sin. The first of it is blame, the middle of it is regret, and the last of it is disgrace on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22300, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/06\/18\/sinful-leaders-in-chains\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Dharr reported: I said, “O Messenger of Allah, will you not appoint me as a leader?” The Prophet, peace and blessings be upon him, struck my chest with his hand, then he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَبَا ذَرٍّ إِنَّكَ ضَعِيفٌ وَإِنَّهَا أَمَانَةُ وَإِنَّهَا يَوْمَ الْقِيَامَةِ خِزْيٌ وَنَدَامَةٌ إِلَّا مَنْ أَخَذَهَا بِحَقِّهَا وَأَدَّى الَّذِي عَلَيْهِ فِيهَا<\/p>\n<p><strong>O Abu Dharr, you are weak and it is a position of public trust. Verily, on the Day of Resurrection it will only result in regret, except for one who takes it by right and fulfills its duties.<\/strong><\/p><\/blockquote>\n<p>And the Prophet (s) said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لَا تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلَا تَوَلَّيَنَّ مَالَ يَتِيمٍ<\/p>\n<p><strong>I love for you what I love for myself. Do not command even two people, and do not manage the property of an orphan<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1825, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/04\/imam-sultan-amanah-trust\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّكُمْ سَتَحْرِصُونَ عَلَى الإِمَارَةِ وَسَتَكُونُ نَدَامَةً يَوْمَ القِيَامَةِ فَنِعْمَ المُرْضِعَةُ وَبِئْسَتِ الفَاطِمَةُ<\/p>\n<p><strong>Verily, you will crave leadership and it will be a source of regret on the Day of Resurrection. How nice is the wet nurse, yet how evil is the weaning!<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7148, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/10\/25\/regret-craving-leadership\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessing be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيْلٌ لِلْأُمَرَاءِ وَيْلٌ لِلْعُرَفَاءِ وَيْلٌ لِلْأُمَنَاءِ لَيَتَمَنَّيَنَّ أَقْوَامٌ يَوْمَ الْقِيَامَةِ أَنَّ ذَوَائِبَهُمْ كَانَتْ مُعَلَّقَةً بِالثُّرَيَّا يَتَذَبْذَبُونَ بَيْنَ السَّمَاءِ وَالْأَرْضِ وَلَمْ يَكُونُوا عَمِلُوا عَلَى شَيْءٍ<\/p>\n<p><strong>Woe to the rulers! Woe to the chiefs! Woe to the trustees! On the Day of Resurrection, some people will wish that their hair was hanging from the sky and swinging between heaven and earth, rather than had done anything they did<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 8627, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/11\/23\/rulers-woe-regret-everything\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيْلٌ لِلْأُمَرَاءِ وَيْلٌ لِلْعُرَفَاءِ وَيْلٌ لِلْأُمَنَاءِ لَيَتَمَنَّيَنَّ أَقْوَامٌ يَوْمَ الْقِيَامَةِ أَنَّ ذَوَائِبَهُمْ كَانَتْ مُعَلَّقَةً بِالثُّرَيَّا يَتَذَبْذَبُونَ بَيْنَ السَّمَاءِ وَالْأَرْضِ وَلَمْ يَكُونُوا عَمِلُوا عَلَى شَيْءٍ<\/p>\n<p><strong>Woe to the rulers! Woe to the authorities! Woe to the trustees! Some people will wish their forelocks were hanging from the star of Pleiades on the Day of Resurrection, rather than had done anything they did.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 8627, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/06\/18\/intense-regret-leaders\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Abdur Rahman ibn Samurah reported: The Prophet, peace and blessings be upon him, said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا<\/p>\n<p><strong>O Abdur Rahman, do not ask for authority! If it is given to you at your request, you will be held fully responsible for it. If it is given to you without your request, you will be helped by Allah in it<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7146, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/03\/18\/makruh-seek-power-sultan\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Warning against seeking authority, a position as judge, or leadership.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[528],"tags":[282,183,24,135,32,48,51,486,134,107,128],"class_list":["post-23842","post","type-post","status-publish","format-standard","hentry","category-hadith-chapters","tag-children","tag-day-of-resurrection-yawm-al-qiyammah","tag-family-ties-sillat-rahim","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-justice-adl","tag-leadership-imamate","tag-parables-al-amthal","tag-paradise-jannah","tag-public-trust-al-amanah","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6cy","jetpack-related-posts":[{"id":14979,"url":"https:\/\/www.abuaminaelias.com\/hard-work-and-responsibility-in-islam\/","url_meta":{"origin":23842,"position":0},"title":"Hard work and responsibility in Islam","author":"Abu Amina Elias","date":"December 5, 2013","format":false,"excerpt":"\"Every one of you is a shepherd and is responsible for his flock.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18837,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-good-character\/","url_meta":{"origin":23842,"position":1},"title":"Forty Hadith on Good Character","author":"Abu Amina Elias","date":"February 1, 2018","format":false,"excerpt":"\"Most complete of believers in faith are those with the best character,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23868,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-warning-evil-rulers\/","url_meta":{"origin":23842,"position":2},"title":"Imam al-Mundhiri on Support for Evil Rulers","author":"Abu Amina Elias","date":"March 18, 2023","format":false,"excerpt":"\"Encouragement to refrain from seeking an audience with oppressors,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20709,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-maintaining-renewing-wudu\/","url_meta":{"origin":23842,"position":3},"title":"Imam al-Mundhiri on Maintaining and Renewing Ablution","author":"Abu Amina Elias","date":"August 3, 2019","format":false,"excerpt":"\"None can preserve his ablution but a believer.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23844,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-fearing-oppressor\/","url_meta":{"origin":23842,"position":4},"title":"Imam al-Mundhiri on Supplications if Fearing an Oppressor","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Encouragement for words to say when fearing an oppressor\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23854,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-bribery-hukm\/","url_meta":{"origin":23842,"position":5},"title":"Imam al-Mundhiri on Bribery in Judgment","author":"Abu Amina Elias","date":"March 17, 2023","format":false,"excerpt":"\"Warning against giving and taking bribes, and pursuing either of them.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23842","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=23842"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/23842\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=23842"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=23842"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=23842"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}