{"id":24157,"date":"2023-09-01T09:16:12","date_gmt":"2023-09-01T05:16:12","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=24157"},"modified":"2023-10-05T21:10:54","modified_gmt":"2023-10-05T17:10:54","slug":"forty-hadith-on-jihad","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-jihad\/","title":{"rendered":"Forty Hadith on Jihad"},"content":{"rendered":"<p style=\"text-align: center;\">Translated, Sourced, and Verified by Abu Amina Elias<\/p>\n<p style=\"text-align: center;\"><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p><strong><u>Hadith 1 – Military Jihad to Raise and Protect the Call to Islam<\/u><\/strong><\/p>\n<p>Abu Musa reported: A man asked the Prophet, “A man may fight to be courageous, another may fight for zeal, and another may fight to show off. Which of these is fighting in the way of Allah?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>He who fights to raise the word of Allah is in the way of Allah<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 123, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/jihad-word-allah-highest\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Hajar commented on this narration, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُرَادُ بِكَلِمَةِ اللَّهِ دَعْوَةُ اللَّهِ إِلَى الْإِسْلَامِ وَيَحْتَمِلُ أَنْ يَكُونَ الْمُرَادُ أَنَّهُ يعني الجهاد لَا يَكُونُ فِي سَبِيلِ اللَّهِ إِلَّا مَنْ كَانَ سَبَبُ قِتَالِهِ طَلَبَ إِعْلَاءِ كَلِمَةِ اللَّهِ فَقَطْ بِمَعْنَى أَنَّهُ لَوْ أَضَافَ إِلَى ذَلِكَ سَبَبًا مِنَ الْأَسْبَابِ الْمَذْكُورَةِ أَخَلَّ بِذَلِكَ<\/p>\n<p>The meaning of the ‘word of Allah’ is the invitation (<em>da’wah<\/em>) to Islam. It is interpreted to mean that jihad would not be in the cause of Allah unless the purpose is only to raise the word of Allah, such that if anyone were to add another reason to it, that would violate it.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/28<\/p><\/blockquote>\n<p><strong><u>Hadith 2 – The Greater and Lesser Jihad<\/u><\/strong><\/p>\n<p>Fadalah ibn ‘Ubayd reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُجَاهِدُ مَنْ جَاهَدَ نَفْسَهُ<\/p>\n<p><strong>The one who strives in jihad is he who strives against himself<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1621, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/13\/mujahid-jihad-against-his-soul\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said during his final pilgrimage:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِالْمُؤْمِنِ مَنْ أَمِنَهُ النَّاسُ عَلَى أَمْوَالِهِمْ وَأَنْفُسِهِمْ وَالْمُسْلِمُ مَنْ سَلِمَ النَّاسُ مِنْ لِسَانِهِ وَيَدِهِ وَالْمُجَاهِدُ مَنْ جَاهَدَ نَفْسَهُ فِي طَاعَةِ اللَّهِ وَالْمُهَاجِرُ مَنْ هَجَرَ الْخَطَايَا وَالذَّنُوبَ<\/p>\n<p><strong>Have I not informed you? The believer is the one who is trusted with the lives and wealth of people. The Muslim is the one from whose tongue and hand people are safe. The one striving in jihad in the way of Allah is the one who strives against himself in obedience to Allah. The emigrant is one who emigrates away from sins and evil deeds.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 23958, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/14\/mujahid-man-jahada-nafsah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Rajab reported: Ibrahim ibn Abi ‘Alqamah, may Allah have mercy on him, said to his people when they returned from a military expedition:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وِ قَدْ جِئْتُمْ مِنَ الْجِهَادِ الْأَصْغَرِ فَمَا فَعَلْتُمْ فِي الْجِهَادِ الْأَكْبَرِ<\/p>\n<p>You have come from the lesser jihad, but you have not performed the greater jihad.<\/p><\/blockquote>\n<p>They said, “What is the greater jihad?” Ibrahim said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادُ الْقَلْبِ<\/p>\n<p>It is the jihad of the heart.<\/p><\/blockquote>\n<p>Al-Battal commented on this narration, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشَّجَاعَةُ صَبْرُ سَاعَةٍ وَهَذَا فِي جِهَادِ الْعَدُوِّ الظَّاهِرِ وَهُوَ جِهَادُ الْكُفَّارِ وَكَذَلِكَ جِهَادُ الْعَدُوِّ الْبَاطِنِ هُوَ جِهَادُ النَّفْسِ وَالْهَوَى فَإِنَّ جِهَادَهُمَا مِنْ أَعْظَمِ الْجِهَادِ<\/p>\n<p>Courage is to be patient for a time. This is the jihad against outward enemies, which is jihad against unbelievers. Such is the jihad against inward enemies, which is the jihad against the ego and lowly desires. Indeed, this is the greater of the two jihads.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/15\/lesser-greater-jihad-al-nafs\/\">Jāmi’ al-‘Ulūm wal-Ḥikam 1\/489<\/a><\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادُ النَّفْسِ وَالْهَوَى أَصْلُ جِهَادِ الْكُفَّارِ وَالْمُنَافِقِينَ فَإِنَّهُ لَا يَقْدِرُ عَلَى جِهَادِهِمْ حَتَّى يُجَاهِدَ نَفْسَهُ وَهَوَاهُ أَوَّلًا حَتَّى يَخْرُجَ إلَيْهِمْ<\/p>\n<p>Jihad of the soul against desire is the foundation of jihad against unbelievers and hypocrites, for a Muslim cannot wage jihad against them unless he has first waged jihad against his soul and desires before he goes out against them.<\/p>\n<p>Source: Rawḍat al-Muḥibbīn 1\/478<\/p><\/blockquote>\n<p><strong><u>Hadith 3 – Jihad is the Best Deed after Faith<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, was asked, “What is the best deed?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيمَانٌ بِاللَّهِ وَرَسُولِهِ<\/p>\n<p><strong>Faith in Allah and His Messenger. <\/strong><\/p><\/blockquote>\n<p>It was said, “Then what?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادٌ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>Jihad in the way of Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1519, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/jihad-hajj-mabrur-best-iman\/\"><strong><em>Muttafaqun Alayhi<\/em> <\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 4 – Warning of Hypocrisy and Worldliness in Military Jihad<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُ أَعْلَمُ بِمَنْ يُجَاهِدُ فِي سَبِيلِهِ وَاللَّهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِي سَبِيلِهِ<\/p>\n<p><strong>Allah knows best who wages jihad in His way, and Allah knows best who is wounded in His way.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2787, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/18\/only-allah-knows-who-fights-jihad\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Zarqani commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ يَعْقِدُ نِيَّتَهُ إِنْ كَانَتْ خَالِصَةً لِإِعْلَاءِ كَلِمَتِهِ فَذَلِكَ الْمُجَاهِدُ فِي سَبِيلِهِ وَإِنْ كَانَ فِي نِيَّتِهِ حُبُّ الْمَالِ وَالدُّنْيَا وَاكْتِسَابُ الذِّكْرِ فَقَدْ أَشْرَكَ مَعَ سَبِيلِ اللَّهِ الدُّنْيَا<\/p>\n<p>It means according to his intention. If it is purely to raise the word of Allah, then that is the true soldier in the way of Allah. If his intention involves the love of wealth and this world, or to earn fame, then he has associated the world as a partner with the way of Allah.<\/p>\n<p>Source: Sharḥ al-Zarqānī ‘alá Muwaṭṭa’ 3\/4<\/p><\/blockquote>\n<p><strong><u>Hadith 4 – Courage and Bravery in Jihad<\/u><\/strong><\/p>\n<p>Abu Ishaq reported: Al-Bara’ ibn ‘Azib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنَّا وَاللَّهِ إِذَا احْمَرَّ الْبَأْسُ نَتَّقِي بِهِ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّ الشُّجَاعَ مِنَّا لَلَّذِي يُحَاذِي بِهِ<\/p>\n<p>We would, by Allah, seek protection by the side of the Prophet, peace and blessings be upon him, when the battle was fierce. Surely, he was the most courageous among us who confronted the onslaught.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1776, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/11\/01\/prophet-courage-jihad\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>‘Ali bin Abi Talib, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنَّا إِذَا احْمَرَّ الْبَأْسُ وَلَقِيَ الْقَوْمُ الْقَوْمَ اتَّقَيْنَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَمَا يَكُونُ مِنَّا أَحَدٌ أَدْنَى مِنَ القَوْمِ مِنْهُ<\/p>\n<p>When the danger intensified and the people met each other in battle, we would seek protection by the Messenger of Allah, peace and blessings be upon him. None of us would be closer to the enemy than him.<\/p>\n<p>Source: Musnad Aḥmad 1347, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/11\/08\/bravery-fights-frontlines\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ النَّاسِ وَكَانَ أَجْوَدَ النَّاسِ وَكَانَ أَشْجَعَ النَّاسِ<\/p>\n<p>The Messenger of Allah, peace and blessings be upon him, was the best of people, the most generous of people, and the most courageous of people.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2820, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/04\/courage-bravery-prophet-madinah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ الَّذِينَ يَقُولُونَ رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّا وَاجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا<\/p>\n<p><strong>What is the matter with you that you do not fight in the way of Allah and for the oppressed men, women, and children who say, ‘Our Lord, deliver us from this city of evildoers, and send an ally to us from You, and send a supporter to us from You’?<\/strong><\/p>\n<p>Surat al-Nisa’ 4:75<\/p><\/blockquote>\n<p><strong><u>Hadith 5 – Commandments of Just War in Jihad<\/u><\/strong><\/p>\n<p>Buraydah reported: When the Messenger of Allah, peace and blessings be upon him, issued orders to a commander of an army or a company, he would personally command him to fear Allah and be good to the Muslims with them. Then, the Prophet would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اغْزُوا بِاسْمِ اللهِ فِي سَبِيلِ اللهِ قَاتِلُوا مَنْ كَفَرَ بِاللهِ اغْزُوا وَلَا تَغُلُّوا وَلَا تَغْدِرُوا وَلَا تُمَثِّلُوا وَلَا تَقْتُلُوا وَلِيدًا وَإِذَا لَقِيتَ عَدُوَّكَ مِنَ الْمُشْرِكِينَ فَادْعُهُمْ إِلَى ثَلَاثِ خِصَالٍ فَأَيَّتُهُنَّ مَا أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى الْإِسْلَامِ فَإِنْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى التَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ الْمُهَاجِرِينَ وَأَخْبِرْهُمْ أَنَّهُمْ إِنْ فَعَلُوا ذَلِكَ فَلَهُمْ مَا لِلْمُهَاجِرِينَ وَعَلَيْهِمْ مَا عَلَى الْمُهَاجِرِينَ فَإِنْ أَبَوْا أَنْ يَتَحَوَّلُوا مِنْهَا فَأَخْبِرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ الْمُسْلِمِينَ يَجْرِي عَلَيْهِمْ حُكْمُ اللهِ الَّذِي يَجْرِي عَلَى الْمُؤْمِنِينَ وَلَا يَكُونُ لَهُمْ فِي الْغَنِيمَةِ وَالْفَيْءِ شَيْءٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ الْمُسْلِمِينَ فَإِنْ هُمْ أَبَوْا فَسَلْهُمُ الْجِزْيَةَ فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ فَإِنْ هُمْ أَبَوْا فَاسْتَعِنْ بِاللهِ وَقَاتِلْهُمْ<\/p>\n<p><strong>March forward in the name of Allah and in the way of Allah. Fight those who deny Allah. March forward and do not embezzle the spoils, do not be treacherous, do not mutilate, and do not kill children. When you meet your enemy among the idolaters, call them to three options. If they respond to any of these, you must accept it and refrain from harming them. Thus, call them to Islam. If they answer you, accept it from them and refrain from harming them. Then, call them to relocate from their abodes to the abode of the emigrants. Inform them if they do that, they will have the privileges and duties of the emigrants. If they refuse to relocate, inform them they will be like the Bedouin Arabs among the Muslims under the rulings of Allah, the same as the believers, but they will have no share of the spoils unless they fight with the Muslims. If they refuse, ask them to pay tribute. If they answer you, accept it and refrain from harming them. If they refuse everything, then seek help from Allah and fight them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1731, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/16\/jihad-just-war\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْطَلِقُوا بِاسْمِ اللَّهِ وَبِاللَّهِ وَعَلَى مِلَّةِ رَسُولِ اللَّهِ وَلَا تَقْتُلُوا شَيْخًا فَانِيًا وَلَا طِفْلًا وَلَا صَغِيرًا وَلَا امْرَأَةً وَلَا تَغُلُّوا وَضُمُّوا غَنَائِمَكُمْ وَأَصْلِحُوا وَأَحْسِنُوا إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ<\/p>\n<p><strong>Depart in the name of Allah, and with Allah, upon the religion of the Messenger of Allah. Do not kill elders, nor children, nor young ones, nor women. Do not plunder, but rather collect your spoils. Behave righteously and in the best manner. Verily, Allah loves those who behave in the best manner.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2608, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/21\/jihad-jus-in-bello\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلا تَقْتُلُوا الْوِلْدَانَ وَلا أَصْحَابَ الصَّوَامِعِ<\/p>\n<p><strong>Do not kill children, nor the monks in their monasteries.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 2728, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/08\/30\/protection-places-of-worship\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا لَا تَقْتُلُوا ذُرِّيَّةً قَالَ كُلُّ نَسَمَةٍ تُولَدُ عَلَى الْفِطْرَةِ حَتَّى يُعْرِبَ عَنْهَا لِسَانُهَا فَأَبَوَاهَا يُهَوِّدَانِهَا وَيُنَصِّرَانِهَا<\/p>\n<p><strong>No doubt, do not kill children! Do not kill children! Every soul is born upon its natural instinct until he expresses it with his tongue, then his father turns him into a Jew or a Christian.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 15589, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/10\/25\/prophet-condemns-killing-children\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Yazid Reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ النُّهْبَةِ وَالْمُثْلَةِ<\/p>\n<p>The Prophet, peace and blessings be upon him, prohibited plundering and mutilation.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5516, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/28\/haram-plunder-mutilation\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>‘Uqbah ibn ‘Amir reported: He came to Abu Bakr, may Allah be pleased with him, with a severed head, and Abu Bakr condemned it. ‘Uqbah said, “O Caliph of the Messenger of Allah, they do that to us!” Abu Bakr said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَاسْتِنَانٌ بِفَارِسَ وَالرُّومِ لا تُحْمَلْ إِلَيَّ رَأْسٌ فَإِنَّمَا يَكْفِي الْكِتَابُ وَالْخَبَرُ<\/p>\n<p>You follow the way of the Persians and the Romans? Rather, do not come to me with a severed head! It is enough for you to write and inform me.<\/p>\n<p>Source: Sunan Saʻīd ibn Manṣūr 2649, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/08\/19\/abu-bakr-decapitation-haram\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Imam al-Zuhri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمْ تُحْمَلْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسٌ قَطُّ وَلا يَوْمَ بَدْرٍ وَحُمِلَ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ رَأْسٌ فَأَنْكَرَهُ وَأَوَّلُ مَنْ حُمِلَتْ إِلَيْهِ الرُّءُوسُ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ<\/p>\n<p>A severed head was never presented to the Messenger of Allah, peace and blessings be upon him, and neither on the day of Badr. A severed head was presented to Abu Bakr, may Allah be pleased with him, and he condemned it. The first to accept the presentation of severed heads was Abdullah ibn al-Zubayr.<\/p>\n<p>Source: al-Marāsīl 329<\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا وَإِنَّ اللَّهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ الَّذِينَ أُخْرِجُوا مِن دِيَارِهِم بِغَيْرِ حَقٍّ إِلَّا أَن يَقُولُوا رَبُّنَا اللَّهُ وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُم بِبَعْضٍ لَّهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا<\/p>\n<p><strong>Permission to fight is given to those being attacked, for they have been wronged. Surely, Allah is powerful to support them, those who have been driven from their homes only for saying, ‘Our Lord is Allah!’ If Allah did not defend people by means of others, the monasteries, the churches, the synagogues, and the mosques, in which the name of Allah is repeatedly invoked, would have been torn down.<\/strong><\/p>\n<p>Surat al-Hajj 22:39-40<\/p><\/blockquote>\n<p><strong><u>Hadith 6 – Prohibition of Attacking Non-Combatants<\/u><\/strong><\/p>\n<p>Abdullah ibn Umar reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ امْرَأَةً وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ<\/p>\n<p>A woman was found killed in one of the battles of the Messenger of Allah, peace and blessings be upon him, so the Prophet condemned the killing of women and children.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3014, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/jihad-killing-women-children\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Rabah ibn Rabi’ reported: We were with the Messenger of Allah, peace and blessings be upon him, during a military expedition. The Prophet saw some people gathered around something, so he sent a man, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">انْظُرْ عَلَامَ اجْتَمَعَ هَؤُلَاءِ<\/p>\n<p><strong>Go and see for what they have gathered<\/strong>.<\/p><\/blockquote>\n<p>The man returned and said, “It was a woman who was killed.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَتْ هَذِهِ لِتُقَاتِلَ<\/p>\n<p><strong>She was not fighting<\/strong>!<\/p><\/blockquote>\n<p>Khalid ibn al-Walid was in the advanced guard, so the Prophet sent a man to him, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَقْتُلَنَّ امْرَأَةً وَلَا عَسِيفًا<\/p>\n<p><strong>Do not kill women or workers<\/strong>!<\/p>\n<p>Source: Sunan Abī Dāwūd 2669, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/jihad-haram-kill-civilians\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَعْدَى النَّاسِ عَلَى اللَّهِ مَنْ قَتَلَ فِي الْحَرَمِ أَوْ قَتَلَ غَيْرَ قَاتِلِهِ أَوْ قَتَلَ بِذُحُولِ الْجَاهِلِيَّةِ<\/p>\n<p><strong>Verily, the worst transgressors to Allah are those who kill in the sacred mosque, those who kill whoever did not fight him, or those who kill with the vindictiveness of ignorance<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 6681, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/12\/transgression-kill-those-do-not-fight\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْتَى النَّاسِ عَلَى اللَّهِ عَزَّ وَجَلَّ مَنْ قَتَلَ غَيْرَ قَاتِلِهِ أَوْ طَلَبَ بِدَمِ الْجَاهِلِيَّةِ مِنْ أَهْلِ الْإِسْلَامِ<\/p>\n<p><strong>Verily, the most tyrannical of people to Allah Almighty is one who kills those who did not fight him, or he demands the blood feuds of ignorance be settled by the people of Islam.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16376, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/12\/22\/tyrant-kill-do-not-fight\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>Aisha reported: I found an engraving on the sword of the Messenger of Allah, peace and blessings be upon him, that wrote:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَشَدَّ النَّاسِ عُتُوًّا مَنْ ضَرَبَ غَيْرَ ضَارِبِهِ وَرَجُلٌ قَتَلَ غَيْرَ قَاتِلِهِ وَرَجُلٌ تَوَلَّى غَيْرَ أَهْلِ نِعْمَتِهِ فَمَنْ فَعَلَ ذَلِكَ فَقَدْ كَفَرَ بِاللَّهِ وَرَسُولِهِ لَا يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا<\/p>\n<p><strong>Verily, the worst of people in insolence are those who strike at whoever did not strike them, a man who kills those who did not fight him, and a man who claims allegiance to those other than his rightful benefactors. Whoever does so has disbelieved in Allah and His Messenger. Allah will not accept his obligatory or voluntary deeds<\/strong>.<\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 15896, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/03\/10\/prophet-sword-condemns-unjust-war\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلَا تَعْتَدُوا إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ<\/p>\n<p><strong>Fight in the way of Allah those who fight you, but do not transgress. Verily, Allah does not love transgressors.<\/strong><\/p>\n<p>Surat al-Baqarah 2:190<\/p><\/blockquote>\n<p><strong><u>Hadith 7 – Warfare as a Last Resort<\/u><\/strong><\/p>\n<p>Abdullah ibn Abi Awfa reported: On the days the Messenger of Allah, peace and blessings be upon him, faced the enemy in battle, he waited until the sun had set, then he stood in front of the people. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ لَا تَمَنَّوْا لِقَاءَ الْعَدُوِّ وَسَلُوا اللَّهَ الْعَافِيَةَ فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا وَاعْلَمُوا أَنَّ الْجَنَّةَ تَحْتَ ظِلَالِ السُّيُوفِ<\/p>\n<p><strong>O people, do not desire to meet the enemy, but rather ask Allah for safety. If you meet your enemy in battle, be patient and know that Paradise is under the shade of swords.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ مُنْزِلَ الْكِتَابِ وَمُجْرِيَ السَّحَابِ وَهَازِمَ الْأَحْزَابِ اهْزِمْهُمْ وَانْصُرْنَا عَلَيْهِمْ<\/p>\n<p><strong>O Allah, the Revealer of the Book, the Mover of the clouds, the Defeater of the confederates! Defeat the unbelievers and grant us victory!<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3024, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/26\/do-not-wish-fight\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اَ تَمَنَّوْا لِقَاءَ الْعَدُوِّ فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا<\/p>\n<p><strong>Do not wish to meet the enemy in battle, but if you meet them, be steadfast.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3026, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/22\/jihad-war-is-last-resort\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَّكُمْ وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ<\/p>\n<p><strong>Fighting has been enjoined upon you, although it is hateful to you. Perhaps you hate something in which is much good for you, or perhaps you love something in which is much evil for you. Allah knows but you do not.<\/strong><\/p>\n<p>Surat al-Baqarah 2:216<\/p><\/blockquote>\n<p><strong><u>Hadith 8 – Accepting Terms of Peace<\/u><\/strong><\/p>\n<p>&#8216;Ali ibn Abi Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ سَيَكُونُ بَعْدِي اخْتِلَافٌ أَوْ أَمْرٌ فَإِنْ اسْتَطَعْتَ أَنْ تَكُونَ السِّلْمَ فَافْعَل<\/p>\n<p><strong>Verily, after me there will be conflicts or affairs, so if you can end them in peace, then do so<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 695, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/29\/end-conflicts-peace\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam Malik, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَجُوزُ مُهَادَنَةُ الْمُشْرِكِينَ السَّنَةَ وَالسَّنَتَيْنِ وَالثَّلَاثَ وَإِلَى غَيْرِ مُدَّةٍ<\/p>\n<p>It is permissible to contract a peace treaty with the idolaters for one, two, or three years, or without any time limit.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 8:61<\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ<\/p>\n<p><strong>If they incline to peace, then you incline to it as well and put your trust in Allah. Verily, He is the Hearing, the Knowing.<\/strong><\/p>\n<p>Surat al-Anfal 8:61<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا<\/p>\n<p><strong>If they withdraw from you, do not fight you, and offer you peace, then Allah does not give you a way against them.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:90<\/p><\/blockquote>\n<p><strong><u>Hadith 9 – Two Types of Military Expeditions<\/u><\/strong><\/p>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْغَزْوُ غَزْوَانِ فَأَمَّا مَنْ ابْتَغَى وَجْهَ اللَّهِ وَأَطَاعَ الْإِمَامَ وَأَنْفَقَ الْكَرِيمَةَ وَيَاسَرَ الشَّرِيكَ وَاجْتَنَبَ الْفَسَادَ فَإِنَّ نَوْمَهُ وَنُبْهَهُ أَجْرٌ كُلُّهُ وَأَمَّا مَنْ غَزَا فَخْرًا وَرِيَاءً وَسُمْعَةً وَعَصَى الْإِمَامَ وَأَفْسَدَ فِي الْأَرْضِ فَإِنَّهُ لَمْ يَرْجِعْ بِالْكَفَافِ<\/p>\n<p><strong>Military expeditions are two kinds. As for one who seeks the countenance of Allah, obeys the leader, spends in charity from his precious possessions, shows leniency to his colleagues, and avoids corruption, then the entirety of his sleep and vigilance is rewarded. As for one who fights out of pride, showing off, and seeking a reputation, who disobeys the leader and commits corruption in the land, then he will return with nothing of importance.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2515, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/02\/04\/jihad-just-cause\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 10 – The True Mujahid is like a Constant Worshiper<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَاللَّهُ أَعْلَمُ بِمَنْ يُجَاهِدُ فِي سَبِيلِهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ وَتَوَكَّلَ اللَّهُ لِلْمُجَاهِدِ فِي سَبِيلِهِ بِأَنْ يَتَوَفَّاهُ أَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ يَرْجِعَهُ سَالِمًا مَعَ أَجْرٍ أَوْ غَنِيمَةٍ<\/p>\n<p><strong>The parable of one who strives in jihad in the way of Allah, and Allah knows best who strives in His way, is that of one who is always fasting and praying. Allah guarantees that one who strives in His way will enter Paradise if he passes away, or he will return home safely with a reward or spoils<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2787, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/13\/jihad-one-who-fights\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 11 – Leniency with Disarmed Combatants<\/u><\/strong><\/p>\n<p>Jabir ibn Abdullah reported: The Messenger of Allah, peace and blessings be upon him, fought against the tribe of Muharib ibn Khasafah, and a man among them named Ghawrath ibn al-Harith came until he was standing over the Messenger of Allah with a sword. The man said, “Who will protect you from me?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللهُ<\/p>\n<p><strong>Allah<\/strong>.<\/p><\/blockquote>\n<p>The sword fell from his hand, and the Prophet picked it up, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ يَمْنَعُكَ مِنِّي<\/p>\n<p><strong>Who will protect you from me?<\/strong><\/p><\/blockquote>\n<p>The man said, “Be better than the offender!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنِّي رَسُولُ اللهِ<\/p>\n<p><strong>Will you testify that there is no God but Allah, and I am the Messenger of Allah?<\/strong><\/p><\/blockquote>\n<p>The man said, “No, but I promise not to fight you, nor will I join anyone fighting you.” The Prophet let him go, and the man returned to his people, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِئْتُكُمْ مِنْ عِنْدِ خَيْرِ النَّاسِ<\/p>\n<p>I have just come to you from the best of people!<\/p>\n<p>Source: Musnad Aḥmad 15190, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/08\/11\/prophet-enemy-combatant\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذَا اخْتَرَطَ عَلَيَّ سَيْفِي وَأَنَا نَائِمٌ فَاسْتَيْقَظْتُ وَهُوَ فِي يَدِهِ صَلْتًا فَقَالَ مَنْ يَمْنَعُكَ مِنِّي فَقُلْتُ اللَّهُ ثَلَاثًا<\/p>\n<p><strong>This man came to me while I was asleep, and he quietly took my sword. I woke up while he stood over my head, holding my unsheathed sword. He said: Who will protect you from me? I said three times: Allah.<\/strong><\/p><\/blockquote>\n<p>Then, Jabir said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمْ يُعَاقِبْهُ<\/p>\n<p>The Prophet did not punish him.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2910, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/01\/pardon-prophet-forgives-idolater\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 12 – Good Treatment of Prisoners of War<\/u><\/strong><\/p>\n<p>Abu ‘Aziz ibn ‘Umayr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَوْصُوا بِالأُسَارَى خَيْرًا<\/p>\n<p><strong>I enjoin you to treat the captives well.<\/strong><\/p><\/blockquote>\n<p>Abu ‘Aziz said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْتُ فِي الأُسَارَى يَوْمَ بَدْرٍ وَكُنْتُ فِي نَفَرٍ مِنَ الأَنْصَارِ وَكَانُوا إِذَا قَدَّمُوا غَدَاءَهُمْ وَعَشَاءَهُمْ أَكَلُوا التَّمْرَ وَأَطْعَمُونِي الْخُبْزَ بِوَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاهُمْ<\/p>\n<p>I was among the prisoners of war on the day of the battle of Badr. Then, I was among the Ansar after I accepted Islam. When lunch or dinner time arrived, I would feed dates to the prisoners, for I had been fed bread due to the Messenger of Allah’s command.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 22\/393, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/09\/07\/prophet-treat-prisoners-well\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُطْعِمُونَ الطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنكُمْ جَزَاءً وَلَا شُكُورًا<\/p>\n<p><strong>They give food in spite of love for it to the needy, the orphan, and the captive, saying: We feed you only for the countenance of Allah. We do not desire from you any reward or gratitude.<\/strong><\/p>\n<p>Surat al-Insan 76:8-9<\/p><\/blockquote>\n<p>Ibn Kathir commented on this verse, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ ابْنُ عَبَّاسٍ كَانَ أُسَرَاؤُهُمْ يَوْمَئِذٍ مُشْرِكِينَ وَيَشْهَدُ لِهَذَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَصْحَابَهُ يَوْمَ بَدْرٍ أَنْ يُكْرِمُوا الْأُسَارَى فَكَانُوا يُقَدِّمُونَهُمْ عَلَى أَنْفُسِهِمْ عِنْدَ الْغَدَاءِ وَهَكَذَا قَالَ سَعِيدُ بْنُ جُبَيْرٍ وَعَطَاءٌ وَالْحَسَنُ وَقَتَادَةُ وَقَدْ وَصَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْإِحْسَانِ إِلَى الْأَرِقَّاءِ فِي غَيْرِمَا حَدِيثٍ<\/p>\n<p>Ibn Abbas said: Their ‘captives’ on that day were idolaters. The evidence for that is that the Messenger of Allah, peace and blessings be upon him, commanded his companions to be generous to the prisoners on the day of Badr, and they would give preference to them in meals over themselves. Such was reported by Sa’id ibn Jubayr, &#8216;Ata’, Al-Hasan, and Qatadah. The Messenger of Allah had enjoined good treatment of prisoners in more than one report.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 76:8<\/p><\/blockquote>\n<p><strong><u>Hadith 13 – Prisoners accept Islam when treated well<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَجِبَ اللَّهُ مِنْ قَوْمٍ يَدْخُلُونَ الْجَنَّةَ فِي السَّلَاسِلِ<\/p>\n<p><strong>Allah marvels at people who enter Paradise in chains.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3010, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/10\/13\/former-enemies-embrace-islam\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn al-Jawzi commented on this tradition, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَاهُ أَنَّهُمْ أُسِرُوا وَقُيِّدُوا فَلَمَّا عَرَفُوا صِحَّةَ الْإِسْلَامِ دَخَلُوا طَوْعًا فَدَخَلُوا الْجَنَّةَ<\/p>\n<p>It means they are taken prisoner and detained, but when they recognize the rightness of Islam, they embrace it willingly and enter Paradise.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/145<\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ<\/p>\n<p><strong>Not equal are the good and evil deed. Repel evil with what is better and then, behold, the one with hostility toward you will become like a devoted friend.<\/strong><\/p>\n<p>Surat al-Fussilat 41:34<\/p><\/blockquote>\n<p><strong><u>Hadith 14 – Believers are the Most Restrained in Taking Life<\/u><\/strong><\/p>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ<\/p>\n<p><strong>The most chaste of people in killing are the people of faith.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2666, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/27\/ahl-al-iman-restrained-killing\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Al-San’ani commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فالمراد أكثر الناس تركًا للقتله المؤمنون وذلك لأن معهم من الإيمان ما يزجرهم عن القتل<\/p>\n<p>The meaning is that most people who avoid killing are the believers, because the faith they carry with them dissuades them from killing.<\/p>\n<p>Source: al-Tanwīr Sharḥ al-Jāmi’ al-Ṣaghīr 2\/508<\/p><\/blockquote>\n<p>And Al-Munawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أي هم أرحم الناس بخلق الله وأشدهم تحريا عن التمثيل والتشويه بالمقتول وإطالة تعذيبه<\/p>\n<p>Meaning, they are the most merciful of people with the creation of Allah, and they are the strictest of them against mutilating or disfiguring the deceased, or prolonging their punishment.<\/p>\n<p>Source: Fayḍ al-Qadīr 2\/7<\/p><\/blockquote>\n<p><strong><u>Hadith 15 – Harboring no Malice towards the Enemy<\/u><\/strong><\/p>\n<p>Sahl ibn Sa’d reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لا يَعْلَمُونَ<\/p>\n<p><strong>O Allah, forgive my people for they do not know.<\/strong><\/p><\/blockquote>\n<p>Abu Hatim said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَعْنِي هَذَا الدُّعَاءُ أَنَّهُ قَالَ يَوْمَ أُحُدٍ لَمَّا شُجَّ وَجْهُهُ<\/p>\n<p>The Prophet said this supplication during the battle of Uhud when they slashed his face.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 973, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/prophet-forgives-battle-uhud\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: I remember seeing the Messenger of Allah, peace and blessings be upon him, tell the story of a prophet who was beaten by his people and he wiped the blood from his face, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ<\/p>\n<p><strong>My Lord, forgive my people for they do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6929, Grade: <strong><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/06\/03\/know-not-what-they-do\/\"><em>Muttafaqun Alayhi<\/em><\/a><\/strong><\/p><\/blockquote>\n<p>Imam al-Ghazali describes the characteristics of a pure heart, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كل عبد سلم عَن الْغِشّ والحقد والحسد وَإِرَادَة الشَّرّ قلبه وسلمت عَن الآثام والمحظورات جوارحه وَسلم عَن الانتكاس والانعكاس صِفَاته فَهُوَ الَّذِي يَأْتِي الله تَعَالَى بقلب سليم<\/p>\n<p>Every servant whose heart is free of deceit, malice, envy, and evil intentions, and is free of the prohibited sins of the limbs, and is free of the fluctuation and reversal of these characteristics of his, he is one who comes to Allah Almighty with a pure heart.<\/p>\n<p>Source: Al-Maqṣad al-Asná 1\/70<\/p><\/blockquote>\n<p><strong><u>Hadith 16 – Praying for Allah to Guide the Enemy to Islam<\/u><\/strong><\/p>\n<p>Abu Huraira reported: Al-Tufayl came with his companions, and they said, “O Messenger of Allah, the tribe of Daws has disbelieved and rejected you, so pray to Allah against them!” And it was said, “May the tribe of Daws be destroyed!” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ<\/p>\n<p><strong>O Allah, guide the tribe of Daws and bring them to me.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4392, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/dua-hidayah-kafirun-kuffar\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, it was said, “O Messenger of Allah, pray against the idolaters!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً<\/p>\n<p><strong>Verily, I was not sent to invoke curses, but rather I was only sent as mercy.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2599, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/07\/mercy-to-the-worlds\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And in another narration, it was said, “O Messenger of Allah, the arrows of the tribe of Thaqif have pierced us, so pray against them!” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اهْدِ ثَقِيفًا<\/p>\n<p><strong>O Allah, guide the tribe of Thaqif!<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3942, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/09\/21\/prophet-prays-thaqif-guided\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Imam al-Nawawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فيحب لأخيه الكافر ما يحب لنفسه من دخوله في الإسلام كما يحب لأخيه المسلم دوامه على الإسلام ولهذا كان الدعاء بالهداية للكافر مستحبا<\/p>\n<p>One should love for his unbelieving brother what he loves for himself, which is his entering Islam, just as he should love for his brother Muslim to remain in Islam. For this reason, it is recommended to supplicate for the unbeliever to be guided.<\/p>\n<p>Source: Sharḥ al-Arba’īn 13<\/p><\/blockquote>\n<p><strong><u>Hadith 17 – Military Leadership to Defend Islam<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ عَزَّ وَجَلَّ وَعَدَلَ كَانَ لَهُ بِذَلِكَ أَجْرٌ وَإِنْ يَأْمُرْ بِغَيْرِهِ كَانَ عَلَيْهِ مِنْهُ<\/p>\n<p><strong>Verily, the leader is only a shield behind whom they fight, and he protects them. If he commands the fear of Allah Almighty and justice, he will have a reward. If he commands something else, it will be held against him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1841. Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/04\/imam-shield\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam al-Tahawi writes in his creed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْحَجُّ وَالْجِهَادُ مَاضِيَانِ مَعَ أُولِي الْأَمْرِ مِنَ الْمُسْلِمِينَ بَرِّهِمْ وَفَاجِرِهِمْ إِلَى قِيَامِ السَّاعَةِ لَا يُبْطِلُهُمَا شَيْءٌ وَلَا يَنْقُضُهُمَا<\/p>\n<p>Hajj pilgrimage and jihad in the way of Allah are continuous, under those with authority among the Muslims, the righteous and wicked among them, until the establishment of the Hour. Nothing invalidates or rescinds them.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/\">al-ʻAqīdah al-Ṭaḥāwīyah<\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 18 – Prohibition of Fighting for Political Dominion<\/u><\/strong><\/p>\n<p>Sa’id ibn Jubayr reported: Abdullah ibn Umar, may Allah be pleased with him, came out to us, and we hoped that he would narrate to us a good tradition. A man approached him, and he said, “O Abu Abdur Rahman, tell us about fighting during times of persecution, as Allah said: <strong>And fight them until there is no more persecution<\/strong>.” (8:39) Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ تَدْرِي مَا الْفِتْنَةُ ثَكِلَتْكَ أُمُّكَ إِنَّمَا كَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَاتِلُ الْمُشْرِكِينَ وَكَانَ الدُّخُولُ فِي دِينِهِمْ فِتْنَةً وَلَيْسَ كَقِتَالِكُمْ عَلَى الْمُلْكِ<\/p>\n<p>Do you know what persecution is? May your mother be bereaved of you! Muhammad, peace and blessings be upon him, only fought the idolaters as there was persecution to make them enter their religion. It was not like your fighting for the sake of ruling.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7095, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/07\/05\/fitnah-prophet-freedom-not-mulk\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ إِمَّا قَتَلُوهُ وَإِمَّا يُعَذِّبُوهُ حَتَّى كَثُرَ الإِسْلاَمُ فَلَمْ تَكُنْ فِتْنَةٌ‏<\/p>\n<p>A man used to be persecuted for his religion, whether they killed him or tortured him, until the followers of Islam became plentiful and there was no longer persecution.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4513, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ ۚ فَإِنِ انتَهَوْا فَإِنَّ اللَّهَ بِمَا يَعْمَلُونَ بَصِيرٌ<\/p>\n<p><strong>Fight them until there is no more persecution and the religion is entirely for Allah. If they cease, then Allah surely sees what they are doing.<\/strong><\/p>\n<p>Surat al-Anfal 8:39<\/p><\/blockquote>\n<p><strong><u>Hadith 19 – Prohibition of Inciting Civil War in the Ummah<\/u><\/strong><\/p>\n<p>Hudhayfah ibn al-Yaman reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَكُونُ بَعْدِي أَئِمَّةٌ لَا يَهْتَدُونَ بِهُدَايَ وَلَا يَسْتَنُّونَ بِسُنَّتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ<\/p>\n<p><strong>Rulers after me will come who do not follow my guidance and my way<\/strong>. <strong>Some of their men will have the hearts of devils in a human body.<\/strong><\/p><\/blockquote>\n<p>I said, “O Messenger of Allah, what should I do if I live to see that time?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَسْمَعُ وَتُطِيعُ لِلْأَمِيرِ وَإِنْ ضُرِبَ ظَهْرُكَ وَأُخِذَ مَالُكَ فَاسْمَعْ وَأَطِعْ<\/p>\n<p><strong>You should listen and obey them even if the ruler strikes your back and takes your wealth, even still listen and obey.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1847, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/tyrant-strike-back-patience\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, it was said, “Shall we confront them with swords?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا مَا أَقَامُوا فِيكُمْ الصَّلَاةَ وَإِذَا رَأَيْتُمْ مِنْ وُلَاتِكُمْ شَيْئًا تَكْرَهُونَهُ فَاكْرَهُوا عَمَلَهُ وَلَا تَنْزِعُوا يَدًا مِنْ طَاعَةٍ<\/p>\n<p><strong>No, as long as they establish prayer among you. If you find something hateful from them, you should hate their actions but not withdraw your hand from obedience.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1855, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/hate-tyrant-deeds-rebellion\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Hasan al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهِ لَوْ أَنَّ النَّاسَ إِذَا ابْتُلُوا مِنْ قِبَلِ سُلْطَانِهِمْ صَبَرُوا مَا لَبِثُوا أَنْ يَرْفَعَ اللَّهُ ذَلِكَ عَنْهُمْ وَذَلِكَ أَنَّهُمْ يَفْزَعُونَ إِلَى السَّيْفِ فَيُوكَلُوا إِلَيْهِ وَوَاللَّهِ مَا جَاءُوا بِيَوْمِ خَيْرٍ قَطُّ<\/p>\n<p>If people had patience when they are afflicted with trials from their ruler, it would not be long before Allah relieves them of it. Yet, they take refuge in their swords, so they are left to their swords. By Allah, not even for a single day did they bring about any good.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/08\/hassan-left-to-their-swords\/\">al-Sharī’ah lil-Ājurrī 62<\/a><\/p><\/blockquote>\n<p>Al-Nawawi commented on these traditions, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْخُرُوجُ عَلَيْهِمْ وَقِتَالُهُمْ فَحَرَامٌ بِإِجْمَاعِ الْمُسْلِمِينَ وَإِنْ كَانُوا فَسَقَةً ظَالِمِينَ وَقَدْ تَظَاهَرَتِ الْأَحَادِيثُ بِمَعْنَى مَا ذَكَرْتُهُ وَأَجْمَعَ أَهْلُ السُّنَّةِ أَنَّهُ لَا يَنْعَزِلُ السُّلْطَانُ بِالْفِسْقِ وَأَمَّا الْوَجْهُ الْمَذْكُورُ فِي كُتُبِ الْفِقْهِ لِبَعْضِ أَصْحَابِنَا أَنَّهُ يَنْعَزِلُ وَحُكِيَ عَنِ الْمُعْتَزِلَةِ أَيْضًا فَغَلَطٌ مِنْ قَائِلِهِ مُخَالِفٌ لِلْإِجْمَاعِ قَالَ الْعُلَمَاءُ وَسَبَبُ عَدَمِ انْعِزَالِهِ وَتَحْرِيمِ الْخُرُوجِ عَلَيْهِ مَا يَتَرَتَّبُ عَلَى ذَلِكَ مِنَ الْفِتَنِ وَإِرَاقَةِ الدِّمَاءِ وَفَسَادِ ذَاتِ الْبَيْنِ فَتَكُونُ الْمَفْسَدَةُ فِي عَزْلِهِ أَكْثَرَ مِنْهَا فِي بَقَائِهِ<\/p>\n<p>As for rebelling against the ruler and fighting him, it is forbidden by consensus of the Muslims even if he is sinful and oppressive. I have mentioned many narrations with this meaning. The people of the Sunnah have agreed that the ruler should not be removed due to his sinfulness. As for the view mentioned in the books of jurisprudence from some of our companions that he should be removed, which is also the opinion of the Mu’tazilites, then it is a serious mistake from them and is in opposition to the consensus. The scholars have said the reason his removal and rebellion against him is forbidden is because of what that entails of tribulations, bloodshed, and corruption, for the harm in removing the ruler is greater than letting him remain.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 12\/229<\/p><\/blockquote>\n<p><strong><u>Hadith 20 – Prohibition of Indiscriminate Violence<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَغْضَبُ لِعَصَبَةٍ أَوْ يَدْعُو إِلَى عَصَبَةٍ أَوْ يَنْصُرُ عَصَبَةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلاَ يَتَحَاشَ مِنْ مُؤْمِنِهَا وَلاَ يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ<\/p>\n<p><strong>Whoever withdraws from lawful obedience to the leader and divides the community and dies in this state, he will have died upon ignorance. Whoever fights under a banner of blindness, raging for the sake of tribalism, or calling to tribalism, or supporting tribalism and he is killed in this state, he will have died upon ignorance. Whoever rebels against my nation, striking the righteous and wicked alike, sparing not even their believers and he does not fulfill the pledge of security to whom it is due, he has nothing to do with me and I have nothing to do with him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1848, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/14\/prophet-disavows-tribalism-terrorism\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Tabari reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأتت الخوارج قريته فأخذوه وأخذوا ابنته فقدموا ابنته فقتلوها وزعم لي أبو الربيع السلولي أن اسم ابنته أم يزيد وأنها كانت تقول لهم يا أهل الإسلام إن أبي مصاب فلا تقتلوه وأما أنا فإنما أنا جارية والله ما أتيت فاحشة قط ولا آذيت جارة لي ولا تطلعت ولا تشرفت قط فقدموها ليقتلوها فأخذت تنادي ما ذنبي ما ذنبي ثم سقطت مغشيا عليها أو ميتة  ثم قطعوها بأسيافهم<\/p>\n<p>The Khawarij rebels came to a village and they seized a man and his daughter. She said to them, &#8216;O people of Islam! Indeed, my father is an old man so do not kill him, and I am only a girl. By Allah, I have never been immoral and I have never harmed anyone.&#8217; They brought her to kill her and she kept saying, &#8216;What is my sin? What is my sin?&#8217; Then she fainted and they killed her with their swords.<\/p>\n<p>Source: Tārīkh al-Ṭabarī 6\/124<\/p><\/blockquote>\n<p>And Ibn Kathir writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذْ لَوْ قَوُوا هَؤُلَاءِ لَأَفْسَدُوا الْأَرْضَ كُلَّهَا عِرَاقًا وَشَامًا وَلَمْ يَتْرُكُوا طِفْلًا وَلَا طِفْلَةَ وَلَا رَجُلًا وَلَا امْرَأَةً لِأَنَّ النَّاسَ عِنْدَهُمْ قَدْ فَسَدُوا فَسَادًا لَا يُصْلِحُهُمْ إِلَّا الْقَتْلُ جُمْلَةً<\/p>\n<p>If the Khawarij rebels ever gained power, they would corrupt the entire earth, Iraq, and Syria. They would not leave a boy or a girl or a man or a woman alone, for in their view the people have become so corrupt that they cannot be reformed except by mass killing.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 10\/584<\/p><\/blockquote>\n<p><strong><u>Hadith 21 – Jihad without Fighting<\/u><\/strong><\/p>\n<p>Ka’b ibn ‘Ujrah reported: A man passed by the Prophet, peace and blessings be upon him, and the companions of the Messenger of Allah saw his endurance and vigor. They said, “O Messenger of Allah, if only this man was acting in the way of Allah!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ كَانَ خَرَجَ يَسْعَى عَلَى وَلَدِهِ صِغَارًا فَهُوَ فِي سَبِيلِ اللهِ وَإِنْ كَانَ خَرَجَ يَسْعَى عَلَى أَبَوَيْنِ شَيْخَيْنِ كَبِيرَيْنِ فَهُوَ فِي سَبِيلِ اللهِ وَإِنْ كَانَ يَسْعَى عَلَى نَفْسِهِ يُعِفُّهَا فَهُوَ فِي سَبِيلِ اللهِ وَإِنْ كَانَ خَرَجَ رِيَاءً وَمُفَاخَرَةً فَهُوَ فِي سَبِيلِ الشَّيْطَانِ<\/p>\n<p><strong>If he goes out striving for his small children, he is in the way of Allah. If he goes out striving for his elderly parents, he is in the way of Allah. If he goes out striving for himself to abstain from wrongdoing, he is in the way of Allah. If he goes out vainly and boasting, he is in the way of Satan.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 19\/129, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/08\/26\/jihad-supporting-family\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا سَبِيلُ اللَّهِ إِلا مَنْ قَتَلَ مَنْ سَعَى عَلَى وَالِدَيْهِ فَفِي سَبِيلِ اللَّهِ وَمَنْ سَعَى عَلَى عِيَالِهِ فَفِي سَبِيلِ اللَّهِ وَمَنْ سَعَى عَلَى نَفْسِهِ لِيُعِفَّهَا فَفِي سَبِيلِ اللَّهِ وَمَنْ سَعَى عَلَى التَّكَاثُرِ فَهُوَ فِي سَبِيلِ الشَّيْطَانِ<\/p>\n<p><strong>Is there nothing in the path of Allah but fighting? Whoever strives for his parents is in the way of Allah. Whoever strives for his family is in the way of Allah. Whoever strives for himself to be independent is in the way of Allah. Whoever strives to gain many possessions for himself is in the way of Satan.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 17824, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/02\/09\/nothing-in-jihad-but-qital\/\"><em>Jayyid<\/em><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 22 – Helping the Poor in the Way of Allah<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ أَوْ الْقَائِمِ اللَّيْلَ الصَّائِمِ النَّهَارَ<\/p>\n<p><strong>One who lends effort to the widows and the poor is like one waging jihad in the way of Allah, or one who regularly prays at night and fasts during the day<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5353, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/22\/helping-poor-jihad-fi-sabil-allah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 23 – Charity in the Way of Allah<\/u><\/strong><\/p>\n<p>Rafi’ ibn Khadij reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْعَامِلُ عَلَى الصَّدَقَةِ بِالْحَقِّ كَالْغَازِي فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ إِلَى بَيْتِهِ<\/p>\n<p><strong>One who works for charity in a just cause is like one who campaigns in the way of Allah until he returns home<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 645, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/17\/sadaqah-jihad-fi-sabil-allah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 24 – Seeking Knowledge in the Way of Allah<\/u><\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ خَرَجَ فِي طَلَبِ الْعِلْمِ كَانَ فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ<\/p>\n<p><strong>Whoever goes out seeking knowledge is in the way of Allah until he returns.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2647, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/02\/20\/seeking-knowledge-jihad\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Darda, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ رَأَى الْغُدُوَّ وَالرَّوَاحَ إِلَى الْعِلْمِ لَيْسَ بِجِهَادٍ فَقَدْ نَقَصَ عَقْلُهُ وَرَأْيُهُ<\/p>\n<p>Whoever does not consider coming and going for the sake of knowledge to be an act of jihad, he has a shortcoming in his mind and his opinion.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/01\/25\/abu-darda-ilm-jihad\/\">Jāmi’ Bayān al-‘Ilm wa Faḍlih 159<\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 25 – Teaching Islam in the Way of Allah<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ دَخَلَ مَسْجِدَنَا هَذَا لِيَتَعَلَّمَ خَيْرًا أَوْ يُعَلِّمَهُ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَمَنْ دَخَلَهُ لِغَيْرِ ذَلِكَ كَانَ كَالنَّاظِرِ إِلَى مَا لَيْسَ لَهُ<\/p>\n<p><strong>Whoever enters our mosque to teach goodness, or to learn it himself, is like one waging jihad in the way of Allah. Whoever enters it for another reason, he is an observer of what does not belong to him<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 87, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/12\/masjid-learning-jihad\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Bakr ibn Abdur Rahman, may Allah have mercy on him, used to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ غَدَا أَوْ رَاحَ إِلَى الْمَسْجِدِ لَا يُرِيدُ غَيْرَهُ لِيَتَعَلَّمَ خَيْرًا أَوْ لِيُعَلِّمَهُ ثُمَّ رَجَعَ إِلَى بَيْتِهِ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ رَجَعَ غَانِمًا<\/p>\n<p>Whoever departs to the mosque in the morning, intending to go nowhere else and to teach goodness or to learn it himself, then he returns to his house, he is like one who wages jihad in the way of Allah and returns with spoils.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/13\/malik-teaching-learning-jihad\/\">al-Muwaṭṭa&#8217; Riwāyat al-Zuhrī 529<\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 26 – Serving Parents in the Way of Allah<\/u><\/strong><\/p>\n<p>Abdullah ibn Amr reported: A man came to the Prophet, peace and blessings be upon him, asking permission to wage jihad. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَحَيٌّ وَالِدَاكَ<\/p>\n<p><strong>Are your parents alive?<\/strong><\/p><\/blockquote>\n<p>The man said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَفِيهِمَا فَجَاهِدْ<\/p>\n<p><strong>Then strive in the service of them both.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3004, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/08\/31\/jihad-for-your-parents\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, a man came to the Prophet, peace and blessings be upon him, and he said, “O Messenger of Allah, I intend to join the military expedition, and I seek your counsel.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَلْ لَكَ مِنْ أُمٍّ<\/p>\n<p><strong>Do you have a mother?<\/strong><\/p><\/blockquote>\n<p>He said yes. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْزَمْهَا فَإِنَّ الْجَنَّةَ تَحْتَ رِجْلَيْهَ<\/p>\n<p><strong>Stay with her, for Paradise is beneath her feet.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3104, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/19\/jannah-is-under-her-feet\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 27 – Hajj Pilgrimage in the Way of Allah<\/u><\/strong><\/p>\n<p>Aisha reported: I said, “O Messenger of Allah, is jihad a duty upon women?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ الْحَجُّ وَالْعُمْرَةُ<\/p>\n<p><strong>Yes, jihad is a duty upon them in which there is no fighting: the Hajj and &#8216;Umrah pilgrimages.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2901, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/03\/jihad-no-war-combat-killing\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, it was said, “O Messenger of Allah, shall we not attend the military expeditions and fight in jihad alongside you?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَكِنَّ أَحْسَنَ الْجِهَادِ وَأَجْمَلَهُ الْحَجُّ حَجٌّ مَبْرُورٌ<\/p>\n<p><strong>No, rather the best and most beautiful jihad for you is the Hajj, a righteous pilgrimage.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1861, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/best-jihad-women-hajj-umrah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ وَلَا تُسَافِرَنَّ امْرَأَةٌ إِلَّا وَمَعَهَا مَحْرَمٌ<\/p>\n<p><strong>A man should not be alone with a woman, nor should a woman travel unless a guardian is with her.<\/strong><\/p><\/blockquote>\n<p>A man stood up and said, “O Messenger of Allah, I have been assigned to a military expedition, but my wife has already left for the Hajj pilgrimage.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اذْهَبْ فَحُجَّ مَعَ امْرَأَتِكَ<\/p>\n<p><strong>Go and perform the pilgrimage with your wife.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3006, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/go-to-hajj-with-wife\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 28 – Jihad with the Tongue in the Way of Allah<\/u><\/strong><\/p>\n<p>Tariq ibn Shihab reported: A man asked the Prophet, peace and blessings be upon him, while he had his leg in the stirrup, “Which jihad is best?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَلِمَةُ حَقٍّ عِنْدَ سُلْطَانٍ<\/p>\n<p><strong>A word of truth before a tyrannical ruler.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 4209, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/29\/best-jihad-word-haqq-truth\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَلِمَةُ حَقٍّ تُقَالُ لإِمَامٍ جَائِرٍ<\/p>\n<p><strong>A word of truth before a tyrannical leader<\/strong>.<\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 20185, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/29\/beloved-jihad-word-haqq-justice\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْظَمِ الْجِهَادِ كَلِمَةَ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ<\/p>\n<p><strong>Verily, among the greatest acts of jihad is a word of justice before a tyrannical ruler<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 2174, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/13\/greatest-jihad-word-haqq-truth\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اذْهَبَا إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ فَقُولَا لَهُ قَوْلًا لَّيِّنًا لَّعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَىٰ<\/p>\n<p><strong>Go to Pharaoh, both of you, for he has transgressed. Speak to him mildly that perhaps he will remember or fear Allah.<\/strong><\/p>\n<p>Surat Ta Ha 20:44-45<\/p><\/blockquote>\n<p>Al-Baghawi reported: A man recited this verse in front of Yahya ibn Mu’adh, may Allah have mercy on him, and he began to weep. Yahya said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِلَهِي هَذَا رِفْقُكَ بِمَنْ يَقُولُ أَنَا الْإِلَهُ فَكَيْفَ رِفْقُكَ بِمَنْ يَقُولُ أَنْتَ الْإِلَهُ<\/p>\n<p>My God, this is Your gentleness with one who claims to be God, then how is Your gentleness with one who says You are God?<\/p>\n<p>Source: Tafsīr al-Baghawī 20:44<\/p><\/blockquote>\n<p><strong><u>Hadith 29 – Soldiers in the Way of Allah Protected from Hellfire<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي وَجْهِ رَجُلٍ أَبَدًا وَلاَ يَجْتَمِعُ الشُّحُّ وَالإِيمَانُ فِي قَلْبِ عَبْدٍ أَبَدًا<\/p>\n<p><strong>The dust in the way of Allah and the smoke of Hell can never be combined on the face of a man. Greed and faith can never be combined in the heart.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3111, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/27\/iman-shuhh-combined\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللهِ وَدُخَانُ جَهَنَّمَ<\/p>\n<p><strong>The dust in the way of Allah will never combine with the smoke of Hell.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1633, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/23\/dust-jihad-dukhan-jahannam\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 30 – Believers who enter Paradise without Military Service<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ آمَنَ بِاللَّهِ وَبِرَسُولِهِ وَأَقَامَ الصَّلَاةَ وَصَامَ رَمَضَانَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ جَاهَدَ فِي سَبِيلِ اللَّهِ أَوْ جَلَسَ فِي أَرْضِهِ الَّتِي وُلِدَ فِيهَا<\/p>\n<p><strong>Whoever has faith in Allah and His Messenger, establishes prayer, and fasts the month of Ramadan, he will have a right upon Allah that he will enter Paradise, whether he wages jihad in the way of Allah or remains in his homeland.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, shall we not give the glad tidings to people?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ أَعَدَّهَا اللَّهُ لِلْمُجَاهِدِينَ فِي سَبِيلِ اللَّهِ مَا بَيْنَ الدَّرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ فَإِذَا سَأَلْتُمُ اللَّهَ فَاسْأَلُوهُ الْفِرْدَوْسَ فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَأَعْلَى الْجَنَّةِ أُرَاهُ فَوْقَهُ عَرْشُ الرَّحْمَنِ وَمِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ<\/p>\n<p><strong>Verily, in Paradise are one hundred levels which Allah has reserved for those who strive in jihad in His way; the distance between two levels is like the distance between the heavens and the earth. When you ask Allah, ask for al-Firdaws, as it is the best and highest level of Paradise, above which is the Throne of the Most Merciful from which the rivers of Paradise flow<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2790, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/09\/faith-enters-paradise-jihad-or-not\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 31 – Remembrance of Allah is Greater than Battle<\/u><\/strong><\/p>\n<p>Abu Darda reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُنَبِّئُكُمْ بِخَيْرِ أَعْمَالِكُمْ وَأَزْكَاهَا عِنْدَ مَلِيكِكُمْ وَأَرْفَعِهَا فِي دَرَجَاتِكُمْ وَخَيْرٌ لَكُمْ مِنْ إِنْفَاقِ الذَّهَبِ وَالْوَرِقِ وَخَيْرٌ لَكُمْ مِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَضْرِبُوا أَعْنَاقَهُمْ وَيَضْرِبُوا أَعْنَاقَكُمْ<\/p>\n<p><strong>Shall I not tell you of the best of your deeds, which is the purest to your King, which raises you among your ranks, which is better for you than spending gold and money in charity, and which is better for you than meeting your enemy and striking the necks of each other?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذِكْرُ اللَّهِ تَعَالَى<\/p>\n<p><strong>It is the remembrance of Allah Almighty.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3377, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/29\/dhikr-better-than-jihad-qital\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 32 – Prayer is Better than Spoils of War<\/u><\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, once dispatched a company. They acquired spoils and rushed back to tell people how close their battle was, how many their spoils were, and how quickly they returned. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَدُلُّكُمْ عَلَى أَقْرَبَ مِنْهُ مَغْزًى وَأَكْثَرَ غَنِيمَةً وَأَوْشَكَ رَجْعَةً مَنْ تَوَضَّأَ ثُمَّ غَدَا إِلَى الْمَسْجِدِ لِسُبْحَةِ الضُّحَى فَهُوَ أَقْرَبُ مَغْزًى وَأَكْثَرُ غَنِيمَةً وَأَوْشَكُ رَجْعَةً<\/p>\n<p><strong>Shall I not tell you what is closer than a battle, more plentiful than spoils, and a swifter return? One who performs ablution, then goes to the mosque in the morning to glorify Allah in the forenoon. It is a closer battle, more plentiful spoils, and a swifter return.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6638, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/duha-better-than-spoils\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلاَ أَدُلُّكُمْ عَلَى قَوْمٍ أَفْضَلُ غَنِيمَةً وَأَسْرَعُ رَجْعَةً قَوْمٌ شَهِدُوا صَلاَةَ الصُّبْحِ ثُمَّ جَلَسُوا يَذْكُرُونَ اللَّهَ حَتَّى طَلَعَتِ الشَّمْسُ فَأُولَئِكَ أَسْرَعُ رَجْعَةً وَأَفْضَلُ غَنِيمَةً<\/p>\n<p><strong>Shall I not tell you about a people with better spoils and a swifter return? People who attend the dawn prayer, then sit remembering Allah until the sun rises. These have a swifter return and better spoils.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3561, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/dhikr-better-spoils\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكُمْ بِأَسْرَعَ كَرَّةً وَأَعْظَمَ غَنِيمَةً مِنْ هَذَا الْبَعْثِ رَجُلٌ تَوَضَّأَ فِي بَيْتِهِ فَأَحْسَنَ وُضُوءَهُ ثُمَّ تَحَمَّلَ إِلَى الْمَسْجِدِ فَصَلَّى فِيهِ الْغَدَاةَ ثُمَّ عَقَّبَ بِصَلَاةِ الضُّحَى فَقَدْ أَسْرَعَ الْكَرَّةَ وَأَعْظَمَ الْغَنِيمَةَ<\/p>\n<p><strong>Shall I not tell you of a swifter return and greater spoils than this company? A man who performs ablution in the best manner, then sets out to the mosque to pray in it in the morning and ends with forenoon prayer. He has a swifter return and greater spoils.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 2535, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/30\/salat-al-duha-fi-masjid\/\"><em>Jayyid<\/em><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 33 – No reward if Fighting for Spoils<\/u><\/strong><\/p>\n<p>Abu Huraira reported: A man said, “O Messenger of Allah, a man intends to fight for the sake of Allah, and he is seeking worldly gains.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him<\/strong>.<\/p><\/blockquote>\n<p>The people found that very difficult, so they said, “Return to the Messenger of Allah, for perhaps he did not understand you.” The man returned, and he said, “O Messenger of Allah, a man intends to fight for the sake of Allah, and he is seeking worldly gain.” The Messenger of Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him<\/strong>.<\/p><\/blockquote>\n<p>Then he returned a third time, and the Messenger of Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7887, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/27\/anfal-jihad-no-reward-for-booty\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Umamah reported: A man came to the Prophet, peace and blessings be upon him, and he said, “If a man battles for the sake of reward and fame, what do you think he has?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا شَيْءَ لَهُ<\/p>\n<p><strong>He has nothing<\/strong>.<\/p><\/blockquote>\n<p>The man repeated his question three times, and the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا شَيْءَ لَهُ<\/p>\n<p><strong>He has nothing<\/strong>.<\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَقْبَلُ مِنْ الْعَمَلِ إِلَّا مَا كَانَ لَهُ خَالِصًا وَابْتُغِيَ بِهِ وَجْهُهُ<\/p>\n<p><strong>Verily, Allah does not accept any good deeds unless they are done sincerely and in pursuit of His countenance.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3140, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/01\/27\/sincerity-allah-only-accepts\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ غَزَا فِي سَبِيلِ اللَّهِ وَلَمْ يَنْوِ إِلَّا عِقَالًا فَلَهُ مَا نَوَى<\/p>\n<p><strong>Whoever joins a military campaign in the way of Allah with no intention but to acquire as much as a rope in spoils, he will only have what he intended.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3138, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/09\/22\/no-reward-jihad-spoils\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 34 – Reward of the Citizen Soldier<\/u><\/strong><\/p>\n<p>Zayd ibn Khalid reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا وَمَنْ خَلَفَ غَازِيًا فِي سَبِيلِ اللَّهِ بِخَيْرٍ فَقَدْ غَزَا<\/p>\n<p><strong>Whoever equips a soldier in the way of Allah, or who cares for the family of a soldier in the way of Allah, he will receive the reward as if he went into battle himself<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2843, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/20\/jihad-helping-defenders\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 35 – Forgiveness for Acts of Cowardice<\/u><\/strong><\/p>\n<p>Zayd ibn Harithah reported:  The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَالَ أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيَّ الْقَيُّومَ وَأَتُوبُ إِلَيْهِ غُفِرَ لَهُ وَإِنْ كَانَ فَرَّ مِنْ الزَّحْفِ<\/p>\n<p><strong>Whoever says this supplication, ‘I seek forgiveness from Allah Almighty, besides whom there is no God, the Living, the Sustainer, and I repent to him,’ then Allah will forgive him, even if he fled from battle.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3577, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/dua-repentance-fled-battle\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَقُولُ رَجُلٌ أَسْتَغْفِرُ اللهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ ثَلَاثَ مَرَّاتٍ إِلَّا غُفِرَ لَهُ وَإِنْ كَانَ فَرَّ مِنَ الزَّحْفِ<\/p>\n<p>No man says three times, ‘I seek forgiveness from Allah, besides whom there is no God, the Living, the Sustainer, and I repent to Him,’ except that he will be forgiven, even if he fled from battle.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 8541, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/08\/31\/tawbah-coward\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 36 – Prohibition of Violating Peace Treaties<\/u><\/strong><\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا جَمَعَ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ يَوْمَ الْقِيَامَةِ يُرْفَعُ لِكُلِّ غَادِرٍ لِوَاءٌ فَقِيلَ هَذِهِ غَدْرَةُ فُلاَنِ بْنِ فُلاَنٍ<\/p>\n<p><strong>When Allah gathers the earlier and later generations on the Day of Resurrection, He will raise a banner for every treacherous person. It will be announced that this is the treachery of this person, the son of this person.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6178, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/22\/banner-yawm-al-qiyamah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Sulaym ibn Amir reported: There was a peace treaty between Mu’awiyah and the Romans. He was marching towards their country, and when the treaty ended, he would surprise attack them. A man came on a horse, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُ أَكْبَرُ وَفَاءٌ لَا غَدْرٌ<\/p>\n<p>Allah is Greatest! Let there be faithfulness and not treachery!<\/p><\/blockquote>\n<p>They found that he was ‘Amr ibn ‘Abasah. Mu’awiyah sent for him and questioned him about that. ‘Amr said: I heard the Messenger of Allah, peace and blessings be upon him, say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَ بَيْنَهُ وَبَيْنَ قَوْمٍ عَهْدٌ فَلَا يَحُلَّنَّ عَهْدًا وَلَا يَشُدَّنَّهُ حَتَّى يَمْضِيَ أَمَدُهُ أَوْ يَنْبِذَ إِلَيْهِمْ عَلَى سَوَاءٍ قَالَ فَرَجَعَ مُعَاوِيَةُ بِالنَّاسِ<\/p>\n<p><strong>If one has a covenant with people, he must not strengthen or loosen it until its term comes to an end, or he brings it to an end in agreement with them.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1580, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/12\/19\/treachery-forbidden-haram\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِيمَانَ لِمَنْ لَا أَمَانَةَ لَهُ وَلَا دِينَ لِمَنْ لَا عَهْدَ لَهُ<\/p>\n<p><strong>There is no faith for one who cannot be trusted. There is no religion for one who cannot uphold a covenant<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 12383, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/13\/no-iman-cannot-promise\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><strong><u>Hadith 37 – Prohibition of Violating Civil Immunity<\/u><\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ نَفْسًا مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا يُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا<\/p>\n<p><strong>Whoever kills a person protected by a treaty will never smell the fragrance of Paradise. Verily, its fragrance can be found from a distance of forty years of travel<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6914, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/06\/11\/break-peace-treaty-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ<\/p>\n<p><strong>Whoever kills a person protected by a treaty without a just cause, Allah has forbidden Paradise for him<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 2760, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/21\/break-peace-treaty-no-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ ظَلَمَ مُعَاهِدًا أَوْ انْتَقَصَهُ أَوْ كَلَّفَهُ فَوْقَ طَاقَتِهِ أَوْ أَخَذَ مِنْهُ شَيْئًا بِغَيْرِ طِيبِ نَفْسٍ فَأَنَا حَجِيجُهُ يَوْمَ الْقِيَامَةِ<\/p>\n<p><strong>Whoever wrongs a person protected by a covenant, violates his rights, burdens him with more work than he can do, or takes something from him without his consent, I will be his prosecutor on the Day of Resurrection.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3052, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/16\/prophet-testifies-dhimmi\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا وَإِنِّي وَاللَّهِ قَدْ وَعَظْتُ وَأَمَرْتُ وَنَهَيْتُ عَنْ أَشْيَاءَ إِنَّهَا لَمِثْلُ الْقُرْآنِ أَوْ أَكْثَرُ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يُحِلَّ لَكُمْ أَنْ تَدْخُلُوا بُيُوتَ أَهْلِ الْكِتَابِ إِلَّا بِإِذْنٍ وَلَا ضَرْبَ نِسَائِهِمْ وَلَا أَكْلَ ثِمَارِهِمْ إِذَا أَعْطَوْكُمُ الَّذِي عَلَيْهِمْ<\/p>\n<p><strong>No doubt, by Allah, I have admonished you, commanded you, and prohibited you from things like those in the Quran or even more. Verily, Allah Almighty has not made it lawful for you to enter the houses of the People of the Book without their permission, nor strike their women, nor eat from their fruits if they give you what is due upon them.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3050, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2022\/07\/20\/rights-dhimmi\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 38 – Prohibition of Assassination<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْإِيمَانُ قَيَّدَ الْفَتْكَ لَا يَفْتِكُ مُؤْمِنٌ<\/p>\n<p><strong>Faith has restrained assassination. A believer does not assassinate<\/strong>.<\/p>\n<p>Source: Sunan Abī Dāwūd 2769, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/20\/believers-do-not-assassinate\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Azimabadi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَى الْحَدِيثِ أَنَّ الْإِيمَانَ يَمْنَعُ مِنَ الْفَتْكِ الَّذِي هُوَ الْقَتْلُ بَعْدَ الْأَمَانِ غَدْرًا<\/p>\n<p>The meaning of the tradition is that faith prohibits assassination, which is to treacherously kill a person after pledging them security.<\/p>\n<p>Source: ‘Awn al-Maʻbūd 7\/324<\/p><\/blockquote>\n<p>Malik reported: A man from the people of Kufa said that Umar ibn al-Khattab, may Allah be pleased with him, wrote to a commander in an army he had dispatched, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ بَلَغَنِي أَنَّ رِجَالًا مِنْكُمْ يَطْلُبُونَ الْعِلْجَ حَتَّى إِذَا أَسْنَدَ فِي الْجَبَلِ وَامْتَنَعَ قَالَ رَجُلٌ مَطْرَسْ يَقُولُ لَا تَخَفْ فَإِذَا أَدْرَكَهُ قَتَلَهُ وَإِنِّي وَالَّذِي نَفْسِي بِيَدِهِ لَا أَعْلَمُ مَكَانَ وَاحِدٍ فَعَلَ ذَلِكَ إِلَّا ضَرَبْتُ عُنُقَهُ<\/p>\n<p>I have heard that it is the habit of some of your men to chase an unbeliever until he takes refuge in a high place. Then, a man tells him in Persian not to be afraid, and when he comes down, they kill him. By Him in whose hand is my soul, if I knew a man had done that once, I would strike his neck.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/03\/13\/umar-betrayal-kafir\/\">al-Muwaṭṭa’ Riwāyat Yaḥyā 1630<\/a><\/p><\/blockquote>\n<p>And Umar ibn Al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهِ لَوْ أَنَّ أَحَدَكُمْ أَشَارَ بِأُصْبُعِهِ إِلَى السَّمَاءِ إِلَى مُشْرِكٍ فَنَزَلَ إِلَيْهِ عَلَى ذَلِكَ فَقَتَلَهُ لَقَتَلْتُهُ بِهِ<\/p>\n<p>By Allah, if one of you were to give a gesture of safety to an idolater and he came trusting you and you killed him, then I would execute him for it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/03\/13\/umar-execute-for-treachery\/\">Sunan Sa’īd ibn Manṣūr 2597<\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 39 – Intention of Martyrdom<\/u><\/strong><\/p>\n<p>Sahl ibn Hunayf reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ<\/p>\n<p><strong>Whoever honestly asks Allah for martyrdom, Allah will grant him martyrdom even if he dies in his own bed.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1909, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/04\/sincerely-asks-for-martyrdom\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Hasan al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْعَبْدَ لَيُجَاهِدُ فِي اللَّهِ حَقَّ جِهَادِهِ وَمَا ضَرَبَ بِسَيْفٍ<\/p>\n<p>Verily, the servant may wage jihad for the sake of Allah, jihad as is due to Him, without ever striking anything with a sword.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/04\/jihad-without-swords\/\">Tafsīr Ibn Abī Ḥātim 29:6<\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 40 – Souls of the Martyrs in Green Birds of Paradise<\/u><\/strong><\/p>\n<p>Ka’b ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَرْوَاحَ الشُّهَدَاءِ فِي طَيْرٍ خُضْرٍ تَعْلُقُ مِنْ ثَمَرِ الْجَنَّةِ أَوْ شَجَرِ الْجَنَّةِ<\/p>\n<p><strong>Verily, the souls of martyrs are in green birds, hanging from the fruits of Paradise, or the trees of Paradise<\/strong>.<\/p>\n<p>Source: Sunan al-Tirmidhī 1641, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/02\/souls-of-martyrs-green-birds\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِندَ رَبِّهِمْ يُرْزَقُونَ<\/p>\n<p><strong>Do not consider those who are killed in the way of Allah to be dead. Nay, they are alive and their Lord is providing for them.<\/strong><\/p>\n<p>Surat Ali ‘Imran 3:169<\/p><\/blockquote>\n<p><strong><u>Hadith 41 – None wish to return to Earth except the Martyrs<\/u><\/strong><\/p>\n<p>Anas reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَحَدٌ يَدْخُلُ الْجَنَّةَ يُحِبُّ أَنْ يَرْجِعَ إِلَى الدُّنْيَا وَلَهُ مَا عَلَى الْأَرْضِ مِنْ شَيْءٍ إِلَّا الشَّهِيدُ يَتَمَنَّى أَنْ يَرْجِعَ إِلَى الدُّنْيَا فَيُقْتَلَ عَشْرَ مَرَّاتٍ لِمَا يَرَى مِنْ الْكَرَامَةِ<\/p>\n<p><strong>No one who enters Paradise would like to return to the world, even if he could have everything on earth, except for the martyr. He will wish to return to the world and be killed ten more times due to the generous reward he sees.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2817, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/11\/jannah-return-earth-shahid\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p><strong><u>Hadith 42 – Pain of Martyrdom<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا يَجِدُ الشَّهِيدُ مِنْ مَسِّ الْقَتْلِ إِلَّا كَمَا يَجِدُ أَحَدُكُمْ مِنْ مَسِّ الْقَرْصَةِ<\/p>\n<p><strong>The martyr does not feel the pain of being killed except as one of you feels the pinch of an insect bite.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1668, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/09\/martyrs-protected-pain-death\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>Hadith 43 – Martyrs are Forgiven except for Sins against Human Beings<\/u><\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُغْفَرُ لِلشَّهِيدِ كُلُّ ذَنْبٍ إِلَّا الدَّيْنَ<\/p>\n<p><strong>The martyr is forgiven for every sin except debt.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1886, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/01\/13\/martyr-forgiven-except-debt\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Nawawi commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَفِيهِ تَنْبِيهٌ عَلَى جَمِيعِ حُقُوقِ الْآدَمِيِّينَ وَأَنَّ الْجِهَادَ وَالشَّهَادَةَ وَغَيْرَهُمَا مِنْ أَعْمَالِ الْبِرِّ لَا يُكَفِّرُ حُقُوقَ الْآدَمِيِّينَ وَإِنَّمَا يُكَفِّرُ حُقُوقَ اللَّهِ تَعَالَى<\/p>\n<p>This is a warning in regards to all the rights of human beings, that jihad, martyrdom, and other deeds of righteousness do not expiate violations against the rights of human beings. Indeed, they only expiate violations against the rights of Allah Almighty.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 1885<\/p><\/blockquote>\n<p><strong><u>Hadith 44 – Martyrdom without Fighting<\/u><\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>The martyrs are five kinds: one who dies of plague, one who dies of stomach infection, one who drowns, one who dies under debris, and one who dies in the way of Allah Almighty.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2829, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/08\/five-martyrs-without-battle\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشَّهَادَةُ سَبْعٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ الْمَطْعُونُ شَهِيدٌ وَالْغَرِقُ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَصَاحِبُ الْحَرِيقِ شَهِيدٌ وَالَّذِي يَمُوتُ تَحْتَ الْهَدْمِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدٌ<\/p>\n<p><strong>There are seven martyrs besides one who is killed in the way of Allah: the victim of plague is a martyr, the one who drowns is a martyr, the one who dies of chest pain is a martyr, the one who dies of stomach infection is a martyr, the one who burns to death is a martyr, the one who dies under rubble is a martyr, and the pregnant woman who dies in labor is a martyr.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3111, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/11\/seven-martyrs-besides-jihad\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا تَعُدُّونَ الشَّهِيدَ فِيكُمْ<\/p>\n<p><strong>Who do you consider a martyr among you<\/strong>?<\/p><\/blockquote>\n<p>They said, “The one who is killed in the way of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ شُهَدَاءَ أُمَّتِي إِذًا لَقَلِيلٌ<\/p>\n<p><strong>If that were so, there are few martyrs in my nation.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, then who are the martyrs?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي الطَّاعُونِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي الْبَطْنِ فَهُوَ شَهِيدٌ<\/p>\n<p><strong>One who is killed in the way of Allah is a martyr, one who dies in the way of Allah is a martyr, one who dies of plague is a martyr, one who dies of stomach infection is a martyr, and one who dies from drowning is a martyr<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1915, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/08\/who-is-a-martyr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Aisha reported: She asked the Messenger of Allah, peace and blessings be upon him, about plagues, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ مِنْ عَبْدٍ يَقَعُ الطَّاعُونُ فَيَمْكُثُ فِي بَلَدِهِ صَابِرًا يَعْلَمُ أَنَّهُ لَنْ يُصِيبَهُ إِلَّا مَا كَتَبَ اللَّهُ لَهُ إِلَّا كَانَ لَهُ مِثْلُ أَجْرِ الشَّهِيدِ<\/p>\n<p><strong>Any servant who resides in a land afflicted by plague, remaining patient and hoping in reward from Allah, knowing that nothing will befall him but what Allah has decreed, then he will be given the reward of a martyr<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5734, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/12\/13\/believers-die-plague-martyrs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><strong><u>Hadith 45 – Allah alone knows the True Martyrs<\/u><\/strong><\/p>\n<p>Umar ibn al-Khattab reported: On the day of Khaybar, some of the companions were saying, “Such person is a martyr. Such person is a martyr.” Then, they passed by a man and they said, “Such person is a martyr.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَلَّا إِنِّي رَأَيْتُهُ فِي النَّارِ فِي بُرْدَةٍ غَلَّهَا أَوْ عَبَاءَةٍ<\/p>\n<p><strong>Surely not! I saw him in the Hellfire because of a cloak or garment he had plundered<\/strong>.<\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا ابْنَ الْخَطَّابِ اذْهَبْ فَنَادِ فِي النَّاسِ أَنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا الْمُؤْمِنُونَ<\/p>\n<p><strong>O son of al-Khattab, go and announce to people that no one will enter Paradise but a believer<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ Muslim 114, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/20\/man-appears-as-martyr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُسْلِمَةٌ وَإِنَّ اللَّهَ لَيُؤَيِّدُ هَذَا الدِّينَ بِالرَّجُلِ الْفَاجِرِ<\/p>\n<p><strong>Verily, no one will enter Paradise but a soul submissive to Allah, yet Allah may support this religion by the hands of a wicked man.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3062, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/04\/03\/faith-allah-make-use-wicked-man\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu al-‘Ajfa reported: Umar ibn al-Khattab, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَقُولُونَهَا لِمَنْ قُتِلَ فِي مَغَازِيكُمْ أَوْ َمَاتَ قُتِلَ فُلانٌ شَهِيدًا وَمَاتَ فُلانٌ شَهِيدًا وَلَعَلَّهُ أَنْ يَكُونَ قَدْ أَوْقَرَ عَجُزَ دَابَّتِهِ أَوْ دَفَّ رَاحِلَتِهِ ذَهَبًا أَوْ وَرِقًا يَلْتَمِسُ التِّجَارَةَ لَا تَقُولُوا ذَاكُمْ وَلَكِنْ قُولُوا كَمَا قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَنْ قُتِلَ أَوْ مَاتَ فِي سَبِيلِ اللهِ فَهُوَ فِي الْجَنَّةِ<\/p>\n<p>You say about those who are killed or who died in your campaigns that ‘this person was killed as a martyr’ or ‘this person died as a martyr.’ Perhaps he only intended to load his animal with spoils, or cover his mount in gold, or pursue his business. Do not say that, but rather say as the Prophet, peace and blessings be upon him, said: <strong>Whoever is killed or died in the way of Allah is in Paradise<\/strong>.<\/p>\n<p>Source: Musnad Aḥmad 285, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/20\/cannot-claim-specific-person-is-martyr\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn Hajar commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُقَالُ فُلَانٌ شَهِيدٌ أَيْ عَلَى سَبِيلِ الْقَطْعِ بِذَلِكَ إِلَّا إِنْ كَانَ بِالْوَحْيِ<\/p>\n<p>It is not said that a specific person is a martyr, meaning definitively, unless it is by divine revelation.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/90<\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;He who fights to raise the word of Allah is in the way of Allah.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[61,17,133,492,183,262,26,27,88,135,32,34,37,47,48,120,50,51,100,482,54,56,134,92,220,72,73,98,179,128],"class_list":["post-24157","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-call-to-islam-dawah","tag-charity-al-sadaqah","tag-covenants","tag-cowardice-al-jubn","tag-day-of-resurrection-yawm-al-qiyammah","tag-death-mawt","tag-forgiveness-al-maghfirah","tag-god-fearing-taqwa","tag-pilgrimage-hajj","tag-hellfire-jahannam","tag-hereafter-akhirah","tag-humanity-al-insaaniyyah","tag-idolatry-shirk","tag-jihad","tag-justice-adl","tag-rebels-khawarij","tag-knowledge","tag-leadership-imamate","tag-manners-al-adab","tag-martyrs-al-shuhada","tag-mercy-al-rahmah","tag-monotheism-tawheed","tag-paradise-jannah","tag-providence-al-qada-wal-qadr","tag-supplication-al-dua","tag-truthfulness-al-sidq","tag-umar-ibn-al-khattab","tag-unbelief-al-kufr","tag-virtue-al-fadilah","tag-women-nisa"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6hD","jetpack-related-posts":[{"id":17171,"url":"https:\/\/www.abuaminaelias.com\/purpose-armed-jihad-islam\/","url_meta":{"origin":24157,"position":0},"title":"Purpose of armed jihad in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"He who fights to make the word of Allah highest...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25452,"url":"https:\/\/www.abuaminaelias.com\/jihad-war-peace-in-islam\/","url_meta":{"origin":24157,"position":1},"title":"Jihad, War, and Peace in Islam","author":"Abu Amina Elias","date":"June 26, 2025","format":false,"excerpt":"\"The one who strives in jihad is the one who strives against himself.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15973,"url":"https:\/\/www.abuaminaelias.com\/jihad-sixth-pillar-of-islam\/","url_meta":{"origin":24157,"position":2},"title":"Jihad is the sixth pillar of Islam?","author":"Abu Amina Elias","date":"August 2, 2014","format":false,"excerpt":"\"Islam is built upon five pillars...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16260,"url":"https:\/\/www.abuaminaelias.com\/jihad-against-the-soul-in-islam\/","url_meta":{"origin":24157,"position":3},"title":"Jihad against the soul in Islam","author":"Abu Amina Elias","date":"January 27, 2015","format":false,"excerpt":"\"He has succeeded who purifies the soul,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":24157,"position":4},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17778,"url":"https:\/\/www.abuaminaelias.com\/jihad-to-impose-a-political-system\/","url_meta":{"origin":24157,"position":5},"title":"Fight jihad to impose a political system?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Verily, I have only been sent to perfect righteous character.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/24157","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=24157"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/24157\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=24157"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=24157"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=24157"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}