{"id":24388,"date":"2025-02-18T15:18:30","date_gmt":"2025-02-18T11:18:30","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=24388"},"modified":"2025-03-07T16:30:48","modified_gmt":"2025-03-07T12:30:48","slug":"seeking-help-angels-jinn","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/seeking-help-angels-jinn\/","title":{"rendered":"Seeking help from Angels and Jinn?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>In general, it is not permissible to seek help from angels, jinn, or any beings residing in the Unseen, especially to the exclusion of seeking help from Allah. However, obscure details related to this topic can confuse people and require clarification.<\/p>\n<p>Some scholars have allowed calling upon angels for help if one is lost while traveling. It has been reported that these unique angels were created by Allah for this purpose. These angels are present and capable of assisting in this situation, which are the two conditions necessary for seeking help from creation to be allowed.<\/p>\n<p>Moreover, it is not permissible to draw an analogy from this specific context to another by superstitiously calling upon deceased prophets and saints for help. Acts of worship in Islam, such as prayers and supplications, must be proven from the Quran and Sunnah, not by analogy.<\/p>\n<p>Some of the righteous predecessors acted upon what was reported from the Messenger of Allah, peace and blessings be upon him, that he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ لِلَّهِ مَلائِكَةً فِي الأَرْضِ سِوَى الْحَفَظَةِ يَكْتُبُونَ مَا سَقَطَ مِنْ وَرَقِ الشَّجَرِ فَإِذَا أَصَابَ أَحَدَكُمْ عَرْجَةٌ بِأَرْضٍ فَلاةٍ فَلْيُنَادِ أَعِينُوا عِبَادَ اللَّهِ<\/p>\n<p>Verily, Allah has angels in the earth besides those who record, who write down how many leaves all from the trees. If one of you is lost in the wilderness, let him call out: Help me, servants of Allah!<\/p>\n<p>Source: Musnad al-Bazzār 4922<\/p><\/blockquote>\n<p>This Hadith has been narrated in various ways, sometimes as a statement of the Prophet ﷺ or his companions. Despite potential weaknesses in its chain of narrators, some early Muslim scholars accepted it.<\/p>\n<p>Imam al-Bayhaqi commented on his version:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا مَوْقُوفٌ عَلَى ابْنِ عَبَّاسٍ مُسْتَعْمَلٌ عِنْدَ الصَّالِحِينَ مِنْ أَهْلِ الْعِلْمِ لِوُجُودِ صِدْقِهِ عِنْدَهُمْ فِيمَا جَرَّبُوا<\/p>\n<p>This is the statement of Ibn Abbas and it was acted upon by the righteous among the people of knowledge. They found it to be true in their experience.<\/p>\n<p>Source: al-Ādāb lil-Bayhaqī 657<\/p><\/blockquote>\n<p>One major scholar who is reported to have acted upon this Hadith is Imam Ahmad ibn Hanbal, who is one of the Four Imams. Abdullah, the son of Imam Ahmad, narrated:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَمِعت ابي يَقُول حججْت خمس حجج مِنْهَا ثِنْتَيْنِ رَاكِبًا وَثَلَاثَة مَاشِيا اَوْ ثِنْتَيْنِ مَاشِيا وَثَلَاثَة رَاكِبًا فضللت الطَّرِيق فِي حجَّة وَكنت مَاشِيا فَجعلت اقول يَا عباد الله دلونا على الطَّرِيق فَلم ازل اقول ذَلِك حَتَّى وَقعت الطَّرِيق<\/p>\n<p>I heard my father say: I performed Hajj five times, twice while riding and three times while walking (or twice while walking and three times while riding). I was lost on the road during one Hajj as I as walking, so I said: O servants of Allah, show me the way! I continued to say that until I found the way.<\/p>\n<p>Source: Masāʼil al-Imām Aḥmad 1\/245<\/p><\/blockquote>\n<p>Imam Ahmad understood that these specific angels were created for this purpose and he did not draw an analogy between this situation and other created beings such as prophets, saints, or others. It was known that these angels were present and capable, so calling upon them was not like calling upon Allah in worship.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah, who was a leading expert in the Hanbali school of law, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ الْمَخْلُوقَ يَطْلُبُ مِنْ الْمَخْلُوقِ مَا يَقْدِرُ الْمَخْلُوقُ عَلَيْهِ &#8230; فَأَمَّا مَا لَا يَقْدِرُ عَلَيْهِ إلَّا اللَّهُ تَعَالَى فَلَا يَجُوزُ أَنْ يُطْلَبَ إلَّا مِنْ اللَّهِ سُبْحَانَهُ لَا يُطْلَبُ ذَلِكَ لَا مِنْ الْمَلَائِكَةِ وَلَا مِنْ الْأَنْبِيَاءِ وَلَا مِنْ غَيْرِهِمْ<\/p>\n<p>The creatures may request from other creatures what they are capable of doing… As for what no one is capable of doing except Allah, it is not permissible to request it except from Allah Almighty. It is not permissible to request that from angels, nor prophets, or anyone else.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/329<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ مَضَتْ السُّنَّةُ أَنَّ الْحَيَّ يُطْلَبُ مِنْهُ الدُّعَاءُ كَمَا يُطْلَبُ مِنْهُ سَائِرُ مَا يَقْدِرُ عَلَيْهِ وَأَمَّا الْمَخْلُوقُ الْغَائِبُ وَالْمَيِّتُ فَلَا يُطْلَبُ مِنْهُ شَيْءٌ<\/p>\n<p>It has come in the Sunnah that the living may be asked for their supplication just as they may be requested to do anything they are capable of doing. As for creatures who are absent or deceased, nothing should be sought from them.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/344<\/p><\/blockquote>\n<p>For this reason, it is not reported from Imam Ahmad that he sought the help of angels in any other situation. The principle of his school is that matters of creed and acts of worship, meaning beliefs and deeds by which one grows closer to Allah, must be established by clear-cut texts of divine revelation and not by human reasoning such as analogies. This is called the principle of &#8216;stopping at the texts&#8217; (<em>tawqif<\/em>).<\/p>\n<p>Imam al-Barbahari, an early scholar of the Hanbali school, writes in his treatise on Islamic creed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">واعْلَمْ رَحِمَكَ اللهُ أَنَّه لَيْسَ في السُّنَّةِ قِيَاسٌ ولَا تُضْرَبُ لَهَا الأمْثَالُ ولا تُتَبَّعَ فِيْهَا الأهْوَاءُ وهُوَ التَّصْدِيْقُ بآثارِ رَسُوْلِ الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِلَا كَيْفَ ولَا شَرْحَ ولا يُقَالُ لِمَ ولا كَيْفَ<\/p>\n<p>Know, may Allah have mercy on you, that there is no analogy in (the creed of) the Sunnah, nor drawing comparisons, nor following whims. It is the affirmation of the reports about the Messenger of Allah, peace and blessings be upon him, without modality or elaboration. It is not said ‘why’ or ‘how’ it is so.<\/p>\n<p>Source: Sharḥ al-Sunnah 1\/39<\/p><\/blockquote>\n<p>And Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ أَحْمَد وَغَيْرُهُ مِنْ فُقَهَاءِ أَهْلِ الْحَدِيثِ يَقُولُونَ إنَّ الْأَصْلَ فِي الْعِبَادَاتِ التَّوْقِيفُ فَلَا يُشْرَعُ مِنْهَا إلَّا مَا شَرَعَهُ اللَّهُ تَعَالَى<\/p>\n<p>Ahmad and the jurists of Hadith would say: The foundational principle in worship is &#8216;stopping at the texts.&#8217; Nothing is legislated unless Allah Almighty has legislated it.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 29\/17<\/p><\/blockquote>\n<p>And Imam Mar’i al-Karmi, another esteemed scholar of the Hanbali school, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إنما غر هؤلاء الداعين عند المقابر مشاهدتهم بعض الأحيان استجابة الدعاء وقضاء حوائجهم في بعض الأوقات ومنها نشأ وجه الضلالات والشبهات لقاصري العقول وجاهلي المنقول وحججهم في ذلك دائرة بين نقل لا يجوز إثبات الشرع به أو قياس لا يجور استحباب العبادات بمثل هذه الحكايات والمقاييس<\/p>\n<p>Indeed, these supplicants at the graves were deceived by the observation that some of their supplications were answered and their needs fulfilled at times. From this arose misguidance and doubts in those with limited minds and ignorance of the transmitted texts. Their argument revolves around texts for which it is not permissible to establish law or an analogy that is not permissible for recommending acts of worship by the likes of these stories and analogies.<\/p>\n<p>Source: Shifāʼ al-Ṣudūr fī Ziyārat al-Mashāhid wal-Qubūr 1\/130<\/p><\/blockquote>\n<p>It is not correct to cite Imam Ahmad’s action as general permission to seek help from angels in other situations, let alone from jinn, prophets, or anyone else who is deceased, absent, or incapable. One cannot claim this as proof for their superstitions while ignoring the legal principles upon which Imam Ahmad&#8217;s school is based, which is the rejection of analogies in creed and worship.<\/p>\n<p>In fact, it was established by Imam Ahmad that it is forbidden to ‘seek refuge’ in the creation based upon the Prophet’s ﷺ authentic statement:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ<\/p>\n<p><strong>I seek refuge in the perfect words of Allah from the evil of what He created. <\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2708, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/29\/dua-refuge-perfect-words-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This was a key proof for Imam Ahmad when he was being persecuted by the Mu’tazlia sect for affirming the Quran is uncreated. It was known that the Prophet ﷺ did not seek refuge in the creation, and since he sought refuge in the Quran, Allah’s words must be part of His uncreated attributes.<\/p>\n<p>Imam al-Khattabi commented on this tradition:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكان أحمد بن حنبل يستدل بقوله بكلمات الله التامة على أن القرآن غير مخلوق وهو أن رسول الله صلى الله عليه وسلم لا يستعيذ بمخلوق<\/p>\n<p>Ahmad ibn Hanbal used his saying ‘the perfect words of Allah’ as evidence the Quran is uncreated. It is because the Messenger of Allah (ṣ) would not seek refuge in creation.<\/p>\n<p>Source: Ma’ālim al-Sunan 4\/332-333<\/p><\/blockquote>\n<p>And Imam Nu’aym, the teacher of Imam al-Bukhari, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يُسْتعَاذُ بِالْمَخْلُوقِ وَلَا بِكَلَامِ الْعِبَادِ وَالْجِنِّ وَالْإِنْسِ وَالْمَلَائِكَةِ وَفِي هَذَا دَلِيلٌ أَنَّ كَلَامَ اللَّهِ غَيْرُ مَخْلُوقٍ وَأَنَّ سِوَاهُ مَخْلُوقٌ<\/p>\n<p>Refuge is not sought from the creation, not by the words of worshipers, jinn, people, or angels. This is evidence that the word of Allah is not created and everything besides Him is created.<\/p>\n<p>Source: Khalq Afʻāl al-ʻIbād 1\/96<\/p><\/blockquote>\n<p>And Imam Ibn Abdul Barr writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَفِي الِاسْتِعَاذَةِ بِكَلِمَاتِ اللَّهِ أَبْيَنُ دَلِيلٍ عَلَى أَنَّ كَلَامَ اللَّهِ مِنْهُ تَبَارَكَ اسْمُهُ وَصِفَةً مِنْ صِفَاتِهِ لَيْسَ بِمَخْلُوقٍ لِأَنَّهُ مُحَالٌ أَنْ يُسْتَعَاذَ بِمَخْلُوقٍ وَعَلَى هَذَا جَمَاعَةُ أَهْلِ السُّنَّةِ<\/p>\n<p>Seeking refuge with ‘the perfect words of Allah’ is the clearest evidence that the word of Allah from Him is among His blessed names and attributes. It is not created as it is impossible for refuge to be sought in creation, and the united community of the Sunnah is upon this.<\/p>\n<p>Source: al-Tamhīd 24\/186<\/p><\/blockquote>\n<p>And Imam al-Baghawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمْ يَكُنِ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَعِيذُ بِمَخْلُوقٍ مِنْ مَخْلُوقٍ<\/p>\n<p>The Prophet never sought refuge from creation by creation.<\/p>\n<p>Source: Sharḥ al-Sunnah 1\/185<\/p><\/blockquote>\n<p>Imam Ahmad started with the logical premise that ‘seeking refuge’ in creation is unlawful. This demonstrates that the prohibition of seeking refuge in creation, which is to ask created beings for a type of God-like help, was established by the earliest generations even before scholars of the Sunnah settled on the un-createdness of the Quran.<\/p>\n<p>Likewise, a number of scholars narrated from the righteous predecessors that they did not allow seeking any God-like help from creation because all of creation needs Allah’s help, including angels, jinn, prophets, and saints, whether they are living or deceased.<\/p>\n<p>Imam al-Sulami writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَم أَن الْخلق كلهم عاجزون ومدبرون وَمن عجز عَن نفع نَفسه كَيفَ يقدر على نفع غَيره وَلذَلِك قَالَ بعض السّلف استغاثة الْمَخْلُوق بالمخلوق كاستغاثة المسجون بالمسجون<\/p>\n<p>Know that all of creation is helpless and under control, so those who are helpless to benefit themselves, how can they benefit others? For this reason, some of the Salaf said: Seeking aid from the creation by the creation is like a prisoner seeking aid from a prisoner.<\/p>\n<p>Source: Waṣīyat al-Shaykh al-Sulamī 1\/41<\/p><\/blockquote>\n<p>The following generation of Hanbali scholars did not derive from his seeking help with angels while lost during travel that God-like help may be sought with the Messenger of Allah ﷺ, saints, or other created beings. Al-Qadi Abu Ya’la, who was an early authority and judge of the Hanbali school, was asked:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ما تقول في قول الإنسان إذا عثر محمد أو علي<\/p>\n<p>What do you say when &#8216;Muhammad&#8217; or &#8216;Ali&#8217; are found in people’s words?<\/p><\/blockquote>\n<p>Al-Qadi replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إن قصد الاستعانة فهو مخطىء لأن الغوث من الله تعالى فقال وهما ميتان فلا يصح الغوث منهما ولأنه يجب تقديم الله على غيره<\/p>\n<p>If the intention is to seek help, this is a mistake, as aid comes from Allah Almighty and He said they are both deceased. It is not correct to seek aid from either of them because it is necessary to give precedence to Allah over everything else.<\/p>\n<p>Source: Badāʼiʻ al-Fawāʼid 4\/40<\/p><\/blockquote>\n<p>If calling out to the Prophet ﷺ for aid after he passed away is a mistake, then calling upon anyone or anything else for aid is an even bigger mistake.<\/p>\n<p>It is excusable if someone misspeaks or makes an honest mistake in their worship. They only need to learn the correct way from the Sunnah, ask Allah for forgiveness, and act better next time. It is not excusable to insist on such a mistake and introduce elaborate, superstitious rituals in Islam on the pretext of seeking God-like assistance from prophets, saints, angels, or jinn.<\/p>\n<p>Indeed, the Hanbali scholars unanimously agreed that whoever sets up intermediaries between Allah and the people for supplication and asking for help have committed an act of unbelief, as reported by Ibn Hajar al-Haytami:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومن ذلك أن يجعل بينه وبين الله تعالى وسائط يتوكل عليهم ويدعوهم ويسألهم قالوا إجماعا<\/p>\n<p>Among those (acts of unbelief) are to make intermediaries between Allah Almighty and the people for them to depend upon, call upon, and ask from. They said: It is a consensus.<\/p>\n<p>Source: al-Iʻlām bi-Qawāṭi’ al-Islām 1\/213<\/p><\/blockquote>\n<p>As for the jinn, some people argue that it is permissible to seek their help because they are present and capable. It may be true that they are present and capable at times, but it is still forbidden because one cannot usually control the jinn except through illicit means like occult magic rituals, nor can one verify if the jinn they have contacted are righteous and trustworthy.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا<\/p>\n<p><strong>There were men among humanity who sought refuge in men among the jinn, but it only increased their transgression.<\/strong><\/p>\n<p>Surat al-Jinn 72:6<\/p><\/blockquote>\n<p>Imam al-Qurtubi commented on this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا خَفَاءَ أَنَّ الِاسْتِعَاذَةَ بِالْجِنِّ دُونَ الِاسْتِعَاذَةِ بِاللَّهِ كُفْرٌ وَشِرْكٌ<\/p>\n<p>There is no doubt that seeking refuge in the jinn, to the exclusion of Allah Almighty, is unbelief and idolatry.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 19\/10<\/p><\/blockquote>\n<p>And the Kuwaiti Encyclopedia of Islamic Law, without citing any difference of opinion, states:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الاِسْتِغَاثَةُ بِالْجِنِّ مُحَرَّمَةٌ لأنهَا اسْتِغَاثَةٌ بِمَنْ لاَ يَمْلِكُ وَتُؤَدِّي إِلَى ضَلاَلٍ<\/p>\n<p>To seek aid from the jinn is forbidden because it is to ask from those one cannot control and leads to misguidance.<\/p>\n<p>Source: al-Mawsū’at al-Fiqhīyah al-Kuwaytīyah 4\/29<\/p><\/blockquote>\n<p>It is wrong to cite the example of the Prophet Solomon ﷺ, who controlled jinn with Allah&#8217;s permission, because these are among the miracles specific to him.<\/p>\n<p>Although Shaykh al-Islam Ibn Taymiyyah discussed how it is theoretically possible for a righteous person to employ the jinn, he notes that Solomon’s example is unique and even the Messenger of Allah (ṣ) did not emulate him in this:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاَلَّذِينَ يَسْتَخْدِمُونَ الْجِنَّ فِي الْمُبَاحَاتِ يُشْبِهُ اسْتِخْدَامَ سُلَيْمَانَ لَكِنْ أُعْطِيَ مُلْكًا لَا يَنْبَغِي لِأَحَدِ بَعْدَهُ وَسُخِّرَتْ لَهُ الْإِنْسُ وَالْجِنُّ وَهَذَا لَمْ يَحْصُلْ لِغَيْرِهِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ &#8230; فَلَمْ يَسْتَخْدِمْ الْجِنَّ أَصْلًا لَكِنْ دَعَاهُمْ إلَى الْإِيمَانِ بِاَللَّهِ وَقَرَأَ عَلَيْهِمْ الْقُرْآنَ وَبَلَّغَهُمْ الرِّسَالَةَ وَبَايَعَهُمْ كَمَا فَعَلَ بِالْإِنْسِ وَاَلَّذِي أُوتِيَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْظَمُ مِمَّا أُوتِيَهُ سُلَيْمَانُ<\/p>\n<p>Those who employ the jinn in permissible matters resemble Solomon, but he was given a kingdom unlike anyone after him. People and jinn were subjugated to him and this is not achievable by anyone else… The Prophet (ṣ) did not employ jinn as a general rule, but he called them to faith in Allah, he recited the Quran to them, he conveyed the message to them, and he accepted their allegiance just as he did with people, yet what he was given is even greater than what was given to Solomon.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 13\/89<\/p><\/blockquote>\n<p>Some people have latched on to Shaykh al-Islam’s theoretical discussion elsewhere to support calling upon jinn for help, but many scholars prohibit it as a practical matter. It is known that many jinn are sinful, dishonest, and unbelievers who mix the truth with falsehood.<\/p>\n<p>Aisha reported: Some people asked the Messenger of Allah, peace and blessings be upon him, about soothsayers. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسُوا بِشَيْءٍ<\/p>\n<p><strong>They are upon nothing.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, sometimes they speak about things that come true.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تِلْكَ الْكَلِمَةُ مِنْ الْجِنِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِي أُذُنِ وَلِيِّهِ قَرَّ الدَّجَاجَةِ فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍ<\/p>\n<p><strong>Those are the words snatched by the jinn, who whisper it into the ears of their friends, and it is mixed with more than one hundred lies.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6213, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/29\/soothsayers-jinn-mix-lies\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Since the jinn are beings in the Unseen, who are outside of our normal perception and control, how could anyone claim they reliably know which jinn are good or evil? If such a righteous person was miraculously granted this perception, how could anyone else verify their claims?<\/p>\n<p>Shaykh Ibn ‘Uthaymeen makes the following point:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقد اتخذ بعض الرقاة كلام شيخ الإسلام رحمه الله متكئاً على مشروعية الاستعانة بالجن المسلم في العلاج بأنه من الأمور المباحة ولا أرى في كلام شيخ الإسلام ما يسوغ لهم هذا &#8230; فما هو المقياس الذي نحكم به على أن هذا الجني مسلم وهذا منافق وهذا صالح وذاك طالح<\/p>\n<p>Some exorcists take the statements of Shaykh al-Islam, may Allah have mercy on him, as a basis for legislating seeking help from Muslim jinn in treatment, as it is among permissible matters, but I do not see anything in the Shaykh’s words to justify this… By what standard could we possibly judge whether this jinn is a Muslim, this one is a hypocrite, this one is righteous, or this one is evil?<\/p>\n<p>Source: Fatāwá Yas’alūnak 13\/39<\/p><\/blockquote>\n<p>Therefore, for all practical purposes, we should not seek help from the jinn even if it were confirmed that they are present and capable.<\/p>\n<p>In sum, it is not permissible to seek help or aid from angels, jinn, prophets, saints, or anyone who is deceased, absent, or incapable. Some scholars allowed asking angels for help in the specific situation of becoming lost while traveling, but they did not draw an analogy from this unique context to any other. Scholars also prohibit seeking help from jinn, even if they were present and capable, because of the dangers involved in interacting with beings from the Unseen.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Seeking aid from the creation by the creation is like a prisoner seeking aid from a prisoner.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[468,122,165,21,37,39,90,326,100,55,408,91,137,220,98],"class_list":["post-24388","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-analogy-al-qiyas","tag-angels-malaikah","tag-consensus-al-ijma","tag-creed-aqidah","tag-idolatry-shirk","tag-imam-ahmad-ibn-hanbal","tag-innovation-bidah","tag-jinn","tag-manners-al-adab","tag-methodology-al-minhaj","tag-miracles-al-mujizah","tag-righteous-predecessors-al-salaf-al-salih","tag-solomon-sulayman","tag-supplication-al-dua","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6lm","jetpack-related-posts":[{"id":21526,"url":"https:\/\/www.abuaminaelias.com\/jinn-demons-paranormal-activity\/","url_meta":{"origin":24388,"position":0},"title":"Jinn, demons, and paranormal activity","author":"Abu Amina Elias","date":"December 23, 2019","format":false,"excerpt":"\"Satan and his tribe see you from where you do not see them.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23090,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-free-time-worship\/","url_meta":{"origin":24388,"position":1},"title":"Imam al-Mundhiri on Free Time for Worship, Concern for Hereafter","author":"Abu Amina Elias","date":"April 28, 2021","format":false,"excerpt":"\"Son of Adam, use your free time for My worship.\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22636,"url":"https:\/\/www.abuaminaelias.com\/al-mundhiri-on-the-call-to-prayer\/","url_meta":{"origin":24388,"position":2},"title":"Imam al-Mundhiri on the Call to Prayer","author":"Abu Amina Elias","date":"October 4, 2020","format":false,"excerpt":"\"The caller to prayer is forgiven for as far as his voice reaches,\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14319,"url":"https:\/\/www.abuaminaelias.com\/an-nawawi-giving-food-break-fasting\/","url_meta":{"origin":24388,"position":3},"title":"Imam al-Nawawi on Feeding the Breaking Fast","author":"Abu Amina Elias","date":"July 20, 2013","format":false,"excerpt":"\"Verily, the angels send blessings upon the fasting person...\"","rel":"","context":"In &quot;Hadith Chapters أبواب الحديث&quot;","block_context":{"text":"Hadith Chapters أبواب الحديث","link":"https:\/\/www.abuaminaelias.com\/category\/hadith-chapters\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13131,"url":"https:\/\/www.abuaminaelias.com\/was-prophet-muhammad-a-terrorist\/","url_meta":{"origin":24388,"position":4},"title":"Was Prophet Muhammad a terrorist?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"Fight in the way of Allah those who fight you, but do not transgress.\" (2:190)","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":22840,"url":"https:\/\/www.abuaminaelias.com\/held-accountable-thoughts\/","url_meta":{"origin":24388,"position":5},"title":"Are we held accountable for our thoughts?","author":"Abu Amina Elias","date":"February 14, 2021","format":false,"excerpt":"\"Allah has pardoned my nation for what occurs within themselves...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/24388","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=24388"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/24388\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=24388"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=24388"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=24388"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}