{"id":24398,"date":"2025-02-21T16:04:50","date_gmt":"2025-02-21T12:04:50","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=24398"},"modified":"2025-04-03T12:01:38","modified_gmt":"2025-04-03T08:01:38","slug":"tawassul-asking-by-the-prophet","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/tawassul-asking-by-the-prophet\/","title":{"rendered":"Tawassul: Asking by the Prophet or from the Prophet?"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>One of the most confusing issues for contemporary Muslims is <em>Tawassul<\/em>, using the Prophet ﷺ ‘as a means’ to grow closer to Allah. Historically, this has been an acceptable difference of juristic opinion among the scholars, but later generations began to define and practice Tawassul in a way it was never intended to.<\/p>\n<p>The Tawassul allowed by scholars is to ask Allah ‘by the Prophet&#8217; ﷺ or, more controversially, ‘by the right of the Prophet.’ It did not mean asking the Prophet directly for anything, whether for his supplication, his intercession, or for help in matters typically asked of Allah.<\/p>\n<p>Among the scholars who permitted this Tawassul were Imam al-Nawawi and his Shafi’i contemporaries, who permitted a Muslim visiting the grave of the Prophet ﷺ to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ جِئْتُك مُسْتَغْفِرًا مِنْ ذَنْبِي مُسْتَشْفِعًا بِك إلَى رَبِّي<\/p>\n<p>I have come seeking forgiveness for my sin and seeking intercession with my Lord by you.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 8\/274<\/p><\/blockquote>\n<p>Al-Qadi ‘Iyad narrated a story from Imam Malik, the authenticity of which is disputed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال ناظرا أَبُو جَعْفَرٍ أَمِيرُ الْمُؤْمِنينَ مَالِكًا فِي مَسْجِدِ رسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فقال &#8230; وَلم تَصْرفْ وَجْهَكَ عَنْهُ وَهُوَ وَسِيلَتُكَ وَوَسِيلَةُ أَبِيكَ آدَمَ عَلَيْهِ السَّلَامُ إِلَى اللَّهِ تَعَالَى يَوْمَ الْقِيَامَةِ بَلِ اسْتَقْبِلْهُ واسْتَشْفِعْ بِهِ فَيُشَفِّعهُ اللَّهُ<\/p>\n<p>Abu Ja’far, the commander of the faithful, debated with Malik in the mosque of the Messenger of Allah … Malik said: Do not turn your face from him as he is your means and the means of your father Adam to Allah Almighty on the Day of Resurrection. Rather, face him and seek intercession by him, so Allah will grant you his intercession.<\/p>\n<p>Source: al-Shifā bi-Taʻrīf Ḥuqūq al-Muṣṭafá 2\/41<\/p><\/blockquote>\n<p>And Imam Ibn Qudamah agreed with the Shafi’i scholars in recommending a Muslim say at the Prophet’s ﷺ grave:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَدْ جِئْتُك مُسْتَغْفِرًا لِذَنْبِي مُسْتَشْفِعًا بِك إلَى رَبِّي<\/p>\n<p>I have come seeking forgiveness for my sin and seeking intercession with my Lord by you.<\/p>\n<p>Source: al-Mughnī 3\/478<\/p><\/blockquote>\n<p>It must be understood what the scholars meant by ‘seeking intercession with Allah by him.’ This is a supplication to Allah and a request from Him, not directly from the Prophet ﷺ himself.<\/p>\n<p>The scholars who allowed this Tawassul intended something like the ‘blind man’s Hadith’ in which an unnamed companion said the following in his presence:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ مُحَمَّدٍ نَبِيِّ الرَّحْمَةِ إِنِّي تَوَجَّهْتُ بِكَ إِلَى رَبِّي فِي حَاجَتِي هَذِهِ لِتُقْضَى لِيَ اللَّهُمَّ فَشَفِّعْهُ فِيَّ<\/p>\n<p><strong>O Allah, I ask You and turn to You by Your Prophet Muhammad, the Prophet of Mercy. I turn by you to my Lord to fulfill this need of mine. O Allah, accept his intercession for me.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3578, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/22\/tawassul-prophet-dua-in-life\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This request is directed to Allah alone and it was not requested from the Prophet ﷺ himself because it is not permissible to call upon him for God-like help in his life or after his death, let alone ask for God-like help from the saints.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah, who nevertheless did not recommend this form of Tawassul, commented on the blind man’s Hadith:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَهَذَا التَّوَسُّلُ بِهِ حَسَنٌ وَأَمَّا دُعَاؤُهُ وَالِاسْتِغَاثَةُ بِهِ فَحَرَامٌ<\/p>\n<p>This way of ‘seeking means’ by him is good. As for calling upon him and seeking his aid, it is forbidden.<\/p>\n<p>Source: Majmū’ al-Fatāwá 3\/276<\/p><\/blockquote>\n<p>In proper Tawassul, it is as if one is saying, ‘I ask Allah by my love of the Prophet&#8217; ﷺ or, ‘I ask Allah by my obedience to the Prophet,’ and so on. This conforms to Tawassul by one’s own actions, that is, drawing close to Allah by one’s righteous deeds, which is agreed upon to be virtuous.<\/p>\n<p>Moreover, scholars who allowed this form of Tawassul often restricted it to the Prophet ﷺ alone. They did not draw an analogy between him and other righteous saints.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَرَأَيْت فِي فَتَاوِي الْفَقِيهِ أَبِي مُحَمَّدِ بْنِ عَبْدِ السَّلَامِ قَالَ لَا يَجُوزُ أَنْ يُتَوَسَّلَ إلَى اللَّهِ بِأَحَدِ مِنْ خَلْقِهِ إلَّا بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إنْ صَحَّ حَدِيثُ الْأَعْمَى فَلَمْ يُعْرَفْ صِحَّتُهُ<\/p>\n<p>I have seen in the verdicts of the jurist, Abu Muhammad ibn &#8216;Abdu Salaam, that he said, ‘It is not permissible to &#8216;seek means&#8217; to Allah by one of His creations except the Messenger of Allah, if the blind man’s Hadith is authentic,’ and he did not acknowledge its authenticity.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 1\/347<\/p><\/blockquote>\n<p>Many scholars, especially from the Hanafi school, did not allow ‘asking by the Prophet&#8217; ﷺ because the way of asking encouraged by the Quran is to ask Allah by His names and attributes.<\/p>\n<p>Imam al-Haskafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنْ أَبِي حَنِيفَةَ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَدْعُوَ اللَّهَ إلَّا بِهِ وَالدُّعَاءُ الْمَأْذُونُ فِيهِ الْمَأْمُورُ بِهِ مَا اُسْتُفِيدَ مِنْ قَوْله تَعَالَى وَلِلَّهِ الأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا<\/p>\n<p>It has come from Abu Hanifa that it is not appropriate for anyone to call upon Allah except by Him. The supplication that is permissible and commanded is derived from His saying: <strong>Allah has the best names, so call upon Him by them.<\/strong> (7:180)<\/p>\n<p>Source: al-Durr al-Mukhtār 1\/662<\/p><\/blockquote>\n<p>And Imam al-Kasani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُكْرَهُ لِلرَّجُلِ أَنْ يَقُولَ فِي دُعَائِهِ أَسْأَلُك بِحَقِّ أَنْبِيَائِك وَرُسُلِك وَبِحَقِّ فُلَانٍ لِأَنَّهُ لَا حَقَّ لِأَحَدٍ عَلَى اللَّهِ جَلَّ شَأْنُهُ<\/p>\n<p>It is disapproved for a man to say in his supplication, ‘I ask You by the right of Your prophets and Your messengers,’ or by the right of any person, as no one has a right over Allah Almighty in His affairs.<\/p>\n<p>Source: Badā&#8217;i&#8217; al-Ṣanā&#8217;I 5\/126<\/p><\/blockquote>\n<p>And Imam Zayn al-Din al-Razi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا يكره فِي الدُّعَاء وَيحرم قَوْله فِي الدُّعَاء أَسأَلك بمقعد الْعِزّ من عرشك وبحق الْعِزّ من عرشك وبحق فلَان وبحق النَّبِي صلى الله عَلَيْهِ وَسلم<\/p>\n<p>What is disapproved in supplication, and forbidden, is one saying in supplication, ‘I ask You by the honorable seat of Your throne,’ or by the right of any person, or by the right of the Prophet.<\/p>\n<p>Source: Tuḥfat al-Mulūk 1\/236-237<\/p><\/blockquote>\n<p>And Mufti Nu&#8217;man al-Alusi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي جميع متونهم أن قول الداعي المتوسل بحق الأنبياء والأولياء وبحق البيت والمشعر الحرام مكروه كراهة تحريم &#8230; وعللوا ذلك بقولهم لأنه لا حق للمخلوق على الخالق<\/p>\n<p>In all of their texts, the saying of the supplicant ‘by the right of the prophets and the saints,’ or ‘by the right of the Sacred House,’ are disapproved with disapproval tantamount to forbiddance … and they justified this because the creation has no right over the Creator.<\/p>\n<p>Source: Jalā’ al-‘Uyūn 1\/516-517<\/p><\/blockquote>\n<p>This form of Tawassul has never been labeled as unbelief or idolatry by any of the credible scholars. It is a somewhat obscure and esoteric issue, the evidences for which are not decisive in the Quran and Sunnah.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ التَّوَسُّلَ يَكُونُ فِي حَيَاتِهِ وَبَعْدَ مَوْتِهِ وَفِي مَغِيبِهِ وَحَضْرَتِهِ وَلَمْ يَقُلْ أَحَدٌ إنَّ مَنْ قَالَ بِالْقَوْلِ الْأَوَّلِ فَقَدْ كَفَرَ وَلَا وَجْهَ لِتَكْفِيرِهِ فَإِنَّ هَذِهِ مَسْأَلَةٌ خَفِيَّةٌ لَيْسَتْ أَدِلَّتُهَا جَلِيَّةً ظَاهِرَةً وَالْكُفْرُ إنَّمَا يَكُونُ بِإِنْكَارِ مَا عُلِمَ مِنْ الدِّينِ ضَرُورَةً<\/p>\n<p>Using him ‘as a means’ in his life and after his death, in his absence or in his presence, no one said that whoever holds the other opinion has committed unbelief, nor viewed it as a cause to excommunicate someone. Indeed, this is a subtle issue without clear and apparent evidences, but unbelief only occurs if someone rejects what is unmistakably known in the religion.<\/p>\n<p>Source: Majmū’ al-Fatāwá 1\/106<\/p><\/blockquote>\n<p>However, some later generations drew an invalid analogy between asking Allah ‘by the Prophet&#8217; ﷺ, and asking the Prophet to ask Allah for us, and asking from the Prophet himself. These three actions are not in the same legal category.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْمَيِّتُ مِنْ الْأَنْبِيَاءِ وَالصَّالِحِينَ وَغَيْرِهِمْ فَلَمْ يُشْرَعْ لَنَا أَنْ نَقُولَ اُدْعُ لَنَا وَلَا اسْأَلْ لَنَا رَبَّك وَلَمْ يَفْعَلْ هَذَا أَحَدٌ مِنْ الصَّحَابَةِ وَالتَّابِعِينَ وَلَا أَمَرَ بِهِ أَحَدٌ مِنْ الْأَئِمَّةِ وَلَا وَرَدَ فِيهِ حَدِيثٌ &#8230; وَلَمْ يَجِيئُوا إلَى قَبْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ قَائِلِينَ يَا رَسُولَ اللَّهِ اُدْعُ اللَّهَ لَنَا وَاسْتَسْقِ لَنَا وَنَحْنُ نَشْكُو إلَيْك مِمَّا أَصَابَنَا وَنَحْوَ ذَلِكَ لَمْ يَفْعَلْ ذَلِكَ أَحَدٌ مِنْ الصَّحَابَةِ قَطُّ بَلْ هُوَ بِدْعَةٌ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ<\/p>\n<p>As for the deceased among the prophets, the righteous, and others, it is not legislated for us to say, ‘Call upon Allah for us,’ nor to say, ‘Ask your Lord for us.’ This was never done by any of the Companions or their followers. It was not commanded by any of the Imams, nor has it been narrated from the Prophet … They did not go to the grave of the Prophet to say, ‘O Messenger of Allah, call upon Allah for us and ask for rain for us and we complain to you of our troubles,’ and so on. This was never done by any of the Companions. Rather, it is an innovation for which Allah has not sent down any authority.<\/p>\n<p>Source: Majmū’ al-Fatāwá 27\/76<\/p><\/blockquote>\n<p>And Imam Ibn &#8216;Abdul Hadi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما دعاؤه هو وطلب استغفاره وشفاعته بعد موته فهذا لم ينقل عن أحد من أئمة المسلمين لا من الأئمة الأربعة ولا غيرهم<\/p>\n<p>As for calling upon him, which is to request his seeking forgiveness and his intercession after his death, this was not transmitted from any of the Imams of the Muslims, not by the Four Imams or any others.<\/p>\n<p>Source: al-Ṣārim al-Munkī 1\/136<\/p><\/blockquote>\n<p>In fact, there are three different actions here with three different rulings: asking ‘by the Prophet&#8217; ﷺ is permissible according to many scholars, asking the Prophet for his supplication is a blameworthy religious innovation, and asking the Prophet for help is an act of idolatry. The deceased cannot answer anyone&#8217;s call because death is the end of deeds, so they can no longer act as they did in life.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ<\/p>\n<p><strong>When the human being dies, his deeds end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1631, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/10\/23\/sadaqah-al-jariyah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Shaykh Ibn ‘Uthaymeen said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سؤال الميت أن يسأل الله أو سؤال قضاء الحاجة بينهما فرق إذا سأل قضاء الحاجة فهذا شرك أكبر وإذا سأل أن يسأل الله فهذا بدعة وضلالة لأن الميت إذا مات انقطع عمله والدعاء من عمله فكيف تسأله ما لا يمكن فإذا جئت إلى ميت وقلت ادع الله لي فإنه لن يدعو الله لك<\/p>\n<p>There is a difference between asking the deceased to ask Allah and asking them for the fulfilment of needs. If one asks them for the fulfilment of needs, this is the greater idolatry. If one asks them to ask Allah, this is an innovation and misguidance, because the deeds of the deceased come to an end after they pass away. Supplication is part of their deeds, so how can you ask them what they cannot do? If you came to a deceased person and said, ‘Call upon Allah for me,’ they will never call upon Allah for you.<\/p>\n<p>Source: al-Arba&#8217;ūn al-&#8216;Aqdīyah 2\/714<\/p><\/blockquote>\n<p>Some people made the mistake of asking the Prophet ﷺ for his supplication, and asking the righteous saints as well, because they believed the deceased have the capability to answer them. It is true that the deceased hear and recognize those who visit their graves, but the scholars did not cite this as proof they could answer them as they did in life.<\/p>\n<p>Shaykh ‘Izz al-Din said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الظاهر أن الميت يعرف زائره لأنا أمرنا بالسلام عليه والشرع لا يأمر بخطاب من لا يسمع &#8230; وقد ذهب بعض العلماء إلى أن أرواح الموتى بأفنية القبور والوقوف عند رأس الميت والاستغفار له مشروع<\/p>\n<p>Apparently, the deceased recognize those who visit them because we have been ordered to greet them with peace, and the Law would not order us to address one who cannot hear … Some of the scholars hold the opinion that the souls of the deceased are in the courtyards of the graves and standing at the head of them, so seeking forgiveness for them is legislated.<\/p>\n<p>Source: Qurrat al-&#8216;Ayn bi-Fatāwá &#8216;Ulamā&#8217; al-Ḥaramayn 1\/65<\/p><\/blockquote>\n<p>Rather, it is virtuous in Islam to seek forgiveness from Allah for the deceased and to supplicate to Allah on their behalf. It is proven that the deceased benefit from some actions of the living, such as our supplications to Allah for them. This is entirely different from asking the deceased for which one expects an answer.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ تَدْعُونَ مِن دُونِهِ مَا يَمْلِكُونَ مِن قِطْمِيرٍ إِن تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ<\/p>\n<p><strong>But those you invoke besides Him do not possess even the skin of a date stone. If you call upon them, they cannot hear your calls. And if they were to hear, they could not respond to you. On the Day of Judgment, they will disown your idolatry. And no one can inform you like the All-Knowing.<\/strong><\/p>\n<p>Surat Fatir 35:13-14<\/p><\/blockquote>\n<p>Imam al-Qurtubi al-Maliki commented on this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذْ لَيْسَ كُلُّ سَامِعٍ نَاطِقًا وَقَالَ قَتَادَةُ الْمَعْنَى لَوْ سَمِعُوا لَمْ يَنْفَعُوكُمْ وَقِيلَ أَيْ لَوْ جَعَلْنَا لَهُمْ عُقُولًا وَحَيَاةً فَسَمِعُوا دُعَاءَكُمْ لَكَانُوا أَطْوَعَ لِلَّهِ مِنْكُمْ وَلَمَا اسْتَجَابُوا لَكُمْ عَلَى الْكُفْرِ &#8230; أَيْ يَجْحَدُونَ أَنَّكُمْ عَبَدْتُمُوهُمْ وَيَتَبَرَّءُونَ مِنْكُمْ ثُمَّ يَجُوزُ أَنْ يَرْجِعَ هَذَا إِلَى الْمَعْبُودِينَ مِمَّا يَعْقِلُ كَالْمَلَائِكَةِ وَالْجِنِّ وَالْأَنْبِيَاءِ وَالشَّيَاطِينِ أَيْ يَجْحَدُونَ أَنْ يَكُونَ مَا فَعَلْتُمُوهُ حَقًّا<\/p>\n<p>Not all who hear can speak. Qatadah said: The meaning is that even if they heard you, they cannot benefit you. It is said that it means if Allah had made (their idols) rational and alive and they heard your supplication, they would be more obedient to Allah than you and would not answer your unbelief … They will dispute your worship and disavow you. Then, it is possible that this refers to what is worshiped among rational creatures such as angels, jinn, prophets, and devils, that is, they will justifiably dispute what you did.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 14\/336<\/p><\/blockquote>\n<p>Hence, even if it is confirmed that the deceased may hear those who visit their graves, it is not confirmed that they can answer back. In this regard, some miraculous occurrences are cited as evidence the deceased can hear, answer, and help those who call upon them, but these are specific instances in which natural laws are broken by Allah’s will.<\/p>\n<p>It is not permissible to derive a general rule applied to deceased saints from such specific events, because miraculous claims require evidence that ordinary default circumstances have been overridden.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لو قال القائل سؤال الغائب حياً وميتاً كسؤال الشاهد &#8230; قلنا هذا محال في العادة المعروفة وإذا وقع ذلك في بعض الصور كان من باب خرق العادة والعادة قد تخرق بأن يسمع الأدنى خطاب الأعلى كما سمع سارية خطاب عمر يا سارية الجبل يا سارية الجبل ويجوز خرق العادة بالعكس لكن إثبات هذا في حق معين لا يكون إلا بحجة تدل على وقوع ذلك في حقه<\/p>\n<p>If it said that asking the absent, whether alive or deceased, is like asking those present … We say this is impossible in ordinary circumstances. When that occurred in some forms, it was a type of supernatural event as natural laws can be broken such that one heard the address of those far away, just as Sariyah heard ‘Umar when he shouted, ‘O Sariyah, the mountain! O Sariyah, the mountain!’ It is possible for natural laws to be broken to the contrary. However, proving this in a specific case can only be done with evidence that it truly occurred.<\/p>\n<p>Source: al-Istighāthah 1\/108-109<\/p><\/blockquote>\n<p>On the contrary, there is evidence to suggest that the Prophet ﷺ in his grave is largely unaware of what Muslims are doing. There are miraculous occurrences confirmed in the Sunnah, such as the blessings we send upon him being delivered to him by the angels, but other authentic traditions suggest these miracles are not general in nature.<\/p>\n<p>Anas ibn Malik reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيَرِدَنَّ عَلَىَّ نَاسٌ مِنْ أَصْحَابِي الْحَوْضَ حَتَّى عَرَفْتُهُمُ اخْتُلِجُوا دُونِي فَأَقُولُ أَصْحَابِي‏ فَيَقُولُ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ<\/p>\n<p><strong>Some of my companions will come towards me at the Fountain in the Hereafter until I recognize them. They will be taken away from me, then I will say: My companions! It will be said: You do not know what they innovated after you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6582, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/15\/they-innovated-after-you\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In this tradition, some people who were known to the Prophet ﷺ in his life would meet him at his Fountain in the Hereafter, but they would be taken away because they introduced innovations after him. This refers to groups like those who turned apostate in the time of Abu Bakr or who introduced heretical beliefs like the Khawarij, the Qadiriyyah, and the Jabriyyah. He was not aware of what they did after he passed away.<\/p>\n<p>Muslims must be cautious not to exaggerate their claims about the Prophet ﷺ and likewise not to make baseless claims about the souls of the saints, such as claiming they are omnipresent or omniscient. Some scholars considered such exaggerations to be an act of unbelief because it associates God-like powers with the creation.<\/p>\n<p>Imam Zadah al-Hanafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَكْفُرُ بِقَوْلِهِ أَرْوَاحُ الْمَشَايِخِ حَاضِرَةٌ تَعْلَمُ<\/p>\n<p>One has committed unbelief by saying ‘the souls of our elders are present,’ as you know.<\/p>\n<p>Source: Majma&#8217; al-Anhur 1\/691<\/p><\/blockquote>\n<p>And Imam Ibn Nujaym al-Hanafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَفِي الْبَزَّازِيَّةِ قَالَ عُلَمَاؤُنَا مَنْ قَالَ أَرْوَاحُ الْمَشَايِخِ حَاضِرَةٌ تَعْلَمُ يَكْفُرُ<\/p>\n<p>In the verdicts of al-Bazzaziyah: Our scholars said whoever says the souls of our elders are present, you know he has committed unbelief.<\/p>\n<p>Source: al-Baḥr al-Rā&#8217;iq 5\/134<\/p><\/blockquote>\n<p>Muslims might easily fall into this mistake if they do not make a proper distinction between permissible Tawassul, which is to ask Allah ‘by the Prophet&#8217; ﷺ, and what is sometimes called <em>Istighatha<\/em>, seeking help from the Prophet. None of the scholars who are usually cited to permit Tawassul by the Prophet further allowed seeking help from him directly.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْفَرْقُ بَيْنَ هَذَيْنِ مُتَّفَقٌ عَلَيْهِ بَيْنَ الْمُسْلِمِينَ الْمُتَوَسِّلُ إنَّمَا يَدْعُو اللَّهَ وَيُخَاطِبُهُ وَيَطْلُبُ مِنْهُ لَا يَدْعُو غَيْرَهُ إلَّا عَلَى سَبِيلِ اسْتِحْضَارِهِ لَا عَلَى سَبِيلِ الطَّلَبِ مِنْهُ وَأَمَّا الدَّاعِي وَالْمُسْتَغِيثُ فَهُوَ الَّذِي يَسْأَلُ الْمَدْعُوَّ وَيَطْلُبُ مِنْهُ وَيَسْتَغِيثُهُ وَيَتَوَكَّلُ عَلَيْهِ وَاَللَّهُ هُوَ رَبُّ الْعَالَمِينَ<\/p>\n<p>The difference between the two matters is agreed upon by the Muslims. The one &#8216;using him as a means&#8217; only calls upon Allah, addresses Him, and requests from Him without calling upon anyone besides Him, except as a way to bring him to mind, not as a way of requesting from him. As for the supplicant seeking aid, he is asking from the one called upon, requesting from him, seeking his aid, and depending upon him, but Allah alone is the Lord of the worlds.<\/p>\n<p>Source: Majmū’ al-Fatāwá 3\/276<\/p><\/blockquote>\n<p>Neither is it wrong to say, &#8216;O Muhammad,&#8217; if the intention is merely to bring him into one&#8217;s mind. This is not idolatry, but Muslims should still be careful with their words and not say anything that would imply seeking help from the Prophet ﷺ directly as one normally would with Allah.<\/p>\n<p>The matter becomes even more confusing because some scholars used the terms <em>Tawassul<\/em> and <em>Istighatha<\/em> interchangeably, whereas it is crucial to distinguish between them. If the scholars said, ‘Seek help by the Prophet&#8217; ﷺ, they did not mean to seek help <em>from<\/em> the Prophet.<\/p>\n<p>Imam al-Halabi al-Hanafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وما قيل من أنه يجوز الاستغاثة بالأنبياء والصالحين فإنما المراد به التبرك بذكرهم والتوسل بهم بلا إمداد منهم<\/p>\n<p>What is said that it is permissible to seek aid ‘by the prophets and the righteous,’ it only means the blessings of remembering them and &#8216;using them as a means,&#8217; not by seeking help from them.<\/p>\n<p>Source: Sayf Allāh &#8216;alá man Kadhaba &#8216;alá Awliyā&#8217; Allāh 1\/49-50<\/p><\/blockquote>\n<p>The scholars do not allow seeking help from the Prophet ﷺ because it resembles supplication (<em>dua’<\/em>), which is an act of worship, and it implies that the Prophet shares in some characteristics of Lordship. Every created being, even the Prophet himself, is in need of Allah and cannot oppose the will of Allah.<\/p>\n<p>In this regard, there is a clear distinction between the powers of the Creator and the helplessness of His creatures.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ<\/p>\n<p><strong>But those they invoke besides Allah cannot create anything; they themselves are created.<\/strong><\/p>\n<p>Surat al-Nahl 16:20<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهُ الْغَنِيُّ وَأَنتُمُ الْفُقَرَاءُ<\/p>\n<p><strong>For Allah is the Self-Sufficient, whereas you stand in need of Him.<\/strong><\/p>\n<p>Surat Muhammad 47:38<\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ مَاتَ وَهْوَ يَدْعُو مِنْ دُونِ اللَّهِ نِدًّا دَخَلَ النَّارَ<\/p>\n<p><strong>Whoever dies while calling upon a partner besides Allah will enter the Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4497, Grade: <strong><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/28\/whoever-dies-dua-allah\/\"><em>Sahih<\/em><\/a><\/strong><\/p><\/blockquote>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا سَأَلْتَ فَاسْأَلْ اللَّهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ<\/p>\n<p><strong>If you ask, ask from Allah. If you seek help, seek help from Allah.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2516, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/29\/mindful-allah-he-will-protect-you\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam al-Nawawi commented on this tradition:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقوله صلى الله عليه وسلم إذا سألت فاسأل الله إشارة إلى أنّ العبد لا ينبغي أن يعلق سرّه بغير الله بل يتوكل عليه في سائر أموره ثم إن كانت الحاجة التي يسألها لم تجر العادة بجريانها على أيدي خلقه كطلب الهداية والعلم والفهم في القرآن والسنة وشفاء المرض وحصول العافية من بلاء الدنيا وعذاب الآخرة سأل ربه ذلك<\/p>\n<p style=\"text-align: right;\">وإن كانت الحاجة التي يسألها جرت العادة أن الله سبحانه وتعالى يجريها على أيدي خلقة كالحاجات المتعلقة بأصحاب الحرف والصنائع وولاة الأمور سأل الله تعالى أن يعطف عليه قلوبهم فيقول اللهم أحنن علينا قلوب عبادك وإمائك وما أشبه ذلك<\/p>\n<p>The Prophet’s saying, ‘<strong>If you ask, ask from Allah<\/strong>,’ indicates that the servant should not attach his heart to other than Allah. Rather, he depends upon Him in all matters. Then, if the need for which he is asking is not something usually done through the hands of His creation, such as requesting guidance, knowledge, and understanding of the Quran and Sunnah, healing the sick, and obtaining wellness from the afflictions of this world and the punishment of the Hereafter, he asks his Lord for that.<\/p>\n<p>If the need for which he is asking is something Allah Almighty usually does through the hands of His creation, such as needs related to craftsmen, workers, and government authorities, he asks Allah Almighty to soften their hearts and he says, ‘O Allah, make the hearts of your male and female servants compassionate to us,’ and whatever resembles that.<\/p>\n<p>Source: Sharḥ Matn al-Arba’īn al-Nawawīyah 1\/63<\/p><\/blockquote>\n<p>Imam al-Sulami, one of the leading scholars of Tasawwuf, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَم أَن الْخلق كلهم عاجزون ومدبرون وَمن عجز عَن نفع نَفسه كَيفَ يقدر على نفع غَيره وَلذَلِك قَالَ بعض السّلف استغاثة الْمَخْلُوق بالمخلوق كاستغاثة المسجون بالمسجون<\/p>\n<p>Know that all of creation is helpless and under control, so those who are helpless to benefit themselves, how can they benefit others? For this reason, some of the Salaf said: Seeking aid from the creation by the creation is like a prisoner seeking aid from a prisoner.<\/p>\n<p>Source: Waṣīyat al-Shaykh al-Sulamī 1\/41<\/p><\/blockquote>\n<p>Shaykh ‘Abdul Qadr al-Jilani, another leading scholar of Tasawwuf, said to his son who was on his deathbed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تخف أحدا ولا ترجه وأوكل الحوائج كلها إلى الله عز وجل واطلبها منه ولا تثق بأحد سوى الله عز وجل ولا تعتمد إلا عليه سبحانه التوحيد التوحيد وجماع الكل التوحيد<\/p>\n<p>Do not fear anyone or put your hopes in another. Entrust all of your needs to Allah Almighty and seek them from Him. Do not rely upon anyone besides Allah Almighty, and do not depend upon anyone but Him, glory be to Him. Oneness! Oneness! The sum of all things is Oneness!<\/p>\n<p>Source: al-Fatḥ al-Rabbānī wal-Fayḍ al-Raḥmānī 1\/308<\/p><\/blockquote>\n<p>And Imam al-Isfahani al-Shafi’i writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمن أَسْمَائِهِ الْوَهَّاب يهب الْعَافِيَة وَلَا يقدر الْمَخْلُوق أَن يَهَبهَا ويهب الْقُوَّة وَلَا يقدر الْمَخْلُوق أَن يَهَبهَا تَقول يَا رب هَب لي الْعَافِيَة وَلَا تسْأَل مخلوقا ذَلِك وَإِن سَأَلته لم يقدر عَلَيْهِ وَتقول عِنْد ضعفك يَا رب هَب لي قُوَّة والمخلوق لَا يقدر عَلَى ذَلِك<\/p>\n<p>Among His names is <em>Al-Wahhab<\/em> (the Bestower) who bestows wellness, which none of the created beings can bestow. He bestows strength, which none of the created beings can bestow. You say, ‘O Lord, bestow wellness upon me,’ and you do not ask the creation for that. If you asked them, they cannot do it. You say in your weakness, ‘O Lord, bestow strength upon me,’ and created beings cannot do that.<\/p>\n<p>Source: al-Ḥujjat fī Bayān al-Maḥajjah 1\/156<\/p><\/blockquote>\n<p>And Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والاستغاثة بالميت والغائب سواء كان نبياً أو ولياً ليس مشروعاً ولا هو من صالح الأعمال إذ لو كان مشروعاً أو حسناً من العمل لكانوا به أعلم وإليه أسبق ولم يصح عن أحد من السلف أنه فعل ذلك<\/p>\n<p>Seeking aid from the deceased and absent, either a prophet or a saint, is not legislated and is not part of righteous actions. If it had been legislated or a good deed, the righteous predecessors would have known it better and been quicker to do it, but it is not authentically narrated from any of them that they did so.<\/p>\n<p>Source: al-Istighāthah 1\/105<\/p><\/blockquote>\n<p>Al-Qadi Abu Ya’la was asked:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ما تقول في قول الإنسان إذا عثر محمد أو علي<\/p>\n<p>What do you say when ‘Muhammad’ or ‘Ali’ are found in people’s words?<\/p><\/blockquote>\n<p>Al-Qadi replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إن قصد الاستعانة فهو مخطىء لأن الغوث من الله تعالى فقال وهما ميتان فلا يصح الغوث منهما ولأنه يجب تقديم الله على غيره<\/p>\n<p>If the intention is to seek help, this is a mistake, as aid comes from Allah Almighty and He said they are both deceased. It is not correct to seek aid from either of them because it is necessary to give precedence to Allah over everything else.<\/p>\n<p>Source: Badāʼiʻ al-Fawāʼid 4\/40<\/p><\/blockquote>\n<p>Idolatry is built upon wrongly ascribing some divine characteristics of the Creator to His creation, and subsequently performing acts of devotion for these created beings in a manner only the Creator deserves.<\/p>\n<p>Imam al-Maqrizi al-Shafi’i writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعلم أن حقيقة الشرك تشبيه الخالق بالمخلوق وتشبيه المخلوق بالخالق أمّا الخالق فإن المشرك شبّه المخلوق بالخالق في خصائص الإلهيّة وهي التفرّد بملك الضّر والنفع والعطاء والمنع فمن علّق ذلك بمخلوق فقد شبهه بالخالق تعالى وسوّى بين التراب وربّ الأرباب فأي فجور وذنب أعظم من هذا<\/p>\n<p>Know that the essence of idolatry is to liken the Creator to the creation, and to liken the creation to the Creator. As for the Creator, the idolater likens the creation to the Creator in specific characteristics of Divinity, which are the uniqueness of controlling harm, benefit, giving, and withholding. Thus, whoever attributes that to a created being has likened it to the Almighty Creator, making equality between the dust and the Lord of lords. What wickedness and sin are greater than this?<\/p>\n<p>Source: Tajrīd al-Tawḥīd al-Mufīd 1\/27<\/p><\/blockquote>\n<p>Thus, when Muslims are seen groveling at the graves of saints, calling out to them for their needs on the assumption they have God-like powers, this closely resembles the archetype of idolatry throughout history.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تَدْعُ مِن دُونِ اللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَۖ فَإِن فَعَلْتَ فَإِنَّكَ إِذًا مِّنَ الظَّالِمِينَ<\/p>\n<p><strong>Do not invoke, instead of Allah, what can neither benefit nor harm you, for if you do, then you will certainly be one of the wrongdoers.<\/strong><\/p>\n<p>Surat Yunus 10:106<\/p><\/blockquote>\n<p>Imam al-Razi al-Ash&#8217;ari commented on this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوِ اشْتَغَلْتَ بِطَلَبِ الْمَنْفَعَةِ وَالْمَضَرَّةِ مِنْ غَيْرِ اللَّه فَأَنْتَ مِنَ الظَّالِمِينَ لِأَنَّ الظُّلْمَ عِبَارَةٌ عَنْ وَضْعِ الشَّيْءِ فِي غَيْرِ مَوْضِعِهِ فَإِذَا كَانَ مَا سِوَى الْحَقِّ مَعْزُولًا عَنِ التَّصَرُّفِ كَانَتْ إِضَافَةُ التَّصَرُّفِ إِلَى مَا سِوَى الْحَقِّ وَضْعًا لِلشَّيْءِ فِي غَيْرِ مَوْضِعِهِ<\/p>\n<p>If you preoccupy yourself with requesting benefits and harms from other than Allah, then you are among the wrongdoers because ‘injustice’ is an expression that means putting something outside of its proper place. When whatever besides the Almighty Truth is separated from administering creation, attributing such administration to besides the Almighty Truth is to put something outside of its proper place.<\/p>\n<p>Source: Tafsīr al-Rāzī 17\/309<\/p><\/blockquote>\n<p>Allah often equates ‘calling upon those besides Him’ with the worship of idols, even if those idols are the representation of righteous beings like angels and prophets. These righteous beings themselves are trying to get closer to Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلِ ادْعُوا الَّذِينَ زَعَمْتُم مِّن دُونِهِ فَلَا يَمْلِكُونَ كَشْفَ الضُّرِّ عَنكُمْ وَلَا تَحْوِيلًا أُولَٰئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ وَيَرْجُونَ رَحْمَتَهُ وَيَخَافُونَ عَذَابَهُ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُورًا<\/p>\n<p><strong>Say, ‘Invoke those you claim besides Him. They do not have the power to undo harm from you or transfer it elsewhere.’ Even the closest to Allah of those invoked would be seeking a way to their Lord, hoping for His mercy, and fearing His punishment. Indeed, your Lord’s torment is fearsome.<\/strong><\/p>\n<p>Surat al-Isra 17:56-57<\/p><\/blockquote>\n<p>The companion Ibn Abbas explained this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ أَهْلُ الشِّرْكِ يَقُولُونَ نَعْبُدُ الْمَلَائِكَةَ وَالْمَسِيحَ وَعُزَيْرًا وَهُمُ الَّذِينَ يَدْعُونَ<\/p>\n<p>The people of idolatry would say, ‘We worship the angels, the Messiah, and ‘Uzayr,’ as those were whom they called upon.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 14\/527<\/p><\/blockquote>\n<p>For this reason, the scholars said that those who set up ‘intermediaries’ between Allah and people for acts of worship like supplication, calling out for help, vows, and sacrifices, they have committed an act of unbelief and idolatry.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ جَعَلَ الْمَلَائِكَةَ وَالْأَنْبِيَاءَ وَسَائِطَ يَدْعُوهُمْ وَيَتَوَكَّلُ عَلَيْهِمْ وَيَسْأَلُهُمْ جَلْبَ الْمَنَافِعِ وَدَفْعَ الْمَضَارِّ مِثْلَ أَنْ يَسْأَلَهُمْ غُفْرَانَ الذَّنْبِ وَهِدَايَةَ الْقُلُوبِ وَتَفْرِيجَ الْكُرُوبِ وَسَدَّ الفاقات فَهُوَ كَافِرٌ بِإِجْمَاعِ الْمُسْلِمِينَ<\/p>\n<p>Whoever appoints angels, prophets, or intermediaries for people to call upon, depend upon, and ask for acquiring benefit and avoiding harm, such as one who asks for the forgiveness of sins, guidance of hearts, removal of hardships, and relief from poverty, he is an unbeliever by the consensus of the Muslims.<\/p>\n<p>Source: Majmū’ al-Fatāwá 1\/124<\/p><\/blockquote>\n<p>And Imam Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمِنْ أَنْوَاعِهِ يعني الشرك طَلَبُ الْحَوَائِجِ مِنَ الْمَوْتَى وَالِاسْتِغَاثَةُ بِهِمْ وَالتَّوَجُّهُ إِلَيْهِمْ وَهَذَا أَصْلُ شِرْكِ الْعَالَمِ فَإِنَّ الْمَيِّتَ قَدِ انْقَطَعَ عَمَلُهُ وَهُوَ لَا يَمْلِكُ لِنَفْسِهِ ضَرَّا وَلَا نَفْعًا فَضْلًا عَمَّنِ اسْتَغَاثَ بِهِ وَسَأَلَهُ قَضَاءَ حَاجَتِهِ أَوْ سَأَلَهُ أَنْ يَشْفَعَ لَهُ إِلَى اللَّهِ فِيهَا<\/p>\n<p>Among the types of idolatry are seeking one’s needs from the deceased, seeking their aid, and turning to them. This is the origin of idolatry in the world. Indeed, the deeds of the deceased have been put to an end and they have no control for themselves to cause harm or benefit, especially one who seeks their aid and asks them to fulfill their needs or asks them to intercede with Allah for them.<\/p>\n<p>Source: Madārij al-Sālikīn 1\/353<\/p><\/blockquote>\n<p>And Imam Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">واعلم أن سؤالَ اللهِ تعالى دونَ خلقه هو المتعين لأن السؤال فيه إظهار الذلِّ من السائل والمسكنة والحاجة والافتقار وفيه الاعترافُ بقدرةِ المسؤول على دفع هذا الضَّرر ونيل المطلوب وجلبِ المنافع ودرء المضارِّ ولا يصلح الذلُّ والافتقار إلَّا لله وحدَه لأنه حقيقة العَبادة<\/p>\n<p>Know that asking Allah Almighty, to the exclusion of His creation, is what is required, because asking shows humility, helplessness, need, and poverty by the one asking. It includes acknowledging the ability of the one being asked to repel this harm, attain what is desired, bring benefits, and ward off evil. It is only appropriate to show this humility and helplessness to Allah alone as it is the essence of worship.<\/p>\n<p>Source: Jāmi’ al-‘Ulūm wal-Ḥikam 1\/481<\/p><\/blockquote>\n<p>And Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وتحقيق هذا المعنى وإيضاحه أن قول العبد لا إله إلا الله يقتضي أن لا إله له غير الله وإلآله هو الذي يطاع فلا يُعصى هيبة له وإجلالًا ومحبة وخوفًا ورجاء وتوكلًا عليه وسؤالًا منه ودعاءً له ولا يصلح ذلك كله إلا الله فمن أشرك مخلوقًا في شيء من هذه الأمور التي هي من خصائص الآلهية كان ذلك قدحًا في إخلاصه في قول لا إله إلا الله ونقصًا في توحيده وكان فيه من عبودية المخلوق بحسب ما فيه<\/p>\n<p>The realization and clarification of this meaning is that the servant’s saying, ‘There is no God but Allah’ necessitates that he has no ‘god’ but Allah, and Allah is the One who is obeyed and not disobeyed, out of awe for Him, reverence, love, fear, hope, trust in Him, asking Him, and supplication to Him. No one can do all of that except Allah. Hence, whoever associates a creature with something of these matters, which are among the specific characteristics of Divinity, that is a flaw in his sincerity in saying, ‘There is no God but Allah,’ a deficiency in his monotheism, and it involves servitude to the created being.<\/p>\n<p>Source: Kalimat al-Ikhlāṣ 1\/23<\/p><\/blockquote>\n<p>And Imam al-Fattani al-Hanafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإن منهم من قصد بزيارة قبور الأنبياء والصلحاء أن يصلي عند قبورهم ويدعو عندها ويسألهم الحوائج وهذا لا يجوز عند أحد من علماء المسلمين فإن العبادة وطلب الحوائج والاستعانة حق لله وحده<\/p>\n<p>Indeed, among them are those who intend to visit the graves of the prophets and the righteous to perform prayers by their graves, offer supplications by them, and ask them for their needs. This was not permitted by any of the Muslim scholars because worship, requesting fulfilment of needs, and seeking help are the right of Allah alone.<\/p>\n<p>Source: Majma&#8217; Bihār al-Anwār 2\/444<\/p><\/blockquote>\n<p>And Imam al-Halabi al-Hanafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإنه قد ظهر الآن فيما بين المسلمين جماعات يدعون أنّ للأولياء تصرفات في حياتهم وبعد الممات ويستغاث بهم في الشدائد والبليات وبهممهم تنكشف المهمات فيأتون قبورهم وينادونهم في قضاء الحاجات مستدلين على أن ذلك منهم كرامات &#8230; وقرّرهم على ذلك من ادعى العلم بمسائل وأمدهم بفتاوى ورسائل وجوّزوا لهم الذبائح والنذور وأثبتوا لهم فيهما الأجور وهذا كما تر كلام فيه تفريط وإفراط وغلو في الدين بترك الاحتياط بل فيه الهلاك الأبدي والعذاب السرمدي لما فيه من روائح الشرك المحقق ومصادرة الكتاب العزيز المصدّق ومخالف لعقائد الأئمة وما اجتمعت عليه الأمة<\/p>\n<p>Now, groups have appeared among the Muslims who claim that the saints have agency during their lives and after death, and their aid is sought in times of hardship and trial, that through their determination important matters are revealed, so they come to their graves and call out to them for the fulfilment of needs, citing as evidence that it is among their miracles …<\/p>\n<p>They were affirmed in this by those who claimed knowledge of the issues and provided them with verdicts and letters permitting them to perform sacrifices and vows for them and established rewards for them in doing so. This, as you see, is a discourse containing excess, negligence, and exaggeration in the religion by abandoning caution. Rather, it contains eternal ruin and everlasting punishment by the odors of confirmed idolatry within it, as issued by the Noble and Truthful Book and in contradiction to the beliefs of the Imams and what the Ummah has agreed upon.<\/p>\n<p>Source: Sayf Allāh &#8216;alá man Kadhaba &#8216;alá Awliyā&#8217; Allāh 1\/49-50<\/p><\/blockquote>\n<p>And Imam al-San’ani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإفرادُ الله تعالى بتوحيد العبادة لا يتِمُّ إلاَّ بأن يكونَ الدعاءُ كلُّه له والنداءُ في الشدائد والرخاء لا يكون إلاَّ لله وحده والاستغاثة والاستعانةُ بالله وحده واللّجوء إلى الله والنذر والنحر له تعالى وجميع أنواع العبادات من الخضوع والقيام تذلُّلاً لله تعالى والركوع والسجود والطواف والتجرد عن الثياب والحلق والتقصير كلُّه لا يكون إلاَّ لله عز وجل<\/p>\n<p style=\"text-align: right;\">ومَن فعل شيئاً مِن ذلك لمخلوق حيٍّ أو ميت أو جماد أو غيره فقد أشرك في العبادة وصار مَن تُفعل له هذه الأمور إلَهاً لعابديه سواءٌ كان مَلَكاً أو نبيًّا أو وليًّا أو شجراً أو قبراً أو جنيًّا أو حيًّا أو ميتاً وصار العابدُ بهذه العبادة أو بأيِّ نوع منها عابداً لذلك المخلوق مشركاً بالله<\/p>\n<p>Thus, singling out Allah Almighty in the Oneness of worship is not complete unless all supplications are for Him, and calling out in hardship and ease is only for Allah alone, and seeking aid and help is only for Allah alone, and seeking refuge in Allah, vows, and sacrifices are for Him the Almighty, and all types of worship such as humbling oneself, standing in humility for Allah Almighty, bowing, prostration, circumambulation, clothing oneself for pilgrimage, shaving, and shortening hair, all of it is only for Allah Almighty.<\/p>\n<p>Whoever does any of that for a created being, either living, deceased, inanimate, or otherwise, he has committed idolatry in worship. The one for whom these things are done has become a ‘god’ for his worshippers, whether he is an angel, a prophet, a saint, a tree, a grave, or a jinn, living or deceased, and the worshipper by this worship, or by any type of it, has indeed become a worshiper of that creature and has associated partners with Allah.<\/p>\n<p>Source: Taṭhīr al-I&#8217;tiqād 1\/58<\/p><\/blockquote>\n<p>And Imam Ibn al-Nahhas al-Shafi’i writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومنها إيقادهم السرج عند الأشجار والأحجار والعيون والآبار ويقولون إنها تقبل النذر وهذه كلها بدع شنيعة ومنكرات قبيحة يجب إزالتها ومحو أثرها فإن أكثر الجهال يعتقدون أنها تضر وتنفع وتجلب وتدفع وتشفي المرضى وترد الغائب إذا نذر لها وهذا شرك ومحادة لله ولرسوله صلى الله عليه وسلم<\/p>\n<p>Among them is their lighting lamps near trees, rocks, springs, and wells. They claim that they accept vows. All of these are heinous innovations and ugly evils that must be removed and their traces eradicated. Indeed, most of the ignorant believe that they cause harm and bring benefit, they heal the sick, and return what is lost if a vow is made to them. This is idolatry and defiance of Allah and His Messenger.<\/p>\n<p>Source: Tanbīh al-Ghāfilīn 1\/522<\/p><\/blockquote>\n<p>Idolatry was first introduced to the people of the Prophet Noah ﷺ because they built statues to commemorate their righteous ancestors, but later generations began to worship these statues. This is why the authentic Sunnah contains many rules designed to prevent the exaggeration of the righteous at their gravesites.<\/p>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صَارَتْ الْأَوْثَانُ الَّتِي كَانَتْ فِي قَوْمِ نُوحٍ فِي الْعَرَبِ بَعْدُ أَسْمَاءُ رِجَالٍ صَالِحِينَ مِنْ قَوْمِ نُوحٍ فَلَمَّا هَلَكُوا أَوْحَى الشَّيْطَانُ إِلَى قَوْمِهِمْ أَنْ انْصِبُوا إِلَى مَجَالِسِهِمْ الَّتِي كَانُوا يَجْلِسُونَ أَنْصَابًا وَسَمُّوهَا بِأَسْمَائِهِمْ فَفَعَلُوا فَلَمْ تُعْبَدْ حَتَّى إِذَا هَلَكَ أُولَئِكَ وَتَنَسَّخَ الْعِلْمُ عُبِدَتْ<\/p>\n<p>All of the idols among the people of Noah appeared among the Arabs later. They were the names of righteous men among the people of Noah. When they passed away, Satan inspired in their people to build statues in the places they used to sit and name them by their names. They did so and they were not worshiped until the first generation passed away and knowledge was lost; then they were worshiped.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4920, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/28\/ibn-abbas-origin-shirk\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ لَا تَجْعَلْ قَبْرِي وَثَنًا لَعَنَ اللَّهُ قَوْمًا اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ<\/p>\n<p><strong>O Allah, do not turn my grave into an idol that is worshiped. Allah has cursed people who take the graves of their prophets as places of worship.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7352, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/09\/20\/do-not-make-my-grave-idol\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Jabir, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُجَصَّصَ الْقُبُورُ وَأَنْ يُكْتَبَ عَلَيْهَا وَأَنْ يُبْنَى عَلَيْهَا وَأَنْ تُوطَأَ<\/p>\n<p>The Prophet, peace and blessings be upon him, prohibited plastering over graves, writing upon them, building over them, and treading upon them.<\/p>\n<p>Source: Sunan al-Tirmidhī 1052, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/11\/11\/plastering-writing-qabr-qubur\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>And Imam Ibn Kathir al-Shafi&#8217;i writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَصْلُ عِبَادَةِ الْأَصْنَامِ مِنَ الْمُغَالَاةِ فِي الْقُبُورِ وَأَصْحَابِهِا وَقَدْ أَمَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِتَسْوِيَةِ الْقُبُورِ وَطَمْسِهَا وَالْمُغَالَاةُ فِي الْبَشَرِ حَرَامٌ وَمَنْ زَعَمَ أَنَّهَا تَفُكُّ مِنَ الْخَشَبِ أَوْ أَنَّهَا تَنْفَعُ أَوْ تَضُرُّ بِغَيْرِ مَشِيئَةِ اللَّهِ فَهُوَ مُشْرِكٌ<\/p>\n<p>The origin of idolatry is from the exaggeration of the graves and their inhabitants. The Prophet ordered for graves to be leveled and covered, and exaggerating the status of humans is forbidden. Whoever claims that they are detached from the wood, or that they bring benefit and cause harm by other than the will of Allah, he is an idolater.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 14\/172<\/p><\/blockquote>\n<p>Muslims must act cautiously so as not to exaggerate the status of the Prophet ﷺ and the righteous saints. Indeed, Allah commanded His Messenger to announce to people that he has no power to benefit or harm like Allah, nor does he know the Unseen except what was revealed to him.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُل لَّا أَمْلِكُ لِنَفْسِي نَفْعًا وَلَا ضَرًّا إِلَّا مَا شَاءَ اللَّهُ وَلَوْ كُنتُ أَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ وَمَا مَسَّنِيَ السُّوءُ<\/p>\n<p><strong>Say, ‘I have no power to benefit or protect myself, except by the will of Allah. If I had known the unknown, I would have benefited myself enormously, and no harm would have ever touched me. I am only a warner and deliverer of good news for those who believe.’<\/strong><\/p>\n<p>Surat al-A’raf 7:188<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُل لَّا أَقُولُ لَكُمْ عِندِي خَزَائِنُ اللَّهِ وَلَا أَعْلَمُ الْغَيْبَ وَلَا أَقُولُ لَكُمْ إِنِّي مَلَكٌ<\/p>\n<p><strong>Say, ‘I do not say to you that I possess Allah’s treasuries or know the Unseen, nor do I claim to be an angel. I only follow what is revealed to me.’<\/strong><\/p>\n<p>Surat al-An’am 6:50<\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ بَعِيرٌ لَهُ رُغَاءٌ يَقُولُ يَا رَسُولَ اللهِ أَغِثْنِي فَأَقُولُ لَا أَمْلِكُ لَكَ شَيْئًا قَدْ أَبْلَغْتُكَ<\/p>\n<p><strong>Let me not find one of you on the Day of Resurrection coming with a growling camel mounted upon his neck and he says, ‘O Messenger of Allah, rescue me!’ Then I will say, ‘I have no power to rescue you, for I already delivered the message.’<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3037, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/02\/28\/istighathah-i-have-no-power\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تُطْرُونِي كَمَا أَطْرَتْ النَّصَارَى ابْنَ مَرْيَمَ فَإِنَّمَا أَنَا عَبْدُهُ فَقُولُوا عَبْدُ اللَّهِ وَرَسُولُهُ<\/p>\n<p><strong>Do not exaggerate my status as the Christians have done with the son of Mary. Verily, I am only a servant, so refer to me as the servant of Allah and His Messenger.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3445, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/03\/do-not-exaggerate-status-prophet\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا النَّاسُ عَلَيْكُمْ بِتَقْوَاكُمْ وَلَا يَسْتَهْوِيَنَّكُمْ الشَّيْطَانُ أَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَبْدُ اللَّهِ وَرَسُولُهُ وَاللَّهِ مَا أُحِبُّ أَنْ تَرْفَعُونِي فَوْقَ مَنْزِلَتِي الَّتِي أَنْزَلَنِي اللَّهُ عَزَّ وَجَلَّ<\/p>\n<p><strong>O people, fear Allah and do not let Satan deceive you! I am Muhammad, the son of Abdullah, the servant of Allah and His Messenger. By Allah, I would not love for you to exalt my status above where Allah Almighty has placed me.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 12551, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/03\/do-not-exaggerate-praise-prophet\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>If this is true about the Prophet ﷺ, it applies even more so to those lesser than him such as the Companions and the righteous saints.<\/p>\n<p>It is said that Muslims who call upon the Prophet ﷺ for God-like help cannot have committed idolatry because they believe Allah has granted these God-like powers to him, or that the source of his God-like powers comes from Allah, or that he merely &#8216;intercedes&#8217; with Allah on their behalf. This is the same understanding as the idolaters in the time of the Prophet.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا يُؤْمِنُ أَكْثَرُهُم بِاللَّهِ إِلَّا وَهُم مُّشْرِكُونَ<\/p>\n<p><strong>Most of them do not believe in Allah without associating others with Him.<\/strong><\/p>\n<p>Surat Yusuf 12:108<\/p><\/blockquote>\n<p>Imam al-Mahalli al-Shafi&#8217;i commented on this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِذَا كَانُوا يَقُولُونَ فِي تَلْبِيَتهمْ لَبَّيْكَ لَا شَرِيك لَك إلَّا شَرِيكًا هُوَ لَك تَمْلِكهُ وَمَا ملك<\/p>\n<p>For this reason, the idolaters would say in their supplication for the pilgrimage, ‘At Your service! You have no partners except Your partners whom You control and they do not control You.’<\/p>\n<p>Source: Tafsīr al-Jalālayn 12:106<\/p><\/blockquote>\n<p>The idolaters claimed their ‘partners’ with Allah were under His control and they did not ascribe Lordship to their idols. This is why they would call out to Allah alone for help when under extreme distress.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ<\/p>\n<p><strong>If they happen to be aboard a ship caught in a storm, they cry out to Allah alone in sincere devotion. But as soon as He delivers them safely to shore, they associate others with Him once again.<\/strong><\/p>\n<p>Surat al-‘Ankabut 29:65<\/p><\/blockquote>\n<p>Indeed, the idolaters openly admitted that Allah was the Almighty Creator, not their idols.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ قُلِ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ<\/p>\n<p><strong>If you ask them who created the heavens and the earth, they will definitely say, &#8216;Allah!&#8217; Say, &#8216;Praise be to Allah!&#8217; In fact, most of them do not know.<\/strong><\/p>\n<p>Surat Luqman 31:25<\/p><\/blockquote>\n<p>Instead of claiming their gods were Creators or Almighty Lords, they said their gods were their ‘intercessors’ with Allah and they performed acts of devotion to them to get closer to Allah.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِندَ اللَّهِ قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ<\/p>\n<p><strong>They worship besides Allah others who can neither harm nor benefit them, and say, ‘These are our intercessors with Allah.’ Ask them, ‘Are you informing Allah of something He does not know in the heavens or the earth? Glorified and Exalted is He above what they associate with Him!’<\/strong><\/p>\n<p>Surat Yunus 10:18<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا لِلَّهِ الدِّينُ الْخَالِصُ وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ<\/p>\n<p><strong>Indeed, sincere devotion is due only to Allah. As for those who take other lords besides Him, saying, ‘We worship them only so they may bring us closer to Allah,’ surely Allah will judge between all regarding what they differed about. Allah certainly does not guide whoever persists in lying and disbelief.<\/strong><\/p>\n<p>Surat al-Zumar 39:3<\/p><\/blockquote>\n<p>Imam Ibn Kathir al-Shafi&#8217;i commented on this verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِلاّ لِيُقَرِّبُونا إِلَى اللهِ زُلْفى أي ليشفعوا لنا ويقربونا عنده منزلة ولهذا كانوا يقولون في تلبيتهم إذا حجوا في جاهليتهم لبيك لا شريك لك إلا شريكا هو لك تملكه وما ملك وهذه الشبهة هي التي اعتمدها المشركون قديم الدهر وحديثه وجاءتهم الرسل صلوات الله وسلامه عليهم أجمعين بردّها والنهي عنها والدعوة إلى إفراد العبادة لله وحده لا شريك له وأنّ هذا شيء اخترعه المشركون من عند أنفسهم لم يأذن الله فيه ولا رضي به بل أبغضه ونهى عنه<\/p>\n<p>‘<strong>So they may bring us closer to Allah<\/strong>,’ that is, they intercede for us and bring us closer in position to Him. For this reason, the idolaters would say in their supplication for the pilgrimage during the time of ignorance, ‘At Your service! You have no partners except Your partners whom You control and they do not control You.’ This doubt was relied upon by the idolaters of the past and present. All of the Messengers came to them to refute it, prohibit it, and invite them to single out Allah alone for worship, who has no partner. This is something the idolaters invented by themselves, which Allah never allowed nor approved. Rather, He hates it and has prohibited it.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 7\/75<\/p><\/blockquote>\n<p>Therefore, a Muslim might still commit idolatry by performing such acts of devotion to the Prophet ﷺ or the saints, which should only be directed to Allah, even if they do not believe the prophets or saints have independent powers from Allah. It is the acts of devotion tantamount to worship that matter.<\/p>\n<p>It is further confirmed in the authentic Sunnah that some Muslims in later times would fall into idol worship due to the influence of false saints, who claim prophetic agency or something like it, teaching them corrupted doctrines.<\/p>\n<p>Thawban reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَقُومُ السَّاعَةُ حَتَّى تَلْحَقَ قَبَائِلُ مِنْ أُمَّتِي بِالْمُشْرِكِينَ وَحَتَّى يَعْبُدُوا الْأَوْثَانَ وَإِنَّهُ سَيَكُونُ فِي أُمَّتِي ثَلَاثُونَ كَذَّابُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ نَبِيٌّ وَأَنَا خَاتَمُ النَّبِيِّينَ لَا نَبِيَّ بَعْدِي<\/p>\n<p><strong>The Hour will not be established until tribes from my nation join the idolaters and they worship idols. Verily, there will be thirty liars among my nation, all of them claiming to be a prophet, but I am the seal of the Prophets. There is no prophet after me.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2219, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/21\/signs-hour-idol-worship\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>To justify Muslims seeking help from the saints, one of their supporters claims that their calling out for help is meant as a metaphor:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإذا وجد في كلام المؤمنين إسناد شيء لغير الله تعالى يجب حمله على المجاز العقلي ولا سبيل إلى تكفيرهم<\/p>\n<p>If you find in the words of the believers something attributed to other than Allah Almighty, it must be interpreted as a logical metaphor and not as a cause to excommunicate them.<\/p>\n<p>Source: Hādhihi Mafāhīmunā 1\/127<\/p><\/blockquote>\n<p>It is admirable to find excuses not to excommunicate Muslims and to give them every chance to learn and adhere to the authentic Sunah, but it is not praiseworthy to make flimsy excuses for prayers that are outwardly idolatrous. It is also not correct to speak of these matters with the intention of excommunicating Muslims. Rather, it is the duty of a true scholar to warn such Muslims, out of genuine concern for them, that their deeds are invalid and potentially idolatrous.<\/p>\n<p>Supplication in humility, confessing one’s helplessness, and asking for divine help is the essence of worship. As such, these prayers must be in agreement with the authentic Sunnah and they cannot be innovated to such an excessive degree.<\/p>\n<p>Al-Nu’man ibn Bashir reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّعَاءُ هُوَ الْعِبَادَةُ<\/p>\n<p><strong>Supplication is worship itself.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ رَبُّكُمْ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ<\/p>\n<p><strong>Your Lord said: Call upon Me and I will answer you. Verily, those who disdain My worship will enter Hell in humiliation.<\/strong> (40:60)<\/p>\n<p>Source: Sunan al-Tirmidhī 3247, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/11\/dua-essence-ibadah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الدُّعَاءُ مُخُّ الْعِبَادَةِ<\/p>\n<p><strong>Supplication is the essence of worship.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3371, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/07\/dua-essence-of-ibadah\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>And Imam Ibn Abi al-&#8216;Izz al-Hanafi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالدُّعَاءُ مِنْ أَفْضَلِ الْعِبَادَاتِ وَالْعِبَادَاتُ مَبْنَاهَا عَلَى السُّنَّةِ وَالِاتِّبَاعِ لَا عَلَى الْهَوَى وَالِابْتِدَاعِ<\/p>\n<p>Supplication is the greatest act of worship, and acts of worship must be based upon conformity to the Sunnah, not upon whims and innovations.<\/p>\n<p>Source: Sharḥ al-‘Aqīdah al-Ṭaḥāwịyah 1\/297<\/p><\/blockquote>\n<p>In practice, those who call out to the Prophet ﷺ or the saints for help do indeed ascribe God-like powers to them. This, after all, is the plain meaning of their words.<\/p>\n<p>Imam al-Alusi al-Maturidi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أن الناس قد أكثروا من دعاء غير الله تعالى من الأولياء الأحياء منهم والأموات وغيرهم مثل يا سيدي فلان أغثني وليس ذلك من التوسل المباح في شيء واللائق بحال المؤمن عدم التفوه بذلك وأن لا يحوم حول حماه وقد عدّه أناس من العلماء شركا وأن لا يكنه فهو قريب منه ولا أرى أحدا ممن يقول ذلك إلا وهو يعتقد أن المدعو الحي الغائب أو الميت المغيب يعلم الغيب أو يسمع النداء ويقدر بالذات أو بالغير على جلب الخير ودفع الأذى وإلا لما دعاه ولا فتح فاه وفي ذلك بلاء من ربكم عظيم<\/p>\n<p>People have increased their supplications to other than Allah Almighty among the saints and others, whether living or deceased. For example, it is said, ‘O my master, help me!’ This has nothing to do with permissible &#8216;seeking means&#8217; at all. It is suitable for a believer not to utter this, nor hover around his patron, as numerous scholars considered this to be idolatry and they were not quiet about it, as it is close to it. I do not know anyone who called out like that except he believed the one he called upon, either living or deceased, knows the Unseen and hears his cry and is capable with his or another’s essence to bring benefit and repel harm, or else he would not have called upon him and opened his mouth. There is a great trial in this from your Lord.<\/p>\n<p>Source: Rūh al-Maʻānī 3\/298<\/p><\/blockquote>\n<p>All of this confusion stems from equating permissible Tawassul with innovated practices wrongly labeled as Tawassul.<\/p>\n<p>Some misguided people are dishonest or ignorant about the issue because they appeal to the juristic authority of Tawassul by the Prophet ﷺ to justify what is not in the same legal category. Their real aim is to promote Istighatha, which is seeking God-like help from deceased saints, and not permissible Tawassul.<\/p>\n<p>This tactic is called the Motte-and-Bailey fallacy. <span style=\"box-sizing: border-box;\">It conflates two positions that share similarities, one that is easy to defend (<em>Tawassul<\/em>) and one that is invalid (<em>Istighatha<\/em>). They intend to validate Istighatha—their Bailey—but it is impossible using orthodox methodologies, so they claim to advocate for Tawassul—<\/span>their Motte.<\/p>\n<p>Imam al-Shawkani refutes this false equivalence, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإن قلت إن هؤلاء القبوريين يعتقدون أن الله هو الضار النافع والخير والشر بيده وإن استغاثوا بالأموات قصدا لإنجاز ما يطلبونه من الله سبحانه وتعالى قلت وهكذا كانت الجاهلية فإنهم يعلمون أن الله هو الضار النافع وأن الخير والشر بيده وإنما عبدوا أصنامهم لتقربهم إلى الله زلفى كما حكاه الله عنهم في كتابه العزيز<\/p>\n<p style=\"text-align: right;\">نعم إذا لم يحصل من المسلمين إلا مجرد التوسل الذي قدمنا تحقيقه فهو كما ذكرناه سابقا ولكن من زعم أنه لم يقع منه إلا مجرد التوسل وهو يعتقد من تعظيم ذلك الميت ما لا يجوز اعتقاده في أحد من المخلوقين وزاد على مجرد الاعتقاد فتقرب إلى الأموات بالذبائح والنذور وناداهم مستغيثا بهم عند الحاجة، فهذا كاذب في دعواه أنه متوسل فقط<\/p>\n<p>If you say, ‘These grave-worshipers believe Allah alone causes harm and benefit, all good and evil are in His hand, and if they seek aid from the deceased their intention is to acquire what they request from Allah Almighty,’ then I say: Such was the time of ignorance. They knew Allah alone causes harm and benefit, all good and evil are in His hand, but they worshiped their idols to bring them closer to Allah, as Allah mentioned in His Honorable Book.<\/p>\n<p>Yes, if the Muslims did nothing but merely ‘seeking the means’ that we have already investigated, then it is as we mentioned previously. But whoever claims that he did nothing but merely ‘seeking the means’ and he believes in the veneration of that deceased person in a manner that is not permissible to believe about created beings, and he went beyond mere belief and approached the dead with sacrifices and vows and called upon them seeking their aid when in need, then he is lying in his claim that he is only ‘seeking the means.’<\/p>\n<p>Source: al-Fatḥ al-Rabbānī 1\/341<\/p><\/blockquote>\n<p>In sum, Tawassul, or asking Allah ‘by the Prophet&#8217; ﷺ, is permissible and valid, according to many scholars, when it is performed within the limits prescribed by the authentic Sunnah. Tawassul does not mean the innovated practices of asking the deceased saints for their supplications or intercession, and it certainly does not mean asking the deceased saints for God-like help.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The difference between the two matters is agreed upon by the Muslims.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[20,399,394,88,37,90,48,56,60,68,220,98],"class_list":["post-24398","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-creation-al-khalq","tag-exaggeration-al-ghuluw","tag-graves-al-qubur","tag-pilgrimage-hajj","tag-idolatry-shirk","tag-innovation-bidah","tag-justice-adl","tag-monotheism-tawheed","tag-prayer-salat","tag-satan-al-shaytan","tag-supplication-al-dua","tag-unbelief-al-kufr"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6lw","jetpack-related-posts":[{"id":20841,"url":"https:\/\/www.abuaminaelias.com\/tawassul-prophets-saints-graves\/","url_meta":{"origin":24398,"position":0},"title":"Tawassul: Seeking help from prophets and saints?","author":"Abu Amina Elias","date":"August 28, 2019","format":false,"excerpt":"\"O you who have faith, fear Allah and seek means to approach Him.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23683,"url":"https:\/\/www.abuaminaelias.com\/asking-dead-for-dua\/","url_meta":{"origin":24398,"position":1},"title":"Asking the deceased for supplications or intercession?","author":"Abu Amina Elias","date":"November 7, 2021","format":false,"excerpt":"\"If you ask, ask from Allah. If you seek help, seek help from Allah.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18417,"url":"https:\/\/www.abuaminaelias.com\/praying-for-enemies-in-islam\/","url_meta":{"origin":24398,"position":2},"title":"Praying for enemies in Islam","author":"Abu Amina Elias","date":"November 2, 2016","format":false,"excerpt":"\"I was not sent to invoke curses, but rather I was only sent as mercy.\"","rel":"","context":"In &quot;Righteousness البر&quot;","block_context":{"text":"Righteousness البر","link":"https:\/\/www.abuaminaelias.com\/category\/righteousness-al-birr\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14804,"url":"https:\/\/www.abuaminaelias.com\/sending-blessings-upon-the-prophet-and-his-companions\/","url_meta":{"origin":24398,"position":3},"title":"Sending blessings upon the Prophet and his Companions","author":"Abu Amina Elias","date":"August 26, 2013","format":false,"excerpt":"\"Whoever sends blessings upon me once will have Allah send blessings upon him ten times.\" --Sahih Muslim 408","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23619,"url":"https:\/\/www.abuaminaelias.com\/grave-worship-in-islam\/","url_meta":{"origin":24398,"position":4},"title":"Prohibition of grave worship in Islam","author":"Abu Amina Elias","date":"October 19, 2021","format":false,"excerpt":"\"Do not take graves as places of prayer. I forbid you from doing so.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17921,"url":"https:\/\/www.abuaminaelias.com\/hafsa-maria-surat-at-tahreem\/","url_meta":{"origin":24398,"position":5},"title":"Story of Hafsa and Maria in Surat al-Tahrim","author":"Abu Amina Elias","date":"March 26, 2016","format":false,"excerpt":"\"Indeed, the only authentic narration is that it was about honey,\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/24398","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=24398"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/24398\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=24398"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=24398"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=24398"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}