{"id":25259,"date":"2025-05-01T10:28:35","date_gmt":"2025-05-01T06:28:35","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=25259"},"modified":"2025-05-02T11:54:45","modified_gmt":"2025-05-02T07:54:45","slug":"how-to-enjoy-your-worship-of-allah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/how-to-enjoy-your-worship-of-allah\/","title":{"rendered":"How to enjoy your worship of Allah"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>As Muslims, we know we should enjoy our prayers and the journey of memorizing the Quran. We often feel a ‘spiritual high’ while worshiping, especially during Ramadan.<\/p>\n<p>However, worship can be difficult for many of us and particularly for the youth. Know that this is not a failure on your part, or an indictment of your lack of faith.<\/p>\n<p>On the contrary, the righteous predecessors themselves would struggle with their worship for many years. This is a natural part of our religious and spiritual development. Indeed, it is a test of our sincerity with Allah, but the path to regularly experiencing the bliss of prayer and Quranic recitation is within your reach.<\/p>\n<p>The Prophet ﷺ is our most excellent example in this regard. He always performed the night prayer, which is not even an obligation for the rest of us, because he enjoyed it. He was rejuvenated by it, and it was the most beloved thing to him in the whole world.<\/p>\n<p>Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جُعِلَتْ قُرَّةُ عَيْنِي فِي الصَّلَاةِ<\/p>\n<p><strong>The delight of my eyes was made in prayer.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3939, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/07\/01\/salat-coolness-delight-eyes\/\">Qawi<\/a><\/em><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَكْعَتَا الْفَجْرِ خَيْرٌ مِنْ الدُّنْيَا وَمَا فِيهَا لَهُمَا أَحَبُّ إِلَىَّ مِنَ الدُّنْيَا جَمِيعًا<\/p>\n<p><strong>Two cycles of prayer before the dawn prayer are better than the world and everything in it. They are both more beloved to me than the entire world.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 725, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/06\/28\/salat-al-fajr-khayr-dunya\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>And the Prophet said to Bilal, his caller to prayer, may Allah be pleased with him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُمْ يَا بِلَالُ فَأَرِحْنَا بِالصَّلَاةِ<\/p>\n<p><strong>Stand, O Bilal, and comfort us with the prayer.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4986, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/02\/05\/o-bilal-comfort-us-with-salat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet ﷺ and his Companions took pleasure in their acts of worship. The stories of their long night prayers even put us to shame!<\/p>\n<p>But these high spiritual states, other than the Prophet himself, did not develop overnight. Instead, it was a long process of struggle against the <em>nafs<\/em> (lower-self) to acquire the habits of worship, to the point where it eventually became pleasurable.<\/p>\n<p>Imam Ibn Hajar commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ كَانَتْ قُرَّةُ عَيْنِهِ فِي شَيْءٍ فَإِنَّهُ يَوَدُّ أَنْ لَا يُفَارِقَهُ وَلَا يَخْرُجَ مِنْهُ لِأَنَّ فِيهِ نَعِيمَهُ وَبِهِ تَطِيبُ حَيَاتُهُ وَإِنَّمَا يَحْصُلُ ذَلِكَ لِلْعَابِدِ بِالْمُصَابَرَةِ عَلَى النَّصَبِ فَإِنَّ السَّالِكَ غَرَضُ الْآفَاتِ وَالْفُتُورِ<\/p>\n<p>Whoever finds ‘the delight of his eyes’ in something, he would love for it never to leave him or depart from him, because in it lies his bliss, and through it his life is made pleasant. This is only attained by the worshipper through perseverance in the face of hardship, for the seeker is vulnerable to obstacles and sluggishness.<\/p>\n<p>Source: Fatḥ al-Bārī 11\/345<\/p><\/blockquote>\n<p>Shaykh Ibrahim ibn Hasan, an Imam in Mecca, commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والمعنى والله أعلم أنه لا تحصل قرة العين في الصلاة إلا بمجاهدة النفس على الخشوع فيها وحضور القلب وإقباله عليها، وذلك يحتاج إلى كبير مجاهدة مع الاستمرار وعدم الانقطاع وبذلك يحصل المسلم على التلذذ بالصلاة وأن تكون راحة وقرة عين له<\/p>\n<p>The meaning, and Allah knows best, is that ‘the delight of the eyes’ cannot be attained in prayer except by striving with the soul to be humble in it and to have the heart present and devoted to it. This requires a great struggle, along with persistence without interruption. In this way, the Muslim will attain delight in prayer, it will become comfort, and the delight of his eyes.<\/p>\n<p>Source: Ithra &#8216;Amal &#8216;Ibādah al-Ṣalāh 1\/62<\/p><\/blockquote>\n<p>The pleasure of worship is an earned spiritual station that results from <em>Mujahadah<\/em> (spiritual struggle), also known as <em>Jihad al-Nafs<\/em> (struggle against the ego). The ego, or lower-self, tends to seek immediate gratification, whereas the rational mind understands delayed gratification is necessary for long-term benefits.<\/p>\n<p>Do not think of yourself as a failure because you struggle to pray or recite the Quran regularly. We mistakenly think that the religious impulse and motivation must appear before we can act, or that our faith is deficient if we do not enjoy our prayer or recitation. This is a false notion. Even the righteous predecessors struggled for years to attain pleasure in prayer.<\/p>\n<p>‘Utabah al-Ghulam, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَابَدْتُ الصَّلَاةَ عِشْرِينَ سَنَةً وَتَنَعَّمْتُ بِهَا عِشْرِينَ سَنَةً<\/p>\n<p>I suffered with prayer for twenty years, then I enjoyed it for twenty years.<\/p>\n<p>Source: Ḥilyat al-Awliyā’ 10\/10<\/p><\/blockquote>\n<p>Imam Ibn al-Qayyim commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هذه اللذّة والتنعّم بالخدمة إنَّما تحصل بالمصابرة على التكرّه والتعب أوَّلًا فإذا صبر عليه وصدق في صبره أفضى به إلى هذه اللذّة … ولا يزال السالك عرضةَ الآفات والفتور والانتكاس حتى يصل إلى هذه الحال فحينئذٍ يصير نعيمُه في سيره ولذّتُه في اجتهاده وعذابُه في فتوره ووقوفه<\/p>\n<p>This pleasure and enjoyment of servitude is only achieved first by being patient with reluctance and fatigue. If one is patient with it and is sincere in his patience, it will eventually result in this pleasure… The seeker remains vulnerable to obstacles, apathy, and regression until he reaches this desirable state. Then, his pleasure is in his journey, his enjoyment is in his effort, but his torment is in his regression and discontinuation.<\/p>\n<p>Source: Ṭarīq al-Hijratayn 2\/699<\/p><\/blockquote>\n<p>And Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والصبر باللَّه بقاء فلأن العبد إذا كان باللَّه هان عليه كل شيء ويتحمل الأثقال ولم يجد لها ثقلًا فإنه إذا كان باللَّه لا بالخلق ولا بنفسه كان لقلبه وروحه وجود آخر وشأن آخر غير شأنه إذا كان بنفسه وبالخلق وفي هذه الحال لا يجد عناء الصبر ولا مرارته وتنقلب مشاق التكليف له نعيمًا وقرة عين<\/p>\n<p>Patience with Allah is to be permanent, because if the servant is with Allah, everything becomes easy for him, and he endures burdens and does not find them to be heavy. If he is with Allah, not with the creation or himself, his heart and soul will have another existence and another state than if he were with himself or the creation. In this state, he will not find the hardship of patience or its bitterness, and the difficulties of the obligations will turn into bliss for him and the delight of the eyes.<\/p>\n<p>Source: ‘Uddat al-Ṣābirīn 1\/91<\/p><\/blockquote>\n<p>Hence, it is not a failure if you do not enjoy the prayer at the beginning of your journey to Allah. Sometimes we do not want to pray, and we often have little control over our emotions. We might feel the prayer is burdensome, an annoyance, or a mere obligation, but such negative thoughts plagued the righteous saints as well. It is our reaction to these thoughts and feelings that matters most.<\/p>\n<p>The key to overcoming these obstacles is to persevere in worship despite these troubling feelings. Make yourself pray even if you do not feel like doing it. The successful prayer is the one you completed to the best of your ability, being as present with Allah as you can, regardless of how you felt during it.<\/p>\n<p>The same principle applies to memorizing and reciting the Book of Allah.<\/p>\n<p>Thabit al-Bunani, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَابَدْتُ القُرْآن عِشْرِينَ سَنَةً وَتَنَعَّمْتُ بِه عِشْرِينَ سَنَةً<\/p>\n<p>I suffered with the Quran for twenty years, then I enjoyed it for twenty years.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/05\/01\/thabit-quran-twenty-years\/\">Qūt al-Qulūb 1\/92<\/a><\/p><\/blockquote>\n<p>Imam al-Ghazali commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولا يصدر التنعيم إلا من الأنس والحب ولا يصدر الأنس إلا من المداومة على المكابدة والتكلف مدة طويلة حتى يصير التكلف طبعاً فكيف يستبعد هذا وقد يتكلف الإنسان تناول طعام يستبشعه أولاً ويكابد أكله ويواظب عليه فيصير موافقاً لطبعه حتى لا يصبر عنه فالنفس معتادة متحملة لما تتكلف هي النفس ما عودتها تتعود<\/p>\n<p>Enjoyment does not result except from intimacy and love, and intimacy does not result except from persistence in suffering and exertion for long periods until exertion becomes one’s nature. How could it be otherwise? A person may eat food that he finds disgusting at first, and he struggles to eat it, but he persists in it such that the taste is acquired naturally, until he cannot stand to be without it. The soul will become accustomed to and endure what is exerted for. It is the soul that will resume its habits.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/302<\/p><\/blockquote>\n<p>And Al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فليكن حاله الصبر أو العزيمة عليه حتى يجد حلاوة التلاوة<\/p>\n<p>Let him be in a state of patience or determination upon it until he experiences the sweetness of recitation.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/286<\/p><\/blockquote>\n<p>Shaykh ‘Uwaydah, senior teacher at the Quran memorization center in Jeddah, writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فالمرء لا يصل أحياناً إلى لذة العبادة إلا بعد أن يذوق مشقتها فإذا قوي تعلق الرجاء بالعوض سمحت الطباع بترك العادات وترك الراحة فالإنسان مفطور أن لا يترك محبوباً إلا لمحبوب أعظم منه<\/p>\n<p>Thus, a person at times does not reach the pleasure of worship until he has tasted its hardship. If the attachment to hope for reward becomes strong, he will naturally abandon bad habits and leave comfort. For a human being will instinctively not abandon something beloved to them unless it is for something more beloved than it.<\/p>\n<p>Source: Faṣl al-Khiṭāb fī al-Zuhd 5\/246<\/p><\/blockquote>\n<p>Just as someone might dislike coffee the first time they try it, if they continue to drink it, coffee will become an <em>acquired taste<\/em>. Or like a long-distance runner who struggles with sore muscles and discomfort at the beginning of their training, but later experiences the &#8216;runner&#8217;s high&#8217; which sustains their steady practice. In the same way, our lower-selves might dislike the effort we need to put into prayer and Quranic memorization, but consistency will eventually lead to an acquired taste for worship.<\/p>\n<p>Psychologists call this the <em>behavioral activation principle<\/em>. We should not wait for the motivation or ‘spiritual high’ to come before the act of worship. Rather, we must overcome the ego’s sluggish inertia to perform acts of worship before we experience such positive feelings. If we persist in the proper behaviors, the blessed spiritual emotions will eventually follow, sooner or later.<\/p>\n<p>In addition, it is essential to change our mindset regarding memorizing and reciting the Book of Allah. We should not think of it is as a bothersome obligation, something people expect us to do, or even worse, memorizing only for the social status it will bring. Rather, we must think of the Quran as Allah’s conversation with us, as if He is speaking to us directly as individuals.<\/p>\n<p>Some of the righteous scholars used to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كنت أقرأ القرآن فلا أجد له حلاوة حتى تلوته كأني أسمعه من رسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يتلوه على أصحابه ثم رفعت إلى مقام فوقه فكنت أتلوه كأني أسمعه من جبريل عليه السلام يلقيه على رسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثم جاء الله بمنزلة أخرى فأنا الآن أسمعه من المتكلم عزّ من قائل فعندها وجدت له نعيماً ولذة لا أصبر عنها<\/p>\n<p>I used to recite the Quran, but I did not find any sweetness in it, until I recited it as if I was hearing it from the Messenger of Allah himself, peace and blessings be upon him, reciting it to his companions. Then, I was raised to a station above it and I used to recite it as if I was hearing it from the Angel Gabriel, upon him be peace, delivering it to the Messenger of Allah. Then, Allah brought me to another station, so now I hear the words from the Almighty Speaker Himself. Then, I found in it a bliss and delight that I cannot stand to be without.<\/p>\n<p>Source: Qūt al-Qulūb 1\/92<\/p><\/blockquote>\n<p>One should think of the Quran as Allah’s personal message to themselves. This was the mindset of the Companions and the righteous predecessors.<\/p>\n<p>Al-Hasan ibn ‘Ali, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إنَّ مَنْ كان قَبْلَكُمْ رأوا القرآنَ رسائلَ مِنْ ربِّهِمْ فكانوا يتدبَّرونها بالليل ويَتَفَقَّدُونَها في النهار<\/p>\n<p>Verily, those before you viewed the Qur’an as letters from their Lord, such that they would contemplate it by night and yearn for it by day.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/02\/12\/hasan-quran-letter-from-allah\/\">al-Tibyān fī Ādāb Ḥamalat al-Qur’ān 1\/54<\/a><\/p><\/blockquote>\n<p>Muhammad ibn Ka’b, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ بَلَغَهُ الْقُرْآنُ فَكَأَنَّمَا كَلَّمَهُ اللَّهُ<\/p>\n<p>Whomever the Quran reaches, it is as if Allah is speaking to him.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/05\/01\/quran-direct-address-to-you\/\">Tafsīr al-Tha’labī 6:19<\/a><\/p><\/blockquote>\n<p>Imam al-Ghazali commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا قَدَّرَ ذَلِكَ لَمْ يَتَّخِذْ دِرَاسَةَ الْقُرْآنِ عَمَلَهُ بَلْ يَقْرَؤُهُ كَمَا يَقْرَأُ الْعَبْدُ كِتَابَ مَوْلَاهُ الَّذِي كَتَبَهُ إِلَيْهِ لِيَتَأَمَّلَهُ وَيَعْمَلَ بِمُقْتَضَاهُ<\/p>\n<p>If that is assumed, let him not make the formal study of the Quran his main task. Instead, let him recite as a servant reads the book of his Master, who has written it for him to meditate upon and to act upon what it requires.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/285<\/p><\/blockquote>\n<p>With a change in mindset and pushing through negative feelings of boredom, laziness, or sluggishness, we will eventually arrive at the station of pleasurable, habitual worship with the help of Allah. <span style=\"font-size: 16px;\">In other words, whatever inner state we want to achieve, we must first <\/span>force<span style=\"font-size: 16px;\"> ourselves to perform the outward deeds that coincide with that inner state.<\/span><\/p>\n<p>This insight, well-known to modern cognitive psychologists, can be traced back to the Prophet ﷺ and his Companions.<\/p>\n<p>Sa’d ibn Abi Waqqas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذَا الْقُرْآنَ نَزَلَ بِحُزْنٍ فَإِذَا قَرَأْتُمُوهُ فَابْكُوا فَإِنْ لَمْ تَبْكُوا فَتَبَاكَوْا<\/p>\n<p><strong>Verily, this Quran has descended with sadness. If you recite it, then weep. If you cannot weep, then feign weeping.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 1337, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/02\/09\/recite-then-weep\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>Ibn Abi Mulaykah reported: I was sitting with Abdullah ibn Amr, may Allah be pleased with him, and he mentioned a prophetic tradition, then he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ابْكُوا فَإِنْ لَمْ تَجِدُوا بُكَاءً فَتَبَاكَوْا<\/p>\n<p>Weep! If you do not find yourself weeping, then feign weeping.<\/p>\n<p>Source: al-Zuhd wal-Raqā’iq 1007, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/09\/05\/abdullah-weeping-pretend-cry\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In this example, a heart moved by the Quran’s recitation will cause one to cry, not in a depressive way, but in a manner that fosters reflection and humility. This ‘sadness’ is, in fact, a healthy emotion, as attested by those who have experienced it.<\/p>\n<p>Nevertheless, many of us do not cry when we hear the Quran, even though we should<em>. <\/em>It is recommended to make yourself cry, or at least attempt to cry, not for the sake of showing off, but so that your outward deed matches the inner state you desire. Indeed, if you do not cry when hearing the Quran, then weep for the fact that you cannot weep!<\/p>\n<p>Likewise, this principle applies to any good character trait one would like to acquire. If one finds themselves to be miserly, they should force themselves to give charity until they enjoy it. If one finds themselves to be arrogant, they should humble themselves before others and remember their own personal shortcomings until humility becomes natural to them.<\/p>\n<p>Whatever positive character trait your higher-self desires, then do whatever outward deeds coincide with that virtue.<\/p>\n<p>Imam al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِذَنْ قَدْ عَرَفْتَ بِهَذَا قَطْعًا أَنَّ هَذِهِ الْأَخْلَاقَ الْجَمِيلَةَ يُمْكِنُ اكْتِسَابُهَا بِالرِّيَاضَةِ وَهِيَ تَكَلُّفُ الْأَفْعَالِ الصَّادِرَةِ عنها ابتداء لتصير طبعاً انتهاء وَهَذَا مِنْ عَجِيبِ الْعَلَاقَةِ بَيْنَ الْقَلْبِ وَالْجَوَارِحِ أعني النفس والبدن فإن كل صِفَةً تَظْهَرُ فِي الْقَلْبِ يَفِيضُ أَثَرُهَا عَلَى الْجَوَارِحِ حَتَّى لَا تَتَحَرَّكَ إِلَّا عَلَى وَفْقِهَا لَا مَحَالَةَ وَكُلُّ فِعْلٍ يَجْرِي عَلَى الْجَوَارِحِ فَإِنَّهُ قَدْ يَرْتَفِعُ مِنْهُ أَثَرٌ إِلَى الْقَلْبِ والأمر فيه دور<\/p>\n<p>Thus, you know decisively that these praiseworthy character traits can be acquired through self-discipline, exerting oneself in the deeds emanating from them at the beginning, in order for them to become one’s nature at the end. This is among the wonders of the relationship between the heart and the limbs, that is, the soul and the body. Every attribute in the heart necessarily has effects on the limbs to the extent that it only moves in conformity with it. And every action taken by the limbs makes its way to the heart, thereby constituting a mutual connection.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 3\/59<\/p><\/blockquote>\n<p>Your outward behavior proceeds from your heart, but your outward behavior likewise affects what goes into your heart. As such, purification of the heart must begin by conforming to the Sunnah outwardly as a means to internalize the Sunnah within the core of one&#8217;s being, which is the primary goal of every believer.<\/p>\n<p>For this reason, Imam al-Ghazali organized his magnum opus, <em>Revival of the Religious Sciences<\/em>, by detailing the outward deeds before discussing the subtleties of the heart. Scholars such as Ibn al-Jawzi and Ibn Qudamah, among others, replicated this structure in their works to reinforce this effective methodology.<\/p>\n<p>In sum, we might find prayer and worship to be burdensome or inconvenient, and we do not ‘feel’ the spiritual emotions we think we should feel. This is not a failure or lack of faith. It is an inevitable obstacle on the journey to Allah that even the most righteous struggle with.<\/p>\n<p>To experience the positive spiritual emotions felt by the Prophet ﷺ and the righteous predecessors, we must firmly establish the outward habits of worship, despite resistance from the lower-self, until they become our inward second-nature, so to speak. Then, with Allah&#8217;s help and favor, these blessed feelings will come to us regularly, further enriching our relationship with the Almighty Creator.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;I suffered with prayer for twenty years, then I enjoyed it for twenty years.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[5],"tags":[14,464,16,517,114,104,47,100,470,491,377,58,60,84,45,91,179,364],"class_list":["post-25259","post","type-post","status-publish","format-standard","hentry","category-worship-ibadah","tag-arrogance-al-takabbur","tag-call-to-prayer-al-adhan","tag-character-akhlaq","tag-salat-al-fajr","tag-generosity-al-karam","tag-humility-al-tawaduh","tag-jihad","tag-manners-al-adab","tag-mindfulness-muraqabah","tag-miserliness-al-bukhl","tag-night-prayer-tahajjud","tag-patience-al-sabr","tag-prayer-salat","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-quran-exegesis-tafsir","tag-righteous-predecessors-al-salaf-al-salih","tag-virtue-al-fadilah","tag-voluntary-prayer-salat-al-nafilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6zp","jetpack-related-posts":[{"id":16602,"url":"https:\/\/www.abuaminaelias.com\/worship-middle-night-shaban\/","url_meta":{"origin":25259,"position":0},"title":"Worship in the middle night of Sha’ban","author":"Abu Amina Elias","date":"April 23, 2015","format":false,"excerpt":"\"There is a proof for it, so it cannot be rejected.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":25259,"position":1},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16920,"url":"https:\/\/www.abuaminaelias.com\/the-meaning-of-spiritual-excellence-in-islam\/","url_meta":{"origin":25259,"position":2},"title":"Spiritual excellence in Islam","author":"Abu Amina Elias","date":"August 29, 2015","format":false,"excerpt":"\"Excellence is to worship Allah as if you see Him, for although you do not see Him yet He certainly sees you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23619,"url":"https:\/\/www.abuaminaelias.com\/grave-worship-in-islam\/","url_meta":{"origin":25259,"position":3},"title":"Prohibition of grave worship in Islam","author":"Abu Amina Elias","date":"October 19, 2021","format":false,"excerpt":"\"Do not take graves as places of prayer. I forbid you from doing so.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":21204,"url":"https:\/\/www.abuaminaelias.com\/textual-corruption-of-surat-al-asr\/","url_meta":{"origin":25259,"position":4},"title":"Textual corruption of Surat al-‘Asr?","author":"Abu Amina Elias","date":"September 18, 2019","format":false,"excerpt":"\"By the time and calamities of age!\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":17195,"url":"https:\/\/www.abuaminaelias.com\/protection-of-non-muslim-houses-of-worship-in-islam\/","url_meta":{"origin":25259,"position":5},"title":"Protection of non-Muslim houses of worship in Islam","author":"Abu Amina Elias","date":"October 18, 2015","format":false,"excerpt":"\"The houses of worship for non-Muslim citizens should be defended by the believers.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25259","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=25259"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25259\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=25259"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=25259"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=25259"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}