{"id":25318,"date":"2025-05-30T16:44:39","date_gmt":"2025-05-30T12:44:39","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=25318"},"modified":"2025-05-31T08:53:04","modified_gmt":"2025-05-31T04:53:04","slug":"manhaj-of-the-salaf","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/manhaj-of-the-salaf\/","title":{"rendered":"Following the Way of the Salaf"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>It is an obligation upon Muslims to apply the methodology (<em>manhaj<\/em>) of the righteous predecessors (<em>salaf<\/em>), which is to follow the first three generations of Islam in seeking proof from the Quran, the Sunnah, and the consensus of the Companions instead of relying on personalities. The only infallible sources of religious knowledge are the Book of Allah and His Messenger’s ﷺ instructions and actions. The opinions of every other Imam, even the Companions, may indicate evidence of correctness but are not proof in themselves.<\/p>\n<p>Mujahid ibn Jabr, a leading student of the Companion Ibn Abbas, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ أَحَدٌ إِلَّا يُؤْخَذُ مِنْ قَوْلِهِ وَيُتْرَكُ مِنْ قَوْلِهِ إِلَّا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>There is no one but that his opinions may be taken or left, except for the Messenger of Allah.<\/p>\n<p>Source: al-Madkhal ilā al-Sunan al-Kubrá 30<\/p><\/blockquote>\n<p>And Imam al-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمن لَيْسَ بمعصوم وَلَا حجَّة لنا وَلَا لكم فِي قَوْله وَلَا فِي فعله فَمَا جعل الله الْحجَّة إِلَّا فِي كِتَابه وعَلى لِسَان نبيه صلى الله عَلَيْهِ وَسلم<\/p>\n<p>Whoever is not infallible, his opinions and actions are not proof for us or for you. Thus, Allah has only placed proof in His Book and on the tongue of His Prophet.<\/p>\n<p>Source: al-Qawl al-Mufīd fī Adillat al-Ijtihād wal-Taqlīd 1\/23<\/p><\/blockquote>\n<p>The way of the Salaf contrasts with <em>Taqlid<\/em>, that is, uncritical imitation. Taqlid is to accept the ruling or opinion of a scholar without knowing the evidence for it. In general, it is not permissible to rely on Taqlid regardless of a scholar’s high status, since even the greatest minds make mistakes. It is especially impermissible for students of knowledge capable of evaluating the issues themselves. Rather, Taqlid is only permissible due to necessity for lay Muslims who cannot investigate the sources on their own.<\/p>\n<p>Allah commands us to obey Him and His Messenger ﷺ in all things. If we have a disagreement, we must refer the matter to the Quran and Sunnah, and adopt what we believe is the strongest interpretation of the source texts in terms of legal principles (<em>usul<\/em>), maxims (<em>qawa’id<\/em>), and objectives (<em>maqasid<\/em>).<\/p>\n<p>Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا<\/p>\n<p><strong>O believers! Obey Allah and obey the Messenger and those in authority among you. Should you disagree on anything, then refer it to Allah and His Messenger, if you truly believe in Allah and the Last Day. This is the best and fairest resolution.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:59<\/p><\/blockquote>\n<p>Muslims are not commanded to follow a specific school of thought (<em>madh’hab<\/em>) or Imam in all matters. For students of knowledge preparing to become Imams and scholars, learning one school might be desirable until one reaches the level of independent reasoning (<em>ijtihad<\/em>), in which case it is forbidden to follow a ruling if the evidence points to a stronger interpretive choice.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا يَجِبُ عَلَى أَحَدٍ مِنْ الْمُسْلِمِينَ تَقْلِيدُ شَخْصٍ بِعَيْنِهِ مِنْ الْعُلَمَاءِ فِي كُلِّ مَا يَقُولُ وَلَا يَجِبُ عَلَى أَحَدٍ مِنْ الْمُسْلِمِينَ الْتِزَامُ مَذْهَبِ شَخْصٍ مُعَيَّنٍ غَيْرِ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كُلِّ مَا يُوجِبُهُ وَيُخْبِرُ بِهِ بَلْ كُلُّ أَحَدٍ مِنْ النَّاسِ يُؤْخَذُ مِنْ قَوْلِهِ وَيُتْرَكُ إلَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ<\/p>\n<p>It is not obligatory for any Muslim to follow a specific scholar in everything he says, and it is not obligatory for any Muslim to adhere to the school of any individual. There is no specific authority other than the Messenger in everything he requires and informs about. Rather, the statements of every person are taken and left except the Messenger of Allah.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 20\/208-209<\/p><\/blockquote>\n<p>The Prophet ﷺ told us that the methodology of the Salaf is superior to all those who come after them, such as those who integrated Greek philosophy or gnostic mysticism into their interpretations of the Quran and Sunnah. The three generations of the Salaf provide the standard to which all Muslims are held, as no one can be better than them.<\/p>\n<p>Abdullah ibn Mas’ud reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَجِيءُ مِنْ بَعْدِهِمْ قَوْمٌ تَسْبِقُ شَهَادَتُهُمْ أَيْمَانَهُمْ وَأَيْمَانُهُمْ شَهَادَتَهُمْ<\/p>\n<p><strong>The best people are those of my generation, then those who come after them, then those who come after them. Then, there will come people after them whose testimony precedes their oaths and their oaths precede their testimony.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6429, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/14\/sahabah-tabieen-salaf-salih\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet ﷺ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَوَّلَ هَذِهِ الأُمَّةِ خِيَارُهُمْ وَآخِرَهُمْ شِرَارُهُمْ مُخْتَلِفِينَ مُتَفَرِّقِينَ فَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَأْتِهِ مَنِيَّتُهُ وَهُوَ يَأْتِي إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ<\/p>\n<p><strong>Verily, the first generations of this nation are the best of them, and the last of them are the worst of them in disputing and sectarianism. Thus, whoever has faith in Allah and the Last Day, let him meet his end while he treats people as he would love to be treated.<\/strong><\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 10517, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/12\/latter-generations-sectarianism\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>The Salaf stand out not only in their legal and interpretive methodology, but perhaps most especially their character. They treated each other, and foreigners, the way they would like to be treated, the ethics of reciprocity which form the basis of all moral reasoning. For this reason, they were exemplary in combining law and ethics as opposed to viewing Islam in purely outward legalistic terms.<\/p>\n<p>The Companions understood that none of their statements, actions, or opinions are independent sources of religious authority. They were authoritative in so far as they knew and applied the Sunnah better than any other generation.<\/p>\n<p>Abu Bakr, the First Righteous Caliph and the greatest Muslim in the Ummah after its Prophet, may Allah be pleased with him, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذَا رَأْيِي فَإِنْ يَكُنْ صَوَابًا فَمِنَ اللَّهِ وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَأَسْتَغْفِرُ اللَّهَ<\/p>\n<p>This is my opinion. If it is correct, it is from Allah. If it is wrong, it is from myself, and I seek forgiveness from Allah.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2024\/11\/09\/abu-bakr-ijtihad\/\">Jāmi’ Bayān al-‘Ilm 2\/830<\/a><\/p><\/blockquote>\n<p>And Abdullah ibn Mas’ud, may Allah be pleased with him, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ يَكُ يعني قوله صَوَابًا فَمِنْ اللَّهِ وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنْ الشَّيْطَانِ وَاللَّهُ وَرَسُولُهُ بَرِيئَانِ<\/p>\n<p>If my opinion is correct, it is from Allah. If it is mistaken, it is from myself and Satan. Allah and His Messenger are innocent of it.<\/p>\n<p>Source: Sunan Abī Dāwūd 2116, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/06\/02\/ibn-masud-myself-shaytan\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>This was the sincere humility of the senior Companions in acknowledging their potential to make mistakes in rulings and verdicts. They would even publicly disagree and correct each other at times without relying on Taqlid.<\/p>\n<p>Al-Hasan reported: Ali ibn Abi Talib, may Allah be pleased with him, heard Ibn Abbas was lenient in allowing temporary marriage with women. Ali said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَهْلًا يَا ابْنَ عَبَّاسٍ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا يَوْمَ خَيْبَرَ<\/p>\n<p>Do not be hasty, Ibn Abbas! For the Messenger of Allah, peace and blessings be upon him, prohibited it on the day of Khaybar!<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1407, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>And Imam al-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قد ذكر أهل الْعلم إِن ابْن مَسْعُود خَالف عمر فِي نَحْو مائَة مَسْأَلَة وَمَا وَافقه إِلَّا فِي نَحْو أَربع مسَائِل فَأَيْنَ التَّقْلِيد من هَذَا<\/p>\n<p>The people of knowledge have mentioned that Ibn Mas’ud disagreed with Umar on about one hundred issues and only agreed with him on four issues, so where is the Taqlid in this?<\/p>\n<p>Source: al-Qawl al-Mufīd fī Adillat al-Ijtihād wal-Taqlīd 1\/27<\/p><\/blockquote>\n<p>There are four credible legal schools of thought established by the Imams Abu Hanifa, Malik, Al-Shafi’i, and Ahmad. These Imams developed principles to systematically interpret and apply the Quran and Sunnah in regards to new issues facing the Muslim community. Like the Companions, the Four Imams all denied infallibility for themselves and their students.<\/p>\n<p>Imam Abu Hanifa, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ لِأَحَدٍ أَنْ يُفْتِيَ بِقَوْلِنَا مَا لَمْ يَعْلَمْ مِنْ أَيْنَ قُلْنَا<\/p>\n<p>It is not permissible for anyone to issue verdicts by our statements without knowing from where we said it.<\/p>\n<p>Source: al-Baḥr al-Rā’iq Sharḥ Kanz al-Daqā’iq 6\/293<\/p><\/blockquote>\n<p>And he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا جَاءَنَا عَنْ رَسُولِ اللَّهِ صلى الله عَلَيْهِ وَسلم قَبِلْنَاهُ عَلَى الرَّأْسِ وَالْعَيْنَيْنِ وَمَا جَاءَنَا عَنْ أَصْحَابِهِ رَحِمَهُمُ اللَّهُ اخْتَرْنَا مِنْهُ وَلَمْ نَخْرُجْ عَنْ قَوْلِهِمْ وَمَا جَاءَنَا عَنِ التَّابِعِينَ فَهُمْ رِجَالٌ وَنَحْنُ رِجَالٌ وَأَمَّا غَيْرُ ذَلِكَ فَلا تَسْمَعِ التَّشْنِيعَ<\/p>\n<p>Whatever comes to us from the Messenger of Allah, may Allah bless him and grant him peace, we accept it with our heads and our eyes. Whatever comes to us from his Companions, may Allah have mercy on them, we choose from them but do not oppose their opinions. Whatever comes to us from the Successors, they are men as we are men.<\/p>\n<p>Source: al-Intiqā&#8217; fī Faḍāʼil al-Thalāthah al-A&#8217;immah al-Fuqahā&#8217; 1\/144<\/p><\/blockquote>\n<p>Imam ‘Isam ibn Yusuf, may Allah have mercy on him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كنت في مأتم فاجتمع فيه أربعة من أصحاب أبي حنيفة رضي الله عنه زفر بن الهذيل وأبو يوسف وعافية بن يزيد وآخر فكلهم أجمعوا على أنه لا يحل لأحد أن يفتى بقولنا ما لم يعلم من أين قلنا<\/p>\n<p>I was at a memorial service where four students of Abu Hanifa were gathered: Zufar ibn al-Hudhayl, Abu Yusuf, ‘Afiyah ibn Yazid, and another. All of them agreed that ‘it is not permissible for anyone to issue verdicts by our statements without knowing from where we said it.’<\/p>\n<p>Source: &#8216;Uyūn al-Masā&#8217;il lil-Samarqandī 1\/485<\/p><\/blockquote>\n<p>Imam Malik ibn Anas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا أَنَا بَشَرٌ أُخْطِئُ وَأُصِيبُ فَانْظُرُوا فِي رَأْيِي فَكُلَّمَا وَافَقَ الْكِتَابَ وَالسُّنَّةَ فَخُذُوا بِهِ وَكُلَّمَا لَمْ يُوَافِقِ الْكِتَابَ وَالسُّنَّةَ فَاتْرُكُوهُ<\/p>\n<p>Surely, I am only a human being. I make mistakes sometimes and I am correct sometimes, so examine my opinions. Whatever agrees with the Book and the Sunnah, then take it. Whatever disagrees with the Book and the Sunnah, then abandon it.<\/p>\n<p>Source: Jāmiʻ Bayān al-ʻIlm li-Ibn ‘Abd al-Barr 1435<\/p><\/blockquote>\n<p>Imam Malik was aware that authentic Hadith existed in other lands that amounted to religious proof he was unaware of. Hence, he denied the Caliph al-Mansur’s request to make his school the official doctrine of the Caliphate.<\/p>\n<p>Malik reported: When the Caliph Abu Ja’far al-Mansur performed the pilgrimage, he called for me, so I entered upon him and he spoke to me, asking me questions, and I replied. Then, he said, “I am determined to have several copies made of these books of yours. I will send a copy to every region in the lands of the Muslims. I will command them to adhere to its contents without referring to any other, and they will set aside everything but this new knowledge. Indeed, I see the foundation of knowledge in the narrations of the people of Medina and their teachings.” I said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَمِيرَ الْمُؤْمِنِينَ لَا تَفْعَلْ فَإِنَّ النَّاسَ قَدْ سَبَقَتْ إِلَيْهِمْ أَقَاوِيلُ وَسَمِعُوا أَحَادِيثَ وَرَوَوْا رِوَايَاتٍ وَأَخَذَ كُلُّ قَوْمٍ بِمَا سَبَقَ إِلَيْهِمْ وَعَمِلُوا بِهِ وَدَانُوا بِهِ مِنَ اخْتِلَافِ النَّاسِ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرَهُمْ وَإِنَّ رَدَّهُمْ عَمَّا اعْتَقَدُوهُ شَدِيدٌ فَدَعِ النَّاسَ وَمَا هُمْ عَلَيْهِ وَمَا اخْتَارَ كُلُّ أَهْلِ بَلَدٍ لِأَنْفُسِهِمْ<\/p>\n<p>O Commander of the Faithful, do not do so, for the people have received sayings, heard reports, and transmitted various accounts. Each one holds to what it has received and acts according to it. They practice as such due to people’s differences, the Companions of the Messenger of Allah and others. Turning them away from their beliefs would surely be difficult, so leave the people with what they are upon and what every country has chosen for themselves.<\/p><\/blockquote>\n<p>The Caliph al-Mansur replied:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَعَمْرِي لَوْ طَاوَعْتَنِي عَلَى ذَلِكَ لَأَمَرْتُ بِهِ<\/p>\n<p>I swear on my life, if you had obeyed me in this matter, I would have commanded it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/12\/10\/malik-fiqh-force-caliph\/\">Jāmi’ Bayān al-‘Ilm li-Ibn ‘Abd al-Barr 870<\/a><\/p><\/blockquote>\n<p>Similarly, Imam al-Shafi’i issued a general disclaimer about himself and his school, insisting that whatever authentic Hadith and sound legal verdicts he did not know should be incorporated into his school.<\/p>\n<p>Imam al-Shafi’i, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ مَسْأَلَةٍ تَكَلَّمْتُ فِيهَا صَحَّ الْخَبَرُ فِيهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ أَهْلِ النَّقْلِ بِخَلَافِ مَا قُلْتُ فَأَنَا رَاجِعٌ عَنْهَا فِي حَيَاتِي وَبَعْدَ مَوْتِي<\/p>\n<p>Every issue on which I have spoken for which an authentic narration exists from the Prophet, according to the scholars of transmission, in contradiction to what I have said, then I recant from it in my lifetime as well as after my death.<\/p>\n<p>Source: Manāqib al-Shāfiʻī lil-Bayhaqī 1\/473<\/p><\/blockquote>\n<p>Later authorities in the Shafi’i school, such as Imam al-Nawawi, permitted their students to adopt opinions from other schools if the evidence and reasoning were sound. They would carefully apply ‘juristic tools’ (<em>alat al-ijtihad<\/em>) to the previously unknown texts to ensure the alternative ruling was consistent with Islamic teachings.<\/p>\n<p>Imam al-Nawawi related the words of Shaykh Abu ‘Amr:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَمَنْ وَجَدَ مِنْ الشَّافِعِيَّةِ حَدِيثًا يخالف مذهبه نظران كَمُلَتْ آلَاتُ الِاجْتِهَادِ فِيهِ مُطْلَقًا أَوْ فِي ذَلِكَ الْبَابِ أَوْ الْمَسْأَلَةِ كَانَ لَهُ الِاسْتِقْلَالُ بالعمل به وان لم يكن وَشَقَّ عَلَيْهِ مُخَالَفَةُ الْحَدِيثِ بَعْدَ أَنْ بَحَثَ فَلَمْ يَجِدْ لِمُخَالَفَتِهِ عَنْهُ جَوَابًا شَافِيًا فَلَهُ الْعَمَلُ بِهِ إنْ كَانَ عَمِلَ بِهِ إمَامٌ مُسْتَقِلٌّ غَيْرَ الشَّافِعِيِّ وَيَكُونُ هَذَا عُذْرًا لَهُ فِي تَرْكِ مَذْهَبِ<\/p>\n<p>Whoever finds a Hadith from the Shafi’is that contradicts his school of thought, there are two considerations: that the tools of juristic reasoning are to be used completely in general, or in that topic or issue, then he may act upon it independently. But if it is not so, it is difficult for him to resolve the contradicting Hadith after he has researched it, and he does not find a satisfactory answer to its contradiction, then he may act upon it if it was acted upon by an independent Imam besides Al-Shafi’i. This is an excuse for him to leave the school’s ruling.<\/p>\n<p>Source: al-Majmū’ Sharḥ al-Muhadhab 1\/64<\/p><\/blockquote>\n<p>In fact, Imam al-Shafi’i himself is well-known to have changed his opinions when he relocated to Egypt, where previously unknown Hadith were now accessible and different social conditions required alternative rulings. In the Shafi’i tradition, this is known as ‘the old school’ (<em>al-qadim<\/em>) and ‘the new school’ (<em>al-jadid<\/em>).<\/p>\n<p>Ibn al-Subki explains:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">القديم ما قاله الشافعي رضي الله عنه بالعراق قبل انتقاله إلى مصر سواء كان رجع عنه وهو الغالب أو لم يرجع وهو قليل &#8230; الجديد ما قاله الإمام الشافعي بمصر أو بعد خروجه من بغداد تصنيفًا أو إفتاءً<\/p>\n<p>The ‘old school’ is that Imam al-Shafi’i said in Iraq before moving to Egypt, whether he retracted it, which is usually the case, or he did not retract it, which is rare… The ‘new school’ is what Al-Shafi’i said in Egypt or after he left Baghdad, either in written form or as a legal verdict.<\/p>\n<p>Source: Ibhāj fī Sharḥ al-Minhāj 1\/356<\/p><\/blockquote>\n<p>Imam Ahmad was likewise known for ordering his students to follow the evidence if it opposed his opinion. His school often contains multiple narrations of his opinions, sometimes contradicting each other, indicating that he would change his mind when presented with better evidence and arguments as he continued to collect Hadith in his Musnad.<\/p>\n<p>Imam Ahmad ibn Hanbal, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأْيُ الأَوْزَاعِيِّ وَرَأْيُ مَالِكٍ وَرَأْيُ سُفْيَانَ كُلُّهُ رَأَيٌ وَهُوَ عِنْدِي سَوَاءٌ وَإِنَّمَا الْحُجَّةُ فِي الآثَارِ<\/p>\n<p>Al-Awza’i had opinions, Malik had opinions, Sufyan al-Thawri had opinions. Each of them had opinions, and it is all the same to me. Indeed, the proof is only in the narrations.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/10\/22\/ahmad-follow-sunnah\/\">Jāmiʻ Bayān al-ʻIlm li-Ibn ‘Abd al-Barr 2107<\/a><\/p><\/blockquote>\n<p>And he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَا تُقَلِّدْ مَالِكًا وَلَا الثَّوْرِيَّ وَلَا الْأَوْزَاعِيَّ وَخُذْ مِنْ حَيْثُ أَخَذُوا<\/p>\n<p>Do not uncritically follow me, nor Malik, nor Al-Thawri, nor Al-Awza’i. Rather, take from where they took.<\/p>\n<p>Source: Jāmiʻ Bayān al-ʻIlm li-Ibn ‘Abd al-Barr 435<\/p><\/blockquote>\n<p>If the Hanbali scholars respectfully leave an opinion from their school for a stronger evidence-based opinion in the schools of Abu Hanifa, Malik, or Al-Shafi&#8217;i, this is actually following Imam Ahmad&#8217;s instructions rather than opposing him.<\/p>\n<p>As demonstrated, the Four Imams did not allow their students to uncritically adopt their opinions if they were capable of investigating the source evidence and arriving at a better conclusion.<\/p>\n<p>Muslims today are inheritors of a rich legacy left by the Four Imams and their students, yet the absolute truth is not monopolized by any single school. We are tasked with critically examining this legacy in search of the best opinions and precedents to apply in our unique social conditions.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ٱلَّذِينَ يَسْتَمِعُونَ ٱلْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُو۟لَـٰٓئِكَ ٱلَّذِينَ هَدَىٰهُمُ ٱللَّهُ وَأُو۟لَـٰٓئِكَ هُمْ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ<\/p>\n<p><strong>…those who listen to what is said and follow the best of it. These are the ones rightly guided by Allah, and these are truly the people of reason.<\/strong><\/p>\n<p>Surat al-Zumar 39:18<\/p><\/blockquote>\n<p>This means when we look at the opinions of the jurists, we should take the best from their discourse: what is recommended (<em>mustahab<\/em>) and in line with Islamic ethics (<em>akhlaq<\/em>), not what is discouraged (<em>makruh<\/em>), weak, mistaken, or even problematic. We are never allowed to be partisan towards our chosen school out of stubborn tribal bigotry or indulgence of lowly desires.<\/p>\n<p>The Quran establishes this tremendous principle as a general rule which can guide us in all kinds of situations, taking the good and leaving the bad. Such is the mark of a wise, intelligent, and reasonable believer.<\/p>\n<p>Shaykh al-Sa’di commented on the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وهذا جنس يشمل كل قول فهم يستمعون جنس القول ليميزوا بين ما ينبغي إيثاره مما ينبغي اجتنابه فلهذا من حزمهم وعقلهم أنهم يتبعون أحسنه وأحسنه على الإطلاق كلام الله وكلام رسوله &#8230; أي العقول الزاكية ومن لبهم وحزمهم، أنهم عرفوا الحسن من غيره وآثروا ما ينبغي إيثاره على ما سواه وهذا علامة العقل بل لا علامة للعقل سوى ذلك فإن الذي لا يميز بين الأقوال حسنها وقبيحها ليس من أهل العقول الصحيحة أو الذي يميز لكن غلبت شهوته عقله فبقي عقله تابعاً لشهوته فلم يؤثر الأحسن كان ناقص العقل<\/p>\n<p>This category of words includes every statement. They listen to every type of statement to distinguish between what should be preferred or avoided. Therefore, from their prudence and intelligence, they follow the best of it, and the best of it absolutely is the speech of Allah and His Messenger&#8230; That is, pure minds, from their intelligence and prudence, they know the good from otherwise and they prefer what should be preferred over whatever else. This is a sign of a sound mind. Indeed, there is no sign of a sound mind other than that. The one who does not distinguish between statements, their good and their bad, is not among the people of sound minds, or the one who can distinguish but his desires overcame his reason, so his mind remained subservient to his desires and he did not prefer the best, so his mind is deficient.<\/p>\n<p>Source: Taysīr al-Karīm al-Raḥmān 1\/721<\/p><\/blockquote>\n<p>The scholars distinguished Taqlid of the Imams with ‘following’ them. Specifically, Taqlid is accepting an opinion without knowing the evidence for it, while following is accepting an opinion while knowing the evidence for it. Following an Imam is permissible, but Taqlid is not, as stated by Imam Abu Hanifa.<\/p>\n<p>Imam Ibn ‘Abd al-Barr writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالتَّقْلِيدُ عِنْدَ الْعُلَمَاءِ غَيْرُ الِاتِّبَاعِ لِأَنَّ الِاتِّبَاعَ هُوَ تَتَبُّعُ الْقَائِلِ عَلَى مَا بَانَ لَكَ مِنْ فَضْلِ قَوْلِهِ وَصِحَّةِ مَذْهَبِهِ وَالتَّقْلِيدُ أَنْ تَقُولَ بِقَوْلِهِ وَأَنْتَ لَا تَعْرِفُ وَجْهَ الْقَوْلِ وَلَا مَعْنَاهُ وَتَأْبَى مَنْ سِوَاهُ أَوْ أَنْ يَتَبَيَّنَ لَكَ خَطَؤُهُ فَتَتَّبِعَهُ مَهَابَةَ خِلَافِهِ وَأَنْتَ قَدْ بَانَ لَكَ فَسَادُ قَوْلِهِ وَهَذَا مُحَرَّمٌ الْقَوْلُ بِهِ فِي دِينِ اللَّهِ سُبْحَانَهُ وَتَعَالَى<\/p>\n<p>Taqlid, according to the scholars, is not the same as following, because &#8216;following&#8217; is following the opinion according to what is clear to you regarding the merit of his statement and the soundness of his school. Taqlid is that you repeat what he says even though you do not know the meaning of the statement and you reject anyone other than him, or that his error becomes clear to you, but you follow him out of fear of contradicting him, even though it is clear to you that his statement is flawed. It is forbidden to accept such an opinion in the religion of Allah Almighty.<\/p>\n<p>Source: Jāmi’ Bayān al-‘Ilm 2\/787<\/p><\/blockquote>\n<p>And he writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُقَالُ لِمَنْ قَالَ بِالتَّقْلِيدِ لِمَ قُلْتُ بِهِ وَخَالَفْتَ السَّلَفَ فِي ذَلِكَ فَإِنَّهُمْ لَمْ يُقَلِّدُوا &#8230; فَإِنْ قَالَ: قَلَّدْتُهُ لِأَنِّي عَلِمْتُ أَنَّهُ صَوَابٌ قِيلَ لَهُ عَلِمْتَ ذَلِكَ بِدَلِيلٍ مِنْ كِتَابٍ أَوْ سُنَّةٍ أَوْ إِجْمَاعٍ فَإِنْ قَالَ نَعَمْ فَقَدْ أَبْطَلَ التَّقْلِيدَ وَطُولِبَ بِمَا ادَّعَاهُ مِنَ الدَّلِيلِ<\/p>\n<p>It is said to one who practices Taqlid, ‘Why did you say this and differ from the Salaf in that, since they did not practice Taqlid?’ … If he says, ‘I imitated him because I knew that he was correct,’ he is told, ‘You knew that from evidence from the Book, the Sunnah, or consensus.’ If he says yes, then he has invalidated Taqlid and is asked to provide the evidence for his claim.<\/p>\n<p>Source: Jāmi’ Bayān al-‘Ilm 2\/994<\/p><\/blockquote>\n<p>Relying on one school could be desirable or necessary, especially for lay Muslims or students of knowledge at the beginning of their education, but one must know the opinions of the school with their evidences, lest an egregious error be made in the religion of Allah.<\/p>\n<p>As such, it is compulsory for Muslims to ask the scholars for evidence in matters they do not know. Adopting baseless legal verdicts could potentially result in seriously harmful, unintended consequences.<\/p>\n<p>Ibn Abbas reported: A man was wounded during the time of the Messenger of Allah, peace and blessings be upon him. The man had a nocturnal emission, so he was ordered to perform a ritual bath without a concession. The water seeped into his wound causing his death. When this news reached the Prophet, he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَتَلُوهُ قَتَلَهُمْ اللَّهُ أَلَمْ يَكُنْ شِفَاءُ الْعِيِّ السُّؤَالَ<\/p>\n<p><strong>They killed him! May Allah curse them! Is not the cure for ignorance to ask questions?<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 337, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/07\/fiqh-deadly-results\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>In this example, a flawed legal ruling was issued resulting in the death of one of the Companions. The Prophet ﷺ was furious with those who gave the ruling, admonishing them to ask the people of knowledge before acting on such a dire matter.<\/p>\n<p>Therefore, it is not sufficient to carelessly regurgitate what is found in the juristic heritage, as it akin to someone offering unqualified medical advice. Today’s societies vary greatly from past generations, including people&#8217;s tendency to twist rulings for evil ends, so it is incumbent upon us to faithfully interpret the corpus of source evidence and apply sound Islamic principles to our unprecedented and challenging situations. Rather, failing to apply the Salaf’s methodology in our time is even worse than medical malpractice.<\/p>\n<p>Imam Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَنْ أَفْتَى النَّاسَ بِمُجَرَّدِ الْمَنْقُولِ فِي الْكُتُبِ عَلَى اخْتِلَافِ عُرْفِهِمْ وَعَوَائِدِهِمْ وَأَزْمِنَتِهِمْ وَأَمْكِنَتِهِمْ وَأَحْوَالِهِمْ وَقَرَائِنِ أَحْوَالِهِمْ فَقَدْ ضَلَّ وَأَضَلَّ وَكَانَتْ جِنَايَتُهُ عَلَى الدِّينِ أَعْظَمَ مِنْ جِنَايَةِ مَنْ طَبَّبَ النَّاسَ<\/p>\n<p>Whoever gives people verdicts based on what is transmitted in books, despite their differing customs, traditions, times, places, circumstances, and conditions, has gone astray and led others astray, and his crime against the religion is greater than the crime of one who mistreats people with medicine.<\/p>\n<p>Source: I’lām al-Muwaqqi’īn 3\/66<\/p><\/blockquote>\n<p>So-called ‘closing the door of ijtihad’ was one of the most detrimental innovations of the classical period. The religious authorities prohibited any independent thought, as if Islamic knowledge were calcified, in an effort to maintain stability in the tradition, but it ultimately led to stagnation and sectarianism. On the contrary, Islam is a living and responsive tradition able to meet the needs of every time and place.<\/p>\n<p>The religious establishment’s abandonment of the Salaf’s methodology was thoroughly critiqued by Imam al-Shawkani, who meticulously refuted their points one by one and undoubtedly proved the general consensus of the Salaf against Taqlid. In his time, Taqlid had become an enormous source of division and weakness, just as it is today.<\/p>\n<p>Imam al-Shawkani writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَانْظُر إِلَى هَذِه الْبِدْعَة الشيطانية الَّتِي فرقت بَين أهل هَذِه الْملَّة الشَّرِيفَة وصيرتهم على مَا يرَاهُ من التباين والتقاطع والتخالف فَلَو لم يكن من شُؤْم هَذِه التقليدات والمذاهب المبتدعات إِلَّا مُجَرّد هَذِه الْفرْقَة بَين أهل الْإِسْلَام مَعَ كَونهم أهل مِلَّة وَاحِدَة وَنَبِي وَاحِد وَكتاب وَاحِد لَكَانَ ذَلِك كَافِيا فِي كَونهَا غير جَائِزَة<\/p>\n<p>Look at this satanic innovation that has divided the people of this noble religion and made them as is seen to be upon dissension, division, and dispute! If the only evil consequence of these acts of Taqlid and heretical schools was this division between the people of Islam, despite them being people of one religion, one Prophet, and one Book, that would be enough to make it impermissible.<\/p>\n<p>Source: al-Qawl al-Mufīd fī Adillat al-Ijtihād wal-Taqlīd 1\/39-40<\/p><\/blockquote>\n<p>Taqlid was viewed by some scholars as a means to protect the accumulated knowledge and authority of the establishment, but in the end, it was a significant factor in the decline of the Muslim world.<\/p>\n<p>Unfortunately, the term &#8216;Salafi&#8217; has been co-opted today by some parties as a political slogan or tribal identity, but that is not its essence. The Salafiyyah is a scholarly methodology, not a sectarian movement.<\/p>\n<p>Shaykh Ibn ‘Uthaymeen said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السلفية هي اتباع منهج النبي صلى الله عليه وسلم وأصحابه؛ لأنهم هم الذين سلفونا وتقدموا علينا فاتباعهم هو السلفية وأما اتخاذ السلفية كمنهج خاص ينفرد به الإنسان ويضلل من خالفه من المسلمين ولو كانوا على حق واتخاذ السلفية كمنهجٍ حزبي فلا شك أن هذا خلاف السلفية فالسلف كلهم يدعون إلى الاتفاق والالتئام حول سنة الرسول صلى الله عليه وسلم ولا يضللون من خالفهم عن تأويل اللهم إلا في العقائد فإنهم يرون أن من خالفهم فيها فهو ضال أما في المسائل العملية فإنهم يخففون فيها كثيراً &#8230; فالسلفية بمعنى أن تكون حزباً خاصاً له مميزاته ويضلل أفراده من سواهم فهؤلاء ليسوا من السلفية في شيء<\/p>\n<p>Salafiyyah is following the approach of the Prophet, peace and blessings of Allah be upon him, and his companions, because they are the ones who preceded us and came before us, so following them is Salafiyyah. As for adopting Salafiyyah as a special approach that a person follows alone and accuses those Muslims who disagree with him as misguided, even if they are right, and adopting Salafiyyah as a partisan approach, then there is no doubt that this is contrary to Salafiyyah, as all of the Salaf call for agreement and unity around the Sunnah of the Messenger, and they do not accuse of misguidance those who disagree with them based on their interpretations, except in matters of creed, for they view whoever differs with them in this as misguided. As for practical matters, they are very lenient in this regard&#8230; Salafiyyah in the sense of being a special party with its own characteristics, and its members accuse others of misguidance, then these are not Salafis at all.<\/p>\n<p>Source: Liqā’ al-Bāb al-Maftūḥ 57\/15<\/p><\/blockquote>\n<p>As for Taqlid, it can be granted as a concession to lay Muslims who do not know Arabic and cannot evaluate scholarly opinions for themselves. This is an allowance of need, not desirability. It is still an obligation upon every Muslim to verify claims about Islam to the extent of their abilities.<\/p>\n<p>Shaykh &#8216;Abdulaziz ibn Baz issued a legal verdict on Taqlid:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يجوز ذلك بل لا بد من الاستدلال والنظر في الأدلة اللهم إلا في وقت لا يوجد فيه مجتهد فقد ذكر العلماء جواز التقليد للضرورة إذا كان في مكان أو في قرية لا يتمكنوا فيه من العلماء ولا يوجد فيه عالم إلا عالم بمذهب فلان مذهب أبي حنيفة، مذهب مالك، مذهب أحمد فيفتيهم على ما فهم وليس عنده قدرة على معرفة الدليل هذا قد يجوز فيما قاله بعض أهل العلم ولكن مهما أمكن له أن ينظر ومهما أمكنه أن يتحرى الحق بالدليل فهذا هو الواجب عليه<\/p>\n<p>This is not permissible. Rather, it is necessary to deduce and examine the evidence, except in a time when there is no qualified jurist (<em>mujtahid<\/em>). The scholars have mentioned the permissibility of Taqlid due to necessity if one is in a place or a village where they cannot find scholars, or there is no scholar there except one who is knowledgeable of a particular school, such as the schools of Abu Hanifa, Malik, and Ahmad, so he issues verdicts to them based on what he understood and he does not have the ability to know the evidence. This may be permissible according to what some of the people of knowledge have said, but as much as he is able to examine and as much as he is able to seek out the truth with evidence, this is what is obligatory upon him.<\/p>\n<p>Source: Fatāwá al-Jāmi&#8217; al-Kabīr 2734<\/p><\/blockquote>\n<p>In sum, the methodology of the Salaf is to establish rules and practices in Islam based upon evidence from the Quran, the Sunnah, and the consensus of the Companions, as opposed to uncritically accepting claims without evidence. Lay Muslims who cannot analyze the source texts or properly apply Islamic principles may rely upon a qualified scholar’s judgment, but they should still strive to find the best evidence-based opinion. As for the students of knowledge, they are entrusted by this Ummah with finding the strongest opinions and solutions in accordance with Islamic teachings.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The best people are those of my generation, then those who come after them&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[320,12,420,16,18,441,165,21,342,104,38,39,41,43,100,55,91,68,70,73],"class_list":["post-25318","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-abu-bakr","tag-ali-ibn-abi-talib","tag-caliphs-al-khulafa","tag-character-akhlaq","tag-community-jamaah","tag-companions-al-sahabah","tag-consensus-al-ijma","tag-creed-aqidah","tag-al-fiqh","tag-humility-al-tawaduh","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-al-shafii","tag-imam-malik","tag-manners-al-adab","tag-methodology-al-minhaj","tag-righteous-predecessors-al-salaf-al-salih","tag-satan-al-shaytan","tag-sincerity-al-ikhlaas","tag-umar-ibn-al-khattab"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6Am","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":25318,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":25318,"position":1},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25356,"url":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","url_meta":{"origin":25318,"position":2},"title":"The Ash’ari and Maturidi Schools of Theology","author":"Abu Amina Elias","date":"June 13, 2025","format":false,"excerpt":"\"The Ash'aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant...\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20726,"url":"https:\/\/www.abuaminaelias.com\/fasting-on-day-of-arafat-or-not\/","url_meta":{"origin":25318,"position":3},"title":"Fasting on the Day of Arafat or not?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"There is a doubt in fasting the day of ‘Arafat. Is it a celebration?\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23718,"url":"https:\/\/www.abuaminaelias.com\/tabarruk-bil-saliheen\/","url_meta":{"origin":25318,"position":4},"title":"Seeking blessings from relics of the righteous?","author":"Abu Amina Elias","date":"November 17, 2021","format":false,"excerpt":"\"People do not contrive an innovation in religion but that it removes a Sunnah like it.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23179,"url":"https:\/\/www.abuaminaelias.com\/eid-dua-taqabbal-allahu-minna-wa-minkum\/","url_meta":{"origin":25318,"position":5},"title":"Eid Supplication: May Allah accept from us and from you","author":"Abu Amina Elias","date":"May 11, 2021","format":false,"excerpt":"\"May Allah accept good deeds from us and from you.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25318","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=25318"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25318\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=25318"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=25318"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=25318"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}