{"id":25356,"date":"2025-06-13T11:26:36","date_gmt":"2025-06-13T07:26:36","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=25356"},"modified":"2025-07-04T18:42:33","modified_gmt":"2025-07-04T14:42:33","slug":"ashari-and-maturidi-aqidah","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/ashari-and-maturidi-aqidah\/","title":{"rendered":"The Ash’ari and Maturidi Schools of Theology"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>The way of the Salaf in understanding Islam is to ‘stop’ (<em>tawqif<\/em>) at the revealed texts without ascribing ‘modalities’ (<em>kayfiyyah<\/em>) or ‘how’ to Allah’s names and attributes, or to matters of the Unseen for which the modalities are unknown, and without ‘likening’ (<em>tashbih<\/em>) Allah to His creation. It is known as the Athari or Salafi creed, which is named after those who follow the ‘reports’ (<em>athar<\/em>) transmitted from the Prophet ﷺ and his Companions.<\/p>\n<p>The Athari methodology was cemented in early Islam by Imam Malik in the famous narration of the heretic who disingenuously asked him &#8216;how’ Allah rises over the Throne, by which he only intended to confuse Imam Malik’s students.<\/p>\n<p>Yahya ibn Yahya reported: We were with Malik ibn Anas, may Allah have mercy on him, and a man came to him, saying, “O Abu Abdullah, ‘<strong>The Merciful rose above the Throne<\/strong>,’ (20:5). How is this rising?” Malik bowed his head silently until he raised it, dripping sweat, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الِاسْتِوَاءُ غَيْرُ مَجْهُولٍ وَالْكَيْفُ غَيْرُ مَعْقُولٍ وَالْإِيمَانُ بِهِ وَاجِبٌ وَالسُّؤَالُ عَنْهُ بِدْعَةٌ<\/p>\n<p>The rising is not unknown, its modality is inconceivable, faith in it is an obligation, and asking about it is a heretical innovation.<\/p><\/blockquote>\n<p>Imam al-Bayhaqi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَعَلَى مِثْلِ هَذَا دَرَجَ أَكْثَرُ عُلَمَائِنَا فِي مَسْأَلَةِ الِاسْتِوَاءِ وَفِي مَسْأَلَةِ الْمَجِيءِ وَالْإِتْيَانِ وَالنِّزُولِ<\/p>\n<p>Most of our scholars followed this example in the issue of the divine attribute of ‘rising,’ as well as the issues of ‘coming,’ ‘going,’ and ‘descending.&#8217;<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/24\/malik-kayfiyyah-creed\/\">al-I’tiqād lil-Bayhaqī 1\/116<\/a><\/p><\/blockquote>\n<p>The Salaf would not apply Greek-influenced naturalistic or metaphysical reasoning to understand matters of the Unseen, as these theological topics are by definition outside the scope of human intellect. The Unseen must be revealed by Allah to be understood, as contained in the texts of the Quran, the Sunnah, and the Companions.<\/p>\n<p>However, the influence of philosophers was enormous upon Muslim sects who broke away from the Sunnah. Their complex, sophisticated, and high-sounding language was confusing to the masses and alluring to the social elite. In response, some Muslims set out to defend the Sunnah and refute the philosophers on their own terms.<\/p>\n<p>Among the leading Imams at this time was Abu al-Hasan al-Ash’ari, the descendant of a senior Companion, whose methodology in refuting the philosophers and deviant sects eventually developed into a distinct school of Sunni theology. All Sunni Muslims widely respect him for his service in defending Islam at a time when it was under ideological assault, despite utilizing philosophical concepts for this purpose.<\/p>\n<p>Imam al-Ash’ari publicly recanted many of his previously held positions. It is said that he eventually accepted the way of the Salaf in adhering to the revealed texts without speculative or ‘metaphorical’ interpretations (<em>ta’wil<\/em>), although some of his followers dispute this. The school attributed to him throughout history may not necessarily align with the positions he settled upon near the end of his life.<\/p>\n<p>Imam al-Dhahabi describes Al-Ash&#8217;ari in his biographical history as follows:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">العَلاَّمَةُ إِمَامُ المُتَكَلِّمِين أَبُو الحَسَنِ عَلِيُّ بنُ إِسْمَاعِيْلَ بنِ أَبِي بِشْرٍ إِسْحَاقَ بنِ سَالِمِ بنِ إِسْمَاعِيْلَ بنِ عَبْدِ اللهِ بنِ مُوْسَى ابنِ أَمِيْر البَصْرَةِ بِلاَلِ بنِ أَبِي بُرْدَةَ ابنِ صَاحِب رَسُوْل اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبِي مُوْسَى عَبْدِ اللهِ بنِ قَيْس بن حَضَّارٍ الأَشْعَرِيُّ &#8230; وَكَانَ عجباً فِي الذَّكَاء وَقوَة الفهمِ وَلَمَّا بَرَعَ فِي مَعْرِفَةِ الاعتزَال كرِهه وَتبرَّأَ مِنْهُ وَصَعِدَ لِلنَّاسِ فتَابَ إِلَى اللهِ تَعَالَى مِنْهُ ثُمَّ أَخذ يُردُّ عَلَى المُعْتَزِلَة وَيهتِك عِوَارَهُم<\/p>\n<p>The eminent scholar, the Imam of the philosopher-theologians, Abu al-Hasan ‘Ali, son of Ismai’l, son of Abi Bishr Ishaq, son of Salim, son of Ismai’l, son of ‘Abdullah, son of Musa, son of the Governor of Basrah, Bilal ibn Abi Burdah, who was son of the Companion of the Messenger of Allah, peace and blessings be upon him, Abu Musa ‘Abdillah ibn Qays ibn Haddar al-Ash’ari… He was astonishing in his intelligence and strong comprehension. When he became proficient in his knowledge of the Mu’tazilite philosophy, he hated it and repented from it. He stood up for people and publicly repented to Allah Almighty from it, then he continued to refute the Mu’tazila and expose their faults.<\/p>\n<p>Source: Siyar A&#8217;lām al-Nubalā&#8217; 15\/85-86<\/p><\/blockquote>\n<p>And the Imam writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأَيْتُ لأَبِي الحَسَن أَرْبَعَة توَالِيف فِي الأُصُوْل يذكرُ فِيْهَا قوَاعدَ مَذْهَبِ السَّلَف فِي الصِّفَات وَقَالَ فِيْهَا تُمَرُّ كَمَا جَاءت ثُمَّ قَالَ وَبِذَلِكَ أَقُول وَبِهِ أَدين وَلاَ تُؤوَّل<\/p>\n<p>I saw four works by Abu al-Hasan on religious fundamentals in which he mentioned the principles of Salaf’s method in understanding the divine attributes. He said in them, ‘Leave them as they have come,’ then he said, ‘With this I speak and by it practice the religion, and I do not interpret them.’<\/p>\n<p>Source: Siyar A&#8217;lām al-Nubalā&#8217; 15\/86<\/p><\/blockquote>\n<p>Imam al-Ash’ari was uniquely talented in his deconstruction of the philosophers’ beliefs because, for a time, he had been one of them. Sunni scholars highly regard him for his effective criticism of the ‘rationalist’ Mu’tazilite sect.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا مِمَّا مُدِحَ بِهِ الْأَشْعَرِيُّ فَإِنَّهُ بَيَّنَ مِنْ فَضَائِحِ الْمُعْتَزِلَةِ وَتَنَاقُضِ أَقْوَالِهِمْ وَفَسَادِهَا مَا لَمْ يُبَيِّنْهُ غَيْرُهُ لِأَنَّهُ كَانَ مِنْهُمْ وَكَانَ قَدْ دَرَسَ الْكَلَامَ عَلَى أَبِي عَلِيٍّ الْجُبَّائِيِّ أَرْبَعِينَ سَنَةً وَكَانَ ذَكِيًّا ثُمَّ إِنَّهُ رَجَعَ عَنْهُمْ وَصَنَّفَ فِي الرَّدِّ عَلَيْهِمْ وَنَصَرَ فِي الصِّفَاتِ طَرِيقَةَ ابْنِ كُلَّابٍ لِأَنَّهَا أَقْرَبُ إِلَى الْحَقِّ وَالسُّنَّةِ مِنْ قَوْلِهِمْ وَلَمْ يَعْرِفْ غَيْرَهَا فَإِنَّهُ لَمْ يَكُنْ خَبِيرًا بِالسُّنَّةِ وَالْحَدِيثِ وَأَقْوَالِ الصَّحَابَةِ وَالتَّابِعِينَ وَغَيْرِهِمْ وَتَفْسِيرِ السَّلَفِ لِلْقُرْآنِ وَالْعِلْمُ بِالسُّنَّةِ الْمَحْضَةِ إِنَّمَا يُسْتَفَادُ مِنْ هَذَا<\/p>\n<p>This is what Al-Ash’ari is praised for. He clarified the scandals of the Mu’tazlia, their contradictory statements, and their corruption in a way that no one else could have because he was one of them. He had studied theology under Abu ‘Ali al-Jubba’i for forty years and he was quite intelligent. Then, he turned away from them, authored refutations against them, and supported Ibn Kullab’s method of understanding the divine attributes because it was closer to the truth and the Sunnah than their statements. He did not know anything else, as he was not aware of the Sunnah, the Hadith, the statements of the Companions, their successors, and others, the righteous predecessors’ interpretation of the Quran, or knowledge of the authentic Sunnah. He would have benefitted from them.<\/p>\n<p>Source: Minhāj al-Sunnah 5\/276-277<\/p><\/blockquote>\n<p>For this reason, Athari scholars would sometimes approvingly cite Imam al-Ash’ari as an authority.<\/p>\n<p>Imam Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أما قوله ليس كل شيء أراده فقد أحبه فهذا صحيح وهو أحد قولي الأشعري وقول المحققين من أصحابه وهذا الذي يدل عليه الكتاب والسنة والمعقول<\/p>\n<p>As for saying that ‘Allah does not love everything He wills to be,’ this is correct. It is one of the statements of Al-Ash’ari and the statement of researchers among his students, and this is what is indicated by the Book, the Sunnah, and sound reasoning.<\/p>\n<p>Source: Badāʼi’ al-Fawāʼid 2\/5<\/p><\/blockquote>\n<p>And Ibn al-Qayyim again cites him as a credible source:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاحْتَجَّ الشَّيْخُ أَبُو الْحَسَنِ الْأَشْعَرِيُّ فِي كُتُبِهِ عَلَى الْمُعَطِّلَةِ بِهَذِهِ الْآيَةِ<\/p>\n<p>Shaykh Abu Hasan al-Asha’ri used this verse in his books as proof against those who nullify the attributes of Allah.<\/p>\n<p>Source: al-Dā&#8217; wal-Dawā&#8217; 1\/144<\/p><\/blockquote>\n<p>Whether Imam al-Ash’ari eventually accepted the Athari creed or retained some of his philosophical positions, his life paints an admirable portrait of a sincere and righteous man seeking the truth and willing to revise his views as he discovered new knowledge.<\/p>\n<p>Are the followers of Al-Ash’ari considered <em>Ahl al-Sunnah<\/em> <em>wal-Jama’ah<\/em> (people of the Sunnah and the united community)? The Athari scholars have debated this question, but the answer depends on what is meant by ‘people of the Sunnah.’<\/p>\n<p>Some scholars consider the Ash’aris, and by extension the closely aligned Maturidis, to be within the fold of the Sunnah when contrasted with other extreme sects like the Rafidah, Mu’tazlia, and Khawarij.<\/p>\n<p>Imam al-Saffarini writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَهْلُ السُّنَّةِ وَالْجَمَاعَةِ ثَلَاثُ فِرَقٍ الْأَثَرِيَّةُ وَإِمَامُهُمْ أَحْمَدُ بْنُ حَنْبَلٍ رَضِيَ اللَّهُ عَنْهُ وَالْأَشْعَرِيَّةُ وَإِمَامُهُمْ أَبُو الْحَسَنِ الْأَشْعَرِيُّ رَحِمَهُ اللَّهُ وَالْمَاتُرِيدِيَّةُ وَإِمَامُهُمْ أَبُو مَنْصُورٍ الْمَاتُرِيدِيُّ وَأَمَّا فِرَقُ الضَّلَالِ فَكَثِيرَةٌ جِدًّا<\/p>\n<p>The ‘people of Sunnah and the united community’ are three groups: The Athari, whose Imam is Ahmad ibn Hanbal, may Allah be pleased with him. The Ash’aris, whose Imam is Abu al-Hasan al-Ash’ari, may Allah have mercy on him. And the Maturidis, whose Imam is Abu Mansur al-Maturidi. As for the misguided sects, there are many of them.<\/p>\n<p>Source: Lawāmi&#8217; al-Anwār al-Bahīyah 1\/73<\/p><\/blockquote>\n<p>The statement of Imam al-Saffarini is widely quoted as evidence that the differences between the three Sunni schools of theology are negligible, but this is not the case. The Imam’s statement requires clarification.<\/p>\n<p>The Ash’aris and Maturidis are ‘people of the Sunnah’ in that they accept the legitimacy of the Four Righteous Caliphs: Abu Bakr, Umar, Uthman, and Ali. They accept the Quran and authentic Hadith as their primary sources, the legitimacy of Sunni political authority, and the legal schools of the Four Imams: Abu Hanifa, Malik, Al-Shafi’i, and Ahmad. All three schools accept the earliest text of sound Islamic creed, <em><a href=\"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/\">Al-Aqidah al-Tahawiyyah<\/a><\/em>.<\/p>\n<p>This broader definition is one of the established meanings <em>Ahl al-Sunnah wal-Jama’ah<\/em>.<\/p>\n<p>Imam al-Tabari writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالصَّوَابُ أَنَّ الْمُرَادَ مِنَ الْخَبَرِ لُزُومُ الْجَمَاعَةِ الَّذِينَ فِي طَاعَةِ مَنِ اجْتَمَعُوا عَلَى تَأْمِيرِهِ فَمَنْ نَكَثَ بَيْعَتَهُ خَرَجَ عَنِ الْجَمَاعَةِ<\/p>\n<p>The correct opinion is that ‘the united community’ refers to those who obey the authorities over them. Whoever renounces his pledge of allegiance has left ‘the united community.’<\/p>\n<p>Source: Fatḥ al-Bārī 13\/37<\/p><\/blockquote>\n<p>And Imam al-Shatibi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَحَاصِلُهُ أَنَّ الْجَمَاعَةَ رَاجِعَةٌ إِلَى الِاجْتِمَاعِ عَلَى الْإِمَامِ الْمُوَافِقِ لِلْكِتَابِ وَالسُّنَّةِ وَذَلِكَ ظَاهِرٌ فِي أَنَّ الِاجْتِمَاعَ عَلَى غَيْرِ سُنَّةٍ خَارِجٌ عَنْ مَعْنَى الْجَمَاعَةِ الْمَذْكُورِ فِي الْأَحَادِيثِ الْمَذْكُورَةِ كَالْخَوَارِجِ وَمَنْ جَرَى مُجْرَاهُمْ<\/p>\n<p>In sum, ‘the united community’ refers to those who gather under the ruler in accordance with the Book and the Sunnah. It is apparent that gathering upon something besides the Sunnah is excluded in the meaning of ‘the united community,’ as mentioned in the Hadith, such as the Khawarij and those who follow their path.<\/p>\n<p>Source: al-I&#8217;tiṣām 2\/775<\/p><\/blockquote>\n<p>The Ash’aris, Maturidis, and Atharis are not inherently antagonistic towards each other, despite their disagreements. The three Sunni schools have largely coexisted under a single polity, accepting their differences as a matter of interpretation. They allow prayer behind each other, often engaging in mutually beneficial and respectful scholarly discussions.<\/p>\n<p>In contrast, the Rafidah, Khawarij, and some of the Mu’tazlia consider it part of their creed to wage civil wars against Sunni rulers.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَمَّا الْأَشْعَرِيَّةُ فَلَا يَرَوْنَ السَّيْفَ مُوَافَقَةً لِأَهْلِ الْحَدِيثِ وَهُمْ فِي الْجُمْلَةِ أَقْرَبُ الْمُتَكَلِّمِينَ إلَى مَذْهَبِ أَهْلِ السُّنَّةِ وَالْحَدِيثِ<\/p>\n<p>As for the Ash’aris, they do not view the sword as warranted against the people of Hadith. In general, they are the closest of the philosopher-theologians to the way of the Sunnah and Hadith.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 6\/55<\/p><\/blockquote>\n<p>And Shaykh al-Islam writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإن كان في كلامهم من الأدلة الصحيحة وموافقة السنة مالا يوجد في كلام عامة الطوائف فإنهم أقرب طوائف أهل الكلام إلى السنة والجماعة والحديث وهم يعدون من أهل السنة والجماعة عند النظر إلى مثل المعتزلة والرافضة ونحوهم بل هم أهل السنة والجماعة في البلاد التي يكون أهل البدع فيها المعتزلة والرافضة ونحوهم<\/p>\n<p>There is sound evidence in their discourse that agrees with the Sunnah, unlike what is found in other sects. They are the closest group among the philosopher-theologians to the Sunnah, the united community, and the Hadith. They are considered among ‘the people of Sunnah and the united community’ in comparison to the Mu’tazila, the Rafidah, and their likes. Rather, they are indeed ‘the people of Sunnah’ in countries wherein are heretics like the Mu’tazila, the Rafidah, and others.<\/p>\n<p>Source: Bayān Talbīs al-Jahmīyah 3\/538<\/p><\/blockquote>\n<p>From this perspective, it is correct to say the Ash’aris and Maturidis are ‘people of the Sunnah’ in general, despite their mistakes, as it forms the basis for Sunnis to cooperate in righteousness, piety, charitable works, and supporting the Ummah, as commanded by Allah:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَتَعَاوَنُوا۟ عَلَى ٱلْبِرِّ وَٱلتَّقْوَىٰ وَلَا تَعَاوَنُوا۟ عَلَى ٱلْإِثْمِ وَٱلْعُدْوَٰنِ<\/p>\n<p style=\"text-align: left;\"><strong>Cooperate with one another in goodness and righteousness, and do not cooperate in sin and transgression.<\/strong><\/p>\n<p>Surat al-Ma&#8217;idah 5:2<\/p><\/blockquote>\n<p>Al-&#8216;Allamah al-Sa&#8217;di commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نتعاون فيما اتفقنا عليه ويعذر بعضنا بعضاً فيما اختلفنا فيه<\/p>\n<p>Cooperate in what is agreed upon, and give excuses to each other in what we differ.<\/p>\n<p>Source: Munāẓarāt al-Fiqhīyah 1\/10<\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah, despite his criticism of the Ash&#8217;ari methodology, attempted to find common ground with them:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالنَّاسُ يَعْلَمُونَ أَنَّهُ كَانَ بَيْنَ الْحَنْبَلِيَّةِ وَالْأَشْعَرِيَّةِ وَحْشَةٌ وَمُنَافَرَةٌ وَأَنَا كُنْت مِنْ أَعْظَمِ النَّاسِ تَأْلِيفًا لِقُلُوبِ الْمُسْلِمِينَ وَطَلَبًا لِاتِّفَاقِ كَلِمَتِهِمْ وَاتِّبَاعًا لِمَا أُمِرْنَا بِهِ مِنْ الِاعْتِصَامِ بِحَبْلِ اللَّهِ<\/p>\n<p>People know that there is estrangement and rivalry between the Hanbalis and Ash&#8217;aris, but I was the greatest of people in bringing the hearts of Muslims together, seeking to agreement in their statements, following what we are commanded to hold fast to the Quran, the rope of Allah.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 3\/227<\/p><\/blockquote>\n<p>Since the Ash&#8217;aris and Maturidis are closest to the Sunnah than other groups, cooperating with them is desirable, even necessary, on important issues like charity campaigns, defense of Islamic countries, and producing beneficial scholarship for the Ummah. This is especially true in non-Muslim countries where Muslims are a minority, sometimes among a hostile population.<\/p>\n<p>However, it is not correct to say that their beliefs and methodologies opposing the Salaf are faithful to the Sunnah. Philosophical speculation about the Unseen is technically an ‘innovation’ (<em>bid’ah<\/em>), since the Salaf did not practice it, but it is not like the innovations that justify violence against Sunnis, such as the Mu&#8217;tazlia who imprisoned and tortured the Atharis.<\/p>\n<p>These two meanings of ‘people of the Sunnah and united community’ should be appreciated when discussing intra-Sunni differences in creed and theology.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَفْظُ أَهْلِ السُّنَّةِ يُرَادُ بِهِ مَنْ أَثْبَتَ خِلَافَةَ الْخُلَفَاءِ الثَّلَاثَةِ فَيَدْخُلُ فِي ذَلِكَ جَمِيعُ الطَّوَائِفِ إِلَّا الرَّافِضَةَ وَقَدْ يُرَادُ بِهِ أَهْلُ الْحَدِيثِ وَالسُّنَّةِ الْمَحْضَةِ فَلَا يَدْخُلُ فِيهِ إِلَّا مَنْ يُثْبِتُ الصِّفَاتِ لِلَّهِ تَعَالَى وَيَقُولُ إِنَّ الْقُرْآنَ غَيْرُ مَخْلُوقٍ وَإِنَّ اللَّهَ يُرَى فِي الْآخِرَةِ وَيُثْبِتُ الْقَدْرَ وَغَيْرَ ذَلِكَ مِنَ الْأُصُولِ الْمَعْرُوفَةِ عِنْدَ أَهْلِ الْحَدِيثِ وَالسُّنَّةِ<\/p>\n<p>The term ‘people of the Sunnah’ means those who acknowledge the authority of the first three Caliphs, so all the sects are included in that except for the Rafidah. The term also means ‘the people of Hadith and authentic Sunnah,’ so it does not include anyone except those who affirm the divine attributes of Allah, who say the Quran is not created and that Allah will be seen in the Hereafter, and who affirm divine providence and other religious fundamentals according to the people of Sunnah and Hadith.<\/p>\n<p>Source: Minhāj al-Sunnah 2\/221<\/p><\/blockquote>\n<p>Shaykh ‘Abdulaziz Ibn Baz issued a legal verdict:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأشاعرة من أهل السنة في غالب الأمور ولكنهم ليسوا منهم في تأويل الصفات وليسوا بكفار بل فيهم الأئمة والعلماء والأخيار ولكنهم غلطوا في تأويل بعض الصفات فهم خالفوا أهل السنة في مسائل<\/p>\n<p>The Ash’aris are from &#8216;the people of Sunnah&#8217; in the majority of matters, but they are not among them in interpreting the divine attributes. They are not unbelievers. Rather, among them are Imams, scholars, and righteous people. However, they are mistaken in misinterpreting some of the divine attributes, so they are not people of the Sunnah on certain issues.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá Ibn Bāz 28\/256<\/p><\/blockquote>\n<p>Shaykh Ibn ‘Uthaymeen said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الأشاعرة من أهل السنة والجماعة فيما وافقوا فيه أهل السنة والجماعة وهم مخالفون أهل السنة والجماعة في باب الصفات لأنهم لا يثبتون من صفات الله إلا سبع صفات ومع هذا لا يثبتونها على الوجه الذي أثبتها عليه أهل السنة، فلا ينبغي أن نقول هم من أهل السنة على الإطلاق ولا أن ننفي عنهم كونهم من أهل السنة على الإطلاق بل نقول هم من أهل السنة فيما وافقوا فيه أهل السنة وهم مخالفون أهل السنة فيما خالفوا فيه أهل السنة فالتفصيل هو الذي يكون به الحق وقد قال الله تعالى وَإِذَا قُلْتُمْ فَاعْدِلُوا فإخراجهم من أهل السنة مطلقاً ليس من العدل وإدخالهم في أهل السنة بالإطلاق ليس من العدل أيضاً والواجب أن يعطى كل ذي حقٍ حقه<\/p>\n<p>The Ash&#8217;aris are from ‘the people of the Sunnah and united community’ when they agree with the people of the Sunnah and united community, but they differ from them in the matter of the divine attributes, because they only affirm seven attributes of Allah. Even then, they do not affirm them in the way that the people of Sunnah affirmed them. Therefore, we do not say that they are from the people of Sunnah in an absolute manner, nor do we deny that they are from the people of Sunnah in an absolute manner. Rather, we say, ‘They are from the people of Sunnah in that in which they agree with the people of Sunnah, and they differ from the people of Sunnah in that in which they differ with the people of Sunnah.’ The truth is in making distinctions. Allah Almighty said, ‘<strong>When you speak, be just<\/strong>,’ (6:152). Hence, excluding them from the people of Sunnah in an absolute manner is not just, and including them among the people of Sunnah in an absolute manner is not just either. It is obligatory to give everyone their due rights.<\/p>\n<p>Source: Liqā’ al-Bāb al-Maftūḥ 6\/20<\/p><\/blockquote>\n<p>And Shaykh al-Albani said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أما إن الأشاعرة والماتريدية هل هم من أهل السنة والجماعة أنا أقول هم من أهل السنة والجماعة في كثير من عقائدهم ولكن في عقائد أخرى انحرفوا عن أهل السنة والجماعة<\/p>\n<p>As for the Ash&#8217;aris and Maturidis, are they from ‘the people of the Sunnah and the united community’? I say that they are part of the people of the Sunnah in many of their beliefs, but in other beliefs they have deviated from the people of the Sunnah.<\/p>\n<p>Source: Silsilat al-Hudá wal-Nūr 673<\/p><\/blockquote>\n<p>It is appropriate for the Atharis, Ash’aris, and Maturidis to be considered ‘people of the Sunnah’ in general, as far as the public is concerned. The differences between them should be discussed by scholars, not by untrained lay Muslims, as this will cause more confusion than clarity. There is little or no benefit in discussing the theological differences between Sunni Muslims in public, especially among audiences who are incapable of engaging the debates with knowledge or good faith.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْوَاجِبُ أَمْرُ الْعَامَّةِ بِالْجُمَلِ الثَّابِتَةِ بِالنَّصِّ وَالْإِجْمَاعِ وَمَنْعُهُمْ مِنْ الْخَوْضِ فِي التَّفْصِيلِ الَّذِي يُوقِعُ بَيْنَهُمْ الْفُرْقَةَ وَالِاخْتِلَافَ فَإِنَّ الْفُرْقَةَ وَالِاخْتِلَافَ مِنْ أَعْظَمِ مَا نَهَى اللَّهُ عَنْهُ وَرَسُولُهُ<\/p>\n<p>What must be done is to enjoin the public to believe in general terms in that which is proven by the divine texts and scholarly consensus, and prevent them from indulging in detailed discussions that will create division and differences between them, because division and differences are among the things that are most emphatically forbidden by Allah and His Messenger.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 12\/237<\/p><\/blockquote>\n<p>Imam al-Nawawi likewise forbids discussion among lay Muslims about these disagreements if they lead to doubt, hatred, and disunity:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يجوز اخْتِلَاف يُوقِعُ فِي شَكٍّ او شبهة اوفتنة وخصومة اوشجار وَنَحْوِ ذَلِكَ<\/p>\n<p>It is not permissible to discuss differences resulting in doubts, misgivings, arguments, fights, and so on.<\/p>\n<p>Source: Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 16\/219<\/p><\/blockquote>\n<p>The internal debates, while important regarding methodology, are scholastic and inaccessible to most lay Muslims just trying to keep up with their daily practice. It is not appropriate to expose the public to these confusing, often esoteric, debates between scholars.<\/p>\n<p>Regarding Imam al-Saffarini’s statement that includes the Ash’aris and Maturidis as ‘people of the Sunnah,’ it appears that he meant it in regards to their commonalities, such as agreement on the authentic Sunnah as a primary source, the four schools of law, and acceptance of Sunni political authority.<\/p>\n<p>Imam al-Saffarini did not consider the Ash’ari or Maturidi schools to be fully representative of the Sunnah. In the same book, the Imam clearly advocates for the Athari creed of Imam Ahmad ibn Hanbal:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْلَمْ أَنَّ مَذْهَبَ الْحَنَابِلَةِ هُوَ مَذْهَبُ السَّلَفِ فَيَصِفُونَ اللَّهَ بِمَا وَصَفَ بِهِ نَفْسَهُ وَبِمَا وَصَفَهُ بِهِ رَسُولُهُ مِنْ غَيْرِ تَحْرِيفٍ وَلَا تَعْطِيلٍ وَمِنْ غَيْرِ تَكْيِيفٍ وَلَا تَمْثِيلٍ فَاللَّهُ تَعَالَى ذَاتٌ لَا تُشْبِهُ الذَّوَاتِ مُتَّصِفَةٌ بِصِفَاتِ الْكَمَالِ الَّتِي لَا تُشْبِهُ الصِّفَاتِ مِنَ الْمُحْدَثَاتِ &#8230; فَهَذَا اعْتِقَادُ سَائِرِ الْحَنَابِلَةِ كَجَمِيعِ السَّلَفِ فَمَنْ عَدَلَ عَنْ هَذَا الْمَنْهَجِ الْقَوِيِّ زَاغَ عَنِ الصِّرَاطِ الْمُسْتَقِيمِ وَانْحَرَفَ<\/p>\n<p>Know that the way of the Hanbalis is the way of the Salaf, such that they describe Allah as He described Himself and as described by His Messenger, without distortion or negation, and without ascribing modalities or comparisons. For the essence of Allah Almighty does not resemble any other essence. He is characterized by perfect attributes that do not resemble the attributes of contingent beings… This is the creed of the rest of the Hanbalis, as it was for all of the Salaf. Whoever foregoes this robust methodology has deviated and fallen off the Straight Path.<\/p>\n<p>Source: Lawāmi&#8217; al-Anwār al-Bahīyah 1\/107<\/p><\/blockquote>\n<p>The Imam equates the Athari creed with the creed of the Salaf, the three best generations in Islam:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّهُ أَيِ الْإِمَامَ أَحْمَدَ رَضِيَ اللَّهُ عَنْهُ إِمَامُ وَقُدْوَةُ أَهْلِ أَيْ أَصْحَابِ الْأَثَرِ يَعْنِي الَّذِينَ إِنَّمَا يَأْخُذُونَ عَقِيدَتَهُمْ مِنَ الْمَأْثُورِ عَنِ اللَّهِ جَلَّ شَأْنُهُ فِي كِتَابِهِ أَوْ فِي سُنَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ مَا ثَبَتَ وَصَحَّ عَنِ السَّلَفِ الصَّالِحِ مِنَ الصَّحَابَةِ الْكِرَامِ وَالتَّابِعِينَ الْفِخَامِ &#8230; ذَلِكَ الذَّاهِبُ مَذْهَبَ الْإِمَامِ أَحْمَدَ الْأَثَرِي أَيِ الْمَنْسُوبُ إِلَى الْعَقِيدَةِ الْأَثَرِيَّةِ وَالْفِرْقَةِ السَّلَفِيَّةِ الْمَرْضِيَّةِ وَيُعْرَفُ أَيْضًا بِمَذْهَبِ السَّلَفِ<\/p>\n<p>For the Imam Ahmad ibn Hanbal, may Allah be pleased with him, is an Imam and role model for the people of traditions, meaning those who only derive their creed from what is reported about the affairs of Allah Almighty in His Book, the Sunnah of the Prophet, peace and blessings be upon him, or what is established and authenticated from the righteous predecessors among the Noble Companions and their successors… Such is the way of Imam Ahmad, the Athari, who is attributed to the Athari creed and the group of respectable Salafis. It is also known as the way of the Salaf.<\/p>\n<p>Source: Lawāmi&#8217; al-Anwār al-Bahīyah 1\/64<\/p><\/blockquote>\n<p>To support his view, the Imam cites the Hadith of the Messenger of Allah, peace and blessings be upon him, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ بَنِي إِسْرَائِيلَ تَفَرَّقَتْ عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلَاثٍ وَسَبْعِينَ مِلَّةً كُلُّهُمْ فِي النَّارِ إِلَّا مِلَّةً وَاحِدَةً<\/p>\n<p><strong>Verily, the children of Israel split into seventy-two sects, and my nation will split into seventy-three sects. All of them are in the Hellfire except for one denomination.<\/strong><\/p><\/blockquote>\n<p>It was said, “Who are they, O Messenger of Allah?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا أَنَا عَلَيْهِ وَأَصْحَابِي<\/p>\n<p><strong>Those upon my way and the way of my Companions.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2641, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/12\/14\/seventy-three-sects-sahaba\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>The Imam commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّهُمْ أَيِ الْأَثَرِيَّةَ مِنَ الْفِرْقَةِ النَّاجِيَةِ أَثْبَتُوا النُّصُوصَ الْقُرْآنِيَّةَ وَالْأَحَادِيثَ النَّبَوِيَّةَ مُتَمَسِّكِينَ بِالتَّنْزِيهِ لِلَّهِ سُبْحَانَهُ وَتَعَالَى مِنْ غَيْرِ تَعْطِيلٍ لِلصِّفَاتِ الْوَارِدَةِ فِي الْكِتَابِ الْعَزِيزِ وَالسُّنَّةِ الصَّحِيحَةِ<\/p>\n<p>They are surely the Atharis from the saved sect. They confirm the texts of the Quran and Hadith, affirming the transcendence of Allah Almighty without nullifying the divine attributes as they are related in the Noble Quran and authentic Sunnah.<\/p>\n<p>Source: Lawāmi&#8217; al-Anwār al-Bahīyah 1\/94<\/p><\/blockquote>\n<p>Imam al-Saffarini considered the Asha’ris and Maturidis to be ‘people of the Sunnah’ in one respect, but not in another. This larger context must be understood when quoting his previous statement.<\/p>\n<p>The application of terms like Ash’ari, Athari, and Salafi can be confusing because they encompass both moderates and extremists in either school. Not everyone who claims to be ‘Salafi’ is an actual follower of the Salaf, because actions matter more than superficial labels.<\/p>\n<p>Imam al-Ash’ari himself was nearer to Imam Ahmad than many of Ahmad’s later followers or even some &#8216;Salafis&#8217; today.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وكان الأشعري أقرب إلى مذهب أحمد بن حنبل وأهل السنة من كثير من المتأخرين المنتسبين إلى أحمد الذين مالوا إلى بعض كلام المعتزلة كابن عقيل<\/p>\n<p>Al-Ash’ari was closer to the way of Ahmad ibn Hanbal and ‘the people of Sunnah’ than many of the later scholars who attributed themselves to Ahmad, but who inclined to some of the Mu’tazilite theology, such as Ibn ‘Aqil.<\/p>\n<p>Source: Dar&#8217; Ta&#8217;āruḍ al-&#8216;Aql wal-Naql 1\/270<\/p><\/blockquote>\n<p>Likewise, not everyone who attributes themselves to Imam al-Ash’ari is following what he intended. Later adherents of any school may substantially diverge from their claimed founder.<\/p>\n<p>Nevertheless, the Athari scholars tend to be fair to the other schools by properly representing their views, praising their good qualities, and excusing their mistakes. The Ash’aris and Maturidis were recognized as producing several brilliant jurists and exegetes who significantly contributed to the Ummah’s scholarly heritage.<\/p>\n<p>Even after criticizing the works of several Ash’ari scholars, Shaykh al-Islam prohibited ‘excommunication’ (<em>takfir<\/em>) against them, or declaring them to be unbelievers:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَوْ كَفَرَ هَؤُلَاءِ لَزِمَ تَكْفِيرُ كَثِيرٍ مِنْ الشَّافِعِيَّةِ وَالْمَالِكِيَّةِ وَالْحَنَفِيَّةِ وَالْحَنْبَلِيَّةِ وَالْأَشْعَرِيَّةِ وَأَهْلِ الْحَدِيثِ وَالتَّفْسِيرِ وَالصُّوفِيَّةِ الَّذِينَ لَيْسُوا كُفَّارًا بِاتِّفَاقِ الْمُسْلِمِينَ &#8230; وَمَعَ هَذَا فَقَدْ اتَّفَقَ الْمُسْلِمُونَ عَلَى أَنَّهُ لَا يُكَفَّرُ أَحَدٌ مِنْ هَؤُلَاءِ الْأَئِمَّةِ وَمَنْ كَفَّرَهُمْ بِذَلِكَ اسْتَحَقَّ الْعُقُوبَةَ الْغَلِيظَةَ الَّتِي تَزْجُرُهُ وَأَمْثَالَهُ عَنْ تَكْفِيرِ الْمُسْلِمِينَ<\/p>\n<p>If we were to excommunicate these Imams, it would mean excommunicating many of the Shafi’i’s, Malikis, Hanafis, Hanbalis, Ash’aris, scholars of Hadith and Quranic interpretation, and Sufis who are not unbelievers by consensus of the Muslims. Rather, the Muslims have agreed not to declare any of these Imams to be unbelievers. Whoever excommunicates them deserves a severe punishment for that, by the consensus of the Muslims, to deter them and their likes from excommunicating Muslims.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 35\/101<\/p><\/blockquote>\n<p>Shaykh Ibn ‘Uthaymeen agreed with this view:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يخرج الأشاعرة والماتريدية من صف المسلمين إلا جاهل بحالهم أو جاهل بأسباب الكفر والخروج عن الإسلام أما أهل العلم بذلك فلم يخرجوهم من الإسلام بل ولا من أهل السنة والجماعة في غير ما خالفوا به أهل السنة والجماعة والإنسان قد يكون فيه شعبة من المخالفة للحق وشعبة من الموافقة له ولا يخرجه ذلك عن أهل الحق إخراجا مطلقا بل يعطى ما يستحقه ويوصف بما هو أهله من هذا وهذا حتى يكون الوزن بالقسطاس المستقيم<\/p>\n<p>The Ash&#8217;aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant of their condition, or ignorant of the causes of unbelief and leaving Islam. As for those with such knowledge, they do not exclude them from Islam, nor from ‘the people of the Sunnah and the united community’ except in that in which they differed with the people of Sunnah. A person might oppose the truth in one matter, or agree with it in another, but that does not exclude him from being among &#8216;the truthful&#8217; absolutely. Rather, he is given what he deserves and described with what he deserves of this or that, such that the balance is with the upright scale.<\/p>\n<p>Source: Majmūʻ Fatāwá wa Rasā&#8217;il lil-‘Uthaymīn  1\/235<\/p><\/blockquote>\n<p>Shaykh al-Islam found fault with scholars being too excessive in their condemnation of the Ash’aris:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُبَالِغُ يعني الهروي فِي ذَمِّ الْأَشْعَرِيَّةِ مَعَ أَنَّهُمْ مِنْ أَقْرَبِ هَذِهِ الطَّوَائِفِ إلَى السُّنَّةِ وَالْحَدِيثِ وَرُبَّمَا كَانَ يَلْعَنُهُمْ<\/p>\n<p>Al-Harawi exaggerated in his condemnation of the Ash’aris, despite them being the closest of these sects to the Sunnah and Hadith. Perhaps he even cursed them!<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 14\/354<\/p><\/blockquote>\n<p>The balanced approach of Shaykh al-Islam towards the Ash’aris is a demonstration of Islam’s commitment to justice in all things.<\/p>\n<p>On the other hand, many Ash’ari scholars were fair in their assessment of the Atharis. Imam al-Ghazali, who inclined to the Ash’ari school, affirmed the validity of both Ash’ari and Athari methods, seeking to reconcile them both by focusing on what was essential and agreed upon in creed.<\/p>\n<p>Imam al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">والظن بأحمد بن حنبل رضي الله عنه أنه علم أن الاستواء ليس هو الاستقرار والنزول ليس هو الانتقال ولكنه منع من التأويل حسماً للباب ورعاية لصلاح الخلق فإنه إذا فتح الباب اتسع الخرق وخرج الأمر عن الضبط وجاوز حد الاقتصاد إذ حد ما جاوز الاقتصاد لا ينضبط فلا بأس بهذا الزجر ويشهد له سيرة السلف فإنهم كانوا يقولون أمروها<\/p>\n<p>I suspect that Ahmad ibn Hanbal, may Allah be pleased with him, knew that ‘rising over the Throne’ does not mean ‘sitting’ and that ‘descending’ does not mean ‘moving,’ but he prohibited metaphorical interpretations in determination to close the door in the best interests of people. If the door is opened, the breach will widen and the matter will get out of control and exceed the limits of moderation, since what exceeds the limits of moderation cannot be controlled, so there is nothing wrong with this warning. The conduct of the Salaf bears witness to it, because they used to enjoin it.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/104<\/p><\/blockquote>\n<p>The Ash&#8217;aris resorted to metaphorical interpretations to avoid falling into anthropomorphism (<em>tajism<\/em>), that is, to liken the Creator to His creation. Although Imam al-Ghazali considered such interpretations to be valid up to a point, he still justified Imam Ahmad’s rationale of ‘blocking the means’ (<em>sadd al-dhara’iah<\/em>), and he warned against the potential repercussions of overextending metaphorical readings of Allah&#8217;s attributes.<\/p>\n<p>The Imam continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وحد الاقتصاد بين هذا الانحلال كله وبين جمود الحنابلة دقيق غامض لا يطلع عليه إلا الموفقون الذين يدركون الأمور بنور إلهي لا بالسماع<\/p>\n<p>The limit of moderation between all of this interpretive laxity and the rigidity of the Hanbalis is a subtle and obscure thing. It is only comprehended by the rightly-guided who arrive at matters by divine light, not merely by hearing transmitted reports.<\/p>\n<p>Source: Iḥyā’ Ulūm al-Dīn 1\/104<\/p><\/blockquote>\n<p>In other words, metaphorical interpretations can be dangerous when mishandled. Only the most pure-hearted and knowledgeable scholars can utilize them, while loose philosophizing about the Unseen may lead to serious deviation later on, particularly when paired with Sufi mysticism lacking firm scriptural grounding.<\/p>\n<p>Hence, Muslims need to take a fair, balanced, and moderate approach to intra-Sunni differences in creed and theology. Muslims must not allow valid scholarly disagreements, which historically have been tolerated and excused even in creed, to incite disunity and weakness in the Ummah. Extremists in either school who excommunicate or disparage the others, as a whole, should be rebuked and restrained.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُتَأَوِّلَ الَّذِي قَصْدُهُ مُتَابَعَةُ الرَّسُولِ لَا يَكْفُرُ بَلْ وَلَا يَفْسُقُ إِذَا اجْتَهَدَ فَأَخْطَأَ وَهَذَا مَشْهُورٌ عِنْدَ النَّاسِ فِي الْمَسَائِلِ الْعَمَلِيَّةِ وَأَمَّا مَسَائِلُ الْعَقَائِدِ فَكَثِيرٌ مِنَ النَّاسِ كَفَّرَ الْمُخْطِئِينَ فِيهَا وَهَذَا الْقَوْلُ لَا يُعَرَفُ عَنْ أَحَدٍ مِنَ الصَّحَابَةِ وَالتَّابِعِينَ لَهُمْ بِإِحْسَانٍ وَلَا عَنْ أَحَدٍ مِنْ أَئِمَّةِ الْمُسْلِمِينَ وَإِنَّمَا هُوَ فِي الْأَصْلِ مِنْ أَقْوَالِ أَهْلِ الْبِدَعِ الَّذِينَ يَبْتَدِعُونَ بِدْعَةً وَيُكَفِّرُونَ مَنْ خَالَفَهُمْ كَالْخَوَارِجِ وَالْمُعْتَزِلَةِ وَالْجَهْمِيَّةِ وَوَقَعَ ذَلِكَ فِي كَثِيرٍ مِنْ أَتْبَاعِ الْأَئِمَّةِ كَبَعْضِ أَصْحَابِ مَالِكٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَغَيْرِهِمْ &#8230; وَإِذَا لَمْ يَكُونُوا فِي نَفْسِ الْأَمْرِ كُفَّارًا لَمْ يَكُونُوا مُنَافِقِينَ فَيَكُونُونَ مِنَ الْمُؤْمِنِينَ فَيَسْتَغْفِرُ لَهُمْ وَيَتَرَحَّمُ عَلَيْهِمْ<\/p>\n<p>Those who misinterpreted, while intending to follow the Messenger, are not declared unbelievers. Rather, they are not even declared sinners if they exercised reasoning and were mistaken. This is well-known among people in practical matters. As for matters of belief, many people excommunicate those who make mistakes in them. This view was not known by anyone among the Companions, their successors, or those who followed them in righteousness, nor by any of the Imams of the Muslims. Indeed, its origin is from the statements of the innovators, who charged with heresy and unbelief those who opposed them, such as the Khawarij, the Mu’tazila, and the Jahmiyyah. Yet many of those who followed the Imams fell into that, such as some of the companions of Malik, Al-Shafi’i, Ahmad, and others… If they are not unbelievers all the same, they are not hypocrites either, so they are among the believers. One should ask Allah to forgive them and have mercy upon them.<\/p><\/blockquote>\n<p>Then, Shaykh al-Islam cites the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَبَّنَا ٱغْفِرْ لَنَا وَلِإِخْوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلْإِيمَـٰنِ وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّۭا لِّلَّذِينَ ءَامَنُوا۟ رَبَّنَآ إِنَّكَ رَءُوفٌۭ رَّحِيمٌ<\/p>\n<p><strong>Our Lord! Forgive us and our fellow believers who preceded us in faith, and do not allow bitterness into our hearts towards those who believe. Our Lord! Indeed, You are Ever Gracious, Most Merciful.<\/strong><\/p>\n<p>Surat al-Hashr 59:10<\/p><\/blockquote>\n<p>Shaykh al-Islam continues:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَيَدْخُلُ فِي الْعُمُومِ وَإِنْ كَانَ مِنَ الثِّنْتَيْنِ وَالسَبْعِينَ فِرْقَةً فَإِنَّهُ مَا مِنْ فِرْقَةٍ إِلَّا وَفِيهَا خَلْقٌ كَثِيرٌ لَيْسُوا كُفَّارًا بَلْ مُؤْمِنِينَ فِيهِمْ ضَلَالٌ وَذَنْبٌ يَسْتَحِقُّونَ بِهِ الْوَعِيدَ<\/p>\n<p>This verse is inclusive in general, even if someone were from the seventy-two sects, for there is no sect but that it contains many who are not unbelievers. Rather, they are misguided believers and sinners who deserved to be warned.<\/p>\n<p>Source: Minhāj al-Sunnah 5\/239-240<\/p><\/blockquote>\n<p>Shaykh Ibn ‘Uthaymeen agreed with this view, applying it specifically to Ash‘ari and Maturidi scholars who interpret Allah’s attributes metaphorically, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأما موقفنا من العلماء المئولين فنقول من عرف منهم بحسن النية وكان لهم قدم صدق في الدين واتباع السنة فهو معذور بتأويله السائغ ولكن عذره في ذلك لا يمنع من تخطئة طريقته المخالفة لما كان عليه السلف الصالح من إجراء النصوص على ظاهرها واعتقاد ما دل عليه ذلك الظاهر من غير تكييف ولا تمثيل فإنه يجب التفريق بين حكم القول وقائله والفعل وفاعله فالقول الخطأ إذا كان صادرا عن اجتهاد وحسن قصد لا يذم عليه قائله بل يكون له أجر على اجتهاده<\/p>\n<p>As for our position on the scholars who misinterpreted, we say that if someone is known to have good intentions, has been sincere in religion, and following the Sunnah, he is excused for his valid interpretation. However, his excuse for that does not prevent him from being criticized for his mistaken method as it conflicts with the righteous predecessors, who understood the divine texts by their apparent meanings, believing in what the apparent meaning indicates without ascribing a &#8216;modality&#8217; to it or likening it to creation. For one must make a distinction between the judgment of the statement and the speaker, the action and the actor. The speaker of an incorrect statement, if derived from reasoning and good motives, is not condemned. Rather, he has a reward for his effort in reasoning.<\/p>\n<p>Source: Majmū&#8217; Fatāwá wa Rasā&#8217;il lil-&#8216;Uthaymīn 1\/120-121<\/p><\/blockquote>\n<p>Then, the Shaykh cites the Messenger of Allah, peace and blessings be upon him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهُ أَجْرٌ<\/p>\n<p><strong>If a judge makes a ruling, striving to apply his reasoning and he is correct, he will have two rewards. If a judge makes a ruling, striving to apply his reasoning and he is mistaken, he will have one reward.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7352, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/10\/sincere-ijtihad-rewarded\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Shaykh’s latter point reinforces the principle that a statement may be classified as religious innovation (<em>bid‘ah<\/em>), without necessarily labeling its speaker as an innovator (<em>mubtadi&#8217;<\/em>), let alone a heretic, if the error stemmed from sincere interpretation. This is a well-established principle.<\/p>\n<p>The severity of innovation varies. Some innovations are merely mistaken misinterpretations, if such beliefs or practices have no basis with the Salaf, but other innovations are weaponized by the sects against the Sunnis.<\/p>\n<p>Abu Qilabah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا ابْتَدَعَ قَوْمٌ بِدْعَةً قَطُّ إِلَّا اسْتَحَلُّوا بِهَا السَّيْفَ<\/p>\n<p>People never innovate a heresy except that they make the sword lawful by it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/04\/17\/abu-qilabah-bidah-violence\/\">Muṣannaf ‘Abd al-Razzāq 18660<\/a><\/p><\/blockquote>\n<p>An Ash&#8217;ari or Maturidi scholar, or their followers, who genuinely slip from the way of the Salaf deserve a respectful correction. But a heretic intending to harm the Sunnis must be dealt with strictly. When the Salaf and Imams were harsh against innovators, as expressed in many of their statements, they were reacting to the leaders of violent sects, not the honest seekers who had mistaken interpretations.<\/p>\n<p>On this basis, the senior Athari scholars of our time have cautioned against excessive condemnation of the other Sunni schools, their scholars, or the lay Muslims who follow their errors. They would excuse the mistakes of great classical Hadith scholars, such as Al-Nawawi and Ibn Hajar, who occasionally adopted an Ash’ari position.<\/p>\n<p>Shaykh Ibn ‘Uthaymeen said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فعلينا أن نتئد وأن لا نتسرع وأن لا نقول لشخص أتى ببدعة واحدة من آلاف السنن إنه رجل مبتدع وهل يصح أن ننسب هذين الرجلين يعني ابن حجر والنووي وأمثالهما إلى الأشاعرة ونقول هما من الأشاعرة الجواب لا &#8230; فإذا قال قائل بمسألة من مسائل الصفات بما يوافق مذهبهم فلا نقول إنه أشعري أرأيتم لو أن إنساناً من الحنابلة اختار قولاً للشافعية فهل نقول إنه شافعي الجواب لا نقول إنه شافعي<\/p>\n<p>We must be cautious and not rush, and we do not say about an individual who comes with one innovation, among thousands from the Sunnah, that he is a heretic. Is it correct to attribute these two men, Imam Ibn Hajar and Imam al-Nawawi and their likes, to the Ash’ari? Do we say they are among the Ash’aris? The answer is no… When someone brings up an issue in the divine attributes that agrees with their doctrines, we do not say he is an Ash’ari. Do you think that if someone among the Hanbalis preferred an opinion of the Shafi’i’s that we say he is Shafi’i? The answer is we do not say they are Shafi’i’s.<\/p>\n<p>Source: Sharḥ al-Arba&#8217;īn lil-‘Uthaymīn 1\/289-290<\/p><\/blockquote>\n<p>And Shaykh Salih al-Fawzan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا ينبغي للطلبة المبتدئين وغيرهم من العامة أن يشتغلوا بالتبديع والتفسيق لأن ذلك أمر خطير وهم ليس عندهم علم ودراية في هذا الموضوع وأيضاً هذا يُحدث العداوة والبغضاء بينهم فالواجب عليهم الاشتغال بطلب العلم وكف ألسنتهم عما لا فائدة فيه بل فيه مضرة عليهم، وعلى غيرهم. &#8230; من كان عنده أخطاء اجتهادية تأوَّل فيها غيره كابن حجر والنووي وما قد يقع منهما من تأويل بعض الصفات لا يُحكم عليه بأنه مبتدع ولكن يُقال هذا الذي حصل منهما خطأ ويرجى لهما المغفرة بما قدماه من خدمة عظيمة لسنَّة رسول الله صلى الله عليه وسلم فهما إمامان جليلان موثوقان عند أهل العلم<\/p>\n<p>Beginner students and others from the general public should not be busy with declaring someone an innovator or a sinner, because that is a serious matter and they do not have knowledge or understanding of this subject. Moreover, this creates enmity and hatred between them. They must be busy with seeking knowledge and refrain from speaking about what is useless and harmful to them and others&#8230; Whoever has an error in his reasoning that he interpreted incorrectly, such as Ibn Hajar and Al-Nawawi, such as their interpretations of some divine attributes, he should not be judged as a heretic, but it should be said that what they did was a mistake, and forgiveness is hoped for them as they have provided a great service to the Sunnah of the Messenger of Allah, peace and blessings be upon him, and they are two outstanding Imams who are trusted by the people of knowledge.<\/p>\n<p>Source: al-Muntaqá min Fatāwá al-Fawzān 2\/211-212<\/p><\/blockquote>\n<p>The Atharis are even fair to scholars from heretical groups such as the Mu’tazlia, acknowledging the benefits of their works in disciplines unrelated to creed. For instance, the linguistic exegesis of the Quran by Al-Zamakhshari is considered a highly valuable resource.<\/p>\n<p>Shaykh Ibn ‘Uthaymeen said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هناك أناس ينتسبون لطائفة معينة شعارها البدعة كالمعتزلة مثلاً ومنهم الزمخشري فالزمخشري مُعتزلي ويصف المثْبِتِين للصفات بأنهم حَشَوِية مُجَسِّمة ويُضَلِّلهم فهو معتزلي ولهذا يجب على مَن طالع كتابه الكشاف في تفسير القرآن أن يحترز من كلامه في باب الصفات لكنه من حيث البلاغة والدلالات البلاغية اللغوية جيد يُنْتَفع بكتابه كثيراً إلا أنه خَطَرٌ على الإنسان الذي لا يعرف في باب الأسماء والصفات شيئاً<\/p>\n<p>There are people who belong to a certain sect, whose slogan is heresy, such as the Mu’tazila. For example, among them is Al-Zamakhshari. Al-Zamakhshari was a Mu’tazilite and wrongly described those who affirm the divine attributes as anthropomorphists and literalists, accusing them of misguidance, so he is a Mu’tazilite. As such, whoever reads his book, <em>Al-Kashaf fi Tafsir al-Qur’an<\/em>, must be careful of his words on the topic of divine attributes. However, in terms of rhetoric and linguistic connotations, it is very good and his book is of great benefit, except that it is dangerous for someone who does not know anything about the divine names and attributes.<\/p>\n<p>Source: Liqā’ al-Bāb al-Maftūḥ 43\/15<\/p><\/blockquote>\n<p>The way of Islam is to accept the truth from whoever speaks it, and to be fair even with our most vicious enemies. If we can benefit from a scholar of the Mu’tazlia, a sect who nearly beat Imam Ahmad to death, there is nothing to prevent the three Sunni schools from fruitful scholarly engagement or cooperative charitable work.<\/p>\n<p>Islam has limits and borders, but its tent is wider than some people imagine. The leading Athari scholars, following the moral example of the Salaf, were inclined to acknowledge the good in other Muslims, to disagree respectfully, even passionately, all while giving excuses to each other whenever possible.<\/p>\n<p>Al-Hasan al-Basri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا أَهْلَ السُّنَّةِ تَرَفَّقُوا رَحِمَكُمُ اللَّهُ فَإِنَّكُمْ مِنْ أَقَلِّ النَّاسِ<\/p>\n<p>O people of the Sunnah! Be gentle with each other, may Allah have mercy on you, for you are surely in the minority of people.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/19\/hasan-ahl-al-sunnah-gentle\/\">Sharḥ Uṣūl Iʻtiqād Ahl al-Sunnah 15<\/a><\/p><\/blockquote>\n<p>Abu Qilabah, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا بَلَغَكَ عَنْ أَخِيكَ شَيْءٌ تَكْرَهُهُ فَالْتَمِسْ لَهُ الْعُذْرَ جَهْدَكَ فَإِنْ لَمْ تَجِدْ لَهُ عُذْرًا فَقُلْ فِي نَفْسِكَ لَعَلَّ لأَخِي عُذْرًا لا أَعْلَمُهُ<\/p>\n<p>If you hear something about your brother that you dislike, then make an effort to obtain an excuse for him. If you do not find an excuse, then say to yourself, ‘Perhaps my brother has an excuse I do not know.’<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/09\/30\/excuse-brother-do-not-know\/\">Ḥilyat al-Awliyā’ 2\/285<\/a><\/p><\/blockquote>\n<p>And Imam al-Dhahabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلْيَعْذُر مَنْ تَأَوَّلَ بَعْضَ الصِّفَاتِ وَأَمَّا السَّلَفُ فَمَا خَاضُوا فِي التَّأْوِيْلِ بَلْ آمَنُوا وَكَفُّوا وَفَوَّضُوا عِلمَ ذَلِكَ إِلَى اللهِ وَرَسُوْلِه وَلَوْ أَنَّ كُلَّ مَنْ أَخْطَأَ فِي اجْتِهَادِهِ &#8211; مَعَ صِحَّةِ إِيْمَانِهِ وَتَوَخِّيْهِ لاتِّبَاعِ الحَقِّ أَهْدَرْنَاهُ وَبَدَّعنَاهُ لَقَلَّ مَنْ يَسلَمُ مِنَ الأَئِمَّةِ مَعَنَا رَحِمَ اللهُ الجَمِيْعَ بِمَنِّهِ وَكَرَمِهِ<\/p>\n<p>Thus, excuse those who misinterpret some of the divine attributes. As for the Salaf, they did not delve into such interpretations, but rather they had faith, were restrained, and left that knowledge to Allah and His Messenger. If everyone who made a mistake in their reasoning were to be shunned and labeled as heretics, despite the soundness of their faith and desire to follow the truth, few of the Imams would be safe with us. May Allah have mercy on them all by His grace and generosity!<\/p>\n<p>Source: Siyar A&#8217;lām al-Nubalā&#8217; 14\/374<\/p><\/blockquote>\n<p>In sum, the Athari creed and methodology are the most authentic and consistent representations of the Sunnah and the way of the Salaf. That said, there are legitimate differences among Sunni scholars in their interpretations of specific revealed texts concerning the divine attributes. These disagreements can be debated in good faith, but should be tolerated, so long as no one crosses the boundaries into clear misguidance or heresy.<\/p>\n<p>The best of the Ashʿari and Maturidi scholars strove valiantly to protect the religion against the excesses of philosophical sophistry and irrational sectarianism. Their efforts deserve gratitude, not hostility. At the same time, some of their followers departed from that balanced precedent, relying too heavily on Greek metaphysical frameworks or indulging in unwarranted speculative metaphor.<\/p>\n<p>In our times, it is essential to return to the foundations of Islam: the Quran, the Sunnah, and the understanding of the righteous predecessors — with clarity, fairness, and mercy. Muslims must uphold intellectual and theological integrity without falling into destructive, irresponsible polemics.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The Ash&#8217;aris and Maturidis are not excluded from the ranks of Muslims except by someone who is ignorant&#8230;&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[280],"tags":[21,39,43,48,50,54,55,93,91,72],"class_list":["post-25356","post","type-post","status-publish","format-standard","hentry","category-faith-iman","tag-creed-aqidah","tag-imam-ahmad-ibn-hanbal","tag-imam-malik","tag-justice-adl","tag-knowledge","tag-mercy-al-rahmah","tag-methodology-al-minhaj","tag-moderation-al-wasitiyyah","tag-righteous-predecessors-al-salaf-al-salih","tag-truthfulness-al-sidq"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6AY","jetpack-related-posts":[{"id":15820,"url":"https:\/\/www.abuaminaelias.com\/how-many-rakaat-of-taraweeh-prayer-in-ramadan\/","url_meta":{"origin":25356,"position":0},"title":"How many raka’at of Taraweeh prayer in Ramadan?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The majority of scholars maintain that night prayer in Ramadan consists of twenty bowings and others said that is consists of eleven, thirteen, or thirty six bowings.\"","rel":"","context":"In &quot;Worship عبادة&quot;","block_context":{"text":"Worship عبادة","link":"https:\/\/www.abuaminaelias.com\/category\/worship-ibadah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20861,"url":"https:\/\/www.abuaminaelias.com\/does-allah-exist-in-a-place\/","url_meta":{"origin":25356,"position":1},"title":"Does Allah exist in a place? A man in the sky?","author":"Abu Amina Elias","date":"August 29, 2019","format":false,"excerpt":"\"There is nothing like Him, for He is the Hearing, the Seeing.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":25318,"url":"https:\/\/www.abuaminaelias.com\/manhaj-of-the-salaf\/","url_meta":{"origin":25356,"position":2},"title":"Following the Way of the Salaf","author":"Abu Amina Elias","date":"May 30, 2025","format":false,"excerpt":"\"The best people are those of my generation, then those who come after them...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":25356,"position":3},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15301,"url":"https:\/\/www.abuaminaelias.com\/all-good-manners-from-four-prophetic-hadith\/","url_meta":{"origin":25356,"position":4},"title":"All good manners from four Prophetic Hadith","author":"Abu Amina Elias","date":"January 23, 2014","format":false,"excerpt":"\"Verily, from the perfection of Islam is that a person leaves what does not concern him.\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":23706,"url":"https:\/\/www.abuaminaelias.com\/al-sawad-al-azam\/","url_meta":{"origin":25356,"position":5},"title":"Follow the great majority of Muslims today?","author":"Abu Amina Elias","date":"November 15, 2021","format":false,"excerpt":"\"The united community is only the one that conforms to the obedience of Allah,\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25356","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=25356"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25356\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=25356"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=25356"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=25356"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}