{"id":25452,"date":"2025-06-26T18:50:18","date_gmt":"2025-06-26T14:50:18","guid":{"rendered":"https:\/\/www.abuaminaelias.com\/?p=25452"},"modified":"2025-07-10T11:24:25","modified_gmt":"2025-07-10T07:24:25","slug":"jihad-war-peace-in-islam","status":"publish","type":"post","link":"https:\/\/www.abuaminaelias.com\/jihad-war-peace-in-islam\/","title":{"rendered":"Jihad, War, and Peace in Islam"},"content":{"rendered":"<p><em>In the Name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Jihad is a broad concept in Islam that includes all types of ‘striving’ for the sake of Allah, whether in acts of worship, charity, or purification of the heart. In terms of the Law, jihad is the technical term for the rules of ‘just war.&#8217; It cannot be properly translated as ‘holy war,’ since no such descriptions were used by any Muslim scholars.<\/p>\n<p>War is never &#8216;holy&#8217; in itself. It is only either justified by necessity, or unjustified as an act of oppression. In contrast, peace is the aim of just war in Islam and is a fundamental virtue embedded all throughout Islamic teachings.<\/p>\n<p>Imam Ibn al-Qayyim categorized jihad into four types:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادِ النَّفْسِ وَجِهَادِ الشَّيْطَانِ وَجِهَادِ الْكُفَّارِ وَالْمُنَافِقِين<\/p>\n<p>Jihad against the ego, jihad against Satan, and jihad against unbelievers and hypocrites.<\/p>\n<p>Source: Zād al-Ma’ād 3\/9<\/p><\/blockquote>\n<p>The first two types are against the evil inclinations of the human soul and the dark whisperings of Satan, which are present within every human being. These are purely spiritual struggles that do not involve any fighting or violence. Even jihad against the hypocrites usually does not include warfare, but rather penning refutations against their distortions of Islam.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Non-Military Jihad<\/strong><\/span><\/p>\n<p>The Quran, the Sunnah, the statements of the Salaf, and prominent scholars confirm many acts of jihad do not involve military service, often emphasizing the personal jihad of spiritual purification over war against hostile nations.<\/p>\n<p>The Prophet ﷺ explicitly taught his Companions that any ‘striving in the way of Allah’ is like an act of jihad, but striving out of greed for worldly possessions is ‘the way of Satan.’<\/p>\n<p>Abu Huraira reported: We were sitting with the Messenger of Allah, peace and blessings be upon him, when a young man approached us. When we saw him, we said, “If only this young man had given his youth and effort and strength in the path of Allah!” The Prophet heard our conversation, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا سَبِيلُ اللَّهِ إِلا مَنْ قَتَلَ مَنْ سَعَى عَلَى وَالِدَيْهِ فَفِي سَبِيلِ اللَّهِ وَمَنْ سَعَى عَلَى عِيَالِهِ فَفِي سَبِيلِ اللَّهِ وَمَنْ سَعَى عَلَى نَفْسِهِ لِيُعِفَّهَا فَفِي سَبِيلِ اللَّهِ وَمَنْ سَعَى عَلَى التَّكَاثُرِ فَهُوَ فِي سَبِيلِ الشَّيْطَانِ<\/p>\n<p><strong>Is there nothing in the path of Allah but fighting? Whoever strives for his parents is in the way of Allah. Whoever strives for his family is in the way of Allah. Whoever strives for himself to be independent is in the way of Allah. Whoever strives to gain many possessions for himself is in the way of Satan.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 17824, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/02\/09\/nothing-in-jihad-but-qital\/\"><em>Jayyid<\/em><\/a><\/p><\/blockquote>\n<p>The jihad against the lower-self, or ego (<em>nafs<\/em>), is an &#8216;individual obligation&#8217; (<em>fard al-&#8216;ayn<\/em>) as opposed to the &#8216;communal obligation&#8217; (<em>fard al-kifayah<\/em>) of military service, despite the pressing need to protect Muslims from invaders and tyrants. Every single Muslim is responsible for restraining their evil impulses at all times, either on or off the battlefield.<\/p>\n<p>Fadalah ibn ‘Ubayd reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُجَاهِدُ مَنْ جَاهَدَ نَفْسَهُ<\/p>\n<p><strong>The one who strives in jihad is the one who strives against himself.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1621, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/13\/mujahid-jihad-against-his-soul\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ الشَّدِيدُ مَنْ غَلَبَ النَّاسَ وَلَكِنَّ الشَّدِيدَ مَنْ غَلَبَ نَفْسَهُ<\/p>\n<p><strong>The strong are not those who defeat people. Rather, the strong are those who defeat their own ego.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 717, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/06\/14\/jihad-al-nafs\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Imam Ibn ‘Abdul Barr commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَفِي هَذَا دَلِيلٌ عَلَى أَنَّ مُجَاهَدَةَ النَّفْسِ أَصْعَبُ مَرَامًا وَأَفْضَلُ مِنْ مُجَاهَدَةِ الْعَدُوِّ<\/p>\n<p>This is evidence that striving against oneself is a more difficult task and is better than striving against the enemy.<\/p>\n<p>Source: al-Tamhīd 6\/323<\/p><\/blockquote>\n<p>The spiritual jihad is more important than the physical jihad because one must know and implement the faith-based moral values of Islam before setting out on the battlefield to defend them. After all, how can you fight for Islam if you do not understand or apply it?<\/p>\n<p>Imam Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ جِهَادُ النَّفْسِ مُقَدَّمًا عَلَى جِهَادِ الْعَدُوِّ فِي الْخَارِجِ وَأَصْلًا لَهُ فَإِنَّهُ مَا لَمْ يُجَاهِدْ نَفْسَهُ أَوَّلًا لِتَفْعَلَ مَا أُمِرَتْ بِهِ وَتَتْرُكَ مَا نُهِيَتْ عَنْهُ وَيُحَارِبُهَا فِي اللَّهِ لَمْ يُمْكِنْهُ جِهَادُ عَدُوِّهِ فِي الْخَارِجِ فَكَيْفَ يُمْكِنُهُ جِهَادُ عَدُوِّهِ وَالِانْتِصَافُ مِنْهُ وَعَدُوُّهُ الَّذِي بَيْنَ جَنْبَيْهِ قَاهِرٌ لَهُ مُتَسَلِّطٌ عَلَيْهِ لَمْ يُجَاهِدْهُ وَلَمْ يُحَارِبْهُ فِي اللَّهِ بَلْ لَا يُمْكِنُهُ الْخُرُوجُ إِلَى عَدُوِّهِ حَتّى يُجَاهِدَ نَفْسَهُ عَلَى الْخُرُوجِ<\/p>\n<p>Jihad against the lower-self precedes jihad against external enemies and is the basis for it. Indeed, if one does not strive against himself first to do what he has been commanded and avoid what he has been forbidden and to wage war against it for the sake of Allah, one cannot possibly strive against external enemies. How can one strive against his enemies and be just if his enemy within has overpowered him, dominated him, and he did not strive or wage war against it for the sake of Allah? Rather, he cannot go out against his enemies unless he gives precedence to striving against himself.<\/p>\n<p>Source: Zād al-Ma’ād 3\/6<\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah confirms this principle:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادُ النَّفْسِ وَالْهَوَى أَصْلُ جِهَادِ الْكُفَّارِ وَالْمُنَافِقِينَ فَإِنَّهُ لَا يَقْدِرُ عَلَى جِهَادِهِمْ حَتَّى يُجَاهِدَ نَفْسَهُ وَهَوَاهُ أَوَّلًا حَتَّى يَخْرُجَ إلَيْهِمْ<\/p>\n<p>Jihad against one’s ego and whims is the basis of jihad against the unbelievers and hypocrites. One will not be able to fight them until he first struggles against his ego and whims, until he can march against them.<\/p>\n<p>Source: Rawḍat al-Muḥibbīn 1\/478<\/p><\/blockquote>\n<p>For this reason, some scholars classified the spiritual jihad as the ‘greater jihad’ and physical jihad as the ‘lesser jihad.’ They would refer to the spiritual jihad as <em>mujahadah<\/em> to distinguish it from the <em>jihad<\/em> of just war.<\/p>\n<p>Ibrahim ibn Abi ‘Alqamah, the early scholar of Medina, used to say when his people returned from the battlefield:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جَاءُوا مِنَ الْغَزْوِ قَدْ جِئْتُمْ مِنَ الْجِهَادِ الْأَصْغَرِ فَمَا فَعَلْتُمْ فِي الْجِهَادِ الْأَكْبَرِ<\/p>\n<p>You have come from the lesser jihad. What have you done in the greater jihad?<\/p><\/blockquote>\n<p>They asked, “What is the greater jihad?” Ibrahim said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادُ الْقَلْبِ<\/p>\n<p>Jihad of the heart.<\/p><\/blockquote>\n<p>Imam Ibn Rajab commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَهَذَا فِي جِهَادِ الْعَدُوِّ الظَّاهِرِ وَهُوَ جِهَادُ الْكُفَّارِ وَكَذَلِكَ جِهَادُ الْعَدُوِّ الْبَاطِنِ هُوَ جِهَادُ النَّفْسِ وَالْهَوَى فَإِنَّ جِهَادَهُمَا مِنْ أَعْظَمِ الْجِهَادِ<\/p>\n<p>Courage is to be patient for a time. This is the jihad against outward enemies, which is jihad against unbelievers. Likewise, is the jihad against inward enemies, which is the jihad against the ego and lowly desires. Indeed, this is the greater of the two jihads.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/15\/lesser-greater-jihad-al-nafs\/\">Jāmi’ al-‘Ulūm wal-Ḥikam 1\/489<\/a><\/p><\/blockquote>\n<p>A similar narration was attributed directly to the Prophet ﷺ by Imam al-Bayhaqi, although he noted it has a weak chain of authorities. The saying of Ibrahim was likely confused as a Hadith by later narrators. Some scholars are understandably skeptical of this weak Hadith because they do not want to belittle the importance of military strength against tyranny.<\/p>\n<p>Nevertheless, the primacy of the spiritual jihad is confirmed by the Sunnah, the statements of the Salaf, and prominent scholars, even those who rejected the weak Hadith about the ‘greater jihad.’<\/p>\n<p>Abu Darda reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُنَبِّئُكُمْ بِخَيْرِ أَعْمَالِكُمْ وَأَزْكَاهَا عِنْدَ مَلِيكِكُمْ وَأَرْفَعِهَا فِي دَرَجَاتِكُمْ وَخَيْرٌ لَكُمْ مِنْ إِنْفَاقِ الذَّهَبِ وَالْوَرِقِ وَخَيْرٌ لَكُمْ مِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَضْرِبُوا أَعْنَاقَهُمْ وَيَضْرِبُوا أَعْنَاقَكُمْ<\/p>\n<p><strong>Shall I not tell you of the best of your deeds, which is the purest to your King, which raises you among your ranks, which is better for you than spending gold and money in charity, and which is better for you than meeting your enemy and striking the necks of each other?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course!” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذِكْرُ اللَّهِ تَعَالَى<\/p>\n<p><strong>It is the remembrance of Allah Almighty.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3377, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/29\/dhikr-better-than-jihad-qital\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Mas’ud, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَأَنْ أُسَبِّحَ تَسْبِيحَاتٍ أَحَبُّ إِلَيَّ مِنْ أَنْ أُنْفِقَ عَدَدَهُنَّ دَنَانِيرَ فِي سَبِيلِ اللهِ<\/p>\n<p>That I declare the glory of Allah many times is more beloved to me than spending the same number of coins in the cause of Allah.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/23\/ibn-masud-dhikr-more-beloved\/\">Shu’ab al-Imān lil-Bayhaqī 659<\/a><\/p><\/blockquote>\n<p>It was said to Abdullah ibn Amr, may Allah be pleased with him, “What do you say about jihad and military campaigns?” Abdullah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ابْدَأْ بِنَفْسِكَ فَجَاهِدْهَا وَابْدَأْ بِنَفْسِكَ فَاغْزُهَا<\/p>\n<p>Begin with your soul and wage jihad against it. Begin with your soul and wage a military campaign against it.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/03\/20\/abdullah-ibn-amr-jihad-al-nafs\/\">Muḥāsabat al-Nafs 62<\/a><\/p><\/blockquote>\n<p>The Caliph ‘Umar ibn ‘Abdul ‘Aziz, may Allah have mercy on him, who himself commanded armies, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْضَلُ الْجِهَادِ جِهَادُ الْهَوَى<\/p>\n<p>The best jihad is the jihad against whims.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/06\/18\/umar-ii-jihad-whims\/\">al-Ādāb al-Shar’īyah 3\/131<\/a><\/p><\/blockquote>\n<p>Sufyan al-Tharwri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَشْجَعُ النَّاسِ أَشَدُّهُمْ مِنْ الْهَوَى امْتِنَاعًا<\/p>\n<p>The most courageous of people are the strongest in controlling their whims.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/06\/18\/umar-ii-jihad-whims\/\">al-Ādāb al-Shar’īyah 3\/131<\/a><\/p><\/blockquote>\n<p>It was said to Al-Hasan al-Basri, may Allah have mercy on him, “Which jihad is best?” Al-Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِهَادُك هَوَاك<\/p>\n<p>Your jihad against your desires.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/01\/27\/hasan-jihad-al-nafs\/\">Rawḍat al-Muḥibbīn 1\/478<\/a><\/p><\/blockquote>\n<p>And Al-Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الْعَبْدَ لَيُجَاهِدُ فِي اللَّهِ حَقَّ جِهَادِهِ وَمَا ضَرَبَ بِسَيْفٍ<\/p>\n<p>Verily, the servant may wage jihad for the sake of Allah, jihad as is due to Him, without ever striking anything with a sword.<\/p>\n<p>Source: Tafsīr Ibn Abī Ḥātim 29:6<\/p><\/blockquote>\n<p>And Al-Hasan said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَيْسَ عَدُوُّكَ الَّذِي إِنْ قَتَلْتَهُ اسْتَرَحْتَ مِنْهُ وَلَكِنَّ عَدُوَّكَ نَفْسُكَ الَّتِي بَيْنَ جَنْبَيْكَ<\/p>\n<p>Your enemy is not the one you are relieved from if you killed him. Rather, your true enemy is your own soul, between your two sides.<\/p><\/blockquote>\n<p>Imam al-Tabari commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هُوَ جِهَادُ أَعْدَى الْأَعْدَاءِ لِلْمَرْءِ وَذَلِكَ لَا شَكَّ أَعْظَمُ أَجْرًا عِنْدَ اللَّهِ مِنْ جِهَادِ أَهْلِ الشِّرْكِ<\/p>\n<p>It is the jihad against the greatest of enemies to a man. There is no doubt that it is greater in reward to Allah than the jihad against the people of idolatry.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/08\/09\/jihad-greatest-enemy-nafs\/\">Tahdhīb al-Āthār Musnad ‘Umar 2\/812<\/a><\/p><\/blockquote>\n<p>Imam Ibn al-Jawzi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تأملت جهاد النفس فرأيته أعظم الجهاد ورأيت خلقًا من العلماء والزهاد لا يفهمون معناه لأن فيهم من منعها حظوظها على الإطلاق<\/p>\n<p>I reflected on the jihad against the ego and I saw that it was the greatest jihad. Yet, I saw groups of scholars and ascetics not understanding its meaning, as among them are those who prohibit its good fortunes completely.<\/p>\n<p>Source: Ṣayd al-Khāṭir 1\/80<\/p><\/blockquote>\n<p>Since moral and spiritual education is a prerequisite to engaging in combat, Allah commands the believers to allow a dedicated group of scholars to stay behind the frontlines and preserve the values of Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا كَانَ ٱلْمُؤْمِنُونَ لِيَنفِرُوا۟ كَآفَّةًۭ فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍۢ مِّنْهُمْ طَآئِفَةٌۭ لِّيَتَفَقَّهُوا۟ فِى ٱلدِّينِ وَلِيُنذِرُوا۟ قَوْمَهُمْ إِذَا رَجَعُوٓا۟ إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ<\/p>\n<p><strong>It not necessary for the believers to march forth all at once. Only a party from each group should march forth, leaving the rest to gain religious knowledge then enlighten their people when they return to them, so that they too may beware of evil.<\/strong><\/p>\n<p>Surat al-Tawbah 9:122<\/p><\/blockquote>\n<p>In the ‘fog of war,’ people become impulsive, emotive, and carried away by their fear or rage, to the point that Muslims might transgress the objectives and laws of just war, especially if they are ignorant of Islam’s rules of engagement.<\/p>\n<p>Hence, scholars, preachers, and educators are tasked with the heavy responsibility of teaching Muslim soldiers about the moral values of Islam, conditions when war is appropriate, what actions are permissible in the rules of engagement, and warning them to refrain from indulging their worst impulses for wrath and bloodlust.<\/p>\n<p>Aside from the spiritual jihad, more acts of jihad do not involve warfare, such as charity, building mosques, and speaking truth to power. These deeds are considered ‘jihad’ due to the intense effort, and sometimes danger, needed to accomplish them.<\/p>\n<p>Aisha reported: I said, “O Messenger of Allah, is jihad a duty upon women?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ الْحَجُّ وَالْعُمْرَةُ<\/p>\n<p><strong>Yes, jihad is a duty upon them in which there is no fighting: the Hajj and ‘Umrah pilgrimages.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2901, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/06\/03\/jihad-no-war-combat-killing\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>One who lends effort to the widows and the poor is like one waging jihad in the way of Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5353, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/22\/helping-poor-jihad-fi-sabil-allah\/\"><strong><em>Muttafaqun Alayhi <\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ دَخَلَ مَسْجِدَنَا هَذَا لِيَتَعَلَّمَ خَيْرًا أَوْ يُعَلِّمَهُ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>Whoever enters our mosque to teach goodness, or to learn it himself, is like one waging jihad in the way of Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 87, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/12\/masjid-learning-jihad\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْضَلُ الْجِهَادِ مَنْ بَنَى مَسْجِدًا يُعَلِّمُ فِيهِ الْقُرْآنَ وَالْفِقْهَ وَالسُّنَّةَ<\/p>\n<p>The best jihad is to build a mosque and to teach the Quran, the Sunnah, and religious understanding therein.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/08\/14\/al-qurtubi-best-jihad-masjid\/\">Tafsīr al-Qurṭubī 9:122<\/a><\/p><\/blockquote>\n<p>Abu Sa’id al-Khudri reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْظَمِ الْجِهَادِ كَلِمَةَ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ<\/p>\n<p><strong>Verily, among the greatest acts of jihad is a word of justice before a tyrannical ruler.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2174, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/13\/greatest-jihad-word-haqq-truth\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>All of these texts are types of jihad from the perspective of Islamic moral and spiritual teachings, but in the legal texts, <em>jihad<\/em> almost exclusively means fighting to defend Islam and depose unbelieving tyrants who persecute Muslims in their lands.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Jihad as Just War<\/strong><\/span><\/p>\n<p>The primary goal of jihad as a &#8216;just war&#8217; is to protect the safety of Muslim countries, save Muslims persecuted in foreign lands, and remove tyrants who outlaw the peaceful practice of Islam. It is not a tool of religious compulsion or forced conversion, nor is it a means of advancing purely political, ideological, or worldly gains.<\/p>\n<p>The Prophet ﷺ received his first divine revelations in Mecca, and he preached the message of Islam to the Meccans peacefully for thirteen years. However, an intolerable level of oppression eventually forced him and his followers to flee to the nearby town of Yathrib, later known as Medina. This emigration marked the new ‘Medinan phase’ of his mission, in which verses were revealed permitting and then ordering just war.<\/p>\n<p>Despite fleeing from Mecca, the Quraysh aristocracy vowed to exterminate the newly formed religious community in Medina. They wrote a threatening letter to the Prophet’s ﷺ new allies, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّكُمْ آوَيْتُمْ صَاحِبَنَا وَإِنَّا نُقْسِمُ بِاللَّهِ لَتُقَاتِلُنَّهُ أَوْ لَتُخْرِجُنَّهُ أَوْ لَنَسِيرَنَّ إِلَيْكُمْ بِأَجْمَعِنَا حَتَّى نَقْتُلَ مُقَاتِلَتَكُمْ وَنَسْتَبِيحَ نِسَاءَكُمْ<\/p>\n<p>You have given protection to our companion. We swear by Allah, you must fight him or exile him, or else we will come at you in full force. We will kill your fighting men and take your women.<\/p>\n<p>Source: Sunan Abī Dāwūd 3004, Grade: <strong><em>Sahih<\/em><\/strong><\/p><\/blockquote>\n<p>The idolaters of Mecca had initiated the war against the Muslims, not the other way around. The Prophet ﷺ never wanted to go to war with them or anyone else.<\/p>\n<p>Al-Bara’ reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْلَا أَنْتَ مَا اهْتَدَيْنَا وَلَا تَصَدَّقْنَا وَلَا صَلَّيْنَا فَأَنْزِل السَكِينَةً عَلَيْنَا وَثَبِّتِ الْأَقْدَامَ إِنْ لَاقَيْنَا إِنَّ الْأُلَى قَدْ بَغَوْا عَلَيْنَا إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا<\/p>\n<p><strong>O Allah, had You not guided us, we would not have given charity or performed prayer. Send tranquility upon us and make our stance firm if we encounter the enemy. Verily, they were the first to transgress against us. If they intend persecution, we have refused.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3034, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/01\/01\/fitnah-first-to-transgress-us\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam al-Biqa’i commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ففيه إشعار لهذه الأمة بأن لا تطلب الحرب ابتداء وإنما تدافع عن منعها من إقامة دينها &#8230; فحق المؤمن أن يأبى الحرب ولا يطلبه<\/p>\n<p>In this is a notification to this nation that it should not seek war in the first place. Indeed, it only defends itself from those who obstruct the establishment of its religion… Thus, it is a duty upon the believer to refuse war and not to seek it.<\/p>\n<p>Source: Naẓm al-Durar fī Tanāsub al-Āyāt wal-Suwar 3\/406<\/p><\/blockquote>\n<p>In this context, Allah revealed verses permitting warfare in self-defense:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُذِنَ لِلَّذِينَ يُقَـٰتَلُونَ بِأَنَّهُمْ ظُلِمُوا۟ وَإِنَّ ٱللَّهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ ٱلَّذِينَ أُخْرِجُوا۟ مِن دِيَـٰرِهِم بِغَيْرِ حَقٍّ إِلَّآ أَن يَقُولُوا۟ رَبُّنَا ٱللَّهُ ٱلَّذِينَ أُخْرِجُوا۟ مِن دِيَـٰرِهِم بِغَيْرِ حَقٍّ إِلَّآ أَن يَقُولُوا۟ رَبُّنَا ٱللَّهُ وَلَوْلَا دَفْعُ ٱللَّهِ ٱلنَّاسَ بَعْضَهُم بِبَعْضٍۢ لَّهُدِّمَتْ صَوَٰمِعُ وَبِيَعٌۭ وَصَلَوَٰتٌۭ وَمَسَـٰجِدُ يُذْكَرُ فِيهَا ٱسْمُ ٱللَّهِ كَثِيرًۭا وَلَيَنصُرَنَّ ٱللَّهُ مَن يَنصُرُهُۥٓ إِنَّ ٱللَّهَ لَقَوِىٌّ عَزِيزٌ<\/p>\n<p><strong>Permission to fight back is hereby granted to those being fought, for they have been wronged. And Allah is truly Most Capable of helping them prevail. They are those who have been expelled from their homes for no reason other than proclaiming, &#8216;Our Lord is Allah.&#8217; Had Allah not repelled the aggression of some people by means of others, destruction would have surely claimed monasteries, churches, synagogues, and mosques in which Allah’s Name is often mentioned. Allah will certainly help those who stand up for Him. Allah is truly All-Powerful, Almighty.<\/strong><\/p>\n<p>Surat al-Hajj 22:39-40<\/p><\/blockquote>\n<p>Imam Ibn Kathir, and many of the early Muslim authorities, considered this to be the first verse to be revealed permitting warfare in self-defense:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقال غير واحد من السلف هذه أول آية نزلت في الجهاد<\/p>\n<p>More than one of the righteous predecessors said this was the first verse revealed about jihad.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 5\/433<\/p><\/blockquote>\n<p>The first principle of just war to be established is that non-aggression is the general rule, but retaliation is permissible if necessary to resolve an unbearable injustice. Muslims were now allowed to fight back as a direct response to their aggression, whereas previously they had been told to remain patient.<\/p>\n<p>This verse also establishes an inherent right of individuals to defend themselves if they are unjustly attacked in their places of worship. Such places are considered safe zones as long as their occupants stay out of the fighting.<\/p>\n<p>The righteous Caliph Abu Bakr, may Allah be pleased with him, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا لَا يُقْتَلُ الرَّاهِبُ فِي الصَّوْمَعَةِ<\/p>\n<p>No doubt, the monk in his monastery may not be killed.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/12\/20\/no-harm-monks-temples\/\">Muṣannaf Ibn Abī Shaybah 33127<\/a><\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالْجُمْهُورُ يَقُولُونَ لَا يُقْتَلُ إلَّا مَنْ كَانَ مِنْ الْمُعَاوِنِينَ لَهُمْ عَلَى الْقِتَالِ فِي الْجُمْلَةِ وَإِلَّا كَانَ كَالنِّسَاءِ وَالصِّبْيَانِ<\/p>\n<p>The majority of scholars say monks are not killed during war, unless they are among those who assist in fighting in its entirety. Otherwise, they are immune like women and children.<\/p>\n<p>Majmū&#8217; al-Fatāwá 28\/660<\/p><\/blockquote>\n<p>The Quraysh ramped up their efforts to kill the Prophet ﷺ and wipe out the Muslims, as in the battles of Badr and Uhud, so another verse was revealed to command fighting back while reinforcing the principle of non-aggression.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَـٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ ٱلَّذِينَ يُقَـٰتِلُونَكُمْ وَلَا تَعْتَدُوٓا۟ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُعْتَدِينَ<\/p>\n<p><strong>Fight in the way of Allah those who fight you, but do not transgress. Verily, Allah does not love transgressors.<\/strong><\/p>\n<p>Surat al-Baqarah 2:190<\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلا تَعْتَدُوا يعني لَا تَقْتُلُوا النِّسَاءَ وَالصِّبْيَانَ وَالشَّيْخَ الْكَبِيرَ وَلا مَنْ أَلْقَى السَّلَمَ، وَكَفَّ يَدَهُ فَإِنْ فَعَلْتُمْ هَذَا فَقَدِ اعْتَدَيْتُمْ<\/p>\n<p>‘<strong>Do not transgress<\/strong>,’ means do not kill women, children, old men, or whoever offers you peace and restrains his hand from fighting, for if you did so, you would have certainly transgressed.<\/p>\n<p>Source: Tafsīr Ibn Abī Ḥātim 1\/325<\/p><\/blockquote>\n<p>The Caliph ‘Umar ibn ‘Abdul ‘Aziz interpreted the protected classes in the Quran consistently with the legal category of ‘civilians’ today:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ذلك في النساءِ والذُّرِّيةِ ومن لمْ يَنْصِبْ لك الحربَ منهم<\/p>\n<p>This verse is regarding women, children, and whoever among them is not waging war against you.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 3\/290<\/p><\/blockquote>\n<p>And Shaykh Wahbah al-Zuhayli commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ولا تعتدوا بالبدء بالقتال ولا بقتل المسالمين ولا بقتل غير المقاتلة من النساء والصبيان والعجزة والشيوخ ولا بتخريب الدور وقطع الأشجار وإحراق الزروع والثمار فإن الله يكره الاعتداء<\/p>\n<p>‘<strong>Do not transgress<\/strong>’ by initiating fighting, killing peaceful people, or killing non-combatants such as women, children, the infirm, or the elderly, nor by destroying homes, cutting down trees, or burning crops and fruits, for Allah hates aggression.<\/p>\n<p>Source: al-Tafsīr al-Munīr 2\/183<\/p><\/blockquote>\n<p>Then, Allah reminds the enemy of His mercy if they repent:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ ٱنتَهَوْا۟ فَإِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ<\/p>\n<p><strong>But if they cease, then surely Allah is All-Forgiving, Most Merciful.<\/strong><\/p>\n<p>Surat al-Baqarah 2:192<\/p><\/blockquote>\n<p>Imam Ibn ‘Ashur commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْ فَإِنِ انْتَهَوْا عَنْ قِتَالِكُمْ فَلَا تَقْتُلُوهُمْ لِأَنَّ اللَّهَ غَفُور رَحِيم فينبعي أَنْ يَكُونَ الْغُفْرَانُ سُنَّةَ الْمُؤْمِنِينَ<\/p>\n<p>If they cease their fighting, then do not fight them, for Allah is Forgiving and Merciful. Thus, there should be forgiveness as it is the way of the believers.<\/p>\n<p>Source: al-Taḥrīr wal-Tanwīr 2\/206<\/p><\/blockquote>\n<p>Then, Allah prohibits further hostility without a just cause:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّـٰلِمِينَ<\/p>\n<p><strong>But if they stop persecuting you, let there be no hostility except against the aggressors.<\/strong><\/p>\n<p>Surat al-Baqarah 2:193<\/p><\/blockquote>\n<p>Qatadah, may Allah be pleased with him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ انْتَهَوْا فَلا عُدْوَانَ إِلا عَلَى الظَّالِمِينَ أيّ لَا تُقَاتِلُوا إِلا مَنْ قَاتَلَكُمْ<\/p>\n<p>‘<strong>But if they stop persecuting you, let there be no hostility except against the aggressors<\/strong>,’ that is, you do not fight them unless they fight you.<\/p>\n<p>Source: Tafsīr Ibn Abī Ḥātim 2:193<\/p><\/blockquote>\n<p>Imam Makki ibn Abi Talib commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ومعنى فَلاَ عُدْوَانَ أي لا يُقاتَل إلا من قاتل قال الأخفش المعنى فإن انتهى بعضهم فلا عدوان إلا على الذي لم ينته وهو الظالم منهم<\/p>\n<p>The meaning of ‘<strong>let there be no hostility<\/strong>’ is that you do not fight them unless they fight you. Al-Akhfash said, ‘The meaning is if some of them stop, let there be no hostility except against those who have not stopped, for those are the oppressors among them.’<\/p>\n<p>Source: al-Hidāyah ilá Bulūgh al-Nihāyah 1\/638<\/p><\/blockquote>\n<p>Imam al-Zamakhshari commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا تَعْتَدُوا عَلَى الْمُنْتَهِينَ لِأَنَّ مُقَاتَلَةَ الْمُنْتَهِينَ عُدْوَانٌ وَظُلْمٌ &#8230; أو فلا تظلموا إلا الظالمين غير المنتهين سمى جزاء الظالمين ظلما للمشاكلة كقوله تعالى فَمَنِ اعْتَدى عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ<\/p>\n<p>So do not transgress against those who desist, for fighting those who desist is aggression and injustice&#8230; Or, do not ‘oppress’ anyone except the oppressors who do not desist. The punishment of the oppressors is called ‘oppression’ for the sake of similarity, as in the saying of the Almighty, ‘<strong>If anyone attacks you, retaliate in the same manner.<\/strong>’ (2:194)<\/p>\n<p>Source: Tafsīr al-Kashāf 1\/236<\/p><\/blockquote>\n<p>Imam al-Tibi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يعني مقاتلة المنتهين عدوان وظلم ومقاتلة الظالمين أي غير المنتهين حق وصواب وأصل الكلام فإن انتهوا عن الفتنة فلا تقاتلوهم ثم فلا عدوان عليهم ثم فلا عدوان على المنتهين<\/p>\n<p>Meaning, fighting those who desist is aggression and oppression. Fighting the oppressors, that is, those who do not desist, is right and proper. The original statement is if they desist from persecution, then do not fight them, then there is no aggression against them, and again there is no aggression against those who desist.<\/p>\n<p>Source: Futūḥ al-Ghayb fīl-Kashf &#8216;an Qinā&#8217; al-Rayb 3\/265<\/p><\/blockquote>\n<p>And Imam Ibn Kamal, the Shaykh al-Islam of the Ottoman Empire, commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أي فلا عدوانَ عليهم فأراد أن ينبِّه على قبح العدوان وأنَّه ظلم وأنَّ مقاتلةَ المنتَهِين عدوانٌ فحصَر العدوانَ في أضدادهم وسجَّل على أنَّ العدوان ظلمٌ<\/p>\n<p>That is, let there be no hostility against them, for Allah intended to point out the ugliness of aggression and that it is injustice, and that fighting those who desist is aggression. Thus, He limited aggression to their opponents and classified ‘aggression’ as injustice.<\/p>\n<p>Source: Tafsīr Ibn Kamāl Bāshā 2\/51<\/p><\/blockquote>\n<p>The phrase “do not transgress” governs both when a war may be rightly declared and the limits in which it may be conducted. The fighting ends “if they stop,” which refers to peace treaties, truces, reconciliation, and other means to end war, which are more desirable than bloodshed.<\/p>\n<p>The statements of prominent figures among the Companions and the Salaf provide clear evidence that these verses remain applicable. They did not consider them to be ‘abrogated,’ ‘nullified,’ or ‘canceled’ by later verses, contrary to what is claimed by some exegetes.<\/p>\n<p>Imam al-Tabari commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قالوا ولا شيْءَ نُسِخَ من حكمِ هذه الآيةِ<\/p>\n<p>They said nothing of the ruling in this verse has been abrogated.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 3\/290<\/p><\/blockquote>\n<p>Imam Ibn Kathir agreed that the verse is not abrogated:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وفي هذا نظر لأن قوله الَّذِينَ يُقاتِلُونَكُمْ إنما هو تهييج وإغراء بالأعداء الذين همتهم قتال الإسلام وأهله أي كما يقاتلونكم فاقتلوهم أنتم &#8230; أي لتكون همتكم منبعثة على قتالهم، كما همتهم منبعثة على قتالكم وعلى إخراجهم من بلادهم التي أخرجوكم منها قصاصا<\/p>\n<p>This opinion is in dispute because His statement <strong>‘those who fight you<\/strong>’ is only an exhortation and incitement against enemies who are engaged in fighting against Islam and its people… meaning, let your energy be spent on fighting them, just as their energy is spent on fighting you, and drive them from your lands as they drove you from their lands, as a proportional response.<\/p>\n<p>Source Tafsīr Ibn Kathīr 1\/387<\/p><\/blockquote>\n<p>Shaykh al-Islam Ibn Taymiyyah likewise agreed, as did the majority of scholars:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْتُ هَذَا القَوْلُ يعني الآية ليست منسوخة هُوَ قَوْلُ جُمْهُورِ العُلَمَاء وَهُوَ مَذْهَبُ مَالِكٍ وأَحْمَدَ بنِ حَنْبَلٍ وَغَيرِهِمْ والقَوْلُ الأَوْلُ ضَعِيفٌ فَإِنَّ دَعْوَى النَّسْخَ يَحْتَاجُ إِلَى دَلِيلٍ وَلَيسَ فِي القُرْآنِ مَا يُنَاقِض هَذِهِ الآيَة<\/p>\n<p>I say: This opinion that the verse is not abrogated is the view of the majority of scholars. It is the way of Malik, Ahmad ibn Hanbal, and others. The other opinion is weak. Indeed, to claim abrogation requires proof and there is nothing in the Quran to contradict this verse.<\/p>\n<p>Source: Qā’idah Mukhtaṣarah fī Qitāl al-Kuffār 1\/101<\/p><\/blockquote>\n<p>The desire for reconciliation with his enemies, and warning himself against transgression, was engraved on the Prophet’s ﷺ swords as a reminder every time he was forced to go into battle against those who desperately wanted to kill him and his friends.<\/p>\n<p>Ali ibn Abi Talib reported: When the weapon of the Prophet, peace and blessings be upon him, had been assembled, I found three sayings on the handle or blade of his sword:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">صِلْ مَنْ قَطَعَكَ وَقُلِ الْحَقَّ وَلَوْ عَلَى نَفْسِكَ وَأَحْسِنْ إِلَى مَنْ أَسَاءَ إِلَيْكَ<\/p>\n<p><strong>Maintain relations with those who cut you off, speak the truth even if it is against yourself, and be good to one who is evil to you.<\/strong><\/p>\n<p>Source: Mu’jam Shuyūkh Ibn al-A’rābī 1507, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/03\/10\/sword-of-the-prophet\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Aisha reported: I found an engraving on the sword of the Messenger of Allah, peace and blessings be upon him, that wrote:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَشَدَّ النَّاسِ عُتُوًّا مَنْ ضَرَبَ غَيْرَ ضَارِبِهِ وَرَجُلٌ قَتَلَ غَيْرَ قَاتِلِهِ<\/p>\n<p><strong>Verily, the worst of people in insolence are those who strike those who never struck anyone, a man who kills those who never killed anyone.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 15896, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/03\/10\/prophet-sword-condemns-unjust-war\/\">Hasan li ghayrihi<\/a><\/em><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ أَعْتَى النَّاسِ عَلَى اللَّهِ عَزَّ وَجَلَّ مَنْ قَتَلَ غَيْرَ قَاتِلِهِ<\/p>\n<p><strong>Verily, the most tyrannical of people to Allah Almighty is one who kills those who never killed anyone.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 16376, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/12\/22\/tyrant-kill-do-not-fight\/\">Hasan li ghayrihi<\/a><\/em><\/p><\/blockquote>\n<p>The default rule (<em>asl<\/em>) is that all people are considered inviolable, meaning they may not be harmed or killed unless there is a solid legal justification for doing so.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإن الأصل أن دم الآدمي معصوم لا يقتل إلا بالحق<\/p>\n<p>The foundational principle is that the blood of a human being is inviolable except by right of justice.<\/p>\n<p>Source: al-Ṣārim al-Maslūl 1\/104<\/p><\/blockquote>\n<p>For this reason, Islam strictly forbids the killing of women, children, old men, laborers, religious people seeking safety in their houses of worship, and anyone we might classify as a ‘civilian’ today.<\/p>\n<p>Ibn Umar, may Allah be pleased with him, reported:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ<\/p>\n<p>A woman was found killed in one of the battles of the Messenger of Allah, peace and blessings be upon him, so the Prophet condemned the killing of women and children.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3014, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/jihad-killing-women-children\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Caliph Umar ibn al-Khattab, may Allah be pleased with him, decreed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا تَغُلُّوا وَلا تَغْدِرُوا وَلا تُمَثِّلُوا وَلا تَقْتُلُوا وَلِيدًا وَاتَّقُوا اللَّهَ فِي الْفَلاحِينَ الَّذِينَ لا يَنْصُبُونَ لَكُمُ الْحَرْبَ<\/p>\n<p>Do not steal the spoils, do not be treacherous with the enemy, do not mutilate the dead, do not kill children, and fear Allah regarding the farmers who do not wage war against you.<\/p>\n<p>Source: Sunan Sa’īd ibn Mansūr 2625<\/p><\/blockquote>\n<p>Imam Ibn Qudamah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَنَا قَوْلُ عُمَرَ وَأَنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَقْتُلُوهُمْ حِينَ فَتَحُوا الْبِلَادَ وَلِأَنَّهُمْ لَا يُقَاتِلُونَ فَأَشْبَهُوا الشُّيُوخَ وَالرُّهْبَانَ<\/p>\n<p>We adhere to the saying of Umar. The Companions of the Messenger of Allah did not kill farmers when they liberated the lands, because they do not fight. In this, they resemble old men and priests.<\/p>\n<p>Source: al-Mughnī 9\/313<\/p><\/blockquote>\n<p>Rabah ibn Rabi’ reported: We were with the Messenger of Allah, peace and blessings be upon him, during a military expedition. The Prophet saw some people gathered around something, so he sent a man, saying, “Go and see for what they have gathered.” The man returned and said, “It was a woman who was killed.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا كَانَتْ هَذِهِ لِتُقَاتِلَ<\/p>\n<p><strong>She was not fighting!<\/strong><\/p><\/blockquote>\n<p>Khalid ibn al-Walid was in the advanced guard, so the Prophet sent a man to him, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَقْتُلَنَّ امْرَأَةً وَلَا عَسِيفًا<\/p>\n<p><strong>Do not kill women or workers!<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2669, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/17\/jihad-haram-kill-civilians\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>This Hadith is clear evidence that it is unlawful for Muslims to target non-combatants of any kind, as the Prophet ﷺ explicitly stated the reason her killing was illegal, “She was not fighting.”<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَذَلِكَ أَنَّ اللَّهَ تَعَالَى أَبَاحَ مِنْ قَتْلِ النُّفُوسِ مَا يَحْتَاجُ إلَيْهِ فِي صَلَاحِ الْخَلْقِ<\/p>\n<p>That is because Allah Almighty only permitted taking lives to the extent it is necessary for the welfare of creation.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 28\/355<\/p><\/blockquote>\n<p>And Shaykh al-Islam writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأباح للمؤمنين القتال دفعا عن نفوسهم وعقوبة لمن أخرجهم من ديارهم ومنعهم من توحيد الله وعبادته &#8230; فمن ليس من أهل القتال لم يؤذن في قتاله<\/p>\n<p>The believers were allowed to fight in defense of their lives and to retaliate against those who drove them out of their homes and obstructed them from the Oneness of Allah and His worship&#8230; Whoever is not a combatant, it is not permissible to fight him.<\/p>\n<p>Source: al-Ṣārim al-Maslūl 1\/101<\/p><\/blockquote>\n<p>These well-established Islamic rules unequivocally outlaw military tactics known as “terrorism” today, or the use of weapons of mass destruction.<\/p>\n<p>Taking prisoners is an unfortunate but unavoidable consequence of war, yet Islam encourages good treatment of captured enemies. In accordance with Allah’s instructions, the Companions would feed their prisoners before they ate themselves.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَيُطْعِمُونَ ٱلطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًۭا وَيَتِيمًۭا وَأَسِيرًا إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ ٱللَّهِ لَا نُرِيدُ مِنكُمْ جَزَآءًۭ وَلَا شُكُورًا<\/p>\n<p><strong>They give food—despite their desire for it—to the poor, the orphan, and the captive, saying to themselves, &#8216;We feed you only for the sake of Allah, seeking neither reward nor thanks from you.&#8217;<\/strong><\/p>\n<p>Surat al-Insan 76:8-9<\/p><\/blockquote>\n<p>Qatadah, may Allah be pleased with him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ أَمَرَ اللَّهُ بِالأُسَرَاءِ أَنْ يُحْسَنَ إِلَيْهِمْ وَإِنَّ أَسْرَاهُمْ يَوْمَئِذٍ لِأَهْلُ الشِّرْكِ<\/p>\n<p>Allah had commanded good treatment with the captives, and their captives at that time were the people of idolatry.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 23\/544<\/p><\/blockquote>\n<p>Abu ‘Aziz reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَوْصُوا بِالأُسَارَى خَيْرًا<\/p>\n<p><strong>I enjoin you to treat the captives well.<\/strong><\/p><\/blockquote>\n<p>Abu ‘Aziz, who had been a prisoner of war, eventually accepted Islam due to the kindness of the Muslims:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكُنْتُ فِي نَفَرٍ مِنَ الأَنْصَارِ وَكَانُوا إِذَا قَدَّمُوا غَدَاءَهُمْ وَعَشَاءَهُمْ أَكَلُوا التَّمْرَ وَأَطْعَمُونِي الْخُبْزَ بِوَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاهُمْ<\/p>\n<p>I was among the Ansar after I accepted Islam. When lunch or dinner time arrived, I would feed dates to the prisoners, for I had been fed bread due to the Messenger of Allah’s command.<\/p>\n<p>Source: al-Mu’jam al-Kabīr lil-Ṭabarānī 22\/393, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/09\/07\/prophet-treat-prisoners-well\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Showing generosity and magnanimity towards prisoners was an essential strategy for winning hearts and minds, the true goal of Islam. Not revenge, but rather reconciliation. Not coercion, but rather conversion.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَجِبَ اللَّهُ مِنْ قَوْمٍ يَدْخُلُونَ الْجَنَّةَ فِي السَّلَاسِلِ<\/p>\n<p><strong>Allah marvels at people who enter Paradise in chains.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3010, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/10\/13\/former-enemies-embrace-islam\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Imam Ibn al-Jawzi commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَعْنَاهُ أَنَّهُمْ أُسِرُوا وَقُيِّدُوا فَلَمَّا عَرَفُوا صِحَّةَ الْإِسْلَامِ دَخَلُوا طَوْعًا فَدَخَلُوا الْجَنَّةَ<\/p>\n<p>It means they are taken prisoner and detained, but when they recognize the rightness of Islam, they embrace it willingly and enter Paradise.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/145<\/p><\/blockquote>\n<p>The harmful results of warfare are only permitted in Islam as the lesser of two evils, only if it is necessary to deter invaders, save innocent lives, end intolerable oppression, and give every human being the chance to embrace Islam without fear.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مِنَ الْمَعْلُومِ أَنَّ الْقِتَالَ إِنَّمَا شُرِعَ لِلضَّرُورَةِ وَلَوْ أَنَّ النَّاسَ آمَنُوا بِالْبُرْهَانِ وَالْآيَاتِ لَمَا احْتِيجَ إِلَى الْقِتَالِ فَبَيَانُ آيَاتِ الْإِسْلَامِ وَبَرَاهِينُهُ وَاجِبٌ مُطْلَقًا وُجُوبًا أَصْلِيًّا وَأَمَّا الْجِهَادُ فَمَشْرُوعٌ لِلضَّرُورَ<\/p>\n<p>It is well-known that fighting is only legislated due to necessity. If people were let to believe in the proofs and signs, there would be no need for fighting, for explaining the signs of Islam and its proofs is absolutely obligatory, a fundamental obligation. As for jihad, it is legislated due to necessity.<\/p>\n<p>Source: al-Jawāb al-Ṣaḥīḥ 1\/238<\/p><\/blockquote>\n<p>Shaykh al-Islam explains that inviting all human beings to accept Islam voluntarily is the first and foremost imperative. The rules of just war have been established only to protect this mission.<\/p>\n<p>As such, the Prophet ﷺ forbade Muslims from desiring to fight their enemies because war is only allowed as a last resort when all other options for peaceful resolution have been exhausted. It is not an outlet for rage, wrath, or malice, or a means to satisfy worldly desires.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">‏لاَ تَمَنَّوْا لِقَاءَ الْعَدُوِّ فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا<\/p>\n<p><strong>Do not wish to meet the enemy in battle, but if you meet them, be steadfast.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3026, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/22\/jihad-war-is-last-resort\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Imam al-Harrali commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فيه إشعار لهذه الأمة بأن لا تطلب الحرب ابتداء وإنما تدافع من منعها من إقامة دينها كما قال تعالى أذن للذين يقاتلون بأنهم ظلموا فحق المؤمن أن يأتي الحرب ولا يطلبه فإنه إن طلبه فأوتيه عجز كما عجز من طلبه من الأمم السابقة<\/p>\n<p>In this is a notification to this nation that it should not seek war in the first place, but rather defend itself against those who prevent it from establishing its religion, as Allah Almighty said, ‘<strong>Permission to fight back is granted to those being fought, for they have been wronged<\/strong>,’ (22:39). Thus, it is the duty of the believer to meet war but not to seek it.<\/p>\n<p>Source: Fayḍ al-Qadīr 6\/399<\/p><\/blockquote>\n<p>Unlike other strictly legal texts that prohibit aggression, this Hadith delves deeper into the heart. Muslims must not allow bloodlust to be their motivation in jihad, nor concoct flimsy excuses to declare an unjust war of choice.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ بَابَ الْإِحْسَانِ إِلَى النَّاسِ وَالْعَفْوِ عَنْهُمْ مُقَدَّمٌ عَلَى بَابِ الْإِسَاءَةِ وَالِانْتِقَامِ<\/p>\n<p>For the way of treating people well and pardoning them takes precedence over the way of abuse and revenge.<\/p>\n<p>Source: Minhāj al-Sunnah 4\/372<\/p><\/blockquote>\n<p>The most crucial goal of every believer should be to come to Allah with a pure heart on the Day of Judgment, which is a heart empty of &#8216;malice&#8217; (<em>hiqd<\/em>), that is, a heart without the evil intention to harm others for no legitimate reason.<\/p>\n<p>Imam al-Ghazali writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كل عبد سلم عَن الْغِشّ والحقد والحسد وَإِرَادَة الشَّرّ قلبه وسلمت عَن الآثام والمحظورات جوارحه وَسلم عَن الانتكاس والانعكاس صِفَاته فَهُوَ الَّذِي يَأْتِي الله تَعَالَى بقلب سليم<\/p>\n<p>Every servant whose heart is free of deceit, malice, envy, and evil intentions, and is free of the prohibited sins of the limbs, and is free of the fluctuation and reversal of these characteristics, he is one who comes to Allah Almighty with a pure heart.<\/p>\n<p>Source: Al-Maqṣad al-Asná 1\/70<\/p><\/blockquote>\n<p>These ‘diseases of the heart’ can never be the reason for going to war, but Muslims can and should desire martyrdom, which is to die serving Allah in a just cause. This pure desire is entirely different from being pleased with revenge, killing, and bloodshed.<\/p>\n<p>Imam Abu al-‘Abbas al-Qurtubi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وتحريره أن تمني لقاء العدو المنهي عنه غير تمني الشهادة المرغب فيه<\/p>\n<p>To clarify, that wishing to meet the enemy, which is forbidden, is not the same as wishing for martyrdom, which is desirable.<\/p>\n<p>Source: al-Mufhim li-mā Ashkala min Talkhīṣ Ṣaḥīḥ Muslim 3\/524<\/p><\/blockquote>\n<p>However, martyrdom in Islam means much more than falling on the battlefield.<\/p>\n<p>Jabir ibn ‘Atik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الشَّهَادَةُ سَبْعٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ الْمَطْعُونُ شَهِيدٌ وَالْغَرِقُ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَصَاحِبُ الْحَرِيقِ شَهِيدٌ وَالَّذِي يَمُوتُ تَحْتَ الْهَدْمِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدٌ<\/p>\n<p><strong>There are seven martyrs besides one who is killed in the way of Allah: the victim of plague is a martyr, the one who drowns is a martyr, the one who dies of chest pain is a martyr, the one who dies of stomach infection is a martyr, the one who burns to death is a martyr, the one who dies under rubble is a martyr, and the pregnant woman who dies in labor is a martyr.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 3111, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/11\/seven-martyrs-besides-jihad\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ<\/p>\n<p><strong>Whoever honestly asks Allah for martyrdom, Allah will grant him martyrdom even if he dies in his own bed.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1909, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/04\/sincerely-asks-for-martyrdom\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Prophet ﷺ further taught us parables that convey the spirit of jihad as justice and self-defense, rather than conquest or domination. The commander-in-chief of the Muslim army is a “shield” for the Muslims.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ<\/p>\n<p><strong>Verily, the leader is only a shield behind whom they fight, and he protects them.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1841, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/04\/imam-shield\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The Companions described the face of the Prophet ﷺ like the “moon,” as opposed to a sword. That means he was gentle and inviting, forgiving and willing to reconcile, unlike the many tyrants of his day who ruled over their subjects with an iron fist.<\/p>\n<p>A man asked Al-Bara’, may Allah be pleased with him, “Was the face of the Prophet, peace and blessings be upon him, like a sword?” Al-Bara’ said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا بَلْ مِثْلَ الْقَمَرِ<\/p>\n<p>No, it was like the moon.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3552, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/24\/prophet-face-like-qamar\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>These kinds of parables do not carry weight in the legal treatises of the jurists. However, they still express a more profound meaning about the leadership of the Prophet ﷺ and the primary role of the Caliphs as guardians of Muslims worldwide. They teach Muslims about the merciful attitude of Islam, a symbolic expression of the legal principle of non-aggression.<\/p>\n<p>As for the jurists, the key question they debated was the issue of <em>casus belli<\/em> or the legal justification (<em>&#8216;illah<\/em>) for war. What conditions determine when declaring war is necessary? Are non-Muslims fought in response to their aggression (<em>hirabah<\/em>) or merely for their unbelief (<em>kufr<\/em>)?<\/p>\n<p>The majority of scholars, including Imam Abu Hanifa, Imam Malik, and Imam Ahmad, did not consider unbelief in itself as a sufficient justification for going to war.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْكَافِرِ الْأَصْلِيِّ الَّذِي لَيْسَ هُوَ مِنْ أَهْلِ الْقِتَالِ فَإِنَّهُ لَا يُقْتَلُ عِنْدَ أَكْثَرِ الْعُلَمَاءِ كَأَبِي حَنِيفَةَ وَمَالِكٍ وَأَحْمَد<\/p>\n<p>The person born as an unbeliever, who is not among the combatants, he is not killed according to most of the scholars such as Abu Hanifa, Malik, and Ahmad.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 28\/534<\/p><\/blockquote>\n<p>And Shaykh al-Islam writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فأما الباغي من غير قتال فليس في النص أن الله أمر بقتاله بل الكفار إنما يقاتلون بشرط الحراب كما ذهب اليه جمهور العلماء وكما دل عليه الكتاب والسنة<\/p>\n<p>As for the transgressor who does not fight, then there are no texts in which Allah commands him to be fought. Rather, the unbelievers are only fought on the condition that they wage war, as is practiced by the majority of scholars and as is evident in the Book and the Sunnah.<\/p>\n<p>Source: al-Nubūwāt 1\/140<\/p><\/blockquote>\n<p>Imam Ibn al-Qayyim, his most prominent student, agreed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلِأَنَّ الْقَتْلَ إِنَّمَا وَجَبَ فِي مُقَابَلَةِ الْحِرَابِ لَا فِي مُقَابَلَةِ الْكُفْرِ وَلِذَلِكَ لَا يُقْتَلُ النِّسَاءُ وَلَا الصِّبْيَانُ وَلَا الزَّمْنَى وَالْعُمْيَانُ وَلَا الرُّهْبَانُ الَّذِينَ لَا يُقَاتِلُونَ بَلْ نُقَاتِلُ مَنْ حَارَبَنَا وَهَذِهِ كَانَتْ سِيرَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَهْلِ الْأَرْضِ كَانَ يُقَاتِلُ مَنْ حَارَبَهُ إِلَى أَنْ يَدْخُلَ فِي دِينِهِ أَوْ يُهَادِنَهُ أَوْ يَدْخُلَ تَحْتَ قَهْرِهِ بِالْجِزْيَةِ<\/p>\n<p>Killing is only necessary to confront war and not to confront unbelief. For this reason, women and children are not killed, neither are the elderly, the blind, or monks who do not participate in fighting. Rather, we only fight those who wage war against us. This was the way of the Messenger of Allah with the people of the earth. He would fight those who declared war on him until they accepted his religion, or they proposed a peace treaty, or they came under his control by paying tribute.<\/p>\n<p>Source: Aḥkām ahl al-Dhimmah 1\/110<\/p><\/blockquote>\n<p>Even so, pre-emptive strikes or ‘offensive jihad’ (<em>jihad al-talab<\/em>) were permitted by scholars when a non-Muslim country was persecuting Muslims or preventing their citizens from hearing the message of Islam.<\/p>\n<p>Maintaining a strong posture against ambitious rivals was also considered a prudent measure for self-defense. English political theorist Thomas Hobbes asserted that, without any legal authority to enforce peace, all people “are in that condition which is called war, and such a war is of every man against every man.”<\/p>\n<p>In other words, every nation was at war with every other nation by default unless they had an explicit peace treaty. The best defense was a good offense, as the Arabs used to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الرُّوْم إِذَا لَمْ تُغْزَ غَزَتْ<\/p>\n<p>If the Romans are not attacked, they attack.<\/p>\n<p>Source: Siyar A’lām al-Nubalā’ 18\/595<\/p><\/blockquote>\n<p>It was rightly assumed by pre-modern jurists that neighboring dynasties were almost certainly aiming to expand their power and influence by force. Conversion to the enemy&#8217;s religion by the sword was a very real threat if geopolitical strength was not projected.<\/p>\n<p>For this reason, some scholars interpreted the verse “fight those who fight you” to mean fight those who were preparing to invade Muslim territory.<\/p>\n<p>Imam al-Baydawi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الَّذِينَ يُقاتِلُونَكُمْ وقيل معناه الذين يناصبونكم القتال ويتوقع منهم ذلك دون غيرهم من المشايخ والصبيان والرهبان والنساء أو الكفرة كلهم فإنهم بصدد قتال المسلمين وعلى قصده<\/p>\n<p>It is said “<strong>those who fight you<\/strong>” means those who wage war or from whom that is expected, but not others among them such as old men, children, monks, and women, or it means all the unbelievers who are about to fight the Muslims and intend to do so.<\/p>\n<p>Source: Anwār al-Tanzīl wa Asrār al-Ta&#8217;wīl 1\/127<\/p><\/blockquote>\n<p>Offensive jihad was not necessarily viewed as an act of aggression, but rather a tactic in an overall defensive strategy. Similarly, President George Washington wrote “that offensive operations, oftentimes, is the surest​, if not the only, means of defense.”<\/p>\n<p>Intimidating potential invaders with pre-emptive strikes was a valid security concern for the jurists, but some scholars of the Salaf did not view offensive deterrence to be an obligation.<\/p>\n<p>Imam al-Sarakhsi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَكَانَ الثَّوْرِيُّ يَقُولُ الْقِتَالُ مَعَ الْمُشْرِكِينَ لَيْسَ بِفَرْضٍ إلَّا أَنْ تَكُونَ الْبِدَايَةُ مِنْهُمْ فَحِينَئِذٍ يَجِبُ قِتَالُهُمْ دَفْعًا لِظَاهِرِ قَوْلِهِ فَإِنْ قَاتَلُوكُمْ فَاقْتُلُوهُمْ وَقَوْلُهُ وَقَاتَلُوا الْمُشْرِكِينَ كَافَّةً كَمَا يُقَاتِلُونَكُمْ كَافَّةً<\/p>\n<p>Al-Thawri said, ‘Fighting with the idolaters is not an obligation unless they initiate it, in which case they must be fought in defense,’ due to the literal meaning of His saying, ‘<strong>If they fight you, then kill them<\/strong>,’ (2:191) and His saying, ‘<strong>Fight the idolaters collectively as they fight you collectively<\/strong>,’ (9:36).<\/p>\n<p>Source: Sharḥ al-Siyar al-Kabīr 1\/187<\/p><\/blockquote>\n<p>And Imam Ibn al-‘Arabi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَقَالَ جَمَاعَةٌ مِنْ الْفُقَهَاءِ إنَّ الْجِهَادَ بَعْدَ فَتْحِ مَكَّةَ لَيْسَ بِفَرْضٍ إلَّا أَنْ يَسْتَنْفِرَ الْإِمَامُ أَحَدًا مِنْهُمْ قَالَهُ سُفْيَانُ الثَّوْرِيُّ<\/p>\n<p>A group of jurists said jihad is not obligatory after the liberation of Mecca, unless the ruler calls for them to join one, as was said by Sufyan al-Thawri.<\/p>\n<p>Source: Aḥkām al-Qur&#8217;ān li-Ibn al-&#8216;Arabī 1\/146<\/p><\/blockquote>\n<p>Nevertheless, if the call to Islam was not obstructed and Muslims could practice their religion peacefully in a non-Muslim country, a war against them would have been unnecessary.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِذَا كَانَ أَصْلُ الْقِتَالِ الْمَشْرُوعِ هُوَ الْجِهَادُ وَمَقْصُودُهُ هُوَ أَنْ يَكُونَ الدِّينُ كُلُّهُ لِلَّهِ وَأَنْ تَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَمَنْ امْتَنَعَ مِنْ هَذَا قُوتِلَ بِاتِّفَاقِ الْمُسْلِمِينَ وَأَمَّا مَنْ لَمْ يَكُنْ مِنْ أَهْلِ الْمُمَانَعَةِ وَالْمُقَاتِلَةِ كَالنِّسَاءِ وَالصِّبْيَانِ وَالرَّاهِبِ وَالشَّيْخِ الْكَبِيرِ وَالْأَعْمَى وَالزَّمِنِ وَنَحْوِهِمْ فَلَا يُقْتَلُ عِنْدَ جُمْهُورِ الْعُلَمَاءِ &#8230; فَمَنْ لَمْ يَمْنَعْ الْمُسْلِمِينَ مِنْ إقَامَةِ دِينٍ لِلَّهِ لَمْ تَكُنْ مَضَرَّةَ كُفْرِهِ إلَّا عَلَى نَفْسِهِ<\/p>\n<p>As the fundamental rule of legislated warfare, which is jihad, its purpose is to make the religion for Allah alone and make the word of Allah highest. Whoever obstructs this purpose is fought by agreement of the Muslims. As for those who are not obstructionists or combatants, such as women, children, monks, old men, the blind, bystanders, and so on, they are not killed according to the majority of scholars… Whoever does not obstruct the Muslims from establishing the religion of Allah, his unbelief harms no one but himself.<\/p>\n<p>Source: Majmū&#8217; al-Fatāwá 28\/354-355<\/p><\/blockquote>\n<p>And Shaykh al-Islam writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">المقصود بالقتال أن تكون كلمة الله هي العليا وأن يكون الدين كله لله وأن لا تكون فتنة أي لا يكون أحد يفتن أحدا عن دين الله فإنما نقاتل من كان ممانعا عن ذلك وهم أهل القتال فأما من لا يقاتل عن ذلك فلا وجه لقتله كالمرأة والشيخ الكبير والراهب ونحو ذلك<\/p>\n<p>The objective of fighting is for the word of Allah to be made highest, the religion to be entirely for Allah, and for there to be no more persecution, meaning no one is persecuted into abandoning the religion of Allah. Indeed, only those who obstruct this are fought for it, those who are combatants. As for those who do not fight for that, there is no justification for killing them, such as women, old men, monks, and so on.<\/p>\n<p>Source: al-Ṣārim al-Maslūl 1\/282<\/p><\/blockquote>\n<p>The Prophet ﷺ taught Muslims that the rationale for warfare is only to protect Islam’s mission to allow every human being the opportunity to willingly accept this religion, not by force but by persuasion.<\/p>\n<p>Abu Musa reported: A man asked the Prophet, “A man may fight to be courageous, another may fight for zeal, and another may fight to show off. Which of these is fighting in the way of Allah?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ<\/p>\n<p><strong>He who fights to raise the word of Allah is in the way of Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 123, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/12\/jihad-word-allah-highest\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>To &#8216;raise the word of Allah’ means preaching Islam to the world, whereas other selfish motives such as zeal, rage, fame, spoils, political ambitions, or any other worldly aspiration are not considered true jihad.<\/p>\n<p>Imam Ibn Hajar commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لْمُرَادُ بِكَلِمَةِ اللَّهِ دَعْوَةُ اللَّهِ إِلَى الْإِسْلَامِ وَيَحْتَمِلُ أَنْ يَكُونَ الْمُرَادُ أَنَّهُ لَا يَكُونُ فِي سَبِيلِ اللَّهِ إِلَّا مَنْ كَانَ سَبَبُ قِتَالِهِ طَلَبَ إِعْلَاءِ كَلِمَةِ اللَّهِ فَقَطْ بِمَعْنَى أَنَّهُ لَوْ أَضَافَ إِلَى ذَلِكَ سَبَبًا مِنَ الْأَسْبَابِ الْمَذْكُورَةِ أَخَلَّ بِذَلِكَ &#8230; وَفِيهِ ذَمُّ الْحِرْصِ عَلَى الدُّنْيَا وَعَلَى الْقِتَالِ لِحَظِّ النَّفْسِ فِي غَيْرِ الطَّاعَةِ<\/p>\n<p>The meaning of the ‘word of Allah’ is the call of Allah to Islam. It potentially means that jihad would not be in the cause of Allah unless the purpose of fighting is only to raise the word of Allah, such that if anyone were to add another reason to it among the reasons mentioned, that would violate it… In this Hadith is blame for seeking worldly gains and for fighting to acquire personal fortune in disobedience to Allah.<\/p>\n<p>Source: Fatḥ al-Bārī 6\/28-29<\/p><\/blockquote>\n<p>Imam al-Shawkani agreed with him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُرَادُ بِكَلِمَةِ اللَّهِ دَعْوَةُ اللَّهِ إلَى الْإِسْلَامِ<\/p>\n<p>The meaning of ‘the word of Allah’ is the call of Allah to Islam.<\/p>\n<p>Source: Nayl al-Awṭār 7\/254<\/p><\/blockquote>\n<p>Forced conversions to Islam are explicitly forbidden in the Quran, so the Prophet ﷺ never coerced any of his enemies to accept his religion.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِكْرَاهَ فِي الدِّينِ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ<\/p>\n<p><strong>Let there be no compulsion in religion, for the truth stands out clearly from falsehood.<\/strong><\/p>\n<p>Surat al-Baqarah 2:256<\/p><\/blockquote>\n<p>Imam Ibn al-Qayyim commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلَمْ يُكْرِهْ أَحَدًا قَطُّ عَلَى الدِّينِ وَإِنَّمَا كَانَ يُقَاتِلُ مَنْ يُحَارِبُهُ وَيُقَاتِلُهُ وَأَمَّا مَنْ سَالَمَهُ وَهَادَنَهُ فَلَمْ يُقَاتِلْهُ وَلَمْ يُكْرِهْهُ عَلَى الدُّخُولِ فِي دِينِهِ امْتِثَالًا لِأَمْرِ رَبِّهِ سُبْحَانَهُ وَتَعَالَى حَيْثُ يَقُولُ لَا إِكْرَاهَ فِي الدِّينِ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ &#8230; مَنْ تَأَمَّلَ سِيرَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَبَيَّنَ لَهُ أَنَّهُ لَمْ يُكْرِهْ أَحَدًا عَلَى دِينِهِ قَطُّ وَأَنَّهُ إِنَّمَا قَاتَلَ مَنْ قَاتَلَهُ وَأَمَّا مَنْ هَادَنَهُ فَلَمْ يُقَاتِلْهُ مَا دَامَ مُقِيمًا عَلَى هُدْنَتِهِ<\/p>\n<p>The Prophet never forced the religion upon anyone, but rather he only fought those who waged war against him and fought him first. As for those who made peace with him or conducted a truce, he never fought them and he never compelled them to enter his religion, as his Lord the Almighty had commanded him, ‘<strong>Let there be no compulsion in religion, for the truth stands out clearly from falsehood.<\/strong>’ … Whoever ponders over the biography of the Prophet, it will be clear to him that he never compelled anyone to accept his religion, and that he only fought those who fought him. As for those who conducted a truce with him, he never fought them as long as they upheld their truce.<\/p>\n<p>Source: Hidāyat al-Ḥayārá  1\/237-238<\/p><\/blockquote>\n<p>In other words, Muslims are not allowed to fight for acquiring money, power, slaves, politics, revenge, malice, and so on. The Prophet ﷺ warned his Companions that there is no reward for a Muslim who fights only to acquire the spoils of war.<\/p>\n<p>Abu Huraira reported: A man said, “O Messenger of Allah, a man intends to fight for the sake of Allah, and he is seeking worldly gains.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him<\/strong>.<\/p><\/blockquote>\n<p>The people found that very difficult, so they said, “Return to the Messenger of Allah, for perhaps he did not understand you.” The man returned, and he said, “O Messenger of Allah, a man intends to fight for the sake of Allah, and he is seeking worldly gain.” The Messenger of Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him<\/strong>.<\/p><\/blockquote>\n<p>Then he returned a third time, and the Messenger of Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا أَجْرَ لَهُ<\/p>\n<p><strong>There is no reward for him.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 7887, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/27\/anfal-jihad-no-reward-for-booty\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Umamah reported: A man came to the Prophet, peace and blessings be upon him, and he said, “If a man battles for the sake of reward and fame, what do you think he has?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا شَيْءَ لَهُ<\/p>\n<p><strong>He has nothing<\/strong>.<\/p><\/blockquote>\n<p>The man repeated his question three times, and the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا شَيْءَ لَهُ<\/p>\n<p><strong>He has nothing<\/strong>.<\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ لَا يَقْبَلُ مِنْ الْعَمَلِ إِلَّا مَا كَانَ لَهُ خَالِصًا وَابْتُغِيَ بِهِ وَجْهُهُ<\/p>\n<p><strong>Verily, Allah does not accept any good deeds unless they are done sincerely and in pursuit of His countenance.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3140, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/01\/27\/sincerity-allah-only-accepts\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>And the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ غَزَا فِي سَبِيلِ اللَّهِ وَلَمْ يَنْوِ إِلَّا عِقَالًا فَلَهُ مَا نَوَى<\/p>\n<p><strong>Whoever joins a military campaign in the way of Allah with no intention but to acquire as much as a rope in spoils, he will only get what he intended.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 3138, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/09\/22\/no-reward-jihad-spoils\/\"><em>Hasan li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>Thus, sincere intention to the fundamental objectives, in line with the strict rules of engagement, is required for any Muslim hoping to be rewarded for participating in a true jihad.<\/p>\n<p>The primacy of Islam’s missionary imperative over warfare is inferred by the fact that it was one of the first, if not the first, act of jihad that Allah prescribed for His Messenger.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا تُطِعِ ٱلْكَـٰفِرِينَ وَجَـٰهِدْهُم بِهِ جِهَادًۭا كَبِيرًۭا<\/p>\n<p><strong>So do not yield to the disbelievers, but strive against them with it in a great jihad.<\/strong><\/p>\n<p>Surat al-Furqan 25:52<\/p><\/blockquote>\n<p>Ibn Abbas, may Allah be pleased with him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قولَه وَجَاهِدْهُمْ بِهِ يعني بالقرآنِ<\/p>\n<p>His saying, ‘<strong>Strive against them with it<\/strong>,’ meaning the Quran.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 17\/470<\/p><\/blockquote>\n<p>This verse commands the jihad of ‘calling to Islam’ (<em>da’wah<\/em>), which preceded all other verses ordering warfare against enemies. This is consistent with the Quran’s gradual revelation over several years, which establishes general principles early on and provides exceptions later.<\/p>\n<p>Many of the Salaf would use the word ‘abrogation’ not to mean ‘cancellation,’ but as an amendment to a general ruling found in a previous verse.<\/p>\n<p>Imam Ibn al-Qayyim writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْت مُرَادُهُ وَمُرَادُ عَامَّةِ السَّلَفِ بِالنَّاسِخِ وَالْمَنْسُوخِ رَفْعُ الْحُكْمِ بِجُمْلَتِهِ تَارَةً وَهُوَ اصْطِلَاحُ الْمُتَأَخِّرِينَ وَرَفْعُ دَلَالَةِ الْعَامِّ وَالْمُطْلَقِ وَالظَّاهِرِ وَغَيْرِهَا تَارَةً إمَّا بِتَخْصِيصٍ أَوْ تَقْيِيدٍ أَوْ حَمْلِ مُطْلَقٍ عَلَى مُقَيَّدٍ وَتَفْسِيرِهِ وَتَبْيِينِهِ حَتَّى إنَّهُمْ يُسَمُّونَ الِاسْتِثْنَاءَ وَالشَّرْطَ<\/p>\n<p>I say: The general meaning of the righteous predecessors when using the words ‘abrogating’ and ‘abrogated’ is sometimes the complete removal of the previous ruling—and this is the technical term of the latter generations—or sometimes the removal of the general, absolute, and outward meaning or otherwise, whether by specification, restriction, interpreting an absolute as limited, or by explanation and clarification. Even then they would refer to it as exceptional and conditional.<\/p>\n<p>Source: Iʻlām al-Muwaqqiʻīn 1\/29<\/p><\/blockquote>\n<p>When some of the Salaf claimed the peaceful verses are ‘abrogated,’ they most likely did not mean &#8216;canceled&#8217; but rather as exceptions to general rulings established earlier.<\/p>\n<p>Similarly, when the scholars talked about fighting ‘idolatry’ and ‘unbelief’ in a general sense, they were referring to combatants (<em>harbi<\/em>) who forced Muslims to convert to their religion or else be tortured or even murdered, as Imam Ibn al-Mawdud stated:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِأَنَّ الْكَافِرَ مَتَى أُطْلِقَ يَنْصَرِفُ إِلَى الْحَرْبِيِّ عَادَةً وَعُرْفًا<\/p>\n<p>When the word ‘unbeliever’ is used, it is usually referring to a combatant.<\/p>\n<p>Source: al-Ikhtiyār li-Ta’līl al-Mukhtār 5\/27<\/p><\/blockquote>\n<p>The &#8216;idolatry&#8217; of the Meccans was not a benign religion minding its own business. Rather, it was a violent creed that could not tolerate peaceful Muslims living beside them.<\/p>\n<p>Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا كَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَاتِلُ الْمُشْرِكِينَ وَكَانَ الدُّخُولُ فِي دِينِهِمْ فِتْنَةً<\/p>\n<p>Muhammad only fought the idolaters as there was persecution to make them accept their religion.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7095, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/07\/05\/fitnah-of-shirk\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, Ibn Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ إِمَّا قَتَلُوهُ وَإِمَّا يُعَذِّبُوهُ حَتَّى كَثُرَ الإِسْلاَمُ فَلَمْ تَكُنْ فِتْنَةٌ‏<\/p>\n<p>A man used to be persecuted for his religion, whether they killed him or tortured him, until the followers of Islam became plentiful and there was no longer persecution.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4514, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>This is the &#8216;idolatry&#8217; that scholars declared war upon, as Imam Ibn al-Qayyim explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَحَقِيقَتُهَا أَنَّهَا الشِّرْكُ الَّذِي يَدْعُو صَاحِبُهُ إِلَيْهِ وَيُقَاتِلُ عَلَيْهِ وَيُعَاقِبُ مَنْ لَمْ يَفْتَتِنْ بِهِ &#8230; عَذِّبُوا الْمُؤْمِنِينَ لِيَفْتَتِنُوا عَنْ دِينِهِمْ فَهَذِهِ الْفِتْنَةُ الْمُضَافَةُ إِلَى الْمُشْرِكِينَ<\/p>\n<p>The reality is this ‘idolatry’ is what its practitioners call to, fight for, and punish whoever is not tempted into it… they tortured the believers to tempt them away from their religion. This was the ‘persecution’ of the idolaters.<\/p>\n<p>Source: Zād al-Ma’ād 3\/151-152<\/p><\/blockquote>\n<p>And Shaykh Muhammad Ibn ‘Abdul Wahhab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">معنى الفتنة هنا الشرك كقوله وَقَاتِلُوهُمْ حَتَّى لَا تَكُونَ فِتْنَةٌ &#8230; وحقيقتها الشرك الذي يدعو إليه صاحبه ويعاقب من لم يفتتن به<\/p>\n<p>The meaning of ‘persecution’ is idolatry, as in His saying, ‘<strong>Fight them until there is no more persecution<\/strong>…’ (8:39)… In reality, it is the idolatry that its practicioners call to and punish those who are not tempted into it.<\/p>\n<p>Source: Mukhtaṣar Sīrat al-Rasūl 1\/150<\/p><\/blockquote>\n<p>Peacefully preaching Islam was first established as a permanent obligation, whereas jihad as warfare was later legislated as a necessary, contextual exception to protect the original mission. If the safety of Muslims to practice and preach the religion can be guaranteed, war is not justified at all, in accordance with Imam al-Zarkashi’s legal maxim:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْجِهَاد وُجُوبَهُ وُجُوبُ الْوَسَائِلِ لَا الْمَقَاصِدِ إذْ الْمَقْصُودُ مِنْهُ الْهِدَايَةُ<\/p>\n<p>Jihad is an obligation of means, not ends, as the objective is to spread guidance.<\/p>\n<p>Source: Tuḥfat al-Muḥtāj bi-Sharḥ al-Minhāj 9\/221<\/p><\/blockquote>\n<p>The early conquests by the Muslims might imply militant, dynastic expansionism was the point of jihad, as claimed by Muslim extremists and the Orientalists, but a careful look at the historical evidence proves them wrong. The Companions were ordered to save their brothers and sisters living in those brutal empires which oppressed them.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَا لَكُمْ لَا تُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ وَٱلْمُسْتَضْعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلْوِلْدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخْرِجْنَا مِنْ هَـٰذِهِ ٱلْقَرْيَةِ ٱلظَّالِمِ أَهْلُهَا وَٱجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّۭا وَٱجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا<\/p>\n<p><strong>What is the matter with you? You do not fight in the cause of Allah and for oppressed men, women, and children who cry out, ‘Our Lord! Deliver us from this land of oppressors! Appoint for us a savior; appoint for us a helper—all by Your grace.’  <\/strong><\/p>\n<p>Surat al-Nisa’ 4:75<\/p><\/blockquote>\n<p>In the time of the Prophet ﷺ and his Companions, the Romans had been imprisoning or executing their prominent citizens who embraced Islam. Farwah ibn ‘Amr al-Judhami was one such subordinate of Caesar who accepted Islam, even sending gifts to the Prophet.<\/p>\n<p>When the Romans found out about Farwah’s conversion, they imprisoned him, killed him, and displayed his corpse in public crucifixion-style, ironically imitating those who tried to murder Jesus Christ, upon him be peace.<\/p>\n<p>Imam Ibn Kathir documents the incident:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَكَانَ فَرْوَةُ عَامِلًا لِلرُّومِ عَلَى مَنْ يَلِيهِمْ مِنَ الْعَرَبِ وَكَانَ مَنْزِلُهُ مُعَانَ وَمَا حَوْلَهَا مِنْ أَرْضِ الشَّامِ فَلَمَّا بَلَغَ الرُّومَ ذَلِكَ مِنْ إِسْلَامِهِ طَلَبُوهُ حَتَّى أَخَذُوهُ، فَحَبَسُوهُ عِنْدَهُمْ &#8230; ثُمَّ ضَرَبُوا عُنُقَهُ وَصَلَبُوهُ عَلَى ذَلِكَ<\/p>\n<p>Farwah was the governor of the Romans over the Arabs who were near them, and his home was in Ma&#8217;an and the surrounding lands of the Levant. When the Romans heard of his conversion to Islam, they sought him out until they captured him, and they imprisoned him&#8230; then they struck off his neck and crucified him on that basis.<\/p>\n<p>Source: al-Bidāyah wal-Nihāyah 7\/349<\/p><\/blockquote>\n<p>This gruesome public execution signaled to everyone in the region that conversion to Islam was not tolerated in the Roman empire. The peaceful spread of Islam was under threat, as the Muslim preachers sent to them were threatened with violent resistance.<\/p>\n<p>Shaykh al-Islam Ibn Taymiyyah considered this the legal justification to declare war:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَالنَّصَارَى حَارَبُوا المُسْلِمِينَ أَوَّلًا وَقَتَلُوا مَنْ أَسْلَمَ مِنْهُمْ بَغْيًا وَظُلْمًا وَإِلَّا فَرُسُلُهَ أَرْسَلَهُمْ يَدْعُونَ النَّاسَ إِلَى الإِسلَامِ طَوعًا لا كَرْهًا فَلَمْ يُكْرِهْ أَحَدًا عَلَى الإِسْلَامِ لَمَّا بَدَأَهُ النَّصَارَى بِقَتْلِ المُسْلِمِينَ أَرْسلَ سَرِيَّةً أَمَّرَ عَلَيهَا زَيدَ بنَ حَارِثَةَ<\/p>\n<p>The Christians waged war against the Muslims first, and they unjustly and oppressively killed those who accepted Islam among them, even though messengers were sent to them to call people to Islam willingly, without compulsion, and no one was forced into Islam. When the Christians started killing Muslims, an army was sent under the command of Zayd ibn al-Harith.<\/p>\n<p>Source: Qā’idah Mukhtaṣarah fī Qitāl al-Kuffār 1\/136-137<\/p><\/blockquote>\n<p>The peaceful invitation to Islam by unarmed preachers was the Prophet’s ﷺ initial policy, but as they were met hostility and brutality, he resorted to war as a means of ensuring Islam would be safe in Roman lands. The only way to save these oppressed Muslim converts and protect their rights was to take the initiative against those tyrannical empires, a bold proposition for the outnumbered and underfunded Muslims.<\/p>\n<p>In contrast, the Companions and the Salaf did not attack their peaceful neighbors. The best example of this is the amicable relations the Muslims had with Abyssinia, in present-day Ethiopia. Before the migration to Medina, some Muslims were granted asylum by the Negus of Abyssinia. When the Quran was presented to him, the Negus said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ هَذَا وَالَّذِي جَاءَ بِهِ مُوسَى لَيَخْرُجُ مِنْ مِشْكَاةٍ وَاحِدَةٍ انْطَلِقَا فَوَاللَّهِ لَا أُسْلِمُهُمْ إِلَيْكُمْ أَبَدًا<\/p>\n<p>Verily, this recitation and what has come from Moses have emerged from the same lamp. You are released. By Allah, I will never surrender them to the Quraysh.<\/p>\n<p>Source: Musnad Aḥmad 22498, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/07\/sahaba-meet-najashi\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>The generosity of the Abyssinians did not go unappreciated. The Prophet ﷺ encouraged Muslims to maintain peaceful relations with them as long as they remain friendly, and this instruction was taken seriously by the scholars of Medina.<\/p>\n<p>Abu Sukayna reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعُوا الْحَبَشَةَ مَا وَدَعُوكُمْ وَاتْرُكُوا التُّرْكَ مَا تَرَكُوكُمْ<\/p>\n<p><strong>Leave the Abyssinians alone as long as they leave you alone, and leave the Turks alone as long as they leave you alone.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4302, Grade: <em>Hasan<\/em><\/p><\/blockquote>\n<p>The jurist Ibn Rushd commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عَنْ مَالِكٍ أَنَّهُ قَالَ لَا يَجُوزُ ابْتِدَاءُ الْحَبَشَةِ بِالْحَرْبِ وَلَا التَّرْكُ &#8230; وَقَدْ سُئِلَ مَالِكٌ عَنْ صِحَّةِ هَذَا الْأَثَرِ فَلَمْ يَعْتَرِفْ بِذَلِكَ لَكِنْ قَالَ لَمْ يَزَلِ النَّاسُ يَتَحَامَوْنَ غَزْوَهُمْ<\/p>\n<p>Imam Malik said it is not permissible to initiate war against the Abyssinians or the Turks… Malik was asked about the authenticity of the Hadith and, although he did not recognize it, he said, ‘The people have always avoided attacking them.’<\/p>\n<p>Source: Bidāyat al-Mujtahid 2\/144<\/p><\/blockquote>\n<p>It strains credulity to imagine the Prophet ﷺ commanded his Companions to migrate to Abyssinia for asylum, only to later attack them unprovoked just because they were Christians, as if he would have responded to their goodwill with a backstabbing betrayal. Allah and His Messenger are above such things!<\/p>\n<p>The more plausible explanation is that Islam could be safely practiced in the Abyssinian kingdom, so there was no legal justification for attacking them, even though the Abyssinians themselves did not rule by Shariah law.<\/p>\n<p>Islam clearly distinguishes between peaceful and hostile non-Muslims. Peaceful non-Muslims are treated with kindness and generosity, while hostile non-Muslims are treated harshly only to the extent it deters them from harming Muslims or innocent people.<\/p>\n<p>Shaykh ‘Abdu Rahman al-Sa’di writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فإن الكفار نوعان معرضون ومعارضون فالمعارض المحارب لله ورسوله القادح بالله وبدينه ورسوله أغلظ كفرا وأعظم فسادا<\/p>\n<p>The unbelievers are two types: passive and confrontational. The confrontational are those who wage war against Allah and His Messenger. They slander Allah, His religion, and His Messenger, which is more severe unbelief and greater corruption.<\/p>\n<p>Source: al-Qawl al-Sadīd 1\/154<\/p><\/blockquote>\n<p>As the Quraysh launched their attacks against Medina, there were Muslims who still had family and friends in Mecca who, despite being idolaters, were not supporting the war. Allah allowed, even encouraged, the Muslims to maintain good relations with those who were not fighting them.<\/p>\n<p>Asma’ bint Abi Bakr reported: My mother, who was an idolater, came to me hoping for good treatment during the truce of the Prophet, peace and blessings be upon him, so I asked him, “Shall I keep relations with her?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ<\/p>\n<p><strong>Yes<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5978, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/08\/22\/family-kafir-mushrik\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Then, Allah revealed the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَّا يَنْهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمْ يُقَـٰتِلُوكُمْ فِى ٱلدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَـٰرِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوٓا۟ إِلَيْهِمْ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ إِنَّمَا يَنْهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَـٰتَلُوكُمْ فِى ٱلدِّينِ وَأَخْرَجُوكُم مِّن دِيَـٰرِكُمْ وَظَـٰهَرُوا۟ عَلَىٰٓ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ وَمَن يَتَوَلَّهُمْ فَأُو۟لَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ<\/p>\n<p><strong>Allah does not forbid you from dealing kindly and fairly with those who have neither fought nor driven you out of your homes. Surely, Allah loves those who are fair. Allah only forbids you from befriending those who have fought you for your faith, driven you out of your homes, or supported others in doing so. And whoever takes them as friends, then it is they who are the true wrongdoers.<\/strong><\/p>\n<p>Surat al-Mumtahanah 60:8-9<\/p><\/blockquote>\n<p>Imam Ibn Kathir commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أي إنما ينهاكم عن موالاة هؤلاء الذين ناصبوكم بالعداوة فقاتلوكم وأخرجوكم وعاونوا على إخراجكم ينهاكم الله عن موالاتهم ويأمركم بمعاداتهم<\/p>\n<p>That is, He only forbids you from befriending those who have declared enmity towards you, fought you, expelled you, and helped in expelling you. Allah forbids you from befriending them and commands you to be hostile to them.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 8\/119<\/p><\/blockquote>\n<p>This key verse, and the ruling derived from it, has not been abrogated or cancelled.<\/p>\n<p>Imam al-Tabari, after discussing the interpretations of early Muslims, commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وأولَى الأقوالِ في ذلك بالصَّوابِ قولُ مَن قال عُنِي بذلك لا يَنْهاكم اللَّهُ عن الذين لم يُقاتِلوكم في الدينِ من جميعِ أصنافِ المللِ والأديانِ أن تبرُّوهم وتَصِلوهم وتُقْسِطوا إليهم &#8230; جميعَ مَن كان ذلك صفتَه فلم يَخْصُصْ به بعضًا دونَ بعضٍ ولا معنَى لقولِ مَن قال ذلك مَنْسُوخٌ<\/p>\n<p>The first of those opinions is correct, those who said the meaning of ‘<strong>Allah does not forbid you from those who did not fight you in religion<\/strong>’ are all types of denominations and faiths, that you be kind to them, have good relations with them, and be fair to them… It is all who fit that description, so the verse is not restricted by others. It does not mean as those who say it is abrogated.<\/p>\n<p>Source: Tafsīr al-Ṭabarī 22\/574<\/p><\/blockquote>\n<p>Imam al-Qurtubi agrees that the verse is not abrogated:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هَذِهِ الْآيَةُ رُخْصَةٌ مِنَ اللَّهِ تَعَالَى فِي صِلَةِ الَّذِينَ لَمْ يُعَادُوا الْمُؤْمِنِينَ وَلَمْ يُقَاتِلُوهُمْ &#8230; وَقَالَ أَكْثَرُ أَهْلِ التَّأْوِيلِ هِيَ مُحْكَمَةٌ<\/p>\n<p>This verse is a concession from Allah Almighty in maintaining relations with those who are not hostile to the believers and do not fight them… Most of the exegetes say the verse is operative.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 18\/59<\/p><\/blockquote>\n<p>And Imam al-Shinqiti commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَّا التَّقْسِيمُ فَقِسْمَانِ قِسْمٌ مُسَالِمٌ لَمْ يُقَاتِلِ الْمُسْلِمِينَ وَلَمْ يُخْرِجْهُمْ مِنْ دِيَارِهِمْ فَلَمْ يَنْهَ اللَّهُ الْمُسْلِمِينَ عَنْ بِرِّهِمْ وَالْإِقْسَاطِ إِلَيْهِمْ وَقِسْمٌ غَيْرُ مُسَالِمٍ يُقَاتِلُ الْمُسْلِمِينَ وَيُخْرِجُهُمْ مِنْ دِيَارِهِمْ وَيُظَاهِرُ عَلَى إِخْرَاجِهِمْ فَنَهَى اللَّهُ الْمُسْلِمِينَ عَنْ مُوَالَاتِهِمْ وَفَرْقٌ بَيْنَ الْإِذْنِ بِالْبَرِّ وَالْقِسْطِ وَبَيْنَ النَّهْيِ عَنِ الْمُوَالَاةِ وَالْمَوَدَّةِ<\/p>\n<p>As for the division, they are two categories: a peaceful group that did not fight the Muslims and did not expel them from their homes, so Allah did not forbid the Muslims from being kind to them and treating them fairly. Another group, who is not peaceful, that fought the Muslims and expelled them from their homes and supported them in their expulsion, so Allah forbade the Muslims from befriending them. There is a difference between permission to be kind and fair, and the prohibition of friendship and affection.<\/p>\n<p>Source: Aḍwā’ al-Bayān 8\/90<\/p><\/blockquote>\n<p>It should be noted that the wording of the verse “Allah does not forbid you from being fair” does not imply that injustice is allowed in any context, as Imam al-Qurtubi clarified:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّ الْعَدْلَ وَاجِبٌ فِيمَنْ قَاتَلَ وَفِيمَنْ لَمْ يقاتل<\/p>\n<p>Justice is obligatory towards those who fight and those who do not fight.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 18\/59<\/p><\/blockquote>\n<p>Aside from purely legal discussions, our understanding of jihad must be integrated with Islamic theology and the nature of Allah as the Most Merciful. Peace, mercy, and justice are fundamental values in Islam, rooted in the Names and Attribute of Allah Himself. Indeed, the noble creed and ethics of Islam precede the Law in importance, guiding the jurists in their rulings and verdicts.<\/p>\n<p>Several texts of the Quran and Sunnah emphasize peace and mercy as objectives of Islam. The prescribed greeting between Muslims and their neighbors is, “Peace be upon you and the mercy of Allah.” The Quran even uses the word “peace” as a synonym for Islam.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱدْخُلُوا۟ فِى ٱلسِّلْمِ كَآفَّةًۭ وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَـٰنِ إِنَّهُۥ لَكُمْ عَدُوٌّۭ مُّبِينٌۭ<\/p>\n<p><strong>O believers! Enter into ‘peace’ <\/strong>(<em>silm<\/em>)<strong> wholeheartedly and do not follow Satan’s footsteps. Surely, he is your sworn enemy.<\/strong><\/p>\n<p>Surat al-Baqarah 2:208<\/p><\/blockquote>\n<p>Many of the Companions and Salaf said ‘peace’ in this verse means Islam, as Imam Ibn Kathir states:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عن ابن عباس ومجاهد وطاوس والضحاك وعكرمة وقتادة والسدي وابن زيد في قوله اُدْخُلُوا فِي السِّلْمِ يعني الإسلام<\/p>\n<p>Ibn Abbas, Mujahid, Al-Dahhak, ‘Ikramah, Qatadah, Al-Suddi, and Ibn Zayd said ‘<strong>enter into peace<\/strong>’ means Islam.<\/p>\n<p>Source: Tafsīr Ibn Kathīr 1\/422<\/p><\/blockquote>\n<p>Islam means more than peace, of course, as its primary meaning is &#8216;surrender&#8217; (<em>istislam<\/em>) to the will of Allah. Even so, Islam and peace share the same linguistic root, implying a strong connection of peace to the essence of the religion.<\/p>\n<p>Many of the Prophet’s ﷺ teachings and sayings of his Companions further highlight the virtue of peace in Islam, as an Attribute of Allah, as well as non-aggression being the default characteristic of a true Muslim.<\/p>\n<p>Aisha reported: When the Messenger of Allah, peace and blessings be upon him, finished his prayer, he would not sit long enough but to say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ ذَا الْجَلَالِ وَالْإِكْرَامِ<\/p>\n<p><strong>O Allah, You are peace and from You is peace. Blessed are You, the Majestic and Noble.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 592, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/04\/28\/o-allah-you-are-peace\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Anas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ السَّلَامَ اسْمٌ مِنْ أَسْمَاءِ اللَّهِ تَعَالَى وَضَعَهُ اللَّهُ فِي الْأَرْضِ فَأَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><strong>Verily, peace is one of the names of Allah Almighty that He has placed upon the earth, so spread peace between yourselves.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad lil-Bukhārī 989, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2023\/05\/19\/spread-salaam-of-allah\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْمُسْلِمُ مَنْ سَلِمَ النَّاسُ مِنْ لِسَانِهِ وَيَدِهِ وَالْمُؤْمِنُ مَنْ أَمِنَهُ النَّاسُ عَلَى دِمَائِهِمْ وَأَمْوَالِهِمْ<\/p>\n<p><strong>The Muslim is the one from whose tongue and hand people are safe, and the believer is the one people trust with their lives and wealth.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 4995, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/10\/31\/believer-peaceful-trustworthy\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: A man asked, “O Messenger of Allah, whose Islam is best?” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَلِمَ النَّاسُ مِنْ لِسَانِهِ وَيَدِهِ<\/p>\n<p><strong>Those from whose tongue and hand people are safe.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 6753, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/10\/19\/best-islam-safe\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet replied to the same question:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تُطْعِمُ الطَّعَامَ وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ<\/p>\n<p><strong>That you feed the hungry and you greet with peace those you know and those you do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 28, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/10\/greet-peace-do-not-know\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ<\/p>\n<p><strong>You will not enter Paradise until you have faith, and you will not have faith until you love each other. Shall I tell you something that, if you did, you would love each other? Spread peace between yourselves.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 54, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/16\/no-paradise-until-love-one-another\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَفْشُوا السَّلامَ تَحَابُّوا وَإِيَّاكُمْ وَالْبُغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ لا أَقُولُ لَكُمْ تَحْلِقُ الشَّعْرَ وَلَكِنْ تَحْلِقُ الدِّينَ<\/p>\n<p><strong>Spread peace and you will love one another. Beware of hatred, for it is the razor. I do not say that it shaves hair, but rather it shaves away the religion.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad lil-Bukhārī 260, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/02\/spread-love-peace-beware-hatred\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْبُدُوا الرَّحْمَنَ وَأَطْعِمُوا الطَّعَامَ وَأَفْشُوا السَّلَامَ تَدْخُلُوا الْجَنَّةَ بِسَلَامٍ<\/p>\n<p><strong>Worship the Most Merciful, feed the poor, and spread peace. You will enter Paradise in peace.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1855, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/09\/07\/mercy-and-peace\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمْ اللَّهُ عَزَّ وَجَلَّ<\/p>\n<p><strong>Spread peace, feed the hungry, and be brothers as Allah Almighty has commanded you.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 3252, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/12\/03\/spread-salaam-be-brothers\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Mu’adh ibn Jabal reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْشِ السَّلَامَ وَابْذُلِ الطَّعَامَ وَاسْتَحِ اللَّهَ اسْتِحْيَاءَ رَجُلٍ ذِي هَيْبَةٍ مِنْ أَهْلِكِ<\/p>\n<p><strong>Spread peace, offer food, and be modest before Allah as you would for a man of dignity from your family.<\/strong><\/p>\n<p>Source: Musnad al-Bazzār 2642, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/05\/11\/spread-salaam-haya-akhlaq\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Al-Bara’ ibn ‘Azib reported: The Messenger of Allah, peace and blessings be upon him, said,<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْشُوا السَّلَامَ تَسْلَمُوا<\/p>\n<p><strong>Spread peace and you will receive peace.<\/strong><\/p>\n<p>Source: al-Adab al-Mufrad lil-Bukhārī 787, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/11\/25\/spread-receive-salaam\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>Abu Umamah, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَمَرَنَا نَبِيُّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُفْشِيَ السَّلَامَ<\/p>\n<p>Our Prophet, peace and blessings be upon him, commanded us to spread peace.<\/p>\n<p>Source: Sunan Ibn Mājah 3693, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/03\/27\/prophet-command-spread-salaam\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The offering of peace was not restricted to Muslims alone, either. The Companions of the Prophet ﷺ would greet non-Muslims with peace as long as they did not display any hostility towards them or Islam.<\/p>\n<p>‘Ammar ibn Yasir, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَلَاثٌ مَنْ جَمَعَهُنَّ جَمَعَ الْإِيمَانَ الْإِنْصَافُ مِنْ نَفْسِكَ وَالْإِنْفَاقُ مِنَ الْإِقْتَارِ وَبَذْلُ السَّلَامِ لِلْعَالَمِ<\/p>\n<p>Whoever has three qualities has completed the faith: a sense of fairness in yourself, spending in charity despite difficult circumstances, and offering peace to the world.<\/p>\n<p>Source: Muṣannaf Ibn Abī Shaybah 30440, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/08\/02\/ammar-world-peace\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>It was said to Ibn Umar, “What will you do in the market if you will not sell or buy or barter or sit in the gatherings?” Ibn Umar, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا نَغْدُو مِنْ أَجْلِ السَّلَامِ نُسَلِّمُ عَلَى مَنْ لَقِيَنَا<\/p>\n<p>We only go out in the morning to greet them with peace. We greet with peace whomever we meet.<\/p>\n<p>Source: al-Muwaṭṭa’ li-Imām Mālik 3533, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/28\/ibn-umar-non-muslims-peace\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Umamah, may Allah be pleased with him, would greet non-Muslims with peace, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">هِيَ تَحِيَّةٌ لِأَهْلِ مِلَّتِنَا وَأَمَانٌ لِأَهْلِ ذِمَّتِنَا وَاسْمٌ مِنْ أَسْمَاءِ اللَّهِ نُفْشِيهِ بَيْنَنَا<\/p>\n<p>This is the greeting for the people of our religion, an assurance of security for the people of our covenant, and the one of the names of Allah that we share between us.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/31\/abu-umamah-salaam-non-muslims\/\">al-Tamhīd 17\/91<\/a><\/p><\/blockquote>\n<p>Imam Ibn &#8216;Abdul Barr commented:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَرُوِيَ عَنِ ابْنِ مَسْعُودٍ وَأَبِي الدَّرْدَاءِ وَفَضَالَةَ بْنِ عُبَيْدٍ أَنَّهُمْ كَانُوا يَبْدَءُونَ أَهْلَ الذِّمَّةِ بِالسَّلَامِ وَعَنِ ابْنِ مَسْعُودٍ أَنَّهُ كَتَبَ إِلَى رَجُلٍ مِنْ أَهْلِ الْكِتَابِ السَّلَامُ عَلَيْكَ<\/p>\n<p>It is narrated from Ibn Mas’ud, Abu Darda, and Fadalah ibn ‘Ubayd that they would initiate the greeting of peace with non-Muslim citizens. Ibn Mas’ud once wrote to a man among the people of the Book and he said, ‘Peace be upon you.’<\/p>\n<p>Source: al-Tamhīd 17\/91<\/p><\/blockquote>\n<p>In fact, peace is such a core Islamic value that the first sermon of the Prophet ﷺ upon arrival in Medina exhorted Muslims to spread peace, not war.<\/p>\n<p>Abdullah ibn Salaam reported: When the Messenger of Allah, peace and blessings be upon him, came to Medina, the people rushed toward him and it was said, “The Messenger of Allah has come!” I came along with the people to see him and when I looked at the face of the Prophet, I realized that his face was not the face of a liar. The first thing the Prophet said was this:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيُّهَا النَّاسُ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَصَلُّوا وَالنَّاسُ نِيَامٌ تَدْخُلُوا الْجَنَّةَ بِسَلَامٍ<\/p>\n<p><strong>O people, spread peace, feed the hungry, and pray at night when people are sleeping. You will enter Paradise in peace.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2485, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/18\/prophet-face-not-a-liar\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Consider this context of the Prophet’s ﷺ arrival in Medina after he was forced to flee Mecca due to attempts to assassinate him, in addition to the previously mentioned threatening letter that the Quraysh sent to him promising war against the new Muslim community. Did the Prophet first call to arms even though it would have been justified? Revenge against his enemies? No, rather he calmly appealed for peace.<\/p>\n<p>Mercy, another fundamental Islamic value, is likewise not restricted to Muslims alone. Islam teaches us to be merciful to all of Allah&#8217;s creation, as long as that mercy is not at the expense of an innocent person&#8217;s rights.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَآ أَرْسَلْنَـٰكَ إِلَّا رَحْمَةًۭ لِّلْعَـٰلَمِينَ<\/p>\n<p><strong>We have sent you only as a mercy for the whole world.<\/strong><\/p>\n<p>Surat al-Anbiya’ 21:107<\/p><\/blockquote>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الرَّاحِمُونَ يَرْحَمُهُمْ الرَّحْمَنُ ارْحَمُوا مَنْ فِي الْأَرْضِ يَرْحَمْكُمْ مَنْ فِي السَّمَاءِ<\/p>\n<p><strong>The merciful will be shown mercy by the Most Merciful. Be merciful to those on the earth, and the One in the heavens will have mercy upon you.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1924, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2010\/11\/16\/irhamu-man-fil-ard\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Musa al-Ash&#8217;ari reported: The Messenger of Allah, peace and blessings be upon him, said,<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَنْ تُؤْمِنُوا حَتَّى تَحَابُوا أَفَلا أَدُلُّكُمْ عَلَى مَا تَحَابُونَ عَلَيْهِ<\/p>\n<p><strong>You will never have faith until you love each other. Shall I tell you what will make you love each other?<\/strong><\/p><\/blockquote>\n<p>They said, “Of course, O Messenger of Allah.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَفْشُوا السَّلامَ بَيْنِكُمْ فَوَالَّذِي نَفْسِي بِيَدِهِ لا تَدْخُلُونَ الْجَنَّةَ حَتَّى تَرَاحَمُوا<\/p>\n<p><strong>Spread peace between yourselves. By the One in whose hand is my soul, you will not enter Paradise until you are merciful to others.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, all of us are merciful.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ لَيْسَ بِرَحْمَةِ أَحَدِكُمْ خَاصَّتَهُ وَلَكِنْ رَحْمَةُ الْعَامَّةِ<\/p>\n<p><strong>Verily, it is not only mercy between yourselves, but rather it is mercy for everyone.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrā lil-Nasā’ī 5760, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/29\/faith-merciful-creation\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The mercy of Islam extends even to animals and the smallest of Allah&#8217;s creatures.<\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">غُفِرَ لِامْرَأَةٍ مُومِسَةٍ مَرَّتْ بِكَلْبٍ عَلَى رَأْسِ رَكِيٍّ يَلْهَثُ قَالَ كَادَ يَقْتُلُهُ الْعَطَشُ فَنَزَعَتْ خُفَّهَا فَأَوْثَقَتْهُ بِخِمَارِهَا فَنَزَعَتْ لَهُ مِنْ الْمَاءِ فَغُفِرَ لَهَا بِذَلِكَ<\/p>\n<p><strong>A prostitute had once been forgiven. She passed by a dog panting near a well. Thirst had nearly killed him, so she took off her sock, tied it to her veil, and drew up some water. Allah forgave her for that.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3321, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/30\/prostitute-forgiven-kalb\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ma’qil ibn Yasar reported: I said, “O Messenger of Allah, I had taken the goat to slaughter it, but I had mercy on it.” The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنْ رَحِمْتَهَا رَحِمَكَ اللَّهُ<\/p>\n<p><strong>If you had mercy on it, Allah will have mercy on you.<\/strong><\/p>\n<p>Source: Shu’ab al-Imān lil-Bayhaqī 10557, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2025\/03\/07\/allah-merciful-animals\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Al-Sharid ibn Suwayd reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ قَتَلَ عُصْفُورًا عَبَثًا عَجَّ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ يَقُولُ يَا رَبِّ إِنَّ فُلَانًا قَتَلَنِي عَبَثًا وَلَمْ يَقْتُلْنِي مَنْفَعَةً<\/p>\n<p><strong>Whoever kills so much as a sparrow unjustly, it will plead to Allah on the Day of Resurrection, saying, &#8216;O Lord, he killed me unjustly, and he did not kill me for any beneficial purpose!&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 5894, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/29\/animals-complain-yawm-al-qiyamah\/\">Jayyid<\/a><\/em><\/p><\/blockquote>\n<p>The scholars of Hadith recognized the relevance of such narrations to the concept of jihad. In response to the question of whether Muslims are allowed to burn idolaters in retaliation, Imam al-Bukhari records a Hadith in which Allah scolds a Prophet because he collectively punished an ant colony.<\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ نَمْلَةً قَرَصَتْ نَبِيًّا مِنَ الأَنْبِيَاءِ فَأَمَرَ بِقَرْيَةِ النَّمْلِ فَأُحْرِقَتْ فَأَوْحَى اللَّهُ إِلَيْهِ أَفِي أَنْ قَرَصَتْكَ نَمْلَةٌ أَهْلَكْتَ أُمَّةً مِنَ الأُمَمِ تُسَبِّحُ<\/p>\n<p><strong>An ant bit one of the Prophets, so he ordered that the colony of ants be burned. Allah revealed to him, &#8216;One ant has bitten you, so you destroy one of the nations that praise Allah?&#8217;<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3019, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/14\/allah-reprimands-prophet-ants\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The implication is that if collective punishment is blameworthy against creatures as tiny as ants, it is even more blameworthy against human beings. The Prophet ﷺ did not allow innocent people to be killed for crimes committed by someone else, effectively outlawing the cycle of blood feuds that plagued Arabia at the time.<\/p>\n<p>Ibn Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ وَلَا يُؤْخَذُ الرَّجُلُ بِجَرِيرَةِ أَبِيهِ وَلَا بِجَرِيرَةِ أَخِيهِ<\/p>\n<p><strong>Do not return to unbelief after me by striking the necks of each other. No man is to be punished for the crimes of his father or his brother.<\/strong><\/p>\n<p>Source: Sunan al-Nasā’ī 4127, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/19\/no-collective-punishment-retaliation-vengeance\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>These numerous texts remind us that behind the legal discussion of the jurists, the theory and practice of warfare must conform to the Prophet&#8217;s ﷺ mission to be a mercy to the worlds. To this end, Muslims are obligated to accept credible peace offerings from their enemies whenever they are offered.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنِ ٱعْتَزَلُوكُمْ فَلَمْ يُقَـٰتِلُوكُمْ وَأَلْقَوْا۟ إِلَيْكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًۭا<\/p>\n<p><strong>If they refrain from fighting you and offer you peace, then Allah does not permit you to harm them.<\/strong><\/p>\n<p>Surat al-Nisa’ 4:90<\/p><\/blockquote>\n<p>And Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَإِن جَنَحُوا۟ لِلسَّلْمِ فَٱجْنَحْ لَهَا وَتَوَكَّلْ عَلَى ٱللَّهِ إِنَّهُ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ<\/p>\n<p><strong>If the enemy is inclined towards peace, make peace with them. And put your trust in Allah. Indeed, He alone is the All-Hearing, All-Knowing.<\/strong><\/p>\n<p>Surat al-Anfal 8:61<\/p><\/blockquote>\n<p>Ali ibn Abi Talib reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ سَيَكُونُ بَعْدِي اخْتِلَافٌ أَوْ أَمْرٌ فَإِنْ اسْتَطَعْتَ أَنْ تَكُونَ السِّلْمَ فَافْعَل<\/p>\n<p><strong>Verily, after me there will be conflicts or affairs, so if you can end them in peace, then do so.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 695, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/11\/29\/end-conflicts-peace\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>The classical jurists derived several legal categories that allow peace with unbelievers, even if the Muslims do not have political control over them.<\/p>\n<p>Imam al-Mawardi writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اعْلَمْ أَنَّ مَا تُحْقَنُ بِهِ دِمَاءُ الْمُشْرِكِينَ يَنْقَسِمُ أَرْبَعَةَ أَقْسَامٍ هُدْنَةٌ وَعَهْدٌ وَأَمَانٌ وَذِمَّةٌ<\/p>\n<p>Know that the lives of idolaters are spared in four cases: a truce, a covenant, a pledge of security, or a tribute for citizenship.<\/p>\n<p>Source: al-Ḥāwī al-Kabīr 14\/296<\/p><\/blockquote>\n<p>In accordance with the Quran, the Prophet ﷺ let enemies go if they promised to stop attacking the Muslims, as an act of mercy and a demonstration of Islam&#8217;s magnanimity in victory.<\/p>\n<p>Allah said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وإِنْ أَحَدٌۭ مِّنَ ٱلْمُشْرِكِينَ ٱسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَـٰمَ ٱللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُۥ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌۭ لَّا يَعْلَمُونَ<\/p>\n<p><strong>If anyone from the idolaters asks for your protection, grant it to them so they may hear the Word of Allah, then escort them to a place of safety, for they are a people who have no knowledge.<\/strong><\/p>\n<p>Surat al-Tawbah 9:6<\/p><\/blockquote>\n<p>Ibn Zayd, may Allah have mercy on him, explained:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنْ لَمْ يُوَافِقْهُ مَا يَقُصُّ عَلَيْهِ وَيُحَدِّثُهُ فَأَبْلِغْهُ مَأْمَنَهُ وَلَيْسَ هَذَا بِمَنْسُوخٍ<\/p>\n<p>If he does not accept what is narrated and told to him, then escort them to a place of safety. This has not been abrogated.<\/p>\n<p>Source: Tafsīr Ibn Abī Ḥātim 29:6<\/p><\/blockquote>\n<p>Allah not only relents against His enemies without forcing their conversion, but He even excuses them for their ignorance, just as the Messenger of Allah, peace and blessings be upon him, prayed when his face was slashed at the battle of Uhud:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اللَّهُمَّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لا يَعْلَمُونَ<\/p>\n<p><strong>O Allah, forgive my people for they do not know.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 973, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/23\/prophet-forgives-battle-uhud\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>In one incident, an idolater snuck up to the Prophet ﷺ to kill him, but eventually lost his sword to him. When the Prophet pointed the weapon at him and asked him to become Muslim, the man refused to convert to Islam, but he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُعَاهِدُكَ عَلَى أَنْ لَا أُقَاتِلَكَ وَلَا أَكُونَ مَعَ قَوْمٍ يُقَاتِلُونَكَ<\/p>\n<p>I pledge not to fight you and not to join anyone who fights you.<\/p><\/blockquote>\n<p>The Prophet accepted these terms and let him go, so when the man returned to his tribe, he exclaimed:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">جِئْتُكُمْ مِنْ عِنْدِ خَيْرِ النَّاسِ<\/p>\n<p>I have just come to you from the best of the people!<\/p>\n<p>Source: Musnad Aḥmad 15190, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/08\/11\/prophet-enemy-combatant\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet ﷺ did not want to kill the man. He wanted him to embrace Islam. The wisdom in letting him go is that he returned to his tribe, praising him for his generosity, which raised his reputation and embodied the values of Islamic mercy, potentially converting more hearts and minds.<\/p>\n<p>In practice, many jurists limited peace treaties to a ten-year term, as was the international custom at the time. However, others set no limit at all, paving the way for permanent peace treaties, as adopted by most Muslim countries today.<\/p>\n<p>Imam Malik, may Allah be pleased with him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَجُوزُ مُهَادَنَةُ الْمُشْرِكِينَ السَّنَةَ وَالسَّنَتَيْنِ وَالثَّلَاثَ وَإِلَى غَيْرِ مُدَّةٍ<\/p>\n<p>It is permissible to contract a peace treaty with the idolaters for one, two, or three years, or without any time limit.<\/p>\n<p>Source: Tafsīr al-Qurṭubī 8\/41<\/p><\/blockquote>\n<p>There is nothing in Islam to prevent lasting peace with non-Muslims as long as the freedom and security of Muslims are guaranteed and innocent people are not being slaughtered.<\/p>\n<p>All avenues of peace and reconciliation must be pursued as much as possible, while any covenant, promise, or truce with the enemy must be strictly upheld. It is absolutely forbidden for Muslims to unilaterally violate peace treaties, plot political assassinations, or make false promises to the enemy. Anyone who does so will be condemned by Allah and all creation on the Day of Judgment.<\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا جَمَعَ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ يَوْمَ الْقِيَامَةِ يُرْفَعُ لِكُلِّ غَادِرٍ لِوَاءٌ فَقِيلَ هَذِهِ غَدْرَةُ فُلاَنِ بْنِ فُلاَنٍ<\/p>\n<p><strong>When Allah gathers the earlier and later generations on the Day of Resurrection, He will raise a banner for every treacherous liar. It will be announced that this is the betrayal of this person, the son of this person.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6178, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/22\/banner-yawm-al-qiyamah\/\"><strong><em>Muttafaqun Alayhi<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْإِيمَانُ قَيَّدَ الْفَتْكَ لَا يَفْتِكُ مُؤْمِنٌ<\/p>\n<p><strong>Faith has prohibited assassination. A believer does not assassinate.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2769, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/20\/believers-do-not-assassinate\/\">Sahih li ghayrihi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا إِيمَانَ لِمَنْ لَا أَمَانَةَ لَهُ وَلَا دِينَ لِمَنْ لَا عَهْدَ لَهُ<\/p>\n<p><strong>There is no faith for one who cannot be trusted. There is no religion for one who cannot uphold a covenant.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 12383, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/13\/no-iman-cannot-promise\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>Some people claim Muslims cannot be trusted because the Prophet ﷺ noted, “War is deception,” and Muslims are allegedly at war with the entire non-Muslim world, but this is false. The Prophet was only expressing the same fundamental truth as Sun Tzu in his famous treatise on warfare, “All warfare is based on deception.”<\/p>\n<p>In Islam, deceiving the enemy is only permitted as a necessary tactic in war, such as misdirecting troop movements, conducting covert reconnaissance, and confusing the enemy.<\/p>\n<p>Ka’b ibn Malik reported: When the Prophet, peace and blessings be upon him, intended to set out on a military expedition, he would pretend to go somewhere else. The Prophet would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَرْبُ خَدْعَةٌ<\/p>\n<p><strong>War is deception.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 2637, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/02\/war-is-deceit\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>The Prophet ﷺ said this because it is a limited exception to the general rule of truthfulness.<\/p>\n<p>If the Muslims accept a treaty or make a promise to the enemy, they are obligated to be faithful to it. This rule is so strict that it must be upheld even at the cost of disadvantaging Muslim forces. Those who violated the peace were sometimes threatened with capital punishment because sabotaging a legitimate truce is an extreme act of wickedness against everyone involved.<\/p>\n<p>The Caliph Umar ibn al-Khattab, may Allah be pleased with him, wrote to a commander in an army he had dispatched, saying:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّهُ بَلَغَنِي أَنَّ رِجَالًا مِنْكُمْ يَطْلُبُونَ الْعِلْجَ حَتَّى إِذَا أَسْنَدَ فِي الْجَبَلِ وَامْتَنَعَ قَالَ رَجُلٌ مَطْرَسْ يَقُولُ لَا تَخَفْ فَإِذَا أَدْرَكَهُ قَتَلَهُ وَإِنِّي وَالَّذِي نَفْسِي بِيَدِهِ لَا أَعْلَمُ مَكَانَ وَاحِدٍ فَعَلَ ذَلِكَ إِلَّا ضَرَبْتُ عُنُقَهُ<\/p>\n<p>I have heard that it is the habit of some of your men to chase an unbeliever until he takes refuge in a high place. Then a man tells him in Persian not to be afraid, and when he comes down, they kill him. By the One in whose hand is my soul, if I knew a man had done that once, I would strike his neck.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/03\/13\/umar-execute-for-treachery\/\">al-Muwaṭṭa’ Riwāyat Yaḥyā 2\/448<\/a><\/p><\/blockquote>\n<p>And Umar said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاللَّهِ لَوْ أَنَّ أَحَدَكُمْ أَشَارَ بِأُصْبُعِهِ إِلَى السَّمَاءِ إِلَى مُشْرِكٍ فَنَزَلَ إِلَيْهِ عَلَى ذَلِكَ فَقَتَلَهُ لَقَتَلْتُهُ بِهِ<\/p>\n<p>By Allah, if one of you were to give a gesture of safety to an idolater and he came trusting you and you killed him, then I would execute him for it.<\/p>\n<p>Source: Sunan Sa’īd ibn Manṣūr 2597, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/03\/13\/umar-execute-for-treachery\/\"><em>Qawi li ghayrihi<\/em><\/a><\/p><\/blockquote>\n<p>In one instance, a peace treaty was signed between the Caliph Mu’waiyyah and the Romans. Mu’waiyyah was marching his army towards their country so that when the covenant came to an end, he would attack them by surprise. A man came riding on a horse, shouting, “Allah is Most Great! Allah is Most Great! Let there be faithfulness and not treachery!” The Caliph sent for him and questioned him, so the man said he heard the Prophet, peace and blessings be upon him, say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَ بَيْنَهُ وَبَيْنَ قَوْمٍ عَهْدٌ فَلَا يَحُلَّنَّ عَهْدًا وَلَا يَشُدَّنَّهُ حَتَّى يَمْضِيَ أَمَدُهُ أَوْ يَنْبِذَ إِلَيْهِمْ عَلَى سَوَاءٍ<\/p>\n<p><strong>If one has a covenant with people, he must not unilaterally modify it until its term comes to an end, or he brings it to an end in agreement with them.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1580, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/12\/19\/treachery-forbidden-haram\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>Thus, Mu’waiyah returned with his army. Dispatching the troops before the end of the treaty was technically an unlawful act of war itself, and a surprise attack would inevitably undermine any possibility of reconciliation or peace, so the Caliph recognized his mistake and pulled back his troops. Faithfulness to eternal Islamic values is far more important than any temporary, tactical military advantage.<\/p>\n<p>The moral teachings of Islam were paramount to the Salaf. They feared Allah more than their enemies. They were worried that their own sins were more dangerous than their foes because sins cause the loss of Allah’s assistance in their struggle, as well as punishment in the Hereafter.<\/p>\n<p>The Caliph ‘Umar ibn ‘Abdul ‘Aziz, may Allah have mercy on him, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَلا تَكُنْ فِي شَيْءٍ مِنْ عَدَاوَةِ عَدُوِّكَ أَشَدَّ احْتِرَاسًا لِنَفْسِكَ وَمَنْ مَعَكَ مِنْ مَعَاصِي اللَّهِ فَإِنَّ الذُّنُوبَ أَخْوَفُ عِنْدِي عَلَى النَّاسِ مِنْ مَكِيدَةِ عَدُوِّهِمْ<\/p>\n<p>There is nothing of the hostility of your enemies that deserves more caution than your own selves and those with you who are sinfully disobedient to Allah. For I fear the sins of the people more than the plots of their enemies.<\/p>\n<p>Source: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/08\/23\/umar-jihad-our-sins-more-harmful\/\">Ḥilyat al-Awliyā’ 5\/302<\/a><\/p><\/blockquote>\n<p>In every circumstance, either before or during hostilities, Islam has forbidden every type of war crime and transgression for the purpose of minimizing bloodshed, destruction, religious persecution, and suffering as much as possible.<\/p>\n<p>Shaykh Wahbah al-Zuhayli, an internationally recognized expert on Islamic law, summarizes the rules of armed jihad:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">شرع القتال في سبيل الله لرد العدوان وحماية الدعوة وحرية الدين الإلهي كان تشريع القتال متصفا بالعدل والحق فهو لا اعتداء فيه على أحد ولا يتجاوز فيه ما تقتضيه الضرورة الحربية وليس الهدف منه التدمير والتخريب ولا الإرهاب المجرد فلا يقتل غير المقاتلين ولا تقتل النساء والصبيان ونحوهم من الرهبان والعجزة والمرضى والشيوخ ولا تقطع الزروع والثمار ولا تذبح الحيوانات إلا لمأكلة كما جاء في الوصايا النبوية ووصايا الخلفاء الراشدين لم يكن القتال لإكراه الناس على اعتناق الإسلام فذلك منفي أصلا في شريعة القرآن<\/p>\n<p>Fighting in the way of Allah was legislated to repel aggression, to protect the call to Islam and freedom for the divine religion. The legislation of fighting is characterized by justice and truth, as there is no aggression against anyone and no excess of what is required by military necessity. Its aim is not destruction, sabotage, or simply terrorism. Non-combatants are not to be killed, nor are women, children, and the like of monks, the infirm, the sick, and the elderly. Crops and fruits are not to be cut down, and animals are not to be slaughtered except for food, as stated in the Prophetic instructions and the instructions of the Rightly-Guided Caliphs. Fighting is not to force people to embrace Islam, as that is fundamentally denied in the law of the Quran.<\/p>\n<p>Source: al-Tafsīr al-Munīr 2\/183<\/p><\/blockquote>\n<p>To conclude, jihad is a broad concept in Islam that includes both spiritual and military meanings. The spiritual jihad to purify one’s heart is the most important, often classified by scholars as ‘the greater jihad.’ The physical or ‘lesser jihad’ is nevertheless an essential duty upon Muslims to protect their countries, save the oppressed, and remove obstructions that prevent people from accepting Islam of their own free will. The rules of engagement in jihad prohibit the killing of civilians, initiating wars without legal justification, or acting treacherously towards the enemy.<\/p>\n<p><em>Success comes from Allah, and Allah knows best.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;The one who strives in jihad is the one who strives against himself.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[7],"tags":[61,183,26,511,32,37,38,39,43,47,48,54,93,84,91,98,179],"class_list":["post-25452","post","type-post","status-publish","format-standard","hentry","category-sunnah","tag-call-to-islam-dawah","tag-day-of-resurrection-yawm-al-qiyammah","tag-forgiveness-al-maghfirah","tag-hearts-al-qulub","tag-hereafter-akhirah","tag-idolatry-shirk","tag-imam-abu-hanifah","tag-imam-ahmad-ibn-hanbal","tag-imam-malik","tag-jihad","tag-justice-adl","tag-mercy-al-rahmah","tag-moderation-al-wasitiyyah","tag-purification-of-the-soul-tazkiyyat-al-nafs","tag-righteous-predecessors-al-salaf-al-salih","tag-unbelief-al-kufr","tag-virtue-al-fadilah"],"aioseo_notices":[],"jetpack_featured_media_url":"","jetpack_shortlink":"https:\/\/wp.me\/p5YGRL-6Cw","jetpack-related-posts":[{"id":17171,"url":"https:\/\/www.abuaminaelias.com\/purpose-armed-jihad-islam\/","url_meta":{"origin":25452,"position":0},"title":"Purpose of armed jihad in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"He who fights to make the word of Allah highest...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18429,"url":"https:\/\/www.abuaminaelias.com\/offensive-jihad-in-islam\/","url_meta":{"origin":25452,"position":1},"title":"Offensive jihad in Islam?","author":"Abu Amina Elias","date":"December 9, 2016","format":false,"excerpt":"\"Verily, Allah does not love transgressors.\"","rel":"","context":"In &quot;Noble Quran القرآن الكريم&quot;","block_context":{"text":"Noble Quran القرآن الكريم","link":"https:\/\/www.abuaminaelias.com\/category\/noble-quran\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":16093,"url":"https:\/\/www.abuaminaelias.com\/dar-al-harb-explained\/","url_meta":{"origin":25452,"position":2},"title":"Dar al-Harb: Islam at war with the world?","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"If the enemy inclines to peace, you incline to it also...\"","rel":"","context":"In &quot;Wisdom الحكمة&quot;","block_context":{"text":"Wisdom الحكمة","link":"https:\/\/www.abuaminaelias.com\/category\/wisdom-hikmah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":13203,"url":"https:\/\/www.abuaminaelias.com\/comprehensive-meaning-jihad\/","url_meta":{"origin":25452,"position":3},"title":"Comprehensive meaning of jihad in Islam","author":"Abu Amina Elias","date":"July 4, 2016","format":false,"excerpt":"\"The Mujahid wages jihad against himself.\"","rel":"","context":"In &quot;Faith الإيمان&quot;","block_context":{"text":"Faith الإيمان","link":"https:\/\/www.abuaminaelias.com\/category\/faith-iman\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":15973,"url":"https:\/\/www.abuaminaelias.com\/jihad-sixth-pillar-of-islam\/","url_meta":{"origin":25452,"position":4},"title":"Jihad is the sixth pillar of Islam?","author":"Abu Amina Elias","date":"August 2, 2014","format":false,"excerpt":"\"Islam is built upon five pillars...\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":24157,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-on-jihad\/","url_meta":{"origin":25452,"position":5},"title":"Forty Hadith on Jihad","author":"Abu Amina Elias","date":"September 1, 2023","format":false,"excerpt":"\"He who fights to raise the word of Allah is in the way of Allah.\"","rel":"","context":"In &quot;Sunnah السنة&quot;","block_context":{"text":"Sunnah السنة","link":"https:\/\/www.abuaminaelias.com\/category\/sunnah\/"},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25452","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=25452"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/posts\/25452\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=25452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/categories?post=25452"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/tags?post=25452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}