

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.ikhwanis.com/print.cfm?krjoiqo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:37 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Al-Ikhwan al-Muslimoon  | Hasan Al-Banna: Ahl Us-Sunnah and the Shiah Are the Same, Upon Purity, United by the Kalimah</title>
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/layout/ikhwanis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Al-Ikhwan al-Muslimoon </strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Hasan Al-Banna: Ahl Us-Sunnah and the Shiah Are the Same, Upon Purity, United by the Kalimah</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Saturday, July, 27 2013 and
 filed under <a href="categories/kx-figureheads.html">Figureheads</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/hasan-al-banna.html">
Hasan Al-Banna 
</a> &#149; <a href="tags/rafidah.html">
Rafidah 
</a> &#149; <a href="tags/shiah.html">
Shiah 
</a> &#149; <a href="tags/shiites.html">
Shi'ites 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><div align=center><img src=../ikhwanis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
<font class='titleHeadline'>Hasan al-Banna: Ahl us-Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> are the Same, Upon Purity, United by the Kalimah</font>    <P>
Hasan al-Banna founded his organization "al-Ikhwan al-Muslimeen" upon the principle that anyone who says "<i>Laa ilaaha illallaaha</i>" can join his organization in order to work towards a collective goal - and this includes the <a href='tags/rafidah.html' class='tagLink'><font class='tagLink'>Rafidah</font></a> <a href='tags/shiah-cf.html' class='tagLink'><font class='tagLink'><a href="tags/shiah.html" class="tagLink"><font class="tagLink">Shi'ah</font></a></font></a> - for he strove to bring nearness, cordiality and unity between Ahl us-Sunnah and the <a href='tags/shiah-cf.html' class='tagLink'><font class='tagLink'><a href="tags/shiah.html" class="tagLink"><font class="tagLink">Shi'ah</font></a></font></a>. The following quote is from Umar al-Tilmisani, one of the supreme leaders of al-Ikhwan:    <P>
<div class='arabic' align='right' lang='AR-SA'>  <blockquote dir="rtl">  &#1608;&#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607; &#1575;&#1604;&#1571;&#1582;&#1610;&#1585; (&#1584;&#1603;&#1585;&#1610;&#1575;&#1578; &#1604;&#1575; &#1605;&#1584;&#1603;&#1585;&#1575;&#1578;)&#1591;1- &#1583;&#1575;&#1585; &#1575;&#1604;&#1575;&#1593;&#1578;&#1589;&#1575;&#1605; 1985 &#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1571;&#1587;&#1578;&#1575;&#1584; &#1593;&#1605;&#1585; &#1575;&#1604;&#1578;&#1604;&#1605;&#1587;&#1575;&#1606;&#1610; &#1589;249 &#1608;250:    <P>
  &#1608;&#1601;&#1610; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1610;&#1606;&#1575;&#1578; &#1593;&#1604;&#1609; &#1605;&#1575; &#1571;&#1584;&#1603;&#1585; &#1603;&#1575;&#1606; &#1575;&#1604;&#1587;&#1610;&#1583; &#1575;&#1604;&#1602;&#1605;&#1610;-&#1608;&#1607;&#1608; &#1588;&#1610;&#1593;&#1610; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576;- &#1610;&#1606;&#1586;&#1604; &#1590;&#1610;&#1601;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1585;&#1603;&#1586; &#1575;&#1604;&#1593;&#1575;&#1605; &#1608;&#1608;&#1602;&#1578;&#1607;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1575;&#1604;&#1588;&#1607;&#1610;&#1583;  &#1610;&#1593;&#1605;&#1604; &#1580;&#1575;&#1583;&#1575;&#1611; &#1593;&#1604;&#1609; &#1575;&#1604;&#1578;&#1602;&#1585;&#1610;&#1576; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; ,&#1581;&#1578;&#1609; &#1604;&#1575; &#1610;&#1578;&#1582;&#1584; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1604;&#1601;&#1585;&#1602;&#1577; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1605;&#1606;&#1601;&#1584;&#1575; &#1610;&#1593;&#1605;&#1604;&#1608;&#1606; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604;&#1607; &#1593;&#1604;&#1609; &#1578;&#1605;&#1586;&#1610;&#1602; &#1575;&#1604;&#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; ,&#1608;&#1587;&#1571;&#1604;&#1606;&#1575;&#1607; &#1610;&#1608;&#1605;&#1575;&#1611; &#1593;&#1606; &#1605;&#1583;&#1609; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; ,&#1601;&#1606;&#1607;&#1575;&#1606;&#1575; &#1593;&#1606; &#1575;&#1604;&#1583;&#1582;&#1608;&#1604; &#1601;&#1610; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1575;&#1574;&#1604; &#1575;&#1604;&#1588;&#1575;&#1574;&#1603;&#1577; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1610;&#1604;&#1610;&#1602; &#1576;&#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1606; &#1610;&#1588;&#1594;&#1604;&#1608;&#1575; &#1571;&#1606;&#1601;&#1587;&#1607;&#1605; &#1576;&#1607;&#1575; &#1608;&#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1608;&#1606; &#1593;&#1604;&#1609; &#1605;&#1575; &#1606;&#1585;&#1609; &#1605;&#1606; &#1578;&#1606;&#1575;&#1576;&#1584; &#1610;&#1593;&#1605;&#1604; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1593;&#1604;&#1609; &#1573;&#1588;&#1593;&#1575;&#1604; &#1606;&#1575;&#1585;&#1607; ,&#1602;&#1604;&#1606;&#1575; &#1604;&#1601;&#1590;&#1610;&#1604;&#1578;&#1607; : &#1606;&#1581;&#1606; &#1604;&#1575; &#1606;&#1587;&#1571;&#1604; &#1593;&#1606; &#1607;&#1584;&#1575; &#1604;&#1604;&#1578;&#1593;&#1589;&#1576; &#1571;&#1608; &#1578;&#1608;&#1587;&#1593;&#1577; &#1604;&#1607;&#1608;&#1577; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1604;&#1603;&#1606;&#1606;&#1575; &#1606;&#1587;&#1571;&#1604; &#1604;&#1604;&#1593;&#1604;&#1605; ,&#1604;&#1571;&#1606;&#1617;&#1614; &#1605;&#1575; &#1576;&#1610;&#1606; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1605;&#1584;&#1603;&#1608;&#1585; &#1601;&#1610; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1604;&#1575; &#1581;&#1589;&#1585; &#1604;&#1607;&#1575; &#1608;&#1604;&#1610;&#1587; &#1604;&#1583;&#1610;&#1606;&#1575; &#1605;&#1606; &#1587;&#1593;&#1577; &#1575;&#1604;&#1608;&#1602;&#1578; &#1605;&#1575; &#1610;&#1605;&#1603;&#1606;&#1606;&#1575; &#1605;&#1606; &#1575;&#1604;&#1576;&#1581;&#1579; &#1601;&#1610; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1585;&#1575;&#1580;&#1593; . &#1601;&#1602;&#1575;&#1604; &#1585;&#1590;&#1608;&#1575;&#1606; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; :  <blockquote>   &#1575;&#1593;&#1604;&#1605;&#1608;&#1575; &#1571;&#1606;&#1617;&#1614; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1605;&#1587;&#1604;&#1605;&#1608;&#1606; &#1578;&#1580;&#1605;&#1593;&#1607;&#1605; &#1603;&#1604;&#1605;&#1577; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575;&#1617;&#1614; &#1575;&#1604;&#1604;&#1607; &#1608;&#1571;&#1606;&#1617;&#1614; &#1605;&#1581;&#1605;&#1583;&#1575;&#1611; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1608;&#1607;&#1584;&#1575; &#1571;&#1589;&#1604; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; ,&#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1601;&#1610;&#1607; &#1587;&#1608;&#1575;&#1569; &#1608;&#1593;&#1604;&#1609; &#1575;&#1604;&#1578;&#1602;&#1575;&#1569; ,&#1571;&#1605;&#1575; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606;&#1607;&#1605;&#1575; &#1601;&#1607;&#1608; &#1601;&#1610; &#1571;&#1605;&#1608;&#1585; &#1605;&#1606; &#1575;&#1604;&#1605;&#1605;&#1603;&#1606; &#1575;&#1604;&#1578;&#1602;&#1585;&#1610;&#1576; &#1601;&#1610;&#1607;&#1575; &#1576;&#1610;&#1606;&#1607;&#1605;&#1575;</blockquote>      </blockquote>  </div>    <P>
<blockquote class='quote'><img src='../ikhwanis.com/images/quote-start.gif'>And in his latest book, "<i>Dhikriyyaat, Laa Mudhakkaraat</i>" (1st print, Dar al-I'tisaam, 1985), the Ustaadh, Umar at-Tilmisaanee says (pp. 249-250):    <P>
And in the forties from what I recall, Sayyid al-Qummee - and he is Shi'ite in his madhhab - came as a guest of the Ikhwaan at the main headquarters, and at this time, the Imaam, Shaheed (i.e. al-Banna) was [undertaking] serious action in bringing proximity between the madhaahib, so that the enemies of Islaam do not take the splitting between the madhaahib as a means through which they can work to tear apart the Islamic unity. We asked him one day about the extent of the difference between Ahl us-Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a>, but he prohibited us from entering into the likes of these thorny issues which are not befitting for the Muslims to become occupied with, with the Muslims already upon what we see of separation, the enemies of Islaam work to kindle its fire, so we said to his eminence: We do not ask this due to partisanship or to widen the difference between the Muslims, but we ask due to knowledge because what is between the Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> (of difference) is mentioned in the authored books that are innumerable, and we do not have the time that will allow us to investigate all those sources. So he, may Allaah be pleased with him, said:    <P>
<blockquote>Know that Ahl us-Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> are Muslims, the kalima "There is none worthy of worship except Allaah and Muhammad is the Messenger of Allaah" unites them. And this is the foundation of the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>. And the Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> are the same (regarding that), and (they) are upon purity. As for the difference between them both, then it is in matters in which it is possible to bring them together.</blockquote></blockquote>    <P>
The Ikhwan of Hassan al-Banna was not set up to rectify the affairs of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and the Sunnah, but merely to amass large numbers which can be used to further group political interests. As a result, the foundation of walaa and baraa (loyalty and disloyalty) on the basis of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and the Sunnah was demolished and laid to waste. As a result, all sorts of doors and avenues were opened for nearness and closeness to those whose straying and deviation from what the Messenger (sallallaaahu alayhi wasallam) was alraedy plain and obvious. <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.ikhwanis.com/print.cfm?krjoiqo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:37 GMT -->
</html>


