

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.ikhwanis.com/print.cfm?nzyrotd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:47 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Al-Ikhwan al-Muslimoon  | Al-Ikhwan Al-Muslimoon: Masters of Dissimulation and Hypocrisy in Fulfilling Their Political Objectives</title>
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/layout/ikhwanis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Al-Ikhwan al-Muslimoon </strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Al-Ikhwan Al-Muslimoon: Masters of Dissimulation and Hypocrisy in Fulfilling Their Political Objectives</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Saturday, July, 27 2013 and
 filed under <a href="categories/xz-general.html">General</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/ali-ashmawi.html">
Ali Ashmawi 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><div align=center><img src=../ikhwanis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
<div class='sidebar'>  <blockquote><img src=../ikhwanis.com/assets/images/secret-history-ashmawee.gif align="right" style="margin:6px 0px 8px 15px;" border="1" width=200 height=270 border=0> <a href='tags/ali-ashmawi.html' class='tagLink'><font class='tagLink'>Ali Ashmawi</font></a> is a former Brotherhood member who was involved in the re-organization of the Brotherhood in 1965 and he had close ties with <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and others with whom he was apprehended and imprisoned. He was accused of betrayal by the Brotherhood when he wrote articles in a newspaper (later becoming the book to the right) in which he revealed unknown affairs about their methods and goals and some of their figureheads (such as Sayyid Qutb). The book of Ashmawi deals with the Ikhwaan between 1952 and 1970 and the struggles between the Free Officers (who took power after the <a href='tags/revolution.html' class='tagLink'><font class='tagLink'>revolution</font></a> in 1952) and then later between Jamal Abd al-Nasser and the Ikhwaan. In the course of that Ashmawi reveals much about the apparent goodness that the Ikhwan like to portray when in reality the apparent goodness is but a facade for the vile hizbiyyah and political machinations of the leaders whose aim is simply to gain leadership.</blockquote>   </div>    <P>
<blockquote>In the introduction to the book, "<i>The Secret History of the Muslim Brotherhood</i>" (2nd edition, p. 6), Ashmawi writes:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1585;&#1571;&#1610;&#1578; &#1571;&#1610;&#1590;&#1575;&#1611; &#1571;&#1606; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1602;&#1610;&#1575;&#1583;&#1575;&#1578; &#1575;&#1604;&#1571;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1607;&#1575;&#1585;&#1576;&#1577; &#1608;&#1575;&#1604;&#1578;&#1609; &#1578;&#1593;&#1610;&#1588; &#1601;&#1609; &#1576;&#1604;&#1575;&#1583; &#1571;&#1582;&#1585;&#1609; &#1608;&#1580;&#1583;&#1578; &#1591;&#1585;&#1610;&#1602;&#1607;&#1575; &#1604;&#1604;&#1578;&#1593;&#1575;&#1605;&#1604; &#1605;&#1593; &#1575;&#1604;&#1605;&#1575;&#1585;&#1583; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1603;&#1609; &#1575;&#1604;&#1584;&#1609; &#1581;&#1584;&#1585;&#1608;&#1606;&#1575; &#1605;&#1606;&#1607; &#1576;&#1604;  &#1608;&#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1608;&#1575; &#1603;&#1579;&#1610;&#1585;&#1575;&#1611; &#1605;&#1606; &#1575;&#1604;&#1605;&#1586;&#1575;&#1610;&#1575; &#1575;&#1604;&#1578;&#1609; &#1610;&#1603;&#1601;&#1604;&#1607;&#1575; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1603;&#1609; &#1604;&#1605;&#1606; &#1610;&#1593;&#1610;&#1588;&#1608;&#1606; &#1601;&#1609;  &#1603;&#1606;&#1601;&#1607;&#1548; &#1608;&#1608;&#1580;&#1583;&#1578; &#1571;&#1606;&#1607;&#1605; &#1610;&#1578;&#1593;&#1575;&#1605;&#1604;&#1608;&#1606; &#1576;&#1588;&#1582;&#1589;&#1610;&#1578;&#1610;&#1606; &#1608;&#1575;&#1581;&#1583;&#1577; &#1575;&#1604;&#1578;&#1588;&#1583;&#1583; &#1608;&#1576;&#1579; &#1575;&#1604;&#1580;&#1605;&#1608;&#1583; &#1601;&#1609; &#1593;&#1602;&#1608;&#1604;  &#1575;&#1604;&#1571;&#1601;&#1585;&#1575;&#1583; &#1608;&#1571;&#1582;&#1585;&#1609; &#1607;&#1610;&#1606;&#1577; &#1604;&#1610;&#1606;&#1577; &#1601;&#1609; &#1575;&#1604;&#1578;&#1593;&#1575;&#1605;&#1604; &#1605;&#1593; &#1575;&#1604;&#1587;&#1604;&#1591;&#1575;&#1578; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1603;&#1610;&#1577;&#1548; &#1602;&#1583; &#1578;&#1589;&#1604; &#1573;&#1604;&#1609;  &#1581;&#1583; &#1575;&#1604;&#1605;&#1583;&#1575;&#1607;&#1606;&#1577; &#1604;&#1604;&#1587;&#1604;&#1591;&#1575;&#1578; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1603;&#1610;&#1577; &#1576;&#1594;&#1610;&#1577; &#1573;&#1593;&#1591;&#1575;&#1574;&#1607;&#1605; &#1589;&#1608;&#1585;&#1577; &#1581;&#1587;&#1606;&#1577; &#1593;&#1606; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1603;&#1610;  &#1610;&#1601;&#1608;&#1586;&#1608;&#1575; &#1576;&#1578;&#1571;&#1610;&#1610;&#1583; &#1571;&#1605;&#1585;&#1610;&#1603;&#1575;&#1606;&#1610; &#1590;&#1583; &#1581;&#1603;&#1575;&#1605; &#1583;&#1608;&#1604;&#1607;&#1605;&#1548; &#1608;&#1603;&#1606;&#1578; &#1571;&#1593;&#1604;&#1605; &#1571;&#1606; &#1607;&#1584;&#1575; &#1606;&#1608;&#1593; &#1605;&#1606; &#1575;&#1604;&#1585;&#1610;&#1575;&#1569; &#1605;&#1605;&#1575; &#1586;&#1575;&#1583;&#1606;&#1609; &#1579;&#1608;&#1585;&#1577; &#1593;&#1604;&#1610;&#1607;&#1605; &#1604;&#1593;&#1604;&#1605;&#1609; &#1576;&#1581;&#1602;&#1610;&#1602;&#1577; &#1571;&#1605;&#1585;&#1607;&#1605; &#1608;&#1571;&#1606;&#1607;&#1605; &#1571;&#1587;&#1575;&#1578;&#1584;&#1577; &#1601;&#1609; &#1607;&#1584;&#1575;  &#1575;&#1604;&#1606;&#1608;&#1593; &#1605;&#1606; &#1575;&#1604;&#1606;&#1601;&#1575;&#1602;&#1548; &#1608;&#1604;&#1593;&#1604; &#1575;&#1604;&#1605;&#1608;&#1590;&#1608;&#1593;&#1575;&#1578; &#1575;&#1604;&#1602;&#1575;&#1583;&#1605;&#1577; &#1578;&#1578;&#1606;&#1575;&#1608;&#1604; &#1576;&#1593;&#1590; &#1575;&#1604;&#1580;&#1608;&#1575;&#1606;&#1576; &#1605;&#1606; &#1587;&#1604;&#1608;&#1603;&#1610;&#1575;&#1578;&#1607;&#1605; ... &#1571;&#1585;&#1580;&#1608; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1578;&#1601;&#1609; &#1576;&#1575;&#1604;&#1594;&#1585;&#1590;</div>    <P>
<b>Translation:</b>    <P>
<blockquote class='quote'><img src='../ikhwanis.com/images/quote-start.gif'>And I saw that many of the leaders of al-Ikhwaan who fled from (their lands) and who live in other lands found their way of dealing with the "Demonic America" they had (previously) warned us against. On the contrary, they benefited from many of the distinguishing (benefits) that it guarantees to the American society, for those who live within its confines. <b>And I found that they operate with two personalities (two faces)</b>, one which (comprises) severity, and instilling indifference (stiffness) in the minds of individuals and another which is gentle, soft in dealing with the American powers (of leadership) which often reaches the level of compromise with American powers, seeking to give them a positive image of the Ikhwaan <b>so that they can succeed in receiving American support against the <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> of their lands</b>. And I used to know that this is a type of dissimulation (and is) from what led me to rebel against them due to my knowledge of the reality of their affair and that they are (well-grounded) teachers of this type of hypocrisy. And perhaps the following topics to be covered will address some aspects of their behaviour... I hope from Allaah that it fulfils the objective.</blockquote>    <P>
<b>Notes:</b>    <P>
<blockquote>Pretty much after its inception, the organization of al-Ikhwan al-Muslimoon has been a tool of destabilization and a proxy used to help reach geo-political goals which are not really in the interests of the Muslims and their countries. Despite claiming to oppose the "Demonic West," they will make allegiances and alliances upon the principle of whatever will lead us to power, then it is obligatory to follow that course. At an individual level, a person's lust for power can be easily manipulated through the lure of apparent support in attaining that power, and just as this applies at the individual personal level, it also works with organizations and parties at higher structural levels. And this is the reality of al-Ikhwan al-Muslimeen for they have goals and agendas in the various countries including the Gulf countries, and they operate with deception, dissimulation and hypocrisy, and this in turn makes them a useful tool to bring about upheavals and changes that are not really in the interests of the Muslims, neither in their religious affairs nor their worldly ones.   </blockquote>    <P>
</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.ikhwanis.com/print.cfm?nzyrotd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:47 GMT -->
</html>


