

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.ikhwanis.com/print.cfm?aexpakq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:49:58 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Al-Ikhwan al-Muslimoon  | Shaykh Salih Al-Fawzaan Clarifies His Position Towards the Muslim Brotherhood</title>
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/layout/ikhwanis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Al-Ikhwan al-Muslimoon </strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Salih Al-Fawzaan Clarifies His Position Towards the Muslim Brotherhood</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, September, 30 2013 and
 filed under <a href="categories/xz-general.html">General</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=../ikhwanis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
<blockquote>Shaykh Saalih al-Fawzaan clarifies his firm position against al-Ikhwan al-Muslimeen:    <P>
<img src=../ikhwanis.com/assets/images/fawzan-ikhwan-clarify.png width="540" border=0>    <P>
This is the text of the clarification:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1585;&#1576; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606; &#1608;&#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1593;&#1604;&#1609; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1608;&#1593;&#1604;&#1609; &#1570;&#1604;&#1607; &#1608;&#1589;&#1581;&#1576;&#1607;.  &#1585;&#1571;&#1610;&#1610; &#1601;&#1610; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1606;&#1607;&#1605; &#1581;&#1586;&#1576;&#1610;&#1608;&#1606; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606; &#1575;&#1604;&#1578;&#1608;&#1589;&#1604; &#1573;&#1604;&#1609; &#1575;&#1604;&#1581;&#1603;&#1605; &#1608;&#1604;&#1575; &#1610;&#1607;&#1578;&#1605;&#1608;&#1606; &#1576;&#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1573;&#1604;&#1609; &#1578;&#1589;&#1581;&#1610;&#1581; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1604;&#1575; &#1610;&#1601;&#1585;&#1602;&#1608;&#1606; &#1601;&#1610; &#1571;&#1578;&#1576;&#1575;&#1593;&#1607;&#1605; &#1576;&#1610;&#1606; &#1575;&#1604;&#1587;&#1606;&#1610; &#1608;&#1575;&#1604;&#1576;&#1583;&#1593;&#1610;.  &#1608;&#1605;&#1575; &#1580;&#1575;&#1569; &#1601;&#1610; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1588;&#1601;&#1607;&#1610; &#1575;&#1604;&#1605;&#1587;&#1580;&#1604; &#1593;&#1606;&#1610; &#1601;&#1607;&#1608; &#1587;&#1576;&#1618;&#1602; &#1604;&#1587;&#1575;&#1606; &#1604;&#1575; &#1610;&#1594;&#1610;&#1585; &#1605;&#1606; &#1585;&#1571;&#1610;&#1610; &#1601;&#1610;&#1607;&#1605; &#1588;&#1610;&#1574;&#1575;.    <P>
&#1603;&#1578;&#1576;&#1607; &#1589;&#1575;&#1604;&#1581; &#1576;&#1606; &#1601;&#1608;&#1586;&#1575;&#1606; &#1575;&#1604;&#1601;&#1608;&#1586;&#1575;&#1606; 26/5/1433    <P>
&#1575;&#1604;&#1578;&#1608;&#1602;&#1610;&#1593;</div>    <P>
And here is a translation:    <P>
<blockquote class='quote'><img src='../ikhwanis.com/images/quote-start.gif'>All praise is due to Allaah, the Lord of the worlds, and may salaat and salaam be upon our Prophet Muhammad, upon his family and companionship.    <P>
My view about the <a href='tags/muslim-brotherhood.html' class='tagLink'><font class='tagLink'>Muslim Brotherhood</font></a> is that they are hizbiyyoon (biased partisans) who desire to acquire (reach) rulership and they are not concerned with calling to correction of the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and they do not differentiate between the sunni and bid'iyy from their followers, and what has come of recorded speech from me then that is a slip the tongue, it does not change my view regarding them in anything.    <P>
Written by Salih bin Fawzan al-Fawzaan (26/5/1433H).<BR>  Signature.  </blockquote>    <P>
This is an answer to those people who are using some prior speech of Shaykh al-Fawzaan, which the Shaykh describes as a slip of the tongue in order to mislead people about this corrupt and destructive group or organization, "<i>al-Ikhwan al-Muslimoon</i>."    <P>
</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.ikhwanis.com/print.cfm?aexpakq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:49:58 GMT -->
</html>


