

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.ikhwanis.com/print.cfm?llkxsun by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:47 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Al-Ikhwan al-Muslimoon  | Hassan Al-Banna: Meeting With Raafidees Muhammad Al-Qummee and Ayatollah Kashani</title>
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../ikhwanis.com/layout/ikhwanis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Al-Ikhwan al-Muslimoon </strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Hassan Al-Banna: Meeting With Raafidees Muhammad Al-Qummee and Ayatollah Kashani</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, July, 29 2013 and
 filed under <a href="categories/xz-general.html">General</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/hasan-al-banna.html">
Hasan Al-Banna 
</a> &#149; <a href="tags/rafidah.html">
Rafidah 
</a> &#149; <a href="tags/shiah.html">
Shiah 
</a> &#149; <a href="tags/shiites.html">
Shi'ites 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><div align=center><img src=../ikhwanis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
<font class='titleHeadline'>Hasan al-Banna and Unity With the <a href='tags/raafidah-ky.html' class='tagLink'><font class='tagLink'><a href="tags/raafidah.html" class="tagLink"><font class="tagLink">Raafidah</font></a></font></a> <a href="tags/shiah.html" class="tagLink"><font class="tagLink">Shiah</font></a></font>    <P>
<blockquote>In the book (<span class='arb' lang='AR-SA'>&#1575;&#1604;&#1605;&#1604;&#1607;&#1605; &#1575;&#1604;&#1605;&#1608;&#1607;&#1608;&#1576; - &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575;</span>) "The Inspired Gift - Hasan al-Banna", Umar at-Tilmisani, former Murshid of the Ikhwan, said (p. 78):    <P>
<div class='arabic' align='right' lang='AR-SA'><img src=../ikhwanis.com/assets/images/kashani.gif align=left hspace=8 vspace=6 border=0>&#1608;&#1576;&#1604;&#1594; &#1605;&#1606; &#1581;&#1585;&#1589;&#1607; (&#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1617;&#1614;&#1575;) &#1593;&#1604;&#1609; &#1578;&#1608;&#1581;&#1610;&#1583; &#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1606;&#1617;&#1614;&#1607; &#1603;&#1575;&#1606; &#1610;&#1585;&#1605;&#1610; &#1573;&#1604;&#1609; &#1605;&#1572;&#1578;&#1605;&#1585; &#1610;&#1580;&#1605;&#1593; &#1575;&#1604;&#1601;&#1585;&#1602; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; &#1604;&#1593;&#1604;&#1617;&#1614; &#1575;&#1604;&#1604;&#1607; &#1610;&#1607;&#1583;&#1610;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1604;&#1573;&#1580;&#1605;&#1575;&#1593; &#1593;&#1604;&#1609; &#1571;&#1605;&#1585; &#1610;&#1581;&#1608;&#1604; &#1576;&#1610;&#1606;&#1607;&#1605; &#1608;&#1576;&#1610;&#1606; &#1578;&#1603;&#1601;&#1610;&#1585; &#1576;&#1593;&#1590;&#1607;&#1605; ,&#1582;&#1575;&#1589;&#1577; &#1608;&#1571;&#1606;&#1617;&#1614; &#1602;&#1585;&#1570;&#1606;&#1606;&#1575; &#1608;&#1575;&#1581;&#1583; &#1608;&#1583;&#1610;&#1606;&#1606;&#1575; &#1608;&#1575;&#1581;&#1583; &#1608;&#1585;&#1587;&#1608;&#1604;&#1606;&#1575; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1575;&#1581;&#1583; &#1608;&#1573;&#1604;&#1607;&#1606;&#1575; &#1608;&#1575;&#1581;&#1583; &#1608;&#1604;&#1602;&#1583; &#1575;&#1587;&#1578;&#1590;&#1575;&#1601; &#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1594;&#1585;&#1590; &#1601;&#1590;&#1610;&#1604;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1575;&#1604;&#1602;&#1605;&#1610; &#1571;&#1581;&#1583; &#1603;&#1576;&#1575;&#1585; &#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1608;&#1586;&#1593;&#1605;&#1575;&#1574;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1605;&#1585;&#1603;&#1586; &#1575;&#1604;&#1593;&#1575;&#1605; &#1601;&#1578;&#1585;&#1577; &#1604;&#1610;&#1587;&#1578; &#1576;&#1575;&#1604;&#1602;&#1589;&#1610;&#1585;&#1577; .&#1603;&#1605;&#1575; &#1571;&#1606;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601; &#1571;&#1606;&#1617;&#1614; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1575;&#1604;&#1576;&#1606;&#1617;&#1614;&#1575; &#1602;&#1583; &#1602;&#1575;&#1576;&#1604; &#1575;&#1604;&#1605;&#1585;&#1580;&#1593; &#1575;&#1604;&#1588;&#1610;&#1593;&#1610; &#1570;&#1610;&#1577; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1603;&#1575;&#1588;&#1575;&#1606;&#1610; &#1571;&#1579;&#1606;&#1575;&#1569; &#1575;&#1604;&#1581;&#1580; &#1593;&#1575;&#1605; 1948 &#1608;&#1581;&#1583;&#1579; &#1576;&#1610;&#1606;&#1607;&#1605;&#1575; &#1578;&#1601;&#1575;&#1607;&#1605; &#1610;&#1588;&#1610;&#1585; &#1573;&#1604;&#1610;&#1607; &#1571;&#1581;&#1583; &#1588;&#1582;&#1589;&#1610;&#1575;&#1578; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1575;&#1604;&#1610;&#1608;&#1605; &#1608;&#1571;&#1581;&#1583; &#1578;&#1604;&#1575;&#1605;&#1584;&#1577; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1575;&#1604;&#1588;&#1607;&#1610;&#1583; &#1575;&#1604;&#1571;&#1587;&#1578;&#1575;&#1584; &#1593;&#1576;&#1583; &#1575;&#1604;&#1605;&#1578;&#1593;&#1575;&#1604; &#1575;&#1604;&#1580;&#1576;&#1585;&#1610; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607; ( &#1604;&#1605;&#1575;&#1584;&#1575; &#1575;&#1594;&#1578;&#1610;&#1604; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575; )(&#1591;1-&#1575;&#1604;&#1575;&#1593;&#1578;&#1589;&#1575;&#1605;-&#1589;32) &#1610;&#1606;&#1602;&#1604; &#1593;&#1606; &#1585;&#1608;&#1576;&#1610;&#1585; &#1580;&#1575;&#1603;&#1587;&#1608;&#1606; &#1602;&#1608;&#1604;&#1607; :  &#1608;&#1604;&#1608; &#1591;&#1575;&#1604; &#1593;&#1605;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1585;&#1580;&#1604; (&#1610;&#1602;&#1589;&#1583; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575;) &#1604;&#1603;&#1575;&#1606; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1610;&#1578;&#1581;&#1602;&#1602; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1604;&#1607;&#1584;&#1607; &#1575;&#1604;&#1576;&#1604;&#1575;&#1583; &#1582;&#1575;&#1589;&#1577; &#1604;&#1608; &#1575;&#1578;&#1601;&#1602; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575; &#1608;&#1570;&#1610;&#1577; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1603;&#1575;&#1588;&#1575;&#1606;&#1610; &#1575;&#1604;&#1586;&#1593;&#1610;&#1605; &#1575;&#1604;&#1573;&#1610;&#1585;&#1575;&#1606;&#1610; &#1593;&#1604;&#1609; &#1571;&#1606; &#1610;&#1586;&#1610;&#1604;&#1575; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606; &#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; ,&#1608;&#1602;&#1583; &#1575;&#1604;&#1578;&#1602;&#1609; &#1575;&#1604;&#1585;&#1580;&#1604;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1581;&#1580;&#1575;&#1586; &#1593;&#1575;&#1605; 48 &#1608;&#1610;&#1576;&#1583;&#1608; &#1571;&#1606;&#1607;&#1605;&#1575; &#1578;&#1601;&#1575;&#1607;&#1605;&#1575; &#1608;&#1608;&#1589;&#1604;&#1575; &#1573;&#1604;&#1609; &#1606;&#1602;&#1591;&#1577; &#1585;&#1574;&#1610;&#1587;&#1610;&#1577; &#1604;&#1608;&#1604;&#1575; &#1571;&#1606; &#1593;&#1608;&#1580;&#1604; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575; &#1576;&#1575;&#1604;&#1575;&#1594;&#1578;&#1610;&#1575;&#1604;</div>    <P>
<blockquote class='quote'><img src='../ikhwanis.com/images/quote-start.gif'>And he reached [due] to his eargerness (i.e.of Hasan al-Banna's) for unifying the word of the Muslims [the level] where he would aim for a conference that would bring together all of the Islamic sects [hoping] that Allaah may guide them [all] to consensus upon a matter that would prevent them from making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of each other specifically, and [agreement] that our <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is one, our religion is one, and our Messenger (sallallaahu alayhi wasallam) is one, and our deity is one.    <P>
And for this objective he received as a guest, the esteemed Shaykh Muhammad al-Qummee, one of the senior scholars of the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> and their leaders, at the general headquarters for a period of time that was not short. Just as it is well-known that the Imaam al-Banna had met with the Shi'ite Ayatollah Kaashaani during <a href='tags/hajj.html' class='tagLink'><font class='tagLink'>Hajj</font></a> in the year 1948 and some mutual understanding took place between them that one of the personalities of al-Ikhwan al-Muslimeen today, one of the students of the Imaam, Shaheed [al-Banna], the teacher, Abdul-Muta'aal al-Jabaree pointed to in his book "Why was <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-Banna</font></a> Assassinated" (1st print, [Dar] al-I'tisaam, p.32), quoting from Rober[t] (or perhaps Ruper[t]) Jackson his saying:    <P>
<blockquote>And if the life of this man was lengthened (meaning Hasan al-Banna) it would have been possible to actualize much for this land, especially if <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-Banna</font></a> and Ayatollah Kashani, the leader of Iran, had agreed to put an end to the differing between the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> and the Sunnah. And the two men met in the Hijaz in the year [19]48 and it appears that they acquired mutual understanding and came to [agreement] on a fundamental point, had it not been that the assassination of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-Banna</font></a> was hastened.</blockquote></blockquote>  </blockquote>    <P>
<font class='titleHeadline'>The Da'wah of <a href="tags/hasan-al-banna.html" class="tagLink"><font class="tagLink">Hasan al-Banna</font></a></font>    <P>
<blockquote>The da'wah of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-Banna</font></a> is characterized as follows:    <P>
Taking the current social, economical, and political circumstances of the Muslims as the base and foundation for devising the nature, role, direction and orientation of one's da'wah - <u>and pushing the issues of creed to the back seat</u>. Thus, the call is not to a particular creed with walaa and baraa upon it and acting upon what it necessitates. And hence, as part of this da'wah, it is permitted, rather obligatory (to al-Banna at least) to work with all the groups and parties, by putting aside differences, even if they are in fundamental issues.    <P>
This dawah was the one revived by <u>Salman al-Awdah</u> (now sitting with Sufis and Shi'ites), through his distinguishing between <i>al-firqat an-naajiyah</i> and <i>at-taa'ifat ul-mansoorah</i> (the former are all the groups of da'wah, such as Ikhwan and Tabligh and the latter is simply the cream of those groups) and it is also the one that <u>Abdur-Rahman Abdul-Khaliq</u>, revived through his doctrines of "<i>ta'addud al-jamaa'aat</i>" (multiplicity of groups), and it is also the one that <u>Abu al-Hasan al-Ma'ribi</u> revived through his doctrine of "<i>al-manhaj al-waasi'</i>" - and this "<i>fikr</i>", this way of thinking is also what the Qutbiyyah Ikhwaniyyah are upon in the West, in the US, Canada, UK and other places.</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.ikhwanis.com/print.cfm?llkxsun by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:47 GMT -->
</html>


