

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?umzta by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 3: Takfir Based Upon Mere Absence of Obedience</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 3: Takfir Based Upon Mere Absence of Obedience</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, August, 22 2011 and
 filed under <a href="categories/bd-takfir-of-muslim-masses.html">Takfir of Muslim Masses</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">




<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<div class='sidebar'>Shaykh Muhammad bin Abd al-Wahhaab responded to the claims of his adversaries that he makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslim masses in many of the letters and treatises he sent to those claimants and to others in order to dispel the false notions being spread about him as a means to hinder others from his reform  movement. Here we will present some excerpts from some of these letters for the purpose of documentation and record. These can be found in the seventh volume of the collection of his works (<span class='arb' lang='AR-SA'>&#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576;</span>), which contains all of his personal letters and correspondences.</div> <P>




<p>Shaykh Ibn Abd al-Wahhaab said (7/60):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1603;&#1584;&#1604;&#1603; &#1578;&#1605;&#1608;&#1610;&#1607;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1591;&#1594;&#1575;&#1605; &#1576;&#1571;&#1606; &#1575;&#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1610;&#1602;&#1608;&#1604;: &#1575;&#1604;&#1584;&#1610; &#1605;&#1575; &#1610;&#1583;&#1582;&#1604; &#1578;&#1581;&#1578; &#1591;&#1575;&#1593;&#1578;&#1610; &#1603;&#1575;&#1601;&#1585;&#1548; &#1608;&#1606;&#1602;&#1608;&#1604;: &#1587;&#1576;&#1581;&#1575;&#1606;&#1603; &#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605;! &#1576;&#1604; &#1606;&#1588;&#1607;&#1583; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1605;&#1575; &#1610;&#1593;&#1604;&#1605;&#1607; &#1605;&#1606; &#1602;&#1604;&#1608;&#1576;&#1606;&#1575;&#1548; &#1576;&#1571;&#1606; &#1605;&#1606; &#1593;&#1605;&#1604; &#1576;&#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583;&#1548; &#1608;&#1578;&#1576;&#1585;&#1571; &#1605;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1608;&#1571;&#1607;&#1604;&#1607;&#1548; &#1601;&#1607;&#1608; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1601;&#1610; &#1571;&#1610; &#1586;&#1605;&#1575;&#1606; &#1608;&#1571;&#1610; &#1605;&#1603;&#1575;&#1606;. &#1608;&#1573;&#1606;&#1605;&#1575; &#1606;&#1603;&#1601;&#1617;&#1585; &#1605;&#1614;&#1606; &#1571;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1573;&#1604;&#1607;&#1610;&#1578;&#1607;&#1548; &#1576;&#1593;&#1583; &#1605;&#1575; &#1606;&#1576;&#1610;&#1606; &#1604;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577; &#1593;&#1604;&#1609; &#1576;&#1591;&#1604;&#1575;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603;. </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And likewise, his distortion upon the common people that Ibn Abd al-Wahhaab says, "Whoever does not come under my obedience is a disbeliever." And we say: Sublime are you (O Lord), this is a mighty slander! Rather, we call Allaah to witness over what he knows from our hearts that whoever acts upon Tawhid and frees himself from Shirk and its people, then he is a Muslim in whatever time and place (he maybe in). But we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who associates partners with Allaah in his Ilaayhiyyah, after we have made clear to him the proof for the futility of Shirk.</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>From the claims spread by his adversaries was that Ibn Abd al-Wahhaab demands obedience to himself and whoever falls outside of his obedience is a disbeliever. He clarified this and in other places that worship is only for Allaah alone, and loyalty is to Allah and His Messenger and any person in any time or place, who is upon this, is a Muslim and the only obedience due upon him is what Allah and His Messenger have obligated, such as to the Messenger (sallallaahy alayhi wasallam) and to one's parents, and to the ruler in that which is good. But they spread this claim because they wanted to make it appear to the common people that he was trying to demand loyalty to himself. This type of intellectual <a href='tags/terrorism.html' class='tagLink'><font class='tagLink'>terrorism</font></a> was used because they could not find fault with what he actually called to, which is singling out Allaah with worship, relying upon Him alone, and soliciting benefit, repulsion of harm and intercession from Him alone.  </blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?umzta by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
</html>


