

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?ktztq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:45 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab: On the Karaamaat of the Awliyaa</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab: On the Karaamaat of the Awliyaa</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Wednesday, August, 24 2011 and
 filed under <a href="categories/hz-doubts--misconceptions.html">Misconceptions</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
When Shaykh Muhammad bin Abd al-Wahhaab began to invite the people to invoke only Allaah in matters of attaining benefit and repelling harm, instead of the righteous dead, one of the rumours and slanders spread was that they, the 'Wahhabis,' reject the Awliyaa and deny their miracles. This was part of the general agenda of intellectual <a href='tags/terrorism.html' class='tagLink'><font class='tagLink'>terrorism</font></a> aimed at silencing the da'wah of Muhammad bin Abd al-Wahhaab and those with him and to drive the people away from what is agreeable and accetable to their <a href='tags/fitrah.html' class='tagLink'><font class='tagLink'>fitrah</font></a>. Shaykh Abd Allaah bin Muhammad bin Abd al-Wahhaab stated in a treatise he wrote after 1218H as occurs in <i>al-Durar al-Saniyyah</i> (1/241):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1604;&#1575; &#1606;&#1606;&#1603;&#1585; &#1603;&#1585;&#1575;&#1605;&#1575;&#1578; &#1575;&#1604;&#1571;&#1608;&#1604;&#1610;&#1575;&#1569;&#1548; &#1608;&#1606;&#1593;&#1578;&#1585;&#1601; &#1604;&#1607;&#1605; &#1576;&#1575;&#1604;&#1581;&#1602;&#1548; &#1608;&#1571;&#1606;&#1607;&#1605; &#1593;&#1604;&#1609; &#1607;&#1583;&#1609; &#1605;&#1606; &#1585;&#1576;&#1607;&#1605;&#1548; &#1605;&#1607;&#1605;&#1575; &#1587;&#1575;&#1585;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602;&#1577; &#1575;&#1604;&#1588;&#1585;&#1593;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1602;&#1608;&#1575;&#1606;&#1610;&#1606; &#1575;&#1604;&#1605;&#1585;&#1593;&#1610;&#1577;&#1548; &#1573;&#1604;&#1575; &#1571;&#1606;&#1607;&#1605; &#1604;&#1575; &#1610;&#1587;&#1578;&#1581;&#1602;&#1608;&#1606; &#1588;&#1610;&#1574;&#1575;&#1611; &#1605;&#1606; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1575;&#1578;&#1548; &#1604;&#1575; &#1581;&#1575;&#1604; &#1575;&#1604;&#1581;&#1610;&#1575;&#1577;&#1548; &#1608;&#1604;&#1575; &#1576;&#1593;&#1583; &#1575;&#1604;&#1605;&#1605;&#1575;&#1578;&#1548; &#1576;&#1604; &#1610;&#1591;&#1604;&#1576; &#1605;&#1606; &#1571;&#1581;&#1583;&#1607;&#1605; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1601;&#1610; &#1581;&#1575;&#1604; &#1581;&#1610;&#1575;&#1578;&#1607;&#1548; &#1576;&#1604; &#1608;&#1605;&#1606; &#1603;&#1604; &#1605;&#1587;&#1604;&#1605; &#1563; &#1601;&#1602;&#1583; &#1580;&#1575;&#1569; &#1601;&#1610; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579;&#1548; "&#1583;&#1593;&#1575;&#1569; &#1575;&#1604;&#1605;&#1585;&#1569; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1605;&#1587;&#1578;&#1580;&#1575;&#1576; &#1604;&#1571;&#1582;&#1610;&#1607; " &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1608;&#1571;&#1605;&#1585; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1593;&#1605;&#1585;&#1548; &#1608;&#1593;&#1604;&#1610;&#1575;&#1611;&#1548; &#1576;&#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1575;&#1587;&#1578;&#1594;&#1601;&#1575;&#1585; &#1605;&#1606; " &#1571;&#1608;&#1610;&#1587; " &#1601;&#1601;&#1593;&#1604;&#1575; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And we do not rejet the karaamaat (miracles) of the awliyaa (righteous friends of Allaah). We acknowledge them as true annd that they (the awliyaa) are upon guidance from their Lord so long as they traversed upon the Sharee'ah and the observed principles, except that (we say) they do not deserve anything from the types of worship, neither whilst alive nor after death. Rather, supplication is requested from one of them whilst he is alive, in fact, from every Muslim for there has come in the hadeeth, "The supplication of a Muslim man for his brother is answered..." to the end of the hadeethh. And the Prophet (sallallaahu alayhi wasallam) ordered Umar and Ali to ask Uways to ask for forgiveness for them, and they did so.</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>The Shaykh of the da'wah, Muhammad bin Abd al-Wahhaab, his associates and offspring, all follow the doctrine of Ahl al-Sunnah wal-Jamaa'ah towards the Awliyaa and their miracles, except that they do not allow the directing of worship to anyone from the creation. But when this call threatened the interests of the elites, they embarked upon a propaganda campaign and used intellectual <a href='tags/terrorism.html' class='tagLink'><font class='tagLink'>terrorism</font></a> upon the masses to divert them from the da'wah. What we see in the actual writings, letters and correspondences of the leaders of the monotheistic reform  movement is in stark contrast to the dark propaganda in the books of the Sufis,  Rafidis, Nusayri Baatinees and others. </blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?ktztq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:45 GMT -->
</html>


