

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?ttvms by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 2: Retrospective Takfir of the Ummah and Takfir Bil-'Ayn</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 2: Retrospective Takfir of the Ummah and Takfir Bil-'Ayn</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, August, 22 2011 and
 filed under <a href="categories/bd-takfir-of-muslim-masses.html">Takfir of Muslim Masses</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">




<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<div class='sidebar'>Shaykh Muhammad bin Abd al-Wahhaab responded to the claims of his adversaries that he makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslim masses in many of the letters and treatises he sent to those claimants and to others in order to dispel the false notions being spread about him as a means to hinder others from his reform  movement. Here we will present some excerpts from some of these letters for the purpose of documentation and record. These can be found in the seventh volume of the collection of his works (<span class='arb' lang='AR-SA'>&#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576;</span>), which contains all of his personal letters and correspondences.</div> <P>




<p>Shaykh Muhammad bin Abd al-Wahhaab said (7/11-12) in a letter he wrote to the people of al-Qaseem who requested him to explain his creed and what he is upon:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1579;&#1605; &#1604;&#1575; &#1610;&#1582;&#1601;&#1609; &#1593;&#1604;&#1610;&#1603;&#1605;&#1548; &#1571;&#1606;&#1607; &#1576;&#1604;&#1594;&#1606;&#1610; &#1571;&#1606; &#1585;&#1587;&#1575;&#1604;&#1577; &#1587;&#1604;&#1610;&#1605;&#1575;&#1606; &#1576;&#1606; &#1587;&#1581;&#1610;&#1605; &#1602;&#1583; &#1608;&#1589;&#1604;&#1578; &#1573;&#1604;&#1610;&#1603;&#1605;&#1548; &#1608;&#1571;&#1606;&#1607; &#1602;&#1576;&#1604;&#1607;&#1575; &#1608;&#1589;&#1583;&#1602;&#1607;&#1575; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1606;&#1578;&#1605;&#1610;&#1606; &#1604;&#1604;&#1593;&#1604;&#1605; &#1601;&#1610; &#1580;&#1607;&#1578;&#1603;&#1605;&#1563; &#1608;&#1575;&#1604;&#1604;&#1607; &#1610;&#1593;&#1604;&#1605; &#1571;&#1606; &#1575;&#1604;&#1585;&#1580;&#1604; &#1575;&#1601;&#1578;&#1585;&#1609; &#1593;&#1604;&#1610;&#1617;&#1614; &#1571;&#1605;&#1608;&#1585;&#1575;&#1611; &#1604;&#1605; &#1571;&#1602;&#1604;&#1607;&#1575;&#1548; &#1608;&#1604;&#1605; &#1610;&#1571;&#1578; &#1571;&#1603;&#1579;&#1585;&#1607;&#1575; &#1593;&#1604;&#1609; &#1576;&#1575;&#1604;&#1610;.   &#1601;&#1605;&#1606;&#1607;&#1575;: &#1602;&#1608;&#1604;&#1607;: &#1573;&#1606;&#1610; &#1605;&#1576;&#1591;&#1604; &#1603;&#1578;&#1576; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1602;&#1608;&#1604;: &#1573;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1587;&#1578;&#1605;&#1575;&#1574;&#1577; &#1587;&#1606;&#1577; &#1604;&#1610;&#1587;&#1608;&#1575; &#1593;&#1604;&#1609; &#1588;&#1610;&#1569;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1583;&#1593;&#1610; &#1575;&#1604;&#1575;&#1580;&#1578;&#1607;&#1575;&#1583;&#1548; &#1608;&#1573;&#1606;&#1610; &#1582;&#1575;&#1585;&#1580; &#1593;&#1606; &#1575;&#1604;&#1578;&#1602;&#1604;&#1610;&#1583;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1602;&#1608;&#1604;: &#1573;&#1606; &#1575;&#1582;&#1578;&#1604;&#1575;&#1601; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1606;&#1602;&#1605;&#1577;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1603;&#1601;&#1617;&#1585; &#1605;&#1606; &#1578;&#1608;&#1587;&#1604; &#1576;&#1575;&#1604;&#1589;&#1575;&#1604;&#1581;&#1610;&#1606;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1603;&#1601;&#1617;&#1585; &#1575;&#1604;&#1576;&#1608;&#1589;&#1610;&#1585;&#1610; &#1604;&#1602;&#1608;&#1604;&#1607;: &#1610;&#1575; &#1571;&#1603;&#1585;&#1605; &#1575;&#1604;&#1582;&#1604;&#1602;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1602;&#1608;&#1604;: &#1604;&#1608; &#1571;&#1602;&#1583;&#1585; &#1593;&#1604;&#1609; &#1607;&#1583;&#1605; &#1602;&#1576;&#1577; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607;  &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1604;&#1607;&#1583;&#1605;&#1578;&#1607;&#1575;&#1548; &#1608;&#1604;&#1608; &#1571;&#1602;&#1583;&#1585; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1593;&#1576;&#1577; &#1604;&#1571;&#1582;&#1584;&#1578; &#1605;&#1610;&#1586;&#1575;&#1576;&#1607;&#1575; &#1608;&#1580;&#1593;&#1604;&#1578; &#1604;&#1607;&#1575; &#1605;&#1610;&#1586;&#1575;&#1576;&#1575;&#1611; &#1605;&#1606; &#1582;&#1588;&#1576;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1581;&#1585;&#1605; &#1586;&#1610;&#1575;&#1585;&#1577; &#1602;&#1576;&#1585; &#1575;&#1604;&#1606;&#1576;&#1610;  &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1606;&#1603;&#1585; &#1586;&#1610;&#1575;&#1585;&#1577; &#1602;&#1576;&#1585; &#1575;&#1604;&#1608;&#1575;&#1604;&#1583;&#1610;&#1606; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;&#1575;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1603;&#1601;&#1617;&#1585; &#1605;&#1606; &#1581;&#1604;&#1601; &#1576;&#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1603;&#1601;&#1617;&#1585; &#1575;&#1576;&#1606; &#1575;&#1604;&#1601;&#1575;&#1585;&#1590; &#1608;&#1575;&#1576;&#1606; &#1593;&#1585;&#1576;&#1610;&#1548; &#1608;&#1573;&#1606;&#1610; &#1571;&#1581;&#1585;&#1602; &#1583;&#1604;&#1575;&#1574;&#1604; &#1575;&#1604;&#1582;&#1610;&#1585;&#1575;&#1578; &#1608;&#1585;&#1608;&#1590; &#1575;&#1604;&#1585;&#1610;&#1575;&#1581;&#1610;&#1606; &#1608;&#1571;&#1587;&#1605;&#1610;&#1607; &#1585;&#1608;&#1590; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606;.  &#1580;&#1608;&#1575;&#1576;&#1610; &#1593;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1575;&#1574;&#1604;&#1548; &#1571;&#1606; &#1571;&#1602;&#1608;&#1604;: &#1587;&#1576;&#1581;&#1575;&#1606;&#1603; &#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605;! &#1608;&#1602;&#1576;&#1604;&#1607; &#1605;&#1606; &#1576;&#1607;&#1578; &#1605;&#1581;&#1605;&#1583;&#1575;&#1611;  &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1571;&#1606;&#1607; &#1610;&#1587;&#1576; &#1593;&#1610;&#1587;&#1609; &#1576;&#1606; &#1605;&#1585;&#1610;&#1605; &#1608;&#1610;&#1587;&#1576; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581;&#1610;&#1606;&#1548; &#1601;&#1578;&#1588;&#1575;&#1576;&#1607;&#1578; &#1602;&#1604;&#1608;&#1576;&#1607;&#1605; &#1576;&#1575;&#1601;&#1578;&#1585;&#1575;&#1569; &#1575;&#1604;&#1603;&#1584;&#1576; &#1608;&#1602;&#1608;&#1604; &#1575;&#1604;&#1586;&#1608;&#1585;.  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It should not be hidden to you that it has reached me that the letter of Sulayman bin Saheem (an adversary) has reached you and that some of those ascribing to knowledge in your direction have accepted it and believed it. And Allaah knows that the man has fabricated many affairs against me which I have never expressed, and which most of them have never come to my mind. From them:    <P>
<blockquote>His saying that I invalidate the books of the four schools of thought. <b>And that I say the people have not been upon any (deen) since six-hundred years</b>. And that I claim independent ijtihaad and that I have departed from taqleed (of the schools) and that I say the differing of the Scholars (in jurisprudence) is a punishment, vengeance. And that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of those who make tawassul through the righteous. And that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of al-Buwaysiree due to his saying, "O most-noble of the creation..."  And that I say if I was able to destroy to the dome of the Messenger of Allaah (sallallaahu alayhi wasallam), I would have destroyed it, and that if I was able I would have taken its lining and replace it with lining of wood. And that I prohibit visiting the grave of the Prophet (sallallaahu alayhi wasallam) and that I prohibit visiting the graves of [ones] parents and others. And that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who swears by other than Allaah. And that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of Ibn al-Faarid and Ibn Arabi, and that I burn the book Dalaa'il al-Khayraat and Rawd al-Riyaaheen and that I label it as Rawd al-Shayaateen. </blockquote>    <P>
My answer to all these matters is: Sublime are you (O  Lord), this is a mighty slander! But before this, Muhammad (sallallaahu alayhi wasallam) was slandered with the claim that he reviles Eesaa bin Maryam, and that he reviles the righteous (dead). So their hearts resemble each other with fabrication of lies and false witness.  </blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>There is one particular matter that needs commenting on which is that Ahl al-Sunnah wal-Jamaa'ah distinguish between judging a belief, saying or act of disbelief and between judging a person who  might fall into such a belief, saying or act to be a disbeliever (this is referred to as <i>takfir bil-'ayn</i>). This is from the firmly established <a href='tags/shariah.html' class='tagLink'><font class='tagLink'>Shariah</font></a> principles which Ahl al-Sunnah adhere to, and Shaykh Ibn Abd al-Wahhaab is upon the same methodology. See <a href=http://www.salaf.com/s/?ptpjose>this article</a> for more elaboration. Thus, while a scholar may write and explain that certain affairs constitute disbelief with <a href='tags/shariah.html' class='tagLink'><font class='tagLink'>Shariah</font></a> evidences, this does not necessitate that everyone who falls into them becomes an automatic disbeliever. Rather, no one becomes a disbeliever except after the establishment of the proof. This is because there are many plausible scenarios that prevent the judgement of disbelief being applied to a person from them a) misunderstanding, faulty interpretation b) ignorance c) compulsion d) pure, genuine error. These matters themselves require separate study and this is not the place to elaborate.    <P>
Once this is clear, then when Shaykh Ibn Abd al-Wahhaab began to clarify the same matters that those before him had clarified with respect to the Tawhid of the Messengers, and rightfully described many of the beliefs and practices as constituting disbelief, many of the bigoted partisans and those whose interests where threatened began to spread lies that he makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslim masses and of specific figures that were dear to them, such as al-Buwaysiree and others. This was a type of intellectual <a href='tags/terrorism.html' class='tagLink'><font class='tagLink'>terrorism</font></a> employed to scare the Muslim masses away from learning the reality of the Tawhid of the Messengers, because none of these people were able to find fault with the actual teaching of Ibn Abd al-Wahhab, and his evidences and his arguments. As for the common masses, then Shaykh Muhammad Ibn Abd al-Wahhaab did not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of them. He made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one to whom the reality of the Tawhid of the Messengers became clear and apparent, then hated it, drove others away from it and fought against its adherents (<a href=index13c6.html?hgybz>see this article</a>).</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?ttvms by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
</html>


