

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?asnof by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:53 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Ahmad Bin Ali al-Maqrizi al-Shafi'i (d. 845H) on Tawhid, Shirk, Rububiyyah, Uluhiyyah, Shafaa'ah</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Ahmad Bin Ali al-Maqrizi al-Shafi'i (d. 845H) on Tawhid, Shirk, Rububiyyah, Uluhiyyah, Shafaa'ah</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Sunday, August, 21 2011 and
 filed under <a href="categories/yz-monotheism.html">Monotheism</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<b><a href=maqrizi-tajrid-surah-naas6b4a.pdf?a=hcnbxm>Download as PDF File</a></b>    <P>
<img src=assets/images/maqrizi-tajreed-cover.gif align=right border=1 hspace=8 vspace=6 border=0>He is Ahmad bin Ali al-Maqrizi al-Misree <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> (d. 845H), he was first upon the madhhab of Abu Hanifah (rahimahullaah), following his maternal grandfather in that, then he became a Shafi'ite at the age of twenty, when his father died, and he heard and took <a href='tags/knowledge.html' class='tagLink'><font class='tagLink'>knowledge</font></a> from al-Siraaj al-Balqini, al-Haythami, Zayn al-Din al-Iraqi, al-Tanukhi and others who were from the scholars of Shaam and Makkah.    <P>
The intent in this article is to indicate the futility and falsehood of the allegations or arch-liars such as <a href=categories/cj-lies-of-ahmad-dahlan.html>Ahmad Dahlan</a> who claimed that distinguishing between Allah's Rububiyyah and Uluhiyyah, and rejecting the solicitation of intercession from the righteous dead through calling upon them and what is like that is a Wahhabite <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a>. Al-Maqrizi preceded Shaykh Ibn Abd al-Wahhaab by 250 years, indicating that Ibn Abd al-Wahhaab brought nothing new from himself. Al-Maqrizi wrote a book called <i>Tajreed al-Tawhid al-Mufeed</i>, "Laying Bare the Beneficial Tawhid" (Dar Umar bin al-Khattaab, Cairo, 1428H). The book as a whole is an excellent short treatise, it is a shame not to be able to translate it all, but we only have time to extract the relevant parts from the opening passages by which arch-liars such as <a href=categories/cj-lies-of-ahmad-dahlan.html>Ahmad Dahlan</a> and others are exposed for the intellectual and academic fraudsters they surely were when they used intellectual <a href='tags/terrorism.html' class='tagLink'><font class='tagLink'>terrorism</font></a> against the masses to warn them from the reform movement of Ibn Abd al-Wahhaab and his followers by lying about what he was calling to.    <P>
<font class='titleHeadline'>Al-Maqrizi on Distinguishing Between Rubiyyah and Uluhiyyah</font>    <P>
Al-Maqrizi wrote, writing about the reality of the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of the Prophets and Messengers (titles in square brackets are ours to highlight the points being made by al-Maqrizi):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1575;&#1593;&#1604;&#1605; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1585;&#1576; &#1603;&#1604; &#1588;&#1610;&#1569; &#1608;&#1605;&#1575;&#1604;&#1603;&#1607; &#1608;&#1573;&#1604;&#1607;&#1607;&#1615; :  &#1601;&#1575;&#1604;&#1585;&#1576; &#1605;&#1589;&#1583;&#1585; &#1585;&#1576;&#1617; &#1610;&#1585;&#1614;&#1576;&#1617;&#1615; &#1585;&#1576;&#1617;&#1575;&#1611; &#1601;&#1607;&#1608; &#1585;&#1575;&#1576;&#1617;&#1612; : &#1601;&#1605;&#1593;&#1606;&#1609; &#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; {&#1585;&#1614;&#1576;&#1617;&#1616; &#1575;&#1604;&#1618;&#1593;&#1614;&#1575;&#1604;&#1614;&#1605;&#1616;&#1610;&#1606;&#1614;} &#1585;&#1575;&#1576;&#1617;&#1616; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606; &#1548; &#1601;&#1573;&#1606; &#1575;&#1604;&#1585;&#1576; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1607;&#1608; &#1575;&#1604;&#1582;&#1575;&#1604;&#1602; &#1575;&#1604;&#1605;&#1608;&#1580;&#1583; &#1604;&#1593;&#1576;&#1575;&#1583;&#1607; &#1548; &#1575;&#1604;&#1602;&#1575;&#1574;&#1605; &#1576;&#1578;&#1585;&#1576;&#1610;&#1578;&#1607;&#1605; &#1608;&#1573;&#1589;&#1604;&#1575;&#1581;&#1607;&#1605; &#1605;&#1606; &#1582;&#1614;&#1604;&#1602;&#1613; &#1608;&#1585;&#1586;&#1602;&#1613; &#1608;&#1593;&#1575;&#1601;&#1610;&#1577; &#1608;&#1573;&#1589;&#1604;&#1575;&#1581; &#1583;&#1610;&#1606; &#1608;&#1583;&#1606;&#1610;&#1575; .  &#1608;&#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1603;&#1608;&#1606; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583; &#1610;&#1578;&#1582;&#1584;&#1608;&#1606;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1605;&#1581;&#1576;&#1608;&#1576;&#1575;&#1611; &#1605;&#1571;&#1604;&#1608;&#1607;&#1575;&#1611; &#1608;&#1610;&#1601;&#1585;&#1583;&#1608;&#1606;&#1607; &#1576;&#1575;&#1604;&#1581;&#1576; &#1608;&#1575;&#1604;&#1582;&#1608;&#1601; &#1608;&#1575;&#1604;&#1585;&#1580;&#1575;&#1569; &#1608;&#1575;&#1604;&#1573;&#1582;&#1576;&#1575;&#1578; &#1608;&#1575;&#1604;&#1578;&#1608;&#1576;&#1577; &#1608;&#1575;&#1604;&#1606;&#1584;&#1585; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1608;&#1575;&#1604;&#1591;&#1604;&#1576; &#1608;&#1575;&#1604;&#1578;&#1608;&#1603;&#1604; &#1548; &#1608;&#1606;&#1581;&#1608; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1588;&#1610;&#1575;&#1569;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Know that Allaah, the Sublime is the Rabb (Lord) of everything, its Maalik (Owner, Master) and Deity (Ilaah). <b>[Regarding the meaning of al-Rabb]</b>. Al-Rabb is the verbal noun of rabba (to nurture), yarabbu rabban (he nurtured a nurturing) hence he is raabb (the one who nurtures).  So the meaning of His, the Exalted's saying, "The Lord (Rabb) of all the Worlds" is that he is the Raabb of all the worlds, for the Lord, the Sublime and Exalted is the Creator, Originator of His servants, the one who nurtures them and rectifies them through creation,  <a href='tags/provision.html' class='tagLink'><font class='tagLink'>provision</font></a>, good health, and rectifying their religious and wordly (lives). <b>[Regarding the meaning of Ilaayhiyyah]</b>. And Ilaahiyyah is when the servants take  Him, the Sublime, as the beloved, worshipped, and they single Him out with love, <a href='tags/fear.html' class='tagLink'><font class='tagLink'>fear</font></a>, hope, <a href='tags/humility.html' class='tagLink'><font class='tagLink'>humility</font></a>, repentance, making oath, obedience, making request (through supplication), reliance and the likes of these things.</blockquote>    <P>
A little later he says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1604;&#1576;&#1575;&#1576; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1571;&#1606; &#1610;&#1585;&#1609; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1603;&#1604;&#1607;&#1575; &#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1548; &#1579;&#1605; &#1610;&#1602;&#1591;&#1593; &#1575;&#1604;&#1575;&#1604;&#1578;&#1601;&#1575;&#1601; &#1573;&#1604;&#1609; &#1575;&#1604;&#1608;&#1587;&#1575;&#1574;&#1591; &#1608;&#1571;&#1606; &#1610;&#1593;&#1576;&#1583;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1593;&#1576;&#1575;&#1583;&#1577; &#1610;&#1601;&#1585;&#1583;&#1607; &#1576;&#1607;&#1575; &#1608;&#1604;&#1575; &#1610;&#1593;&#1576;&#1583; &#1594;&#1610;&#1585;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the essential core of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> (Monotheism) is that (a person) considers all things to be within Allaah the Exalted's control and thereafter to cut off turning to intermediaries, and to worship Him, the Sublime, with worship that He is singled out with, and that he does not worship others...</blockquote>    <P>
And shortly after al-Maqrizi writes:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1604;&#1575; &#1585;&#1610;&#1576; &#1571;&#1606; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577; &#1604;&#1605; &#1610;&#1606;&#1603;&#1585;&#1607; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1608;&#1606; &#1548; &#1576;&#1604; &#1571;&#1602;&#1585;&#1608;&#1575; &#1576;&#1571;&#1606;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1581;&#1583;&#1607; &#1582;&#1575;&#1604;&#1602;&#1607;&#1605; &#1608;&#1582;&#1575;&#1604;&#1602; &#1575;&#1604;&#1587;&#1605;&#1575;&#1608;&#1575;&#1578; &#1608;&#1575;&#1604;&#1571;&#1585;&#1590; &#1548; &#1608;&#1575;&#1604;&#1602;&#1575;&#1574;&#1605; &#1576;&#1605;&#1589;&#1575;&#1604;&#1581; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1603;&#1604;&#1607; &#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1571;&#1606;&#1603;&#1585;&#1608;&#1575; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1608;&#1575;&#1604;&#1605;&#1581;&#1576;&#1577; &#1603;&#1605;&#1575; &#1602;&#1583; &#1581;&#1603;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1606;&#1607;&#1605; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; {&#1608;&#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1610;&#1578;&#1582;&#1584; &#1605;&#1606; &#1583;&#1608;&#1606; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606;&#1583;&#1575;&#1583;&#1575; &#1610;&#1581;&#1576;&#1608;&#1606;&#1607;&#1605; &#1603;&#1581;&#1576; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1584;&#1610;&#1606; &#1570;&#1605;&#1606;&#1608;&#1575; &#1571;&#1588;&#1583; &#1581;&#1576;&#1575; &#1604;&#1604;&#1607;} . &#1601;&#1604;&#1605;&#1575; &#1587;&#1608;&#1608;&#1575; &#1594;&#1610;&#1585;&#1607; &#1576;&#1607; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1603;&#1575;&#1606;&#1608;&#1575; &#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; {&#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1575;&#1604;&#1584;&#1610; &#1582;&#1604;&#1602; &#1575;&#1604;&#1587;&#1605;&#1575;&#1608;&#1575;&#1578; &#1608;&#1575;&#1604;&#1571;&#1585;&#1590; &#1608;&#1580;&#1593;&#1604; &#1575;&#1604;&#1592;&#1604;&#1605;&#1575;&#1578; &#1608;&#1575;&#1604;&#1606;&#1608;&#1585; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1603;&#1601;&#1585;&#1608;&#1575; &#1576;&#1585;&#1576;&#1607;&#1605; &#1610;&#1593;&#1583;&#1604;&#1608;&#1606;} .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><b>[Tawhid al-Rububiyyah Must Be Accompanied by <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> al-Uluhiyyah]</b>. And there is no doubt that the Mushriks did not reject <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> al-Rububiyyah. Rather they affirmed that He alone, the Sublime, is their creator, and the creator of the heavens and earth, and the one who looks after the affairs of all of the universe. But they rejected <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> al-Ilaahiyyah wal-Mahabbah, just as Allaah, the Exalted, stated about them, "<b>And amongst mankind are those who take rivals (in worship) besides Allaah, loving them with the love only due to Allaah. But those who believe are most severe in  their love of Allaah</b>" (2:165). So when they equated others besides Him in this <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a>, they became Mushriks, justs as Allaah, the Exalted said, "<b>All praise is due to Allaah who created the heavens and earth and made the darknesses and the light. But then those who disbelieve, turn away from their Lord (to other deities)</b>." (6:1)</blockquote>    <P>
And later he says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1601;&#1604;&#1575; &#1608;&#1604;&#1610;&#1617;&#1614; &#1608;&#1604;&#1575; &#1581;&#1614;&#1603;&#1614;&#1605;&#1614; &#1608;&#1604;&#1575; &#1585;&#1576; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1584;&#1610; &#1605;&#1606; &#1593;&#1614;&#1583;&#1614;&#1604;&#1614; &#1576;&#1607; &#1594;&#1610;&#1585;&#1607; &#1601;&#1602;&#1583; &#1571;&#1588;&#1585;&#1603; &#1601;&#1610; &#1571;&#1604;&#1608;&#1607;&#1610;&#1578;&#1607;&#1616;&#1548; &#1608;&#1604;&#1608; &#1608;&#1581;&#1583; &#1585;&#1576;&#1608;&#1576;&#1610;&#1578;&#1607; &#1548; &#1601;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1575;&#1580;&#1578;&#1605;&#1593;&#1578; &#1601;&#1610;&#1607; &#1575;&#1604;&#1582;&#1604;&#1575;&#1574;&#1602; &#1548; &#1605;&#1572;&#1605;&#1606;&#1607;&#1575; &#1608;&#1603;&#1575;&#1601;&#1585;&#1607;&#1575; &#1548; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1605;&#1601;&#1585;&#1602; &#1575;&#1604;&#1591;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1572;&#1605;&#1606;&#1610;&#1606; &#1608;&#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Thus there is no protecter, judge, or lord except Allaah, the one whom if a person turned to another besides Him would have associated a partner with Him in His Uluhiyyah (right to be worshipped alone), even if he singled Him out in Rububiyyah. For <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> al-Rububiyyah is that which the entire creation, the believers and disbelievers amongst them, are agreed upon. It is <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> al-Uluhiyyah which separates the path between the believers and the mushriks...</blockquote>    <P>
And after this he says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1576;&#1607;&#1584;&#1575; &#1575;&#1604;&#1575;&#1593;&#1578;&#1576;&#1575;&#1585; &#1575;&#1604;&#1584;&#1610; &#1602;&#1585;&#1585;&#1606;&#1575; &#1576;&#1607; &#1575;&#1604;&#1573;&#1604;&#1607; &#1548; &#1608;&#1571;&#1606;&#1607; &#1575;&#1604;&#1605;&#1581;&#1576;&#1608;&#1576; &#1604;&#1575;&#1580;&#1578;&#1605;&#1575;&#1593; &#1589;&#1601;&#1575;&#1578; &#1575;&#1575;&#1604;&#1603;&#1605;&#1575;&#1604; &#1601;&#1610;&#1607; &#1603;&#1575;&#1606; &#1575;&#1604;&#1604;&#1607; &#1607;&#1608; &#1575;&#1604;&#1575;&#1587;&#1605; &#1575;&#1604;&#1580;&#1575;&#1605;&#1593; &#1604;&#1580;&#1605;&#1610;&#1593; &#1605;&#1593;&#1575;&#1606;&#1610; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1581;&#1587;&#1606;&#1609; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1593;&#1604;&#1610;&#1575; &#1548; &#1608;&#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1606;&#1603;&#1585;&#1607; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1608;&#1606; &#1608;&#1610;&#1581;&#1578;&#1580; &#1575;&#1604;&#1585;&#1576; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1604;&#1610;&#1607;&#1605; &#1576;&#1578;&#1608;&#1581;&#1610;&#1583;&#1607;&#1605; &#1585;&#1576;&#1608;&#1576;&#1610;&#1578;&#1607; &#1593;&#1604;&#1609; &#1578;&#1608;&#1581;&#1610;&#1583; &#1571;&#1604;&#1608;&#1607;&#1610;&#1578;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And upon this consideration which we have corroborated (the real meaning of) al-ilaah and that He is the adored, beloved one due to all the qualities of perfection having united in Him, then "Allaah" is the name that brings together all of the meanings of the beautiful names and the lofty attributes, and this is what was rejected by the Mushriks and the Lord, the Sublime and Exalted, argued by their [affirmation of] <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> in His Rububiyyah for the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> in His Uluhiyyah...</blockquote>    <P>
Then he cites Surah al-An'aam (6:59-60) as an example of the evidences in the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> through which Allaah argues for His Uluhiyyah through illustrating His Rububiyyah, and then he says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1576;&#1575;&#1604;&#1580;&#1605;&#1604;&#1577; &#1601;&#1607;&#1608; &#1578;&#1593;&#1575;&#1604;&#1609; &#1610;&#1581;&#1578;&#1580; &#1593;&#1604;&#1609; &#1605;&#1606;&#1603;&#1585;&#1610; &#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1576;&#1573;&#1579;&#1576;&#1575;&#1578;&#1607;&#1605; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And in short, He, the Exalted, argues against the deniers of His Uluhiyyah by [mentioning] their affirmation of His Rububiyyah...</blockquote>    <P>
Then al-Maqrizi makes an amazing point regarding Surah al-Nas, the last surah in the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> in that Allaah mentions three beautiful names, al-Rabb (Lord), al-Malik (Master) and al-Ilah (Deity) in that order, and that there is a gradation involved in that al-Rabb comprises an affirmation that He is their creator and originator. However, this on its own is not sufficient. Thereafter He mentioned Himself as the Malik al-Nas (Master, Owner of mankind), and the master is one who command and prohibits. This is indicative that the command (al-amr) belongs to Him. So far with these two names we have al-khalq and al-amr, and this is what occurs in Surah al-A'raaf, "<b>Verily to Him belongs al-khalq (creating) and al-amr (commanding)</b>" (7:54). And then He referred to Himself as Ilaah al-Nas (Deity of mankind). And this indicates He is the one loved, adored, venerated and worshipped by them. And thus, this completes the meaning of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> in this surah.    <P>
After this he mentions that none one affirmed another creator besides Allaah aside from the Magian pagans (dualists), and indicates the falsehood of their view. Then he proceeds to mention the <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> that occurred in the various nations and so he says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1588;&#1585;&#1603; &#1575;&#1604;&#1571;&#1605;&#1605; &#1603;&#1604;&#1607; &#1606;&#1608;&#1593;&#1575;&#1606; : &#1588;&#1585;&#1603; &#1601;&#1610; &#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1548; &#1608;&#1588;&#1585;&#1603; &#1601;&#1610; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577;. &#1601;&#1575;&#1604;&#1588;&#1585;&#1603; &#1601;&#1610; &#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1608;&#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1607;&#1608; &#1575;&#1604;&#1594;&#1575;&#1604;&#1576; &#1593;&#1604;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1573;&#1588;&#1585;&#1575;&#1603; &#1548; &#1608;&#1607;&#1608; &#1588;&#1585;&#1603; &#1593;&#1576;&#1575;&#1583; &#1575;&#1604;&#1571;&#1589;&#1606;&#1575;&#1605; &#1608;&#1593;&#1576;&#1575;&#1583; &#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577; &#1608;&#1593;&#1576;&#1575;&#1583; &#1575;&#1604;&#1580;&#1606; &#1608;&#1593;&#1576;&#1575;&#1583; &#1575;&#1604;&#1605;&#1588;&#1575;&#1610;&#1582; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581;&#1610;&#1606; &#1575;&#1604;&#1571;&#1581;&#1610;&#1575;&#1569; &#1608;&#1575;&#1604;&#1571;&#1605;&#1608;&#1575;&#1578; &#1575;&#1604;&#1584;&#1610;&#1606; &#1602;&#1575;&#1604;&#1608;&#1575; {&#1605;&#1614;&#1575; &#1606;&#1614;&#1593;&#1618;&#1576;&#1615;&#1583;&#1615;&#1607;&#1615;&#1605;&#1618; &#1573;&#1616;&#1604;&#1617;&#1614;&#1575; &#1604;&#1616;&#1610;&#1615;&#1602;&#1614;&#1585;&#1617;&#1616;&#1576;&#1615;&#1608;&#1606;&#1614;&#1575; &#1573;&#1616;&#1604;&#1614;&#1609; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; &#1586;&#1615;&#1604;&#1618;&#1601;&#1614;&#1609;} &#1608;&#1610;&#1588;&#1601;&#1593;&#1608;&#1575; &#1604;&#1606;&#1575; &#1593;&#1606;&#1583;&#1607; &#1548; &#1608;&#1610;&#1606;&#1575;&#1604;&#1606;&#1575; &#1576;&#1587;&#1576;&#1576; &#1602;&#1585;&#1576;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1603;&#1585;&#1575;&#1605;&#1578;&#1607; &#1604;&#1607;&#1605; &#1602;&#1585;&#1576; &#1608;&#1603;&#1585;&#1575;&#1605;&#1577; &#1548; &#1603;&#1605;&#1575; &#1607;&#1608; &#1575;&#1604;&#1605;&#1593;&#1607;&#1608;&#1583; &#1601;&#1610; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1605;&#1606; &#1581;&#1589;&#1608;&#1604; &#1575;&#1604;&#1603;&#1585;&#1575;&#1605;&#1577; &#1608;&#1575;&#1604;&#1586;&#1604;&#1601;&#1609; &#1604;&#1605;&#1606; &#1610;&#1582;&#1583;&#1605; &#1571;&#1593;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1604;&#1603; &#1608;&#1571;&#1602;&#1575;&#1585;&#1576;&#1607; &#1608;&#1582;&#1575;&#1589;&#1578;&#1607; . &#1608;&#1575;&#1604;&#1603;&#1578;&#1576; &#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1603;&#1604;&#1607;&#1575; &#1605;&#1606; &#1571;&#1608;&#1604;&#1607;&#1575; &#1573;&#1604;&#1609; &#1570;&#1582;&#1585;&#1607;&#1575; &#1578;&#1576;&#1591;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576; &#1608;&#1578;&#1585;&#1583;&#1607; &#1608;&#1578;&#1602;&#1576;&#1581; &#1571;&#1607;&#1604;&#1607; &#1608;&#1578;&#1606;&#1589; &#1593;&#1604;&#1609; &#1571;&#1606;&#1607;&#1605; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1548; &#1608;&#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1585;&#1587;&#1604; &#1589;&#1604;&#1608;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607;&#1605; &#1605;&#1578;&#1601;&#1602;&#1608;&#1606; &#1593;&#1604;&#1609; &#1584;&#1604;&#1603; &#1605;&#1606; &#1571;&#1608;&#1604;&#1607;&#1605; &#1573;&#1604;&#1609; &#1570;&#1582;&#1585;&#1607;&#1605; &#1548; &#1608;&#1605;&#1575; &#1571;&#1607;&#1604;&#1603; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1605;&#1606; &#1575;&#1604;&#1571;&#1605;&#1605; &#1573;&#1604;&#1575; &#1576;&#1587;&#1576;&#1576; &#1607;&#1584;&#1575; &#1575;&#1604;&#1588;&#1585;&#1603; &#1608;&#1605;&#1606; &#1571;&#1580;&#1604;&#1607; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The polytheism of the various nations is of two types: <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> in Ilaahiyyah and <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> in Rububiyyah.     <P>
The <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> in Ilaahiyyah and Ibaadah (worship) is the predominant one amongst the people of polytheism.  <b>This is the <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> of the worshippers of the idols, and worshippers of the Angels, and worshippers of the Jinn, and the worshippers of the Shaykhs and the righteous, both the living and the dead</b>. These are the ones who said, "<b>We do not worship them except that they may bring us closer to Allaah</b>" (39:3), and that they may intercede for us with Allaah, and that due to their nearness to Allaah and His honouring of them, we may receive nearness and honour, just as it takes place in the [life of the] world, when nearnness and nobility is attained by the one who serves the helpers of the king, and his relatives and his special associates.     <P>
All of the Divine Books, from their very first to their last, came to invalidate this madhhab (doctrine), to refute it, and to revile it's people and to textually state that they are the enemies of Allaah, the Exalted. And all of the Messengers (salawaat of Allaah be upon them all) are united upon that, the first of them to the last of them. And Allaah, the Exalted, never destroyed any of the nations except due to this <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a>, and because of it.</blockquote>    <P>
Now that's one hardcore 'Wahhabi' for you from the ninth century hijrah, two and half centuries before Shaykh Muhammad bin Abd al-Wahhab. This establishes <a href=categories/cj-lies-of-ahmad-dahlan.html>Ahmad Dahlan</a> and his likes to be dishonest followers of desires. Then al-Maqrizi explains the error of these people in that they give such love and devotion (worship) to others besides Allaah that is due only to Allaah, so they set up rivals and equals to Him. After this reiterates:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1605;&#1593;&#1604;&#1608;&#1605; &#1602;&#1591;&#1593;&#1575; &#1571;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1578;&#1587;&#1608;&#1610;&#1577; &#1604;&#1605; &#1578;&#1603;&#1606; &#1576;&#1610;&#1606;&#1607;&#1605; &#1608;&#1576;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1603;&#1608;&#1606;&#1607; &#1585;&#1576;&#1607;&#1605; &#1608;&#1582;&#1575;&#1604;&#1602;&#1607;&#1605; &#1548; &#1601;&#1573;&#1606;&#1607;&#1605; &#1603;&#1575;&#1606;&#1608;&#1575; &#1603;&#1605;&#1575; &#1571;&#1582;&#1576;&#1585; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605; &#1605;&#1602;&#1585;&#1610;&#1606; &#1576;&#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1581;&#1583;&#1607; &#1607;&#1608; &#1585;&#1576;&#1607;&#1605; &#1608;&#1582;&#1575;&#1604;&#1602;&#1607;&#1605; &#1608;&#1571;&#1606; &#1575;&#1604;&#1571;&#1585;&#1590; &#1608;&#1605;&#1606; &#1601;&#1610;&#1607;&#1575; &#1604;&#1604;&#1607; &#1608;&#1581;&#1583;&#1607; &#1608;&#1571;&#1606;&#1607; &#1585;&#1576; &#1575;&#1604;&#1587;&#1605;&#1575;&#1608;&#1575;&#1578; &#1575;&#1604;&#1587;&#1576;&#1593; &#1608;&#1585;&#1576; &#1575;&#1604;&#1593;&#1585;&#1588; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605; &#1548; &#1608;&#1571;&#1606;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1576;&#1610;&#1583;&#1607; &#1605;&#1604;&#1603;&#1608;&#1578; &#1603;&#1604; &#1588;&#1610;&#1569; &#1608;&#1607;&#1608; &#1610;&#1580;&#1610;&#1585; &#1608;&#1604;&#1575; &#1610;&#1580;&#1575;&#1585; &#1593;&#1604;&#1610;&#1607; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And it is known with absolute certainty that this equivocation of theirs was not between them (the other deities) and Allaah in the issue of His being their Lord and Creator, for they, as Allaah has informed about them, used to affirm that Allaah alone, the Exalted, is their Lord and Creator and that the earth and whatever is within it belongs to Allaah alone and that He is the Lord of the seven heavens and the Lord of the Mighty Throne, and that He, the Sublime and Exalted, is the one in whose hand is the dominion of everything, and that He is the one who grants protection, but not can grant protection from Him... </blockquote>    <P>
After this he states that the proof for the invalidation of this <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> is greater than can be enumerated in the revealed texts. Then he mentions the other <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a>, the <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> in Rububiyyah, and he mentions that those who fell into it were the Magian pagans (dualists) and likewise the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a>. We can now make some notes on what has preceded:    <P>
<font class='titleHeadline'>Summary Notes</font>    <P>
<blockquote>Al-Maqrizi who died in 845H, more than  two and a half  centuries before Muhammad bin Abd al-Wahhaab was born, and who was a Shafi'ite, having studied under al-Siraj al-Balqini, and al-Haythami and Zayn al-Din al-Iraqi, has preceded Shaykh Ibn Abd al-Wahhaab in clarifying the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of the Messengers in the precise manner outlined.     <P>
He explained that Allaah is the Rabb, Malik and Ilaah, and that Rububiyyah is the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of Allaah's actions (of creating, owning, providing etc.), and that Uluhiyyah is the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of the servants actions (in worship of their Lord). He explained that the Mushriks never rejected the Rububiyyah of Allaah. Rather, they showed rejection towards the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of Uluhiyyah and Mahabbah. He said that it was this <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> that distinguished between the believer (in Tawhid) and the pagans.    <P>
He explained that the crux of the matter is that Allah is the ilaah (deity in truth) because His name, Allaah, combines and represents all the beautiful names and perfect attributes, which necessitate only He is worshipped alone. However, it is as if the pagans reject and deny this Ilaahiyyah of Allaah, and thus Allaah argues against them through their acknowledgement of His Rububiyyah. Hence, the one who calls upon others besides Allaah, such as the saints and righteous dead and prophets, and solicits their intercession from them, this person is in essence rejecting that Allaah is al-Shafee' (owner of all intercession), and the one who responds to the supplicant when he supplicates, and other such names and attributes which are applicable. Because if he truly believed in them, he would have turned only to Allaah.    <P>
He explains that the <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> of all nations is of two types, <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> in Uluhiyyah and <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> in Rububiyyah. He explains that those who worship the Angels, Prophets, the Shaykhs and the Righteous all fall into the <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> of Uluhiyyah, and he explained their justifiation, which is that they claimed that they are simply seeking nearness to Allaah and to win their intercession. These are the very same matters explained by <a href='tags/fakhr-al-din-al-razi.html' class='tagLink'><font class='tagLink'>Fakhr al-Din al-Razi</font></a> (d. 606H), more than two and a half centuries before al-Maqrizi, and almost six centuries before Ibn Abd al-Wahhaab (<a href=indexdd19.html?qwrwa>see this article</a>).    <P>
Then he emphasized that when they made these other deities equal to Allaah it was certainly not in respect to Rububiyyah, because they affirmed all of that without any question.    <P>
<div class='sidebar'>If you reflect upon all of the above, and also reflect upon what is found in the speech of al-Razi (<a href=indexdd19.html?qwrwa>see this article</a>), and Ibn Aqeel (<a href=index2e94.html?yuitd>see this article</a>)  - both of whom lived <u>over six centuries</u> before Muhammad bin Abd al-Wahhaab - you will come to realize that bankrupt and intellectual fraudsters like <a href=categories/cj-lies-of-ahmad-dahlan.html>Ahmad Dahlan</a> only relied upon the ignorance of the masses in order to mobilize them and instill hatred in their hearts towards the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> which the Messengers brought. In reality, what these people know is that the common-people will see the simplicity and beauty of the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of the Messengers, and their <a href='tags/fitrah.html' class='tagLink'><font class='tagLink'><a href="tags/fitrah-uj.html" class="tagLink"><font class="tagLink">fitrah</font></a></font></a> will recognize it as truth, but because many of these Shaykhs and authorities have vested interests, bigotry and partisanship, and have  much to lose (of status, followers and perhaps material benefit too), they deceived the common-folk, put barriers and veils in front of them by spreading propaganda against those who called to the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'><a href="tags/tawhid-eu.html" class="tagLink"><font class="tagLink">tawhid</font></a></font></a> of the Messengers, so that the common-folk remain where they are and upon what they are upon, and the status-quo is not changed.</div>    <P>
</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?asnof by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:53 GMT -->
</html>


