

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?qhybo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 4: Takfir and Hijrah</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 4: Takfir and Hijrah</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Tuesday, August, 23 2011 and
 filed under <a href="categories/bd-takfir-of-muslim-masses.html">Takfir of Muslim Masses</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">




<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<div class='sidebar'>Shaykh Muhammad bin Abd al-Wahhaab responded to the claims of his adversaries that he makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslim masses in many of the letters and treatises he sent to those claimants and to others in order to dispel the false notions being spread about him as a means to hinder others from his reform  movement. Here we will present some excerpts from some of these letters for the purpose of documentation and record. These can be found in the seventh volume of the collection of his works (<span class='arb' lang='AR-SA'>&#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576;</span>), which contains all of his personal letters and correspondences.</div> <P>




<p>Shaykh Ibn Abd al-Wahhaab said (in the section, <i>Fataawaa wa Masaa'il</i>, 4/11):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1603;&#1584;&#1576; &#1608;&#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606;&#1548; &#1601;&#1605;&#1579;&#1604; &#1602;&#1608;&#1604;&#1607;&#1605;: &#1573;&#1606;&#1575; &#1606;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1608;&#1606;&#1608;&#1580;&#1576; &#1575;&#1604;&#1607;&#1580;&#1585;&#1577; &#1573;&#1604;&#1610;&#1606;&#1575; &#1593;&#1604;&#1609; &#1605;&#1606; &#1602;&#1583;&#1585; &#1593;&#1604;&#1609; &#1573;&#1592;&#1607;&#1575;&#1585; &#1583;&#1610;&#1606;&#1607;&#1548; &#1608;&#1571;&#1606;&#1575; &#1606;&#1603;&#1601;&#1617;&#1585; &#1605;&#1606; &#1604;&#1605; &#1610;&#1603;&#1601;&#1617;&#1585; &#1608;&#1605;&#1606; &#1604;&#1605; &#1610;&#1602;&#1575;&#1578;&#1604;&#1548; &#1608;&#1605;&#1579;&#1604; &#1607;&#1584;&#1575; &#1608;&#1571;&#1590;&#1593;&#1575;&#1601; &#1571;&#1590;&#1593;&#1575;&#1601;&#1607;. &#1601;&#1603;&#1604; &#1607;&#1584;&#1575; &#1605;&#1606; &#1575;&#1604;&#1603;&#1584;&#1576; &#1608;&#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1589;&#1583;&#1608;&#1606; &#1576;&#1607; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;. &#1608;&#1573;&#1584;&#1575; &#1603;&#1606;&#1575; &#1604;&#1575; &#1606;&#1603;&#1601;&#1617;&#1585; &#1605;&#1614;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1589;&#1606;&#1605; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1609; &#1602;&#1576;&#1585; &#1593;&#1576;&#1583; &#1575;&#1604;&#1602;&#1575;&#1583;&#1585;&#1548; &#1608;&#1575;&#1604;&#1589;&#1606;&#1605; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1609; &#1602;&#1576;&#1585; &#1571;&#1581;&#1605;&#1583; &#1575;&#1604;&#1576;&#1583;&#1608;&#1610;&#1548; &#1608;&#1571;&#1605;&#1579;&#1575;&#1604;&#1607;&#1605;&#1575;&#1548; &#1604;&#1571;&#1580;&#1604; &#1580;&#1607;&#1604;&#1607;&#1605; &#1608;&#1593;&#1583;&#1605; &#1605;&#1606; &#1610;&#1606;&#1576;&#1607;&#1607;&#1605;&#1548; &#1601;&#1603;&#1610;&#1601; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1604;&#1605; &#1610;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1573;&#1584;&#1575; &#1604;&#1605; &#1610;&#1607;&#1575;&#1580;&#1585; &#1573;&#1604;&#1610;&#1606;&#1575;&#1548; &#1608;&#1604;&#1605; &#1610;&#1603;&#1601;&#1617;&#1585; &#1608;&#1610;&#1602;&#1575;&#1578;&#1604;&#1567; &#1587;&#1615;&#1576;&#1618;&#1581;&#1614;&#1575;&#1606;&#1614;&#1603;&#1614; &#1607;&#1614;&#1584;&#1614;&#1575; &#1576;&#1615;&#1607;&#1618;&#1578;&#1614;&#1575;&#1606;&#1612; &#1593;&#1614;&#1592;&#1616;&#1610;&#1605;&#1612;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And as for the lie and slander, then it is like their saying that we make generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> (of the masses), and that we make emigration (hijrah) obligatory towards us for the one who is able to manifest his religion, and that we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who does not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and who does not fight, and multiple times the likes of this (type of lying and slander). All of this  is from lying and slander by which they hinder the people from the deen of Allaah and His Messenger. And when it is the case that we do not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who worships the idol (i.e. tomb) which is on the grave of Abd al-Qadir, and the idol which is on the grave of Ahmad al-Badawi and their likes, due to their ignorance, and the absence of the one to notify them (of their opposition), then how could we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of  the one who does not associate partners with Allaah, when he does not emigrate to us and who does not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and does not fight? "<b>Glory be to you (O Lord), this is a mighty slander</b>." (24:16)</blockquote>    <P>
And in al-Durar al-Saniyyah (10/131), there occurs the statement of Shaykh Ibn Abd al-Wahhaab in one of his letters;    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1605;&#1575; &#1584;&#1603;&#1585; &#1604;&#1603;&#1605; &#1593;&#1606;&#1610; &#1571;&#1606;&#1610; &#1571;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1601;&#1607;&#1584;&#1575; &#1605;&#1606; &#1576;&#1607;&#1578;&#1575;&#1606; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1602;&#1608;&#1604;&#1607;&#1605;: &#1573;&#1606;&#1610; &#1571;&#1602;&#1608;&#1604;: &#1605;&#1606; &#1578;&#1576;&#1593; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1608;&#1607;&#1608; &#1587;&#1575;&#1603;&#1606; &#1601;&#1610; &#1576;&#1604;&#1583;&#1607; &#1571;&#1606;&#1607; &#1605;&#1575; &#1610;&#1603;&#1601;&#1610;&#1607; &#1581;&#1578;&#1609; &#1610;&#1580;&#1610;&#1569; &#1593;&#1606;&#1583;&#1610;&#1548; &#1601;&#1607;&#1584;&#1575; &#1571;&#1610;&#1590;&#1575;&#1611; &#1605;&#1606; &#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606;&#1548; &#1573;&#1606;&#1605;&#1575; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1575;&#1578;&#1576;&#1575;&#1593; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1601;&#1610; &#1571;&#1610; &#1571;&#1585;&#1590; &#1603;&#1575;&#1606;&#1578;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>What has been mentioned to you that I  make generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> (of the masses), this is from the slanders of the enemies. Likewise, their saying that I say whoever follows the deen of Allaah and His Messenger whilst resident in his own land, this is not sufficient until he comes (emigrates) to me. This is also from slandder. Rather, the intent is for [a person] to follow the deen of Allaah and His Messenger in whichever land it may be.</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>These and other statements of Shaykh Muhammad bin Abd al-Wahhaab in his many letters, whilst refuting the slanders of his adversaries, also indicate another very important matter that is worthy of mention: That he is free and innocent of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> who appeared in the 20th century after reading the books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, groups such as <b>al-Takfir wal-Hijrah</b>. These groups made mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslims, following Sayyid Qutb's mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the entire Muslim ummah without exception (see   <a href=http://www.salaf.com/s/?hbzvvmh>here</a>, <a href=http://www.salaf.com/s/?cvcsryr>here</a>,   <a href=http://www.salaf.com/s/?jjooijk>here</a>,<a href=http://www.salaf.com/s/?nrjnbfv>here</a>, and <a href=http://www.salaf.com/s/?litajcc>here</a>), and they also made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of those who did not agree with their <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and likewise, they required emigration to themselves.     <P>
As for the da'wah of the Shaykh Muhammad bin Abd al-Wahhaab it was founded upon that of the Prophets and Messengers of calling to the Uluhiyyah of Allaah, the Exalted. As for the da'wah of the 20th century <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>, it was founded upon a Marxist Socialist reading of Islamic history through which the absence of the implementation of social justice by <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a>, and the absence of their implementation of the <a href='tags/shariah.html' class='tagLink'><font class='tagLink'>Shariah</font></a> in all affairs without exception, demanded a Leninist or Marxist type <a href='tags/revolution.html' class='tagLink'><font class='tagLink'>revolution</font></a> of the masses in order to "snatch the Haakimiyyah" and give it back to Allaah - all of which was distilled in the mind and writings of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, who before this period in his life had spent fifteen years devouring <a href=http://www.salaf.com/s/?fcalumu>Western materialist philosophies</a>. Bear in mind <a href=http://www.salaf.com/s/?rvmldnu>these people were making this call of theirs in Egypt</a>, the land in which the Ubaydi Baatinee Ismaa'eelees established their shirk centuries ago and which it was never really cleansed from and in which the idols (tombs) of al-Badawi, Sinjar, Dusuqi and others continued to be worshipped besides Allaah (to this day) and where millions flock to them, seeking blessings and benefit and repulsion of harm.    <P>
So it should be apparent to the intelligent person who respects his intellect what great difference there lies between Shaykh Muhammad bin Abd al-Wahhaab, his da'wah creed and methodology (the Methodology of the Prophets in Da'wah to Allaah) and the da'wah and methodologies of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> of the 20th century. For one called to the cleansing of the land of the oppression against the right of the Lord of all men (singling out Allaah with all forms and types of worship), and the others left alone the idols of al-Badawi, Sinjar, Dusuqi and others in their land (the greatest oppression) and called instead for mass populist or <a href=http://www.salaf.com/s/?grurqkk>elite vanguard revolutions</a> to help establish the social justice of Islam (<a href=http://www.themadkhalis.com/md/?bguiq>mixed with Communism of course</a>) to remove the oppression encroaching upon the rights of men (economic and social justice through the ahkaam).  </blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?qhybo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
</html>


