

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?hgybz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 1: Takfir Upon Presumption and Without Proof Being Established</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Muhammad Bin Abd Al-Wahhaab and the Claim of Takfir of the Muslim Masses - Part 1: Takfir Upon Presumption and Without Proof Being Established</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, August, 22 2011 and
 filed under <a href="categories/bd-takfir-of-muslim-masses.html">Takfir of Muslim Masses</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">




<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<div class='sidebar'>Shaykh Muhammad bin Abd al-Wahhaab responded to the claims of his adversaries that he makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslim masses in many of the letters and treatises he sent to those claimants and to others in order to dispel the false notions being spread about him as a means to hinder others from his reform  movement. Here we will present some excerpts from some of these letters for the purpose of documentation and record. These can be found in the seventh volume of the collection of his works (<span class='arb' lang='AR-SA'>&#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576;</span>), which contains all of his personal letters and correspondences.</div> <P>




<p>Shaykh Ibn Abd al-Wahhaab said (7/25) in his letter to Muhammad bin 'Eed:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1571;&#1605;&#1575; &#1605;&#1575; &#1584;&#1603;&#1585; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569; &#1593;&#1606;&#1610;: &#1571;&#1606;&#1610; &#1571;&#1603;&#1601;&#1617;&#1585; &#1576;&#1575;&#1604;&#1592;&#1606;&#1548; &#1608;&#1576;&#1575;&#1604;&#1605;&#1608;&#1575;&#1604;&#1575;&#1577;&#1548; &#1571;&#1608; &#1571;&#1603;&#1601;&#1617;&#1585; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604; &#1575;&#1604;&#1584;&#1610; &#1604;&#1605; &#1578;&#1602;&#1605; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1601;&#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605;&#1548; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606; &#1576;&#1607; &#1578;&#1606;&#1601;&#1610;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;.   </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for what the enemies have mentioned about me: That I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> on the basis of presumption, and on the basis of loyalty, or that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the ignorant person upon whom the proof has not been established, then this is a mighty slander. They desire to make the people flee from the deen of Allaah and His Messenger by it.</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>Here Ibn Abd al-Wahhaab rejects the three claims that he makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> a) on the basis of mere presumption, and absence of certainty, b) on the basis of (the mere absence of) loyalty to himself, and c) of the ignorant person upon whom the proof has not been established (by showing him that he is opposing the deen which the Messenger came with). He explains prior to this statement:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1578;&#1603;&#1601;&#1610;&#1585; &#1605;&#1606; &#1576;&#1575;&#1606; &#1604;&#1607; &#1571;&#1606; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1607;&#1608; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;&#1548; &#1579;&#1605; &#1571;&#1576;&#1594;&#1590;&#1607; &#1608;&#1606;&#1601;&#1617;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606;&#1607; &#1608;&#1580;&#1575;&#1607;&#1583; &#1605;&#1606; &#1589;&#1583;&#1602; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1601;&#1610;&#1607;&#1548; </div>    <P>
Which means that <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> is made after it becomes clear to a person that this Tawhid is the deen that Muhammad (sallallaahu alayhi wasallam) came with, then hated it, and drove people away from it, and fights against those who believed Muhammad (sallallaahu alayhi wasallam) regarding it.  </blockquote>    <P>
 <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?hgybz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
</html>


