

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?bmhov by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:08 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Shaykh Abd Al-Muhsin Al-Abbaad on the Freedom and Innocence of Muhammad Bin Abd Al-Wahhaab From the 20th Century Takfiri Kharijites</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Abd Al-Muhsin Al-Abbaad on the Freedom and Innocence of Muhammad Bin Abd Al-Wahhaab From the 20th Century Takfiri Kharijites</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Wednesday, August, 24 2011 and
 filed under <a href="categories/bd-takfir-of-muslim-masses.html">Takfir of Muslim Masses</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
Shaykh Abd al-Muhsin al-Abbaad, after quoting many statements from Shaykh Muhammad bin Abd al-Wahhaab's works in his rebuttals of the allegations of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> made against him by his adversaries, made [in (<span class='arb' lang='AR-SA'>&#1588;&#1585;&#1581; &#1588;&#1585;&#1608;&#1591; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1571;&#1585;&#1603;&#1575;&#1606;&#1607;&#1575; &#1608;&#1608;&#1575;&#1580;&#1576;&#1575;&#1578;&#1607;&#1575;</span>), pp. 78-80], the following pertinent comment:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1571;&#1601;&#1590;&#1578; &#1576;&#1584;&#1603;&#1585; &#1575;&#1604;&#1606;&#1602;&#1608;&#1604; &#1593;&#1606; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1601;&#1610; &#1578;&#1602;&#1585;&#1610;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577;&#1548; &#1608;&#1607;&#1610; &#1571;&#1606; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1605;&#1593;&#1610;&#1606; &#1575;&#1604;&#1584;&#1610; &#1608;&#1602;&#1593; &#1601;&#1610; &#1575;&#1604;&#1588;&#1585;&#1603; &#1601;&#1610; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1580;&#1607;&#1604;&#1607;&#1548; &#1573;&#1606;&#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1576;&#1593;&#1583; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1604;&#1607; &#1608;&#1573;&#1602;&#1575;&#1605;&#1577; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1604;&#1575; &#1602;&#1576;&#1604; &#1584;&#1604;&#1603;&#1548; &#1604;&#1571;&#1606; &#1605;&#1606; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1606; &#1608;&#1575;&#1604;&#1581;&#1575;&#1602;&#1583;&#1610;&#1606; &#1593;&#1604;&#1610;&#1607; &#1608;&#1593;&#1604;&#1609; &#1583;&#1593;&#1608;&#1578;&#1607;&#1548; &#1575;&#1604;&#1605;&#1576;&#1606;&#1610;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577;&#1548; &#1608;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1587;&#1604;&#1601; &#1575;&#1604;&#1571;&#1605;&#1617;&#1577;&#1548; &#1605;&#1606; &#1610;&#1588;&#1606;&#1593; &#1593;&#1604;&#1610;&#1607; &#1608;&#1610;&#1606;&#1601;&#1617;&#1585; &#1605;&#1606; &#1583;&#1593;&#1608;&#1578;&#1607;&#1548; &#1576;&#1585;&#1605;&#1610;&#1607; &#1576;&#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1608;&#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1608;&#1607;&#1608; &#1573;&#1606;&#1605;&#1575; &#1610;&#1603;&#1601;&#1585; &#1605;&#1606; &#1602;&#1575;&#1605;&#1578; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1608;&#1576;&#1575;&#1606;&#1578; &#1604;&#1607; &#1575;&#1604;&#1605;&#1581;&#1580;&#1577;&#1548; &#1608;&#1604;&#1571;&#1606; &#1606;&#1601;&#1585;&#1575;&#1611; &#1610;&#1587;&#1610;&#1585;&#1575;&#1611; &#1605;&#1606; &#1591;&#1604;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577; &#1601;&#1610;&#1605;&#1575; &#1593;&#1604;&#1605;&#1578; &#1610;&#1593;&#1610;&#1576;&#1608;&#1606; &#1593;&#1604;&#1609; &#1605;&#1606; &#1610;&#1602;&#1585;&#1617;&#1585; &#1584;&#1604;&#1603; &#1608;&#1607;&#1608; &#1593;&#1610;&#1576; &#1604;&#1605;&#1575; &#1602;&#1585;&#1617;&#1585;&#1607; &#1588;&#1610;&#1582;&#1575; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1548; &#1575;&#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577; &#1608;&#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;&#1575; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;.    <P>
 &#1608;&#1605;&#1593; &#1584;&#1604;&#1603; &#1601;&#1573;&#1606; &#1575;&#1604;&#1582;&#1591;&#1571; &#1601;&#1610; &#1575;&#1604;&#1593;&#1601;&#1608; &#1601;&#1610; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1575;&#1604;&#1605;&#1588;&#1578;&#1576;&#1607;&#1577;&#1548; &#1582;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1582;&#1591;&#1571; &#1601;&#1610; &#1575;&#1604;&#1593;&#1602;&#1608;&#1576;&#1577;&#1548; &#1608;&#1607;&#1605; &#1601;&#1610; &#1593;&#1610;&#1576;&#1607;&#1605; &#1575;&#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1584;&#1610; &#1602;&#1585;&#1617;&#1585;&#1607; &#1575;&#1604;&#1588;&#1610;&#1582;&#1575;&#1606; &#1608;&#1575;&#1604;&#1581;&#1585;&#1589; &#1593;&#1604;&#1609; &#1582;&#1604;&#1575;&#1601;&#1607; &#1610;&#1601;&#1587;&#1581;&#1608;&#1606; &#1575;&#1604;&#1605;&#1580;&#1575;&#1604; &#1604;&#1604;&#1605;&#1578;&#1585;&#1576;&#1589;&#1610;&#1606; &#1576;&#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1589;&#1591;&#1575;&#1583;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1593;&#1603;&#1585;&#1548; &#1601;&#1610;&#1585;&#1583;&#1617;&#1583;&#1608;&#1606; &#1589;&#1583;&#1609; &#1606;&#1593;&#1610;&#1602; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1608;&#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1586;&#1593;&#1605;&#1608;&#1606; &#1571;&#1606; &#1578;&#1591;&#1585;&#1601; &#1605;&#1606; &#1575;&#1576;&#1578;&#1604;&#1610; &#1576;&#1575;&#1604;&#1578;&#1601;&#1580;&#1610;&#1585; &#1608;&#1575;&#1604;&#1578;&#1583;&#1605;&#1610;&#1585;&#1548; &#1585;&#1575;&#1580;&#1593; &#1573;&#1604;&#1609; &#1583;&#1585;&#1575;&#1587;&#1577; &#1605;&#1606;&#1575;&#1607;&#1580; &#1575;&#1604;&#1578;&#1593;&#1604;&#1610;&#1605; &#1575;&#1604;&#1605;&#1576;&#1606;&#1610;&#1577; &#1593;&#1604;&#1609; &#1603;&#1578;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1608;&#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577;&#1548; &#1608;&#1607;&#1608; &#1576;&#1607;&#1578; &#1608;&#1586;&#1608;&#1585; &#1605;&#1605;&#1606; &#1575;&#1601;&#1578;&#1585;&#1575;&#1607; &#1571;&#1608; &#1585;&#1583;&#1617;&#1583;&#1607;.     <P>
&#1601;&#1573;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1585;&#1583;&#1617;&#1583;&#1608;&#1575; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1593;&#1610;&#1602; &#1605;&#1606; &#1571;&#1607;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1576;&#1604;&#1575;&#1583;&#1548; &#1602;&#1583; &#1583;&#1585;&#1587;&#1608;&#1575; &#1603;&#1605;&#1575; &#1583;&#1585;&#1587; &#1594;&#1610;&#1585;&#1607;&#1605; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1606;&#1575;&#1607;&#1580;&#1548; &#1608;&#1604;&#1605; &#1610;&#1581;&#1589;&#1604; &#1604;&#1607;&#1605; &#1590;&#1585;&#1585; &#1605;&#1606;&#1607;&#1575; &#1576;&#1604; &#1581;&#1589;&#1604; &#1575;&#1604;&#1606;&#1601;&#1593; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605; &#1605;&#1606;&#1607;&#1575; &#1604;&#1603;&#1604; &#1605;&#1606; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1607;&#1583;&#1575;&#1610;&#1578;&#1607; &#1608;&#1578;&#1608;&#1601;&#1610;&#1602;&#1607;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1581;&#1589;&#1604; &#1575;&#1604;&#1578;&#1591;&#1585;&#1601; &#1605;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1605;&#1578;&#1591;&#1585;&#1601;&#1610;&#1606; &#1604;&#1601;&#1607;&#1608;&#1605;&#1607;&#1605; &#1575;&#1604;&#1582;&#1575;&#1591;&#1574;&#1577; &#1575;&#1604;&#1578;&#1610; &#1588;&#1584;&#1617;&#1608;&#1575; &#1576;&#1607;&#1575; &#1608;&#1582;&#1585;&#1580;&#1608;&#1575; &#1593;&#1606; &#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1608;&#1602;&#1583;&#1608;&#1578;&#1607;&#1605; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1575;&#1604;&#1584;&#1610;&#1606; &#1588;&#1584;&#1617;&#1608;&#1575; &#1608;&#1582;&#1585;&#1580;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1606;&#1578;&#1610;&#1580;&#1577; &#1604;&#1601;&#1607;&#1608;&#1605;&#1607;&#1605; &#1575;&#1604;&#1582;&#1575;&#1591;&#1574;&#1577;&#1548; &#1608;&#1604;&#1603;&#1604; &#1602;&#1608;&#1605; &#1608;&#1575;&#1585;&#1579;&#1548; &#1608;&#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1605;&#1587;&#1578;&#1593;&#1575;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I have taken liberties in mentioning the quotes from Shaykh al-Islam Muhammad bin Abd al-Wahhaab in corroborating this issue, which is that making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of a specific person who falls into Shirk in worship due to his ignorance, that it only takes place after clarification to him and establishing the proof, not before that. This is because from the ignoramuses and those jealous of him and his da'wah that is based upon the Book and the Sunnah and what the Salaf of the ummah were upon, were those who would revile him and divert others from his da'wah by accusing him of making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslims, and making generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a>. But he only makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one whom the proof has been established, and the clear way has become clear to him. And there is a small band of students of knowledge from Ahl al-Sunnah in what I know who criticise those who affirm this matter, but this in reality is criticism of what the two Shaykhs of Islam, Ibn Taymiyyah and Muhammad bin Abd al-Wahhab and others from the people of knowledge have corroborated (in this matter).    <P>
And alongside this, falling into error on the side of lenience, pardon in obscure, unclear matters is better than falling on the side of error in matters of punishment. And when they rebuke this position which the two Shaykhs have corroborated, and encouraging opposition to it, they open up the door for those who lie in wait for Ahl al-Sunnah, those who stirk in the murky waters. And hence they repeat they echo the screams of the enemies of Islam and the Muslims who claim that the <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>extremism</font></a> of those put to trial with bombings and destruction returns back to the curriculum of study based upon the books of Shaykh Muhammad bin Abd al-Wahhaab and others from Ahl al-Sunnah. This is a slander and falsehood from the one who fabricated it or repeated it.    <P>
For those who have repeated this scream from the people of this land have also studied this same curriculum yet no harm has appeared from them. Rather, great benefit has come from it for everyone for whom Allaah willed guidance and granting of success. <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>Extremism</font></a> only arose from those extremists due to their incorrect understandings through which they separated from and exited from the body of the Muslims, and their role-model in that is [the sect of the] <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> who revolted against the Companions as a result of their faulty understandings, and "<i>every people have an inheritor</i>", and from Allaah is aid sought.</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
We can repeat our comments from <a href=index30fe.html?qhybo>a previous article</a> as they are relevant to the topic and also because the Shaykh said that "<i>every people have an inheritor</i>," its befitting we put <a href=  http://www.salaf.com/s/?iffhfbp>the dots on the letters</a>:    <P>
<blockquote>These and other statements of Shaykh Muhammad bin Abd al-Wahhaab in his many letters, whilst refuting the slanders of his adversaries, also indicate another very important matter that is worthy of mention: That he is free and innocent of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> who appeared in the 20th century after reading the books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, groups such as <b>al-Takfir wal-Hijrah</b>. These groups made mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslims, following Sayyid Qutb's mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the entire Muslim ummah without exception (see   <a href=http://www.salaf.com/s/?hbzvvmh>here</a>, <a href=http://www.salaf.com/s/?cvcsryr>here</a>,   <a href=http://www.salaf.com/s/?jjooijk>here</a>,<a href=http://www.salaf.com/s/?nrjnbfv>here</a>, and <a href=http://www.salaf.com/s/?litajcc>here</a>), and they also made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of those who did not agree with their <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and likewise, they required emigration to themselves.     <P>
As for the da'wah of the Shaykh Muhammad bin Abd al-Wahhaab it was founded upon that of the Prophets and Messengers of calling to the Uluhiyyah of Allaah, the Exalted. As for the da'wah of the 20th century <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>, it was founded upon a Marxist Socialist reading of Islamic history through which the absence of the implementation of social justice by <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a>, and the absence of their implementation of the <a href='tags/shariah.html' class='tagLink'><font class='tagLink'>Shariah</font></a> in all affairs without exception, demanded a Leninist or Marxist type <a href='tags/revolution.html' class='tagLink'><font class='tagLink'>revolution</font></a> of the masses in order to "snatch the Haakimiyyah" and give it back to Allaah - all of which was distilled in the mind and writings of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, who before this period in his life had spent fifteen years devouring <a href=http://www.salaf.com/s/?fcalumu>Western materialist philosophies</a>. Bear in mind <a href=http://www.salaf.com/s/?rvmldnu>these people were making this call of theirs in Egypt</a>, the land in which the Ubaydi Baatinee Ismaa'eelees established their shirk centuries ago and which it was never really cleansed from and in which the idols (tombs) of al-Badawi, Sinjar, Dusuqi and others continued to be worshipped besides Allaah (to this day) and where millions flock to them, seeking blessings and benefit and repulsion of harm.    <P>
So it should be apparent to the intelligent person who respects his intellect what great difference there lies between Shaykh Muhammad bin Abd al-Wahhaab, his da'wah creed and methodology (the Methodology of the Prophets in Da'wah to Allaah) and the da'wah and methodologies of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> of the 20th century. For one called to the cleansing of the land of the oppression against the right of the Lord of all men (singling out Allaah with all forms and types of worship), and the others left alone the idols of al-Badawi, Sinjar, Dusuqi and others in their land (the greatest oppression) and called instead for mass populist or <a href=http://www.salaf.com/s/?grurqkk>elite vanguard revolutions</a> to help establish the social justice of Islam (<a href=http://www.themadkhalis.com/md/?bguiq>mixed with Communism of course</a>) to remove the oppression encroaching upon the rights of men (economic and social justice through the ahkaam).</blockquote>    <P>
 <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?bmhov by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:08 GMT -->
</html>


