

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?gqcfihu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:34 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab on Benefiting From the Knowledge-Based Heritage of Past Scholars</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab on Benefiting From the Knowledge-Based Heritage of Past Scholars</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Friday, September, 16 2011 and
 filed under <a href="categories/ps-general.html">General</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
<div class='sidebar'>This article should be read alongside <a href=indexcf8c.html?xndfwky>this one</a> (regarding <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> al-Haytami) which deals with a similar related matter.</div>    <P>
That which is spread by the dishonest contemporary Sufis is that Muhammad bin Abd al-Wahhaab (rahimahullaah) and those with him dismissed all previous scholarly heritage, reviled the forerunners, and scrapped their books, said it is prohibited to look at them, and made themselves the only scholarly authority. <b>That is animal fodder purchased and consumed only by the dumbwitted</b>, and is simply another piece in the propaganda jigsaw used to malign the monotheistic call of Muhammad bin Abd al-Wahhaab and those with him. Here we present a statement from Shaykh Abd Allaah bin Muhammad bin Abd al-Wahhaab on the books and scholarly authorities which the Scholars of the Unitarian movement relied upon in matters of religion. He said, as occurs in <i>al-Durar al-Saniyyah</i> (1/228-229):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1579;&#1605; &#1573;&#1606;&#1575; &#1606;&#1587;&#1578;&#1593;&#1610;&#1606; &#1593;&#1604;&#1609; &#1601;&#1607;&#1605; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1604;&#1607;&#1548; &#1576;&#1575;&#1604;&#1578;&#1601;&#1575;&#1587;&#1610;&#1585; &#1575;&#1604;&#1605;&#1578;&#1583;&#1575;&#1608;&#1604;&#1577; &#1575;&#1604;&#1605;&#1593;&#1578;&#1576;&#1585;&#1577;&#1548; &#1608;&#1605;&#1606; &#1571;&#1580;&#1604;&#1607;&#1575; &#1604;&#1583;&#1610;&#1606;&#1575; : &#1578;&#1601;&#1587;&#1610;&#1585; &#1575;&#1576;&#1606; &#1580;&#1585;&#1610;&#1585;&#1548; &#1608;&#1605;&#1582;&#1578;&#1589;&#1585;&#1607; &#1604;&#1575;&#1576;&#1606; &#1603;&#1579;&#1610;&#1585; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610;&#1548; &#1608;&#1603;&#1584;&#1575; &#1575;&#1604;&#1576;&#1594;&#1608;&#1610;&#1548; &#1608;&#1575;&#1604;&#1576;&#1610;&#1590;&#1575;&#1608;&#1610;&#1548; &#1608;&#1575;&#1604;&#1582;&#1575;&#1586;&#1606;&#1548; &#1608;&#1575;&#1604;&#1581;&#1583;&#1575;&#1583;&#1548; &#1608;&#1575;&#1604;&#1580;&#1604;&#1575;&#1604;&#1610;&#1606;&#1548; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; . &#1608;&#1593;&#1604;&#1609; &#1601;&#1607;&#1605; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579;&#1548; &#1576;&#1588;&#1585;&#1608;&#1581; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1576;&#1585;&#1586;&#1610;&#1606; : &#1603;&#1575;&#1604;&#1593;&#1587;&#1602;&#1604;&#1575;&#1606;&#1610;&#1548; &#1608;&#1575;&#1604;&#1602;&#1587;&#1591;&#1604;&#1575;&#1606;&#1610;&#1548; &#1593;&#1604;&#1609; &#1575;&#1604;&#1576;&#1582;&#1575;&#1585;&#1610;&#1548; &#1608;&#1575;&#1604;&#1606;&#1608;&#1608;&#1610; &#1593;&#1604;&#1609; &#1605;&#1587;&#1604;&#1605;&#1548; &#1608;&#1575;&#1604;&#1605;&#1606;&#1575;&#1608;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1580;&#1575;&#1605;&#1593; &#1575;&#1604;&#1589;&#1594;&#1610;&#1585; .  &#1608;&#1606;&#1581;&#1585;&#1589; &#1593;&#1604;&#1609; &#1603;&#1578;&#1576; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579;&#1548; &#1582;&#1589;&#1608;&#1589;&#1575;&#1611; : &#1575;&#1604;&#1571;&#1605;&#1607;&#1575;&#1578; &#1575;&#1604;&#1587;&#1578;&#1548; &#1608;&#1588;&#1585;&#1608;&#1581;&#1607;&#1575; &#1563; &#1608;&#1606;&#1593;&#1578;&#1606;&#1610; &#1576;&#1587;&#1575;&#1574;&#1585; &#1575;&#1604;&#1603;&#1578;&#1576;&#1548; &#1601;&#1610; &#1587;&#1575;&#1574;&#1585; &#1575;&#1604;&#1601;&#1606;&#1608;&#1606;&#1548; &#1571;&#1589;&#1608;&#1604;&#1575;&#1611;&#1548; &#1608;&#1601;&#1585;&#1608;&#1593;&#1575;&#1611;&#1548; &#1608;&#1602;&#1608;&#1575;&#1593;&#1583;&#1548; &#1608;&#1587;&#1610;&#1585;&#1575;&#1611;&#1548; &#1608;&#1606;&#1581;&#1608;&#1575;&#1611;&#1548; &#1608;&#1589;&#1585;&#1601;&#1575;&#1611;&#1548; &#1608;&#1580;&#1605;&#1610;&#1593; &#1593;&#1604;&#1608;&#1605; &#1575;&#1604;&#1571;&#1605;&#1577; .  &#1608;&#1604;&#1575; &#1606;&#1571;&#1605;&#1585; &#1576;&#1575;&#1578;&#1604;&#1575;&#1601; &#1588;&#1610;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1571;&#1589;&#1604;&#1575;&#1611;&#1548; &#1573;&#1604;&#1575;&#1617; &#1605;&#1575; &#1575;&#1588;&#1578;&#1605;&#1604; &#1593;&#1604;&#1609; &#1605;&#1575; &#1610;&#1608;&#1602;&#1593; &#1575;&#1604;&#1606;&#1575;&#1587; &#1601;&#1610; &#1575;&#1604;&#1588;&#1585;&#1603;&#1548; &#1603;&#1585;&#1608;&#1590; &#1575;&#1604;&#1585;&#1610;&#1575;&#1581;&#1610;&#1606;&#1548; &#1571;&#1608; &#1610;&#1581;&#1589;&#1604; &#1576;&#1587;&#1576;&#1576;&#1607; &#1582;&#1604;&#1604; &#1601;&#1610; &#1575;&#1604;&#1593;&#1602;&#1575;&#1574;&#1583;&#1548; &#1603;&#1593;&#1604;&#1605; &#1575;&#1604;&#1605;&#1606;&#1591;&#1602;&#1548; &#1601;&#1573;&#1606;&#1607; &#1602;&#1583; &#1581;&#1585;&#1605;&#1607; &#1580;&#1605;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569;&#1548; &#1593;&#1604;&#1609; &#1571;&#1606;&#1575; &#1604;&#1575; &#1606;&#1601;&#1581;&#1589; &#1593;&#1606; &#1605;&#1579;&#1604; &#1584;&#1604;&#1603;&#1548; &#1608;&#1603;&#1575;&#1604;&#1583;&#1604;&#1575;&#1574;&#1604;&#1548; &#1573;&#1604;&#1575;&#1617; &#1573;&#1606; &#1578;&#1592;&#1575;&#1607;&#1585; &#1576;&#1607; &#1589;&#1575;&#1581;&#1576;&#1607; &#1605;&#1593;&#1575;&#1606;&#1583;&#1575;&#1611;&#1548; &#1571;&#1578;&#1604;&#1601; &#1593;&#1604;&#1610;&#1607; &#1563; &#1608;&#1605;&#1575; &#1575;&#1578;&#1601;&#1602; &#1604;&#1576;&#1593;&#1590; &#1575;&#1604;&#1576;&#1583;&#1608;&#1548; &#1601;&#1610; &#1575;&#1578;&#1604;&#1575;&#1601; &#1576;&#1593;&#1590; &#1603;&#1578;&#1576; &#1571;&#1607;&#1604; &#1575;&#1604;&#1591;&#1575;&#1574;&#1601;&#1548; &#1573;&#1606;&#1605;&#1575; &#1589;&#1583;&#1585; &#1605;&#1606;&#1607; &#1604;&#1580;&#1607;&#1604;&#1607;&#1548; &#1608;&#1602;&#1583; &#1586;&#1580;&#1585; &#1607;&#1608;&#1548; &#1608;&#1594;&#1610;&#1585;&#1607; &#1593;&#1606; &#1605;&#1579;&#1604; &#1584;&#1604;&#1603; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Thereafter, we seek aid in understanding the Book of Allaah with the well-circulated, accepted books of tafseer (Qur'anic commentary), and from the loftiest of them in our view are the tafseer of Ibn Jarir, and its summarized version by Ibn Kathir <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a>, and likewise (that of) al-Baghawi, and al-Baydawi, and al-Khaazin, and al-Haddaad and al-Jalaalayn and other than them.    <P>
And in understanding the hadeeth, with the explanations upon [the hadeeth collection of] al-Bukhari by the prominent scholars such as al-Asqalaani, al-Qastalaani. And [that of] <a href='tags/al-nawawi.html' class='tagLink'><font class='tagLink'>al-Nawawi</font></a> for [the hadeeth collection of] Muslim, and [that of] al-Munawi upon al-Jami' al-Sagheer. And we are eager for the books of hadeeth, such as the six main books and their explanations, and we are occupied with all of the books, in all of the various disciplines, both in the foundations and the subsidiary [matters], in the principles, in biographies, in grammar, morphology and in all of the sciences of this Ummah.     <P>
And we do not command the destruction of any of the authored works at all except what comprises that which makes the people fall into polytheism, such as Rawd al-Riyaaheen, or [those books] on account of which errors in creed are acquired, such as [books] on [Greek] logic, for a group of the Scholars have prohibited them, bearing in mind that we do not investigate into such matters (in any case), and like [the book] al-Dalaa'il. [And the same is with any book] unless its author manifests obstinacy [with respect to what is in it of error and misguidance], in that case it is destroyed.     <P>
And as for what one of the Bedouins did of destroying some of the books of the people of al-Taa'if, then that occurred from him due to his ignorance, and he and others have been reprimanded from the likes of that.</blockquote>    <P>
<font class='titleHeadline'>Comments</font>    <P>
<blockquote><b>Firstly</b>, note that the Shaykh mentioned some of the books of those who had something of I'tizaal and something of departure from the creed of the Salaf (in the books of tafseer), alongside those books which are purely Salafi, Athari. And likewise reliance upon the books of those who had been influenced by the Mutakallimeen such as <a href='tags/al-nawawi.html' class='tagLink'><font class='tagLink'>al-Nawawi</font></a> and al-Asqalani and others. And the same can be said in all other disciplines. So this exposes the academic fraud of the contemporary Sufis who are very unjust and whose hatred and desires prevent them from being truthful about these Shaykhs. They never dismissed Islamic scholarl heritage, rather they valued it and benefited from it and prohibited that it be dismissed and shunned. <b>Secondly</b>, note also how they did  not command the destruction of any of the heritage of the past Muslim scholars, even if they contained something of error, unless it comprises what leads the people to invalidation of their faith, or which are a means and avenue towards that or towards heresy. <b>Thirdly</b>, the freedom of these Shaykhs from a contemporary faction, the Haddaadiyyah, who prohibit the books of <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> and <a href='tags/al-nawawi.html' class='tagLink'><font class='tagLink'>al-Nawawi</font></a> and others, and call for their destruction - this is not the position and view of Ahl al-Sunnah. And alhamdulillaah, the contemporary Scholars of Ahl al-Sunnah have spoken against them and their evil, and they are similar to those being alluded to at the end of the quote above.</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?gqcfihu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:34 GMT -->
</html>


