

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?jepuo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab: On the Intercession of the Prophets, Angels and Awliyaa</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab: On the Intercession of the Prophets, Angels and Awliyaa</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Friday, August, 26 2011 and
 filed under <a href="categories/ix-beliefs.html">Belief</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
When Shaykh Muhammad bin Abd al-Wahhaab began calling to the pure monotheism of the Prophets and Messengers and inviting the people to ask for intercession only from Allaah, the Exalted, as He is its sole owner, the elites began to divert the common-folk away from him and his call by intellectual <a href='tags/terrorism.html' class='tagLink'><font class='tagLink'>terrorism</font></a>, by spreading lies to the people that he (and those with him) reject the intercession of the Prophets and the Awliyaa. Shaykh Abd Allaah bin Muhammad bin Abd al-Wahhaab stated in a treatise he wrote after 1218H as occurs in <i>al-Durar al-Saniyyah</i> (1/231):     <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1606;&#1579;&#1576;&#1578; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1604;&#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1608;&#1605; &#1575;&#1604;&#1602;&#1610;&#1575;&#1605;&#1577;&#1548; &#1581;&#1587;&#1576; &#1605;&#1575; &#1608;&#1585;&#1583;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1606;&#1579;&#1576;&#1578;&#1607;&#1575; &#1604;&#1587;&#1575;&#1574;&#1585; &#1575;&#1604;&#1571;&#1606;&#1576;&#1610;&#1575;&#1569;&#1548; &#1608;&#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577;&#1548; &#1608;&#1575;&#1604;&#1571;&#1608;&#1604;&#1610;&#1575;&#1569;&#1548; &#1608;&#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; &#1581;&#1587;&#1576; &#1605;&#1575; &#1608;&#1585;&#1583; &#1571;&#1610;&#1590;&#1575;&#1611; &#1563; &#1608;&#1606;&#1587;&#1571;&#1604;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1575;&#1604;&#1603; &#1604;&#1607;&#1575;&#1548; &#1608;&#1575;&#1604;&#1573;&#1584;&#1606; &#1601;&#1610;&#1607;&#1575; &#1604;&#1605;&#1606; &#1610;&#1588;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1608;&#1581;&#1583;&#1610;&#1606;&#1548; &#1575;&#1604;&#1584;&#1610;&#1606; &#1607;&#1605; &#1571;&#1587;&#1593;&#1583; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1607;&#1575;&#1548; &#1603;&#1605;&#1575; &#1608;&#1585;&#1583;&#1548; &#1576;&#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1571;&#1581;&#1583;&#1606;&#1575;  &#1605;&#1578;&#1590;&#1585;&#1593;&#1575;&#1611; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; - : &#1575;&#1604;&#1604;&#1607;&#1605; &#1588;&#1601;&#1593; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583;&#1575;&#1611; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1601;&#1610;&#1606;&#1575; &#1610;&#1608;&#1605; &#1575;&#1604;&#1602;&#1610;&#1575;&#1605;&#1577;&#1548; &#1571;&#1608; : &#1575;&#1604;&#1604;&#1607;&#1605; &#1588;&#1601;&#1593; &#1601;&#1610;&#1606;&#1575; &#1593;&#1576;&#1575;&#1583;&#1603; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581;&#1610;&#1606;&#1548; &#1571;&#1608; &#1605;&#1604;&#1575;&#1574;&#1603;&#1578;&#1603;&#1548; &#1571;&#1608; &#1606;&#1581;&#1608; &#1584;&#1604;&#1603;&#1548; &#1605;&#1605;&#1575; &#1610;&#1591;&#1604;&#1576; &#1605;&#1606; &#1575;&#1604;&#1604;&#1607;&#1548; &#1604;&#1575; &#1605;&#1606;&#1607;&#1605; &#1563; &#1601;&#1604;&#1575; &#1610;&#1602;&#1575;&#1604; : &#1610;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607;&#1548; &#1571;&#1608; &#1610;&#1575; &#1608;&#1604;&#1610; &#1575;&#1604;&#1604;&#1607;&#1548; &#1571;&#1587;&#1571;&#1604;&#1603; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577;&#1548; &#1571;&#1608; &#1594;&#1610;&#1585;&#1607;&#1575;&#1548; &#1603;&#1571;&#1583;&#1585;&#1603;&#1606;&#1610;&#1548; &#1571;&#1608; &#1571;&#1594;&#1579;&#1606;&#1610;&#1548; &#1571;&#1608; &#1575;&#1588;&#1601;&#1606;&#1610;&#1548; &#1571;&#1608; &#1575;&#1606;&#1589;&#1585;&#1606;&#1610; &#1593;&#1604;&#1609; &#1593;&#1583;&#1608;&#1610;&#1548; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603;&#1548; &#1605;&#1605;&#1575; &#1604;&#1575; &#1610;&#1602;&#1583;&#1585; &#1593;&#1604;&#1610;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609;&#1548; &#1601;&#1573;&#1584;&#1575; &#1591;&#1604;&#1576; &#1584;&#1604;&#1603; &#1605;&#1605;&#1575; &#1584;&#1603;&#1585; &#1601;&#1610; &#1571;&#1610;&#1575;&#1605; &#1575;&#1604;&#1576;&#1585;&#1586;&#1582;&#1548; &#1603;&#1575;&#1606; &#1605;&#1606; &#1571;&#1602;&#1587;&#1575;&#1605; &#1575;&#1604;&#1588;&#1585;&#1603;&#1548; &#1573;&#1584; &#1604;&#1605; &#1610;&#1585;&#1583; &#1576;&#1584;&#1604;&#1603; &#1606;&#1589; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576; &#1571;&#1608; &#1587;&#1606;&#1577;&#1548; &#1608;&#1604;&#1575; &#1571;&#1579;&#1585; &#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1601;&#1610; &#1584;&#1604;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And we affirm the intercession for our Prophet Muhammad (sallallaahu alayhi wasallam) on the Day of Judgement, in accordance with what has been narrated. Likewise we affirm it for all of the Prophets, the Angels, the Awliyaa (pious friends of Allaah), and [likewise], children, in accordance with what has been narrated as well. But we ask it from its Master, Owner (al-Maalik), and permission for it (to be solicited) is for whomever He wills from the monotheists, those who are the most pleasing of people (deserving it), as has been narrated, in that one of us says, in humility to Allaah, "O Allaah, grant intercession to our Prophet Muhammad (sallallaahu alayhi wasallam) for us on the Day of Judgement", or "O Allaah, grant intercession to your righteous servants or the Angels for us..." and what is similar to that, from what is requested from Allaah, but not from them. So it is not said, "O Messenger of Allaah (or) O wali of Allaah, I ask intercession from you..." or other such (requests) such as "Reach me (to aid me) or "Rescue me" or "Heal me", or "Aid me against my enemy" and what is similar to that, from those affairs in which none has power over except Allaah, the Exalted. When he requests any of that which has just been mentioned (from those in the life) of al-Barzakh, it is from the types of Shirk, since no text has been related from the Book or the Sunnah (for this practice), and nor any narration from the Rigteous Salaf regarding it...  </blockquote>    <P>
Compare the above with what is below:    <P>
<blockquote><font class='titleHeadline'>Fakhr al-Din al-Razi on Soliciting Intercession, Supplication (Du'a) as the Essence of Worship, and Veneration of the Graves as a Means of Worshipping the Righteous Dead</font>    <P>
Al-Razi said in his tafsir (Mafaateeh al-Ghayb, 17/63):     <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1606;&#1592;&#1610;&#1585;&#1607; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1575;&#1588;&#1578;&#1594;&#1575;&#1604; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1582;&#1604;&#1602; &#1576;&#1578;&#1593;&#1592;&#1610;&#1605; &#1602;&#1576;&#1608;&#1585; &#1575;&#1604;&#1571;&#1603;&#1575;&#1576;&#1585; &#1593;&#1604;&#1609; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583; &#1571;&#1606;&#1607;&#1605; &#1573;&#1584;&#1575; &#1593;&#1592;&#1605;&#1608;&#1575; &#1602;&#1576;&#1608;&#1585;&#1607;&#1605; &#1601;&#1575;&#1606;&#1607;&#1605; &#1610;&#1603;&#1608;&#1606;&#1608;&#1606; &#1588;&#1601;&#1593;&#1575;&#1569; &#1604;&#1607;&#1605; &#1593;&#1606;&#1583; &#1575;&#1604;&#1604;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the equivalent of this in our time is the occupation of many of the creation with the veneration of the graves of the senior [righteous] ones, upon the belief that when they venerate their graves, then they (the deceased) will become intercessors for them with Allaah.</blockquote>    <P>
Al-Razi, the Ash'ari scholar of the 6th and early 7th centuries, affirmed: <b>a)</b> That Shafaa'ah (intercession) belongs to none but Allaah alone, and intercession can never take place except with Allah's permission - (<a href=http://www.tawhidfirst.com/monotheism/?pqwqp>see this article</a>),  <b>b)</b> That du'a (supplication) is the loftiest of the stations of al-ubudiyyah (servitude, worship), is the  most excellent of the types of worship, and the reality of du'a is such that incorporates other forms of worship such as humility (dhull), servitude (uboodiyyah), incapacity (inkisaar), poverty, need (maskanah) - (<a href=http://www.tawhidfirst.com/monotheism/?asmag>see this article</a>), <b>c)</b> That none of the pagans ever intended to worship the statues or idols, rather the acts of worship they performed were directed to those in the graves, and their reason was that they were intending to solicit their intercession - (see <a href=http://www.tawhidfirst.com/monotheism/?fgnbc>this article</a> and <a href=http://www.tawhidfirst.com/monotheism/?pqwqp>this article</a>), <b>d)</b> That many were found in the time of al-Razi who flocked to the graves and venerated them with the desire of soliciting the intercession of the righteous dead - (<a href=http://www.tawhidfirst.com/monotheism/?qhxzs>see here</a>), <b>e)</b> That no nation in history ever believed in Ruboobiyyah for other than Allaah (with an exception for the Dualists) and that none of those who worship other than Allaah believe that what they worship has any independent power or control. And that what actually led people to worship things were certain philosophical and other reasons and from them were the soliciting of the intercession of the pious, righteous dead. And further, that whatever they took as focal points of worship (pictures, idols, statues, graves, tombs) were never intended for worship at all, rather they were simply focal points to allow the direction of worship to the righteous dead - (<a href=http://www.tawhidfirst.com/monotheism/?ebzse>see here</a>), <b>f)</b> Finally, that seeking intercession from other than Allaah is something which deprives a person from receiving intercession at all (<a href=http://www.tawhidfirst.com/monotheism/?pmtvz>see here</a>).    <P>
<b>A key thing to note in the above is al-Razi's clear and explicit denial that those <u>worshipping</u> others besides Allaah ever believed that those others have control over creation, life, death, benefit, harm, and he says that this (affirming another as creator, provider, sustainer) has never ever been known in any nation in history (except for the Dualists). This undermines the claims of the fabricating, slandering saint-worshippers who came later such as <a href=categories/cj-lies-of-ahmad-dahlan.html>Ahmad Dahlan</a> in the 13th century hijrah who claimed that Rububiyyah and Uluhiyyah <u>are one and the same</u>, and that distinguishing between them is an innovation! What a brazen fraud and lie against the Book of Allah, who said, (<span class='arb' lang='AR-SA'>&#1608;&#1614;&#1605;&#1614;&#1575; &#1610;&#1615;&#1572;&#1618;&#1605;&#1616;&#1606;&#1615; &#1571;&#1614;&#1603;&#1618;&#1579;&#1614;&#1585;&#1615;&#1607;&#1615;&#1605;&#1618; &#1576;&#1616;&#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1573;&#1616;&#1604;&#1575;&#1617;&#1614; &#1608;&#1614;&#1607;&#1615;&#1605; &#1605;&#1617;&#1615;&#1588;&#1618;&#1585;&#1616;&#1603;&#1615;&#1608;&#1606;&#1614;</span>), "<b>And most of them do not believe in Allaah except while they associate partners with Him</b>." (12:106) </b></blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?jepuo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:44 GMT -->
</html>


