

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?fgxss by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab on Fiqh, Ijtihaad, Madhhabs and Taqlid</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Abd Allaah Bin Muhammad Bin Abd Al-Wahhaab on Fiqh, Ijtihaad, Madhhabs and Taqlid</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Wednesday, August, 24 2011 and
 filed under <a href="categories/mq-taqlid-and-madhhabs.html">Taqlid and Madhhabs</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
The son of Shaykh Muhammad bin Abd al-Wahhaab, Abd Allaah, explains in one of his letters after 1218H (see al-Durar al-Saniyyah 1/277) the position of the Shaykhs of the da'wah towards fiqh, ijtihaad, madhhabs, taqlid and the four Imaams:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1606;&#1581;&#1606; &#1571;&#1610;&#1590;&#1575;&#1611; : &#1601;&#1610; &#1575;&#1604;&#1601;&#1585;&#1608;&#1593;&#1548; &#1593;&#1604;&#1609; &#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1571;&#1581;&#1605;&#1583; &#1576;&#1606; &#1581;&#1606;&#1576;&#1604;&#1548; &#1608;&#1604;&#1575; &#1606;&#1606;&#1603;&#1585; &#1593;&#1604;&#1609; &#1605;&#1606; &#1602;&#1604;&#1583; &#1571;&#1581;&#1583; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577;&#1548; &#1583;&#1608;&#1606; &#1594;&#1610;&#1585;&#1607;&#1605;&#1548; &#1604;&#1593;&#1583;&#1605; &#1590;&#1576;&#1591; &#1605;&#1584;&#1575;&#1607;&#1576; &#1575;&#1604;&#1594;&#1610;&#1585; &#1563; &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577;&#1548; &#1608;&#1575;&#1604;&#1586;&#1610;&#1583;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1573;&#1605;&#1575;&#1605;&#1610;&#1577;&#1548; &#1608;&#1606;&#1581;&#1608;&#1607;&#1605; &#1563; &#1608;&#1604;&#1575; &#1606;&#1602;&#1585;&#1607;&#1605; &#1592;&#1575;&#1607;&#1585;&#1575;&#1611; &#1593;&#1604;&#1609; &#1588;&#1610;&#1569; &#1605;&#1606; &#1605;&#1584;&#1575;&#1607;&#1576;&#1607;&#1605; &#1575;&#1604;&#1601;&#1575;&#1587;&#1583;&#1577;&#1548; &#1576;&#1604; &#1606;&#1580;&#1576;&#1585;&#1607;&#1605; &#1593;&#1604;&#1609; &#1578;&#1602;&#1604;&#1610;&#1583; &#1571;&#1581;&#1583; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577; .  &#1608;&#1604;&#1575; &#1606;&#1587;&#1578;&#1581;&#1602; &#1605;&#1585;&#1578;&#1576;&#1577; &#1575;&#1604;&#1575;&#1580;&#1578;&#1607;&#1575;&#1583; &#1575;&#1604;&#1605;&#1591;&#1604;&#1602;&#1548; &#1608;&#1604;&#1575; &#1571;&#1581;&#1583; &#1604;&#1583;&#1610;&#1606;&#1575; &#1610;&#1583;&#1593;&#1610;&#1607;&#1575;&#1548; &#1573;&#1604;&#1575; &#1571;&#1606;&#1606;&#1575; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1587;&#1575;&#1574;&#1604;&#1548; &#1573;&#1584;&#1575; &#1589;&#1581; &#1604;&#1606;&#1575; &#1606;&#1589; &#1580;&#1604;&#1610;&#1548; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576;&#1548; &#1571;&#1608; &#1587;&#1606;&#1577; &#1594;&#1610;&#1585; &#1605;&#1606;&#1587;&#1608;&#1582;&#1548; &#1608;&#1604;&#1575; &#1605;&#1582;&#1589;&#1589;&#1548; &#1608;&#1604;&#1575; &#1605;&#1593;&#1575;&#1585;&#1590; &#1576;&#1571;&#1602;&#1608;&#1609; &#1605;&#1606;&#1607;&#1548; &#1608;&#1602;&#1575;&#1604; &#1576;&#1607; &#1571;&#1581;&#1583; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577; : &#1571;&#1582;&#1584;&#1606;&#1575; &#1576;&#1607;&#1548; &#1608;&#1578;&#1585;&#1603;&#1606;&#1575; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576;&#1548; &#1603;&#1575;&#1585;&#1579; &#1575;&#1604;&#1580;&#1583; &#1608;&#1575;&#1604;&#1571;&#1582;&#1608;&#1577;&#1548; &#1601;&#1573;&#1606;&#1575; &#1606;&#1602;&#1583;&#1605; &#1575;&#1604;&#1580;&#1583; &#1576;&#1575;&#1604;&#1573;&#1585;&#1579;&#1548; &#1608;&#1573;&#1606; &#1582;&#1575;&#1604;&#1601; &#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1581;&#1606;&#1575;&#1576;&#1604;&#1577; .    <P>
&#1608;&#1604;&#1575; &#1606;&#1601;&#1578;&#1588; &#1593;&#1604;&#1609; &#1571;&#1581;&#1583; &#1601;&#1610; &#1605;&#1584;&#1607;&#1576;&#1607;&#1548; &#1608;&#1604;&#1575; &#1606;&#1593;&#1578;&#1585;&#1590; &#1593;&#1604;&#1610;&#1607;&#1548; &#1573;&#1604;&#1575; &#1573;&#1584;&#1575; &#1575;&#1591;&#1604;&#1593;&#1606;&#1575; &#1593;&#1604;&#1609; &#1606;&#1589; &#1580;&#1604;&#1610;&#1548; &#1605;&#1582;&#1575;&#1604;&#1601;&#1575;&#1611; &#1604;&#1605;&#1584;&#1607;&#1576; &#1571;&#1581;&#1583; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1548; &#1608;&#1603;&#1575;&#1606;&#1578; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577; &#1605;&#1605;&#1575; &#1610;&#1581;&#1589;&#1604; &#1576;&#1607;&#1575; &#1588;&#1593;&#1575;&#1585; &#1592;&#1575;&#1607;&#1585;&#1548; &#1603;&#1573;&#1605;&#1575;&#1605; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577;&#1548; &#1601;&#1606;&#1571;&#1605;&#1585; &#1575;&#1604;&#1581;&#1606;&#1601;&#1610;&#1548; &#1608;&#1575;&#1604;&#1605;&#1575;&#1604;&#1603;&#1610; &#1605;&#1579;&#1604;&#1575;&#1611;&#1548; &#1576;&#1575;&#1604;&#1605;&#1581;&#1575;&#1601;&#1592;&#1577; &#1593;&#1604;&#1609; &#1606;&#1581;&#1608; &#1575;&#1604;&#1591;&#1605;&#1571;&#1606;&#1610;&#1606;&#1577; &#1601;&#1610; &#1575;&#1604;&#1575;&#1593;&#1578;&#1583;&#1575;&#1604;&#1548; &#1608;&#1575;&#1604;&#1580;&#1604;&#1608;&#1587; &#1576;&#1610;&#1606; &#1575;&#1604;&#1587;&#1580;&#1583;&#1578;&#1610;&#1606;&#1548; &#1604;&#1608;&#1590;&#1608;&#1581; &#1583;&#1604;&#1610;&#1604; &#1584;&#1604;&#1603; &#1563; &#1576;&#1582;&#1604;&#1575;&#1601; &#1580;&#1607;&#1585; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1576;&#1575;&#1604;&#1576;&#1587;&#1605;&#1604;&#1577;&#1548; &#1601;&#1604;&#1575; &#1606;&#1571;&#1605;&#1585;&#1607; &#1576;&#1575;&#1604;&#1571;&#1587;&#1585;&#1575;&#1585;&#1548; &#1608;&#1588;&#1578;&#1575;&#1606; &#1605;&#1575; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1578;&#1610;&#1606; &#1563; &#1601;&#1573;&#1584;&#1575; &#1602;&#1608;&#1610; &#1575;&#1604;&#1583;&#1604;&#1610;&#1604; : &#1571;&#1585;&#1588;&#1583;&#1606;&#1575;&#1607;&#1605; &#1576;&#1575;&#1604;&#1606;&#1589;&#1548; &#1608;&#1573;&#1606; &#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576;&#1548; &#1608;&#1584;&#1604;&#1603; &#1610;&#1603;&#1608;&#1606; &#1606;&#1575;&#1583;&#1585;&#1575;&#1611; &#1580;&#1583;&#1575;&#1611;&#1548; &#1608;&#1604;&#1575;    &#1605;&#1575;&#1606;&#1593; &#1605;&#1606; &#1575;&#1604;&#1575;&#1580;&#1578;&#1607;&#1575;&#1583; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1587;&#1575;&#1574;&#1604; &#1583;&#1608;&#1606; &#1576;&#1593;&#1590;&#1548; &#1601;&#1604;&#1575; &#1605;&#1606;&#1575;&#1602;&#1590;&#1577; &#1604;&#1593;&#1583;&#1605; &#1583;&#1593;&#1608;&#1609; &#1575;&#1604;&#1573;&#1580;&#1578;&#1607;&#1575;&#1583;&#1548; &#1608;&#1602;&#1583; &#1587;&#1576;&#1602; &#1580;&#1605;&#1593; &#1605;&#1606; &#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577;&#1548; &#1573;&#1604;&#1609; &#1575;&#1582;&#1578;&#1610;&#1575;&#1585;&#1575;&#1578; &#1604;&#1607;&#1605; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1587;&#1575;&#1574;&#1604;&#1548; &#1605;&#1582;&#1575;&#1604;&#1601;&#1610;&#1606; &#1604;&#1604;&#1605;&#1584;&#1607;&#1576;&#1548; &#1575;&#1604;&#1605;&#1604;&#1578;&#1586;&#1605;&#1610;&#1606; &#1578;&#1602;&#1604;&#1610;&#1583; &#1589;&#1575;&#1581;&#1576;&#1607; .  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And also we are upon the madhhab of Imaam Ahmad bin Hanbal in the matters of jurisprudence, and we do not show rejection to the one who made taqleed of one of the four Imaams as opposed to those besides them (the four) because of the absence of precision in the madhhabs of the others, such as the <a href='tags/raafidah.html' class='tagLink'><font class='tagLink'>Raafidah</font></a>, the Zaydiyyah and the Imaamiyyah and their likes. And we do not make open affirmation for them (the <a href='tags/raafidah.html' class='tagLink'><font class='tagLink'>Raafidah</font></a>, Zaydiyyah and Imaamiyyah) upon anything of their corrupt madhhabs. Rather, we compel (the common folk) to make taqlid of one of the four Imaams.    <P>
And we do not deserve the status of absolute ijtihaad and there is none amongst us who lays claim to it, except that in some of the issues (of jurisprudence), when a plain, clear text from the Book, or a Sunnah unabrogated, unspecified and uncontradicted by what is stronger than it, and by which one of the four Imaams have spoken, we take it and we leave our madhhab, such as in the example of the inheritance of the grandfather and brethren. For we give precedence to the grandfather in the inheritance even though it opposes the madhhab of the Hanbalis.    <P>
And we do not investigate (scrutinize) anyone in his madhhab, nor do we find fault with him  except when we come across a plain, clear text which opposes the madhhab of one of the four Imaams and it is a matter through which an open and apparent symbol (of religious duty) is actualized, such as (it pertains to) the Imaam leading the <a href='tags/prayer.html' class='tagLink'><font class='tagLink'>prayer</font></a>, we order the Hanafi and the Maliki for example, to maintain perfect rest (calm, ease) when arising from ruku' and in sitting between the two prostrations because of the clarity of the evidence regarding that. [This being] different to the Shafi'ite Imaam (leading the prayer) who utters the basmalah loudly (in the prayer), we do not order to him to say it inwardly, and there is a great difference between the two issues (given here). So when the evidence is strong, we direct them (to what is correct) with the text, even if it opposes the madhhab, but this occurs very rarely.     <P>
And there is nothing to prevent making ijtihaad in some matters as opposed to others. Thus, there is no contradiction between (this and) not making the claim of independent ijtihaad, because a group from the scholars from the four madhhabs are preceded choosing certain preferred opinions in certain matters, who, whilst making taqleed of the founders of the  madhhab (in general), opposed the madhhab (in those matters).</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>This is a very different picture to the one spread and presented by the extreme Sufis and others, who in their propaganda, spread the lies of the adversaries, and never ever do justice and present the actual statements of the so-called 'Wahhabis' from their own writings, statements, letters and treatises. So the position we gather from Shaykh Abd Allah bin Muhammad bin Abd al-Wahhaab is that they do not prohibit following a madhhab so long as there is no clash with <u>a clear, plain legislative text</u> which another Imaam (from the other three schools) has spoken with and which is in a non-obscure matter. He rejects claiming independent absolute ijtihaad and no one claimed that amongst them. However, this does not mean that in certain issues one may have preferred opinions that lie outside of one's madhhab. One can also see the wisdom used by these Scholars of Tawhid in the matters of correction.  </blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?fgxss by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:10:10 GMT -->
</html>


