

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.wahhabis.com/print.cfm?qaehvcx by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:32 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Wahhabis.Com | Imam Al-Qurtubi Al-Maliki on Plastering Graves, Constructing Over Them and Making Them Places of Worship</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/wahhabis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Wahhabis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Imam Al-Qurtubi Al-Maliki on Plastering Graves, Constructing Over Them and Making Them Places of Worship</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, September, 19 2011 and
 filed under <a href="categories/ps-general.html">General</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif border=0></div>    <P>
The Maliki mufassir (exegete), al-Qurtubi, writes in <i>al-Jaami' li Ahkaam il-Qur'an</i>, in explanation of the verse in Surah al-Kahf (18:21), refer to the printed version (Dar Aalam al-Kutub, 1423H, 10/381):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1601;&#1575;&#1578;&#1582;&#1575;&#1584; &#1575;&#1604;&#1605;&#1587;&#1575;&#1580;&#1583; &#1593;&#1604;&#1609; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1601;&#1610;&#1607;&#1575; &#1608;&#1575;&#1604;&#1576;&#1606;&#1575;&#1569; &#1593;&#1604;&#1610;&#1607;&#1575;&#1548; &#1573;&#1604;&#1609; &#1594;&#1610;&#1585; &#1584;&#1604;&#1603; &#1605;&#1605;&#1575; &#1578;&#1590;&#1605;&#1606;&#1578;&#1607; &#1575;&#1604;&#1587;&#1606;&#1577; &#1605;&#1606; &#1575;&#1604;&#1606;&#1607;&#1610; &#1593;&#1606;&#1607; &#1605;&#1605;&#1606;&#1608;&#1593; &#1604;&#1575; &#1610;&#1580;&#1608;&#1586;&#1563; ... &#1602;&#1575;&#1604; &#1593;&#1604;&#1605;&#1575;&#1572;&#1606;&#1575;: &#1608;&#1607;&#1584;&#1575; &#1610;&#1581;&#1585;&#1605; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1606; &#1610;&#1578;&#1582;&#1584;&#1608;&#1575; &#1602;&#1576;&#1608;&#1585; &#1575;&#1604;&#1571;&#1606;&#1576;&#1610;&#1575;&#1569; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1587;&#1575;&#1580;&#1583;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Taking places of worship over graves and praying therein and constructing over them and other such affairs all come under that which the Sunnah has forbade, it is prohibited, impermissible... Our scholars have said: And this is unlawful upon the Muslims, that they take the graves of their prophets and scholars as places of worship. </blockquote>    <P>
He continues:    <P>
 <div class='arabic' align='right' lang='AR-SA'>&#1608;&#1585;&#1608;&#1609; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1593;&#1606; &#1571;&#1576;&#1610; &#1605;&#1585;&#1579;&#1583; &#1575;&#1604;&#1594;&#1606;&#1608;&#1610; &#1602;&#1575;&#1604; &#1587;&#1605;&#1593;&#1578; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604;: (&#1604;&#1575; &#1578;&#1589;&#1604;&#1608;&#1575; &#1573;&#1604;&#1609; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1604;&#1575; &#1578;&#1580;&#1604;&#1587;&#1608;&#1575; &#1593;&#1604;&#1610;&#1607;&#1575;) &#1604;&#1601;&#1592; &#1605;&#1587;&#1604;&#1605;. &#1571;&#1610; &#1604;&#1575; &#1578;&#1578;&#1582;&#1584;&#1608;&#1607;&#1575; &#1602;&#1576;&#1604;&#1577; &#1601;&#1578;&#1589;&#1604;&#1608;&#1575; &#1593;&#1604;&#1610;&#1607;&#1575; &#1571;&#1608; &#1573;&#1604;&#1610;&#1607;&#1575; &#1603;&#1605;&#1575; &#1601;&#1593;&#1604; &#1575;&#1604;&#1610;&#1607;&#1608;&#1583; &#1608;&#1575;&#1604;&#1606;&#1589;&#1575;&#1585;&#1609;&#1548; &#1601;&#1610;&#1572;&#1583;&#1610; &#1573;&#1604;&#1609; &#1593;&#1576;&#1575;&#1583;&#1577; &#1605;&#1606; &#1601;&#1610;&#1607;&#1575; &#1603;&#1605;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1587;&#1576;&#1576; &#1601;&#1610; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1589;&#1606;&#1575;&#1605;. &#1601;&#1581;&#1584;&#1585; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1593;&#1606; &#1605;&#1579;&#1604; &#1584;&#1604;&#1603;&#1548; &#1608;&#1587;&#1583; &#1575;&#1604;&#1584;&#1585;&#1575;&#1574;&#1593; &#1575;&#1604;&#1605;&#1572;&#1583;&#1610;&#1577; &#1573;&#1604;&#1609; &#1584;&#1604;&#1603; &#1601;&#1602;&#1575;&#1604;: (&#1575;&#1588;&#1578;&#1583; &#1594;&#1590;&#1576; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1602;&#1608;&#1605; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1602;&#1576;&#1608;&#1585; &#1571;&#1606;&#1576;&#1610;&#1575;&#1574;&#1607;&#1605; &#1608;&#1589;&#1575;&#1604;&#1581;&#1610;&#1607;&#1605; &#1605;&#1587;&#1575;&#1580;&#1583;). &#1608;&#1585;&#1608;&#1609; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1575;&#1606; &#1593;&#1606; &#1593;&#1575;&#1574;&#1588;&#1577; &#1608;&#1593;&#1576;&#1583;&#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1593;&#1576;&#1575;&#1587; &#1602;&#1575;&#1604;&#1575;: &#1604;&#1605;&#1575; &#1606;&#1586;&#1604; &#1576;&#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1591;&#1601;&#1602; &#1610;&#1591;&#1585;&#1581; &#1582;&#1605;&#1610;&#1589;&#1577; &#1604;&#1607; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607;&#1607; &#1601;&#1573;&#1584;&#1575; &#1575;&#1594;&#1578;&#1605; &#1576;&#1607;&#1575; &#1603;&#1588;&#1601;&#1607;&#1575; &#1593;&#1606; &#1608;&#1580;&#1607;&#1607; &#1601;&#1602;&#1575;&#1604; &#1608;&#1607;&#1608; &#1603;&#1584;&#1604;&#1603;: (&#1604;&#1593;&#1606;&#1577; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1610;&#1607;&#1608;&#1583; &#1608;&#1575;&#1604;&#1606;&#1589;&#1575;&#1585;&#1609; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1602;&#1576;&#1608;&#1585; &#1571;&#1606;&#1576;&#1610;&#1575;&#1574;&#1607;&#1605; &#1605;&#1587;&#1575;&#1580;&#1583;) &#1610;&#1581;&#1584;&#1585; &#1605;&#1575; &#1589;&#1606;&#1593;&#1608;&#1575;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Scholars report from Abu Murthid al-Ghanawi who said: I heard the Messenger (sallallaahu alayhi wasallam) said, "<i>Do not pray towards the graves, and do not sit over them</i>", the wording is of Muslim. Meaning do not take them as a qiblah, praying over them or towards them as the Jews and <a href='tags/christians.html' class='tagLink'><font class='tagLink'>Christians</font></a> used to do, thereby leading to worship of whoever is within them, as was the underlying case of the worship of idols. So the Prophet (sallallaahu alayhi wasallam) warned against the likes of that and he closed the avenues leading towards that, so he said, "<i>Allah's anger is severe against a people who took the graves of their prophets and righteous as places of worship</i>." And in the two Sahihs, from Aa'ishah, Abd Allaah bin Abbaas, who both said, "When the illness befell the Messenger of Allaah (sallallaahu alayhi wasallam), he would put his shirt over his face and when it agitated him, he would remove it from his face, and he said whilst in that state, "<i>May Allaah curse the Jews and <a href='tags/christians.html' class='tagLink'><font class='tagLink'>Christians</font></a>, they took the graves of their prophets as places of worship</i>." He would warn from what they did. </blockquote>    <P>
Then he brings more narrations:    <P>
<div class='arabic' align='right' lang='AR-SA'> &#1608;&#1585;&#1608;&#1609; &#1605;&#1587;&#1604;&#1605; &#1593;&#1606; &#1580;&#1575;&#1576;&#1585; &#1602;&#1575;&#1604;: &#1606;&#1607;&#1610; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1571;&#1606; &#1610;&#1580;&#1589;&#1589; &#1575;&#1604;&#1602;&#1576;&#1585; &#1608;&#1571;&#1606; &#1610;&#1602;&#1593;&#1583; &#1593;&#1604;&#1610;&#1607; &#1608;&#1571;&#1606; &#1610;&#1576;&#1606;&#1609; &#1593;&#1604;&#1610;&#1607;. &#1608;&#1582;&#1585;&#1580;&#1607; &#1571;&#1576;&#1608; &#1583;&#1575;&#1608;&#1583; &#1608;&#1575;&#1604;&#1578;&#1585;&#1605;&#1584;&#1610; &#1571;&#1610;&#1590;&#1575; &#1593;&#1606; &#1580;&#1575;&#1576;&#1585; &#1602;&#1575;&#1604;: &#1606;&#1607;&#1609; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1589;&#1604;&#1609; &#1571;&#1606; &#1578;&#1580;&#1589;&#1589; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1571;&#1606; &#1610;&#1603;&#1578;&#1576; &#1593;&#1604;&#1610;&#1607;&#1575; &#1608;&#1571;&#1606; &#1610;&#1576;&#1606;&#1609; &#1593;&#1604;&#1610;&#1607;&#1575; &#1608;&#1571;&#1606; &#1578;&#1608;&#1591;&#1571;. &#1602;&#1575;&#1604; &#1575;&#1604;&#1578;&#1585;&#1605;&#1584;&#1610;: &#1607;&#1584;&#1575; &#1581;&#1583;&#1610;&#1579; &#1581;&#1587;&#1606; &#1589;&#1581;&#1610;&#1581;. &#1608;&#1585;&#1608;&#1609; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1593;&#1606; &#1571;&#1576;&#1610; &#1575;&#1604;&#1607;&#1610;&#1575;&#1580; &#1575;&#1604;&#1571;&#1587;&#1583;&#1610; &#1602;&#1575;&#1604; &#1602;&#1575;&#1604; &#1604;&#1610; &#1593;&#1604;&#1610; &#1576;&#1606; &#1571;&#1576;&#1610; &#1591;&#1575;&#1604;&#1576;: &#1571;&#1604;&#1575; &#1571;&#1576;&#1593;&#1579;&#1603; &#1593;&#1604;&#1609; &#1605;&#1575; &#1576;&#1593;&#1579;&#1606;&#1610; &#1593;&#1604;&#1610;&#1607; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;: &#1571;&#1604;&#1575; &#1578;&#1583;&#1593; &#1578;&#1605;&#1579;&#1575;&#1604;&#1575; &#1573;&#1604;&#1575; &#1591;&#1605;&#1587;&#1578;&#1607; &#1608;&#1604;&#1575; &#1602;&#1576;&#1585;&#1575; &#1605;&#1588;&#1585;&#1601;&#1575; &#1573;&#1604;&#1575; &#1587;&#1608;&#1610;&#1578;&#1607; - &#1601;&#1610; &#1585;&#1608;&#1575;&#1610;&#1577; - &#1608;&#1604;&#1575; &#1589;&#1608;&#1585;&#1577; &#1573;&#1604;&#1575; &#1591;&#1605;&#1587;&#1578;&#1607;&#1575;. &#1608;&#1571;&#1582;&#1585;&#1580;&#1607; &#1571;&#1576;&#1608; &#1583;&#1575;&#1608;&#1583; &#1608;&#1575;&#1604;&#1578;&#1585;&#1605;&#1584;&#1610;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And Muslim reports from Jaabir who said, "<i>The Messenger of Allaah (sallallaahu alayhi wasallam) prohibited the plastering of graves, sitting on them and construction over them</i>" ... and in the Sahih (of al-Bukhari) from Abu al-Hayaaj al-Asadee who said: Ali (bin Abi Talib) said, "<i>Shall I not send you as the Messenger of Allaah (sallallaahu alayhi wasallam) sent me? That you do not leave any idol except that you destroy it, and nor any raised grave except that you level it</i>" - and in a narration, "<i>and nor any picture except that you obliterate it</i>" and it was related also by Abu Dawud and al-Tirmidhi. </blockquote>    <P>
Then he says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1602;&#1575;&#1604; &#1593;&#1604;&#1605;&#1575;&#1572;&#1606;&#1575;: &#1592;&#1575;&#1607;&#1585;&#1607; &#1605;&#1606;&#1593; &#1578;&#1587;&#1606;&#1610;&#1605; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1585;&#1601;&#1593;&#1607;&#1575; &#1608;&#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1604;&#1575;&#1591;&#1574;&#1577;. &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1576;&#1607; &#1576;&#1593;&#1590; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;. &#1608;&#1584;&#1607;&#1576; &#1575;&#1604;&#1580;&#1605;&#1607;&#1608;&#1585; &#1573;&#1604;&#1609; &#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1575;&#1585;&#1578;&#1601;&#1575;&#1593; &#1575;&#1604;&#1605;&#1571;&#1605;&#1608;&#1585; &#1576;&#1573;&#1586;&#1575;&#1604;&#1578;&#1607; &#1607;&#1608; &#1605;&#1575; &#1586;&#1575;&#1583; &#1593;&#1604;&#1609; &#1575;&#1604;&#1578;&#1587;&#1606;&#1610;&#1605;&#1548; &#1608;&#1610;&#1576;&#1602;&#1609; &#1604;&#1604;&#1602;&#1576;&#1585; &#1605;&#1575; &#1610;&#1593;&#1585;&#1601; &#1576;&#1607; &#1608;&#1610;&#1581;&#1578;&#1585;&#1605;&#1548; &#1608;&#1584;&#1604;&#1603; &#1589;&#1601;&#1577; &#1602;&#1576;&#1585; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1602;&#1576;&#1585; &#1589;&#1575;&#1581;&#1576;&#1610;&#1607; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605;&#1575; - &#1593;&#1604;&#1609; &#1605;&#1575; &#1584;&#1603;&#1585; &#1605;&#1575;&#1604;&#1603; &#1601;&#1610; &#1575;&#1604;&#1605;&#1608;&#1591;&#1571; - &#1608;&#1602;&#1576;&#1585; &#1571;&#1576;&#1610;&#1606;&#1575; &#1570;&#1583;&#1605; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1593;&#1604;&#1609; &#1605;&#1575; &#1585;&#1608;&#1575;&#1607; &#1575;&#1604;&#1583;&#1575;&#1585;&#1602;&#1591;&#1606;&#1610; &#1605;&#1606; &#1581;&#1583;&#1610;&#1579; &#1575;&#1576;&#1606; &#1593;&#1576;&#1575;&#1587;. &#1608;&#1571;&#1605;&#1575; &#1578;&#1593;&#1604;&#1610;&#1577; &#1575;&#1604;&#1576;&#1606;&#1575;&#1569; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1593;&#1604;&#1609; &#1606;&#1581;&#1608; &#1605;&#1575; &#1603;&#1575;&#1606;&#1578; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1578;&#1601;&#1593;&#1604;&#1607; &#1578;&#1601;&#1582;&#1610;&#1605;&#1575; &#1608;&#1578;&#1593;&#1592;&#1610;&#1605;&#1575; &#1601;&#1584;&#1604;&#1603; &#1610;&#1607;&#1583;&#1605; &#1608;&#1610;&#1586;&#1575;&#1604;&#1563; &#1601;&#1573;&#1606; &#1601;&#1610;&#1607; &#1575;&#1587;&#1578;&#1593;&#1605;&#1575;&#1604; &#1586;&#1610;&#1606;&#1577; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1601;&#1610; &#1571;&#1608;&#1604; &#1605;&#1606;&#1575;&#1586;&#1604; &#1575;&#1604;&#1570;&#1582;&#1585;&#1577;&#1548; &#1608;&#1578;&#1588;&#1576;&#1607;&#1575; &#1576;&#1605;&#1606; &#1603;&#1575;&#1606; &#1610;&#1593;&#1592;&#1605; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1610;&#1593;&#1576;&#1583;&#1607;&#1575;. &#1608;&#1576;&#1575;&#1593;&#1578;&#1576;&#1575;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1593;&#1575;&#1606;&#1610; &#1608;&#1592;&#1575;&#1607;&#1585; &#1575;&#1604;&#1606;&#1607;&#1610; &#1571;&#1606; &#1610;&#1606;&#1576;&#1594;&#1610; &#1571;&#1606; &#1610;&#1602;&#1575;&#1604;: &#1607;&#1608; &#1581;&#1585;&#1575;&#1605;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Our Scholars said: That which is apparent from it is prohibition of raising graves and that they should be level. But some of the people of knowledge have spoken with this (view) although the majority hold the view that the raising whose levelling has been commanded is what is additional to the natural raising of the grave, and that there should remain that by which the grave can be recognized and respected. This is the description of the grave of our Prophet (sallallaahu alayhi wasallam) upon what has been reported by al-Darqutnee from the hadeeth of <a href='tags/ibn-abbaas.html' class='tagLink'><font class='tagLink'>Ibn Abbaas</font></a>. As for making much-elevated constructions like what the (people) of <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>jaahiliyyah</font></a> used to out of exaggeration and veneration, then that is to be destroyed and terminated. For there is contained within (that practice) the placing of the adornment of the world into the very first stage (of the stages of) the Hereafter, and resemblance of those who used to venerate the graves and worship them. And out of consideration of this meaning, and the apparent prohibition (in the texts) it is desirable for it to be said: <b>(This practice) is haraam (unlawful)</b>.</blockquote>    <P>
<font class='titleHeadline'>Comment</font>    <P>
<blockquote>When al-Qurtubee said "<i>Our scholars</i>..." he is speaking of the Maaliki jurists, and it is established that this is what the Maalikiyyah are upon (just like the other jurists of other schools),  that this practice is "<b>haraam</b>." As for the doubt about the Prophet's grave then that will be dealt with in other articles but briefly, there is nothing in that for the innovators to justify their beautification, adornment and construction over the graves of the dead whom they venerate, because <u>firstly</u>, the masjid was already built and present before the grave of the Prophet (sallallaahu alayhi wasallam) and no one built a place of worship on or around the Prophet's grave, the mosque was already there, and the Prophet was buried outside of the mosque in the house of Aa'ishah (radiallaahu anhaa). <u>Secondly</u>, the  mosque was expanded in the time of al-Waleed bin Abd al-Malik (in 88H) who ordered the governor of Madeenah, Umar bin Abd al-Azeez, to expand it, who did so reluctantly, and it incorporated the grave of the Prophet (sallallaahu alayhi wasallam) and al-Waleed was criticised by some of the people of knowledge for that in his time, though he considered nothing wrong with this, and he ordered that it be done. From this, a) no place of worship was built over the grave of the Prophet, and b) nor was the Prophet buried in a mosque, hence, there is no proof at all in this for the Innovators, and everything in those Prophetic statements of severe prohibition remains, and the jurists of the various schools never ceased speaking with that prohibition.    <P>
</blockquote> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.wahhabis.com/print.cfm?qaehvcx by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:09:32 GMT -->
</html>


