

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.dajjaal.com/liar/articles/czuhb-shaykh-muhammad-bin-salih-al-uthaymeen-clarification-on-issues-pertaining-to-magic-sihr.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:10:54 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>

	<title>Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment</title>
	
	
	<meta name="Keywords" content="">
	<meta name="Description" content="Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment.  ...">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	
    <link rel="STYLESHEET" type="text/css" href="../scripts/bootstrap.min.css">
    <script src="../scripts/bootstrap.min.js"></script>
    <link rel="STYLESHEET" type="text/css" href="../style.css">
    <link rel="STYLESHEET" type="text/css" href="../scripts/custom.css">

</head>

<body>

	<div class="container">

		<div>
			

<div class="d-flex flex-wrap align-items-center textSmall pb-2 pt-3 px-1">
  <div class="d-flex flex-wrap align-items-center w-full lg:w-auto">
    
  </div>
  <div class="d-flex align-items-center pt-2 pt-lg-0 justify-content-start justify-content-lg-end w-full lg:w-auto ms-lg-auto">
    <span>Monday, 11 August 2025&nbsp;&nbsp;&nbsp;</span>
    <a href="../index.html">Home</a> &nbsp;&#149;&nbsp; 
    <a href="../about.html">About Us</a> &nbsp;&#149;&nbsp;  
    
    <a href="../contact.html">Contact Us</a> 
  </div>
</div>



<div>
  <img src="../images/banner.gif" width="100%" height="auto" border="0" alt="">
</div>








<nav class="navbar navbar-expand-lg navbar-light bg-light">
  <div class="container-fluid">
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNav" aria-controls="navbarNav" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon">
        <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 30 30'><path stroke='#FFFFFF' stroke-linecap='round' stroke-miterlimit='10' stroke-width='2' d='M4 7h22M4 15h22M4 23h22'/></svg>
      </span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNav">
      <ul class="navbar-nav pt-2 pt-lg-0 me-auto">
        <li class="nav-item">
          <a class="nav-link" href="../index.html">HOME</a>
        </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/dajjaal.html">DAJJAAL (ANTI-CHRIST)</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/jesus-the-messiah.html">JESUS THE MESSIAH</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/satan-and-the-jinn.html">SATAN AND THE JINN</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/magic-and-occult.html">MAGIC AND THE OCCULT</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/articles.html">ARTICLES</a>
            </li>
        
        <li class="nav-item">
          <a class="nav-link" href="../reports.html">REPORTS</a>
        </li>
	    </ul>
      <ul class="navbar-nav">
        <li class="nav-item"><a class="nav-link" href="../rss.html">RSS</a></li>
        <li class="nav-item"><a class="nav-link" href="../tags.html">TAGS</a></li>
        <li class="nav-item"><a class="nav-link" href="../search.html">SEARCH</a></li>
        
          <li class="nav-item lg:ms-auto"><a class="nav-link" href="../signin.html">LOGIN</a></li>
        
      </ul>
    </div>
  </div>
</nav>





		</div>
	
		<div class="d-flex flex-column flex-lg-row bg-white pt-3">
			<div class="px-3 w-full lg:w-7/12">
				<font style="font-size:12px;">You are here: <a href="../index.html">Home</a> / 
<a href="../categories/magic-and-occult.html">Magic and the Occult</a> 
</font>
				<hr size="1" noshade style="margin-top:12" color="#cdcdcd">
				<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
					<tr>
						
							<td valign="top" width="100%">
								<span class="articleTitle">Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment</span>
								<BR>
								Filed under: <a href="../categories/magic-and-occult.html">Magic and the Occult</a>
								<BR>
								Wednesday, November 07 2012 - by <a href="../authors/Admin.html">Admin</a>
								<BR>
								
								<BR>
								<img src="../images/spacer.gif" width="10" height="4"><BR>
								<!-- AddThis Button BEGIN -->
								<a class="addthis_button" href="http://addthis.com/bookmark.php?v=250&amp;pub=xa-4b1aa87179c845dd"><img src="../../../s7.addthis.com/static/btn/v2/lg-share-en.gif" width="125" height="16" alt="Bookmark and Share" style="border:0"/></a><script type="text/javascript" src="../../../s7.addthis.com/js/250/addthis_widget.js#pub=xa-4b1aa87179c845dd"></script>
								<!-- AddThis Button END -->
							</td>
						
					</tr>
				</table>


				<hr size="1" noshade style="margin-top:12" color="#cdcdcd">

				

				<a href="mailto:Enter_Email?subject=Dajjaal.Com | Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment&body=You may be interested in this article:%0D%0A%0D%0AShaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment%0D%0Ahttps://www.dajjaal.com/liar/?czuhb">Mail to a Friend</a> &#149;
				<a href="../print52a8.html?czuhb">Printer friendly</a> 

				

				<br><br>

				
				
<div class="articleContent">
<img src=../assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>The Shaykh has numerous writings and fataawaa and we have translated something of them in what has preceded:    <P>
<ul><li> Shaykh Ibn al-Uthaymeen: Sikhr Takhyeeliyy (Illusionary Magic) is True and Real and Has an Actual Effect - (<a href=../index7725.html?suquy>see here</a>)  <li> Shaykh Ibn al-Uthaymeen on the Magic that Expels from Islam and the Magic Which Does Not - (<a href=../index27ec.html?gwwua>see here</a>)  </ul>    <P>
In this article we want to bring a selection of fatawaa from the Shaykh on this issue to see some of the tafseelaat (detailed elaborations and classifications) he provides, and which in relation to all other articles on this subject, will give us a greater, all round picture of the issue.</div>    <P>
The Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/noor/article_807.shtml>as occurs here</a>)    <P>
<blockquote><div class='arabic' align='right'>&#1602;&#1576;&#1604; &#1575;&#1604;&#1573;&#1580;&#1575;&#1576;&#1577; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1571;&#1608;&#1583; &#1571;&#1606; &#1571;&#1576;&#1610;&#1606; &#1571;&#1606; &#1575;&#1604;&#1587;&#1581;&#1585; &#1605;&#1606; &#1571;&#1603;&#1576;&#1585; &#1575;&#1604;&#1605;&#1581;&#1585;&#1605;&#1575;&#1578; &#1576;&#1604; &#1607;&#1608; &#1605;&#1606; &#1575;&#1604;&#1603;&#1601;&#1585; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1610;&#1587;&#1578;&#1593;&#1610;&#1606; &#1576;&#1575;&#1604;&#1571;&#1581;&#1608;&#1575;&#1604; &#1575;&#1604;&#1588;&#1610;&#1591;&#1575;&#1606;&#1610;&#1577; &#1593;&#1604;&#1609; &#1587;&#1581;&#1585;&#1607; &#1571;&#1608; &#1610;&#1578;&#1608;&#1589;&#1604; &#1576;&#1607; &#1573;&#1604;&#1609; &#1575;&#1604;&#1588;&#1585;&#1603; &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1576;&#1575;&#1585;&#1603; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; (&#1608;&#1575;&#1578;&#1576;&#1593;&#1608;&#1575; &#1605;&#1575; &#1578;&#1578;&#1604;&#1608;&#1575; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1593;&#1604;&#1609; &#1605;&#1604;&#1603; &#1587;&#1604;&#1610;&#1605;&#1575;&#1606; &#1608;&#1605;&#1575; &#1603;&#1601;&#1585; &#1587;&#1604;&#1610;&#1605;&#1575;&#1606; &#1608;&#1604;&#1603;&#1606; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1603;&#1601;&#1585;&#1608;&#1575; &#1610;&#1593;&#1604;&#1605;&#1608;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1575;&#1604;&#1587;&#1581;&#1585; &#1608;&#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1604;&#1603;&#1610;&#1606; &#1576;&#1576;&#1575;&#1576;&#1604; &#1607;&#1575;&#1585;&#1608;&#1578; &#1608;&#1605;&#1575;&#1585;&#1608;&#1578; &#1608;&#1605;&#1575; &#1610;&#1593;&#1604;&#1605;&#1575;&#1606; &#1605;&#1606; &#1571;&#1581;&#1583; &#1581;&#1578;&#1609; &#1610;&#1602;&#1608;&#1604;&#1575; &#1573;&#1606;&#1605;&#1575; &#1606;&#1581;&#1606; &#1601;&#1578;&#1606;&#1577; &#1601;&#1604;&#1575; &#1578;&#1603;&#1601;&#1585;) &#1601;&#1607;&#1584;&#1575; &#1583;&#1604;&#1610;&#1604; &#1593;&#1604;&#1609; &#1571;&#1606; &#1578;&#1593;&#1604;&#1605; &#1575;&#1604;&#1587;&#1581;&#1585; &#1603;&#1601;&#1585; (&#1575;&#1604;&#1587;&#1581;&#1585; &#1605;&#1578;&#1604;&#1602;&#1609; &#1605;&#1606; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606;) &#1608;&#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1601;&#1610;&#1580;&#1576; &#1575;&#1604;&#1581;&#1584;&#1585; &#1605;&#1606;&#1607; &#1608;&#1575;&#1604;&#1576;&#1593;&#1583; &#1593;&#1606;&#1607; &#1581;&#1578;&#1609; &#1604;&#1575; &#1610;&#1602;&#1593; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1603;&#1601;&#1585; &#1575;&#1604;&#1605;&#1582;&#1585;&#1580; &#1593;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577; &#1608;&#1575;&#1604;&#1593;&#1610;&#1575;&#1584; &#1576;&#1575;&#1604;&#1604;&#1607;</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Before answering this question I would like to explain that magic is from the greatest of unlawful things, rather it is from disbelief when the magician seeks aid through the devilish stations for his magic, or he attains it through shirk. For Allaah, the Blessed and Exalted said, "<b>They followed what the Shayaateen (devils) gave out (falsely of the magic) in the lifetime of <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (<a href='../tags/solomon.html' class='tagLink'><font class='tagLink'>Solomon</font></a>). <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic and such things that came down at <a href='../tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='../tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='../tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i></b>"." (2:102). This is evidence that learning mgaic is kufr, the magic which is taken from the devils, and upon this it is obligatory to take caution from it and to be far away from it so that a person does not fall into  disbelief which expels from the religion and refuge is with Allaah.</blockquote>    <P>
And the Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/noor/article_808.shtml>as occurs here</a>) in an answer to a question:    <P>
<blockquote><div class='arabic' align='right'>&#1575;&#1604;&#1587;&#1572;&#1575;&#1604;: &#1575;&#1604;&#1588;&#1582;&#1589; &#1575;&#1604;&#1584;&#1610; &#1610;&#1587;&#1578;&#1582;&#1583;&#1605; &#1575;&#1604;&#1587;&#1581;&#1585; &#1571;&#1608; &#1610;&#1586;&#1575;&#1608;&#1604; &#1575;&#1604;&#1587;&#1581;&#1585; &#1605;&#1575;&#1584;&#1575; &#1593;&#1604;&#1610;&#1607;&#1567;    	&#1575;&#1604;&#1580;&#1608;&#1575;&#1576;: &#1587;&#1576;&#1602; &#1571;&#1606; &#1602;&#1604;&#1606;&#1575; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1587;&#1581;&#1585;&#1607; &#1576;&#1608;&#1575;&#1587;&#1591;&#1577; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1571;&#1608; &#1604;&#1575; &#1610;&#1578;&#1608;&#1589;&#1604; &#1573;&#1604;&#1610;&#1607; &#1573;&#1604;&#1575; &#1576;&#1575;&#1604;&#1588;&#1585;&#1603; &#1571;&#1606; &#1607;&#1584;&#1575; &#1588;&#1585;&#1603; &#1605;&#1582;&#1585;&#1580; &#1593;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577;</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'><b>Question:</b> A person who uses magic or who devotes himself to it, what is upon him? <b>Answer:</b> It has already preceded that if his magic was through the agency of the devils or (the magic) cannot be attained except through shirk, this is shirk which expels from the religion.  </blockquote>    <P>
And the Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/noor/article_913.shtml>as occurs here</a>) in an answer to another question:    <P>
<blockquote><div class='arabic' align='right'>&#1575;&#1604;&#1587;&#1581;&#1585; &#1605;&#1606; &#1603;&#1576;&#1575;&#1574;&#1585; &#1575;&#1604;&#1584;&#1606;&#1608;&#1576; &#1608;&#1605;&#1606;&#1607; &#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1603;&#1601;&#1585;&#1575;&#1611; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604; (&#1608;&#1614;&#1604;&#1614;&#1602;&#1614;&#1583;&#1618; &#1593;&#1614;&#1604;&#1616;&#1605;&#1615;&#1608;&#1575; &#1604;&#1614;&#1605;&#1614;&#1606;&#1616; &#1575;&#1588;&#1618;&#1578;&#1614;&#1585;&#1614;&#1575;&#1607;&#1615; &#1605;&#1614;&#1575; &#1604;&#1614;&#1607;&#1615; &#1601;&#1616;&#1610; &#1575;&#1604;&#1618;&#1570;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1605;&#1616;&#1606;&#1618; &#1582;&#1614;&#1604;&#1575;&#1602;&#1613;) &#1604;&#1605; &#1610;&#1603;&#1606; &#1604;&#1607; &#1582;&#1604;&#1575;&#1602; &#1571;&#1610; &#1606;&#1589;&#1610;&#1576; &#1601;&#1610; &#1575;&#1604;&#1570;&#1582;&#1585; &#1601;&#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1603;&#1575;&#1601;&#1585; &#1576;&#1604; &#1601;&#1610; &#1575;&#1604;&#1570;&#1610;&#1575;&#1578; &#1575;&#1604;&#1587;&#1575;&#1576;&#1602;&#1577; &#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1604;&#1603;&#1575;&#1606; &#1573;&#1606;&#1605;&#1575; &#1606;&#1581;&#1606; &#1601;&#1578;&#1606;&#1577; &#1601;&#1604;&#1575; &#1578;&#1603;&#1601;&#1585; &#1601;&#1604;&#1575; &#1610;&#1581;&#1604; &#1604;&#1571;&#1581;&#1583; &#1571;&#1606; &#1610;&#1578;&#1593;&#1575;&#1591;&#1609; &#1575;&#1604;&#1587;&#1581;&#1585; &#1604;&#1571;&#1606;&#1607; &#1573;&#1605;&#1575; &#1603;&#1576;&#1610;&#1585;&#1577; &#1608;&#1573;&#1605;&#1575; &#1603;&#1601;&#1585; &#1593;&#1604;&#1609; &#1581;&#1587;&#1576; &#1575;&#1604;&#1578;&#1601;&#1589;&#1610;&#1604; &#1575;&#1604;&#1584;&#1610; &#1584;&#1603;&#1585;&#1607; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Magic is from the major sins and from it is that which is disbelief, Allaah, the Mighty and Majestic said, "<b>And indeed they knew that the buyers of it (magic) would have no share in the Hereafter</b>." (2:101-102), he will not have any "khalaaq" meaning portion in the hereafter. So this one is a disbeliever, rather in the preceding verses, the angels say, "We are a tribulation so do no disbelieve", hence it is not permissible for anyone to engage in magic because it is either a major sin or disbelief according to the tafseel (detail, classification) which the Scholars have mentioned.</blockquote>    <P>
And the Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/noor/article_1207.shtml>as occurs here</a>) in an answer to another question:    <P>
<blockquote><div class='arabic' align='right'>&#1575;&#1604;&#1587;&#1581;&#1585; &#1604;&#1575; &#1588;&#1603; &#1571;&#1606;&#1607; &#1583;&#1575;&#1569; &#1593;&#1590;&#1575;&#1604; &#1608;&#1571;&#1606;&#1607; &#1580;&#1606;&#1575;&#1610;&#1577; &#1605;&#1606; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1593;&#1592;&#1610;&#1605;&#1577; &#1608;&#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1575;&#1604;&#1584;&#1610; &#1610;&#1587;&#1578;&#1593;&#1610;&#1606; &#1576;&#1575;&#1604;&#1571;&#1585;&#1608;&#1575;&#1581; &#1575;&#1604;&#1588;&#1610;&#1591;&#1575;&#1606;&#1610;&#1577; &#1571;&#1608; &#1576;&#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1571;&#1608; &#1576;&#1575;&#1604;&#1580;&#1606; &#1603;&#1575;&#1601;&#1585; &#1608;&#1575;&#1604;&#1593;&#1610;&#1575;&#1584; &#1576;&#1575;&#1604;&#1604;&#1607; &#1603;&#1601;&#1585;&#1575; &#1605;&#1582;&#1585;&#1580;&#1575; &#1593;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577; &#1608;&#1573;&#1606; &#1589;&#1575;&#1605; &#1608;&#1589;&#1604;&#1609; &#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1578;&#1576;&#1575;&#1585;&#1603; (&#1608;&#1614;&#1575;&#1578;&#1614;&#1617;&#1576;&#1614;&#1593;&#1615;&#1608;&#1575; &#1605;&#1614;&#1575; &#1578;&#1614;&#1578;&#1618;&#1604;&#1615;&#1608;&#1575; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1615; &#1593;&#1614;&#1604;&#1614;&#1609; &#1605;&#1615;&#1604;&#1618;&#1603;&#1616; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1615; &#1608;&#1614;&#1604;&#1614;&#1603;&#1616;&#1606;&#1614;&#1617; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1614; &#1603;&#1614;&#1601;&#1614;&#1585;&#1615;&#1608;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1606;&#1614;&#1617;&#1575;&#1587;&#1614; &#1575;&#1604;&#1587;&#1616;&#1617;&#1581;&#1618;&#1585;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1618;&#1586;&#1616;&#1604;&#1614; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1614;&#1603;&#1614;&#1610;&#1618;&#1606;&#1616; &#1576;&#1616;&#1576;&#1614;&#1575;&#1576;&#1616;&#1604;&#1614; &#1607;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1614;&#1575;&#1606;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1581;&#1614;&#1578;&#1614;&#1617;&#1609; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1575; &#1573;&#1616;&#1606;&#1614;&#1617;&#1605;&#1614;&#1575; &#1606;&#1614;&#1581;&#1618;&#1606;&#1615; &#1601;&#1616;&#1578;&#1618;&#1606;&#1614;&#1577;&#1612; &#1601;&#1614;&#1604;&#1575; &#1578;&#1614;&#1603;&#1618;&#1601;&#1615;&#1585;&#1618; &#1601;&#1614;&#1610;&#1614;&#1578;&#1614;&#1593;&#1614;&#1604;&#1614;&#1617;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1618;&#1607;&#1615;&#1605;&#1614;&#1575; &#1605;&#1614;&#1575; &#1610;&#1615;&#1601;&#1614;&#1585;&#1616;&#1617;&#1602;&#1615;&#1608;&#1606;&#1614; &#1576;&#1616;&#1607;&#1616; &#1576;&#1614;&#1610;&#1618;&#1606;&#1614; &#1575;&#1604;&#1618;&#1605;&#1614;&#1585;&#1618;&#1569;&#1616; &#1608;&#1614;&#1586;&#1614;&#1608;&#1618;&#1580;&#1616;&#1607;&#1616; &#1608;&#1614;&#1605;&#1614;&#1575; &#1607;&#1615;&#1605;&#1618; &#1576;&#1616;&#1590;&#1614;&#1575;&#1585;&#1616;&#1617;&#1610;&#1606;&#1614; &#1576;&#1616;&#1607;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1573;&#1616;&#1604;&#1614;&#1617;&#1575; &#1576;&#1616;&#1573;&#1616;&#1584;&#1618;&#1606;&#1616; &#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1616; &#1608;&#1614;&#1610;&#1614;&#1578;&#1614;&#1593;&#1614;&#1604;&#1614;&#1617;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1614;&#1575; &#1610;&#1614;&#1590;&#1615;&#1585;&#1615;&#1617;&#1607;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1575; &#1610;&#1614;&#1606;&#1618;&#1601;&#1614;&#1593;&#1615;&#1607;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1614;&#1602;&#1614;&#1583;&#1618; &#1593;&#1614;&#1604;&#1616;&#1605;&#1615;&#1608;&#1575; &#1604;&#1614;&#1605;&#1614;&#1606;&#1616; &#1575;&#1588;&#1618;&#1578;&#1614;&#1585;&#1614;&#1575;&#1607;&#1615; &#1605;&#1614;&#1575; &#1604;&#1614;&#1607;&#1615; &#1601;&#1616;&#1610; &#1575;&#1604;&#1618;&#1570;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1605;&#1616;&#1606;&#1618; &#1582;&#1614;&#1604;&#1575;&#1602;&#1613; &#1608;&#1614;&#1604;&#1614;&#1576;&#1616;&#1574;&#1618;&#1587;&#1614; &#1605;&#1614;&#1575; &#1588;&#1614;&#1585;&#1614;&#1608;&#1618;&#1575; &#1576;&#1616;&#1607;&#1616; &#1571;&#1614;&#1606;&#1618;&#1601;&#1615;&#1587;&#1614;&#1607;&#1615;&#1605;&#1618; &#1604;&#1614;&#1608;&#1618; &#1603;&#1614;&#1575;&#1606;&#1615;&#1608;&#1575; &#1610;&#1614;&#1593;&#1618;&#1604;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614;) &#1601;&#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1575;&#1604;&#1584;&#1610; &#1610;&#1587;&#1578;&#1593;&#1610;&#1606; &#1576;&#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1608;&#1575;&#1604;&#1571;&#1585;&#1608;&#1575;&#1581; &#1575;&#1604;&#1588;&#1610;&#1591;&#1575;&#1606;&#1610;&#1577; &#1608;&#1575;&#1604;&#1580;&#1606; &#1603;&#1575;&#1601;&#1585;</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>There is no doubt that magic is a chronic disease and that it is a great crime on behalf of the magician. And the magician that seeks aid through the satanic spirits or through the devils or the <a href='../tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> is a disbeliever, and refuge is with Allaah, with disbelief that expels from the religion, even if fasts and prays, due to the saying of Allaah, the Exalted and Blessed, "<b>They followed what the Shayaateen (devils) gave out (falsely of the magic) in the lifetime of <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (<a href='../tags/solomon.html' class='tagLink'><font class='tagLink'>Solomon</font></a>). <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic and such things that came down at <a href='../tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='../tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='../tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i>." And from these (angels) people learn that by which they cause separation between man and his wife, but they could not thus harm anyone except by Allah's permission. And they learn that which harms them and profits them not. And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. And how bad indeed was that for which they sold their ownselves, if they but knew</b>" (2:101-102). Hence, the magician that seeks aid through the devils and satanic spirits and the <a href='../tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> is a disbeliever. </blockquote>    <P>
And the Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/noor/article_1497.shtml>as occurs here</a>) in an answer to another question:    <P>
<blockquote><div class='arabic' align='right'>&#1606;&#1593;&#1605; &#1575;&#1604;&#1587;&#1581;&#1585; &#1606;&#1608;&#1593;&#1575;&#1606; &#1606;&#1608;&#1593; &#1603;&#1601;&#1585; &#1608;&#1606;&#1608;&#1593; &#1593;&#1583;&#1608;&#1575;&#1606; &#1608;&#1592;&#1604;&#1605; &#1571;&#1605;&#1575; &#1575;&#1604;&#1603;&#1601;&#1585; &#1601;&#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1603;&#1608;&#1606; &#1605;&#1578;&#1604;&#1602;&#1575;&#1611; &#1605;&#1606; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1601;&#1575;&#1604;&#1584;&#1610; &#1610;&#1578;&#1604;&#1602;&#1609; &#1605;&#1606; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1607;&#1584;&#1575; &#1603;&#1601;&#1585; &#1608;&#1583;&#1604;&#1610;&#1604; &#1584;&#1604;&#1603; &#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; (&#1608;&#1614;&#1575;&#1578;&#1614;&#1617;&#1576;&#1614;&#1593;&#1615;&#1608;&#1575; &#1605;&#1614;&#1575; &#1578;&#1614;&#1578;&#1618;&#1604;&#1615;&#1608;&#1575; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1615; &#1593;&#1614;&#1604;&#1614;&#1609; &#1605;&#1615;&#1604;&#1618;&#1603;&#1616; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1615; &#1608;&#1614;&#1604;&#1614;&#1603;&#1616;&#1606;&#1614;&#1617; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1614; &#1603;&#1614;&#1601;&#1614;&#1585;&#1615;&#1608;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1606;&#1614;&#1617;&#1575;&#1587;&#1614; &#1575;&#1604;&#1587;&#1616;&#1617;&#1581;&#1618;&#1585;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1618;&#1586;&#1616;&#1604;&#1614; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1614;&#1603;&#1614;&#1610;&#1618;&#1606;&#1616; &#1576;&#1616;&#1576;&#1614;&#1575;&#1576;&#1616;&#1604;&#1614; &#1607;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1614;&#1575;&#1606;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1581;&#1614;&#1578;&#1614;&#1617;&#1609; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1575; &#1573;&#1616;&#1606;&#1614;&#1617;&#1605;&#1614;&#1575; &#1606;&#1614;&#1581;&#1618;&#1606;&#1615; &#1601;&#1616;&#1578;&#1618;&#1606;&#1614;&#1577;&#1612; &#1601;&#1614;&#1604;&#1575; &#1578;&#1614;&#1603;&#1618;&#1601;&#1615;&#1585;&#1618;) &#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1608;&#1593; &#1605;&#1606; &#1575;&#1604;&#1587;&#1581;&#1585; &#1603;&#1601;&#1585; &#1605;&#1582;&#1585;&#1580; &#1593;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577; &#1610;&#1602;&#1578;&#1604; &#1605;&#1578;&#1593;&#1575;&#1591;&#1610;&#1607;... &#1575;&#1604;&#1606;&#1608;&#1593; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1605;&#1606; &#1575;&#1604;&#1587;&#1581;&#1585; &#1587;&#1581;&#1585; &#1604;&#1575; &#1610;&#1603;&#1608;&#1606; &#1576;&#1571;&#1605;&#1585; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1604;&#1603;&#1606;&#1607; &#1576;&#1571;&#1583;&#1608;&#1610;&#1577; &#1608;&#1593;&#1602;&#1575;&#1602;&#1610;&#1585; &#1608;&#1571;&#1588;&#1610;&#1575;&#1569; &#1581;&#1587;&#1610;&#1577; &#1601;&#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1608;&#1593; &#1604;&#1575; &#1610;&#1615;&#1603;&#1601;&#1616;&#1617;&#1585; &#1608;&#1604;&#1603;&#1606; &#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1602;&#1578;&#1604; &#1601;&#1575;&#1593;&#1604;&#1607; &#1583;&#1585;&#1569;&#1575; &#1604;&#1601;&#1587;&#1575;&#1583;&#1607; &#1608;&#1573;&#1601;&#1587;&#1575;&#1583;&#1607;</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Yes, magic is of two types, a type that is disbelief and a type that is oppression. As for that which is disbelief, that is what is derived, taken from the devils, so the one who takes from the devils, this is disbelief and the evidence is the saying of His saying, the Exalted, "<b>They followed what the Shayaateen (devils) gave out (falsely of the magic) in the lifetime of <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (<a href='../tags/solomon.html' class='tagLink'><font class='tagLink'>Solomon</font></a>). <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic and such things that came down at <a href='../tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='../tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='../tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i>".</b>" (2:101-102). And this type of magic is disbelief which expels from the religion, the one who engages in it is killed (as an apostate)... the second type of magic is the magic which does not occur through the affair of the devils, but it is through potions and medications and perceptible things, this type does not expel from Islam but it is obligatory to kill the one who does it in order to repel his own corruption and causing of corruption.  </blockquote>    <P>
Note that Islam has come to protect the five necessities: <u>a)</u> sound religion, <u>b)</u> the body, <u>c)</u> the mind or intellect, <u>d)</u> wealth and property and <u>e)</u> honour and lineage. The legislations in Islaam are aimed at protecting these five necessities, and it is from this perspective we understand the wisdom behind the various injunctions in many different affairs (marriage, divorce, inheritance, intoxicants, social dealings, transactions and so on). With respect to magic in particular, then it is something that destroys these five necessities, magic (in its various types) affects them all, it affects sound religion (eemaan, tawhid), the bodies of people, the minds of people, the honours of people, the wealth of people. As a result, the prescribed punishment is specified for people who cause corruption upon the earth in order to protect the lives, honours and wealth of the people, alongside protection of their eemaan and deen. And sometimes this prescribed punishment is meted out for shirk and kufr (entailing apostasy) - due to involvement with devils and magic which expels from Islam, or for dhulm (oppression) and fisq (sinfulness) where people are being harmed in their bodies, wealth, and minds by those who use potions and medications to harm people.    <P>
And the Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/books/article_18361.shtml>as occurs here</a>) in his tafseer of Surah al-Baqarah:    <P>
<blockquote><div class='arabic' align='right'>&#1585;&#1575;&#1576;&#1593;&#1575;&#1611;: &#1575;&#1604;&#1587;&#1575;&#1581;&#1585;&#1548; &#1575;&#1604;&#1587;&#1581;&#1585; &#1606;&#1608;&#1593;&#1575;&#1606;: &#1606;&#1608;&#1593; &#1610;&#1603;&#1601;&#1585; &#1576;&#1607; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585;&#1548; &#1608;&#1606;&#1608;&#1593; &#1604;&#1575; &#1610;&#1603;&#1601;&#1585; &#1576;&#1607;. &#1571;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1604;&#1575; &#1610;&#1603;&#1601;&#1585; &#1576;&#1607; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1601;&#1573;&#1606;&#1607; &#1610;&#1602;&#1578;&#1604; &#1581;&#1583;&#1575;&#1611;&#1548; &#1603;&#1605;&#1575; &#1580;&#1575;&#1569; &#1584;&#1604;&#1603; &#1593;&#1606; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577;&#1548; &#1603;&#1601;&#1617;&#1575;&#1611; &#1604;&#1601;&#1587;&#1575;&#1583;&#1607;&#1563; &#1604;&#1571;&#1606;&#1607; &#1605;&#1606; &#1575;&#1604;&#1587;&#1575;&#1593;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1571;&#1585;&#1590; &#1601;&#1587;&#1575;&#1583;&#1575;&#1611;&#1548; &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1576;&#1575;&#1585;&#1603; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609;: {{&#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1580;&#1618;&#1604;&#1616; &#1584;&#1614;&#1604;&#1616;&#1603;&#1614; &#1603;&#1614;&#1578;&#1614;&#1576;&#1618;&#1606;&#1614;&#1575; &#1593;&#1614;&#1604;&#1614;&#1609; &#1576;&#1614;&#1606;&#1616;&#1610; &#1573;&#1616;&#1587;&#1618;&#1585;&#1614;&#1575;&#1574;&#1616;&#1610;&#1604;&#1614; &#1571;&#1614;&#1606;&#1614;&#1617;&#1607;&#1615; &#1605;&#1614;&#1606;&#1618; &#1602;&#1614;&#1578;&#1614;&#1604;&#1614; &#1606;&#1614;&#1601;&#1618;&#1587;&#1611;&#1575; &#1576;&#1616;&#1594;&#1614;&#1610;&#1618;&#1585;&#1616; &#1606;&#1614;&#1601;&#1618;&#1587;&#1613; &#1571;&#1614;&#1608;&#1618; &#1601;&#1614;&#1587;&#1614;&#1575;&#1583;&#1613; &#1601;&#1616;&#1610; &#1575;&#1604;&#1571;&#1614;&#1585;&#1618;&#1590;&#1616; &#1601;&#1614;&#1603;&#1614;&#1571;&#1614;&#1606;&#1614;&#1617;&#1605;&#1614;&#1575; &#1602;&#1614;&#1578;&#1614;&#1604;&#1614; &#1575;&#1604;&#1606;&#1614;&#1617;&#1575;&#1587;&#1614; &#1580;&#1614;&#1605;&#1616;&#1610;&#1593;&#1611;&#1575;}} &#1608;&#1604;&#1575; &#1571;&#1581;&#1583; &#1610;&#1588;&#1603; &#1601;&#1610; &#1573;&#1601;&#1587;&#1575;&#1583; &#1575;&#1604;&#1587;&#1581;&#1585;&#1577; &#1601;&#1610; &#1575;&#1604;&#1571;&#1585;&#1590;&#1548; &#1601;&#1610;&#1602;&#1578;&#1604;&#1608;&#1606; &#1603;&#1601;&#1575;&#1611; &#1604;&#1588;&#1585;&#1607;&#1605; &#1608;&#1585;&#1583;&#1593;&#1575;&#1611; &#1604;&#1594;&#1610;&#1585;&#1607;&#1605;&#1548; &#1608;&#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1575;&#1604;&#1603;&#1575;&#1601;&#1585;: &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1587;&#1578;&#1593;&#1610;&#1606; &#1576;&#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1608;&#1605;&#1585;&#1583;&#1577; &#1575;&#1604;&#1580;&#1606; &#1593;&#1604;&#1609; &#1573;&#1610;&#1584;&#1575;&#1569; &#1593;&#1576;&#1575;&#1583; &#1575;&#1604;&#1604;&#1607;&#1548; &#1576;&#1571;&#1606; &#1610;&#1590;&#1593; &#1587;&#1581;&#1585;&#1575;&#1611; &#1610;&#1587;&#1578;&#1607;&#1608;&#1610; &#1576;&#1607; &#1575;&#1604;&#1588;&#1610;&#1591;&#1575;&#1606; &#1571;&#1608; &#1605;&#1585;&#1583;&#1577; &#1575;&#1604;&#1580;&#1606; &#1581;&#1578;&#1609; &#1610;&#1587;&#1603;&#1606;&#1608;&#1575; &#1601;&#1610; &#1580;&#1587;&#1605; &#1573;&#1606;&#1587;&#1575;&#1606;&#1548; &#1608;&#1610;&#1571;&#1576;&#1608;&#1575; &#1571;&#1606; &#1610;&#1582;&#1585;&#1580;&#1608;&#1575; &#1605;&#1606;&#1607; &#1573;&#1604;&#1575; &#1576;&#1581;&#1604; &#1575;&#1604;&#1587;&#1581;&#1585;&#1563; &#1607;&#1584;&#1575; &#1610;&#1603;&#1601;&#1585; &#1604;&#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609;: {{&#1608;&#1614;&#1575;&#1578;&#1614;&#1617;&#1576;&#1614;&#1593;&#1615;&#1608;&#1575; &#1605;&#1614;&#1575; &#1578;&#1614;&#1578;&#1618;&#1604;&#1615;&#1608;&#1575; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1615; &#1593;&#1614;&#1604;&#1614;&#1609; &#1605;&#1615;&#1604;&#1618;&#1603;&#1616; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1615; &#1608;&#1614;&#1604;&#1614;&#1603;&#1616;&#1606;&#1614;&#1617; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1614; &#1603;&#1614;&#1601;&#1614;&#1585;&#1615;&#1608;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1606;&#1614;&#1617;&#1575;&#1587;&#1614; &#1575;&#1604;&#1587;&#1616;&#1617;&#1581;&#1618;&#1585;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1618;&#1586;&#1616;&#1604;&#1614; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1614;&#1603;&#1614;&#1610;&#1618;&#1606;&#1616; &#1576;&#1616;&#1576;&#1614;&#1575;&#1576;&#1616;&#1604;&#1614; &#1607;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614;}}</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Fourthly: The magician, magic is of two types. A type by which a magician becomes a disbeliever and a type by which he does not become a disbeliever. As for the one who does not disbelieve, then he is killed as a hadd punishment (not as an apostate), as has come from some of the Companions, in order to repel his corruption, because he is from those who cause corruption upon the earth. And Allaah, the Blessed and Exalted had said, "<b>Because of that We ordained for the Children of Israel that if anyone killed a person not in retaliation of murder, or (and) to spread mischief in the land - it would be as if he killed all mankind</b>." (5:32). And no one doubts in the corruption caused by the magicians on the earth, hence, they are killed out of repelling their evil and as a deterrent for others. And the disbelieving magician is the one that seeks aid through the devils and the rebellious amongst the <a href='../tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> in harming the servants ofAllaah, in that he places magic in which he seeks recourse to the devils, or the rebellious <a href='../tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> until they reside in a person's body and refuse to come out except through the route (of another instance of) magic, so this [person] disbelieves due to the saying of the Exalted, "<b>They followed what the Shayaateen (devils) gave out (falsely of the magic) in the lifetime of <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (<a href='../tags/solomon.html' class='tagLink'><font class='tagLink'>Solomon</font></a>). <a href='../tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic and such things that came down at <a href='../tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='../tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and Marut</b>" (2:101-102)  </blockquote>    <P>
And the Shaykh (rahimahullaah) said (<a href=http://www.ibnothaimeen.com/all/books/article_18169.shtml>as occurs here</a>) in his explanation of al-Safaareeniyyah    <P>
<blockquote><div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1587;&#1581;&#1585; &#1606;&#1608;&#1593;&#1575;&#1606;: &#1587;&#1581;&#1585; &#1610;&#1603;&#1601;&#1585; &#1576;&#1607; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585; : &#1608;&#1607;&#1608; &#1575;&#1604;&#1587;&#1581;&#1585; &#1576;&#1608;&#1575;&#1587;&#1591;&#1577; &#1575;&#1604;&#1575;&#1587;&#1578;&#1593;&#1575;&#1606;&#1577; &#1576;&#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1548; &#1601;&#1607;&#1584;&#1575; &#1603;&#1601;&#1585; &#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; : (&#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1615; &#1608;&#1614;&#1604;&#1614;&#1603;&#1616;&#1606;&#1614;&#1617; &#1575;&#1604;&#1588;&#1614;&#1617;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1614; &#1603;&#1614;&#1601;&#1614;&#1585;&#1615;&#1608;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1606;&#1614;&#1617;&#1575;&#1587;&#1614; &#1575;&#1604;&#1587;&#1616;&#1617;&#1581;&#1618;&#1585;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1618;&#1586;&#1616;&#1604;&#1614; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1614;&#1603;&#1614;&#1610;&#1618;&#1606;&#1616; &#1576;&#1616;&#1576;&#1614;&#1575;&#1576;&#1616;&#1604;&#1614; &#1607;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1616;&#1617;&#1605;&#1614;&#1575;&#1606;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1581;&#1614;&#1578;&#1614;&#1617;&#1609; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1575; &#1573;&#1616;&#1606;&#1614;&#1617;&#1605;&#1614;&#1575; &#1606;&#1614;&#1581;&#1618;&#1606;&#1615; &#1601;&#1616;&#1578;&#1618;&#1606;&#1614;&#1577;&#1612; &#1601;&#1614;&#1604;&#1575; &#1578;&#1614;&#1603;&#1618;&#1601;&#1615;&#1585;&#1618; )(&#1575;&#1604;&#1576;&#1602;&#1585;&#1577;: &#1575;&#1604;&#1570;&#1610;&#1577; 102) &#1548; &#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1602;&#1578;&#1604; &#1604;&#1603;&#1601;&#1585;&#1607; &#1608;&#1605;&#1601;&#1587;&#1583;&#1578;&#1607; &#1548; &#1601;&#1573;&#1606; &#1578;&#1575;&#1576; &#1602;&#1578;&#1604; &#1604;&#1605;&#1601;&#1587;&#1583;&#1578;&#1607;. &#1608;&#1587;&#1581;&#1585; &#1604;&#1575; &#1610;&#1603;&#1601;&#1585; &#1576;&#1607; &#1575;&#1604;&#1587;&#1575;&#1581;&#1585; : &#1608;&#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1603;&#1608;&#1606; &#1576;&#1575;&#1604;&#1571;&#1583;&#1608;&#1610;&#1577; &#1548; &#1604;&#1603;&#1606; &#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1602;&#1578;&#1604; &#1583;&#1585;&#1569;&#1575;&#1611; &#1604;&#1605;&#1601;&#1587;&#1583;&#1578;&#1607;. &#1601;&#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1572;&#1604;&#1601; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;  : ( &#1608;&#1587;&#1575;&#1581;&#1585; &#1608;&#1587;&#1575;&#1581;&#1585;&#1577; ) &#1601;&#1610;&#1607; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1601;&#1589;&#1610;&#1604; &#1563; &#1601;&#1606;&#1602;&#1608;&#1604; : &#1573;&#1584;&#1575; &#1603;&#1601;&#1585; &#1576;&#1587;&#1581;&#1585;&#1607; &#1601;&#1573;&#1606;&#1607;&#1575; &#1604;&#1575; &#1578;&#1602;&#1576;&#1604; &#1578;&#1608;&#1576;&#1578;&#1607; &#1563; &#1576;&#1575;&#1593;&#1578;&#1576;&#1575;&#1585; &#1573;&#1606;&#1606;&#1575; &#1606;&#1602;&#1610;&#1605; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1583; &#1608;&#1606;&#1602;&#1578;&#1604;&#1607; &#1548; &#1608;&#1573;&#1606; &#1604;&#1605; &#1610;&#1603;&#1601;&#1585; &#1576;&#1587;&#1581;&#1585;&#1607; &#1571;&#1602;&#1605;&#1606;&#1575; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1583; &#1578;&#1591;&#1607;&#1610;&#1585;&#1575;&#1611; &#1604;&#1575; &#1603;&#1601;&#1585;&#1575;&#1611;</div></blockquote>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>And magic is of two types, magic through which a magician becomes a disbeliever and that is magic through the route of seeking aid from the devils, this one disbelieves due to the saying of Allaah, the Exalted, "<b>Sulayman did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic and such things that came down at <a href='../tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='../tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='../tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i></b>"." (2:101-102). And it is obligatory to kill this magician due to his disbelief and corruption. So if he repents, he is killed for his corruption (and not disbelief). And magic through which a magician does not become a disbeliever, and this is what occurs through potions (used to harm others), however it is necessary for him to be killed in order to repel his corruption (in harming others). So the saying of the author (rahimahullaah), "<i>And the male and female magician</i>" it has this detail to it, so we say, if he disbelieves through his magic, his repentance is not accepted with the consideration that we are establishing the prescribed punishment upon him and we kill him. And if he does not become a disbeliever through his magic, we establish the prescribed punishment upon him out of purification (of the land of his likes) but not due to disbelief.</blockquote>    <P>
<font class='titleHeadline'>Notes and Comments</font>    <P>
There are a few notes on what has preceded:    <P>
<blockquote><b>FIRST:</b> Magic is of <u>types</u> and <u>from it</u> is what involves the devils and comprises ways and means of kufr and shirk - this is kufr. <u>And from it</u> is that does not involve the devils but involves potions and medications used to harm others (either killing them or injuring them or making them sick or mad), then this is dhulm (oppression) and fisq (sinfulness) but not kufr. <u>And from it</u> is that which is deception and trickery (sleight-of-hand magic) and this is a separate category altogether. And there are other types that also enter into the linguistic meaning of magic (as opposed to legislative meaning) - see Shaykh Saalih Aal al-Shaykh <a href=../index599d.html?ktuoa>explain that here</a> - so the ruling in all cases varies, because magic has levels and types.    <P>
<b>SECOND:</b> The Shaykh has indicated that the hadd punishment is not always for magic which is kufr, rather, those who harm the people with magic involving potions and medications and the likes and who cause death or injury and harm, then they are kill out of repelling corruption and protection of people's lives, minds and properties - which are from the necessities the Shariah has come to protect - and thus the prescribed punishment for those whose magic does not reach kufr but which comprises oppression against others is from this angle.  This is an important consideration to keep in mind as some may argue that the fact that some of the Companions killed magicians is a proof that all magic (including sleight-of-hand magic involving deceptions and tricks) is kufr and apostasy. And this does not follow, and is not a valid argument in and of itself when we return to the tafseelaat (details) the scholars have elaborated upon with respect to this matter. Thus, one who embezzles money from the people, or brings harm through potions and the likes or who is a threat to the faith and beliefs of the people through his tricks and deceptions and the likes then such a one may be given the hadd punishment by the authorities from the angle of causing corruption upon the land, but it does not follow that because he has received the hadd punishment, his actions, in all cases, were kufr and apostasy.    <P>
<b>THIRD:</b> To support the above, see the explanation of Shaykh Ibn Baz on the killing by Jundub al-Azdee (radiallaahu anhu) of a magician. Ibn Baz (rahimahullaah) says in his commentary on the chapter pertaining to magic in Kitab al-Tawhid the following (Dar al-Diyaa, 1422H, p. 129):    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Some of the people, from them al-Shafi'ee said: If the magic of the magician is through known things which harm but which do not alter the minds, rather they harm and cause illness and in which there is no claim of knowledge of the unseen, and it was not from one who seeks the service of the devils and aid from them, and does not perform that which Allaah has prohibited of shirk and other than it, then he is not killed. Because this is not from magic, rather, it is from causing harm and oppression. Hence, he is merely beaten and disciplined [as opposed to being killed], <b>because the intent behind killing the magicians in the view of the Sahaabah is (to eliminate) those who employ the <a href='../tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a>, worship them and claim knowledge of the unseen, since this is what is found overwhelmingly amongst the magicians, so such a one is killed, and this is what is correct</b>.</blockquote>    <P>
<b>FOUR:</b> In light of the above, caution needs to be taken in understanding the details (tafseelaat) in the types of magic and likewise the interpretations of the actions of the Sahaabah, and it is important to gather the statements of all of the people of knowledge in order to get a sound picture and comprehension of issues.  </blockquote> <P>

</div>
<br>


<hr size="1" noshade color="#cdcdcd">




<span class="smallHeadline">Link to this article:</span>&nbsp;&nbsp;&nbsp;<b>Show:</b>
<a href="javascript:void();" onclick="document.frm.thelink.value='<a href=\'czuhb-shaykh-muhammad-bin-salih-al-uthaymeen-clarification-on-issues-pertaining-to-magic-sihr.html\'>Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment</a>'">HTML Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='https://www.dajjaal.com/liar/articles/czuhb-shaykh-muhammad-bin-salih-al-uthaymeen-clarification-on-issues-pertaining-to-magic-sihr.cfm'">Full Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='https://www.dajjaal.com/liar/?czuhb'">Short Link</a>
<BR>
<form name="frm"><input name="thelink" type="text" style="width:100%;max-width:450px;" value="<a href='czuhb-shaykh-muhammad-bin-salih-al-uthaymeen-clarification-on-issues-pertaining-to-magic-sihr.html'>Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment</a>" onFocus="this.select()" onClick="this.select()"></form>



<span class="smallHeadline">Related Articles:</span><BR>

<font class="smallHeadline">Add a Comment</font> (comments are currently moderated)
<br>






You must be registered and logged in to comment.



				
				<br>
				<br>
				<br>
			</div>
			<div class="px-3 pt-3 pt-lg-0 ps-lg-0 pe-lg-3 w-full lg:w-5/12 d-flex">
				<div class="d-none d-lg-block" style="height:100%;border-right:1px solid #dedede;margin-right:4px;"></div>
				<div>

<div>
    <a href="xsxpr-the-role-of-television-in-social-engineering-predictive-programming-and-destruction-of-children-and-society.html"><img src="../assets/images/tv-corruption.gif" width="100%" border="0" alt=""></a>
    <img src="../images/spacer.gif" width="100" height="8">
    
    
    <a href="feicu-prophet-solomon-the-devils-shayaateen-magic-the-angels-harut-and-marut-and-baabil-babylon.html"><img src="../assets/images/sulayman-magic-babylon.gif" width="100%" border="0" alt=""></a>
    <img src="../images/spacer.gif" width="100" height="8">
</div>




<div>

    



    <table cellpadding="3">
    
    </table>

</div>



<div class="d-flex flex-column flex-sm-row pt-2">
    <div class="w-full sm:w-1/2 sm:pe-2">
      




<table width="100%" bgcolor="#ffffff">
<tr><td colspan="2"><span class="smallHeadline">Latest Articles</span></td></tr>
<tr>
<td><a href="lixgt-bayan-talbis-al-dajaaijlah-why-and-how-hijab-and-co-conspirators-slander-people-of-the-sunnah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Bayan Talbis al-Dajaajilah: How and Why Hijab and Co-Conspirators Malign and Slander People of the Sunnah While Defending and Lauding the People of Innovation and Misguidance</font></a>
</td>
</tr><tr>
<td><a href="oykkt-shaykh-al-islam-ibn-taymiyyah-distinction-between-illusionary-tricks-involving-deception-and-those-involving-the-devils---part-2.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh al-Islam Ibn Taymiyyah: Distinction Between Illusionary Tricks Involving Deception And Those Involving the Devils - Part 2</font></a>
</td>
</tr><tr>
<td><a href="zktic-shaykh-al-islam-ibn-taymiyyah-distinction-between--illusionary-tricks-involving-deception-and-those-involving-the-devils.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh al-Islam Ibn Taymiyyah: Distinction Between  Illusionary Tricks Involving Deception And Those Involving the Devils - Part 1</font></a>
</td>
</tr><tr>
<td><a href="czuhb-shaykh-muhammad-bin-salih-al-uthaymeen-clarification-on-issues-pertaining-to-magic-sihr.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Muhammad bin Salih al-Uthaymeen: Clarification on Issues Pertaining to Magic (Sihr) and Explanation of the Intent Behind the Prescribed Punishment</font></a>
</td>
</tr><tr>
<td><a href="bvcox-a-refutation-of-kamal-al-mekkis-attempt-to-distinguish-between-magic-and-sorcery.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Refutation of The Attempt of Kamal al-Mekki of al-Maghrib Institute to Distinguish Between The Meaning Entering Into the Term  'Magic' and and the Meaning of the Term 'Sorcery'</font></a>
</td>
</tr><tr>
<td><a href="zjscm-shaykh-ibn-baz-on-magic-being-major-kufr-the-types-of-this-magic-and-an-explanation-of-the-magic-known-as-taqmeer.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Ibn Baz on Magic Being Major Kufr, the Types of This Magic and an Explanation of the Magic Known as Taqmeer and Removal of a Misconception</font></a>
</td>
</tr><tr>
<td><a href="suquy-shaykh-ibn-al-uthaymeen-sikhr-takhyeeliyy-illusionary-magic-is-true-and-real-and-has-an-actual-effect.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Ibn al-Uthaymeen: Sikhr Takhyeeliyy (Illusionary Magic) is True and Real and Has an Actual Effect</font></a>
</td>
</tr><tr>
<td><a href="ltnra-shaykh-abdul-azeez-al-raajihee-on-the-types-of-magic.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Abdul-Azeez al-Raajihee on the Types of Magic  and Consensus Amongst the Scholars About the Magic Which Expels from Islaam</font></a>
</td>
</tr><tr>
<td><a href="ktuoa-shaykh-saalih-aal-al-shaykh-on-the-classification-of-magic-into-types.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Saalih Aal al-Shaykh on the Classification of Magic into Types That Vary in Definition, Reality and Ruling</font></a>
</td>
</tr><tr>
<td><a href="wivmi-shaykh-al-sadee-magic-enters-into-shirk-from-two-angles.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh al-Sa'dee: Magic Enters Into Shirk From Two Angles</font></a>
</td>
</tr>
<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>







 
      
    </div>
    <div class="w-full sm:w-1/2 sm:border-start sm:ps-2 d-flex">
        <div class="d-none d-sm-block" style="height:100%;width:0;border-right:1px solid #dedede;margin-right:8px;margin-left:8px;"></div>
        <div>

<table align="center" width="100%">
<tr><td><span class="smallHeadline">Search This Site</span></td></tr>
<form action="https://www.dajjaal.com/liar/search.cfm" method="post"><tr>
<td><input type="text" name="q" size="25" style="background:#ffffff;width:100%;" value="Enter phrase and hit enter" onfocus="this.value='';"></td>
</tr>
</form>
</table>





<br>





<table width="100%" bgcolor="#ffffff" style="border-bottom:1px dashed #99ccff;">
<tr><td colspan="2"><span class="smallHeadline">Most Popular</span></td></tr>

<tr>

<td>
<a href="feicu-prophet-solomon-the-devils-shayaateen-magic-the-angels-harut-and-marut-and-baabil-babylon.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Prophet Solomon, the Devils (Shayaateen), Magic, the Angels Harut and Marut and Baabil (Babylon)</b></font></a>
</td>
</tr><tr>

<td>
<a href="gzinc-islamic-ruqyah-for-warding-off-the-devils-and-the-magic-of-the-magicians-from-the-quran.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Islamic Ruqyah For Warding Off the Devils and the Magic of the Magicians From the Qur'an</b></font></a>
</td>
</tr><tr>

<td>
<a href="xsxpr-the-role-of-television-in-social-engineering-predictive-programming-and-destruction-of-children-and-society.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Role of Television in Social Engineering, Predictive Programming, Culture Creation and Destruction of Children and Society</b></font></a>
</td>
</tr><tr>

<td>
<a href="lnhnu-some-of-the-signs-of-magicians-sorcerers-and-how-to-identify-them.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Some of the Signs of Magicians, Sorcerers and How To Identify Them</b></font></a>
</td>
</tr><tr>

<td>
<a href="gvokb-the-dajjaal-anti-christ-will-appear-after-70000-from-bani-ishaq-conquer-constantinople.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Dajjaal (Anti-Christ) Will Appear After 70,000 From Bani Ishaq (Children of Isaac) Conquer Constantinople</b></font></a>
</td>
</tr><tr>

<td>
<a href="bgxjt-the-whispering-of-iblis-satan-to-adam-with-four-matters.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Whispering of Iblis (Satan) To Adam With Four Matters</b></font></a>
</td>
</tr><tr>

<td>
<a href="qovvu-what-a-man-or-woman-must-do-to-become-a-magician-saahir.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>What a Man or Woman Must Do To Become a Magician (Saahir)</b></font></a>
</td>
</tr><tr>

<td>
<a href="mrayz-shaykh-abdur-rahman-al-barraak-on-the-types-of-magic-and-their-ruling.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>On The Various Types Of Magic, Why it Enters Into Shirk, and a Warning Against Kamal al-Mekki's Enticement of Muslims to Watch The Tricks of The Magicians</b></font></a>
</td>
</tr><tr>

<td>
<a href="hokgj-shaykh-salih-al-fawzan-appearance-of-the-dajjaal-is-near.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Shaykh Salih al-Fawzan: Appearance of the Dajjaal Is Near</b></font></a>
</td>
</tr><tr>

<td>
<a href="zktic-shaykh-al-islam-ibn-taymiyyah-distinction-between--illusionary-tricks-involving-deception-and-those-involving-the-devils.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Shaykh al-Islam Ibn Taymiyyah: Distinction Between  Illusionary Tricks Involving Deception And Those Involving the Devils - Part 1</b></font></a>
</td>
</tr>

<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>




<br>





<table width="100%" bgcolor="#ffffff" style="border-bottom:1px dashed #99ccff;">
<tr><td colspan="2"><span class="smallHeadline">Tags</span></td></tr>

<tr>
<td>

<span class="tagspan_yellow"><a href="../tags/adam.html">adam</a></span>

<span class="tagspan_yellow"><a href="../tags/al-jibt.html">al-jibt</a></span>

<span class="tagspan_yellow"><a href="../tags/al-maghrib.html">al-maghrib</a></span>

<span class="tagspan_yellow"><a href="../tags/al-maghrib-institute.html">al-maghrib institute</a></span>

<span class="tagspan_yellow"><a href="../tags/anti-christ.html">anti-christ</a></span>

<span class="tagspan_yellow"><a href="../tags/at-taghut.html">at-taghut</a></span>

<span class="tagspan_yellow"><a href="../tags/baabil.html">baabil</a></span>

<span class="tagspan_yellow"><a href="../tags/babylon.html">babylon</a></span>

<span class="tagspan_yellow"><a href="../tags/bani-ishaq.html">bani ishaq</a></span>

<span class="tagspan_yellow"><a href="../tags/capitalism.html">capitalism</a></span>

<span class="tagspan_yellow"><a href="../tags/communism.html">communism</a></span>

<span class="tagspan_yellow"><a href="../tags/constantinople.html">constantinople</a></span>

<span class="tagspan_yellow"><a href="../tags/dajjaal.html">dajjaal</a></span>

<span class="tagspan_yellow"><a href="../tags/eve.html">eve</a></span>

<span class="tagspan_yellow"><a href="../tags/frankists.html">frankists</a></span>

<span class="tagspan_yellow"><a href="../tags/freemasonry.html">freemasonry</a></span>

<span class="tagspan_yellow"><a href="../tags/freemasons.html">freemasons</a></span>

<span class="tagspan_yellow"><a href="../tags/garden-of-eden.html">garden of eden</a></span>

<span class="tagspan_yellow"><a href="../tags/globalism.html">globalism</a></span>

<span class="tagspan_yellow"><a href="../tags/green-lane--mosque.html">green lane  mosque</a></span>

<span class="tagspan_yellow"><a href="../tags/harut.html">harut</a></span>

<span class="tagspan_yellow"><a href="../tags/iblees.html">iblees</a></span>

<span class="tagspan_yellow"><a href="../tags/iblis.html">iblis</a></span>

<span class="tagspan_yellow"><a href="../tags/illuminati.html">illuminati</a></span>

<span class="tagspan_yellow"><a href="../tags/incantation.html">incantation</a></span>

<span class="tagspan_yellow"><a href="../tags/islamic-ruling-on-magic.html">islamic ruling on magic</a></span>

<span class="tagspan_yellow"><a href="../tags/jinn.html">jinn</a></span>

<span class="tagspan_yellow"><a href="../tags/kamal-al-mekki.html">kamal al-mekki</a></span>

<span class="tagspan_yellow"><a href="../tags/marut.html">marut</a></span>

<span class="tagspan_yellow"><a href="../tags/mohammad-hijab.html">mohammad hijab</a></span>

<span class="tagspan_yellow"><a href="../tags/mystery-babylon.html">mystery babylon</a></span>

<span class="tagspan_yellow"><a href="../tags/new-age-spirituality.html">new age spirituality</a></span>

<span class="tagspan_yellow"><a href="../tags/paradise.html">paradise</a></span>

<span class="tagspan_yellow"><a href="../tags/qabbalah.html">qabbalah</a></span>

<span class="tagspan_yellow"><a href="../tags/qadianis.html">qadianis</a></span>

<span class="tagspan_yellow"><a href="../tags/rafidah.html">rafidah</a></span>

<span class="tagspan_yellow"><a href="../tags/rafidi-shiah.html">rafidi shi'ah</a></span>

<span class="tagspan_yellow"><a href="../tags/romans.html">romans</a></span>

<span class="tagspan_yellow"><a href="../tags/ruqyah.html">ruqyah</a></span>

<span class="tagspan_yellow"><a href="../tags/sabbateans.html">sabbateans</a></span>

<span class="tagspan_yellow"><a href="../tags/satan.html">satan</a></span>

<span class="tagspan_yellow"><a href="../tags/socialism.html">socialism</a></span>

<span class="tagspan_yellow"><a href="../tags/solomon.html">solomon</a></span>

<span class="tagspan_yellow"><a href="../tags/soofiyyah.html">soofiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/sufis.html">sufis</a></span>

<span class="tagspan_yellow"><a href="../tags/sufiyyah.html">sufiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/sulayman.html">sulayman</a></span>

<span class="tagspan_yellow"><a href="../tags/temple-of-solomon.html">temple of solomon</a></span>

<span class="tagspan_yellow"><a href="../tags/zionists.html">zionists</a></span>

</td>
</tr>
<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>



<br>










<table width="100%" bgcolor="#ffffff" style="border-bottom:1px dashed #99ccff;">
<tr><td colspan="2"><span class="smallHeadline">Archives</span></td></tr>
<tr>

<td>

<a href="../archives/2025/08.html">August 2025</a><BR>


<a href="../archives/2025/07.html">July 2025</a><BR>


<a href="../archives/2025/06.html">June 2025</a><BR>


<a href="../archives/2025/05.html">May 2025</a><BR>


<a href="../archives/2025/04.html">April 2025</a><BR>


<a href="../archives/2025/03.html">March 2025</a><BR>


<a href="../archives/2025/02.html">February 2025</a><BR>


<a href="../archives/2025/01.html">January 2025</a><BR>


<a href="../archives/2024/12.html">December 2024</a><BR>


<a href="../archives/2024/11.html">November 2024</a><BR>


<a href="../archives/2024/10.html">October 2024</a><BR>


<a href="../archives/2024/09.html">September 2024</a><BR>


<a href="../archives/2024/08.html">August 2024</a><BR>


<a href="../archives/2024/07.html">July 2024</a><BR>


<a href="../archives/2024/06.html">June 2024</a><BR>


<a href="../archives/2024/05.html">May 2024</a><BR>


<a href="../archives/2024/04.html">April 2024</a><BR>


<a href="../archives/2024/03.html">March 2024</a><BR>


<a href="../archives/2024/02.html">February 2024</a><BR>


<a href="../archives/2024/01.html">January 2024</a><BR>


<a href="../archives/2023/12.html">December 2023</a><BR>


<a href="../archives/2023/11.html">November 2023</a><BR>


<a href="../archives/2023/10.html">October 2023</a><BR>


<a href="../archives/2023/09.html">September 2023</a><BR>


<a href="../archives/2023/08.html">August 2023</a><BR>


<a href="../archives/2023/07.html">July 2023</a><BR>


<a href="../archives/2023/06.html">June 2023</a><BR>


<a href="../archives/2023/05.html">May 2023</a><BR>


<a href="../archives/2023/04.html">April 2023</a><BR>


<a href="../archives/2023/03.html">March 2023</a><BR>


<a href="../archives/2023/02.html">February 2023</a><BR>


<a href="../archives/2023/01.html">January 2023</a><BR>


<a href="../archives/2022/12.html">December 2022</a><BR>


<a href="../archives/2022/11.html">November 2022</a><BR>


<a href="../archives/2022/10.html">October 2022</a><BR>


<a href="../archives/2022/09.html">September 2022</a><BR>


<a href="../archives/2022/08.html">August 2022</a><BR>


<a href="../archives/2022/07.html">July 2022</a><BR>


<a href="../archives/2022/06.html">June 2022</a><BR>


<a href="../archives/2022/05.html">May 2022</a><BR>


<a href="../archives/2022/04.html">April 2022</a><BR>


<a href="../archives/2022/03.html">March 2022</a><BR>


<a href="../archives/2022/02.html">February 2022</a><BR>


<a href="../archives/2022/01.html">January 2022</a><BR>


<a href="../archives/2021/12.html">December 2021</a><BR>


<a href="../archives/2021/11.html">November 2021</a><BR>


<a href="../archives/2021/10.html">October 2021</a><BR>


<a href="../archives/2021/09.html">September 2021</a><BR>


<a href="../archives/2021/08.html">August 2021</a><BR>


<a href="../archives/2021/07.html">July 2021</a><BR>


<a href="../archives/2021/06.html">June 2021</a><BR>


<a href="../archives/2021/05.html">May 2021</a><BR>


<a href="../archives/2021/04.html">April 2021</a><BR>


<a href="../archives/2021/03.html">March 2021</a><BR>


<a href="../archives/2021/02.html">February 2021</a><BR>


<a href="../archives/2021/01.html">January 2021</a><BR>


<a href="../archives/2020/12.html">December 2020</a><BR>


<a href="../archives/2020/11.html">November 2020</a><BR>


<a href="../archives/2020/10.html">October 2020</a><BR>


<a href="../archives/2020/09.html">September 2020</a><BR>


<a href="../archives/2020/08.html">August 2020</a><BR>


<a href="../archives/2020/07.html">July 2020</a><BR>


<a href="../archives/2020/06/index.html">June 2020</a><BR>


<a href="../archives/2020/05.html">May 2020</a><BR>


<a href="../archives/2020/04.html">April 2020</a><BR>


<a href="../archives/2020/03.html">March 2020</a><BR>


<a href="../archives/2020/02.html">February 2020</a><BR>


<a href="../archives/2020/01.html">January 2020</a><BR>


<a href="../archives/2019/12.html">December 2019</a><BR>


<a href="../archives/2019/11.html">November 2019</a><BR>


<a href="../archives/2019/10.html">October 2019</a><BR>


<a href="../archives/2019/09.html">September 2019</a><BR>


<a href="../archives/2019/08.html">August 2019</a><BR>


<a href="../archives/2019/07.html">July 2019</a><BR>


<a href="../archives/2019/06.html">June 2019</a><BR>


<a href="../archives/2019/05.html">May 2019</a><BR>


<a href="../archives/2019/04.html">April 2019</a><BR>


<a href="../archives/2019/03.html">March 2019</a><BR>


<a href="../archives/2019/02.html">February 2019</a><BR>


<a href="../archives/2019/01.html">January 2019</a><BR>


<a href="../archives/2018/12.html">December 2018</a><BR>


<a href="../archives/2018/11.html">November 2018</a><BR>


<a href="../archives/2018/10.html">October 2018</a><BR>


<a href="../archives/2018/09.html">September 2018</a><BR>


<a href="../archives/2018/08.html">August 2018</a><BR>


<a href="../archives/2018/07.html">July 2018</a><BR>


<a href="../archives/2018/06.html">June 2018</a><BR>


<a href="../archives/2018/05.html">May 2018</a><BR>


<a href="../archives/2018/04.html">April 2018</a><BR>


<a href="../archives/2018/03.html">March 2018</a><BR>


<a href="../archives/2018/02.html">February 2018</a><BR>


<a href="../archives/2018/01.html">January 2018</a><BR>


<a href="../archives/2017/12.html">December 2017</a><BR>


<a href="../archives/2017/11.html">November 2017</a><BR>


<a href="../archives/2017/10.html">October 2017</a><BR>


<a href="../archives/2017/09.html">September 2017</a><BR>


<a href="../archives/2017/08.html">August 2017</a><BR>


<a href="../archives/2017/07.html">July 2017</a><BR>


<a href="../archives/2017/06.html">June 2017</a><BR>


<a href="../archives/2017/05.html">May 2017</a><BR>


</td>
</tr>
<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>



<br>






</div>
    </div>
</div>


</div>
			</div>
		</div>
		

		<div>
			
    <div style="background-color:#FFFFFF;padding-top:16px;">
        <div style="background-color:#901732;">

            <br>
            
                <div class="textsmall" style="color:#ffffff;" align="center">&copy; Dajjaal.Com. All Rights Reserved.<BR>
The Dajjaal (Anti-Christ) is the One-Eyed Liar<BR>
Sorcerers, Magicians are the Worshipers of the Devils
</div>
            
            <div style="font-size:12px;padding-left:5px;" align="center"><a href="http://www.learnarabic.com/register.cfm" target="_top"> Start an Online Arabic Course</a> </div>
            <br>
        </div>
        <div style="background-color:#000000;height:4px;width:100%;"></div>
    </div>
    <br>
    <br>
    <br>

		</div>

	</div>


</body>


<!-- Mirrored from www.dajjaal.com/liar/articles/czuhb-shaykh-muhammad-bin-salih-al-uthaymeen-clarification-on-issues-pertaining-to-magic-sihr.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:10:55 GMT -->
</html>
