{"id":1012,"date":"2014-03-12T23:05:45","date_gmt":"2014-03-12T23:05:45","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1012"},"modified":"2014-03-12T23:05:45","modified_gmt":"2014-03-12T23:05:45","slug":"response-to-bukhari-is-mudalis-dhabi-says-yes","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/03\/12\/response-to-bukhari-is-mudalis-dhabi-says-yes\/","title":{"rendered":"Response to: Bukhari is Mudalis? Dhabi says: Yes."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1012\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to SlaveOfAhlubait’s article entitled: “Bukhari is Mudalis? Dhabi says: Yes.” The article can be found <a href=\"http:\/\/ahlubait.wordpress.com\/2011\/02\/03\/bukhari-is-mudalis-dhabi-says-yes\/\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">When scholars of hadith refer to a narrator as a Mudallis they usually refer to one of many things. The action of Tadlees comes in many forms. The most common, is to narrate from your Shaykh that which you did not hear from him. This is referred to Tadlees al-Isnad. In this case, the first student narrated from the second student from their Shaykh, instead of narrating from the Shaykh directly. This is usually an issue since the first student didn’t mention the name of the second for a purpose. In many cases, it is because the second student is weak. It is important to be aware that this isn’t an explicit lie since the first student never says, “I heard my Shaykh,” but rather says, “My Shaykh said.” If he were to say the former, then he would be a liar, and not simply a Mudallis.<\/p>\n<p style=\"text-align: justify;\">\nAnother type of Tadlees, which is less common, is the mentioning of the name of one’s Shaykh but by using a name that he is less known for. This is referred to as Tadlees al-shuyookh, and this is the topic of SoA’s article.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Section 1: Tadlees of the Name of Al-Dhuhli:<\/strong><\/p>\n<p style=\"text-align: justify;\">SoA firstly quotes Al-Dhahabi, then comments:<\/p>\n<p style=\"text-align: justify;\">Dhabi further says in His Sair Aalam Nabala<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">ومحمد بن إسماعيل البخاري ، ويُدلِّسُهُ كثيراً !!! ، لا يقول : محمد بن يحيى !! بل يقول محمد فقط !! أو محمد بن خالد !! أو محمد بن عبدالله ، يَنسبهُ إلى الجدّ ، ويُعَمِّي اسمه ، لمكانِ الواقع بينهما !!! غفر الله لهم<\/span><br \/>\n<span style=\"color: #800000;\">……… And Mohammad bin Ismail Bukhari (narrated from him); but he did a lot of Tadless ; He did not say Mohammad bin Yahya; He would rather say Mohammad only, or Mohammad bin Khalid, or Mohammad bin Abdullah; relating him to his grand grand father; and Hiding his name; where as reality could be between them; May Allah forgive them<\/span><br \/>\n<span style=\"color: #800000;\">[Sair Alam Nabala, vol 12, page 275, under the heading Zuhli which he started on page 273]<\/span><br \/>\n<span style=\"color: #800000;\">Let me explain this so that it becomes easy for Brothers who are reading this<\/span><br \/>\n<span style=\"color: #800000;\">The narrator he is talking about<\/span><br \/>\n<span style=\"color: #800000;\">His full name is<\/span><br \/>\n<span style=\"color: #800000;\">Mohammad bin Yahya bin Abdullah bin Khalid bin Faris Zuhli <\/span><br \/>\n<span style=\"color: #800000;\">So, Bukhari wont say : Mohammad bin Yahya<\/span><br \/>\n<span style=\"color: #800000;\">Rather, He would say Mohammad bin Khalid<\/span><br \/>\n<span style=\"color: #800000;\">I hope this eases what Dhabi said<\/span><\/p>\n<p style=\"text-align: justify;\">It should be noted that the correct translation of one of the statements of Al-Dhahabi was “due to what happened between them” and not “where as reality could be between them” which makes absolutely no sense. Sadly our opponent is equally weak in both Arabic and English, may Allah help us understand him so we can help him.<\/p>\n<p style=\"text-align: justify;\">Moreover, as we can see from the picture that Al-Dhahabi has drawn, that Al-Bukhari is accused of the second form of Tadlees and not the first.<br \/>\nHowever, even though this is technically a form of Tadlees, it does not cause any damage to Al-Bukhari. To prove this we return to the mother of the books of hadith methodology. Ibn Al-Salaah says (p.46):<br \/>\n“Tadlees al-shuyukh is to narrate from a Shaykh a hadith by naming him or mentioning him by that what he is not known by, for the purpose of him not being known.”<br \/>\nIbn Al-Salaah ends by mentioning that this form is not as bad as the known form of Tadlees, since there are a multiple of reasons as to why one would not mention the name of his Shaykh in a known form. The reasons that Ibn Al-Salaah includes are: The weakness of the Shaykh, the lateness of the death of the Shaykh, the Shaykh being younger than the narrator, and the changing of names so that the original narrator seems to have more than one Shaykh.<br \/>\nAs we can see, Al-Bukhari’s reasons do not fit any of the above reasons. It is simply because he could not bring himself to naming his Shaykh in full due to personal reasons. As we know, Al-Bukhari often quoted narrations from Al-Dhuhli in his Saheeh, some count a total of over thirty times (see Al-Tahtheeb), attesting to the credibility of the latter.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Section 2: Tadlees of the Name of Abdullah bin Salih:<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Dhabi says in Meezan-ul-Atadal<\/span><br \/>\n<span style=\"color: #800000;\">وقد روى عنه البخاري في الصحيح، على الصحيح، ولكنه يدلسه، يقول: حدثنا عبد الله ولا ينسبه، وهو هو<\/span><br \/>\n<span style=\"color: #800000;\">No doubt, Bukhari narrated from Him in His Sahih; but HE DID TADLEES; and He said: Narrated to me Abdullah and did not mention His Parentage so and so<\/span><\/p>\n<p style=\"text-align: justify;\">By returning to the introduction of Al-Fath by Ibn Hajar, we find that there is a difference of opinion as to whether the Abdullah in these narrations is Ibn Salih or another Abdullah. We find two instances in which Abdullah is mentioned without a last name. In the first case, we find that the scholars have provided three names, Abdullah bin Yusuf, Abdullah bin Raja’a, and Abdullah bin Salih. In the second instance, we find that it is either Abdullah bin Maslama or Abdullah bin Salih.<\/p>\n<p style=\"text-align: justify;\">\nIf we hold the opinion that the true narrator is one of the other narrators, who all happen to be trustworthy, then this has nothing to do with Tadlees.<\/p>\n<p style=\"text-align: justify;\">\nHowever, if we held the opinion of Al-Dhahabi, that this is indeed Abdullah bin Salih, then we would have to wonder ourselves why Al-Dhahabi didn’t include Al-Bukhari in Mizan Al-I’itidal (a book of weak narrators) under his own chapter? No, it is not because Al-Bukhari is a major scholar. There have been bigger scholars like Al-A’amash and Abu Ishaaq Al-Sabee’ee who have received their own section. The correct answer is because this rare scenario is not sufficient for one to be grouped with the “Mudalliseen”.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar himself when classifying those that were accused of Tadlees in his book Ta’reef Al-Taqdees, included Al-Bukhari in a section called: “Those that have not been Accused of Tadlees except Rarely”. He furthermore holds the opinion that those that are included in this section are to be accepted on all accounts, since it is so very rare that they have been accused of such a thing. Ibn Hajar (p. 43) goes on to defend Al-Bukhari against all these accusations nevertheless.<\/p>\n<p style=\"text-align: justify;\">\nOf course, we remind readers that this is only if we assume that Abdullah is actually Abdullah bin Salih, and this specific case has caused a difference of opinion among Hadith scholars, since several have held the view that it is not him in the first place.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to SlaveOfAhlubait’s article entitled: “Bukhari is Mudalis? Dhabi says: Yes.” The article can be found here. When scholars of hadith refer to a narrator as a Mudallis they usually refer to one of many things. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/03\/12\/response-to-bukhari-is-mudalis-dhabi-says-yes\/\" title=\"Response to: Bukhari is Mudalis? Dhabi says: Yes.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-1012","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1012","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1012"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1012\/revisions"}],"predecessor-version":[{"id":1017,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1012\/revisions\/1017"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1012"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1012"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1012"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}