{"id":1053,"date":"2014-03-14T00:20:40","date_gmt":"2014-03-14T00:20:40","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1053"},"modified":"2018-10-30T14:38:46","modified_gmt":"2018-10-30T14:38:46","slug":"issues-of-ghaybah-part-6","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/03\/14\/issues-of-ghaybah-part-6\/","title":{"rendered":"Issues of Ghaybah [Part-6] &#8211; Imams and their ridiculous knowledge"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1053\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and our prophet,<\/p>\n<div style=\"text-align: justify;\">\n<div>\n<p>This dear readers is the sixth part of our blessed series concerning the infinite problems which generate from the theory of divine leadership and the last hidden leader.<\/p>\n<p>It is often that Shia will tell you that the Imams only narrate from their fathers and that their knowledge comes from their fathers and that they are taught this knowledge by their parents, as if it is a natural process with no Ghuluw(extremism) whatsoever, but when faced with the narrations about Imams who die and leave their children at a very young age, something which happened more than once, then they stutter and hesitate, how can they explain this? So they&#8217;ll usually try to come up with excuses on the spot.<\/p>\n<p>The reason they do this is of course firstly to try and rationalize their own beliefs, it is a type of Taqiyyah, as why would anyone wish to convert to a religion that makes no sense?<\/p>\n<p>The Mahdi of the Shia was born just before the death of his father according to some Shia sects or some time after the death of his father according to others, the small baby was taken and hidden in the cellar away from the eyes of the people. In both versions of this fairy-tale the previous Imam al-`Askari had absolutely no time at all to teach this baby all of the knowledge of his fathers before him.<\/p>\n<p>Regardless of their excuses, those who are knowledgeable about the Madhab know for a fact that the Imams don&#8217;t only narrate from their fathers, and that they make their own Fatwas and religious rulings, and that they address new matters that are unheard of in their fathers days and give an infallible ruling, this is because the Imams do not learn from their fathers as some gullible layShia wish to believe, they can communicate with angels and do receive inspiration and new revelation.<\/p>\n<p>The famous Shia website &#8220;al-Islam&#8221; have uploaded a book called &#8220;Imamate and Leadership&#8221; by Sayyid Mujtaba Musavi Lari the son of Ayatullah Sayyid Ali Asghar Lari. In this book they inform us that all Imams share the exact same knowledge, which is the knowledge of the Prophet (saw):<\/p>\n<\/div>\n<div><\/div>\n<blockquote>\n<div>[There are authoritative texts to the effect that whatever was taught to the previous prophets was also known to the Prophet, peace and blessings be upon him and his family, and to the Imams, peace be upon them. Thus Imam al-Baqir, peace be upon him, said: &#8220;God has two kinds of knowledge, particular and general. The prophets have no access to the former, nor can the cherubim become aware of it. It is the latter to which the prophets and the cherubim have access, and God&#8217;s Messenger has transmitted it to us.&#8221;]<\/div>\n<\/blockquote>\n<div><\/div>\n<div>Then in the same book they narrate this lovely story:<\/div>\n<blockquote><p>[A Christian scholar by the name of Burayd once went to see Imam al-Sadiq, peace be upon him, in the company of Hisham b. Hakam. In the way they encountered Imam Musa b. Ja&#8217;far, peace be upon him, who asked Burayd how thoroughly he was acquainted with his own scripture. Burayd answered that there was none who could equal him in his knowledge of the Gospels. The Imam then asked him whether he relied on himself for the interpretation of the scriptures, and he replied that he had full confidence in his own understanding and knowledge.Thereupon Imam Musa al-Kazim, peace be upon him, began reciting the Gospels. Burayd was astonished and profoundly affected. He said: &#8220;For fifty years I have been searching for one such as you.&#8221; Then he embraced Islam, as did the woman who was accompanying him.]<\/p><\/blockquote>\n<div>He also writes:<\/div>\n<div><\/div>\n<div>\n<blockquote><p>[al-Nawfali says: &#8220;After Imam ar-Ridha’, peace be upon him, arrived, al-Ma&#8217;mun, the Abbasid caliph, gave that invitations to go out to various religious leaders to attend a meeting: the head of the Christian bishops, the leading Jewish rabbi, the leading starworshippers, people that followed no religious law whatsoever, the Zoroastrian judge, a Greek physician, and Muslim theologians all well versed in dogmatics. al-Ma&#8217;mun then sent a message to the Imam inviting him to participate in discussions with these religious leaders (until he said)  The Imam said: &#8220;Would you like to know when the caliph will repent of his initiative?&#8221; &#8211; &#8220;Yes.&#8221;&#8221;When I argue against the followers of the Torah by citing the Torah, against the followers of the Gospels by citing the Gospels, against the followers of the Psalms by citing the Psalms, against the Sabeans in their own Hebraic tongue, against the Zoroastrian priests in their own Persian tongue, against the Greeks in their own Greek tongue, and against the theologians in their own Arabic tongue; when I defeat all of them with my proofs and arguments so that they abandon their religions and accept the truth of what I say]<\/p><\/blockquote>\n<\/div>\n<div>\n<p>I ask, if all of the Imams have equal knowledge and each one teaches the next one what he learned from his fathers, than how can a young baby like the Mahdi or any of the previous Imams whose fathers died at a very young age, how can they learn all the knowledge of Islam in addition to all the gospels of the Christians and scriptures of the Jews and all the languages of the world and so on?<\/p>\n<p>Matter of the fact is that this sect has ridiculous beliefs, what we read in their books is inexcusable, no excuse can be made for it. They will act in Taqiyyah and claim that &#8220;Allah blessed the Imams with knowledge at young age just like he blesses many humans in their ability to memorize.&#8221; I say: This is not a blessing! This is way beyond a blessing.<\/p>\n<p>In al-Kafi we read concerning their knowledge:<\/p>\n<p>محمد بن يحيى، عن أحمد بن محمد، عن الحسين بن سعيد، عن النضر بن سويد عن يحيى الحلبي، عن ذريح المحاربي قال: قال لي أبوعبدالله (عليه السلام): لو لا أنا نزداد لانفدنا<\/p>\n<p>[Muhammad bin Yahya from Ahmad bin Muhammad from al-Husayn bin Said from an-Nadhr bin Suwayd from Yahya al-Halabiy from Dharih al-Muharabiy who said: Abu Abdillah said to me: if it werent that we are increased (in knowledge i.e. by receiving new communication) we would have ran out (exhausted our answers).]<\/p>\n<p>Al-Kafi by Kulayni,Vol 1,Pg 254,H 2<br \/>\nMajlisi:&#8221;Saheeh&#8221; (Mirat ul Uqool 3\/107)<\/p>\n<p>Also narrated by an additional chain on the same page:<\/p>\n<p>مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ صَفْوَانَ عَنْ أَبِي الْحَسَنِ مِثْلَهُ<\/p>\n<p>[Muhammad bin Yahya from Ahmad bin Muhammad from Muhammad bin Khalid from Safwan from abu al-Hasan (as) like it]<\/p>\n<p>Majlisi:&#8221;Saheeh&#8221; (Mirat ul Uqool 3\/104)<\/p>\n<p>Also Zurarah asks the Imam about this in the following narration:<\/p>\n<p>مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ ثَعْلَبَةَ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ لَوْ لَا أَنَّا نَزْدَادُ لَأَنْفَدْنَا قَالَ قُلْتُ تَزْدَادُونَ شَيْئاً لَا يَعْلَمُهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ أَمَا إِنَّهُ إِذَا كَانَ ذَلِكَ عُرِضَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ عَلَى الْأَئِمَّةِ ثُمَّ انْتَهَى الْأَمْرُ إِلَيْنَا .<\/p>\n<p>[Muhammad bin Yahya from Ahmad bin Muhammad from Ibn Abi Umayr from Tha&#8217;labah (bin Maymun) from Zurarah (bin A&#8217;yan) who said: I heard Aba Ja&#8217;far saying: if it were not that we are increased (in knowledge) (i.e. by receiving new communication) we would have ran out (exhausted our answers), he (Zurarah) said: I said: are you increased in something which the messenger of Allah did not know?<\/p>\n<p>He said: if such a situation arises, it is given (presented) to the messenger of Allah first, then the (preceding) Aimmah (i.e. are made aware of it) then the matter reaches to us.]<\/p>\n<p>Al-Kafi by Kulayni,Vol 1,Pg 255,H 3<br \/>\nMajlisi:&#8221;Saheeh&#8221; (Mirat ul Uqool 3\/107)<\/p>\n<p>Meaning, if the ruling for cigarettes comes up, there were no cigarettes in the time of the Prophet (saw) so there is no revelation concerning them, so in this case the Imam can receive new revelation that even the Prophet (saw) never knew, but it is to be presented to the Prophet (saw) and the previous Imams first, since they must all have equal knowledge.<\/p>\n<p>al-Mazandarani, the interpreter and commentator of al-Kafi says on 6\/26 of his Sharh Usoul al-Kafi:<\/p>\n<p>ينبغي أن يعلم أن كل علم ألقاه تعالى إلى نبيه (صلى الله عليه وآله) كان أوصياؤه (عليهم السلام) عالمين به من غير زيادة ولا نقصان، وأما العلوم المستأثرة المخزونة إذا اقتضت الحكمة الإلهية إظهارها في أوقات متفرقة على ولي العصر والخليفة الموجود في تلك الأوقات أظهرها له ولا يلزم منه أن يكون هو أعلم من النبي (صلى الله عليه وآله) لما ذكره (عليه السلام) من أنه يعرض ذلك أولا على رسول الله (صلى الله عليه وآله) ثم عليه<\/p>\n<p>[It must be known, that every knowledge that was bestowed by Allah upon his Prophet (as) must also be known by his successors without addition or subtraction. As for the hidden knowledge of God that he kept hidden, if the godly wisdom dictates that it must later be revealed on the ruler and successor of that specific time, then He will reveal it to him and this does not necessarily mean that he has more knowledge (at this point) than the Prophet (saw), because he (as) said: That it must be presented first on the messenger (as) then to him.]<\/p>\n<p>This is why the author of the book &#8220;Imamate and Leadership&#8221; says in the chapter called &#8220;The sources of the Imam&#8217;s Knowledge.&#8221;, he says:<\/p>\n<\/div>\n<\/div>\n<div style=\"text-align: justify;\"><\/div>\n<blockquote>\n<div>[The exceedingly precise and profound knowledge possessed by the Imams is derived from their communication with the world of the unseen and from inspiration (ilham).]<\/div>\n<div><\/div>\n<\/blockquote>\n<div style=\"text-align: justify;\">\n<div>As you can see dear reader, the man doesn&#8217;t wish to say &#8220;revelation&#8221; since this would make his Imam a Prophet, so he decides to hide it by using the word &#8220;Ilham&#8221;. In reality, Ilham is nothing but a feeling that Allah throws in the heart of his slave to help him or guide him towards something, such as a man who wishes to ride a plane, he gets a feeling in his heart that he mustn&#8217;t, and indeed it turns out that this exact same plane crashes, then he is thankful for his Lord who has saved him from an eminent death.<\/div>\n<div><\/div>\n<div>However, learning all the Islamic rulings, and the gospels and scriptures and languages, this is nowhere near &#8220;Ilham&#8221;, this can only be the revelation and guidance of angels. Notice that the author also writes &#8220;communication with the unseen.&#8221; If this isn&#8217;t divine revelation then what is?<\/div>\n<div><\/div>\n<div>For those who wish to know more about how the Imams receive revelation and communicate with angels, refer to our translated book about how Imamah is nothing but a continuation of prophet-hood.<\/div>\n<\/div>\n<div style=\"text-align: justify;\"><\/div>\n<div style=\"text-align: justify;\">The author continues playing dumb and lists some of the sources of knowledge of the Imams:<\/div>\n<div style=\"text-align: justify;\"><\/div>\n<div style=\"text-align: justify;\">\n<blockquote><p>[The Noble Qur&#8217;an was also a rich source on which the Immaculate Imams drew for their knowledge. Given the breadth of their religious vision and perception, they were able to derive various ordinances from revelation and to extract all manner of truths from its innermost layers of meaning.The third source on which they drew consisted of the books and pages which they inherited from the Most Noble Messenger, peace and blessings be upon him and his family, these permitted them to advance still further their level of knowledge and to broaden its scope.]<\/p><\/blockquote>\n<p>He wants us to believe that they learned all this just by reading the Qur&#8217;an and some &#8220;papers&#8221; left by their fathers before them, then he says that these papers &#8220;advances their level of knowledge.&#8221;<\/p>\n<p>Does this ignorant not know what al-Mazandarani stated above? There is no &#8220;furthering&#8221; or &#8220;broadening&#8221;, all Imams know the exact same information at all times, otherwise this would leave a gap. That if I meet the Imam BEFORE he finished reading these &#8220;papers&#8221; he would not have sufficient knowledge to answer my questions.<\/p>\n<p>The author of the silly book is stuck, he has to explain where this knowledge came from and he has no logical way of doing so, he knows that nobody will believe his silly explanation about the Imams learning all of this from the Qur&#8217;an and from some &#8220;papers&#8221;, so finally he quotes this narration and admits his sin:<\/p>\n<blockquote><p>[Hasan b. Abbas once asked Imam ar-Ridha’, peace be upon him, in a letter. &#8220;What is the difference between a messenger, a prophet, and an Imam?&#8221; The Imam answered as follows:<\/p>\n<p>&#8220;The messenger (rasul) is a person to whom Jibril descends and who both sees him and hears the words that he speaks. He is thus in communication with divine revelation (wahy), which he sometimes receives in the form of a dream, as was the case with Ibrahim, peace be upon him. The prophet (nabiyy) sometimes hears the words spoken by Jibril and at other times sees him without hearing anything from him. The Imam hears the words that Jibril utters without seeing him.&#8221;]<\/p><\/blockquote>\n<p>Yes, THIS IS WHERE THE KNOWLEDGE COMES FROM, it is also what separates the majority of Muslims from this deviant sect that denies the seal of prophet-hood and the ending of divine revelation.<\/p>\n<p>He ends by saying:<\/p>\n<blockquote><p>[God&#8217;s effusions of grace thus continue throughout time by means of the Inerrant Imam, in such a way that the link between man and the Creator is not severed with the passing of the Prophet.]<\/p><\/blockquote>\n<p>In other words, prophet-hood never ended.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon our nation and our prophet, This dear readers is the sixth part of our blessed series concerning the infinite problems which generate from the theory <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/03\/14\/issues-of-ghaybah-part-6\/\" title=\"Issues of Ghaybah [Part-6] &#8211; Imams and their ridiculous knowledge\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-1053","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1053","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1053"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1053\/revisions"}],"predecessor-version":[{"id":4428,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1053\/revisions\/4428"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1053"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1053"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1053"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}