{"id":1107,"date":"2014-03-17T14:29:29","date_gmt":"2014-03-17T14:29:29","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1107"},"modified":"2015-08-06T22:10:28","modified_gmt":"2015-08-06T22:10:28","slug":"response-to-the-only-hadeeth-in-glory-of-muawiah-in-sihah-e-sitta","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/03\/17\/response-to-the-only-hadeeth-in-glory-of-muawiah-in-sihah-e-sitta\/","title":{"rendered":"Response to: The Only Hadeeth in Glory of Muawiah in Sihah-e-Sitta"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1107\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to SlaveOfAhlubait’s article: “The Only Hadeeth in Glory of Muawiah in Sihah-e-Sitta.” The article can be found <a href=\"http:\/\/ahlubait.wordpress.com\/2011\/02\/10\/the-only-hadeeth-in-glory-of-muawiah-in-sihah-e-sitta-and-its-reply\/\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">In this article, SoA quotes the narration in praise of Mu’awiyah. The narration is the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">in fadail of mawia, it is only tirmidhi who made a chapter by the name of MANAQIB-E-MAWIA, and he presented this hadeeth in that<\/span><br \/>\n<span style=\"color: #800000;\">“o allah! make him a guide, guided, and spread guidance through him. this hadeeth is hasan ghareb”<\/span><br \/>\n<span style=\"color: #800000;\">[jami tirmidhi, vol 6, page 157, printed beirut]<\/span><\/p>\n<p style=\"text-align: justify;\">SoA provides three reasons to reject the hadith. The first is the claim that the main narrator Abd Al-Rahman bin Abi Umaira never heard the Prophet (salalahu alaihi wa salam). The second is that Mu’awiyah’s questionable actions during the time of Ali and during his own caliphate makes it impossible for him to have been guided. The third is a criticism towards the strengthening of the narration by Al-Tirmithi himself.<\/p>\n<p style=\"text-align: justify;\">In response to the second issue, we say that whether Mu’awiyah was a guide\/guided or not is a subjective issue. Those that hate Mu’awiyah will flaunt a list of questionable actions by him, while those that love him will argue that he was responsible for spreading Islam into many lands from Rome, to Africa, to the East. So, we will leave this matter to another article in the future inshallah since this is not the place for such a large topic.<\/p>\n<p style=\"text-align: justify;\">As for the third issue, one can easily see by revising the Hadith chain that it is not a matter of the authentication of Al-Tirmithi, for the chain up until Abd Al-Rahman bin Abi Umaira is authentic, without a doubt, regardless of the “easy-goingness” of Al-Tirmithi.<\/p>\n<p style=\"text-align: justify;\">With this, we are left with the first issue.<br \/>\nIs Abd Al-Rahman bin Abi Umaira a companion of the Prophet (salalahu alaihi wa salam) or not? SoA comments:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">dhabi and other scholars of rijal said that the narrator who narrated this hadeeth, there is difference of opinion about him being a companion of prophet, his name is abdur rehman bin abu umaira al mazni<\/span><br \/>\n<span style=\"color: #800000;\">[tareekh islam, vol 2, page 342]<\/span><\/p>\n<p style=\"text-align: justify;\">The actual quote in Arabic is the following:<br \/>\nهذا الحديث رواته ثقات، لكن اختلفوا في صحبة عبد الرحمن، والأظهر أنه صحابي<\/p>\n<p style=\"text-align: justify;\">[The narrators of this Hadith are reliable, but they differed on whether `Abdul-Rahman was a companion, and what is more apparent is that he is a companion.]<\/p>\n<p style=\"text-align: justify;\">SoA left out that Al-Dhahabi holds the opinion that he is indeed a sahabi.<\/p>\n<p style=\"text-align: justify;\">SoA add that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">abu hatim razi said that he did not hear this from prophet asws<\/span><br \/>\n<span style=\"color: #800000;\">[al illal, 2601]<\/span><\/p>\n<p style=\"text-align: justify;\">Indeed, this is the opinion of Abu Hatim. It is important to note that Abu Hatim though affirms that Abd Al-Rahman bin Abi Umaira is in fact a companion of the Prophet (salalahu alaihi wa salam) though, as we can see in Al-Jarh wal Ta’deel 5\/333.<br \/>\nSoA also claims that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">ibn abdul bar, ibn hajar and ibn ather said that it is not proven that he was a companion or that he narrated from prophet<\/span><\/p>\n<p style=\"text-align: justify;\">Ibn Abd Al-Barr did indeed say this. Ibn Al-Atheer quoted him in his Usd Al-Ghaaba, which he is known to do, while Ibn Hajar in Al-Isaba 2\/1181 says something completely different after quoting Ibn Abd Al-Barr’s opinion:<\/p>\n<p style=\"text-align: justify;\">“Ibn Fat’hoon replied: I don’t know what this is? For Marwan bin Mohammad Al-Tatri and Abu Mus’hir both narrated this from Rabee’a bin Yazeed that he heard Abd Al-Rahman bin Abi Umaira say that he heard the Messenger (salalahu alaihi wa salam) say this. I said (Ibn Hajar): We’ve mentioned the two narrations and who quoted them, and Ibn Fat’hoon missed out on saying: Let’s assume that the narration of Ibn Abd Al-Barr was indeed disconnected, but what will he do with the rest in which he says that he heard it from the Prophet (salalahu alaihi wa salam)? What more is needed to affirm that one is a companion other than this?”<\/p>\n<p style=\"text-align: justify;\">As we can see, Ibn Hajar was vehemently affirming that Abd Al-Rahman bin Abi Umaira is indeed a companion of the Prophet (salalahu alaihi wa salam). So, we request SoA to revise their material before attributing controversial opinions like these to our scholars.<\/p>\n<p style=\"text-align: justify;\">In conclusion, SoA have failed on all three counts in providing reasons to weaken this narration.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to SlaveOfAhlubait’s article: “The Only Hadeeth in Glory of Muawiah in Sihah-e-Sitta.” The article can be found here. In this article, SoA quotes the narration in praise of Mu’awiyah. The narration is the following: in <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/03\/17\/response-to-the-only-hadeeth-in-glory-of-muawiah-in-sihah-e-sitta\/\" title=\"Response to: The Only Hadeeth in Glory of Muawiah in Sihah-e-Sitta\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6,1],"tags":[20],"class_list":{"0":"post-1107","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail","8":"category-hadith","9":"tag-muawiyah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1107","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1107"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1107\/revisions"}],"predecessor-version":[{"id":1113,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1107\/revisions\/1113"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1107"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1107"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1107"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}