{"id":1117,"date":"2014-03-21T18:47:44","date_gmt":"2014-03-21T18:47:44","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1117"},"modified":"2015-11-11T12:13:20","modified_gmt":"2015-11-11T12:13:20","slug":"response-to-sunnis-and-mutah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/03\/21\/response-to-sunnis-and-mutah\/","title":{"rendered":"Response to: Sunnis and Mutah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1117\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to SlaveOfAhlubait’s article: “Sunnis and <a href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\">Mutah<\/a>”. The article can be found <a href=\"http:\/\/ahlubait.wordpress.com\/2010\/04\/26\/sunnis-and-mutah\/\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">In this article, SoA quotes the opinion of Ibn Juraij, the Sunni Mekkan scholar, on the permissibility of the temporary marriage. SoA also quotes those that have affirmed that Ibn Juraij did partake in this.<\/p>\n<p style=\"text-align: justify;\">We admit that this is the case, for Ibn Juraij, and even those before him like Ibn Abbas and Sa’eed bin Jubair, believed that muta’ah is permissible according to the sharee’ah.<\/p>\n<p style=\"text-align: justify;\">However, Ahl Al-Sunnah do not refer to Ibn Juraij as a primary source for Islamic law, nor do we refer to Ibn Abbas, no Sa’eed bin Jubair, especially since it has been established in authentic hadiths, which can be found in the Saheehain, that the Prophet (salalahu alaihi wa salam) prohibited muta’a. This, furthermore, is the consensus of Ahl Al-Sunnah today.<\/p>\n<p style=\"text-align: justify;\">The prophetic narrations would be evidence for Shias as well, but Shias unfortunately do not take their religion from Sunni books. Due to this, we found it obligatory upon us to provide evidence of the prohibition of muta’a in the words of the Shia Imams from their own books.<\/p>\n<p style=\"text-align: justify;\">1- Ali narrated in Al-Istibsaar 3\/689: The Messenger (salalahu alaihi wa aalihi wa salam) prohibited the meat of the domestic donkey and the muta’a marriage.<\/p>\n<p style=\"text-align: justify;\">2- abu al-Hasan al-Rida in al-Kafi 5\/467: He was asked about if a man is able to marry in muta`a and goes with her from country to country? He replied: &#8220;The other marriage is permissible, not this one.&#8221;<\/p>\n<p style=\"text-align: justify;\">al-Majlisi commented in Mir&#8217;aat al-`Uqoul:<\/p>\n<p style=\"text-align: justify;\">ظاهره أنه سأل السائل عن حكم المتعة أجاب عليه السلام بعدم جواز أصل المتعة تقية<\/p>\n<p style=\"text-align: justify;\">[What is apparent from it, is that the questioner asked about muta`a so he peace be upon him replied that muta`a is essentially prohibited as Taqiyyah&#8230;]<\/p>\n<p style=\"text-align: justify;\">3- Ja’afar Al-Sadiq responded when asked about it in Ahmad bin Mohammad bin Eisa Al-Ash’ari’s Nawadir (p. 87): Don’t pollute yourself with it.<\/p>\n<p style=\"text-align: justify;\">4- Ja’afar Al-Sadiq said about it in Ahmad bin Mohammad bin Eisa Al-Ash’ari’s Nawadir (p. 87): Only the fawajir (those that perform illicit sexual acts) do it.<\/p>\n<p style=\"text-align: justify;\">The first narration is authentic and cannot be weakened.<\/p>\n<p style=\"text-align: justify;\"><strong>Note:<\/strong> The third and fourth narrations have authentic chains, but are from Kitab Al-Nawadir, which some Shia scholars do not accept. We mention this point so that we won’t be accused of being non-academic with our arguments.<\/p>\n<p style=\"text-align: justify;\">So, as we can see from the narrations above, and especially the narration of Ali, muta’ah is not permissible.<\/p>\n<p style=\"text-align: justify;\">Shias will argue that he said this when he was in fear, due to taqiyyah. We argue that this point is simply absurd, for it brings us back to the article of SoA, who reminds us that some very major Sunni scholars in the past for a period of time believed in muta’ah, like Ibn Juraij. One should also be aware that Ibn Juraij is a contemporary of Ja’afar Al-Sadiq and both men were very much respected in their communities. It is in light of this information that we simply cannot accept that Ja’afar Al-Sadiq feared for his life, and thus taught the prohibition of muta’a, out of fear, since there is no reason to be afraid, since Ibn Juraij practiced it! All that Ja’afar Al-Sadiq needs to say is: O’ people, look! Ibn Juraij practices it! Why do you condemn me?!<\/p>\n<p style=\"text-align: justify;\">Similarly, all that Ali, Ameer Al-Mu’mineen, the most powerful man in the Islamic empire, needed to say is: O’ people, look! Ibn Abbas preaches the permissibility of it! Why do you condemn me?!<\/p>\n<p style=\"text-align: justify;\">In conclusion, the argument that these words were said out of taqiyyah is simply ridiculous, not only because they were high in status and cannot be touched, but because these very opinions and practices were shared by some important early Sunnis, notably the Mekkans, like Ibn Abbas, Sa’eed, and Ibn Juraij.<\/p>\n<p style=\"text-align: justify;\">Not only this, ibn Jurayj is an Umayyad, he is from bani Umayyah, so anyone who wished to practice muta`a can do so without worry at all since one of the biggest scholars who is from banu Umayyah the rulers was openly doing it without issue. The only difference is that ibn Jurayj fears God more than some deviant sects, as when the prohibition of muta`a reached him, he refrained from doing it.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar al-`Asqalani (rah) reports regarding ibn Jurayj&#8217;s (rah) opinion of Mut`ah: &#8220;Abu `Awanah narrated in his Sahih from ibn Jurayj that he said to them in Basarah: &#8220;Bear witness that I have retracted my Fatwa.&#8221; After he narrated to them eighteen narrations that there was no harm in it.&#8221;<\/p>\n<p style=\"text-align: justify;\">source: al-Talkhees al-Habeer 3\/160, Musnad abi `Awanah 3\/31 #4087.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to SlaveOfAhlubait’s article: “Sunnis and Mutah”. The article can be found here. In this article, SoA quotes the opinion of Ibn Juraij, the Sunni Mekkan scholar, on the permissibility of the temporary marriage. SoA also <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/03\/21\/response-to-sunnis-and-mutah\/\" title=\"Response to: Sunnis and Mutah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-1117","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1117","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1117"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1117\/revisions"}],"predecessor-version":[{"id":2744,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1117\/revisions\/2744"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1117"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1117"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}