{"id":1123,"date":"2014-04-08T22:33:38","date_gmt":"2014-04-08T22:33:38","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1123"},"modified":"2018-10-30T14:41:02","modified_gmt":"2018-10-30T14:41:02","slug":"issues-of-ghaybah-part-7","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/04\/08\/issues-of-ghaybah-part-7\/","title":{"rendered":"Issues of Ghaybah [Part-7] &#8211; Is Ghaybah a test and how can the Imam truly be a Hujjah?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1123\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon this nation and its Prophet,<\/p>\n<p style=\"text-align: justify;\">This is the seventh article on the countless issues of Ghaybah or &#8220;occultation&#8221; as they decided to call it, although I would rather they call it Absence. These folks were even confused about the rules of their &#8220;Ghaybah&#8221;, they say there is a smaller one and a bigger one. The smaller Ghaybah is when the Mahdi had four emissaries and he used to send them letters to inform them of matters in politics and religion. The bigger Ghaybah is when humanity is cut-off completely from the Mahdi and no one gets to be in contact with him, YET you observe in many Shia books that their scholars are receiving letters from him and information as well as guidance, such as al-Mufid and his famous letters from al-Mahdi. May Allah help us from confusion in matters of religion.<\/p>\n<p style=\"text-align: justify;\">Aside from this&#8230;<\/p>\n<p style=\"text-align: justify;\">Remember O dear readers, when we used to show the Shia laypeople their narrations and the declarations by their scholars, that the 12th one has been hiding for 1,200 years out of fear from the rulers and their spear carrying soldiers? Well this caused some of their laypeople to change their beliefs concerning this issue, as their &#8220;intellect&#8221; could not accept that their miraculous virtuous savior was so scared that he remained in hiding for so long without helping his loyal followers in anything. How can they love someone who quietly watches as they suffer and die in confusion and he hides from fear for his own useless life? Would it not be more intellectual if Allah (swt) makes him appear and guide the nation as much as he can, with sincerity and sacrifice, then after he dies Allah sends another 13th one after him? Wasn&#8217;t this the case with the Prophets of bani Isra&#8217;eel? Bani Isra&#8217;eel are a nation who used to kill their prophets but Allah kept sending new ones to continue guiding humanity.<\/p>\n<p style=\"text-align: justify;\">These days the latest Shia fashion is that  they started calling his disappearance a &#8220;test&#8221;. This means that he is not hiding out of fear but is hiding because Allah ordered him to disappear to test the faith of his followers.<\/p>\n<p style=\"text-align: justify;\">Other than the fact that this belief contradicts with their other beliefs such as &#8220;Lutf&#8221; or godly grace, we would like to show these folks a thing or two about their Madhab that they might have missed.<\/p>\n<p style=\"text-align: justify;\">In their book &#8220;Bidayat al-Ma`arif al-Ilahiyyah fi Sharh `Aqa&#8217;id al-Imamiyyah&#8221; by al-Sayyid Muhsin al-Khizari, 2\/148, we read the words of al-Muhaqqiq Naseer-ul-Deen al-Tusi, a Shia scholar, he says:<\/p>\n<p style=\"text-align: justify;\">ليست غيبة المهدي &#8211; عليه السلام &#8211; من الله سبحانه، ولا منه &#8211; عليه السلام &#8211; بل من المكلفين والناس، وهي من غلبة الخوف وعدم تمكين الناس من إطاعة الإمام، فإذا زال سبب الغيبة وقع الظهور<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[The Ghaybah of the Mahdi (as) is not from Allah (swt) nor from him (as) rather it is caused by those who are religiously accountable and by the people, it is caused by being overcome with fear and the inability of the people to obey the Imam. If the cause of Ghaybah disappears then he will appear.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">In the same book on page 149, he quotes al-Muhaqqiq `Abdul-Razzaq bin `Ali bin al-Husayn al-Lahijee:<\/p>\n<p style=\"text-align: justify;\">إذا كان الإمام المعصوم موجودا وغائبا فليس علينا بيان سبب غيبته بالتفصيل، نعم يعلم إجمالا أن السبب في غيبته ليس من جانبه، لأنه معصوم، ويمتع ترك الواجب منه، مع أن الظهور والقيام بأمر الإمامة وإقامة الشرايع من الواجبات، فسبب غيبة الإمام من طرف رعيته لعدم نصرتهم إياه، فإذا تحققت مظنة النصرة من قبل الرعية وجب ظهوره<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[If the infallible Imam is existing but absent(Gha&#8217;ib) then we are not responsible for clarifying the reason for his Ghaybah in detail. Yes, it is generally known that the reason for his Ghaybah is not caused by him, because he is infallible, and it is prohibited for him to leave his duty. Although appearing and conducting the affairs of leadership and establishing the religious laws are from his duties but the cause of his absence are his subjects for not supporting him. If the support is granted then the appearance becomes Wajib.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Finally the author of the book himself states in conclusion:<\/p>\n<p style=\"text-align: justify;\">والجواب عنه: أن الإمام &#8211; عليه السلام &#8211; إن ظهر قبل الموعد فإن اتقى عن حكومة الجور فهو لا يناسبه، وإن لم يتق فهم قتلوه، فالغيبة مانعة عن قتله، وهذا أمر تدل عليه الأخبار<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[The answer for this: Is that the Imam (as) if he appears before the right time, then he will do Taqiyyah in the government of the tyrants and this does not suite him, and if he does not do Taqiyyah he will be killed, so the Ghaybah prevents his death and this is a matter proven by the narrations.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Why are these Shia scholars saying this? Why don&#8217;t they just use the lame excuse of this being a &#8220;test&#8221;?<\/p>\n<p style=\"text-align: justify;\">It is because as we said before, the Shia since the olden days believed that there must always be an apparent infallible Imam to lead, they believe that his presence and leadership is justice, they believe that his absence is injustice. Allah (swt) can&#8217;t be unjust as this contradicts Qur&#8217;an and the Shia `Aqeedah of &#8220;`Adl Ilahi&#8221; or divine justice, also the Imam cannot be unjust because he is infallible, who does this leave? This leaves the rest of the people, they blame it on his opponents for threatening to kill him, and on his Shia for lack of support.<\/p>\n<p style=\"text-align: justify;\">For the big Shia leaders and philosophers it cannot be anything else, otherwise they themselves would fall into a big mess in terms of beliefs, a mess bigger than the one they&#8217;ve already fallen in as the reader can see. Let me InshaAllah show you an example.<\/p>\n<p style=\"text-align: justify;\">Shareef al-Murtada says in his book of Ghaybah pg.52:<\/p>\n<p style=\"text-align: justify;\">أما سبب الغيبة فهو: إخافة الظالمين له عليه السلام، وقبضهم يده عن التصرف فيما جعل إليه التصرف والتدبير له، لأن الإمام إنما ينتفع به إذا كان ممكنا، مطاعا، مخلى بينه وبين أغراضه، ليقوم الجناة، ويحارب البغاة، ويقيم الحدود، ويسد الثغور، وينصف المظلوم من الظالم، وكل هذا لا يتم إلا مع التمكين، فإذا حيل بينه وبين مراده سقط عنه فرض القيام بالإمامة، فإذا خاف على نفسه وجبت غيبته ولزم استتاره<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[As for the reason for Ghaybah: It is the fear the oppressors caused him (as) to have, and the restrains they placed on his hands, disabling him from exercising his authority which was given to him. Benefiting from the Imam  is only possible if he was in authority, and if he was obeyed, and if he was free to fulfill his duties, to punish the criminals and fight the transgressors and apply the law, and to grant the oppressed justice from his oppressors, and all of this is not possible unless he is in authority. If he was prevented from doing so, then his obligatory duty to lead is also dropped from him, and if he fears for himself then Ghaybah becomes obligatory and hiding becomes necessary.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Do you notice O dear reader that he has no option but to claim that the man is in hiding out of fear caused by his opponents? Otherwise al-Murtada who is the leader of the Shia in his time, has no excuse as to why Allah (swt) would allow the nation to remain without an infallible guide and leader.<\/p>\n<p style=\"text-align: justify;\">Also notice how he says that &#8220;Benefiting from the Imam is only possible if he was in authority&#8221; which means he is pretty much useless and his existence is currently pointless, this was briefly discussed in a previous article under a similar title:<\/p>\n<ul style=\"text-align: justify;\">\n<li><strong><a title=\"The Shia Mahdi … Useless?\" href=\"http:\/\/twelvershia.net\/2013\/08\/26\/the-shia-mahdi-useless\/\" rel=\"external nofollow\">The Shia Mahdi … Useless?<\/a><\/strong><\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Al-Murtada decided to base his entire defense of the Ghaybah on this argument, when he was asked: How is it possible for the Mahdi to be allowed to hide without fulfilling any of his duties? He answered on pg.54:<\/p>\n<p style=\"text-align: justify;\">وإذا جاز استتاره عليه السلام &#8211; مع تعلق الحاجة إليه &#8211; لخوف الضرر، وكانت التبعة في ذلك لازمة لمخيفية ومحوجية إلى التغيب، سقطت عنه اللائمة، وتوجهت إلى من أحوجه إلى الاستتار وألجأه إلى التغيب<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[If he (as) was permitted to hide -even with a need for his presence- for fear of harm, the negative consequences of this are the responsibility of those who scared him and caused him to hide, then all blame is dropped from him (as), and the blame is now directed towards those who made him disappear.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">He then goes on to use this same excuse for everything else, such as the length of his absence:<\/p>\n<p style=\"text-align: justify;\">لأنه لا فرق في ذلك بين القصير المنقطع وبين الممتد المتادي، لأنه إذا لم يكن في الاستتار لائمة على المستتر إذا أحوج إليه جاز أن يتطاول سبب الاستتار<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[There is no difference when it comes to this between a short absence and a very long one, because if the disappearance is not his own fault and he was forced into it, then he is allowed to hide for long periods if needed]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Thus avoiding in a really lame way the accusation of injustice.<\/p>\n<p style=\"text-align: justify;\">What is interesting and ironic is that the Twelvers today insist on calling him a &#8220;Hujjah of Allah&#8221;, although he is far from being one. The word &#8220;Hujjah of Allah&#8221; in the Islamic religion means the divine godly proof or godly argument that He (swt) issues to prove the truth from the falsehood. Allah (swt) sends the angels with divine messages for his chosen slaves so they can be prophets and so they can establish the Hujjah of Allah upon his creations, Allah says in his book:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\"><strong>{[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument(Hujjah) against Allah after the messengers. And ever is Allah Exalted in Might and Wise.} [4:165]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Allah (swt) sends them so that humanity cannot have an argument against their Lord on the day of judgement, for how can Allah throw us in the fire if he did not send us his divine godly proof and establish his godly argument on us through these chosen men? Then after that whoever rejects is deserving of an eternity in hell-fire.<\/p>\n<p style=\"text-align: justify;\">The Shia Mahdi is quite the opposite, he is the<strong> &#8220;Hujjah of the people against Allah after the messengers.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\">How you ask?<\/p>\n<p style=\"text-align: justify;\">`Ali (ra) presented his version of the Qur&#8217;an which was perfectly complied in the acceptable order, it contained the abrogations and clarified them, it contained the detailed interpretation of every verse and its cause of revelation, the rulers reject `Ali&#8217;s (ra) book.<\/p>\n<p style=\"text-align: justify;\">Ahlul-Bayt then inherited this book until the 12th one was born, he then took it and disappeared.<\/p>\n<p style=\"text-align: justify;\">So when we are asked on the day of judgement why we strayed from truth we answer:&#8221;The Hujjah of Allah was absent.&#8221;<\/p>\n<p style=\"text-align: justify;\">May Allah (swt) save us from misguidance and confusion. We hope this series of articles on Ghaybah are helpful for our readers InshaAllah, for our goal is guidance from darkness of lies and innovation to the light of truth and Sunnah.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon this nation and its Prophet, This is the seventh article on the countless issues of Ghaybah or &#8220;occultation&#8221; as they decided to call it, although <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/04\/08\/issues-of-ghaybah-part-7\/\" title=\"Issues of Ghaybah [Part-7] &#8211; Is Ghaybah a test and how can the Imam truly be a Hujjah?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[16],"class_list":{"0":"post-1123","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah","8":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1123","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1123"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1123\/revisions"}],"predecessor-version":[{"id":4429,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1123\/revisions\/4429"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1123"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1123"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1123"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}