{"id":1154,"date":"2014-05-09T18:18:13","date_gmt":"2014-05-09T18:18:13","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1154"},"modified":"2015-09-17T12:10:34","modified_gmt":"2015-09-17T12:10:34","slug":"response-to-birth-of-imam-ali-in-kaaba","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/05\/09\/response-to-birth-of-imam-ali-in-kaaba\/","title":{"rendered":"Response to: Birth of Imam Ali in Kaaba"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1154\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to Syed Hasni’s article entitled “Birth of Imam Ali in Kaaba.” The article was translated and published on SlaveOfAhlubait’s blog, on the 24th of March, 2011, and can be found <a href=\"http:\/\/ahlubait.wordpress.com\/2011\/03\/24\/birth-of-imam-ali-in-kaaba\/\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p id=\"yui_3_16_0_1_1399658239098_3120\" style=\"text-align: justify;\">Syed Hasni, in this article, sets out to establish the opinion that Ali was born in the Ka’aba, while at the same time refuting the idea that Hakeem bin Hizam was born there.<\/p>\n<p style=\"text-align: justify;\"><strong>1- Did the Scholars say that Hakeem bin Hizam was Not born in the Ka’aba?<\/strong><\/p>\n<p style=\"text-align: justify;\">Syed Hasni provides twelve quotes in order to establish his points, then suggests that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">there is none other who was born in kaaba apart from imam ali asws; as for hakim bin hazim, it is a story created by nawasib so that the glory of imam ali asws can be nullified; though great sunni scholars have negated it.<\/span><\/p>\n<p style=\"text-align: justify;\">However, when we look through the sources provided by Syed Hasni, we find that this statement is only said by late scholars who have died in the previous century or the one before it. The earliest person that shared this view was Ibn Sabagh Al-Maliki, who is an infamous 9th century Shi’ee, who has a book proving the Imamate of the twelve Imams. Not only is this opinion rejected because it is the opinion of a Twelver Shia, but also because he is a very late scholar.<\/p>\n<p style=\"text-align: justify;\">The earliest opinions that Syed Hasni quotes are the opinions of Al-Mas’oudi, another Shi’ee, who has a book attributed to him with evidence for the twelve Imams, and Al-Hakim Al-Nisapuri.<br \/>\nSyed Hasni quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">masoodi writes in his book<\/span><br \/>\n<span style=\"color: #800000;\">ali was born inside kaaba<\/span><\/p>\n<p style=\"text-align: justify;\">We argue that this quote is no sufficient evidence, for Al-Mas’oudi is a fourth century Shi’ee scholar whose opinion does not hold any weight in their school due to the lack of statements that establish his credibility. Moreover, the quote does not suggest that Ali was the only person born in the ka’aba. It does not negate that the same may have been the case with Hakeem bin Hizam.<\/p>\n<p style=\"text-align: justify;\">Ironically, Syed Hasni affirms this when commenting on Al-Hakim’s quote:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">hakim negated mus’ab that he made an error here that there was no one else born in kaaba apart from hakim bin hazm; though it is proven with mutawatir narration that imam ali asws was <span style=\"text-decoration: underline;\"><strong>also<\/strong><\/span> born here; but since he had to negate saying of mus’ab;<\/span><br \/>\n<span style=\"color: #800000;\">that is why he talked of it here; and did not talk of it in the chapter of fadail of imam ali asws;<\/span><\/p>\n<p style=\"text-align: justify;\">The term “also” above was bolded and underlined for emphasis that this is Syed Hasni’s admittance that Al-Hakim believed that Hakeem bin Hizam was also born in the ka’aba.<\/p>\n<p style=\"text-align: justify;\"><strong>2- Is there mutawatir Evidence that Ali was Born in the Ka’aba?<\/strong><\/p>\n<p style=\"text-align: justify;\">The first person to have made this claim was Al-Hakim (d. 405 AH), who is a respectable Sunni scholar with Shia tendencies, as anyone who has read through his Mustadrak would have noticed. Strangely, Al-Hakim did not provide any evidence for this claim, nor did he report any narrations from the Prophet (salalahu alaihi wa salam), Ali, any companion, any of the Tabi’een, or any early historian, to support this view. With the absence of this evidence, we have no choice but to reject this statement as a slip of the pen.<\/p>\n<p style=\"text-align: justify;\">Not only was Syed Hasni unable to provide any narrations to support this theory, but Al-Hakim himself, an early Hadithist failed. It is therefore unlikely to suggest that this narration is Mutawatir, let alone Saheeh.<\/p>\n<p style=\"text-align: justify;\"><strong>3- Was Al-Zubair bin Bakkar the First Person to say that Hakeem bin Hizam was born in the Ka’aba?<\/strong><\/p>\n<p style=\"text-align: justify;\">If Syed Hasni bothered to look at the same page that he was quoting from Mustadrak Al-Hakim, he will realize that there are two other historians that have held this view, the first is Mus’ab Al-Zubairi, and the second is Ali bin Aththam, both of whom lived in the second century after Hijra.<\/p>\n<p style=\"text-align: justify;\"><strong>4- Who was really born in the Ka’aba?<\/strong><\/p>\n<p style=\"text-align: justify;\">There is no definitive proof to support either view, for claims come from people that have lived in late times. However, if one is going to accept that `Ali was born in the Ka’aba, then he would have no choice but to accept the same for Hakeem bin Hizam, for those that have held this view lived two centuries earlier than those that held the view that only `Ali did.<br \/>\n<span style=\"text-decoration: underline;\">Note:<\/span><\/p>\n<p style=\"text-align: justify;\">We have seen when going through Shia narrations that the merits of the companions have been instead attributed to Ali. Narrations like, “I am the great Siddeeq,” or “I am the great Farooq.” Furthermore, in narrations of conquests, we also find that whenever an enemy of Islam is killed, we often read after the inclusion of the name of the person that killed him, we find: “it was also said that Ali may have killed him.”<\/p>\n<p style=\"text-align: justify;\">Perhaps the most surprising is a quote by Ibn Taymiyyah in Minhaj Al-Sunnah where he says, “A trustworthy person from our peers met up with a sheikh I know, who was religious and an ascetic but within him was some Tashayyu. He claimed that he had a book of secrets that he took from one of the treasuries of the caliphs and praised the book. He then brought it, and it was in a good handwriting, and within it are the narrations in praise of Abu Bakr and Omar in Saheeh Al-Bukhari and Muslim, but they were attributed to Ali.”<\/p>\n<p style=\"text-align: justify;\">With this in mind, it is not all too strange to find this merit, a birth in the Ka’aba, being attributed to Ali. For if Hakeem bin Hizam’s story was a fabrication, it would have been attributed to a more famous Sahabi, like Abu Bakr, Omar, Uthman, Mu’awiyah, or Amr bin Al-Aas. It simply does not make sense to attribute narrations of merits to companions that are relatively unknown in comparison to Ali if these merits have no basis of truth in the first place.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">For more on this subject, we suggest checking out:<\/p>\n<p style=\"text-align: justify;\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"zMQlRlmFZZ\"><p><a href=\"https:\/\/youpuncturedtheark.wordpress.com\/2015\/09\/17\/the-fable-of-alisra-birth-inside-kaaba-an-honour-or-dishonour\/\" rel=\"external nofollow\">The Fable of Ali’s(RA) Birth inside Ka’aba: An Honour or&nbsp;Dishonour?<\/a><\/p><\/blockquote>\n<p><iframe loading=\"lazy\" class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; visibility: hidden;\" title=\"&#8220;The Fable of Ali’s(RA) Birth inside Ka’aba: An Honour or&nbsp;Dishonour?&#8221; &#8212; In Defense of the Aal &amp; Ashaab\" src=\"https:\/\/youpuncturedtheark.wordpress.com\/2015\/09\/17\/the-fable-of-alisra-birth-inside-kaaba-an-honour-or-dishonour\/embed\/#?secret=OHdYPnzSMb#?secret=zMQlRlmFZZ\" data-secret=\"zMQlRlmFZZ\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to Syed Hasni’s article entitled “Birth of Imam Ali in Kaaba.” The article was translated and published on SlaveOfAhlubait’s blog, on the 24th of March, 2011, and can be found here. Syed Hasni, in this <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/05\/09\/response-to-birth-of-imam-ali-in-kaaba\/\" title=\"Response to: Birth of Imam Ali in Kaaba\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6,1],"tags":[],"class_list":{"0":"post-1154","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1154","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1154"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1154\/revisions"}],"predecessor-version":[{"id":2453,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1154\/revisions\/2453"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}