{"id":1177,"date":"2014-05-29T17:10:17","date_gmt":"2014-05-29T17:10:17","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1177"},"modified":"2014-05-29T17:18:00","modified_gmt":"2014-05-29T17:18:00","slug":"response-to-do-shias-narrate-from-a-donkey","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/05\/29\/response-to-do-shias-narrate-from-a-donkey\/","title":{"rendered":"Response to: Do Shi’as Narrate From A Donkey?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1177\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to RevisitingtheSalaf.org article entitled: Do Shi’as Narrate from a Donkey? The article was published on the 18th of May, 2014, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2014\/05\/do-shias-narrate-from-donkey.html\" rel=\"external nofollow\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">The donkey narration in the most important Shia hadith book Al-Kafi is infamous. The final part of the narration has become a spotlight of ridicule amongst Sunni, scholars and laymen alike. The narration goes as follows:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Imam Alee (a.s) said, &#8220;The first one of the animals which died was Ya&#8217;fur who died within the same hour that the Messenger of Allah (saw) died. He brook off his bound until and began to run until he came to the well of Banu Khatma in Quba and threw himself into it and it became his grave.&#8221; It is narrated that Ameer Al-Mo&#8217;mineen (a.s) said, &#8220;That donkey spoke to the Messenger of Allah (saw) saying, &#8216;May Allah (swt) take my soul and the soul of my parents in service for your cause! My father related to me from his father from his grand father from his father who lived with Noah in the Ark. Once Noah came to him and whipped him on his back and said, &#8220;From the descendents of this donkey there will a donkey on whose back the master and the last of the prophets will ride.&#8221; I thank Allah (swt) who has made me that donkey.'&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><strong> Section 1: The Reasons why this Narration is Mocked:<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS comment:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In this article we shall discuss the so-called &#8216;Ahl ul Sunnah&#8217;s&#8217; ignorant and hypocritical mockery of the science of Shi&#8217;a hadeeth. In particular, the narration of the Prophets (saw) donkey called &#8216;Ya&#8217;fur.&#8217; One only has to read the various hadeeth from both Shi&#8217;a and Sunni sources to ascertain that animals being able to speak is not a unique phenomenon.<\/span><\/p>\n<p style=\"text-align: justify;\">They furthermore argue that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Even if we assume this incident to be true, it is difficult to understand why the hadeeth is mocked at when it involves our beloved Prophet (saw). Would it seriously be impossible for such an incident to occur considering numerous miracles took place during the life of the Prophet (saw)?<\/span><\/p>\n<p style=\"text-align: justify;\">RTS do not seem to be aware of the cause for the ridicule. Sunnis do not mock miracles, nor do they mock the belief that Allah can cause animals and humans to interact. RTS does not need to quote narrations from the Saheehayn about a cow and a wolf speaking to humans, for even stranger things can be found in the Qur’an. As all Muslims know, Sulayman (alaihi alsalam) was given the ability to understand the speech of ants and birds, so the suggestion that man, through a miracle, can communicate with a donkey is not unbelievable.<br \/>\nHowever, the cause of the mockery does not revolve around this phenomenon. If that was the case, then the Sunnis would have written books, instead of articles on the subject, for this is not the only narration in which Shias have animals speak. For we find in Shia narrations that `Ali spoke to lizards, wolves, camels, lions, cows, elephants, geese, horses, and snakes. (See Madinat Al-Ma’ajiz 1\/103-118). Almost each and every one of the twelve Imams can be found in narrations speaking to some sort of animal, and yet, the previous one was isolated and mocked exclusively.<\/p>\n<p style=\"text-align: justify;\">There are two reasons why the narration is mocked. The first is that it includes a chain of narrators. The donkey says:<\/p>\n<p style=\"text-align: justify;\">إن ذلك الحمار كلّم رسول الله فقال : بأبي أنت وأمي ، إن أبي حدثني عن أبيه عن جده عن أبيه أنه كان مع نوح في السفينة<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">My father related to me from his father from his grand father from his father who lived with Noah in the Ark.<\/span><br \/>\n<span style=\"color: #800000;\"><span style=\"color: #333333;\">The narration is a silly fabrication since the donkey is only talking about his great-great-grand father, and it is impossible for donkeys to live for hundreds of years for that donkey to be the donkey of the Prophet Noah (alaihi alsalam).<\/span> <\/span><\/p>\n<p style=\"text-align: justify;\">Secondly, the narration is seen as authentic in the eyes of Shia Akhbari scholars, like Al-Hur Al-Amili. He said in Wasa’el Al-Shi’a 30\/196:<br \/>\n“&#8230;so it is known that everything within it is authentic, according to the early scholars, meaning correctly attributed to the infallibles with solid evidences, or mutawatir.”<br \/>\nIn other words, this narration, is binding upon all Akhbaris, or any Shi’ee, that believes in the authenticity of Al-Kulayni’s Al-Kafi. However, the objective Shi’ee that rejects reports with weak or disconnected chains of transmission, then such a report is not binding upon them. With this in mind, it is not the intention of Sunnis to mock those that fall into the latter category, but rather, to mock those that fall into the former category. Not only that, but Sunnis invite those of the latter category to join Sunnis in mocking those that fall into the former category, for their gullibility and weak-mindedness, which caused them to accept such drivel.<\/p>\n<p style=\"text-align: justify;\">In conclusion, this isn&#8217;t a narration of a donkey who miraculously spoke, rather the donkey is an actual narrator and he narrates from other donkeys a Hadith about Noah (as). Since Shia as a whole do not have reliable chains of transmission in their books, it was rather amusing to see that they resorted to narrating from donkeys.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 2: Donkey Narrations in Sunni Sources:<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS then started to quote the narration of Ya’foor the donkey from Sunni sources. The narration goes as follows:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">More than one of the scholars of hadeeth have denied this hadeeth. However, it was narrated by Aboo Muhammad ibn Abdullah ibn Hamid, narrated by Aboo Al-Hussain Ahmad ibn Hadan Al-Sijsi, narrated by Umar ibn Muhammad ibn Bajir, narrated by Aboo Ja&#8217;far Muhammad ibn Mazid, narrated by Aboo Abdullah Muhammad ibn Akba ibn Aboo Al-Sahba, narrated by Aboo Hudhafyah, narrated by Abdullah ibn Habib Al-Hathli, narrated by Aboo Abd Al-Rahman Al-Silmy, narrated by Aboo Manthur who said: When Allah (swt) opened Khaybar to his Prophet (saw) he received as his share of the spoils four sheep, four goats, ten pots of gold and silver and a black, haggard donkey. The Prophet (saw) addressed the donkey asking, &#8220;What is your name?&#8221; The donkey answered, &#8220;Yazid son of Shihab. Allah (swt) had brought forth from my ancestry 60 donkeys, none of whom were ridden on except by prophets. None of the descendants of my grandfather remain but me, and none of the prophets remain but you and I expected you to ride me. Before you, I belonged to a Jewish man, whom I caused to stumble and fall frequently so he used to kick my stomach and beat my back.&#8221; The Prophet – may Allah&#8217;s (swt) prayers and peace be upon him – said to him, &#8220;I will call you Ya&#8217;fur. Oh Ya&#8217;fur!&#8221; Then Ya&#8217;fur replied, &#8220;I obey.&#8221; The Prophet (saw) then asked, &#8220;Do you desire females?&#8221; The donkey replied, &#8220;NO!&#8221; So the Prophet (saw) used to ride the donkey to complete his business, and if the Prophet (saw) dismounted from him, he would send the donkey to the house of the person he wanted to visit and Ya&#8217;fur would knock at the door with his head. When the owner of the house would answer the door, the donkey would signal to that person to go see the Prophet (saw). When the Prophet (saw) died, the donkey went to a well belonging to Aboo Al-Haytham ibn Al-Tahyan and threw himself in the well out of sadness for the Prophet&#8217;s (saw) death, making it his grave.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Bidayah Wa&#8217;an-Nihayah. Pg. # 933 &#8211; 934, H. # 27.<\/span><\/p>\n<p style=\"text-align: justify;\">Due to the grace of Allah, the scholars of Ahl Al-Sunnah said:<br \/>\nIbn Al-Jawzi said: May Allah curse the person that fabricated this hadith, for he intended to mock and attack Islam! (Al-Mawdoo’aat 1\/218)<br \/>\nIbn Hibban said: This hadith has no foundation, and it’s chain is nothing, and it is not permissible to use Mohammad bin Mazeed as evidence. (See previous source.)<br \/>\nAbu Musa Al-Madeeni said: This narration is extremely munkar, both in chain and text, and I forbid anyone to narrate this from me, unless they mention my words about it (in rejecting it). (Al-Isaba by Ibn Hajar 4\/2366.)<\/p>\n<p style=\"text-align: justify;\">This is the difference between the scholars of Ahl Al-Sunnah and the Shia. We denounce these narrations as fabrications, while Shias include them in their biggest book of hadith, some even accepting them as authentic.<\/p>\n<p style=\"text-align: justify;\">In a second narration, RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Aboo Na&#8217;im Al-Asbahani:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated to us Aboo Bakr Ahmad ibn Muhammad ibn Musa Al-Anburi from Ahmad ibn Muhammad ibn Yusuf from Ibraheem ibn Suwayd Al-Jadu&#8217;i from Abdullah ibn Uzayna Al-Taa&#8217;i from Thawr ibn Yazeed from Khalid ibn Ma&#8217;daan from Ma&#8217;adh ibn Jabal who said: On Khaybar, a donkey came and stood in front of the Prophet (saw). The Prophet (saw) asked him, &#8220;Who are you?&#8221; The donkey replied: &#8220;I am Amro Bin Fulan! We were (The donkey and his brothers) seven brothers and we have been ridden by all the prophets. I am the youngest among them, and I was yours, and I have been owned by a Jewish man. When I used to remember you I had to spit him, and then he used to hit me. The Prophet (saw) said to the donkey: &#8220;Then I shall call you, &#8216;Ya&#8217;fur.'&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Dala&#8217;el An-Nubuwwah. Vol. 1, Pg. # 386 &#8211; 387, H. # 288.<\/span><\/p>\n<p style=\"text-align: justify;\">We find the scholars of Ahl Al-Sunnah once again condemning this narration. Abdullah bin Uthaina was accused by Al-Naqqash and Al-Hakim of narrating fabrications. Ibn Hibban said: It is not permissible to narrate his book unless one is doing so in order to show its weakness. See Lisan Al-Mizan by Ibn Hajar 3\/321.<br \/>\nRTS then quote a narration from Al-Qadhi Iyyad’s Al-Shifa from the book of Ibrahim bin Hammad but do not include a chain. It is needless to say that such narrations are rejected.<br \/>\nFinally, RTS quote the opinion of some unknown Sufi author called Ibn Hudaida who says that he wishes that he was a hair on a donkey, as if such a statement has any weight in the eyes of Sunnis.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 3: Narration of the Bull:<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS quote the following narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Taghribirdi:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Sheikh Qutb Al-Din (Al-Yunini) said: On the first ten days of Muharram, many people who reside in Damascus said and that is known in Damascus and it has been narrated very much from the jurist of Jabbat A&#8217;asal (one of Damascus villages) that he talked to a bull from the Jabbat A&#8217;asal. And the summary of that story is that the bull was going out with a boy who was taking it to drink water, so after he finished (drinking), he (the bull) thanked Allah (swt). The boy was surprised and told the owner of the bull. He (the owner of the bull) was in doubt, so on the next day he took the bull by himself (took him to drink water), and after the bull drink water, he thanked Allah (swt), and on the third day some people came to see the bull, and they saw it thanking Allah (swt), so some of them talked to it and it said: &#8220;Allah (swt) had decided to the Ummah to live seven barren years, but by the Shafa&#8217;a (intercession) of the Prophet (saw), He (Allah (swt)) changed them (those seven years) to fertile years.&#8221; And it said (the bull) that the Prophet (saw) asked the bull to spread that among people. And the bull said: &#8220;O RasulAllah! What is the evidence to let them believe me?&#8221; He said: &#8220;You will be dead after telling them.&#8221; The narrator said: Then the bull went to a high point and fell down and had died. People took some of his hair to take as Barakah, then it was enshrouded and buried. (Author said): This story is strange, but the narrator is trustworthy and he says it is very well-known in Damascus.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: An-Nujoom Az-Zahira fi Mulook Mysr wa Al-Qahira. Vol. 8, Pg. # 50.<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak since Al-Yuneeni does not mention his source in the narration. He says that a trustworthy person told him, but this is not sufficient in the eyes of hadith scholars, since it is possible that the he is not trustworthy in the eyes of others, which is why it is necessary for him to mention the name of the narrator. (See Fath Al-Mugheeth by Al-Sakhawi 1\/263.) Some scholars even argue that If this person was known for being trustworthy, then the scholar wouldn&#8217;t have shied away from mentioning his name.<br \/>\n…and alhamdulillah rab al-alameen.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to RevisitingtheSalaf.org article entitled: Do Shi’as Narrate from a Donkey? The article was published on the 18th of May, 2014, and can be found here. The donkey narration in the most important Shia hadith book <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/05\/29\/response-to-do-shias-narrate-from-a-donkey\/\" title=\"Response to: Do Shi’as Narrate From A Donkey?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-1177","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1177","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1177"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1177\/revisions"}],"predecessor-version":[{"id":1182,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1177\/revisions\/1182"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1177"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1177"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1177"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}