{"id":1197,"date":"2014-06-01T16:56:55","date_gmt":"2014-06-01T16:56:55","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1197"},"modified":"2014-06-01T17:06:45","modified_gmt":"2014-06-01T17:06:45","slug":"response-to-what-does-bakri-mean","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/06\/01\/response-to-what-does-bakri-mean\/","title":{"rendered":"Response to: What does Bakri Mean?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1197\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to RevisitingtheSalaf.org’s article, which is entitled: What does Bakri Mean? The article was published on the 28th of May, 2014, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2014\/05\/what-does-bakri-mean_28.html\" rel=\"external nofollow\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">In this article, RTS fail to provide what they set out to do; define the meaning of the term: Bakri.<\/p>\n<p style=\"text-align: justify;\">They start off by sharing the following thoughts:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In this article we shall define the term &#8216;Bakri,&#8217; and why the followers of the Ahlulbayt (a.s) use this term for our opponents who claim to be adhering to the Sunnah of the Prophet (saw). Bakri is a term used by (classical) Shi&#8217;a and Sunni scholars to describe those who believe in Aboo Bakr&#8217;s appointment by textual sources (Nass), so one can not claim that the Shi&#8217;a use of it is bigoted. Strangely, Shi&#8217;as over the years have become apologetic over this term despite the fact the use of this term can be located in a plethora of ancient works from the Muslims and those of other sects.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS then quote several scholars from both the Sunni and Shia sects that mention the Bakriya as those that have praised Abu Bakr. Here is an example of what RTS had to share:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Sheikh Al-Sadooq:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The author shall be told that the Al-Bakriyya and the Baziya [sic] sects have claimed that the Holy Prophet (saw) has issued statement of appointment (Nass) on the caliphate of Aboo Bakr&#8230;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Kamaaluddin wa Tamaamun Ni&#8217;ma. Pg. # 107.<\/span><\/p>\n<p style=\"text-align: justify;\">However, when we noticed that RTS never quoted any full definitions of what a Bakri really is.<\/p>\n<p style=\"text-align: justify;\">The term &#8220;Bakri&#8221; in the books of Islam is used for several matters, for example those who are from Bakr bin Wa&#8217;il&#8217;s tribe are called Bakriyyah, another example are those who are descendants of al-Khalifah Abu Bakr al-Siddeeq also call themselves &#8220;Bakriyyah&#8221;, the opponent however is speaking of the sect or group called &#8220;Bakriyyah&#8221;, we translate their definition below:<\/p>\n<p style=\"text-align: justify;\">According to Abd Al-Qahir Al-Baghdadi (Al-Farq baina Al-Firaq p. 212-213), they are the followers of Bakr the son of the sister of `Abd Al-Wahid bin Zaid. The man was a deviant who had beliefs like that man is the soul and not the body, that babies do not feel pain, and that anyone that commits a major sin is a hypocrite and a worshipper of Satan. Furthermore, he believed that Ali, Talha, and Al-Zubair committed Kufur and shirk, but will be forgiven because they are from the people of Badr.<\/p>\n<p style=\"text-align: justify;\">Al-Baghdadi also adds that he believed that eating garlic and onions are Haram, and that the sound of gargling in the stomach requires ablution.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar in Lisan Al-Mizan 2\/105 quotes much of the same and adds that Ibn Hazm mentioned his followers as a group from the Khawarij.<\/p>\n<p style=\"text-align: justify;\">It is in this light that we realize that Al-Saduq in his previous statement grouped the Bakriyah and the Ibadhiyah together. It is because both sects are from the Khawarij.<\/p>\n<p style=\"text-align: justify;\">Furthermore, one of the views of the Bakr the son of the sister of Abd Al-Wahid, according to Al-Nawawi, is that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">&#8220;he claims that he (saw) appointed Aboo Bakr by Nass (appointment)&#8230;&#8221;<\/span><br \/>\n<span style=\"color: #800000;\">Source: Saheeh Muslim Sharh Al-Nawawi. Vol. 12, Pg. # 205 &#8211; 206.<\/span><\/p>\n<p style=\"text-align: justify;\">Now, we ask in all fairness:<\/p>\n<p style=\"text-align: justify;\">Is holding one view out of many views sufficient for one to label a person as a follower of a sect?! Do the scholars of Ahl Al-Sunnah believe that babies do not feel pain?! Do scholars of Ahl Al-Sunnah believe that Ali, Talha, and Al-Zubair committed kufur and shirk?! If the answer is no, then one should cease from referring to the followers of Ahl Al-Sunnah as Bakris.<\/p>\n<p style=\"text-align: justify;\">If we check the book &#8220;al-Dibaj&#8221; by Ibn Farhoun, we read in the biography of the scholar Muhammad bin Sahnoun (160-256 AH) that he was reliable, expert jurist, a defender of the Madhab of the people of Madinah and defender of Ahlul-Sunnah. Then the author lists his books and among them is a book called &#8220;al-Radd `ala al-Bakriyyah&#8221; meaning a book in refutation of the Bakriyyah sect, does this mean that Ibn Sahnoun as a Sunni is refuting himself? Well, no&#8230; since the Bakriyyah is a sect with completely different beliefs from Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">RTS mentions a similar case himself but does not analyse nor does he apply intellect, just a copy paste job:<\/p>\n<p><span style=\"color: #800000;\">Al-Dhahabi:<\/span><\/p>\n<p><span style=\"color: #800000;\">Aboo Ja&#8217;far Al-Azdi Al-Dawoodi Al-Maliki, the jurist. he was in Tarabolos of Al-Maghrib and there he taught his book &#8220;Sharh Al-Muwatta,&#8221; then he went to Tilmisaan. He was skillful in eloquency and debates. He has a book called &#8220;Al-Idhaah Fi Al-Radd Alal Bakriyya.&#8221; Learned from him: Aboo Abdul-Malik Al-Barqi and Aboo Bakr ibn Al-Shaikh. He died in Tilmisaan.<\/span><\/p>\n<p><span style=\"color: #800000;\">Source: Tarikh Al-Islam. Vol. 28, Pg. # 57.<\/span><\/p>\n<p style=\"text-align: justify;\">al-Maliki wrote in his book &#8220;al-`Awasim min al-Qawasim&#8221; about the emergence of early sectarian groups, he said that from these groups are the Bakriyyah, `Umariyyah, the `Uthmaniyyah, the `Alawiyyah and the `Abbasiyyah, he said about them:<\/p>\n<p style=\"text-align: justify;\">&#8220;Each of them claiming they are upon truth and that their chosen leader is upon truth while everyone else is an oppressive idiot deprived of goodness. All of these are not acceptable Madhabs, nor do they have legitimate opinions, rather they are all upon idiocy and ignorance, or they&#8217;re infiltrators who wish to spread misguidance and make us a laughing stock for the atheists, they are Satan&#8217;s play thing and he has made them go astray.&#8221;<\/p>\n<p style=\"text-align: justify;\">Then he continues listing their beliefs when it comes to the Khulafa&#8217;, regarding the Bakriyyah he says that they believed that Abu Bakr was appointed, he ruled with justice, and his choices were correct, BUT:<\/p>\n<p style=\"text-align: justify;\">وولي فعدل، واختار فأجاد، إلا أنه أوهم في عمر فإنه أمره غليظ: وفظاظته غلبت. وذكروا معايب، وأما عثمان فلم يخف ما عمل. وكذلك علي<\/p>\n<p style=\"text-align: justify;\">&#8220;However Abu Bakr made a mistake concerning (appointing) `Umar, for he was harsh, and his rudeness got the better of him. Then they mentioned bad things about him. As for `Uthman, what he committed (from sins) is not hidden, and the same is said for `Ali.&#8221;<\/p>\n<p style=\"text-align: justify;\">We ask, is this the belief of Ahlul-Sunnah? Obviously as the author said, these sects were all deviant and they drowned in ignorance and extremism so each would fabricate stories and narrations, especially the `Alawites who were influenced by Ibn Saba&#8217; the Jew and produced today&#8217;s Shia sects.<\/p>\n<p style=\"text-align: justify;\">With such looseness with definitions, perhaps Sunnis can refer to Shias as Mu’atazilites for rejecting that Allah (subhanahu wa ta’ala) can be seen on the day of judgement. Perhaps Sunnis can refer to Shias as Zoroastrians for acknowledging their Imams as holy kings like the Zoroastrians did.<\/p>\n<p style=\"text-align: justify;\">These semantics games are below us and we shall not stoop to such a level when debunking the deceit we find brought up by our opponents. We welcome our opponents to refer to us as Bakris, for it only displays their ignorance and shamelessness.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to RevisitingtheSalaf.org’s article, which is entitled: What does Bakri Mean? The article was published on the 28th of May, 2014, and can be found here. In this article, RTS fail to provide what they set <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/06\/01\/response-to-what-does-bakri-mean\/\" title=\"Response to: What does Bakri Mean?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"class_list":{"0":"post-1197","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1197","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1197"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1197\/revisions"}],"predecessor-version":[{"id":1202,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1197\/revisions\/1202"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}