{"id":1253,"date":"2014-07-01T13:45:22","date_gmt":"2014-07-01T13:45:22","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1253"},"modified":"2015-08-06T21:40:37","modified_gmt":"2015-08-06T21:40:37","slug":"response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-i","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/07\/01\/response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-i\/","title":{"rendered":"Response to: The Oppression of Sayeda Fatima (s.a) Part VII-I"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1253\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The following is a response to RevisitingtheSalaf.org’s article “The Oppression of Sayeda Fatima (s.a) Part VII-I.” The article was published on the 19th of June, 2014, and can be found (<span style=\"color: #800000;\"><a href=\"http:\/\/www.revisitingthesalaf.org\/2014\/06\/the-oppression-of-sayeda-faatima-sa_2037.html\" rel=\"external nofollow\">here.<\/a>)<\/span><\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">It has taken seven irrelevant articles to finally get here, but RTS have finally made it. Finally, they have chosen to write an article discussing the various aspects of the narrations that suggest that Fatima’s house was burned down and that her ribs were broken. However, we suggest renaming the article to something more fitting, like “The Oppression of the Visitors of RevisitingTheSalaf.org” due to the unnecessary length of the article.<\/p>\n<p style=\"text-align: justify;\">Jokes aside, and in typical fashion, the twelvershia.net team will respond to all the relevant evidences, swiftly and painlessly.<br \/>\nBefore even getting to the rebuttal, we would like to point out the first mistranslation that we found in the narration of Saqeefa that was quoted by RTS.<br \/>\nThe narration says:<br \/>\nخالف عنا علي والزبير<br \/>\nThe narration simply says that Ali and Al-Zubair were not present with them. It does not mean that they “opposed us.” RTS, may have purposefully mistranslated this in order to suggest ill will between these parties.<\/p>\n<p style=\"text-align: justify;\">Be aware that in our refutation, we will only be focusing on refuting the relevant material. RTS are infamous for getting sidetracked into discussing issues that are not related to the actual events of the broken rib\/burned house.<br \/>\nThe topics will be discussed in this refutation will be the following:<\/p>\n<p style=\"text-align: justify;\">&#8211; Was the House of Fatima Burned?<br \/>\n&#8211; Did Imam Alee (a.s) give Allegiance Instantly?<br \/>\n&#8211; The Breaking of Zubayrs Sword<br \/>\n&#8211; Shia Narrations from the Book of Sulaym bin Qais<br \/>\n&#8211; The Existence of Hadhrat Mohsin<br \/>\n&#8211; Shia Narrations about the Burning of the House<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #800000;\">Was the House of Fatima Burned?<\/span> <\/strong><\/p>\n<p style=\"text-align: justify;\">1- The narration of Ibn Abd Rabbih in Al-Iqd Al-Fareed: RTS are extremely ignorant for bringing this narration as evidence. Firstly, the narration does not suggest that the house was burned. On the contrary, RTS left out that Ali comes out of the house and pledged allegiance to Abu Bakr right then and there. So, the very narration that RTS quoted goes against the silly suggestion that the house was burned and that Fatima’s ribs were broken.<br \/>\nHowever, being the objective researchers that we are, we need to point out that the narration is disconnected since the author died in the fourth century and did not witness these events. Therefore, we class this narration as weak.<\/p>\n<p style=\"text-align: justify;\">2- The narration of Abul Fida Imad Al-Deen Isma’eel bin Alee in Al-Mukhtasar fi Akbar Al-Bashr: This narration is the same as the previous one.<\/p>\n<p style=\"text-align: justify;\">The author says right after quoting the narration:<\/p>\n<p style=\"text-align: justify;\">كذا نقله القاضي جمال الدين بن واصل، وأسنده إلى ابن عبد ربه المغربي<br \/>\nTranslation: That is how Al-Qadhi Jamal Al-Deen bin Wasil quoted and attributed it to Ibn Abd Rabbih Al-Maghribi.<\/p>\n<p style=\"text-align: justify;\">3- The narration of Al-Baladhuri in Ansab Al-Ashraf: The narration is weak due to the anonymity of Maslama bin Muharib. RTS quoted Ibn Hibban’s inclusion of this narrator in his book Al-Thiqaat, but as we have explained in previous articles, Ibn Hibban was infamous for including people that he does not know in this book. For example, in his book of trustworthy narrators, he said, “Suhail bin Amr, a shaikh that narrates from his father, and Hammam bin Yahya narrated from him. I do not know who he is nor do I know his father.”<br \/>\nThe narration is also weak due to the anonymity of the author of the book, Al-Baladhuri. Ibn Hajar included him in his book of weak narrators, Lisan Al-Mizan. We couldn’t find contemporaries and those that lived in centuries close to him anyone that has mentioned him with praise.<\/p>\n<p style=\"text-align: justify;\">Another weakness in the narration is disconnection, since Ibn Awn died in the year 150 AH and was not an eye witness of the events.<br \/>\nRTS have anticipated the last response above and have countered with an ironic quote from Ibn Hajar:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The Mursal of Tabi&#8217;ee, if he mentioned an occasion that he was not present in, it is called Mursal, even though it is possible that he has heard it actually from a companion that has experienced the occasion. <span style=\"text-decoration: underline;\"><strong>But the thing is that if he has been present in its time,<\/strong><\/span> it is considered as if he actually has heard it or was present in it with the condition that he should be free of Tadlees, and Allah (swt) knows best.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Fath Ul-Bari Fi Sharh Sahih Al-Bukhari. Vol. 9, Pg. # 104 &#8211; 105.<\/span><\/p>\n<p style=\"text-align: justify;\">It seems as though the “academics” that write for the RTS website do not even know what they are quoting. We have bolded and underlined the portion of the quote that is relevant. We find in his biography in Tahtheeb Al-Tahtheeb that he was born in the year 66 AH, which means that he could not have been present at the time, and thus, the quote provided by RTS is used as ammunition against them.<\/p>\n<p style=\"text-align: justify;\">However, they have also quoted another opinion:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Mulla Alee Al-Qari:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">I say: &#8220;Mursal of Al-Tabi&#8217;ee is Hujjah (proof) among the Jumhoor (majority) of scholars, let alone the Mursal of someone about whose companionship (to the Prophet (saw)) there is difference of opinion? (i.e. it is indeed Hujjah).&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Mirqatul Al-Mafatih Sharh Mishkatul Masabih. Vol. 9, Pg. # 434.<\/span><\/p>\n<p style=\"text-align: justify;\">Mullah Ali Al-Qari seems to be referring to the opinion of the Hanafis towards Mursal narrations. For this is indeed a popular opinion within the Hanafi school. On the other hand, we find that all the scholars of Hadith and the majority of the scholars of Fiqh of other Madhabs, hold the opinion that Mursal narrations are not to be accepted (with some exception in some very specific cases). These opinions can be found in the words of Imam Muslim, Al-Tirmithi, Al-Hakim, Al-Khateeb, Ibn Abd Al-Barr, Ibn Al-Salaah, Al-Nawawi, Al-Ala’ee, and others. See Al-Hadith Al-Mursal by Hussah Al-Sagheer 2\/408-410.<\/p>\n<p style=\"text-align: justify;\">Perhaps though, the most ironic thing about this very narration is that Ibn Awn, is not a tabi’ee, but was rather treated as one of the atba’a al-tabi’een. See Al-Thiqaat by Ibn Hibban 3\/4. Therefore, the point that the narrations of the tabi’een are seen as authentic is irrelevant, since he is of an even later level of narrators.<br \/>\nMost importantly, even if we went against our logic and accepted the argument, we find that the narration does not say that Fatima’s house was burned, nor were her ribs broken, but that Ali came out and pledged his allegiance.<\/p>\n<p style=\"text-align: justify;\">4- The narration of Al-Masudi in Muruj Al-Dhahab: The narration is weak since Al-Mas’udi the author was not praised by any scholar of his time. This applies to both Sunni and Shia schools of thought. RTS suggest that he was only weakened because he narrated some narrations that suggest that he was a Shi’ee. However, we maintain our position that he is more of an anonymous narrator, since we could not find scholars weakening him, nor praising him either.<br \/>\nPlus, it should be mentioned that the father of Ibn A’isha is an anonymous narrator.<\/p>\n<p style=\"text-align: justify;\">5- The narration of Al-Ayyashi in his Tafseer: RTS has quoted a Shi’ee narration that is weak, since the chain is both disconnected and from anonymous sources.<\/p>\n<p style=\"text-align: justify;\">6- The narration of Ibn Abi Shaybah in his Musannaf: The narration is weak due to disconnection between Aslam and the events of the narration.<\/p>\n<p style=\"text-align: justify;\">RTS have countered with several arguments. One of them is a quote from Al-Isaba by Ibn Hajar:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Aslam slave of Umar, narrated ibn Munda through Abdul Mun&#8217;em ibn Bashir from Abdul Rahman ibn Zayd ibn Aslam from his father from his grandfather that he travelled with the Messenger of Allah (saw) in two journeys. And it is famous that Umar bought Aslam after the death of the Messenger of Allah (saw). Such is narrated by ibn Ishaq and others, we will mention him again in the third part, if God wants.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Isaba. Vol. 1, Pg. # 130.<\/span><\/p>\n<p style=\"text-align: justify;\">This is not evidence, since even Ibn Hajar, who is quoting this, doubts the merits of this story. He says, “We will mention him again in the third chapter.” Ibn Hajar says in the opening of his book 1\/6, “The third chapter is for those that have been mentioned in the previous books that have seen both the days of Jahiliyah and Islam, and that were not found in narrations that they have met the Prophet (salalahu alaihi salam) or seen him.” This suggests that Ibn Hajar strongly opposes the narration above, for he would have not mentioned him in this chapter if he saw it as authentic. The reason being is that this narration is by Abd Al-Mun’im bin Basheer, who was caught by Yahya bin Ma’een for fabricating narrations. See his biography in Rijal books like Mizan Al-I’itidal or Lisan Al-Mizan.<br \/>\nAnother argument provided by RTS is the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Ishaq sought to testify that Umar bought Aslam during the Hajj campaign which took place in 11 A.H. However, the birth of ibn Ishaq was around 80 A.H and hence there was approximately a 70 year gap between both these personalities between when Aslam was bought and ibn Ishaq&#8217;s birth. So the question is, how did he become a witness to this? How does he constitute those years without being present? And what is his evidence to compensate for them 70 years? It is strange how the opponents find the Mursal hadeeth of Zayd ibn Aslam unacceptable when they have no problem in accepting statements made from ibn Ishaq when we see a massive gap between the lives of Aslam and ibn Ishaq. Do we not see double standards at play here?<\/span><\/p>\n<p style=\"text-align: justify;\">There are no double standards since the narration is connected. Ibn Ishaaq narrated this from Nafi’ who heard it from Ibn Omar that Omar bought Aslam after the death of the Prophet (salalahu alaihi wa salam) during the hajj. See Ma’rifat Al-Sahaba by Abu Nu’aim 1\/255.<br \/>\nThe third argument provided by RTS is another that suggests the acceptability of mursal (disconnected) narrations. They argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"> As we have already discussed Aslam the slave of Umar, we will now analyse his son, Zayd ibn Aslam in regards to his Mursal (hurried) narrations. In the following hadeeth, Zayd bin Aslam has narrated a hadeeth which is mursal (broken) on the authority of the Prophet (saw) despite the fact he was not even born during the Prophet (saw) life, yet is still authenticated as Saheeh! <\/span><\/p>\n<p style=\"text-align: justify;\">RTS, who has very little experience with hadith sciences, is not aware of the meaning of the words of Al-Tirmithi. What Al-Tirmithi is trying to say is that “this narration is more correct” and not “authentic”. He said that a hadith of Abd Al-Rahman bin Zaid bin Aslam from his father from Ata’a from Abi Sa’eed is weaker than the narration of Abdullah bin Aslam from his father. He is implying that the narration should not be connected to Abu Sa’eed in the first place. Such matters are clear to those that are versed with hadith sciences and the science of `ilal.<br \/>\nMore importantly, even if we accepted this narration as authentic, we would have to accept that the house was not burned or the ribs of Fatima were broken, for the narration does not include that, but rather, includes that they all pledged allegiance to Abu Bakr in the end.<br \/>\nRTS continue by quoting narrations that prohibit frightening Muslims. We agree that this is not permissible. However, it does not equate to burning down the house of Fatima, nor do we believe that RTS are satisfied with only this argument.<br \/>\nRTS also quoted a narration that states:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Amr Al-Naqid and ibn Abi Umar from Sufyan ibn Uyayna from Ayoob from ibn Sireen from Aboo Huraira who reported: The Messenger of Allah (saw) said: &#8220;He who points a weapon towards his brother, the angels invoke curse upon him even if he is his real brother so long as he does not abandon it.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Saheeh Muslim. Vol. 2, Pg. # 1211, H. # 125.<\/span><\/p>\n<p style=\"text-align: justify;\">If we believed that this incident occurred, then one could argue that the angels did invoke a curse, which lasted only for a short time, since everyone ended up pledging allegiance to Abu Bakr. However, we reject the narration in the first place, so we do not believe that such a curse was placed upon Omar.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Did Imam Alee (a.s) give Allegiance Instantly?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Two opinions are given. The first is that it was given immediately. This can be found in Mustadrak Al-Hakim #4431 that Abu Bakr said to Ali: O’ cousin of the Messenger (salalahu alaihi wa salam) did you intend to create discord between the Muslims? He said: Don’t blame O’ caliph of the Messenger of Allah (salalahu alaihi wa salam). He then pledged allegiance to him. The chain is authentic.<\/p>\n<p style=\"text-align: justify;\">However, the narrations in the Saheehain have suggested that Ali only gave <em>bay’ah<\/em> six months later, after the death of Fatima. The narrations are clear that he gave <em>bay’ah<\/em> willingly and he was not threatened to do so.<\/p>\n<p style=\"text-align: justify;\">Some scholars have reconciled this by either suggesting that the <em>bay’ah<\/em> took place twice, or that the first narration has a hidden defect.<\/p>\n<p style=\"text-align: justify;\">Regardless, we find it silly that RTS would quote several narrations that Ali gave <em>bay’ah<\/em> during the life of Fatima, then suggest that he only gave it six months after the death of the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">Perhaps RTS should have a clear opinion before attempting to create doubts among both Sunni and Shia readers.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The Breaking of Zubayrs Sword<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">1- The narration of Al-Tabari in his Tareekh: The narration is weak because it comes from the path of Ziyad bin Kulaib who is from the atba’a al-tab’ieen, which makes his narration disconnected.<\/p>\n<p style=\"text-align: justify;\">2- The narration of Al-Muhib Al-Tabari in Al-Riyadh: The narration is weak because it comes from the path of Al-Zuhri who is from the tabi’een, which makes his narration disconnected.<\/p>\n<p style=\"text-align: justify;\">3- The narration of Imam Ahmad in Al-Sunnah: See previous comments about Al-Zuhri for the first part of the narration. The second part is authentic up until Ibrahim bin Abd Al-Rahman bin Awf, who may have been too young to have seen the events of the narration, since it was said that he was an infant during the times of the Prophet (salalahu alaihi wa salam). Regardless, the continuation of the narration from his pass states that Ali and Al-Zubair both say that Abu Bakr is more deserving of the caliphate than they are. See Mustadrak Al-Hakim 4396.<br \/>\n4- The narration of Al-Hakim in Al-Mustadrak: Same as previous.<br \/>\n5- The narration of Ibn Katheer in Al-Bidaya wal Nihaya: Same as previous.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Shia Narrations from the Book of Sulaym bin Qais<\/strong><\/span><br \/>\n<span style=\"color: #333333;\">RTS share their perspective on how one should view the incident of the broken rib\/burned house\/death of Fatima. They first choose to suggest the following:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The book of Sulaym ibn Qays Al-Hilali is connected to the incidents which occurred in the early stages of Islam when the usurpation of Caliphate and the seizing of rulership took place after the Prophet&#8217;s (saw) demise. The book illustrates the lives and attitudes of the Caliphs and contains information that is unavailable in other sources. It was collected by Sulaym ibn Qays who entrusted it to Aban ibn Abi-Ayyash. The book has received endorsement from the Holy Imam (a.s).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Some have also cast doubt about the authenticity of the book. The author is regarded as trustworthy, however, Aban ibn Abi-Ayyash himself remains disputed. This caused many from the later generation to either partially or completely dismiss the book.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Our purpose is not to delve in to the polemics concerning the reliability of the book, rather we would like to give another perspective concerning the attack on the house of Sayeda Faatima (s.a) and the circumstances surrounding the death of the Prophet (saw). This will allow us to resolve a critical puzzle scattered in many Sunni and Shi&#8217;a books about this incident.<\/span><\/p>\n<p style=\"text-align: justify;\">Confusion can be found in the above statement. RTS admits that some have doubted the authenticity of the book, but yet state that the Imam has endorsed it. The latter is false and we demand RTS to provide evidence of this baseless statement.<br \/>\nWe add that Aban bin Abi Ayyash was weakened by Al-Tusi. Ibn Al-Ghadha’iri adds that the Shias suggest that he fabricated the book of Sulaym bin Qays. See Dhu’afa’a Rijal Al-Hadith 1\/134.<br \/>\nIn other words, RTS is quoting narrations that are seen as fabrications, even according to the standards of Shias themselves.<br \/>\nAl-Bahbudi comments, “There is no doubt that the book is fabricated, and there are signs that suggest this: Like that Mohammad bin Abi Bakr (who was an infant at the time) advised his father upon his deathbed and that the Imams are thirteen.” See Ma’rifat Al-Hadeeth p. 359.<br \/>\nThis is the quality of the sources that RTS uses as evidence.<\/p>\n<p style=\"text-align: justify;\">Sulaym bin Qays himself is unknown nor is there any mention of him or any information concerning him in the books of history or Rijal. The correct view upon research is that there was a man known as &#8220;Salm bin Qays al-Hilali&#8221; not &#8220;Sulaym&#8221;, this man was a liar who used to narrate mainly from Anas bin Malik and al-Hasan al-Basri, meaning he is a late narrator and couldn&#8217;t have narrated anything from `Ali himself. Shia scholars claimed he was a companion of `Ali and fabricated a book and attributed it to this man.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The Existence of Hadhrat Mohsin (a.s)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">In this chapter, RTS quote evidence of the existence of Al-Muhsin. Al-Muhsin, often seen in Shia narrations as the stillborn son of Fatima, is used as a plot device in order to inflate the tragic drama surrounding the myth of the broken rib tale.<br \/>\nRTS then quoted the names of the Sunni scholars that suggested that Al-Mohsin died young, after birth. The list includes, Ibn Hazm, Ibn Al-Athir, Al-Muhib Al-Tabari, Al-Bakkari, Ibn Sayyid Al-Naas, Ibn Kathir, Al-Qastalani, Al-Nuwairi, Zakariya Al-Ansari, and Abu Al-Fida’a. We add to this list the name of Ibn Ishaaq (d. 150 AH), who is the Imam of the seerah, and one of the most knowledgeable people when it comes to the biographies of the companions and family of the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">See Al-Thuriyah Al-Tahira by Al-Dulabi p.114.<br \/>\nRTS then mentioned the names of the scholars that believed that Al-Mohsin was a stillborn. The scholars he included in this list were Ibn Abd Al-Hadi Al-Maqdisi, Al-Mizzi, Al-Safoori, Al-Suban, Al-Hamzawi, Al-Fasi, and Al-Safadi.<br \/>\nRTS also includes a quote from Ibn Shahr Ashoub in which he quotes Ibn Qutaibah as being from the second group of scholars.<\/p>\n<p style=\"text-align: justify;\">However, what we find in his book is different, which is why we disregard it, since Ibn Shahr Ashoub is not a trusted scholar.<br \/>\nIt should also be noted that Ibn Abd Al-Hadi has two opinions and that he has included in his book the narration in which the Prophet (salalahu alaihi wa salam) named Al-Mohsin. Refer to his Nihayat Al-Maraam p.58.<br \/>\nNow, due to the apparent difference of opinion between the scholars, we find ourselves obliged to stick with the view of the first party, for several reasons:<br \/>\n1- They are the majority.<\/p>\n<p style=\"text-align: justify;\">2- They are supported by a hadith, that although considered by scholars weak, is not considered a fabrication, in which the Prophet (salalahu alaihi wa salam) names Al-Mohsin, which means that he was born during his lifetime. The opposing view is not supported by weak hadiths.<br \/>\n3- The naming of children rarely ever occurs until after birth, especially in an age in which ultrasounds did not exist.<br \/>\nMost importantly, even if we assumed that Al-Mohsin died a stillbirth, there is no sufficient evidence to suggest that it was from any causes other than natural ones.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Confession of Aboo Bakr and Umar ibn Al-Khattab<\/strong><\/span><br \/>\n<span style=\"color: #333333;\">Under this lengthy chapter, RTS quotes a single narration that includes Abu Bakr saying:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">I wish that I would not have uncovered the house of Faatima (s.a) and left it, even if they would have closed it(to prepare) for a war!<\/span><\/p>\n<p style=\"text-align: justify;\"> RTS has quoted this report from Al-Ahadith Al-Mukhtara 1\/88-91 and other sources.<\/p>\n<p style=\"text-align: justify;\">In response, we simply say that the narration is weak due to the narration of Ulwan bin Dawud. He was described as munkar al-hadith by Al-Bukhari and Ibn Yunus. See Lisan Al-Mizan 4\/218. Sa’eed bin Ufair, his student, referred to him as a zaaqool (a thief).<\/p>\n<p style=\"text-align: justify;\">RTS has anticipated that we would quote the opinions of scholars that have referred to him as munkar al-hadith and have responded with the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Dhahabi:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">&#8220;Not everyone who narrates munkar hadeeth is weak.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Mizan Al-I&#8217;tidal. Vol. 1, Pg. # 259.<\/span><\/p>\n<p style=\"text-align: justify;\">We say in response that there is a difference between a hadith being referred to as munkar, as we find Al-Thahabi doing above, and calling a narrator munkar al-hadith, as we see in the words of Al-Bukhari and Ibn Yunus.<\/p>\n<p style=\"text-align: justify;\">Simply put, it is the difference between calling a meal “bad” as opposed to referring to the chef as ”bad”.<\/p>\n<p style=\"text-align: justify;\">Al-Bukhari himself said, “Everyone I refer to as munkar al-hadith, then it is not permissible to narrate from him.”<\/p>\n<p style=\"text-align: justify;\">Al-Shaikh Abd Al-Azeez Sadhan comments, “One of the harshest terms that Al-Bukhari uses in jarh and ta’deel is him saying about a narrator: Munkar al-hadith.”<\/p>\n<p style=\"text-align: justify;\">RTS though provide another argument by presenting a chain without Ulwan. They quote:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Similar like this and longer than this has been (Narrated ibn Wahab &#8211; Al-Layth bin Sa&#8217;d &#8211; Saleh bin Kaysan &#8211; Hameed bin Abdul-Rahman bin Auf &#8211; Abdul Rahman bin Auf), and it is also reported by Ai&#8217;dh.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Tarikh Al-Islam Wa Wafiyat Ul Mashaheer Wa Al-Alam. Vol. 3, Pg. # 117 &#8211; 118<\/span><\/p>\n<p style=\"text-align: justify;\">RTS also comments:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">It would seem inconceivable that Layth heard the narration from Alwan from Saleh ibn Kaysan and did not enquire about it on his pilgrimage to Hajj, since Saleh ibn Kaysan was a significant scholar of Hijaz like Al-Zuhri and others and since Layth heard from these scholars, he would have undoubtedly asked Saleh ibn Kaysan regarding this specific narration too, especially with Al-Dhahabi mentioning it. In conclusion, the existence of Alwan in some chains does not affect the reliability of this narration.<\/span><\/p>\n<p style=\"text-align: justify;\">In response, we say that Al-Laith has narrated this hadith from Ulwan on at least three different occasions with the inclusion of the name of Ulwan (see next source). Therefore, it is not likely that he heard it directly from Salih bin Kaysan. This is also supported by the fact that Al-Uqaili 4\/50 in his Dhua’afa’ and Al-Daraqutni in his Ilal 1\/214, both stated that this is the hadith of Ulwan. In other words, they do not acknowledge it as the hadith of Al-Layth.<\/p>\n<p style=\"text-align: justify;\">RTS in a last ditch effort, quote a narration from Ansab Al-Ashraf with Al-Haytham bin Adi, who was an infamous liar, in order to strengthen the previous report.<\/p>\n<p style=\"text-align: justify;\">RTS furthermore provide several vague narrations in which the two caliphs express sadness and regret, wishing that they were dead. RTS suggest that this is proof that they broke Fatima’s ribs. However, we do not find any evidence of this in those narrations. It is like suggesting that Mariam the daughter of Imran must have fornicated because she expressed regret and wished death upon herself. Allah (subhanahu wa ta’ala) says in His holy book [Surat Mariam:24]:<\/p>\n<p style=\"text-align: justify;\">قَالَتْ يَا لَيْتَنِي مِتُّ قَبْلَ هَذَا وَكُنْتُ نَسْيًا مَنْسِيًّا<\/p>\n<p style=\"text-align: justify;\">{She said: &#8220;I wish I had died long before this and became forgotten&#8221;}<\/p>\n<p style=\"text-align: justify;\">As we can see, there is no connection between her regret and the foolish accusation.<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #800000;\">Shia Narrations about the Burning of the House<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">The article went into a downward spiral after the previous sections with RTS quoting Shia opinions and Shia narrations in order to substantiate the event. It is important to be aware that RTS was not able to provide any clear evidences from Sunni books that suggest that the event of the broken rib occurred.<\/p>\n<p style=\"text-align: justify;\">First narration by Al-Majlisi from Bihar Al-Anwar: Weak because it comes through the path of Eisa bin Al-Mustafeed, who is anonymous according to Al-Jawahiri (p. 449).<\/p>\n<p style=\"text-align: justify;\">Second narration by Al-Ayyashi in his Tafseer: Weak because the chain is disconnected between him and Amr bin Abi Miqdam.<br \/>\nThird narration by Al-Kulayni in Al-Kafi: The narration is authentic, but does not mention the event, nor does it mention that Abu Bakr and Omar killed Fatima. It only suggests that Fatima is a shaheed. Furthermore, Shias are all shaheed according to the Imam, as we can see in the authentic narration in Al-Kafi 8\/146, even if they die on their beds. This supports the Sunni view that there are those that can be referred to as shaheed even though they did not literally die as martyrs. See Saheeh Muslim #3539. Also in al-Kafi 1\/190 we read chapter called:<\/p>\n<p style=\"text-align: justify;\">في أن الأئمة شهداء الله عز وجل على خلقه<\/p>\n<p style=\"text-align: justify;\">&#8220;Chapter: That the Imams are Shuhada&#8217; of Allah on the people.&#8221;<\/p>\n<p style=\"text-align: justify;\">Shuhahda&#8217; here means witnesses, so how do I know that Fatimah is not a Shaheedah meaning a witness of Allah on his creation?<\/p>\n<p style=\"text-align: justify;\">Fourth narration by Al-Kulayni in Al-Kafi: The narration does not mention anything about the event of the broken rib. All it mentions is the existence of Al-Mohsin and that he was named before birth. However, the chain is weak due to the anonymity of Al-Qassim bin Yahya.<\/p>\n<p style=\"text-align: justify;\">Fifth narration by Al-Kulayni in Al-Kafi: The narration does not mention anything about the event of the broken rib.<\/p>\n<p style=\"text-align: justify;\">Sixth narration by Al-Kulayni in Al-Kafi: The narration is weak due to Al-Mu’alla bin Mohammad. See his biography in Fihrist Al-Najashi.<\/p>\n<p style=\"text-align: justify;\">Seventh narration by Al-Kulayni in Al-Kafi: The narration is weak due to Ali bin Mohammad Al-Hirmizani. See Al-Jawahiri p. 414.<\/p>\n<p style=\"text-align: justify;\">Eighth narration by Al-Khudhaibi in Al-Hidaya Al-Kubra: The chain is disconnected between the author and Al-Mufadhal.<\/p>\n<p style=\"text-align: justify;\">Ninth narration by Al-Hilli in Mukhtasar Basa’ir Al-Darajat: The chain is weak due to the anonymity of Omar bin Furat. See Al-Jawahiri p. 428.<\/p>\n<p style=\"text-align: justify;\">Tenth narration by Al-Mas’oudi in Ithbat Al-Wasiya: The author is anonymous which makes the narration weak.<\/p>\n<p style=\"text-align: justify;\">Eleventh narration of Al-Saduq in Ilal Al-Shara’i’i: See hadith number four.<\/p>\n<p style=\"text-align: justify;\">Twelfth narration by Al-Saduq in Al-Amali: The chain is weak due to Al-Hasan bin Ali Al-Bata’ini and his father Ali bin Abi Hamza Al-Bata’ini, as they have been deemed as liars by Shia hadith scholars.<\/p>\n<p style=\"text-align: justify;\">Thirteenth narration by Al-Saduq in Al-Amali: See previous comment.<\/p>\n<p style=\"text-align: justify;\">Fourteenth narration by Al-Saduq in Al-Khisal: The chain is weak due to Tameem bin Bahloul, who is anonymous. See Al-Jawahiri p. 94.<\/p>\n<p style=\"text-align: justify;\">Fifteenth narration by Ibn Quluwaih in Kamil Al-Ziyarat: The chain is weak due to Abdullah bin Bukair Al-Arjani. See Al-Jawahiri p. 327. RTS argued that the narration is authentic due to the “Kamil Al-Ziyarat rule,” which basically suggests that all the narrations in this book are from reliable narrators. We reject this rule and point out that this is an old view of Al-Khoei, but he decided that this view is false since there is no evidence by the author that he intended this. Refer to Al-Jawahiri’s introduction.<\/p>\n<p style=\"text-align: justify;\">Sixteenth narration by Ibn Quluwaih in Kamil Al-Ziyarat: The chain is weak due to Abdullah bin Abd Al-Rahman Al-Asam. See Al-Jawahiri p. 338.<\/p>\n<p style=\"text-align: justify;\">Seventeenth narration by Al-Khazzaz in Kifayat Al-Athar: The chain is weak due to Abdullah bin Dahir. See Al-Jawahiri p. 333.<\/p>\n<p style=\"text-align: justify;\">Eighteenth narration by Al-Tabari Al-Imami in Dala’il Al-Imamah: The chain is weak due to Abd Al-Rahman bin Bahr who is anonymous. See Al-Jawahiri p. 308.<\/p>\n<p style=\"text-align: justify;\">Nineteenth narration by Al-Tabari Al-Imami in Dala’il Al-Imamah: The chain is weak due to Al-Hassan bin Basheer who is anonymous. See Al-Jawahiri p. 136.<\/p>\n<p style=\"text-align: justify;\">Twentieth narration by Al-Tabari Al-Imami in Dala’il Al-Imamah: The chain is weak due to Mohammad bin Ahmad bin Abi Abdullah who is anonymous.<\/p>\n<p style=\"text-align: justify;\">Twenty-first narration by Al-Tabari Al-Imami in Dala’il Al-Imamah: The chain is weak due to Ali bin Omar bin Hasan and Ja’afar bin Mohammad, who are both anonymous.<\/p>\n<p style=\"text-align: justify;\">Twenty-second narration by Al-Mufeed in Al-Ikhtisaas: The narration is weak due to disconnection and because the grandfather of Amr is unknown.<\/p>\n<p style=\"text-align: justify;\">Twenty-third narration by Al-Mufeed in Al-Ikhtisaas: The narration is weak by Al-Arjani and Al-Asam. The chain was discussed above.<\/p>\n<p style=\"text-align: justify;\">Twenty-fourth narration by Al-Mufeed in Al-Amali: The chain is weak because of Sa’eed bin Ufair who is anonymous according to Al-Jawahiri p. 251.<\/p>\n<p style=\"text-align: justify;\">Twenty-fifth narration by Al-Mufeed in Al-Amali: The chain is weak due to Eisa bin Mihran who is anonymous according to Al-Jawahiri p. 449.<\/p>\n<p style=\"text-align: justify;\">Twenty-sixth narration by Al-Murtadha in Al-Shafi: The chain is weak due to the anonymity of Ahmad bin Amr Al-Bajali. See Al-Jawahiri p. 36.<\/p>\n<p style=\"text-align: justify;\">Twenty-seventh narration by Al-Tusi in his Mukhtasar Al-Shafi: See previous narration.<\/p>\n<p style=\"text-align: justify;\">Twenty-eighth narration by Al-Tusi in Al-Amali: The chain is weak due to Ikrimah.<\/p>\n<p style=\"text-align: justify;\">Twenty-ninth narration by Al-Karajki in Kanz Al-Fawa’id: The chain is weak due to the weakness of Al-Mufadhal bin Omar, who died as a Al-Khattabi (a follower heretical sect). He was weakened by Al-Kashshi, Al-Najashi, and Ibn Al-Ghadha’iri, and there is an authentic narration in Al-Kashshi where the Imam cursed him. See Dhu’afa’a Al-Ruwat by Ibrahim Shaboot p. 563.<\/p>\n<p style=\"text-align: justify;\">Thirtieth narration by Al-Tabrasi in Al-Ihtijaaj: The narration is weak due to disconnection.<\/p>\n<p style=\"text-align: justify;\">Thirty-first narration by Ibn Tawus in Muhj Al-Da’awaat: The narration makes no mention of the killing of Fatima or of the event of the broken rib. It does vaguely mention a cursing of two men, but the narration explicitly says later on that they are Abu Jahl and Waleed, the two greatest enemies of the Prophet (salalahu alaihi wa salam). If the Shias insinuate that the two men are supposed to refer to Abu Bakr and Omar, then they would need clear proof of this.<\/p>\n<p style=\"text-align: justify;\">Thirty-second narration by Ibn Tawus in Iqbal Al-A’amal: There is no chain included from Sa’ad bin Abdullah to Ja’afar Al-Sadiq.<\/p>\n<p style=\"text-align: justify;\">In conclusion, we have found that RTS has failed in providing evidence of the burning of the house\/breaking of the rib of Fatima in both Sunni and Shia sources.<\/p>\n<p style=\"text-align: justify;\">And all praise be to Allah the Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to RevisitingtheSalaf.org’s article “The Oppression of Sayeda Fatima (s.a) Part VII-I.” The article was published on the 19th of June, 2014, and can be found (here.) It has taken seven irrelevant articles to finally get <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/07\/01\/response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-i\/\" title=\"Response to: The Oppression of Sayeda Fatima (s.a) Part VII-I\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[17,18],"class_list":{"0":"post-1253","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-abu-bakr","9":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1253","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1253"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1253\/revisions"}],"predecessor-version":[{"id":1273,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1253\/revisions\/1273"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1253"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1253"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1253"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}