{"id":1262,"date":"2014-07-14T15:50:41","date_gmt":"2014-07-14T15:50:41","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1262"},"modified":"2015-11-11T12:23:12","modified_gmt":"2015-11-11T12:23:12","slug":"response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-ii","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/07\/14\/response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-ii\/","title":{"rendered":"Response to: The Oppression of Sayeda Fatima (s.a) Part VII-II"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1262\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to RevisitingTheSalaf.org’s “The Oppression of Sayeda Fatima (s.a) Part VII-II.” The article was published on the 2nd of July, 2014, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2014\/07\/the-oppression-of-sayeda-faatima-sa_2.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">As the reader can see, this is the second part of our opponent&#8217;s argument, the first part was refuted by us and can be found <a href=\"http:\/\/twelvershia.net\/2014\/07\/01\/response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-i\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">The majority of this article revolves around the <a href=\"http:\/\/twelvershia.net\/2014\/05\/08\/fadak-prophetic-inheritance-qa\/\" rel=\"external nofollow\">Fadak<\/a> issue. For the sake of time, we point interested readers to our own original article which explains away the many misconceptions that surround everything Fadak. In this refutation though, we will only focus on matters that were not mentioned in our original article. Refer to that article <a href=\"http:\/\/twelvershia.net\/2014\/05\/08\/prophetic-inheritance-qa\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">In this article, we will only be focusing on the new arguments that have not been refuted in our original article. We will at times also touch up upon some of the older arguments briefly, before pointing towards our original Q&amp;A article on Fadak. Here are the sections covered in this refutation:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>A- RTS’ “Fadak in the Qur’aan”<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>B- Abu Bakr requesting Fatima to provide Two Witnesses<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>C- Ignorance of RTS regarding Inheritance<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>D- Abu Tufail’s Fadak Narration<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>E- Was Fatima angry with Abu Bakr until her Death?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>F- Fadak in Shia Narrations<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>G- Aboo Bakr and Umar order Khalid to assassinate Alee (a.s)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>H- Did Alee (a.s) Anger Faatima (s.a)?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>I- Umar Attacks the Houses of the Wives of the Prophet (saw)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>J- Umar Threatens To Burn His Son&#8217;s House Down<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>K- Umar Burns the House of a Companion of the Prophet (saw)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>L- Aboo Bakr Orders To Burn the House of the Wife of the Prophet Muhammad (saw)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Without further ado:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>A-Fadak in the Qur’aan<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">RTS quote several narrations in order to prove that Fadak was mentioned in the Qur’an. They quote:<br \/>\n<span style=\"color: #800000;\">&#8220;When &#8216;And give to the near of kin his due&#8217; was revealed, the Messenger of Allah (saw) gave Fadak to Faatima (s.a).&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><span style=\"color: #333333;\">They relied on Al-Haskani’s narrations. Not surprisingly, all these narrations are weak. Due to the length of the chains, we will only point out one weakness with each chain instead of shedding light on the whole chain.<\/span> <\/span><\/p>\n<p style=\"text-align: justify;\">First narration through Abu Sa’eed Al-Khudri: Weak since it is from Attiyyah. We will expand on this later. It is also weak since Attiyyah is a mudalis that used to refer to Ibn Al-Kalbi as Abu Sa’eed. This is the opinion of Imam Ahmad, Ibn Hibban, and Al-Khateeb Al-Baghdaadi. See Mu’jam Al-Mudaliseen p. 331. Ibn Al-Kalbi was a notorious liar. See his biography in Mizan Al-I’itidal. Al-Khateeb said: Attiyyah changed his name in order to make people think he was referring to the tafseer of Abu Sa’eed Al-Khudri. See previous source.<\/p>\n<p style=\"text-align: justify;\">Second narration through Abu Sa’eed: See previous comments.<\/p>\n<p style=\"text-align: justify;\">Third narration through Abu Sa’eed: See previous comments.<\/p>\n<p style=\"text-align: justify;\">Fourth narration through Abu Sa’eed: See previous comments.<\/p>\n<p style=\"text-align: justify;\">Fifth narration through Abu Sa’eed: See previous comments.<\/p>\n<p style=\"text-align: justify;\">Sixth narration through Abu Sa’eed: See previous comments. We add that in this narration, we find that Abu Sa’eed is referred to Al-Khudri instead of Abu Sa’eed, which supposedly negates our previous claim. However, it comes to us through Bakr bin Rustum, which was weakened by Abu Zur’ah in his biography in Al-Jarh wal Ta’deel by Ibn Abi Hatim.<\/p>\n<p style=\"text-align: justify;\">Seventh narration through Ali bin Abi Talib: Weak since it came through the path of Al-Munthir bin Mohammad Al-Qaboosi. He was weakened by Al-Daraqutni. See his biography in Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">Eighth narration through Ibn Abbas: Weak since it comes through Attiyyah, who we will expand on in the next part of our refutation. It also weak since it comes through anonymous narrators like Abdullah bin Manee’.<br \/>\nNinth narration through Abu Sa’eed Al-Khudri in Al-Dur Al-Manthoor: The hadith is rejected since no chain is included.<\/p>\n<p style=\"text-align: justify;\">Tenth narration Ibn Abbas in Al-Dur Al-Manthoor: The hadith is rejected since no chain is included.<br \/>\nEleventh narration in Musnad Abi Ya’la through Abu Sa’eed: Refer to the first narration.<\/p>\n<p style=\"text-align: justify;\">RTS, anticipating our arguments, have gone through the trouble of attempting to strengthen Attiyyah. They have provided the following evidences:<\/p>\n<p style=\"text-align: justify;\">1- He was strengthened by Yahya bin Ma’een.<br \/>\n2- He was strengthened by Ibn Sa’ad.<br \/>\n3- Ibn Hajar referred to him as truthful(Saduq).<br \/>\n4- He was strengthened by Ibn Shaheen.<br \/>\n5- He was strengthened by Al-Ijli.<br \/>\n6- Mohammad Awama stated that Al-Tirmithi saw his hadith as Hasan.<br \/>\n7- Ibn Khuzayma used his narrations in his Book of Tawheed in which he only used authentic reports.<\/p>\n<p style=\"text-align: justify;\">Before even responding to the above, we provide the names of those that have weakened Attiyyah. Mughlatai (see Al-Iktifa’a 3\/229-232) includes the names of the following scholars: Hushaim bin Basheer, Al-Saji, Al-Thawri, Imam Ahmad, Yahya bin Ma’een, Al-Nasa’ee, Al-Ijli, Al-Sa’adi, Ibn Adi, Abu Hatim Al-Razi, Abu Zur’ah, Abu Dawud, and Ibn Hazm. In other words, this is a clear majority. Now, we respond to the points above:<\/p>\n<p style=\"text-align: justify;\">1- As we have pointed above, Yahya bin Ma’een weakened him, and this was related by Al-Uqaili according to Mughlatai. Ibn Shaheen also quoted Ibn Ma’een’s weakened of Attiyyah in his book of weak narrators (p. 273). In Ibn Tahman’s book of questions to Yahya (p. 78), he refers to him as: La ba’sa bihi, meaning that he is &#8220;not bad&#8221;. We can come to the conclusion that Yahya had different opinions of Attiyyah and did not stick to one view.<\/p>\n<p style=\"text-align: justify;\">2- This is correctly attributed to Ibn Sa’ad, and we reject his opinion since it goes against the majority of the scholars of hadith, who are greater in quantity and more knowledgeable than him in this field.<\/p>\n<p style=\"text-align: justify;\">3- We agree with Ibn Hajar regarding Attiyyah’s truthfulness, however, we weaken his reports due to his weakness in narrating. Ibn Hajar said in al-Taqreeb &#8220;Saduq, makes many mistakes, he was a Shi`ee Mudallis&#8221; The fact that he said &#8220;Makes MANY mistakes&#8221; is usually enough to weaken his narration according to the majority of scholars.<\/p>\n<p style=\"text-align: justify;\">4- Ibn Shaheen did not strengthen him, but only quoted the opinion of Yahya. Furthermore, he quoted the opinion of Yahya weakening him too. Refer to the response to the first point above.<\/p>\n<p style=\"text-align: justify;\">5- Al-Ijli’s words refer to Attiyyah’s truthfulness, not his ability to narrate narrations, which is clear from his words.<\/p>\n<p style=\"text-align: justify;\">6- Al-Tirmithi never said that every hadith that is hasan makes the narrator hasan. His definition of a hasan hadith is one that is not shaadh, has supporting chains, and does not include a liar. These conditions fit some of the narrations of Attiyyah. As the reader can see, Attiyyah is never accused of lying by anyone.<\/p>\n<p style=\"text-align: justify;\">7- Ibn Khuzaimah actually weakens Attiyyah but only uses his narrations when the narration is authentic through another chain. Refer to his Saheeh 2\/1139. This is the case with the example provided by RTS, which comes through the hadith Jabir.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>B- Abu Bakr requesting Fatima to provide Two Witnesses<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">RTS quote narrations that are similar to the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Al-Mada&#8217;ini from Sa&#8217;eed ibn Khalid, servant of Khuza&#8217;a from Musa ibn Uqba who said: Faatima (s.a) entered upon Aboo Bakr when he was paid allegiance, she said: &#8220;Umm Ayman and Rabah bear witness for me that the Messenger of Allah (saw) gave me the Fadak.&#8221; Aboo Bakr said: &#8220;By Allah (swt)! There is no one more dear to me than your father, I wished the Judgment Day had happened in the day that he passed away, I prefer A&#8217;isha to encounter poverty rather than your poverty, do you think I give every red and black their rights and I oppress you, while you are the daughter of the Messenger of Allah (saw)? This wealth is for the Muslims. Your father used to appoint people over it and spent it for charity. I will do with it what your father did. Faatima (s.a) said: &#8220;By Allah (swt)! I will not speak to you!&#8221; He said: &#8220;By Allah (swt)! I will not leave speaking with you.&#8221; She said: &#8220;By Allah (swt)! I will pray to Allah (swt) against you.&#8221; He said: &#8220;But I will pray to Allah (swt) for you.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Ansaab Al-Ashraaf. Vol. 10, Pg. # 79.<\/span><\/p>\n<p style=\"text-align: justify;\">They provide several narrations that suggest that Abu Bakr requested witnesses, then attempted to worm his way out of it by asking for more witnesses. However, as we all know in the authentic report in Saheeh Al-Bukhari and other famous Sunni works, none of this happened. Abu Bakr simply rejected Fatima’s claim by providing the narration that the Prophet (salalahu alaihi wa salam) said that he will not have any inheritors.<\/p>\n<p style=\"text-align: justify;\">In response to the narrations provided by RTS we say:<br \/>\nFirst narration by Musa bin Uqba in Ansab Al-Ashraf: Weak due to Sa’eed bin Khalid who was weakened by Al-Bukhari, Abu Zur’ah, Abu Hatim, Ibn Hibban, and Al-Daraqutni. See his biography in Tahtheeb Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">Second narration by Ahmad bin Abd Al-Azeed Al-Jawhari: The narration is weak since it comes through the path of Hisham Al-Kalbi and his father. Both were accused of fabricating narrations. See their biographies in Mizan Al-I’itidal.<\/p>\n<p style=\"text-align: justify;\">Third narration by Al-Balathuri in Futooh Al-Buldan: Weak due to the anonymity of Al-Baladhuri himself and Ja’wana, and also weak due to disconnection.<\/p>\n<p style=\"text-align: justify;\">Fourth narration by Al-Balathuri in Futooh Al-Buldan: Weak due to the anonymity of Al-Baladhuri, Rawh, and “a man”, and disconnection.<\/p>\n<p style=\"text-align: justify;\">Fifth narration by Al-Fakhr Al-Razi: Weak due to absence of chain.<\/p>\n<p style=\"text-align: justify;\">Sixth narration by Al-Hamawi: Weak due to absence of chain.<\/p>\n<p style=\"text-align: justify;\">Seventh narration by Al-Mohib Al-Tabari: Weak due to absence of chain.<\/p>\n<p style=\"text-align: justify;\">Eighth narration by Ibn Shabbah: The chain includes Al-Numairi bin Hassaan, who is anonymous. Plus, the hadith is disconnected.<\/p>\n<p style=\"text-align: justify;\">Ninth narration by Al-Sarkhasi: Weak due to absence of chain.<\/p>\n<p style=\"text-align: justify;\">Tenth narration by Ibn Hazm: Weak due to absence of chain.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>C- Ignorance of RTS regarding Inheritance<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">RTS, in this chapter, quote narrations that suggest that the Prophet (salalahu alaihi wa salam) left behind several things. We will quote some of these narrations before providing the understanding of RTS:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Bukhari:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Isa bin Tahman: Anas brought out to us two worn out leather shoes without hair and with pieces of leather straps. Later on Thabit Al-Banani told me that Anas said that they were the shoes of the Prophet (saw).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Abu Burda: A&#8217;isha brought out to us a patched wool Len garment, and she said, &#8220;(It chanced that) the soul of Allah&#8217;s Messenger (saw) was taken away while he was wearing this.&#8221; Abu-Burda added, &#8220;A&#8217;isha brought out to us a thick waist sheet like the ones made by the Yemenites, and also a garment of the type called Al-Mulabbada.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Saheeh Al-Bukhari. Pg. # 766, H # 3107 \/ 3108<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Kathir:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">As for the mule, it was grey…and it is said that it lived after him (saw) and it was with Alee ibn Abi Talib (a.s) during his caliphate.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Bidaya Wa An-Nihaya. Vol. 8, Pg. # 381.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS then argue the following:<br \/>\n<span style=\"color: #800000;\">Taking all this evidence in to consideration, how is it possible for one to deny that the Prophet (saw) did not leave behind any inheritance? Then what was this property so often referred to? More importantly, all this was left in the hands of the kin of the Prophet (saw) with the exception of Anas who was his servant. <\/span><\/p>\n<p style=\"text-align: justify;\">We ask the objective reader if this understanding of RTS fits with the idea of inheritance. Why did Anas and A’isha inherit material possessions of the Prophet (salalahu alaihi wa salam) instead of more worthy inheritors like Fatima, Al-Hasan, and Al-Hussain? The simple answer is that these materials were not inherited by them, but whatever was left behind by the Prophet (salalahu alaihi wa salam) was spread throughout the Muslims. This applies to Fadak as well, as we have covered in our Q&amp;A section of our original Fadak article. Refer to it for more on the subject. Furthermore RTS quotes narrations of the mule of the prophet (saw) being with `Ali, then after `Ali died it was with `Abdullah bin Ja`far, we ask does `Abdullah inherit `Ali? Obviously he doesn&#8217;t, `Ali&#8217;s children are the ones who are supposed to inherit him, nor do we read anything about a mule being left behind for inheritance in `Ali&#8217;s will, neither in Sunni nor Shia books. This all shows that these possessions were not inherited, rather the nation just took care of the prophet&#8217;s (saw) belongings until `Umar bin `Abdul-`Aziz collected them in a room for preservation, not inheritance.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">One should also take note that Ahmad ibn Hanbals authentic narration above mentions a variety of things that Alee (a.s) received from what the Prophet (saw) had left behind, to which Abbas also wanted a share. The narration does not reveal what those things were, but from the continuous dispute of Abbas in front of Aboo Bakr, Umar and Uthman we can safely assume what was left was worthy enough to dispute about.<\/span><\/p>\n<p style=\"text-align: justify;\">This has been explained in detail in our Fadak article. We point our readers to it for the sake of time, and in fear of repetition.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>D- Abu Tufail’s Fadak Narration<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated to us Abdullah ibn Muhammad ibn Abi Shayba and I heard it from Abdullah ibn Abi Shayba too who said: Narrated to us Fudhayl from Al-Waleed ibn Jumai from Abil Tufayl who said: When the Messenger of Allah (saw) died, Faatima (s.a) sent word to Aboo Bakr saying: &#8220;Have you inherited from the Messenger of Allah(saw) or his family?&#8221; He said: &#8220;No, rather his family.&#8221; She said: &#8220;Then where is the share of the Messenger of Allah (saw)?&#8221; Aboo Bakr said: &#8220;I heard the Messenger of Allah (saw) say: &#8216;If Allah (swt) grants some wealth to a Prophet, then takes his soul, He grants it to the one who takes charge after him.&#8217; So I have decided to give the benefit of it to the Muslims.&#8221; She said: &#8220;You and what you heard from the Messenger of Allah (saw) know.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #333333;\">This has been explained in detail in our Fadak article. We point our readers to it for the sake of time, and in fear of repetition.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #333333;\">In short, the narration, even though Hasan, contradicts the Saheeh narrations in the subject in more than one area. A Hasan Hadith cannot be accepted if found contradicting a Sahih, this narration not only has one &#8220;Saduq&#8221; narrator, it has two Saduq narrators, making it lesser than the usual &#8220;Hasan&#8221; Hadith, on top of it abu al-Tufayl was 8 years of age when the Prophet (saw) passed away, making him 8 years of age when he heard of this event, so it&#8217;s possible that he misunderstood a word or narrated from his understanding rather than the accurate word for word narrative found in the Hadith of the senior companion.<\/span><\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">E- Was Fatima angry with Abu Bakr until her Death?<\/strong><\/p>\n<p style=\"text-align: justify;\">Even though this narration can be found in the Saheehain, some scholars, like Al-Bayhaqi, have suggested that the anger of Fatima was only ascribed to her by Al-Zuhri, who never witnessed these events. Sunni scholars argued that even though the hadith can be found in the Saheehain, it was narrated in disconnected form, which causes it to fall outside the conditions of the authors of the Saheehain.<\/p>\n<p style=\"text-align: justify;\">However, RTS has argued that this conclusion is false:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In the science of Hadeeth Idraaj (interpolation) takes places when a sub narrator gives his opinion in the narration. Thus the words &#8220;Faatima (s.a), the daughter of Allah&#8217;s Apostle (saw) got angry and stopped speaking to Aboo Bakr, and continued assuming that attitude till she died&#8230;&#8221; are said to be the words of Zuhri. Therefore, we should find the masculine arabic term (قال ‚&#8217;He said&#8230;&#8217;) as opposed to  (قالت  &#8216;She said&#8230;&#8217; ) contained within the narration. Let us examine if these words are from A&#8217;isha or Zuhri.<\/span><\/p>\n<p style=\"text-align: justify;\">They continued:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Bayhaqi said that the Idraaj (interpolation) of the narration, is from the point of the text, &#8220;And she lived for&#8230;&#8221; till the the remainder of the text. However, these words appear after &#8220;Faatima (s.a), the daughter of Allah&#8217;s Apostle (saw) got angry and stopped speaking to Aboo Bakr, and continued assuming that attitude till she died.&#8221; This shows that this is clearly not the opinion of Zuhri as claimed by Al-Bayhaqi.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The only subnarrator that has narrated it from ibn Shahab Al-Zuhri with the addition of the word قال (he said) is Mo&#8217;ammar, but we also found that he has narrated it also as قالت (she said) elsewhere, i.e. She said (A&#8217;isha) said: &#8220;Faatima (s.a) was angered&#8230;&#8221; <\/span><\/p>\n<p style=\"text-align: justify;\">RTS then provide narration with the words “she said” in order to prove that it was indeed A’isha who said these things.<\/p>\n<p style=\"text-align: justify;\">Firstly: The narration of Ma’amar from Al-Zuhri by Al-Marwazi. RTS provided a chain from Al-Marwazi, from Ibn Zanjawaih, from Abd Al-Razaq from Ma’amar from Al-Zuhri. This chain is authentic. However, it contradicts what we find in Musanaf Abd Al-Razzaq itself #9774, in which we find the words “he said,” implying Al-Zuhri. The same is found through Abdullah bin Mohammad from Hisham from Ma’amar in Saheeh Al-Bukhari #6230, and Mustakhraj Abi Awana #5376 through two chains from Abd Al-Razzaq from Ma’amar. It is safe to say that what we find in Al-Marwazi’s book is an error by either the author, Ibn Zanjawaih, or a scribe.<\/p>\n<p style=\"text-align: justify;\">Secondly: The narration of Saleh bin Kaisan from Al-Zuhri by Al-Bukhari and Musnad Ahmad. The narration of Saleh does not attribute the anger of Fatima until her death to Al-Zuhri, but mentions it as a continuous report. It does not include the terms “he said” or “she said” at that point.<\/p>\n<p style=\"text-align: justify;\">Thirdly: The narration of Uqail from Al-Zuhri in Musnad Ahmad. Like the previous narration, we find it as a continuous report. However, RTS failed to mention that Saheeh Muslim #2713 includes the words “he said,” implying that it is an addition by Al-Zuhri.<\/p>\n<p style=\"text-align: justify;\">Fourthly: The narration of Shoiab from Al-Zuhri. Like the previous two cases, we find it as a continuous report.<\/p>\n<p style=\"text-align: justify;\">Fifthly: The narration of Mohammad bin Abdullah bin Muslim from Al-Zuhri. Like the previous cases, we find it as a continuous report. However, Mohammad bin Abdullah is weakened by many scholars, and we do not see his narration as binding evidence.<\/p>\n<p style=\"text-align: justify;\">Sixthly: The narration of Al-Waleed bin Mohammad from Al-Zuhri. Like the previous cases, we find it as a continuous report. However, Al-Waleed bin Mohammad is extremely weak and we don’t find his narrations as binding evidence.<\/p>\n<p style=\"text-align: justify;\">RTS conclude:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">As evidenced, the objection that those words are actually the words of Al-Zuhri and not A&#8217;isha is rather baseless. The one chain through Mo&#8217;ammar does not stand a chance against the other five Saheeh chains narrated by Al-Zuhri. Even so, the one chain through Mo&#8217;ammar has also been narrated in another form which clearly shows that those words do indeed belong to A&#8217;isha.<\/span><\/p>\n<p style=\"text-align: justify;\">We choose to stick to the view of Al-Bayhaqi and reject the conclusion provided by RTS. We hold the view that none of the narrations include the words “she said” except for one narration attributed to Ma’amar, which we believe is a mistake, as we have proven above. Out of the four reliable narrators from Al-Zuhri, we find that Ma’amar’s narration has without a doubt used the words “he said,” while Shoaib’s and Saleh’s narrations do not include this narration. Uqail’s narration has one version that supports the narration of Ma’amar, even though there are conflicting narrations from Uqail that suggest that he narrated it as a continuous narration.<\/p>\n<p style=\"text-align: justify;\">As we know from the methodologies of the early hadith scholars in accepting the additions of reliable narrators, if one Hafiz narrates an addition, it is seen as acceptable. This is the case with Ma’amar, who is one of the strongest students of Al-Zuhri. Plus, it is supported by one of the narrations of Uqail, and we do not believe that it was a coincidence that it was attributed to Uqail with the same version that it was attributed to Al-Zuhri unless it was truly narrated by Al-Zuhri.<\/p>\n<p style=\"text-align: justify;\">RTS then chose to play another game. They submit that the attribution of the addition to Al-Zuhri is accurate for the sake of the argument, but then suggest that disconnected narrations by Al-Zuhri are reliable.<\/p>\n<p style=\"text-align: justify;\">RTS first bring evidences for the reliability of the disconnected narrations of the Tabi’een by quoting Ibn Hajar and Mulla Ali Qari. We have refuted these two quotes in part one of our article, so there is no need to repeat ourselves.<\/p>\n<p style=\"text-align: justify;\">Then, they quote the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Khatib Al-Baghdadi:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Yaqoob ibn Sufyan said: I heard Ja&#8217;far ibn Abd Al-Waheed Al-Hashimi saying to Ahmad ibn Salih that Yahya ibn Sa&#8217;eed said: &#8220;The Mursal (hurried) of Al-Zuhri is unreliable.&#8221; Ahmad got angry and said: &#8220;What does Yahya know about the knowledge of Zuhri? That which Yahya said is untrue!&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Kifaya. Pg. # 386.<\/span><\/p>\n<p style=\"text-align: justify;\">Ja’afar bin Abd Al-Wahid Al-Hashimi is a liar. See his biography in Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">RTS continue to explain the concept of idraaj and how all mudraj reports are to be accepted in Saheeh Al-Bukhari:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The criticism of Zuhri has been recorded in Tarikh Kabir of Bukhari. However, despite this, Bukhari still deemed him as proof to have recorded from him in his authentic works. Al-Bukhari, being a hadeeth scientist himself would have undoubtedly taken Zuhri&#8217;s Idraaj in to consideration before including it into his &#8216;Saheeh&#8217; (Authentic) collection.<\/span><\/p>\n<p style=\"text-align: justify;\">This is false. Al-Bukhari has mentioned disconnected reports in his book. Are those to be accepted as reliable as well? Al-Bukhari has referred to his book as Al-Jami’ Al-Saheeh Al-Musanad min hadeethi Rasoolillah, implying that the connected reports to the Prophet (salalahu alaihi wa salam) are authentic. This does not apply to narrations of the sahaba or tabi’een, or disconnected reports, which is why scholars have never made a big deal out of criticizing such reports, even though they are very obviously weak.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Having said that, the Idraaj from Al-Zuhri, is of the permissible type whereby he added his explanation of the Ghareeb words contained in the hadeeth. Thus, it is correct to say, to add something from oneself in the text of a hadeeth is Haraam.<\/span><\/p>\n<p style=\"text-align: justify;\">We are not talking about the permissibility of explaining a narration, but rather, whether such additions are seen as binding evidence or not. In this case, it is not, since it isn’t simply an explanation of terms of a hadith, but a recounting of an actual historic event, which is not based on an eye-witness account.<\/p>\n<p style=\"text-align: justify;\">Carrying on, RTS provide an addition narration in which Fatima dies angry with Abu Bakr and Omar. RTS quote:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Alee ibn Isa from Abdul Wahab ibn Ata from Muhammad ibn Amr from Abi Salama from Abi Huraira who said: Faatima (s.a) came to Aboo Bakr and Umar and she asked to give her, her share of inheritance from the Messenger of Allah (saw). They both said: We heard the Messenger of Allah (saw) saying: &#8220;I do not leave property to be inherited.&#8221; She (s.a) said: &#8220;By Allah (swt)! I will not talk to you both forever.&#8221; And then she died and did not speak with them.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narration has been graded Saheeh (Authentic) by Al-Albani. Aboo Isa has added the meaning of &#8220;I will not talk to you both&#8221; is that I will not talk to you about this property forever, you both are right. And this Hadeeth (i.e. I do not leave property&#8230;) is narrated in another form from Aboo Bakr from the Messenger of Allah (saw).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Saheeh Sunan Al-Tirmidhi. Vol. 2, Pg. # 214, H. # 1609.<\/span><\/p>\n<p style=\"text-align: justify;\">Al-Albani is referring to two different narrations that he strengthened due to their agreement in the content attributed to the Prophet (salalahu alaihi wa salam). However, the second narration, which is our focus, is the only one that includes that Fatima swore to not talk to them forever. The second narration, which includes this addition, only comes to us through the path of Ali bin Eisa, who is Al-Bazzar Al-Baghdaadi. He was not known by the scholars of hadith and Al-Khateeb in his History of Baghdaad is not sure if he is the shaikh of Al-Sami or another anonymous shaikh.<\/p>\n<p style=\"text-align: justify;\">Carrying on, RTS demonstrate their shamelessness by using double standards. They argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The Nawasib also seek to suggest Aboo Bakr spoke to Bibi Faatima (s.a) on her deathbed until she (s.a) was pleased with him. Why would the need to seek the pleasure of Sayeda Faatima (s.a) arise if she (s.a) was not angry with Aboo Bakr and had agreed to the verdict of the two? Or was it that she considered them to be non-Muslim as she remained angry for all those days?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Bayhaqi:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Shu&#8217;ba: When Faatima (s.a) became ill, Aboo Bakr came to her and asked for permission to enter. So Alee (a.s) said, &#8220;O Faatima (s.a)! This is Aboo Bakr asking for permission to enter.&#8221; She answered, &#8220;Do you want me to give him permission?&#8221; He said, &#8220;Yes.&#8221; So she allowed him (to enter), and he (Aboo Bakr) came in seeking her pleasure, so he told her: &#8220;By Allah (swt)! I only left my home and property and my family seeking the pleasure of Allah (swt) and His Messenger (saw) and you, O Ahlulbayt (a.s).&#8221; So he talked to her (s.a) until she was pleased with him.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Sunan Al-Bayhaqi. Vol. # 6, Pg. # 30.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Also recorded in Al-Bayhaqi Al-Sunan Al-Kubra, Dala&#8217;il Al-Nubuwwa. It is narrated with a good (Hasan) chain. Muhibb Al-Din Al-Khatib in Al-Riyad Al-Nadira. And Dhahabi has said concerning this narration in Siyar A&#8217;lam Al-Nubala<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Note: Al-Bayhaqi, ibn Kathir, and ibn Hajar all authenticate this hadeeth and ibn Kathir states it as Saheeh in his Al-Bidayah and ibn Hajar in his Fath Al-Bari has said the mursal of Shu&#8217;ba is authentic.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">On the other hand, we find other Scholars disregarding the Mursal of Shu&#8217;ba.<\/span><\/p>\n<p style=\"text-align: justify;\">Notice how RTS recently suggested that all disconnected narrations are acceptable, and they did this by quoting Ibn Hajar and Mulla Ali Qari, but now went against this view, since it conflicts with their goal.<\/p>\n<p style=\"text-align: justify;\">Al-Ijli explained: The mursal of Al-Sha’abi is authentic; he barely narrates disconnected narrations unless they were saheeh. See Ma’rifat Al-Thiqat by Al-Ijli.<\/p>\n<p style=\"text-align: justify;\">We are not quoting these words in order to suggest that disconnected reports are binding upon Muslims, but rather, that there are degrees within disconnected reports, and that some disconnected reports are stronger than others. We are also pointing this out in order to show the deception and inconsistency of RTS, for they are switching their stances on disconnected reports in order to establish their arguments. We, on the other hand, accept disconnected reports as having weakness, even though we admit that there are degrees of weakness within them.<\/p>\n<p style=\"text-align: justify;\">Note: RTS are so incompetent that they refer to the famous Tabi’ee Imam `Amir Al-Sha’bi as &#8220;Al-Shu’ba&#8221;, as you all know Shu`bah bin Hajjaj is a completely different person but RTS has no idea what they&#8217;re copying.<\/p>\n<p style=\"text-align: justify;\">RTS then argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">To bear a grudge for such a long period of time proves Faatima (s.a) did not consider them to be Muslim during that time period. And it is not permitted for a Muslim to be angry with another Muslim for more than three days!<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Bukhari:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Anas bin Malik: Allah&#8217;s Apostle (saw) said, &#8220;Do not hate one another, and do not be jealous of one another, and do not desert each other, and O Allah&#8217;s (saw) worshipers! Be brothers. Lo! It is not permissible for any Muslim to desert (not talk to) his brother (Muslim) for more than three days!&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Saheeh Al-Bukhari. Pg. # 1519, H. # 6065.<\/span><\/p>\n<p style=\"text-align: justify;\">This is a foolish argument by RTS. Firstly, the daughter of the Prophet (salalahu alaihi wa salam) was not a man to socialize with other men, in order for one to assume that she deserted them. Fatima only approached them as the official government, not as a group of friends that she used to “hang out” with. Secondly, deserting a Muslim is not a form of takfeer upon them. Thirdly, even for the sake of the argument that Abu Bakr stole the land of Fatima, it does not take him outside the fold of Islam, so to assume that this is takfeer is non-sense.<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">F- Fadak in Shia Narrations<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS provided two narrations that support their fictitious retelling of the Fadak story. However, both narrations are weak.<\/p>\n<p style=\"text-align: justify;\">The first comes from the Tafseer of Ali bin Ibrahim Al-Qummi, which was falsely attributed to its author. See Buhooth fi Ilm Al-Rijal p. 428. The book was criticized for the anonymity of the author. We at twelvershia.net have another problem with the book, which is that it is filled with authentic narrations that support that idea that the Qur’an has been tampered with. Perhaps RTS supports this view, which is why they would champion this book.<\/p>\n<p style=\"text-align: justify;\">The other book is the book of Sulaym bin Qais, which we have discussed in the first part of this refutation.<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">G- Aboo Bakr and Umar order Khalid to assassinate Alee (a.s)<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS quote the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Aboo Bakr Al-Khallal:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated to me Muhammd ibn Alee from Al-Athram who said: I heard Aba Abdullah (i.e. Ahmad ibn Hanbal) when the hadeeth of Uqail from Al-Zuhri from Urwa from A&#8217;isha from the Prophet (saw) was mentioned to him about Alee (a.s) and Al-Abbas, and from Uqail from Al-Zuhri that Aba Bakr ordered Khalid about Alee (a.s), Aboo Abdullah said: &#8220;How?&#8221; When he understood it, he said: &#8220;I do not like to write down Hadeeth like this.&#8221;<\/span><br \/>\n<span style=\"color: #800000;\">Footnote: The chain to Ahmad is Saheeh (Authentic).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Sunnah of Aboo Bakr Al-Khallal. Vol. 3, Pg. # 505<\/span><\/p>\n<p style=\"text-align: justify;\">They then state:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We see how Ahmad ibn Hanbal chooses to ignore the narrations regarding this incident, and how the truth is hidden on disagreements between the Sahaba.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">This example, and what we have evidenced makes it crystal clear that in order to find out the truth from the books of the so-called &#8216;Ahl ul Sunnah,&#8217; one must not accept blindly what is narrated but dig deeper and search very carefully to join all the pieces of the puzzle together.<\/span><\/p>\n<p style=\"text-align: justify;\">It should be noted that the narration is disconnected, since we do not know who narrated this hadith from Uqail. This is clear from the chain.<\/p>\n<p style=\"text-align: justify;\">Ahmad’s attitudes towards these fabrications are common in both the Sunni and Shia schools. Sunnis do have the freedom of choice as to whether to write fabrications. Shias too have turned a blind eye to narrations that they deemed as fabrications, which is why we barely see any narrations in praise of the companions of the Prophet (salalahu alaihi wa salam) in their books.<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">H- Did Alee (a.s) Anger Faatima (s.a)?<\/strong><\/p>\n<p style=\"text-align: justify;\">The famous narration that documents this event is the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Bukhari:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Abul Yamaan from Shu&#8217;aib from Al-Zuhri from Alee ibn Al-Hussain from Al-Miswar bin Makhrama: Alee (a.s) demanded the hand of the daughter of Aboo Jahl. Faatima (s.a) heard of this and went to Allah&#8217;s Messenger (saw) saying, &#8220;Your people think that you do not become angry for the sake of your daughters. Alee (a.s) is now going to marry the daughter of Aboo Jahl.&#8221; On that, Allah&#8217;s Messenger (saw) got up after his recitation of Tashahhud. I heard him saying, &#8220;Then after! I married one of my daughters to Aboo Al-As bin Al-Rabi (the husband of Zaynab, the daughter of the Prophet (saw) before Islam) and he proved truthful in whatever he said to me. No doubt, Faatima (s.a) is a part of me, I hate to see her being troubled. By Allah (swt)! The daughter of Allah&#8217;s Messenger (saw) and the daughter of Allah&#8217;s (swt) enemy cannot be the wives of one man.&#8221; So Alee (a.s) gave up that engagement.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Saheeh Al-Bukhari. Pg. # 917, H. # 3769.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS comment:<br \/>\n<span style=\"color: #800000;\">As recorded in Bukhari and many other books of our opponents, the Prophet (saw) said:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The Messenger of Allah (saw) said: &#8220;Faatima (s.a) is part of me, whoever angers her, angers me.”<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The Nawasib have attempted throughout history to attribute the merits of Ahlubayt (a.s) to their enemies and the vilifications of their enemies to them. Among the many fabricated stories told against Imam Alee (a.s) was that he had asked for Aboo Jahl&#8217;s (the chief of infidels) daughter&#8217;s hand in marriage. When this news reached Sayeda Faatima (s.a), she rushed to her father who found out the falsity of the story and thus the Prophet (saw) said these words. The aim of fabricating this story was to divert the attention from the people who in reality angered Sayeda Faatima (s.a), and put Imam Alee (a.s) under the spotlight as the one who did so.<\/span><\/p>\n<p style=\"text-align: justify;\">They provide the following reasons for weakening the narration of Miswar bin Makhrama, yet most of these arguments are irrelevant:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">•    Al-Miswar mentions that at the time when the Prophet (saw) narrated the hadeeth in the Masjid, he was Muhtalim (i.e. impure as a result of wet dreams, or nocturnal emissions), which evidences the fact he had already reached the age of puberty, yet he was present in the Masjid in such an impure state!<\/span><\/p>\n<p style=\"text-align: justify;\">RTS are ignorant that the term Muhtalim refers to an age group, not a person in a greater state of impurity. See Tahtheeb Al-Lugha 1\/908. More importantly, even if we accepted that he was in such a state, it is not evidence to reject his narration.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• The hadeeth through Alee ibn Al-Hussain (a.s) from Al-Miswar contains the story of the sword, which does not make any sense, and the efforts of commentators like ibn Hajar to make sense out of that nonsense is helpless.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS are purposefully being vague by not providing why the story of the sword does not make any sense. Even if RTS do not understanding Al-Miswar’s rationality behind his words, it is not enough to reject his narration.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• The hadeeth through ibn Al-Zubayr is apparently taken from Al-Miswar.<\/span><\/p>\n<p style=\"text-align: justify;\">No proofs are provided to support this claim.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• The hadeeth through ibn Abi Mulaika from Al-Miswar contains the story of Banu Hisham ibn Al-Mughira asking the Prophet (saw) for permission to marry their daughter off to Imam Alee (a.s), but the other versions do not mention that.<\/span><\/p>\n<p style=\"text-align: justify;\">We do not see how this contradicts the narration. It is only natural for the family of the daughter of Abu Jahl (or any family) to ask the Prophet (salalahu alaihi wa salam) if he is alright with daughter being a second wife.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Some versions do not mention the story of the proposal, only the part that the Prophet(saw) says that &#8220;Faatima (s.a) is part of me…&#8221; is mentioned.<\/span><\/p>\n<p style=\"text-align: justify;\">This does not weaken the longer version since narrators sometimes shorten hadiths. RTS needs to provide evidence that the longer version is fabricated for us to accept their claim.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• The Prophet (saw) mentions one of his Mushrik son-in-laws and praises him by saying, &#8220;I married one of my daughters to Aboo Al-As bin Al- Rabi and he proved truthful in whatever he said to me,&#8221; hence what is being proposed is that Alee (a.s) was not as such.<\/span><\/p>\n<p style=\"text-align: justify;\">Abu Al-Aas is a known convert to Islam. As for the praise towards Abu Al-Aas, then it is unconnected to Ali, and it is only RTS’ understanding that everything in Sunni Hadith is a hint against Ali is their own problem.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• The Prophet (saw) knew what Alee (a.s) is doing is Halaal, thus he says: &#8220;I do not make anything lawful, unlawful&#8230;&#8221; yet contrary to this statement, he (saw) forbids it for Imam Alee (a.s)!<\/span><\/p>\n<p style=\"text-align: justify;\">Scholars have provided explanations that include the view that he did not literally declare it as haram, but only condemned it, in order to preserve the feelings of his daughter.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Aboo Hanifa finds narrating this incident as an insult to Imam Alee (a.s). So how is it possible that the grandson of Imam Alee (a.s), Alee ibn Al-Hussain (a.s) narrates this story proudly and does not see it as an insult to his grandfather?!<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is an everlasting merit for Fatima, when on the other hand; it is only a temporary condemnation of Ali. This is clear especially since we know that Ali let go of the idea of marrying the daughter of Abi Jahl.<\/p>\n<p style=\"text-align: justify;\"> RTS then provide another argument. They quoted Ibn Hajar:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Hajar:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Hadeeth of Al-Miswar and Marwan was mentioned before in two forms from Al-Zuhri and it was mentioned at the beginning of the book of Al-Shurut, under the story of the peace treaty of Al-Hudaibiyya that Al-Zuhri has narrated it from Urwa from Al-Miswar and Marwan from the companions of the Prophet (saw), so it becomes obvious that in other places where it doesn&#8217;t mention, &#8220;from the companions of the Prophet (saw),&#8221; that it is in Mursal form because Miswar was younger than that to have witnessed the occasion, and Marwan is younger than him. Yes, Miswar was at an age to be able to discern in the occasion of Hunain, and he has memorized the story of proposal of Alee (a.s) to the daughter of Abi Jahl which happened around that time. Allah (swt) knows best.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Fath Ul-Bari Fi Sharh Saheeh Al-Bukhari. Vol. 9, Pg. # 432.<\/span><\/p>\n<p style=\"text-align: justify;\">They then commented:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">It is interesting how ibn Hajar says that Al-Miswar was younger than that to be able to have witnessed and understood the story of Hudaibiyya by himself and that he rather heard it from other companions of the Prophet (saw), but two years later he was mature enough to discern all things on the occasion of Hunain in the 8th year after Hijra and the story of the proposal of Imam Alee (a.s) to the daughter Abi Jahl around that time.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We ask, what was his criteria and tool to conclude this and make it a fact?<\/span><\/p>\n<p style=\"text-align: justify;\">Ibn Hajar gives his reasons. He said that Al-Miswar narrated a narration from Sulh Al-Hudaibiya through other companions, while he did not do the same with the narration about the daughter of Abu Jahl incident. It seems that RTS did not understand what they were quoting.<\/p>\n<p style=\"text-align: justify;\">RTS do not provide any other reasons to reject the narration other than point to scans that state that he was eight years old at the time. As we all know, it is fine to narrate as such an age, and Shias do accept this since they accept that Al-Hasan and Al-Hussain were both younger than Al-Miswar, and yet, they narrated from the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">RTS also seem to suggest that Al-Miswar could not have been a muhtalim while being only eight years old. However, as Ibn Hajar said, this could be understood as a metaphor for one who is young but has the ability to discern.<\/p>\n<p style=\"text-align: justify;\">As for Ibn Al-Zubair, RTS attempted his character by quoting this tradition:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Baladhari:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">And narrated to me Hisham ibn Ammar saying: Narrated Al-Zubayri from Al-Zuhri that he said: One of the biggest issues that Abdullah ibn Al-Zubayr is criticised for is that he left mentioning the Messenger of Allah (saw) in his sermons, and that when he was criticised for it, he said: He has a bad family that when he is mentioned, they become proud of themselves and raise their necks because of his name.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Ansaab Al-Ashraaf. Vol. 7, Pg. # 2857.<\/span><\/p>\n<p style=\"text-align: justify;\">The chain is weak since Hisham bin Ammar says, “I was told that Al-Zubayri said.” RTS mistranslated this, perhaps purposefully.<\/p>\n<p style=\"text-align: justify;\">RTS did also ask a group of questions that need to be dealt with:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Al-Miswar was eight years old when the Prophet (saw) died, which means that he was around six years old when the story of the proposal happened.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• How did he perceive the story with such precision and then memorise the hadeeth of the Prophet (saw) at the age of six?<\/span><\/p>\n<p style=\"text-align: justify;\">RTS is suggesting that this narration is disconnected and we have quoted the words of Ibn Hajar that it is indeed a connected narration. However, even if we assumed that it is disconnected, we accept this narration since it is a disconnected narration by a companion of the Prophet (salalahu alaihi wa salam), and the majority of the scholars of hadith, if not all of them, accept these types of narrations.<\/p>\n<p style=\"text-align: justify;\">Ironically, RTS is now complaining about this being disconnected, when he only recently argued for the acceptability of the disconnected narrations of Al-Zuhri, who died in the year 125 AH.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• How could he then be in a state of nocturnal emission at the age of six?!<\/span><\/p>\n<p style=\"text-align: justify;\">This has been explained above.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Ibn Al-Zubayr was also four months older than Al-Miswar, so how is it possible that it was only these two six years old companions who heard the story and no one from among the elder companions heard it and witnessed it?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Is it a coincidence that only these two companions who are famous in their enmity towards Ahlulbayt (a.s) witnessed the occasion?<\/span><\/p>\n<p style=\"text-align: justify;\">No. The Sunni view is that many people heard this tradition. However, unlike most traditions, we have only received them from a few eye witnesses. As most of us are aware, the sermons of the Prophet (salalahu alaihi wa salam) are all heard by large quantities of people, and yet, it is rare when these narrations reach us in many chains going back to several companions.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Ibn Zubayr&#8217;s enmity is clear towards the Ahlulbayt (a.s) since he fought against Imam Alee (a.s) in the battle of Jamal. He also possessed enmity towards his children after him, to the extent that he did not mention the name of the Prophet (saw) in his sermons and send blessings upon him.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Al-Miswar was also his sidekick and a person who was praised, respected and obeyed by the Khawarij who declared Imam Alee (a.s) a Kafir. One must question how that could be possible except that he possessed enmity towards Alee (a.s).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Al-Miswar would praise and send blessings upon Mu&#8217;awiyah whenever his name was mentioned. Is it simply a coincidence that Al-Miswar always was to the side with the enemies of Imam Alee (a.s)?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• How can a story be accepted from an enemy?<\/span><\/p>\n<p style=\"text-align: justify;\">This has been responded to above. Furthermore, Ibn Al-Zubair’s relationship with Ali did not prevent him from narrating this major merit of Fatima.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">• Is it a coincidence that only these two harsh enemies of Alee (a.s) heard this story and that both of them were very close friends?<\/span><\/p>\n<p style=\"text-align: justify;\">This is one possibility. The other possibility, which is suggest by Al-Tirmithi and Al-Bazzar is that this is a mistake by Isma’eel bin Ulaya, who attributed this narration accidentally to Ibn Mulaika from Ibn Al-Zubair, when Ibn Mulaika only narrated it from Al-Miswar.<\/p>\n<p style=\"text-align: justify;\">Both are very possible and it seems that Al-Tirmithi didn’t want to argue for the weakness of the hadith of Ibn Al-Zubair due to the strength of Ibn Ulaya, even though the majority of narrators attributed it to Al-Miswar alone.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">When we take all these facts into consideration, we can easily conclude that this story is a myth created by the Nawasib, narrated by the Nawasib, justified by the Nawasib, promoted by the Nawasib and used by the Nawasib at present to degrade the Messenger of Allah (saw), Imam Alee (a.s) and the chief of the ladies of Paradise, Faatima (s.a), only to save the reputation of Aboo Bakr and Umar.<\/span><\/p>\n<p style=\"text-align: justify;\">We respond to this allegation with another authentic narration:<\/p>\n<p style=\"text-align: justify;\">Imam Ahmad narrated in his Fadha’il 2\/946 from Sufyan (bin Uyayna) from Amr (bin Dinar) from Mohammad bin Ali (Al-Baqir) that: Ali (as) wanted to get married to the daughter of Abi Jahl. The Messenger (salalahu alaihi wa salam) said while on the pulpit, “Ali wanted to marry Al-Awra’a bint Abi Jahl, and it is not to him to gather between the daughter of the enemy of Allah and the daughter of the Messenger of Allah, and Fatima is a piece of me.”<\/p>\n<p style=\"text-align: justify;\">Perhaps RTS will also suggest that Al-Baqir was an enemy of Ali next.<\/p>\n<p style=\"text-align: justify;\">We would also like to suggest that RTS turn its back to the narration that says that, “Whoever angers Fatima angers me,” since this narration only comes through these paths that RTS is discrediting. If RTS were to do this, then they should drop their case against Abu Bakr altogether.<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">I- Umar Attacks the Houses of the Wives of the Prophet (saw)<\/strong><\/p>\n<p style=\"text-align: justify;\">In this section, RTS goes out of his way in order to prove that Omar had an aggressive nature towards women.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Muhammad Ibn Sa’d:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Uthman ibn Umar from Younis ibn Yazid from Al-Zuhri from Sa&#8217;eed ibn Mosayyib who said: When Aboo Bakr died, A&#8217;isha held a mourning gathering in which eulogies had been read for him, Umar was informed of it, so he forbid them [the mourners] from doing so. They refused, so he said to Hisham ibn Al-Walid: &#8220;Bring out for me the daughter of Abi Qohafa (sister of Abi Bakr)!&#8221; Then he lashed her, and when the mourners heard this they escaped, and he said: &#8220;Do they want to punish Aboo Bakr by their weeping?&#8221; The Messenger of Allah (saw) said: &#8220;The dead man suffers when his family weep for him.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Tabaqat Al-Kabir. Vol. 3, Pg. # 191.<\/span><\/p>\n<p style=\"text-align: justify;\">Perhaps RTS should have changed the name of the article to “Merits of Omar” for finding and introducing to us this marvellous narration.<\/p>\n<p style=\"text-align: justify;\">We find that in this narration the great love that Omar have for Abu Bakr. We also find that Omar believed that Abu Bakr would be tormented by the loud weeping and wailing of his family. This shows that he believed in the prophetic narration, which goes against the Shia claim that he was an unbeliever. Secondly, the narration shows that Omar believed that Abu Bakr was a good believer, which caused him to try to prevent any punishment from occurring onto him. For if he believed that Abu Bakr was to be punished for his “injustice” towards Ahl Al-Bayt, then preventing the weeping of family members wouldn’t have made a difference. Thirdly, Omar was the ruler at the time, which allows him to enter upon whomever he wills in order to prevent what is haram. Perhaps RTS would suggest that if a couple were fornicating, then the ruler is supposed to wait until they are done, then to ask them nicely to come outside for their punishment.<\/p>\n<p style=\"text-align: justify;\">RTS then quote a similar narration about Khalid bin Al-Waleed and we simply repeat what we have said above since it is a very similar story.<\/p>\n<p style=\"text-align: justify;\">However, our objectivity prevents us from totally accepting these merits since both narrations are disconnected. Both Sa’eed and Amr were not eye witnesses of the incidents since they were born way after these incidents.<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">J- Umar Threatens To Burn His Son&#8217;s House Down<\/strong><\/p>\n<p style=\"text-align: justify;\">Another misinterpreted merit of Omar:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abi Shaybah:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Aboo Bakr from Ya&#8217;laa ibn Ubayd from Fudhayl ibn Ghazwan from Nafi&#8217; from ibn Umar who said: Umar was informed that one of his sons has covered the walls of his house with cloth, so he said: &#8220;By Allah (swt!) If that is true, I will burn his house.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narration is Saheeh (Authentic).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Musannaf ibn Abi Shaybah. Vol. 8, Pg. # 360, H. # 25744.<\/span><\/p>\n<p style=\"text-align: justify;\">Omar bin Al-Khattab was known for his asceticism. This led him to harshness even amongst his own children who would seek worldly pleasure, like decorating their houses. Are these threats the threats of a disbeliever? Or are they the words of someone who feared Allah and wanted the mercy of Allah for his family?<\/p>\n<p style=\"text-align: justify;\">Furthermore, we find in the Saheehain from the Hadiths of Abu Huraira #186 and Ibn Abbas #187 that a person who thinks about committing a sin, but does not commit it, will not have it held against him, nor will it be written as a sin.<\/p>\n<p style=\"text-align: justify;\">It should also be known that there is another narration, in Saheeh Al-Bukhari #5808, in which Ali angers Fatima. The narration is from Sahl bin Sa’ad, who then states that the Prophet (salalahu alaihi wa salam) saw Ali sleeping in the Masjid, with dust all over him. He then referred to him as Abu Turab. In other words, this narration is treated as a merit for Ali, even though he angered Fatima.<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #000080;\">K- Umar Burns the House of a Companion of the Prophet (saw)<\/strong><\/p>\n<p style=\"text-align: justify;\">The merits continue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abd Al-Razzaq:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abd Al-Razzaq narrated Ubaydullah ibn Umar and Ma&#8217;mar from Nafi narrated Safiyyah ibn Abi Ubayd: Umar discovered alcohol in the house of a man from (the tribe of) Thaqif. He (the man) had already been lashed for alcohol consumption in the past. Therefore, he (Umar) burnt his house, and asked, &#8220;What is your name?&#8221; He (the man) replied, &#8220;Ruwayshid.&#8221; He (Umar) retorted, &#8220;Rather, you are Fuwaysiq (an abusive word).&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Musannaf Abd Al-Razzaq. Vol. 6, Pg. # 77, H. # 10051.<\/span><\/p>\n<p>Perhaps we shall employ some of the RTS people in order to write our articles in the future, for this narration shows that Omar was harshly against the selling of alcohol, due to its prohibition. Once again, we ask, are these the actions of a disbeliever? Or are they are the actions of a man that wants the best for the Ummah?<\/p>\n<p style=\"text-align: justify;\">Note: RTS are so incompetent that they refer to one of the sources that narrates this event as “Al-Kuni,” when it is in actuality “Al-Kuna.”<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>L- Aboo Bakr Orders To Burn the House of the Wife of the Prophet Muhammad (saw)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">RTS quote a narration in which Abu Bakr wants to burn the house of woman who was thought to be a wife of the Prophet (salalahu alaihi wa salam). He wanted to burn her house because she apostated. Omar then told Abu Bakr that she was never his wife in the first place. Strangely, we do not know what led RTS to the conclusion that she was indeed the wife of the Prophet (salalahu alaihi wa salam) for them to make such a foolish claim.<\/p>\n<p style=\"text-align: justify;\">Either way, the narration is weak since it contains Hussain bin Abi Ma’shar. See his biography in Mizan Al-I’itidal or Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">And peace be upon Muhammad our master and his family and followers.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to RevisitingTheSalaf.org’s “The Oppression of Sayeda Fatima (s.a) Part VII-II.” The article was published on the 2nd of July, 2014, and can be found here. As the reader can see, this is the second part <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/07\/14\/response-to-the-oppression-of-sayeda-fatima-s-a-part-vii-ii\/\" title=\"Response to: The Oppression of Sayeda Fatima (s.a) Part VII-II\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12,1],"tags":[17,18],"class_list":{"0":"post-1262","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh","8":"category-hadith","9":"tag-abu-bakr","10":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1262","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1262"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1262\/revisions"}],"predecessor-version":[{"id":2753,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1262\/revisions\/2753"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1262"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1262"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1262"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}