{"id":1276,"date":"2014-07-20T01:54:23","date_gmt":"2014-07-20T01:54:23","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1276"},"modified":"2014-07-20T16:12:48","modified_gmt":"2014-07-20T16:12:48","slug":"oral-transmission-the-declaration-of-hearing-from-the-scholars","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/07\/20\/oral-transmission-the-declaration-of-hearing-from-the-scholars\/","title":{"rendered":"Oral transmission: The declaration of hearing from the scholars"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1276\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In continuation of our mini-series in our practical comparisons between Saheeh Al-Bukhari and Al-Kulayni’s Al-Kafi, we look at one of the finer points of Hadith science, specifically, Seeghat al-Sama` and Tadlees.<\/p>\n<p style=\"text-align: justify;\">We begin by listing two chains for two  narrations related to ablution (Wudhu&#8217;), one from al-Kafi the Shia book, and the next is by al-Jami` al-Sahih the Sunni book:<\/p>\n<p>al-Kafi&#8217;s chain:<\/p>\n<blockquote><p>3937 &#8211; 1 &#8211;<br \/>\nعلي بن ابراهيم، عن محمد بن عيسى، عن يونس بن عبدالرحمن، عن أبان وجميل، عن زرارة قال: حكى لنا أبوجعفر<\/p>\n<p>[3937 &#8211; 1 &#8211; `Ali bin Ibrahim, from Muhammad bin `Isa, from Yunus bin `Abdul-Rahman, from Abban and Jameel, from Zurarah that he said: Abu Ja`far (as) told us etc&#8230;]<\/p><\/blockquote>\n<p>al-Bukhari&#8217;s chain:<\/p>\n<blockquote><p>(157) &#8211; [160]<br \/>\nحَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْأُوَيْسِيُّ، قَالَ: حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَطَاءَ بْنَ يَزِيدَ أَخْبَرَهُ، أَنَّ حُمْرَانَ مَوْلَى عُثْمَانَ أَخْبَرَهُ، أَنَّهُ رَأَى عُثْمَانَ بْنَ عَفَّانَ دَعَا بِإِنَاءٍ<\/p>\n<p>[(157) &#8211; [160] We were told by `Abdul-`Aziz bin `Abdullah al-Uwaysee, he said: Ibrahim ibn Sa`d has told me, from Ibn Shihab, that `Ata&#8217; bin Yazid had informed him, that Humran the servant of `Uthman informed him, that he saw `Uthman ibn `Affan calling for a pot of water etc&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Have you noticed any differences in how the chains of transmission are presented in each book? Most Muslim laypeople today wouldn&#8217;t notice the difference between both methods of transmission, which is why InshaAllah we will try with a  very simplistic explanation to inform our readers of the significance of the differences found between the two.<\/p>\n<p style=\"text-align: justify;\">Seeghaht al-Sama` means by definition: The word(s) used by a narrator that link him to the next narrator in the narration. We shall use the same two narrations above and make all such words or expressions in bold font so the reader can understand this definition even more.<\/p>\n<p>Seeghat-ul-Sama` expressions in al-Kafi&#8217;s chain:<\/p>\n<blockquote><p>3937 &#8211; 1 &#8211;<br \/>\nعلي بن ابراهيم، <strong>عن<\/strong> محمد بن عيسى، <strong>عن<\/strong> يونس بن عبدالرحمن، <strong>عن<\/strong> أبان وجميل، <strong>عن<\/strong> زرارة قال: <strong>حكى لنا<\/strong> أبوجعفر<\/p>\n<p>[3937 &#8211; 1 &#8211; `Ali bin Ibrahim, <strong>from<\/strong> Muhammad bin `Isa, <strong>from<\/strong> Yunus bin `Abdul-Rahman, <strong>from<\/strong> Abban and Jameel, <strong>from<\/strong> Zurarah that he said: Abu Ja`far (as) <strong>told us<\/strong> etc&#8230;]<\/p><\/blockquote>\n<p>Seeghat-ul-Sama` expressions in al-Bukhari&#8217;s chain:<\/p>\n<blockquote><p>(157) &#8211; [160]<br \/>\n<strong>حَدَّثَنَا<\/strong> عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْأُوَيْسِيُّ، قَالَ: <strong>حَدَّثَنِي<\/strong> إِبْرَاهِيمُ بْنُ سَعْدٍ، <strong>عَنِ<\/strong> ابْنِ شِهَابٍ، أَنَّ عَطَاءَ بْنَ يَزِيدَ <strong>أَخْبَرَهُ<\/strong>، أَنَّ حُمْرَانَ مَوْلَى عُثْمَانَ <strong>أَخْبَرَهُ<\/strong>، أَنَّهُ <strong>رَأَى<\/strong> عُثْمَانَ بْنَ عَفَّانَ دَعَا بِإِنَاءٍ<\/p>\n<p>[(157) &#8211; [160] <strong>We were told<\/strong> by `Abdul-`Aziz bin `Abdullah al-Uwaysee, he said: Ibrahim ibn Sa`d <strong>has told me<\/strong>, <strong>from<\/strong> Ibn Shihab, that `Ata&#8217; bin Yazid <strong>had informed him<\/strong>, that Humran the servant of `Uthman <strong>informed him<\/strong>, that <strong>he saw<\/strong> `Uthman ibn `Affan calling for a pot of water etc&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Now that we know what Seeghat-ul-Sama` is, we move on to define another important term, the infamous &#8220;Tadlees&#8221;.<\/p>\n<p style=\"text-align: justify;\">Tadlees according to the most common definition is: The act of a narrator, narrating from his Shaykh (or teacher) what he did not hear from him. This means that you as a narrator, attribute to another narrator certain words that you haven&#8217;t heard directly from his mouth, rather you learned of them through some other means, maybe some person told you, or you read them in a certain book, or you saw him in a dream or whatever indirect ways you can think of. A narrator who often does so and is popular for it, is known as a &#8220;Mudallis&#8221;.<\/p>\n<p style=\"text-align: justify;\">&#8220;Seeghat-ul-Sama`&#8221; and &#8220;Tadlees&#8221; these two terms are very much linked to one another and have always caused issues for the scholars of Hadith in the past. This is because there are two types of &#8220;Seeghat-ul-Sama`&#8221; the first are clear ones and the second are broad ambiguous ones. Examples:<\/p>\n<p style=\"text-align: justify;\">A- &#8220;Zayd said: `Amr has told me&#8221; This is a strong expression of transmission and a clear declaration of Zayd that he has indeed heard whatever it is that he shall narrate from `Amr&#8217;s mouth directly. This is the favorite type of narration to Hadith scholars, for any truthful, honest man, whether known for being a Mudallis (one who commits Tadlees) or not, if he uses clear words like those, he will have his Hadith accepted.<\/p>\n<p style=\"text-align: justify;\">B- &#8220;It was narrated by Zayd, from `Amr&#8221; OR &#8220;From Zayd that `Amr said&#8221; In both cases, we cannot be certain that Zayd heard from `Amr, he may have heard it from someone else. This is especially problematic if Zayd was a known Mudallis. In such a case, scholars would be cautious when he used unclear terms.<\/p>\n<p style=\"text-align: justify;\">Is Tadlees harmful? The answer is of-course yes, in many cases a trustworthy man might attribute a Hadith to some scholar, and people would think this Hadith is authentic and they would worship Allah based on it. However, later they find out that this trustworthy man did not at any point meet up with this scholar, he actually heard the report from another man who is completely unreliable and unqualified, sometimes even a liar or fabricator, and this suspicious character was the one who claimed he heard it from that scholar, in which case one has to abandon worshiping Allah based on what reached them through this unreliable person.<\/p>\n<p style=\"text-align: justify;\">Popular Sunni narrator and Imam of Hadith Shu`bah bin Al-Hajjaj (d. 160 AH) used to say about his teacher: I would pay attention to the mouth of Qatadah; if he said, “I heard,” then, I would write down his narration. However, I wouldn&#8217;t write if he didn&#8217;t say it. (Mu’jam Al-Mudalliseen p. 371)<\/p>\n<p style=\"text-align: justify;\">Even though Shu`bah was known for his extra caution with Tadlees, one could easily find similar practices from his predecessors from the Tabi`een(Followers), and this trend continued until scholars created compendiums for the known Mudalliseen, like Al-Shathakooni, Al-Nasa’ee, Al-Daraqutni, and others from the early scholars. Then this trend continued into larger books by Abu Zur`ah Al-`Iraqi, Sibt Ibn Al-A`ajami, and Al-Suyuti, from among the late scholars, as well as Ibn Hajar whose book (with 153 popular narrators accused of Tadlees) became the most popular in the field. This kept going until our current times where contemporaries collected all that was written by those earlier scholars and studied the practical and theoretical aspects, all in order to serve the students of knowledge. One of which is the very useful book Riwayat Al-Mudalliseen fi Saheeh Al-Bukhari by Awwad Al-Khalaf, in which he argued against every single accusation that Al-Bukhari’s book may have an unclear Seeghah that would suggest Tadlees.<\/p>\n<p style=\"text-align: justify;\">An example of this is the following narration of al-Bukhari: From abi Ishaaq, <strong>from<\/strong> al-Bara&#8217;, he said: “While a companion of the Prophet (saw) was reading and his horse was tied…etc” [Al-Bukhari #4839]<\/p>\n<p style=\"text-align: justify;\">The words: “<strong>from<\/strong> al-Bara’”, this is not considered straightforward. Such narrations are usually rejected. However, Al-Bukhari was aware of this fact, but only included this narration in his book since he was sure that abu Ishaaq did in fact hear this narration. Proof of this is found also in his Saheeh in another chapter where he quoted the same Hadith, but this time in this form: abu Ishaaq says, “<strong>I heard<\/strong> al-Bara’ bin `Aazib.” See Al-Bukhari #3614.<\/p>\n<p style=\"text-align: justify;\">It should be noted that al-Bukhari is not one that would cheat those that read his book by substituting an unclear Seeghaht al-Sama`with a clear one. Anyone who goes through Saheeh Al-Bukhari will find thousands of examples of words like, “he told us,” and “he told me,” and “from him,” etc&#8230;<\/p>\n<p>Take an example al-Bukhari’s care for these terminologies from the very first Hadith in his book:<\/p>\n<blockquote><p>(1)- [1]<br \/>\nحَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، قَالَ: حَدَّثَنَا سُفْيَانُ، قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ، قَالَ: أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَلَى الْمِنْبَرِ، قَالَ: سَمِعْتُ رَسُولَ اللَّهِ يَقُولُ<\/p>\n<p>[[1] &#8211; (1) <strong>We were told<\/strong> by al-Humaydi `Abdullah bin al-Zubayr, he said: Sufiyan <strong>told us<\/strong>, he said: Yahya bin Sa`eed al-Ansaree <strong>told us<\/strong>, he said: <strong>I was informed by<\/strong> Muhammad bin Ibrahim al-Taymee, <strong>that he heard<\/strong> `Alqamah bin Waqqas al-Laythee saying: <strong>I heard<\/strong> `Umar bin al-Khattab may Allah be pleased with him on the Mimbar saying: <strong>I heard<\/strong> the messenger of Allah (saw) say: etc&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">We can know that these words were extremely specific since we find variety in the words that are used, as well as another narration, in the same book but instead from the path of Qutaybah bin Sa`eed from `Abd Al-Wahhab from Yahya bin Sa`eed, in which the exact Seeghah are used:<\/p>\n<blockquote><p>(6223)- [6689]<br \/>\nحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ: سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ: أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ  يَقُولُ<\/p>\n<p>[[6689] &#8211; (6223) <strong>We were told<\/strong> by Qutaybah bin Sa`eed, `Abdul-Wahhab <strong>told us<\/strong>, he said:<strong> I heard<\/strong> Yahya bin Sa`eed say: <span style=\"color: #800000;\"><strong>I was informed<\/strong><\/span> by Muhammad bin Ibrahim, <span style=\"color: #800000;\"><strong>that he heard<\/strong><\/span> `Alqamah bin Waqqas al-Laythee saying: <span style=\"color: #800000;\"><strong>I heard<\/strong><\/span> `Umar bin al-Khattab may Allah be pleased with him say: <span style=\"color: #800000;\"><strong>I heard<\/strong><\/span> the messenger of Allah (saw) say: etc&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Notice that this narrations reached al-Bukhari through a different route and through different teachers, yet also notice that when the two branches of this chain meet at Yahya bin Sa`eed, all the terminology in dark red is similar to the terminology found in the previous Hadith, this shows that these words were related to us exactly and with precision, they are not random.<\/p>\n<p style=\"text-align: justify;\">This demonstrates Al-Bukhari&#8217;s precision in recounting the Hadith in the same exact way that he heard it from his teacher. Similarly, Al-Bukhari also recounted the very same Hadith elsewhere in his book in a much simpler form, in which his teachers used the simplest and most common Seeghah: &#8220;‘an&#8221; or &#8220;from&#8221;:<\/p>\n<blockquote><p>(2356)- [2529]<br \/>\nحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ اللَّيْثِيِّ، قَالَ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ<\/p>\n<p>[[2529] &#8211; (2356) Muhammad bin Katheer <strong>told us<\/strong>, <strong>from<\/strong> Sufiyan, Yahya bin Sa`eed <strong>told us<\/strong>, <strong>from<\/strong> Muhammad bin Ibrahim al-Taymee, <strong>from<\/strong> `Alqamah bin Waqqas, he said: <strong>I heard<\/strong> `Umar bin al-Khattab may Allah be pleased with him, <strong>from<\/strong> the Prophet (saw) etc&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">However, when looking through Al-Kulayni’s Al-Kafi, we find something completely different. The Seeghah in almost every case, comes in only one form, which is the simplest form: &#8220;‘an&#8221; or &#8220;from&#8221;.<\/p>\n<p style=\"text-align: justify;\">The word: &#8220;Hadathana&#8221; or &#8220;We were told&#8221;, which is the most common clear Seeghah can be found in Saheeh Al-Bukhari 14,390 times out of a total 7,593 narrations, while in Al-Kafi, it can only be found 62 times, out of a total of 16,199 narrations.<\/p>\n<p style=\"text-align: justify;\">Mathematically speaking, one can easily argue that Al-Bukhari was hundreds of times more careful with having clear and connected narrations in his book than Al-Kulayni.<\/p>\n<p style=\"text-align: justify;\">As for the actual Mudalliseen, or narrators who commit Tadlees, then matters get only worse for Al-Kulayni and Shia as a whole.<\/p>\n<p style=\"text-align: justify;\">According to `Awwad Al-Khalaf the expert Sunni scholar of Hadith, there are sixty eight narrators in Saheeh Al-Bukhari that have been accused of Tadlees. According to the esteemed scholar al-Baaji, the total amount of narrators in the Saheeh of Bukhari is 1,745.<\/p>\n<p style=\"text-align: justify;\">However, out of the thousands upon thousands of narrators in Al-Kafi, we do not have a single narrator that has been accused of Tadlees nor do we have a single narration that was weakened because it contains a Mudallis in its chain.<\/p>\n<p style=\"text-align: justify;\">This is not surprising. For even though we have discussed some of the practical aspect of this issue, we find something very similar in the books that discuss the intricacies of Shia Hadith sciences.<\/p>\n<p style=\"text-align: justify;\">Shia renowned scholar Ja’far al-Subhani said in his Usool Al-Hadith (p. 115) when talking about Tadlees: &#8220;Sufyan bin `Uyaynah was known for Tadlees. `Ali bin Khashram said: We were with Sufyan bin `Uyaynah, and he said: Al-Zuhri said… so Tadlees here is that Sufyan dropped his Shaykh while mentioning the Hadith in a Seeghah that implies he heard from Al-Zuhri directly.&#8221;<\/p>\n<p style=\"text-align: justify;\">We ask the objective reader. How is this information beneficial to Shias? Would it not be better to provide an example of a Shi’ee narrator in order to have Shias be aware of Mudalliseen in their books?! The answer is simple. The Shias do not have examples of Mudalliseen or books that have collected the names of the Mudalliseen, which is why they have no choice but to give examples from Sunni books regarding Sunni narrators.<\/p>\n<p style=\"text-align: justify;\">Sunni student of knowledge Shaykh Sa`d ibn Rashid al-Shanfa, in his study of the subject, went through several books by major Shia Hadith scholars, and could not find an instance in which those scholars would provide a Shi’ee example, even though each of these authors wrote about Tadlees!<\/p>\n<p style=\"text-align: justify;\">The names of the Shi`ee scholars are: Al-Shaheed Al-Thani, Al-Husayn bin `Abd Al-Samad Al-`Amili, Agha Fadhil Darbandi, `Abd Al-Razzaq Al-Ha’iri, Al-Jalali, Al-Kajoori, Mullah `Ali Kuni, Ja`far Al-Subhani, `Abdullah Al-Mamaqani, `Ali Akbar Ghifari, Abu Fadhl Al-Babili, and `Ali Al-Berujerdi. See his book Al-Jarh wal Ta`deel `ind Al-Shia Al-Imamiyah (p. 52).<\/p>\n<p style=\"text-align: justify;\">Sadly, even though the Shias have not succeeded in defending their books from the narrations of the Mudalliseen, the Shias are plagued by scholars that knowingly ignore, belittle, and cheat the people with their commentary of this phenomenon. Ja`far Al-Subhani, at the end of the chapter on Tadlees said (p. 117): &#8220;Luckily, it is very rare for us to find this (Tadlees al-shuyookh – another type of Tadlees) and that of the first type (of Tadlees) in our Imami narrations.&#8221;<\/p>\n<p style=\"text-align: justify;\">Yet we -and anyone familiar with the science- do believe that al-Subhani should be worried, in fact he should be very worried, and this is for a simple reason, the Imamiyyah take almost all of their narrations from the people of Qum in Persia, who in turn took them from the people of Kufah in `Iraq, so what significance does this hold when it comes to Tadlees? Let us quote the expert scholars of Hadith so the matter can be clarified.<\/p>\n<p style=\"text-align: justify;\">Imam of Hadith al-Khateeb al-Baghdaadi said in his book &#8220;al-Jami`&#8221; 2\/286: &#8220;The most correct chains for prophetic-traditions are those of the people of al-Haramayn -Makkah and Madinah-, for their Tadlees is minimal, and the number of those who are popular liars and fabricators among them is very small.&#8221;<\/p>\n<p style=\"text-align: justify;\">Okay, it seems the people who lived in the society of the descendants of the family and the descendants of the companions of Rasul-Allah (saw) are more careful in their narrations and more God fearing than those Arabs who lived in other regions.<\/p>\n<p style=\"text-align: justify;\">Imam of Hadith al-Hafiz al-Hakim al-Naysaburi says in his book &#8220;al-Ma`rifah&#8221; pg.111: &#8220;And the ones who practice Tadlees the most out of all narrators, are the people of Kufah, and a small group from the people of Basarah.&#8221;<\/p>\n<p style=\"text-align: justify;\">Here is why al-Subhani should be terribly worried, his narrations mainly come from the people of a city which was popular for Tadlees. In fact even the biggest of the scholars of Hadith of Ahlul-Sunnah in Kufah were known for Tadlees, such as Sulayman bin Mihran al-A`mash and abu Ishaaq `Amro bin `Abdullah al-Sabee`ee and others like them&#8230;<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Examples of Tadlees in al-Kafi:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">We take the narrations of Ibrahim bin `Umar al-Yamani from abu Ja`far al-Baqir. In al-Kafi vol.2 page 80, we read the following chain:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ أَبِي جَعْفَرٍ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim, <strong>from<\/strong> his father, <strong>from<\/strong> Hammad bin `Isa, <strong>from<\/strong> Ibrahim bin `Umar al-Yamani, <span style=\"color: #800000;\"><strong>from<\/strong><\/span> abu Ja`far (as) etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">`Ali bin Ibrahim they consider him reliable a Thiqah, his father Ibrahim is also accepted as trustworthy by the Shia, Hammad bin `Isa is also reliable and a Thiqah in their view, Ibrahim bin `Umar is a Thiqah according to al-Khu&#8217;i, he then narrates from the Imam al-Baqir. All in all, this narration seems authentic based on their standards, which is why their scholar al-Majlisi grades it &#8220;Hasan kal-Sahih&#8221; in his book Mir&#8217;aat-ul-`Uqoul 8\/68.<\/p>\n<p style=\"text-align: justify;\">However, is this narration connected? Or are there individuals who were dropped, as Tadlees?<\/p>\n<p style=\"text-align: justify;\">To find out, we look at another narration from al-Kafi 2\/176:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim, <strong>from<\/strong> his father, <strong>from<\/strong> Hammad bin `Isa, <strong>from<\/strong> Ibrahim bin `Umar al-Yamani,<span style=\"color: #800000;\"> <strong>from<\/strong> Jabir<\/span>, <strong>from<\/strong> abu Ja`far (as) etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Here we find that Ibrahim bin `Umar, did not seem to hear directly from abu Ja`far al-Baqir, there seems to have been a missing link, this missing link was Jabir al-Ju`fi, who is also a Thiqah according to the Shia, this leaves the narration as being authentic based on their standards as before, which is why al-Majlisi also graded it  &#8220;Hasan kal-Sahih&#8221; in his book Mir&#8217;aat-ul-`Uqoul 9\/54.<\/p>\n<p style=\"text-align: justify;\">We ask again though, is this narration connected? Or have there been narrators dropped out of Tadlees?<\/p>\n<p style=\"text-align: justify;\">To know this, we open al-Kafi 4\/70 and find this chain:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim, <strong>from<\/strong> his father, <strong>from<\/strong> Hammad bin `Isa, <strong>from<\/strong> Ibrahim bin `Umar al-Yamani, <span style=\"color: #800000;\"><strong>from<\/strong> `Amro bin Shimr, <strong>from<\/strong> Jabir<\/span>, <strong>from<\/strong> abu Ja`far (as) etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Suddenly another narrator pops up, turns out Ibrahim bin `Umar heard Jabir al-Ju`fi&#8217;s narration through the means of a man called `Amro bin Shimr, this time though the equation differs greatly because `Amro is Majhoul, he is an unknown man, which is why al-Majlisi grades this one as &#8220;Da`eef `ala al-Mashhour&#8221; in his book 16\/214.<\/p>\n<p style=\"text-align: justify;\">Here we ask the Shia scholars who were happily authenticating the previous reports, isn&#8217;t it very possible, since you have no way of knowing for sure whether Ibrahim bin `Umar actually heard what he heard directly from abu Ja`far al-Baqir, isn&#8217;t possible that all this time he was narrating this through `Amro bin Shimr or others who are unknown and unreliable? How can you then be certain of the authenticity of those narrations you accepted above?<\/p>\n<p style=\"text-align: justify;\">In conclusion, we repeat that the Sunni Hadith library is far more safe guarded due to the efforts of the scholars, both old and new, to cleanse the system from the narrations of the Mudalliseen, except in which the narration was clearly heard. While on the other hand, the Shia failed in both documenting the names of the Mudalliseen and also documenting the Seeghah in which the Hadith was mentioned nor do they document the dates of birth and death of their narrators, which causes Al-Kafi to fail in credibility and precision of its reports in comparison to Al-Bukhari as we cannot know if a narrator lived to meet another, or if a narrator heard what he heard from his teacher directly or from some liar here or there.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In continuation of our mini-series in our practical comparisons between Saheeh Al-Bukhari and Al-Kulayni’s Al-Kafi, we look at one of the finer points of Hadith science, specifically, Seeghat al-Sama` and Tadlees. We begin by listing two chains for two  narrations <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/07\/20\/oral-transmission-the-declaration-of-hearing-from-the-scholars\/\" title=\"Oral transmission: The declaration of hearing from the scholars\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,10],"tags":[],"class_list":{"0":"post-1276","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-books"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1276","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1276"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1276\/revisions"}],"predecessor-version":[{"id":1286,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1276\/revisions\/1286"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1276"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1276"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1276"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}