{"id":1314,"date":"2014-07-30T13:53:47","date_gmt":"2014-07-30T13:53:47","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1314"},"modified":"2014-07-30T13:53:47","modified_gmt":"2014-07-30T13:53:47","slug":"response-to-the-hadith-of-manzila","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/07\/30\/response-to-the-hadith-of-manzila\/","title":{"rendered":"Response to: The Hadith of Manzila"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1314\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to ShiaPen’s article entitled: The Hadith of Manzila. The article was written as a refutation to Ibn Al-Hashimi’s article on the same subject. ShiaPen’s article can be found <a href=\"http:\/\/www.shiapen.com\/comprehensive\/hadith-manzila.html\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">The hadith that was eventually dubbed as “Hadith Al-Manzila” is significant to every Shi’ee since the beginning of tashayyu’. This narration, to them, stands as clear evidence that Ali was made successor by the Prophet (salalahu alaihi wa salam). Even though the text has been interpreted by Sunni scholars to mean otherwise, the task has fallen upon us once again to reiterate this opinion while dealing with the supporting evidence brought by the ShiaPen team.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Section 1: The Meaning of Hadith Al-Manzila<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">\nShiaPen have done a good job of listing the relationship of Harun to Musa. They have successfully pointed out what was established in the Qur’an that he was a brother, a vizier, and his caliph to his people.<br \/>\nTruly, we find that these qualities can also be found in the relationship between Ali and the Prophet (salalahu alaihi wa salam), even though Ali is not literally the brother of the Prophet (salalahu alaihi wa salam).<br \/>\nHowever, none of these qualities are specific to Ali alone.<br \/>\nFirstly, we know that the believers were all given the status of brotherhood with one another. Allah (subhanabu wa ta’ala) says in His holy book:<br \/>\nإِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ<\/p>\n<p style=\"text-align: justify;\">{The believers are but brothers}<\/p>\n<p style=\"text-align: justify;\">Furthermore, the Prophet (salalahu alaihi wa salam) had many viziers that he relied on and looked to for advice, in all matters, in times of war and peace. This was not specific to Ali in any way shape or form. ShiaPen included weak disconnected narrations from Al-Dur Al-Manthoor and Al-Riyadh Al-Nadhira to establish that Ali was a vizier, even though there is no reason for them to provide evidence for a matter that is so widely accepted amongst all Muslims.<br \/>\nWe also know that the Prophet (salalahu alaihi wa salam) had many caliphs. These include Ibn Um Maktoom, Abu Lubaba, Abu Ruhm, Mohammad bin Maslama, Numaila bin Abdullah Al-Laythi, Uwaif bin Al-Adhbat, Siba’a bin Urfuta, and Ghalib bin Abdullah Al-Laythi. (Tareekh Khalifa, p. 48)<br \/>\nIn this light, there is no doubt that these men were also in the same status. They were also in the position of Harun to Musa.<\/p>\n<p style=\"text-align: justify;\">Most importantly though, there was another connection between Musa and Harun, which was that Harun attained the status of prophethood through the request made by Musa.<br \/>\nIn order to dispel any confusion though, the Prophet (salalahu alaihi wa salam) pointed out to Ali that he is the final prophet, and that there will not be any prophets after him.<br \/>\nHowever, one may ask: Why would the Prophet (salalahu alaihi wa salam) liken his relationship with Ali to Musa’s and Harun? The answer can be found in the context of the events.<br \/>\nIbn Al-Hashimi originally quoted Al-Thahabi:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #3366ff;\">The Messenger of Allah set out for Tabuk with an army of 30,000 men from al-Medinah…and he put Muhammad bin Maslamah Ansari in charge of al-Medinah…The Prophet had left behind Ali to look after his family. The Munafiqoon used this as an opportunity to spread false rumors about Ali. They implied that the Prophet gave little importance to Ali and therefore left him alone in al-Medinah. When his patience ran out, he (Ali) hurried from al-Medinah and–joining the Prophet at al-Jurf–asked: “The Munafiqoon are saying such-and-such about me and so I have come to you.” The Prophet of Allah said: “They are liars. I have left you behind to look after my household, so go back.” In order to soothe his feelings, the Prophet further added: “You are to me as Haroon was to Musa, except that there will be no Prophet after me.” Ali returned to al-Medinah pacified and satisfied.<\/span><br \/>\n<span style=\"color: #3366ff;\">(Tareekh al-Islam, Vol.1, p.232)<\/span><\/p>\n<p style=\"text-align: justify;\">The context makes things significantly clearer. We use the possible likenesses introduced to us by ShiaPen to fill in the blanks and then decide which makes the most sense.<br \/>\nIs it that Ali complained about being left behind and that the Prophet (salalahu alaihi wa salam) reassured him that he is a brother?<br \/>\nOr is it that Ali complained about being left behind and that the Prophet (salalahu alaihi wa salam) reassured him that he is a vizier?<br \/>\nBoth comparisons do not make much sense considering the context of the events. This naturally leaves the final and correct interpretation that he was reassuring him that he was a caliph upon the people of Madinah, and that this was a rank to be sought after, and that it was a status shared by Harun when he was a caliph upon his people.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Section 2: The Temporal Relationship between Harun and Musa<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">\nIn the previous section, we have pointed out that we accept that Harun was Musa’s brother, vizier, and caliph upon his people. We have also agreed with ShiaPen that this was the station of Ali to Mohammad as well. However, we hold the opinion that two of these stations are temporal only.<br \/>\nFirstly, there are no doubts that Ali, and all the believers are the brothers of the Prophet (salalahu alaihi wa salam), both in this life and the next.<br \/>\nHowever, it is not linguistically acceptable for one to argue that Ali was the Prophet’s (salalahu alaihi wa salam) vizier after his death, for the dead do not have viziers. No person in their right mind holds the belief that Ali would go to the grave of the Messenger (salalahu alaihi wa salam) and suggest war tactics and advise him on how to run the country.<br \/>\nSimilarly, his position as a caliph upon the people of Madinah was as temporary as that of those that we have mentioned previously, like Ibn Um Maktoom, Abu Ruhm, and the others. For upon the return of the Prophet (salalahu alaihi wa salam), they have rescinded their positions since he would take charge. In fact, these terms were as temporary as the caliphate of Harun upon his people, which only lasted until the return of Musa.<br \/>\nIn this context, it becomes even clearer that there is nothing to suggest that the status of Ali as caliph extends to anything past the return of the Prophet (salalahu alaihi wa salam), let alone after his death.<\/p>\n<p style=\"text-align: justify;\">Once again, we quote through Ibn Al-Hashimi who quoted Al-Qurtubi for reaffirmation that:<br \/>\n<span style=\"color: #3366ff;\">There is no disagreement that Haroon died before Musa…and (Haroon) was not a successor after him (Musa), for the successor (to Musa) was Yusha bin Noon (i.e. Joshua), so if he (the Prophet) wanted by his saying (to grant Ali) the Caliphate, he would have said “you will be to me like Yusha was to Musa”&#8230;<\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Section 3: Would Ali have been the Caliph if the Prophet (salalahu alaihi wa salam) Died when in Tabuk?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen argue:<br \/>\n<span style=\"color: #800000;\">It is common sense from Musa (as)’s words that Harun’s role was that as leader and successor, and should be acknowledged as such even if he were to die before Musa (as). Therefore the fact that he died and did not become khalifa does not in anyway alter this fact. Whilst we acknowledge that Yusha bin Nun became khalifa after Musa (as), this was only because Harun (as) passed away during his brother’s lifetime, had this not been the case Harun would have been khalifa. Once it is proven that Harun (as) had been appointed as the Khalifa of Musa (as) during his lifetime, then the same applies to Imam Ali (as), in Hadith Manzila the Prophet (s) made it clear that just like the appointment of Harun (as) by Musa (as), he (s) was likewise appointing Ali (as) as the Khalifa in his absence.<\/span><br \/>\nThe assumptions made by ShiaPen are ridiculous at best, since we have already established that were many companions that have held these positions.<br \/>\nIf the Prophet (salalahu alaihi wa salam) died when he was out during Hijjat Al-Wada’a, then Ibn Um Maktoob would have been appointed as the permanent caliph according to the suggestion brought by ShiaPen. (Tareekh Khalifa, p. 48)<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Section 4: Did the Prophet (salalahu alaihi wa salam) say “Hadith Al-Manzila” on Other Occasions (in Sunni Hadiths)?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">In response to the issue of context, ShiaPen refer to the Sunni view as “utter bigotry”. They suggest that context should not be a factor since the narration has occurred in instances other than Tabuk. They also suggest that the statement “there is no Prophet after me” makes the context nonsensical. This has been addressed previously both in this article and Ibn Al-Hashimi’s article, so we shall move on to the narrations.<br \/>\nIt should be noted that all the narrations that ShiaPen quote are weak, what is authentic and  established is that it happened on the way to Tabuk.<\/p>\n<p style=\"text-align: justify;\">First narration:<br \/>\n<span style=\"color: #800000;\">We read in Zakhair al-Uqba, page 120:<\/span><br \/>\n<span style=\"color: #800000;\">“Asma bint Umays said: ‘When Fatima gave birth to Hassan, the Prophet (pbuh) said to me: ‘O Asma, bring my grandson to me’. Then I wrapped him in a yellow cloth and gave him to the Prophet. The Prophet put him on his shoulder and said: ‘I never saw you wrapping a child with a yellow cloth’. Then he (the Prophet) replaced the cloth with a white one and then recited Adhan in (Haasan’s) right ear, and thene recited Iqama in (Haasan’s) left ear. The Prophet (s) then asked: ‘Ali, What have you named the child?’ He replied: ‘How can I keep it before you?’. The Prophet (s) then said: ‘I can also not give a name until Allah (swt) decides’. Gibrael then descended saying: ‘O Muhammad your Creator conveys Peace on you and says Ali is to you as Harun was to Musa except there is no prophet after you, give the child the same name that Harun gave his child…’<\/span><br \/>\nUpon returning to the text, we found that this narration was taken from the Saheefa of Ali Al-Redha, which is a Shi’ee text. Indeed, the narration was found on page seventy three of the text. The book has come to us through Abdullah bin Ahmad bin Aamer Al-Ta’ee from his father from Ali Al-Redha. However, this book is a fabrication attributed to Al-Redha. See Mizan Al-I’itidal 4\/59.<\/p>\n<p style=\"text-align: justify;\">Second narration:<br \/>\n<span style=\"color: #800000;\">We read in Tarikh Damishq, Volume 42 page 167:<\/span><br \/>\n<span style=\"color: #800000;\">“Ibn Abbas narrated that he heard Umar bin al-Khattab discussing with some people about the first Muslims, thus Umar said: ‘I heard Allah’s messenger (pbuh) saying three virtues about Ali, if I had one of these (virtues) it would be more lovable to me than anything else.<\/span><br \/>\n<span style=\"color: #800000;\">I was with Abu Ubayda, Abu Bakr and a group of companions, then the Prophet (s) patted Ali’s shoulder and said: ‘O Ali, you are the strongest amongst the believers in faith, the first Muslim who embraced Islam and your status to me is like the status of Harun to Musa”. <\/span><br \/>\nThis narration comes through the path of Abdullah bin Athran, who doesn’t have a biography in hadith books. It also comes through the path of Al-Ma’moun, from Al-Rasheed, from Al-Mahdi, from Al-Mansour, the Abbasid caliphs, who were not hadith narrators. The narration is an obvious fabrication.<br \/>\nShiaPen provide a supplementary version of the same narration from Kanz Al-Umal, but it contains no chain, and is therefore weak.<\/p>\n<p style=\"text-align: justify;\">Third narration:<br \/>\n<span style=\"color: #800000;\">We read in Tarikh Dasmishq, Volume 42 page 170:<\/span><br \/>\n<span style=\"color: #800000;\">“Jaffar bin Abi Talib said: ‘When Hamza’s daughter arrived at Madina, Ali, Jafar and Zaid disputed about her, thus Allah’s messenger (a) said: ‘Tell me what is wrong?’ Zaid said: ‘She is my niece and I’m worthier to take of her’. Ali said: ‘She is my cousin and I have brought her here’. Jafar said: ‘She is my cousin, and her aunt is my wife’. (The prophet) said: ‘O Jaffar, take her, you are worthier (to take care of her)’. Then Allah’s messenger said: ‘I will judge between you, as for you Zaid, you are my friend, and I’m your friend. As for you Jafar, you look like me physically and ethically. As for you Ali, your status to me is like the status of Aaron to Moses, except the prophethood’..”’. <\/span><br \/>\nThe narration comes through the path of Abdulrahman bin Abi Bakr bin Ubaidullah who is weak to Yahya, Abu Hatim, Al-Nasa’ee, Ahmad, Al-Bazzar, and others. See his biography in Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">Fourth narration:<br \/>\n<span style=\"color: #800000;\">We read in Fadhail al-Sahaba, Volume 2 page 638 Tradition 1085:<\/span><br \/>\n<span style=\"color: #800000;\">“Zayd bin Abi Awfa said: ‘I went to Allah’s messenger in his mosque, then he (Zaid) mentioned the story of brotherhood amongst the companions of Allah’s messenger. Then Ali said to the Prophet (s): ‘I lost my patience and felt sorrow when I saw you doing that to your companions but not to me, if I have incurred your displeasure I wish to apologise’.<\/span><br \/>\n<span style=\"color: #800000;\">Allah’s messenger said: ‘I swear by He who sent me with the truth, I only left you for myself, your status to me is like the status of Harun to Musa except there is no Prophet after me, you are my brother and my inheritor’. (Ali) said: ‘O Allah’s messenger, what shall I inherit from you?’ (The Prophet) said: ‘You shall inherit from me what the prophets used to inherit’. (Ali) said: ‘What did the Prophets inherit?’ (The Prophet) said: ‘The book of Allah and the Sunnah of the Prophet, you are with me in my palace in paradise along with my daughter Fatima, you are my brother and my friend’. Then Allah’s messenger recited the verse { (they shall be) as brethren, on raised couches, face to face.} 015.047” <\/span><br \/>\nThe narration comes through the path of Abdulmu’min bin Abbad who has been weakened by Abu Hatim and Al-Bukhari. See his biography in Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">Fifth narration:<br \/>\n<span style=\"color: #800000;\">We read in Al-Mujam al-Kabir, Volume 9 page 287 Hadith 10929:<\/span><br \/>\n<span style=\"color: #800000;\">“Ibn Abbas said: ‘The prophet made brotherhood among his companions, between the Muhajreen and the Ansar, but he left Ali without making his brotherhood with anyone, thus Ali left in anger and went to a pool. The Prophet (s) then went after him and when he found him, he (s) patted him by his feet and said: ‘Stand up, you should be called Abu Turab, are you angry because I made brotherhood between the Muhajreen and Ansar whilst I left you without making brotherhood? Aren’t you pleased that your status to me is like the status of Harun to Musa except there is no prophet after me? Whoever loved you is faithful and who ever hated you, God will make him die a pre-Islamic death and will be judged about his deeds in Islam’. <\/span><br \/>\nThe narration comes to us through Hamid bin Adam, who was declared as a liar by Al-Jawzajani, Ibn Adi, and Al-Sulaimani. See his biography in Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">Sixth narration:<br \/>\n<span style=\"color: #800000;\">We read in Tarikh Dasmishq, Volume 42 page 140:<\/span><br \/>\n<span style=\"color: #800000;\">Jabir said: Allah’s messenger (pbuh) came as we slept in the mosque, thus he hit us with a stick and said: ‘Are you sleeping in the mosque, it is not allowed to sleep in it’. Thus we woke up and Ali woke up, then Allah’s messenger (s) said: ‘O Ali, come here, it you are permitted to remain in the mosque whatever is allowed for me, don’t you like the fact that your status to me is like the status of Harun to Musa except there is no Prophet after me’..”. <\/span><br \/>\nThe narration comes to us through Haram bin Uthman. Al-Shafi’ee used to say that: To narrated from Haram is haram. Many scholars have stated that he is not trustworthy. See his biography in Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">Seventh narration:<br \/>\n<span style=\"color: #800000;\">Umm Salim (mother of Salim) is a renowned female companion of our Holy Prophet (s). Prophet (s), he (s) frequently visited her, one day he said to her:<\/span><br \/>\n<span style=\"color: #800000;\">“O Umm Salim! Ali’s flesh is of mine, and his blood is of my own; he is to me as Harun is to Musa.” <\/span><br \/>\n<span style=\"color: #800000;\">Kanz ul Ummal, Volume 11 page 607 Tradition 32936<\/span><br \/>\nThe narration, according to the author of Kanz Al-Ummal is from Al-Dhua’afaa’ by Al-Uqaili 2\/308, which is a book that collects the names of weak narrators and liars. ShiaPen knew this and decided to quote this secondary source instead of pointing to the actual source. Refer to the comments by Sh. Mazin Al-Sirsawi on the weakness of this narrator. Al-Uqaili himself pointed out that he was an extreme Rafidhi as well.<\/p>\n<p style=\"text-align: justify;\">Eighth narration:<br \/>\n<span style=\"color: #800000;\">We read in Tarikh Dasmishq, Volume 41 page 18:<\/span><br \/>\n<span style=\"color: #800000;\">“Aqeel bin Abi Talib said: ‘I disputed with Ali and Jafar bin Abi Talib about something, thus I said: ‘By Allah you are not more loveable to Allah’s messenger (ah) than me, our relation is one and our father is one and our mother is one.’ Allah’s messenger (s) said: ‘I love Usama bin Zayd’.<\/span><br \/>\n<span style=\"color: #800000;\">I said: ‘I’m not asking you about Usama bin Zayd rather I’m asking you about myself’. He (s) said: ‘O Aqeel, by Allah I love you because of two qualities, for your relationship and for Abu Talib’s love to you. The most loveable to me is Abu Talib, while you Jaffar are the most similar person to me in morality whilst you Ali, your status to me is like the status of Harun to Musa except there is no prophet after me’..”. <\/span><br \/>\nThe narration comes to us through the path of Musa bin Mateer who was accused of fabricating narrations by Yahya bin Ma’een. He was also weakened by Abu Hatim, Al-Nasa’ee, and Al-Daraqutni. See his biography in Lisan Al-Mizan.<\/p>\n<p style=\"text-align: justify;\">Ninth narration:<br \/>\n<span style=\"color: #800000;\">We read in Tarikh Dasmishq, Volume 42 page 169:<\/span><br \/>\n<span style=\"color: #800000;\">“Ibn Abbas said: ‘I saw Ali approach the prophet (s) and hug him, he [Ali] then said: ‘I have been informed that you named Abu Bakr, Umar and others, whilst you didn’t mention me’. The prophet (s) said: ‘Your status to me is like the status of Harun to Musa”.<\/span><\/p>\n<p style=\"text-align: justify;\">This narration comes through the path of Nahshal bin Sa’eed who was declared a liar by Ishaq bin Rahawaih and Al-Tayalsi. He was also weakened by several scholars. See his biography in Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">Tenth narration:<br \/>\n<span style=\"color: #800000;\">We read in Tarikh Dasmishq, Volume 42 page 179:<\/span><br \/>\n<span style=\"color: #800000;\">Zayd bin Abi Awufa said: ‘Allah’s messenger (s) entered the mosque, thus Ali stood up, then he (s) said: ‘Your status to me is like the status of Harun to Musa except there is no Prophet after me’. <\/span><br \/>\nThe narration comes through Shurahbeel bin Sa’ad who was weakened by Yahya, Abu Zur’ah, Al-Nasa’ee, while Ibn Abi Thi’b accused him of lying. See his biography in Tahtheeb Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">Eleventh narration:<br \/>\n<span style=\"color: #800000;\">We read in:<\/span><br \/>\n<span style=\"color: #800000;\">1. Manaqib Ali page 238 Hadith number 214 by Maghazali<\/span><br \/>\n<span style=\"color: #800000;\">2. Kifayat Muttalib page 264 Chapter 62<\/span><br \/>\n<span style=\"color: #800000;\">3. Yanabi al Mawada, page 13 Chapter 22<\/span><br \/>\n<span style=\"color: #800000;\">Shaykh Suleman al-Hanafi al-Qanduzi records:<\/span><br \/>\n<span style=\"color: #800000;\">Ali said: ‘Allah’s messenger (s) said to me on the day of Khaybar: ‘If I wasn’t afraid that some people of my nation would say about you what the Christians said about Isa son of Maryam, I would have said about you some things today that whenever you passed by a group of Muslims they would take the sand under which you trod and they would take the remaining water of your ablution for healing purposes, but it shall suffice to have your status to me like the status of Harun to Musa except there is no Prophet after me’. <\/span><br \/>\nThe narration comes through the path of Abdulrahman bin Ziyad Al-Afreeqi who was weakened by Yahya, Abdulrahman bin Mahdi, Ahmad, Al-Jawzajani, Al-Tirmithi, Al-Nasa’ee, Ibn Khuzaima, Al-Saji, Abu Ahmad Al-Hakim, and others. See his biography in Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Section 5: One More Weak Addition<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen write:<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Imam Ali (as) had been left in Madina to oversee all its affairs in the absence of the Prophet (s). The comparison of Imam Ali (as) to Harun (as) demonstrates that Imam Ali (as) was the caliph of the Prophet, in the same way that Harun was the caliph of Musa according to the Quran. This is made even more apparent in the version of the hadith narrated by the famous Sunni scholar Al Hakim al Nisaburi in his Mustadrak, volume 3 page 141. He narrates it with a small addition not found in many of the other narrations.<\/span><br \/>\n<span style=\"color: rgb(128, 0, 0);\">Ibn Abbas said: ‘Allah’s messenger marched to the Tabuk battle alongside thepeople, then Ali said to him: ‘Shall I march with you?’ The prophet replied: ‘No’. Then Ali cried, thus he (prophet) said to him: ‘Arent you pleased that your status to me is similar to that of Harun to Musa except there shall be no prophet after me, I shall not leave without you being my caliph’. <\/span><br \/>\n<span style=\"color: rgb(128, 0, 0);\">Al Hakim decalred it ‘Sahih’ while Dhahabi found no objection to it.<\/span><br \/>\n<span style=\"color: rgb(128, 0, 0);\">We should point out that this hadith in no way contradicts the other narrations found in the likes of Bukhari, it merely narrates further details that the other narrations did not have.<\/span><\/p>\n<p style=\"text-align: justify;\">This is the same narration of Abu Balj which we have weakened in another article found <a href=\"http:\/\/twelvershia.net\/2013\/05\/02\/response-to-alee-a-s-the-master-of-every-believer\/\" rel=\"external nofollow\">here<\/a>. Refer to this article for the details as to why this narration is weak.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Section 6: Did the Prophet (salalahu alaihi wa salam) say “Hadith Al-Manzila” on Other Occasions (in Shia Hadiths)?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen attempt to provide other contexts for the narration of hadith Al-Manzila, but this time, by using Shia texts.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">First occasion – When Imam Ali was the first person who embraced Islam, the Prophet [s] said to him this hadith (al-Mahasin by Burqi, Volume 1 page 159).<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe text that ShiaPen are referring to is the following:<\/p>\n<p style=\"text-align: justify;\">\nوقد كان أول من استجاب له علي بن أبي طالب صلوات الله عليه وقد قال له رسول الله صلى الله عليه وآله : &#8221; أنت منى بمنزلة هارون من موسى الا أنه لا نبي بعدي &#8221; .<\/p>\n<p style=\"text-align: justify;\">\nRough translation: And the first that answered to him was Ali bin Abi Talib (salawat Allah alaih), and the Prophet (salalahu alaihi wa aalih) had said to him, “You are to me as Harun was to Musa, except that there is no prophet after me.”<\/p>\n<p style=\"text-align: justify;\">\nThe narration does not explicitly say that this was said by the Prophet (salalahu alaihi wa salam) after Ali answered to him. Rather, the narration lists two merits of Ali; that he was the first to answer, and that he was to the Prophet (salalahu alaihi wa salam) what Harun was to Musa. There is no evidence here.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: rgb(128, 0, 0);\">Second occasion – The day of Khaybar (Amali by Seduq, page 156).<\/span><\/p>\n<p style=\"text-align: justify;\">\nThis narration comes from the path of Sunni narrators, as well as the narrator Abdulrahman bin Ziyad that we have weakened in section 4 of this article.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: rgb(128, 0, 0);\">Third occasion – when Fatima gave birth to Imams Hassan (as) and Hussain (as) (Amali by Seduq, page 197).<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe narration is weak since it contains Al-Abbas bin Bakkar who is anonymous according to Al-Jawahiri (p. 300).<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Fourth occasion – at Bani al-Mustaleq day (Amali by Seduq, page 238)<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is authentic. See our comments below.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Fifth occasion – On the day of brotherhood (Amali by Seduq, page 402)<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe narration is weak due to more than one anonymous narrator. These include Qais bin Al-Rabee, who was declared anonymous by Al-Jawahiri (p. 470), Attiyah Al-Awfi (375), and others.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Sixth occasion – On the day of Tabuk (Amali by Tusi, page 342)<\/span><\/p>\n<p style=\"text-align: justify;\">\nThis narration supports the Sunni, or rather, the agreed upon view, that this event happened on the way to Tabuk.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Seventh occasion – Whilst conversing with Um Salamah (Elal al-Sharaie, by Seduq, Volume 1 page 66)<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe narration comes through the path of anonymous narrators, according to Al-Jawahiri like Abaya Al-Asadi (p. 303).<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Eighth occasion – in the mosque (Elal al-Sharaie by Seduq, Volume 1 page 202)<\/span><\/p>\n<p style=\"text-align: justify;\">\nThis page contains two narrations, both are from Al-Muthaffar bin Ja’afar, who is anonymous according to Al-Jawahiri (p607).<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Ninth occasion – When the prophet addressed worshippers in the mosque in response to someone that had belittled him (Kitab Salim bin Qays, page 235)<\/span><\/p>\n<p style=\"text-align: justify;\">\nThis narration is a fabrication since it only comes through the path of Aban bin Abi Ayyash, who is weak. See Al-Jawahiri (p. 2).<\/p>\n<p style=\"text-align: justify;\">Furthermore, he was weakened by Al-Tusi in his Rijal, while Ibn Al-Ghadha’iri accused him of lying.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Tenth occasion – When the hajj was performed (Amali al-Tusi, page 521)<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe narration is weak since it contains more than one narrator that doesn’t have a biography in the books of the classical scholars, which makes them anonymous. These include Harun bin Amr Al-Mujashi’ee, Al-Fadhl bin Mohammad Al-Bayhaqi.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Eleventh occasion – A general one, that does not mention any specific event (Manaqib Amir al-Mominin by al-Kufi, Volume 1 page 499).<\/span><\/p>\n<p style=\"text-align: justify;\">\nIt is beyond us how ShiaPen can allege that this is an “eleventh occasion,” when there is no event specified?! Their justification for including this as a separate occasion is beyond ridiculous.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Twelfth occasion – When the Prophet (s) was ill during the final days of his life (Kamal al-Deen by Seduq, page 264).<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe narration is weak since it contains Aban bin Abi Ayyash. See above in the ninth occasion.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Thirteenth occasion – During Esra wa Miraq (Kamal al-Deen by Seduq, page 251).<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe chain is weak since it contains Sahl bin Ziyad, who has been accused of lying by Ahmad bin Mohammad bin Eisa Al-Ash’ari and weakened by Al-Najashi. See the work of the latter for more. The narration also contains several Sunni narrators which this hadith has been falsely attributed to.<\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: rgb(128, 0, 0);\">Fourteenth occasion – When the Prophet met al-Khizer (Uyoon Akhbar al-Raza by Seduq, Volume 1 page 13).<\/span><\/p>\n<p style=\"text-align: justify;\">\nThe narration includes more than one anonymous narrator, who don’t have biographies in classical rijal works. These include Ibrahim bin Mohammad bin Harun, Ahmad bin Abi Al-Fadhl Al-Balkhi, and Yahya bin Sa’eed Al-Balkhi.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: rgb(128, 0, 0);\">Let us also read the explanation of Hadith Manzila from a Shia text. We read in Ma’ani al-Akhbar by Seduq, page 74:<\/span><br \/>\n<span style=\"color: rgb(128, 0, 0);\">Abu Harun al-Abdi said: ‘I asked Jabir bin Abdullah al-Ansari about the meaning of Allah’s messenger (s)’ statement to Ali (as): ‘Your status to me is like the status of Harun to Musa except there is no Prophet after me’.<\/span><br \/>\n<span style=\"color: rgb(128, 0, 0);\">He (Jabir) said: ‘By Allah he (the Prophet) made him (Ali) Caliph during his (s) life and after his death and made obedience of him (Ali) obligatory, so whoever didn’t submit to his Caliphate after hearing this statement, is verily amongst the unjust’’.<\/span><\/p>\n<p style=\"text-align: justify;\">The narration comes through the path of Isma’eel bin Abaan, who is anonymous according to Al-Jawahiri (p. 62). The narration includes other anonymous narrators as well.<\/p>\n<p style=\"text-align: justify;\">Ironically, after going through all the narrations we have come to the realization that Hadith Al-Manzila cannot be found as part of the story of the conquest of Tabuk within any Shi’ee book through an authentic chain, and that the only authentic narration about this event can be found in Al-Saduq’s Amali in Bani Al-Mustaliq. Though, we do have issues with this narration, since it is a major exaggeration of the events that took place at Bani Al-Mustaliq, since it includes that Khalid bin Al-Waleed asked the people to pray and then killed them. This action is not one that a fasiq commits, let alone a Muslim. It is therefore, inconceivable that the Prophet (salalahu alaihi wa salam) would leave him in charge of his armies after such a vicious act. Moreover, the narration, in its original form, can be found in Sirat Ibn Hisham, though Ibn Ishaaq, who narrated it through Hakeem bin Hakeem through Al-Baqir. The narration doesn’t include these false additions, nor does it include the addition of “You are to me as Harun was to Musa.” See Ibn Hisham 2\/365. In this light, we reject then the additions as fabrications that were concocted in order to dramatize the events.<\/p>\n<p style=\"text-align: justify;\">Even though we have always rejected this narration since it came from a Shi’ee source, we made our case in order to invite the objective Shi’ee reader onto our ranks by accepting the Sunni version of Hadith Al-Manzila. The Sunni version is the one that actually fits the context after all.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to ShiaPen’s article entitled: The Hadith of Manzila. The article was written as a refutation to Ibn Al-Hashimi’s article on the same subject. ShiaPen’s article can be found here. The hadith that was eventually dubbed <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/07\/30\/response-to-the-hadith-of-manzila\/\" title=\"Response to: The Hadith of Manzila\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6,1,5],"tags":[],"class_list":{"0":"post-1314","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail","8":"category-hadith","9":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1314","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1314"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1314\/revisions"}],"predecessor-version":[{"id":1316,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1314\/revisions\/1316"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1314"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1314"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1314"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}