{"id":1358,"date":"2014-08-23T12:27:56","date_gmt":"2014-08-23T12:27:56","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1358"},"modified":"2018-10-30T14:45:08","modified_gmt":"2018-10-30T14:45:08","slug":"issues-of-ghaybah-part-9","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/08\/23\/issues-of-ghaybah-part-9\/","title":{"rendered":"Issues of Ghaybah [Part-9] &#8211; The low-quality of Shiite narrations about the Imam’s birth"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1358\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon this nation and its Prophet,<\/p>\n<p style=\"text-align: justify;\">What is harder than waiting for a beloved person who is absent?<\/p>\n<p style=\"text-align: justify;\">Waiting for beloved person that you&#8217;ve never met before nor do you know if he&#8217;ll return or if he even exists!<\/p>\n<p style=\"text-align: justify;\">The topic of our discussion today are the narrations proving the birth of the 12th Shi`ee hidden savior, a man who decided to save himself from the dangers and headaches of leading this nation.<\/p>\n<p style=\"text-align: justify;\">The early Shia scholar of Hadith Muhammad bin Ya`qoub al-Kulayni and the late Shia scholar of Hadith Muhammad Baqir al-Majlisi both tried to collect narrations proving the birth of the so called 12th Imam al-Qa&#8217;im in their books of Hadith. Were they successful?<\/p>\n<p style=\"text-align: justify;\">We begin with Kulayni&#8217;s book &#8220;al-Kafi&#8221;, the main book of Hadith adopted by the Imamiyyah today. He collects the narrations on the birth of the 12th one in volume one of his Usool, from page 514 until page 525, under the chapter title:<\/p>\n<p style=\"text-align: justify;\">&#8220;باب مَوْلِدِ الصَّاحِبِ&#8221;<\/p>\n<p style=\"text-align: justify;\">&#8220;The Birth of the Possessor&#8221;<\/p>\n<p style=\"text-align: justify;\">The greatest of Shi`ee Muhadditheen al-Kulayni has only managed to gather and collect 31 narrations in this chapter, in order to find out which of these narrations are an authority and which are weak and unreliable, we refer to al-Majlisi himself who wrote his book &#8220;Mir&#8217;aat ul-`Uqoul&#8221; in order to verify the reliability of al-Kafi&#8217;s narrations.<\/p>\n<p style=\"text-align: justify;\">In al-Mir&#8217;aat volume 6 page 171, al-Majlisi begins his commentary on each narration of the above chapter, and based on his judgement out of 31 narrations only 8 are reliable, the rest are all weak and unknown narrations.<\/p>\n<p style=\"text-align: justify;\">After viewing the grading of al-Majlisi for these narrations, we decided to inspect those he deems authentic, to see what they tell us about the birth of the 12th Imam, how was he born, how&#8217;d they hide his birth, who was his mother and what happened to her and so on&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #4:<\/strong> It talks about how abu Sidam, al-Hasan bin al-Nadir and a group of the companions of Imam al-Hasan al-`Askari discussed the money in their hands and what they should do with it. The narration only mentions some letters that this man received and he believed them to be from the 12th Imam obviously, the narration says:<\/p>\n<p style=\"text-align: justify;\">فَوَرَدَتْ عَلَيَّ رُقْعَةُ الرَّجُلِ ( عليه السلام ) إِذَا مَضَى مِنَ النَّهَارِ كَذَا وَ كَذَا فَاحْمِلْ مَا مَعَكَ<\/p>\n<p style=\"text-align: justify;\">[A letter came to me from the man (as) that said, ‘When it will become such and such hours of the day then take all (money and property) with you.’]<\/p>\n<p style=\"text-align: justify;\">And he receives more letters later on in the narration:<\/p>\n<p style=\"text-align: justify;\">فَوَرَدَتْ عَلَيَّ رُقْعَةٌ أَنِ احْمِلْ مَا مَعَكَ<\/p>\n<p style=\"text-align: justify;\">[A letter came that told me to take everything along with me. I loaded everything in the carriages of the porters.]<\/p>\n<p style=\"text-align: justify;\">Finally, he reaches a house where a black man meets him, and when he enters he unloads his goods then says:<\/p>\n<p style=\"text-align: justify;\">وَ إِذَا بَيْتٌ عَلَيْهِ سِتْرٌ فَنُودِيتُ مِنْهُ يَا حَسَنَ بْنَ النَّضْرِ احْمَدِ اللَّهَ عَلَى مَا مَنَّ بِهِ عَلَيْكَ وَ لَا تَشُكَّنَّ فَوَدَّ الشَّيْطَانُ أَنَّكَ شَكَكْتَ وَ أَخْرَجَ إِلَيَّ ثَوْبَيْنِ وَ قِيلَ خُذْهَا فَسَتَحْتَاجُ إِلَيْهِمَا فَأَخَذْتُهُمَا وَ خَرَجْتُ قَالَ سَعْدٌ فَانْصَرَفَ الْحَسَنُ بْنُ النَّضْرِ وَ مَاتَ فِي شَهْرِ رَمَضَانَ وَ كُفِّنَ فِي الثَّوْبَيْنِ<\/p>\n<p style=\"text-align: justify;\">[Then I found out that there was a room behind the curtain and someone called me therefrom: ‘O al-Hassan ibn al-Nadr, thank Allah for the favor that He has done to you and do not complain. Satan loves that you doubt. He gave me two pieces of cloth and it was said to me, ‘Take these; you will soon need them.’ I took them and left.’ Sa‘d has said, ‘Al-Hassan ibn Nadr came back, died in the month of Ramadan and was shrouded in two pieces of cloth.]<\/p>\n<p style=\"text-align: justify;\">This is the end of this narration, nothing about the birth of the Imam, only some letters that could have been written by anyone, and a voice he heard from behind a curtain, nor was it declared that he met the Imam or identified him, also anyone could have been behind that curtain. In fact even if he met him and declared so, this is still no evidence because we cannot build a `Aqeedah based on the words of one man who claims he saw something no one else saw, if it were a minor religious matter such as a ruling of Fiqh then we might accept it if he is reliable, but to build a `Aqeedah based on this is un-acceptable by the scholars of Islam. If this is evidence for the birth of the 12th one, then it is very flimsy evidence.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #8:<\/strong> This narration is talking about some unknown man who sent money he believed will reach the 12th Imam, he never saw him, talked to him or mentioned anything about his birth.<\/p>\n<p style=\"text-align: justify;\">We will quote the full narration:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ مُحَمَّدٍ قَالَ أَوْصَلَ رَجُلٌ مِنْ أَهْلِ السَّوَادِ مَالًا فَرُدَّ عَلَيْهِ وَ قِيلَ لَهُ أَخْرِجْ حَقَّ وُلْدِ عَمِّكَ مِنْهُ وَ هُوَ أَرْبَعُمِائَةِ دِرْهَمٍ وَ كَانَ الرَّجُلُ فِي يَدِهِ ضَيْعَةٌ لِوُلْدِ عَمِّهِ فِيهَا شِرْكَةٌ قَدْ حَبَسَهَا عَلَيْهِمْ فَنَظَرَ فَإِذَا الَّذِي لِوُلْدِ عَمِّهِ مِنْ ذَلِكَ الْمَالِ أَرْبَعُمِائَةِ دِرْهَمٍ فَأَخْرَجَهَا وَ أَنْفَذَ الْبَاقِيَ فَقُبِلَ<\/p>\n<p style=\"text-align: justify;\">[A man from Bedouins sent a certain quantity of commodity (as religious dues) but it was returned to him and he was told, ‘Pay first the rights of the children of your uncle. It is four hundred Dirhams.’ The property of the children of his uncle was in his possession in a sharing manner and he had withheld their property. When he did the accounting, their right in that shared property was four hundred dirhams. He paid that amount and sent the rest and it was accepted.]<\/p>\n<p style=\"text-align: justify;\">For all he knows his money could be going elsewhere so this isn&#8217;t an evidence.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #15:<\/strong> A Shi`ee man called Muhammad bin Salih simply wrote to the Imam as the narration states:<\/p>\n<p style=\"text-align: justify;\">[I wrote to him (the Imam) about the case. He wrote back to me, ‘Demand from them and make them pay.’]<\/p>\n<p style=\"text-align: justify;\">He gets into trouble with another man from Baghdad who owes him money, so he beats up his father then the man from Baghdad gets angry because the Shi`ee beat up his father, he cries for help and calls him a Rafidhi Qummi, so what does this Shi`ee man do? He obviously lies as the narration states:<\/p>\n<p style=\"text-align: justify;\">فَقَبَضْتُ عَلَى لِحْيَتِهِ وَ أَخَذْتُ بِرِجْلِهِ وَ سَحَبْتُهُ إِلَى وَسَطِ الدَّارِ وَ رَكَلْتُهُ رَكْلًا كَثِيراً فَخَرَجَ ابْنُهُ يَسْتَغِيثُ بِأَهْلِ بَغْدَادَ وَ يَقُولُ قُمِّيٌّ رَافِضِيٌّ قَدْ قَتَلَ وَالِدِي فَاجْتَمَعَ عَلَيَّ مِنْهُمُ الْخَلْقُ فَرَكِبْتُ دَابَّتِي وَ قُلْتُ أَحْسَنْتُمْ يَا أَهْلَ بَغْدَادَ تَمِيلُونَ مَعَ الظَّالِمِ عَلَى الْغَرِيبِ الْمَظْلُومِ أَنَا رَجُلٌ مِنْ أَهْلِ هَمَدَانَ مِنْ أَهْلِ السُّنَّةِ وَ هَذَا يَنْسُبُنِي إِلَى أَهْلِ قُمَّ وَ الرَّفْضِ لِيَذْهَبَ بِحَقِّي وَ مَالِي قَالَ فَمَالُوا عَلَيْهِ<\/p>\n<p style=\"text-align: justify;\">[I complained to his father and he said, ‘So what!’ I then held him by his beard and leg and pulled him toward the center of the house and kicked him many times. His son went out and cried for help from the people of Baghdad saying, ‘He is a Qumi, Rafidi he has killed my father.’ A large number of Baghdad people gathered around me. I rode my horse and said, ‘Very nice of you people of Baghdad. You support the unjust against a lonely stranger. I am a man from the Sunni sect and he calls me a man from Qum and a Rafidi so that he can destroy my rights.’ The people then turned on the other man]<\/p>\n<p style=\"text-align: justify;\">First of all this man clearly has no morals and does not appear to be from the friends of God, rather he beat up a man to death and lied claiming he was a Sunni afterwards, add on top of it there is no mention of the 12th Imam&#8217;s birth or existence in this Hadith.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #20:<\/strong> Another narration where some unknown man receives a letter asking him to hand over his sword with the rest of the money, it seems money and property are a reoccurring theme in the narrations of the 12th Imam, as if his job is a banker.<\/p>\n<p style=\"text-align: justify;\">Here is the full narration:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ مُحَمَّدٍ قَالَ حَمَلَ رَجُلٌ مِنْ أَهْلِ آبَةَ شَيْئاً يُوصِلُهُ وَ نَسِيَ سَيْفاً بِآبَةَ فَأَنْفَذَ مَا كَانَ مَعَهُ فَكَتَبَ إِلَيْهِ مَا خَبَرُ السَّيْفِ الَّذِي نَسِيتَهُ<\/p>\n<p style=\"text-align: justify;\">[A man from A’ba (name of a town) delivered certain items of property (to the holy location) but a sword that was part of such property was forgotten and remained in A’ba. When the delivery was made a letter came to him that said, ‘What about the sword that you forgot and left in A’ba?&#8217;]<\/p>\n<p style=\"text-align: justify;\">Nothing even remotely related to evidence can be spotted in this narration.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #24:<\/strong> Another random letter, here is the full narration:<\/p>\n<p style=\"text-align: justify;\">الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ قَالَ كَانَ يَرِدُ كِتَابُ أَبِي مُحَمَّدٍ ( عليه السلام ) فِي الْإِجْرَاءِ عَلَى الْجُنَيْدِ قَاتِلِ فَارِسَ وَ أَبِي الْحَسَنِ وَ آخَرَ فَلَمَّا مَضَى أَبُو مُحَمَّدٍ ( عليه السلام ) وَرَدَ اسْتِئْنَافٌ مِنَ الصَّاحِبِ لِإِجْرَاءِ أَبِي الْحَسَنِ وَ صَاحِبِهِ وَ لَمْ يَرِدْ فِي أَمْرِ الْجُنَيْدِ بِشَيْ‏ءٍ قَالَ فَاغْتَمَمْتُ لِذَلِكَ فَوَرَدَ نَعْيُ الْجُنَيْدِ بَعْدَ ذَلِكَ<\/p>\n<p style=\"text-align: justify;\">[al-Husayn ibn Muhammad al-Ash‘ari who has said the following: “The letters of abu Muhammad al-`Askari (as) would come about the matters related to al-Junayd, who eliminated Faris, abu al-Hassan and others. When he passed away letters about the issues related to abu al-Hassan and his friend continued coming from the possessor (12th Imam) but there was no mention of al- Junayd. I felt depressed about it. (Soon) thereafter, the news of the death of al-Junayd reached us.’”]<\/p>\n<p style=\"text-align: justify;\">Again al-Ash`ari just like his friends claims to be getting these mystical letters from the &#8220;holy location&#8221;, except there is no proof that an infallible divinely appointed Imam wrote any of this, nor are these secret letters evidence for religious beliefs because religion is clear for all mankind, not a bunch of secret letters that only a handful of men claim to receive assuming they even know where they come from.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #25:<\/strong> The usual Shi`ee Muhammad bin Salih who keeps claiming he receives letters said:<\/p>\n<p style=\"text-align: justify;\">[I had a female slave that had attracted my attention. I wrote to him (12th one), requesting permission to have a child from her. The answer came, ‘You may do so and Allah does whatever He wants.’ I went to bed with her and she became pregnant. The fetus fell off prematurely and she died.]<\/p>\n<p style=\"text-align: justify;\">Not an evidence.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #29:<\/strong> Another insult to the uncle of the so called 12th Imam, whom they claim is an impostor:<\/p>\n<p style=\"text-align: justify;\">[Ja‘far (the impostor) sold certain items. Of the items that he sold was a Ja‘fari (descendents of Ja‘far ibn abu Talib) female child that they had brought up. A certain ‘Alawi person informed the buyer all about the female child and.the buyer said, ‘I will be glad to return her if someone will pay me what I have paid.’ He then informed the people of the Holy Location. They sent forty one Dinars to the slave trader and asked him to return her to her people.’]<\/p>\n<p style=\"text-align: justify;\">Like some of the narrations before it, this one does not even mention the 12th Imam nor his birth nor anything at all&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Narration #31:<\/strong> This is the final authentic narration in this chapter, and like its predecessors it is nothing more than a letter prohibiting some folks from visiting a couple of cemeteries.<\/p>\n<p style=\"text-align: justify;\">In conclusion, for a chapter that&#8217;s titled &#8220;Chapter on The Birth of the Possessor&#8221;, we can certainly say we didn&#8217;t learn anything about the birth of this possessor nor can we even be sure that such a man existed.<\/p>\n<p style=\"text-align: justify;\">A Shia questioner will ask: &#8220;How is it possible that these narrations are unrelated to his birth? Does al-Kulayni not know what narrations to include into which chapters? Are there no narrations speaking of his birth (as) in this entire chapter!!?&#8221;<\/p>\n<p style=\"text-align: justify;\">The answer is YES, there definitely are narrations in this chapter proving the birth and existence of the 12th one, in fact the first narration #1 in this chapter is really clear, al-Husayn bin Muhammad al-Ash`ari says:<\/p>\n<p style=\"text-align: justify;\">الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ قَالَ خَرَجَ عَنْ أَبِي مُحَمَّدٍ ( عليه السلام ) حِينَ قُتِلَ الزُّبَيْرِيُّ هَذَا جَزَاءُ مَنِ افْتَرَى عَلَى اللَّهِ فِي أَوْلِيَائِهِ زَعَمَ أَنَّهُ يَقْتُلُنِي وَ لَيْسَ لِي عَقِبٌ فَكَيْفَ رَأَى قُدْرَةَ اللَّهِ وَ وُلِدَ لَهُ وَلَدٌ سَمَّاهُ م‏ح‏م‏د سَنَةَ سِتٍّ وَ خَمْسِينَ وَ مِائَتَيْنِ<\/p>\n<p style=\"text-align: justify;\">[When al-Zubayri was killed this letter came from Imam abu Muhammad (as): ‘Such as this is the retribution for those who lie against Allah in the matters of those who possess Authority from Him. He claimed that he could kill me and that I would leave no children behind. How has he then experienced the power of Allah?’ A child was born to him, whom he named M.H.M.D, in the year two hundred fifty-six A.H.’]<\/p>\n<p style=\"text-align: justify;\">Leaving aside the fact that this is another &#8220;letter&#8221;, this narration as opposed to those before it is explicit and clear, yet the issue is that al-Majlisi in his book &#8220;Mir&#8217;aat al-`Uqoul&#8221; graded this narration as &#8220;Da`eef `ala al-Mashhour&#8221; which means: It is famous for being weak.<\/p>\n<p style=\"text-align: justify;\">In other words all narrations clearly declaring his birth are either very weak like this one or are narrated by unknown people, so we ask: How can unknown people know about the &#8220;secret birth&#8221; of the 12th Imam while the reliable Shia narrators who claim to be very close to the Imams have nothing in this regard?<\/p>\n<p style=\"text-align: justify;\">Next we move to al-Majlisi&#8217;s popular encyclopedia of Hadith &#8220;Bihar al-Anwar&#8221;, a book which is more than 100 volumes in size because its author tries to collect whatever he can get his hands on from reliable and unreliable sources.<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi begins talking about the 12th Imam in volume 51, from page 2 until page 28, he begins with the chapter called:<\/p>\n<p style=\"text-align: justify;\">&#8220;ولادته وأحوال أمه صلوات الله عليه&#8221;<\/p>\n<p style=\"text-align: justify;\">&#8220;His birth and the condition of his mother peace be upon him.&#8221;<\/p>\n<p style=\"text-align: justify;\">Even after relying on many weak and unreliable sources all al-Majlisi could gather were 37 narrations which he backs-up with a couple more so they become around 40 in total.<\/p>\n<p style=\"text-align: justify;\">To verify the authority and authenticity of these reports we refer to the renowned and popular Shi`ee scholar of Hadith Grand Ayatulla Asif al-Muhsini, who wrote his popular commentary on al-Majlisi&#8217;s book and called it &#8220;Mashra`at al-Bihar&#8221;. Al-Muhsini comments on the authenticity of every report related to the 12th Imam in the above specified chapter of Bihar al-Anwar.<\/p>\n<p style=\"text-align: justify;\">In Mashra`at al-Bihar 2\/208 al-Muhsini says:<\/p>\n<p style=\"text-align: justify;\">[It includes (meaning the chapter) more than forty narrations (regarding his birth), what is acceptable from them are #5, IF it is established that al-Saduq asked Allah&#8217;s mercy many times on abu `Isam as the narration states.]<\/p>\n<p style=\"text-align: justify;\">Meaning the first one is weak, because al-Muhsini himself does not state that this is established, and if it isn&#8217;t then abu `Isam is an unknown narrator with no reliability. I add, even if it was established, the Hadith would still be weak, because according to the strong opinion of al-Khu&#8217;i and other Shi`ee scholars, if al-Saduq were to ask Allah to have mercy on someone, then this does not necessarily prove the person&#8217;s reliability.<\/p>\n<p style=\"text-align: justify;\">Al-Muhsini continues:<\/p>\n<p style=\"text-align: justify;\">[And the narration #33, IF al-Khashhab in this narration was actually al-Hasan bin Musa, but there is hesitation because he is from the seventh level while al-Khashhab in this narration was the teacher of ibn abi Najran and he is from the sixth level, thus he is Majhool(unknown).]<\/p>\n<p style=\"text-align: justify;\">This is basically it, out of 40 narrations in Bihar al-Anwar, only two might be considered acceptable, although the author seems to consider both weak since there is no evidence for the reliability of their narrators.<\/p>\n<p style=\"text-align: justify;\">Next al-Muhsini comments on the most popular Shi`ee narration regarding the birth of the Mahdi, he says:<\/p>\n<p style=\"text-align: justify;\">[As for the second narration and others, it has detailed the birth of al-Qa&#8217;im. However, it is weak in its chains, and its texts conflict, as for its narrators they are unknown, even Hakeemah (rah) is not documented as being reliable, thus these narrations are all not considered nor can we rely on them to learn the details.]<\/p>\n<p style=\"text-align: justify;\">Hakeemah, assuming she even exists, is nothing but one woman living in an un-educated superstitious Shiite society full of extremists, add on top of it that she herself is not reliable, thus she could have easily claimed to see the Mahdi in order to earn a couple of coins and attract attention to herself and raise her status in Shiite society.<\/p>\n<p style=\"text-align: justify;\">He continues on page 209:<\/p>\n<p style=\"text-align: justify;\">[As for narration #12 and others that are similar to it, they are fictional stories fabricated by some narrators as the expert researchers know, unless the reader is a naive simpleton.]<\/p>\n<p style=\"text-align: justify;\">How many naive simpletons do we have in our days attending the Husayniyyat and believing all those stories?<\/p>\n<p style=\"text-align: justify;\">So peace be upon our Prophet Muhammad (saw) and on his family and companions and all those who followed his guidance without following their desires and straying from the path of righteousness.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-2361\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions.png\" alt=\"discussions\" width=\"48\" height=\"48\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions.png 64w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions-62x62.png 62w\" sizes=\"auto, (max-width: 48px) 100vw, 48px\" \/><\/a>Discuss this article at <a href=\"http:\/\/forum.twelvershia.net\/imamah-ghaybah\/issues-of-ghaybah-and-the-birth-of-the-mahdi\/\" target=\"_blank\" rel=\"noopener external nofollow\">http:\/\/forum.twelvershia.net\/imamah-ghaybah\/issues-of-ghaybah-and-the-birth-of-the-mahdi\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon this nation and its Prophet, What is harder than waiting for a beloved person who is absent? Waiting for beloved person that you&#8217;ve never met before nor <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/08\/23\/issues-of-ghaybah-part-9\/\" title=\"Issues of Ghaybah [Part-9] &#8211; The low-quality of Shiite narrations about the Imam’s birth\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-1358","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1358","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1358"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1358\/revisions"}],"predecessor-version":[{"id":4432,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1358\/revisions\/4432"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1358"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1358"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1358"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}