{"id":1367,"date":"2014-08-25T20:29:36","date_gmt":"2014-08-25T20:29:36","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1367"},"modified":"2017-06-02T23:22:59","modified_gmt":"2017-06-02T23:22:59","slug":"understanding-the-mutawatir-and-the-tawatur","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/08\/25\/understanding-the-mutawatir-and-the-tawatur\/","title":{"rendered":"Understanding the Mutawatir and the Tawatur"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1367\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In recent times, a new phenomenon has occurred among Imami Shia that engage in polemical discourse with Ahlul-Sunnah. This phenomenon is the usage of the claim that narrations with several chains do not need to be examined due to their Tawatur and must simply be accepted. This rule was then incorrectly applied to several fabricated pro-Shia narrations, like Hadith al-Tayr (bird), Hadith Kasr al-Dhil` (broken rib), and Hadith Madinat al-`ilm (city of knowledge), due to their large amount of chains and due to the ignorance of those that abuse this rule.<\/p>\n<p style=\"text-align: justify;\">In this short article, we shall take a look at the definition of this term, what the expert scholars of Hadith think of Tawatur and we shall also see if accepting Tawatur the way the Shia view it plays in their favor or not.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>A-The Definition of a Mutawatir Hadith<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Both Sunnis and Shias more or less agree with the definition of the term. The Shi`ee scholar Mohammad Redha Jadeedi in his Mu’jam Mustalahat Al-Rijal wal Diraya (p. 145) states that the Mutawatir Hadith is one that includes so many narrators that it is impossible for them to conspire upon a lie, and that this applies to all levels of the narrators of the Hadith. He attributes this view to Al-Shaheed Al-Thani, Hasan Abdul-Samad Al-Harithi, Baha’a Al-Deen Al-Amili, Mir Damad, Mohammad Ja’afar Shari’atmadar, and Mulla Ali Al-Kanni.<\/p>\n<p style=\"text-align: justify;\">A Mutawatir Hadith, due to the above, is the ultimate binding evidence that cannot be rejected.<\/p>\n<p style=\"text-align: justify;\">Sunni Muhaddith Al-Khateeb in his book Al-Kifaya 1\/88 shares a similar view, but adds that what they narrated must not have been caused by some sort of confusion or Shubhah, and cannot have been forced upon them.<\/p>\n<p style=\"text-align: justify;\">Nur Al-Din `Itr in his Manhaj Al-Naqd fi Uloom Al-Hadith (p. 404) states that the scholars have differed in differentiating the number required in each of those levels, for one to accept that a Hadith is Mutawatir. Some scholars suggested seventy narrators, while others suggested forty. Some suggested twelve. The least of them suggested only four.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>B-Criticisms towards the Definition<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">As we can see from the above, no one agreed upon a number for the limit of narrators for a Hadith to be shifted to the Mutawatir category. Due to this, the Mutawatir Hadith, which is supposed to represent complete certainty, becomes something subjective. One who believes that a Hadith needs seventy narrators on each level would reject a Hadith with four narrators on each level, while one who believes that four is sufficient, would accept that Hadith as Mutawatir.<\/p>\n<p style=\"text-align: justify;\">Sh. Hamza Al-Malibari in his Uloom Al-Hadith (p. 94) explains that Tawatur can be established in one case and not another, and it can be established upon one person and not another, which means that it is nothing more than a subjective opinion of the strength of a Hadith.<\/p>\n<p style=\"text-align: justify;\">Sh. Abdullah Al-Judai’ in his Tahreer Uloom Al-Hadith 1\/43 comments that Tawatur exists so that there would be no disagreement, and yet, people disagree by claiming that “this narration is Mutawatir or not?!” This is the case since scholars differ on the number of narrators in each level of the chain so it can be referred to as Mutawatir. Hence, once again, the term is entirely subjective.<\/p>\n<p style=\"text-align: justify;\">The subjective nature of this issue is not only theoretical, but the subjectivity of the matter has been established in the practical sense as well. The famous Hadith: Whoever touches his private parts should perform ablution, has been narrated by nineteen companions. Al-Suyuti lists them and the sources of these narrations in his Al-Azhar Al-Mutanathira (p. 61). However, we find that each of the four madhahib include scholars that believe that touching the private parts does not require ablution, due to the weakness of the narrations. Ibn Al-Mundhir, the Shafi’ee, commented, “If the narration of Busra is not correct, then ablution after touching private parts is not necessary.” See Ahkam Al-Wudu’u min mas Al-Dhakar by Abi Abdullah Al-Aqsari (p. 133). Notice how Ibn Al-Mundhir is ignoring the supposed Tawatur of the narration and resting his judgment upon a single strong Hadith which opposes the multiple weak reports.<\/p>\n<p style=\"text-align: justify;\">Another criticism is that the early scholars of Hadith did not believe that this form of knowledge is to be included in the science of Hadith in the first place. Ibn Al-Salah in his Muqadimma (p. 145) suggests that the definition of Mutawatir is something that is mentioned by the people of fiqh and usool, not by Hadith scholars.<\/p>\n<p style=\"text-align: justify;\">Sh. Sa’ad Al-Homaid shares a similar view in his Fatawa Hadithiya (p. 7) where he states that this term was created by Mutakilimeen (i.e. philosophers) and that it didn’t exist before the time of the Mu’tazilites, and that the early Muslims did not see a difference between the terms Mutawatir and Ahaad.<\/p>\n<p style=\"text-align: justify;\">Furthermore, Sh. Al-Homaid (p. 10) states that “most of the people that spoke about this (Tawatur) said that one doesn’t need to look at the narrators of the chains, and they seem to mean the Dhabt (i.e. the ability to retain a Hadith), as for their `Adalah (justness) it definitely needs to be looked into.”<\/p>\n<p style=\"text-align: justify;\">It is clear that Sh. Al-Homaid holds this opinion since it is very possible for a large group of people to come together and narrate a lie. It is also very possible for a great number of folks to all believe in rumors and spread them such as what happens very often in our days, human nature never changed. In other words, one cannot treat Tawatur as acceptable simply for including a large number of people. Al-Judai 1\/43 also adds that the number of narrators is not sufficient without knowing who the narrators are.<\/p>\n<p>Shi`ee scholar of Hadith `Abd al-Hadi al-Fahdli says in Usool `Ilm al-Hadith (p. 73) that a big group of people can transmit a lie even if they did not conspire to do so, what leads them to doing this are their desires and their love of advertising or spreading what agrees with their beliefs without the need to conspire together to achieve this. He then says on the same page:<\/p>\n<p>&#8220;Knowing that these folks have not conspired does not remove the possibility of intentional lying. So we must add to the definition (of Mutawatir): &#8216;In a way that it is safe to assume that they have not lied.&#8217; This safety can be realized by the the number of narrators and their reliability, or that there is no reason to lie in that specific topic as well as other factors.&#8221;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>C-Turning the Tables on the Imamiyyah and Shia<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">For the stubborn Shi’ee that will not be willing to accept the sound explanations and commentary above, a sensitive topic needs to be brought up. Al-Majlisi comments in Mir’at Al-Uqool 12\/525 on Al-Kafi’s Hadith that the Qur’an was originally seventeen thousand verses long:<br \/>\n“The narration is authentic, and it is clear that this narration and many of the authentic narrations are clear that the Qur’an has been shortened and changed, and I hold that the narrations of this meaning are Mutawatir in meaning.”<\/p>\n<p style=\"text-align: justify;\">Modern scholar, Al-Nuri Al-Tabrasi in his notorious Fasl Al-Khitab, went through the books of the early Shias and successfully collected those traditions. He ended up with 1062 narrations that imply that the Qur’an has been tampered with.<\/p>\n<p style=\"text-align: justify;\">It is safe to say that Shias, with their primitive understanding of Mutawatir narrations, are bound by these 1062 narrations, for there are not many matters in the religion that can be found in anywhere close to that many narrations. Their only choice is to adopt that proper understanding of Mutawatir that we have provided above, or else, embrace the belief that the Qur’an has been tampered with.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong> Conclusion<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">To make this conclusion as brief as our article, we say that the Shi`ee idea that every Hadith that reaches us through seven or ten chains becomes Mutawatir, this is a false idea that must be corrected. How often does it happen in our society that news which is mass transmitted turns out to be false, how often do many TV stations offer us news reports that are incorrect and unverified? The mass transmission of a piece of information only serves to increase its popularity wherever the transmission is spread, it in no way proves its authenticity.<\/p>\n<p style=\"text-align: justify;\">I say, if the purpose of Tawatur is to prove the certainty of a matter, then it is sufficient that this event be  reported by a small amount of strong authentic unique chains, as opposed to a big number of weak unreliable stories.<\/p>\n<p style=\"text-align: justify;\">Tawatur was a term heavily relied on by innovators as they all fabricated many narrations to try and prove their beliefs, such as the Waqifah who fabricated many reports to prove that Musa bin Ja`far is the Mahdi or the Ithna `Ashariyyah who fabricated many reports about the 12th Imam&#8217;s occultation and so on&#8230;<\/p>\n<p style=\"text-align: justify;\">The concept of Tawatur has without a doubt been abused, however, when conditions are met, a narration\/event does without a doubt reach the highest level of authenticity.<\/p>\n<p style=\"text-align: justify;\">We end with this quote from the researcher of the book &#8220;al-Masa&#8217;il al-Sarawiyyah&#8221; Sa&#8217;ib `Abdul-Hameed, he praises the author al-Shaykh al-Mufeed for his scientific professional method in this book by saying on (p. 12):<\/p>\n<p style=\"text-align: justify;\">&#8220;In this book we can clearly see the correct methodology (of al-Mufeed) in his research and in how he extracts proofs. He holds on to the authentic established narration and leaves all else, even if what opposes it was related by the great ones such as al-Saduq and ibn al-Junayd. He shows complete disregard to the multitude of narrations whose chains are unreliable, instead he relies on the single authentic chain leaving behind a large pile of weak and fabricated reports. He is the expert diver who selects the pure pearls leaving behind the rubble that floats in the oceans.&#8221;<\/p>\n<p style=\"text-align: justify;\">And peace be upon our messenger and his family and companions.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In recent times, a new phenomenon has occurred among Imami Shia that engage in polemical discourse with Ahlul-Sunnah. This phenomenon is the usage of the claim that narrations with several chains do not need to be examined due to their <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/08\/25\/understanding-the-mutawatir-and-the-tawatur\/\" title=\"Understanding the Mutawatir and the Tawatur\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-1367","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1367","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1367"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1367\/revisions"}],"predecessor-version":[{"id":4072,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1367\/revisions\/4072"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1367"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1367"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1367"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}