{"id":1376,"date":"2014-08-26T16:30:43","date_gmt":"2014-08-26T16:30:43","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1376"},"modified":"2015-01-15T17:24:25","modified_gmt":"2015-01-15T17:24:25","slug":"understanding-application-of-the-confusion-of-reliable-narrators","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/08\/26\/understanding-application-of-the-confusion-of-reliable-narrators\/","title":{"rendered":"Understanding &#038; Application of the Confusion of Reliable narrators"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1376\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In continuation of our ongoing series surrounding the study of the sciences of Hadith in both the Sunni and Shia sects, the knowledge of the Ikhtilaat(confusion) of the narrator is one that cannot be ignored.<\/p>\n<p style=\"text-align: justify;\">In theory, according to Ibn Al-Salah in his Muqadimmah (p. 230) Ikhtilaat(confusion) is caused by several reasons. It happens due to old age, due to losing sight, and other reasons. He comments, “It is acceptable to take the Hadith of those that took Hadith from them before their Ikhtilaat, and not from those that took from them after their Ikhtilaat, nor if one is unsure if it was taken before or after Ikhtilaat.”<\/p>\n<p style=\"text-align: justify;\">The above is clear that Ibn Al-Salah holds the view that one must be certain that the narration that reached him was before the Ikhtilaat of the narrator, in order for it to be accepted. This opinion has always been adopted by Ahl Al-Sunnah.<br \/>\nIbn Hajar in Nuzhat Al-Nathar (p. 125) states that the reasons for <em>Ikhtilaat<\/em> include age, loss of sight, and the burning and loss of books that were relied upon by the narrator.<\/p>\n<p style=\"text-align: justify;\">To explain this matter in a simple way, we give the following hypothetical scenario as an example:<\/p>\n<p style=\"text-align: justify;\">A scholar called Jarir in the city of Mawsil in `Iraq was known as being a great Muhaddith, or a great narrator of Hadith, he traveled far and wide and collected many narrations from all the major scholars in the Islamic lands before settling in the city of Mawsil. The journey finally came to an end and Jarir returned to his home in Mawsil and brought with him great knowledge and thousands of Hadith, his reputation became really good and he was relied upon by the people of his town. With the passing of time Jarir became old of age, due to this he started forgetting certain parts of what he had memorized in his journey, he also started to narrate the meaning of what he once memorized as he forgot the exact word for word structure of the Hadith, on top of it he started to confuse the narrators in the chains of what he narrated.<\/p>\n<p style=\"text-align: justify;\">Things only got worse for Jarir and this is human nature and the Will of Allah (swt), as for those who narrated from this great man, they are divided into three parts:<\/p>\n<p style=\"text-align: justify;\">-Those who took Hadith from him when he was still in his full health and strength, these narrations we normally accept.<\/p>\n<p style=\"text-align: justify;\">-Those who took Hadith from him after he became Mukhtalit(confused), these narrations we normally reject.<\/p>\n<p style=\"text-align: justify;\">-Those who took Hadith from him but we are not certain at what time they did this, these narrations are also rejected out of precaution and out of fear of Allah.<\/p>\n<p style=\"text-align: justify;\"><strong>Efforts of Ahl Al-Sunnah in regards to Ikhtilaat<\/strong><\/p>\n<p style=\"text-align: justify;\">In order to solve this problem, Ahl Al-Sunnah authored books that include the names of those that have fallen to Ikhtilaat. Then, these scholars would discuss details regarding the acceptance of the narrations of that narrator. From these books are Kitab Al-Mukhtaliteen by Al-`Ala’ee, who included forty six narrators, and Al-Kawakib Al-Nayiraat by Ibn Al-Kayyal who named seventy narrators.<\/p>\n<p style=\"text-align: justify;\">This trend continued until contemporary times when scholars like Jasim Al-Esawi collected the names of those that have been accused of Ikhtilaat in the Saheehain(Bukhari &amp; Muslim). According to his studies, thirty three narrators of the Mukhtaliteen(confused ones) can be found in the Saheehain, however, from those, only nine of them have been known to have narrated Hadiths after they fell into Ikhtilaat.<\/p>\n<p style=\"text-align: justify;\">In Saheeh Al-Bukhari, the narrators that have been correctly accused of Ikhtilaat are Sa’eed bin Abi Aruba (p. 21), Ata’a bin Al-Sa’ib (p. 142), and Al-Mas’oudi (p. 153). The author Al-Esawi then studies these narrations and discussed their authenticity. He delves into matters regarding whether the narration has come through another path, or if the narration came from a student who has heard from his teacher before Ikhtilaat, and other matters that have to do with the reliability of those reports. He also lists the names of those that have heard from these narrators before Ikhtilaat for the benefit of the reader. For example, Al-Esawi (p. 25) mentioned that Sa’eed bin Abi Aruba had thirteen students in the Saheehain that have heard from him before his Ikhtilaat. They are: Isma’eel bin Ulaya, Hammad bin Usama, Abu Uthman Al-Basri, Rawh bin Ubada, Abdul A’ala bin Abdul A’ala, Ibn Al-Mubarak, Abdulwahab bin Ata’a, Abda bin Sulaiman, Eisa bin Yunus bin Abi Ishaq, Mohammad bin Bishr Al-Abdi, Mohammad bin Bakr bin Uthman Al-Bursani, Ibn Qattan, and Yazeed bin Zurai’. He then mentions the names and Hadiths of three students that heard from Sa’eed bin Abi Aruba after his Ikhtilaat, and they are Mohammad bin Abdullah Al-Ansari, Ghandar, and Ibn Abi Adi (p.28-38).<\/p>\n<p style=\"text-align: justify;\">Next, the author discusses the narrations of eleven other students who did not receive any comments from scholars as to whether they heard from Sa’eed before or after his Ikhtilaat (p. 38).<\/p>\n<p style=\"text-align: justify;\">Finally, the author reaches the result that whatever al-Bukhari narrated from the three men who had Ikhtilaat is all authentic, either because it was narrated before their time of Ikhtilaat or because it had supporting chains proving its authority.<\/p>\n<p style=\"text-align: justify;\"><strong> Efforts of Shias in regards to Ikhtilaat<\/strong><\/p>\n<p style=\"text-align: justify;\">Unlike Ahl Al-Sunnah, the Shia did not pay much attention to defining Ikhtilaat in the first place. Some of the late Shia scholars have attempted to speak of the usage of this word, since similar words like &#8220;Mukhalat&#8221; and &#8220;Mukhtalit&#8221; have been found at certain points in Shi`ee Rijali books such as al-Najashi&#8217;s book.<\/p>\n<p style=\"text-align: justify;\">Shia scholar Mohammad Redha Jadeedi in his Mu’jam Mustalahaat Al-Rijal wal Diraya (p. 151) details the opinions of other Shia scholars regarding the term in question. According to Hasan Al-Sadr Al-Amili, the word &#8220;Mukhtalit&#8221; is referring to those that have a bad `Aqeedah. The same is found in `Iddat Al-Rijal 1\/251. Al-Mamaqani explains it as someone who narrates from all people, the weak and the reliable ones. What may have led some of these scholars to view that Ikhtilaat has to do with `Aqeedah and not Dhabt (retaining a Hadith) is that Al-Najashi (p. 128) said that he was Mukhtalit and that Al-Mufeed narrated from him poetry that implies his Ikhtilaat. It is not likely that poetry that is memorized would refer to the Sunni definition of Ikhtilaat, but rather, that there is an issue with his `Aqeedah.<\/p>\n<p style=\"text-align: justify;\">The Shia scholar `Abd al-Hadi al-Fadhli says regarding Ikhtilaat in his book Usool `Ilm al-Hadith (p.124): &#8220;In Hadith terminology it means: Being easy-going in narrating, thus the narrator is lenient when it comes to Dhabt, he does not narrate the Hadith the same way he hears it. Also he does not care from who he narrates, and from whom he takes, and retains the valuable and worthless (narrations).&#8221;<\/p>\n<p style=\"text-align: justify;\">As we can see, the above is very general and related to narrators that are generally weak, unlike the precise definition given by the Sunni scholars. The term &#8220;Ikhtilaat&#8221; as is popular among the scholars of Hadith is when the scholar faces certain circumstances in his life that affect his ability to narrate correctly and accurately, not because he is lenient and easy-going nor because he takes his religious knowledge from unreliable folks, this stuff is related to the weakness and strength of the narrator overall not his Ikhtilaat.<\/p>\n<p style=\"text-align: justify;\">Upon further inspection, Al-Tusi in his Rijal has referred to others using the word Mukhalat to describe Ata’a bin Abi Rabah (p. 75) and Salama bin Salih Al-Ahmar (p. 219).<\/p>\n<p style=\"text-align: justify;\">Ironically, Ata’a and Salama don’t have narrations in any of the four Shia books, nor were they ever considered to be Imami narrators. It did not take long to realize that these views were actually views that some Sunnis shared. See Al-Tabaqat Al-Kubra 8\/505 for the biography of Salama and Mizan Al-I’itidal 5\/90 in the biography of Ata’a. In other words, even when one finds Shias describing narrators as Mukhtaliteen, it is simply based on the opinions of Sunnis themselves. It is also obvious that neither of these statements include any details as to when this Ikhtilaat occurred and who are the students that heard before\/after the Ikhtilaat, since the early Shia scholars did not have much care for that in the first place.<\/p>\n<p style=\"text-align: justify;\"><strong>The Ikhtilaat of the Shi`ee narrator Ibn Abi `Umayr<\/strong><\/p>\n<p style=\"text-align: justify;\">Perhaps the most ironic issue that revolves around Ikhtilaat is the person of Ibn Abi `Umayr and the dilemma of the early Shia scholars concerning his Hadith. Al-Najashi reports (p. 326), “It is said that his sister buried his books while she was in hiding and when he was imprisoned for four years, which caused his books to decay, and it is said he left them in a room and the rain caused them to rot, which caused him to narrate from his memory and from what was left which stayed with the people.”<\/p>\n<p style=\"text-align: justify;\">As the readers remember, we mentioned the loss of one&#8217;s books as one of the reasons for Ikhtilaat, the narrator who travels and writes down all the knowledge then returns to his town and narrates whatever he wrote to the people, if his books were lost then he will be in a situation where he cannot narrate with accuracy and precise details, he will also mess up the names of the narrators and locations and such. Ibn abi `Umayr had lost all of his books, and he then had to resort to narrating from his memory, his situation was so bad that he had to narrate from what his students had copied from his lectures in the past and what the people had memorized from his words.<\/p>\n<p style=\"text-align: justify;\">The effects of Ibn Abi `Umayr&#8217;s Ikhtilaat are apparent in Al-Kafi. We find him saying in over a hundred and thirty different occasions that he heard from “a man” or “someone” or “someone that he mentioned” or “a group of people” or “more than one person”, without mentioning the name of his source. Meaning he lost the name of his scholars and got confused as to which of his teachers narrated which Hadith, and if a man forgets the name of his teachers then he will definitely forget parts of their narrations and make mistakes in other parts.<\/p>\n<p style=\"text-align: justify;\">Ironically, instead of rejecting his narrations altogether or at least listing his students into two groups (i.e. those that have heard before his Ikhtilaat, and those that have heard from him after his Ikhtilaat), we find that Shias have embraced his narrations even though Ibn Abi `Umayr can’t remember who he narrated from. Al-Najashi (p. 326) states after mentioning that his books were destroyed that “He then narrated from his memory and what was left which stayed with the people, and this is why our companions are reassured about his disconnected reports.”<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/p>\n<p style=\"text-align: justify;\">In conclusion, is it fair to say that the scholars of Ahl Al-Sunnah were much more critical of their own narrations and more cautious about accepting narrations than the Shias. This is not simply based on the sheer amount of work that has been put into documenting the cases of Ikhtilaat, the dates in which Ikhtilaat happened, and the like, but even in the practical sense, when Shia scholars have found their narrators suffering from Ikhtilaat, they thought well of them and became more lenient about accepting their Hadiths because it is all they possess.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In continuation of our ongoing series surrounding the study of the sciences of Hadith in both the Sunni and Shia sects, the knowledge of the Ikhtilaat(confusion) of the narrator is one that cannot be ignored. In theory, according to Ibn <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/08\/26\/understanding-application-of-the-confusion-of-reliable-narrators\/\" title=\"Understanding &#038; Application of the Confusion of Reliable narrators\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,10],"tags":[],"class_list":{"0":"post-1376","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-books"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1376","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1376"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1376\/revisions"}],"predecessor-version":[{"id":1639,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1376\/revisions\/1639"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1376"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1376"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1376"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}