{"id":1411,"date":"2014-09-12T00:04:03","date_gmt":"2014-09-12T00:04:03","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1411"},"modified":"2014-09-12T00:04:03","modified_gmt":"2014-09-12T00:04:03","slug":"ali-bin-ahmad-al-kufi-and-tahreef","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/09\/12\/ali-bin-ahmad-al-kufi-and-tahreef\/","title":{"rendered":"`Ali bin Ahmad al-Kufi and Tahreef"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1411\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">al-Salamu `Aleykum,<\/p>\n<p style=\"text-align: justify;\">Who is `Ali bin Ahmad al-Kufi? He is a big Shia scholar in his time, from the progeny of their Imam al-Jawad, his full name being `Ali bin Ahmad bin Musa bin Muhammad bin `Ali bin Musa bin Ja`far al-Sadiq (d. 352 hijri)<\/p>\n<p style=\"text-align: justify;\">Al-Tusi says in al-Fehrest:<\/p>\n<p style=\"text-align: right;\">علي بن أحمد الكوفي يكنى أبا القاسم كان إمامياً مستقيم الطريقة ، وصنف كتباً كثيرة سديدة ، منها كتاب الأوصياء ، وكتاب الفقه على ترتيب كتاب المزني ، ثمّ خلّط وأظهر مذهب المخمسة ، وصنف كتباً في الغلو والتخليط ، وله مقالة تنسب إليه<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ahmad al-Kufi. his Kuniyah is abu al-Qasim, he was an Imami who followed the correct path, and he authored many good books, such as Kitab-ul-Awsiya&#8217;, and Kitab-ul-Fiqh that is arranged similarly to al-Mazni&#8217;s, then he messed up and followed the Madhab of the Mukhammisah (a Shia sect), and he authored books of Ghulu and nonsense, and he adopted special beliefs.]<\/p>\n<p style=\"text-align: justify;\">Today we&#8217;ll be looking at his book, &#8220;al-Istighathah fi Bida`-ul-Thalathah&#8221; which has two other names: &#8220;al-Bida` al-Muhdathah&#8221; and &#8220;al-Ighathah fi Bida`-ul-Thalathah&#8221;.<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Mirza `Abdullah al-Asbahani says in his book Riyadh-ul-`Ulama&#8217; that this book that we will be quoting today, is from the books he authored when he was still a correct Imami Shia.<\/p>\n<p style=\"text-align: justify;\">وهذا السيد قد ألف في زمان استقامة أمره كتبا عديدة على طريقة الشيعة الإمامية منها كتاب الإغاثة في بدع الثلاثة<\/p>\n<p style=\"text-align: justify;\">[This Sayyid during the times when he was on the correct path has authored many books for the Imami Shia, from them, al-Ighathah fi Bida`-ul-Thalathah]<\/p>\n<p style=\"text-align: justify;\">He then says:<\/p>\n<p style=\"text-align: justify;\">وكتبه جلها بل كلها معتبرة عند أصحابنا حيث كان في أول أمره مستقيما محمود الطريقة وقد صنف كتبه في تلك الأوقات<\/p>\n<p style=\"text-align: justify;\">[And his books, most of them, rather all of them are relied upon by our companions, as he was on correct guidance at the beginning and he authored his books in that period]<\/p>\n<p style=\"text-align: justify;\">The Shia researcher of the book says commenting on the above:<\/p>\n<p style=\"text-align: right;\">كأنه يشير بقوله (كان في أول أمره مستقيما محمود الطريقة) إلي ما ذكره بعض أصحاب المعاجم من أنه غلا في آخر عمره وأظهر بعض المقالات المضادة لمذهب الشيعة الإمامية، ولكن الذي اعتقده أنه برئ من مثل هذه المذاهب الفاسدة ولذا لم يطعنه بذلك كثير من العلماء المتقدمين، واحسب أن ذلك الطعن جاءه من بعض سماسرة بني أمية الذين هم في عصره لا سيما بعد ما اطلعوا على تأليفه (الاستغاثة في بدع الثلاثة) هذا الكتاب الذي أبان فيه فضائح القوم ومخازيهم<\/p>\n<p style=\"text-align: justify;\">[I say: it is as if he (meaning al-Mirza) when he says &#8220;he was on correct guidance at the beginning&#8221; is pointing towards what some writers wrote about him becoming from the Ghulat at the end of his life and showed signs of disagreement to the Imami Shia Madhab. However, I believe that he is innocent from adopting false Madhabs, and this is why not many of the early scholars attacked him for this. I consider that this accusation was fabricated by some trouble makers of Bani Umayyah in his time, especially after they saw his book &#8220;al-Istighathah fi Bida`-ul-Thalathah&#8221;, this book that exposed their scandals and shame]<\/p>\n<p style=\"text-align: justify;\">I&#8217;ll translate this book&#8217;s title so that you know what it means:<br \/>\n&#8220;The helper in (learning) the innovations of the three.&#8221;<\/p>\n<p style=\"text-align: justify;\">I wonder which three he means?<\/p>\n<p style=\"text-align: justify;\">Yes, it&#8217;s a book by a Kufan Shia attacking the first three Khualafa&#8217;, as if we haven&#8217;t seen enough of that already.<\/p>\n<p style=\"text-align: justify;\">As for al-`Allamah al-Noori al-Tabrasi, he wrote in Mustadrak al-Wasa&#8217;il regarding this book saying:<\/p>\n<p style=\"text-align: right;\">هو في أسلوبه ووضعه ومطالبه من الكتب البديعة الكاشفة عن علو مقام فضل مؤلفه ولذا اعتمد عليه العلماء الأعلام مثل ابن شهرآشوب في مناقبه وفي معالمه إشارة إلى ذلك، والشيخ يونس البياضي في كتاب الصراط المستقيم بل وكلام العلامة الحلي رحمه الله يشير إلى أنه من الكتب المعروفة بين الإمامية والقاضي في الصوارم المهرقة وغيرهم<\/p>\n<p style=\"text-align: justify;\">[The intelligent and creative method and arrangement of the book shows the high value of its author, this is why our greatest scholars relied on it, such as Ibn Shahr Ashoub in his Manaqib and Ma`alim, also al-Shaykh Yunus al-Bayyadi in his book al-Sirat al-Mustaqeem, even the words of al-`Allamah al-Helli indicate that this is from the popular books of the Imamiyyah, this was also confirmed by al-Qadi in al-Sawarim al-Muhraqah and others]<\/p>\n<p style=\"text-align: justify;\">I say: We don&#8217;t care whether this Zindeeq changed his Madhab at the end of his life and became a Kafir, all we wanted to prove is that this man is of high value as a Shia scholar, and that his book which we shall quote is relied upon by the Imamiyyah.<\/p>\n<p style=\"text-align: justify;\">Now the quote, abu al-Qasim al-Kufi says in &#8220;al-Istighathah&#8221; volume 1 page 53, while commenting on how `Uthman ibn `Affan (ra) erased the Masahif and united the people on one Qur&#8217;an:<\/p>\n<p style=\"text-align: right;\"><strong>بها وهي بدعة في الاسلام عظيمة الذكر فظيعة الشر لأنه لا يخلو من أن يكون في تلك المصاحف ما هو في هذا المصحف أو كان فيها زيادة عليه فإن كان فيها ما هو في أيدي الناس فلا معنى لما فعله بها والطبخ لها إذا كان جائزا أن يكون عند قوم بعض القرآن في بعض الصحف من غير أن يكون عنده القرآن كله، وإن كان فيها زيادة على ما في أيدي الناس فقصده لذهابه منع جميع المسلمين منه، فقد قصد إلى إبطال بعض كتاب الله وتعطيل بعض شريعته ومن قصد إلى ذلك فقد حق عليه قول الله تعالى (أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة تردون إلى أشد العذاب وما الله بغافل عما تعملون) هذا مع ما يلزم فيه من الحجة أنه لم يترك ذلك تعمدا إلا وفيه ما يكرهه ومن كره ما أنزل الله تعالى في كتابه حبط جميع عمله كما قال الله تعالى &#8221; ذلك بأنهم كرهوا ما أنزل الله فأحبط أعمالهم &#8221; وما أحد يستحق هذه الآية فيه أحق ممن قصد لي صحف القرآن فطبخها بالماء وغسلها معطلا لما كان فيها من القرآن مع إجماع أهل القبلة والآثار من الخاص والعام أن هذا الذي في أيدي الناس من القرآن ليس هو القرآن كله وأنه قد ذهب من القرآن ما ليس هو في أيدي الناس، وهذا مما ألحقه ما قلناه: أنه كان في تلك الصحف شئ من القرآن كرهه عثمان فأزاله من أيدي الناس، وكفى بذلك شاهدا على عناده لله ولرسوله<\/strong><\/p>\n<p style=\"text-align: justify;\">[This is a great evil and a terrible innovation, because either those Masaahif contained what we have in this Mushaf (available today), or they contained additions to it. If those Masaahif (which he erased) contained the same material as that which is found in our Mushaf (today), then there is no reason for him to erase them and it is allowed for people to have parts of the Qur&#8217;an without having the rest of it, but if those Masaahif contained additions not found in the people&#8217;s hands (today) then his intention was to prevent the Muslims from having access to them.<br \/>\nHe had intended to destroy some parts of Allah&#8217;s book and he intended to prevent Allah&#8217;s laws, and whoever intends such a thing then Allah&#8217;s words apply to him:<br \/>\n{So do you believe in part of the Scripture and disbelieve in part? Then what is the recompense for those who do that among you except disgrace in worldly life; and on the Day of Resurrection they will be sent back to the severest of punishment. And Allah is not unaware of what you do.}<br \/>\nThis also strengthens the evidence that he did not do this unless there were certain parts in it which he hated, and whoever hates what Allah reveals then all his deeds will be annulled:<br \/>\n{That is because they disliked what Allah revealed, so He rendered worthless their deeds.}<br \/>\nNo one deserves to be addressed by this verse except a person who erased the Masaahif with water thus wasting all of their Qur&#8217;anic content, taking into consideration the consensus of the people of Qiblah and Athaar, from the Khaas and the `Aam, that what is in the people&#8217;s hands is not the complete Qur&#8217;an, and that a part of the Qur&#8217;an was lost, so I add this to what I said previously: That those Masaahif contained parts of the Qur&#8217;an that `Uthman hated, so he removed them from the people&#8217;s possession, and this is sufficient as proof that he is a stubborn enemy of Allah and his messenger.]<\/p>\n<p style=\"text-align: justify;\">\nJust as a benefit, al-Najashi listed in al-Fehrest some of the man&#8217;s books, among them was a book called:<\/p>\n<p style=\"text-align: justify;\"><strong>كتاب التبديل والتحريف<\/strong><\/p>\n<p style=\"text-align: justify;\">&#8220;Kitab-ul-Tabdeel wal-Tahreef&#8221;<\/p>\n<p style=\"text-align: justify;\">It is no secret to any Arab speaker what this title implies. How can it be otherwise when he is a student of `Ali bin Ibrahim al-Qummi? They&#8217;re all masters of Tahreef.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>al-Salamu `Aleykum, Who is `Ali bin Ahmad al-Kufi? He is a big Shia scholar in his time, from the progeny of their Imam al-Jawad, his full name being `Ali bin Ahmad bin Musa bin Muhammad bin `Ali bin Musa bin <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/09\/12\/ali-bin-ahmad-al-kufi-and-tahreef\/\" title=\"`Ali bin Ahmad al-Kufi and Tahreef\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[],"class_list":{"0":"post-1411","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1411","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1411"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1411\/revisions"}],"predecessor-version":[{"id":1412,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1411\/revisions\/1412"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1411"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1411"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1411"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}