{"id":1424,"date":"2014-10-10T11:44:09","date_gmt":"2014-10-10T11:44:09","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1424"},"modified":"2018-10-30T14:50:10","modified_gmt":"2018-10-30T14:50:10","slug":"issues-of-ghaybah-part-10","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/10\/10\/issues-of-ghaybah-part-10\/","title":{"rendered":"Issues of Ghaybah [Part-10] &#8211; Is Ghaybah necessary to avoid Taqiyyah or is it Taqiyyah in and of itself?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1424\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and our Prophet,<\/p>\n<p style=\"text-align: justify;\">A man who did a considerable amount of damage to this great faith through his corruption and extremism, the leader of the Imamiyyah al-Shaykh al-Mufid, this man in a desperate attempt to defend the absence of his Imam ended up doing more damage to his own sect and cult than anything.<\/p>\n<p style=\"text-align: justify;\">The topic which was being discussed was the reason for the occultation and Ghaybah of the 12th Imam as opposed to his fathers who were never absent. In his book Rasa&#8217;il al-Ghaybah 3\/3 al-Mufid quotes his opponent&#8217;s argument:<\/p>\n<p style=\"text-align: justify;\"><strong>إذا كان السبب في الغيبة &#8211; التي طالت مدتها ، و امتدت بها الأيام &#8211; هو كثرة الأعداء والخوف على نفسه منهم ، فقد كان الزمن الأول على الأئمة من آبائه أصعب ، وكان أعداؤهم أكثر ، والخوف على أنفسهم أشد وأكثر ، ومع ذلك فإنهم كانوا ظاهرين ، ولم يستتروا ، ولا غابوا عن شيعتهم ، حتى أتاهم اليقين فهذا يبطل هذه العلة في الغيبة<\/strong><\/p>\n<p style=\"text-align: justify;\">[If the cause of this absence -which stretched for a long time- was the big number of enemies and his fear for himself, then (I argue that) the old days of his fathers were much harder and their enemies were more numerous, they feared so much more for themselves, yet they were still apparent and not hidden from their followers or absent, so that the followers may have certainty (of the truth) and this cancels out the excuse of his Ghaybah.]<\/p>\n<p style=\"text-align: justify;\">Al-Mufid replies to this on the next page 3\/4:<\/p>\n<p style=\"text-align: justify;\"><strong> إن الذي يظهر من أحوال الأئمة الماضين عليهم السلام أنهم أبيحت لهم التقية من الأعداء ، ولم يكلفوا بالقيام بالسيف مع الظهور ، لعدم مصلحة في ذلك ، ولم يكونوا ملزمين بالدعوة ، بل كانت المصلحة تقتضي الحضور في مجالس الأعداء ، والمخالطة لهم ، ولهذا أذاعوا تحريم إشهار السيوف عنهم ، وحظر الدعوة إليها ، لئلا يزاحم الأعداء ظهورهم وتواجدهم بين الناس . وقد أشاروا إلى مجئ منتظر يكون في أخر الزمان ، إمام منهم ، يكشف الله به الغمة ، ويحيي به السنة ، يهدي به الأمة ، لا تسعه التقية عند ظهوره <\/strong><\/p>\n<p style=\"text-align: justify;\">[What is apparent from the situation of the previous Imams (as) is that Taqiyyah was made permissible for them from their enemies, they were not ordered to rebel with the sword when apparent because there was no goodness or benefit from it. The previous Imams were not ordered to make Da`wah(preaching) but rather there were benefits from attending the gatherings of the enemies, and mixing with them, this is why they announced the impermissibility of unsheathing the sword and the impermissibility of calling to their right of leadership, so that the enemies may not interfere with their presence among the people. They (Imams) have pointed to the appearance of an awaited one at the end of times, an Imam just like them, through which Allah lifts the darkness and revives the Sunnah and guides the nation, he is incapable of Taqiyyah in his appearance.]<\/p>\n<p style=\"text-align: justify;\">He repeats the same words again in volume 4 of this book, so notice the dangerous idea that he is declaring here, that previous Imams were ordered to stick to Taqiyyah and not declare their leadership or rise with the sword.<\/p>\n<p style=\"text-align: justify;\">Here we ask the following question, isn&#8217;t it the popular Shi`ee belief that Imam al-Husayn led a religious revolution to reform? That he took a heroic stance which SAVED the religion and he stood against the tyrant Sultan? The Shia even commemorate this event and describe it as &#8220;The Husayni revolution&#8221;.<\/p>\n<p style=\"text-align: justify;\">On the other hand, we find that al-Mufid above turned the tables, he made it seem like his revolution with the sword is nothing but an act of disobedience since he was ordered to stick to Taqiyyah just like the rest of the Imams.<\/p>\n<p style=\"text-align: justify;\">We also observe that what al-Mufid is basically saying, is that previous Imams were present because they were allowed to make Taqiyyah, whereas the 12th one is not present because he is prohibited from doing Taqiyyah.<\/p>\n<p style=\"text-align: justify;\">Here is an issue&#8230;<\/p>\n<p style=\"text-align: justify;\">Taqiyyah in the tongue of the Arabs means to fear or to be cautious or wary of something, in order to protect oneself from it.<\/p>\n<p style=\"text-align: justify;\">We ask, isn&#8217;t the 12th Imam hiding out of caution and fear from his enemies, because if they discovered his true intentions they would harm him? Isn&#8217;t this LITERALLY Taqiyyah!<\/p>\n<p style=\"text-align: justify;\">So what we find is that even the 12th Imam is doing Taqiyyah, heck his Taqiyyah is much more than the Taqiyyah of his fathers before him! At least they would show their faces in public.<\/p>\n<p style=\"text-align: justify;\">Be informed dear reader that this contradicts al-Mufid&#8217;s words, when he claimed that the 12th Imam is prohibited from doing Taqiyyah unlike his fathers when he appears, yet we see that he already appeared since 1,250 years ago and has been doing Taqiyyah since. This is affirmed by the Shia philosopher and grand Marji&#8217;i al-Sayyed Muhammad Sa&#8217;eed al-Tabataba&#8217;ee al-Hakeem in his book &#8220;al-&#8216;Aqaed&#8221; tries to reply to the ones who say that the absence of the twelfth Imam contradicts the Shia belief that the nation needs a constant human guide to defend the religion and provide all the answers, in his answer in &#8220;Usool al-`Aqeedah&#8221; about the necessity of establishing the religious Imamah on page 241-242 he says:<\/p>\n<p style=\"text-align: justify;\"><strong>وإنما اضطر (عليه السلام) للغيبة بسبب التداعيات والمضاعفات التي جرّ إليها تقصير الناس في القيام بوظيفتهم إزاء الإمامة التي شرعها الله تعالى من أجل الغرض المذكور.<\/strong><br \/>\n<strong>فغيبته (صلوات الله عليه) في ذلك نظير تقية آبائه (صلوات الله عليهم) من الظالمين، أو سجن بعضهم، بحيث تعذر عليهم أداء وظيفتهم كاملاً في حفظ الدين من الضياع والخلاف<\/strong><\/p>\n<p style=\"text-align: justify;\">[&#8220;He (as) was forced into occultation (Ghaybah) because of the circumstances and the complications that came as a result of the people not fulfilling their obligations towards the divine Imamah that was ordered by Allah for the above mentioned reasons. So his Ghaybah (as) is like the Taqiyyah of his fathers (as) from the oppressors, or the imprisonment of some of them, in a way that they weren&#8217;t able to completely fulfill their duties in preserving the religion from being lost or corrupted.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Which brings us to the next question, didn&#8217;t the previous Imams get the 12th Imam into a lot of trouble by declaring that he shall destroy all the tyrants when he appears? Thus depriving us of his presence and of his guidance and Fatwas. Wouldn&#8217;t it have been better if the Imams simply said: &#8220;Allah will grant us victory when the time is right&#8221; instead of specifying that this victory is realized by the 12th descendant of `Ali?<\/p>\n<p style=\"text-align: justify;\">This opens up other questions, the most important of which is: WHY TWELVE LEADERS ONLY??? Why not 24 Imams, or 86 Imams? Or better yet, an unspecified number so that we can always be in the presence of an infallible until the time of judgement comes?<\/p>\n<p style=\"text-align: justify;\">Seems to me that &#8220;12&#8221; is an estimation which is way off.<\/p>\n<p style=\"text-align: justify;\">And peace be upon our Prophet Muhammad (saw) and his family and companions and all those who followed his guidance without succumbing to their desires and straying from the path of righteousness.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon our nation and our Prophet, A man who did a considerable amount of damage to this great faith through his corruption and extremism, the leader <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/10\/10\/issues-of-ghaybah-part-10\/\" title=\"Issues of Ghaybah [Part-10] &#8211; Is Ghaybah necessary to avoid Taqiyyah or is it Taqiyyah in and of itself?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-1424","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1424","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1424"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1424\/revisions"}],"predecessor-version":[{"id":4433,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1424\/revisions\/4433"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1424"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1424"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1424"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}