{"id":143,"date":"2013-04-15T15:11:33","date_gmt":"2013-04-15T15:11:33","guid":{"rendered":"http:\/\/twelvershia.net\/?p=143"},"modified":"2015-08-06T22:05:16","modified_gmt":"2015-08-06T22:05:16","slug":"response-to-assassination-attempt-on-the-prophet-saw","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/04\/15\/response-to-assassination-attempt-on-the-prophet-saw\/","title":{"rendered":"Response to: Assassination Attempt On The Prophet (saw)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=143\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>This is a response to the article published by RevisitingtheSalaf.org, on the 27<sup>th<\/sup> of February, 2012, that can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/02\/companions-attempt-to-kill-prophet.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">In this article, RTS tries to provide evidences that the closest companions of the Prophet (pbuh) attempted to assassinate him. RTS starts off by quoting a good, albeit vague narration:<\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Yazid, narrated <b>Al-Walid ibn Abdullah ibn Jumai<\/b> from Aboo Tufail (r.a) who said: &#8220;When the Prophet (saw) set out to go to the battle of Tabuk, he stopped at Uqbah and then commanded his caller to call that no one should take the path leading to Uqbah since the Prophet (saw) was travelling in that path and then whilst the Prophet had Ammar bin Yasir (r.a) pulling his camel from the front and Hudhaifah pushing from the back, <b>a group having their faces covered came on a caravan and attacked the Holy Prophet (saw).<\/b> Ammar (r.a) then came and attacked the masked men (May Allah (swt) Curse be upon them!) The Holy Prophet (saw) then said to Hudhaifah:‘Quickly pull forward, pull forward,’ then the Prophet (saw) came off the camel and asked Ammar (r.a) whether he had identified those people, Ammar (r.a) said:‘No, they were masked.’ The prophet (saw) asked: ‘Do you know what they wanted?’ Ammar (r.a) said: ‘Allah (swt) and his messenger (saw) know better.’The Prophet (saw) said: ‘They wanted to throw the Prophet (saw) off from the Uqbah.’<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">After that when Ammar (r.a) had a dispute with one of them (people who tried to kill the Prophet), Ammar (r.a) said to him: ‘I swear to you by Allah (swt), how many people of the Uqbah tried to attack the Prophet (saw)?’ The man said: ‘We think they were about fourteen.’ Ammar (r.a) said: ‘And if you were amongst them it would be fifteen.’ Three of them put forward this excuse to the Prophet(saw): &#8216;We did not hear the caller of the messenger of Allah (saw)&#8217;. Ammar ibn Yassir (r.a) said: &#8216;I bear testimony that the remaining twelve will fight Allah (swt) and His messenger (saw) in this world and on the day when the witnesses will be resurrected.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\">RTS then, quotes Ibn Hazm who comments on this narration by saying:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8220;Hudhaifah&#8217;s hadeeth is false, because it is narrated<b>through Walid ibn Jumai <\/b>– he is unreliable – it seems he does not know who fabricated the hadeeth, because he narrated <b>many reports in which state that Aboo Bakr,<\/b> <b>Umar,<\/b> <b>Uthmaan, Talha and Sa’d ibn Abi Waqas,<\/b> <b>attempted to murder the Holy Prophet (saw) by pushing him over from Al-Uqbah during Tabuk. This is a fabricated lie!&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">RTS then, links the two together by saying:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Ibn Hazim explicitly reveals they are numerous reports through Walid ibn Jumai in which the identities of Munafiqeen were revealed. The names of those who attempted to kill the Prophet (saw) were Aboo Bakr, Umar, Uthmaan, Talha and Sa&#8217;ad ibn Abi Waqas. But these narrations are no where to be found in any of the book of the so called &#8216;Ahl Sunnah&#8217; today. Where have these narrations gone? Is there a attempt to cover this plot?.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS goes on to defend Al-Waleed bin Jumai’, assuming that doing so would lead to some sort of authentication of the hadith. However, even if one would accept the narrations of Al-Waleed, this narration would still have to be rejected, for the simple reason that Ibn Hazm does not include his chain to Al-Waleed and the chain of Al-Waleed to the eye witness of the event. So, accepting such a narration, in which one knows a single narrator in a chain which could possibly consist of seven to nine narrators, is not reasonable. Keep in mind that Ibn Hazm is a fifth century scholar, which is why his chains are longer than average.<\/p>\n<p style=\"text-align: justify;\">And yet, RTS boasts:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">With such a prominent scholars praising Walid ibn Jumai they can remain not a shadow of doubt about the authenticity of these narrations.<\/span><\/p>\n<p style=\"text-align: justify;\">On a side note, it is also more than likely that this narration may have been a late fabrication, one that may have occurred in the fourth century, that has been falsely attributed to Al-Waleed bin Jumai’, since his biographies in various books of Rijal do not contain anything resembling such a narration. It should be noted that the scholars were meticulous about including the strange reports quoted by narrators to show their weakness. So, it is extremely unlikely that the Hadith scholars of the region, some of which even met Al-Waleed, made no mention of this narration, while a fifth century scholar that lived in Andalusia did. This explanation is surely more convincing than the theory that there was an attempt by Sunni scholars to “cover this plot”.<\/p>\n<p style=\"text-align: justify;\">RTS goes on to quote a narration in which Omar asks Huthaifah if he (Omar) is a hypocrite. The quote is as follows:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\">وقال مسدد : ثنا يحيى ، عن الأعمش ، عن زيد بن وهب ، قال : سمعت حذيفة رضي الله عنه ، يقول : &#8221; مات رجل من المنافقين فلم أصل عليه ، <b>فقال عمر رضي الله عنه <\/b><b>: <\/b><b>ما منعك أن تصلي عليه ؟ قلت : إنه منهم ،<\/b> <b>فقال :أبالله منهم أنا ؟ قلت : لا . قال : فبكى عمر<\/b><b> <\/b><b>رضي الله عنه<\/b> &#8221; <b>إسناده صحيح<\/b>، وقد استنكره يعقوب بن سفيان من حديث زيد بن وهب<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Musaddad said: Narrated Yahya from Al-A’mash from Zaid ibn Wahab who said: I heard Hudhaifah (may Allah be pleased with him), saying: &#8220;Another man of Munafiqeen died, and I will not pray on his funeral, <b>Umar then said: what prevents you to pray on him? I said: Because he was one of them, (Umar) said: By Allah am I also one of them?!<\/b> I said: &#8216;No.&#8217; Then Umar cried.<\/span><\/p>\n<p style=\"text-align: justify;\">It should be noted that the narration isn’t at all reliable since it is narrated by Sulaiman bin Mahran Al-A’amash who is a Mudalis (those that narrate from their teachers what they did not hear). See Mu’jam Al-Mudaliseen by Mohammad bin Tal’at p. 233-242. However, we will comment on the narration assuming that Al-A’amash did hear this hadith from Zaid bin Wahab in order to refute any doubts about Omar and his intentions.<\/p>\n<p style=\"text-align: justify;\">RTS comments:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Umar was asking a rather foolish question, and unintentionally revealed his true color&#8217;s by doing so. In response, Hudhaifah said: <b><i>&#8220;No you are not!&#8221;<\/i><\/b>. Did Umar not know if he was at Uqbah that night?<\/span><\/p>\n<p style=\"text-align: justify;\">This narration would not make any sense if Omar was asking about those from the `Aqaba, but rather, he was asking about the Munafiqeen in general. There is no evidence that suggests that Huthaifah only knew of the names of the hypocrites of Al-`Aqaba, and the only narration that supports that is the narration quoted by Ibn Lahee’a (who is unreliable according to the majority of Hadith scholars, see Tahtheeb Al-Tahtheeb p. 2\/411-414, Al-Risala, 1429, first edition), that was quoted by RTS in the beginning of the article.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Didn&#8217;t Umar know If He was a Munafiq or not ? Hudhaifah concealed this fact from him but more importantly why?. The answer is very clear, he was concealing the truth to spare his life. Suppose Hudhayfah would have said to Umar &#8220;That you are one of the Munafiqs&#8221; would Umar had speared his life? The actions of Hudhayfah should not come as a surprise.<\/span><\/p>\n<p style=\"text-align: justify;\">On the contrary, Huthaifah made it public that Omar was not a hypocrite by narrating this event to Zaid bin Wahb, the narrator from Huthaifah. Such an action implies that Huthaifah intentionally wanted people to know what he bore witness that Omar was not a hypocrite.<\/p>\n<p style=\"text-align: justify;\">Huthaifah, furthermore, praises Omar in more than one occasion after his death.<\/p>\n<p style=\"text-align: justify;\">We find in Fadha’il Al-Sahaba by Ahmad bin Hanbal 2\/404 (Dar Ibn Al-Jawzi, 1430, 4<sup>th<\/sup>edition) the following:<\/p>\n<p style=\"text-align: justify;\"><b>حدثنا عبد الله : قثنا هارون بن سفيان ، نا معاوية بن عمرو قثنا زائدة قثنا منصور ، عن ربعي بن حراش ، عن حذيفة قال : إن عمر لما استخلف كان الإسلام <\/b><b>كالرجل المقبل<\/b><b> ؛ لا يزداد إلا قربا ، فلما قتل عمر كان الإسلام كالرجل المدبر ؛ لا يزداد إلا بعدا .<\/b><b><\/b><\/p>\n<p style=\"text-align: justify;\">Abdullah narrated to us, that Harun bin Sufyan narrated to us, that Mu’awiya bin Amr, that Za’idah narrated to us, that Mansour narrated from Rib’ee bin Hirash, from Huthaifah, he said: When Omar received the caliphate, Islam was like a man that was approaching, who would continuously come closer, but when Omar was killed, Islam was like a man that was walking away, who continuously kept getting farther.<\/p>\n<p style=\"text-align: justify;\">We also find in Musanaf Abdulrazaq 11\/105 (Dar Ihya’a Al-Turath Al-Arabi, 1423, first edition) the following:<\/p>\n<p style=\"text-align: justify;\">أخبرنا عبد الرزاق عن معمر عن أيوب عن ابن سيرين قال : سئل حذيفة عن شئ ، فقال : إنما يفتي أحد ثلاثة : من عرف الناسخ والمنسوخ ، قالوا : ومن يعرف ذلك ؟ قال : عمر ، أو رجل ولى سلطانا فلا يجد بدا من ذلك ، أو متكلف (2).<\/p>\n<p style=\"text-align: justify;\">Abdulrazaq told us, from Ma’amar from Ayoub, from Ibn Sireen, that Huthaifah was asked something, he replied: Only three people can give out religious rulings, 1- Those that knew the abrogated laws, they asked: Who’d know that? He replied: Omar, 2- Or a man given a position that has no other choice but to, 3- Or a Mutakalif (one who acts greater than he actually is).<\/p>\n<p style=\"text-align: justify;\">Both narrations are authentic.<\/p>\n<p style=\"text-align: justify;\">So, as we can see, even after the death of Omar, Huthaifah still speaks of him with great praise. Declaring that Islam was closer to the people when he was alive and that he is one of knowledge of the abrogated laws. Both are of the highest forms of praise. That being the case, one has no choice but to hold the view that Huthaifah’s negation of Omar’s hypocrisy is to be taken at face value, and that there are no hidden meanings in the text.<\/p>\n<p style=\"text-align: justify;\">That being said, Omar’s words, and his relief upon hearing Huthaifah’s confirmation, shows that it was Omar’s personality that did not allow him to think highly of himself, constantly causing him to recheck his intentions to be sure that they were in order. It is known that performing good deeds in Islam, with intentions for anyone other than Allah (i.e. for the society, for family), is considered as a form of lesser hypocrisy, which is a trap that even the best of Muslims can fall into.<\/p>\n<p style=\"text-align: justify;\">RTS continues to argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The actions of Hudhayfah should not come as a surprise. On another occasion Hudhayfah deny&#8217;s what he had said before regarding Uthman and swears by Allah (swt). He conceals the truth and says that it is part of the religion to spare other part of it.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Ibn Abi Shaybah:<\/b> Narrated Abdullah ibn Nomair from Al-A’mash from Abdulmalik ibn Maysara from Al-Nazzal Ibn Sabra who said: Ibn Masoud and Hudhaifa entered upon Uthman, Uthman said to Hudhayfah  I have been informed that you have said such and such? Hudhayfah said: ‘No, by Allah (swt) I haven’t said that’, when they went out ibn Masoud he said to Hudhaifa: &#8216;What is wrong with you?! Why did you deny what I heard you say (about Uthman) before?&#8217; He said: &#8216;I spare parts of my religion with other parts of it, because of the fear to loose it completely&#8217;.<\/span><\/p>\n<p style=\"text-align: justify;\">The above narration is not relevant to the accusation that the companions of the Prophet (pbuh) attempted to take his life. The narration is vague, does not include any details, and suffers from the same weakness as the previous hadith, which is the Tadlees of Al-A’amash. (See above for details.)<\/p>\n<p style=\"text-align: justify;\">RTS goes on to quote Ibn Al-Qayyim, Abu Nu’aim, and Ibn Qutaibah, who all quote the same narration. However, these are either disconnected, or contain the same defect, which is the Tadlees of Al-A’amash, and the vagueness of the narration prohibits the possibility of linking the narration with the earlier narration of the hypocrites and their attempt to kill the Messenger (pbuh).<\/p>\n<p style=\"text-align: justify;\">On the other hand, we find a clear authentic Hadith about the position of Huthaifah towards Uthman in Tareekh Al-Madinah by Ibn Shibbah 2\/170 (Dar Al-Kutub Al-Ilmiyah, 1417, first edition):<\/p>\n<p dir=\"RTL\" style=\"text-align: justify;\"><b>حدثنا حبان بن هلال قال، حدثنا أبو الأشهب قال، حدثني حبيب بن الشهيد قال، حدثني الوليد، عن <\/b><b>جندب<\/b><b>رضي الله عنه قال: بلغنا حديث ذكره <\/b><b>حذيفة<\/b><b>بن اليمان رضي الله عنه في عثمان بن عفان رضي الله عنه فأنكرته من مثله لمثله، فأتيته عند صلاة الصبح فسلمت عليه ثلاثا فلم يؤذن لي فرجعت، فإذا رسوله قد أتبعني فردني، فدخلت عليه فقال: ما ردك ؟ فقلت: استأذنت &#8211; أو سلمت ثلاثا فلم يؤذن لي. فقال:أما إنك لو استأذنت أكثر من ذلك لم يؤذن لك. قال: وحسبتك نائما. قال: ما كنت لانام حتى أعلم من أين تطلع الشمس. قال: ما حديث بلغني عنك ذكرت به عثمان فأنكرته من مثلك لمثله ؟ فقال: قد كان بعض ذلك، أما إنهم قد ساروا إليه وهم قاتلوه. قلت:قاتلوه ؟ قال: قاتلوه &#8211; ثلاثا &#8211; قلت: فأين قتلته ؟ قال: في النار والله &#8211; قالها ثلاثا &#8211; قلت: فأين هو ؟ قال: في الجنة والله &#8211; قالها ثلاثا &#8211; ثم قال: أما إنها قد حضرت فتنة ففر منها. ثم قال: والله لانا أعلم بها من بطريق كذا وكذا. قلت: ما تأمرني ؟ قال:الزم الذي أنت عليه ولا تدعه إلى غيره فتضل.<\/b><b><\/b><\/p>\n<p style=\"text-align: justify;\">Hibban bin Hilal said: Abu Al-Ashhab narrated to us, he said: Habeeb bin Al-Shaheed narrated to us, he said: Al-Waleed narrated to me, from Jundub, that he said: We heard of statements from Huthaifah bin Al-Yaman (raa) about Uthman (raa), and I rejected that such a person could say such a thing about such a person, so I went to him at the morning prayer, greeted thrice, received no answer, and left. Then, a messenger brought me back to him, so I entered. He said: Why did you leave? I said: I asked permission – or – I greeted thrice and received no permission. He said: If you asked more than that (three times) you wouldn’t have been allowed entry. He said: I thought you were asleep. He said: I don’t sleep until I know where the sun comes from. He (Jundub) said: What is it about that I’ve heard about you about Uthman that I rejected from someone like you would say about someone like him?! He (Huthaifah): Some of that is happening, they are going to kill him. He said: Kill him? He said: Kill him – three times. He said: Where are his killers? He said: In the hellfire, Wallah! – he said it thrice. He (Jundub) said: What about him? He said: In heaven, Wallah! – He said it three times. Then he said: The Fitna has begun, so you should escape it. Then he said: I know more about it (the Fitna) than this path and that path. He said: And what do you suggest I do? He said: Stick to what you are upon now, and don’t leave it to another for that will cause you to go astray.<\/p>\n<p style=\"text-align: justify;\">The narration is authentic, and clearly shows that Huthaifah believed that Uthman is from the people of heaven.<\/p>\n<p style=\"text-align: justify;\">Finally, RTS actually provides a clear narration, where in which Huthaifah accuses a companion of being a Munafiq. This time though, it is Abu Musa Al-Ash’ari. He quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Al-A’mash from Shaqiq who said: We were sitting beside Hudhayfah and Abdullah (ibn Mas&#8217;ud) and Aboo Moosa (Al-Ash’ari) entered the mosque, Hudhaifa said: &#8216;One of these two is a Munafiq&#8217;, then he continue to say: &#8216;The most similar people to the Prophet (saw) in his character, his actions and manner is Abdullah. (i.e. Aboo Musa is the Munafiq).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: the narrators of this narration are trustworthy, and this narration is narrated in Al-Ma’rifa wa Al-Tarikh of Al-Fasawi.<\/span><\/p>\n<p style=\"text-align: justify;\">This narration, with this text, can only be found in the narration of Abdullah bin Numair from Al-A’amash. In all other chains and paths for this Hadith, we find the same text, but without the addition that Abu Musa was with Ibn Mas’ud. The first of these are the narrations of Abdulrahman bin Yazeed, from Huthaifah. (Sunan Al-Tirmithi, p. 863, Daralsalam, 1420, first edition.)<\/p>\n<p style=\"text-align: justify;\">As for the narrations of Abu Wa’el, also known as Shaqeeq, we find Al-A’amash narrating from him, along with several other narrators, however, the accusation against Abu Musa can only be found in the narration of Abdullah bin Numair. Other narrators that have narrated this from Al-A’amash include include Za’idah (Musnad Ahmad 16\/598, Dar Al-Hadith, 1416, first edition), Muhadhir (Al-Mustadrak, 4\/1204, Al-Maktaba Al-Asriya, 1427), Abu Ishaaq (Fadha’il Al-Sahaba 2\/1062, Dar Ibn Al-Jawzi, 1430, fourth edition), Abu Mu’awiyah Mohammad bin Khazim (Fadha’il Al-Sahaba, 2\/1063), and Mohammad bin Ubaid (see Musnad Ahmad 16\/597)<\/p>\n<p style=\"text-align: justify;\">Furthermore, Za’idah and Abu Mu’awiyah are two of the best known narrators from Al-A’amash, while Abdullah bin Numair is included in a lesser level, so whatever he narrators that conflicts with their narration from him would normally not be accepted. (See Tabaqat Al-Nasa’ee and their biographies in the books of Rijal). Yet, in this narration Abdullah bin Numair is including an addition that isn’t mentioned by six of Al-A’amash’s students, let alone the other chains from Abu Wa’el and Abdulrahman bin Yazeed from Huthaifah. In light of these facts, the addition in the text of the narration is to be rejected based upon the rules of the early hadith scholars.<\/p>\n<p style=\"text-align: justify;\">Another piece of evidence that suggests the weakness of the addition in the narration is that the two main narrators of this event, Abu Wa&#8217;el (in the six books) and Abdulrahman bin Yazeed (in Saheeh Muslim Al-Nasa&#8217;ee, and Ibn Majah), are both students of Abu Musa and continued to narrate from him after his death. (Tahtheeb Al-Kamal 3\/402 and 4\/490) It is not logical for them to narrate from Abu Musa if there was evidence that he was a hypocrite.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This is a response to the article published by RevisitingtheSalaf.org, on the 27th of February, 2012, that can be found here. In this article, RTS tries to provide evidences that the closest companions of the Prophet (pbuh) attempted to assassinate <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/04\/15\/response-to-assassination-attempt-on-the-prophet-saw\/\" title=\"Response to: Assassination Attempt On The Prophet (saw)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[17,18,19],"class_list":{"0":"post-143","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-abu-bakr","9":"tag-umar","10":"tag-uthman"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/143","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=143"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/143\/revisions"}],"predecessor-version":[{"id":2299,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/143\/revisions\/2299"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=143"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=143"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}