{"id":1442,"date":"2014-10-20T12:02:42","date_gmt":"2014-10-20T12:02:42","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1442"},"modified":"2014-10-20T17:36:34","modified_gmt":"2014-10-20T17:36:34","slug":"response-to-sunni-hadith-about-the-prophet-contemplating-suicide","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/10\/20\/response-to-sunni-hadith-about-the-prophet-contemplating-suicide\/","title":{"rendered":"Response to: Sunni Hadith about the Prophet Contemplating Suicide"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1442\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to ShiaPen’s article Sunni Hadith about the Prophet Contemplating Suicide. Found <a href=\"http:\/\/www.shiapen.com\/comprehensive\/sunni-hadith-and-suicidal-prophet.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">The topic of this article is quite clear. It deals with the narration in which the Prophet (salalahu alaihi wa salam) was said to have contemplated suicide. However, the ShiaPen team went further to deny the whole account regarding how prophet-hood was first revealed.<\/p>\n<p style=\"text-align: justify;\">The ShiaPen team attempt to break down the following hadith that was recorded by Al-Bukhari:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We read in Sahih Bukhari Volume 9, Book 87, Number 111:<\/span><br \/>\n<span style=\"color: #800000;\">Narrated Aisha:<\/span><br \/>\n<span style=\"color: #800000;\">The commencement of the Divine Inspiration to Allah’s Apostle was in the form of good righteous (true) dreams in his sleep. He never had a dream but that it came true like bright day light. He used to go in seclusion (the cave of) Hira where he used to worship (Allah Alone) continuously for many (days) nights. He used to take with him the journey food for that (stay) and then come back to (his wife) Khadija to take his food like-wise again for another period to stay, till suddenly the Truth descended upon him while he was in the cave of Hira. The angel came to him in it and asked him to read. The Prophet replied, “I do not know how to read.” (The Prophet added), “The angel caught me (forcefully) and pressed me so hard that I could not bear it anymore. He then released me and again asked me to read, and I replied, “I do not know how to read,” whereupon he caught me again and pressed me a second time till I could not bear it anymore. He then released me and asked me again to read, but again I replied, “I do not know how to read (or, what shall I read?).” Thereupon he caught me for the third time and pressed me and then released me and said, “Read: In the Name of your Lord, Who has created (all that exists). Has created man from a clot. Read and Your Lord is Most Generous…up to….. ..that which he knew not.” (96.15)<\/span><br \/>\n<span style=\"color: #800000;\">Then Allah’s Apostle returned with the Inspiration, his neck muscles twitching with terror till he entered upon Khadija and said, “Cover me! Cover me!” They covered him till his fear was over and then he said, “O Khadija, what is wrong with me? ” Then he told her everything that had happened and said, “I fear that something may happen to me.” Khadija said, “Never! But have the glad tidings, for by Allah, Allah will never disgrace you as you keep good reactions with your Kith and kin, speak the truth, help the poor and the destitute, serve your guest generously and assist the deserving, calamity-afflicted ones.” Khadija then accompanied him to (her cousin) Waraqa bin Naufal bin Asad bin ‘Abdul ‘Uzza bin Qusai. Waraqa was the son of her paternal uncle, i.e., her father’s brother, who during the Pre-Islamic Period became a Christian and used to write the Arabic writing and used to write of the Gospels in Arabic as much as Allah wished him to write. He was an old man and had lost his eyesight. Khadija said to him, “O my cousin! Listen to the story of your nephew.” Waraqa asked, “O my nephew! What have you seen?” The Prophet described whatever he had seen.<\/span><br \/>\n<span style=\"color: #800000;\">Waraqa said, “This is the same Namus (i.e., Gabriel, the Angel who keeps the secrets) whom Allah had sent to Moses. I wish I were young and could live up to the time when your people would turn you out.” Allah’s Apostle asked, “Will they turn me out?” Waraqa replied in the affirmative and said: “Never did a man come with something similar to what you have brought but was treated with hostility. If I should remain alive till the day when you will be turned out then I would support you strongly.” But after a few days Waraqa died and the Divine Inspiration was also paused for a while and the Prophet became so sad as we have heard that he intended several times to throw himself from the tops of high mountains and every time he went up the top of a mountain in order to throw himself down, Gabriel would appear before him and say, “O Muhammad! You are indeed Allah’s Apostle in truth” whereupon his heart would become quiet and he would calm down and would return home. And whenever the period of the coming of the inspiration used to become long, he would do as before, but when he used to reach the top of a mountain, Gabriel would appear before him and say to him what he had said before.<\/span><\/p>\n<p style=\"text-align: justify;\">However, before we even dissect the (not so well translated) hadith, ShiaPen have quoted a few fabrications in order to counter the hadith of Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 1:<\/strong> ShiaPen Attempt to Prove that the Prophet (salalahu alaihi wa salam) was a Prophet Since the Beginning of Time and Not During the Year 13 Before Hijrah.<\/p>\n<p style=\"text-align: justify;\">The first is a hadith from Mustadrak Al-Hakim:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Our position also finds support in this famous Hadith from Al-Mustadrak ala al-Sahihain, by al-Hakem, v2, p665:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">حدثنا أبو النضر الفقيه و أحمد بن محمد بن سلمة العنزي قالا : ثنا عثمان بن سعيد الدارمي و محمد بن سنان العوفي ثنا إبراهيم بن طهمان عن بديل بن ميسرة عن عبد الله بن شقيق عن ميسرة الفخر قال : قلت لرسول الله صلى الله عليه و سلم متى كنت نبيا ؟ قال : و آدم بين الروح و الجسد<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Maysra al-Fakhr said: I asked Allah’s Messenger, “Since when have you been a Prophet?” He replied: “Since Adam was between the soul and body”. <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Hakim commented: ’The chain is Sahih’ also Al-Dahabi commented: ’Sahih’<\/span><br \/>\n<span style=\"color: #800000;\">The said tradition can also be located in:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">1. Musanaf ibn Abi Shayba, v8, p438<\/span><br \/>\n<span style=\"color: #800000;\">2. Al-Mu’ajam al-Kabir, al-Tabarani, v20, p353<\/span><br \/>\n<span style=\"color: #800000;\">3. Al-Tabaqat al-Kubra, by ibn Saad, v1, p148<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">One can deduce from the above tradition that there was a state prior to his physical creation when Hazrat Muhammad (s) had been fashioned in a different state, a state wherein he was already a Prophet (s).<\/span><br \/>\n<span style=\"color: #800000;\">Being a prophet necessitates that he had been in contact with angels long before Adam (as) was created, and continued to do so till his earthly appearance. Therefore, seeing an angel should not be a new or disturbing thing to him, as some Sunni hadiths, which we will soon examine, suggest.<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is decent, however, in most sources, we don’t find the words متى كنت نبيا (when did you become a prophet?), but instead, we find متى كتبت نبيا (when was it written that you are to be a prophet?).<\/p>\n<p style=\"text-align: justify;\">These include earlier sources like Musnad Ahmad #19686, Al-Darimi’s Al-Raddu ‘ala Al-Jahmiya #124, Al-Sunnah by Ibn Abi Asim #329, and Musnad Al-Royani #1513. The strongest of chains to `Abdullah bin Shaqeeq are the ones who mention this.<\/p>\n<p style=\"text-align: justify;\">I add, it is strange that the Rafidah decide to rely on this narration, because `Abdullah bin Shaqeeq is described as follows:<\/p>\n<p style=\"text-align: justify;\">Ahmad ibn Hanbal said: &#8220;Reliable, and he used to bear a grudge against `Ali.&#8221;<\/p>\n<p style=\"text-align: justify;\">`Abdul-Rahman bin Yusuf said: &#8220;Reliable, and he was a `Uthmani, he disliked `Ali.&#8221;<\/p>\n<p style=\"text-align: justify;\">This is odd, since the Rafidah often insist that Ahlul-Sunnah should not narrate and take religious rulings from any Nasibi, yet when it suits them we find them quoting it happily.<\/p>\n<p style=\"text-align: justify;\">Furthermore, this narration was weakened as implied by Al-Tirmithi in Al-`Ilal (p. 395). He said: This was narrated by Hammad bin Zayd, Yazeed bin Zuray`, and others, from Budail bin Maysara from `Abdullah bin Shaqeeq that he said, “It was said to the Prophet (salalahu alaihi wa salam): When was it written that you are a prophet?” And they did not mention Maysara Al-Fajr.<\/p>\n<p style=\"text-align: justify;\">The criticism by Al-Tirmithi here displays his Imamah in the field of hadith sciences, as he was able to find this hidden defect with ease.<\/p>\n<p style=\"text-align: justify;\">Thus, the narration has a `Illah, it contains a Nasibi and has Ikhtilaaf fil-Matn, so it falls as an argument for the Rafidah.<\/p>\n<p style=\"text-align: justify;\">I add, the text itself is not explicit, for when Rasul-Allah (saw) said: &#8220;I was a prophet since Adam was between the soul and the body.&#8221; He (saw) could have simply meant: &#8220;Allah chose me as prophet when Adam etc&#8230;&#8221; not necessarily that he knew it or was informed of it until later on in his life, or &#8221; Allah had ordered the pen to write me as prophet since Adam etc&#8230;&#8221;, and both can be easily reconciled without effort and Takalluf especially since some texts do mention the &#8220;writing&#8221; and by doing so they explain the other Mutoun.<\/p>\n<p style=\"text-align: justify;\">The second narration is from Tanweer Al-Miqbaas min Tafseer Ibn Abbas:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Sayyidina Ibn Abbas (ra), in his commentary of the Qur’an 24:35, also has these comments, as recorded in Tanwîr al-Miqbâs min Tafsîr Ibn ‘Abbâs, available here:<\/span><\/p>\n<p><span style=\"color: #800000;\">“It is also said that the verse means: the likeness of the light of Muhammad in the loins of his forefathers is like this, up to Allah’s saying (… kindled from a blessed tree). He says: the light of Muhammad in Abraham was an upright religion (olive tree) , and Abraham was neither Jew nor Christian (neither of the East nor of the West), the works of Abraham would almost glow forth in the loins of his forefathers like this (would almost glow forth (of itself)), up until Allah’s saying (kindled from a blessed tree) He says: as if it is the light of Muhammad (pbuh) and if Abraham was not a prophet, he would still have this light (though no fire touched it); it is also said that the latter passage means: Had Allah not honoured Abraham, he would not have had this light; it is also said: if Allah had not honoured His believing servant with this light, he would not have had it”.<\/span><br \/>\n<span style=\"color: #800000;\">In short, Muhammad (s) was that light of Allah (swt) via which He (swt) guided His Prophets (as) and true believers. This supports the theory of his existence in the form of Light before Adam (as). Salafis should not deny this, particularly when we have the opinion of a leading Sahabi, Ibn Abbas (ra) whose superior knowledge of the Quran they attest to.<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is from the path of Ibn Al-Kalbi from Abi Salih from Ibn Abbas, and it is known to be one of the worst chains. See Mohammad bin Al-Sai’b and Abu Salih Bathaam’s biographies in the Tahtheebain.<\/p>\n<p style=\"text-align: justify;\">See Mabahith fi Uloom Al-Qur’an p. 373 by Manaa’a Al-Qataan for more about the poor status of this book that ShiaPen are quoting from.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then quote another hadith:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We also read this hadith:<\/span><br \/>\n<span style=\"color: #800000;\">حدثنا الحسن قثنا أحمد بن المقدام العجلي قثنا الفضيل بن عياض قثنا ثور بن يزيد عن خالد بن معدان عن زاذان عن سلمان قال سمعت حبيبي رسول الله صلى الله عليه و سلم يقول : كنت انا وعلي نورا بين يدي الله عز و جل قبل ان يخلق آدم بأربعة عشر ألف عام فلما خلق الله آدم قسم ذلك النور جزءين فجزء أنا وجزء علي عليه السلام<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“Salman said: I heard Allah’s beloved Messenger state: Ali and I were a light between Allah’s hands fourteen thousand years prior the creation of Adam, and when Allah created Adam he divided that light into two parts, one part is me and the other part is Ali”<\/span><\/p>\n<p style=\"text-align: justify;\">However, this too is a fabrication. We find in Lisan Al-Mizan 2\/284 that Al-Daraqutni said about al-Hasan bin `Ali al-`Adwi that he is matrook (very weak) and Ibn Adi accused him of fabricating narrations. Ibn Hajar said: This shaikh has little shame and doesn’t consider what he fabricates.<\/p>\n<p style=\"text-align: justify;\">Ibn Adi also said: Most of what he narrates, except for a little bit is fabricated, and we accused him of it, rather, we are convinced that he fabricated them.<\/p>\n<p style=\"text-align: justify;\">ShiaPen also quoted weak traditions from Nahj Al-Balagha and some late Sufi shaikhs that support these false notions. However, we declare these opinions as worthless for such matters are hidden in the realm of the unknown, and guesswork attributed to late scholars does not hold any weight in these matters without the Qur’an or Musnad Ahadith.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 2:<\/strong> ShiaPen Attempt to Show that the Hadith that the Prophet (salalahu alaihi wa salam) Contemplated Suicide as an Authentic Tradition.<\/p>\n<p style=\"text-align: justify;\">Moving on, ShiaPen quote the narration of Al-Bukhari and criticize the content. Much of the criticism revolves around their inability to accept that the Prophet (salalahu alaihi wa salam) was left confused and terrified by witnessing an angel in angelic form. However, these criticisms are clearly driven by bias and the ShiaPen team are clearly clutching at straws in order to weaken this narration in whichever way they can.<\/p>\n<p style=\"text-align: justify;\">The only real criticism was that they do not accept that the Prophet (salalahu alaihi wa salam) contemplated suicide. Ironically, we agree with ShiaPen on this issue, as well as Ibn Al-Hashimi who initially wrote the reasons as to why there is no solid proof that the Prophet (salalahu alaihi wa salam) contemplated such a thing.<\/p>\n<p style=\"text-align: justify;\">Ibn Al-Hashimi correctly argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\">If we look at the Hadith in question, it says:<\/span><br \/>\n<span style=\"color: #000080;\">…the Prophet became so sad as we have heard (fi ma balaghana) that he intended several times to throw himself from the tops of high mountains…<\/span><br \/>\n<span style=\"color: #000080;\">The narrator says “fi ma balaghana” which translates to “as we have heard”; …<\/span><br \/>\n<span style=\"color: #000080;\">The phrase “fi ma balaghani” was used by the Seerah authors to denote a degree of doubt. To denote an even higher degree of doubt, they would use the term “za’ama” (he alleged).<\/span><br \/>\n<span style=\"color: #000080;\">Az-Zuhri said: “Urwah told me on the authority of Aisha…”<\/span><br \/>\n<span style=\"color: #000080;\">Shaykh al-Islam Ibn Hajar explained in Fath al-Bari that this means that the addition of “fi ma balaghana” was an addition to the narration and it would be referred to as “Balaghaat az-Zuhri” only; Zuhri added it to Aisha’s narration based on what he had heard from other sources. Such an addition is considered Dhaeef (weak) because of the large gap between Zuhri and Aisha. Furthermore, this story is found in other sources but without Zuhri’s addition. Zuhri’s narration is graded as Mursal; Mursal means that the chain is “hurried” and incomplete, so we are in doubt of its authenticity. Everything Mursal by az-Zuhri is considered Dhaeef (weak) by the scholars of Hadith. Imam Yahya ibn Saeed al-Qattaan said: “Mursal az-Zuhri is worse than the Mursal of any other!”<\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen respond:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In addition to Imam Bukhari who personally deemed it a Sahih tradition, we see that Imam Ahmad ibn Hanbal recorded the tradition in his book ‘Musnad ibn Hanbal’ Volume 6 page 232 Hadith 26001 and the margin writer Shaykh Shu’aib al-Arnaout in his commentary of the said hadith stated:<\/span><br \/>\n<span style=\"color: #800000;\">إسناده صحيح على شرط الشيخين<\/span><br \/>\n<span style=\"color: #800000;\">“The chain is Sahih according to the standards of the two Sheikhs” <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Habban who sought to record only Sahih traditions in his book, also recorded the said tradition in his book ‘Sahih Ibn Haban’ Volume 1 page 216. Last but certainly not least, Imam of the Salafi cult, Al-Albaani pointed out the very ‘Balagh’ thing which Ibn al-Hashimi has and in fact stated:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“But he narrated this as Balagh, thus it’s disconnected, therefore we ranked it as a different hadith and gave it a different number”.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Despite this, Al-Albaani declared the tradition ‘Sahih’ in his book Mishkat al-Masabih, Volume 3 page 270 Hadith 5842:<\/span><br \/>\n<span style=\"color: #800000;\">وزاد البخاري : حتى حزن النبي صلى الله عليه وسلم – فيما بلغنا – حزنا غدا منه مرارا كي يتردى من رؤوس شواهق الجبل فكلما أوفى بذروة جبل لكي يلقي نفسه منه تبدى له جبريل فقال : يا محمد إنك رسول الله حقا . فيسكن لذلك جأشه وتقر نفسه<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Bukhari added: Until the prophet felt sad – as it has been narrated to us – and tried to throw himself from the top of the mountain, whenever he reached the edge of the top of the mountain to throw himself, Jebrail appeared to him and say: ‘O Muhammad, you are the messenger of God’. Then he (prophet) felt comfort.<\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen continue by providing names of scholars that have recording this report, like Ibn Al-Jawzi, Al-Lalka’ee, Al-Suyuti, and other contemporaries.<\/p>\n<p style=\"text-align: justify;\">We comment by first saying that Al-Albani weakened the narration in Al-Silsila Al-Dha’eefa #1052 and this book was written after Mishkat Al-Masabeeh, which means that it overrules his previous position.<\/p>\n<p style=\"text-align: justify;\">Even more important than that is the fact that nobody can strengthen this tradition with this disconnected chain. It doesn’t matter if a scholar claims that it is authentic, because that would simply be based upon wishful thinking since Al-Zuhri did not give evidence for this report.<\/p>\n<p style=\"text-align: justify;\">Perhaps the most obvious evidence that disconnected narrations are not necessarily authentic is the title of the book, which Al-Bukhari called: &#8220;The Authentic Connected Collection&#8221;, implying that the connected narrations are the authentic ones and anything disconnected does not fall under the condition of Bukhari.<\/p>\n<p style=\"text-align: justify;\">Al-Shaikh Muqbil was also aware that such narrations, for the simple reason of disconnection, were not considered as part of Al-Bukhari’s condition. He said: The Ta`leeq (disconnected narrations from the level of Al-Bukhari’s shyookh and above) are not of the condition of the Saheeh, which is why Al-Daraqutni rahimahu Allah didn&#8217;t criticize the Mu`allaq Ahadith. See Al-Fatawa Al-Hadeethiya 1\/114.<\/p>\n<p style=\"text-align: justify;\">Similarly, we the correct view is that this is not only for Ta`leeq, but rather, for all of Al-Bukhari’s disconnected traditions&#8230; and these matters are not hidden away from any student of the hadith sciences, but are known by even the youngest student.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then counter by arguing that Al-Zuhri’s disconnected traditions are acceptable in the eyes of Ahl Al-Sunnah. They argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">As for Ibn al-Hashimi’s comment that Zuhri’s words ‘as we have heard’ (fi ma balaghana) renders the tradition as ‘Mursal’ we would like to mention that Zuhri enjoyed such an esteemed rank amongst the esteemed Sunni Imams that even a Mursal of Zuhri is deemed authentic. We read in Al-Kifaya by Khatib al-Baghdadi, page 386:<\/span><br \/>\n<span style=\"color: #800000;\">أخبرنا محمد بن الحسين القطان قال أنا عبد الله بن جعفر بن درستويه قال ثنا يعقوب بن سفيان قال سمعت جعفر بن عبد الواحد الهاشمي يقول لأحمد بن صالح قال يحيى بن سعيد مرسل الزهري شبه لا شيء فغضب أحمد وقال ما ليحيى ومعرفة علم الزهري ليس كما قال يحيى<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ya’qub ibn Sufyan said: ‘I heard Ja’far ibn Abd al-Waheed al-Hashimi saying to Ahmad ibn Salih that Yahya ibn Sa’eed said: ‘The Mursal of al-Zuhri is unreliable’. Ahmad got angry and said: ‘What does Yahya know about the knowledge of Zuhri, that which Yahya said is untrue’’.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">This is a direct rebuttal to Ibn Hashimi’s citing of Yahya ibn Sa’eed al-Qattan, who rejected the Mursal of al-Zuhri. Yahya has been declared ignorant about the Mursal of al-Zuhri. Therefore, even if it is said that the embarrassing part was his interpolation, it would still be treated as authentic since he would never narrate from unreliable sources. This is why Imam Bukhari likewise recorded it in his Sahih.<\/span><\/p>\n<p style=\"text-align: justify;\">As for the opinion of Ahmad bin Salih, then this should be interpreted to mean that he believes that the disconnected reports of Al-Zuhri do have weight and that they can be used for support, not that they are authentic, as ShiaPen are trying to make them out to be.<\/p>\n<p style=\"text-align: justify;\">Of course ShiaPen usually translate narrations in a fashion that suits them, for example Yahya in the above text did not say al-Zuhri&#8217;s Maraseel are unreliable, he said: &#8220;The Mursal of al-Zuhri is equal to nothing.&#8221; Ahmad bin Salih replied angrily that this wasn&#8217;t true, he never said &#8220;reliable&#8221; but he never made it to be useless completely or &#8220;equal to nothing&#8221;, his Maraseel are useful especially as support.<\/p>\n<p style=\"text-align: justify;\">This is clear when we find that Ahmad bin Salih used to criticize Al-Zuhri’s narration from Abdulrahman bin Ka’ab, and said that he didn’t hear it. See Tuhfat Al-Tahseel p. 288. If he believed that all of Al-Zuhri’s reports are authentic, then why would he make such a criticism in the first place?<\/p>\n<p style=\"text-align: justify;\">Furthermore, the majority of the hadith scholars severely condemned Al-Zuhri’s disconnected reports. Husa Al-Shagheer quoted the following statements from hadith scholars:<\/p>\n<p style=\"text-align: justify;\">&#8211; Yahya bin Sa’eed Al-Qattan said: The disconnected reports of Al-Zuhri are worse than the disconnected reports of others, for he is a hafith, and he could name names, but wouldn’t name those that aren’t qualified or that he is embarrassed to name.<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Shafi’ee said: The disconnected reports of Al-Zuhri are like nothing, for we found him narrating from those like Sulaiman bin Arqam.<\/p>\n<p style=\"text-align: justify;\">&#8211; Ibn Ma’een said: The disconnected reports of Al-Zuhri are like nothing.<\/p>\n<p style=\"text-align: justify;\">&#8211; Ibn Al-Madeeni said: The disconnected reports of Al-Zuhri are terrible.<\/p>\n<p style=\"text-align: justify;\">See Al-Hadith Al-Mursal 1\/337.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then provide an alternative source in which they attempt to show that Al-Zuhri narrated this with a full chain:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ahmad b. ‘Uthman, known as Abu al-Jawza – Wahb b. Jarir – his father – al-Nu‘man b. Rashid – al-Zuhri – ‘Urwah – ‘A’ishah: The first form in which the revelation came to the Messenger of God was true vision; this used to come to him like the break of dawn. After that, he grew to love solitude and used to remain in a cave on Hira’ engaged in acts of devotion for a number of days before returning to his family. Then he would return to his family and supply himself with provisions for a similar number of days. This continued until the Truth came to him unexpectedly, and said: “Muhammad, you are the Messenger of God.” [Describing what happened next], the Messenger of God said, “I had been standing, but fell to my knees; and crawled away, my shoulders trembling. I went to Khadijah and said, ‘Wrap me up! Wrap me up!’ When the terror had left me, he came to me and said, ‘Muhammad, you are the Messenger of God.’”<\/span><br \/>\n<span style=\"color: #800000;\">He (Muhammad) said: I had been thinking of hurling myself down from a mountain crag, but he appeared to me, as I was thinking about this, and said, “Muhammad, I am Gabriel and you are the Messenger of God.” <\/span><br \/>\n<span style=\"color: #800000;\">In one of the discussion forums on the internet, someone made an attempt to prove that al-Nu’man bin Rashid is weak. Hence we would like to respond that Ibn Abi Hatim has authenticated him (Mizan al-Etidal, v4, p265) Yahya bin Mueen said: ‘He is Thiqah’ (Tarikh ibn Mueen, p318). Ibn Haban included him in his book of Thiqah narrators namely al-Thuqat. Imam Tirmidhi authenticated his narration (Sunnan al-Tirmidhi, v3, p319).<\/span><br \/>\n<span style=\"color: #800000;\">This shows that the al-Bukhari narration’s is not a rumour picked by al-Zuhri, Aisha actually narrated it, claiming to have heard it from the Messenger of Allah (s)!<\/span><\/p>\n<p style=\"text-align: justify;\">We disagree with ShiaPen in the way they are trying to portray this narrator. Firstly, Ibn Abi Hatim Al-Razi said no such thing. Al-Thahabi is referring to his father. However, when we return to Al-Jarh wal Ta’deel 8\/513 by Ibn Abi Hatim, we find him quoting his father saying: Al-Nu’man bin Rashid made a lot of mistakes, but he is truthful. Ibn Abi Hatim said: Al-Bukhari included his name in the book of weak narrators, and I heard my father said: His name is to be removed from that book.<\/p>\n<p style=\"text-align: justify;\">This implies that Abu Hatim didn&#8217;t “authenticate him”, as ShiaPen suggest, but rather, he weakened him but implied that he is not at a major level of weakness, even though he “makes a lot of mistakes”.<\/p>\n<p style=\"text-align: justify;\">As for Yahya bin Ma’een, we find him weakening Al-Nu’man bin Rashid more than once in his book. However, in one of the times, he refers to him as reliable. It is possible that he has two opinions regarding the man, however, we find that Ibn Abi Hatim, when quoting Al-Duri, who was a contemporary, and the narrator of Yahya bin Ma’een’s book, only quoting the statement in which he weakens Al-Nu’man bin Rashid. So, it seems as though this is the correct position.<\/p>\n<p style=\"text-align: justify;\">As for Ibn Hibban and his relatively easy going methods of statements of trustworthiness, then that is known even amongst the youngest students of knowledge.<\/p>\n<p style=\"text-align: justify;\">He was also weakened by Al-Nasa’ee, Al-Bukhari, Ahmad bin Hanbal, Al-Uqaili, Abu Dawud, Ali bin Al-Madeeni, and others.<\/p>\n<p style=\"text-align: justify;\">ShiaPen provide another narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Similarly there is another report by Zuhri in The History of al-Tabari, Volume 6 page 76 wherein he did not use “fi ma balaghana” :<\/span><br \/>\n<span style=\"color: #800000;\">Muhammad b. Abd al-Ala – Ibn Thawr – Mamar – al Zuhri:<\/span><br \/>\n<span style=\"color: #800000;\">“The inspiration ceased to come to the Messenger of God for a while, and he was deeply grieved. He began to go to the top of the mountain crags, in order to fling himself from them; but every time he reached from the summit of a mountain, Gabriel appeared to him and said to him, ‘You are the Prophet of God’. Thereupon his anxiety would subside and he would come back to himself. <\/span><br \/>\n<span style=\"color: #800000;\">This once again demonstrates that al-Zuhri attested to the veracity of the incident, and was not merely repeating an unsubstantiated rumour.<\/span><\/p>\n<p style=\"text-align: justify;\">It seems as though the ShiaPen team are not aware that the disconnection of the report remains a disconnection whether or not the late narrator uses the words “fi ma balaghana” or not. Nobody assumes that a contemporary scholar who narrated a narration from the Prophet (salalahu alaihi wa salam) is claiming to have heard it from him if he doesn&#8217;t use the words “fi ma balaghana”. Thus, the same should not be assumed when Al-Zuhri doesn&#8217;t use it.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 3:<\/strong> ShiaPen Accuse A’isha of Fabricating this Tradition.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Before we leave this topic area there is one thing that we have not discussed until now, but something that merits analysis, determining why such shameless narrations have come about in the first instance. It would be inappropriate to apportion exclusive blame to the descendants of Muawiyah, real blame should be apportioned to that individual that propagated such a shameless lie relating to the first revelation. When we examine the tradition we are analysing and indeed similar ones on this topic in Sahih Bukhari, we note that the narrator is one Aisha daughter of Abu Bakr, wife of the Prophet (s). Let us therefore pose one question for Ibn al Hashimi to explain to his readers:<\/span><br \/>\n<span style=\"color: #800000;\">How did Aisha narrate such precise details of the event when she had not yet been conceived?<\/span><br \/>\n<span style=\"color: #800000;\">The tragedy is the Nawasib happily reel of such traditions as Sahih on account of their being narrated by Aisha; they will after all insist ‘who knows a man better than his wife?’ The problem with this line of argument is simple, Aisha’s spousal relationship had not yet been secured, rather she had not even been conceived when this entire episode transpired! Remember the tradition is not one wherein Aisha is narrating that which the Prophet (s) cascaded to her; rather it begins on her authority that which she knows as an eye witness. She never came into contact with the Mother of Faithful Khadija (as), she never even saw her.<\/span><\/p>\n<p style=\"text-align: justify;\">This is by far the most ironic argument in the article. ShiaPen were just trying to force Sunnis to accept the disconnected traditions of Al-Zuhri and now they are having issues with a tradition because A’isha wasn’t an eye witness. Luckily, she lived with the Prophet (salalahu alaihi wa salam) for ten years, which is why it is not likely that she would have received this information from anyone other than him.<\/p>\n<p style=\"text-align: justify;\">It is also ironic that ShiaPen would raise such an issue when nine out of their twelve Imams never met the Prophet (salalahu alaihi wa salam), and yet, they find the idea that these Imams narrated from anyone other than him to be preposterous.<\/p>\n<p style=\"text-align: justify;\">In any case, ShiaPen’s main concerns apart from the idea that the Prophet (salalahu alaihi wa salam) contemplated suicide (which has been refuted above), is the idea that he was afraid of the angel, and that his reaction was overdone.<\/p>\n<p style=\"text-align: justify;\">Luckily, we do have another narration in the Saheehain, from the path of Jabir bin Abdullah Al-Ansari who said:<\/p>\n<p style=\"text-align: right;\">حدثنا عبد الله بن يوسف أخبرنا الليث قال حدثني عقيل عن ابن شهاب قال سمعت أبا سلمة قال أخبرني جابر بن عبد الله رضي الله عنهما أنه سمع النبي صلى الله عليه وسلم يقول ثم فتر عني الوحي فترة فبينا أنا أمشي سمعت صوتا من السماء فرفعت بصري قبل السماء فإذا الملك الذي جاءني بحراء قاعد على كرسي بين السماء والأرض فجئثت منه حتى هويت إلى الأرض فجئت أهلي فقلت زملوني زملوني فأنزل الله تعالى<\/p>\n<p style=\"text-align: right;\">{ يا أيها المدثر قم فأنذر إلى قوله والرجز فاهجر }<\/p>\n<p style=\"text-align: justify;\">[Narrated Jabir bin `Abdullah: that he heard the Prophet saying, &#8220;The Divine Inspiration was delayed for a short period but suddenly, as I was walking. I heard a voice in the sky, and when I looked up towards the sky, to my surprise, I saw the angel who had come to me in the Hira Cave, and he was sitting on a chair in between the sky and the earth. I was so frightened by him that I fell on the ground and came to my family and said (to them), &#8216;Cover me! (with a blanket), cover me!&#8217; Then Allah sent the Revelation: &#8220;O, You wrapped up (In a blanket)! (Arise and warn! And your Lord magnify And keep pure your garments, And desert the idols.&#8221; (74.1-5)]<\/p>\n<p style=\"text-align: justify;\">Although, one authentic chain was already more than enough to prove this.<\/p>\n<p style=\"text-align: justify;\">&#8230;and Alhamdulillah rab al-alameen.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to ShiaPen’s article Sunni Hadith about the Prophet Contemplating Suicide. Found here. The topic of this article is quite clear. It deals with the narration in which the Prophet (salalahu alaihi wa salam) was said <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/10\/20\/response-to-sunni-hadith-about-the-prophet-contemplating-suicide\/\" title=\"Response to: Sunni Hadith about the Prophet Contemplating Suicide\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-1442","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1442","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1442"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1442\/revisions"}],"predecessor-version":[{"id":1445,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1442\/revisions\/1445"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1442"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1442"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1442"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}