{"id":1468,"date":"2014-10-26T19:50:05","date_gmt":"2014-10-26T19:50:05","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1468"},"modified":"2015-06-06T08:55:12","modified_gmt":"2015-06-06T08:55:12","slug":"the-teachers-of-ali-bin-al-husayn","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/10\/26\/the-teachers-of-ali-bin-al-husayn\/","title":{"rendered":"The Teachers of `Ali bin al-Husayn"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1468\" alt=\"\" \/><strong>Imams from Ahlulbayt according to Twelvers:<\/strong><\/p>\n<p>&nbsp;<\/p>\n<blockquote><p>1-Al-Husayn bin `Ali<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَخْبَرَهُ، أَنَّ عَلِيًّا عَلَيْهِ السَّلَام، قَالَ: كَانَتْ لِي شَارِفٌ مِنْ نَصِيبِي مِنَ الْمَغْنَمِ، وَكَانَ النَّبِيُّ أَعْطَانِي<\/strong><\/p>\n<p>[Sahih al-Bukhari]<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p><strong>Other members from Ahlulbayt (Includes their servants):<\/strong><\/p>\n<p>&nbsp;<\/p>\n<blockquote><p>2- `Abdullah ibn `Abbas<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْد، قَالَ حَسَنٌ: حَدَّثَنَا يَعْقُوبُ، وَقَالَ عَبد: حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حدثنا أبى عَنْ صَالِحٍ، عَنْ ابْنِ شِهَابٍ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، قال: أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ مِنْ الْأَنْصَارِ<\/strong><\/p>\n<p>[Sahih Muslim]<\/p>\n<p>&nbsp;<\/p>\n<p>3-`A’ishah bint Abu Bakr (Umm-ul-Mu’mineen)<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنّ النَّبِيَّ : كَانَ يُقَبِّلُ وَهُوَ صَائِمٌ<\/strong><\/p>\n<p>[Sahih Muslim]<\/p>\n<p>&nbsp;<\/p>\n<p>4-Safiyyah bint Huyay (Umm-ul-Mu’mineen)<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ: أَخْبَرَنِي عَلِيُّ بْنُ الْحُسَيْنِ رَضِيَ اللَّهُ عَنْهُ: أَنَّ صَفِيَّةَ زَوْجَ النَّبِيِّ أَخْبَرَتْهُ، أَنَّهَا جَاءَتْ إِلَى رَسُولِ اللَّهِ<\/strong><\/p>\n<p>[Sahih al-Bukhari]<\/p>\n<p>&nbsp;<\/p>\n<p>5-Umm Salamah (Umm-ul-Mu’mineen)<\/p>\n<p>&nbsp;<\/p>\n<p><strong>أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ، أَخْبَرَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ أُمِّ سَلَمَةَ،  قَالَتْ: أَكَلَ رَسُولُ اللَّهِ<\/strong><\/p>\n<p>[Tabaqat ibn Sa`d]<\/p>\n<p>&nbsp;<\/p>\n<p>6-Umm Abeeha bint `Abdullah bin Ja`far bin abi Talib<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا أَبُو خَلِيفَةَ الْفَضْلُ بْنُ الْحُباب، ثنا عَلِيُّ بْنُ الْمَدِينِيِّ، ثنا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي أَبَانُ بْنُ صَالِحٍ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ بِنْتِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ الَّتِي عِنْدَ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، عَنْ أَبِيهَا عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ عَلِيُّ بْنُ حُسَيْنٍ وَكَانَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ رَضِيَ اللَّهُ عَنْهُمَا، يَقُولُ: عَلَّمَنِي عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ كَلِمَاتٍ أَقُولُهُن<\/strong><\/p>\n<p>[Al-Du`a’ lil-Tabarani]<\/p>\n<p>&nbsp;<\/p>\n<p>7-Zaynab bint Umm Salamah (Rabeebat Rasul-Allah (saw))<\/p>\n<p>&nbsp;<\/p>\n<p><strong>أَخْبَرَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ الْمَدَنِيُّ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: أَكَلَ رَسُولُ اللَّهِ<\/strong><\/p>\n<p>[Musnad Ishaq bin Rahawayh]<\/p>\n<p>&nbsp;<\/p>\n<p>8-Aslam abu Rafi` (Mawla Rasul-Allah (saw))<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَسَدِيُّ، عَنْ شَرِيكٍ، عَنِ ابْنِ عَقِيلٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ أَبِي رَافِعٍ، قَالَ: قَالَتْ فَاطِمَةُ: يَا رَسُولَ اللَّهِ، أَلا أَعُقُّ<\/strong><\/p>\n<p>[Musannaf  ibn abi Shaybah]<\/p>\n<p>&nbsp;<\/p>\n<p>9-`Ubaydullah ibn abu Rafi` (Ibn Mawla Rasul-Allah (saw))<\/p>\n<p>&nbsp;<\/p>\n<p><strong>نا يَحْيَى بْنُ آدَمَ، قَالَ: نا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشٍ، عَنْ زَيْدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ قَالَ: &#8221; مِنًى كُلُّهَا مَنْحَرٌ<\/strong><\/p>\n<p>[Musannaf ibn abi Shaybah]<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p><strong>Teachers from outside Ahlulbayt (Sahabah and Tabi`een and Atba`):<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<blockquote><p>10-Abu Hurayrah<\/p>\n<p>&nbsp;<\/p>\n<p><strong>أَخْبَرَنَاهُ أَبُو الْقَاسِمِ زَاهِرُ بْنُ طَاهِرٍ، أَنَا أَبُو سَعْدٍ أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُوسَى الْمُقْرِئُ، أَنَا أَبُو الْحَسَنِ مُحَمَّدُ بْنُ عَلِيِّ بْنِ سَهْلٍ الْمَاسَرْجِسِيُّ، أَنَا أَحْمَدُ بْنُ مِهْرَانَ ـ إِمْلاءً، بِمِصْرَ ـ، نَا فَهْدُ بْنُ سُلَيْمَانَ، نَا أَصْبَغُ بْنُ الْفَرَجَ، نَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا السَّمْحِ، حَدَّثَهُ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّه قَالَ: سَأَلَ مُوسَى رَبَّهُ<\/strong><\/p>\n<p>[Tareekh Dimashq]<\/p>\n<p>&nbsp;<\/p>\n<p>11-Jabir bin `Abdullah al-Ansari<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-size: 13px;\"><strong>ثنا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ: &#8221; أَنَّ رَسُولَ اللَّهِ  مَكَثَ بِالْمَدِينَةِ تِسْعَ سِنِينَ لَمْ يَحُجَّ<\/strong><\/span><br \/>\n[Sahih ibn Khuzaymah]<\/p>\n<p>&nbsp;<\/p>\n<p>12-Al-Miswar bin Makhramah<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، أَنَّ الْوَلِيدَ بْنَ كَثِيرٍ حَدَّثَهُ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدُّؤَلِيِّ حَدَّثَهُ، أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ، أَنَّ عَلِيَّ بْنَ حُسَيْنٍ حَدَّثَهُ، أَنَّهُمْ حِينَ قَدِمُوا الْمَدِينَةَ مِنْ عِنْدِ يَزِيدَ بْنِ مُعَاوِيَةَ مَقْتَلَ حُسَيْنِ بْنِ عَلِيٍّ رَحْمَةُ اللَّهِ عَلَيْهِ لَقِيَهُ الْمِسْوَرُ بْنُ مَخْرَمَةَ، فَقَالَ لَهُ: هَلْ لَكَ إِلَيَّ مِنْ حَاجَةٍ<\/strong><\/p>\n<p>[Sahih al-Bukhari]<\/p>\n<p>&nbsp;<\/p>\n<p>13-Malik bin Rabee`ah abu Usayd al-Ansari<\/p>\n<p>&nbsp;<\/p>\n<p><strong>أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ أَبَا أَسِيدٍ الأَنْصَارِيَّ قَدِمَ بِسَبْيٍ مِنَ الْبَحْرَيْنِ<\/strong><\/p>\n<p>[Al-Awsat li ibn al-Mundhir]<\/p>\n<p>&nbsp;<\/p>\n<p>14-Al-Rubayyi` bint Mu`awwidh al-Ansariyah<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمَّادٍ، ثنا الْعَبَّاسُ بْنُ يَزِيدَ، نا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ، أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ أَرْسَلَهُ إِلَى الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ يَسْأَلُهَا عَنْ وُضُوءِ رَسُولِ اللَّهِ<\/strong><\/p>\n<p>[Sunan al-Daraqutni]<\/p>\n<p>&nbsp;<\/p>\n<p>15-Sa`eed bin al-Musayyib<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا الْحُسَيْنُ بْنُ إِسْحَاقَ التُّسْتَرِيُّ، وَإِبْرَاهِيمُ بْنُ هَاشِمٍ الْبَغَوِيُّ، قَالا: ثنا أُمَيَّةُ بْنُ بِسْطَامَ، ثنا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ إِسْرَائِيلَ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ حَدَّثَهُ، أَنَّ رَسُولَ اللَّهِ قَالَ لِعَلِيٍّ<\/strong><\/p>\n<p>[Mu`jam al-Tabarani al-Kabir]<\/p>\n<p>&nbsp;<\/p>\n<p>16-Dhakwan abu Salih al-Samman (Mawla Umm-ul-Mu’mineen)<\/p>\n<p>&nbsp;<\/p>\n<p><strong>أنا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالا: نا مُحَمَّدٌ، نا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ ذَكْوَانَ، مَوْلَى عَائِشَةَ، قَالَتْ: قَدِمَ رَسُولُ اللَّهِ لأَرْبَعٍ بَقِينَ مِنْ ذِي الْحِجَّةِ<\/strong><\/p>\n<p>[Hadith Shu`bah lil-Nasa’i]<\/p>\n<p>&nbsp;<\/p>\n<p>17-Zirr bin Hubaysh<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا أَبُو أَحْمَدَ، قال: حَدَّثَنَا مِسْعَرٌ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، وَعَاصِمٍ، عَنْ زِرٍّ، عَنْ عَائِشَةَ، رضي الله عنها، قالت: مَا تَرَكَ النَّبِيُّ<\/strong><\/p>\n<p>[Tareekh ibn Shubah]<\/p>\n<p>&nbsp;<\/p>\n<p>18-Sa`eed bin Marjanah<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ أَبِي غَسَّانَ مُحَمَّدِ بْنِ مُطَرِّفٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ سَعِيدِ بْنِ مَرْجَانَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ  قَالَ: &#8221; مَنْ أَعْتَقَ رَقَبَةً مُسْلِمَةً<\/strong><\/p>\n<p>[Sahih al-Bukhari]<\/p>\n<p>&nbsp;<\/p>\n<p>19-`Amro bin `Uthman bin `Affan<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا سَعْدَانُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ، عَنْ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّهُ قَالَ زَمَنَ الْفَتْحِ: يَا رَسُولَ اللَّهِ، أَيْنَ تَنْزِلُ غَدًا<\/strong><\/p>\n<p>[Sahih al-Bukhari]<\/p>\n<p>&nbsp;<\/p>\n<p>20-Marwan bin al-Hakam<\/p>\n<p>&nbsp;<\/p>\n<p><strong>حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ، قَالَ: شَهِدْتُ عُثْمَانَ، وَعَلِيًّا رَضِيَ اللَّهُ عَنْهُمَا<\/strong><\/p>\n<p>[Sahih al-Bukhari]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This last one deserves some clarification as I&#8217;m sure it sounds odd to a lot of readers. The question will be, &#8220;How can Marwan be a teacher of `Ali bin Husayn? What knowledge did Marwan have?&#8221; The answer is that the word &#8220;teacher&#8221; is a technical term used in Hadith sciences, it doesn&#8217;t mean that `Ali was a student in a classroom who listened to lectures from the likes of Marwan. The word teacher here is &#8220;Shaykh&#8221; in Arabic, if Zayd heard a narration from `Amr and narrated it to us then in Hadith sciences we say &#8220;`Amr is a teacher\/Shaykh of Zayd.&#8221; Even if Zayd never narrated anything except one narration and even if he had more knowledge, yet technically `Amr is referred to as the Shaykh or teacher of Zayd. To conclude, `Ali ibn Husayn narrated to us something that Marwan said, an event between `Uthman ibn `Affan and `Ali ibn abi Talib that he had witnessed before `Ali bin Husayn was born.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Imams from Ahlulbayt according to Twelvers: &nbsp; 1-Al-Husayn bin `Ali &nbsp; حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَخْبَرَهُ، أَنَّ عَلِيًّا عَلَيْهِ السَّلَام، قَالَ: كَانَتْ <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/10\/26\/the-teachers-of-ali-bin-al-husayn\/\" title=\"The Teachers of `Ali bin al-Husayn\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-1468","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1468","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1468"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1468\/revisions"}],"predecessor-version":[{"id":2073,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1468\/revisions\/2073"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1468"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1468"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1468"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}