{"id":1487,"date":"2014-11-01T15:10:14","date_gmt":"2014-11-01T15:10:14","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1487"},"modified":"2015-11-11T12:39:57","modified_gmt":"2015-11-11T12:39:57","slug":"rasul-allah-saw-and-the-divine-order-of-imamah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/11\/01\/rasul-allah-saw-and-the-divine-order-of-imamah\/","title":{"rendered":"Rasul-Allah (saw) and the divine order of Imamah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1487\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In this article we shall discuss the following InshaAllah:<\/p>\n<p><strong>1- How Rasul-Allah (saw) would make the fundamental pillars of Islam deeply rooted in Society.<\/strong><\/p>\n<p><strong>2- The Madhabi Shia Imamah with its two branches, a brief definition of each:<\/strong><\/p>\n<blockquote><p><strong>a- Religious Imamah: Hadith of Thaqalayn &amp; Madinat-ul-`Ilm.<\/strong><\/p>\n<p><strong>b- Political Imamah: Hadith of Ghadeer &amp; al-Manzilah.<\/strong><\/p><\/blockquote>\n<p style=\"text-align: justify;\">The Imami Madhab of the Shia preaches the concept of Imamah, this theory for them is divided into two parts:<\/p>\n<p style=\"text-align: justify;\">Political Imamah: The divine appointment of `Ali as ruler having absolute authority over all matters related to running the Muslim government, only those of his descendants from Fatimah who are in constant contact with the heavens can reach this position.<\/p>\n<p style=\"text-align: justify;\">Religious Imamah: The divine appointment of `Ali as religious leader and spiritual successor to the Prophet (saw), the correct religion with all its interpretations and rulings can only be acquired from him, he knows all that the Messenger (saw) knows and he was told many secret rulings that can only be attained through him.<\/p>\n<p style=\"text-align: justify;\">For the common Arabs and the average desert dwellers, this &#8220;form&#8221; of Imamah is unfamiliar, before the advent of Islam these two branches of Imamah were simply as follows:<\/p>\n<p style=\"text-align: justify;\">Political: Either a group of people gather and appoint a man as their leader and chief, or a man of considerable intellect or might forces his leadership on a group of people.<\/p>\n<p style=\"text-align: justify;\">Religious: An elder who studied the religious scriptures or learned under the scholars of his time may assume a position of leadership in religious affairs or become a member of the leading religious counsel in his town or tribe.<\/p>\n<p style=\"text-align: justify;\">As you can see, the theory of Imamah brought fourth by the Madhabi Imami Shia is much different than what the Arabs were familiar with, it is alien to them to say the least. Thus in order to introduce such a theory to society, Allah must clarify it, must explain it and then He must pave the way for it to become a practical matter, a norm deeply rooted in the people so they may continue their journey by applying it in their daily lives even after the passing of the Messenger (saw).<\/p>\n<p style=\"text-align: justify;\">Muhammad ibn `Abdillah (saw) lived 23 years among the Muslims as a prophet, during this time he attempted and succeeded in integrating and deeply rooting the fundamentals of Islam into the Arabian society.<\/p>\n<p style=\"text-align: justify;\">Prayer for instance is one of the first commandments to be revealed on our master Muhammad (saw), and he would pray in congregation five times daily, and he made sure that everyone prayed and attended, he praised the congregation and promised many rewards, he even threatened to burn the houses of certain men who insisted on skipping the congregation out of laziness, he advised the people to observe his prayer and follow his movements. The Prophet (saw) recommended voluntary prayers for many occasions, and when in his absence or sickness, he always appointed a man to lead the people, even when he never appointed one, the Muslims themselves would do it as prayer has become deeply rooted in society, it became the norm.<\/p>\n<p style=\"text-align: justify;\">Fasting is the obligatory duty in Ramadan, the Prophet (saw) always fasted and ordered fasting, he promised many rewards for those who did and recommended voluntary fasting for those who can, he explained to the believers in detail the rules and laws of the Islamic fast, he also fasted every Monday and Thursday, and in certain blessed months he would also fast. The practice of fasting became the norm in Islamic society and the Muslims continued to fast as they always did to our day.<\/p>\n<p style=\"text-align: justify;\">Charity was made obligatory for the Muslims, the act of slaughtering and offering to the poor, giving them from one&#8217;s own wealth, all of these were heavily practiced by Rasul-Allah (saw) in his life, the details about the obligatory charity became widespread in the life of the Prophet (saw), and voluntary charity was practiced regularly by all who can afford it in Muslim society.<\/p>\n<p style=\"text-align: justify;\">The pilgrimage was also made obligatory and it was the last order that Allah revealed on his messenger (saw), this is why it was practiced for less years. The Prophet (saw) wished to also establish this pillar in society, so he began with `Umrah, which is almost exactly the same as Hajj since they would shave and make Ihram and Tawaf and walk between Safa and Marwa, and he did it four times in his life, then finally when the disbelievers were kicked out of Makkah, he order Abu Bakr to lead the believers as the prince of Hajj and to teach them its rulings, and in the following year he (saw) himself led the believers to Hajj and repeated those same exact rituals again for all to see. The rituals of Hajj had become very common and known to all the Muslims who would later teach it to their children.<\/p>\n<p style=\"text-align: justify;\">Aside from all of this, these fundamentals were clearly stated in the Qur&#8217;an, not only that but the book of Allah touched on many of their rulings and laws, such as:<\/p>\n<p style=\"text-align: justify;\">{O you who have believed, do not approach prayer while you are intoxicated until you know what you are saying or in a state of janabah, except those passing through [a place of prayer], until you have washed [your whole body]. And if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and find no water, then seek clean earth and wipe over your faces and your hands [with it]. Indeed, Allah is ever Pardoning and Forgiving.} [4:43]<\/p>\n<p style=\"text-align: justify;\">{And complete the Hajj and &#8216;umrah for Allah. But if you are prevented, then [offer] what can be obtained with ease of sacrificial animals. And do not shave your heads until the sacrificial animal has reached its place of slaughter. And whoever among you is ill or has an ailment of the head [making shaving necessary must offer] a ransom of fasting [three days] or charity or sacrifice. And when you are secure, then whoever performs &#8216;umrah [during the Hajj months] followed by Hajj [offers] what can be obtained with ease of sacrificial animals. And whoever cannot find [or afford such an animal] &#8211; then a fast of three days during Hajj and of seven when you have returned [home]. Those are ten complete [days]. This is for those whose family is not in the area of al-Masjid al-Haram. And fear Allah and know that Allah is severe in penalty.} [2:196]<\/p>\n<p style=\"text-align: justify;\">{And whatever you give for interest to increase within the wealth of people will not increase with Allah. But what you give in zakah, desiring the countenance of Allah &#8211; those are the multipliers.} [30:39]<\/p>\n<p style=\"text-align: justify;\">On the other hand, both the political Imamah and religious Imamah of `Ali -as understood by Imamiyyah- were not given this treatment.<\/p>\n<p style=\"text-align: justify;\">You may argue that there is a Hadith by a single individual here or a single individual there that praises `Ali, or shows a virtue he has, or a merit BUT these are nothing more than Ahad narrations, most of which teach us to love `Ali and his family. However, not much is stated when it comes to his political or religious leadership, and the praise he received others had received mostly similar praise, as for the narrations that are claimed to be proofs for his leadership, a great difference of opinion surrounds their texts and chains of transmission, in most cases they are nothing more than Ahad narrations attributed to certain individuals here or there, but never a widespread phenomenon or a practice in society.<\/p>\n<p style=\"text-align: justify;\">As far as the Qur&#8217;an is concerned, in Allah&#8217;s book there is no explanation or clarification for the Madhabi Imami Shia understanding of neither their political nor their religious Imamah. The Qur&#8217;an is very general in discussing how the Muslims must run their affairs, it recommends consultation, and it advises the believers to obey those of them in authority. No mention of `Ali, banu Hashim or the descendants of `Ali was made clear; the status of the leaders was not explained in the way the Shia understand it, that they are infallible and divinely appointed, that they&#8217;re in direct contact with the heavens, that the matters of politics and religion all return to them, they are the successors of the divine message and its masters and finally that it is prohibited for the Muslims to select their own leaders. As for religious matters, it is even more unclear as Allah tells us to follow the way of the first forerunners from the Mouhajiroun and the Ansar, then in another verse it tells us to follow the path of the believers, and in another it tells us to ask the people of knowledge in revelation, all of which are very general.<\/p>\n<p style=\"text-align: justify;\"><strong>-Let us begin with the religious Imamah:<\/strong><\/p>\n<p style=\"text-align: justify;\">The Ahlul-Sunnah and the Imami sect of the Shia are both in agreement that we as Muslims receive our knowledge primarily from the Qur&#8217;an, and then from the Sunnah of the Prophet of Islam peace be upon him. Where is the disagreement then?<\/p>\n<p style=\"text-align: justify;\">The disagreement is on whether we have in our possession the correct Sunnah or not, Ahlul-Sunnah will say that the nation has preserved the Sunnah of the messenger (saw) and that we derive the rulings from it, whereas the Madhabi Imamiyyah say that we do not have the correct Sunnah, that the only way to reach it and learn it is from the household, only they can propagate the correct Sunnah and teachings of Muhammad (saw).<\/p>\n<p style=\"text-align: justify;\">The Imami Madhabi scholars state in their books that the Sunnah is a source of Shari`ah but claim that reaching the true Sunnah is impossible. Knowing the Sunnah and holding on to the Sunnah cannot be achieved without returning to the household.<\/p>\n<p style=\"text-align: justify;\">We observe from their words that the Sunnah for them is only acceptable in theory, which led them to neglect and abandon the entire Sunnah which was narrated by the nation and restrict themselves to whatever small number of prophetic narrations we find available in their own books, a small number that cannot possibly represent the complete guidance of the Rasul (saw). Whereas the rest of what is found in their books are statements of their religious leaders and Imams, not narratives attributed to Rasul-Allah (saw) or stories of events that took place in his time.<\/p>\n<p style=\"text-align: justify;\">Holding on to the Sunnah can only be achieved through two methods:<\/p>\n<p style=\"text-align: justify;\">A- If it was collected, written, preserved, explained and made directly available for everyone who wishes to follow and benefit.<\/p>\n<p style=\"text-align: justify;\">B- If some individual knew it in detail, is able to explain its texts, then everyone must refer to this individual as custodian and guardian of the Sunnah.<\/p>\n<p style=\"text-align: justify;\">Shia Madhabi scholars state, that since the Sunnah was not written in the time of the Prophet (saw), nor was it in its final form, such as knowing what is clear from what is vague, what is imperative and what is abrogated, what is general from what is restricted. They claim, that the Rasul (saw) would speak about a matter in one occasion, in front of certain people, while others are not in attendance, so the narrations were scattered and received by the companions randomly, each of them knew parts of the Sunnah and missed others. This is why they say that it is impossible to follow the Sunnah by relying on these reports, and the only solution is for the Prophet (saw) to appoint someone, store his entire Sunnah with this person and fully explain it to him, so that the people may seek his guidance whenever they need it.<\/p>\n<p style=\"text-align: justify;\">Madhabi Shia say that the person who was divinely appointed for this task is none other than `Ali, he knows the full Sunnah, its interpretation and explanation, the imperative from the abrogated and the general from the specific. Based on this, the nation&#8217;s role in preserving and propagating the Sunnah was cancelled, no one may take the Sunnah from the companions or disciples of the Prophet (saw), even the companions themselves cannot take the Sunnah of the Prophet (saw) except from `Ali.<\/p>\n<p style=\"text-align: justify;\">That above is their story, and it is this story that we wish to investigate in order to find out whether this has a basis in Islam, or is completely out of touch with reality.<\/p>\n<p style=\"text-align: justify;\">Our first comment regarding their theory, is that if it were true, then the Prophet (saw) would have needed to educate the people and raise awareness concerning two primary matters: The nature of this religious Imamah that was granted to `Ali so that the believers may become familiar with it, and secondly he must present to them clear evidence of the reality of this religious Imamah to show how it functions in the practical sense.<\/p>\n<p style=\"text-align: justify;\">The above is only natural, and it is the way the companions were used to, whenever an Islamic ritual or practice was revealed, the Prophet (saw) would follow the above method to introduce it to his followers, we take Hajj for example:<\/p>\n<p style=\"text-align: justify;\">Firstly the Prophet (saw) would explain its nature and describe it: He would tell them that it is a trip of pilgrimage, to a specified location and in a specified time of the year, it is obligatory for everyone, those who do it shall be rewarded by such and such and those who leave it shall be punished by such and such.<\/p>\n<p style=\"text-align: justify;\">Then secondly, he would get them familiar with the practical reality of Hajj: He would ride on his camel with them when the time comes, he would show them how to gather and prepare for it, in his absence he would appoint a prince to lead the people to Hajj, when they get there he would show them exactly how it is done in detail, then get them used to it by ordering them to repeat what they have done on a yearly basis.<\/p>\n<p style=\"text-align: justify;\">In our case, he (saw) should make everyone aware that his Sunnah is scattered left and right between his companions, and that some of his companions may not understand the rulings correctly, nor would they be aware of what was abrogated, and thus taking any religious verdicts or prophetic-narrations from any of them would be a very bad idea and a big risk of misguidance.<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) must also inform the people, that one of his cousins -namely `Ali- this man was appointed divinely as a custodian of the Sunnah, and that he had left in his possession the entirety of the Sunnah, and explained to him all the rulings and the abrogations and the restrictions, so they may take all of the religious rulings and Sunan from him only and never trust anyone else&#8217;s opinion, since `Ali is incapable of making a mistake, since he is incapable of forgetfulness, since he has knowledge equal to that of Rasul-Allah (saw) and since whenever a new matter appears `Ali can give them new rulings based on the fact that he is in direct connection with the heavens.<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) must also inform them that the 23 years he spent with them were not sufficient, and that God has decreed that certain rulings must be kept stored as secrets with `Ali and his descendants, so they must stick with them after his death in order to acquire all of this hidden information.<\/p>\n<p style=\"text-align: justify;\">Now we look at what we have on the ground of reality, we find that Rasul-Allah (saw) did none of this, he never explained the nature of the religious Imamah which was necessary since nobody had a clue as to what it was nor was it a common thing for the pagan Arabs of his time. Rather, what we find are some vague unclear narrations being quoted, narrations that are not mass transmitted, narrations that have big differences in their main texts, we give an example below:<\/p>\n<p style=\"text-align: justify;\">The narration of the two weighty things, or as we call it &#8220;<a href=\"http:\/\/twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\" rel=\"external nofollow\">Hadith-ul-Thaqalayn<\/a>&#8220;, this is an example of such texts that are quoted to prove the religious Imamah of `Ali, this text has the following apparent issues:<\/p>\n<p style=\"text-align: justify;\">A- It doesn&#8217;t mention `Ali. Thus it cannot be an evidence for his appointment.<\/p>\n<p style=\"text-align: justify;\">B- It doesn&#8217;t indicate which members of Ahlul-Bayt are being discussed. Does this mean they&#8217;re all knowledgeable? Is going to `Aqeel ibn abi Talib similar to going to al-Hasan bin `Ali? Is going to `A&#8217;ishah the same as going to Umm Hani&#8217; bint abi Talib (`Ali&#8217;s sister)?<\/p>\n<p style=\"text-align: justify;\">C- The texts are apparently conflicting, some texts seem to imply that we only need to take care of Ahlul-Bayt and be responsible for them after Rasul-Allah&#8217;s (saw) death, while others say we must hold on to them for guidance and knowledge. This confusion in the text alone is sufficient in discarding this entire Hadith as argument.<\/p>\n<p style=\"text-align: justify;\">Then after collecting all the texts and the chains such as how we&#8217;ve done <a href=\"http:\/\/twelvershia.net\/2013\/10\/26\/detailed-research-on-the-texts-and-chains-of-al-thaqalayn\/\" rel=\"external nofollow\">(here)<\/a>, we find more issues:<\/p>\n<p style=\"text-align: justify;\">D- In several other narrations the Prophet (saw) tells us that if we hold on to the Qur&#8217;an we shall never go astray, without mentioning his family, an example of this is in his farewell sermon, so we ask: Was he tricking the believers then, when he told them that only the Qur&#8217;an is protection from all misguidance? Why did he mention the household later in Ghadeer in the presence of a smaller number of people and deprive the majority of knowing their significance and value and necessity?<\/p>\n<p style=\"text-align: justify;\">E- The majority of texts are not clear in stating that Ahlul-Bayt are a source of guidance, we take an example of a typical Hadith of Ghadeer from Musnad ibn al-Ja`d:<\/p>\n<p style=\"text-align: justify;\">In Ghadeer, he (saw) begins by saying that his time has come near, then he says that he is leaving behind &#8220;Thaqalayn&#8221; and the Thaqal is the heavy matter and the burden of a man, this is why the family of a man are referred to as his Thaqal in Arabic, they are two heavy responsibilities for him and he is leaving them behind for us. Zaydi scholar al-Shareef al-Radi in his book &#8220;al-Majaz fil-Sunnah&#8221; explained Thaqal as the heavy luggage one carries with him in his travels.<\/p>\n<p style=\"text-align: justify;\">He reveals the first heavy matter and says &#8220;The book of Allah, a rope from the heavens to the earth.&#8221; The Qur&#8217;an was the most important responsibility in his life, Allah tasked him with preserving it, he tasked him with reciting it and explaining it, and teaching it to the people while following its instructions to the letter. He describes it as &#8220;A rope from the heavens to the earth&#8221;, meaning that it&#8217;s the link which will be left behind after his passing, the matter that will  link us with God after the revelation stops is his holy book. This also implies that it is a guidance for us to reach the heavens, thus the usage of the word &#8220;rope&#8221;.<\/p>\n<p style=\"text-align: justify;\">He then reveals the second heavy responsibility, he says &#8220;And my `Itrah my Ahlul-Bayt&#8221;, meaning that the second matter that was weighing on his shoulders was the responsibility of his family, to provide for them and care for them. Then after his death, this responsibility and heavy burden was placed on the shoulders of every believer, the duty of loving his family and protecting them and giving them their due rights. We give a simpler example, let&#8217;s say a friend of yours who was married and had a family and kids, this man suddenly discovers that he has lung cancer (God Forbid), and he takes you to a room and tells you: &#8220;I feel I will not last long, and I&#8217;ll be leaving behind a heavy matter, my household.&#8221; Do you understand from this that you must obey them and follow their guidance? Or that he wishes for you to take care of them and treat them as your own?<\/p>\n<p style=\"text-align: justify;\">He (saw) says to them &#8220;The merciful has informed me that they shall not separate until they reach me at the pond&#8221; Meaning that the responsibility of the Qur&#8217;an and the responsibility for his household shall both be tied together, and whoever reaches the Prophet (saw) and wishes to drink from the pond, if he were to be irresponsible towards one of the two during his life, then his fate shall hang in the balance. The example of this is that of the Khawarij, they perfected their Qur&#8217;anic recitation yet they killed `Ali and his children, or the Rafidah who claimed to love and support the Ahlul-Bayt yet neglected the Qur&#8217;an and even claimed its distortion. A true believer must always be responsible towards both.<\/p>\n<p style=\"text-align: justify;\">Finally, Rasul-Allah (saw) says &#8220;Fandhuru Kayfa Takhlufunani Feehima&#8221;, meaning &#8220;So figure out how you shall succeed me in them.&#8221; Thus he made a Wasiyyah or he (saw) willed for us to be careful in how we succeed him in both of these issues, and this proves that it is us who shall be responsible for them and not the other way around. `Ali is reported to have said similarly in Sermon 67 of <a href=\"http:\/\/twelvershia.net\/2015\/11\/11\/examining-nahjul-balagha-and-the-eloquence-of-ali\/\" rel=\"external nofollow\">Nahj-ul-Balagha<\/a> regarding the Ansar, he said: &#8220;If the Government was intended for them there would not have been a will concerning them.&#8221; What `Ali means, is that the Messenger (saw) did not intend for the Ansar to be in a position of government, and the proof is that he (saw) told the believers and willed for them to treat the Ansar with goodness, whereas if they were entitled for it then he (saw) would have told the Ansar to treat the rest of the believers well as they would be in position of power. Since Rasul-Allah (saw) told us to succeed him in taking care of his household then it is proven that the government was not intended for them.<\/p>\n<p style=\"text-align: justify;\">F- All the authentic texts of Thaqalayn as well as most of the weak ones imply that the Qur&#8217;an is the source of guidance and that we must simply take care of Ahlul-Bayt and remember their rights, on the other hand the texts that state that the Qur&#8217;an and Ahlul-Bayt together are the sources of guidance are small in number and they are either of weak or fabricated chains.<\/p>\n<p style=\"text-align: justify;\">G- This narration is mainly authentic from the path of Zayd bin Arqam, it wasn&#8217;t attributed with Sahih chains to any of the other Sahabah, which makes it anything except Mutawatir.<\/p>\n<p style=\"text-align: justify;\">Every single one of these reasons that we quickly listed above, is sufficient to cancel out any argument that relies on such a text to prove religious Imamah.<\/p>\n<p style=\"text-align: justify;\">Another of these vague scattered reports is that of the gate of the city of knowledge, or &#8220;Madinat-ul-`Ilm&#8221; as it was popularly known. When looking at this narration as well we find obvious problems:<\/p>\n<p style=\"text-align: justify;\">A- There is a difference on the authenticity of the text, some said it was authentic like al-Hakim, some said it was weak like ibn Hajar and some said it was fabricated like al-Dhahabi.<\/p>\n<p style=\"text-align: justify;\">B- It does not explain anything about religious Imamah and its nature, what are its limits? Is it that `Ali is just a narrator? Or is it that he is able to give the explanations and interpretations?<\/p>\n<p style=\"text-align: justify;\">C- It&#8217;s attributed to ibn `Abbas, to abu Sa`eed, to Jabir and to `Abdullah ibn Mas`oud. However, one knows that they could not have narrated this without even looking at the chains, this is because the text implies that all knowledge must be taken from `Ali since he was the gate. Yet, `Abdullah ibn `Abbas was known to sleep in front of the doors of the Sahabah so that when they woke up he could take from them the knowledge and the Sunnah, he also sent his son and his servant and told them to listen to the Hadith of abu Sa`eed and learn it, if he believed that Sunnah must only be taken from `Ali then he wouldn&#8217;t do any of this. `Abdullah ibn Mas`oud was known to favor the opinions of `Umar and lean towards them more than any other Sahabi this is why his entire Fiqh is based on that of `Umar and the Koufans would seek `Umar&#8217;s opinions in their city through him. abu Sa`eed al-Khudari was a jurist and popular for sitting in the prophetic-mosque and narrating a big amount of narrations and giving religious verdicts, if he believed that `Ali was the only one qualified to give verdicts and propagate Sunan, he would not have done so himself. As for Jabir bin `Abdullah whom they consider a Shia, he is also from those who narrated a lot of prophetic-Hadith and never told anyone that the Sunnah can only be taken from `Ali, and he narrated from `Umar bin al-Khattab more than anyone else. These people who are narrating to us about this system of acquiring guidance, they themselves oppose it in their practices on the ground of reality and this is established so how can we attribute it to them on top of the weakness in its chains?<\/p>\n<p style=\"text-align: justify;\">D- The first generation such as Umm Salamah and Anas ibn Malik and abu Dharr al-Ghafari never stopped giving Fatwas or left the matter of religious guidance to the &#8220;gate of knowledge&#8221;, they also propagated narrations and never hid anything they heard from the Messenger (saw), nor was it known  that they would tell people &#8220;Go and ask `Ali because he knows best about the Sunnah.&#8221; If the reader is to refer to our research <a href=\"http:\/\/twelvershia.net\/2014\/10\/24\/the-teachers-of-the-imams\/\" rel=\"external nofollow\">(here)<\/a> he would even see that the supposed Shia Imams themselves used to narrate from these companions.<\/p>\n<p style=\"text-align: justify;\">The next step that Rasul-Allah (saw) would normally make as we&#8217;ve seen in the previous example on Hajj, is to apply the religious Imamah of `Ali in society, in a way that it isn&#8217;t just words of the mouth but a social practice deeply rooted in the hearts of the Muslims, enabling it to be inherited from generation to generation after his passing.<\/p>\n<p style=\"text-align: justify;\">Here we also find that Rasul-Allah (saw) did absolutely nothing to plant the seeds of religious Imamah. In his final days for example, especially the last two years, the responsibilities grew and the matters that needed his attention were many, what he could have done was attend to those matters and order `Ali to sit in his Masjid to offer people religious verdicts, this way the people would realize that this man is being relied upon and prepared for a much greater responsibility. In fact, considering that `Ali was infallible, that he couldn&#8217;t forget, that he had all the knowledge and whatever else Imami Madhabi scholars claim, considering all of this we&#8217;ve never seen one report, not one Hadith, where the Prophet (saw) orders `Ali to sit in the Masjid and give people religious verdicts.<\/p>\n<p style=\"text-align: justify;\">I add, it was never reported that Rasul-Allah (saw) told any of the tribal leaders or delegations or any of the Muslims around him: &#8220;Seek `Ali and take your religious verdicts from him.&#8221; Some of these people never even got the chance to meet him (saw) a second time, either because they lived in far areas or because he (saw) had passed away by the time they visited Madinah again, yet it was never reported that he (saw) would tell them: &#8220;You may return and not find me, go to `Ali as I have stored my entire Sunnah with him.&#8221;<\/p>\n<p style=\"text-align: justify;\">Was our Prophet (saw) forgetful and negligent? How can the religious Imamah be implemented in the lives of the Muslims if no measures were taken to ensure this? Could anyone after the death of Rasul-Allah (saw) have denied the existence of congregational prayer? Isn&#8217;t it impossible because the Prophet (saw) made sure to fully clarify it and constantly practice it in their midst for a long period in a way that no one can deny it afterwards?<\/p>\n<p style=\"text-align: justify;\">In addition, the Messenger (saw) himself would send his companions to the far towns and lands to teach people Islam, wasn&#8217;t he worried that these companions were not infallible? Wasn&#8217;t he worried that they can forget some words? Wasn&#8217;t he worried that they may confuse people and misguide them because of their ignorance in matters of abrogation? It was popularly reported through many sources and chains that he (saw) would send his companions as teachers and governors and judges.<\/p>\n<p style=\"text-align: justify;\">Our master (saw) made sure to educate a group of elites so they could be the religious leaders of the future, and in the popular authentic narration he tells us the specialty of each of his companions, and he would say that the most knowledgeable in Qur&#8217;anic recitation is Ubay bin Ka`b, and the most knowledgeable in matters of Halal and Haram is Mu`adh ibn Jabal and the most knowledgeable in matters of inheritance is Zayd bin Thabit.<\/p>\n<p style=\"text-align: justify;\">As stated previously, the Qur&#8217;an declares that we have to take our religion from the believers and those with knowledge generally, no one will ever disagree with this logic. However, the Qur&#8217;an also mentions the concept of laypeople learning religious rulings and teaching them to others without the need to refer back to an infallible, for instance:<\/p>\n<p style=\"text-align: justify;\">{And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious.} [9:122]<\/p>\n<p style=\"text-align: justify;\">Which means that they learn and become jurists so that when the fighters from among them return, they can teach them the religion.<\/p>\n<p style=\"text-align: justify;\">Another point of criticism towards the theory of religious Imamah, is that if indeed as they claim, that the religious rulings require the presence of an infallible to preserve them, to explain them and to propagate them correctly, then by necessity Allah needs to establish this infallible and his followers in the earth, or in other words grant them victory and power and control, similarly to Dawud and Sulayman and Ibrahim. Simply appointing a religious authority will not get the job done, it will only be effective if his authority was established in the lands otherwise it is useless. Allah wished for Islam to be the final message for humanity, and he wished for it to be victorious and apparent over all other religions:<\/p>\n<p style=\"text-align: justify;\">{It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it.}<\/p>\n<p style=\"text-align: justify;\">When Allah wishes this, then by necessity he needs to establish it on the ground of reality for it to be manifest over all religion. Even though a big war was waged against the Prophet of Islam (saw) for long years, a war that took many shapes, yet Allah granted him victory and supported him with miracles, even the angels would descend to fight alongside the believers in Badr and other battles. By doing so, Allah preserved his religion and made sure that it would spread in the lands without corruption or loss because if it were corrupted and lost then it would never be manifest over all religions, it wouldn&#8217;t be called the final message to humanity nor would we be religiously accountable.<\/p>\n<p style=\"text-align: justify;\">{Muhammad is not the father of [any] one of your men, but [he is] the Messenger of Allah and last of the prophets.}<\/p>\n<p style=\"text-align: justify;\">If Muhammad (saw) had failed and lost his wars and couldn&#8217;t deliver the correct message out of weakness, Allah wouldn&#8217;t make him the final messenger and He would send us other messengers to correct the deviance, out of mercy and grace. On the other hand, those who are claimed to have been awarded religious Imamah by the Madhabi Shia, they were defeated and disgraced, they couldn&#8217;t spread the correct teachings nor deliver the message as it should have been delivered, they were so weak that they had to disappear completely leaving humanity without guidance.<\/p>\n<p style=\"text-align: justify;\">The scholars of Madhabi Tashayyu` often argue in their books of philosophy, that the blame does not fall upon Allah or the hidden Imam, the blame falls on the nation for rejecting him and not supporting him. We reply: This is unacceptable, for if Allah truly wished to hand this hidden Imam such a great responsibility, then it is also incumbent upon Allah to grant him the means of establishing himself and exercising his authority on the ground, we all know this verse:<\/p>\n<p style=\"text-align: justify;\">{And Allah is predominant over His affair, but most of the people do not know.}<\/p>\n<p style=\"text-align: justify;\">Allah could have granted him success by any means necessary, exactly like he granted our Prophet (saw) success through miracles and He surrounded him by loyal followers. More importantly, every single Shi`ee who says that the religious Imam is not present because the people will reject him and withhold their support from him knows in his heart that he is lying to himself, there are thousands upon thousands of Muslims today, both Ahlul-Sunnah and Shia who have almost lost hope because of the circumstances in their countries, all wishing for him to finally appear so that he may lead them to victory and resolve their issues and fill the earth with justice. We find so many Muslims today blindly following leaders who are much less significant than the hidden Imam, yet they do this out of desperation as there is no one else to turn to, no proper alternative.<\/p>\n<p style=\"text-align: justify;\">We conclude this point by saying, that if the survival of the complete religion and the availability of its correct teachings depended on the religious Imamah of the household, then Allah would have granted them victory and established them in the earth.<\/p>\n<p style=\"text-align: justify;\">The next point we wish to discuss is regarding the claim of the Madhabi Shia scholars who claim that it is impossible for the Muslims to refer back to the authentic Sunnah since it was never written down in the life of the Messenger (saw) in an organized way, in a way enabling us to know the difference between the imperative and the abrogated, between the clear and the vague, between the general and the specific. Yet we ask, did the Imams of the Shia write down the Sunnah for us in a way that we know the imperative from the abrogated? In a way that we know the clear from the vague? The general from the specific? The answer is that they never did that nor do we have any book written by any of the Imams that we can use, they never wrote a book and said: &#8220;O people don&#8217;t go far and never stray, refer not to Abu Hurayrah or Abu al-Darda&#8217;, we have written down the entire Sunnah and organized it and explained it for you to understand and benefit in this book.&#8221; Then these books would be copied to each Muslim province as a reference for the people.<\/p>\n<p style=\"text-align: justify;\">What did Ahlul-Bayt do then? They used to mention different narrations in different occasions, and they wouldn&#8217;t declare the rulings publicly because the Shia claim they were under <a href=\"http:\/\/twelvershia.net\/2014\/05\/29\/taqiyya-the-other-face\/\" rel=\"external nofollow\">Taqiyya<\/a>, so instead they would secretly mention various rulings to random people who happen to be in attendance in their small gatherings each time and so their words were scattered between their companions, they would also mention general statement at times and specific statements at others exactly as they say the Prophet (saw) did. Even worse, they would speak in Taqiyya at times and they would reveal the true ruling at other times, they also allowed people to write some of their narrations and they turned out to be forgeries by extremists and liars disguised as their Shia, their situation was so bad that Shi`ee books of jurisprudence are literally filled with contradictions (refer to Wasa&#8217;il al-Shi`ah and Tahdheeb al-Ahkam).<\/p>\n<p style=\"text-align: justify;\">In conclusion, the Madhabi Shia falsely claim that the household are a key to understanding and reaching the true Sunnah of Rasul-Allah (saw), what is apparent by taking a quick browse through the narrations of Ahlul-Bayt is that they themselves need another key in order to understand their own narrations and reach their true Hadith. In this case it is incumbent upon Allah to appoint a custodian for the custodian of the Sunnah in order to preserve the Sunnah of Ahlul-Bayt and explain it. However, since that is not available by consensus, the Madhabi Shia scholars claim that the means to understanding and reaching the true Hadith of Ahlul-Bayt are the high ranking Shia scholars who are a source of imitation, or as they call them &#8220;Marja`&#8221;, so here we ask: What makes these Shia scholars more qualified than the companions of Rasul-Allah (saw) in interpreting and transmitting the Sunnah? The answer to this question will reveal the truth that we are in no need for divine custodians and guardians, we only need scholars and jurists.<\/p>\n<p style=\"text-align: justify;\"><strong>-Next, we speak also briefly about the political Imamah:<\/strong><\/p>\n<p style=\"text-align: justify;\">In order to prepare the Muslims for the political leadership of `Ali, several important steps must be taken by Rasul-Allah (saw), such as appointing `Ali in positions of authority during his travels or wars, so he may run the people&#8217;s affairs in the absence of Rasul-Allah (saw) and so that the people may understand that whenever the Messenger (saw) is unavailable, we must always obey `Ali.<\/p>\n<p style=\"text-align: justify;\">This first matter never happened, we saw the Messenger (saw) all throughout his life appoint many men -including `Ali- to run the affairs of the people in his absence, so the people were not introduced to the idea of only having to obey one man. Every time a different man from a different tribe was chosen to be the successor of the Messenger (saw) on Madinah during his travels and wars, such as  Sa`d bin `Ubadah who was a Khazraji and he was appointed as his Khalifah on Madinah for fifteen days during his absence in the second year of Hijrah, or abu Salamah who was a Makhzoumi he was also his Khalifah on Madinah during the battle of Dhil-`Asheerah, or his servant Zayd bin Harithah from Banu Kalb who was his Khalifah in the expedition of Kirz bin Fihr, or Sa`d bin Mu`adh of al-Aws tribe who was his Khalifah on Madinah during the invasion of Buwat, or `Uthman bin `Affan from banu Umayyah who was his Khalifah on Madinah during Dhi-Amr and the list is long&#8230;<\/p>\n<p style=\"text-align: justify;\">`Ali would be even a soldier in someone else&#8217;s army, or he would fall under another man&#8217;s authority, at other instances such as when he was appointed to lead the men at Khaybar, he was a second or third choice since Abu Bakr and `Umar both were chosen to lead before him in that battle. Similarly to above, Rasul-Allah (saw) would also appoint military leaders and generals whenever he dispatched an army, such as `Abdullah bin Ri&#8217;ab bin Jahsh who was an Asadi and whom he sent to Nakhlah, Ghalib bin `Abdullah who was a Laythi and he was sent as his Ameer to fight against banu Sulaym, he sent `Ubaydullah bin al-Jarrah who was a Fihri Qurashi to Sayf-ul-Bahr as his Ameer, he sent Bishr bin Suwayd who was a Juhani against bani al-Harith bin Kinanah, he then sent `Amro bin al-`Aas from banu Sahm in the conquest of Dhat-ul-Salasil, he appointed as his Ameer Abu Bakr who was a Taymi Qurashi to the expedition of Fazarah and this list is also long&#8230;<\/p>\n<p style=\"text-align: justify;\">Refer to books of history such as al-Tanbeeh wal-Ishraf by al-Mas`oudi or al-Mahbar by Ibn Habib for big lists of the Khulafa&#8217; and Umara&#8217; of Rasul-Allah (saw).<\/p>\n<p style=\"text-align: justify;\">A second thing any person who wishes to appoint a successor would do, is write an official document that anyone can refer to in order to learn of the legitimacy of the man&#8217;s successor-ship. The companions would even do so when writing their wills, and they&#8217;d be required to bring witnesses and they would seal the document. This is what all wise men do if they wished to appoint their heirs or even in lesser situations, such as inheritance or debts, documents are normally recommended.<\/p>\n<p style=\"text-align: justify;\">Abu Bakr after his consultation chose `Umar and wrote for him a document proving this, it&#8217;s written in Tareekh al-Tabari that when `Umar was delivering his speech, a servant of Abu Bakr called Shadeed stood next to him, in his hand a Saheefah where it is written that the next Caliph is `Umar bin al-Khattab.<\/p>\n<p style=\"text-align: justify;\">Rasul-Allah (saw) in much smaller matters, always relied on written documents in the presence of witnesses, and he would seal them with his ring. There are books authored by scholars just to collect all the letters and documents and treaties that were written by the orders of Rasul-Allah (saw) and one can review them word for word and letter for letter as they&#8217;re preserved to this day, many of which are written regarding topics that are regarded as insignificant compared to the issue of Shia political Imamah.<\/p>\n<p style=\"text-align: justify;\">This matter was not uncommon, it was widespread in their days,`Ali ibn abi Talib when he was writing his will, he began it with:<\/p>\n<p style=\"text-align: justify;\">&#8220;‘(I begin) in the name of Allah, the Beneficent, the Merciful.&#8221;<\/p>\n<p style=\"text-align: justify;\">And he ended it with:<\/p>\n<p style=\"text-align: justify;\">&#8220;This is the decision that Ali has made about his assets this morning when he has arrived in Maskin. It is witnessed by abu Samar ibn Abrahah, Sa‘sa‘h ibn Suhan, Yazid ibn Qays and Hayyaj ibn abu Hayyaj and it is written by Ali ibn abu Talib with his own hand on tenth of Jamadi al-’Ula’, in the year thirty-seven.’&#8221;<\/p>\n<p style=\"text-align: justify;\">This is because `Ali is among the intelligent ones, he never wished for his children to fight among themselves, nor did he wish for someone to claim something that doesn&#8217;t belong to them after his death. So he had a document written with his own hand writing, and sealed it with his ring as all Caliphs did to any letter they wrote, and he made several witnesses to attend the matter.<\/p>\n<p style=\"text-align: justify;\">On the other hand, we see that concerning `Ali&#8217;s political Imamah, no document was written. A matter of great importance and a matter which is said to be the key to Islam&#8217;s success and the only guarantee of the future of this religion, yet nothing was ever written. The Shia scholars claim that Rasul-Allah (saw) had great fears that his companions would not accept his cousin&#8217;s leadership, so he had every reason to make sure something like this was written, yet he never did it.<\/p>\n<p style=\"text-align: justify;\">If such a document was written, what would be the situation then? Would a couple of hypocrites be able to trick the believers and usurp the right of `Ali? How could they face the masses then, after having turned their backs on such a clear divine order? This verse would surely break their backs:<\/p>\n<p style=\"text-align: justify;\">{It is not for a believing man or a believing woman, when Allah and His Messenger have decided a matter, that they should [thereafter] have any choice about their affair. And whoever disobeys Allah and His Messenger has certainly strayed into clear error.} [33:36]<\/p>\n<p style=\"text-align: justify;\">The next point is related to the public declarations or the public appointments, when a man wishes to address the general public and inform them of something.<\/p>\n<p style=\"text-align: justify;\">As the reader knows, when anyone wishes to make a public speech in which he declares a matter of great importance, if he has any wisdom in him, he would select the best timing, the best location and the best choice of words.<\/p>\n<p style=\"text-align: justify;\">We all know that during the farewell pilgrimage, the Muslims came in enormous numbers, from every corner of the Arabian peninsula, they were all gathered in one spot at mount `Arafah in a very special occasion and a very unique time. As far as timing and place, there is no better time nor was there a better place in the last couple of years of the life of our Messenger (saw). He (saw) then stood up in front of them all and gave one of the strongest sermons in the history of humankind, a sermon that remains engraved in the heart of every believer to this very day, the sermon of farewell.<\/p>\n<p style=\"text-align: justify;\">If an appointment were to be made, that was certainly the best time to make it. Yet, the leaders of the Imami sect claim that the appointment was made at a different time and place, when most believers had left and gone back to their lands in Ta&#8217;if and Yaman and Bahrayn* and the people of Makkah remained in Makkah while others took the sea route to Jaddah and the towns near the shore, Rasul-Allah (saw) only returned with a much smaller number to Madinah. As for the location, Ghadeer Khum is a small oasis on the road between Makkah and Madinah, the area holds no importance or value other than that, many similar areas exist in random locations in the Arabian deserts (Check Islamic books of geography of Hijaz for water locations).<\/p>\n<p style=\"text-align: justify;\">Note*: When we wrote Bahrayn above we never meant the island known as the kingdom of Bahrayn in our days, but rather a large area that composes eastern Arabia and includes the regions known in our days as Qatar, Kuwayt, Emirates and Northern Oman. Whenever Rasul-Allah (saw) and the Caliphs mention the word &#8220;Bahrayn&#8221; they are always referring to eastern Arabia and not the island.<\/p>\n<p style=\"text-align: justify;\">Leaders of the Shia Imami sect will desperately try to state that &#8220;There were also the Syrian and Egyptian Muslims heading north.&#8221; But we all know that if these lands even had any Muslims in them, their numbers would be very insignificant assuming they even exist, Syria and Egypt were not Islamic lands at that time. Secondly, they will try desperately to say that the location of Ghadeer was a major gathering point for all Muslims, but this is also deception and isn&#8217;t true at all (Check books of Hadith to know what were the major gathering points for Hajj).<\/p>\n<p style=\"text-align: justify;\">I add, that if Rasul-Allah (saw) had declared this so called appointment while in Makkah, while holding on to the walls of the Ka`bah wouldn&#8217;t it have been so much better? If he (saw) had waited until he returned to Madinah, the capital of the Islamic world, then announced this appointment in his own Masjid, and ordered messengers to send the letters declaring `Ali&#8217;s appointment to all areas of the Arabian peninsula, wouldn&#8217;t it have been better? To both question we answer YES, almost any other location would&#8217;ve been better than a place in the middle of nowhere such as Ghadeer.<\/p>\n<p style=\"text-align: justify;\">You can also refer to this refutation a brother wrote concerning the significance of the timing and location at Ghadeer, <a href=\"http:\/\/twelvershia.net\/2014\/02\/24\/response-to-why-didnt-the-prophet-of-allah-p-highlight-the-issue-of-complaints-against-imam-ali-as-at-arafat\/\" rel=\"external nofollow\">(here)<\/a>.<\/p>\n<p style=\"text-align: justify;\">I add, that by consensus of reliable and popular Muslim scholars, the verse of {Today I have completed your religion for you} was announced at `Arafah, after the Prophet (saw) delivered his sermon and after the rituals of Hajj were made clear for all believers, then Allah announced the completion of this religion. If this religion was already complete, does it make any sense that the most important part of the religion &#8220;political Imamah of `Ali&#8221; was left out and was abandoned and neglected until Ghadeer?<\/p>\n<p style=\"text-align: justify;\">As far as the text of appointment itself, or as it is known today as &#8220;Hadith-ul-Ghadir&#8221;, still to our very day there are disagreements on its meaning and on the text, there are words which are found in some narrations not in others and the scholars are not in agreement regarding the authenticity of these words. Even the main text itself, &#8220;Man Kuntu Mawlahu&#8221; its meaning is not agreed upon.<\/p>\n<p style=\"text-align: justify;\">The Madhabi Imami Shia will say this text means leadership, while Ahlul-Sunnah and the rest of the Muslims all say this is a request and an order from the Prophet (saw) to those who showed hatred towards `Ali from the soldiers who accompanied him to Yaman, that they should instead love him and be loyal allies to him.<\/p>\n<p style=\"text-align: justify;\">I will list based on some of the major Arabic Ma`ajim and some of the top linguists, what meanings these words can handle which would fit into our situation perfectly and not have anything to do with leadership, as well as the Shia opinion:<\/p>\n<p style=\"text-align: justify;\">-Mawla means a close-friend, the word itself implies closeness in all of its meanings whether describing a bond between relatives or the relation of a slave to his master, so he (saw) could be simply telling them that whoever considers him (saw) as a close friend or Wali, then he must also be like that with `Ali. Similarly to what we call the pious believers, we say they&#8217;re &#8220;Awliya of Allah&#8221; the singular of which is Wali, meaning close friends of Allah.<\/p>\n<p style=\"text-align: justify;\">-Mawla means a beloved person, similar to the above he could be ordering them to love `Ali just as they loved him, and thus the feelings of hatred they had for him would disappear, this is why Buraydah said: &#8220;After hearing these words, `Ali became the most beloved of people to me.&#8221;<\/p>\n<p style=\"text-align: justify;\">-Mawla may mean al-Wala&#8217;-fil-Deen, meaning the obligatory love and closeness that a believer must have towards another, or the love and closeness between those who share the same faith and religion, this is similar to the Qur&#8217;anic verse {The believing men and the believing women are Awliya&#8217; to one another}, so whoever is of this faith and has this type of love towards the Prophet (saw) must also have it towards `Ali as declared in the Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">-Mawla may mean the master of a servant, and since the Prophet (saw) had freed slaves, and they became Mawali of banu Hashim, and `Ali is also from Bani Hashim, so whoever the Prophet (saw) is his Mawla then `Ali must also be his Mawla since both are from Banu Hashim. This is similar to saying: &#8220;`Ali is my close relative.&#8221; and thus they should refrain from having a bad relationship with him.<\/p>\n<p style=\"text-align: justify;\">-Mawla means ally, and the ally in the language of the Arabs is the one who joins you and is strengthened by your strength and gets more power when you&#8217;re powerful, this is the blessing which the Muslims received by embracing this faith and  following this Prophet (saw), such as the saying of `Umar: &#8220;We are people whom Allah strengthened with this religion, so if we seek strength by any other means He shall disgrace us.&#8221; Thus the Prophet (saw) is telling them that whoever considers himself his ally, must also be `Ali&#8217;s ally.<\/p>\n<p style=\"text-align: justify;\">-Mawla means supporter, the support in religion, like protecting and guarding and supporting one another as believers, such as the saying of Allah {Allah is the Mawla(supporter) of those who believed while the disbelievers have no Mawla} and {But if you cooperate against him &#8211; then indeed Allah is his Mawla(supporter), and Gabriel and the righteous of the believers and the angels, moreover, are his assistants.} And so the Prophet (saw) informed them that whomever claims to have Walayah towards him must also have Walayah for `Ali since they are all believers and must all support each-other in their religion.<\/p>\n<p style=\"text-align: justify;\">-Mawla here can be in the meaning of Awla, or that he is nearer to the believers and closer to the believers than themselves, meaning he is more worthy of being loved by the believers than their own selves, and by doing so he (saw) would have granted `Ali a higher form of love than what is usually asked of the believers among each other.<\/p>\n<p style=\"text-align: justify;\">-Mawla means the master of a slave, and this was an interpretation adopted by some of the extremists of the Rafidah in the past, that this text means that we are all slaves for Muhammad (saw) and `Ali, and this is not an acceptable opinion and produces many corrupt rulings of jurisprudence in case we are all slaves of the same person, such annulling marriages and canceling inheritance and obligatory charity.<\/p>\n<p style=\"text-align: justify;\">-As for leadership or authority, this explanation which is adopted by most of the Rafidah today is also corrupt, since `Ali can&#8217;t be a leader alongside the Prophet (saw), nor can he share in his authority as all authority belongs to him alone, so those who claim that the meaning is &#8220;Whomever I am his leader, `Ali is also his leader&#8221; have missed the mark.<\/p>\n<p style=\"text-align: justify;\">After all this, it is not acceptable to use such a narration as evidence for an appointment of a political authority. I add, the meaning of love, friendship and closeness is what seems to be the closest to the truth based on the context, since Rasul-Allah (saw) said right after it &#8220;O Allah befriend whomever befriends him and be an enemy to whoever is his enemy.&#8221; And Muwalat (Love\/Friendship) opposes Mu`adat (Hatred\/Enmity).<\/p>\n<p style=\"text-align: justify;\">As for the context in which this narration was quoted, we find that in the Hadith of Buraydah:<\/p>\n<p style=\"text-align: justify;\">From Buraydah, he said: I was in a Ghazwa with `Ali and I saw within him some bad mannerisms. So when I came to the Messenger of Allah (saws), I mentioned `Ali and criticized him. I then saw the face of the Messenger of Allah (saws) change (to anger), he then said, “O’ Buraydah, am I not more important to the believers than themselves?” I said, “Yes, O’ Messenger of Allah.” He said, “To whom I am his Mawla, then `Ali is his Mawla.”<\/p>\n<p style=\"text-align: justify;\">As we can see from the context, this is not a declaration of succession, but rather, the Prophet (saws) is affirming to Buraydah that `Ali is on the side of the believers. Thus, it is correct to translate the above as, “Whoever loves me; must also love `Ali.” Not only is the usage of the word “Mawla” unclear for a declaration of succession, but the context does not fit such a declaration, since it is only logical that such an appointment is to be made in front of masses, not in secrecy to a single man. Also the biggest problem with `Ali and these soldiers was not one of authority, since they all obeyed him and followed his orders, the issue was that of hatred for `Ali’s person, so it would not make sense to remind them of his authority at this point or his leadership rather it makes sense to encourage loving him and being close to him.<\/p>\n<p style=\"text-align: justify;\">In brief, the issues some soldiers had with `Ali include the following:<\/p>\n<p style=\"text-align: justify;\">&#8211; Ibn Ishaq in one narration mentions that one of the reasons that the army to Yemen was angered with him was because he had them take off the fancy clothing that they were dressed up in (probably from the war-booty).<\/p>\n<p style=\"text-align: justify;\">&#8211; Imam Ahmad, with an authentic chain, that one man was angered by `Ali since `Ali took one of the best looking slave girls from the khums in one of the battles.<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Bayhaqi’s hadith from Abi Sa’eed Al-Khudari in which the army of `Ali requested that they ride on the camels those were to be given to charity in order to rest their own camels. `Ali declined their request.<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Bukhari mentions in one narrated from Abi Sa’eed that `Ali angered one of his companions because he split some gold among four people that he believed were not deserving of it.<\/p>\n<p style=\"text-align: justify;\">These narrations can all be found in Al-Bidaya wal Nihaya by Ibn Katheer in detail and it is suggested to return to his book for further reading in the subject. We can see from the very nature of the problems that these included problems that happened between `Ali and individuals, as well as between him and his army as a whole.<\/p>\n<p style=\"text-align: justify;\">Ibn Katheer then comments: It was when the criticisms of `Ali became plenty within the army, due to his preventing them from using the camels, his taken back of the clothing that they were given by his deputy, and `Ali had indeed an excuse in his action, but these actions became famous within the pilgrims. It was then, and Allah knows best, that when the Messenger of Allah (saws) came back from his pilgrimage, completed the rituals, and returned to Al-Madinah, he passed by Ghadeer Khum, he stood amongst the people to clear `Ali and raise his status, and showed his merit, to remove from the hearts of the people what had become of them, and this will be explained in detail in its place Insha-Allah.<\/p>\n<p style=\"text-align: justify;\">Ghadeer was an event that took place in the year 11 AH, the words &#8220;Man Kuntu Mawlahu&#8221; would be heard again but not in the near future, they were not heard when Abu Bakr usurped the Caliphate (according to the Shias). They were not heard when Abu Bakr was on his deathbed and appointed `Umar as a successor. They were not heard when `Umar was on his deathbed and included `Ali with five other candidates to Khilafah. They were not heard when `Uthman was killed and the Khawarij were looking for a new Caliph. They were not even heard during the wars of `Ali and the internal wars between the Muslims. No, they were heard merely a hundred days before the death of `Ali during his reign as Caliph.<\/p>\n<p style=\"text-align: justify;\">The authentic narrations of Ghadeer Khum, when attributed to `Ali, are Mutawatir to him since he uttered those words in the area of Al-Rahabah near the outskirts of Al-Kufa. Due to the large amount of people around, the narration was documented and then spread near and far, and through a large number of his students.<\/p>\n<p style=\"text-align: justify;\">Fitr bin Khalifah testified that this event occurred only a hundred days before the death of `Ali. See Saheeh Ibn Hibban #7057. In other words, this event occurred way after the battles of Al-Jamal, Siffeen, and Al-Nahrawan, which puts to rest the idea that `Ali was attempting to prove his legitimacy by quoting the narration of the Prophet (saws), since Al-Nahrawan occurred in the year 39 AH, and `Ali died in Ramadan, 40 AH. Even `Amir bin Wathilah first heard of this narration at Rahbah as is clear from his narration, then he went to ask Zayd and verify.<\/p>\n<p style=\"text-align: justify;\">Even though most narrations are not clear in what was the reason that `Ali spoke those words, we do find a single vague narration in Musannaf Ibn Abi Shaybah (Hadith #28 of the Chapter of the Merits of `Ali) that suggests that this was done when `Ali heard that people were “Yataqawaloon Feeh,” which roughly translates into: they spoke badly of him.<\/p>\n<p style=\"text-align: justify;\">Unless `Ali was not aware of how to prioritize quoting the Prophet (saws), we can safely say that he did not understand the Hadith to be an appointment of successor-ship. If that was the case, then he has definitely missed out on several key opportunities.<\/p>\n<p style=\"text-align: justify;\">So, as we can see by studying the three cases in which the Hadith was narrated, with the inclusion of a context, that the narrations have nothing to do with established his legitimacy, but rather, were mentioned in times in which the character of `Ali was criticized.  It was in these cases that these significant words “`Ali is beloved of the believers” were uttered.<\/p>\n<p style=\"text-align: justify;\">Even when a group of Ansar came to him and said to him &#8220;Al-Salamu `Alykum ya Mawlana.&#8221; `Ali himself was confused and didn&#8217;t understand what they meant, he told them: &#8220;How can I be your Mawla when you are Arabs?&#8221; Thinking that Mawla was in relation to owning slaves. Which is why big Imami Shia scholars in the past such as Tabrasi and Murtada both said that the text of Ghadeer is not a clear text for appointment, other Shia scholars said that those who never understood what the Shia understand from this text are excused, obviously since it isn&#8217;t clear.<\/p>\n<p style=\"text-align: justify;\">To conclude this brief discussion of Ghadeer, we say: It is clear from the above, that concerning the event at Khum which the Imami Madhabi scholars cling to, neither the timing, nor the location and not even the words are acceptable for us to consider this as any form of divine appointment.<\/p>\n<p style=\"text-align: justify;\">The next vague text they use is the one in which the Prophet (saw) tells `Ali when he leaves him in charge of Madinah during his trip to Tabuk: &#8220;Will you not be pleased that you will be to me like Haroun was to Musa? But there will be no prophet after me.&#8221; Otherwise known as &#8220;Hadith-ul-Manzilah&#8221; and they also claim that this was an appointment but their opinion is problematic.<\/p>\n<p style=\"text-align: justify;\">The first issue would be to define what was Haroun to Musa and what is the similarity between them, we find that they were both prophets and both received revelation and both were brothers, but Muhammad (saw) and `Ali were not both prophets nor did both receive revelation nor are they biological brothers, this first observation proves that Rasul-Allah (saw) when he said this to `Ali, he did not mean it in its absolute sense.<\/p>\n<p style=\"text-align: justify;\">What can be the similarities then? If we cut to the chase and say that leadership is not from the similarities we wouldn&#8217;t be mistaken, Haroun was never appointed by Musa as the leader after him, Haroun only succeeded Musa temporarily in his absence at one point and this is in fact a similarity and fits into the context perfectly since Rasul-Allah (saw) had left `Ali to take care of the women and children in his absence. Other similarities include that Haroun was an aid and a support for Musa and he was related to him by blood, and this is also shared by our Prophet (saw) and `Ali. However, according to the Hadith `Ali was saddened by being left behind,  Rasul-Allah (saw) told him this to please him and comfort him, so assuming that he (saw) was intending the blood relation or the support in religion would not be a wise guess as this was already a matter known to `Ali, but showing `Ali the resemblance between their situation and the situation of Musa and Haroun would have made staying behind in Madinah valuable and important in `Ali&#8217;s eyes, as he would feel the deep trust Rasul-Allah (saw) has towards him.<\/p>\n<p style=\"text-align: justify;\">The strongest chain of this report goes back to Sa`d ibn abi Waqqas yet when `Ali ibn abi Talib came to him during the Fitnah and asked for his support, Sa`d said: &#8220;If you give me a sword that distinguishes the Muslim from the Kafir then I shall join your fight.&#8221; so he stayed away from them all, had he understood from the text what the extremists of the Shia understood, he would not have done so, and he would have listened and obeyed.<\/p>\n<p style=\"text-align: justify;\">Moreover, a divine appointment must not be reactionary, just like the Hadith of Ghadeer, this narration came as a reaction, and if the hypocrites did not criticize `Ali and deceive him, he would not have deserted his post and followed the Messenger (saw) to complain about being left behind with the women and children, and the Prophet (saw) would not have responded back by saying what he said.<\/p>\n<p style=\"text-align: justify;\">The next issue is that of the transfer of authority, any leader who knows his time is near will attempt to gradually transfer his leadership to his chosen successor before he passes away, and the Prophet (saw) had several chances to do this during his final years:<\/p>\n<p style=\"text-align: justify;\">A- The matter of leading the believers in prayer held great significance, when he (saw) became sick and couldn&#8217;t lead the people in their daily congregational prayers, the Prophet (saw) wished to appoint a man to take his place, so he appointed someone other than `Ali to lead the believers in their prayers when it was known in their society that the Khalifah  or the one placed in charge is the one who usually leads the people in prayer.<\/p>\n<p style=\"text-align: justify;\">B- The matter of preparing the army of Usamah, and he (saw) was very concerned about this army, so he prepared it himself and organized it and advised the soldiers when `Ali was left doing nothing, he could have at least given him this first task and placed him in a position of responsibility. All that was left was to simply dispatch this army and Abu Bakr would later do this during his Khilafah.<\/p>\n<p style=\"text-align: justify;\">C- The year of delegations happened just before the Prophet&#8217;s (saw) death, in the 9th year of Hijrah up to seventy delegations came from all over the Arabian peninsula declaring their Islam and loyalty, the delegation of Yamamah itself was around a hundred thousand men. The Messenger (saw) never told them about his successor and never promoted him nor did he request from them to offer their allegiance to `Ali after his death.<\/p>\n<p style=\"text-align: justify;\">D- The 9th year is also when the Muslims were able to do their first Hajj, he (saw) was not able to lead the believers on their first journey so he wished to appoint a man to lead them, but instead of appointing `Ali he appointed Abu Bakr. According to the narration of Jabir the Prophet (saw) sent `Ali after Abu Bakr with a message, so Abu Bakr asked him: &#8220;Were you sent as a leader or a messenger?&#8221; `Ali replied: &#8220;As a messenger.&#8221; And according to the narration of`Ali, Abu Bakr established the Hajj for the people and delivered the sermon of Hajj, and taught the people its tenets, then he signaled to `Ali and abu Hurayrah and some others so they may shout out some instructions that Rasul-Allah (saw) had ordered.<\/p>\n<p style=\"text-align: justify;\">E- Madinah being the stronghold of Islam and its capital, its dwellers were the Ansar who numbered by the thousands, and so the Prophet (saw) should have given them special instructions and placed the responsibility on their shoulders to insure that after his passing, that his successor can easily ascend to the throne and that no one may rebel against him. No such instructions were given, and we find that the leaders of the Ansar were the ones who gathered in the Saqifah.<\/p>\n<p style=\"text-align: justify;\">These and many other things could have been done to facilitate the matter and guarantee the ascension of his heir, especially since the Imami Madhabi Shia claim that the Prophet (saw) knew that among his companions were folks who didn&#8217;t want `Ali&#8217;s leadership, and he (saw) even knew the future according to them and told his family members of what would take place. They accuse the Prophet (saw) of a loathsome thing, that he was ordered to announce the leadership of `Ali in `Arafah but didn&#8217;t out of fear of the people, then Jibreel descended and commanded him to declare it; a Prophet who was too fearful to announce an urgent divine Godly order of the utmost importance, the embodiment of a sad excuse as to why `Ali&#8217;s leadership was never mentioned in the final sermon.<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) who had announced to the pagans, straight to their faces and in the middle of their holy city, that their gods were nothing more than useless rocks, the same man who announced to the Jews who had armies and fortresses in the Arabian peninsula that they were cursed, that they were astray and misguided, the same man who announced to the Christians that `Isa (as) was neither God nor his son, the same man who sent messengers to the biggest of kings and emperors who had giant armies and plenty of assassins, asking them to embrace Islam and abandon their heresies and deviance, to Heraclius the Caesar of Byzantium, to Chosroes II the Khosrau of Persia, to the Negus of Ethiopia, to al-Muqawqis the ruler of Egypt, Harith Gassani the governor of Syria, Munzir ibn Sawa the ruler of Bahrain and to the Maharajah of Kashmir. Muhammad ibn `Abdillah (as) was now too scared and fearful to announce a much smaller matter to his own followers and supporters so Allah had to send the angel back to command him to reveal the entire message of Islam.<\/p>\n<p style=\"text-align: justify;\">The Imami Madhabi Shia claim that the Prophet (saw) has to have an infallible memory, he must not forget anything because if he was allowed to forget then we can doubt his entire message, since he might have forgotten to tell us some Islamic rulings. I say, if according to your authentic Shia narrations in al-Kafi, the Prophet (saw) was reluctant to deliver a message from Allah out of fear of the people, then we can also doubt his message because what if he withheld a lot of crucial Islamic rulings from us out of fear?<\/p>\n<p style=\"text-align: justify;\">To conclude the matter of political Imamah, we say that since none of these measures were taken, then by necessity and intellect we conclude that no appointment was made for `Ali. If we are to believe otherwise then we would be accusing the Prophet (saw) of being unable to arrange for such an obvious matter and so he would clearly be unqualified to even assume such a position or handle such an affair, this opposes what is popularly known by all those who studied the history and biography of this man whether they were Muslims or non-Muslims, they all agreed that he was the most intelligent and successful political leader of all times.<\/p>\n<p style=\"text-align: justify;\">Peace be upon our master and leader Muhammad, and upon his family and companions and those who followed them in goodness.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In this article we shall discuss the following InshaAllah: 1- How Rasul-Allah (saw) would make the fundamental pillars of Islam deeply rooted in Society. 2- The Madhabi Shia Imamah with its two branches, a brief definition of each: a- Religious <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/11\/01\/rasul-allah-saw-and-the-divine-order-of-imamah\/\" title=\"Rasul-Allah (saw) and the divine order of Imamah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[],"class_list":{"0":"post-1487","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1487","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1487"}],"version-history":[{"count":21,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1487\/revisions"}],"predecessor-version":[{"id":2772,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1487\/revisions\/2772"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1487"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1487"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1487"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}