{"id":1522,"date":"2014-11-13T23:00:08","date_gmt":"2014-11-13T23:00:08","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1522"},"modified":"2015-03-08T21:01:58","modified_gmt":"2015-03-08T21:01:58","slug":"rasul-allah-saw-and-the-future-of-the-ummah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/11\/13\/rasul-allah-saw-and-the-future-of-the-ummah\/","title":{"rendered":"Rasul-Allah (saw) and the future of the Ummah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1522\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In our past article <a href=\"http:\/\/twelvershia.net\/2014\/11\/01\/rasul-allah-saw-and-the-divine-order-of-imamah\/\" rel=\"external nofollow\">(here)<\/a> we discussed Imamah and its two branches, the political Imamah and the religious Imamah, in this article we shall answer the two questions that any Madhabi Shia may use as a last resort to defend his position:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><strong>1- How can a responsible leader like the Prophet (saw), who cared for his nation and message, leave without being reassured that a qualified deputy and successor will carry-out these responsibilities after him?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>2- How is it possible that the Prophet (saw) of Islam, leaves his nation without giving them any advice and instructions concerning leadership even though it is from the most important matters for our success as a nation?<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Regarding the first question,<\/p>\n<p style=\"text-align: justify;\">The Madhabi Shia argument is that any good leader must be cautious concerning the fate of his followers, he must take the steps and the measures necessary to ensure a smooth and promising future for them. Rasul-Allah (saw) orders us in the authentic Sunnah that if any three among us ride on a journey, that they must appoint one of them to be in charge, so how can he leave the entire nation without a leader?<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s begin by crossing out some possibilities, starting with the possibility that Rasul-Allah (saw) was negligent, he knew the importance of leadership but didn&#8217;t address it, this is unacceptable as we cannot possibly attribute such a thing to a man chosen by the Divine Will. Secondly, is that Rasul-Allah (saw) didn&#8217;t take into consideration the gravity of the situation, and was unable to estimate the importance of leadership and this is why he never thought of addressing the issue of leadership, this too is unacceptable since it implies that Rasul-Allah (saw)  was not qualified to lead and couldn&#8217;t think ahead.<\/p>\n<p style=\"text-align: justify;\">The Madhabi Shia scholars do the same thing to prove their point, they ask the same pivotal question and cross out these same two possibilities, as usual they try to narrow the answer to whatever they desire and this is their methodology in almost every matter of religion, so they say that the only possibility left is that Rasul-Allah (saw) did in fact appoint a successor.<\/p>\n<p style=\"text-align: justify;\">The three possibilities the Madhabi Shia scholars like to restrict us to are as follows,<\/p>\n<p style=\"text-align: justify;\">Negligence: Rasul-Allah (saw) left the matter in the hands of the nation and never appointed.<\/p>\n<p style=\"text-align: justify;\">Ignorance: Rasul-Allah (saw) never considered the importance of leadership for the nation&#8217;s future.<\/p>\n<p style=\"text-align: justify;\">Appointment: Rasul-Allah (saw) obeyed a divine order and appointed `Ali but the nation rebelled.<\/p>\n<p style=\"text-align: justify;\">This is how the Madhabi Shia scholars like to lead or steer the reader towards the conclusion that they adopt. I say: From a distance, this method appears to be logical and correct in its current form. However, the reality is that this seemingly logical method is nothing more than a fallacy by Shia philosophers to confuse the reader.<\/p>\n<p style=\"text-align: justify;\">In this case, the method includes a fallacious element which will most certainly lead to an erroneous conclusion because of the intention of the person posing this argument in the first place and his selective, unscientific method.<\/p>\n<p style=\"text-align: justify;\">We sum up their argument as follows:<\/p>\n<p style=\"text-align: justify;\">a) Having a fit body is necessary to be a good football player. (Fact)<\/p>\n<p style=\"text-align: justify;\">b) Reza has a fit body. (Description of subject)<\/p>\n<p style=\"text-align: justify;\">Therefore, c) Reza is a good football player. (Fallacy)<\/p>\n<p style=\"text-align: justify;\">Which isn&#8217;t necessarily true, because Reza might not have played football in his entire life, nor did anyone say that having a fit body is the only criteria of a good football player. In the same manner, we say that Rasul-Allah (saw) knowing the necessity of leadership does not equate to him personally appointing a leader nor can we conclude this.<\/p>\n<p style=\"text-align: justify;\">Now, onto dissecting the argument to illustrate that it only appears logical whereas in reality it is a fallacious syllogism. The first argument we presented in our previous article <a href=\"http:\/\/twelvershia.net\/2014\/11\/01\/rasul-allah-saw-and-the-divine-order-of-imamah\/\" rel=\"external nofollow\">(here)<\/a>, is a &#8220;proof by contradiction&#8221; scenario. In that article we showed that if the conclusion drawn by the Madhabi Shia was correct, then it shall logically and necessarily lead to certain matters. We discussed in some detail that if an appointment were to be made, then it should have been made with clear words, at the most convenient timing and at the most favorable location, then it should have been followed by many steps and measures to ensure that the leadership of the heir is firmly planted in society in preparation for a transfer of authority. Since we proved that none of the above took place, rather certain matters which oppose it took place, then by necessity we learn that no appointment was made in the first place.<\/p>\n<p style=\"text-align: justify;\">This is similar to having concluded that a person must have lost his sight in an accident that took place, but then we observe that when a candle light is placed in front of his eyes, his pupils move left and right following the flame wherever it moves, then later we find him reading the daily newspaper and describing the content and colors of its various images. Based on these clear observations we reject the above conclusion which declares that the man lost his vision in the accident.<\/p>\n<p style=\"text-align: justify;\">Madhabi Shia claim, that since the Prophet (saw) is the wisest and greatest leader, he would abide by caution in dealing with this great matter, he would plan ahead to secure the future of his nation and make the best judgement after carefully assessing the situation. By the same token, we ask: Is it possible for us to claim that Rasul-Allah (saw) was wary and cautious, can we claim that he took the matter very seriously and planned ahead if we believe that he was only satisfied with simply announcing a text of appointment once or even twice?<\/p>\n<p style=\"text-align: justify;\">What we&#8217;re trying to say is, that a simple text or announcement was not sufficient nor good enough for a matter of this size and value, the evidence is that the moment Rasul-Allah (saw) passed away everything collapsed when the companions rebelled according to the Madhabi Shia, and so the words of Rasul-Allah (saw) were not translated into the ground of reality. Again we repeat, is it possible that the greatest leader, the wisest leader, the man who knows the necessity  and importance of appointing a leader for the survival of the religion, a man who is familiar with the situation on the ground, who fully knows that many hypocrites around him detest his heir and wish to block him from authority, a man who has all the time he needs to plan how he can secure his heir&#8217;s ascension to the throne, finds it sufficient according to the Madhabi Shia to just randomly announce the appointment of his heir the way he did and then leave us and die!?<\/p>\n<p style=\"text-align: justify;\">Based on this we say, that the Prophet (saw) in such a situation that directly affects the future of the nation, the future of the message and is the only guarantee of the religion&#8217;s survival, he could not simply take normal measures, he must take special measures that are worthy of a matter as great as Imamah. When observing the claims of the Shia, we find that Rasul-Allah (saw) never did anything special, all there is to it is that he raised `Ali&#8217;s hand and announced his leadership with an unclear text according to al-Murtada and al-Tabrasi.<\/p>\n<p style=\"text-align: justify;\">Can Rasul-Allah (saw) be described as being cautious in this case? Is this the way he planned ahead carefully? Is this the way he gave the matter the preparation and attention it deserved? Obviously not. The Madhabi Shia fall in the hole they dug, since their argument was that a wise leader would not leave without a heir, it can also be said to them that a wise leader would not be satisfied by simply speaking a couple of words concerning a matter of this magnitude.<\/p>\n<p style=\"text-align: justify;\">This was one refutation which we spoke about in detail in the aforementioned article, now we provide another to answer the above issue.<\/p>\n<p style=\"text-align: justify;\">We Ahlul-Sunnah say, Rasul-Allah (saw) was comfortable without appointing a deputy, he was reassured about the nation&#8217;s future, and he slept with peace of mind, the success of the nation and the preservation of the message never required an urgent intervention from Rasul-Allah (saw). This way, we keep the Prophet&#8217;s (saw) personality away from the accusations of the deviants, away from those who called him neglectful and unqualified, but that based on his assessment of the reality on the ground he realized that there simply is no need for this appointment.<\/p>\n<p style=\"text-align: justify;\">Secondly, when discussing the leadership and policies of our master Muhammad (saw), we must not overlook an aspect that played a vital role in every decision he took, it is the divine revelation. Every matter of great importance that affected the future of the religion and the future of the believers was dictated by this divine revelation, and so we must not reduce Rasul-Allah (saw) to the level of a mere tribal leader or politician.<\/p>\n<p style=\"text-align: justify;\">The big mistake the Madhabi Shia scholars are doing, is that they&#8217;re trying to analyse a situation based on their own estimation and evaluation of what a mere king or tribal leader would do, in complete isolation from divine revelation.  Based on this evaluation of a typical scenario of a leader appointing an heir, they decided that it is incumbent upon Rasul-Allah (saw) to choose a man and appoint him as the sole candidate and heir after him. We answer by saying: If we agree for the sake of the argument that Rasul-Allah (saw) had big fears concerning our future, could he take a personal initiative based on his own opinion and appoint someone, or must he refer to the heavens first? The answer is that he must receive permission from his Lord that would enable him to take such a step. However, when Rasul-Allah (saw) consulted his Lord, if Allah simply answered him &#8220;Leave this matter and don&#8217;t interfere.&#8221; Just like Allah decided to end the prophet-hood with Muhammad not with Musa, just like Allah decided that there should be a gap of six hundred years between Muhammad and `Isa, just like Allah decided that Ibrahim will not die when his people tried to burn him but Zakariya died when they cut him in half, in this case who are we to argue and who are we to object based on our fallible evaluation and analysis?<\/p>\n<p style=\"text-align: justify;\">That is assuming Rasul-Allah (saw) was indeed worried as they claim but as we previously said, we do not believe this was the case and we shall list some of the main reasons as to why that is:<\/p>\n<p style=\"text-align: justify;\">A- He delivered the whole message and Allah completed the religion through him, he clarified every fundamental matter and explained the laws and the rulings, he forbade us from all that angers Allah and enjoined upon us all goodness. Rasul-Allah (saw) told us: &#8220;I left you on a bright path whose night and day are alike. No one strays from it after me except he is destroyed.&#8221; And he said: &#8220;I left nothing which could bring you closer to Allah except that I ordered you to do it, and I left nothing which could bring you closer to hell-fire except that I forbade you from it.&#8221; And in his farewell sermon he told his companions: &#8220;You shall be asked about me, what will you say?&#8221; They said: &#8220;We bear witness that you delivered the message and did your duty and advised the people.&#8221; He then said while pointing to them: &#8220;O Allah bear witness, O Allah bear witness, O Allah bear witness!&#8221; Then Allah completed our religion for us and completed his favor upon us. As far as the message being fully transmitted, he accomplished this and had no worries with this regard that anything may be missing.<\/p>\n<p style=\"text-align: justify;\">B- He established a solid political foundation for the Muslim state in Madinah, although simple in its structure yet it is an entity that the Muslims can rely on when dealing with outside threats. Madinah&#8217;s demography was composed of the most reliable of early believers, the supporters and the emigrants who settled in it, and Rasul-Allah (saw) exercised his power and authority from Madinah throughout his prophet-hood, thus his message is no longer just an idea floating about, rather it became embedded in the political entity that is Madinah.<\/p>\n<p style=\"text-align: justify;\">C- He raised and prepared a young generation from his companions, a generation that would act as a vanguard, believers who embraced the message and were willing to sacrifice their lives for it, their dependability and valor have already been proven in the many ordeals they faced during his life. They carry the knowledge of the Book and they were the ones whom Allah constantly praised in the Qur&#8217;an and he promised them victory and support over their enemies.<\/p>\n<p style=\"text-align: justify;\">{You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong and believe in Allah.}<\/p>\n<p style=\"text-align: justify;\">{And thus we have made you a just community that you will be witnesses over the people and the Messenger will be a witness over you.}<\/p>\n<p style=\"text-align: justify;\">{Muhammad is the Messenger of Allah; and those with him are forceful against the disbelievers, merciful among themselves. You see them bowing and prostrating [in prayer], seeking bounty from Allah and [His] pleasure. Their mark is on their faces from the trace of prostration. That is their description in the Torah. And their description in the Gospel is as a plant which produces its offshoots and strengthens them so they grow firm and stand upon their stalks, delighting the sowers &#8211; so that Allah may enrage by them the disbelievers. Allah has promised those who believe and do righteous deeds among them forgiveness and a great reward.}<\/p>\n<p style=\"text-align: justify;\">{And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct &#8211; Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.}<\/p>\n<p style=\"text-align: justify;\">{But the Messenger and those who believed with him fought with their wealth and their lives. Those will have [all that is] good, and it is those who are the successful. &#8211; Allah has prepared for them gardens beneath which rivers flow, wherein they will abide eternally. That is the great attainment.}<\/p>\n<p style=\"text-align: justify;\">{But those who have believed and emigrated and fought in the cause of Allah and those who gave shelter and aided &#8211; it is they who are the believers, truly. For them is forgiveness and noble provision.}<\/p>\n<p style=\"text-align: justify;\">{Certainly was Allah pleased with the believers when they pledged allegiance to you, [O Muhammad], under the tree, and He knew what was in their hearts, so He sent down tranquility upon them and rewarded them with an imminent conquest &#8211; And much war booty which they will take. And ever is Allah Exalted in Might and Wise. &#8211; Allah has promised you much booty that you will take [in the future] and has hastened for you this [victory] and withheld the hands of people from you &#8211; that it may be a sign for the believers and [that] He may guide you to a straight path. &#8211; And [He promises] other [victories] that you were [so far] unable to [realize] which Allah has already encompassed. And ever is Allah, over all things, competent.}<\/p>\n<p style=\"text-align: justify;\">These verses describe them and praise them as well as other verses we have not mentioned, and this generation among them were politicians and speakers and scholars and warriors and men of piety and men of wealth and they are the best of generations. Taking this into consideration, Rasul-Allah (saw) had no worries about their ability to run the government.<\/p>\n<p style=\"text-align: justify;\">D- He was informed by Allah about every matter that shall happen in the future, that the religion will be aided by Allah and that there shall come a time when the name of Allah will enter every household and that the devil has lost all hope of being worshiped in this nation as he said in his farewell sermon. Knowing that this religion will prevail and dominate, Rasul-Allah (saw) didn&#8217;t have much to worry about, he declared the prophecy: “Verily, this matter (Islam) will reach where day and night have reached, and it will not leave a house of Madar (mud or clay) or a house of Wabar (fur of camels and goats, i.e. tents) except Allah will bring it into this religion, (either) with the honor of an honored one, or the disgrace of a disgraced one; honor with which Allah honors Islam, and disgrace with which Allah disgraces Kufr.” And he said: &#8220;The earth was brought together -folded- for me so that I could see the east and the west, and I was given two treasures, the yellow (gold) and the white (silver). And it was said to me: ‘Your dominion will extend as far as has been shown to you.’ So I asked Allah for three things: That my nation would not be overwhelmed by famine that would destroy them all, and that their enemies would not unite upon them and annihilate them all, and that they would not be rent by schism and fight one another, but it was said to me: ‘When I (Allah) issue My decree it cannot be revoked. But I will never cause your nation to be overwhelmed by famine that would destroy them all, and I will not gather their enemies against them (and destroy them) until they (your nation) fight one another and kill one another.&#8221; And so the nation shall be victorious from what Allah promised him, their dominion will extend to all the lands and they shall earn much wealth. As for the last part concerning the Fitnah, where a Muslim will kill his brother, Rasul-Allah (saw) gave detailed instructions on how a believer must conduct himself during that trial.<\/p>\n<p style=\"text-align: justify;\">E- He instructed his companions to listen and obey to the first man the nation agrees upon and to advise him and stick together like one solid body, he warned them from anything which causes division and conflict and recommended to them all that shall bring them closer and unite their word as one word. He (saw) would tell them: &#8220;The similitude of believers in regard to mutual love, affection, fellow-feeling is that of one body; when any limb of it aches, the whole body aches, because of sleeplessness and fever.&#8221;<\/p>\n<p style=\"text-align: justify;\">{As for those who divide their religion and break up into sects, thou hast no part in them in the least: their affair is with God: He will in the end tell them the truth of all that they did.}<\/p>\n<p style=\"text-align: justify;\">{And hold fast, all together, by the rope which God (stretches out for you), and be not divided among yourselves; and remember with gratitude God’s favor on you; for ye were enemies and He joined your hearts in love, so that by His Grace, ye became brethren;and ye were on the brink of the pit of Fire,and He saved you from it. Thus doth God make His Signs clear to you: That ye may be guided}<\/p>\n<p style=\"text-align: justify;\">F- He affirmed and accepted the old Arabian tradition of consultation, the Arabs were already familiar with the concept of &#8220;Shura&#8221; since they always ran their affairs as a group, especially the people of Makkah whose elders always gathered in &#8220;Dar-ul-Nadwa&#8221; which means &#8220;the house of gathering and discussions&#8221;, to consult and discuss matters of common concern, and nothing would be decided until it is agreed upon in their meeting. Islam acknowledged consultation and adopted it, Rasul-Allah (saw) always consulted with his companions in matters of politics and war as clearly seen from his Seerah.<\/p>\n<p style=\"text-align: justify;\">{So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him].}<\/p>\n<p style=\"text-align: justify;\">{And those who have responded to their lord and established prayer and whose affair is [determined by] consultation among themselves, and from what We have provided them, they spend.}<\/p>\n<p style=\"text-align: justify;\">From the six major points we stated and others, we determine that Rasul-Allah (saw) did not have much cause to worry, as for writing a document and announcing someone as his successor, his words: &#8220;Allah and the believers will not accept other than Abu Bakr.&#8221; maybe they are the missing piece of the picture. After seeing that the conditions were more than favorable and that there was no urgent issue that would require him to select a deputy, Rasul-Allah (saw) chose to not interfere in this matter, allowing these great men to experience for themselves the process of filling the political gap, allowing the nation to begin its journey without depending on him as they&#8217;ve reached the stage of maturity enabling them to carry-on and move forward, this way they can also become an example for the future generations.<\/p>\n<p style=\"text-align: justify;\">We see this on the ground of reality, when the nation was able to overcome the calamity of the death of the Prophet (saw), they were then with the grace of Allah able to fill the political gap on the same day without any Fitnah, after this they were able to face the threat of the hypocrites who turned back on their heels, after this the nation began to spread the message of Islam to all nations and they succeeded in defending against the big superpowers of the Romans and the Persians, this was the reign of Abu Bakr al-Siddeeq the successor of Rasul-Allah (saw).<\/p>\n<p style=\"text-align: justify;\">So what blessing do we seek after this blessing!?<\/p>\n<p style=\"text-align: justify;\">The next issue that may arise is that a Shi`ee would object by saying &#8220;Abu Bakr appointed `Umar and never consulted.&#8221; This is incorrect, rather Abu Bakr consulted the people of knowledge and piety and those whose words are heard, then he reached his decision based on this consultation, after it he presented his offer to the people and asked them if they would accept whomever he chose, after they agreed to this then he declared `Umar his successor.<\/p>\n<p style=\"text-align: justify;\">An Imami will say but what about the Hadith of Ghadeer? Isn&#8217;t this a divine appointment of `Ali as leader?<\/p>\n<p style=\"text-align: justify;\">Although we touched upon this topic in our previous article and it is refuted many times on many websites as is popularly known, we will not go into any detail rather we will go through it again quickly, Hadith-ul-Ghadeer according to the authentic reports consists of three parts:<\/p>\n<p style=\"text-align: justify;\">After some people complained about `Ali, the Prophet (saw) stood at Khum and said:<\/p>\n<p style=\"text-align: justify;\">&#8220;<span style=\"color: #008000;\">(a)Alastu Awla bil-Mu&#8217;mineen min Anfusihim?<\/span>&#8221; They replied: &#8220;Bala(Yes)&#8221; He said: &#8220;<span style=\"color: #0000ff;\">(b)Man Kuntu Mawlaahu `Aliyun Mawlaahu<\/span>, <span style=\"color: #ff0000;\">(c)Allahumma Waali man Waalaah wa `Aadi man `Aadaah<\/span>.&#8221;<\/p>\n<p style=\"text-align: justify;\">Imami Shia claim that since the Prophet (saw) established authority for himself in the green part <span style=\"color: #008000;\">(a)<\/span>, then he has automatically established it for `Ali as well in blue part <span style=\"color: #0000ff;\">(b)<\/span>.<\/p>\n<p style=\"text-align: justify;\">This is incorrect, tying what is said in part <span style=\"color: #008000;\">(a)<\/span> with what is being said in part <span style=\"color: #0000ff;\">(b)<\/span> is not accurate linguistically. The part <span style=\"color: #008000;\">(a)<\/span> is known in Arabic as &#8220;Istifhaam Taqreeree&#8221;, which in English means that the speaker poses a question to a person in which he requires him to answer by either confirming or denying in order to achieve a purpose such as condemning the person or reproaching him or anything else.<\/p>\n<p style=\"text-align: justify;\">An example from the Qur&#8217;an would be: {Did We not expand thy breast for thee?} And the purpose of this Istifhaam Taqreeree is for the Prophet (saw) to remember Allah&#8217;s blessing upon him and be thankful.<\/p>\n<p style=\"text-align: justify;\">Another example of this would be if you invited me to your house as an honored guest and I complained that your wife did not serve me nor honor my stay, then you tell me: &#8220;Am I not the owner of this house?&#8221; I reply: &#8220;Yes.&#8221; Then you say: &#8220;Whomever I&#8217;ve honored, my wife has (also) honored.&#8221;<\/p>\n<p style=\"text-align: justify;\">If I have established the ownership of the house to my self in the above example, it doesn&#8217;t mean that I have established it for my wife as well in the next part and the same applies to Hadith-ul-Ghadeer.<\/p>\n<p style=\"text-align: justify;\">In Hadith-ul-Ghadeer, it is actually part <span style=\"color: #ff0000;\">(c)<\/span> which gives context and explains part <span style=\"color: #0000ff;\">(b)<\/span>, and the former part states that the Muwaalaat in the Hadith is none other than Walaayah or love and closeness and friendship and support, this opposes enmity which the Hadith says &#8220;And be the enemy of his enemy&#8221;.<\/p>\n<p style=\"text-align: justify;\">This is supported by the words of the linguists, such as in Lisan al-`Arab we read:<\/p>\n<p style=\"text-align: justify;\">قال أَبو زيد طالتْ عُدَواؤهُمْ أَي تباعُدُهم وتَفَرُّقُهم والعَدُوُّ ضِدُّ الصَّدِيق<\/p>\n<p style=\"text-align: justify;\">[abu Zayd said: &#8220;Taalat `Udaa&#8217;uhum&#8221; meaning they became distant and separated, and the enemy is the opposite of the friend.]<\/p>\n<p style=\"text-align: justify;\">It also says:<\/p>\n<p style=\"text-align: justify;\">و الوَليُّ : الصَّدِيق والنَّصِير<\/p>\n<p style=\"text-align: justify;\">[And the Wali: (means) the friend and the supporter.]<\/p>\n<p style=\"text-align: justify;\">In al-Mukhassas by ibn Sayyidah we also read:<\/p>\n<p style=\"text-align: justify;\">العدوّ ضد الصديق<\/p>\n<p style=\"text-align: justify;\">[The enemy is what opposes the friend.]<\/p>\n<p style=\"text-align: justify;\">We also read the same in Fiqh-ul-Lughah by al-Tha`alibi.<\/p>\n<p style=\"text-align: justify;\">As for Taj-ul-`Arous by al-Zubaydi, we read:<\/p>\n<p style=\"text-align: justify;\">الولى له معان كثيرة فمنها ( المحب ) وهو ضد العدو اسم من والاه إذا أحبه ( و ) منها ( الصديق و ) منها ( النصير ) من والاه إذا نصره<\/p>\n<p style=\"text-align: justify;\">[Al-Wali has many meanings, from them the lover and he is what opposes the enemy, the name of which is &#8220;Walahu&#8221; meaning he loved him, and from them is the friend and the supporter, from it &#8220;Walahu&#8221; meaning he supported him]<\/p>\n<p style=\"text-align: justify;\">In other words, since he (saw) used Muwalat in part <span style=\"color: #0000ff;\">(b)<\/span> and explained it in the context of part <span style=\"color: #ff0000;\">(c)<\/span> its meaning becomes that of love and friendship and support and closeness which oppose enmity and hatred and separation.<\/p>\n<p style=\"text-align: justify;\">Next we will mention the two most popular meanings for &#8220;Mawlahu&#8221; according to the Shia and discuss them quickly:<\/p>\n<p style=\"text-align: justify;\">1- That it means authority and that `Ali is in charge of our affairs, which is outright rejected because the Prophet (saw) can&#8217;t say &#8220;Whomsoever I have authority over him, `Ali also has authority over him.&#8221; The leader of the Muslims in the time of the Prophet (saw) was himself, he was the one in charge and he was the chief of the believers, no one was his partner nor did he share authority with another man. However, it makes perfect sense for Rasul-Allah (saw) to tie his love with the love of his beloved cousin `Ali, not that `Ali was our leader alongside the Prophet (saw) who was also our leader, nor will anybody accept this, even the Shia do not believe that there can be two leaders at once, which is why they believe that when one of `Ali&#8217;s children is the leader in authority the other one has no authority and has to remain silent. I add, when a Sunni is asked today: &#8220;Is `Ali your Mawla?&#8221; he replies: &#8220;Yes.&#8221; even though `Ali is not in authority today nor is he in charge of us after his death, but we still love him to this day. Whereas, if Muwalat were to mean authority, then `Ali&#8217;s authority has ended with his death, so if a Shia is asked who is in charge of you today and he replies &#8220;`Ali&#8221; that means he has cancelled the leadership of his hidden Imam who is supposed to be his current leader and the man in authority.<\/p>\n<p style=\"text-align: justify;\">2- That it means `Ali is our owner and we are his slaves because he is the master, and this was and still is a popular opinion the Rafidah hold. This opinion is also rejected outright because Islam came to liberate humankind from slavery and honor it, and no Muslim believes he is a slave to any creature, we are not owned by Muhammad (saw) nor `Ali. This belief they hold is corrupt, because if we were all owned slaves for Muhammad (saw) and `Ali, then inheritance is cancelled by default since slaves cannot inherit by consensus, all of our belongings would go to our masters after our death and during our lives, also if people were owned by `Ali then they cannot marry-off their sister and daughters since the slaves have no authority in marriages, also this means `Ali cannot marry as everyone would be his slave, he can only seek pleasure through what his right hand possesses but not through marrying a free-woman, also this means charity is cancelled as charity is given from the rich to the poor and if we were all owned that means the poor from us would be rich through the wealth of their owner `Ali and rich of us would be poor because everything we possess belongs to our owner `Ali, thus what we mentioned is sufficient to refute this belief.<\/p>\n<p style=\"text-align: justify;\">We turn the table on the Madhabi Shia now and direct our attention towards their own stronghold of Iran, the Madhabi Shia scholars claim that if Rasul-Allah (saw) had left the nation without an appointed successor, this means he does not care about their future and fate. We would like to open the eyes of the Shia laypeople to their political Imam al-Khomayni, the father of the Islamic republic of Iran, this man never appointed his successor and he died leaving them all behind without a Khalifah, does this mean Khomayni never cared for the future of the religion and the fate of his Islamic revolution?  Khomayni before his death appointed Khaminai as the leader of the Friday prayer in Tehran and this was a sign that he wished for him to succeed him, Khaminai was later chosen as successor after the Shia Assembly of Experts gathered and did their consultation or &#8220;Shura&#8221;.<\/p>\n<p style=\"text-align: justify;\">The truth is that Khomayni did care, but he also knew that he had an Assembly of Experts composed of 76 of the highest of Shia scholars, they were all trustworthy and reliable according to him, they had a state to back them up and they were all loyal to the idea of Tashayyu`, this is why the man was comfortable and didn&#8217;t feel an urgent need to make an appointment.<\/p>\n<p style=\"text-align: justify;\">This is the same man who gave this excuse as to why `Ali&#8217;s name was not announced in the Qur&#8217;an:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">[Those (referring to Sahabah) who had no attachment with Islam and Qur&#8217;an except for sake of Leadership and Worldly gains, they used to make Qur&#8217;an a means for their corrupt goals, it was possible for them to alter this Heavenly Book (Qur&#8217;an) whenever the name of the Imam was mentioned in the Qur&#8217;an, and erase those verses and thus attaching disgrace and shame on the lives of Muslims.]<\/p>\n<p style=\"text-align: justify;\">Source: Kashful Asrar Page 114 by al-Khomayni.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The last matter to address in this article is the second question, that how can Rasul-Allah (saw) leave the nation without mentioning anything about leadership and without giving any advice or instructions concerning it.<\/p>\n<p style=\"text-align: justify;\">We will answer this question by quoting a large quantity of prophetic texts that speak of leadership and authority, because the question itself is a result of the ignorance of the questioner who never thought of opening the books of the Sunnah and finding large amounts of narrations addressing matters of leadership and politics.<\/p>\n<p style=\"text-align: justify;\">In the name of Allah we begin,<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">1-[`Abdullah said: The oppression of a leader for fifty years is better than one month of Harj, because the Prophet (saw) said: Definitely the people are in need of the authority of the rulers whether they are good or corrupt, as for the good ones they divide the bounties justly between you, as for the corrupt ones they shall be a test for the believer, and the corrupt Imarah(leadership) is better than al-Harj. They asked: What is al-Harj? He (saw) said: Lots of murder and lies.]<\/p>\n<p style=\"text-align: justify;\">2-[Thawran said: We were sitting in the mosque when `Ammar passed us by, we said to him: O `Ammar, tell us what you heard concerning Fitnah from the Hadith of the Prophet (saw). He said: I heard the Prophet (saw) say: After me will come folks who will grab the kingdom, they will kill one another for it. We said to him: If anyone other than you told us that we would not have believed him. He said: It shall happen.]<\/p>\n<p style=\"text-align: justify;\">3-[`Ata&#8217; said: The Prophet (saw) said to Quraysh: You are the most worthy of the people for this matter(leadership) as long as you are upon truth, except if you leave it(truth) then you will have it(leadership) taken away from you.]<\/p>\n<p style=\"text-align: justify;\">4-[Abu Dharr said: I asked the Prophet (saw) to appoint me in a position of authority, he said: O Abu Dharr, you are a weak man and it(leadership) is a trust and it(leadership) will be a cause of disgrace and remorse on the Day of Resurrection except for the one who takes it up with a full sense of responsibility and fulfills what is entrusted to him (discharges its obligations efficiently).]<\/p>\n<p style=\"text-align: justify;\">5-[`Awf said: I asked the Prophet (saw) about leadership and being in authority, he replied: It begins with blame, then regret, then misery on the day of judgment, except for one who is a just ruler, and how can one be unbiased when judging his own relative?]<\/p>\n<p style=\"text-align: justify;\">6-[Abu Musa said: I asked to be in a position of authority so the Prophet (saw) said: We do not assign the authority of ruling to those who ask for it, nor to those who are keen to have it.]<\/p>\n<p style=\"text-align: justify;\">7-[Jabir said: The Prophet (saw) said: The worst of the dead is the one who dies (fighting in a war) between two groups, one of which is asking for the kingdom.]<\/p>\n<p style=\"text-align: justify;\">8-[`Uqbah said: The Prophet (saw) that he said to Quraysh: This matter(leadership) shall remain yours and you are the rulers as long as you do not deviate from the path, if you do then Allah will send his most evil creations and they will take all that you have.]<\/p>\n<p style=\"text-align: justify;\">9-[Abu Sa`eed said: The Prophet (saw) said: There will be rulers upon you with whom your hearts will feel pleased and you will feel comforted; then there will be rulers upon you with whom your hearts will tremble [with fear] and your skins will quiver. A man said: Should we dethrone them, O Prophet of God? He replied: No. Not as long as they establish prayer.]<\/p>\n<p style=\"text-align: justify;\">10-[Abu Bakrah said: The Prophet (saw) said: A people who give authority to a woman over them shall not succeed.]<\/p>\n<p style=\"text-align: justify;\">11-[Junadah said: The Prophet (saw) called us and took a pledge of allegiance from us. Among the things which he made binding upon us, through the pledge, he directed us that we are to hear [the commands of our rulers] and to obey [them] – whether with the willingness of our hearts or under compulsion, whether with disgust or with fondness, and even if others are given undue preference over ourselves. And that we will not try to snatch the rule from those who possess it, except that you observe such an open rejection [of faith] on their part, about which you have a clear and unequivocal directive from God. And that we will always proclaim the truth, wherever we might be; in matters relating to God, we will not be discouraged by anyone’s rebukes.]<\/p>\n<p style=\"text-align: justify;\">12-[Abu Sa`eed said: The Prophet (saw) said: Every one who breaks a covenant will have a flag on the Day of Resurrection. It will be raised higher according to the nature of his breach. Behold, there will be no greater a sin with respect to breaking the covenant than that of a Emir(ruler) who breaks his covenant with the Muslim masses.]<\/p>\n<p style=\"text-align: justify;\">13-[`Iyad said: The Prophet (saw) said: He who wishes to give advice to one in authority, he mustn&#8217;t say it publicly, but he takes him by the hand and talks to him privately, if he accepts it from him then that it is, and if he rejects then he has done his part.]<\/p>\n<p style=\"text-align: justify;\">14-[Zayd said: The Prophet (saw) said: May Allah make bright (beautiful, happy) the face of the one who listens to my saying, and he memorizes it, understands it and delivers it to others. How many people may carry knowledge while they are not knowledgeable, and how many people carry knowledge to those who are more knowledgeable than them? There are three qualities on which the heart of a Muslim does not betray him ever, working sincerely for Allah, well wishing towards those leaders in authority, and sticking to the majority group(Jama`ah) for indeed the prayers of the Muslims surround those [who adhere to the political unit] from behind them.]<\/p>\n<p style=\"text-align: justify;\">15-[`Abdullah said: The Prophet (saw) said: There will soon be a time when you see preferential treatment [of others] and abominable deeds [in the rulers]. People asked: O Prophet of God, what do you direct us to do [under such circumstances]? He said: Give them the rights that they have on you and [if they don’t grant you the rights that you have on them, then] ask God for your rights.]<\/p>\n<p style=\"text-align: justify;\">16-[Sa`d said: The Prophet (saw) said: There is no Emir(ruler) of ten [people] unless he is brought with his body tied up on the day of judgement, only his justice will set him free.]<\/p>\n<p style=\"text-align: justify;\">17-[Mu`qil said: The Prophet (saw) said: Any slave whom Allah makes him in charge of subjects, he dies on the day of his death cheating his subjects, Allah will make paradise unlawful for him.]<\/p>\n<p style=\"text-align: justify;\">18-[Ziyad said: The Prophet (saw) said: After me will be chaotic times, so when you see one who has left the al-Jama`ah(Majority of Muslims) or intends to divide the nation of Muhammad (saw), then kill him whoever he may be, because the hand of Allah is on the Jama`ah(Majority), and the devil runs along with the one who separates himself from it.]<\/p>\n<p style=\"text-align: justify;\">19-[Abu Sa`eed said: The Prophet (saw) said: Allah neither raised up any Prophet nor did He authorize any person with ruling power but for whom there were two types of entourage: one enjoins upon him to do good and incites him to carry it out, and the other enjoins evil and goads him; and the protected (from the bad entourage) is the one whom Allah protects.]<\/p>\n<p style=\"text-align: justify;\">20-[Anas said: The companions reported from the Prophet (saw): Do not curse your Emirs(rulers), nor cheat them, nor hate them, and fear Allah and be patient because the matter has become near.]<\/p>\n<p style=\"text-align: justify;\">21-[Wa&#8217;il said: We asked: O Prophet of God, if we come under the rule of such rulers who demand their rights but do not grant us our rights, what do you direct us to do? The Prophet (saw) said: Hear [their commands] and obey [them]. For indeed upon them is the fulfillment of their responsibilities and upon you is the fulfillment of your responsibilities.]<\/p>\n<p style=\"text-align: justify;\">22-[Abu Hurayrah said: The Prophet (saw) said: Whosoever obeys me, obeys Allah; and he who disobeys me, disobeys Allah; and whosoever obeys the Emir(ruler), in fact, obeys me; and he who disobeys the Emir, in fact, disobeys me.]<\/p>\n<p style=\"text-align: justify;\">23-[`Ali said: The Prophet (saw) said: Whoever from among them [i.e., your leaders] commands you something that entails disobedience to God, do not obey him. Obedience is only in good things.]<\/p>\n<p style=\"text-align: justify;\">24-[Abu Mariyam said: The Prophet (saw) said: If Allah gives authority to someone over the affairs of the Muslims and he (i.e., the ruler) ignores their rights, denies their access to him and neglects their needs, Allah will not answer his prayer or realize his hopes and will act towards him with indifference on the Day of Resurrection.]<\/p>\n<p style=\"text-align: justify;\">25-[Abu Hurayrah said: The Prophet (saw) said: Allah accepts for you three and hates for you three, he accepts for you to worship him and not associate anyone with him, and to hold fast to the rope of Allah and not separate, and to give good advice to the one whom he gives authority over you. He hates for you to gossip, and to ask irrelevant questions and to waste money.]<\/p>\n<p style=\"text-align: justify;\">26-[Abu Dharr said: The Prophet (saw) asked: What will you do when there come upon you rulers who delay prayers from their prescribed times? I replied: What do you direct me to do? The Prophet (saw) said: Offer your prayer at its prescribed time, then if you find them praying within the time, offer it with them too, as it would be considered an extra (supererogatory) offering for you. And if you do not [find them offering prayer within the prescribed time], you would have saved your prayer [from expiration.]<\/p>\n<p style=\"text-align: justify;\">27-[Anas said: The Prophet (saw) said: The Emirs(rulers) are from Quraysh as long as they rule over you with three(things): As long as they are merciful when they are begged to show mercy, and they divide with equity, and judge in fairness.]<\/p>\n<p style=\"text-align: justify;\">28-[Abu Sa`eed said: The Prophet (saw) said: When allegiance is pledged to two rulers, kill the second one.]<\/p>\n<p style=\"text-align: justify;\">29-[Nafi` said: The Prophet (saw) said: The one who withdraws his hand from obedience to the ruler, will find no argument (in his defense) when he stands before Allah on the Day of Resurrection, and Whosoever dies without having sworn allegiance will die the death of the times of ignorance(Jahiliyyah).]<\/p>\n<p style=\"text-align: justify;\">30-[Al-Nu`man said: The Prophet (saw) said: Prophet-hood will remain in you for as long as God decides for it to remain and then God will remove it when He decides to remove it. After prophet-hood, there will be a Caliphate on the style of prophet-hood and it will exist for as long as God decides for it to exist, then He will remove it when He decides to remove it. Then there will be a kingdom in which people will face trials and tribulations and it will continue to exist for as long as God decides for it to exist. Then He will remove it, when He decides to remove it. After this, there will be an oppressive kingdom and it will continue to exist for as long as God decides for it to exist. Then He will remove it, when He decides to remove it. Then there will once again be a rule on the style of prophet hood. After saying this, the Prophet (saw) was silent.]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">These narrations are the answer to the second question posed by the Madhabi Shia propagandists, as you can see their claim that Rasul-Allah (saw) left us without mentioning leadership or giving instructions with regards to it is nothing short of a lie, and we provided a big number of narrations illustrating this, we could still quote a lot more narrations if we wish but that serves no purpose other than further prolonging our article. The above texts are rich in advice, in wisdom, in instructions, in orders and prohibitions related to the matter of leadership, when one collects all narrations related to a certain subject he will have good knowledge of the divine principals and guidelines he must follow, and this is sufficient for people who wish to be guided.<\/p>\n<p style=\"text-align: justify;\">It is imperative that we highlight a matter although it is obvious, these religious texts we quoted as well as many other narrations, make it extremely clear that there shall not be any appointment nor shall the leaders be infallible or &#8220;all-knowing&#8221;. Most of the advice the Prophet (saw) gave us above makes no sense if the leader was intended to be a divinely appointed infallible man.<\/p>\n<p style=\"text-align: justify;\">Before we conclude, one of our brothers who just reverted to Sunnah after having been a Shia his entire life, he has provided an answer with his own words and his own style, to honor him we shall include his answer word for word, for the benefit of the readers so they can see how this average Shia layman reached a logical conclusion after sincere, honest and intellectual research.<\/p>\n<p style=\"text-align: justify;\">He says answering the above questions:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">[Yes, I used to use this argument alot back in the days. It would be the first argument I&#8217;d make to a Sunni.<\/p>\n<p style=\"text-align: justify;\">This question is thought of as a trump-card by Shiites. They believe that Ahlul Sunnah have no answer to it. They even compare it with leaving a will. They&#8217;ll say, &#8220;Doesn&#8217;t the Qur&#8217;an order a Muslim to leave a will? Then how can the Prophet (saws) not have left a will?&#8221; As if leaving a will has anything to do with appointing a leader. A will is a personal document, setting out one&#8217;s affairs. Well, we know that the Prophet (saws) did indeed leave a will, and he still didn&#8217;t appoint a successor in it.<\/p>\n<p style=\"text-align: justify;\">The overriding argument that the Shiites make is, &#8220;How can the Prophet not have left a successor? Why would he leave the people after him without any leadership?&#8221; The point that they try to make is that by not appointing a successor the Prophet (saws) failed in his mission, and let the religion be corrupted at the end.<\/p>\n<p style=\"text-align: justify;\">Well, to this I say that the Shiites cannot have their cake and eat it too. How so? Well:<\/p>\n<p style=\"text-align: justify;\">Shiites claim that he appointed &#8216;Ali (ra) as his successor. Well, we know that &#8216;Ali (ra) was not accepted as the successor after the Prophet (saws). So we are left with the following conclusions:<\/p>\n<p style=\"text-align: justify;\">a) All the Muslims were unaware that &#8216;Ali (ra) was appointed the successor. If so, the Prophet (saws) failed in delivering the message. He clearly did a poor job in informing the Muslim masses of &#8216;Ali (ra)&#8217;s appointment.<\/p>\n<p style=\"text-align: justify;\">b) The Muslims did know about &#8216;Ali (ra)&#8217;s appointment, but they all rejected it. If so, the Prophet (saws) failed in his mission. He failed to reform the Arabs, and at the end of it the Muslims whom the Prophet (saws) spent decades educating abandoned his religion the moment he died. This ofcourse is the belief of the Shiites, because they cannot possibly accept option a). If Shiites want to believe that &#8216;Ali (ra) was the appointed successor, then they must believe that basically all the Muslims after the Prophet (saws)&#8217;s death were hypocrites, apostates and kuffar.<\/p>\n<p style=\"text-align: justify;\">I mean, how can we possibly consider the Prophet (saws) to have been a successful Messenger if this is the case? Was Prophethood just about delivering a message, or was it about changing the people? Clearly the people were not changed, and clearly they did not respect the Prophet (saws). This ofcourse flies in the face of all the facts that we possess.<\/p>\n<p style=\"text-align: justify;\">Did the Prophet (saws) appoint a leader?<\/p>\n<p style=\"text-align: justify;\">ANSWER: NO, THE PROPHET (SAWS) DID NOT SPECIFY WHO WOULD LEAD THE MUSLIMS AFTER HIM.<\/p>\n<p style=\"text-align: justify;\">This was not his mission. His mission did not include appointing a successor, because he cannot have a successor. He is the last of the Prophets. I do not believe the term &#8220;khalif&#8221; is rightfully translated as &#8220;successor&#8221;. It is better translated as &#8220;deputy&#8221; or something similar.<\/p>\n<p style=\"text-align: justify;\">His mission was to deliver the message, to reform the people and the society, teach them halal &amp; haram, teach them the compulsory and recommended acts, inform them of the Day of Judgement and so on.<\/p>\n<p style=\"text-align: justify;\">The point of his mission is that if he is successful in teaching the people, then the people should be able to take care of themselves after him. This includes choosing a suitable leader.<\/p>\n<p style=\"text-align: justify;\">Infact, the Prophet (saws) did teach the people about leadership.<\/p>\n<p style=\"text-align: justify;\">He himself appointed people to rule when he left a place. The Shiites take this as a lesson that he must have left a successor, and the argument is &#8220;If he appointed someone in his place when he left a town, how can he not have appointed someone when he left the people for good!?!&#8221;.<\/p>\n<p style=\"text-align: justify;\">As usual, the Shiites muddle up and confuse the issue, as is typical of extremists.<\/p>\n<p style=\"text-align: justify;\">The lesson that they should take, instead, is that when the Prophet acted as a leader, he was demonstrating how a person should lead. Appointing a representative when he left a town was indeed emulated by the Khalifs after him &#8211; by appointing governers and deputies to represent them.<\/p>\n<p style=\"text-align: justify;\">We know that the Prophet (saws) would allow the companions to convey their opinions in certain matters. Such as the Treaty of Hudaybiyah, when the companions argued, or the Battle of the Trench, when they recommended building a ditch and other similar cases.<\/p>\n<p style=\"text-align: justify;\">What does this show?<\/p>\n<p style=\"text-align: justify;\">To the Shiites, ofcourse, any arguing that the companions did is evidence that they are kuffar who liked to argue with the Prophet. As usual, the extremist and nonsensical conclusion.<\/p>\n<p style=\"text-align: justify;\">Rather, it shows that the Prophet (saws) encouraged consultation and a spirit of community. He was teaching the Muslims to govern their affairs through consultation and as a community.<\/p>\n<p style=\"text-align: justify;\">Long story short, what did the Muslims do when the Prophet (saws) died? Did they kill each other for leadership and destroy Islam?<\/p>\n<p style=\"text-align: justify;\">No &#8211; they elected the best man among them, and then the best man after him, and they strengthened Islam and made the Ummah into a superpower.<\/p>\n<p style=\"text-align: justify;\">So did the Prophet (saws) fail in his mission? On the contrary, he succeeded as no Prophet succeeded before him, and we Muslims will never achieve the power that we once had until we emulate those who the Prophet (saws) taught with his own hands.]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">And peace be upon our master Muhammad (saw) and his household and companions.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In our past article (here) we discussed Imamah and its two branches, the political Imamah and the religious Imamah, in this article we shall answer the two questions that any Madhabi Shia may use as a last resort to defend <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/11\/13\/rasul-allah-saw-and-the-future-of-the-ummah\/\" title=\"Rasul-Allah (saw) and the future of the Ummah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[],"class_list":{"0":"post-1522","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1522","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1522"}],"version-history":[{"count":21,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1522\/revisions"}],"predecessor-version":[{"id":1798,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1522\/revisions\/1798"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1522"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1522"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1522"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}