{"id":1568,"date":"2014-12-02T20:15:43","date_gmt":"2014-12-02T20:15:43","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1568"},"modified":"2014-12-02T20:15:43","modified_gmt":"2014-12-02T20:15:43","slug":"response-to-some-of-the-sahaba-would-look-at-a-beautiful-woman-in-salat","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/12\/02\/response-to-some-of-the-sahaba-would-look-at-a-beautiful-woman-in-salat\/","title":{"rendered":"Response to: Some of the Sahaba would look at a Beautiful Woman in Salat"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1568\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to SlaveOfAhlubait’s article: “Some of the Sahaba would look at a Beautiful Woman in Salat.” The article was published on the 5th of June, 2012, and can be found <a href=\"http:\/\/ahlubait.wordpress.com\/2012\/06\/05\/some-of-the-sahaba-would-look-at-a-beautiful-woman-in-salat-authentic-narration\/\" rel=\"external nofollow\">here<\/a>. <\/strong><\/p>\n<p style=\"text-align: justify;\">SoA without even commenting on the narration, quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Abbas says that there was a woman who would offer prayers behind Holy Prophet asws, she was beautiful amongst the most beautiful in people , so some in the Nation would go forward till they reached first row so that they do not see her; while others would stay behind till they reach the last rown so that they can see her from their underarms when they would bow. Upon this, Allah revealed: and We know who moves forward in you and who stays behind [surat ul Hajr, 15] <\/span><br \/>\n<span style=\"color: #800000;\">REFERENCE:- <\/span><br \/>\n<span style=\"color: #800000;\">1- Sunan Tirmidhi, urdu version, 2\/314, narration 2915<\/span><br \/>\n<span style=\"color: #800000;\">2- Sahih Sunan Tirmidhi, Albany, 3\/264. Sheikh Albany terms it Sahih<\/span><\/p>\n<p style=\"text-align: justify;\">Grading of the Narration:<\/p>\n<p style=\"text-align: justify;\">\nThe narration was weakened by Al-Tirmithi himself in his Sunan. He said: This narration was similarly narrated by Ja’afar bin Sulaiman from Amr bin Malik from Abi Al-Jawza’a, and he did not mention Ibn Abbas, and this seems to be more correct than the hadith of Nuh (meaning the hadith above).<br \/>\nAl-Albani responded to this in his Al-Silsila Al-Saheeha 5\/609 by saying that Nuh is stronger than Ja’afar bin Sulaiman. He also mentioned that Nuh was strengthened by Yahya bin Ma’een according to Uthman Al-Darimi.<br \/>\nAl-Albani, was mistaken, since it seems that he relied on quoting a late scholar instead of quoting the original source. When returning to Uthman Al-Darimi, we find him quoting that Yahya bin Ma’een actually strengthened Khalid bin Qais, who he referred to as the brother of Nuh. See page 102.<br \/>\nYahya’s real opinion about Nuh is that he is shwaikh (small shaikh)salih al-hadeeth, which is a much lesser degree of strengthening than thiqa. See Ibn Tahman (p. 40).<br \/>\nFurthermore, Al-Albani rejected the statement attributed to Yahya that he is weak, since it comes to Abu Dawud from a disconnected chain. However, this is incorrect, because Yahya mentioned here is Yahya bin Sa’eed Al-Qattan, and not Yahya bin Ma’een. See Al-Takmeel by Ibn Katheer 1\/413. Of course, we do not blame Al-Albani for making these mistakes, since some of these books were not available when he was alive, may Allah have mercy on him.<br \/>\nIt should also be noted that Al-Nasa’ee put him in a lower level of tawtheeq as well. See previous source.<br \/>\nWith all the above in mind, it becomes clear as to why Al-Tirmithi chose the narration of Ja’afar bin Sulaiman over the narration of Nuh bin Qais, for both are mid-tier narrators. Other reasons that Al-Tirmithi chose the narration of Ja’afar is because Ja’afar’s narration implies a greater sense of dhabt. This is because he purposefully narrated a disconnected narration in favor of the common chain of Abu Al-Jawza’a from Ibn Abbas. Among hadith scholars, this is evidence of the correctness of a narration.<br \/>\nIt should also be noted that when an early scholar weakens a narration due to a hidden defect, his opinion has greater weight than that of a contemporary scholar with limited resources.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Context of the Verse:<\/p>\n<p style=\"text-align: justify;\">\nAnother reason as to why this narration is weak is because it does not fit the context of the Qur’an for the verses that come before and after this verse have to do with creation, death, and resurrection.<br \/>\nAl-Tabari quotes from an authentic chain up until Qatada, who then narrated from Ibn Abbas (though disconnected) that the word mustaqdimeen are Adam and his children that have died before us, and that the musta’khireen are those that are yet to die. This, even though it is disconnected, is much more fitting of the verse when taking context into consideration. This is why Al-Tabari mentions that this is the most correct interpretation of the verses after quoting different views of the meaning of the verses. See Tafseer Al-Tabari 7\/507-510.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to SlaveOfAhlubait’s article: “Some of the Sahaba would look at a Beautiful Woman in Salat.” The article was published on the 5th of June, 2012, and can be found here. SoA without even commenting on <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/12\/02\/response-to-some-of-the-sahaba-would-look-at-a-beautiful-woman-in-salat\/\" title=\"Response to: Some of the Sahaba would look at a Beautiful Woman in Salat\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-1568","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1568","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1568"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1568\/revisions"}],"predecessor-version":[{"id":1569,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1568\/revisions\/1569"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1568"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1568"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1568"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}