{"id":1578,"date":"2014-12-10T15:42:46","date_gmt":"2014-12-10T15:42:46","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1578"},"modified":"2014-12-10T15:56:52","modified_gmt":"2014-12-10T15:56:52","slug":"sultan-ali-shah-and-tahreef","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/12\/10\/sultan-ali-shah-and-tahreef\/","title":{"rendered":"Sultan `Ali Shah and Tahreef"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1578\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">al-Salamu `Aleykum,<\/p>\n<p style=\"text-align: justify;\">Late Imami Shia scholars such as Majlisi, Jaza&#8217;iri &amp; Noori believed in Tahreef as is known from their popular works and explicit statements. Today InshaAllah, we try to introduce our readers to another popular Shia scholar who shares the same enmity and hatred towards the companions that he also adopted the belief of Tahreef.<\/p>\n<p style=\"text-align: justify;\">Sultan Muhammad bin Haydar Muhammad al-Janabidhi, also known as Sultan `Ali Shah the 14th century scholar who wrote the Shia Tafseer called &#8220;Bayan-ul-Sa`adah&#8221; in the year 1311 hijri.<\/p>\n<p style=\"text-align: justify;\">This Shi`ee begins his book by praising the Prophet (saw) and the Imams whom he describes as being eleven infallible leaders with the 12th one being al-Qa&#8217;im al-Hujjah.<\/p>\n<p style=\"text-align: justify;\">Then on page 19 of volume 1 he announces his beliefs in his own book of Tafseer:<\/p>\n<p style=\"text-align: justify;\"><em><strong>[Section thirteen:<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\"><em><strong>Regarding the additions and deletions and the tampering with the arrangement and the corruption and alterations that have taken place in the Qur&#8217;an we have with us, the Qur&#8217;an we were ordered to recite and obey and whose rulings we are to follow.<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\"><em><strong>Know (O reader) that the narrations are great in number from the path of the pure Imams (as) which declare that additions and deletions and corruption and alteration have taken place in it, in such a way that leaves no doubt that some of it was actually uttered by them (as)]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">As you can see, his opinion is quite clear in this matter. Al-Janabidhi then gives the other side of the argument, that people say that this corruption only happened to the interpretation not the text and that the Qur&#8217;an was collected in the time of the companions and the Muslims took great care of it etc&#8230;<\/p>\n<p style=\"text-align: justify;\">He then comments on this explanation in the same page by saying:<\/p>\n<p style=\"text-align: justify;\"><em><strong>[What they mistakenly believed to be evidence for this, such as it (Qur&#8217;an) being collected in the lifetime of the Prophet (saw) according to them, and that they used to memorize it and study it, and that the companions were preserving it from change and alteration  in a way that they established the correct recitations. We answer by saying: As far as it being collected in his lifetime this is disputable since it was being revealed until the end of his life, plenty of narrations state that parts of it were revealed in the last year. Rather they began collecting it after his death and `Ali was also busy in his house collecting it and this cannot be denied. As for them studying and memorizing it, we agree with this but they only studied and memorized that which was in their hands, as for them being concerned about preserving it and its recitations this was only after it was collected and arranged so just like some of them had intentions of preserving it, other hypocrites wanted to corrupt it.]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">Janabidhi says that based on this the Qur&#8217;an is unreliable but still the Imams have ordered them to recite it, so does this mean it isn&#8217;t corrupted? He answers:<\/p>\n<p style=\"text-align: justify;\"><em><strong>[It is obligatory to follow it (Qur&#8217;an) and obey its prohibitions and laws since many narrations mention what we have stated previously but not because what is between the two covers is the (perfect) Book revealed on Muhammad (saw) without deletions, additions and corruption. We only benefit from such narrations, that the additions and deletions and alterations if they took place in the Qur&#8217;an, do not corrupt the meaning of the rest of it. Rather I say, the most important function of the Book of Allah was pointing towards the `Itrah(Ahlul-Bayt) and to tell us to hold on to them, as for the rest it contained their Hujjah(argument). After holding on to Ahlul-Bayt, if they should order us to follow it (the Qur&#8217;an) then it becomes a definite authority even if it was corrupted in a way that damages its meaning. On the other hand, if we did not hold on to Ahlul-Bayt or if they did not order us to follow the Book, then even if it weren&#8217;t corrupted in this case, yet by obeying it and following its orders and extracting its rulings by our own personal effort we would be committing what they had prohibited, because they (as) prohibited us from interpreting it by our own opinions.]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">This part may have been a bit hard for some readers to understand. What the Shia scholar is saying here is that Ahlul-Bayt are the main purpose of the Book of Allah, they are the most important aspect of the religion and they told us that the Book is corrupted. If Ahlul-Bayt still tell us to hold on to the Qur&#8217;an even after knowing that it is corrupted then we must do as they say and it becomes a Hujjah upon us. If one does not hold on to Ahlul-Bayt, then the Qur&#8217;an is useless whether it was corrupted or not.<\/p>\n<p style=\"text-align: justify;\">Finally, he mentions our old friend al-Fayd al-Kashani and his opinion in Tahreef that we discussed in an earlier article, he says:<\/p>\n<p style=\"text-align: justify;\"><em><strong>[In the introduction of the Tafseer of al-Fayd (ra) called &#8220;al-Safi&#8221; he gathered the narrations and opinions so whoever wishes can refer back to his book. He had also mentioned many narrations throughout the pages of his Tafseer for the verses showing the alterations that have taken place in them.]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">Now let&#8217;s see how this Shia scholar applies his belief in Tahreef on the ground of reality!<\/p>\n<p style=\"text-align: justify;\">We all know this Qur&#8217;anic verse:<\/p>\n<p style=\"text-align: justify;\">{O Messenger, announce that which has been revealed to you from your Lord, and if you do not, then you have not conveyed His message. And Allah will protect you from the people.} [5:67]<\/p>\n<p style=\"text-align: justify;\">And we all know this popular Shi`ee narration from Tafseer al-Safi, that the Prophet (saw) said:<\/p>\n<p style=\"text-align: justify;\"><strong>فَقَدْ ضَمِنَ لِي تَبَارَكَ وَتَعَالَى الْعِصْمَةَ وَهُوَ اللَّهُ الْكَافِي الكَرِيمُ فَأَوْحَى اللَّهُ إِلَيَّ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ فِي عَليٍّ صَلَوَاتُ اللَّهِ وَسَلاَمُهُ عَلْيْهِ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ مَعَاشِرَ النَّاسِ مَا قَصَّرْتُ فِي تَبْلِيغِ مَا أَنْزَلَهُ وَأَنَا مُبَيِّنٌ لَكُمْ سَبَبَ هَذِهِ الآيَةِ إِنَّ جَبْرِئِيل هَبَطَ إِلَيَّ مِرَاراً يَأَمُرُني<\/strong><\/p>\n<p style=\"text-align: justify;\"><em><strong>[&#8230;For my Lord has guaranteed protection for me, and Allah is kind and sufficient, so he revealed to me through the divine revelation: In the name of Allah, the Entirely Merciful, the Especially Merciful: {O Messenger, announce that which has been revealed to you from your Lord <span style=\"color: #000080;\">concerning `Ali peace be upon him<\/span>, and if you do not, then you have not conveyed His message. And Allah will protect you from the people.} O people, I did not fall short in delivering what Allah revealed, and I shall explain to you the reason for this verse&#8217;s revelation, Jibra&#8217;eel descended on me time after time ordering me&#8230;]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">Now let&#8217;s see how al-Janabidhi interpreted this verse in his book:<\/p>\n<p style=\"text-align: justify;\"><strong>{يَـۤأَيُّهَا ٱلرَّسُولُ بَلِّغْ مَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ}عنهم (ع) كان هناك: فى علىّ؛ فأسقطوه {وَإِن لَّمْ تَفْعَلْ} خوفاً من افتتان امّتك وفتنتك بهم { فَمَا بَلَّغْتَ رِسَالَتَهُ } لانّ الولاية غاية الرّسالة فان لم تحصل كانت الرّسالة كأن لم تحصل<\/strong><\/p>\n<p style=\"text-align: justify;\"><em><strong>[{O Messenger, announce that which has been revealed to you from your Lord} They (as) said: There was &#8220;Concerning `Ali&#8221; but they dropped it (from the Qur&#8217;an). {and if you do not} Out of fear that your nation shall go through a trial and you will face a trial through them. {then you have not conveyed His message.} Because the Wilayah is the purpose of the message, so if it is not announced then it is as if the message itself was not revealed]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">He openly attributes to the Imams that they said the word `Ali was present in this verse but the companions dropped it, then he continues explaining the rest as if nothing happened.<\/p>\n<p style=\"text-align: justify;\">Finally, we end with his comment on the verse of preservation of the Qur&#8217;an, verse 9 of chapter 15 which says:<\/p>\n<p style=\"text-align: justify;\">{Indeed, it is We who sent down the Remembrance and indeed, We will be its guardian.}<\/p>\n<p style=\"text-align: justify;\">Janabidhi comments on it by saying:<\/p>\n<p style=\"text-align: justify;\"><strong>ولا ينافى حفظه تعالى للذّكر بحسب حقيقته التّحريف فى صورة تدوينه فانّ التّحريف ان وقع وقع فى الصّورة المماثلة له كما قال فويل للّذين يكتبون الكتاب بأيديهم ثمّ يقولون هو من عند الله وما هو من عند الله<\/strong><\/p>\n<p style=\"text-align: justify;\"><em><strong>[Allah&#8217;s preservation of the reality of the Remembrance does not conflict with the Tahreef(corruption) that has taken place in its written image, for if corruption had taken place then it has happened to the (written) image which resembles it, as He said: So woe to those who write the Book with their own hands, then say, &#8220;This is from Allah&#8221; and it isn&#8217;t from Allah.]<\/strong><\/em><\/p>\n<p style=\"text-align: justify;\">So in conclusion, he believes this verse is not evidence for the Qur&#8217;an&#8217;s preservation, rather it means that Allah has preserved its reality but not the copy or image which is in people&#8217;s hands today, the version we have was written by the hands of the hypocrites.<\/p>\n<p style=\"text-align: justify;\">The above evidence is sufficient for those with intellect.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>al-Salamu `Aleykum, Late Imami Shia scholars such as Majlisi, Jaza&#8217;iri &amp; Noori believed in Tahreef as is known from their popular works and explicit statements. Today InshaAllah, we try to introduce our readers to another popular Shia scholar who shares <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/12\/10\/sultan-ali-shah-and-tahreef\/\" title=\"Sultan `Ali Shah and Tahreef\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[],"class_list":{"0":"post-1578","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1578","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1578"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1578\/revisions"}],"predecessor-version":[{"id":1585,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1578\/revisions\/1585"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1578"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1578"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1578"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}