{"id":1586,"date":"2014-12-11T17:31:01","date_gmt":"2014-12-11T17:31:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1586"},"modified":"2015-11-11T12:10:28","modified_gmt":"2015-11-11T12:10:28","slug":"response-to-rasool-allahs-curse-upon-muawiyyah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/12\/11\/response-to-rasool-allahs-curse-upon-muawiyyah\/","title":{"rendered":"Response to: Rasool Allah’s Curse upon Muawiyyah."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1586\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to Wilayat.net’s article “Rasool Allah’s Curse upon Muawiyyah.” The article can be found <a href=\"http:\/\/www.wilayat.net\/index.php?option=com_content&amp;view=article&amp;id=2660:rasool-curse-upon-muawiyyah-ever-hungry&amp;catid=187:muawiyyah&amp;lang=en\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">The article opens with the following narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Sahih Muslim, Book 032, Number 6298:<\/span><br \/>\n<span style=\"color: #800000;\">Ibn Abbas reported: I was playing with children that Allah&#8217;s Messenger (may peace be upon him) happened to pass by (us). I hid myself behind the door. He (the Holy Prophet) came and he patted upon my shoulders and said: Go and call Mu&#8217;awiya. I returned and said: He is busy in taking food. He again asked me to go and call Mu&#8217;swiya to him. I went (and came back) and said that he was busy in taking food, whereupon he said: May Allah not fill his belly! Ibn Muthanna, said: I asked Umm Umayya what he meant by the word Hatani. He said: It means&#8221; he patted my shoulders&#8221;.<\/span><\/p>\n<p style=\"text-align: justify;\">The authors at Wilayat.net go on to suggest that Mu’awiyah is a kaffir by providing external evidences. However, before moving on, there is a need to examine if this narration within itself is sufficient to reach this conclusion.<\/p>\n<p style=\"text-align: justify;\"><strong>1- Does the Invocation upon Mu’awiyah make him a Disbeliever?<\/strong><\/p>\n<p style=\"text-align: justify;\">After scrutinizing the meaning of the Hadith and suggested interpretations by scholars, we failed to find evidences that this implies that Mu’awiyah was a kaffir. The narration simply states that the Prophet (salalahu alaihi wa salam) invoked Allah (subhanahu wa ta’ala) to cause Mu’awiyah’s belly to not be filled. It does not state that he invoked Allah (subhanahu wa ta’ala) to damn Mu’awiyah to the hellfire. Surely, the offense that Mu’awiyah committed is not worthy of eternal damnation. Our Prophet (saw) was very merciful and caring, he was like a father to us, a mercy for all mankind, and he wouldn’t just go about cursing people for the smallest of offenses and errors.<\/p>\n<p style=\"text-align: justify;\">Even if a Shi’ee were to argue that disobeying a direct order from the Prophet (salalahu alaihi wa salam) will always warrant eternal damnation in all cases, then one can simply argue that disobeying Allah (subhanahu wa ta’ala) is a greater crime. In other words, every sin warrants eternal damnation according to their explanation from missing prayer to gazing at women lustfully.<\/p>\n<p style=\"text-align: justify;\">More importantly, there is evidence that the Prophet’s (salalahu alaihi wa salam) invocations, even when coming to pass, is not conclusive evidence that a person is a kafir.<\/p>\n<p style=\"text-align: justify;\">We read in Sharh Saheeh Muslim 13\/192 that:<\/p>\n<p style=\"text-align: justify;\"><strong>A man ate in front of the Messenger (salalahu alaihi wa salam) with his left hand. He (the Prophet) said, “Eat with your right (hand),” He said, “I cannot,” He replied, “May you not! His arrogance prevented him (from obeying),” He said (the narrator), “He was not able to raise it to his mouth (ever again).”<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Nawawi comments:<\/p>\n<p style=\"text-align: justify;\"><strong>As for the opinion of Al-Qadhi Iyadh may Allah be pleased with him that the statement “his arrogance prevented him” is evidence that he was a hypocrite, is incorrect. Arrogance and going against an order does not necessitate hypocrisy, but it is a sin if he was required to obey. This Hadith is also evidence that one can invoke upon those that go against a religions ruling without an excuse.<\/strong><\/p>\n<p style=\"text-align: justify;\">In other words, the simple fact that the Prophet (salalahu alaihi wa salam) invoked Allah (subhanahu wa ta’ala) to prevent Mu’awiyah from being full does not mean that Mu’awiyah is a kafir, but rather, that he disobeyed an order.<\/p>\n<p style=\"text-align: justify;\"><strong>2- External Evidences that Mu’awiyyah was a Disbeliever <\/strong><\/p>\n<p style=\"text-align: justify;\">Wilayat.net quote the following narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Sahih Bukhari, Volume 7, Book 65, Number 308:<\/span><br \/>\n<span style=\"color: #800000;\">Narrated <a href=\"http:\/\/twelvershia.net\/2015\/01\/11\/abu-huraira\/\" rel=\"external nofollow\">Abu Huraira<\/a>: <\/span><br \/>\n<span style=\"color: #800000;\">Allah&#8217;s Apostle said, &#8220;A Muslim eats in one intestine (i.e. he is satisfied with a little food) while a Kafir (unbeliever) eats in seven intestines (eats much).&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">The authors of Wilayat.net quote this along with a statement by Ibn Katheer that Mu’awiyah used to eat seven times a day.<\/p>\n<p style=\"text-align: justify;\">Firstly, the statement by Ibn Katheer is free of any source and Sunnis do not accept 8th century reports about a first century individual.<\/p>\n<p style=\"text-align: justify;\">More importantly, it is ironic that Wilayat.net have chosen to become literalists in this specific occasion, when they are always accusing Sunnis of being shallow and literal. It is obvious that the narration is to be taken metaphorically and not literally, for there is no Muslim that is taken out of the fold of Islam for eating too much, nor has anyone seen as morbidly obese person being referred to as an apostate.<\/p>\n<p style=\"text-align: justify;\"><strong>3- Another Argument<\/strong><\/p>\n<p style=\"text-align: justify;\">They quote:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Due to this Curse of Prophet (saw), Muawiyyah became very fat and he used to fart in front of every one, every where. This cursed person even didn&#8217;t left the Minbar of Prophet (saw) and he farted there too in front of people who came there to pray.<\/span><\/p>\n<p style=\"text-align: justify;\">They then provided a quote by Al-Zamakhshari in which he mentions the above. The narration is disconnected since it is a testimony of a sixth century scholar and is therefore rejected.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to Wilayat.net’s article “Rasool Allah’s Curse upon Muawiyyah.” The article can be found here. The article opens with the following narration: Sahih Muslim, Book 032, Number 6298: Ibn Abbas reported: I was playing with children <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/12\/11\/response-to-rasool-allahs-curse-upon-muawiyyah\/\" title=\"Response to: Rasool Allah’s Curse upon Muawiyyah.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[20],"class_list":{"0":"post-1586","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-muawiyah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1586","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1586"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1586\/revisions"}],"predecessor-version":[{"id":2741,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1586\/revisions\/2741"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1586"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1586"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1586"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}