{"id":1594,"date":"2014-12-20T23:59:58","date_gmt":"2014-12-20T23:59:58","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1594"},"modified":"2018-10-30T14:51:06","modified_gmt":"2018-10-30T14:51:06","slug":"issues-of-ghaybah-part-11","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/12\/20\/issues-of-ghaybah-part-11\/","title":{"rendered":"Issues of Ghaybah [Part-11] -The infallible hands religious authority to the non-infallible"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1594\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and our Prophet,<\/p>\n<p style=\"text-align: justify;\">The Imami scholars in our days are known for their bigotry, they do not give any importance to their followers nor do they give them much respect. The scholars of Imamiyyah have established themselves as divine figures, they enjoy great privileges and grand titles.<\/p>\n<p style=\"text-align: justify;\">From the popular sayings among Shia laymen, is that the one who objects to the jurist is like he who objects to Allah. By spreading this saying among laypeople, they&#8217;ve managed to grant themselves a station of an infallible.<\/p>\n<p style=\"text-align: justify;\">The reader may wonder where they got this weird opinion from, as it seems that the regular scholars are now equal to the infallible leaders, with this saying there may not even be a need for an infallible because it appears as if the scholars are sufficient.<\/p>\n<p style=\"text-align: justify;\">The answer is, that this popular saying originated from a Hadith by the Shia Imam himself and is found in Usoul al-Kafi their main book. Since we learned this and we felt that this narration appears to not fit in with the theory of &#8220;The need of an infallible Imam&#8221;, we decided to investigate al-Kafi and find this Hadith.<\/p>\n<p style=\"text-align: justify;\">Source: Al-Kafi 1\/67 #10:<\/p>\n<p style=\"text-align: right;\">مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلَيْنِ مِنْ أَصْحَابِنَا بَيْنَهُمَا مُنَازَعَةٌ فِي دَيْنٍ أَوْ مِيرَاثٍ فَتَحَاكَمَا إِلَى السُّلْطَانِ وَ إِلَى الْقُضَاةِ أَ يَحِلُّ ذَلِكَ قَالَ مَنْ تَحَاكَمَ إِلَيْهِمْ فِي حَقٍّ أَوْ بَاطِلٍ فَإِنَّمَا تَحَاكَمَ إِلَى الطَّاغُوتِ وَ مَا يَحْكُمُ لَهُ فَإِنَّمَا يَأْخُذُ سُحْتاً وَ إِنْ كَانَ حَقّاً ثَابِتاً لِأَنَّهُ أَخَذَهُ بِحُكْمِ الطَّاغُوتِ وَ قَدْ أَمَرَ اللَّهُ أَنْ يُكْفَرَ بِهِ قَالَ اللَّهُ تَعَالَى يُرِيدُونَ أَنْ يَتَحاكَمُوا إِلَى الطَّاغُوتِ وَ قَدْ أُمِرُوا أَنْ يَكْفُرُوا بِهِ قُلْتُ فَكَيْفَ يَصْنَعَانِ قَالَ يَنْظُرَانِ إِلَى مَنْ كَانَ مِنْكُمْ مِمَّنْ قَدْ رَوَى حَدِيثَنَا وَ نَظَرَ فِي حَلَالِنَا وَ حَرَامِنَا وَ عَرَفَ أَحْكَامَنَا فَلْيَرْضَوْا بِهِ حَكَماً فَإِنِّي قَدْ جَعَلْتُهُ عَلَيْكُمْ حَاكِماً فَإِذَا حَكَمَ بِحُكْمِنَا فَلَمْ يَقْبَلْهُ مِنْهُ فَإِنَّمَا اسْتَخَفَّ بِحُكْمِ اللَّهِ وَ عَلَيْنَا رَدَّ وَ الرَّادُّ عَلَيْنَا الرَّادُّ عَلَى اللَّهِ وَ هُوَ عَلَى حَدِّ الشِّرْكِ بِاللَّهِ قُلْتُ فَإِنْ كَانَ كُلُّ رَجُلٍ اخْتَارَ رَجُلًا مِنْ أَصْحَابِنَا فَرَضِيَا أَنْ يَكُونَا النَّاظِرَيْنِ فِي حَقِّهِمَا وَ اخْتَلَفَا فِيمَا حَكَمَا وَ كِلَاهُمَا اخْتَلَفَا فِي حَدِيثِكُمْ قَالَ الْحُكْمُ مَا حَكَمَ بِهِ أَعْدَلُهُمَا وَ أَفْقَهُهُمَا وَ أَصْدَقُهُمَا فِي الْحَدِيثِ وَ أَوْرَعُهُمَا وَ لَا يَلْتَفِتْ إِلَى مَا يَحْكُمُ بِهِ الْآخَرُ قَالَ قُلْتُ فَإِنَّهُمَا عَدْلَانِ مَرْضِيَّانِ عِنْدَ أَصْحَابِنَا لَا يُفَضَّلُ وَاحِدٌ مِنْهُمَا عَلَى الْآخَرِ قَالَ فَقَالَ يُنْظَرُ إِلَى مَا كَانَ مِنْ رِوَايَتِهِمْ عَنَّا فِي ذَلِكَ الَّذِي حَكَمَا بِهِ الْمُجْمَعُ عَلَيْهِ مِنْ أَصْحَابِكَ فَيُؤْخَذُ بِهِ مِنْ حُكْمِنَا وَ يُتْرَكُ الشَّاذُّ الَّذِي لَيْسَ بِمَشْهُورٍ عِنْدَ أَصْحَابِكَ فَإِنَّ الْمُجْمَعَ عَلَيْهِ لَا رَيْبَ فِيهِ وَ إِنَّمَا الْأُمُورُ ثَلَاثَةٌ أَمْرٌ بَيِّنٌ رُشْدُهُ فَيُتَّبَعُ وَ أَمْرٌ بَيِّنٌ غَيُّهُ فَيُجْتَنَبُ وَ أَمْرٌ مُشْكِلٌ يُرَدُّ عِلْمُهُ إِلَى اللَّهِ وَ إِلَى رَسُولِهِ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَلَالٌ بَيِّنٌ وَ حَرَامٌ بَيِّنٌ وَ شُبُهَاتٌ بَيْنَ ذَلِكَ فَمَنْ تَرَكَ الشُّبُهَاتِ نَجَا مِنَ الْمُحَرَّمَاتِ وَ مَنْ أَخَذَ بِالشُّبُهَاتِ ارْتَكَبَ الْمُحَرَّمَاتِ وَ هَلَكَ مِنْ حَيْثُ لَا يَعْلَمُ قُلْتُ فَإِنْ كَانَ الْخَبَرَانِ عَنْكُمَا مَشْهُورَيْنِ قَدْ رَوَاهُمَا الثِّقَاتُ عَنْكُمْ قَالَ يُنْظَرُ فَمَا وَافَقَ حُكْمُهُ حُكْمَ الْكِتَابِ وَ السُّنَّةِ وَ خَالَفَ الْعَامَّةَ فَيُؤْخَذُ بِهِ وَ يُتْرَكُ مَا خَالَفَ حُكْمُهُ حُكْمَ الْكِتَابِ وَ السُّنَّةِ وَ وَافَقَ الْعَامَّةَ قُلْتُ جُعِلْتُ فِدَاكَ أَ رَأَيْتَ إِنْ كَانَ الْفَقِيهَانِ عَرَفَا حُكْمَهُ مِنَ الْكِتَابِ وَ السُّنَّةِ وَ وَجَدْنَا أَحَدَ الْخَبَرَيْنِ مُوَافِقاً لِلْعَامَّةِ وَ الْآخَرَ مُخَالِفاً لَهُمْ بِأَيِّ الْخَبَرَيْنِ يُؤْخَذُ قَالَ مَا خَالَفَ الْعَامَّةَ فَفِيهِ الرَّشَادُ فَقُلْتُ جُعِلْتُ فِدَاكَ فَإِنْ وَافَقَهُمَا الْخَبَرَانِ جَمِيعاً قَالَ يُنْظَرُ إِلَى مَا هُمْ إِلَيْهِ أَمْيَلُ حُكَّامُهُمْ وَ قُضَاتُهُمْ فَيُتْرَكُ وَ يُؤْخَذُ بِالْآخَرِ قُلْتُ فَإِنْ وَافَقَ حُكَّامُهُمُ الْخَبَرَيْنِ جَمِيعاً قَالَ إِذَا كَانَ ذَلِكَ فَأَرْجِهْ حَتَّى تَلْقَى إِمَامَكَ فَإِنَّ الْوُقُوفَ عِنْدَ الشُّبُهَاتِ خَيْرٌ مِنَ الِاقْتِحَامِ فِي الْهَلَكَاتِ<\/p>\n<p style=\"text-align: justify;\">Before we begin translation this Hadith section by section, we speak of its authenticity.<\/p>\n<p style=\"text-align: justify;\">Al-`Allamah al-Majlisi authenticates this narration in &#8220;Mir&#8217;aat-ul-`Uqoul&#8221; 1\/221, not only that but he tells us that it is a popular and widely accepted narration:<\/p>\n<p style=\"text-align: justify;\">تلقاه الأصحاب بالقبول<\/p>\n<p style=\"text-align: justify;\">&#8220;The companions have received it with acceptance.&#8221;<\/p>\n<p style=\"text-align: justify;\">And by companions, he means the Shia scholars in general not just in his own time, but even after him the Shia leader al-Khomayni himself accepts it in his book &#8220;al-Ijtihaad wal-Taqleed&#8221; pg26:<\/p>\n<p style=\"text-align: justify;\">مقبولة عمر بن حنظلة وهي لاشتهارها بين الأصحاب والتعويل عليها في مباحث القضاء<\/p>\n<p style=\"text-align: justify;\">&#8220;The accepted narration of `Umar bin Handhalah for its popularity between our companions and because they rely on it in judicial matters&#8221;<\/p>\n<p style=\"text-align: justify;\">As for its main narrator, `Umar bin Handhalah, the Imam himself praises his narrations in al-Kafi 3\/275:<\/p>\n<p style=\"text-align: justify;\">إِذاً لَا يَكْذِبُ عَلَيْنَا<\/p>\n<p style=\"text-align: justify;\">He says that `Umar bin Handhalah would never attribute lies to the Imams in his narrations.<\/p>\n<p style=\"text-align: justify;\">Now the translation accompanied by our commentary:<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;I asked aba `Abdillah (as), if two people from our companions had a dispute over an issue of debts or inheritance and they go to the Sultan or the judges to settle their dispute through his or their decision. I said, ‘Is it permissible to seek such a judgment?’ The Imam replied, ‘Going to them for a judgment in a right or wrongful matter is like seeking the judgment of the devil. Any benefit received through such judgment is like consuming filth even if it is one’s firmly established right. It is like filth because it is a benefit received through the judgment of the devil and Allah has commanded to reject the devil, ‘ . . . yet they choose to take their affairs to Satan for judgment even though they are commanded to reject him (the devil). Satan wants to lead them far away from the right path.’ (4:60)&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">Here we find that a companion of the infallible asked him about a certain scenario, that if two Shia had a matter they were disputing whether a matter of dept or inheritance or any matter of Fiqh, should they consult the governor or the judge in their land to settle the matter? The Imam said they should not, as we all know the governors and judges back in the time of al-Sadiq were all scholars of Ahlul-Sunnah, so he described their judgement as &#8220;Going to the devil&#8221;.<\/p>\n<p style=\"text-align: justify;\">He goes further to say that even if the Sunni scholar judges correctly, yet one is sinful and will be punished simply for seeking his ruling on the matter. We do not know why the Shia Imam here isn&#8217;t talking about &#8220;Muslim Unity&#8221; and all of that other nonsense modern day Shia speak of?<\/p>\n<p style=\"text-align: justify;\">The Hadith continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;I said, ‘What should they do then?’ The Imam replied, ‘They must look for one among you who has narrated our Hadith and has studied what is lawful and unlawful according to our teachings and has learned our laws. They must agree to settle their dispute by his judgment; I have given him authority to settle your disputes&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">This here is the biggest issue with this Hadith, The infallible is basically saying that a man who is well learned in Hadith is sufficient to judge between people and settle disputes, and that Allah is pleased with this man&#8217;s judgement.<\/p>\n<p style=\"text-align: justify;\">The above directly contradicts the Shia theory of Imamah, as the Shia said that the Prophet (saw) could not have left the matter to his knowledgeable companions, they said this would be irresponsible, they say that even if these companions were scholars yet none of them had sufficient knowledge nor did they encompass everything, they should not be in charge of religious matters as they can commit mistakes in judgement, they may not know the abrogated from the established, they may not know the general from the specific. Therefore, it would be a mistake and an injustice on the part of the Prophet (saw) if he allowed them to handle these matters of religious rulings and the task of propagating the religion. Rather, this mission is only given to an infallible who encompasses all knowledge, only what he says is to be taken, as for everyone else&#8217;s words, such as Hudhayfah (ra) or `Umar (ra) or abu Hurayrah (ra), it is all rejected no matter how much knowledge they have because they are not infallible, they are not protected from forgetfulness and errors, and they risk misguiding the believers with whatever they report and whatever verdicts they issue.<br \/>\nIt continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;If he issues a judgment according to our commands but then it is not accepted, the dissenting party has ignored the commands of Allah and it is a rejection of us. Rejecting us is rejecting Allah and that is up to the level of paganism and considering things equal to Allah.’&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">The Imam is saying that if a Shia layperson disagrees or rejects a verdict by one who was knowledgeable and well versed in the Hadith of the Imams, then he is equal to a pagan.<\/p>\n<p style=\"text-align: justify;\">We ask, how come the Shia find it very easy to disagree and reject the narrations and verdicts of the biggest scholars among the companions of Rasul-Allah (saw)? Why wouldn&#8217;t this be equal to paganism? Or are the companions of the Imams given more value over those of Rasul-Allah (saw)?<\/p>\n<p style=\"text-align: justify;\">It continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;“I said, ‘What if each one of such disputing parties chooses a man from among our people and agrees to accept their judgment but these two men come up with different judgments and they have differences in your Hadith?’ “The Imam replied, ‘The judgment will be the judgment of the one who is more just, has better understanding of the law (Fiqh), who is more truthful in Hadith and is more pious of the two. The judgment of the other one will be disregarded.’&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">Notice the big calamities, the Imam is allowing people to differ in verdicts and judgement as long as they are sincere. The Imam does not tell them to refer the matter back to an infallible even if they should happen to narrate opposing narrations from the same Imam, he says that Allah will be pleased with you as long as you select the opinion of &#8220;the most knowledgeable&#8221;, yet how can we expect a simple layperson to know which of the two scholars is more knowledgeable?<\/p>\n<p style=\"text-align: justify;\">We see in this narration so far, that an infallible is not necessary nor required, rather what is required are knowledgeable trustworthy scholars who understand the general matters of Fiqh and judge based on their knowledge.<br \/>\nIt continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;“I said, ‘What if both (judges) are just and accepted among our people and none of them have been given any preference over the other?’ “The Imam replied, ‘One must consider and study the Hadith that each one of them narrate from us to see which one has received the acceptance of all of your people. Such Hadith must be followed and the one, which is rarely accepted and is not popular in your people, must be disregarded; the one popularly accepted (by consensus) is free of doubts&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">In this case both men are equal in knowledge and both are trusted and narrate authentic Hadiths, so the Imam says to take the most popular narration and that what the majority agree on is free of doubt.<\/p>\n<p style=\"text-align: justify;\">It is as if the Imam is putting forward what resembles the methodology of the rest of the Muslim nation. He says that the majority opinion or the consensus (Ijma`) is binding religiously and is divine proof for religious matters, we wonder if it includes the consensus between the companions of Rasul-Allah (saw) to elect their own leaders and that no one claimed that a man was divinely appointed!<br \/>\nIt continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;The nature of cases is of three kinds: (a) a case that is well-known and true that must be followed; (b) a case that is well-known as false that must be avoided, (c) and a confusing case the knowledge of which must be left to Allah and His messenger for an answer. The messenger of Allah has said, “There are the clearly lawful and the clearly unlawful and the confusing cases. One who stays away from the confusing ones has protected himself against the unlawful ones. Those who follow the confusing matters indulging in unlawful matters will be destroyed unexpectedly.”&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">This is exactly the way of Ahlul-Sunnah, no need for an infallible, all matters are divided into the above cases and what we disagree on is returned to Allah&#8217;s book and the Prophet&#8217;s (saw) Sunnah, not some infallible leader that nobody has heard of.<\/p>\n<p style=\"text-align: justify;\">The Imam also confirms that not all matters must be known by everybody, rather certain verses and traditions will remain vague and unclear and Allah has ordered us to believe in them as they are. Whereas those who have a sickness in their hearts, such as the Batiniyyah and the deviant sects, they will find these vague and unclear statements and use them as proofs for their religion.<\/p>\n<p style=\"text-align: justify;\">It continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;“I said, ‘What if both Hadith from you would be popular and narrated by the trustworthy people from you?’ “The Imam replied, ‘One must study to find out which one agrees with the laws of the Quran and the Sunnah and does not agree with the laws of those who oppose us. Such Hadith must be accepted and the one that disagrees with the laws of the Quran and the Sunnah and coincides with the masses must be disregarded&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">Obviously, the Imam here makes no sense, as he tells people to refer back to the Sunnah of Rasul-Allah (saw) yet at the same time he tells people to avoid the rulings of the people of Sunnah (Ahlul-Sunnah)!<\/p>\n<p style=\"text-align: justify;\">This is the mentality of a cult, a deviant movement that wishes to separate itself from the rest of the Muslims, a cancerous entity aiming to sow discord and cause division.<\/p>\n<p style=\"text-align: justify;\">If authentic Shia narrations concerning a matter conflict with one another (And this is common), then how can they refer to the Sunnah of Rasul-Allah (saw) while being ordered to take what opposes it? Unless what is meant by referring to it is opposing it.<\/p>\n<p style=\"text-align: justify;\">It continues&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;“I said, ‘May Allah keep my soul in service for your cause, what if both Faqih, scholars of the law, would have deduced and learned their judgment from the book and the Sunnah and found that one of the Hadith agrees with the masses, and the other disagrees with the masses, which one must be followed?’ “The Imam replied, ‘The one which disagrees with the masses must be followed due to its containing guidance.’ “I said, ‘May Allah keep my soul in the service of your cause, what if both Hadith agree with the masses?’ “The Imam replied, ‘One must study to find out which of the two, being more agreeable to their rulers and judges so it must be disregarded and the other must be followed.’ “I said, ‘What if both Hadith are agreeable to their rulers?’ “The Imam replied, ‘If such is the case it must be suspended until you meet your Imam. Restraint in confusing cases is better than indulging in destruction.’&#8230;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Comment:<\/p>\n<p style=\"text-align: justify;\">Finally, after reaching an impossible case such as you read above, we now reach the role of the great Imam. What is ironic, is that even if the Shia were to encounter such a rare scenario the narrator should have still asked the Imam an additional question: &#8220;What if what you say happens yet we can&#8217;t meet the Imam because he is in hiding?&#8221;<\/p>\n<p style=\"text-align: justify;\">Then the Imam would have given him the only answer left: &#8220;O my follower, then and only then will an unintelligent person like you realize how useless we really are!&#8221;<\/p>\n<p style=\"text-align: justify;\">This dear reader is the bitter truth and the reality of the hidden Imam who has two hundred million followers that control several governments yet is still scared to come out.<\/p>\n<p style=\"text-align: justify;\">And peace be upon our Prophet Muhammad (saw) and his family and companions and all those who followed his guidance without succumbing to their desires and straying from the path of righteousness.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon our nation and our Prophet, The Imami scholars in our days are known for their bigotry, they do not give any importance to their followers <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/12\/20\/issues-of-ghaybah-part-11\/\" title=\"Issues of Ghaybah [Part-11] -The infallible hands religious authority to the non-infallible\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-1594","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1594","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1594"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1594\/revisions"}],"predecessor-version":[{"id":4434,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1594\/revisions\/4434"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1594"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1594"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1594"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}