{"id":1606,"date":"2014-12-26T13:42:16","date_gmt":"2014-12-26T13:42:16","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1606"},"modified":"2015-11-21T18:05:20","modified_gmt":"2015-11-21T18:05:20","slug":"comments-on-toyibs-revised-edition-of-his-ibn-saba-book","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/12\/26\/comments-on-toyibs-revised-edition-of-his-ibn-saba-book\/","title":{"rendered":"Comments on Toyib’s Revised Edition of his Ibn Saba’ Book"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1606\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following are comments on Toyib Olawuyi’s revised edition of his Ibn Saba’ book. His book is available to be downloaded <a href=\"https:\/\/archive.org\/details\/IbnSabaUpdated\" rel=\"external nofollow\">here<\/a>. The revised content is more or less entirely based upon our own original work on Ibn Saba’, which can be found <a href=\"http:\/\/twelvershia.net\/2014\/09\/18\/abdullah-ibn-saba-the-book\/\" rel=\"external nofollow\">here<\/a>, in other words Toyib wished to correct big mistakes which we exposed in his original work and he also attempted to refute some of the solid arguments we put forth but to not avail as you shall see.<\/p>\n<p style=\"text-align: justify;\">It is highly recommended that readers who are not familiar with our previous book to first refer to that for the sake of clarity in regards to the upcoming comments and refutations. It is also recommended for those that have read Olawuyi’s revised edition to also refer to our original refutation since some of his new responses are so terribly weak that they do not warrant a reply in the first place.<\/p>\n<p style=\"text-align: justify;\">Thus we shall address only what is worth addressing and in the name of Allah we begin,<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; Olawuyi Takes Back Two Critical Accusations:<\/strong><\/p>\n<p style=\"text-align: justify;\">Upon reading our refutation, Olawuyi indirectly conceded two points:<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Point -1:<\/span> He took back his accusation against Ibn Katheer on p. 31-32 of his original book in which he accused Ibn Katheer of “manipulating” a report. He went on to say in his original work:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“Our Sunni brother will never be able to trace what Ibn Kathir has attributed to Abu Ya’la in any of the latter’s works or reports!”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Then after reading our response, he wrote in the footnotes on p. 22-23 of his revised version that:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“…upon further researches, we accept the possibility that he had only used a now extinct version of the book of Abu Ya’la. He has been corroborated by al-Hafiz.”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Olawuyi is sadly too proud to admit that these “further researches” were a consequence of the refutation by twelvershia.net.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Point -2:<\/span> His accusation against Al-Barqani of attempting to authenticate a narration mentioning Ibn Saba’. Refer to p. 17-18 of his original book in which he accuses Al-Barqani of being “<span style=\"color: #800000;\">fallacious<\/span>” and attempting to play a “<span style=\"color: #800000;\">fast one<\/span>”. These accusations were omitted in his revised edition due to our response to his accusation (Refer to p.22-23 in our book).<\/p>\n<p style=\"text-align: justify;\">Olawuyi on p. 21 of his book also took back a new Hadith sciences rule that his own <em>Ijtihad<\/em> led him to invent. This no longer exists in his revised edition! To understand what caused him to omit this point, refer to our refutation on p. 24-25 in our book.<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; Olawuyi’s personal stance towards Ibn Saba’:<\/strong><\/p>\n<p style=\"text-align: justify;\">Olawuyi (p. iv) emphasizes that:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“… at this point that we, the Shī’ah Imāmīyyah, do NOT deny the existence of ‘Abd Allāh b. Sabā. Those of us who do that are in error, and their opinion does not bind our madhhab. It is only the Qur’ān and our authentic aḥādīth that do that. There indeed was once a man with that name, as our ṣaḥīḥ reports establish. However, the only statement that is true about him – from all that the Ahl al-Sunnah claim – is that he considered Amīr al-Mūminīn to be a god. Everything else is false, as nothing else is established in any reliable Sunnī or Shī’ī riwāyah.”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Even though Olawuyi is correct in asserting that the narrations about Ibn Saba’ are mostly weak, it is problematic for him to act as if his views represent the Shi’ee school. His personal view that Ibn Saba’ was nothing more than a person that claimed godhood for Ali, contradicts the views that we have shared in our refutation.<\/p>\n<p style=\"text-align: justify;\">Refer to p. 32 of Firaq Al-Shia by the top Shia classical historians Sa’ad Al-Ash’ari and Al-Nawbakhti. They have stated clearly that there is a sect called the Saba’ee sect and that they are the followers of Ibn Saba’. They also include that they are the first exaggerators, and that Ibn Saba’ used to curse Abu Bakr and `Umar, believe in Raja’ah, believed in Imamah, and was originally a Jew.<\/p>\n<p style=\"text-align: justify;\">Even though Olawuyi can claim that these opinions hold no weight without a chain of narrations, we can safely say that the opinions of these experts have more weight than the opinion of a contemporary author. Refer to Fihrist Al-Najashi p. 63 and p. 177 for his major praise of these two scholars. Al-Najashi refers to Al-Asha’ri as the Shaikh of the Ta’ifah (the group), which is a title that Shias today reserve for Al-Tusi, one of the most reputable and high stationed scholars in Shia history.<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; The Existence of the Saba’ee Sect and their Beliefs:<\/strong><\/p>\n<p style=\"text-align: justify;\">Olawuyi (p. iv) carries on:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“We have seen efforts by some Sunnī brothers to prove all the Sunnī claims about ‘Abd Allāh b. Sabā by mentioning the existence and doctrines of a group called al-Sabāiyyah. In their opinion, if they can prove that a sect which attributed itself to Ibn Sabā existed, then they have already proved the existence of the man himself. Moreover, if they are able to establish the doctrines of this sect, then they have established the original doctrines of the man. This is however a very poor methodology, which is based upon clear logical fallacies. The fact that a group of people attribute themselves to an individual or an entity does NOT necessarily prove that he\/she\/it existed. Qur’ān 7:71 and 53:19-23 give vivid examples. AlLāt, al-‘Uzzā and Manāt were three Arab idols which existed only in “names”. They had no real existence. A lot of the other idols are like that. However, it is possible to find people who attribute themselves to such imaginary idols, and who even spread weird legends about the idols’ “achievements” and “teachings”! Besides that, it is quite possible to find people who have attributed themselves to a real being, but who do NOT truly or accurately represent him at all. Examples of these kinds of adherents abound in our midst. For instance, there are Christians who attribute themselves to the Christ, Prophet ‘Īsā b. Maryam, ‘alaihimā al-salām. Would it be accurate to determine the existence and true doctrines of the Christ through the existence and doctrines of Christians? On a more specific note, is it correct to claim that the Christ believed in his own divinity, or that he was the Son of God, simply because Christians make these claims? Of course, that would be very wrong!<\/span><br \/>\n<span style=\"color: #800000;\">In the same manner, it is wrong to try to prove the existence and doctrines of ‘Abd Allāh b. Sabā through the claims and doctrines of al-Sabāīyyah, who attributed themselves to him. Rather, separate authentic reports must be provided to independently and directly establish the existence of the man himself and his personal doctrines, beliefs and teachings.“<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">By the grace of Allah, the above comments provided by Olawuyi do not cause a dent on the evidences brought forth in our previous book. Please refer to (p. 12-19) for more on the existence of the Saba’ee sect and their beliefs. In fact, what he wrote above makes no sense as the man did exist according to reliable Sunni and Shia reports, so the example of the non-existent “al-Laat and al-`Uzza” is not accurate, also his example of `Isa (as) also isn’t accurate since `Isa (as) was a pious prophet as is established and his followers attributed falsehood to him, Ibn Saba’ on the other hand is not only proven to exist but also it is established that he was an early deviant, exaggerator and liar.<\/p>\n<p style=\"text-align: justify;\">We add to the above that the existence of the Saba&#8217;ee sect is accepted by late Shia scholars like Mohammad Zaid Al-Deen Al-Amili in his book Al-Shia fil Tareekh. See pages 38-39 (second edition).<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; Was Hujayyah Al-Kindi referred to as Abu Al-Za’araa’?<\/strong><\/p>\n<p style=\"text-align: justify;\">In order to weaken an authentic narration about Ibn Saba’, Olawuyi attempted to cause readers to believe that Abu Al-Za’araa’ is a weak narrator named Abdullah bin Hani’, instead of the reliable Hujayyah Al-Kindi. He (p. 18) then pointed readers to the following sources: Tabaqat Ibn Sa’ad, Thiqat Al-Ijli, Al-Jarh wal Ta’deel by Ibn Abi Hatim, Thiqaat Ibn Hibban, Tahtheeb Al-Kamal by Al-Mizzi, and Mizan Al-I’itidal by Al-Thahabi, and Taqreeb Al-Tahtheeb by Ibn Hajar.<\/p>\n<p style=\"text-align: justify;\">Olawuyi (p.20) then claimed that:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“…many top Sunni rijal scholars contradicted the suggestion that Hujayyah had the nickname “Abu Al-Za’ra’.”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">This is false. None of the scholars above “contradict” this suggestion. A contradiction would be a direct dismissal of this nickname, or the affirmation of another nickname.<\/p>\n<p style=\"text-align: justify;\">For example, a scholar would say, “Hujayyah is not Abu Al-Za’araa’,” or “Hujayyah is Abu Ahmad.” These could be considered contradictions. However, the sources that Olawuyi provides do not include a nickname for Hujayyah. They simply do not mention anything about his nickname. How can this be considered a contradiction?!<\/p>\n<p style=\"text-align: justify;\">Would referring to Mohammad bin Isma’eel Al-Bukhari instead of Abu Abdullah Mohammad bin Isma’eel Al-Bukhari be also considered a contradiction?! Perhaps Olawuyi will soon argue that Sunni scholars do not know Al-Bukhari’s name since they are contradicting each other.<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; Incompetence or Deceptiveness of Olawuyi in Quoting Narrations:<\/strong><\/p>\n<p style=\"text-align: justify;\">Furthermore, in order for Olawuyi to strengthen his case that Hujayyah is not Abu Al-Za’araa’, he quotes the narrations by these “two men” (who we maintain is one and the same person), then bolds and capitalizes the main differences in order to show that the narrations are different.<\/p>\n<p style=\"text-align: justify;\">He quotes Ali via Hujayyah (p. 19) as saying: الحميت الأسود<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“Who will excuse me of this<strong> evil black CONTAINER<\/strong>, who tells lies upon Allah?”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Then quotes Ali via Abu Al-Za’ara’a as saying: الخبيث الأسود<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“What does this <strong>evil black MAN<\/strong> want from me?”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Aside from the fact that his translation is incorrect, Olawuyi argues that the narrations are different and that they have nothing in common and no similarities. He says: <span style=\"color: #800000;\">&#8220;Where is the similarity? Do they even resemble in any way or by any means?&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">However, we maintain that Olawuyi was deceptive in his argumentation since he knows that the word <strong>حميت<\/strong> (container) is similar in writing to (evil) <strong>خبيث<\/strong>, which is why Olawuyi had to resort to quoting two different sources in order to make these narrations appear as different. The first source he quotes is from Tareekh Ibn Abi Khaythama, while the second source is Lisan Al-Mizan. Once this is understood, one can easily come to the conclusion that these are mistakes by editors, which Olawuyi either purposefully used to his advantage, or simply was careless as we have known him to be.<\/p>\n<p style=\"text-align: justify;\">In Lisan Al-Mizan, we find that both the narration of Zaid bin Wahb and the narration of Abi Al-Za’araa’ and Zaid bin Wahb both include the term “evil black man.”<\/p>\n<p style=\"text-align: justify;\">However, in Tareekh Ibn Abi Khaythama, both Zaid bin Wahb and the separate narration from Hujayyah refer to him as “black container”.<\/p>\n<p style=\"text-align: justify;\">Moreover, in Tareekh Dimashq 16\/309, we have four narrations, two from Zaid, one from Abu Al-Za’araa’, and another from Hujayyah (who is Abu Al-Za’araa’), and all four refer to Ibn Saba’ as “black container”.<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; `Umar and Raja’ah:<\/strong><\/p>\n<p style=\"text-align: justify;\">In regards to a narration in which `Umar says that the Prophet (salalahu alaihi wa salam) will be sent to cut off the hands and legs of those that claimed he was dead, Olawuyi (p. 59) argues:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“The alternative translation – “send” – which is offered by our Sunnī brother makes no sense. For instance, ‘Umar’s words would look like this: “Verily! Allāh will SEND him and he will cut the hands and legs of some men.” But, Allāh has already sent His Prophet decades before that period!”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The translation of the word Ba’atha is “to send” in all cases. Depending on the context one can derive what is meant. Allah (subhanahu wa ta’ala) “sends” people from their graves. He “sends” prophets to the people. He “sends” people to battle. Allah (subhanahu wa ta’ala) says in Surat Al-Isra’a, verse 5:<\/p>\n<p style=\"text-align: justify;\">{We SENT those against you servants of Ours – those of great military might…}<\/p>\n<p style=\"text-align: justify;\">In other words, being sent by Allah (subhanahu wa ta’ala) on multiple occasions is not linguistically inaccurate, for the Prophet (salalahu alaihi wa salam) was first sent as a prophet, then he was sent to many tribes on different occasions, and will finally be sent from his grave on the day of judgment.<\/p>\n<p style=\"text-align: justify;\"><strong>&#8211; Additional early quotes about Ibn Saba&#8217; and his sect:<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">Al-Ma`rifah wal-Tareekh by Ya`qoub bin Sufiyan:<br \/>\nحَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ، ثنا مُحَمَّدُ بْنُ سَابِقٍ أَبُو جَعْفَرٍ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنْ أَبِي الْوَلِيدِ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ: سَأَلَنِي: &#8221; مِمَّنْ أَنْتَ &#8220;؟ قَالَ:، فَقُلْتُ: مِنْ أَهْلِ الْكُوفَةِ، فَقَالَ: &#8221; بِئْسَ الْقَوْمُ بَيْنَ سِبَائِي وَحَرُورِي<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">[Salim bin `Abdullah bin `Umar (d.106 AH) asked: &#8220;From where do you come?&#8221; I said: &#8220;From the people of Koufah.&#8221; He said: &#8220;Terrible folks they are, either a Sabaa&#8217;i or a Harouri!&#8221;]<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\"><br \/>\nComment: abu al-Waleed is al-Waleed bin abi al-Waleed the servant of ibn `Umar. Muhammad bin Sabiq is Saduq. Al-Fadl bin Sahl is abu al-`Abbas Thiqah. Malik and Salim (d.106 AH) are Thiqaat.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\"><br \/>\nMusannaf ibn abi Shaybah:<br \/>\nحَدَّثَنَا ابْنُ عُلَيَّةَ ، عَنْ خَالِدٍ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، قَالَ : أَرَادَ عُبَيْدُ اللهِ بْنُ زِيَادٍ أَنْ يُوَرِّثَ الأُخْتَ مِنَ الأُمِّ مَعَ الْجَدِّ ، وَقَالَ : إنَّ عُمَرَ قَدْ وَرَّثَ الأُخْتَ مَعَهُ ، فَقَالَ عَبْدُ اللهِ بْنُ عُتْبَةَ : إنِّي لَسْتُ بِسَبَئِيٍّ وَلاَ حَرُورِي ، فَاقْتَفِرِ الأَثَرَ ، فَإِنَّك لَنْ تُخْطِئَ فِي الطَّرِيقِ مَا دُمْت عَلَى الأَثَرِ<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">[Ibn Sireen said: `Ubaydullah bin Ziyad wished to offer inheritance to the sister from the mother alongside the grandfather. He also said: &#8220;`Umar had done so.&#8221; `Abdullah bin `Utbah (d.74 AH) said: &#8220;I am neither a Sabaa&#8217;i nor am I a Harouri, follow the (correct) path for you shall never go astray while on that path.&#8221;]<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\"><br \/>\nComment: Ibn Sireen is Thiqah, Khalid is al-Hadhdha’ Thiqah, Ibn `Ulayyah is Isma`eel abu Bishr. `Abdullah bin `Utbah bin Mas`oud al-Koufi (d.74 AH) has seen the Prophet (saw).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\"><br \/>\n…and praise be to Allah the most Gracious and most Merciful.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following are comments on Toyib Olawuyi’s revised edition of his Ibn Saba’ book. His book is available to be downloaded here. The revised content is more or less entirely based upon our own original work on Ibn Saba’, which <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/12\/26\/comments-on-toyibs-revised-edition-of-his-ibn-saba-book\/\" title=\"Comments on Toyib’s Revised Edition of his Ibn Saba’ Book\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,10],"tags":[],"class_list":{"0":"post-1606","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-books"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1606","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1606"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1606\/revisions"}],"predecessor-version":[{"id":2800,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1606\/revisions\/2800"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1606"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1606"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1606"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}