{"id":1626,"date":"2015-01-11T08:51:33","date_gmt":"2015-01-11T08:51:33","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1626"},"modified":"2019-03-27T15:25:24","modified_gmt":"2019-03-27T15:25:24","slug":"abu-huraira","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/01\/11\/abu-huraira\/","title":{"rendered":"Abu Hurayrah &#8211; The Great Hadith Narrator"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1626\" alt=\"\" \/><img loading=\"lazy\" decoding=\"async\" class=\" aligncenter\" src=\"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/2\/27\/Basmala.svg\/608px-Basmala.svg.png\" alt=\"abu huraira\" width=\"608\" height=\"122\" \/><\/p>\n<p style=\"text-align: right;\">(refer to the bottom of the article for refutations to various article about Abu Huraira)<\/p>\n<h1 style=\"text-align: justify;\">A Brief Biography of Abu Huraira<\/h1>\n<p style=\"text-align: justify;\">Abu Hurayrah accepted Islam during the year of Khaibar. He then established and maintained a close relationship with the Prophet peace be upon him. He accompanied him wherever he went, seeking knowledge from him. Abu Hurayrah was one of the most retainful companions of Prophetic traditions.<\/p>\n<p style=\"text-align: justify;\">The Prophet, himself, attested to Abu Hurayrah&#8217;s care and passion for the acquirement of knowledge and Prophetic traditions. Abu Hurairah is authentically reported to have said:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“Oh Messenger of Allah, I have heard many hadiths from you, and I fear that I may forget them. &#8220;<\/p>\n<p style=\"text-align: justify;\">The Prophet peace be upon him said: “Spread your cloak [before me.”<\/p>\n<p style=\"text-align: justify;\">[Abu Hurayrah said:] So I did. He then placed his hands inside it, and he then told me: &#8220;Embrace it.&#8221; So I did. Since then, I have not forgotten a single hadith.&#8221; [Bukhari &amp; Muslim]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Al-Bukhari said: &#8220;More than eight hundred men from the companions and <em>tabi&#8217;in<\/em> narrated from him. Among the companions who narrated from him were: Ibn Abbas, Ibn &#8216;Umar, Jabir b. Abdullah, Anas b. Malik, and Wathilah b. al-Aska’. He became the governor of Bahrain during the reign of ‘Umar. He eventually settled in Medinah, and that is where he died.<\/p>\n<p style=\"text-align: justify;\">Khalifa b. Khayyat said: &#8220;Abu Hurayrah died in 57 AH.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Haytham b.  ‘Adi said: &#8220;He died in 58 AH.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Wāqidi said: &#8220;He died in 59 AH and he was 78 years old.&#8221;<\/p>\n<p style=\"text-align: justify;\">Ibn Numayr said the same.<\/p>\n<p>Others said: he died in al-‘Aqiq.<\/p>\n<p style=\"text-align: justify;\">His burial prayer (<em>janazah<\/em>) was led by ‘Utbah b. Abi-Sufyan who was the governor of Medinah during the discharge of Marwān b. al-Ḥakam.<\/p>\n<h1 style=\"text-align: justify;\">The Status of Abu Huraira<\/h1>\n<p style=\"text-align: justify;\">In this brief section, we shall list some of the praise Abu Hurayrah has received from his contemporaries in order to dispel any doubts regarding his character. We have primarily relied upon authentic reprots, and we will point out any weakness or defects in them (if there are any.)<\/p>\n<h3 style=\"text-align: justify;\"><strong>General Merits:<\/strong><\/h3>\n<p style=\"text-align: justify;\">Al-Bukhari said that Abu Hurayrah had 800 students from the <em>Sahabah<\/em> and <em>Tabi&#8217;in<\/em> who transmitted from him hadith. This alone is a major merit since the companions of the Prophet would not allow such an individual to prolifically disseminate Prophetic traditions if he was not suitable for such an important role. That number is a solid indicator that the man was evidently trustworthy in the eyes of the <em>Sahabah<\/em> and <em>Tabi&#8217;in<\/em>.<\/p>\n<p style=\"text-align: justify;\">Al-Hakim in Al-Mustadrak 6\/2224 listed twenty eight companions of the Prophet – peace be upon him – who transmitted hadiths from Abu Hurayrah as evidence of his reliability.<\/p>\n<p style=\"text-align: justify;\">Abu Hurayrah was also a jurist who people used to consult for religious rulings , which is why Ibn Sa’ad mentioned him in his chapter as one of the fourteen companions who used to issue religious verdicts after the the Prophet – peace be upon him – (Al-Tabaqat Al-Kubra 2\/312).<\/p>\n<h3 style=\"text-align: justify;\"><strong>Specific Praise from the Sahabah:<\/strong><\/h3>\n<p style=\"text-align: justify;\">Ibn Umar said: &#8220;Umar is better than me and Abu Hurayrah is better than me.&#8221; (Musanaf Abdulrazaq #8342.)<\/p>\n<p style=\"text-align: justify;\">He also said: O’ Abu Hurayrah, from amongst us, you used to attach yourself to the Messenger of Allah – peace be upon him – the most, and you were the best retainer of his hadith. (Al-Tirmidhi #3771)<\/p>\n<p style=\"text-align: justify;\">Talha said: There is no doubt that he (Abu Hurayrah) heard from the Messenger – peace be upon him – what we did not hear, and he was a guest of the Messenger – peace be upon him – for he was poor. His hand was with the hand of the Messenger – peace be upon him – . (Al-Tirmidhi #3772. There is some weakness because Ibn Ishaaq may have not heard it from Mohammad bin Ibrahim Al-Taymi.)<\/p>\n<p style=\"text-align: justify;\">Zaid bin Thabit narrated that the Prophet – peace be upon him – affirmed a supplication by Abu Hurayrah in which he asks for knowledge that cannot be forgotten. (Tareekh Dimashq: Abu Huraira #187.)<\/p>\n<p style=\"text-align: justify;\">Abu Ayoob said: I prefer to narrate from Abu Hurayrah [as an intermediary] than directly from the Prophet – peace be upon him.  (He meant that he trusts Abu Hurayrah more than he trusts himself when it comes to the transmission of prophetic traditions<\/p>\n<p style=\"text-align: justify;\">(Al-Mustadrak #6175. There is some anonymity with Ibrahim bin Bistam, but this narration has been narrated in Tareekh Dimashq through many alternative chains. See Tareekh Dimashq: Abu Huraira #260-263.)<\/p>\n<p style=\"text-align: justify;\">Abdullah b. &#8216;Abbas narrated the story of how `Ali was sent behind Abu Bakr to announce the verses of Surat-Bara’ah, since the Prophet – peace be upon him – said that only a man from his relatives may do so. So he reported that when Ali’s throat became soar from announcing it, he would let Abu Hurayrah take his place and announce it to the people. (Al-Sunan al-Kubra, Bayhaqi 9\/222.)<\/p>\n<h3 style=\"text-align: justify;\"><strong>Specific praise from Tabi’in:<\/strong><\/h3>\n<p style=\"text-align: justify;\">Abu Salih: &#8220;Abu Huraira was one of the best companions at memorizing the hadiths of the Messenger – peace be upon him.&#8221; (Mustadrak Al-Hakim #6161.)<\/p>\n<p style=\"text-align: justify;\">Mohammad b. Iyas b. Al-Bukayr used to seek fatwas from Abu Hurayrah . (Muwatta Malik #1037.)<\/p>\n<p style=\"text-align: justify;\">Abu Hazim boasted that he took knowledge from Abu Hurayrah for five years. (Al-Ma’rifa wal Tareekh 2\/65).<\/p>\n<p style=\"text-align: justify;\">Abu Uthman Al-Nahdi said: &#8220;Abu Hurayrah, his wife, and his servant, used to have three shifts for each period of the night (for <em>qiyam<\/em> prayers).&#8221; (Al-Tabaqat Al-Kubra 5\/248.)<\/p>\n<p style=\"text-align: justify;\">Tawus: &#8220;Abu Hurayrah did not let his daughter wear gold because he feared for her the heat of the hellfire. (Al-Tabaqaat Al-Kubra 5\/245).<\/p>\n<p style=\"text-align: justify;\">Maymun b. Mihran got into an argument with a sheikh who boasted about having heard hadiths from Abu Hurayra, implying that he himself is knowledgeable. Maymun argued that not everyone who sat with Abu Hurayrah had his heart with him at the time. In other words, according to Maymoon, only those that attentively listened to Abu Hurayrah would become people of knowledge. (Al-Tabaqat Al-Kabeer 2\/326).<\/p>\n<p style=\"text-align: justify;\">This small list of merits we mentioned here is sufficient Insha-Allah to show the high status Abu Hurayrah possessed in early Islamic society where he was revered for his knowledge and piety.<\/p>\n<h2 style=\"text-align: justify;\"><a href=\"http:\/\/en.wikipedia.org\/wiki\/Abu_Hurairah\" rel=\"external nofollow\">Abu Huraira<\/a>: the Yemeni, the Dawsi (from the tribe of Daws), the companion, the jurist, and the ascetic.<\/h2>\n<p style=\"text-align: justify;\">Abu Huraira&#8217;s name will be often tied to one of the above adjectives, but what rings most commonly in the ear of the student of knowledge is the adjective: Hadithist, or hadith narrator.<\/p>\n<p style=\"text-align: justify;\">Even though Abu Hurayrahconverted to Islam at a late stage, around four years before the Prophet&#8217;s &#8211; peace be upon him &#8211; death, Abu Huraira was able to narrate the largest amount of narrations out of all the companions.<\/p>\n<p style=\"text-align: justify;\">It was due to this, that enemies of Islam sought to discredit him, in order to ultimately destroy the high status of the hadith system and library that Sunni Islam has amassed in its early years.<\/p>\n<p style=\"text-align: justify;\">A common misconception that is brought forth by those that criticize Abu Huraira is that he was able to narrate over five thousand hadiths, while only being with the Prophet &#8211; peace be upon him &#8211; for a relatively short time. The number often quoted is 5374. However, most readers aren&#8217;t aware that the number mentioned in this statistic is based upon Ibn Hazm&#8217;s book on the &#8220;Names of the Narrating Companions&#8221; and their numbers of hadiths. His statistics, as he admits himself, are based on the Musnad of Baqi bin Makhlad, which is one of the largest, if not the largest, hadith collection ever collected.<\/p>\n<p style=\"text-align: justify;\">Firstly, all Muslims should be aware that most, if not all hadith collections include repetitions. These repetitions come in different forms. At times they include a shortening of a narration in order to focus on a specific part. At times, a hadith is repeated in order to provide another chain. In many cases, a hadith is repeating for the simple reason that the hadith is relevant in more than one chapter. A famous example is the famous hadith: &#8220;Actions are (accounted for) by their intentions.&#8221; This hadith is repeated several times in Saheeh Al-Bukhari, simply because it fits into many different chapters.<\/p>\n<p style=\"text-align: justify;\">Another aspect that readers need to keep in mind is that many of the hadiths attributed to Abu Huraira are not authentic in the first place. The Musnad of Baqi bin Makhlad was not an authentic collection after all, which is why the narrations attributed to Abu Huraira in it are rather large.<\/p>\n<p style=\"text-align: justify;\">So, one may ask, how many narrations does one find from the path of Abu Huraira in authentic collections?<\/p>\n<p style=\"text-align: justify;\">Al-Hafith Al-Ala&#8217;ee counted the narrations in Saheeh Al-Bukhari and ended up a total of four hundred and eighteen narrations. See his Kashf Al-Niqab (p. 187).<\/p>\n<p style=\"text-align: justify;\">Other aspects that are related to Abu Huraira that people often overlook is that he lived for almost fifty years after the death of the Prophet &#8211; peace be upon him. Outlasting most of the other companions of the Prophet &#8211; peace be upon him &#8211; made him an ideal teacher. It is very common in Islamic study circles today to attain knowledge from old teachers. The older the teacher, the more likely the chance of having a shorter chain of narration to the Prophet &#8211; peace be upon him. With the passing of most of the companions, the younger <em>tabi&#8217;een<\/em> of the time had to either attain knowledge from elder <em>tabi&#8217;een<\/em>, who heard from the companions, or to attain knowledge from the older companions. Another aspect that should be considered was Abu Huraira&#8217;s location. Unlike many companions of the Prophet &#8211; peace be upon him &#8211; he stayed in Al-Madinah. Many other companions migrated to Basra, Kufa, Al-Shaam, Yemen, or even Makkah. Al-Madinah, at the time, was perhaps the &#8220;Mecca&#8221; of Islamic knowledge.<\/p>\n<p style=\"text-align: justify;\">However, even with all the above, one needs to admit that Abu Huraira still narrated a larger amount than the other companions regardless of age and location. The answer, as many Sunnis know, is due to Abu Huraira not having a job during the life of the Prophet &#8211; peace be upon him. Unlike most of the Muhajireen and Ansar, a large portion of their time was spent in the marketplace. Abu Huraira didn&#8217;t have the luxury of having a business, but was forced to beg on the streets of Madinah for food to simply stay alive. Being in close proximity to the Prophet &#8211; peace be upon him &#8211; though, made things easier, since the Prophet &#8211; peace be upon him &#8211; often received meals as gifts from his companions. Abu Huraira, with the intention of surviving first, was always within ear-range of the Prophet &#8211; peace be upon him &#8211; which exposed him to the prophetic traditions.<\/p>\n<h3 style=\"text-align: justify;\">Other points we wish to add are:<\/h3>\n<p style=\"text-align: justify;\">Abu Huraira&#8217;s narrations without repetition are not 5,000+ rather they&#8217;re around 1,400 (according to the research of Dr. `Abduh Yamani and Diya&#8217;-ul-Deen al-A`zami).<\/p>\n<p style=\"text-align: justify;\">Not all of these narrations were actually uttered by abu Huraira, some are fabricated lies and are not authentic, which reduces the above number even more.<\/p>\n<p style=\"text-align: justify;\">The vast majority of these narrations that remain were not exclusively narrated by abu Huraira, rather you&#8217;ll find the same narration by abu Huraira being related to us by other companions, this rules out the possibility of him &#8220;making it up&#8221;.<\/p>\n<p style=\"text-align: justify;\">A lot of abu Huraira&#8217;s narrations are not things he heard directly from the Prophet (saw), rather a big amount of his narrations are things which he later heard after the Prophet&#8217;s (saw) death from senior companions. This is why abu Huraira does not always say &#8220;I heard the Prophet (saw) say such and such&#8221; this means his narrations are not limited to the time he spent alongside the Prophet (saw).<\/p>\n<p style=\"text-align: justify;\">Some of Abu Huraira&#8217;s narrations are not words or sayings from the Prophet (saw) so they&#8217;re not prophetic-Hadiths in the traditional sense, but he narrates some events he witnessed or describes certain things he saw such as battles, or the way the Prophet (saw) walked or the color of his turban and other details.<\/p>\n<h2 style=\"text-align: justify;\">Fun Fact: Abu Huraira Spoke in Three Different Languages<\/h2>\n<p style=\"text-align: justify;\">It has become a common misconception amongst rationalist Muslims and Shias that <a href=\"http:\/\/twelvershia.net\/2015\/01\/11\/abu-huraira\/\" data-slimstat-type=\"2\" data-slimstat-callback=\"true\" data-slimstat-tracking=\"false\" rel=\"external nofollow\">Abu Huraira<\/a> was a simple and ignorant man. This view is a general view given to all who are considered to fall under the category of <em>muhadith<\/em> (those who specialize in narrating hadiths) as opposed to the <em>faqeeh <\/em>(jurists), who use their intellect in understanding hadiths.<\/p>\n<p style=\"text-align: justify;\">Similar accusations have been put forward to other <em>muhaditheen<\/em> of later generations, like Imam Ahmad, Al-Bukhari, Muslim, and other authors of hadith compilations.<\/p>\n<p style=\"text-align: justify;\">However, this is far from true, as we find in I’ilam Al-Muwaqi’een by Ibn Al-Qayyim, that according to Ibn Hazm, Abu Huraira is considered to be in the second tier of companions that were people of <em>futya <\/em>(that gave out religious rulings). This tier includes famous companions like Abu Bakr, Uthman bin Affan, Sa’ad bin Abi Waqqas, Abdulrahman bin Awf, Salman Al-Farsi, Jabir bin Abdullah, Mu’ath bin Jabal, Um Salama, and other famous companions.<\/p>\n<p style=\"text-align: justify;\">Furthermore, Abu Huraira was a multilingual companion, who lived in a setting (Al-Madinah) in which most people only spoke in Arabic. Not only does being multilingual have a major positive affect on brain activity and <a href=\"http:\/\/www.alfa.org\/News\/3535\/Researchers%3A-Dementia-Delayed-for-the-Multilingual\" rel=\"external nofollow\" data-slimstat-type=\"0\" data-slimstat-callback=\"true\" data-slimstat-tracking=\"true\">prevents dementia<\/a> according to modern science, but also allows the people to have a greater access to his knowledge.<\/p>\n<p style=\"text-align: justify;\">Other than the primary language of Arabic that Abu Huraira grew up with, since he was a Yemeni from the Daws tribe, Abu Huraira also spoke Abyssinian and Persian. Below, we have quoted two narrations that prove this little known fact.<\/p>\n<p style=\"text-align: justify;\">Harith b. Abu Dhubab (and he was the first cousin of Abu Huraira) said: Abu Huraira, I used to hear from you that you narrated to us along with this hadith and the other one also (there is no transitive disease), but now you observe silence about it. You used to say that Allah’s Messenger (ﷺ) said: There is no transitive disease. Abu Huraira denied having any knowledge of that, but he said that the sick camel should not be taken to the healthy one. Harith, however, did not agree with him, which irritated Abu Huraira and he said to him some words in the <strong>Abyssinian language.<\/strong><\/p>\n<p style=\"text-align: justify;\">Saheeh Muslim #2221<\/p>\n<p style=\"text-align: justify;\">While I was sitting with Abu Hurayrah<strong>, <\/strong>a Persian woman came to him along with a son of hers. She had been divorced by her husband and they both claimed him. She said: Abu Hurayrah, speaking to him in<strong> Persian<\/strong>, my husband wishes to take my son away. Abu Hurayrah said: Cast lots for him, saying it to her<strong> in a foreign language<\/strong>.<\/p>\n<p style=\"text-align: justify;\">Sunan Abi Dawud #2277<\/p>\n<p style=\"text-align: justify;\">Even though it may seem extremely strange for Abu Huraira to have learned and known these two languages, it should seem less of a surprise for those that are aware that Yemen was ruled by the Sassanid Persians and the Aksumite Abyssinians in the pre-Islamic era.<\/p>\n<h2 style=\"text-align: justify;\">Below, we have included a list of articles that are related to Abu Huraira and the accusations towards him.<\/h2>\n<p style=\"text-align: justify;\">The list will be updated on a regular basis.<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"text-align: justify;\"><a title=\"Response to: How Ibn Umar exposed Abu Huraira\" href=\"http:\/\/twelvershia.net\/2014\/10\/18\/response-to-how-ibn-umar-exposed-abu-huraira\/\" rel=\"external nofollow\">Response to: How Ibn Umar exposed Abu Huraira<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2014\/07\/30\/response-to-the-reputation-of-abu-huraira-was-that-of-a-liar-in-his-era\/\" rel=\"external nofollow\">Response to: The Reputation of Abu Huraira was that of a Liar in his Era<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2014\/11\/26\/response-to-reputation-of-abu-huraira-in-his-era-2\/\" rel=\"external nofollow\">Response to: Reputation of Abu Huraira in his Era (2)<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2014\/08\/21\/response-to-abu-huraira-enemy-of-allah\/\" rel=\"external nofollow\">Response to: Abu Huraira: Enemy of Allah<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2014\/08\/21\/response-to-abu-huraira-narrated-ahadeeth-different-from-what-prophet-told-ayesha\/\" rel=\"external nofollow\">Response to: Abu Huraira Narrated Ahadeeth Different from what Prophet told Ayesha<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/05\/11\/abu-huraira-and-his-promises\/\" rel=\"external nofollow\">Response to: Abu Huraira and his Promises<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/05\/14\/response-to-abu-huraira-enemy-of-allah-his-book-and-a-thief-according-to-umar\/\" data-slimstat-type=\"2\" data-slimstat-callback=\"true\" data-slimstat-tracking=\"false\" rel=\"external nofollow\">Response to: Abu huraira: Enemy of Allah &amp; His Book, and a Thief<\/a><\/li>\n<\/ul>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-2610\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" alt=\"abu huraira\" width=\"426\" height=\"179\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg 426w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah-300x126.jpg 300w\" sizes=\"auto, (max-width: 426px) 100vw, 426px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Abu Huraira accepted Islam in the year of Khaibar. Then he maintained\/established a close relationship with the Prophet peace be upon him, and accompanied him wherever he went, seeking knowledge from him. He was from the most memorizing companion&#8230; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/01\/11\/abu-huraira\/\" title=\"Abu Hurayrah &#8211; The Great Hadith Narrator\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3682,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15],"tags":[13],"class_list":{"0":"post-1626","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-featured-posts","8":"tag-abu-huraira"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1626","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1626"}],"version-history":[{"count":31,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1626\/revisions"}],"predecessor-version":[{"id":4815,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1626\/revisions\/4815"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3682"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1626"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1626"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1626"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}