{"id":1647,"date":"2015-01-22T06:25:18","date_gmt":"2015-01-22T06:25:18","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1647"},"modified":"2019-03-05T04:43:01","modified_gmt":"2019-03-05T04:43:01","slug":"dua-kumayl-not-authentic","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/01\/22\/dua-kumayl-not-authentic\/","title":{"rendered":"Dua Kumayl is NOT Authentic"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1647\" alt=\"\" \/><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-2021\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"Dua Kumayl\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a><\/p>\n<h1 style=\"text-align: justify;\">Dua Kumayl is NOT Authentic<\/h1>\n<p style=\"text-align: justify;\">In the name of Allah, the Most Gracious, Most Merciful.<\/p>\n<p style=\"text-align: justify;\">&#8220;Dua Kumayl&#8221; is a trademark supplication of the Twelver school, and it is popular to the extent that it perhaps is the most recited supplication known by Shi&#8217;ites today. Ironically, upon investigation, it turned out that even this renowned supplication has questionable origins roots. Shi&#8217;ite scholars, however, are never outspoken about this reality simply because it would be devastating to the masses.<\/p>\n<p style=\"text-align: justify;\">Even some of the more outspoken reformers, such as <a href=\"http:\/\/en.wikipedia.org\/wiki\/Muhammad_Asif_Muhsini\" rel=\"external nofollow\">Mohammad Asif Mohseni<\/a> in his Mashra’at Al-Bihar (1\/405), couldn’t openly dismiss and reject the ascription of this supplication to <em>Amir Al-Mu’minin<\/em>. When commenting on the 118 narrations of the first chapter in the twenty third volume of Bihar Al-Anwar, Mohseni said:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“The authentic reports in this chapter are: 8, 9, 18, 26, 27, 29, 31, 32, 34 in a version, 35, 37, 41, 46, 54, 58, 62, 63, 65, 67, 68, 74, 75, 76, 77 in a version, 84, 86 in a version, 90, <strong>and the 91st narration which is though to have come from &#8216;Ali (as)<\/strong>.”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">It is needless to say that Dua Kumayl is the 91st report in this chapter.<\/p>\n<p style=\"text-align: justify;\">A few pages later, Mohseni proceeds to use even more doubtful language when explaining the report. Prior to explaining the text of of Dua Kumayl, he said: “Assuming it was uttered by &#8216;Ali, it would mean&#8230;.”<\/p>\n<p style=\"text-align: justify;\">This suspicious language drove us to look further into the personality known as Kumayl b. Ziyad in order to discern his reliability in Shi&#8217;te biographical sources.<\/p>\n<p style=\"text-align: justify;\">The earliest Shi&#8217;ite biographical source to mention anything about Kumayl b. Ziyad is Rijal Al-Barqi. On page 59, the author refered to him as Kumayl b. Ziyad Al-Nakha’i. He listed him under a chapter titled: &#8220;The Companions [of Ali] from Yemen&#8221;. Nothing else is mentioned about this transmitter. It should also be noted that there is a difference of opinion regarding who is the actual author of Rijal Al-Barqi.<\/p>\n<p style=\"text-align: justify;\">The second biographical source to mentioned Kumayl is Rijal Al-Tusi, which is a more authoritative book. Al-Tusi mentioned Kumayl b. Ziyad Al-Nakha’i on two occasions. He is listed under the chapers: “those who narrated from Ali” (p. 80) and “the companions of Al-Hasan b. Ali” (p. 95).<\/p>\n<p style=\"text-align: justify;\">There is no other mention of Kumayl in any early authoritative Shi&#8217;ite biographical <em>rijali<\/em> sources. In other words, his reliability has not been endorsed, nor has it been negated. It is thus evident that Kumayl b. Ziyad was not a significant figure. It is also seems like his trademark &#8220;Dua Kumayl&#8221; only reached canon status around four centuries after his death, as one expect him to receive more attention from early Shi&#8217;ite biographical sources otherwise.<\/p>\n<h2 style=\"text-align: justify;\">Dua Kumayl&#8217;s Chain of Transmission<\/h2>\n<p style=\"text-align: justify;\">The earliest and most reliable source that contains the isnads for Dua Kumayl is Al-Saduq’s Kamal Al-Deen 1\/274-279. Al-Saduq listed the following chains of transmission for the supplication:<\/p>\n<p style=\"text-align: justify;\">1- From my father, and Mohammad b. Al-Hasan, and Mohammad b. Ali Majilowaih, from Mohammad b. Abi Al-Qasim Majilowaih, from Mohammad b. Ali Al-Kufi Al-Qurashi Al-Muqri’, from Al-Nasr b. Muzahim Al-Minqari, from Omar b. Sa’ad, from Fudhail b. Khadeej, from Kumayl b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">2- From Mohammad b. Al-Hasan b. Ahmad b. Al-Waleed, from Mohammad b. Al-Hasan Al-Saffar, and Sa’ad b. Abdullah, and Abdullah b. Ja’afar Al-Himyari, from Ahmad b. Mohammad b. Eisa, and Ibrahim b. Hashim, from Abdulrahman b. Abi Najran, from Asim b. Humaid, from Abi Hamza Al-Thamali, from <strong>Abdulrahman b. Jundub<\/strong>, from Kumayl b. Ziyad Al-Nakha’i.<\/p>\n<p style=\"text-align: justify;\">3- From Abdullah b. Mohammad b. Abdullah b. Mohammad b. Abdulwahab b. Nasr b. Abdulwahab Al-Qurashi, from Abi Bakr Mohammad b. Dawud b. Sulaiman Al-Nisapuri, from Musa b. Ishaaq Al-Ansari the judge of Ray, from Abu Nu’aym Dhirar b. Surad Al-Taymi, from Asim b. Humaid Al-Hannat, from Abi Hamza, from <strong>Abdulrahman b. Jundub Al-Fazzari<\/strong>, from Kumayl b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">4- From Ahmad b. Ziyad b. Ja’afar Al-Hamadani, from Ali b. Ibrahim b. Hashim, from his father, from Abdulrahman b. Abi Najran, from Asim b. Humaid, from Abi Hamza Al-Thamali, from <strong>Abdulrahman b. Jundub Al-Fazzari<\/strong>, from Kumayl b. Ziyad Al-Nakha’i.<\/p>\n<p style=\"text-align: justify;\">5- From Abi Sa’eed Mohammad b. Al-Hasan b. Ali b. Mohammad b. Ahmad b. Ali b. Al-Salt Al-Qummi, from Mohammad b. Al-Abbas Al-Harawi, from Abi Abdullah Mohammad b. Ishaaq b. Sa’id Al-Sa’di, from Abi Hatim Mohammad b. Idrees Al-Hanthali Al-Razi, from Isma’il b. Musa Al-Fazzari, from Asim b. Humaid, from Abi Hamza Al-Thamali, from <strong>Abdulrahman b. Jundub<\/strong>, from Kumayl b. Ziyad Al-Nakha’i.<\/p>\n<p style=\"text-align: justify;\">6- From Abu Ahmad b. Mohammad b. Ahmad Al-Sarraj Al-Hamadani, from Abi Ahmad Al-Qasim b. Abi Salih, from Musa b. Ishaaq Al-Qadhi Al-Ansari, from Abi Nu’aym Dhirar b. Surd, from Asim b. Humaid Al-Hannat, from Abi Hamza Al-Thamali, from <strong>Abdulrahman b. Jundub Al-Fazzari<\/strong>, from Kumail b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">7- From Abi Mohammad Bakr b. Ali b. Mohammad b. Al-Fadhl Al-Hanafi Al-Shashi, from Abi Bakr Mohammad b. Abdullah b. Ibrahim Al-Bazzar Al-Shafi’i, from Musa b. Ishaaq Al-Qadhi, from Dhirar b. Surad, from Asim b. Humaid Al-Hannat, from Abi Hamza Al-Thamali, from <strong>Abdulrahman<\/strong> <strong>b. Jundub Al-Fazzari<\/strong>, from Kumayl b. Ziyad Al-Nakha’i.<\/p>\n<p style=\"text-align: justify;\">8- From Abi Al-Hasan Ali b. Abdullah b. Ahmad Al-Aswari, from Makki b. Ahmad b. Sa’dawaih Al-Bartha’ee, from Abdullah b. Mohammad b. Al-Hasan Al-Mashriqi, from Mohammad b. Idrees Abu Hatim, from Isma’il b. Musa Al-Fazzari, from Asim b. Humaid, from Abi Hamza Al-Thamali, from Thabit b. Abi Safiyyah, from <strong>Abdulrahman b. Jundub<\/strong>, from Kumayl b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">Note: Thabit b. Abi Safiyyah is Abu Hamza Al-Thamali.<\/p>\n<p style=\"text-align: justify;\">9- From Abi Al-Hasan Ahmad b. Mohammad b. Al-Saqr Al-Sa’igh Al-Adl, from Musa b. Ishaaq Al-Qadhi, from Dhirar b. Surd, from Asim b. Humaid Al-Hannat, from Abi Hamza Al-Thamali, from <strong>Abdulrahman b. Jundub Al-Fazzari<\/strong>, from Kumayl b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">10- From Abi Mohammad Bakr b. Ali b. Mohammad b. Al-Fadhl Al-Hanafi Al-Shashi, from Abi Bakr Mohammad b. Abdullah [b.] Ibrahim Al-Bazzar Al-Shafi’i, from Bishr b. Musa Abu Ali Al-Asadi, from Abdullah b. Al-Haytham, from Abi Ya’qub Ishaaq b. Mohammad b. Ahmad Al-Nakha’i, from Abdullah b. Al-Fadhl b. Abdullah b. Abi Al-Hayyaj b. Mohammad b. Abi Sufyan b. Al-Harith b. Abdulmutalib, from Hisham b. Mohammad [b.] Al-Sa’ib Abu Munthir Al-Kalbi, from Abi Mikhnaf Lut b. Yahya from Fudhail b. Khadeej, from Kumayl b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">11- From my father, from Sa’ad b. Abdullah, from Ya’qoub b. Yazeed, from Abdullah b. Al-Fadhl b. Eisa, from Abdullah Al-Nawfili, from Abdullah b. Abdulrahman, from Hisham Al-Kalbi, from Abi Mukhnaf Lut b. Yahya, from <strong>Abdulrahman b. Jundub<\/strong>, from Kumayl b. Ziyad.<\/p>\n<p style=\"text-align: justify;\">12- From Mohammad b. Ali Majilowaih, from his uncle Mohammad b. Abi Al-Qassim, from Mohammad b. Ali Al-Kufi, from Nasr b. Muzahim, from Abi Mukhnaf Lut b. Yahya Al-Azdi, from <strong>Abdulrahman b. Jundub<\/strong>, from Kumayl b. Ziyad Al-Nakha’i.<\/p>\n<p style=\"text-align: justify;\">13- From Ja’afar b. Mohammad b. Masroor, from Al-Hussain b. Mohammad b. Amer, from his uncle Abdullah b. Amer, from Mohammad b. Abi Umair, from Aban b. Uthman Al-Ahmar, from <strong>Abdulrahman b. Jundub<\/strong>, from Kumayl b. Ziyad Al-Nakha’ee.<\/p>\n<p style=\"text-align: justify;\">14- From Mohammad b. Musa Al-Mutawakil, from Mohammad b. Abi Abdullah Al-Kufi, from Mohammad b. Isma’il Al-Barmaki, from Abdullah b. Ahmad, from Abi Zuhair Abdulrahman b. Musa Al-Barqi, from Mohammad b. Al-Zayyat, from Abi Salih, from Kumail b. Ziyad.<\/p>\n<h2 style=\"text-align: justify;\">Analysis of the Chains of Transmission<\/h2>\n<p style=\"text-align: justify;\">Though these redactions of Dua Kumayl may seem plentiful at first glance, they actually are only three hadiths. They are not independent, and most of these chains of transmission converge to a single transmitter.<\/p>\n<p style=\"text-align: justify;\">To break things down, it is apparent that the common link in reports #2 – 9 and 11 – 13 is Abdulrahman b. Jundub Al-Fazzari. He  is the primary transmitter of Dua Kumayl, yet he was not mentioned in any early biographical sources<em>.<\/em> According to Al-Jawahiri, in <em>Al-Mufid min Mu’jam Rijal Al-Hadith <\/em>(p. 309), he us unknown.<\/p>\n<p style=\"text-align: justify;\">Reports reports #1 and # 10 are transmitted through Fudhail b. Khadeej. He too was not mentioned in any early biographical sources, and he therefore is an obscure and unknown transmitter.<\/p>\n<p style=\"text-align: justify;\">The final report is the most problematic of them all, since it contains three unknown transmitters, Abdulrahman b. Musa Al-Barqi, Mohammad b. Al-Zayyat, and Abu Salih.<\/p>\n<p>Another noteworthy phenomenon in these reports is their conflicting transmission:<\/p>\n<ul>\n<li>Reports #11 and #12 quote Lut b. Yahya transmitting the tradition from &#8216;Abdurrahman b. Jundub, while report #10 quotes him transmitting it from Fudhail b. Khadeej.<\/li>\n<li>Report #1 quotes Nasr b. Muzahem transmitting the tradition from &#8216;Omar b. Sa&#8217;d, while report #12 quotes him transmitting it from Lut b. Yahya.<\/li>\n<\/ul>\n<h2><span style=\"font-size: 18pt;\"><strong>Summary<\/strong><\/span><\/h2>\n<p>The inauthenticity of this supplication stems from a variety of defects in its transmission:<\/p>\n<ol>\n<li>All of its chains of transmission converge to Kumayl b. Ziyad, who is an obscure and unknown transmitter in early Shi&#8217;ite biographical sources.<\/li>\n<li>Reports #2-9 and #11-13 further converge to another unknown transmitter beneath Kumayl, &#8216;Abdurrahman b. Jundub.<\/li>\n<li>Reports #1 and #10 converge to Fudhail b. Khadeej beneath Kumayl, and he is unknown as well.<\/li>\n<li>Report #14 contains three consecutive unknown transmitters.<\/li>\n<li>Several redactions of this report, as presented above, conflict in their chains of transmission.<\/li>\n<li>The source of all of these reports is the forger, <a href=\"http:\/\/www.twelvershia.net\/sdm_downloads\/the-distortions-of-al-saduq\/\">Al-Saduq Ibn Babuyah<\/a>.<\/li>\n<\/ol>\n<p>It is important to note that the aforementioned chains of transmission for Dua Kumayl very well may include other  factors that add to its weakness, however, we have pointed out the most obvious flaws in a concise fashion for the benefit of the readers.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" src=\"http:\/\/www.eslam.de\/begriffe\/b\/images\/bittgebet_von_kumail.gif\" alt=\"Dua Kumayl\" width=\"186\" height=\"115\" \/><\/p>\n<h2 style=\"text-align: justify;\">English Translation of the Fabricated Supplication Known as Dua Kumayl<\/h2>\n<p>In the Name of Allah, the All-merciful, the All-compassionate<\/p>\n<p>O Allah, I ask You by Your mercy, which “..embraces all things” (7:156),<\/p>\n<p>And by Your strength, through which You dominate all things,<\/p>\n<p>And toward which all things are humble<\/p>\n<p>And before which all things are lowly;<\/p>\n<p>And by Your invincibility through which You overwhelm all things,<\/p>\n<p>And by Your might, which nothing can resist;<\/p>\n<p>And by Your tremendousness, which has filled all things;<\/p>\n<p>by Your force, which towers over all things;<\/p>\n<p>And by Your face, which subsists after the annihilation of all things,<\/p>\n<p>And by Your Names, which have filled the foundations of all things;<\/p>\n<p>And by Your knowledge, which encompasses all things;<\/p>\n<p>And by the light of Your face, through which all things are illumined!<\/p>\n<p>O Light! O All-holy!<\/p>\n<p>O First of those who are first<\/p>\n<p>And O Last of those who are last!<\/p>\n<p>O Allah, forgive me those sins which tear apart safeguards!<\/p>\n<p>O Allah, forgive me those sins which draw down adversities!<\/p>\n<p>O Allah, forgive me those sins which alter blessings!<\/p>\n<p>O Allah forgive me those sins which hold back supplication!<\/p>\n<p>O Allah forgive me those sins which cut down hopes!<\/p>\n<p>O Allah, forgive me those sins which draw down tribulation!<\/p>\n<p>O Allah, forgive me every sin I have committed and every mistake I have made!<\/p>\n<p>O Allah, verily I seek nearness to You through remembrance of You,<\/p>\n<p>And I seek intercession from You with Yourself,<\/p>\n<p>And I ask You through Your munificence to bring me near to Your proximity,<\/p>\n<p>And to provide me with gratitude toward You<\/p>\n<p>And to inspire me with Your remembrance.<\/p>\n<p>O Allah, verily I ask You with the asking of a submissive, abased and lowly man to show me forbearance, to have mercy on me<\/p>\n<p>And to make me satisfied and content with Your apportionment and humble in every state.<\/p>\n<p>O Allah, I ask You with the asking of one whose indigence is extreme,<\/p>\n<p>And who has stated to You in difficulties his need<\/p>\n<p>And whose desire for what is with You has become great.<\/p>\n<p>O Allah, Your force is tremendous, Your place is lofty,<\/p>\n<p>And Your deception is hidden, Your command is manifest,<\/p>\n<p>And Your domination is overwhelming, Your power is unhindered<\/p>\n<p>And escape from Your governance is impossible.<\/p>\n<p>O Allah, I find no forgiver of my sins,<\/p>\n<p>No concealer of my ugly acts,<\/p>\n<p>And no transformer of any of my ugly acts into good acts but You<\/p>\n<p>There is no god but You!<\/p>\n<p>Glory be to You, and Yours is the praise!<\/p>\n<p>I have wronged myself,<\/p>\n<p>And I have been audacious in my ignorance<\/p>\n<p>And I have depended upon Your ancient remembrance of me and Your favour toward me.<\/p>\n<p>O Allah! O my Protector!<\/p>\n<p>How many ugly things You have concealed!<\/p>\n<p>How many burdensome tribulations You have abolished!<\/p>\n<p>And how many stumbles You have prevented!<\/p>\n<p>And how many ordeals You have repelled!<\/p>\n<p>And how much beautiful praise, for which I was unworthy, You have spread abroad!<\/p>\n<p>O Allah, my tribulation is tremendous,<\/p>\n<p>And my bad state is excessive,<\/p>\n<p>And my acts are inadequate,<\/p>\n<p>And my fetters have tied me down,<\/p>\n<p>And my far-fetched hopes have held me back from my gain<\/p>\n<p>And this world with its delusions, my own soul with its offences and my delay have deceived me.<\/p>\n<p>O my Master! So I ask You by Your might not to let my evil works and acts veil my supplication from You,<\/p>\n<p>And not to disgrace me through the hidden things You know of my secrets<\/p>\n<p>And not to hasten me to punishment for what I have done in private:<\/p>\n<p>My evil acts in secrecy and my misdeeds<\/p>\n<p>And my continuous negligence and my ignorance<\/p>\n<p>And my manifold passions and my forgetfulness.<\/p>\n<p>And by Your might, O Allah, be kind to me in all states<\/p>\n<p>And be gracious to me in all affairs!<\/p>\n<p>My God and my Lord! Have I any but You from whom to ask removal of my affliction and regard for my affairs!<\/p>\n<p>My God and my Protector! You put into effect through me a decree in which I followed the caprice of my own soul<\/p>\n<p>And did not remain wary of adorning my enemy.<\/p>\n<p>So he deluded me through my soul’s caprice and therein destiny favoured him<\/p>\n<p>So, in what was put into effect through me in that situation, I transgressed some of Your statutes<\/p>\n<p>And disobeyed some of Your commands.<\/p>\n<p>So Yours is the argument against me in all of that<\/p>\n<p>I have no argument in what Your destiny put into effect through me therein<\/p>\n<p>nor in what Your decree and Your tribulation imposed upon me.<\/p>\n<p>Now I have come to You, My God, after my shortcoming and my immoderation toward myself,<\/p>\n<p>Proffering my excuse, regretful,<\/p>\n<p>Broken, apologizing,<\/p>\n<p>Asking forgiveness, repenting,<\/p>\n<p>Acknowledging, submissive, confessing.<\/p>\n<p>I find no place to flee from what occurred through me,<\/p>\n<p>Nor any place of escape to which I may turn in my affairs,<\/p>\n<p>Other than Your acceptance of my excuse and Your entering me into the compass of Your mercy.<\/p>\n<p>O Allah, so accept my excuse,<\/p>\n<p>Have mercy upon the severity of my affliction<\/p>\n<p>And release me from the tightness of my fetters,<\/p>\n<p>My Lord, have mercy upon the weakness of my body, the thinness of my skin and the frailty of my bones.<\/p>\n<p>O Thou who gave rise to my creation, to the remembrance of me, to the nurture of me, to goodness toward me and to nourishment on me,<\/p>\n<p>Bestow upon me for the sake of Your having given rise [to me] with generosity and Your previous goodness to me!<\/p>\n<p>O Allah, my Master and my Lord!<\/p>\n<p>Can You see Yourself tormenting me with Your fire after I have professed Your Unity<\/p>\n<p>And after the knowledge of You my heart has embraced,<\/p>\n<p>And the remembrance of You my tongue has constantly mentioned<\/p>\n<p>And the love of You to which my mind has clung,<\/p>\n<p>And after the sincerity of my confession and my supplication, humble before Your lordship?<\/p>\n<p>Far be it from You! You are more generous than that You should squander him whom You have nurtured,<\/p>\n<p>Or banish him whom You have brought nigh,<\/p>\n<p>Or drive away him whom You have given an abode<\/p>\n<p>Or submit to tribulation him whom You have spared and shown mercy.<\/p>\n<p>Would that I knew, my Master, My God and my Protector,<\/p>\n<p>Whether You will give the Fire dominion over faces fallen down prostrate before Your Tremendousness,<\/p>\n<p>And over tongues voicing sincerely the profession of Your Unity and giving thanks to You in praise,<\/p>\n<p>And over hearts acknowledging Your Divinity through verification,<\/p>\n<p>And over minds encompassing knowledge of You until they have become humble<\/p>\n<p>And over bodily members speeding to the places of Your worship in obedience and beckoning for Your forgiveness in submission.<\/p>\n<p>No such opinion is held of You! Nor has such been reported – thanks to Your bounty — concerning You,<\/p>\n<p>O All-generous! My Lord,<\/p>\n<p>And You know my weakness before a little of this world’s tribulations and punishments,<\/p>\n<p>And before those ordeals which befall its inhabitants,<\/p>\n<p>Even though it is a tribulation and ordeal whose stay is short, whose subsistence is but little and, whose period is but fleeting.<\/p>\n<p>So how can I endure the tribulations of the next world and the great ordeals that occur within it?<\/p>\n<p>For it is a tribulation whose period is long, whose station endures and whose sufferers are given no respite,<\/p>\n<p>Since it only occurs as a result of Your wrath, Your vengeance and Your anger,<\/p>\n<p>And these cannot be withstood by the heavens and the earth.<\/p>\n<p>O Master, so what about me?!<\/p>\n<p>For I am Your weak, lowly, base, wretched and miserable slave.<\/p>\n<p>My God! My Lord! My Master! My Protector!<\/p>\n<p>For which things would I complain to You?<\/p>\n<p>And for which of them would I lament and weep?<\/p>\n<p>For the pain and severity of chastisement?<\/p>\n<p>Or for the length and period of tribulation?<\/p>\n<p>So if You take me to the punishments with Your enemies,<\/p>\n<p>And gather me with the people of Your tribulation<\/p>\n<p>And separate me from Your friends and saints,<\/p>\n<p>Then suppose, My God, my Master, my Protector and my Lord that I am able to endure Your chastisement,<\/p>\n<p>How can I endure separation from You?<\/p>\n<p>And suppose that I am able to endure the heat of Your fire,<\/p>\n<p>How can I endure not gazing upon Your generosity?<\/p>\n<p>Or how can I dwell in the Fire while my hope is Your pardon?<\/p>\n<p>So by Your might, my Master and my protector, I swear sincerely, if You leave me with speech,<\/p>\n<p>I will lament to You from the midst of the Fire’s inhabitants with lamentation of the hopeful;<\/p>\n<p>I will cry to You with the cry of those crying for help;<\/p>\n<p>I will weep to You with the weeping of the bereft;<\/p>\n<p>And I will call to You, Where art Thou, O Sponsor of the believers,<\/p>\n<p>O Goal of the hopes of Your knowers,<\/p>\n<p>O Aid of those who seek assistance,<\/p>\n<p>O Friend of the hearts of the sincere<\/p>\n<p>And O God of all the world’s inhabitants!<\/p>\n<p>Can You see Yourself — Glory be to You My God, and Yours is the praise — hearing within the Fire the voice of a slave surrendered to<\/p>\n<p>Imprisoned there because of his violations,<\/p>\n<p>Tasting the flavour of its torment because of his disobedience,<\/p>\n<p>And confined within its levels because of his sin and crime,<\/p>\n<p>While he laments to You with the lament of one hopeful for Your mercy,<\/p>\n<p>And calls to You with the tongue of those who profess Your Unity<\/p>\n<p>And entreats You by Your lordship!<\/p>\n<p>My Protector, so how should he remain in the chastisement, while he has hope for Your previous clemency?<\/p>\n<p>Or how should the Fire cause him pain while he expects Your bounty and mercy?<\/p>\n<p>Or how should its flames burn him, while You hear his voice and see his place?<\/p>\n<p>Or how should its groaning encompass him, while You know his weakness?<\/p>\n<p>Or how should he be convulsed among its levels, while You know his sincerity?<\/p>\n<p>Or how should its keepers torture him while he calls out to You, “O Lord”?<\/p>\n<p>Or how should he have hope of Your bounty in freeing him from it, while You abandon him within it?<\/p>\n<p>Far be it from You! That is not what is expected of You,<\/p>\n<p>Nor what is well-known of Your bounty,<\/p>\n<p>Nor it is similar to the goodness and kindness Thou hast shown to those who profess Your Unity.<\/p>\n<p>So I declare with certainty that were it not for what You have decreed concerning the chastisement of Your deniers<\/p>\n<p>And what You have foreordained concerning the everlasting home of those who stubbornly resist,<\/p>\n<p>You would make the Fire, all of it, coolness and safety,<\/p>\n<p>And no one would have a place of rest or abode within it.<\/p>\n<p>But You —holy are Your Names—hast sworn that You will fill it with the unbelievers,<\/p>\n<p>Both Jinn and men together,<\/p>\n<p>And that You will place those who stubbornly resist therein forever.<\/p>\n<p>And You — majestic is Your eulogy— said at the beginning and were gracious through kindness as a favour,<\/p>\n<p>“What? Is he who has been believer like unto him who has been ungodly? They are not equal” (32:18)<\/p>\n<p>My God and my Master! So I ask You by the power You have apportioned<\/p>\n<p>And by the decision which You have determined and imposed and through which You have overcome him toward whom it has been put into<\/p>\n<p>That You forgive me in this night and at this hour<\/p>\n<p>Every offence I have committed,<\/p>\n<p>And every sin I have performed,<\/p>\n<p>And every ugly thing I have concealed<\/p>\n<p>And every folly I have enacted<\/p>\n<p>Whether I have hidden or announced it,<\/p>\n<p>Or I have concealed it or manifested it<\/p>\n<p>And every evil act which You have commanded the Noble Writers to record,<\/p>\n<p>Those whom You have appointed to watch over what appears from me<\/p>\n<p>And whom You have made, along with my bodily members, witness against me.<\/p>\n<p>And “You were Yourself the Watcher” (5:117) over me from behind them,<\/p>\n<p>And the Witness of what is hidden from them<\/p>\n<p>But through Your mercy You concealed it<\/p>\n<p>And through Your bounty You veiled it.<\/p>\n<p>[And I ask You] that You bestow upon me an abundant share of every good You send down,<\/p>\n<p>Or kindness You confer,<\/p>\n<p>Or goodness You unfold,<\/p>\n<p>Or provision You spread out,<\/p>\n<p>Or sin You forgive,<\/p>\n<p>Or error You cover.<\/p>\n<p>My Lord! My Lord! My Lord!<\/p>\n<p>My God! My Master! My Protector! Owner of my bondage!<\/p>\n<p>O He in whose hand is my forelock!<\/p>\n<p>O He who knows my affliction and my misery!<\/p>\n<p>O He who is aware of my poverty and indigence!<\/p>\n<p>My Lord! My Lord! My Lord!<\/p>\n<p>I ask You by Your Truth and Your Holiness<\/p>\n<p>And the greatest of Your Attributes and Names,<\/p>\n<p>That You make my times in the night and the day inhabited by Your remembrance,<\/p>\n<p>And joined to Your service<\/p>\n<p>And my works acceptable to You,<\/p>\n<p>So that my works and my litanies may all be a single litany<\/p>\n<p>And my occupation with Your service everlasting.<\/p>\n<p>My Master! O He upon whom I depend!<\/p>\n<p>O He to whom I complain about my states!<\/p>\n<p>My Lord! My Lord! My Lord!<\/p>\n<p>Strengthen my bodily members in Your service,<\/p>\n<p>And fortify my ribs in determination<\/p>\n<p>And bestow upon me earnestness in my fear of You<\/p>\n<p>And continuity in my being joined to Your service<\/p>\n<p>So that I may move easily toward You in the battlefields of the foremost<\/p>\n<p>And hurry to You among the prominent<\/p>\n<p>And desire fervently Your proximity among the fervently desirous<\/p>\n<p>And move nearer to You with the nearness of the sincere<\/p>\n<p>And fear You with the fear of those who have certitude<\/p>\n<p>And gather with the believers in Your vicinity.<\/p>\n<p>O Allah, whoever desires evil for me, desire [it] for him!<\/p>\n<p>whoever deceives me-deceive him!<\/p>\n<p>And make me one of the most excellent of Your slaves in Portion from You,<\/p>\n<p>And the nearest of them in station to You<\/p>\n<p>And the most elect of them in proximity to You.<\/p>\n<p>For that cannot be attained except by Your bounty.<\/p>\n<p>And grant generously to me through Your munificence,<\/p>\n<p>And incline toward me with Your splendour<\/p>\n<p>And protect me with Your mercy!<\/p>\n<p>And make my tongue remember You without ceasing<\/p>\n<p>And my heart enthralled by Your love!<\/p>\n<p>And be gracious to me by answering me favourably,<\/p>\n<p>And nullify my slips<\/p>\n<p>And forgive my lapses!<\/p>\n<p>For Thou hast decreed Your worship for Your servants<\/p>\n<p>And commanded them to supplicate You<\/p>\n<p>And assured them that they would be answered.<\/p>\n<p>So toward You, my Lord, I have turned my face<\/p>\n<p>And toward You, my Lord, I have extended my hand.<\/p>\n<p>So by Your might, comply with my supplication<\/p>\n<p>And make me attain my desires!<\/p>\n<p>Do not severe my hopes of Your favours<\/p>\n<p>And spare me the evil of my enemies from among the jinn and men!<\/p>\n<p>O He, whose pleasure is quickly achieved!<\/p>\n<p>Forgive him who owns nothing but supplication<\/p>\n<p>For You do what You will.<\/p>\n<p>O He whose Name is a remedy,<\/p>\n<p>And whose remembrance is a cure,<\/p>\n<p>And whose obedience is wealth!<\/p>\n<p>Have mercy upon him whose capital is hope<\/p>\n<p>And whose weapon is tears!<\/p>\n<p>O Ample in blessings!<\/p>\n<p>O Repeller of adversities!<\/p>\n<p>O Light of those who are lonely in the darkness!<\/p>\n<p>O Knower who was never taught!<\/p>\n<p>Bless Muhammad and Muhammad’s household!<\/p>\n<p>And do with me what is worthy of You!<\/p>\n<p>And Allah bless His messenger and the holy Imams of his household<\/p>\n<p>And give them abundant peace!<\/p>\n<p>&nbsp;<\/p>\n<h3>The translation of Dua Kumayl was taken from <a href=\"http:\/\/www.al-islam.org\/dua-kumayl-a-translation-and-commentary-husein-a-rahim\/dua-kumayl-translation-commentary\" rel=\"external nofollow\">here.<\/a><\/h3>\n<p style=\"text-align: justify;\">… and praise be to Allah – the Most Gracious, Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>&#8220;Dua Kumayl&#8221; is a trademark of the Shia sect and is so popular that it is perhaps the most recited supplication known by those that ascribe themselves to the Shiasm. Ironically, upon investigation, it turned out that even this very famous supplication has questionable roots&#8230; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/01\/22\/dua-kumayl-not-authentic\/\" title=\"Dua Kumayl is NOT Authentic\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3683,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15],"tags":[],"class_list":{"0":"post-1647","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-featured-posts"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1647","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1647"}],"version-history":[{"count":24,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1647\/revisions"}],"predecessor-version":[{"id":4572,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1647\/revisions\/4572"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3683"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1647"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1647"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1647"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}