{"id":1708,"date":"2015-02-12T09:05:26","date_gmt":"2015-02-12T09:05:26","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1708"},"modified":"2017-12-30T15:29:32","modified_gmt":"2017-12-30T15:29:32","slug":"prohibition-mutah-marriages","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/","title":{"rendered":"The Prohibition of Mutah Marriages"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1708\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter\" src=\"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/2\/27\/Basmala.svg\/608px-Basmala.svg.png\" alt=\"mutah\" width=\"608\" height=\"122\" \/><\/p>\n<h1 style=\"text-align: justify;\">The Prohibition of Mutah Marriages<\/h1>\n<p style=\"text-align: justify;\">The debate on the permissibility of <em>m<\/em><em>utah<\/em> marriages has spanned through centuries. The very act of indulging in a temporary marriage has triggered a multitude of emotional reactions from Muslims and non-Muslims alike. Much of the debate revolves around whether a temporary marriage is moral or not. It goes without saying that those that believe that it is prohibited usually hold the opinion that it is a despicable act. On the other hand, those who find it permissible voice the opinion that it is a necessity, since it prevents people from falling into other sins.<\/p>\n<p style=\"text-align: justify;\">Instead of studying the moral argument though, we at twelvershia.net decided that it would be more efficient to present to the dear viewer the academic answer and to avoid personal opinions. At the end of the day, it is Allah – praise be to Him &#8211; , that decides what is morally acceptable and what isn’t. The limited intellect of man has no place as a deciding factor when such is the case.<\/p>\n<p style=\"text-align: justify;\">This set of articles will first establish the prohibition of <em>mutah<\/em> marriages through authentic Sunni hadiths. After this has been established, we will look into arguments brought forth by Shias in order to justify the practice of <em>mutah<\/em>, like the criticisms towards the hadiths in this chapter, the Qur’anic evidence, and other additional hadith evidences, etc.<\/p>\n<p style=\"text-align: justify;\">In the beginning, during an expedition, Ibn Masu’d narrated (Muslim #3396): We were on a expedition with the Messenger of Allah – peace be upon him -, without any women. So we said, “Shall we castrate ourselves?” He forbade us from doing so, then permitted us to get married for a stipulated time, at the price of a garment.<\/p>\n<p style=\"text-align: justify;\">Al-Hazimi in Al-I’itibar (p. 137) explains: This ruling was permissible in the early days of Islam and the Prophet – peace be upon him &#8211; , permitted it due to the reasons mentioned by Ibn Mas’ud, during their travels, and it is not known to us that the Prophet – peace be upon him &#8211; permitted it while they were in their homes, which is why he forbade them from practicing this more than once at different times.<\/p>\n<p style=\"text-align: justify;\">One interesting aspect from the narration is that Ibn Mas’ud points out that <em>mutah<\/em> became “permitted”. This implies that it was forbidden before the aforementioned expedition. This suggests that the companions knew of such a marriage, but that it was not made lawful to them until this occasion. Dr. Jawad Ali, the Shi’ee author of Al-Mufasal fi Tareekh Al-Arab Qabl Al-Islam suggests that <em>mutah<\/em> was practiced since pre-Islamic times.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\">Contradiction about the Time in which Mutah was Banned?<\/h2>\n<p style=\"text-align: justify;\">Perhaps the most common argument brought forth by Shias that support the lawfulness of <em>mutah<\/em> is the contradiction argument. A Shi’ee will usually argue that since the reports differ on the timing of the banning of <em>mutah<\/em> then we must completely reject all narrations that suggest that <em>mutah<\/em> was banned.<\/p>\n<p style=\"text-align: justify;\">In response, we say that: It is not necessary for one to know the timing of when a religious ruling was made in order to accept it. One does not need to know when the prayers have been made obligatory, nor the alms, nor the pilgrimage, nor the fasting of Ramadan, nor the cutting off the hands of thieves, nor the time of the revelation of the inheritance laws for one to hold these matters as binding.<\/p>\n<p style=\"text-align: justify;\">No scholar would suggest that due to a difference of opinion as to the timing of the revealing of a law that it should be dismissed.<\/p>\n<p style=\"text-align: justify;\">However, if a Shi’ee will obsessively suggest that this is a reason to reject a part of the <em>shari’ah<\/em>, then it is binding upon them to reject the imamate of Ali. When one returns to Shia sources, one find that Ali was first designated an Imam at different times. His appointment as an Imam occurred as early as the time he was a baby, then in a narration as soon as Mohammad – peace be upon him &#8211; became a prophet, then on Yawm Al-Dar, then on the night of the Isra’a, then during Mi’raj in the highest parts of the heavens, then on the way back to the earth, then on the night of the migration to Madinah, then after the 3<sup>rd<\/sup> year after Hijra, <strong>then on Khaibar<\/strong>, then on the<strong> conquest of Makkah<\/strong>, then during the day of the Ghadeer , then on his death bed. Sh. Faisal Noor, on more than one occasion mocks these narrations, since they often include a confused prophet asking the angel: Who is my successor? He comments that the Prophet – peace be upon him – had to be reminded of his successor occasion after occasion. (See pages 57-69 from Al-Imamah wal Nas by Sh. Faisal Noor).<\/p>\n<p style=\"text-align: justify;\">The reader can also look into the great conflict between all the narrations related to the 12th Imam of the Shia in the same book.<\/p>\n<p style=\"text-align: justify;\">The academic way of dealing with such contradictions is by filtering out weak narrations and by reconciling those that can be reconciled.<\/p>\n<p style=\"text-align: justify;\">With the above in mind, we can take a look at the most important authentic narrations that include the timing of the prohibition of <em>mutah<\/em>, even though we can all agree that it is not necessary for one to know as to when the practice was made prohibited by the Prophet – peace be upon him.<\/p>\n<p style=\"text-align: justify;\">The narration about the earliest prohibition comes from the path of Ali bin Abi Talib in Saheeh Muslim #3417-3421. He narrates: The Messenger of Allah – peace be upon him – prohibited the <em>mutah<\/em> marriage of woman on Khaibar and consuming the (meat of the) domestic donkey.<\/p>\n<p style=\"text-align: justify;\">In some of these narrations, the words of Ali are directed towards Ibn Abbas.<\/p>\n<p style=\"text-align: justify;\">The second narration is the narration of Rabee’a bin Subra Al-Juhani from his father, in which he states that <em>mutah<\/em> was banned during the conquest of Makkah. This is also in Saheeh Muslim #3406, #3407, #3410, #3413, and #3414.<\/p>\n<p style=\"text-align: justify;\">Imam Muslim #3404 also includes from the hadith of Salama bin Al-Akwa’ that it was prohibited in the year of Awtas.<\/p>\n<p style=\"text-align: justify;\">According to historians, the conquest of Khaibar occurred on the seventh year after Hijra, while the conquest of Makkah and Awtas occurred on the eighth.<\/p>\n<p style=\"text-align: justify;\">Some of the narrations of Rabee’a bin Subra, like Al-Darimi’s in his Sunan #2250, suggest that it was during the final pilgrimage. However, one can safely conclude that this is a mistake by a narrator, since we find the same wording in Saheeh Muslim #3408 which also includes three of the same narrators. Therefore, it is safe to say that we are looking at the same hadith, but a narrator accidentally said that it was in the final pilgrimage, which occurred in Makkah, instead of conquest of Makkah.<\/p>\n<p style=\"text-align: justify;\">Abu Nu’aym Al-Haddad 3\/19 adds: In the narration of Ja’afar bin Awn and Abu Nu’aym, both from Abdul Aziz bin Omar bin Abdul Aziz, from Al-Rabee’, the narrations point to this occurring during the final pilgrimage. As for the narration of Ibrahim bin Sa’eed from Abdul Malik bin Al-Rabee’, and the narration of Harmala bin Abdul Al-Aziz bin Al-Rabee’, and Al-Zuhri, from Al-Rabee’, it was on the conquest (of Makkah), and this is more correct.<\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<h2 style=\"text-align: justify;\">The Strongest Views about when Mutah was Prohibited<\/h2>\n<p style=\"text-align: justify;\">In this brief chapter, we will simply focus on presenting the case for the strongest views for when <em>mutah<\/em> was prohibited. We will not be concerned with opinions like Al-Hazimi’s (p. 137) that it occurred during the final pilgrimage, since we have established that it goes against the correct wording of the hadith of Subra Al-Juhani.<\/p>\n<p style=\"text-align: justify;\">With that in mind, we are left with two opinions, which are that <em>mutah<\/em> was prohibited during Khaibar, during the conquest of Makkah, or in both expeditions.<\/p>\n<p style=\"text-align: justify;\">The most popular opinion is the one that is often most echoed by Sunni scholars.<\/p>\n<p style=\"text-align: justify;\">Al-Nawawi states in Al-Minhaj 9\/184 (via Al-Luma’ by Hamid bin Ali Al-Hanafi p. 50): The correct and chosen opinion is that it was made prohibited and permissible twice, and that it was permitted before Khaibar, then prohibited after Khaibar, then permitted before the conquest of Makkah, which is the day (year) of Awtas since they are connected, then made forbidden after three days permanently until the day of judgment, and the prohibition continued.<\/p>\n<p style=\"text-align: justify;\">However, this opinion was not agreed upon by all scholars. Al-Suhaili said in Al-Rawdh Al-Unuf 4\/70 that:<\/p>\n<p style=\"text-align: justify;\">Nobody from the historians nor hadith narrators are aware that <em>mutah<\/em> was forbidden on Khaibar, and Ibn Uyayna narrated it from Ibn Shihab from Abdullah bin Mohammad and said that the Prophet – peace be upon him – forbade the (meat of the) domestic donkey on the year of Khaibar, and (forbade) <em>mutah<\/em>. This means that <em>mutah<\/em> was made forbidden after this, or on another day, which means that it was a mix up in the wordings of Ibn Shihab.<\/p>\n<p style=\"text-align: justify;\">One of the earliest of sources &#8220;Musnad al-Hamidi&#8221; (d.219 AH) states the Hadith as follows:<\/p>\n<p style=\"text-align: justify;\">حَدَّثنا سُفْيَانُ، قَالَ: حَدَّثنا الزُّهْرِيُّ، قَالَ: أَخْبَرَنِي حَسَنٌ، وَعَبْدُ اللَّهِ ابْنَا مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِمَا، أَنَّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ، قَالَ لابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا: إِنَّ رَسُولَ اللَّهِ &#8221; نَهَى عَنْ نِكَاحِ الْمُتْعَةِ، وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ زَمَنَ خَيْبَرَ &#8220;، قَالَ سُفْيَانُ: يَعْنِى: أَنَّهُ نَهَى عَنْ لُحُومِ الأَهْلِيَّةِ زَمَنَ خَيْبَرَ، وَلا يَعْنِي نِكَاحَ الْمُتْعَةِ<\/p>\n<p style=\"text-align: justify;\">[&#8220;The messenger (saw) forbade the mutah, and the meat of the domestic donkey on Khaybar.&#8221; Suffiyan says: Meaning, he (saw) forbade the donkey meat at the time of Khaybar but not the mutah of women.]<\/p>\n<p style=\"text-align: justify;\">Abu Awana similarly comments 2\/278:<\/p>\n<p style=\"text-align: justify;\">The scholars say that the meaning of hadith Ali bin Abi Talib is that “the Prophet – peace be upon him – forbade the eating of the meat of the domestic donkey on Khaibar AND forbade the <em>mutah<\/em> of women on the days of Al-Fath (conquest of Makkah).”<\/p>\n<p style=\"text-align: justify;\">Before going on, it is important to point out that the scholars above seemed to lean towards this view since it is rare for something to be permitted and prohibited twice in the <em>shari’ah<\/em>. They seem to have sided with the narration of Sabra instead of the narration of Ali due to the fact that it was also narrated that Salama bin Akwa’ also mentioned that it was prohibited on the same year. Furthermore, Sabra himself stated that he practiced <em>mutah<\/em> on those days and provided details about the events, which makes it unlikely that he could have provided an incorrect date. Due to this, some scholars interpreted the hadith of Ali to mean that <em>mutah<\/em> was banned in general while domestic donkey meat was banned on Khaibar. Even though we disagree with this opinion due to reasons that we will shortly point out, the opinions and conclusions that these scholars arrived to are rational ones, as opposed to Shia apologists who claim that since “contradictions” have occurred, it is obligatory to reject all the narrations that prohibit <em>mutah.<\/em><\/p>\n<p style=\"text-align: justify;\">Of course, we have a few reasons to reject this opinion and stick to the view of the majority of the scholars of Ahl Al-Sunnah, which is that <em>mutah<\/em> was first prohibited on Khaibar, then made permissible and prohibited during the conquest of Makkah.<\/p>\n<p style=\"text-align: justify;\">The first reason is due to the hadith of Ibn Omar, in which he also mentions that <em>mutah<\/em> was banned in Khaibar. See Mustakhraj Abi Awana #3309.<\/p>\n<p style=\"text-align: justify;\">The second is that the reason provided by Al-Sulaihi is based on a chain that goes against what has been narrated by the majority. He quotes a narration that has Ali saying that “the <em>mutah<\/em> of women on Khaibar was prohibited,” and not “the <em>mutah <\/em>of woman, and prohibited the meat of the domestic donkey on Khaibar.” However, this narration contradicts the authentic narrations provided from Saheeh Muslim which are clear that it was banned on Khaibar.<\/p>\n<p style=\"text-align: justify;\">Thirdly, the narration in Saheeh Muslim from Sabra #3408\/#3416 states that <em>mutah<\/em> is now banned until the Day of Judgment. With regular rulings in Islamic <em>fiqh<\/em>, laws are usually made without those attached words. For these to be binded with <em>mutah<\/em> suggests that <em>mutah<\/em> was made permissible before after prohibition, however, is finally banned permanently. The usage of this wording cannot be found in the hadiths describing <em>mutah<\/em> being banned on Khaibar.<\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<h3 style=\"text-align: justify;\">Conclusion<\/h3>\n<p style=\"text-align: justify;\">As established in the previous texts, the authentic traditions from the Prophet – peace be upon him -, all point to the prohibition during his time. In this article we have covered the prohibition mentioned by Ali, Sabra, Ibn Omar, and Salama bin Al-Akwa’. In a separate article, we will also take a look at the narration of Omar, in which he also relates that the Prophet – peace be upon him – prohibited <em>mutah<\/em>.<\/p>\n<p style=\"text-align: justify;\">Other related matters that we will discuss in separate articles include:<\/p>\n<ul>\n<li style=\"text-align: justify;\">&#8211; <a title=\"Disproving the Argument that Mutah is in the Qur’an\" href=\"http:\/\/www.twelvershia.net\/2015\/02\/14\/mutah-in-the-quran\/\">Verse of Mutah in the Quran &#8211; A Shia Claim Debunked<\/a><\/li>\n<li style=\"text-align: justify;\">&#8211; <a title=\"The Banning of Mutah in the Time of Omar\" href=\"http:\/\/twelvershia.net\/2015\/02\/16\/banning-mutah-time-omar\/\" rel=\"external nofollow\">The Banning of <em>Mutah<\/em> in the Time of Omar<\/a><\/li>\n<li style=\"text-align: justify;\">&#8211; <a href=\"http:\/\/twelvershia.net\/2015\/02\/19\/companions-believed-mutah\/\" rel=\"external nofollow\">The Companions that Believed in <em>Mutah<\/em><\/a><\/li>\n<li style=\"text-align: justify;\">&#8211; <a title=\"Mutah in the Eyes of Ahl Al-Bayt in Ismaili and Zaydi Shia Traditions\" href=\"http:\/\/twelvershia.net\/2015\/02\/20\/mutah-eyes-ahl-al-bayt-ismaili-zaydi-shia-traditions\/\" rel=\"external nofollow\">Mutah in the Eyes of Ahl Al-Bayt in Ismaili and Zaydi Shia Traditions<\/a><\/li>\n<li style=\"text-align: justify;\">&#8211; <a title=\"Mutah in the Eyes of Ahl Al-Bayt in Twelver Shia Traditions\" href=\"http:\/\/twelvershia.net\/2015\/02\/23\/mutah-in-the-eyes-of-ahl-al-bayt-in-twelver-shia-traditions\/\" rel=\"external nofollow\">Mutah in the Eyes of Ahl Al-Bayt in Twelver Shia Traditions<\/a><\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Also see some of our older articles on Mut&#8217;ah in the form of refutations to other websites:<\/p>\n<ul>\n<li style=\"text-align: justify;\"><a title=\"Response to: Asma bint Abu Bakar did Mutah\" href=\"http:\/\/twelvershia.net\/2014\/03\/15\/response-to-asma-bint-abu-bakar-did-mutah\/\" rel=\"external nofollow\">Response to: Asma bint Abu Bakar did Mutah<\/a><\/li>\n<li style=\"text-align: justify;\"><a title=\"Response to: Sunnis and Mutah\" href=\"http:\/\/twelvershia.net\/2014\/03\/21\/response-to-sunnis-and-mutah\/\" rel=\"external nofollow\">Response to: Sunnis and Mutah<\/a><\/li>\n<li style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2014\/07\/30\/response-to-prophet-forbade-mutah-on-the-day-of-khaybar\/\" rel=\"external nofollow\">Response to: Prophet forbade Mutah on the Day of Khaybar?<\/a><\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Also check out this brief audio lecture discussing the rulings of <a href=\"http:\/\/twelvershia.net\/2015\/10\/07\/mutah-marriage-audio-lecture\/\" rel=\"external nofollow\">Mutah marriage<\/a>.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-2610\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" alt=\"mutah\" width=\"426\" height=\"179\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg 426w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah-300x126.jpg 300w\" sizes=\"auto, (max-width: 426px) 100vw, 426px\" \/><\/a><\/p>\n<hr \/>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The debate on the permissibility of mutah marriages has spanned through centuries. The very act of indulging in a temporary marriage has triggered a multitude of emotional reactions from Muslims and non-Muslims alike. Much of the debate revolves around&#8230; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" title=\"The Prohibition of Mutah Marriages\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15],"tags":[],"class_list":{"0":"post-1708","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-featured-posts"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1708","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1708"}],"version-history":[{"count":25,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1708\/revisions"}],"predecessor-version":[{"id":4232,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1708\/revisions\/4232"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1708"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1708"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1708"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}