{"id":1716,"date":"2015-02-14T06:23:18","date_gmt":"2015-02-14T06:23:18","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1716"},"modified":"2017-12-30T15:26:16","modified_gmt":"2017-12-30T15:26:16","slug":"mutah-in-the-quran","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/02\/14\/mutah-in-the-quran\/","title":{"rendered":"Verse of Mutah in the Quran &#8211; A Shia Claim Debunked"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1716\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The alleged verse of <em>mutah<\/em> in the Quran is the second in our series of the prohibition of <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\"><em>mutah<\/em><\/a><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/02\/CSkVgLFWoAAhfuE.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-thumbnail wp-image-4228\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/02\/CSkVgLFWoAAhfuE-150x150.jpg\" alt=\"mutah in the quran\" width=\"150\" height=\"150\" \/><\/a>. The verse states:<\/p>\n<p style=\"text-align: justify;\">So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And there is no blame upon you for what you mutually agree to beyond the obligation.<\/p>\n<p style=\"text-align: justify;\">Surat Al-Nisa’: 24<\/p>\n<p style=\"text-align: justify;\">The term used in Arabic for “enjoy” is: <em>istamta’tum<\/em>, which shares the same roots in the Arabic language as the term: <em>mutah<\/em>. Though, that is where the similarities end. Yet, it was enough for Shias to assume that there is a verse of <em>mutah<\/em> in the Quran.<\/p>\n<p style=\"text-align: justify;\"><strong>The Context of the &#8220;Verse of Mutah&#8221;<br \/>\n<\/strong><\/p>\n<p style=\"text-align: justify;\">When returning to the context of the &#8220;verse of mutah&#8221;, we realize that the verse is referring to a marriage that creates chastity.<\/p>\n<p style=\"text-align: justify;\">The same verse includes:<\/p>\n<p style=\"text-align: justify;\">وَأُحِلَّ لَكُمْ مَا وَرَاءَ ذَلِكُمْ أَنْ تَبْتَغُوا بِأَمْوَالِكُمْ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ فَمَا اسْتَمْتَعْتُمْ بِهِ مِنْهُنَّ فَآَتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُمْ بِهِ مِنْ بَعْدِ الْفَرِيضَةِ<\/p>\n<p style=\"text-align: justify;\">And lawful to you are [all other] beyond these, [provided] that you seek them [in marriage] with [gifts from] your property, desiring chastity, not unlawful sexual intercourse. So whatever you enjoy [of marriage] from them&#8230;<\/p>\n<p style=\"text-align: justify;\">Surat Al-Nisa’: 24<\/p>\n<p style=\"text-align: justify;\">The terms “desiring chastity” by the translators of the Saheeh Internation edition of the Qur’an is used to define the word: <em>muhsineen<\/em>, which also translates into “fortified”.<\/p>\n<p style=\"text-align: justify;\">According to the consensus of Muslims, both Sunni and Shias, those that are <em>muhsin<\/em> or fortified in marriage and are guilty of illegal sexual intercourse, are to be stoned to death. While on the other hand, those that are not <em>muhsin<\/em> are merely lashed.<\/p>\n<p style=\"text-align: justify;\">Furthermore, upon returning to Al-Istibsar by Al-Tusi (p. 997) we find a hadith with a chain that is as clear as the sun. Ishaaq bin Ammar asks the Musa Al-Kadhim about <em>mutah<\/em> and whether it fortifies him or not. Imam Musa responds: No, it (fortification) is only for someone permanent that is with him.<\/p>\n<p style=\"text-align: justify;\">Al-Tusi confirms this on the next page by saying: <em>Mutah<\/em> does not fortify. This is why in Shi`ee Fiqh, if a person does adultery and he was in a <em>m<\/em><em>utah<\/em> relationship, he is not stoned.<\/p>\n<p style=\"text-align: justify;\"><strong>Abrogated Recitation<\/strong><\/p>\n<p style=\"text-align: justify;\">The second piece of evidence that Shias use also revolves around the verse. They quote narrations from Ubai bin Ka’ab, Ibn Abbas, and Sa’eed bin Jubair in which they have quoted the same verse from the Quran, but recited it with the inclusion of an addition. The verse would read as:<\/p>\n<p style=\"text-align: justify;\">So for whatever you enjoy [of marriage] from them <strong><span style=\"text-decoration: underline;\">for a specified time<\/span><\/strong>, give them their due compensation as an obligation.<\/p>\n<p style=\"text-align: justify;\">Of course, this recitation no longer exists today. Major scholars from both sects have provided their reasons for this.<\/p>\n<p style=\"text-align: justify;\">Ayatollah Milani in his Al-Tahqeeq fi Nafi Al-Tahreef (p. 174) argues after quoting the narrations of Ibn Abbas and Ubai:<\/p>\n<p style=\"text-align: justify;\">If we add to this the permissibility of <em>mutah <\/em>and the actions of the Muslims until the time of Omar bin Al-Khattab, who banned it and promised to punish those who do it, it has become certain that this is how this verse was revealed as the narrations state, and that the word, “for a specific time,” was removed after the death of the Prophet peace be upon him and his family.<\/p>\n<p style=\"text-align: justify;\">The answer provided by Al-Milani is a desperate attempt to make <em>mutah<\/em> permissible, and by doing this he was pushed into claiming that the Quran has been tampered with.<\/p>\n<p style=\"text-align: justify;\">On the other side of the spectrum, Ibn Taymiyyah provides his interpretation of these narrations in Minhaj Al-Sunnah 2\/634:<\/p>\n<p style=\"text-align: justify;\">If revealed, then it is a letter (a recitation), and there is no doubt that it is not from the famous recitation, which makes it abrogated, and it would have been revealed when <em>mut’ah<\/em> was permissible, and when it became forbidden this letter (recitation) was abrogated.<\/p>\n<p style=\"text-align: justify;\">The reader has the freewill to decide which opinion is more reasonable of the two.<\/p>\n<p style=\"text-align: justify;\">Note: It is recommended for readers to refer to Minhaj Al-Sunnah for more on this subject, for Ibn Taymiyyah furthermore explains that the existence of this recitation by Ubai and Ibn Abbas does not make <em>mutah<\/em> permissible, but rather, it simply states that those that perform <em>mutah<\/em> are obligated to pay a dowry, and that this is the case with all forms of marriages, including marriages that are incorrectly contracted.<\/p>\n<p style=\"text-align: justify;\">In conclusion,<em> <\/em>there is no evidence of <em>mutah<\/em> in the Qur’an, but rather, remnants from an abrogated recitation according to Ahl Al-Sunnah, or rather, oral reports of corruption in the views of extreme Shias like Al-Milani. In both cases, we ultimately redirected to the various traditions in our earlier original article about the evidences for the <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\">prohibition of <em>mutah<\/em><\/a> from the <em>sunnah<\/em>.<\/p>\n<p style=\"text-align: justify;\"><strong>The term &#8220;Ajr&#8221; simply means dowry<\/strong><\/p>\n<p style=\"text-align: justify;\">Some of those not familiar with Arabic, may think that the word &#8220;Ujourahun&#8221; which means &#8220;Wages&#8221; here refers to the money you give a woman who you do <em>mutah<\/em> with her. This is incorrect because the word &#8220;Ajr&#8221; is used often to refer to the dowry as you will see in the following verses:<\/p>\n<p style=\"text-align: justify;\">وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا أَنْ يَنْكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِنْ مَا مَلَكَتْ أَيْمَانُكُمْ مِنْ فَتَيَاتِكُمُ الْمُؤْمِنَاتِ وَاللَّهُ أَعْلَمُ بِإِيمَانِكُمْ بَعْضُكُمْ مِنْ بَعْضٍ فَانْكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآَتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلَا مُتَّخِذَاتِ أَخْدَانٍ فَإِذَا أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَاحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى الْمُحْصَنَاتِ مِنَ الْعَذَابِ ذَلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ وَأَنْ تَصْبِرُوا خَيْرٌ لَكُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ<\/p>\n<p style=\"text-align: justify;\">{And whoever among you cannot [find] the means to marry free, believing women, then [he may marry] from those whom your right hands possess of believing slave girls. And Allah is most knowing about your faith. You [believers] are of one another. So marry them with the permission of their people and give them their <span style=\"color: #008000;\">due compensation (Ujourahun)<\/span> according to what is acceptable. [They should be] chaste, neither [of] those who commit unlawful intercourse randomly nor those who take [secret] lovers. But once they are sheltered in marriage, if they should commit adultery, then for them is half the punishment for free [unmarried] women. This [allowance] is for him among you who fears sin, but to be patient is better for you. And Allah is Forgiving and Merciful.} [4:25]<\/p>\n<p style=\"text-align: justify;\">الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّبَاتُ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْ وَالْمُحْصَنَاتُ مِنَ الْمُؤْمِنَاتِ وَالْمُحْصَنَاتُ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ إِذَا آَتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ وَلَا مُتَّخِذِي أَخْدَانٍ وَمَنْ يَكْفُرْ بِالْإِيمَانِ فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي الْآَخِرَةِ مِنَ الْخَاسِرِينَ<\/p>\n<p style=\"text-align: justify;\">{This day [all] good foods have been made lawful, and the food of those who were given the Scripture is lawful for you and your food is lawful for them. And [lawful in marriage are] chaste women from among the believers and chaste women from among those who were given the Scripture before you, when you have given them their <span style=\"color: #008000;\">due compensation (Ujourahun)<\/span>, desiring chastity, not unlawful sexual intercourse or taking [secret] lovers. And whoever denies the faith &#8211; his work has become worthless, and he, in the Hereafter, will be among the losers.} [5:5]<\/p>\n<p style=\"text-align: justify;\"> يَا أَيُّهَا النَّبِيُّ إِنَّا أَحْلَلْنَا لَكَ أَزْوَاجَكَ اللَّاتِي آَتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّا أَفَاءَ اللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالَاتِكَ اللَّاتِي هَاجَرْنَ مَعَكَ وَامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَنْ يَسْتَنْكِحَهَا خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِي أَزْوَاجِهِمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا<\/p>\n<p style=\"text-align: justify;\">{O Prophet, indeed We have made lawful to you your wives to whom you have given their <span style=\"color: #008000;\">due compensation (Ujourahun)<\/span> and those your right hand possesses from what Allah has returned to you [of captives] and the daughters of your paternal uncles and the daughters of your paternal aunts and the daughters of your maternal uncles and the daughters of your maternal aunts who emigrated with you and a believing woman if she gives herself to the Prophet [and] if the Prophet wishes to marry her, [this is] only for you, excluding the [other] believers. We certainly know what We have made obligatory upon them concerning their wives and those their right hands possess, [but this is for you] in order that there will be upon you no discomfort. And ever is Allah Forgiving and Merciful.} [33:50]<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The alleged verse of mutah in the Quran is the second in our series of the prohibition of mutah. The verse states: So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/02\/14\/mutah-in-the-quran\/\" title=\"Verse of Mutah in the Quran &#8211; A Shia Claim Debunked\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,12,4],"tags":[],"class_list":{"0":"post-1716","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fiqh","9":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1716","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1716"}],"version-history":[{"count":12,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1716\/revisions"}],"predecessor-version":[{"id":1720,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1716\/revisions\/1720"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}