{"id":1729,"date":"2015-02-16T08:31:18","date_gmt":"2015-02-16T08:31:18","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1729"},"modified":"2019-09-27T15:30:53","modified_gmt":"2019-09-27T15:30:53","slug":"banning-mutah-time-omar","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/02\/16\/banning-mutah-time-omar\/","title":{"rendered":"The Banning of Mutah in the Time of Omar"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1729\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In the original <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\"><em>mutah<\/em><\/a> article, we have provided several narrations that prove that <em>mutah<\/em> was prohibited by the Prophet – peace be upon him &#8211; during his time. However, there were claims made by some of the Prophet’s – peace be upon him – companions that suggest that <em>mutah<\/em> was prohibited during the time of Omar.<\/p>\n<p style=\"text-align: justify;\">The narrations of Jabir and Ibn Abbas are the ones most often cited.<\/p>\n<p style=\"text-align: justify;\">In Musanaf Abd Al-Razaq #14021, through an authentic chain, we can find Ibn Abbas saying:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">&#8220;If it were not for his prohibition (Omar’s), then only a vile person would perform adultery.&#8221;<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">In the same book we find Jabir saying that people were prevented from performing <em>mutah<\/em> due to what happened with Amr bin Huraith towards the end of the caliphate of Omar, and that <em>mutah<\/em> was practiced during the time of the Prophet – peace be upon him &#8211; and Abu Bakr.<\/p>\n<p style=\"text-align: justify;\">However, it has already been established in our first article about <em>mutah<\/em> that it was prohibited during the time of the Prophet – peace be upon him -, so why are these two companions attributing it to Omar?<\/p>\n<p style=\"text-align: justify;\"><strong>Evidence that Omar Relied on a Prophetic Tradition to Ban Mutah<\/strong><\/p>\n<p style=\"text-align: justify;\">We find a narration in Sunan Ibn Majah #1953 in which Omar says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">&#8220;The Messenger of Allah – peace be upon him – allowed us to perform <em>mutah<\/em> for three (days), then prohibited it. By Allah, if I knew that one of you performs <em>mutah<\/em> and is fortified, I will stone him (to death), unless he comes to me with four that testify that the Messenger – peace be upon him – permitted it after prohibiting it.&#8221;<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The narration is authentic, even though Aban bin Abdullah bin Abi Hazim was weakened by some, one finds that he was deemed trustworthy by Yahya bin Ma’een, Imam Ahmad, and Ibn Numair. Ibn Adi adds that he did not find any <em>munkar<\/em> traditions from Aban. See Tahtheeb Al-Tahtheeb 1\/54.<\/p>\n<p style=\"text-align: justify;\">Yet, even if one were to accept the criticism of Ibn Hibban, who weakened him for relating uncorroborated traditions, we find that the narration by Omar is corroborated by Ali, Ibn Omar, Sabra, and Salama. Thus, to treat this report as an uncorroborated tradition is unjust. <strong>Refer to the original <\/strong><strong><em>mutah<\/em><\/strong><strong> article for references.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The Silence of the Sahaba in Front of Omar<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Scholars of Ahl Al-Sunnah often argue that since none of the companions could bring evidences proving that <em>mutah<\/em> was made permissible after prohibition, it must mean that <em>mutah<\/em> must have stayed prohibited. The narration of Omar above, and his request for witnesses itself suggests that there wasn’t an opposition that could prove otherwise. All they could do was prove that <em>mutah<\/em> existed at one time, which is something all the companions agreed upon.<\/p>\n<p style=\"text-align: justify;\">Shias today attempt to cast doubts by suggesting that the companions of the Prophet – peace be upon him – only stayed quiet due to their fear of Omar. Little did they know that Omar was indeed open to being corrected in matters of jurisprudence, and has on several occasions accepted evidences provided by opponents.<\/p>\n<p style=\"text-align: justify;\">An example of this is the narration in Sunan Abi Dawud #2538 that the compensation that is paid for a dead man goes to the father’s side of his family, and that his wife gets no compensation. Omar held this opinion until Al-Dahhak bin Sufyan told him that the Prophet – peace be upon him – allowed the wife of Ashyam Al-Dhibabi to inherit him.<\/p>\n<p style=\"text-align: justify;\">Another is from Musanaf Abd Al-Razaq #17706 in which he used to say that the compensation for a finger that is cut off differs in price from the most useful to the least useful finger. He was then told that the Prophet – peace be upon him – wrote to the family of Hazm that all fingers receive the same compensation. Omar then changed his opinion.<\/p>\n<p style=\"text-align: justify;\">In other words, Omar was always someone who was open to being corrected, and has changed his opinion on several occasions when evidence has been brought to him. It is due to this that one must accept that the silence of the companions suggests that they were in agreement with Omar. More importantly, those that believed in the permissibility of <em>mutah<\/em> did not have clear evidences to prove that <em>mutah<\/em> was made permissible after the year of the conquest of Makkah.<\/p>\n<p style=\"text-align: justify;\">This leads to the question: Why did some companions still accept <em>mutah <\/em>as permissible? The answer to that question will be looked at in the following chapter.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In the original mutah article, we have provided several narrations that prove that mutah was prohibited by the Prophet – peace be upon him &#8211; during his time. However, there were claims made by some of the Prophet’s – peace <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/02\/16\/banning-mutah-time-omar\/\" title=\"The Banning of Mutah in the Time of Omar\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[18],"class_list":{"0":"post-1729","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh","8":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1729","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1729"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1729\/revisions"}],"predecessor-version":[{"id":4922,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1729\/revisions\/4922"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1729"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1729"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1729"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}