{"id":1732,"date":"2015-02-16T19:00:31","date_gmt":"2015-02-16T19:00:31","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1732"},"modified":"2018-10-30T14:53:23","modified_gmt":"2018-10-30T14:53:23","slug":"issues-ghaybah-part-13","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/02\/16\/issues-ghaybah-part-13\/","title":{"rendered":"Issues of Ghaybah [Part-13] &#8211; King Abdullah dies! But where’s the Imam?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1732\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<h3><\/h3>\n<h3 style=\"font-size: 20px; text-align: justify;\"><br \/>\nIt has been <span style=\"color: #ff0000;\"><span class=\"dhmscountup\" data-time=\"332949180\">3853 days 13 hours 53 minutes 0 second<\/span> <\/span>since King Abdullah of Saudi Arabia has been dead, and since the Shias have started waiting for the arrival of Imam Mahdi.<br \/>\n<\/h3>\n<p style=\"text-align: justify;\">Peace be upon our nation and prophet.<\/p>\n<p style=\"text-align: justify;\">In this article we will be discussing the Shia mythology (aka Hidden Imam), more specifically an event that shook Shiite society and sent them back into a state of confusion and &#8220;Hayrah&#8221; once again.<\/p>\n<p style=\"text-align: justify;\">Namely, this:<\/p>\n<blockquote><p>1. From the Messenger of Allah (pbuhaf): Hijaz (Saudi Arabia) will be ruled by a man whose name is the name of an animal(Fahad\/leopard), when you see him from a distance, you would think he has a lazy eye, and if you get close to him, you do not see anything (wrong) in his eyes. He will be succeeded by a brother of his, named Abdullah. Woe to our Shia (followers) from him! Woe to our Shia (followers) from him! Woe to our Shia (followers) from him! – he repeated it three times – Give me the good news of his death, and I shall give you the good news of the appearance of the hujjah (Imam Mahdi). Reference: Two Hundred and Fifty Signs, sign number 122<\/p>\n<p>2. From Abi Baseer who heard from Imam Sadiq (pbuhaf): Whoever guarantees for me the death of Abdullah, I will guarantee for him the Qa’im (Imam Mahdi). When Abdullah dies, then people will not gather\/agree on anyone after him, and this matter will not except for your companion (Imam Mahdi) inshallah, and the kingdom of years will be over, and it will become the kingdom of months and days. So I asked: Will that be prolonged? He said: No. (Biharul Anwar, Volume 52, page 21 &amp; Ghaybat-ul-Tusi)<\/p><\/blockquote>\n<p style=\"text-align: justify;\">These kinds of narrations above, are from the typical lies invented by Shia leaders to drug their followers and keep their hopes and expectations up as they await eternally for their so called hidden savior.<\/p>\n<p style=\"text-align: justify;\">As you all know, Shia expected the emergence of their 12th leader after the death of the Saudi king Abdullah. They all awaited in anticipation, some even saved up money for when their Imam comes so they may go and meet him.<\/p>\n<p style=\"text-align: justify;\">King Abdullah finally died in the 23rd of January 2015, which is the 3rd of the month of Rabi`-ul-Thani 1436 in the Hijri calendar.<\/p>\n<p style=\"text-align: justify;\">What happened was simple: The King died and no hidden Imam appeared as opposed to Shia mythology, also there was no chaos and the authority was handed to his brother Salman who now rules Saudi Arabia.<\/p>\n<p style=\"text-align: justify;\">Now we head to ShiaChat to check on the reactions of those folks, and give the readers a glimpse of the situation.<\/p>\n<p style=\"text-align: justify;\">In the thread called: &#8220;If King Abdullah Is Dead, Why Hasnt Al Qaim Come?&#8221; Started by Ya Mahdi1999 , Feb 09 2015 03:27 AM.<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;Ya Mahdi1999&#8221; says: [[It has been over 2 weeks since King Abdullah died, why hasnt our beloved Imam arrived yet?????]]<\/p>\n<p style=\"text-align: justify;\">Of course this guy is disappointed, he should raise a complaint to his master Husayn (ra) and see maybe he can intercede and get the hidden guy to come out.<\/p>\n<p style=\"text-align: justify;\">Shia moderator &#8220;hameedeh&#8221; says: [[Imam Mahdi AJ would come in the month of Rajab? ]]<\/p>\n<p style=\"text-align: justify;\">That sounds good, so now we&#8217;re in the Arabian month of Rabi`-ul-Thani, after it is Jumadah al-Awwal and Jumadah al-Thani, then comes Rajab. Two more months until this Shia lady discovers that there is no 12th Imam nor will he ever appear (And we will remind eachother).<\/p>\n<p style=\"text-align: justify;\">Apparently this silly comment above restored the faith of our Shi`ee brother &#8220;Ya Mahdi1999&#8221;, he replies by saying: [[Indeed, thanks for your answer, it has restored once again the patience in awaiting our saviour]]<\/p>\n<p style=\"text-align: justify;\">Indeed Shi`ee faith is easily restored, no wonder their scholars control them like cattle.<\/p>\n<p style=\"text-align: justify;\">Shia moderator &#8220;hameedeh&#8221; then corrects her previous information and says: [[I think it was the Sufiyani that will come in Rajab, not Imam Mahdi AJ. We need a timeline and check things off the list. ]]<\/p>\n<p style=\"text-align: justify;\">Oh-oH! I guess the guy whose faith was restored above is going to find some other post on this thread to restore his faith. Secondly, how can you guys confuse your 12th Imam with the Sufiyani? Seriously? I&#8217;ll tell you what though, neither of the two will appear in Rajab as both the 12th Imam and the Sufiyani are fabricated personalities, both invented due to political\/tribal reasons.<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;FisherKing&#8221; says: [[LOL it hasn&#8217;t even been a month. Sabr.]]<\/p>\n<p style=\"text-align: justify;\">That is very wise, he&#8217;s right we shouldn&#8217;t rush the &#8216;man&#8217;, we must have Sabr and patience as it takes him time to prepare himself, as if the past 1,200 years weren&#8217;t enough for him to prepare.<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;Darth Vader&#8221; says: [[it hasn&#8217;t even been a month. I would hold my horses until 2016 or 2017 and above all that I would try to prepare through this time to secure my family]]<\/p>\n<p style=\"text-align: justify;\">What happened to the Rajab theory? Suddenly you push him back to 2016, 2017? It&#8217;s as if you guys don&#8217;t even want him to appear, how dare you delay his appearance for two years when finally after all this wait, a king called `Abdullah dies! That is surely a sign of Nasibism.<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;sayedamir2000&#8221; says: [[If you read carefully second hadith you have brought and especially the part that I have highlighted in the hadith, it clearly indicates that we have to wait at least for months and days.]]<\/p>\n<p style=\"text-align: justify;\">Months and days you say?<\/p>\n<p style=\"text-align: justify;\">Shia administrator &#8220;repenter&#8221; says: [[The concept of Imam Mahdi is the same as The holy Kabaa. The Kabaa doesn&#8217;t come to you, you go to the Kabaa, the same way you have to go too Imam Mahdi, not the other way around. ]]<\/p>\n<p style=\"text-align: justify;\">Then he said: [[We aren&#8217;t waiting for him, he is waiting for us. See the difference? This whole concept of us &#8220;waiting&#8221; is misunderstood and it is unfortunate. It&#8217;s he who is waiting, not us. ]]<\/p>\n<p style=\"text-align: justify;\">In other words, their administrator nuked the entire theory of waiting that his sect relied upon for hundreds of years. Instead he claims this was all a &#8220;test&#8221; and this is something we refuted in one of our previous &#8220;Issues of Ghaybah&#8221; articles. It contradicts the mission of the 12th Imam, whose existence is a grace from Allah since he guides his slaves. How then can you guys claim that Allah withheld his grace from us, and removed his infallible guide from among us, then He expects us to increase in faith and piety so that He may make him appear again!? In that case wait for a couple of more thousand years.<\/p>\n<p style=\"text-align: justify;\">Another Shia member called &#8220;Chair Pundit&#8221; replies to the above: [[That doesn&#8217;t make any logical sense. The true Muslims are praying and engaging in positive actions. Thus, the Imam ought to have appeared some time ago. The &#8220;us&#8221; you refer to is specifically authentic Muslims. Why would the Imam be waiting for those who aren&#8217;t true Muslims? Wouldn&#8217;t that just constitute a weak excuse for refusing to reappear? This is utter nonsense.]]<\/p>\n<p style=\"text-align: justify;\">The admin of ShiaChat replies back: [[It requires a certain amount of intelligence, reading comprehension and politeness to understand it. To fools, everything sounds like utter nonsense. Care to try again while there is a little amount of dignity left in you?]]<\/p>\n<p style=\"text-align: justify;\">Wow, what fraternity and unity among the followers of &#8220;Ahlul-Bayt&#8221;, especially when they disagree on the fundamental matter that sets them apart from the rest of the nation (ie Imamah).<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;Ibn Al-Shahid&#8221; says: [[There will be a period where anyone who rules Saudi will rule it for a few months and die. That has yet to happen.]]<\/p>\n<p style=\"text-align: justify;\">Now who fabricated this one? Which Imam was it that made a prophecy about the political situation in &#8220;Saudi&#8221; when there was no such thing as &#8220;Saudi&#8221; back in the days of the Imam?<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;MajiC&#8221; says: [[Even so, and as Sheikh Ali Korani has recently expressed in his opinion, if the new king Salman lasts longer than &#8220;months&#8221; i.e. a year or longer then the recent events may not be associated with this hadith. In any case, combining this with the recent Yemeni revolution from which the promised Yamani will soon emerge inshaAllah, ongoing events in Sham and a myriad of other indicators, explicit and more subtle, we really should be expecting the good news in all seriousness. When that will be is in God&#8217;s knowledge alone, but inshaAllah we shall be the generation to witness it.]]<\/p>\n<p style=\"text-align: justify;\">Ah, the good news is certainly everywhere these days, you can&#8217;t open your TV without seeing a lot of good news all over the middle-east, right? As for their scholar `Ali Kourani, he just makes up odd theories then when they fail and he&#8217;s exposed, his reaction is like &#8220;Meh, if it didn&#8217;t happen then it didn&#8217;t happen.&#8221; As easy as pie ain&#8217;t it? Promise the people something, raise their hopes, then say &#8220;Meh, maybe not..&#8221;<\/p>\n<p style=\"text-align: justify;\">Shia member &#8220;SlaveOfAllah14&#8221; says: [[I am afraid this may turn to be like the 2012 hoax, after which those who had put too much hope will get dissapointed. ]]<\/p>\n<p style=\"text-align: justify;\">What he doesn&#8217;t know, or rather refuses to accept, is that this guy never existed in the first place, his entire existence is a hoax and a rumor spread by scum who sought wealth and authority. As the reader can see, this kind of thing often happens in the Shia world, every couple of years there&#8217;s a new random prophecy which is debunked by Time.<\/p>\n<p style=\"text-align: justify;\">Other Shia members resorted to poetry and wisdom, such as &#8220;peace seeker II&#8221; who said: [[It&#8217;s good to hope .. Even if one gets disappointed, hope returns<br \/>\nHope does not mislead .. Hope in the rise of justice is akin to faith ]]<\/p>\n<p style=\"text-align: justify;\">That is rather depressing, what a sad sect.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series Peace be upon our nation and prophet. In this article we will be discussing the Shia mythology (aka Hidden Imam), more specifically an event that shook Shiite society and sent them <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/02\/16\/issues-ghaybah-part-13\/\" title=\"Issues of Ghaybah [Part-13] &#8211; King Abdullah dies! But where’s the Imam?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-1732","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1732","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1732"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1732\/revisions"}],"predecessor-version":[{"id":4436,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1732\/revisions\/4436"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1732"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1732"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1732"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}