{"id":1746,"date":"2015-02-19T08:10:08","date_gmt":"2015-02-19T08:10:08","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1746"},"modified":"2015-02-19T17:24:03","modified_gmt":"2015-02-19T17:24:03","slug":"companions-believed-mutah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/02\/19\/companions-believed-mutah\/","title":{"rendered":"The Companions that Believed in Mutah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1746\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">After establishing in the original article that it is forbidden to practice <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\"><em>mutah<\/em><\/a> and that the prohibition was related by several companions, we will move on to studying the opinions of other companions, for our opponents argue that a large portion of the companions did not believe in the prohibition of <em>mutah<\/em>.<\/p>\n<p style=\"text-align: justify;\">The positions that will be studied include that of Ibn Abbas, Jabir bin Abdullah, Ali bin Abi Talib, Omar bin Al-Khattab, Abdullah bin Omar, Abdullah bin Mas’ud, Imran bin Husain, Asma’ bint Abi Bakr, Abu Sa’eed Al-Khudri, Mu’awiyah, Samura bin Jundub, Imran bin Sawadah, Salama bin Al-Akwa’, Zaid bin Thabit, Amr bin Huraith, Salama bin Umayyah, and Rabi’a bin Umayyah.<\/p>\n<p style=\"text-align: justify;\">As readers will notice, a few of the names above have narrated narrations in prohibition of <em>mutah<\/em>. However, opponents clutch at straws whenever they can in order to strengthen their arguments. We shall together study these opinions.<\/p>\n<p style=\"text-align: justify;\"><strong>General Answer<\/strong><\/p>\n<p style=\"text-align: justify;\">The actions of companions are not binding evidence for the legality of these actions, especially with the existence of clear cut prophetic-narrations in prohibition.<\/p>\n<p style=\"text-align: justify;\">In this case, if a companion were to practice <em>mutah<\/em>, it does not mean that <em>mutah<\/em> is permissible. Similarly, the companions that practiced adultery or consuming intoxicants never believed in the permissibility of these actions.<\/p>\n<p style=\"text-align: justify;\">As for those that clearly stated that <em>mutah<\/em> is permissible, then their opinions are trounced by the opinions of those who spoke of prohibition, since their evidence lies in authentic prophetic traditions. Those that preached the permissibility of <em>mutah<\/em> were not able to attribute it to the Prophet – peace be upon him – except by saying that it was practiced at his time.<\/p>\n<p style=\"text-align: justify;\">It goes without saying that this is not sufficient evidence, since some people were consuming intoxicant and engaging in adultery at the time as well. It holds nowhere close to as much weight as the clear evidences for the prohibition of <em>mutah<\/em>.<\/p>\n<p style=\"text-align: justify;\"><strong>Specific Answers<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>1- Ibn Abbas<\/strong><\/p>\n<p style=\"text-align: justify;\">Perhaps the strongest advocate for <em>mutah<\/em> amongst the companions was Ibn Abbas. The narrations in which Ibn Abbas has narrated for the permissibility are usually general. However, it is important to recognize that Ibn Abbas’ ruling does not suggest the permissibility of <em>mutah<\/em> in all situations.<\/p>\n<p style=\"text-align: justify;\">In Sunan al-Bayhaqi al-Kubra 7\/204, we find that Abu Jamra narrated:<\/p>\n<p style=\"text-align: justify;\">Ibn Abbas was asked about <em>mutah<\/em>, so he said it was permissible. A servant of his said, “That is during a time of war when there are not a lot of women and situations like that?” Ibn Abbas said, “Yes.”<\/p>\n<p style=\"text-align: justify;\">The opinion of Ibn Abbas here is that <em>mutah<\/em> is only to be performed in situations that are similar to the situations in which <em>mutah<\/em> was first made permissible. The situation mentioned above is similar to that which Ibn Mas’ud described in Saheeh Muslim #3396:<\/p>\n<p style=\"text-align: justify;\">We were on a military expedition with the Messenger of Allah – peace be upon him -, without any women. So we said, “Shall we castrate ourselves?” He forbade us from doing so, then permitted us to get married for a stipulated time, at the price of a garment.<\/p>\n<p style=\"text-align: justify;\">The reasoning of Ibn Abbas is a mystery. One can only speculate as to why he stuck to his opinion when the majority of the companions sided with the clear evidences for the prohibition of <em>mutah<\/em>. Perhaps the most reasonable possibility is that Ibn Abbas accepted that the Prophet – peace be upon him – prohibited <em>mutah<\/em>, but since he permitted it more than once it meant that it can be permitted during dire conditions. Of course, this <em>ijtihad<\/em> has no weight since the text from the Prophet – peace be upon him – is clear, and the text always takes precedence over <em>ijtihad<\/em>.<\/p>\n<p style=\"text-align: justify;\"><strong>2- Jabir bin Abdullah <\/strong><\/p>\n<p style=\"text-align: justify;\">Jabir is perhaps the second companion who is most often cited as to have gone against the prohibition of <em>mutah<\/em>. In Saheeh Muslim #2498, Abu Nadhra said:<\/p>\n<p style=\"text-align: justify;\">I was at Jabir bin Abdullah&#8217;s when a man came saying, “Ibn Abbas and Ibn Al-Zubair different when it came to the two (types of) <em>mutah<\/em>,” Jabir said, “We performed them with the Messenger of Allah – peace be upon him – then Omar prohibited us from them, and we never returned to them.”<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar in Fath Al-Bari comments that the last statement by Jabir suggests that he sided with the consensus, which is that <em>mutah<\/em> is prohibited, for if it was permissible, then he would have taught the permissibility of it after the death of Omar.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar is correct for Jabir lived for another five decades after Omar and never returned to what was supposedly permissible, nor was he known to having preached the permissibility of <em>mutah<\/em>. This is evidence that he accepted the prohibition of Omar, since the prohibition of Omar has supporting evidence from the traditions of the Prophet – peace be upon him – as we have proven in a <a title=\"The Banning of Mutah in the Time of Omar\" href=\"http:\/\/twelvershia.net\/2015\/02\/16\/banning-mutah-time-omar\/\" rel=\"external nofollow\">previous article<\/a>.<\/p>\n<p style=\"text-align: justify;\"><strong>3- Ali bin Abi Talib<\/strong><\/p>\n<p style=\"text-align: justify;\">One narration is provided in order to prove that Ali believed in the permissibility of <em>mutah<\/em> and it is the narration of Al-Hakam bin Abi Utaibah (Tafseer Al-Tabari #9042). Al-Hakam, however, was born after the death of Ali according to several scholars. See his biography in Tahtheeb Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">Furthermore, the narration that Al-Hakam attributes to Ali is identical to the authentic narration to Ibn Abbas, in Musanaf Abd Al-Razaq #14021, through an authentic chain, where he says:<\/p>\n<p style=\"text-align: justify;\">&#8220;If it were not for his prohibition (Omar), then only a vile person would perform adultery.&#8221;<\/p>\n<p style=\"text-align: justify;\">It is obvious to the objective reader that Al-Hakam made a mistake in attributing this narration to Ali, who opposed <em>mutah<\/em>, instead of Ibn Abbas.<\/p>\n<p style=\"text-align: justify;\"><strong>4- Omar bin Al-Khattab<\/strong><\/p>\n<p style=\"text-align: justify;\">In Tareekh Al-Madinah #1190, by Ibn Shibbah, we find a narration in which Omar suggests that he used to practice <em>mutah<\/em> and that it was his <em>ijtihad<\/em> that causes him to reject <em>mutah<\/em>. However, this narration is weak due to it being narrated solely by Zam’a bin Salih. This narration also goes against the authentic narration that Omar rejected <em>mutah<\/em> because of the Prophet&#8217;s narration and asked for witnesses with evidence that it was permitted after its prohibition.<\/p>\n<p style=\"text-align: justify;\"><strong>5- Abdullah bin Omar<\/strong><\/p>\n<p style=\"text-align: justify;\">Ibn Omar is mentioned to have made <em>mutah<\/em> permissible. Authors of a Shia website provide Sunan Al-Tirmithi #832. However, the narration clearly states that Ibn Omar was referring to the <em>mutah<\/em> of the pilgrimage, so this has nothing to do with <em>mutah<\/em> marriages. It was narrated from Ibn Omar that he rejected temporary marriage and described as an act of indecency.<\/p>\n<p style=\"text-align: justify;\"><strong>6- Abdullah bin Mas’ud<\/strong><\/p>\n<p style=\"text-align: justify;\">Ibn Masu’d narrated (Muslim #3396): We were on a expedition with the Messenger of Allah – peace be upon him -, without any women. So we said, “Shall we castrate ourselves?” He forbade us from doing so, then permitted us to get married for a stipulated time, at the price of a garment. Then, Abdullah recited, “Do not prohibit the good things which Allah has made lawful to you and do not transgress. Indeed, Allah does not like transgressors.”<\/p>\n<p style=\"text-align: justify;\">[Al-Ma’idah: 87]<\/p>\n<p style=\"text-align: justify;\">Some scholars commented that Ibn Mas’ud’s recitation of the verse suggests that people transgressed by making <em>mutah<\/em> forbidden.<\/p>\n<p style=\"text-align: justify;\">However, Ibn Al-Qayyim in Zad Al-Ma’aad (p. 405) provides another possible interpretation. He said:<\/p>\n<p style=\"text-align: justify;\">He wanted to use this verse in order to respond to those that say it is completely permissible and that he is a transgressor since the Messenger of Allah – peace be upon him – only allowed it out of necessity and need, during military expeditions, without there being women, and with extreme need for women. So, whoever legalized it in towns, which have an abundance of women and the ability for one to get married, is a transgressor, and Allah does not like transgressors.<\/p>\n<p style=\"text-align: justify;\">It seems that this explanation is more likely. This is because in the Mustakhraj of Abi Awana of Saheeh Muslim (#3319), there is an addition, at the end of this Hadith where Ibn Mas&#8217;ud says: &#8220;Then it (<em>mut’ah)<\/em> was forbidden.&#8221; Ibn Hajar, in Al-Fath, when quoting Al-Isma’eeli in the explanation of hadith #4686 in Al-Bukhari adds that similar additions have been narrated from Ibn Uyayna and Ma’mar.<\/p>\n<p style=\"text-align: justify;\"><strong>7- Imran bin Husain<\/strong><\/p>\n<p style=\"text-align: justify;\">A narration that is often used to support the attribution of this view to Imran bin Husain is the narration of Al-Bukhari #4156 where he says that the verse of <em>mutah<\/em> was revealed in the book of Allah and it was practiced by him with the Messenger of Allah – peace be upon him -, and that nothing forbidding it was revealed until his death, but then a man banned it.<\/p>\n<p style=\"text-align: justify;\">The narration can be found in the chapter of the pilgrimage, which leads us to believe that this is not about the <em>mutah<\/em> marriage, but the <em>mutah <\/em>of the pilgrimage.<\/p>\n<p style=\"text-align: justify;\">This is supported by a hadith in Saheeh Muslim #2158 that states that this is the <em>mutah<\/em> of the pilgrimage.<\/p>\n<p style=\"text-align: justify;\">Thus, the burden of proof lies upon opponents to prove that this is about <em>mutah <\/em>marriages.<\/p>\n<p style=\"text-align: justify;\">As for the verse that Imran bin Husain is talking about, then it is verse 196 from Surat Al-Baqara.<\/p>\n<p style=\"text-align: justify;\"><strong>8- Asma’ bint Abi Bakr<\/strong><\/p>\n<p style=\"text-align: justify;\">Asma’s words regarding <em>mutah<\/em> has been explained in details in an old article. <a title=\"Response to: Asma bint Abu Bakar did Mutah\" href=\"http:\/\/twelvershia.net\/2014\/03\/15\/response-to-asma-bint-abu-bakar-did-mutah\/\" rel=\"external nofollow\">See here<\/a>.<\/p>\n<p style=\"text-align: justify;\">The clear conclusion is that Asma&#8217; never had temporary marriage and this was mistakenly attributed to her, rather her narrations are regarding the Mutah of Hajj.<\/p>\n<p style=\"text-align: justify;\"><strong>9- Abu Sa’eed Al-Khudri<\/strong><\/p>\n<p style=\"text-align: justify;\">The narration in which Abu Sa’eed Al-Khudri talks about <em>mutah<\/em> is in Musanaf Abd Al-Razzaq #14022. Ata’a says, “It was told to me by whomever you wish that Abu Sa’eed Al-Khudri said…” The narration describes that <em>saweeq<\/em> was used as a <em>mahr<\/em>.<\/p>\n<p style=\"text-align: justify;\">The narration by Abi Sa’eed simply describes the details of <em>mahr<\/em> back in the time when <em>mutah<\/em> was permissible, and there is no issue with this. It does not suggest that he believed that <em>mutah<\/em> was prohibited by Omar, nor that it was left as permissible by the Prophet – peace be upon him.<\/p>\n<p style=\"text-align: justify;\">Furthermore, the hadith is weak since Ata’a does not mention who his teacher is.<\/p>\n<p style=\"text-align: justify;\"><strong>10- Mu’awiyah<\/strong><\/p>\n<p style=\"text-align: justify;\">The narration of Abd Al-Razaq in his Musanaf #14026 suggests that Mu’awiyah performed <em>mutah<\/em> during the time of the Prophet – peace be upon him. Like Jabir, Amr bin Huraith, and others, it seems that he was not aware that <em>mutah<\/em> was prohibited by the Prophet – peace be upon him. The personal actions of a companion of the Prophet – peace be upon him – cannot be used to legalize an act if there is clear evidence of prohibition.<\/p>\n<p style=\"text-align: justify;\"><strong>11- Samura bin Jundub<\/strong><\/p>\n<p style=\"text-align: justify;\">No such narration can be found attributed to Samura bin Jundub. However, those that have included Samura in this list did so because Ibn Hajar said in the biography of a companion named Sameer, “This may be Samura bin Jundub.”<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar goes on to quote Ibn Mandah in Al-Isaba 1\/771 which says that, “We used to perform <em>mutah<\/em> at the time of the Messenger of Allah – peace be upon him.&#8221;<\/p>\n<p style=\"text-align: justify;\">Even though there is nothing problematic about this, since there is an agreement that the companions used to practice <em>mutah<\/em> back then. However, it seems that Ibn Hajar or a scribe who wrote Al-Isaba made a mistake, since all other sources say, “We used to narrate hadiths during the time of the Messenger of Allah – peace be upon him.” See Usd Al-Ghaba 2\/344, Al-Jami’ lama fil Musanafat Al-Jawami’ 3\/90, and Ma’rifat Al-Sahaba by Abu Nu’aym 2\/1442.<\/p>\n<p style=\"text-align: justify;\">The word يتمتع <em>yatamata’<\/em> (to perform <em>mutah) <\/em>is similar in its characters to يستمع <em>yastami’ <\/em>(to hear), so such a mistake does happen from time to time.<\/p>\n<p style=\"text-align: justify;\"><strong>12- Imran bin Sawadah<\/strong><\/p>\n<p style=\"text-align: justify;\">A narration in Tareekh Al-Tabari 2\/749 says that Imran bin Sawadah debated Omar on the permissibility of <em>mutah<\/em>. Omar simply responds that the conditions during the time of the Prophet – peace be upon him – required <em>mutah<\/em>, but they don’t require it anymore.<\/p>\n<p style=\"text-align: justify;\">The narration comes through the path of Eisa bin Yazeed bin Da’b. He is considered to be <em>munkar<\/em> al-hadith and a liar. See his biography in Lisan Al-Mizan. Therefore, this narration is rejected and cannot be used as evidence that Imran bin Sawadah believed in the permissibility of <em>mutah.<\/em><\/p>\n<p style=\"text-align: justify;\"><em> <\/em><\/p>\n<p style=\"text-align: justify;\"><strong>13- Salama bin Al-Akwa’ <\/strong><\/p>\n<p style=\"text-align: justify;\">It is narrated in Musnad Al-Royani #1170 that Salama bin Al-Akwa’ stated that there is no evidence for the prohibition of <em>mutah<\/em> from the Qur’an or the traditions of the Prophet – peace be upon him.<\/p>\n<p style=\"text-align: justify;\">However, the narration is weak since it comes from the path of Harun bin Abi Eisa.<\/p>\n<p style=\"text-align: justify;\">Al-Uqaili criticized him in his book of weak narrators for narrating traditions that are not corroborated.<\/p>\n<p style=\"text-align: justify;\">More importantly, Salama bin Al-Akwa’s narration of the prohibition of <em>mutah<\/em> was related by Muslim as we’ve pointed out in our original article on evidences for the <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\">prohibition of <em>mutah<\/em><\/a>.<\/p>\n<p style=\"text-align: justify;\"><strong>14- Zaid bin Thabit<\/strong><\/p>\n<p style=\"text-align: justify;\">There are no narrations that suggest that Zaid bin Thabit believed in the permissibility of <em>mutah<\/em>. Though, a shortlist of five companions was compiled by the third century historian Mohammad bin Habeeb Al-Baghdadi that include Zaid.<\/p>\n<p style=\"text-align: justify;\">Mohammad bin Habeeb included this shortlist on p. 289 of his Al-Muhabbar, but did not provide any proof that this was Zaid’s opinion. It is, therefore, rejected.<\/p>\n<p style=\"text-align: justify;\"><strong>15- Amr bin Huraith<\/strong><\/p>\n<p style=\"text-align: justify;\">In Musanaf Abd Al-Razaq #14021 we find a narration that explicitly states that Amr bin Huraith practiced <em>mutah<\/em> during the time of Omar. Like Jabir bin Abdullah, Amr bin Huraith was unaware that <em>mutah<\/em> was made forbidden during the time of the Prophet – peace be upon him.<\/p>\n<p style=\"text-align: justify;\">Amr continued to live on for another six decades after the death of Omar, and it was not known that he ever practiced <em>mutah<\/em> or spoke of the permissibility of <em>mutah<\/em> after the death of Omar.<\/p>\n<p style=\"text-align: justify;\"><strong>16- Rabee’a bin Umayyah<\/strong><\/p>\n<p style=\"text-align: justify;\">In Muwatta Malik #995, we find Khawla bint Hakeem accusing Rabee’a bin Umayyah bin Khalaf for <em>mutah<\/em> during the time of Omar.<\/p>\n<p style=\"text-align: justify;\">Ironically, Rabee’a was also known for drinking alcohol. He eventually leaves Islam and becomes a Christian. See his biography in Al-Isaba by Ibn Hajar 1\/607.<\/p>\n<p style=\"text-align: justify;\">Perhaps opponents will one day argue that drinking alcohol is permissible as well since this was an act practiced by Rabee’a.<\/p>\n<p style=\"text-align: justify;\">It is needless to say that the actions of a man who eventually leaves Islam cannot be used as binding evidence against Muslims.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>17- Salama bin Umayyah<\/strong><\/p>\n<p style=\"text-align: justify;\">The inclusion of Salama bin Umayyah as one of those that practiced <em>mutah<\/em> during the time of Omar can be found in Musanaf Abd Al-Razzaq #14024.<\/p>\n<p style=\"text-align: justify;\">The most obvious excuse that can be given is that he was not aware that it was prohibited. There is also another possibility, which is that he was included in this narration accidentally since his story is very similar to the story of Amr bin Huraith. Though, do note that the chain is weak. See Tareekh Al-Madinah #1193.<\/p>\n<hr \/>\n<p style=\"text-align: justify;\">This is as far as the evidence the opponents use for the permissibility of Mutah, as the reader can see their evidence is very weak and problematic as opposed to the clear authentic narrations by several companions that declare its prohibition from the Hadith of Rasul-Allah (saw).<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>After establishing in the original article that it is forbidden to practice mutah and that the prohibition was related by several companions, we will move on to studying the opinions of other companions, for our opponents argue that a large <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/02\/19\/companions-believed-mutah\/\" title=\"The Companions that Believed in Mutah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-1746","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1746","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1746"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1746\/revisions"}],"predecessor-version":[{"id":1748,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1746\/revisions\/1748"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1746"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1746"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1746"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}