{"id":1763,"date":"2015-02-23T07:37:00","date_gmt":"2015-02-23T07:37:00","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1763"},"modified":"2015-05-14T07:19:50","modified_gmt":"2015-05-14T07:19:50","slug":"mutah-in-the-eyes-of-ahl-al-bayt-in-twelver-shia-traditions","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/02\/23\/mutah-in-the-eyes-of-ahl-al-bayt-in-twelver-shia-traditions\/","title":{"rendered":"Mutah in the Eyes of Ahl Al-Bayt in Twelver Shia Traditions"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1763\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Unlike the previous articles that focused on everything Ahl Al-Sunnah, this article focuses on <em>mutah<\/em> from a Shia perspective. Even though Shias continuously point out the “contradictions” in the time of the prohibition of <em>mutah, <\/em>as found in Sunni books (which has been dealt with in our original article on <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\"><em>mutah<\/em><\/a>), they are completely unaware of the contradictions that are reported by Ahl Al-Bayt themselves when it comes to matters that revolve around <em>mutah<\/em>. In this delightful chapter, we take a look at these contradictions.<\/p>\n<p style=\"text-align: justify;\"><strong><em>Mutah<\/em><\/strong><strong> in Shia Hadiths: Permissible or Prohibited?<\/strong><\/p>\n<p style=\"text-align: justify;\">Even though there are tons of narrations that suggest the permissibility of <em>mutah<\/em> in Shia books, we find an authentic narration that is clear about its prohibition.<\/p>\n<p style=\"text-align: justify;\">We find in Al-Istibsar by Al-Tusi (p. 689) from Mohammad bin Ahmad bin Yahya from Abi Al-Jawza’a from Al-Hussain bin Ulwan from Amr bin Khalid from Zaid bin Ali from his fathers from Ali – peace be upon him – that he said: The Messenger of Allah – peace be upon him – forbade the meat of the domestic donkey and <em>mutah<\/em> marriages.<\/p>\n<p style=\"text-align: justify;\">All the narrators in this hadith are reliable even though some contemporary Shias have attempted to weaken this hadith by criticizing two narrators.<\/p>\n<p style=\"text-align: justify;\">The first to be criticized was Al-Hussain bin Ulwan. Al-Najashi (p. 52) said: “Al-Hussain bin Ulwan Al-Kalbi, their servant, from Kufa, <em>aami<\/em> (Sunni), and his brother is Al-Hasan, named Abu Mohammad, reliable.”<\/p>\n<p style=\"text-align: justify;\">Shias disagreed amongst themselves as to who Al-Najashi is referring to here as: Reliable.<\/p>\n<p style=\"text-align: justify;\">Those that want to weaken this hadith will argue that it is his brother that is reliable, while those that are objective know that it is Al-Hussain himself, for Al-Najashi’s biography is from Al-Hussain and not Al-Hassan. This is the opinion of Ayatullah Al-Khoei.<\/p>\n<p style=\"text-align: justify;\">The second argument is that Amr bin Khalid is not an Imami. However, upon further inspection, we find that he is a Zaidi. See Al-Kashshi (p. 169). The same page also includes a quote from Ibn Fadhal that he is trustworthy. This is sufficient for some major scholars like Al-Khoei to regard Amr bin Khalid as reliable. (See his Mu’jam) However, some contemporaries would rather see Shia hadith sciences burn to a crisp than to stick to see this hadith being considered authentic, so they argued that Al-Kashshi’s quote from Ibn Fadhal is disconnected. In response, we say that Al-Kashshi and other scholars of <em>rijal<\/em> were not ignorant of the opinions of other earlier <em>rijalis<\/em>, and these experts are reliable when attributing statements to earlier <em>rijalis<\/em>. If this was not the case, then one could next say that the <em>rijalis<\/em> themselves are disconnected from the narrators, and therefore, all opinions of <em>rijali<\/em> scholars should be rejected. This is why real scholars like Al-Khoei would never make absurd claims like this.<\/p>\n<p style=\"text-align: justify;\">Al-Tusi, in Al-Istibsar, when commenting on this hadith stated that, “This hadith is to be taken as <em>taqiyya<\/em>.”<\/p>\n<p style=\"text-align: justify;\">In response, we say that there is no reason for <em><a href=\"http:\/\/twelvershia.net\/2014\/05\/29\/taqiyya-the-other-face\/\" rel=\"external nofollow\">taqiyya<\/a><\/em> in this situation since scholars from Makkah, like Ibn Abbas, his students from Makkah, and even later <em>muftis<\/em> like Ibn Juraij, all accepted the permissibility of <em>mutah<\/em>. In other words, their life was not in danger for holding this belief, even though we have proven in previous chapters that they were incorrect in their opinion. More importantly, it is authentically proven in both Sunni and Shia sources that Ali taught that <em>mutah<\/em> is not permissible, and it is binding upon anyone who wishes to follow Ali to accept this consensus.<\/p>\n<p style=\"text-align: justify;\">We also find in Al-Kafi 5\/1095 from Mohammad bin Yahya from Ahmad bin Mohammad from Mu’amar bin Khallad that he said: I asked Abu Al-Hasan Al-Redha – peace be upon him – about a man getting married to a women in <em>mutah<\/em> and taking her from country to another country? He said: The other type of marriage is permissible, and this type of marriage isn’t.<\/p>\n<p style=\"text-align: justify;\"><strong>Limit of <em>Mutah<\/em> Wives<\/strong><\/p>\n<p style=\"text-align: justify;\">In Al-Istibsar (p. 693), Al-Tusi narrates from Mohammad bin Ya’qoub from Al-Hussain bin Mohammad from Ahmad bin Is’haaq Al-Ash’ari from Bakr bin Mohammad Al-Azdi that he said:<\/p>\n<p style=\"text-align: justify;\">I asked Al-Redha – peace be upon him – about <em>mutah<\/em>, and if it is included within the (limit of) four. He said: No.<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi grades this hadith as authentic in Malath Al-Akhyar.<\/p>\n<p style=\"text-align: justify;\">In Al-Kafi 5\/1084 we find a similar narration from Ali bin Ibrahim from his father from Ibn Abi Umair from Omar bin Uthaina from Abi Abdullah – peace be upon him – that he was asked how many <em>mutah<\/em> (wives) can one have? He said: They are like slave girls.<\/p>\n<p style=\"text-align: justify;\">However, in Al-Istibsar (p. 693), from the path of Ibn Abi Nasr that he asked Al-Redha:<\/p>\n<p style=\"text-align: justify;\">I asked him about a man that is married to a woman and if it is possible to marry her sister as <em>mutah<\/em>. He said: No. I said: Zurarah narrates from Abi Ja’afar – peace be upon him – that they (<em>mutah<\/em> wives) are like slave girls and one can marry as much as one likes. He said: No, they are from the four.<\/p>\n<p style=\"text-align: justify;\">Al-Tusi also narrates from Mohammad bin Hasan Al-Saffar from Mu’awiyah bin Hakeem from Ali bin Al-Hasan bin Ribat from Abdullah bin Muskan from Ammar Al-Sabati from Abi Abdullah (that he was asked) about <em>mutah<\/em>, so he said: They are from the four.<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi grades these two narrations as authentic as well.<\/p>\n<p style=\"text-align: justify;\">So, we ask Shias:<\/p>\n<p style=\"text-align: justify;\">How is it possible for the infallible Imams to legislate that one can marry an unlimited number of <em>mutah<\/em> women, then state that they are one of the four?<\/p>\n<p style=\"text-align: justify;\"><strong>Thoughts on Contradictions<\/strong><\/p>\n<p style=\"text-align: justify;\">As we can see from the above two examples, clear contradictions exist when it comes to matters that revolve around <em>mutah<\/em>.<\/p>\n<p style=\"text-align: justify;\">These contradictions are dangerous because they revolve around the very essence of <em>mutah<\/em> as well as the practical implementations. Unlike the so-called Sunni “contradiction” that we have dealt with in our <a title=\"The Prohibition of Mutah Marriages\" href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\">original article<\/a>, these contradictions create real doubt as to what was really attributed to the Shia “infallibles”.<\/p>\n<p style=\"text-align: justify;\">Is it not hypocritical for Shias to reject all the narrations that prohibit <em>mutah<\/em> in Sunni hadiths due to “contradictions” about the time of revelation, when Shias themselves have direct contradictions that revolve around practical implementation that cannot be reconciled?!<\/p>\n<p style=\"text-align: justify;\">We strongly hold the view that these &#8220;authentic contradictions&#8221; have only occurred in the Shia hadith library due to the weakness of the methodology of Shia hadith scholars. It is only reasonable to accept what Sunnis have attributed to Ali and not what Shias have attributed to him, for the simple reason that the stringent conditions that Sunnis have placed upon themselves when it comes to accepting hadith. For more on this subject, refer to our series on <a title=\"Shia Hadith VS Sunni Hadith\" href=\"http:\/\/twelvershia.net\/2014\/06\/02\/shia-hadith-vs-sunni-hadith\/\" rel=\"external nofollow\">Sunni vs Shia hadith sciences.<\/a><\/p>\n<p style=\"text-align: justify;\"><strong>Fabricated Merits of <em>Mutah<\/em> in Shia Hadiths<\/strong><\/p>\n<p style=\"text-align: justify;\">Perhaps the most despicable aspect of this whole conundrum is the narrations that have been reported from the Imams about the merits of <em>mutah<\/em>.<\/p>\n<p style=\"text-align: justify;\">In Man La Yahtharhu Al-Faqeeh (p. 719) by Al-Saduq, we find him quoting Ja’afar Al-Sadiq saying, “Those that do not believe in our return nor see <em>mutah<\/em> as permissible are not from us.”<\/p>\n<p style=\"text-align: justify;\">He also narrates (p. 722) from Salih bin Uqbah from his father from Abi Ja’afar – peace be upon him – that he said: I asked him: Does the person performing <em>mutah<\/em> get rewards (from Allah)? He said: If he did it for the sake of Allah and to oppose those that reject it, then he will not speak to her without Allah – praise be to him – writing for him a good deed, nor will he reach his hand towards her without Allah writing for him a good deed, and if he got close to her Allah would forgive a sin, and if he bathed, then Allah would forgive him for every hair that water has touched. I asked: Every hair? He said: Yes, every hair.<\/p>\n<p style=\"text-align: justify;\">He also narrates (p. 722) that Abu Ja’afar – peace be upon him – said: When the Prophet – peace be upon him – was taken to the heavens, he said: Jibreel – peace be upon him – said: O’ Mohammad, Allah – praise be to him – said: I forgave (the sins) of all the women that perform <em>mutah<\/em> from your nation.<\/p>\n<p style=\"text-align: justify;\">Before the Shia <em>rijali<\/em> has a chance to smirk and comment about the weakness of these narrations, we point them above to the title of this short chapter: Fabricated Merits of <em>Mutah<\/em>. We are very much aware that these merits have been fabricated and attributed to the Imams, and that this is the Shia position as well. However, it goes without saying that these reported merits from the Imams are nothing more than a counter reaction to Sunnis and their stance against the prohibition of <em>mutah<\/em>. Being driven by nothing more than opposition towards Ahl Al-Sunnah, fabricators from within Shia ranks went out of their way to fabricate narrations and attribute them to the Imams.<\/p>\n<p style=\"text-align: justify;\">This is a very dangerous mentality and there is little doubt that this phenomenon is what caused the widespread false attributions to the Imams.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Unlike the previous articles that focused on everything Ahl Al-Sunnah, this article focuses on mutah from a Shia perspective. Even though Shias continuously point out the “contradictions” in the time of the prohibition of mutah, as found in Sunni books <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/02\/23\/mutah-in-the-eyes-of-ahl-al-bayt-in-twelver-shia-traditions\/\" title=\"Mutah in the Eyes of Ahl Al-Bayt in Twelver Shia Traditions\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-1763","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1763","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1763"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1763\/revisions"}],"predecessor-version":[{"id":2028,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1763\/revisions\/2028"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1763"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1763"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1763"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}