{"id":1811,"date":"2015-03-18T00:25:39","date_gmt":"2015-03-18T00:25:39","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1811"},"modified":"2015-11-03T21:18:56","modified_gmt":"2015-11-03T21:18:56","slug":"history-of-the-alawite-revolutions-contradicts-imamah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/03\/18\/history-of-the-alawite-revolutions-contradicts-imamah\/","title":{"rendered":"History of the Alawite revolutions contradicts Imamah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1811\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">With the grace of Allah we have been recently looking into the history of the `Alawites and the relations between them and both their Umayyad and `Abbasite cousins.<\/p>\n<p style=\"text-align: justify;\">For the less informed readers, `Alawite is a term that refers to the descendants of `Ali ibn abi Talib may Allah be pleased with him.<\/p>\n<p style=\"text-align: justify;\">During our research we discovered something interesting, which is that the `Alawites while clinging to their right to ascend the throne, yet their revolutions did not seem to be in harmony with the views of the “Twelver” sect of Imamiyyah. Rather it appears that these Hashemite revolutionaries did not share the beliefs of the Twelvers nor did they take them into consideration.<\/p>\n<p style=\"text-align: justify;\">This can be concluded easily after observing their behavior as revolutionaries:<\/p>\n<p style=\"text-align: justify;\">A- They did not claim to receive orders from any of the 12 Imams permitting them to revolt or encouraging them to carry arms, nor was it reported from any of the 12 Imams that they instructed any of these men to revolt.<\/p>\n<p style=\"text-align: justify;\">B- These revolutionaries openly called for themselves and received allegiance for themselves not for the 12 Imams of the Twelver sect. In fact, when these revolutions succeeded these revolutionaries ruled and did not transfer authority to the 11 Imams or the hidden Imam of that sect.<\/p>\n<p style=\"text-align: justify;\">C- None of the Twelver Imams of that sect have actually risen up to aid and support any of these revolutions. Rather, the Twelver Imams have been quite peaceful as they never declared any armed revolutions with the exception of al-Husayn ibn `Ali.<\/p>\n<p style=\"text-align: justify;\">Details on these `Alawite revolutionaries is scattered all over the history books, from Tareekh Dimashq to Tareekh-ul-Tabari and from Maqatil-ul-Talibiyyin to Ansab-ul-Ashraf and many others in between. This vast sea of sources makes it hard to gather everything that is mentioned about each man, yet by Allah’s permission we were able to come across one source that does a very good job in collecting them.<\/p>\n<p style=\"text-align: justify;\">The history book “Samt-ul-Nujoum al-`Awaali”, a great historical work based on plenty of major resources and written by `Abdul-Malik bin Husayn al-Makki al-Shafi`i collects the names of the `Alawites who led revolutions against the Imams of their time. In the fourth volume of this book we find a chapter called “Mentioning those of them who called people to their allegiance” starting from page 154 until 201, in this part he will briefly go through the stories of those who rebelled from `Ali’s children.<\/p>\n<p style=\"text-align: justify;\">Note: You can also check the book Maqalat-ul-Islamiyeen by al-Ash`ari for a similar list.<\/p>\n<p style=\"text-align: justify;\">In this article of ours, we will take that brief summary above and summarize it even more so that it becomes more of a simplified list, then we will comment on it if Allah wills.<\/p>\n<p style=\"text-align: justify;\">In Allah’s name we begin,<\/p>\n<p style=\"text-align: justify;\">-In the reign of Banu Umayyah, the `Alawite revolutions were ignited with the rebellion of al-Husayn ibn `Ali during the time of Yazid, but his revolution failed and turned into the tragedy in Karbala’. Husayn’s martyrdom was followed by a rebellion in `Iraq by a group of his Shia, they wished to repent for not aiding al-Husayn after having called him so they named themselves al-Tawwaboun, then this was followed by the rebellion of al-Harrah in Madinah that led to the death of many of the children of the Sahabah, after that a man called al-Mukhtar rebelled in `Iraq and ruled its lands and said he was ordered to do so by Muhammad bin `Ali (ibn al-Hanafiyyah) who disowned him as soon as he heard his lies.<\/p>\n<p style=\"text-align: justify;\">-After this, al-Hasan bin al-Hasan bin `Ali ibn abi Talib was falsely accused of calling for himself by `Abdul-Malik bin Marwan. In fact, several `Alawites were falsely accused of this either by their enemies or by some of the extremist Shia, this ended up getting them into trouble so we will not mention their names in the list.<\/p>\n<p style=\"text-align: justify;\">-Then Zayd ibn `Ali ibn al-Husayn rebelled in Kufa during the time of Hisham bin `Abdul-Malik after he had an argument with him because of Zayd ibn `Ali’s fight with his cousin Ja`far bin al-Hasan. The Koufan Shia then called on him and asked him to rebel but they abandoned him in Kufa after they debated him about the Shaykhayn.<\/p>\n<p style=\"text-align: justify;\">-Then his son Yahya bin Zayd bin `Ali rebelled during the time of al-Walid bin Yazid bin `Abdul-Malik in Khurasan but he was defeated and crucified until the time of abu Muslim al-Khurasani.<\/p>\n<p style=\"text-align: justify;\">-In the reign of Banu al-`Abbas we witnessed much more but not in the time of their first Caliph al-Saffah, rather after his death when al-Mansour became Caliph he was confronted by Muhammad bin `Abdullah bin al-Hasan bin al-Hasan bin `Ali ibn abi Talib. When the government of Banu Umayyah was beginning to shake, the people of Madinah and the heads of Ahlul-Bayt gathered to elect a man from them to lead, and they chose Muhammad al-Nafs-ul-Zakiyyah secretly but never declared it, and he had the support of many men such as abu Hanifa and Malik. Upon hearing this, the Caliph imprisoned his family members, but al-Nafs-ul-Zakiyyah freed them and took over Madinah and had the support of the majority of its people but finally the army headed by `Isa bin Musa defeated him.<\/p>\n<p style=\"text-align: justify;\">-Ibrahim bin `Abdullah al-Mahd bin Hasan bin Hasan bin `Ali, who was sent by his brother Muhammad to Basarah, after his brother’s death he called for himself and was given Imamah by the people but was killed in Ahwaz by al-Mansour’s army.<\/p>\n<p style=\"text-align: justify;\">-Then his uncle Ibrahim al-Ghamr bin al-Hasan who was the brother of `Abdullah al-Mahd rose after his two nephews Muhammad and Ibrahim died. Al-Mansour quickly stopped his movement before he had the chance to acquire more power and arrested him and his brothers and household, he died in prison.<\/p>\n<p style=\"text-align: justify;\">-Then al-Hasan bin Ibrahim bin `Abdullah bin Hasan al-Muthanna bin Hasan al-Sabt bin `Ali ibn abi Talib also rebelled in the time of al-Mansour. He was hiding in Basarah, then he sent his callers to every corner to call for his Imamah, so al-Mansour sent an agent who claimed to be from his closest Shia, then he lured him out and got him arrested, he later died in prison from poison.<\/p>\n<p style=\"text-align: justify;\">-Then `Abdullah al-Ashtar ibn al-Nafs-ul-Zakiyyah bin `Abdullah bin Hasan bin Hasan bin `Ali, he appeared in al-Sind in Kabul where he had escaped after his father’s death. He gathered the people he converted to Islam there, he later got into many fights with the governor of al-Mansour until he got killed.<\/p>\n<p style=\"text-align: justify;\">-Then rose al-Hasan bin Ibrahim bin Hasan bin Hasan bin `Ali in Basarah during the days of al-Mahdi bin al-Mansour, but he was forced to go into hiding because of lack of supporters until he died.<\/p>\n<p style=\"text-align: justify;\">-Then rose `Isa bin Zayd ibn Zayn-ul-`Abidin bin Husayn bin `Ali during al-Mahdi’s rule. He received the Bay`ah from the Koufans, the Basrans, the Ahwazies and Hijazies while he was laying low. Al-Mahdi sent him a man who got close to him then killed him with poison.<\/p>\n<p style=\"text-align: justify;\">-Then rose `Ali bin `Abbas bin Hasan bin Hasan bin `Ali also in al-Mahdi’s reign, he made a group give him Bay`ah in secret in Baghdad. Al-Mahdi arrested him before he could acquire power but his relative al-Husayn bin `Ali of al-Fakh interceded and got him out of prison, he later died from poison in Madinah.<\/p>\n<p style=\"text-align: justify;\">-After this, the martyr of al-Fakh rose, he was al-Husayn bin `Ali bin Hasan bin Hasan bin Hasan bin `Ali during Al-Hadi bin al-Mahdi’s days. He took Bay`ah in Madinah and chased away its governor, then he headed towards Makkah but an army intercepted him and he was killed in Fakh near Makkah.<\/p>\n<p style=\"text-align: justify;\">-Then Yahya bin `Abdullah bin Hasan bin Hasan bin `Ali in al-Hadi’s days after he had survived the event of al-Fakh, he finally settled in the mountain of al-Daylam in the days of Haroun al-Rashid who sent al-Fadl al-Barmaki to fight him. They negotiated peace with him and he returned peacefully to Madinah and received a lot of money from the Caliph, later it was proven that he was still calling to himself secretly so he was arrested and they differed on his death.<\/p>\n<p style=\"text-align: justify;\">-Then his brother Idris bin `Abdullah bin Hasan bin Hasan bin `Ali who also survived al-Fakh then headed towards al-Maghrib and received Bay`ah from the tribes and overthrew the `Abbasies.<\/p>\n<p style=\"text-align: justify;\">-Then Muhammad ibn Ibrahim Tabataba bin Isma`il al-Dibaj bin Ibrahim bin Hasan bin Hasan bin `Ali during al-Rashid’s days. He rebelled alongside abu al-Saraya and they went to Kufa and defeated the `Abbasiyyah and took their gold and received Bay`ah from the Koufans and all Arabs surrounding it, then Muhammad died during that revolution so abu al-Saraya replaced him with a young `Alawite boy called Muhammad bin Muhammad bin Zayd ibn Zayn-ul-`Abidin bin al-Husayn.<\/p>\n<p style=\"text-align: justify;\">-As stated above Muhammad bin Muhammad ibn Zayd bin `Ali bin Husayn rebelled and he was no more than a tool for abu al-Saraya who was the leader of the revolution. Abu al-Saraya appointed `Abbas bin Muhammad bin `Isa al-Ja`fari on Basarah and Husayn al-Aftas bin Husayn bin `Ali Zayn-ul-`Abidin on Makkah. He also appointed Ibrahim bin Musa bin Ja`far al-Sadiq on Yaman. Finally they were both defeated, abu Saraya was beheaded and Muhammad bin Muhammad was imprisoned and it was said poisoned.<\/p>\n<p style=\"text-align: justify;\">-Then an army was sent to defeat Zayd al-Nar bin Musa bin Ja`far al-Sadiq who was burning the houses of Banu al-`Abbas and their followers. Zayd negotiated a peaceful surrender and was jailed in Baghdad.<\/p>\n<p style=\"text-align: justify;\">-Ibrahim al-Jazzar bin Musa bin Ja`far al-Sadiq who was previously placed in Yaman by abu al-Saraya was controlling Yaman, and he became famous for his massacres thus his name “al-Jazzar”.<\/p>\n<p style=\"text-align: justify;\">-Then his son Muhammad bin Ibrahim bin Musa bin Ja`far al-Sadiq and he was calling for Muhammad bin Muhammad, he was killed in Khurasan.<\/p>\n<p style=\"text-align: justify;\">-Then Muhammad bin Sulayman bin Dawoud bin Hasan bin Hasan bin `Ali, but his supporters abandoned him so he hid in Madinah until he died.<\/p>\n<p style=\"text-align: justify;\">-Then Idris bin Idris bin `Abdullah bin Hasan bin Hasan bin `Ali in al-Maghrib after his father died and he established the Idrisi dynasty where his children ruled for hundreds of years.<\/p>\n<p style=\"text-align: justify;\">-Then the infamous scholar of Ahlul-Bayt al-Qasim al-Rassi bin Ibrahim Tabataba bin Isma`il bin Ibrahim bin Hasan bin Hasan bin `Ali also during the days of al-Ma’moun. He remained in hiding while his callers called for his Imamah in the lands, then he moved from Egypt to Hijaz and hid until al-Ma’moun died. After al-Mu`tasim came to power he tried to capture him, but al-Qasim fortified himself in a mountain called al-Ras where he and his children lived.<\/p>\n<p style=\"text-align: justify;\">-Then rose Muhammad Sahib al-Taliqan bin al-Qasim bin `Ali bin `Umar al-Ashraf bin `Ali bin Husayn bin `Ali and the people called him al-Soufi and they differed on what happened to him after al-Mu`tasim.<\/p>\n<p style=\"text-align: justify;\">-Then Muhammad bin Ja`far bin Yahya bin `Abdullah bin al-Hasan bin al-Hasan bin `Ali rebelled in Hirat and conquered the southern part where he and his children ruled until 290 AH.<\/p>\n<p style=\"text-align: justify;\">-Then Muhammad bin Salih bin `Abdullah bin Musa bin `Abdullah bin Hasan bin Hasan bin `Ali who appeared in a village near Madinah. However, abu al-Saj managed to trap him and imprison him in the city of Surra man Ra’a (Samarra), at that time many of the `Alawites refrained from revolting and calling for themselves.<\/p>\n<p style=\"text-align: justify;\">-Then it was the time of al-Hasan bin Zayd bin Muhammad bin Isma`il bin Hasan bin Zayd bin Hasan bin `Ali ibn abi Talib, he conquered Tabaristan and the areas of Daylam and ruled for forty years until he died in 250 AH.<\/p>\n<p style=\"text-align: justify;\">-Then Muhammad bin Ja`far bin Hasan bin `Umar bin `Ali bin Husayn bin `Ali ibn abi Talib, who rebelled in the non-Arab lands but was imprisoned by al-Mutawakkil.<\/p>\n<p style=\"text-align: justify;\">-It was said that more `Alawites rebelled in the time of al-Mutawakkil, some were killed while others were imprisoned.<\/p>\n<p style=\"text-align: justify;\">-Then Yahya bin `Umar bin Yahya bin Husayn bin `Ali Zayn-ul-`Abidin who appeared in Kufa and won the people’s hearts during the Caliphate of al-Musta`in.<\/p>\n<p style=\"text-align: justify;\">-Then Husayn bin Muhammad bin Hamzah bin `Abdullah bin Husayn bin Zayn-ul-`Abidin who was imprisoned by al-Musta`in and died in prison.<\/p>\n<p style=\"text-align: justify;\">-Then Muhammad bin Ja`far bin Hasan bin Ja`far bin Hasan bin Hasan during al-Musta`in’s days in Armenia or Kufa, he died in prison in 250 AH.<\/p>\n<p style=\"text-align: justify;\">-Then al-Kawkabi Ahmad bin `Isa bin `Ali bin Husayn bin Zayn-ul-`Abdin, he rebelled in al-Kufa in the time of al-Mahdi in 255 AH.<\/p>\n<p style=\"text-align: justify;\">-Then Ahmad bin Muhammad bin `Abdullah bin Ibrahim Tabataba bin Isma`il bin Ibrahim bin Hasan bin Hasan bin `Ali in al-Mu`tamid’s time. He had battles with ibn Touloun and was beheaded as a result.<\/p>\n<p style=\"text-align: justify;\">-Then al-Da`i Muhammad bin Zayd bin Muhammad bin Isma`il bin Hasan bin Zayd bin Hasan bin `Ali in 277 AH. He had many battles and was killed in Jurajan in al-Mu`tadid’s time.<\/p>\n<p style=\"text-align: justify;\">-Then al-Nasir al-Utroush al-Hasan bin `Ali bin Hasan bin `Ali bin `Umar al-Ashraf bin `Ali Zayn-ul-`Abidin in al-Jil and al-Daylam in 284 AH, and he conquered lands and gained much strength until he was killed in 304 AH.<\/p>\n<p style=\"text-align: justify;\">-Then al-Da`i al-Hasan bin Qasim bin Hasan bin `Ali bin `Abdul-Rahman bin Qasim bin Hasan bin Zayd bin Hasan bin `Ali. Fought the children of al-Nasir al-`Abbasi and defeated them then ruled Tabaristan for twelve years.<\/p>\n<p style=\"text-align: justify;\">-After him his son al-Mahdi Muhammad bin Hasan bin Qasim bin Hasan during the reign of al-Muti` al-`Abbasi in 353 AH. He ruled over al-Jil and al-Daylam until he died in 360 AH.<\/p>\n<p style=\"text-align: justify;\">-Then al-Tha’ir Ja`far bin Muhammad bin Husayn bin `Ali bin Hasan bin `Ali bin `Umar bin Zayn-ul-`Abidin and he gained strength and ruled until he died in 367 AH.<\/p>\n<p style=\"text-align: justify;\">-Then his son abu al-Husayn al-Mahdi bin Ja`far al-Tha’ir in the Caliphate of al-Qadir Billah al-`Abbasi and he did not last long as he died from sickness.<\/p>\n<p style=\"text-align: justify;\">-Then his brother Husayn bin Ja`far al-Tha’ir, and he ruled the lands he dominated until he died.<\/p>\n<p style=\"text-align: justify;\">-Then Ahmad bin Husayn bin Haroun bin Husayn bin Muhammad bin Haroun bin Muhammad bin Qasim bin Hasan bin Zayd bin Hasan bin `Ali also in the time of al-Qadir in 380 AH. He had some battles until he finally conquered Tabaristan and died in 411 AH.<\/p>\n<p style=\"text-align: justify;\">-Then his brother al-Natiq bil-Haq Yahya bin Husayn in the time of al-Qa’im al-`Abbasi, and he ruled the lands he dominated until he died in 424 AH.<\/p>\n<p style=\"text-align: justify;\">-Then al-`Aqiqi `Ali bin Ja`far bin Hasan bin `Abdullah bin `Ali bin Ahmad bin `Ali bin Husayn bin Zayn-ul-`Abidin in the time of al-Qa’im in 404 AH.<\/p>\n<p style=\"text-align: justify;\">-Then Ahmad bin Muhammad bin `Ali bin Muhammad bin Hasan bin Muhammad ibn Ahmad al-A`rabi bin Muhammad bin Hasan bin `Ali bin `Umar al-Ashraf bin `Ali bin Husayn bin `Ali just as those before him did in 417 AH.<\/p>\n<p style=\"text-align: justify;\">-Then al-Nasir al-Husayn bin Ja`far bin Husayn bin Hasan bin `Ali bin al-Nasir al-Utroush near al-Daylam.<\/p>\n<p style=\"text-align: justify;\">-Then al-Muwaffaq Billah Husayn bin Isma`il bin Zayd bin Ja`far bin Hasan bin Muhammad bin Ja`far bin `Abdul-Rahman bin Qasim bin Hasan bin Zayd bin Hasan bin `Ali.<\/p>\n<p style=\"text-align: justify;\">-Then his son al-Murshid Billah Yahya bin Husayn.<\/p>\n<p style=\"text-align: justify;\">-Then abu Talib Yahya bin Ahmad bin al-Aamir abi al-Qasim al-Husayn al-Mu’ayyad Billah Ahmad bin Husayn bin Haroun after 490 AH in the time of al-Mustazhir and he fought against the Batini sect.<\/p>\n<p style=\"text-align: justify;\">Then the author lists the names of `Alawites who did their revolutions but it is not known when and during whose reign they did so:<\/p>\n<p style=\"text-align: justify;\">-Muhammad bin abi al-A`rabi bin Muhammad bin Hasan bin `Ali bin `Umar bin Zayn-`Abidin.<\/p>\n<p style=\"text-align: justify;\">-`Ali al-`Iraqi bin Husayn bin `Isa bin Zayd bin Zayn-`Abidin.<\/p>\n<p style=\"text-align: justify;\">-Ahmad bin `Isa bin Zayd bin Zayn-`Abidin.<\/p>\n<p style=\"text-align: justify;\">-Al-Hadi bin al-Mahdi bin Hasan bin `Abdullah bin `Ali bin Hasan bin `Ali ibn abi Talib.<\/p>\n<p style=\"text-align: justify;\">-Al-Radi Billah Nasir bin Husayn bin Zayd bin Salih bin Muhammad bin `Abdullah bin Muhammad bin `Abdul-Rahman bin Qasim bin Hasan bin Zayd bin Hasan bin `Ali ibn abi Talib.<\/p>\n<p style=\"text-align: justify;\">-Zayd bin Salih bin Hasan bin Zayd bin Salih bin Hasan bin Zayd bin Salih bin `Umar.<\/p>\n<p style=\"text-align: justify;\">-`Ali bin Muhsin bin Ahmad bin `Ubaydullah bin Hasan bin `Ali bin Muhammad bin Hasan bin Ja`far bin al-Hasan al-Muthanna.<\/p>\n<p style=\"text-align: justify;\">-Husayn bin Muhammad bin `Ali bin Ja`far bin `Ubaydullah.<\/p>\n<p style=\"text-align: justify;\">-His brother Hasan bin Muhammad bin `Ali.<\/p>\n<p style=\"text-align: justify;\">As for those `Alawites whose lineage is not known, they are:<\/p>\n<p style=\"text-align: justify;\">-Ashraf bin Zayd from the progeny of al-Hasan.<\/p>\n<p style=\"text-align: justify;\">-Al-Sayyid al-Azraqi.<\/p>\n<p style=\"text-align: justify;\">-Abu al-Raha al-Kaytami.<\/p>\n<p style=\"text-align: justify;\">And all of these `Alawite revolutions happened in the areas of: Qazwin, Tabristan, al-Jil, al-Daylam, Jurajan, Hijaz, `Iraq and Maghrib.<\/p>\n<p style=\"text-align: justify;\">As for those `Alawites who appeared and called for themselves in Yaman, then the first of them is:<\/p>\n<p style=\"text-align: justify;\">-Al-Hadi ila al-Haq Yahya bin Husayn bin Qasim bin Ibrahim Tabataba bin Isma`il bin Ibrahim al-Ghamr bin al-Hasan al-Muthanna in Sa`dah in the year 280 AH. He fought against the Isma`ili Shia `Ali bin al-Fadl al-Qarmati and the state of the Qaramitah in Yaman, he died from poison in 298 AH.<\/p>\n<p style=\"text-align: justify;\">-Then his son al-Murtada Muhammad bin al-Hadi rose instead of his father but he stepped-down from Imamah after one year so the Zaydi scholars tried to get his brother to step-up.<\/p>\n<p style=\"text-align: justify;\">-Then his brother al-Nasir li-Dinillah Ahmad bin Yahya came after the Zaydiyyah called on him from the mountain of al-Ras during the Caliphate of al-Muqtadir in 301 AH.<\/p>\n<p style=\"text-align: justify;\">And the author continues with another long list of the Imams of the `Alawites who received Bay`ah and ruled the lands of Yaman and fought for control with their opponents.<\/p>\n<p style=\"text-align: justify;\">The above list is sufficient to prove the point, that if these men above believed that the leadership is only intended for an infallible divinely chosen man, they would not have asked for it nor would they have risen to the throne. I add, that if these men believed that Allah had appointed as leaders twelve men from Husayn’s progeny, we would not have seen them take it for themselves and keep the divine Imams away from it.<\/p>\n<p style=\"text-align: justify;\">As we have seen during our research, none of these men handed authority to any of the twelve Shia Imams when they secured victory. If the “Twelver” sect wishes to disagree and claim something baseless like: “They would have given the twelve Imams full authority when they secured victory.” This remains an empty claim which is contradicted by the actions of these Imams from Ahlul-Bayt.<\/p>\n<p style=\"text-align: justify;\">We see for example Idris bin `Abdullah al-Hasani [d.177AH] establish his Caliphate in the land of al-Maghrib and rule it with his children instead of handing it over to Musa al-Qazim or `Ali al-Rida. We also see al-Husayn bin `Ali Sahib al-Fakh [d.169AH] take from the people of Madinah the pledge of allegiance for himself, not for Ja`far al-Sadiq or his son Musa, so he climbed the pulpit of the mosque and called for himself and the people came to him in big numbers giving him their Bay`ah. We see Muhammad bin `Abdullah al-Nafs-ul-Zakiyyah [d.145AH] who took the pledge of allegiance for himself from the heads of Ahlul-Bayt and the heads of the people of Madinah and its scholars, and delivered a sermon and said as is recorded in Tarikh-ul-Umam wal-Mulouk: “And the most worthy of people to uphold this religion are the children of the Mouhajiroun and the Ansar.”<\/p>\n<p style=\"text-align: justify;\">Even the popular Twelver scholar al-Mufid admits this, when he refutes a Waqifi Shia who claims that all those men from Ahlul-Bayt who rebelled never announced their leadership and that they were only deputies on behalf of Musa al-Kadhim, al-Mufid rejects this as quoted in Bihar-ul-Anwar 37\/18:<\/p>\n<p style=\"text-align: justify;\">[As for the one who claims that al-Rida (as) and all those (who stood up) after him (from `Ali&#8217;s descendants) were simply deputies for abi al-Hasan Musa (as), and that they didn&#8217;t claim authority for themselves, then this is the statement of an ignorant who is stubborn because the supporters of those men (who rebelled) from the Shia were pure Zaydi and even from the non-Shia, thus whoever investigates and observes will know for a fact that they were falsely usurping the Imamah]<\/p>\n<p style=\"text-align: justify;\">Meaning, al-Mufid admits that those who rebelled were in fact impostors according to him and their supporters were deviant. How can he then call himself a lover of Ahlul-Bayt is beyond me when he only loves twelve and insults the rest as impostors.<\/p>\n<p style=\"text-align: justify;\">The above were from the descendants of al-Hasan, which is why the “Twelver” sect does not care for them much BUT when a descendant of al-Husayn and a son of one of their twelve Imams rises and claims authority for himself, then the “Twelver” sect will sound the Alarms and get creative in inventing excuses as to WHY would the son of a divinely appointed leader call for his own leadership.<\/p>\n<p style=\"text-align: justify;\">Their first excuse is the ignorance of Zayd ibn `Ali about the belief in Imamah, as they’ve reported in what they deem authentic, in al-Kafi by al-Kulayni and also in Ikhtiyar Ma`rifat-ul-Rijal by al-Tusi, when Zayd debated Shaytan-ul-Taq and told him:<\/p>\n<p style=\"text-align: justify;\">“It has reached me that you claim that in the family of Muhammad is a leader whose obedience is obligatory?”<\/p>\n<p style=\"text-align: justify;\">And he also told him:<\/p>\n<p style=\"text-align: justify;\">“Did my father not feel mercy for me that I may enter the fire when he went and told you about the religion but never told me!?”<\/p>\n<p style=\"text-align: justify;\">Their second excuse is that Zayd bin `Ali knew and the purpose of his revolution was to remove the tyrant and replace him with al-Rida from the family of Muhammad, as we read in al-Kafi and `Uyoun Akhbar-ul-Rida they attribute to their Imam that he said about Zayd:<\/p>\n<p style=\"text-align: justify;\">“May Allah have mercy on my uncle Zayd, he only called towards al-Rida from the family of Muhammad and if he was successful he would have done so.”<\/p>\n<p style=\"text-align: justify;\">And that he said:<\/p>\n<p style=\"text-align: justify;\">“Don’t say Zayd went out (to grab it), he was a truthful scholar, he never called for himself but he only called for al-Rida from the family of Muhammad, and if he had succeeded he would have fulfilled it.”<\/p>\n<p style=\"text-align: justify;\">And this slogan “al-Rida from the family of Muhammad” is the one used by Banu al-`Abbas and is also used by all Zaydi Shia, and it means the one who is pleasing (to Allah) from the family of Muhammad (saw). In other words, it means that they wish to select a man who is pleasing to Allah from the family of Muhammad (saw) because they believed that they were the ones with the right to rule because of their lineage, meaning that even these narrations above do not show that Zayd was intending to hand matters over to any of the twelve men.<\/p>\n<p style=\"text-align: justify;\">Their third excuse is that Zayd bin `Ali was selfish and wished to take the throne and rejected his brother’s leadership, this is in Bihar al-Anwar and Ithbat-ul-Hudat where al-Baqir tells his son Ja`far:<\/p>\n<p style=\"text-align: justify;\">“Zayd will rise after me and call for himself so leave him be and do not fight him as his life is short.”<\/p>\n<p style=\"text-align: justify;\">And in al-Kafi they attribute to Zayd that he objected to al-Baqir and told him:<\/p>\n<p style=\"text-align: justify;\">“The Imam from us (Ahlul-Bayt) is not the one who sits at home, feels secure and avoids armed struggle!”<\/p>\n<p style=\"text-align: justify;\">The reality of the matter is that none of these conversations took place, and these texts were obviously fabricated later as an excuse for why this historical incident took place just as the “Twelver” sect has invented an excuse to any historical matter that disagrees with their beliefs.<\/p>\n<p style=\"text-align: justify;\">So may the peace of Allah be upon Muhammad and his pure family and companions.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>With the grace of Allah we have been recently looking into the history of the `Alawites and the relations between them and both their Umayyad and `Abbasite cousins. For the less informed readers, `Alawite is a term that refers to <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/03\/18\/history-of-the-alawite-revolutions-contradicts-imamah\/\" title=\"History of the Alawite revolutions contradicts Imamah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[],"class_list":{"0":"post-1811","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1811","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1811"}],"version-history":[{"count":12,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1811\/revisions"}],"predecessor-version":[{"id":2667,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1811\/revisions\/2667"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}