{"id":182,"date":"2013-04-18T21:11:24","date_gmt":"2013-04-18T21:11:24","guid":{"rendered":"http:\/\/twelvershia.net\/?p=182"},"modified":"2013-04-24T17:44:45","modified_gmt":"2013-04-24T17:44:45","slug":"the-love-between-the-companions-and-the-family-a-quranic-reality","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/04\/18\/the-love-between-the-companions-and-the-family-a-quranic-reality\/","title":{"rendered":"The Love Between the Companions and the Family, a Qur&#8217;anic reality."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=182\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">al-Salamu `Aleykum wa Rahmatullahi wa Barakatuhu,<\/p>\n<p style=\"text-align: justify;\">The subject of this brief article is to confirm an evident and obvious matter, a matter of which we have certainty, the relationship between the companions of the Prophet (SAWS) and his family, a relation of mutual love and affection and respect.<\/p>\n<p style=\"text-align: justify;\">We aim to confirm this special relationship between them, both during the life of the Prophet (SAWS) and after his death. For this purpose we need to provide decisive proof, although it can be a bit hard for us, simply because we believe that this is an obvious matter that it does not require an effort on the part of anyone to realize this fact. However, we will quote some of the clear religious texts that support our belief with certainty.<\/p>\n<p style=\"text-align: justify;\">Allah (swt) says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong>It is He who supported you with His help and with the believers<\/strong>} [8:62]<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong>And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together.<\/strong>} [8:63]<\/span><\/p>\n<p style=\"text-align: justify;\">We discuss these verses to highlight the various beneficial parts that confirm this mutual relationship and love between the companions and the family.<\/p>\n<p style=\"text-align: justify;\">Firstly, Allah confers favor upon the Prophet (SAWS) and the nation of Islam, that it is He who brought together the hearts of the Muslims. The context of this verse makes us understand that Allah glorifies this favor, in fact Allah (swt) shows in this verse that this matter is so great that it is outside the capability of humans, and that nobody can bring their hearts together as Allah did, He (swt) says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong>If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together.<\/strong>} [8:63]<\/span><\/p>\n<p style=\"text-align: justify;\">This is a godly favor and blessing, that no human can do no matter how mighty and wealthy he is, only the Lord of the creations can achieve this and make it true.<\/p>\n<p style=\"text-align: justify;\">This shows that there was generally a solid relation between the believers during the life of the Prophet (SAWS).<\/p>\n<p style=\"text-align: justify;\">Secondly, another great sign of this godly favor, is that the Arabs in times of ignorance, it was from their nature that they were arrogant and proud, they would not accept dishonor or shame, and they were divided into warring tribes, each one having grudges against the other, but Allah almighty removed all of this hatred from their hearts, and cleansed their souls , and bestowed upon them the tranquility so they became brothers in Islam.<\/p>\n<p style=\"text-align: justify;\">Thirdly, the &#8220;closeness&#8221; discussed in the verse is a closeness of hearts, and there is a difference between a closeness based upon interests and material benefit, and a closeness of hearts. Allah (swt) confirms that it is a closeness of hearts, a true relationship not tied to any worldly matters.<\/p>\n<p style=\"text-align: justify;\">The significance of this point is that this is a relationship that no one can claim, if you should look around today and observe the closeness between any group, and their support for one another, and their cooperation together, and even their sacrifice for each other, yet it will still occur to you that all of this could simply be for material benefits and worldly interests, but only Allah can know what is in the hearts. So the one who confirmed this mutual love and closeness of hearts, is the knower of the unseen, and He is only one who has the right to confirm such a relationship as He knows the secrets of the hearts.<\/p>\n<p style=\"text-align: justify;\">The fourth point, is that this mutual love and affection has to encompass all those who accompanied the Prophet (SAWS) including his family, because the verse begins by:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong>It is He who supported you with His help and with the believers<\/strong>} [8:62]<\/span><\/p>\n<p style=\"text-align: justify;\">According to the scholars the term &#8220;the believers&#8221; refers to all the believers at the time, it is a general reference encompassing all companions. Another thing is, it is not conceivable that this verse means that only the companions love each other but they do not love the family, what kind of a favor would this be upon the Prophet (SAWS) if Allah made his companions love each other but hate his family? This wouldn&#8217;t be a favor at all, it would be closer to a bad omen!<\/p>\n<p style=\"text-align: justify;\">This favor, in this context, cannot confirm other than the fact that this closeness of hearts was truly realized between all the believers of that time.<\/p>\n<p style=\"text-align: justify;\">Before moving on to another religious text, we feel the need to address a question that may arise in the mind of some readers:<\/p>\n<p style=\"text-align: justify;\">If this verse is so clear about the companions and the family loving each other from the bottom of their hearts, then how can some of the deviant Muslims in our days imagine that there was deep hatred and jealousy and ill-will between both groups?<\/p>\n<p style=\"text-align: justify;\">All we know about the viewpoint of these deviants, is that they claim that this hatred was ignited after the Prophet (SAWS) passed away, and it is as if they are replying to us, they say:<\/p>\n<p style=\"text-align: justify;\">&#8220;<em>Yes this closeness was present when the Prophet (as) was present, but as soon as he was gone the people turned on his family and oppressed them.<\/em>&#8220;<\/p>\n<p style=\"text-align: justify;\">We need to discuss this matter, is it possible? and can we believe that this explanation they gave does not contradict the verse?<\/p>\n<p style=\"text-align: justify;\">We say in response, is it possible that the most high bestowed upon his Prophet (SAWS) as favor, a deep love that would instantly turn into a deep hate the moment he dies? Is this a godly favor?<\/p>\n<p style=\"text-align: justify;\">And with such a context where Allah glorifies this great favor? and blesses his Prophet (SAWS) with it, then we claim that NO it only lasted for a short while?<\/p>\n<p style=\"text-align: justify;\">What a big failure it is, when we try to portray that the followers of our Prophet (SAWS) loved each other when he was alive but after his death, and before he was even buried, they all turned on each other and hated each other?<\/p>\n<p style=\"text-align: justify;\">In reality, those who say so do not believe that Allah favored his Prophet (SAWS) as the verses stated, it is as if they&#8217;re saying -And I seek refuge in Allah from this- that it is a form of deception, Allah (swt) gave the Prophet (SAWS) the illusion during his life that there was love between his followers and family, but before his burial it turned into enmity.<\/p>\n<p style=\"text-align: justify;\">Add to that, a great closeness of hearts which is praised by Allah, and he tells us it is so great that no one is capable of creating such deep love between these people, not even the Prophet (SAWS) himself, and then suddenly, this great love which naturally wouldn&#8217;t change between regular individuals, it turns into enmity and hatred on a massive scale, this is unimaginable is it not?<\/p>\n<p style=\"text-align: justify;\">Does the intellect accept this!? This belief can only be in contradiction to the verses we quoted.<\/p>\n<p style=\"text-align: justify;\">If the belief of the deviants was that this closeness gradually faded, through the passing of time, between a few individuals from both sides and later turned into hatred, it may be open for discussion as it is closer to the mind than their current saying.<\/p>\n<p style=\"text-align: justify;\">However, their saying that this deep love turned into deep hatred the moment the Prophet (SAWS) passed away between the general public and his entire family, and they all betrayed his teachings and instructions, then sided with those who openly oppressed his family, this is what no intellect can digest.<\/p>\n<p style=\"text-align: justify;\">Thus we say, that these verses have proven with certainty and without a doubt, the great godly favor and blessing upon our Prophet (SAWS), that the believers, his companions and his family, had strong ties of love and affection both during his life and after his death.<\/p>\n<p style=\"text-align: justify;\">This is a matter which the Qur&#8217;an confirms and doubting the Qur&#8217;an is forbidden.<\/p>\n<p style=\"text-align: justify;\">We now take another text to the same meaning to affirm the previous one, Allah (swt) says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong> And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you &#8211; when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.<\/strong> } [3:103]<\/span><\/p>\n<p style=\"text-align: justify;\">This verse as the previous one, proves that it is a love from the heart, not stemming from worldly interests and materialistic gains. Also the speech here is addressed to the companions generally, as the verse before it begins with:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> { <strong>O you who have believed<\/strong> } [3:102]<\/span><\/p>\n<p style=\"text-align: justify;\">Then Allah confirms another important point, it is that they have become &#8220;Brothers&#8221;, and it is known that the brotherhood of blood is from the closest of ties when it comes to support and love and cooperation, those are usually found between brothers of blood. So with this spiritual love that existed between the companions, Allah referred to them as brothers and saved them from the fire.<\/p>\n<p style=\"text-align: justify;\">It is narrated that when a wondering Arab heard ibn `Abbas (ra) recite:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> { <strong>And you were on the edge of a pit of the Fire, and He saved you from it.<\/strong> } [3:103]<\/span><\/p>\n<p style=\"text-align: justify;\">He said: &#8220;By Allah, the Lord did not save them from the fire if he was intending to throw them into it.&#8221;<\/p>\n<p style=\"text-align: justify;\">What the reader notices based on this interpretation, is that this love which they possess for one another, they will take it with them to their graves and it shall accompany them to the end of their lives. If Allah has saved them from the fire with this mutual love, then this love cannot perish otherwise the reason for their salvation will also perish, it cannot be one of the reasons of their salvation from the fire unless they possess it on the day of judgment.<\/p>\n<p style=\"text-align: justify;\">The next text is the word of Allah (swt):<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> { <strong>Muhammad is the Messenger of Allah; and those with him are forceful against the disbelievers, merciful among themselves.<\/strong>} [48:29]<\/span><\/p>\n<p style=\"text-align: justify;\">The verse is referring to &#8220;Those with him&#8221;, a general speech addressed to all the companions, and we all know that to make any exception we require a specific text as the scholarly rules dictate. Add to this also that the context of this verse comes in the form of a godly favor upon his Prophet (SAWS), Allah cannot favor his Prophet (SAWS) by informing him that those who are with him are only a small minority group and all others are waiting for him to die so they can oppress his family and usurp their rights. What favor and what blessing would that be?<\/p>\n<p style=\"text-align: justify;\">The verse is also talking about people with the Prophet (SAWS) who were fighting and struggling against the disbelievers, it says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> { <strong>are forceful against the disbelievers<\/strong> } [48:29]<\/span><\/p>\n<p style=\"text-align: justify;\">We all know that those who were fighting the disbelievers along the side of the Prophet (SAWS) are thousands upon thousands, so the verse is showing the love and affection and mercy that is found among the general followers of the Prophet (SAWS) who surrounded him, especially those who fought in the conquests.<\/p>\n<p style=\"text-align: justify;\">The last verse I want to mention in this article before I conclude, is the word of Allah (swt):<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong>For the poor emigrants who were expelled from their homes and their properties, seeking bounty from Allah and [His] approval and supporting Allah and His Messenger, [there is also a share]. Those are the truthful. <\/strong>} [59:8]<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #339966;\"> {<strong>And [also for] those who were settled in al-Madinah and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul &#8211; it is those who will be the successful.<\/strong>} [59:9]<\/span><\/p>\n<p style=\"text-align: justify;\">Allah described these companions (Ansar) as having three traits towards the emigrants, and from these emigrants with no doubt is `Ali ibn abi Talib (ra), Fatima al-Zahra&#8217; (ra) and the rest of his family:<\/p>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> {<strong>They love those who emigrated to them<\/strong>} meaning they love all of those who emigrated to them generally and with no exceptions.<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> {<strong>Find not any want in their breasts of what the emigrants were given<\/strong>} meaning they have no jealousy or grudge.<\/p>\n<p style=\"text-align: justify;\"><strong>3- <\/strong>{<strong>Give [them] preference over themselves, even though they are in privation<\/strong>} in other words they share with them what little they have of food and provisions and prefer them over themselves even if they had to deprive their own families from food.<\/p>\n<p style=\"text-align: justify;\">Allah (swt) confirmed for them love, then denied them having any jealousy or ill-will, and finally he confirmed their great sacrifice for those who came to them. This verse explicitly proves the deep love that all the supporters had for all the emigrants, the Ansar and the Muhajiroun.<\/p>\n<p style=\"text-align: justify;\">So if the supporters had so much love and sacrifice towards the emigrants, how then can the emigrants not have the same love between themselves if not more? Knowing that the emigrants are all cousins and relatives from the same city and the same society and the same tribes.<\/p>\n<p style=\"text-align: justify;\">This verse as well as all previous verses has proven with certainty and without doubt, that the strong love between the family and the companions is an unshakable Qur&#8217;anic reality, a clear matter, an obvious matter, a matter which cannot be denied by anyone believing in the integrity of the book of truth.<\/p>\n<p style=\"text-align: justify;\">-end-<\/p>\n<p style=\"text-align: justify;\">(A summary of the speech of al-Sheikh al-Shareef Hatim ibn `Arif al-`Awni al-Hasani, translated by Hani al-Hasani al-Tarabulsi al-Shafi`i.)<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>al-Salamu `Aleykum wa Rahmatullahi wa Barakatuhu, The subject of this brief article is to confirm an evident and obvious matter, a matter of which we have certainty, the relationship between the companions of the Prophet (SAWS) and his family, a <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/04\/18\/the-love-between-the-companions-and-the-family-a-quranic-reality\/\" title=\"The Love Between the Companions and the Family, a Qur&#8217;anic reality.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-182","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/182","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=182"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/182\/revisions"}],"predecessor-version":[{"id":204,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/182\/revisions\/204"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}