{"id":1856,"date":"2015-04-04T22:03:44","date_gmt":"2015-04-04T22:03:44","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1856"},"modified":"2015-04-05T15:16:52","modified_gmt":"2015-04-05T15:16:52","slug":"response-to-objections-criticisms-on-bukhari-vs-kulayni","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/04\/04\/response-to-objections-criticisms-on-bukhari-vs-kulayni\/","title":{"rendered":"Response to Objections &#038; Criticisms on Bukhari vs Kulayni"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1856\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">A response to our original articles that compare Al-Bukhari’s and Al-Kulayni’s books and methodologies has been published around a year ago on Shiachat by one of their members called “Cake”. Even though the criticisms were originally not worth a response, it appears that many Shias online have started to run rampant through Facebook and other internet outlets assuming that it refutes our original articles. If the Shias that paraded this article were aware of Hadith sciences or went back to our original articles and read through them thoroughly, they would realize that the opponent’s criticisms are not sufficient.<\/p>\n<p style=\"text-align: justify;\">In brief, our original articles demonstrate that Al-Bukhari narrated through many more teachers, from diverse locations, and did not focus on narrating from a single teacher. This makes his book much more reliable since the possibility of conspiracy is less as he would have been quickly exposed by those big scholars or their many students around the Islamic world. Statistically, one could even argue that the chances of conspiracy in Al-Kulayni’s collection are ten times that of Al-Bukhari’s.<\/p>\n<p style=\"text-align: justify;\">The main criticisms towards our articles are the following:<\/p>\n<p style=\"text-align: justify;\">1- The Comparison between Al-Bukhari and Al-Kulayni is Unfair due to Different Methodologies.<\/p>\n<p style=\"text-align: justify;\">2- Al-Kulayni was a Third Generation Source unlike Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\">3- Limited Narrators Exist in Al-Bukhari’s Book.<\/p>\n<p style=\"text-align: justify;\"><strong>The Comparison between Al-Bukhari and Al-Kulayni is Unfair due to Different Methodologies<\/strong><\/p>\n<p style=\"text-align: justify;\">The Shia Brother, may Allah guide him and us, suggests that the comparison is unfair since Al-Kulayni did not intend to collect authentic reports only unlike Bukhari, therefore, the efforts of the scholars cannot be compared.<\/p>\n<p style=\"text-align: justify;\">This argument is terribly weak since the authenticity of the book is not a factor to the effort that has been put into the book. On the contrary, if Al-Bukhari wanted to include weak Hadiths, then his book may have included six hundred or even a thousand teachers, instead of the three hundred trustworthy teachers that he relied upon.<\/p>\n<p style=\"text-align: justify;\">As for the argument that these different methodologies are the reason that Al-Kulayni had some weak teachers, then yes, we agree. However, that does not show Al-Kulayni in much of a better light either, since he had the ability to collect from many more weak (and reliable) teachers.<\/p>\n<p style=\"text-align: justify;\">It also seems as though the Shia brother has misunderstood why Al-Bukhari was chosen to be compared to Al-Kulayni. The simple reason is that their two masterful works are seen as the most important texts of each respective sect. We often hear: “Al-Kulayni, the Shia Bukhari”. However, if the opponent is not satisfied with this comparison, then we could easily write up articles in which we compare Al-Kulayni to a different book, like Musnad Ahmad, who quoted from 292 teachers, with only 11 weak teachers and 10 anonymous ones (according to Sh. Amer Sabri in Mu’jam Shyookh Al-Imam Ahmad), or perhaps Al-Kulayni may have been compared to Abu Dawud who had 449 teachers (according to Al-Ghasani who also included teachers from his smaller compilations outside Al-Sunan).<\/p>\n<p style=\"text-align: justify;\">No matter how one slices it, Al-Kulayni’s 28 teachers, two-thirds of them being weak, with most of them being from Qum, is pretty pathetic in comparison to the major Sunni Hadith compilations.<\/p>\n<p style=\"text-align: justify;\"><strong>Al-Kafi was a Third Generation Source unlike Al-Bukhari’s Saheeh<\/strong><\/p>\n<p style=\"text-align: justify;\">The Brother argues that Al-Kafi was a third generation source, meaning that it collected narrations from second generation sources, like Nawadir Al-Hikma or Qurb al-Isnad, which in turn quoted from the first generation sources which are the Usool written by students of the Imams.<\/p>\n<p style=\"text-align: justify;\">Due to this, Al-Kulayni did not have to put much of an effort into collecting from many narrators, since the work was already done for him, and all he had to do was to reorganize his work from second generation books.<\/p>\n<p style=\"text-align: justify;\">\nThis is also a bad argument for the following reasons:<\/p>\n<p style=\"text-align: justify;\">1) Simply because Al-Kulayni’s book is late, does not mean all the narrations were taken from earlier sources. Oral transmission cannot be counted out as a method of transmission, even when quoting popular chains. It is also incorrect to suggest that famous chains are chains from earlier books since only a handful of books predate Al-Kafi out of the thousands of Shia books that we find in early indexes of Al-Tusi and Al-Najashi.<\/p>\n<p style=\"text-align: justify;\">That being said, there is no way to rule out that Al-Kulayni was a primary source for the Hadiths that can be found in his books.<\/p>\n<p style=\"text-align: justify;\">2) The same argument that was made for Al-Kulayni can be made for Al-Bukhari, since he could be considered a third generation source as well. The first generation of books was written by the Sahaba and the Tabi’een, and the names of these books have been collected by Dr. Al-Azmi in his Dirasat fi Uloom Al-Hadith. The second generation of books is often by the major scholars of the level of narrators that came after them. This level includes Imam Malik, Ma’amar, Ibn Juraij, and Abdul Razaq. Thus, if Al-Bukhari wished to be lazy with his collection, he could have relied on one chain for all his reports from a second generation source.<\/p>\n<p style=\"text-align: justify;\">One example of how Al-Bukhari put a major effort into collecting narrations from a second generation source was through his efforts of compiling narrations from Muwatta Malik. Al-Bukhari quoted through twenty different chains that lead to Al-Muwatta. (See: Muwatta Malik wa I’itimad Al-Bukhari wa Muslim ‘ala Nusakh Maktooba Minhu fi Al-Saheehain.)<\/p>\n<p style=\"text-align: justify;\">3) Regardless of any reasons that may be given for the lack of effort by Al-Kulayni, we end up with the same result: A small body of teachers that come from one little town make up the content of sixteen thousand Hadiths.<\/p>\n<p style=\"text-align: justify;\">Thus, we point out once again that the possibility of a conspiracy amongst the teachers of Al-Kulayni, one that would have taken place in Qum, is tens of times higher than one by the teachers of Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\"><strong>Limited Narrators Exist in Al-Bukhari’s Book<\/strong><\/p>\n<p style=\"text-align: justify;\">The Brother then made the claim that Al-Bukhari’s book also suffers from limited narrators. He argued that this is the case with a different level of narrators. He did not criticize the level of Al-Bukhari’s teachers, but rather, the level of the companions of the Prophet &#8211; peace be upon him, and their “limitedness”.<\/p>\n<p style=\"text-align: justify;\">However, even by returning to the level of the companions of the Prophet – peace be upon him – we find that there were around a hundred and eighty companions that narrated Hadith in Saheeh Al-Bukhari. (See Kashf Al-Niqaf by Al-Ala’ee.) That said, Al-Bukhari also focused on having a large variety of companions. This, again, cannot be compared to Al-Kulayni’s 28 teachers.<br \/>\nThe opponent counters our previous point about the possibility of weakness of `Ali bin Ibrahim al-Qummi, which would end up with the destruction of Al-Kafi due to losing 30% of the book, with a weak Abu Huraira, who may have narrated up to 10% of Al-Bukhari’s Saheeh.<\/p>\n<p style=\"text-align: justify;\">Yet, even if we were to assume that Abu Huraira’s 10% (400 Hadiths without repetition) were to be rejected, most of them are corroborated and supported by other companions. The same cannot be said about `Ali bin Ibrahim and his 4,957 narrations, most of which are not corroborated.<\/p>\n<p style=\"text-align: justify;\">For more on Abu Huraira and his reliability, please refer to our collection of articles on <a href=\"http:\/\/twelvershia.net\/2015\/01\/11\/abu-huraira\/\" rel=\"external nofollow\">Abu Huraira<\/a>.<\/p>\n<p style=\"text-align: justify;\">As for the narrations of other companions that were not as famous, we rely on the general praise that they have received from Allah – praise be to Him – in the Qur’an, the praise of the Prophet – peace be upon him &#8211; , their praises upon one another, and their corroborated traditions with one another.<\/p>\n<p style=\"text-align: justify;\">Can this be said about the teachers of Al-Kulayni? Have they received praise from Allah – praise be to Him &#8211; , from His Prophet – peace be upon him &#8211; , or even from the Imams? None of the twenty eight teachers of Al-Kulayni received praise from the Imams! Rather, they received praise from late scholars like Al-Tusi and Al-Najashi, who came three generations after them and died in the middle of the fifth century.<\/p>\n<p style=\"text-align: justify;\">To the objective reader this is sufficient and praise be to Allah – most gracious most merciful &#8211; .<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>A response to our original articles that compare Al-Bukhari’s and Al-Kulayni’s books and methodologies has been published around a year ago on Shiachat by one of their members called “Cake”. Even though the criticisms were originally not worth a response, <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/04\/04\/response-to-objections-criticisms-on-bukhari-vs-kulayni\/\" title=\"Response to Objections &#038; Criticisms on Bukhari vs Kulayni\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-1856","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1856","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1856"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1856\/revisions"}],"predecessor-version":[{"id":1867,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1856\/revisions\/1867"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1856"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1856"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1856"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}