{"id":187,"date":"2013-04-21T00:10:21","date_gmt":"2013-04-21T00:10:21","guid":{"rendered":"http:\/\/twelvershia.net\/?p=187"},"modified":"2014-12-08T13:19:51","modified_gmt":"2014-12-08T13:19:51","slug":"response-to-putting-the-relation-into-relationship","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/04\/21\/response-to-putting-the-relation-into-relationship\/","title":{"rendered":"Response to: Putting the Relation into Relationship"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=187\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on RevisitingtheSalaf.org entitled: Putting The Relation Into Relationship, that was published on the 1st of June, 2012, which can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/06\/putting-relation-into-relationship.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS, in this article quotes a verse from the Qur’an that establishes the prohibition of getting married to Maharim. RTS, then goes on to quote passages from Sunni texts, implying that these texts imply that Ahl Al-Sunnah have made permissible what Allah has prohibited.<\/p>\n<p style=\"text-align: justify;\">RTS argues:<span style=\"color: #ff0000;\"> This act (incest) is considered to be illegal in most non-Islamic countries. The result of such relations can lead to genetic defects and\/or psychological damage. Many Islamic scholars have deemed such acts worthy of execution, or in some cases the Hadd punishment varies. However, on the other hand the Nawasib have a different ideology to the Qur&#8217;aan. They deem such acts excusable without any punishment to the perpetrators.<\/span><\/p>\n<p style=\"text-align: justify;\">The key words here are “excusable without any punishment”. However, when we go back to the texts that are quoted by RTS, we find that this is far from the truth.<\/p>\n<p style=\"text-align: justify;\">First of all, RTS quotes Ibn Hazm, who quoted the opinions of other scholars who said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Aboo Hanifa said: There is no limit on that, and neither no limit for the one who marries his mother that gave birth to him, and his daughter, and his sister, and his grandmother, and his father&#8217;s sister (aunt from the father&#8217;s side), and his mother&#8217;s sister (aunt from the mother&#8217;s side), and the daughter of his brother, and the daughter of his sister, when knowing their relativity with him, and knowing their prohibition from him, and (the prohibition) of having sexual intercourse with them. So the child would be following him, and the &#8216;mahr&#8217; would be obligatory for them upon him, and it is nothing upon him except to commit &#8216;ta&#8217;zeer&#8217; for those that are beneath 40. And that is the saying of Sufyan al-Thawri.<\/span><\/p>\n<p style=\"text-align: justify;\">Be aware that the word limit here is translated from the word Hadd. In other words, Hadd refers to a specific punishment, ordained by Allah (swt) in the Qur&#8217;an or the Sunnah. This means that Abu Hanifa does not believe in a Hadd for those that get married to their Maharim. However, he does say that Ta’zeer is to be implemented. Ta’zeer, unlike a Hadd, is a punishment that hasn&#8217;t been defined by Allah. In other words, what Abu Hanifa is saying is that those that got married to their Maharim are to be punished for the act of marrying their Maharim, but they are not punished for the act of fornication, since the very definition of fornication requires one to not be married.<\/p>\n<p style=\"text-align: justify;\">As for this part, he translated it as:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And it is nothing upon him except to commit &#8216;ta&#8217;zeer&#8217; for those that are beneath 40.<\/span><\/p>\n<p style=\"text-align: justify;\">It should be translated as:<\/p>\n<p style=\"text-align: justify;\">&#8220;except to commit Ta`zeer below forty (lashes)&#8221;<\/p>\n<p style=\"text-align: justify;\">This particular statement is made clearer by Sufyan Al-Thawri, that was not translated fully by RTS.<\/p>\n<p style=\"text-align: justify;\">Sufyan says: فان وطئهن بغير عقد نكاح فهو زنا عليه ما على الزاني من الحد<\/p>\n<p style=\"text-align: justify;\">However, if he goes through with the sexual intercourse WITHOUT getting married, then it is considered fornication, and he receives the Hadd.<\/p>\n<p style=\"text-align: justify;\">So, as we can see, this is a very specific case in which the Qur’an does not define a punishment for. The Qur’an only defines a punishment for the latter case expressed by Sufyan Al-Thawri. So, accusing scholars of Ahl Al-Sunnah of directly contradicting the Qur’an would be out of line.<\/p>\n<p style=\"text-align: justify;\">Either way, there is nothing in texts attributed to Abu Hanifa or Sufyan that suggests that Ahl Al-Sunnah do not punish those that are involved in incest.<\/p>\n<p style=\"text-align: justify;\">The second text that is quoted by RTS is the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Note: The occasion of conflict: If he would not have a certain pure dress &#8211; and if he would have, then praying in a &#8216;mistaken&#8217; dress (i.e. unsure whether it&#8217;s pure\/impure) is not correct &#8211; as what the companions said. Secondly: The companions said: The leading (i.e. leading in prayer) of the one with a dress that is mistaken of being pure with impure. Thirdly: If his sister would be mistaken with being a strange woman and he would not investigate about it for the marriage to be correct in accordance to the Mazhab. And it was said that he should investigate it, then he could marry from a big tribe or a land.<\/span><\/p>\n<p style=\"text-align: justify;\">The above quote includes views from the Hanbali Mathhab about the lengths one needs to take certain investigations. It hypothetical scenario is drawn in which a man enters a town\/community in which he hears that he has a long lost sister. The question arises: Would it be permissible to get married to a woman from this town or not? In one opinion, it is not necessary to investigate and make sure, since it is very unlikely that she would be the same person. Another opinion is that if the community only includes ten likely candidates, then the chances are high of him getting married to his sister, in which case, it is prohibited to marry without deep investigation into the matter.<\/p>\n<p style=\"text-align: justify;\">The very issue of investigation has several degrees of difficulty. For example, if one were to get married to a woman from a certain town, however from that town he knows that he has a sister through breastfeeding. The woman that he wanted to get married to has been breastfed by several women from his same town but wasn&#8217;t sure if his mother through breastfeeding was the same person. In this case an investigation would be very difficult. Due to this, some scholars held the opinion that it is not necessary to investigate into this matter, since it is extremely unlikely for her to be the same person anyways.<\/p>\n<p style=\"text-align: justify;\">Regardless of whether this religious ruling is flawed or not, it would be more than unfair to equate this matter with that of incest, since the intentions of the man was not to have incest, and actions are only judged by their intentions.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf.org entitled: Putting The Relation Into Relationship, that was published on the 1st of June, 2012, which can be found here. RTS, in this article quotes a verse from the Qur’an <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/04\/21\/response-to-putting-the-relation-into-relationship\/\" title=\"Response to: Putting the Relation into Relationship\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-187","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/187","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=187"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/187\/revisions"}],"predecessor-version":[{"id":1577,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/187\/revisions\/1577"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=187"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=187"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=187"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}