{"id":1922,"date":"2015-05-02T09:57:15","date_gmt":"2015-05-02T09:57:15","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1922"},"modified":"2015-11-11T12:10:10","modified_gmt":"2015-11-11T12:10:10","slug":"writing-of-prophetic-narrations-and-knowledge-during-the-days-of-the-companions","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/02\/writing-of-prophetic-narrations-and-knowledge-during-the-days-of-the-companions\/","title":{"rendered":"Writing of prophetic narrations and knowledge during the days of the companions"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1922\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In the days of the companions of the Prophet (SAWS), writing wasn&#8217;t as famous as it is today, because they still relied mainly on their memory in transmitting narrations and religious knowledge. However, many of them wrote or started writing during the days of the Prophet (SAWS) and even after him, below I will translate a short summary of a chapter in the book &#8220;Dirasat fil-Hadith al-Nabawi wa Tareekh Tadweenihi&#8221; by Dr.Mustafa al-A`zami. This summarized translation contains the names of the companions who wrote the Hadith of the Prophet (SAWS) according to the research of the author. I still recommend people to read the entire book in its two volumes to gain great benefit and learn many matters related to the Sunnah.<\/p>\n<p style=\"text-align: justify;\"><u>Notes:<br \/>\n<\/u><br \/>\n-When I say the word &#8220;Sahifa&#8221; this means the book or message or couple of papers or animal skin or palm leaves or tablets that they used to write on at the time, and the plural of Sahifa is &#8220;Suhuf&#8221;.<\/p>\n<p>-I will mention the date of birth and date of death of each companion after his name, if the date of birth is unknown then I shall only mention the date of death. &#8220;BH&#8221; means Before Hijra, &#8220;AH&#8221; means After Hijra.<\/p>\n<p><strong><u>Chapter:<\/u> Companions who wrote and those who wrote from them.<br \/>\n<\/strong><\/p>\n<p><strong>1-Abu Amamah al-Bahili (raa) <em>(10.BH &#8211; 81.AH)<\/em>:<\/strong> Used to go and write knowledge(religion), was asked about writing it by al-Hassan bin Jabir and replied &#8220;No harm in that&#8221;.<br \/>\nal-Qassem al-Shami most probably wrote from him the prophetic narrations.<\/p>\n<p><strong>2-Abu Ayyub al-Ansari (raa) <em>(52.AH)<\/em>:<\/strong> Wrote to his brother&#8217;s son some prophetic narrations. Ayyub bin Khaled bin Ayyub al-Ansari narrated from his father, from his grandfather 112 narrations and they were most probably from a Sahifa.<\/p>\n<p><strong>3-Abu Bakr al-Siddeeq (raa) <em>(50.BH &#8211; 13.AH)<\/em>:<\/strong> It was reported in a weak narration from his daughter that he wrote prophetic narrations but burned them before he died, because he feared that he may transmit knowledge from a trustworthy source but it has mistakes in it. The narration was dropped because it has two unknown narrators and one heavily criticized narrator.<br \/>\nAbu Bakr was the closest man to the Prophet (SAWS) and he wouldn&#8217;t take prophetic narrations from &#8220;trustworthy men&#8221; as that narration stated simply because he accompanied the Prophet (SAWS) at all times and knew his narrations and opinions in all matters. Also that narration above even if by chance we consider it authentic for the sake of argument, then it proves that writing narrations was permissible because if the Prophet (SAWS) had forbade this then Abu Bakr wouldn&#8217;t have wrote them in the first place.<br \/>\nAbu Bakr wrote to Anas ibn Malik whom he had appointed on Bahrain, he wrote him the narrations about the Sadaqat.<br \/>\nAbu Bakr sent a written sermon to `Amro bin al-`Aas and it contained prophetic narrations.<\/p>\n<p><strong>4-Abu Bakr al-Thaqafi <em>(51.AH)<\/em>:<\/strong> Wrote a sermon to his son who was a judge in Sajistan and included in it prophetic narrations related to passing judgements.<\/p>\n<p><strong>5-Abu Rafi`(raa), the Mawla of Rassul-Allah (SAWS) <em>(died before 40.AH)<\/em>:<\/strong> Abu Bakr bin `Abdul-Rahman bin Hashim said that Abu Rafi` wrote him a book about how to begin the prayer.<br \/>\n`Abdullah ibn `Abbas was seen writing on tablets what Abu Rafi` told him from the Sunnah and conduct of the Prophet (SAWS).<\/p>\n<p><strong>6-Abu Sa`eed al-Khudari (raa) <em>(74.AH)<\/em>:<\/strong> He was famous for telling his students not to write his sayings and he narrated from the Prophet (SAWS) in this regard. al-Khateeb al-Baghdadi reported that Abu Sa`eed appears to have written some narrations for himself. Abu al-Nadir also reported from him that he wrote narrations in his letters to Ibn `Abbas.<\/p>\n<p><strong>7-Abu Shah (raa), the man from Yemen:<\/strong> After the Prophet (SAWS) finished his sermon Abu Shah asked him to have it written for him and he (SAWS) ordered his companions to write it for him.<\/p>\n<p><strong>8-Abu Musa al-Ash`ari (raa) <em>(42.AH)<\/em>:<\/strong> It is said that he opposed the writing of prophetic narrations, and that he even erased what his student wrote. It was reported from him that after Ibn `Abbas came to Basarah, Abu Musa wrote him a book and included in it some prophetic narrations.<\/p>\n<p><strong>9-<a href=\"http:\/\/twelvershia.net\/2015\/01\/11\/abu-huraira\/\" rel=\"external nofollow\">Abu Huraira<\/a> (raa) <em>(19.BH &#8211; 59.AH)<\/em>:<\/strong> It appears he had no books at first because he narrated: &#8220;No one knew more about the sayings of Rassul-Allah (SAWS) than me except for Ibn `Umar because he wrote with his hand and his heart understood it. I used to understand it with my heart but I didn&#8217;t write it.&#8221; In his last days however, it was reported al-Fadl bin al-Hassan bin `Amro bin Umayyah from his father that Abu Huraira showed him many books of Hadith in his house.<br \/>\nBachir bin Nuhayk also reported that he used to take these books from Abu Huraira to copy them and then he would recite them to him.<br \/>\nAbu Salih al-Samman wrote a Sahifa from Abu Huraira with prophetic narrations, al-A`mash then wrote from Abu Salih 1,000 narrations from Abu Huraira.<br \/>\nSa`eed al-Maqbari wrote a Sahifa from Abu Huraira.<br \/>\n`Abdul-`Azeez bin Marwan wrote to Katheer bin Murrah that: &#8220;Write to us the narrations of the companions of the Prophet (SAWS), except the narrations of Abu Huraira because we already have them.&#8221;<br \/>\n`Abdullah bin Hurmuz wrote to Tamim al-Jayyashi some of the narrations of Abu Huraira.<br \/>\nYahya ibn`Ubeidullah bin Mawhib al-Qurashi narrated from his father from what he had written from Abu Huraira.<br \/>\n`Uqbah bin abi Hasna&#8217; narrated what he had received from the copy of the written narrations of Abu Huraira.<br \/>\nMuhammad ibn Sireen wrote a book of thin pages from Abu Huraira and his followers narrated from it.<br \/>\nMarwan ibn al-Hakam, ordered his writer to write the narrations from Abu Huraira.<br \/>\nHammam bin Munbah wrote a Sahifa from abu Huraira which was printed several times and researched by doctor Muhammad Hamid-Allah.<\/p>\n<p><strong>10-Abu Hind al-Dari (raa):<\/strong> Makhoul wrote his Hadith.<\/p>\n<p><strong>11-Ubay ibn Ka`b bin Qays al-Ansari (raa) <em>(22.AH)<\/em>:<\/strong> Abu al-`Aliyah Rufay` bin Mahran wrote Hadith from him.<\/p>\n<p><strong>12-Asma&#8217; bint `Umays (raa) <em>(died after 40.AH)<\/em>:<\/strong> Married several of the biggest companions, she had a Sahifa with Hadith written in it.<\/p>\n<p><strong>13-Usayd bin Hudayr al-Ansari (raa) <em>(died in Marwan&#8217;s Caliphate)<\/em>: <\/strong>Wrote some prophetic narrations and the rulings of Abu Bakr and `Umar and `Uthman and sent them to Marwan.<\/p>\n<p><strong>14-Anas bin Malik (raa), the servant of Rassul-Allah (SAWS) <em>(10.BH &#8211; 93.AH)<\/em>:<\/strong> Served the Prophet (SAWS) for ten years, he encouraged his children to write the knowledge, and he ordered them to write the Hadith of `Atban ibn Malik.<br \/>\nIt was reported that he had many books, he would repeat the narrations and his students would write them.<br \/>\nThe narrations written by him were with some of his students in Wasit, and Anas ibn Sireen. Thamamah bin `Ubeidullah had his narrations about Sadaqat, Hameed al-Taweel wrote his narrations as well, Suleiman al-Taymi wrote 14 narrations from him, `Abdul-Malik bin `Umayr also wrote his Hadith.<br \/>\nKatheer bin Suleim used to narrate from him from a copy he had.<br \/>\nAbban bin abi `Ayyash also wrote.<br \/>\nIbrahim bin Hadabah had a copy from him.<br \/>\nKhalid bin `Ubeid al-Basri had something written from his Hadith but it was dismissed because it was un-reliable.<br \/>\nOther un-reliable texts were in the possession of his servant Kharash bin `Abdullah, Dinar bin `Abdul-Malik al-Ahwazi, Bishr bin Hussein narrated from al-Zubair bin `Aday a fabricated copy from Anas still preserved in Damascus, also `Abdullah bin Dinar had a large un-reliable copy, al-`Ala&#8217; bin Zaid and Musa bin `Abdullah al-Taweel as well.<\/p>\n<p><strong>15-Al-Bara&#8217; bin `Azib (raa) <em>(72.AH)<\/em>:<\/strong> His students used to write in his lectures.<\/p>\n<p><strong>16-Jabir bin Sumrah (raa) <em>(74.AH)<\/em>:<\/strong> Wrote some prophetic narrations and sent them to `Amir bin Sa`ad bin abi Waqqas.<\/p>\n<p><strong>17-Jabir bin `Abdullah bin `Amro bin Haram (raa) <em>(16.BH &#8211; 78.AH)<\/em>:<\/strong> Last companion to die in Madinah, from the first authors in Islam, wrote about Hajj according to Imam Muslim.<br \/>\nAbu Suffian had a Sahifa from him.<br \/>\nal-Ja`d abu `Uthman also from the book of Suleiman bin Qays.<br \/>\nal-Hassan al-Basri had a book from him.<br \/>\nSuleiman bin Qays wrote a Sahifa from him when he met him.<br \/>\n`Amir al-Shu`ubi, Qatadah and others narrated from a Sahifa containing his Hadith.<br \/>\n`Abdullah bin `Aqeel said: &#8220;Me and Muhammad bin `Ali abu Ja`far and Muhammad bin al-Hanafiyyah used to go to Jabir bin `Abdullah and ask him about the Sunnah of the Prophet (SAWS) and his prayer, we would learn from him and write down.&#8221;<br \/>\n`Ata&#8217; bin abi Rabah also narrated from what was written from him.<br \/>\nMujahid used to narrate from the Sahifa of Jabir.<br \/>\nMutraf as well.<br \/>\nMuhammad bin Muslim abu al-Zubair gave Layth two books containing Hadith he heard directly from Jabir.<br \/>\nWahb bin Munabbih had a Sahifa attributed to Jabir.<\/p>\n<p><strong>18-Jarir bin `Abdullah al-Bajali (raa) <em>(0 &#8211; 54.AH)<\/em>:<\/strong> Wrote narrations and sent them to Mu`awiyah during the famine in Armenia.<\/p>\n<p><strong>19-Hassan bin `Ali (raa) <em>(3.AH &#8211; 50.AH)<\/em>: <\/strong>Used to recommend writing prophetic narrations for those who could not memorize.<br \/>\nHe had the Fatwas of `Ali in a yellow Sahifa but it is not proven that it contained prophetic narrations.<\/p>\n<p><strong>20-Rafi` bin Khadij al-Ansari (raa) <em>(12.BH &#8211; 74.AH)<\/em>: <\/strong>Had prophetic narrations written with him.<\/p>\n<p><strong>21-Zaid bin Arqam (raa) <em>(66.AH)<\/em>: <\/strong>Wrote some prophetic Hadith and sent them to Anas bin Malik.<\/p>\n<p><strong>22-Zaid bin Thabit (raa) <em>(45.AH)<\/em>: <\/strong>Writer of the Prophet (SAWS), he was appointed by Abu Bakr al-Siddeeq to gather the Quran, later `Uthman appointed him as the writer of the Quran.<br \/>\nIt was reported in a disconnected weak narration that he opposed the writing of prophetic narrations. It was reported through al-Zuhri that Zaid wrote the obligatory acts in a book, and the introduction of this book is still preserved in al-Mu`jam al-Kabir of al-Tabarani.<br \/>\nAbu Qalabah wrote his narrations about Ruqya in a book.<br \/>\nQatadah narrated from Katheer bin al-Salt that they used to write when attending Zaid&#8217;s lectures.<br \/>\nKatheer bin Aflah said: &#8220;We used to write when we were with Zaid.&#8221;<\/p>\n<p><strong>23-Subei`ah bint al-Harith al-Aslamiyah (raa):<\/strong> Wife of Sa`ad bin Khawlah, narrated from the Prophet (SAWS) and wrote to some of the followers.<br \/>\n`Amir said that she wrote to `Abdullah ibn `Utbah narrations from the Prophet (SAWS).<br \/>\n`Umar bin `Abdullah bin al-Arqam went to her to write the narrations of the Prophet (SAWS) and then sent them to `Abdullah bin `Utbah.<br \/>\n`Amro bin `Utbah also wrote her Hadith.<br \/>\nShe also wrote to Masrouq.<\/p>\n<p><strong>24-Sa`ad bin `Ubadah al-Ansari (raa) <em>(15.AH)<\/em>:<\/strong> Used to write in Jahiliyyah, some of his family members narrated prophetic Hadith from his books.<\/p>\n<p><strong>25-Salman al-Farsi (raa) <em>(32.AH)<\/em>: <\/strong>He wrote some narrations to Abu al-Darda&#8217;.<\/p>\n<p><strong>26-Al-Sa&#8217;eb ibn Yazid (raa) <em>(2.AH &#8211; 92.AH)<\/em>:<\/strong> His student Yahya bin Sa`eed wrote some of his narrations and sent them to ibn Luhay`ah.<\/p>\n<p><strong>27-Sumrah bin Jundab (raa) <em>(59.AH)<\/em>:<\/strong> Collected the prophetic narrations in the form of a book, and he sent the letter containing prophetic narrations to his son, Ibn Sereen praised this letter by saying: &#8220;In the letter of Sumrah to his son is a lot of knowledge.&#8221;<br \/>\nFrom those who narrated his books are al-Hassan al-Basri who narrated a big copy and a part of it is still preserved in al-Mu`jam al-Kabir of al-Tabarani.<br \/>\nHis son Salman ibn Sumrah who received letters from his father as mentioned in Sunan abu Dawood, a part of the letter is also preserved in al-Mu`jam al-Kabir of al-Tabarani.<br \/>\nIbn Sereen used to praise this letter so it is assumed that he had a copy of it or he got his hands on it or a part of it.<\/p>\n<p><strong>28-Sahl bin Sa`ad al-Sa`idi al-Ansari (raa) <em>(9.BH &#8211; 91.AH)<\/em>:<\/strong> al-Zuhri, abu Hazim bin Dinar and his son `Abbas all narrated from him. Abu Hazim collected his narrations and his son narrated them.<\/p>\n<p><strong>29-Shaddad bin Awis bin Thabit al-Ansari (raa) <em>(17.BH &#8211; 58.AH)<\/em>:<\/strong> It was reported that he narrated Hadith to young men and they wrote them.<\/p>\n<p><strong>30-Abu Rayhanah al-Azdi al-Ansari (raa):<\/strong> From the important people in Damascus, `Urwah al-A`ma Mawla bani Sa`ad narrated that he sailed the seas and wrote the Suhuf.<\/p>\n<p><strong>31-Al-Dahhak bin Suffian al-Kullabi (raa):<\/strong> The Prophet (SAWS) wrote him Hadth and he wrote them in his letter to `Umar bin al-Khattab.<\/p>\n<p><strong>32-Al-Dahhak bin Qays al-Kullabi (raa) <em>(killed in 64 or 65.AH)<\/em>: <\/strong>Wrote a letter to Qays bin al-Haytham when Yazid bin Mu`awiyah died and mentioned some Ahadith in it.<\/p>\n<p><strong>33-Umm al-Mumineen `Aisha bint Abu Bakr al-Siddeeq (raa) <em>(58.AH)<\/em>:<\/strong> Wife of the prophet (SAWS) and the best female scholar this nation has ever known.<br \/>\n`Urwah ibn al-Zubair used to listen to her Hadith and then go home and write it down.<br \/>\nZiyad ibn abi Suffian wrote to her asking about some matters related to Hajj, it is not known if her answer was written or oral.<br \/>\nMu`awiyah ibn abi Suffian asked her to write him the narrations of the Prophet (SAWS) and later he asked her to write him the virtue of his cousin `Uthman.<\/p>\n<p><strong>34-`Abdullah ibn abi Awfa (raa) <em>(86.AH)<\/em>: <\/strong>Last companion to die in Kufa.<br \/>\nSalim bin abi Umayyah al-Taymi was his writer and he narrated his books.<br \/>\nAbu Hayyan said: &#8220;I heard a Sheikh in Madinah saying that `Abdullah bin abi Awfa wrote to `Ubeidullah when he intended to attack the Haruriyyah, so I told his writer, and he was my friend: Give me a copy, so he did and in it was that the prophet (SAWS) said:&#8230;&#8221;<br \/>\n`Umar bin `Ubeidullah received from him the narrations of the Prophet (SAWS).<\/p>\n<p><strong>35-`Abdullah ibn al-Zubair (raa) <em>(2.AH &#8211; 73.BH)<\/em>: <\/strong>Wrote a letter to his judge `Abdullah ibn `Utbah and in it was a Hadith from the Prophet (SAWS).<\/p>\n<p><strong>36-`Abdullah ibn `Abbas (raa) <em>(3.BH &#8211; 68.AH)<\/em>:<\/strong> Cousin of the Prophet (SAWS) and renowned Mufassir of the Quran.<br \/>\nHe used to write prophetic narrations and he ordered his servants to write with him so he collected a great deal of valuable knowledge which was unique at the time.<br \/>\nHe had a big amount of Suhuf and Tablets and papers with narrations written on them according to Musa ibn `Uqbah.<br \/>\nSometimes he himself would write for his students although he preferred the oral transmission of narrations as opposed to writing them, and in one narration he stated that the past nations were misguided because of writing, he means that they did not memorize the knowledge but were satisfied with writing it so it was lost and corrupted with the passing of time.<br \/>\nHe wrote to ibn abi Mulaykah from the book of judgement of `Ali, and he wrote him prophetic narrations.<br \/>\nal-Hakam bin Muqsim only heard four narrations orally from Ibn `Abbas and the rest was from a book.<br \/>\nSa`eed bin Jubair used to write much knowledge in the Majlis(sitting where people discuss knowledge) of Ibn `Abbas.<br \/>\n`Ali bin `Abdullah ibn `Abbas also had written Hadith from him.<br \/>\n`Ikrimah narrated the Tafseer of ibn `Abbas.<br \/>\n`Amro bin Dinar wrote narrations from him.<br \/>\nKurayb his servant had his books.<br \/>\nMujahid wrote the entire Tafseer of ibn `Abbas on tablets when he met him.<br \/>\nYazid bin Hurmuz saw ibn `Abbas writing the answers to the questions sent to him by Najdah al-Haruri.<\/p>\n<p><strong>37-`Abdullah ibn `Umar (raa) <em>(10.BH &#8211; 74.AH)<\/em>:<\/strong> Son of the second caliph, from the top scholars of his time, Malik said: &#8220;Ibn `Umar used to follow the actions and behavior and condition of the Prophet (SAWS) in great detail that the people started fearing for his brain because of the close attention he paid.&#8221;<br \/>\nNafi` said: &#8220;If you looked at the way Ibn `Umar used to follow the Prophet (SAWS) you would say: He is crazy.&#8221;<br \/>\nHe used to write prophetic narrations in his messages, he had some known books of knowledge, he also had a copy of his father&#8217;s book on Sadaqat which was a copy from the Prophet&#8217;s (SAWS) book on Sadaqat.<br \/>\nJamil bin Zaid al-Ta&#8217;ee collected his narrations from Madinah after he passed away.<br \/>\nSa`eed bin Jubair used to walk with Ibn `Abbas and Ibn `Umar and write their Ahadith.<br \/>\nHe wrote some narrations to `Abdul-`Aziz bin Marwan in his Sermons.<br \/>\nHe wrote some narrations to `Abdul-Malik bin Marwan in his Sermons.<br \/>\n`Umar bin `Ubeidullah bin Ma`mar was the ruler of Persia and he sent a letter to Ibn `Umar asking him about prayer, so he wrote for him the prophetic narrations.<br \/>\nNafi` the Mawla of Ibn `Umar wrote what he narrated in a book.<br \/>\nWrote prophetic narrations for some of his friends in Syria to use in their sermons.<\/p>\n<p><strong>38-`Abdullah bin `Amro bin al-`Aas (raa) <em>(27.BH &#8211; 63.AH)<\/em>:<\/strong> Great scholar, embraced Islam before his father.<br \/>\nHe narrated that some of the companions used to keep the narrations of the Prophet (SAWS) in books during his life.<br \/>\nHe narrated that he used to write everything he heard from the Prophet (SAWS) with his permission.<br \/>\nAbu Huraira said: &#8220;None of the companions of the Prophet (SAWS) narrated more than I, except `Abdullah ibn `Amro because he used to write and I never wrote.&#8221;<br \/>\nHe wrote a famous Sahifa and called it &#8220;al-Sadiqah&#8221;.<br \/>\nHe also collected some Fatwas of `Umar bin al-Khattab.<br \/>\nIt was reported that he had several books and Suhuf, including a Sahifa on al-Maghazi.<br \/>\nFrom those who wrote his Ahadith was Abu Subrah.<br \/>\nShu`ayb bin Muhammad bin `Abdullah bin `Amro used to narrate from a book he had from him, so did Shafi bin Nafi` and `Abdul-Rahman.<br \/>\n`Abdul-Rahman al-Jumahi said: &#8220;I heard `Abdullah ibn `Amro narrate a Hadith from the Prophet (SAWS), so I wrote it until I memorized it, then I erased it.&#8221;<br \/>\nA governor of `Abdullah bin `Amro bin al-`Aas had his Hadith, and so did `Abdullah bin Rabah al-Ansari.<\/p>\n<p><strong>39-`Abdullah ibn Mas`oud (raa) <em>(32.AH)<\/em>:<\/strong> From the first forerunners in Islam and among the greatest of companions.<br \/>\nTeacher of the scholars of Kufa, it was reported that he did not allow prophetic narrations to be written. It was narrated from Ibn Mas`oud that he only wrote the Tashahhud and the Istikhara from the Hadith during the life of the prophet (SAWS).<\/p>\n<p><strong>40-`Atban bin Malik al-Ansari (raa) <em>(Died in the time of Mu`awiyah)<\/em>:<\/strong> The Prophet (SAWS) made brother-hood between him and `Umar bin al-Khattab.<br \/>\nAnas bin Malik told his son to write down the prophetic narrations narrated by `Atban bin Malik.<\/p>\n<p><strong>41-`Ali bin abi Talib (raa) <em>(23.BH &#8211; 40.AH)<\/em>:<\/strong> Judge of the nation and warrior of Islam, he used to write the revelation.<br \/>\nHe wrote a Sahifa containing narrations from the Prophet (SAWS) tied to the scabbard of his sword. He brought it out during his conflict with Mu`awiyah because some people started claiming that the Prophet (SAWS) promised `Ali things that he never promised anybody.<br \/>\nHe brought it out in several occasions and read several narrations from it, so it could have been one Sahifa or multiple Suhuf but based on the texts of the narrations it appears to be only one as `Ali often said: &#8220;We have nothing except the Quran, and what is found in this Sahifa.&#8221;<br \/>\nIt appears though that he had a book on Sadaqat, which could be a part of the Sahifa.<br \/>\nHe also encouraged writing religious knowledge, when he said: &#8220;Who would buy knowledge for one Dirham?&#8221; then al-Harith al-A`war bought some Suhuf with one Dirham and came to `Ali so that he may write for him a lot of knowledge.<br \/>\nHis Fiqhi opinions and Fatwas seem to have been recorded since early times, maybe even during his life. Ibn `Abbas wrote some of them to Ibn abi Mulaykah. His son al-Hassan also had a collection of his father&#8217;s Fatwas and Fiqhi opinions. A third collection was reported to be in the possession of Hijr ibn `Adi.<br \/>\nFrom those who wrote the narrations of `Ali were al-Hassan bin `Ali, al-Harith al-A`war and Hijr bin `Adi bin Jabalah.<br \/>\nKhallas bin `Amro al-Hijri received some of the Suhuf of `Ali according to Abu al-Walid al-Bajili and Ahmad ibn Hanbal said that Khallas narrated from `Ali through a book.<br \/>\nAs for al-Shu`bi and `Ata&#8217; bin abi Rabah their narrations from `Ali were also through a book.<br \/>\n`Abdullah ibn `Abbas also had his Hadith in written format.<br \/>\nShu`bah said: &#8220;Mujahid from `Ali and `Ata&#8217; from `Ali are (both) taken only from a book.&#8221;<\/p>\n<p><strong>42-`Umar ibn al-Khattab (raa) <em>(40.BH &#8211; 23.AH)<\/em>:<\/strong> The adviser of The Prophet (SAWS) and the first man to be called Ameer al-Mumineen or &#8220;The chief of believers&#8221;.<br \/>\n`Urwah bin al-Zubair narrated that `Umar bin al-Khattab wanted to write the prophetic narrations, so he consulted with the companions of the Prophet (SAWS) and they advised him to write it, he then kept making Istikhara during an entire month, then one morning he made his decision, he told them: &#8220;I wanted to write down the Sunan, but I remembered nations before you, they wrote books and read them constantly and abandoned the book of Allah (swt), and by Allah I do not consider the book of Allah to be second to any other.&#8221;<br \/>\nIn another Hadith it was reported by al-Qassem bin Muhammad that he burned some books of Sunnah because he believed that the Quran was the best book and didn&#8217;t want his followers to follow in the footsteps of Ahlul-Kitab.<br \/>\nIn another narration it was reported that `Umar asked the companions not to narrate a lot about the days of the prophet (SAWS) in order to give priority to the book of Allah, and so that the people may concentrate on it to preserve its meaning and text, as opposed to the Hadith which can be memorized in terms of its meaning and not necessarily a word for word memorization of the text. Which is why he once got into an argument with Abu Huraira and Ubay bin Ka`b and Abu Dharr and Abu al-Darda&#8217; because they narrated a lot. This does not mean that their relation was bad, since `Umar in his final days would send Abu Huraira as a judge and Imam of prayer to the people of Bahrain.<br \/>\nal-Darami said while commenting on the narration above: &#8220;It means not to narrate a lot about the days of the Prophet (SAWS) and not his traditions and orders.&#8221;<br \/>\nWhich is backed by the narration of `Umar ibn al-Khattab: &#8220;Lessen the amount of narrations from the Prophet (SAWS) except for what people work with.&#8221;<br \/>\nMeaning things like orders and prohibitions.<br \/>\nAnd all these narrations are weak either way.<br \/>\nOn the other hand it was reported that `Umar ibn al-Khattab sent Ibn Mas`oud to Kufa as a teacher and an adviser and he praised his knowledge. Which means he sent him to teach religion.<br \/>\nAnd he has great reputation when it comes to spreading the Sunnah in all Muslim lands, it was reported that he said in his sermon in his final days:<br \/>\n&#8220;&#8230;O Allah you are my witness on my governors in the lands, I have sent them to teach people the religion and the Sunnah of their Prophet (SAWS)&#8230;&#8221;<br \/>\nAnd `Umar said to al-Rabi` bin Ziyad: &#8220;I did not appoint my governors over you so they can beat you or insult you or take your money, I have appointed them to teach you the book of your Lord and the Sunnah of your Prophet, so whomever among you was oppressed by my governor, he should come and complain to me and I will judge.&#8221;<br \/>\nAbu Musa al-Ash`ari told the people when he reached al-Basara: &#8220;`Umar bin al-Khattab sent me to you in order to teach you the book of your Lord and the Sunnah.&#8221;<br \/>\nMuwariq al-`Ajali said: `Umar said: &#8220;Teach the traditions and obligatory orders just like you teach the Quran.&#8221;<br \/>\nHe also wrote narrations in order to be used in official sermons, Abu `Uthman narrated: &#8220;We were with `Utbah bin Farkad (in Azerbaijan) so `Umar wrote him things from the Prophet (SAWS) and among them was: None wears silk in this life&#8230;&#8221;<br \/>\nAbu `Ubeidah bin al-Jarrah wrote to `Umar so he wrote him back: &#8220;The Prophet (SAWS) said: Allah and his prophet are the Mawla of the one who has no Mawla&#8230;&#8221;<br \/>\nIt was reported that `Umar gathered all narrations on al-Sadaqat in a book, Nafi` narrated it from Ibn `Umar several times.<\/p>\n<p><strong>43-`Amro bin Hazm al-Ansari (raa) <em>(died after 50.AH)<\/em>: <\/strong>The Prophet (SAWS) appointed him on Najran and wrote him a book containing the rulings of purity and prayer and war booty and charity and other books&#8230; `Ata&#8217; bin abi Rabah read from this book in a very late time.<br \/>\nHe also collected some letters from the Prophet (SAWS) in the form of a book, and his son narrated it from him, it was later printed with the book of Ibn Touloun &#8220;I`lam al-Sa&#8217;ileen `an Kutub Sayyid al-Mursaleen&#8221;.<br \/>\nIbn `Abbas also had collected some letters from the prophet (SAWS) and the replies to these letters.<br \/>\n`Urwah also tried to collect the letters of the prophet (SAWS) and we find some of them mentioned in the book &#8220;al-Amwal&#8221; by Ibn Zinjaweih.<\/p>\n<p><strong>44-Fatima al-Zahra&#8217; (raa) daughter of Rasul-Allah (SAWS) <em>(11.AH)<\/em>: <\/strong>She had a Sahifa with her will written on it and it included some prophetic narrations.<\/p>\n<p><strong>45-Fatima bint Qays (raa):<\/strong> Abu Salamah took her permission to write her Hadith in a book.<\/p>\n<p><strong>46-Muhammad bin Maslamah al-Ansari (raa) <em>(31.BH &#8211; 46.AH)<\/em>: <\/strong>They found in the scabbard of his sword a Sahifa containing the narrations of the Prophet (SAWS).<\/p>\n<p><strong>47-Mu`ath ibn Jabal (raa) <em>(20.BH &#8211; 18.AH)<\/em>:<\/strong> The Prophet (SAWS) sent him to Yemen and wrote him a book containing religious rulings on various issues, the book or a copy of it was in possession of Musa bin Talha.<br \/>\nIbn `A&#8217;eth had all the books of Mu`ath ibn Jabal.<\/p>\n<p><strong>48-Mu`awiyah ibn abi Suffian (raa) <em>(60.AH)<\/em>:<\/strong> Writer of revelation, and the first king of Islam.<br \/>\nHe asked companions like `Aisha and al-Mugheerah ibn Shu`bah to write him prophetic narrations.<br \/>\nHe wrote to `Abdul-Rahman bin Shibl: &#8220;Teach the people what you heard from the Prophet (SAWS).&#8221;<br \/>\nMu`awiyah used to teach people various Du`a during his sermons on the Mimbar.<br \/>\nHe wrote a sermon to Marwan and included prophetic narrations in it.<\/p>\n<p><strong>49-al-Mugheera ibn Shu`bah (raa) <em>(50.AH)<\/em>:<\/strong> Warid said: al-Mugheerah told me and I wrote in a book to Mu`awiyah: That the Prophet (SAWS) used to say:&#8230;&#8221;<\/p>\n<p><strong>50-Umm al-Mumineen Maymounah bint al-Harith (raa) <em>(0 &#8211; 51.AH)<\/em>:<\/strong> Wife of the prophet (SAWS), her servant `Ata&#8217; bin Yasar wrote from her a book with prophetic narrations.<\/p>\n<p><strong>51-Al-Nu`man bin Bashir al-Ansari (raa) <em>(2.BH &#8211; 65.AH)<\/em>:<\/strong> Was the governor of Homs, after Yazid died he turned on the Umayyads and gave a pledge of allegiance to Ibn al-Zubair, he was later killed in the rebellion of the people of Homs.<br \/>\nHe wrote a sermon to Qays bin al-Haytham which included prophetic narrations.<br \/>\nAlso wrote a sermon to al-Dahhak bin Qays which included prophetic narrations.<br \/>\nHabib bin Salim was the writer of al-Nu`man so he sent his narrations to his son Yazid bin al-Nu`man bin Bashir.<br \/>\nHabib bin Salim also wrote some of his narrations and sent them to Qatadah.<\/p>\n<p><strong>52-Wathilah ibn al-Asqa` <em>(22.BH &#8211; 83.AH)<\/em>:<\/strong> Used to teach his students Hadith and they would write it down.<\/p>\n<p>&#8211; END &#8211;<\/p>\n<p>Source: Volume 1 of the book: &#8220;Dirasat fil-Hadith al-Nabawi wa Tareekh Tadweenihi&#8221;, Section 4, chapter 1, by Dr.Mustafa al-A`zami.<\/p>\n<p>Translated by Hani al-Tarabulsi al-Shafi`i.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In the days of the companions of the Prophet (SAWS), writing wasn&#8217;t as famous as it is today, because they still relied mainly on their memory in transmitting narrations and religious knowledge. However, many of them wrote or started writing <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/02\/writing-of-prophetic-narrations-and-knowledge-during-the-days-of-the-companions\/\" title=\"Writing of prophetic narrations and knowledge during the days of the companions\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-1922","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1922","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1922"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1922\/revisions"}],"predecessor-version":[{"id":2740,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1922\/revisions\/2740"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1922"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1922"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1922"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}