{"id":1926,"date":"2015-05-02T10:38:18","date_gmt":"2015-05-02T10:38:18","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1926"},"modified":"2017-02-16T21:24:39","modified_gmt":"2017-02-16T21:24:39","slug":"abu-bakr-and-the-prohibition-of-documenting-hadiths","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/02\/abu-bakr-and-the-prohibition-of-documenting-hadiths\/","title":{"rendered":"Abu Bakr and the Prohibition of Documenting Hadiths"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1926\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Abu Bakr and the Prohibition of Documenting Hadiths<\/p>\n<p style=\"text-align: justify;\">One of the most dangerous criticisms towards Abu Bakr Al-Sideeq &#8211; may Allah be pleased with him &#8211; is the suggestion that he banned and burned Hadiths. These suggestions surely place <a href=\"http:\/\/twelvershia.net\/2015\/01\/27\/book-virtues-hazrat-abu-bakr\/\" rel=\"external nofollow\">Abu Bakr<\/a> in a negative light, for it implies that he was against the documentation of the laws that were introduced and explained by the Prophet – peace be upon him.<\/p>\n<p style=\"text-align: justify;\">After studying the works of Ali Al-Shihristani in his “Prohibition of Recording the Hadith”, Dr. Ali Mahdi Mahdawi’s “Tadween Al-Hadith”, and Al-Jalali’s “Tadween Al-Sunnah Al-Shareefah”, we decided to share the arguments for this allegation and our response.<\/p>\n<p style=\"text-align: justify;\"><strong>Evidences for the Prohibition of Hadith<\/strong><\/p>\n<p style=\"text-align: justify;\">All three authors quote the exact two narrations. The first narration is one where Abu Bakr burns Hadiths that he had collected himself in the Prophet’s life. This cannot be interpreted as a ban, but as a personal position towards Hadith transmission, since this was his own collection and we doubt the Shiites would claim that Abu Bakr was collecting Ali’s virtues in those papers. The second narration though is a clear ban on Hadiths, not only documentation, but transmission.<\/p>\n<p style=\"text-align: justify;\">We list the two narrations below starting with the first one:<\/p>\n<p style=\"text-align: justify;\">1- It has been narrated that A’ishah said: My father collected the Hadith (of the Messenger of Allah), which was five hundred texts. He spent that night so sleeplessly and restlessly that I was sad for him. I therefore asked, “Are you moving restlessly due to an ailment or news that you received?” In the morning, he asked me to fetch the collection of Hadith that he had placed with me. When I fetched them, he set fire to them. As I asked for the reason, he replied, “I anticipated that I would die while I still have this collection among which there might be reports of a man that I deemed trustworthy while he was the opposite; therefore, I would be the narrator of such false reports.”<\/p>\n<p style=\"text-align: justify;\">2- After the demise of the Holy Prophet, Abu Bakr gathered people and said, “You are reporting about the Messenger of Allah inconsistent narrations. People coming after you will be engaged in more intense discrepancy. Therefore, do no report anything about the Messenger of Allah, and if anyone asks you, you should refer to the book of Allah as the arbitrator. You should thus deem lawful whatever is lawful therein and deem unlawful whatever is unlawful therein.”<\/p>\n<p style=\"text-align: justify;\">All three Shia scholars provided these two Hadiths as the only evidence that Abu Bakr prohibited and burned Hadiths. They all quoted Al-Dhahabi’s Tadhkirat Al-Hufadh 1\/9-11 as their source for these narrations. We find by returning to these two narrations that Al-Dhahabi has weakened them both. He comments about the first that it is “not authentic”, and that the second is disconnected.<\/p>\n<p style=\"text-align: justify;\">All three of these men use this as evidence that Abu Bakr called for the banning of Hadith narrations without any attention given to Al-Dhahabi’s ruling about their weakness.<\/p>\n<p style=\"text-align: justify;\">Al-Jalali was the only person to provide a short comment. He quotes Al-Mu’allimi the Sunni Hadithist in his Anwar Al-Kashifa: Al-Dhahabi mentioned this narration, and we don’t know his chain to Ibn Abi Mulaika, and Al-Dhahabi mentioned that it is <em>mursal<\/em>, meaning: disconnected, because Ibn Abi Mulaika never met Abu Bakr, not even close, and that this is not evidence, since we don’t know who he heard it from.<\/p>\n<p style=\"text-align: justify;\">Al-Jalali responds: Al-Dhahabi knows what he is quoting, and if it was not reliable, then why quote it in the biography of Abu Bakr?!<\/p>\n<p style=\"text-align: justify;\">See Tadween Al-Sunnah Al-Shareefa (p. 266).<\/p>\n<p style=\"text-align: justify;\">As one can see Al-Jalali’s blind hatred for Abu Bakr caused him to vehemently argue that everything in a narrator’s biography is authentic, even if the author points out the weakness! Perhaps Al-Jalali would also be satisfied if we all graded the narrations that the closest companions of the Imams were liars, as we find that to be the case in Rijal Al-Kashshi, since every narration is in biographical collections are supposedly authentic according to their respective authors!<\/p>\n<p style=\"text-align: justify;\">These three Shiite authors were so desperate in order to prove that Abu Bakr prohibited Hadith narrations but were unable to present us with any more than these two chainless reports.<\/p>\n<p style=\"text-align: justify;\"><strong>Al-Jalali Implies that Abu Bakr did not prohibit the Documentation of Hadiths<\/strong><\/p>\n<p style=\"text-align: justify;\">Urwa bin Al-Zubair reported that Omar wanted to write the Hadiths, but ultimately decided not to.<\/p>\n<p style=\"text-align: justify;\">Al-Jalali comments by saying that (p. 272), “this is evidence that writing was not banned, nor prohibited in origin, for if it were, then how would Omar want to write the traditions?!”<\/p>\n<p style=\"text-align: justify;\">He says again on p. 430 that “Omar was the first to publicly prohibit the documentation of Hadith.”<\/p>\n<p style=\"text-align: justify;\">Al-Jalali, therefore, admits that it was not Abu Bakr that prohibited Hadith documentation, but that it was Omar who did so. We will take a look at the allegations against Omar in the next chapter – Allah willing &#8211; .<\/p>\n<p style=\"text-align: justify;\"><strong>Evidences for the Permissibility of Recording and Transmitting Hadiths<\/strong><\/p>\n<p style=\"text-align: justify;\">After disregarding the weak narrations provided above, we come to the facts about Abu Bakr’s view of Hadiths.<\/p>\n<p style=\"text-align: justify;\">Abu Bakr himself narrated many Hadiths from the Prophet peace be upon him. Ibn Hazm mentions that the number is a hundred and forty two narrations. See Asma’ Al-Sahaba Al-Ruwat (p. 57) and review our article about the “<a href=\"http:\/\/twelvershia.net\/2013\/07\/20\/the-narrators-amongst-the-companions\/\" rel=\"external nofollow\">Narrators amongst the Companions<\/a>”.<\/p>\n<p style=\"text-align: justify;\">Al-Ala’ee states that Abu Bakr’s Hadiths in the Saheehain are eighteen in total. See Kashf Al-Niqab (p. 116).<\/p>\n<p style=\"text-align: justify;\">In regards to Hadith documentation, it has been narrated by Anas bin Malik in Saheeh Al-Bukhari #1454 that Abu Bakr documented a long Hadith in how one is to take the alms when it comes to animals.<\/p>\n<p style=\"text-align: justify;\"><strong>Al-Shihristani’s Attempt to Respond to Narrations that Abu Bakr Documented Hadiths<\/strong><\/p>\n<p style=\"text-align: justify;\">He argues that this narration does not contradict the burning of Hadiths: The reports that Abu Bakr had written down the laws of alms giving in the message that he sent to Anas bin Malik; the governor of Bahrain at that time and the letter to Amr bin Al-Aas, do not contradict the reports narrating his setting fire of the collections of Hadith, because the point that he had recorded to Anas ibn Malik were no more than the laws of alms giving and taxation upon which a state relies, and a Caliph must not ignore for the good of his state.” (p. 19)<\/p>\n<p style=\"text-align: justify;\">Indeed, the response by Al-Shihristani is a cheap attempt to reconcile two opposing accounts of Abu Bakr’s view of Hadith documentation. Such loose reconciliations are only to be made when both narrations are on equal footing, not when one is in Saheeh Al-Bukhari whilst the other lacks a Hadith chain.<\/p>\n<p style=\"text-align: justify;\">Al-Shihristani’s poor attempt at reconciliation could only be used for the example of Anas’ narration though, and he could not extend this to the narration of Amr bin Al-Aas, since the narration of Amr bin Al-Aas had nothing to do with taxation, but rather, it is about providing good treatment for the Ansar.<\/p>\n<p style=\"text-align: justify;\">Note: Al-Shihristani did not include the correct source of this narration, perhaps to keep readers in the dark from the actual text of the Hadith, or simply due to incompetence. He stated that it is in the “Muwatta (A)”, and that he had quoted this from Al-Dirasat (by M. M. A`zami). However, when returning to A`zami’s book, we find him quoting Al-Tabarani’s Kabeer (A). The (A) refers to the first volume since the companions in this volume all have names that start with the letter Alif (A). Abu Bakr and the other nine promised heaven are all in this volume. There is no (A) volume in Al-Muwatta.<\/p>\n<p style=\"text-align: justify;\">And praise be to Allah the Most Gracious and Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Abu Bakr and the Prohibition of Documenting Hadiths One of the most dangerous criticisms towards Abu Bakr Al-Sideeq &#8211; may Allah be pleased with him &#8211; is the suggestion that he banned and burned Hadiths. These suggestions surely place Abu <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/02\/abu-bakr-and-the-prohibition-of-documenting-hadiths\/\" title=\"Abu Bakr and the Prohibition of Documenting Hadiths\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[17],"class_list":{"0":"post-1926","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-abu-bakr"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1926","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1926"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1926\/revisions"}],"predecessor-version":[{"id":2732,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1926\/revisions\/2732"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1926"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1926"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1926"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}