{"id":1930,"date":"2015-05-04T18:01:27","date_gmt":"2015-05-04T18:01:27","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1930"},"modified":"2015-08-06T21:46:10","modified_gmt":"2015-08-06T21:46:10","slug":"omar-and-the-prohibition-of-hadith-documentation","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/04\/omar-and-the-prohibition-of-hadith-documentation\/","title":{"rendered":"Omar and the Prohibition of Hadith Documentation"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1930\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Carrying on our little series on the prohibition of Hadiths by the companions of the Prophet – peace be upon him &#8211; , we examine the evidences brought by Shia scholars who have alleged that Omar banned Hadiths.<\/p>\n<p style=\"text-align: justify;\"><strong>Evidences for Prohibition of Hadith Documentation by Omar<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Shihristani quotes the three narrations in order to establish a banning on Hadiths by Omar. These narrations are as follows (p. 21-22):<\/p>\n<p style=\"text-align: justify;\">1- It has been narrated on the authority of `Urwah ibn al-Zubayr that when Omar had intended to record the Holy Sunnah, he consulted the companions of the Holy Prophet, and they advised him to record. For about a month, Omar set to seek Almighty Allah’s proper guidance in this regard. One morning, after Allah had decided for him, Omar said, ‘I had intended to record the Holy Sunnah, but I remembered some past nations who applied themselves completely to the items they had written and, as a result, neglected the Book of Almighty Allah. By Allah I swear! I will never allow anything to interfere with the Book of Allah.’<\/p>\n<p style=\"text-align: justify;\">2- Yahya ibn Ju`dah narrated that after Omar ibn al-Khattab had intended to record the Holy Sunnah, he changed his mind and distributed a missive in the countries ordering people to erase any item of the Holy Sunnah that they might have recorded.<\/p>\n<p style=\"text-align: justify;\">3- It has been narrated on the authority of al-Qasim ibn Muhammad ibn Abu-Bakr that Omar, after he had received news confirming that people started to hold (or write) books, denied and disliked the matter saying, ‘O people: I have been informed that you have started to hold books. Allah’s most beloved books must be the fairest and the straightest. Now, I order you all to bring me all the books that you hold so that I will decide about them.’ Thinking that Omar wanted to correct and submit the books to a certain criterion, all people brought their books to him. Instead, he set them all to fire and said, ‘This is a false wish just like that of the Christians and the Jews.’<\/p>\n<p style=\"text-align: justify;\">Al-Shihristani adds: According to Ibn Sa`d, in his al-Tabaqat al-Kubra, Omar said, ‘This is a Mishna just like that of the Christians and the Jews.’<\/p>\n<p style=\"text-align: justify;\">Firstly, all three of these narrations are disconnected since none of these men lived during the time of Omar. Urwa bin Al-Zubair was the oldest of the three and was born during the time of Uthman. Al-Qasim bin Mohammad was born in the last year of Uthman’s reign or during the beginning of Ali’s reign. Yahya bin Ju’dah youngest of the three.<\/p>\n<p style=\"text-align: justify;\">Moreover, the first narration, which is the strongest of the three, does not suggest a prohibition on Hadith documentation. It merely describes Omar’s own personal decision to not write the Hadiths. The narration in Arabic ends with Omar saying:<\/p>\n<p style=\"text-align: justify;\">إني كنت أردت أن أكتب السنن&#8230; وإني والله لا ألبس كتاب الله بشيء أبدا<\/p>\n<p style=\"text-align: justify;\">“I wanted to write the traditions… and I, by Allah, will not mix with the book of Allah anything ever.”<\/p>\n<p style=\"text-align: justify;\">The second and third narrations are evidences for prohibition of documentation, however, as we have stated, they are disconnected.<\/p>\n<p style=\"text-align: justify;\">The third narration, the one by Al-Qasim bin Mohammad, is also an impossible narration, given the interpretation provided by Al-Shihristani and co., for it is an impossibility for Omar to have been able to swindle all the Muslims into collecting all their Hadith books before burning them. The narrations suggests that Omar “had received news confirming that people started to hold (or write) books.” This implies that Omar was not aware that people documented Hadiths, which is also impossible.<\/p>\n<p style=\"text-align: justify;\">Most importantly, if this event really did occur, then it would have been a famous narration with multiple authentic chains, due to the gravity of the matter, which is why we find many narrations about Uthman’s burning of the <em>masahif<\/em>, unlike this single disconnected uncorroborated report.<\/p>\n<p style=\"text-align: justify;\"><strong>Evidences of Permissibility of Hadith Documentation by Omar<\/strong><\/p>\n<p style=\"text-align: justify;\">On the other hand, there are other narrations that suggest that Omar did write Hadiths. These include:<\/p>\n<p style=\"text-align: justify;\">1- Omar wrote to Utbah bin Farqad what the Prophet &#8211; peace be upon him – said about the prohibition of wearing silk. (Saheeh Al-Bukhari #5828.)<\/p>\n<p style=\"text-align: justify;\">2- Omar was told by Abdulrahman bin Awf that the Prophet – peace be upon him – took taxes from the Majoos, so he wrote to Jaz’ bin Mu’awiyah that narration ordering him to take taxes from them. (Sunan Abi Dawud #3043 – Authentic chain.)<\/p>\n<p style=\"text-align: justify;\">3- Omar wrote a Hadith to Abu Ubaidah about an uncle’s inheritance according to the Prophet – peace be upon him &#8211; . (Sunan Al-Tirmithi #643. Al-Tirmithi said: Hasan.)<\/p>\n<p style=\"text-align: justify;\">M. A`zami also quotes in his Dirasat fi Al-Hadith Al-Nabawi (p. 92-142) the names of fifty two companions that have documented narrations. His study includes eye witness accounts of these documents, its contents, and at times the names of those that have received these texts. This purely contradicts the idea of a prohibition of Hadith documentation.<\/p>\n<p style=\"text-align: justify;\"><strong>Counter Argument and Rebuttal<\/strong><\/p>\n<p style=\"text-align: justify;\">A Shi’ee may attempt to reconcile all the above by arguing that the evidences of Omar’s documentation of narrations were a double standard and that he didn’t adhere to his own banning. Shias may also argue that the evidences of documentation by companions were done privately away from the eyes of the government that imposed the ban.<\/p>\n<p style=\"text-align: justify;\">In response, we say that one would need to first establish the existence of a ban before attempting to reconcile these narrations. One only seeks to reconcile between apparently contradicting events if they were equal in strength, which is not the case in this situation.<\/p>\n<p style=\"text-align: justify;\">And praise be to Allah the Most Gracious and Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Carrying on our little series on the prohibition of Hadiths by the companions of the Prophet – peace be upon him &#8211; , we examine the evidences brought by Shia scholars who have alleged that Omar banned Hadiths. Evidences for <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/04\/omar-and-the-prohibition-of-hadith-documentation\/\" title=\"Omar and the Prohibition of Hadith Documentation\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[18],"class_list":{"0":"post-1930","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1930","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1930"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1930\/revisions"}],"predecessor-version":[{"id":1979,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1930\/revisions\/1979"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1930"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1930"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1930"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}