{"id":1977,"date":"2015-05-07T19:10:59","date_gmt":"2015-05-07T19:10:59","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1977"},"modified":"2015-11-11T12:10:48","modified_gmt":"2015-11-11T12:10:48","slug":"omar-and-the-prohibition-of-hadith-narration","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/07\/omar-and-the-prohibition-of-hadith-narration\/","title":{"rendered":"Omar and the Prohibition of Hadith Narration"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1977\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">This article contains the most dangerous allegation in our series about the banning of Hadith documentation and narration, since the focus changes from the common allegation that the caliphs banned documentation, and extended it to contain all narrations. This allegation is also the weakest out of the allegations in our series due to the amount of counter-evidences.<\/p>\n<p style=\"text-align: justify;\">Omar bin Al-Khattab, the second caliph of Islam, was one of the main narrators of Hadith, to the extent that he narrated five hundred and thirty-seven Hadiths according to Ibn Hazm in his Asma’a Al-Sahabah Al-Ruwat (p. 44). Al-Ala’ee in his Kashf Al-Niqab counted eighty-one narrations in the Saheehain alone. How is it possible that this avid Hadith narrator could be considered to be anti-Hadith? Below we include narrations that can be split up into different categories:<\/p>\n<p style=\"text-align: justify;\">&#8211; Evidences that Omar Detained Hadith Narrators<\/p>\n<p style=\"text-align: justify;\">&#8211; Omar Forbade Companions from Narrating Hadiths<\/p>\n<p style=\"text-align: justify;\">&#8211; Omar was a Qur’an-only Muslim<\/p>\n<p style=\"text-align: justify;\">&#8211; And finally a section on: How Shias try to make sense of the Contradicting Narrations about Omar’s Alleged Prohibitions.<\/p>\n<p style=\"text-align: justify;\"><strong>Evidences that Omar Detained Hadith Narrators <\/strong><\/p>\n<p style=\"text-align: justify;\">1-  It has been narrated on the authority of Sa`d ibn Ibrahim on the authority of his father that Omar detained three individuals in the charge of much reporting from the Holy Prophet. These three were `Abdullah ibn Mas`ud, Abu’l-Darda&#8217; and Abu-Mas`ud al-Ansari.<\/p>\n<p style=\"text-align: justify;\">2- Al-Khatib al-Baghdadi, in Sharaf Ashab al-Hadith, has recorded that Omar ibn al-Khattab, once, summoned `Abdullah ibn Mas`ud, Abu’l-Darda&#8217; and Abu-Mas`ud and said to them, “Why are you reporting so much from the Messenger of Allah?” He then detained then in al-Madinah.<\/p>\n<p style=\"text-align: justify;\">3- It has been narrated on the authority of Sa`d ibn Ibrahim on the authority of his father that Omar reproached `Abdullah ibn Mas`ud, Abu’l-Darda&#8217;, and Abu-Dharr for they have reported too much from the Holy Prophet. He then detained them in al-Madinah until his death.<\/p>\n<p style=\"text-align: justify;\">4- `Abd al-Rahman ibn `Awf is reported as saying, Before his death, Omar ibn al-Khattab ordered the companions of the Messenger of Allah, namely `Abdullah (ibn Mas`ud), Hudhayfah, Abu’l-Darda&#8217;, Abu-Dharr, and `Uqbah ibn `Āmir, to be present before him although they lived in remote countries. He then reproached them for having spread the traditions of the Messenger of Allah in these countries. “Are you now preventing us from such?” asked they. “No, I do not,” answered Omar. “Yet, you will reside here, and you will never depart me so long as I am alive. I am more knowledgeable. I will hear from you and reply.” Hence, they could not leave the capital until the death of Omar.<\/p>\n<p style=\"text-align: justify;\">(The Prohibition of Recording the Hadith by Al-Shihristani p. 143-144)<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong><\/p>\n<p style=\"text-align: justify;\">Even though Ali Al-Shihristani wants to make it appear as though there have been many reports of Omar detaining Hadith narrators in Al-Madinah, we actually find that all these narrations are in fact one narration by Ibrahim bin Abdulrahman bin Awf, including the fourth narration, since when we return to Tareekh Dimashq, we find that the narration is from Salih bin Ibrahim bin Abdulrahman bin Awf from his father, and not a narration by Abdulrahman bin Awf himself.<\/p>\n<p style=\"text-align: justify;\">All narrations are authentic up to Ibrahim bin Abdulrahman, however, it seems that the differences when it comes to the names of who was detained in Madinah was a difference due to narrators.<\/p>\n<p style=\"text-align: justify;\">As for Ibrahim bin Abdulrahman, there is a difference of opinion as to whether he narrated from Omar or not. According to Al-Kalabathi, he was born in the year 21, two years before the death of Omar. See Ikmal Tahtheeb Al-Kamal 1\/244. Al-Haythami also comments that Ibrahim was born in the years 20, and that he was only around for the first three years of Omar’s life, which makes the narration weak.<\/p>\n<p style=\"text-align: justify;\">Ironically, the last narration clearly states that Omar did not prohibit narrating narrations within Al-Madinah, so that he might get a chance to respond to mistakes in narrations. If this was an outright ban, they would not have the pleasure of narrating Hadiths at all.<\/p>\n<p style=\"text-align: justify;\">As for the word “detained” it doesn’t mean they were jailed or imprisoned, it means that he just wished for them to be in Madinah alongside him so he may keep track of what they narrate.<\/p>\n<p style=\"text-align: justify;\">Regardless, Al-Mu’allimi comments in Al-Anwar Al-Kashifa (p. 55) that “there is a difference of opinion as to whether Ibrahim bin Abdulrahman bin Awf heard from Omar, and it seems as though he didn’t. Also, those people were only some of the Sahabah, and many other Sahabah in the lands were narrating.”<\/p>\n<p style=\"text-align: justify;\">Indeed, Al-Mu’allimi’s argument is a solid one, for there were many companions spread across the land that narrated Hadiths, and if this was an outright Hadith ban, then all the companions would have been ordered to stay in Madinah, instead of three or five companions only.<\/p>\n<p style=\"text-align: justify;\">More importantly, Ibn Mas`oud who was the main narrator and at the top of the list, he was Omar’s student and he narrated Omar’s Fiqh and greatly praised him after his death.<\/p>\n<p style=\"text-align: justify;\"><strong>Omar Forbade Companions to Narrate Hadiths <\/strong><\/p>\n<p style=\"text-align: justify;\">1- Omar said to Qardha bin Ka’ab: You are approaching a people whose tongues share with the Qur’an like the swinging of bees, and if they saw you they will spread their necks out to you and ask you for Hadiths. So don’t narrate much from the Messenger of Allah – peace be upon him – and I am your partner (in this).<\/p>\n<p style=\"text-align: justify;\">2- Omar suggested the same to Abu Musa. (This narration is the same narration as the above, except that the name of the companion was changed to Abu Musa.)<\/p>\n<p style=\"text-align: justify;\">3- Omar said to <a href=\"http:\/\/twelvershia.net\/2015\/01\/11\/abu-huraira\/\" rel=\"external nofollow\">Abu Huraira<\/a>: You will stop narrating from the Messenger – peace be upon him – or I will exile you to the land of Daws (in Yemen).<\/p>\n<p style=\"text-align: justify;\">(Tadween Al-Sunnah Al-Shareefa by Al-Jalali p. 430 – 433.)<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong><\/p>\n<p style=\"text-align: justify;\">The above narrations contradict the suggestion that Omar banned Hadiths, for if he were to ban Hadiths, then he would not ask Qardha to lessen narrating, but would rather force them to stop narrating completely.<\/p>\n<p style=\"text-align: justify;\">The same applies to his threat towards Abu Huraira. It is authentic and contradicts the narration of the detainment of companions. In this narration, we find that Omar threatened to exile those who narrated too many narrations.<\/p>\n<p style=\"text-align: justify;\">Of course Omar being the one in charge of the people feared that if people narrated too much they would make many mistakes due to forgetfulness or ignorance or misunderstandings thus causing problems and differences among the people. Therefore, Omar would recommend that people concentrate on the Qur’an mainly and lessen the narrations.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Omar was a Qur’an-only Muslim<\/strong><\/p>\n<p style=\"text-align: justify;\">1- Omar said: If one of you will stand, then let him stand with the Qur’an, or let him sit. You have narrated to the people until they said: So and so said, and so and so said! And they have left the book of Allah!<\/p>\n<p style=\"text-align: justify;\">2- Omar said when the Prophet – peace be upon him – was on his death bed, “The book of Allah is sufficient for us.”<\/p>\n<p style=\"text-align: justify;\">(Tadween Al-Sunnah Al-Shareefa by Al-Jalali p. 433– 434.)<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong><\/p>\n<p style=\"text-align: justify;\">The first narration does not imply a ban on narrations, but rather, it is a condemnation on quoting other men for religious rulings instead of the book of Allah. There is no indication that this narration refers to the Sunnah.<\/p>\n<p style=\"text-align: justify;\">The second narration occurred during the famous “Pen and Paper Event” that Shias often quote. The special circumstance cause Omar to utter these words, and we will take a look at this event in a separate article &#8211; Allah willing &#8211; .<\/p>\n<p style=\"text-align: justify;\">Furthermore, Omar was known to place the Hadith of the Prophet – peace be upon him – ahead of his personal judgment. He said (Saheeh Al-Bukhari #1502) to the black stone in the Ka’aba, “By Allah if I did not see the Messenger of Allah – peace be upon him – kiss you, then I would not have kissed you.” He then kissed it.<\/p>\n<p style=\"text-align: justify;\">Omar also said (#1502), “Why do we jog (between Al-Safa and Al-Marwa during the pilgrimage)? We did that to show off in front of the disbelievers, but Allah has destroyed them,” He said, “It is something that the Prophet – peace be upon him – did, and we do not like to leave what he did.<\/p>\n<p style=\"text-align: justify;\"><strong>How Shias try to make sense of the Contradicting Narrations Above<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Shihristani (p. 187) noticed that these narrations conflict with each other. One narration suggests a total ban, while others suggest a limitation of narration. Due to this, he arrived at a more moderate conclusion than other Shias. He said:<\/p>\n<p style=\"text-align: justify;\">“On other occasions, Omar ordered the Sahabahh to reduce reporting from the Holy Prophet except in common questions. The purpose beyond the prevention in the earlier narration is too clear to require explanation; Omar disliked seeing the Hadith expansively widespread so that the errors and jurisprudential defects of his government and him would not be known to everybody. In the latter narration, Omar permitted reporting the Hadiths that discuss common questions that are known to all Muslims. Alternatively, it is impermissible to report Hadiths unknown for the people and, perhaps, for Omar himself since such Hadiths would possibly be contrary to his personal opinions and Ijtihad and thus a problem would occur to the ruling system, which is seen as the religious authority of the Islamic community.”<\/p>\n<p style=\"text-align: justify;\">Al-Shihristani’s conclusion that Omar’s ban was in reality an order to lessen the amount of narrations is a correct one. However, Omar’s motive was not because he didn’t want narrations to contradict his opinion.<\/p>\n<p style=\"text-align: justify;\">Omar also had a ruling when it came to the ruling of how much one has to pay as a compensation for chopping off someone’s finger. He then changed his view once he heard of the book that was written to Ibn Hazm by the Prophet – peace be upon him – about the correct compensation. (Musanaf Abdulrazaq #17706 – Authentic.)<\/p>\n<p style=\"text-align: justify;\">Al-Shihristani also quotes several narrations that show that Omar was in fact very open minded to those that opposed him, especially when they present narrations.<\/p>\n<p style=\"text-align: justify;\">These narrations include:<\/p>\n<p style=\"text-align: justify;\">&#8211; Mu’adh corrects Omar’s opinion by quoting the Prophet – peace be upon him &#8211; in a matter regarding punishing a non-Muslim for attacking a Muslim.<\/p>\n<p style=\"text-align: justify;\">&#8211; Ubay corrects Omar by quoting actions by the Prophet – peace be upon him – in matters regarding the pilgrimage.<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Dhahak bin Sufyan corrects Omar by quoting the Prophet – peace be upon him – in a matter regarding inheritance.<\/p>\n<p style=\"text-align: justify;\">&#8211; Shaibah bin Uthman corrects Omar by quoting actions by the Prophet – peace be upon him – in matters regarding charity.<\/p>\n<p style=\"text-align: justify;\">&#8211; Ali bin Abi Talib corrects Omar by quoting actions by the Prophet – peace be upon him – in matters regarding infidelity.<\/p>\n<p style=\"text-align: justify;\">In all of these situations, Omar changes his opinion in order to conform to the prophetic Hadiths.<\/p>\n<p style=\"text-align: justify;\">Al-Shihristani finally argues, “As has been previously demonstrated, Omar’s compliance with the Sahabah’s opinions appertained to the religious laws, as well as the evidences that they used to infer from the Holy Qur&#8217;an and Sunnah, proves that he, on the first days of his reign, did not argue with them on their verdicts and proofs; yet, <strong>he, later on, changed his trend by confirming his personal opinions. <\/strong>He thus granted the caliphs a distinctive feature due to which they alone have had the right to issue religious verdicts.”<\/p>\n<p style=\"text-align: justify;\">See Al-Shihristani’s “Prohibition of Hadith” (p. 94-98).<\/p>\n<p style=\"text-align: justify;\">In other words, according to Al-Shihristani, Omar was an open minded caliph during the early years of his reign, but ended up changing his view to become anti-Hadith towards the end of his years. This is demonstrated, according to Shia authors with him detaining companions within Al-Madinah, prohibiting them from narrating what was not famous and known by him, and limiting narrations altogether.<\/p>\n<p style=\"text-align: justify;\">However, we find no proof from the evidences quoted by the Shia scholars that suggested this change of heart by Omar. Even the most extreme narration of him detaining companions within Al-Madinah, assuming its authenticity, clearly shows that Omar allowed them to narrate Hadiths, without limitations. Ironically, keeping them within Al-Madinah would only cause more “embarrassment” for Omar, if they continued to correct him in his rulings with Hadiths, which would be an extremely self-destructive move by Omar. This only makes Al-Shihristani’s hypothesis seem weaker.<\/p>\n<p style=\"text-align: justify;\">Furthermore, the conclusions that Al-Shihristani arrived at cannot be reconciled with Omar’s limiting of the narrations of Qartha bin Ka’ab, nor has he the ability to prevent his narrations when he is all the way in Kufah. The same can be said about the suggested exiling of Abi Huraira to Yemen.<\/p>\n<p style=\"text-align: justify;\">Al-Shihristani (p. 187) though only came up with this conclusion in light of a single disconnected narration by Al-Zuhri. In it Omar orders to “limit narration from the Messenger except those that are acted upon.” (Musanaf Abdulrazaq #20496 – Authentic to Al-Zuhri.)<\/p>\n<p style=\"text-align: justify;\">The text gave Al-Shihristani the leeway to argue that Omar was against all narrations except for those that are “acted upon”. By “acted upon” Al-Shihristani explains that these are narrations that are practiced by Muslims are known by the caliph.<\/p>\n<p style=\"text-align: justify;\">This interpretation is faulty since the apparent interpretation is that “acted upon” refers to narrations of laws, as opposed to narrations about the daily life of the Prophet – peace be upon him – that do not include any weight legislatively speaking. This interpretation is endorsed by the Shi’ee Al-Jalali (p. 476) in his “Tadween Al-Sunnah Al-Shareefah”.  These narrations of laws can be narrated regardless as to whether Omar knew of them or not.<\/p>\n<p style=\"text-align: justify;\">Most importantly, Al-Shihristani once again falls into the trap of attempting to reconcile contradicting “versions” of Omar by arguing that Omar went through different phases. As we have repeated in our earlier articles, these narrations, views, and “versions” are only to be reconciled when they are equal in weight. In this scenario, the open-mindedness of Omar to follow Hadiths strongly outweighs the narrations that suggest that he limited traditions to that which were known, or that he detained companions for narrating Hadiths that didn’t bode well with him.<\/p>\n<p style=\"text-align: justify;\">As for those that are of the extreme opinion that Hadith were banned so that the merits of Ali would not be known, please refer to our original article in the series for a narration in which Omar narrates a merit of Ali.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah – the Most Gracious Most Merciful &#8211; .<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This article contains the most dangerous allegation in our series about the banning of Hadith documentation and narration, since the focus changes from the common allegation that the caliphs banned documentation, and extended it to contain all narrations. This allegation <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/07\/omar-and-the-prohibition-of-hadith-narration\/\" title=\"Omar and the Prohibition of Hadith Narration\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-1977","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1977","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1977"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1977\/revisions"}],"predecessor-version":[{"id":2742,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1977\/revisions\/2742"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1977"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1977"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1977"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}