{"id":1989,"date":"2015-05-10T07:52:46","date_gmt":"2015-05-10T07:52:46","guid":{"rendered":"http:\/\/twelvershia.net\/?p=1989"},"modified":"2015-08-06T22:09:28","modified_gmt":"2015-08-06T22:09:28","slug":"muawiyahs-limitations-on-the-narration-of-hadiths","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/10\/muawiyahs-limitations-on-the-narration-of-hadiths\/","title":{"rendered":"Muawiyah’s Limitations on the Narration of Hadiths"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=1989\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Al-Shihristani suggests in his “The Prohibition of Recording Hadith” (p. 217-218) that Muawiyah has extended the limitations that were set by Omar in his reign. Like Uthman though, there are no evidences that he ever issued a ban on the documentation of Hadiths.  As for the limitation, Al-Shihristani quotes a number of reports to establish this belief:<\/p>\n<p style=\"text-align: justify;\">1- Muawiyah ibn Abi-Sufyan (during his reign) said, “O People: reduce reporting from Messenger of Allah; and when you do, you must report traditions that were known during the reign of `Umar.”<\/p>\n<p style=\"text-align: justify;\">2- It has been also narrated that al-Yahsubi said that he once heard Muawiyah ibn Abi Sufyan saying to the publics, “Beware of spreading the Hadith except those that were known during the reign of `Umar ibn al-Khattab for this man used to threaten people for the sake of Almighty Allah.”<\/p>\n<p style=\"text-align: justify;\">3- Similarly, it has been narrated on the authority of Ibn `Adi that Isma`il ibn `Ubaydullah confirmed that Muawiyah (ibn Abi-Sufyan) warned people against circulating any tradition that is reported from the Holy Prophet excluding these which were known during the reign of `Umar and admitted by him.<\/p>\n<p style=\"text-align: justify;\">The three narrations above are similar in meaning and the second narration was narrated by Muslim. As for the third narration, it includes weak additions, which are the words “admitted by him”. It is weak since Isma’eel bin Ubaidullah was born after the death of Muawiyah. See his biography in Tahtheeb Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">The third narration also implies that all the Hadiths that are permissible for narrating are ones that were known and accepted by Omar. This is unlike the first two narrations that simply suggest that anything can be narrated as long as it was narrated during the reign of Omar.<\/p>\n<p style=\"text-align: justify;\">Furthermore, there are no issues with the first two Hadiths, since Muawiyah is simply forbidding people to narrate what was not narrated in the early years of Islam. Logically, this “ban” only affects narrations that have come into existence during the time of Uthman, Ali, and Muawiyah. In other words, Muawiyah is implying that narrations that were not known or heard by anyone during the time of the Prophet – peace be upon him – , or the first two reigns, should not be reported at all, since fabrications in Hadiths did not occur during that early era of Islam.<\/p>\n<p style=\"text-align: justify;\">This is echoed by Mohammad bin Sireen in Saheeh Muslim #27 when he said, “They didn’t ask about the chain of narrations before, but when the <em>fitnah <\/em>occurred (the death of Uthman), they began to say: ‘Name us your men (the narrators).’”<\/p>\n<p style=\"text-align: justify;\">These words by Ibn Sireen tell the same story that Muawiyah does, that it was during the time of Uthman that fabrications started to occur. However, Ibn Sireen explains that there was a different methodology used, which was to ask for Hadith chains.<\/p>\n<p style=\"text-align: justify;\">Muawiyah’s methods, on the other hand, seem to be stricter, or seem to imply that the narrations that were spread during the time of Omar were only the narrations of other companions that were known to all men in that generation.<\/p>\n<p style=\"text-align: justify;\">More importantly, the words of Muawiyah in the narration are not to be taken as an outright ban, but rather, it is a warning to Muslims to not narrate narrations that came out of nowhere post-Omar, for they most likely contain fabrications. It is silly to assume that Muawiyah was running an Orwellian society that had spy-cams behind every nook and cranny for such a prohibition to be implemented. The proof is that many people both during his reign and after it narrated traditions that even condemn Muawiyah himself, and these are all recorded in our books today as neither he nor those who came after him had the ability to stop the fabricators from fabricating and spreading rumors.<\/p>\n<p style=\"text-align: justify;\">The question that begs to be asked is: Would relying on narrations that were strictly narrated during the time of Omar cause us to lose narrations?<\/p>\n<p style=\"text-align: justify;\">It is safe to assume, that in the eyes of Muawiyah, everything that was authentic or that falls within the realm of Islamic Law, was already in circulation during the time of Muawiyah, and that the religion will survive with it, for Allah promised that His religion will be preserved within the Qur’an.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah – the most gracious and most merciful &#8211; .<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Al-Shihristani suggests in his “The Prohibition of Recording Hadith” (p. 217-218) that Muawiyah has extended the limitations that were set by Omar in his reign. Like Uthman though, there are no evidences that he ever issued a ban on the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/10\/muawiyahs-limitations-on-the-narration-of-hadiths\/\" title=\"Muawiyah’s Limitations on the Narration of Hadiths\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[20],"class_list":{"0":"post-1989","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-muawiyah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1989","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=1989"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1989\/revisions"}],"predecessor-version":[{"id":1991,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/1989\/revisions\/1991"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=1989"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=1989"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=1989"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}