{"id":2007,"date":"2015-05-12T19:17:04","date_gmt":"2015-05-12T19:17:04","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2007"},"modified":"2019-04-07T02:11:15","modified_gmt":"2019-04-07T02:11:15","slug":"hadith-of-twelve-caliphs","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/12\/hadith-of-twelve-caliphs\/","title":{"rendered":"Hadith of Twelve Caliphs"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2007\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The Hadith of Jabir b. Samura on the twelve caliphs is one of the most pivotal and controversial Hadiths in Sunni-Shia polemics. Perhaps the inclusion of the number “twelve” in the report along with its relative popularity contributed to the mass-citation of this report by the Twelver Shia sect.<\/p>\n<p style=\"text-align: justify;\">Unlike most Shi&#8217;ite sects, which appealed to their own reports to substantiate their respective positions on the number of Imams, the Twelver sect latched onto this report as external evidence to argue for their doctrine. This was demonstrated by some of the most prominent Twelver authorities, such Al-Tusi in <em>Al-Ghaibah<\/em> p. 127-133.<\/p>\n<p style=\"text-align: justify;\">However, upon studying this report, we found that there is no reason to suggest that it supports the Twelver position. In this article,  we shall evaluate and dissect this tradition, and subsequently demonstrate the defectiveness of  Twelver appeals to this hadith.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Variants of the Hadith<\/strong><\/h2>\n<p style=\"text-align: justify;\">First, it is important that the reader is made aware of the fact that this report is only authentically transmitted through the companion of the Prophet, Jabir b. Samurah.  From him, the tradition was then disseminated by several <em>Tabi’een<\/em>. The <em>Tabi’een<\/em> who transmitted this tradition include: Abdulmalik b.&#8217; Umair, Hussain b. &#8216;Abdurrahman, Simak, A&#8217;mer b. Sa’ad b. Abi Waqqas, Al-Sha’bi, and others. Each of their redactions can be found in Sahih Al-Bukhari and Muslim.<\/p>\n<p style=\"text-align: justify;\">1- Al-Bukhari (#6682) transmitted the report through Shu’ba, from &#8216;Abdulmalik, from Jabir b. Samura that the Prophet (peace be upon him) said: <strong>There will be twelve <em>amirs<\/em><\/strong>.<\/p>\n<p style=\"text-align: justify;\">Shu’ba transmitted it in this concise manner. Others, like Sufyan (Sahih Muslim #3394) and Abu &#8216;Abdilsamad Al-Ami  (Musnad Ahmad #20019) transmitted a lengthier redaction from &#8216;Abdulmalik. Sufyan transmitted the report as follows: <strong>The matters of the people will continue to progress as long as they are led by twelve men.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\">Abu &#8216;Abdilsamad Al-&#8216;Ami transmitted the report as follows: &#8220;<strong>This religion will stay at a state of glory or the people will be in a good state until the passing of twelve caliphs.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\">2- Muslim (#3393) transmitted this report through Husain b. Abdulrahman, from Jabir b. Samurah, who reported: &#8220;<strong>This matter will not end until the passing of twelve caliphs.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\">3- Muslim (#3394) narrated this report through Abu &#8216;Awanah, from Simak in a concise manner. However, he also transmitted (#3395) from Hammad b. Salamah from Simak: <strong>Islam will stay in a state of glory until the passing of twelve caliphs.<\/strong> This redaction is corroborated by Zakariyya b. Abi Za’ida’s redaction in Mustakhraj Abi Awana (#5631), which includes this addition.<\/p>\n<p style=\"text-align: justify;\">4- Muslim (#3396) transmitted this report through Dawud, from Al-Sha’bi, from Jabir: &#8220;<strong>This matter will be at a state of glory until twelve caliphs.&#8221; <\/strong>He then transmitted (#3397) a very similar report from Ibn &#8216;Awn which says: &#8220;<strong>This religion will be at a state of glory, fortified until the passing of twelve caliphs.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\">5- Muslim (#3398) transmitted the report through Hatim b. Isma’il, from Al-Muhajir b. Mismar, from Amer b. Sa’ad b. Abi Waqqas, from Jabir: &#8220;<strong>This religion will remain upright until the end of time or until the passing of twelve caliphs<\/strong>.&#8221;<\/p>\n<p style=\"text-align: justify;\">The doubt expressed in this Hadith seems to come from Hatim. The tradition can also be found in Musnad Ahmad (#19875) transmitted through the path of Ibn Abi Dhi’b, from Al-Muhajir without the clause, “until the end of time”.<\/p>\n<p style=\"text-align: justify;\">By studying the aforementioned chains of transmission from Sahih Al-Bukhari and Muslim, we can conclude that the most accurate redaction ascribed to Jabir b. Samurah involved phrases\/clauses, such as : &#8220;twelve, caliphs, and state of glory.&#8221; All of the aforementioned traditions also state that these caliphs shall all be from from the tribe of Quraish. In the different redactions of the report, the words “matter\/religion\/Islam” all refer to the same thing. They may have all been used by Jabir b. Samurah since they were all transmitted by his students in various redactions of the report.<\/p>\n<h3 style=\"text-align: justify;\"><strong>Grading:<\/strong><\/h3>\n<p style=\"text-align: justify;\">It is authentically established by the aforementioned chains of transmission, relayed through five different <em>Tabi&#8217;een,<\/em> that Jabir b. Samurah quoted the Prophet (peace be upon him) saying:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">&#8220;This matter\/religion\/Islam will stay in a state of glory until the passing of twelve caliphs.&#8221;<\/p>\n<p style=\"text-align: justify;\">Jabir then said: He – peace be upon him – said something that I didn’t understand, so I asked my father about it.<\/p>\n<p style=\"text-align: justify;\">He said: &#8220;They are all from Quraish.&#8221;<\/p>\n<\/blockquote>\n<h2 style=\"text-align: justify;\"><strong>Content of the Report<\/strong><\/h2>\n<p style=\"text-align: justify;\">The meaning of the Hadith is apparent: The Prophet is prophesying that Islam shall go through various phases, which span times of glory and times of disgrace. The years of glory for Islam, which were experienced during the time of the Prophet (peace be upon him), will continue to last until the passing of twelve caliphs from the tribe of Quraish.<\/p>\n<p style=\"text-align: justify;\">The report does not state that glory is exclusively experienced  during the reign of twelve caliphs. Rather, it describes a specific uninterrupted era of glory. This prophecy embodied good news and glad tidings for the companions of the Prophet, who experienced oppression and persecution by their enemies in the early stages of the <em>Seerah<\/em>.<\/p>\n<p style=\"text-align: justify;\">As apparent, nothing is said in this tradition about the nature of these twelve caliphs. They are not positively or negatively described in any of the redactions. Rather, it is only said that Islam will see glory during their reign. This report simply has nothing to do with the later Twelver construct of &#8220;the 12 imams&#8221;.<\/p>\n<p>Like all fallacious and defective Twelver appeals to authentic reports, the appeal to this hadith ironically backfires on Twelver polemicists. The hadith explicitly states that Islam will remain in a state of glory till the passing of Twelve caliphs. The first eleven Imams of the Shia were allegedly granted the Imamate between the years 11 and  260 AH.<\/p>\n<p>Let us evaluate the events that unfolded during the supposed reign of these 11 imams (according to Twelver theology):<\/p>\n<ol>\n<li>The caliphate was usurped from &#8216;Ali by a massive nation-wide conspiracy after the death of the Prophet.<\/li>\n<li>The Prophet&#8217;s daughter, Fatimah, was attacked and consequently murdered in her own house.<\/li>\n<li>The entire Ummah was led by apostates for ~ 24 years before leadership was eventually granted to &#8216;Ali.<\/li>\n<li>&#8216;Ali&#8217;s rule was challenged by a political opponent in Syria whom &#8216;Ali was not able to overcome.<\/li>\n<li>After &#8216;Ali&#8217;s death, Al-Hassan conceded leadership of the entire Ummah to this alleged tyrant and enemy of &#8216;Ali, Mu&#8217;awiyah.<\/li>\n<li>Mu&#8217;awiyah&#8217;s son, Yazid, eventually assumed the leadership of the entire Ummah, and ended up massacring Hussain at Karbala, along with various individuals from the Prophet&#8217;s household.<\/li>\n<li>The Umayyads (tyrants) ruled the vast majority of the Ummah till the year 132.<\/li>\n<li>The &#8216;Abbasids (tyrants) ruled the vast majority of the Ummah post-132.<\/li>\n<li>Later Twelver imams were murdered, persecuted, and imprisoned by government authorities.<\/li>\n<\/ol>\n<p>A brief glimpse into the Twelver narrative on early Islamic history will demonstrate that Islam was anything BUT glorious during the reign of their 12 imams. Rather, this era arguably is the worst and most disgraceful period in Islamic history.  <span style=\"text-decoration: underline;\">Not only is the report irrelevant to the Twelver conception of Imamah, but it also (ironically) disproves it.<\/span><\/p>\n<h2>Conclusion<\/h2>\n<p>In no way or form does the hadith on the twelve caliphs substantiate the Twelver conception of Imamah. Rather, the report, in reality, dispels the Twelver narrative and demonstrates the defectiveness of Shi&#8217;ite appeals to this hadith.<\/p>\n<p style=\"text-align: justify;\">As any objective reader may see, there are no actual evidences for Twelver Shi&#8217;ism in this Hadith. However, we have taken it upon ourselves to further expand this article for the benefit of the readers. Refer to the articles below for more information:<\/p>\n<p style=\"text-align: justify;\">&#8211; <a href=\"http:\/\/twelvershia.net\/2015\/05\/13\/who-are-the-twelve-caliphs-sunni-view\/\" rel=\"external nofollow\">Who are the Twelve Caliphs? (Sunni View)<\/a><\/p>\n<p style=\"text-align: justify;\">&#8211; <a href=\"http:\/\/twelvershia.net\/2015\/05\/16\/who-are-the-twelve-caliphs-shia-view\/\" rel=\"external nofollow\">Who are the Twelve Caliphs? (Shia View)<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Hadith of Jabir b. Samura on the twelve caliphs is one of the most pivotal and controversial Hadiths in Sunni-Shia polemics. Perhaps the inclusion of the number “twelve” in the report along with its relative popularity contributed to the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/12\/hadith-of-twelve-caliphs\/\" title=\"Hadith of Twelve Caliphs\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,5],"tags":[],"class_list":{"0":"post-2007","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2007","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2007"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2007\/revisions"}],"predecessor-version":[{"id":4849,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2007\/revisions\/4849"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2007"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2007"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2007"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}