{"id":2011,"date":"2015-05-13T17:58:42","date_gmt":"2015-05-13T17:58:42","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2011"},"modified":"2015-10-26T04:03:21","modified_gmt":"2015-10-26T04:03:21","slug":"who-are-the-twelve-caliphs-sunni-view","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/05\/13\/who-are-the-twelve-caliphs-sunni-view\/","title":{"rendered":"Who are the Twelve Caliphs? (Sunni View)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2011\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">As suggested in the previous article on the explanation and analysis of the <a href=\"http:\/\/twelvershia.net\/2015\/05\/12\/hadith-of-twelve-caliphs\/\" rel=\"external nofollow\">Hadith of the Twelve Caliphs<\/a>, there is nothing in the narration about the nature of these twelve caliphs. They are not described in any of the narrations in a positive or negative light, but only that Islam will see glory until they pass.<\/p>\n<p style=\"text-align: justify;\">In other words, this prophecy revolves around the state of the Islamic Empire, and not the status or persons that hold the position of Caliph during this time.<\/p>\n<p style=\"text-align: justify;\">Due to this, it is not important whether we know or not who these twelve caliphs were supposed to be, since it is not a matter that which our faith stands upon. Rather, in all possible listings, these caliphs have passed away and Islam has entered a state of disgrace for centuries.<\/p>\n<p style=\"text-align: justify;\">Regardless, we share some opinions of who these caliphs were for the benefit of readers.<\/p>\n<p style=\"text-align: justify;\">Al-Bayhaqi records in Dala’il Al-Nubuwa 6\/520: This number with this description was found until the time of Al-Waleed bin Yazeed bin Abdulmalik.<\/p>\n<p style=\"text-align: justify;\">The opinion shared by Al-Bayhaqi suggests that he did not include the caliphs from the Sahabah, but rather, only the ones from the <em>Tabi’een<\/em> for him to arrive at this number. Al-Bayhaqi argued that these twelve caliphs, from Bani Umayyah, are what is meant by the Prophet – peace be upon him – since there was a lot of deaths, due to assassinations, after Al-Waleed.<\/p>\n<p style=\"text-align: justify;\">As for Ibn Taymiyyah, he held the view that the twelve caliphs are those that held complete power, due to which, he included the Sahabah as well, but removed Al-Hasan bin Ali, Mu’awiyah bin Yazeed, Abdullah bin Al-Zubair, and Marwan bin Al-Hakam, due to the splits that occurred during their reigns, then included Mu’awiyah, Yazeed, Abdulmalik bin Marwan, his four children, and Omar bin Abdulaziz. He argued that it was then when Islam saw its glory days, and it was with the death of Omar bin Abdulaziz that Islam fell to an age of disgrace. See Minhaj Al-Sunnah 8\/238.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar in Fath Al-Bari in the chapter on Istikhlaf shares the same view as the above. He clearly states that the first of these is Abu Bakr and the last of them is Omar bin Abdulaziz. He removes Mu’awiyah bin Yazeed and Marwan bin Al-Hakam from the list due to the shortness and weakness of their rule.<\/p>\n<p style=\"text-align: justify;\">As for Abu Bakr Ibn Al-Arabi in Aridhat Al-Ahwathi 9\/50, he counted the twelve to be: Abu Bakr, Omar, Uthman, Ali, Al-Hasan, Mu’awiyah, Yazeed, Mu’awiyah bin Yazeed, Marwan, Abdulmalik bin Marwan, Al-Waleed, and Sulaiman. He too did not include Abdullah bin Al-Zubair, since he didn’t rule the entire Ummah either.<\/p>\n<p style=\"text-align: justify;\">However, if one wanted to be as literal as possible with the narration, then the twelve would constitute:<\/p>\n<p style=\"text-align: justify;\">-Abu Bakr<\/p>\n<p style=\"text-align: justify;\">-`Umar<\/p>\n<p style=\"text-align: justify;\">-`Uthman<\/p>\n<p style=\"text-align: justify;\">-`Ali<\/p>\n<p style=\"text-align: justify;\">-Al-Hasan<\/p>\n<p style=\"text-align: justify;\">-Mu’awiyah<\/p>\n<p style=\"text-align: justify;\">-Yazid<\/p>\n<p style=\"text-align: justify;\">-Mu’awiyah bin Yazid<\/p>\n<p style=\"text-align: justify;\">-`Abdullah bin Al-Zubair<\/p>\n<p style=\"text-align: justify;\">-Marwan bin Al-Hakam<\/p>\n<p style=\"text-align: justify;\">-`Abdulmalik bin Marwan<\/p>\n<p style=\"text-align: justify;\">-Al-Walid bin `Abdulmalik<\/p>\n<p style=\"text-align: justify;\">This list of twelve caliphs is another possible one since the rate of expansion of the Islamic Empire immediately dwindled after the caliphate of Al-Waleed bin Abdulmalik. It was during the time of Al-Waleed that Islam spread from the West in Andalusia up until the East in Xing Jiang.<\/p>\n<p style=\"text-align: justify;\">That being said, in all these probable interpretation of who the twelve caliphs constitute, there is no escaping the fact that these twelve passed by the end of the Umayyad Dynasty, whose dominance in power led to the Islamic Empire’s glory days from modern day Spain to China.<\/p>\n<p style=\"text-align: justify;\"><strong>Our view as to the identity of the twelve:<\/strong><\/p>\n<p style=\"text-align: justify;\">As for our own personal opinion, we present it in addition to the analysis for why we made these choices:<\/p>\n<p style=\"text-align: justify;\">1-Abu Bakr al-Siddiq (The successor of the Prophet peace be upon him)<\/p>\n<p style=\"text-align: justify;\">2-`Umar ibn al-Khattab<\/p>\n<p style=\"text-align: justify;\">3-`Uthman ibn `Affan<\/p>\n<p style=\"text-align: justify;\">4-`Ali ibn abi Talib<\/p>\n<p style=\"text-align: justify;\">5-Hasan ibn `Ali (Last Rashidi Caliph, excluding him because of the short period he ruled isn’t valid)<\/p>\n<p style=\"text-align: justify;\">6-Mu`awiyah ibn abi Sufiyan (First king in Islam)<\/p>\n<p style=\"text-align: justify;\">7-Yazid bin Mu`awiyah<\/p>\n<p style=\"text-align: justify;\">(Mu`awiyah  bin Yazid is Not included as he did not rule and gave up Khilafah, `Abdullah ibn al-Zubayr was the legitimate Caliph in his time)<\/p>\n<p style=\"text-align: justify;\">8-`Abdullah ibn al-Zubayr (His legitimacy was established as Caliph the moment Yazid died)<\/p>\n<p style=\"text-align: justify;\">(Marwan bin al-Hakam is Not included because `Abdullah ibn al-Zubayr was the legitimate Caliph in his time)<\/p>\n<p style=\"text-align: justify;\">9-`Abdul-Malik bin Marwan (Became the legitimate ruler after Ibn Zubayr’s martyrdom by the hands of al-Hajjaj)<\/p>\n<p style=\"text-align: justify;\">10-Walid bin `Abdul-Malik<\/p>\n<p style=\"text-align: justify;\">11-Sulayman bin `Abdul-Malik<\/p>\n<p style=\"text-align: justify;\">12-`Umar bin `Abdul-`Aziz (After ibn `Abdul-`Aziz died, the deviance began to spread in the lands and the Islamic nation was never the same)<\/p>\n<p style=\"text-align: justify;\">This is a personal opinion of course and it isn&#8217;t binding upon anyone. There is no sure way to know exactly who the twelve are since it&#8217;s a matter of Ghayb and since Rasul-Allah (saw) never mentioned the names.<\/p>\n<p style=\"text-align: justify;\"><strong>A Common Misconception:<\/strong><\/p>\n<p style=\"text-align: justify;\">A common view that we often hear today in the pulpits, television channels, and generally upon the tongues of those of religious leaders, is the interpretation that the twelve caliphs are: Abu Bakr, Omar, Uthman, Ali, Omar bin Abdulaziz, and Al-Mahdi.<\/p>\n<p style=\"text-align: justify;\">Those that have arrived to this conclusion only did so because they held the opinion that the twelve caliphs are those that were agreed upon by all Muslims. However, nothing in our original article on the subject could suggest that the twelve will be agreed upon in the first place. The narration simply refers to them as twelve caliphs.<\/p>\n<p style=\"text-align: justify;\">Those that hold the view that these twelve are agreed upon only do so due to a single Hadith. The narration, which can be found in Sunan Abi Dawud #3731 states: This religion will stand until twelve caliphs pass, all of whom are agreed upon by the nation.<\/p>\n<p style=\"text-align: justify;\">This narration though comes from the path of Abu Khalid Al-Ahmasi from Jabir bin Samura. Abu Khalid is of an unknown status and he was not deemed trustworthy by anyone with weight. Furthermore, his narration conflicts with Abdulmalik bin Umair, Husain bin Abdulrahman, Simak, Amer bin Sa’ad bin Abi Waqqas, and Al-Sha’abi, all of whom are more reliable than he is. It is with this in mind, that one can clearly see that this addition in the narration is to be rejected since it contradicts with the correct narration of many reliable Hadith narrators.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>As suggested in the previous article on the explanation and analysis of the Hadith of the Twelve Caliphs, there is nothing in the narration about the nature of these twelve caliphs. They are not described in any of the narrations <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/05\/13\/who-are-the-twelve-caliphs-sunni-view\/\" title=\"Who are the Twelve Caliphs? (Sunni View)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,5],"tags":[],"class_list":{"0":"post-2011","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2011","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2011"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2011\/revisions"}],"predecessor-version":[{"id":2618,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2011\/revisions\/2618"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2011"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2011"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2011"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}