{"id":2099,"date":"2015-06-29T08:48:46","date_gmt":"2015-06-29T08:48:46","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2099"},"modified":"2025-01-27T20:37:28","modified_gmt":"2025-01-27T20:37:28","slug":"the-imams-were-only-seven-and-not-twelve","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/06\/29\/the-imams-were-only-seven-and-not-twelve\/","title":{"rendered":"The Imams were only Seven and not Twelve"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2099\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following article is taken from the Waqifi website <a href=\"http:\/\/www.tashayyu.org\/hadiths\/nusrat\" rel=\"external nofollow\">tashayyu.org<\/a> is a compilation of the narrations found in Al-Tusi&#8217;s Kitab Al-Ghayba. The compiler provides many narrations in which Musa Al-Kadhim is the last Imam and that the Imam are not twelve, but only seven.<\/p>\n<p style=\"text-align: justify;\">We at twelvershia.net do not believe that the Imams were seven nor twelve, nor do we believe in the appointment of any infallible after the Prophet &#8211; peace be upon him &#8211; , but we share this article with readers so that they can be aware that Shias themselves were not in agreement about this matter.<\/p>\n<p style=\"text-align: justify;\">==============<\/p>\n<p style=\"text-align: justify;\"><br style=\"text-align: justify;\" \/>Fii Nusrat al-Waqifa<\/p>\n<p>by Abu Muhammad `Ali b. Ahmad al-`Alawi al-Musawi<\/p>\n<p>(The following work is a reconstruction of said book, now lost, by compiling the ahadith quoted from it by Shaykh Tusi in his Kitab al-Ghayba)<\/p>\n<p><strong>1<\/strong> – al-Musawi said: Muhammad b. Bishr narrated to me.  He said: al-Hasan b. Sama`a narrated to me from Aban b. `Uthman from al-Fudayl b. Yasar.  He said:<\/p>\n<p>I heard Abu `Abdillah عليه السلام saying: A father will not interweave me and the Qa’im.<\/p>\n<p><strong>2<\/strong> – `Ali b. Khalaf al-Anmati reported to me.  He said: `Abdullah b. Waddah narrated to me from Yazid the jeweler.  He said:<\/p>\n<p>When Abu ‘l-Hasan عليه السلام was born to Abu `Abdillah عليه السلام, I made some silver ornaments for him and gifted it to him.  So when I brought it to Abu `Abdillah عليه السلام, he said to me: O Yazid, gift it to the Qa’im of the Family of Muhammad صلى الله عليه وآله وسلم.<\/p>\n<p><strong>3<\/strong> – Ahmad b. al-Hasan al-Maythami narrated to me from his father from Abu Sa`id al-Mada’ini.  He said:<\/p>\n<p>I heard Abu Ja`far عليه السلام saying: Allah saved the Children of Israel from their Pharoah by Musa b. `Imran.  And Allah will save this Umma from its Pharoah by his namesake.<\/p>\n<p><strong>4<\/strong> – Hanan b. Sadir said: My father was sitting, and `Abdullah b. Sulayman the moneychanger, Abu ‘l-Murahif and Salim the paralytic were with him.  So`Abdullah b. Sulayman said to my father: O Abu ‘l-Fadl, did you know that a boy was born to Abu `Abdillah عليه السلام, and he named him so-and-so?  &#8211; and he named his name –<\/p>\n<p>So Salim said: This is true.<\/p>\n<p>So `Abdullah said: Yes.<\/p>\n<p>So Salim said: By Allah, it would truly be more beloved to me than that five hundred dinar should be turned (?) to my family, and I am needy of five dirham to go back with upon myself and my dependents.<\/p>\n<p>So `Abdullah b. Sulayman said to him: And why is that?<\/p>\n<p>He said: It has reached me in the hadith that Allah presented the course of the Qa’im of the Family of Muhammad to Musa b. `Imran.<\/p>\n<p>So he said: Allahumma, make him be from the Children of Israel.<\/p>\n<p>So He said to him: There is no way to that.<\/p>\n<p>So he said: Allahumma, make me be from his helpers.<\/p>\n<p>So it was said to him: There is no way to that.<\/p>\n<p>So he said: Allahumma, make him my namesake.<\/p>\n<p>So it was said to him: I have granted that.<\/p>\n<p><strong>5<\/strong> – Zayd the oil vendor and other than him narrated, he said: Salim says:<\/p>\n<p>I heard Abu Ja`far عليه السلام saying: Allah تعالى presented the course of the Qa’im of the Family of Muhammad to Musa b. `Imran – and he mentioned the hadith and we spoken of it with its delivery.<\/p>\n<p style=\"text-align: justify;\"><strong>6<\/strong> – Bahr b. Ziyad the miller narrated to me from Muhammad b. Marwan from Abu Ja`far عليه السلام.  He said:<\/p>\n<p>A man said: May I be made your ransom, they narrate that Amir al-Mu’mineen عليه السلام said in Kufa upon the minbar: Were not but a day to remain of the world, Allah would prolong that day until Allah sent a man from me who will fill it with equity and justice as it had been filled with oppression and tyranny.<\/p>\n<p>So Abu Ja`far عليه السلام said: Yes.<\/p>\n<p>He said: So are you him?<\/p>\n<p>So he said: No, that is the namesake of the parter of the sea.<\/p>\n<p><strong>7<\/strong> – Abu Muhammad the money changer narrated to me from al-Husayn b. Sulayman from Durays al-Kinasi from Abu Khalid al-Kabuli.  He said:<\/p>\n<p>I heard `Ali b. al-Husayn عليه السلام while he was saying: Qarun used to wear red clothing, and Pharoah used to wear black and lengthened the hair (?).  So Allah sent Musa عليه السلام upon them.  And the Banu so-and-so wear black and lengthen the hair, and Allah تعالى will destroy them by his namesake.<\/p>\n<p><strong>8<\/strong> – And by this isnad, he said: We discussed the Qa’im with him, so he said: His name is the name of the iron of the barber.  (trans. note: in Arabic the word for razor is musa)<\/p>\n<p><strong>9<\/strong> – Ja`far b. Sama`a narrated from Muhammad b. al-Hasan from his father al-Hasan b. Harun.  He said:<\/p>\n<p>Abu `Abdillah عليه السلام said: This son of mine – meaning Abu ‘l-Hasan عليه السلام – he is the Qa’im, and it (or: he) is from the inevitable (al-mahtum).  And he is the one who will fill it with equity and justice as it had been filled with oppression and tyranny.<\/p>\n<p><strong>10<\/strong> – `Abdullah b. Salam narrated to me from `Abdullah b. Sinan.  He said:<\/p>\n<p>I heard Abu `Abdillah عليه السلام saying: From the inevitable is that this son of mine is the Qa’im of this Umma, and the possessor of the sword – and he indicated with his hand to Abu ‘l-Hasan عليه السلام.<\/p>\n<p><strong>11<\/strong> – `Ali b. Rizqullah reported to me from Abu ‘l-Walid at-Tara’ifi.  He said:<\/p>\n<p>One night I was with Abu `Abdillah عليه السلام, when he called his slave-boy.  So he said: Go and summon the master of my children for me.<\/p>\n<p>So the slave-boy said: Who is he?<\/p>\n<p>So he said: So-and-so – meaning Abu ‘l-Hasan عليه السلام –<\/p>\n<p>[He said:] So I will not delay until I come with a qamis without a robe – until he said:<\/p>\n<p>Then he struck his hand upon my upper arm and said: O Abu ‘l-Walid, it is as though I am by the black standard of the possessor of the green patch, fluttering above the head of this one who is sitting, and his companions are with him crushing mountains of iron with a crushing, not coming upon anything but that they crush it.<\/p>\n<p>I said: May I be made your ransom, this one?<\/p>\n<p>He said: Yes, this one, O Abu ‘l-Walid, will fill it with equity and justice as it had been filled with oppression and enmity, taking the course in the people of the qibla with the course of `Ali b. Abi Talib عليه السلام, killing the enemies of Allah until Allah is satisfied.<\/p>\n<p>I said: May I be made your ransom, this one?<\/p>\n<p>He said: This one.<\/p>\n<p>Then he said: So follow him, and obey him, and believe him, and give him satisfaction from yourself, for you shall reach him, if Allah has willed.<\/p>\n<p style=\"text-align: justify;\"><strong>12<\/strong> – `Abdullah b. Jamil narrated to me from Salih b. Abu Sa`id al-Qammat. He said: `Abdullah b. Ghalib narrated to me.  He said:<\/p>\n<p>I recited this qasida to Abu `Abdillah عليه السلام: So if you are the one who is hoped for what we anticipate, then that is what we seek in you from the One on high.<\/p>\n<p>So he said: I am not the possessor of this attribute, rather this is its possessor – and he indicated with his hand to Abu ‘l-Hasan عليه السلام.<\/p>\n<p><strong>13<\/strong> – Abu `Abdillah Ladhdhadh narrated to me from Sarim b. `Alwan al-Jukhi.  He said:<\/p>\n<p>I, al-Mufaddal, Yunus b. Zhibyan, al-Fayd b. al-Mukhtar and al-Qasim – the associate of al-Mufaddal – entered upon Abu `Abdillah عليه السلام and his son Isma`il was with him.<\/p>\n<p>So al-Fayd said: May I be made your ransom, we do taqabbul from these estates, so we do taqbil with it more than we did taqabbul with it (trans. note: this is referring to a type of transacting of property).<\/p>\n<p>So he said: There is no harm with it.<\/p>\n<p>So his son Isma`il said to him: O father, you did not understand.<\/p>\n<p>So Abu `Abdillah عليه السلام said: I did not understand?  I say to you: adhere to me, but you do not do it.<\/p>\n<p>So Isma`il spoke angrily.<\/p>\n<p>al-Fayd said: We regard him to be the master of this authority after you.<\/p>\n<p>So Abu `Abdillah عليه السلام said: No, by Allah, he is not thus.<\/p>\n<p>Then he said: This one adheres to me more than that – and he indicated to Abu ‘l-Hasan.  He was asleep, so he embraced him and rested upon his chest.  So when he noticed, Abu `Abdillah عليه السلام took him by his forearm then said: This one, by Allah, my son truly he, by Allah, will fill it with equity and justice as it had been filled with oppression and tyranny.<\/p>\n<p>So Qasim the second said to him: This one, may I be made your ransom?<\/p>\n<p>He said: Aye, by Allah, this son of mine will not leave the world until Allah fills the Earth with equity and justice by him as it had been filled with oppression and tyranny – three oaths swearing by it.<\/p>\n<p><strong>14<\/strong> – Hanan b. Sadir narrated to me from Isma`il the clothier.  He said:<\/p>\n<p>Abu `Abdillah عليه السلام said: The master of this authority will take charge of the testament while he is twenty years old.<\/p>\n<p>So Isma`il said: So by Allah, no has ever taken charge of it who was younger than him.<\/p>\n<p>And he was of the age which Abu `Abdillah عليه السلام said.<\/p>\n<p><strong>15<\/strong> – Ibrahim b. Muhammad b. Humran narrated to me from Yahya b. al-Qasim the shoemaker and other than him from Jamil b. Salih from Dawud b. Zarabi.  He said:<\/p>\n<p>The Righteous Servant عليه السلام sent to me while he was in the prison, so he said: Go to this man – meaning Yahya b. Khalid – and say to him: Abu so-and-so says to you: What prompted you to do what you did?  You ejected me from my country and separated me and my dependents.<\/p>\n<p>So I went to him and informed him.<\/p>\n<p>So he said: Zubayda is divorced, and upon him be the roughest of oaths, I would wish for him to be fined right now two thousand thousand.  And (when) you have gone out, and returned to him, and informed him.<\/p>\n<p>So he said: Return to him and say to him:  He says to you: By Allah, you will eject me or I will go out.<\/p>\n<p><strong>16<\/strong> – Ibrahim b. Muhammad b. Humran narrated to me from Isma`il b. Mansur the zibl collector.  He said: I heard an elder at Adhri`at – a hundred and twenty years had come upon him.  He said:<\/p>\n<p>I heard `Ali عليه السلام saying upon the minbar of Kufa: It is as though I am with the son of Hamida, he has filled it with equity and justice as it had been filled with oppression and tyranny.<\/p>\n<p>So a man went to him, and said: Is he from you, or from someone other than you?<\/p>\n<p>So he said: No, rather he is a man from me.<\/p>\n<p><strong>17<\/strong> – Ahmad b. al-Hasan narrated to me.  He said: Yahya b. Ishaq al-`Alawi narrated to me from his father.  He said:<\/p>\n<p>I entered upon Abu `Abdillah عليه السلام, and asked him about the master of this authority after him.<\/p>\n<p>He said: The possessor of the lamb.<\/p>\n<p>And Abu ‘l-Hasan was in a section of the home, and with him was a Meccan she-kid.  And he was saying to it: prostrate for Allah who created you.<\/p>\n<p>Then he said: Indeed, he is the one who will fill it with equity and justice as it had been filled with oppression and tyranny.<\/p>\n<p><strong>18<\/strong> – al-Husayn b. `Ali b. Ma`mar narrated to me from his father from `Abdullah b. Sinan.  He said:<\/p>\n<p>I heard Abu `Abdillah عليه السلام and he mentioned bada’ for Allah.  So he said: So what Allah brings out to the angels, and the angels bring it out to the messengers, and the messengers bring it out to humanity, then there is no bada’ in it.  And from the inevitable is that this son of mine is the Qa’im.<\/p>\n<p><strong>19<\/strong> – He said: And Baqbaqa – the brother of the Banin as-Sayrafi.  He said: al-Istakhri narrated to me that he heard Abu `Abdillah عليه السلام saying: It is as though I am with the son of Hamida upon its rods, the East of the Earth and its West have yielded to him.<\/p>\n<p><strong>20<\/strong> – Muhammad b. `Ata Darghama narrated to me from Khallad the pearl seller.  He said: Sa`id al-Makki narrated to me from Abu `Abdillah عليه السلام – and he had a station from him.  He said:<\/p>\n<p>Abu `Abdillah عليه السلام said: O Sa`id, twelve.  When six pass, Allah will grant victory (lit. open) upon the seventh, and five from us, the People of the House, will rule, and the sun will rise from its place of setting (its west) upon the hand of the sixth.<\/p>\n<p><strong>21<\/strong> – Hanan b. Sadir narrated to me from Abu Isma`il the leper from Abu Basir.  He said:<\/p>\n<p>Abu `Abdillah عليه السلام said: The relief (al-faraj) is upon the head of the seventh from us.<\/p>\n<p><strong>22<\/strong> &#8211; `Abdullah b. Jabla narrated to me from Salama b. Janah from Hazim b. Habib.  He said:<\/p>\n<p>I said to Abu `Abdillah عليه السلام: My parents have passed away, and Allah has bestowed upon me and provided, so do I give charity on behalf of them and do hajj?<\/p>\n<p>So he said: Yes.<\/p>\n<p>Then he said to his right: O Abu Hazim, whoever comes to you informing you about the master of this authority that he gave him ghusl and did his kafan and shook off the dirt from his grave, then do not believe him.<\/p>\n<p><strong>23<\/strong> – Abu Muhammad the money-changer narrated to me from `Abd al-Karim b. `Amr from Abu Basir from Abu `Abdillah عليه السلام.  He said:<\/p>\n<p>I heard him saying: It is as though I am with this son of mine – meaning Abu ‘l-Hasan عليه السلام – and the Banu so-and-so have taken him.  So he remains in their hands for a while and long period of time, then he goes out from their hands.  So he takes the hand of a man from his children until he ends up [with him] to the Mount Radwa.<\/p>\n<p><strong>24<\/strong> – Ja`far b. Sulayman narrated to me from Dawud as-Sarami from `Ali b. Abi Hamza.  He said:<\/p>\n<p>Abu `Abdillah عليه السلام said [to me]: Whoever comes to you and says to you that he gave medical treatment to this son of mine, and he closed his eyes, and gave him ghusl, and placed him in his tomb, and shook off his hands from the dirt of his grave, then do not believe him.<\/p>\n<p><strong>25<\/strong> – And he narrated from Sulayman b. Dawud from `Ali b. Abi Hamza from Abu ‘l-Hasan عليه السلام.  He said:<\/p>\n<p>He said to me: O `Ali, whoever reports to you that he gave medical treatment to me, and closed my eyes, and gave me ghusl, and placed me in my tomb, and shook off his hands from the dirt of my grave, then do not believe him.<\/p>\n<p><strong>26<\/strong> – A`yan b. `Abd ar-Rahman b. A`yan reported to me.  He said:<\/p>\n<p>`Abdullah b. Bukayr sent me to `Abdullah al-Kahili the year the Righteous Servant عليه السلام was taken in the time of al-Mahdi (the `Abbasid caliph).<\/p>\n<p>So he said: Recite salam to him and ask him to bring him (?) a report – until he said: Recite salam to him and say to him: Abu ‘l-`Izar narrated to me in your masjid for thirty years and he says: Abu `Abdillah عليه السلام said: The master of this authority will come to Iraq twice.  As to the first, so his release will be hastened and his provisions for the road (ja’iza) will be good.  And as to the second, so he will be imprisoned and his imprisonment will be lengthy, then he will go out from their hands them forcibly.<\/p>\n<p><strong>27<\/strong> – Ibrahim b. Muhammad b. Humran and Humran and al-Haytham and Waqid al-Jazari reported to me from `Abdullah ar-Rajani.  He said:<\/p>\n<p>I was with Abu `Abdillah عليه السلام when the Righteous Servant عليه السلام entered upon him.<\/p>\n<p>So he said: O Ahmad, do thus.<\/p>\n<p>So I said: May I be made your ransom, his name is so-and-so.<\/p>\n<p>So he said: Rather, his name is Ahmad and Muhammad.<\/p>\n<p>Then he said to me: O `Abdullah, the master of this authority will be taken and imprisoned, and his imprisonment will be prolonged.  So when they determine (to kill?) him, he will supplicate by the greatest name of Allah, and it will release him from their hands.<\/p>\n<p><strong>28<\/strong> – One of our companions narrated from Muhammad the clothier.  He said: `Amr b. Minhal al-Qammat narrated to me from Hadid as-Sabati from Abu `Abdillah عليه السلام.<\/p>\n<p>He said: There are two disappearances (ghayba) for Abu ‘l-Hasan عليه السلام, the first of them is lesser and the other is prolonged, until there comes to you one who claims that he died, and (that he) prayed over him and buried him and shook off the dirt of the grave from his hand.  So in that he is a liar, a wasi will not die until he establishes (?) a wasi, and none but the wasi follows (?) the wasi, for if someone other than wasi follows him, he goes blind (?).<\/p>\n<p><strong>29<\/strong> – `Abdullah b. Salam Abu Hurayra narrated to me from Zar`a from Mufaddal.  He said:<\/p>\n<p>I was sitting with Abu `Abdillah عليه السلام when Abu ‘l-Hasan and Muhammad came, and with them was a she-kid.  They were vying for it, and Muhamamd overcame him upon it.  So Abu ‘l-Hasan was embarrassed, and he came and sat to my side.  So I embraced him and kissed him.<\/p>\n<p>So Abu `Abdillah عليه السلام said: Indeed he is your master (or: companion) even though the Banu ‘l-`Abbas will take him and he will encounter a hardship from them.  Then Allah will release him from their hands with a sort of sorts, then his affair will be obscure to the people until the eyes pour forth (?) over him, and the the hearts tumult regarding him as the ship tumults in the abyss of the sea and the storms of wind.  Then upon his hands Allah will bring a relief for this Umma, for the religion and this world.<\/p>\n<p><strong>30<\/strong> – Hanan narrated to me from Abu `Abd ar-Rahman al-Mas`udi.  He said: al-Minhal b. `Amr narrated to us from Abu `Abdillah an-Nu`man from Abu Ja`far عليه السلام.<\/p>\n<p>He said: The master of the authority will be imprisoned for a while, and die [for a while], and escape for a while.<\/p>\n<p><strong>31<\/strong> – Bahr b. Ziyad narrated from `Abdullah al-Kahili that he heard Abu `Abdillah عليه السلام saying:<\/p>\n<p>If someone comes to you informing you that he has given medical treatment to this son of mine, and he witnessed him, closed his eyes, did his ghusl, inserted him in his shrouds, prayed over him, placed him in his grave, and scooped the dirt on him, then do not believe him and it surely will be that.<\/p>\n<p>So Muhammad b. Ziyad at-Tamimi said to him – and he was present to the talk in Mecca – O Abu Yahya, this, by Allah, is a great fitna!<\/p>\n<p>So al-Kahili said to him: So the share of Allah in it is greater.  An elder will disappear (go into ghayba) from them, and a youth will come to them, in it is a tradition (sunna) of Yunus.<\/p>\n<p><strong>32<\/strong> – Ahmad b. al-Harith narrated going up to Abu `Abdillah عليه السلام that he said:<\/p>\n<p>Were the Qa’im to rise, the people would say: It is this one, while his bones had decayed?<\/p>\n<p><strong>33<\/strong> – Sulayman b. Dawud narrated from `Ali b. Abi Hamza from Abu Basir.  He said:<\/p>\n<p>I heard Abu Ja`far عليه السلام saying: There are four traditions (sunan) from four prophets in the master of this authority: a tradition from Musa, a tradition from `Isa, a tradition from Yusuf, and a tradition from Muhammad صلى الله عليه وآله وسلم.  As Musa it is (he will) fear, being vigilant.  As to Yusuf it is prison.  As to `Isa, so it will be said: He died, and he did not die.  And as to Muhammad صلى الله عليه وآله it is the sword.<\/p>\n<p><strong>34<\/strong> – `Ali b. `Abdullah narrated from Zur`a b. Muhammad from Mufaddal.  He said:<\/p>\n<p>I heard Abu `Abdillah عليه السلام saying: The Bani ‘l-`Abbas shall abuse this son of mine, and they will never reach him.<\/p>\n<p>Then he said: And no clamour will cry out, and no rear (of an army?) will drive on, and no inheritance will be divided, and no slave woman will be bought.  (or: And what clamour will, etc)<\/p>\n<p><strong>35<\/strong> – Ahmad b. `Ali narrated from Muhammad b. al-Husayn b. Isma`il from `Abd ar-Rahman b. al-Hajjaj.  He said:<\/p>\n<p>I heard Abu Ibrahim عليه السلام saying: The Bani so-and-so will take me and imprison me.  And he said: And that will be – even if long – to safety.<\/p>\n<p><strong>36<\/strong> – Ibrahim b. al-Mustani narrated from al-Mufaddal.  He said:<\/p>\n<p>I heard Abu `Abdillah عليه السلام saying: The master of this authority will have two disappearances (ghayba), one of them is longer, until it said: He died, and some will say: He was killed.  So none will remain upon his affair save but a small band from his companions.  And no one will be informed of his location and his affair, and not other than him to the mawla who will follow (?) his authority.<\/p>\n<p><strong>37<\/strong> – `Ali b. Mu`adh narrated.  He said:<\/p>\n<p>I said to Safwan b. Yahya: By which thing did you affirm `Ali (b. Musa ar-Rida)?<\/p>\n<p>He said: I prayed and supplicated to Allah and I did istikhara [upon him] and affirmed him.<\/p>\n<p><strong>38<\/strong> – `Ali b. Baqbaqa said: I asked Safwan b. Yahya and Ibn Jundub and a  group from their elders – and what was between him and them was great – by which thing did they affirm this man, the thing that is apparent to you so that I accept your doctrine?<\/p>\n<p>They said, all of them: No, by Allah, but that he said: We have believed him and all referred to al-Bazanti.<\/p>\n<p>So I said: Shame on you, and you are the elders of the Shi`a.  Are you sending me to that lying child, so that I accept from him and leave you alone?<\/p>\n<p><strong>39<\/strong> – Some of our companions asked from `Ali b. Rabbat: Did anyone narrate from Abu ‘l-Hasan عليه السلام that he said: My son `Ali is my wasi, or an Imam after me, or with my status from my father, or my successor (khalifa), or (something with) the meaning of this?<\/p>\n<p>He said: No.<\/p>\n<p>.<br \/>\n<strong>40<\/strong> – Abu Bakr al-Arami `Abdullah b. al-Mughira was asked by which thing did you affirm `Ali?<\/p>\n<p>He said: Salma informed me that there was no one according to his father with his status.<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2361\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions.png\" alt=\"discussions\" width=\"64\" height=\"64\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions.png 64w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/05\/discussions-62x62.png 62w\" sizes=\"auto, (max-width: 64px) 100vw, 64px\" \/><\/a>Discuss this article at <a href=\"http:\/\/forum.twelvershia.net\/imamah-ghaybah\/musa-al-kazim-is-the-real-mahdiqaim-according-to-countless-shia-narrations\/\" target=\"_blank\" rel=\"noopener external nofollow\">http:\/\/forum.twelvershia.net\/imamah-ghaybah\/musa-al-kazim-is-the-real-mahdiqaim-according-to-countless-shia-narrations\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following article is taken from the Waqifi website tashayyu.org is a compilation of the narrations found in Al-Tusi&#8217;s Kitab Al-Ghayba. The compiler provides many narrations in which Musa Al-Kadhim is the last Imam and that the Imam are not <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/06\/29\/the-imams-were-only-seven-and-not-twelve\/\" title=\"The Imams were only Seven and not Twelve\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[],"class_list":{"0":"post-2099","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2099","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2099"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2099\/revisions"}],"predecessor-version":[{"id":5058,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2099\/revisions\/5058"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2099"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2099"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2099"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}