{"id":2127,"date":"2015-07-09T08:46:00","date_gmt":"2015-07-09T08:46:00","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2127"},"modified":"2015-07-09T19:09:00","modified_gmt":"2015-07-09T19:09:00","slug":"meaning-of-death-of-jahiliyyah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/07\/09\/meaning-of-death-of-jahiliyyah\/","title":{"rendered":"Meaning of: Death of Jahiliyyah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2127\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2021 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"death of jahiliyyah\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">We often hear Shias quoting, “Those that does not know his Imam will die a death of Jahiliyyah.” The narration suggests, according to Shias, that rejecting the twelfth Imam of the Shias, or rather, not acknowledging his birth, ultimately is a non-Muslim.<\/p>\n<p style=\"text-align: justify;\">However, before even having to explain the hadith, one needs to first establish its authenticity. Not surprisingly, the hadith cannot be found in any of the major books of hadith with such a wording. Al-Albani comments in #350 of his Al-Silsilah Al-Dha’eefa by saying that “this hadith has no foundation.”<\/p>\n<h1 style=\"text-align: justify;\">Ibn Hajar explains the meaning of the statement: Death of Jahiliyyah<\/h1>\n<p style=\"text-align: justify;\">He said: “To die as those who died in the pre-Islamic period of ignorance means the state of death: to die in a state of misguidance with no ruler to obey, as the inhabitants of that era had no such system of ruling. The hadith doesn’t mean that the Muslim will die as a kafir but as a disobeying Muslim. This Hadith has possible definitions:<\/p>\n<p style=\"text-align: justify;\">To resemble between the state of death between the disobeying Muslim and the Jahili, even if the Muslim was not in reality a Jahili;<\/p>\n<p style=\"text-align: justify;\">or, To frighten and reprimand, and this meaning is not the apparent one.<\/p>\n<p style=\"text-align: justify;\">Ibn Battāl said: this hadith is an argument to not disobey the ruler even if he is wronged. The scholars agreed unanimously on the obligation of obeying the empowered ruler and fighting under his commandment. As well as the scholars consider that obeying the ruler is better than disobeying him as this act prevents bloodshed and mitigates masses. “<\/p>\n<p style=\"text-align: justify;\">See Ibn Hajar’s Fath Al-Bari, in his commentary of #6530.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar is correct, since there is not clear evidence from the reports that the &#8220;death of jahiliyyah&#8221; suggests apostasy.<\/p>\n<p style=\"text-align: justify;\">So to conclude, the death of Jahiliyyah means a death similar to those people who lived in pre-Islamic times, they were divided and not united upon one leadership, rather each tribe ruled itself and they declared wars on each-other. Islam stressed upon unity and loyalty for the sake of the greater good of the nation and this narration reflects this perfectly, it doesn&#8217;t mean that the disobedient person will become an idol worshiper like the people of Jahiliyyah.<\/p>\n<h2 style=\"text-align: justify;\">Additional Evidences<\/h2>\n<p style=\"text-align: justify;\">When looking up narrations that speak of dying a death of Jahiliyyah, we find the following narrations:<\/p>\n<p style=\"text-align: justify;\">Al-Bukhari (#6530) and Muslim (#6610) narrated from Ibn Abbās that he said: the Prophet peace be upon him says: “Whoever disapproves an act done by his ruler has to be patient. Whoever disobeys the ruler even in the smallest matters will die a death of Jahiliyyah.”<\/p>\n<p style=\"text-align: justify;\">Muslim narrated in his Sahīh (#3437) from Abi Hurayrah that the Prophet peace be upon him said: “Whoever disobeys the ruler and becomes separate from the company of Muslims and then dies will die a death of jahiliyyah.”<\/p>\n<p style=\"text-align: justify;\">In addition, he (#3441) narrated from Ibn ‘Umar may Allah be pleased with them that he said: I heard the Prophet peace be upon him saying: “Whoever declines to obey his ruler, he will be faced with Allah the Almighty without an argument. Whoever dies without submitting pledge of allegiance will die a death of jahiliyyah.”<\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<p>&nbsp;<\/p>\n<h3 style=\"text-align: justify;\">Comments on the Above Hadiths<\/h3>\n<p style=\"text-align: justify;\">According to the first hadith, it is about disobedience to the ruler. This cannot be the case with the hidden Shia Mahdi. The second hadith clearly speaks about separating from the company of Muslims. The third hadith is about pledging allegiance, and there is nobody in the past millennium that has pledged his allegiance to the hidden Imam. The above narrations all clearly refer to regular rulers and there is no indication that any of these is referring to an appointed hidden Imam. This is obvious since most Shiite Imams never ruled anything and stayed at home.<\/p>\n<p style=\"text-align: justify;\">We say in response: It&#8217;s quite clear from those narrations which group of people are upon Jahiliyyah(ignorance), out of all groups the Imami Shiites have been the most popular for disobeying the rulers, not pledging allegiance to them and separating from the main body of Muslims to form their own small sect that opposes the rest of the Muslims politically and religiously.<\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: justify;\">Evidence from a Shi&#8217;ee Hadith<\/h2>\n<p style=\"text-align: justify;\">We find in Al-Kafi in the second hadith in Next Chapter after the Chapter of Drinkers of Intoxicants:<\/p>\n<p style=\"text-align: justify;\">Abu Ali Al-Ash&#8217;ari from Al-Hasan bin Ali Al-Kufi from Al-Abbas bin Amer from Dawud bin Al-Husain from Abi Abdullah (as): &#8220;Whosoever drinks an intoxicant, his prayer will not be accepted for forty days. If he dead within those forty days, then he will die a death of the jahiliyyah, but if he repented then Allah will forgive him.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi declares this hadith reliable in Mir&#8217;at Al-Uqool.<\/p>\n<p style=\"text-align: justify;\">As we know, Shias do not declare apostasy for those that drink intoxicants, so it makes perfect sense that what is meant here is not a death of apostasy, but a death of jahiliyyah, since people in the pre-Islamic ages used to drink a lot of intoxicants.<\/p>\n<p>&nbsp;<\/p>\n<p>&#8230;and praise be to Allah the Most Gracious Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>We often hear Shias quoting, “Those that does not know his Imam will die a death of Jahiliyyah.” The narration suggests, according to Shias, that rejecting the twelfth Imam of the Shias, or rather, not acknowledging his birth, ultimately is <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/07\/09\/meaning-of-death-of-jahiliyyah\/\" title=\"Meaning of: Death of Jahiliyyah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,5],"tags":[],"class_list":{"0":"post-2127","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2127","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2127"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2127\/revisions"}],"predecessor-version":[{"id":2135,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2127\/revisions\/2135"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2127"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2127"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2127"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}