{"id":213,"date":"2013-04-25T10:12:21","date_gmt":"2013-04-25T10:12:21","guid":{"rendered":"http:\/\/twelvershia.net\/?p=213"},"modified":"2017-04-04T22:05:09","modified_gmt":"2017-04-04T22:05:09","slug":"respone-to-what-does-mother-of-believers-really-mean","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/04\/25\/respone-to-what-does-mother-of-believers-really-mean\/","title":{"rendered":"Response to: What does Mother of Believers Really Mean?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=213\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a refutation by Kalaam Javed to the article on RevistingtheSalaf.org entitled: What Does Mother Of Believers Really Mean? The article was published on the 22<sup>nd<\/sup> of March, 2012, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/03\/ummahat-ul-muminin.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS website says:<\/p>\n<p><span style=\"color: #ff0000;\"> The position of the Shi&#8217;ee in regards to the wives of the Prophet Muhammed (saw) is that of the Holy Qur&#8217;aan. The righteous wives are those who are devoutly obedient to Allah (swt) commands and to their husbands, and guard in the husband&#8217;s absence what Allah (swt) orders them to guard (i.e. their honor). But, if a wife was to transgress from the path of Allah (swt), she would no longer be treated with a honorific status. The purpose of this article is to evaluate how the title, &#8216;Ummal Mo&#8217;mineen&#8217; has been associated to the wives of the Prophet (saw) and the actual context behind it.<\/span><\/p>\n<p>The RTS position is totally against the position of Ali in this regard. Ali believed that Ayesha has the same respect as she had before. It is mentioned in Nahjul Balagha that Ali said regarding Ayesha after the battle of Jamal:<br \/>\nولها بعد حرمتها الاولى والحساب على الله<\/p>\n<p style=\"text-align: justify;\">&#8220;She has the same respect afterwards as she had earlier, and the accountability is on Allah to take.&#8221;<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">source:<\/span> Nahjul balagha, p. 335<\/p>\n<p style=\"text-align: justify;\">Secondly, it is authentically narrated from `Ali bin abi Talib in Ibn abi Shaybah&#8217;s Musannaf that `A&#8217;ishah is the mother of both the believing men and the believing women.<\/p>\n<p>The chain:<br \/>\nحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ ، قال : حَدَّثَنَا زَائِدَةُ ، عَنْ عَمْرِو بْنِ قَيْسٍ ، عَنْ زَيْدِ بْنِ وَهْبٍ ، قَالَ<br \/>\n[We were told by Ahmad bin `Abdullah, he said: Za&#8217;idah told us, from `Amro bin Qays, from Zayd bin Wahb, he said (etc&#8230;)]<\/p>\n<p>Ahmad bin `Abdullah bin Yunus: Thiqah Hafiz.<br \/>\nZa&#8217;idah bin Qudamah: Thiqah Thabt.<br \/>\n`Umar bin Qays: Thiqah.<br \/>\nZayd bin Wahb: Thiqah.<\/p>\n<p>The relevant part:<br \/>\nفَلَمْ يَكُنْ قِتَالُهُمْ إِلَّا تِلْكَ الْعَشِيَّةَ وَحْدَهَا , فَجَاءُوا بِالْغَدِ يُكَلِّمُونَ عَلِيًّا فِي الْغَنِيمَةِ فَقَرَأَ عَلِيٌّ هَذِهِ الْآيَةُ , فَقَالَ : &#8221; أَمَا إِنَّ اللَّهَ يَقُولُ : وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ سورة الأنفال آية 41 أَيُّكُمْ لِعَائِشَةَ ؟ &#8221; فَقَالُوا : سُبْحَانَ اللَّهِ , أُمُّنَا , فَقَالَ : &#8221; أَحَرَامٌ هِيَ ؟ &#8221; قَالُوا : نَعَمْ , قَالَ عَلِيٌّ : &#8221; فَإِنَّهُ يَحْرُمُ مِنْ بَنَاتِهَا مَا يَحْرُمُ مِنْهَا<\/p>\n<p style=\"text-align: justify;\">[(etc&#8230;) Their battle lasted only that night, then on the next day they (the soldiers) came to ask `Ali for their share of the booty so `Ali recited to them: {Know that, whatever booty you take, the fifth of it is God&#8217;s, and the Messenger&#8217;s} [8:41] `Ali then told them: &#8220;Who shall take `A&#8217;ishah?&#8221; (meaning as part of their share) They responded: &#8220;Glory be to Allah, our mother!?&#8221; He replied: &#8220;Why not, is she forbidden?&#8221; They said: &#8220;Yes!&#8221; `Ali said to them: &#8220;If she is forbidden for you then so are her daughters!&#8221; (&#8230;etc)]<\/p>\n<p>Source: Musannaf ibn abi Shaybah, kitab-ul-Jamal.<\/p>\n<p>Point is, `Ali prohibited his men from taking any of the spoils of war in the battle of al-Jamal since the opponents were Muslims, so when a group of his men asked for their shares from war, he replied in an intelligent way and showed them that they cannot claim their own mother `A&#8217;ishah and therefore they cannot claim any of her daughters (Muslim women).<\/p>\n<p>Perhaps RTS has little care for what its first infallible Imam said, because of the hatred for the wife of the Prophet (peace be upon him).<\/p>\n<p>Afterwards RTS mentioned a lot of Tafaseer to prove its point that the verse of Quran 33:6 refers only to the prohibition of marriage with the wives of the Prophet (peace be upon him). While we know very well that a verse might have more than one implication. This verse has also more than one implication as is proven from the books of Sunnis and Shias. In this article, we will prove that this verse not only proves the prohibition of marrying the wife of the Prophet (peace be upon him), but it also shows the honor of the wives of the Prophet (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">Sunni Tafaseer<\/p>\n<p style=\"text-align: justify;\">1. Tafseer Qurtubi:<\/p>\n<p style=\"text-align: justify;\">وأزواجه أمهاتهم شرف الله تعالى أزواج نبيه صلى الله عليه وسلم بأن جعلهن أمهات المؤمنين ; أي في وجوب التعظيم والمبرة والإجلال وحرمة النكاح على الرجال<br \/>\nAnd his wives (i.e wives of the Prophet) are their mothers (i.e mothers of believers). Allah venerated the wives of His Prophet (s) by giving them the status of mothers of believers, i.e to be respected and venerated and the prohibition of re-marrying.<\/p>\n<p style=\"text-align: justify;\">Tafseer Qurtubi Vol. 14, p. 123<\/p>\n<p>2. Tafseer Ibn Katheer:<br \/>\nوقوله : ( وأزواجه أمهاتهم ) أي : في الحرمة والاحترام ، والإكرام والتوقير والإعظام ، ولكن لا  تجوز الخلوة بهن ، ولا ينتشر التحريم إلى بناتهن وأخواتهن بالإجماع<br \/>\n(and his wives are their mothers.) i.e in terms of Hurmah, and in  terms of honor, respect and veneration, it is not permissible for them to be alone with them, and the prohibition of marriage to them does not extend to their daughters and sisters, according to scholarly consensus.<\/p>\n<p>Tafseer Ibn Kathir, Vol. 6, p. 380<\/p>\n<p>3. Tafseer Fathul Qadeer:<br \/>\nوأزواجه أمهاتهم أي : مثل أمهاتهم في الحكم بالتحريم ومنزلات منزلتهن في استحقاق التعظيم فلا يحل لأحد أن يتزوج بواحدة منهن كما لا يحل له أن يتزوج بأمه ، فهذه الأمومة مختصة بتحريم النكاح لهن وبالتعظيم لجنابهن<\/p>\n<p style=\"text-align: justify;\">(And his wives are their mothers) means:  they are like their mothers in the ruling of prohibition of marriage, and they share the station of deserving treatment of grandeur, so it is not permissible for anyone to marry anyone of them, just like it is impermissible for them to marry their mothers. Thus this motherhood is about forbidding marriage with them and about respecting\/venerating them.<\/p>\n<p style=\"text-align: justify;\">4. Tafseer al Baidhawi:<\/p>\n<p>منزلات منزلتهن في التحريم واستحقاق التعظيم وأزواجه أمهاتهم<br \/>\n“And his wives are their mothers” means they share the station of prohibition in marriage and deserving treatment of grandeur.<\/p>\n<p style=\"text-align: justify;\">Tafseer al-Baidhawi, Vol. 1, p. 364<\/p>\n<p style=\"text-align: justify;\">5. Tafseer Rooh ul Maani:<br \/>\nوأزواجه أمهاتهم أي منزلات منزلة أمهاتهم في تحريم النكاح وإستحقاق التعظيم<br \/>\n&#8220;And his wives are their mothers&#8221; means they share the station of mothers in the prohibition of marriage and the deservement of respect.<\/p>\n<p style=\"text-align: justify;\">Tafseer Rooh al Maani, Vol. 21, p. 151<\/p>\n<p style=\"text-align: justify;\">6. Tafseer al-Lubaab:<br \/>\nوأزواجه أمهاتهم أي مثل أمهاتهم وهو أب لهم وهن أمهات المؤمنين في تعظيم حقهن وتحريم نكاحهن<br \/>\n&#8220;And his wives are their mothers&#8221; means they are like mothers to them (i.e the believers) and he (i.e the Prophet peace be upon him) is their father and they are the mothers of the believers in deserving respect and honor and prohibition of marriage with them.<\/p>\n<p style=\"text-align: justify;\">Tafseer al-Lubaab, Vol. 13, p. 52<\/p>\n<p>Now let’s read the Shia Tafaseer.<\/p>\n<p style=\"text-align: justify;\">Shia Tafaseer<\/p>\n<p style=\"text-align: justify;\">1. Tafseer al-Meezan:<br \/>\nوقوله: (وأزواجه أمهاتهم) جعل تشريعي أي انهن منهم بمنزلة أمهاتهم في وجوب تعظيمهن وحرمة نكاحهن بعد النبي صلى الله عليه وآله وسلم<br \/>\n(and his wives are their mothers). This is the Sharia ruling i.e. his wives are to the men like their mothers, and by necessity they (i.e the wives of the Prophet) have to be honored and are not allowed to be taken as wives after Prophet(saw).<\/p>\n<p style=\"text-align: justify;\">Tafsir al Meezan, Vol. 16, p. 288<\/p>\n<p style=\"text-align: justify;\">2. Tafseer al-Safi:<br \/>\nوأزوجه أمهاتهم منزلات منزلتهن في التحريم مطلقا وفي استحقاق التعظيم<br \/>\n(And his wives are their mothers) means they share the station of prohibition in marriage and deserving treatment of grandeur.<\/p>\n<p style=\"text-align: justify;\">Tafsir Safi , Volume 4, p. 168<\/p>\n<p style=\"text-align: justify;\">3. Tafseer Namoona:<br \/>\nدر اينجا سؤ الى مطرح است و آن اينكه آيا تعبير ((ازواجه امهاتهم )): ((همسران پيامبر مادران مؤ منين محسوب مى شوند)) با چيزى كه در چند آيه قبل گذشت تضاد ندارد؟ زيرا در آنجا مى فرمايد: ((كسانى كه گاهى همسرانشان را بمنزله مادر خود قرار مى دهند، سخن باطلى مى گويند، مادر آنها فقط كسى است كه از او متولد شده اند)) با اين حال چگونه همسران پيامبر كه مسلمانان از آنان متولد نشده اند مادر محسوب مى شوند؟ در پاسخ اين سؤ ال بايد به اين نكته توجه كرد كه خطاب مادر به يك زن يا بايد از نظر جسمانى باشد يا روحانى ، اما از نظر جسمانى تنها در صورتى اين معنى واقعيت دارد كه انسان از او متولد شده باشد، و اين همان است كه در آيات پيشين آمده كه مادر جسمانى انسان تنها كسى است كه از او متولد شده است ، و اما پدر يا مادر روحانى كسى است كه يكنوع حق معنوى بر او داشته باشد، همچون پيامبر (صلى اللّه عليه و آله و سلّم ) كه پدر روحانى امت محسوب مى شود، و هم به خاطر او همسرانش احترام مادر را دارند.<br \/>\nA question arises here that isn&#8217;t the explanation of the verse (and his wives are their mothers) against the verses mentioned before. Because there it is mentioned &#8216;Those who declare their wives as their mothers, and in fact they use false words, their mothers are only the ones who bore them.&#8217; In this situation, how can the wives of the Prophet (peace be upon him) be considered the mothers of the believers. This point should be noted in answering the question at hand that addressing a woman as mother is either due to biological relation, or spiritual relation. This meaning could be only in the case of biological relation, and this is the same thing which is mentioned in the earlier verses, that a person&#8217;s biological mother is only the one who bore him. But the spiritual mother and father are those who have a kind of special right over them, as the Prophet (peace be upon him) is considered the spiritual father of the nation, and due to him, his wives hold the respect which a mother holds.<\/p>\n<p style=\"text-align: justify;\">Tafsir Namoona, Vol. 17, p. 180<\/p>\n<p style=\"text-align: justify;\">4. Tafseer Noor al-Thaqalayn:<br \/>\nعن القائم (عليه السلام) انه سئل عن معنى الطلاق الذي فوض رسول الله (صلى الله عليه وآله) حكمه إلى أمير المؤمنين (عليه السلام)؟ قال: إن الله تقدس اسمه عظم شأن نساء النبي (صلى الله عليه وآله) فخصهن بشرف الأمهات، فقال رسول الله (صلى الله عليه وآله): يا أبا الحسن إن هذا الشرف باق ما دمن على الطاعة فأيتهن عصت الله بعدي بالخروج عليك فأطلقها في الأزواج، وأسقطها من تشرف الأمهات ومن شرف أمومة المؤمنين<br \/>\nIt is narrated from Imam Qaim that he was asked about the right of divorce,  That the Messenger of Allah (s) left it at the discretion of Amirul Momineen (i.e Ali)?” He replied: “The Almighty Allah, hallowed be His name, gave an exalted status to the wives of the Prophet and gave them the honor of being the mothers of the faithful. Thus the Messenger of Allah (s) told Amirul Momineen : O Abal Hasan, this status is valid for them till they remain in the obedience of the Almighty Allah. So whoever of them disobeys Allah and after that me, comes out in armed confrontation against you, remove her from my wife-hood and take away her status of motherhood of faithful.”<br \/>\nTafsir Nur al thaqalayn, Vol. 5, p. 372<\/p>\n<p style=\"text-align: justify;\">The 12th Imam of Shias was right in saying that Allah gave an exalted status to the wives of the Prophet (peace be upon him) when he declared them the mothers of the believers. But he lied when he said that the status was taken away from Ayesha, for the first Imam Ali said, as is mentioned in Nahjul Balagha after the battle of Jamal<br \/>\nولها بعد حرمتها الاولى والحساب على الله<br \/>\nShe has the same respect afterwards as she had earlier, and the accountability is on Allah to take.<br \/>\nNahjul balagha, p. 335<\/p>\n<p>We have proven from the books of Sunnis and Shias that the verse of Holy Quran 33:6 not only proves the veneration of the status of the wives of the Prophet (peace be upon him), but we have also proven from the authentic books of Shias that Ayesha (may Allah be pleased with her) specifically held this status of respect even after the battle of Jamal. It is upto the Shias whether they accept the truth or stick to the ignorance.<\/p>\n<p style=\"text-align: justify;\"><strong> <span style=\"text-decoration: underline;\">Talha ibn Ubaidullah<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">RTS says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Allah (swt) had revealed these verse to expose the evil wish of ‘Talha bin Ubaydullah’ who made a remark that he would marry A&#8217;isha after the death of the Prophet (saw). Thus Allah (swt) sought to remove such an option by revealing these very verses. This fact has been documented plethora in the books of Sunni sources.<\/span><\/p>\n<p>RTS says again:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><br \/>\n<span style=\"color: #ff0000;\"> Such a public declaration unwittingly casts aspersions on the friend’s wife, since it would be automatically assumed that she must have acted or behaved in such a manner that led to the friend developing feelings towards her. This open intention invites others to questions the character of a completely innocent woman, which is humiliating, embarrassing and completely unacceptable.<\/span><\/p>\n<p><span style=\"color: #000000;\"> This is not just ridiculous but it is disgusting as well. Just because a person has intention to marry the wife of someone doesn&#8217;t mean that the wife of that person would have behaved immodestly, and this is something totally unthinkable when it comes to the wives of the Prophet (peace be upon him). But Shi&#8217;ism is a unique cult, where every non-Shia is considered a bastard, so we can expect nothing good from this cult. That is why the Ulemas of Ahlus Sunnah have declared Shias as one of the most misguided sects of the world.<\/span><\/p>\n<p>RTS says again:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> The fact is, Talha’s conduct was inexcusable. We are yet to find any form of Sunni mitigation that might justify his shameless conduct. One would have assumed having publicly declared his affection for A&#8217;isha, she would have sought to distance herself from him as much as possible so as to prevent people from questioning about her character. Yet we learn, in despite of this, A&#8217;isha happily chooses Talha as her journey companion in her nefarious, seditious campaign against Imam Alee (as). A journey wherein Talha accompanied her from her home in Madina up to the plains of Jamal!<\/span><\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"text-decoration: underline;\">The authenticity of the narrations regarding Talha&#8217;s intention to marry Ayesha<\/span><\/strong><\/p>\n<p>There is not a single authentic report regarding this issue. Let&#8217;s see the authenticity of the reports mentioned on the website of RTS.<\/p>\n<p><span style=\"color: #ff0000;\">  Qatada said: ‘A man said: ‘If Allah&#8217;s messenger (saw) died, I would marry A&#8217;isha.’ Hence Allah revealed ‘{Nor is it right for you that ye should annoy Allah&#8217;s Messenger}’ then revealed ‘{and his wives are their mothers.}’<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Source: Tafsir Al-Qurtubi. Vol. 17, Pg. # 228<\/span><\/p>\n<p>Qatadah was born much later after this supposed incident took place. Hence this is a disconnected report.<\/p>\n<p><span style=\"color: #ff0000;\"> It is narrated by Mohammed bin Umar who said that Abdullah bin Jaffar told me that from the authority of ibn Abi Awn from Aboo Bakr bin Mohammed bin Amr bin Hazm about the verse of Allah, &#8220;It is neither permissible for you to annoy the messenger of Allah nor that you should marry his wives after him for ever&#8221; (33:53), he said, this verse was revealed against Talha bin Ubaydullah hence he is the one who said, &#8220;if the Messenger of Allah died, I will marry A&#8217;isha.&#8221;<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Source: Tabaqat Al-Kabir. Vol. 10, Pg. # 191<\/span><\/p>\n<p>This narration is weak due to Muhammad ibn Umar al-Waqidi.<\/p>\n<p><span style=\"color: #ff0000;\"> We were told by Alee, the son of Ahmed, the son of &#8216;Abdaan, that Sulayman, the son of Ahmed al-Lakhmi, said that Hassan, the son of Abbas al-Razi, commended, Mohammad, the son of Hamid, commended, Mahran, the son of Abi-Umar, commended, Sufyan al-Thawri commended, of Dawud, the son of Abi-Hind, (who narrates) of Ikrima, of ibn Abbas said: A man from the companions of the Prophet (saw) said: &#8220;If the Messenger of Allah (saw) would die, I would marry A&#8217;isha or Umm Salama!&#8221; Then Allah the Exalted revealed the following verse: &#8220;And it is not for you that you should hurt the Messenger of Allah, nor to marry his wives after him at all.&#8221; Truly, that is in Allah&#8217;s sight an enormity.<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Source: Sunan Al-Bayhaqi Dar-Kutub. Vol. 7, Ch. 54, Pg. # 110, H # 13418<\/span><\/p>\n<p>This narration is weak due to Muhammad ibn Humayd. And we can see that in this narration, the name of Umme Salmah is also present besides Ayesha. So does the Shias of RTS website consider that she also did something which made Talha to pronounce his intention of marrying her? Remember that she is one of the few wives of the Prophet (peace be upon him) who is not openly insulted by the Shias.<\/p>\n<p><span style=\"color: #ff0000;\"> Abdul-Razzaq and Abdul bin Hamid and ibn Mundhir from Al-Qatadah who said &#8220;Talha bin Ubaydullah said, if the Prophet will die, I will marry A&#8217;isha, then the verse, &#8216;It is neither befitting you to annoy the messenger of Allah nor that you marry his wives after him for ever&#8217; was revealed!&#8221; And so Muqatel son of Hayan and Abdul Rahhman son of Zaid son of Aslam he mentioned with his Sanad that the one who said it was Talha son of Abaydallah until the caution came in forbidding it. Therefore the scholars unanimously agreed that if the Messenger of Allah (saw) dies, it is forbidden to marry any of his wives. It was reported from Alee son of Hussain narrated from Muhammad son of Abi Hamad narration from Mahran from Sufyan from Dawood son of Abi Hind from Ikrimah from ibn Abbas in the saying, &#8220;And it is not lawful for you to bother the Messenger of Allah.&#8221; He said: It was speaking to a man that desired to marry some of the women of the Prophet (saw). A man said to Sufyan: Is it A&#8217;isha? He said: They mentioned that.<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Source: Tafsir Ibn Kathir. Vol. 6, Pg. # 455<\/span><\/p>\n<p>This narration is again disconnected as Qatadah was never present at the time of this incident.<\/p>\n<p><span style=\"color: #ff0000;\"> Ibn Abi Hatim and ibn Mardawiya reported from ibn Abbas that Allah&#8217;s words in “It is neither befitting you to annoy the messenger of Allah (saw) nor that you marry his wives after him for ever.” Ibn Abbas said that the verse was revealed in connection to a man who vowed that he will marry some of the prophet’s wives after his demise. Sufyan said, the wife who was to be married was A&#8217;isha!<\/span><\/p>\n<p>This narration has no Sanad and hence it is weak.<\/p>\n<p><span style=\"color: #ff0000;\"> Ibn Jariir and ibn Abi Hatim narrated from Abdul Rahman bin Zayd bin Aslam who said that, the Prophet of Allah (saw) was informed about a man who said, ‘If the messenger of Allah (saw) died, I will marry so and so after him.” This statement used to annoy the messenger of Allah alot, then the verse, “It is neither befitting for you to annoy the messenger of Allah nor that you marry his wives after him for ever” was revealed.<i><br \/>\n<\/i><\/span><br \/>\nThis narration is Mursal, because Abdur Rahman ibn Zayd ibn Aslam wasn&#8217;t present during the occurrence of this incident and hence the report is weak.<\/p>\n<p><span style=\"color: #ff0000;\"> Also As-Sadee narrated form ibn Abi Hatim who said that “We heard that Talha bin Ubaydullah said that, is Muhammad has kept a partition from our uncle’s daughters and then marries our women after that? But if anything happened to him I will marry his wives after him.”<\/span><\/p>\n<p>First of all, RTS made a mistake in saying that al Suddi narrated from Ibn Abi Hatim, while it is the other way round, i.e Ibn Abi Hatim narrated from al Suddi. Secondly, this narration is Mursal, none of them were present during the occurrence of this incident and hence the report is weak.<\/p>\n<p><span style=\"color: #ff0000;\"> Abdul-Razzaq and Abdul bin Hamid and ibn Mundhir from al-Qatadah who said that “ Talha bin Ubaydullah said, if the Prophet will die, I will marry A&#8217;isha, then the verse “It is neither befitting you to annoy the messenger of Allah nor that you marry his wives after him for ever” was revealed!<\/span><\/p>\n<p>This narration is Mursal, Qatadah wasn&#8217;t present during the occurrence of this incident and hence the report is weak.<\/p>\n<p><span style=\"color: #ff0000;\"> Abdul Razzaq, of Mu&#8217;ammir, of Qatada, that a man said: If the Prophet (saw) was catched (i.e. his life would be catched by Allah), then &#8216;fulana&#8217; (such a woman) would marry, meaning A&#8217;isha. Then Allah (swt) sent down: &#8220;And it is not for you that you should hurt the Messenger of Allah, nor to marry his wives after him at all.&#8221; [Al-Ahzab 53]. Abdul Razzaq: Mu&#8217;ammir said: I heard that this man was Talha bin Ubaydullah.<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Source: Tafsir Al-Qur&#8217;aan, Allamah Sanhani. Vol. 2, Pg. # 122.<\/span><\/p>\n<p>This narration is Mursal, Qatadah wasn&#8217;t present during the occurrence of this incident and hence the report is weak.<\/p>\n<p>As you witnessed that RTS website couldn&#8217;t bring a single authentic report to prove that this incident ever occurred. All the narrations regarding this issue are weak, hence it is doubtful whether this event ever occurred.<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"text-decoration: underline;\">Identity of Talha bin Ubaidullah<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">The fact is that he is not the same Talha ibn Ubaidullah ibn Uthman ibn Amr ibn Kaab al-Tamimi al-Qarshi, who was present in the battle of Jamal, and who was from the ten persons who are guaranteed paradise, rather he is Talha ibn Ubaidullah ibn Musafa&#8217; ibn Ayyaz ibn Sakhar ibn Aamir ibn Kaab al-Tamimi al-Qarshi.  We read in usudul Ghaba he was named as Talha al-Khair as well like Talha ibn Ubaidullah, who is from the ten (who are guaranteed paradise) and this lead to confusion amongst people, and they said : He is the one regarding whom the verse of Quran &#8220;&#8221; was revealed, and this is because he said : If the Prophet (saw) died, I will marry Ayesha, and this is wrong, and this is why a group of people from the ahl al-tafsir  thought that he is Talha ibn Ubaidullah, the one from the ten (who are guaranteed paradise) when they saw that he is Talha ibn Ubaidullah al-Tamimi al-Qarshi, and that he is a Sahabi as well.<br \/>\nUsudul Ghaba, Vol. 5, p. 122<\/p>\n<p style=\"text-align: justify;\">Secondly, we don&#8217;t give any excuses for his conduct. He made a mistake, and repented, just like Abu Dharr committed a mistake and repented when he used ill words for the mother of another person which angered the Prophet (peace be upon him). We read in Hayat ul Quloob:<\/p>\n<p style=\"text-align: justify;\">It is narrated with a Sahih Sanad from Imam Baqir that he said : Abu Dharr used ill words for the mother of a person during the era of the Prophet (peace be upon him), and said : O son of a black woman. Because his mother was black. Upon this, the Prophet (peace be upon him) said: O Abu Dharr &#8211; Do you condemn him for his mother? When Abu Dharr heard this, he laid down on the mud. He wept and put mud on his head and face. Atlast the Prophet (peace be upon him) became pleased with him.<br \/>\nHayat ul Quloob, Vol. 2, p. 971<\/p>\n<p style=\"text-align: justify;\">Just like Abu Dharr, Talha ibn Ubaidullah made a mistake, and repented. It is mentioned in the scan which RTS has uploaded in its website, but didn&#8217;t translate.<br \/>\nوندم هذا الرجل على ما حدث به في نفسه فمشي الى مكة على رجليه و حمل على عشرة افراس في سبيل الله واعتق رقيقا فكفر الله عنه<\/p>\n<p style=\"text-align: justify;\">This man felt guilty for his thoughts and walked to Makkah on his bare feet, then equipped ten with horses for the sake of ِAllah, and let free a slave, and with that Allah has forgiven him.<br \/>\nTafsir Al-Qurtubi. Vol. 17, Pg. # 209<\/p>\n<p><strong> <span style=\"text-decoration: underline;\">Qutayla bint Qays<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">Let me make it clear that Qutayla&#8217;s marriage with the Prophet (peace be upon him) is a not a certain thing. There are various reports, ranging from her marriage with the Prophet (peace be upon him) to the reports which negates her marriage with the Prophet (peace be upon him). There are no specific narrations which prove that she did marry the Prophet (peace be upon him) and that she was included in the mothers of the believers. We would stick to what RTS itself posted in its website to prove that she was not an Ummul Momineen.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> We read in Sahih Muslim:<\/span><br \/>\n<span style=\"color: #ff0000;\"> وَقَالَ النَّاسُ لاَ نَدْرِى أَتَزَوَّجَهَا أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ. قَالُوا إِنْ حَجَبَهَا فَهْىَ امْرَأَتُهُ وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ أُمُّ وَلَدٍ فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا<\/span><\/p>\n<p style=\"text-align: justify;\">The people said: &#8216;We do not know if he (i.e the Prophet) has married her (i.e Safiyyah) or taken her as a concubine.&#8217; They said: &#8216;If he veils her then she is his wife, and if he does not veil her then she is a concubine.&#8217; When he wanted to ride, he veiled her, and she sat on the back of the camel, so they knew that he had married her.<\/p>\n<p>From this narration, we come to know that when the Prophet (peace be upon him) took a woman as his wife, he would veil her. Now RTS has itself mentioned in its website that Qutayla was not veiled.<\/p>\n<p style=\"text-align: justify;\">RTS has quoted in its website from Usudul Ghaba:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is also narrated that The Prophet (saw) willed to let her choose, if she wanted she could wear the veil and so she becomes forbidden for the Muslims, or if she wants she can divorce him so she can choose who she wants to marry. She chose to be seperated, so she was given a divorce and Ikrimah ibn Abi Jahl married her. So Aboo Bakr was informed of this and he said: &#8220;I was urged to (thought of) burning the house over them.&#8221; Umar in response said: &#8220;She is not the mother of believers, he didn&#8217;t enter into her, or make her wear the veil.&#8221; <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Usd ul-Ghaybah. Pg. # 234<\/span><\/p>\n<p style=\"text-align: justify;\">Similarly RTS has quoted from al-Isaba:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;Ikrimah bin Abu-Jahl married her in Hadhramut, and when it (the news) reached Aboo Bakr, he said: &#8220;I will burn their house upon them.&#8221; Then Umar said to him: &#8220;She is not of the mothers of the believers, and neither did he (the Prophet) &#8216;enter&#8217; upon her, nor did he cast the veil on her!<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Al-Isaba fi Tamyiz al-Sahaba. Vol. 2, Pg. # 1903-1904<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"> Hence she was not the wife of Prophet (peace be upon him) and Umar was right in stating that she was not the mother of the believers.<\/span><br \/>\n<span style=\"color: #000000;\"> She doesn&#8217;t become a mother of believers according to this narration as well which RTS has quoted from Usudul Ghaba:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is also narrated that The Prophet (saw) willed to let her choose, if she wanted she could wear the veil and so she becomes forbidden for the Muslims, or if she wants she can divorce him so she can choose who she wants to marry. She chose to be separated, so she was given a divorce and Ikrimah ibn Abi Jahl married her.<\/span><br \/>\n<span style=\"color: #ff0000;\"> Usd ul-Ghaybah. Pg. # 234<\/span><\/p>\n<p style=\"text-align: justify;\">She didn&#8217;t wear the veil, and the Prophet (peace be upon him) gave her the option that if she willed, she could could chose who she wants to marry, and after this clear statement, the RTS still objects at the marriage of Ikrimah with her.<\/p>\n<p style=\"text-align: justify;\">To end the discussion, I quote what RTS has quoted from al-Isaba regarding Qutayla bint Qais:<br \/>\n<span style=\"color: #ff0000;\">وفيها اختلاف كثير جدا<\/span><br \/>\n<span style=\"color: #ff0000;\"> “and there is a lot of disagreement on her.”<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Al-Isaba fi Tamyiz al-Sahaba. Vol. 2, Pg. #  1904<\/span><\/p>\n<p style=\"text-align: justify;\">So when there is lot of disagreement on her, what right RTS has to take one opinion and use it against the Ahlus Sunnah knowing fully well that there are other opinions as well regarding her?!<\/p>\n<p style=\"text-align: justify;\">As we can see, the article of RTS is full of deceptions which has been exposed and refuted with the authentic Sunni and Shia books. May Allah be pleased with the Ahlelbayt and the Sahaba. Aameen!<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>&#8230;it is authentically narrated from `Ali bin abi Talib in Ibn abi Shaybah&#8217;s Musannaf that `A&#8217;ishah is the mother of both the believing men and women&#8230; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/04\/25\/respone-to-what-does-mother-of-believers-really-mean\/\" title=\"Response to: What does Mother of Believers Really Mean?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[21],"class_list":{"0":"post-213","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-aisha"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/213","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=213"}],"version-history":[{"count":12,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/213\/revisions"}],"predecessor-version":[{"id":4016,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/213\/revisions\/4016"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=213"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=213"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}