{"id":2147,"date":"2015-07-14T07:45:57","date_gmt":"2015-07-14T07:45:57","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2147"},"modified":"2015-07-14T07:45:57","modified_gmt":"2015-07-14T07:45:57","slug":"response-to-glimpses-of-shiism-in-the-musnad-of-ibn-hanbal","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/07\/14\/response-to-glimpses-of-shiism-in-the-musnad-of-ibn-hanbal\/","title":{"rendered":"Response to: Glimpses of Shiism in the Musnad of Ibn Hanbal"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2147\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a refutation by brother TwoBlade to Dr. Sayyid Kazim Tabtaba&#8217;i&#8217;s &#8220;Glimpses of Shiism in the Musnad of Ibn Hanbal&#8221;. The original work can be found on the al-islam.org <a href=\"http:\/\/www.al-islam.org\/message-thaqalayn\/general-message-thaqalayn\/glimpses-shiism-musnad-ibn-hanbal-dr-sayyid-kazim\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">======================================<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Introduction<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">If a researcher plagued with an uncritical eye and a desire to establish something he already believes in goes about looking into any book, he will find in it everything he believes in. Whether he looks into the Rig Veda, or the Talmud, he will find Jesus as Christ and part of a Triune Godhead. Whether he looks into what&#8217;s survived of the writings of Mani or the Bible, he will find Buddha and his teachings. It comes as no surprise than that the author of “Glimpses of Shiism in the Musnad of Ibn Hanbal”, based on the more thorough set of articles, “Musnad ar-Riza”, will find his religion everywhere he looks in Sunni texts. We&#8217;ll take a look at:<\/p>\n<p>–   The authenticity of the traditions he&#8217;s quoted and his reliability in conveying remarks.<br \/>\n–   The reality that such traditions are most definitely not limited to the Musnad, but will invariably be found in several works of Ahlus Sunnah (regardless of whether or not the traditions are authentic) contrary to his claim.<br \/>\n–   The problematic nature of his forcing his pre-established notions and personal interpretations on these otherwise clear narrations.<\/p>\n<p>The format will be to first cite what needs to be cited from Tabatabai&#8217;s work, followed by short comments as to his errors in transmission, followed by the actual text of the narration with the summarized tawtheeq of Shua&#8217;yb Arnout, then any comments concerning the narration, it&#8217;s meaning, it&#8217;s purpose of inclusion by Tabatabai and why it is actually a narration benefiting the Ahlus Sunnah and not the Rafidha.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Preface<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Before dealing with the traditions however, I want to address certain assertions made in the preface. Although several objectionable and unreliable claims were made in the preface of the work being looked at, it will suffice here only to deal with those related to Imaam Ahmed, and more particularly, his musnad. Any quotations and facts about the Imaam and his musnad provided herein as responses are from the seerah of Imaam Ahmed (rah) by Salahudin &#8216;Alee Abdul Mawjood, unless otherwise stated, inshaAllah. Likewise, comments on asanid in the text can be referred back to Shua&#8217;yb Arnout&#8217;s (rah) tahqeeq unless otherwise stated, inshaAllah.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>One of the characteristics of this work is the wide space given to hadīth concerning the merits of the Prophet’s Ahl al-Bayt, most of which are confirmed from the viewpoint of Shi‘ite Muslims as well. Compared to the other hadīth compendiums of the Sunnis, the Musnad’s emphasis on this subject is so pronounced that it has attracted the attention of orientalists and other researchers.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Considering all the facts, this isn&#8217;t a shock. The author of this set of extracts from the musnad has himself mentioned that it is a “bulky compendium” of over 30,000 unique sayings. It isn&#8217;t the least bit surprising to find in it more traditions praising ahlul bayt, who are loved by and adhered to by Ahlus Sunnah, as the book has a greater number of traditions in general and a lower criterion for inclusion than such works as the saheeh of Bukhari, or saheeh of Imaam Muslim.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">It&#8217;s actually the general statement of Ibn Khallikan that the musnad contains narrations not found anywhere else. Ibn Jawzi (rah) has said, “there is no hadeeth which doesn&#8217;t have a basis in this musnad.” In fact, it&#8217;s been noted that Imaam Ahmed (rah) had been in the constant process of revamping the work as he taught it, regularly adding and removing traditions from it until the day he (rah) died at which point this task could no longer be carried out. It includes in it, therefore, a mixture of the authentic and the inauthentic, the established and the weak. This conjecture of Tabatabai, his Twelver associates and supposedly also of the Orientalists, has no real basis in light of these facts.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>The Musnad of bin Hanbal is probably the first of the six books of hadīth considered authentic by Sunni Muslims.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">This is an untrue and baseless conjecture on the part of Tabatabai, the musnad isn&#8217;t even considered a part of saheeh as-sittah, let alone being the first of the six. There is a debate amongst the scholars as to the inclusion of Sunan Darimi, Sunan ibn Majah or Muwatta of Imaam Maalik as the sixth of the six, but not the musnad of Imaam Ahmed. The musnad does however hold its own special place in the libraries of the scholars of Islaam.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><strong>The author has selected from the bulky hadīth literature, a large number of narrations to serve as guidelines and support for the people so that when differences arise they take refuge in them and cite them as authentic.<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Actually, the claim of the Imaam was that they could he wrote the musnad so that it could serve as an Imaam for the Muslims when differences arose, not that everything therein was authentic. And unlike the strange beliefs of the Twelvers, the Muslims don&#8217;t consider an Imaam as infallible and perfect. Rather, an Imaam can be right and wrong and this is determined only through checking.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">It is a known fact though that Imaam Ahmed (rah) was continuously working on the musnad, revising it and removing from it what he found to be unreliable, adding to it whatever he gained in knowledge and so forth, till the day he (rah) died. It is even a known fact that his son (rah) added narrations to it when he (rah) transmitted it – a fact of which Tabatabai was aware as indicated in one of the traditions upon which he commented. This clearly indicates that there are in it those things which are objectionable, and weak, and the scholars have listed these and discussed them. Furthermore, had Tabatabai actually consulted Ahmed Shakir&#8217;s tawtheeq of the musnad beyond simply citing a handful of cases of authentication, he would&#8217;ve found that Ahmed Shakir weakened plenty of traditions – a far cry from considering all the reports in the musnad as authentic.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><strong>However, the most outstanding characteristic of the Musnad is that it contains several eyecatching hadīth on the merits of the Prophet’s Ahl al-Bayt (‘a), whereas most of the compilers of the other masānīd, sihāh and sunan, have either ignored these ahādīth or related only a few of them.<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">This is not in the least bit true, as will be detailed presently. Although the musnad may contain a number of odd, eye-catching traditions, such traditions can often also be found in the generality of the Muslim corpus of ahadeeth, usually suffering from the same flaws in the chains. Likewise, what the musnad contains of authentic praise of Ahlul Bayt in general, and Ahlul Kisa (&#8216;Alee&#8217;s family) in particular, is known from many of the Muslim texts and is most definitely not limited to the musnad.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><strong>Ibn Hanbal got into trouble with the authorities for having related these ahādīth on the merits of the Ahl al-Bayt (‘a)<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">This has been the case for numerous scholars of the Sunna&#8217; and isn&#8217;t particularly telling or unique. The trouble for which Imaam Ahmed (rah) is known is his refusal to bow down before the mihna (inquisition) and maintain his belief concerning the Qur&#8217;aan. Through the wounds on his back and his suffering in general, the proper aqeedah has been preserved, wal-hamdulillah. If the Twelver Shi&#8217;a really held disapproval of the authorities as a proof of authenticity in a thing, than they would adopt our view concerning the Holy Qur&#8217;aan rather than the blasphemies they attribute to it.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><strong>Muhammad bin Ismā‘īl al-Bukhārī and Muslim bin Hajjāj al-Qushayrī, for fear of the ‘Abbāsids, left out these ahādīth but since Ahmad was courageous he showed no fear in relating the ahādīth on the merits of Imam ‘Alī (‘a) and the Ahl al-Bayt (‘a).<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">This is patently false. Several traditions on the merits of these people have been mentioned by Muslim and Bukhari. Had they truly had such fear, would they have mentioned any traditions of this nature at all, let alone the number that they did narrate? Imaam Bukhari had an eye on fiqh, not fadhail, but more importantly, many of these traditions don&#8217;t meet the necessary requirements for authentication that those included by sheykhan (rah) have met. This has nothing to do with fearing the Abbasids.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Even more telling is the various narrations Sheykhan (ra) have mentioned with respect to the high position of Ameer ul-Mumineen Mu&#8217;awiyah bin Abi Sufyan (ra) or which they have related through Mu’awiyah. Had they really wanted to hide something from the Abbasids, it would&#8217;ve been more appropriate to hide the various narrations they authenticated concerning Mu&#8217;awiyah (ra). This theory has absolutely no ground to stand upon.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">After quoting a story of Imaam Ahmed (rah) refuting some people speaking of the caliphate of the four followed by this interpretation, he says:<\/p>\n<p style=\"text-align: justify;\"><strong>The meaning of this statement is that the other caliphs adorned themselves with the caliphate and the caliphate covered their flaws, but there was no shortcoming or deficiency in (Imam) ‘Ali (‘a) to be made up by the caliphate.<\/strong> [Footnote:] Ibn Abī al-Hadīd, Sharh Nahj al-Balāghah, vol. 1, p. 17.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">The source mentioned for this interpretation of the story is a very late work by a Mutazilli scholar, done on the orders of a later day Imami Shi&#8217;ite on a later-day Imami Shi&#8217;ite work considered by the Sunni scholars to be one chock full of Imami Shi&#8217;ite fabrications. Will Tabatabai tell people the beliefs of Imaam Ahmed (rah) on account of a Mutazilli when Imaam Ahmed was the defense of the Muslims against the Mutazilla during the mihna (inquisition)? When his suffering was on account of none other than them? Does such a story actually provide us with anything veritable with respect to the pillar of Muslim scholarship, Imaam Ahmed (rah)?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Incredibly, this interpretation cited by Tabatabai even contradicts a saying cited and attributed to Imaam Ahmed by Tabatabai himself through a comparatively more reliable source (Ibn Jawzi&#8217;s (rah) manaqib al-Imaam Ahmed):<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">[Imaam Ahmed&#8217;s defense of the tradition that &#8216;Alee (ra) is the distributor of Hell to which the author of this text adds in the footnotes:] <strong>It is interesting to note that bin Hanbal’s reply bears close resemblance to the answer given by Imam Ja‘far al-Sadiq (‘a) to Mufazzal bin ‘Umar concerning this same hadith. Imam ‘Alī bin Musā al-Rizā (‘a) also gave a similar reply to Ma’mun; refer to ‘Allāmah Majlisī: Bihār al-Anwār, vol. 39, pp. 193-194, Dār al-Ihyā’ al-Turāth al-‘Arabī, Beirut. It is essential to know that according to many narrations, Imam ‘Alī (‘a) has stated: I am the distributor of heaven and hell”,<\/strong> Bihār al-Anwār, vol. 39, p. 199.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Apart from destroying prior interpretation of Ibn Abi al-Hadid, the Mutazilli that Tabatabai referenced, his comments have actually provided us with something far more beneficial. This very interesting tradition, coupled with Tabatabai&#8217;s comments, establishes the intellectual theft of the Rafidha who took the defense of &#8216;Alee (ra), and the tradition about him, by Imaam Ahmed (rah) and placed it instead in the mouths of Ja&#8217;far (rah) and &#8216;Alee al-Riza.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">In this same way, the Imamis have plagiarized every one of the fadhail and the athaar of the thousands of Sahaba and the Prophets and combined them, mostly in 2-3 superman Imaams (ra-rah). The Imamiyah will not be satisfied though with simply stealing the statements of Imaam Ahmed (rah), rather, they will attribute this to their idea that Ahmed (rah) was nothing more than a disciple to the Imaams to whom they claim allegiance:<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Tabtabai:<\/p>\n<p style=\"text-align: justify;\"><strong>The author of Rawzāt al-Jannāt relates on the authority of Daylamī’s Irshād al-Qulub that Ahmad bin Hanbal was a student of Imam al-Kāzim (‘a). Shaykh al-Tā’ifah Tusī considers him among the students of Imam al-Rizā (‘a). A contemporary researcher pointing out bin Hanbal’s links with Imāmī scholars, writes that he studied under many of those known to be followers of the school of Imam Ja‘far al-Sādiq (‘a), and for this reason he has often been criticised by the enemies of the Shi‘ites. <\/strong>[footnote:] The author has listed the names of Ibn Hanbal’s teachers, who according to him had Shi‘ite tendencies, but a review of Shi‘ite narrators in Sayyid al-Khu’ī’s Mu‘jam Rijāl al-Hadith shows that no hadith has been related from Ahmad bin Hanbal in authoritative Shi‘ite books of hadith.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Concerning the first two claims, they come from Twelver texts. Although it would not be the least bit surprising for these men, particularly Imaam Ja&#8217;far (rah), to be teaching one another from traditions they knew, nothing of this nature is established.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">As to the claim that he (rah) had Shi&#8217;i teachers, than it&#8217;s well-known that the people considered as Shi&#8217;a by Ahlus Sunnah are not the latter-day Imami group, but the sects within Islaam, and those who leaned towards them, which elevated &#8216;Alee (ra) beyond his actual rank. This was not entirely uncommon and any scholar with enough teachers probably had at least one Shi&#8217;i teacher in this respect.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a refutation by brother TwoBlade to Dr. Sayyid Kazim Tabtaba&#8217;i&#8217;s &#8220;Glimpses of Shiism in the Musnad of Ibn Hanbal&#8221;. The original work can be found on the al-islam.org here. ====================================== Introduction If a researcher plagued with an <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/07\/14\/response-to-glimpses-of-shiism-in-the-musnad-of-ibn-hanbal\/\" title=\"Response to: Glimpses of Shiism in the Musnad of Ibn Hanbal\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,6],"tags":[],"class_list":{"0":"post-2147","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2147","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2147"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2147\/revisions"}],"predecessor-version":[{"id":2195,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2147\/revisions\/2195"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2147"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2147"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2147"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}