{"id":2160,"date":"2015-07-16T22:07:20","date_gmt":"2015-07-16T22:07:20","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2160"},"modified":"2015-07-16T23:15:31","modified_gmt":"2015-07-16T23:15:31","slug":"criticisms-on-al-islam-orgs-battle-of-badr-article","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/07\/16\/criticisms-on-al-islam-orgs-battle-of-badr-article\/","title":{"rendered":"Criticisms on Al-Islam.org’s “Battle of Badr” Article"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2160\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">The following is a criticism of Al-Islam.org’s “Battle of Badr” <a href=\"http:\/\/www.al-islam.org\/articles\/battle-badr\" rel=\"external nofollow\">article<\/a>, which should be known as “Bani Hashim vs Bani Umayyah” according to the biases that one finds before them in this sad attempt to re-write history. The glorious massacre of the non-believers at the hands of Muslims has turned into the tribal warfare of jahiliyyah. Truly, a Shi’ee cannot write about the seerah of the Prophet – peace be upon him – without butchering it. We provide our criticism to these biases below:<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> <strong>The False Claims that the Duels were Between the Hashimites and the Umayyads<\/strong><\/p>\n<p style=\"text-align: justify;\">The author states: <span style=\"color: #ff0000;\">“The battle began when Utbah Ibn Rabi-ah, his son Al Walid and his brother Sheibah (all from the Ommayad) stood in front of the pagan army and asked the Prophet (S) to send to them their equals for a dual. Hundreds of companions were around him and many of them were expecting to be called upon by the Prophet (S) but he choose to start from his own family.”<\/span><\/p>\n<p style=\"text-align: justify;\">First of all, none of these three men were from Bani Umayyah, but they are all from Bani Abd Shams.<\/p>\n<p style=\"text-align: justify;\">Utb’ah bin Rabee’ah bin Abd Shams<\/p>\n<p style=\"text-align: justify;\">Shaybah bin Rabee’ah bin Abd Shams<\/p>\n<p style=\"text-align: justify;\">Al-Waleed bin Utbah bin Rabee’ah bin Abd Shams<\/p>\n<p style=\"text-align: justify;\">Furthermore, the author of the article, who did not quote a source, left out that three of the Ansar stepped up to fight the non-believers. These three were Awf bin Al-Harith, Mu’awath bin Al-Harith, and Abdullah bin Ruwaha. It was only then when the non-believers requested people from the own tribe to fight them. Then the Prophet – peace be upon him – called upon Ali, Hamza, and Ubaidah bin Al-Harith. This is according to famous reports from the Seerah of Ibn Hisham 1\/552 and Sunan Abi Dawud #2291.<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> <strong>Excessive Praise for the Hashimites<\/strong><\/p>\n<p style=\"text-align: justify;\">The author exaggerates that: <span style=\"color: #ff0000;\">“when the general offensive began, hundreds of companions participated in the battle and offered sacrifices and pleased their Lord. But the members of the house of the Messenger (S) distinguished themselves.”<\/span><\/p>\n<p style=\"text-align: justify;\">The author, in reality is only referring to Ali bin Abi Talib, since he does not know nor even care about the other Hashimites who participated in the battle. It is not surprising that we do not find any example of how they “distinguished themselves”, apart from Ali, as we shall soon examine.<\/p>\n<p style=\"text-align: justify;\">Those that participated from Bani Hashim were:<\/p>\n<p style=\"text-align: justify;\">Ali bin Abi Talib<\/p>\n<p style=\"text-align: justify;\">Hamza bin Abd Al-Mutalib<\/p>\n<p style=\"text-align: justify;\">Ubaidah bin Al-Harith bin Al-Mutalib<\/p>\n<p style=\"text-align: justify;\">Al-Tufail bin Al-Harith<\/p>\n<p style=\"text-align: justify;\">Al-Husain bin Al-Harith<\/p>\n<p style=\"text-align: justify;\">Mistah bin Uthatha<\/p>\n<p style=\"text-align: justify;\">Bani Hashim were only six in number. Hamza brought two allies, and the Prophet – peace be upon him – brought three of his slaves. This brings the total to eleven. See Seerat Ibn Hisham 1\/596-597.<\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong> <strong>Exaggeration of the Numbers killed by Ali<\/strong><\/p>\n<p style=\"text-align: justify;\">The author of the article then proudly states: <span style=\"color: #ff0000;\">“Twenty or twenty two of them (the non-believers) died at Ali’s hand.”<\/span><\/p>\n<p style=\"text-align: justify;\">The author finally provides sources for his claims. He quotes Seerat Ibn Hisham and unreliable Al-Waqidi. However, there are exaggerations here, for Al-Waqidi 1\/144 mentions that “Ali killed and assisted in the killing of twenty-two.” He did not say that Ali alone killed “twenty-two.”<\/p>\n<p style=\"text-align: justify;\">For example, Al-Waqidi 1\/143 says, “Aws bin Mi’yar was killed by both Uthman bin Math’un and Ali bin Abi Talib together.”  Al-Waqidi 1\/143 also includes those that Ali may have possibly killed. He says, “Munabih bin Al-Hajjaj was killed by either Abu Al-Yasr or Ali or Abu Usaid Al-Sa’idi.”<\/p>\n<p style=\"text-align: justify;\">According to Al-Waqidi and Ibn Hisham, there is a difference of opinion regarding the killing of many non-believers. The differences of opinion include the following:<\/p>\n<p style=\"text-align: justify;\">Abu Al-Aas bin Qais bin Adi: Killed by Ali or Al-Nu’man bin Malik or Abu Dujana.<\/p>\n<p style=\"text-align: justify;\">Abu Al-Qais bin Al-Fakih: Ali or Ammar bin Yasser.<\/p>\n<p style=\"text-align: justify;\">Al-Munabin bin Al-Hajjaj: Killed by Abu Al-Yasr or Abu Usaid Al-Sa’idi or Ali.<\/p>\n<p style=\"text-align: justify;\">Hanthala bin Abi Sufyan bin Harb: Killed by Zaid bin Haritha or Hamza, Ali, and Zaid.<\/p>\n<p style=\"text-align: justify;\">Harmala bin Amr: Killed by Kharijah bin Zaid or Ali.<\/p>\n<p style=\"text-align: justify;\">Mu’awiyah bin Amer: Killed by Ali or Ukasha.<\/p>\n<p style=\"text-align: justify;\">Tu’aimah bin Ali: Killed by Ali or Hamza.<\/p>\n<p style=\"text-align: justify;\">Umair bin Uthman: Ali or Abd Al-Rahman bin Awf.<\/p>\n<p style=\"text-align: justify;\">Uqbad bin Abi Mu’eet: Killed by Asim bin Thabit or Ali.<\/p>\n<p style=\"text-align: justify;\">Utbah bin Rabee’ah: Killed by Ubaidah bin Al-Harith, or helped by Ali and Hamza.<\/p>\n<p style=\"text-align: justify;\">Yazeed bin Tameem: Killed by either Ammar or Ali.<\/p>\n<p style=\"text-align: justify;\">Zaid bin Mulais: Killed by either Ali or Bilal.<\/p>\n<p style=\"text-align: justify;\">Zam’a bin Al-Aswad: Killed by Thabit bin Al-Jith’ or Thabit, Ali, and Hamza.<\/p>\n<p style=\"text-align: justify;\">Of course, according to the Shia historian, all of these non-believers were killed by Ali bin Abi Talib. However, an objective student of history would find no reason to doubt the alternatives, for most of them aren’t even famous. On the other hand, Shias are known to have exaggerated the merits of Ali and glorified him to a higher state than he deserves.<\/p>\n<p style=\"text-align: justify;\">In short, according to the Shia view, the Sunnis stole the merits of Ali, and spread them across Al-Nu’man bin Malik, Abu Dujana, Ammar bin Yasser, Abu Al-Yasr, Abu Usaid Al-Sai’idi, Zaid bin Haritha, Hamza, Kharijah bin Zaid, Ukasha, Abd Al-Rahman bin Awf, Asim bin Thabit, Ubaidah bin Al-Harith, Bilal, and Thabit Al-Jith’.<\/p>\n<p style=\"text-align: justify;\">On the other hand, Sunnis believe that Shias stole the merits of those companions, who are unknown to most Sunnis, and gave them all to Ali.<\/p>\n<p style=\"text-align: justify;\">The simplest argument that the Sunni will provide to back up their case is that: if it were the Sunnis that were fabricating these events, then we would have seen many more cases of Abu Bakr and Omar killing the non-believers.<\/p>\n<p style=\"text-align: justify;\">Furthermore, according to Ibn Ishaq (d .150), the earliest and most reliable scholar to have included the names of those that Ali killed, the following were the victims of Ali:<\/p>\n<p style=\"text-align: justify;\">Al-Waleed bin Utbah bin Rabee’ah<\/p>\n<p style=\"text-align: justify;\">Amer bin Abdullah<\/p>\n<p style=\"text-align: justify;\">Al-Aas bin Sa’eed bin Al-Aas bin Umayyah<\/p>\n<p style=\"text-align: justify;\">Nawfal bin Khuwailid bin Asad<\/p>\n<p style=\"text-align: justify;\">Al-Nadhar bin Al-Harith bin Kalada<\/p>\n<p style=\"text-align: justify;\">(See Seerat Ibn Hisham 1\/623-628)<\/p>\n<p style=\"text-align: justify;\">It is important to note that even Al-Aas bin Sa’eed bin Al-Aas was differed upon. Some said that he was killed by Sa’eed bin Abi Waqqas or Abu Al-Yasr 1\/623.<\/p>\n<p style=\"text-align: justify;\">Furthermore, Ibn Sa’ad records in Al-Tabaqat 2\/17 that Nawfal bin Khuwailid was killed as a prison of war in Al-Atheel and Al-Nadhar was also a prisoner of war. This implies that Ali did not kill them during the heat of battle.<\/p>\n<p style=\"text-align: justify;\">It is needless to say that the confusion and differences of opinion only exist due to the looseness of the scholars of history with their standards when it came to such lists. The vast majority of such are not based upon eye-witnesses or chains of narrators. One’s best chance of knowing the details is by referring to the earliest and most reliable source alone. Unlike the hadith of the Prophet – peace be upon him – , which lead to permissibility, prohibition, and the structuring of the proper Islamic ideology, the specifics of kill lists do not really change the way one views religion.<\/p>\n<p style=\"text-align: justify;\">However, it seems clear that it was due to this negligence that we have Shias today claiming that Ali was responsible for over a quarter of the casualties of the Battle of Badr.<\/p>\n<p style=\"text-align: justify;\">It is important to note that Ali was seen as a true warrior even by Ahl Al-Sunnah as recorded in a hadith by Ibn Abbas. However, the narration shows that he was a warrior amongst warriors, and not a one man army. Ibn Abi Asim narrates in his Kitab Al-Jihad #249 through an authentic chain that the Prophet – peace be upon him – said to a boasting Ali after the end of Uhud, “If you did well, then so did Sahl bin Hunaif, Al-Harith bin Al-Summa, Abu Dujana, and Asim bin Thabit.”<\/p>\n<p style=\"text-align: justify;\">And praise be to Allah the Most Gracious Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a criticism of Al-Islam.org’s “Battle of Badr” article, which should be known as “Bani Hashim vs Bani Umayyah” according to the biases that one finds before them in this sad attempt to re-write history. The glorious massacre <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/07\/16\/criticisms-on-al-islam-orgs-battle-of-badr-article\/\" title=\"Criticisms on Al-Islam.org’s “Battle of Badr” Article\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,6],"tags":[],"class_list":{"0":"post-2160","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2160","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2160"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2160\/revisions"}],"predecessor-version":[{"id":2164,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2160\/revisions\/2164"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2160"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2160"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2160"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}