{"id":2202,"date":"2015-07-21T10:51:18","date_gmt":"2015-07-21T10:51:18","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2202"},"modified":"2015-11-11T12:40:19","modified_gmt":"2015-11-11T12:40:19","slug":"criticism-of-al-sahifa-al-sajjadiyya","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/07\/21\/criticism-of-al-sahifa-al-sajjadiyya\/","title":{"rendered":"Criticism of al-Sahifa al-Sajjadiyya"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2202\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\"><strong><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2021 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"Al-Sahifa Al-Sajjadiyya\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a>Al-Sahifa Al-Sajjadiyya is one of the most popular and accepted texts of supplications by Shias<\/strong>. After <a href=\"http:\/\/twelvershia.net\/2015\/11\/11\/examining-nahjul-balagha-and-the-eloquence-of-ali\/\" rel=\"external nofollow\">Nahj Al-Balagha<\/a>, it is perhaps the most well-known Shia text to the common Shia man. An online copy can be found on the <a href=\"http:\/\/www.al-islam.org\/sahifa-al-kamilah-sajjadiyya-imam-zain-ul-abideen\" rel=\"external nofollow\">al-islam.org website.<\/a> Though, like our previous article about Risalat Al-Huquq or the <a href=\"http:\/\/twelvershia.net\/2015\/07\/13\/criticism-of-treatise-of-rights-risalat-al-huquq\/\" rel=\"external nofollow\">Treatise of Rights<\/a>, this text is <strong>falsely attributed to Zain Al-Abideen, and there are no real evidences that Al-Sahifa Al-Sajjadiyya was authored by him.<\/strong><\/h3>\n<p style=\"text-align: justify;\"><strong>This is confirmed in the words of even the staunchest Shia scholars like Al-Majlisi I<\/strong> in Rawdhat Al-Muttaqeen 19\/134.<\/p>\n<p style=\"text-align: justify;\">While attempting to defend the reliability of Al-Sahifa Al-Sajjadiyya, he said:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><em>Be aware that there are many successive chains of the sahifa to ‘Umayr bin al-Mutawakkel. Though ‘Umayr and al-Mutawakkel are unknown, but this has no such an impact for several reasons:<\/em><\/p>\n<p style=\"text-align: justify;\"><em>First, The sahifa itself clearly isn’t scribed by human beings, especially ‘Umayr and al-Mutawakkel as they were not among the Sunni scholars (‘ulamā’ al ‘āmmah), and how would it be possible for those scholars to refer scripts to our Imams peace be upon them; nor are they Shi’i scholars for they have not acquired such a lofty status without anyone knowing them in the first place.<\/em><\/p>\n<\/blockquote>\n<p>In order words, Al-Majlisi admits that the two sole narrators of the text are unknown. This is sufficient to reject any text attributed to the Shia Imams by academic standards. Yet, due to his desperation, he subjectively claims that Al-Sahifa Al-Sajjadiyya is authored by Zain Al-Abideen because it is  <em>“clearly isn’t scribed by human beings.”<\/em><\/p>\n<p style=\"text-align: justify;\">Ironically, his insults to the intellect do not stop there, for he provides his undeniable truth for the reliability of Al-Sahifa Al-Sajjadiyya on the next page.<\/p>\n<p style=\"text-align: justify;\">He claimed:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><em>As for what was discovered by this humble man, which is my chain and by centaintly is that: When I was young, I was seeking the satisfaction of Allah the Almighty, through continuous remembrance. Until one day, I saw al-Mahdi peace be upon him while I was between the state of awareness and sleepiness. He was standing in front of the Old Mosque in Isfahan near to al-Tanbi Door which is my school now. I saluted him and tried to kiss his foot – peace be upon him – but he refused, then he held me and I kissed his hand.<\/em><\/p>\n<p style=\"text-align: justify;\"><em>I asked him about some matters that I had doubts over them such as that I used to be suspicious regarding my prayers since I am not praying the way I was ordered to. I am occupied with the judiciary and I can’t pray the midnight prayer. I already asked our sheikh al-Baha’I may Allah have mercy with him about this matter. He told me, “Pray Dhohr, ‘Asr, and Maghreb postponed with midnight prayer,” and so I did. Then I asked the Mahdi, “Shall I pray midnight prayer?” He replied, “Pray it, but not as you were used to pray it before.” I also asked other questions that don’t exist in my mind anymore.<\/em><\/p>\n<p style=\"text-align: justify;\"><em>Then I said, “My master, it is not easy for me to serve you all the time. Shall you give me a book that I can always act upon?” He said: “I gave Mohammad al-Taj &#8211; who I knew him in the dream world &#8211; a book for you. Go and take it from him.” I marched out of the mosque’s door toward a place near Dar al-Batīkh – an area in Isfahan –; when I reached that person and he saw me, he said, “al-Mahdi sent you to me?” I said, “He did.” Then he brought out of his pocket an old book, when I opened the book, I noticed that it is the du’a book. I kissed the book and I put it on my eyes. I left him aiming back to al-Mahdi peace be upon him. I woke up and I noticed that the book is not with me. I started to cry for losing this book until the sun has risen.<\/em><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Al-Majlisi continues the fairytale quest for the dream. He meets a teacher that was known as Al-Taj, though, it turned out that he didn’t have the book either. He then said:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><em>I marched out crying and thinking until it came across my mind to go to the place I saw in my dream. When I reached Dar al-Batīkh, I saw a pious man named Aqa Hasan, dubbed “Taja”. I saluted him, then he said: “O’ you, all the students who take my endowed books do not respect them while you do. Come with me to see these books and take whatever you need from them.” I went with him to his library. The first book he gave me was the one I saw in my dream. I started to cry loudly and said, “This is all what I need.”<\/em><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Al-Majlisi I then states that the sahifa that he received was the same that was available with other scholars. However, due to his encounter with Al-Mahdi, people started to come to copy the sahifa that he currently held. It was then that &#8220;<em>the blessings of Al-Mahdi caused the sahifa to spread in all lands like the sun, and most people became good people of supplications, and many of them became mustajabu al-da’awa (those that have their prayers answered).&#8221; 19\/137<\/em><\/p>\n<p style=\"text-align: justify;\">This, dear reader, is the status of the authenticity of Al-Sahifa Al-Sajjadiyya. The strongest proofs that Al-Majlisi I provided are:<\/p>\n<ol>\n<li style=\"text-align: justify;\">It could not have been written by Umair and Al-Mutawakkel since they are not known scholars<\/li>\n<li style=\"text-align: justify;\">It could not have been written by a human being<\/li>\n<li style=\"text-align: justify;\">He saw the book in a dream<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">…and praise be to Allah the Most Gracious Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>proofs that sahifa sajjadiyya book was written by imam zain al abideen <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/07\/21\/criticism-of-al-sahifa-al-sajjadiyya\/\" title=\"Criticism of al-Sahifa al-Sajjadiyya\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-2202","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2202","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2202"}],"version-history":[{"count":11,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2202\/revisions"}],"predecessor-version":[{"id":2773,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2202\/revisions\/2773"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2202"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2202"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2202"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}