{"id":2233,"date":"2015-07-22T21:25:35","date_gmt":"2015-07-22T21:25:35","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2233"},"modified":"2015-11-23T00:11:17","modified_gmt":"2015-11-23T00:11:17","slug":"response-to-al-hadith-analysis-and-an-overview","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/07\/22\/response-to-al-hadith-analysis-and-an-overview\/","title":{"rendered":"Response to: Al-Hadith, Analysis and an Overview"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2233\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to A. S. Hashim’s “Al-Hadith, Analysis and an Overview”. This summarized overview of hadith also includes direct attacks against the Sunni hadith library. The piece can be found on <a href=\"http:\/\/www.al-islam.org\/articles\/al-hadith-analysis-and-overview-hashim\" rel=\"external nofollow\">al-islam.org<\/a>. In this article, we place a spotlight on the false allegations by the author of the piece. We will list the allegations in the form of a list and respond to each with a brief and satisfactory response.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #1: Mu’awiyah Spent Hundreds of Thousands of Dinars to Spread Fabricated Hadiths<\/strong><\/p>\n<p style=\"text-align: justify;\">S. Hashim provides no evidence to back this claim other than referencing Asad Haidar “Al-Saadiq and the Four Madh’habs”. Upon further inspection, we find that Asad Haidar is quoting Ibn Abi Al-Hadeed’s Sharh <a href=\"http:\/\/twelvershia.net\/2015\/11\/11\/examining-nahjul-balagha-and-the-eloquence-of-ali\/\" rel=\"external nofollow\">Nahj Al-Balagha<\/a>. The quote provided is as follows:<\/p>\n<p style=\"text-align: justify;\">Abu Ja’afar (Al-Iskafi) said: It is narrated that Mu’awiyah gave Samura bin Jundub a hundred thousand dirhams to narrate that the verse “And of the people is he whose speech pleases you in worldly life, and he calls Allah to witness as to what is in his heart, yet he is the fiercest of opponents; and when he goes away, he strives throughout the land to cause corruption therein and destroy crops and animals. And Allah does not like corruption,” [2: 205] was revealed about Ali bin Abi Talib. Then, the second verse revealed was about Ibn Muljim which says: “And of the people is he who sells himself, seeking means to the approval of Allah. And Allah is Kind to [His] servants.”<\/p>\n<p style=\"text-align: justify;\">He refused. So he gave him two hundred thousand dirhams, but he refused. He then gave him three hundred thousand, but he refused.  He then gave him four hundred thousand, he accepted it, and he narrated this.<\/p>\n<p style=\"text-align: justify;\">In response to this, we first notice that there is no authentic chain for the report, let alone a chain of hadith in the first place. This evidence is rejected since it has no weight. Moreover, it is a clear fabrication against Mu’awiyah since he was an enemy of Ibn Muljim and the Khawarij, not a supporter. Furthermore, how can Mu’awiyah request Samura to narrate this when Ibn Muljim was not even known during the time of the Prophet – peace be upon him &#8211; ? How could such a verse be connected to him?!<\/p>\n<p style=\"text-align: justify;\">Most importantly, according to the majority of the scholars, a silver dirham in the past is worth 2.975 grams of silver today (see Al-Makayeel wal Mawazeen Al-Shar’eeyah p. 19). As for the price of a gram of silver today, it comes out at 1.81 Saudi Arabian Riyals. According to this, the price of a dirham in the past in today’s Saudi Riyals, comes out at 5.38 SAR. This means that Mu’awiyah spent 2,153,900 SAR (574,374 USD) on ONE hadith. Do remember, that Shias currently claim that Mu’awiyah was the establisher of “hadith factories”, which fabricated thousands of hadiths if not tens of thousands of hadiths.<\/p>\n<p style=\"text-align: justify;\">The idea we want to get across is clear. It is not efficient for Mu’awiyah to fabricate narrations since it would literally cost less to hire assassins to kill all the Hashimites.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #2: Sunnis did not Document Hadiths in the Beginning<\/strong><\/p>\n<p style=\"text-align: justify;\">The author, S. Hashim, states:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8220;The administration discouraged putting the Hadith in writing, instead, they encouraged committing the Hadith to memory.The general public went along but soon it was discovered that confusion about the authenticity of the Hadith was taking place. For one thing many of the Sahaaba had died, and for another that committing to memory was not reliable at large, especially if you want the Hadith verbatim as the Prophet (swas) had said it at the circumstance it was said.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Al-Zuhri, Al-Hazm (both commissioned by Khalifa Omar Ibn Abdul Aziz) but the work was probably not done, due to early death of the Khalifa in 101 H.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">This point was thoroughly refuted in our <a href=\"http:\/\/twelvershia.net\/2015\/05\/02\/prohibition-of-hadith\/\" rel=\"external nofollow\">article<\/a> on the Prohibition of the Documentation and Narration of Hadiths. The author also argues that Al-Zuhri and [Abu Bakr bin Mohammad bin Amr bin] Hazm were “probably not done” writing hadiths. This is the conclusion of the author because these two collections of hadith did not reach us in our current time. In response, we turn the tables by arguing that Ali bin Abi Talib did not write any collections of hadith, since nothing that he wrote reached us today.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #3: Most Sunni Narrations are Weak<\/strong><\/p>\n<p style=\"text-align: justify;\">The author provides two simple evidences to suggest this. He mentions that Sahih of Al-Bukhari, d.256 A.H: 7275 (2712 Non-duplicated) out of 600,000.<\/p>\n<p style=\"text-align: justify;\">In response, we say that the number 600,000 is the number of chains of a hadith. So, the hadith, “All deeds are judged based on their intentions,” we find that it has over a hundred and fifty chains, which were all collected by Al-Tabarani. If this is the case, then we can easily see how this number became so huge.<\/p>\n<p style=\"text-align: justify;\">Also, Al-Bukhari did not choose to narrate all authentic hadiths. Whoever has this assumption needs to prove that this was his intention.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #4: Sunnis Relied on Thousands of Shia Narrators<\/strong><\/p>\n<p style=\"text-align: justify;\">The author writes: <span style=\"color: #ff0000; line-height: 1.5;\">“The number of the Shi&#8217;a transmitters of Hadith quoted in the Al-Sihaah Al-Sittah is over 3003.”<\/span><\/p>\n<p style=\"text-align: justify;\">In response, we say that the author needs to provide proofs that those three thousand were ideologically Shias, for they were only political Shias, as we have proven in our <a href=\"http:\/\/twelvershia.net\/2015\/05\/17\/abdul-husayns-100-shia-narrators-in-sunni-books\/\" rel=\"external nofollow\">audio lecture<\/a> in refutation of Abd Al-Hussain Sharaf Al-Deen Al-Musawi’s “Shia Narrators in Sunni Books” in Al-Muraja’aat.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #5: Al-Bukhari Narrated Less About About <a href=\"http:\/\/twelvershia.net\/2015\/11\/22\/ahlul-bait-a-linguistic-term-or-a-shariah-term\/\" rel=\"external nofollow\">Ahlul Bait<\/a> than Imam Muslim Because of the Political Climate<\/strong><\/p>\n<p style=\"text-align: justify;\">S. Hashim boldly states: <span style=\"color: #ff0000; line-height: 1.5;\">“Political times were less troublesome against Ahlul Bayt, (after Al-Mutawak&#8217;kil was killed by his own son), therefore Muslim narrated a large number of Hadiths about Ahlul Bayt.”<\/span><\/p>\n<p style=\"text-align: justify;\">This is false since Al-Mutawakil died in the year 247 AH. Both Al-Bukhari (d. 256) and Muslim (d. 261) started working on their books during the life of Al-Mutawakil and continued working on them after his death. See Al-Imam Muslim bin Hajjaj wa Manhajuhu fi Al-Saheeh 1\/356-357.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #6: Ali Wrote Volumes of Books<\/strong><\/p>\n<p style=\"text-align: justify;\">The author of the article, A. S. Hashim, listed several books. He mentions a chronological edition of the Qur’an, a three volume exegesis of the Qur’an called &#8220;Mus&#8217;haf Fatima&#8221;, Hadith of Prophet (saw) called “Saheefa of Ali”, a book of jurisprudence of rulings and transactions, the history of the prophets in his “White Al-Jafr”, the “Red Al-Jafr”,<\/p>\n<p style=\"text-align: justify;\">This allegation requires no response. None of these books exist today. Nobody has seen them except for the twelve infallible Imams that don’t have any use for these books since they are infallible containers of endless knowledge. It astonishes the intellect how modern Shias can believe in the existence of these books.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #7: Al-Sajjad Wrote Al-Sahifa Al-Sajjadiyya and Risalat Al-Huqooq<\/strong><\/p>\n<p style=\"text-align: justify;\">This has been refuted in two previous articles <a href=\"http:\/\/twelvershia.net\/2015\/07\/21\/criticism-of-al-sahifa-al-sajjadiyya\/\" rel=\"external nofollow\">here<\/a> and <a href=\"http:\/\/twelvershia.net\/2015\/07\/13\/criticism-of-treatise-of-rights-risalat-al-huquq\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #8: The Imams Have Written Books in the First Three Centuries<\/strong><\/p>\n<p style=\"text-align: justify;\">There is not a single book by an Imam that has been authentically attributed to him, even according to Shia hadith sciences.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #9: The Shias Wrote “Three Massive Works of Collecting the Hadith through Ahlulbayt”<\/strong><\/p>\n<p style=\"text-align: justify;\">The author mentions that these are the works of Al-Warraq Al-Hadhrami, Mohammad bin Ahmad Al-Ash’ari, and Ibn Al-Waleed.<\/p>\n<p style=\"text-align: justify;\">All three books are lost, which shows how little care Shias provided their hadith compilations.<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #10: The Claim that the Hadith of the Imam is the Hadith of the Prophet<\/strong><\/p>\n<p style=\"text-align: justify;\">S. Hashim quotes a famous Shia narration which states: <span style=\"color: #ff0000;\">&#8220;My Hadith is the Hadith of my father, and his is the Hadith of his father, up to ‘Ali, who directly narrated the Hadith from Prophet Muhammad (swas).&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">In response, we say that this narration is weak according to Shia hadith sciences, and not a single Imam said this. Moreover, how would such a matter make sense when Imams used to contradict themselves (even due to taqiyyah)? Would both hadiths be attributed to the Prophet – peace be upon him – ?<\/p>\n<p style=\"text-align: justify;\"><strong>Allegation #11: The Narrations of the Shias Come from Ahlulbayt Directly<\/strong><\/p>\n<p style=\"text-align: justify;\">S. Hashim states that the Sunni method of collecting hadiths is through <span style=\"color: #ff0000;\">“Quoting various people whose narration went back to the Prophet&#8217;s Companions then to Muhammad (swas) himself.”<\/span><\/p>\n<p style=\"text-align: justify;\">We agree with him in this point.<\/p>\n<p style=\"text-align: justify;\">Then, he states that Shias: <span style=\"color: #ff0000;\">“Quoted from the twelve Imams (Ahlul Bayt). Narration was straight through to Prophet Muhammad (swas) by way of ‘Ali&#8217;s registration of Hadith.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">This is false. Shias, like Sunnis, relied on “various people whose narration went back to the” twelve Imams. This is why the vast majority of Shia hadiths, even according to the testimony of A. S. Hashim, are weak. If most narrations were directly from Imams, then this problem would not exist. Instead, the majority of hadiths come through around five narrators who then heard from Ja’afar Al-Sadiq. Similarly, Sunnis also narrate through around five narrators from the Prophet – peace be upon him &#8211; . This means that the vast majority of what we have today comes to us through chains, and not from direct narrations.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah the Most Gracious Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to A. S. Hashim’s “Al-Hadith, Analysis and an Overview”. This summarized overview of hadith also includes direct attacks against the Sunni hadith library. The piece can be found on al-islam.org. In this article, we place <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/07\/22\/response-to-al-hadith-analysis-and-an-overview\/\" title=\"Response to: Al-Hadith, Analysis and an Overview\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-2233","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2233","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2233"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2233\/revisions"}],"predecessor-version":[{"id":2812,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2233\/revisions\/2812"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2233"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2233"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2233"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}