{"id":2284,"date":"2015-08-06T08:43:14","date_gmt":"2015-08-06T08:43:14","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2284"},"modified":"2015-10-27T02:02:45","modified_gmt":"2015-10-27T02:02:45","slug":"imam-hasan-as-a-brief-look-into-his-life","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/08\/06\/imam-hasan-as-a-brief-look-into-his-life\/","title":{"rendered":"Response to: Imam Hasan AS &#8211; A Brief Look Into His Life"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2284\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-2021 size-full aligncenter\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"Imam Hasan\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">The following is a response to Al-Mufeed’s biography of Imam Hasan, which can be found in <a href=\"http:\/\/www.al-islam.org\/articles\/imam-al-hasan-second-imam-brief-look-his-life\" rel=\"external nofollow\">al-islam.org<\/a>. The piece, after being translated into English from the original Kitab Al-Irshad (Book of Guidance), was entitled: “Imam Hasan (as), A Brief Look into His Life”.<\/p>\n<p style=\"text-align: justify;\">Before examining the details of the life of Imam Hasan, it is important to first know that Kitab Al-Irshad, by Al-Mufeed, is the most authoritative book of history that has been produced by the Shias. Unlike Ahl Al-Sunnah, Shias struggle with the subject of history, due to the lack of works produced by the sect. If compared to early sources of Sunni history, like Seerat Ibn Hisham, Tareekh Al-Tabari and Tareekh Ibn Khayyat it becomes too clear that Shias cannot compete with Ahl Al-Sunnah in this field. This article will make it a point to prove just that.<\/p>\n<p style=\"text-align: justify;\">We have divided the response into 4 parts:<\/p>\n<ol style=\"text-align: justify;\">\n<li>Criticism of the Source of the Biography of Imam Hasan’s Caliphate<\/li>\n<li>Criticisms of the Text<\/li>\n<li>Who Killed Imam Hasan?<\/li>\n<li>Imam Hasan’s Burial<\/li>\n<\/ol>\n<h2 style=\"text-align: justify;\"><strong> 1. Criticism of the Source of the Biography of Imam Hasan’s Caliphate<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Mufeed’s biography of Imam Hasan in the original Arabic is six and a half pages long. The first page contains basic information like his date of birth and a couple of his merits. The next four pages list out his reign as a caliph. The last page and a half document his death and burial.<\/p>\n<p style=\"text-align: justify;\">Al-Mufeed provides only one source for the four pages about Imam Hasan’s caliphate.<\/p>\n<blockquote><p>He states: “Abu Mikhnaf Lut b. Yahya al-Azdi reported: Ashath b. Suwar told me on the authority of Abu Ishaq al-Sabi’i and others, who said…”<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Upon returning to the summary of Al-Khoei’s Mu’jam of Rijal, which was condensed by Al-Jawahiri, we find that Ashath (p. 73) and Abu Ishaq (p. 434) are both unknown narrators (Note: They are Sunni). Furthermore, Al-Tusturi, in Qamoos Al-Shia 8\/619-620 argues that Lut bin Yahya, who extensively wrote about the early Shia Imams, was not even an Imami, but a general (political) Shi’ee, and such a term is used very loosely, to the extent that even famous Sunni Imams like Sufyan Al-Thawri was referred to as a (political) Shi’ee.<\/p>\n<p style=\"text-align: justify;\">Even from a non-Rijali perspective, the narrations of Lut bin Yahya are extremely dubious due to the fact that they usually contain secret letters and documents between opposing armies and rulers as we shall soon see below. How is it that Lut bin Yahya had exclusive access to all these documents?!<\/p>\n<p style=\"text-align: justify;\">In conclusion, the full four pages cannot be relied upon by Shias due to the weakness of the chain. A problematic aspect of Al-Mufeed’s rendition of the caliphate of Imam Hasan is that he often does not differentiate between his own words and the word from the narration. Thus, it is difficult to tell if the narration was kept in its original form or if he is putting it in his own words.<\/p>\n<h2 style=\"text-align: justify;\"><strong>2. Criticisms of the Text<\/strong><\/h2>\n<p style=\"text-align: justify;\">There are several issues with the text itself that deserve to be mentioned. For some of them contradict what has been authentically established while others contradict logic altogether.<\/p>\n<p style=\"text-align: justify;\">These include:<\/p>\n<p style=\"text-align: justify;\">a) <em>Imam Hasan’s Sermon<\/em><\/p>\n<ul style=\"text-align: justify;\">\n<li>He said, “The Apostle of God, may God bless him and his family, used to send him forward with his standard while Gabriel supported him on his right and Michael supported him on his left.”<\/li>\n<li>He said, “I am of the House, from who God has sent away abomination.” [<strong>Comment<\/strong>: This implies that his household contained abominations until it was sent away.]<\/li>\n<li>He said, “I am of the House for whom God has required love in his Book, when God, the Most High, said: Say: I do not ask for you any reward except love for (my) kin.” [<strong>Comment<\/strong>: This has been responded to thoroughly in our audio lecture <a href=\"http:\/\/twelvershia.net\/2015\/05\/16\/murajaat-verses-in-favor-of-ali\/\" rel=\"external nofollow\">here<\/a>.]<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">b) <em>Mu’awiyah’s Spies and Assassins<\/em><\/p>\n<p style=\"text-align: justify;\">After the death of Ali, the narration of Lut bin Yahya Abu Mikhnaf suggests that Mu’awiyah sent spies who were to assassinate and provide intelligence. The narration contains several letters back and forth with Imam Hasan criticizing Mu’awiyah for his actions. He accuses him of being haughty about the death of Ali. However, Al-Mufeed disliked Mu’awiyah’s letter and decided not to mention it. He says: “Muawiya replied to him with his letter, which there is no need to mention.”<\/p>\n<p style=\"text-align: justify;\">Upon returning to Maqatil Al-Talibiyeen by Abu Al-Faraj Al-Isbahani (p. 250) (Zaydi historian) we find what Al-Mufeed did not want to share. The narration contains a firm Mu’awiyah who declared that “I was not saddened, nor happy, nor was I haughty, nor did I grieve.” He then included a line of poetry that suggests that Ali was an enemy, but that he admired Ali’s generous character.<\/p>\n<p style=\"text-align: justify;\">Al-Mufeed chose to include this text in order to not share the shades of grey in Mu’awiyah’s character. Surely, to keep the Shia layman in the dark is preferred than to make Mu’awiyah appear as anything more than a one dimensional villain.<\/p>\n<p style=\"text-align: justify;\">c) <em>In Accountant in the Court of Mu’awiyah bin Abi Sufyan<\/em><\/p>\n<p style=\"text-align: justify;\">As the title of this little section suggests, something fishy is going on in first century Damascus. Al-Mufeed narrates that Mu’awiyah sent Ju’da the wife of Imam Hasan a hundred thousand dirhams (538,000 SAR) in order to assassinate her husband. He also promised her the hand of Yazeed. A couple of pages back, Mu’awiyah sent Ubaidullah bin Abbas ten times the same amount (5,380,000 SAR) to leave the ranks of Imam Hasan.<\/p>\n<p style=\"text-align: justify;\">Refer to our other article <a href=\"http:\/\/twelvershia.net\/2015\/07\/22\/response-to-al-hadith-analysis-and-an-overview\/\" rel=\"external nofollow\">here<\/a> about Mu’awiyah asking Samura to narrate a fabricated hadith for the price of (2,153,900 SAR).<\/p>\n<p style=\"text-align: justify;\">The problem is not only that these fabrications are based on anonymous narrators, but that the numbers do not make any sense. Why would the assassination of Imam Hasan cost four times less than fabricating a narration? Why would his assassination cost ten times less than bribing Ubaidullah bin Abbas? Why was it so expensive to narrate a fabrication anyway?! People would fabricate narrations pro bono all the time.<\/p>\n<p style=\"text-align: justify;\">d) <em>Conditions of the Settlement<\/em><\/p>\n<p style=\"text-align: justify;\">Al-Mufeed details the conditions as follows:<\/p>\n<p style=\"text-align: justify;\">That the cursing of the Commander of the faithful, peace be upon him, should be abandoned and the practice of using the personal prayer (qunut) in the formal prayer (salat) (as prayer) against him should be set aside; that his Shia, may God be pleased with them, should be given security and that none of them should be exposed to any evil; that each of them who had certain rights should attain those rights.<\/p>\n<p style=\"text-align: justify;\">Then, Al-Mufeed states that Mu’awiyah betrayed Imam Hasan by saying in a sermon, “All of them (the conditions) are now under my foot. And from now on I will not fulfill anything.”<\/p>\n<p style=\"text-align: justify;\">Ironically, Al-Mufeed gives this explanation as to why Imam Hasan agreed to such a deal in the first place:<\/p>\n<blockquote><p>Al-Hasan, peace be upon him, did not trust him. He was aware of his deception and his attempts at assassination. However, he could find no escape from assenting to his demands to abandon the war and bring about a truce because of the weakness of his followers’ understanding of his right, their corrupt attitude towards him and their opposition to him. (In addition, he was aware) of the view of many of them in declaring it lawful to shed his blood and to hand him over to his rival.<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Imam Hasan’s position according to Al-Mufeed contradicts the condition. Why would Imam Hasan ask for security of Shias that don’t believe in his Imamate and want him dead?! IMPORTANT: Al-Mufeed provides no source for his narration that detail the conditions of Imam Hasan.<\/p>\n<h2 style=\"text-align: justify;\"><strong>3. Who Killed Imam Hasan?<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Mufeed provides two narrations that detail the death of Imam Hasan.<\/p>\n<p style=\"text-align: justify;\"><em><strong>The first narration<\/strong><\/em> is from Al-Mugheera bin Miqsam (d. 136 AH) who states that Mu’awiyah sent a hundred thousand dirhams to the wife of Imam Hasan to kill him.<\/p>\n<p style=\"text-align: justify;\"><em><strong>The second narration<\/strong><\/em> is from Umar [Umair] bin Ishaq, a contemporary of Imam Hasan. The Imam, in this narration rebukes Al-Hussain for wanting to know the identity of his killer. He then says, “Do you want to kill (my killer)? If it is who I think it is, then Allah will be more vengeful. If it is not, then I do not want my death to lead to the cause of the death of an innocent person!”<br \/>\nThe narration clearly shows that Imam Hasan had no idea who his killer was, unlike the previous disconnected narration that claims that Mu’awiyah did it.<\/p>\n<p style=\"text-align: justify;\"><strong>Note<\/strong>: The faulty translation provided on al-islam.org from the above quote is as follows: “If he may remain as he is, then God will be more terrible in His vengeance than you. If he may not remain as he is, then I should like to be free of any blame.”<\/p>\n<p style=\"text-align: justify;\">We provide the Arabic text for readers to determine which translation is the correct one:<\/p>\n<p style=\"text-align: justify;\">إن يكن هو هو فالله أشد نقمة منك وإن لم يكن هو فما أحب أن يؤخذ بي بريء<\/p>\n<h2 style=\"text-align: justify;\"><strong>4. Imam Hasan’s Burial<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Mufeed provides a single account here. He narrates from Abdullah bin Ibrahim from Ziyad Al-Makharqi. There is not enough evidence to determine who Abdullah bin Ibrahim is, while nothing can be found in Shia books of Rijal about Ziyad Al-Makharqi.<\/p>\n<p style=\"text-align: justify;\">This far-fetched narration includes the following words from Imam Hasan to his brother: “Carry me on my bier to the grave of my grandfather, the Apostle of God, may God bless him and his family, so that I may renew my covenant with him. After that take me to the grave of my grandmother, Fatima the daughter of Asad, may God be pleased with her, and bury me there.”<\/p>\n<p style=\"text-align: justify;\">The narration ends with A’isha riding a mule, under the suspicion that Imam Hasan was going to be buried in her house.  She cries: “What is there between you and me that you should allow someone I don’t want to enter my house?” Marwan too appears to prevent this burial from taking place. This is the account provided by Al-Mufeed and an earlier Shia scholar Abu Faraj Al-Isbahani.<\/p>\n<p style=\"text-align: justify;\">Abu Faraj though, provides another narration in his Maqatil Al-Talibiyeen (p. 36) that states that Imam Hasan sent someone to request from A’isha to be buried in her house. She agreed. Bani Umayyah, upon hearing of this, gathered and brought weapons, for they would not allow this and said: By Allah, he is not to ever be buried with the Prophet – peace be upon him &#8211; ! Imam Hasan, upon receiving word, said, “There is no need for it, bury me beside my mother, Fatima – peace be upon her &#8211; .”<\/p>\n<p style=\"text-align: justify;\">This second account is a more reasonable one that doesn’t insult the intellect, for it doesn’t contain any renewal of covenant to the Prophet (saw) after his death (which is unheard of), nor does it contain an Imam with knowledge of the unseen.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah the Most Gracious Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Imam Hasan AS brief life account <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/08\/06\/imam-hasan-as-a-brief-look-into-his-life\/\" title=\"Response to: Imam Hasan AS &#8211; A Brief Look Into His Life\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[20],"class_list":{"0":"post-2284","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-muawiyah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2284","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2284"}],"version-history":[{"count":13,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2284\/revisions"}],"predecessor-version":[{"id":2622,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2284\/revisions\/2622"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2284"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2284"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2284"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}