{"id":2382,"date":"2015-08-19T19:08:47","date_gmt":"2015-08-19T19:08:47","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2382"},"modified":"2015-11-11T12:40:57","modified_gmt":"2015-11-11T12:40:57","slug":"was-sayyidah-aisha-bint-abi-bakr-ra-involved-in-the-murder-of-uthman-ra","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/08\/19\/was-sayyidah-aisha-bint-abi-bakr-ra-involved-in-the-murder-of-uthman-ra\/","title":{"rendered":"Was Sayyidah ‘Aisha bint Abi Bakr (ra) involved in the murder of Uthman (ra)?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2382\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Bismillah<\/p>\n<p style=\"text-align: justify;\">All praises due to Allah and may His mercy and blessings be upon His Last and Final Messenger Muhammad, his family and companions.<\/p>\n<p style=\"text-align: justify;\">Shia Imamis have always been very critical of many of the close companions of the Prophet (may Allah’s peace and blessings be upon him). They hate them to the worse extant and consider this to be a virtue. They consider this viewpoint of them to be a criterion to differentiate between a believer and a hypocrite. So to prove their point they come with different historical “evidences”. But in all this they fail to establish authenticity. When someone objects to this they say how could you deny this while your own scholars have written this in their books?<\/p>\n<p style=\"text-align: justify;\">This is one of their biggest problems which caused them to remain ignorant about the methodology of scholars of Ahl as-Sunnah. They fail to understand that our scholars quote a tradition for different reasons and not always they care about its authenticity. So there are scholars who when quote a tradition, they quote it for its authenticity like Al-Bukhari, Muslim, Ibn Khuzaimah, Ibn Hibban etc in their Sahih collections. There are those who quote a tradition because of its weakness like Ibn al-Jawzi, Al-Shawkani, Mulla ‘Ali Qari in their collections on fabricated narrations. There are those who quote a narration to explain the usage of Arabic word contained in it, like Ibn Manzoor in Lisan al-‘Arab, Majduddin Ibn al-Atheer in An-Nihayah etc. There are those who quote a hadith as an example of a narration by specific narrator, for example Tareekh Baghdad of Khateeb in which the author mentions a narrator and after mentioning the sayings of scholars regarding him he narrates traditions narrated by him. There are those who compile books just to collect narrations on specific topic. For example, As-Suyuti compiled Al-Jami’ al-Kabeer or Jam’ al-Jawami’ which was later rearranged by ‘Ali Muttaqi in Kanz al-‘Ummal. This book is a collection of everything which is narrated from the Prophet (pbuh). So we see scholars quote a narration in their book for different reasons and its authenticity is considered while doing it. Hence, the claim of some shia that it is Hujjah on sunnis because some sunni scholars have mentioned it is flawed.<\/p>\n<p style=\"text-align: justify;\">One of their accusation against Sayyida ‘Aisha is that she was involved in the murder of ‘Uthman or that she incited people against him. We see even their well known ‘Ulama propagate this false accusation. By Allah, this is not the first time she is being accused. The last time she was accused was during the incident of Ifk and Allah then revealed her innocence from above the seven heavens.<\/p>\n<p style=\"text-align: justify;\">This article was compiled during my <a href=\"http:\/\/forum.twelvershia.net\/hadith-rijal\/analysis-of-narrations-from-'a-shi'ite-encyclopedia'\/msg257\/#msg257\" target=\"_blank\" rel=\"external nofollow\">analysis of shia encyclopedia<\/a> in which the Shi’i author has repeated the same accusation and to support it he has quoted some books by Sunni (or simply non-Shia) authors. Therefore, here I will be quoting the Shia author of the Shi’ite Encyclopedia first and then I will be responding to it, Insha Allah.<\/p>\n<p style=\"text-align: justify;\">The author of “<a href=\"http:\/\/www.al-islam.org\/encyclopedia\/chapter1a\/9.html\" rel=\"external nofollow\">A Shi’ite encyclopedia<\/a>” quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Once she went to Uthman and asked for her share of inheritance from the Prophet (after so many years passed from the demise of the Prophet). Uthman refrained to give Aisha any money, and reminded her that she was one of those who counseled Abu Bakr not to pay the share of inheritance of Fatimah al-Zahra (AS). So if Fatimah does not have any share, then why should she? Hearing this, Aisha became very angry at Uthman, and came out and said to the people:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>“Kill this old fool (Na’thal), for he is unbeliever.”<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Sunni references:<\/span><\/p>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">History of Ibn al-Athir, v3, p206<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Lisan al-Arab, v14, p141<\/span><\/li>\n<li><span style=\"color: #ff0000;\">al-Iqd al-Farid, v4, p290<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Sharh Ibn Abil Hadid, v16, pp 220-223.<\/span><\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>Reply<\/strong><\/h2>\n<p style=\"text-align: justify;\">As for the context of the statement quoted by the compiler of the Encyclopedia, that is Aisha (ra) asking of her share of inheritance from Uthman (ra), then I do not know the source of it. None of the referenced sources mention the background provided by the author, as far as I can see. Wallahu A’alam.<\/p>\n<p style=\"text-align: justify;\">First let me introduce the refrences provided by the shia author so that the matter would be clear for the readers.<\/p>\n<ol style=\"text-align: justify;\" start=\"1\">\n<li>History of ‘Izud-Deen Ibn al-Atheer Al-Jazari. It is “Al-Kaamil fi at-Tarikh”. This book is a collection of incidents without providing the source of it. It mostly relies on the book of Tabari for early history but doesn’t mention the Isnad, unlike Tabari who narrates incidents with Isnad.<\/li>\n<li>Lisan al-‘Arab: A detailed dictionary of Arabic language compiled by Muhammad bin Mukrim bin ‘Ali Al-Ansari Al-Afreeqi, well famous as Ibn Manzur Al-Afreeqi. Hence, no isnad is given. The author quotes traditions and early Arabic proverbs and poetry regardless of their authenticity. This he does to explain a specific word in his book. Besides, the author was not a specialist in hadith.<\/li>\n<li>Al-‘Iqd al-Farid: It was compiled by Abu ‘Umar Ahmad bin Muhammad bin Abdi Rabbihi, famous as Ibn ‘Abd Rabbihi al-Andalusi (d.328AH). He only collected the speeches, sayings, poems and incidents he was aware of. The muhaqqiq of the book mentioned several books as his sources which includes the Torah, the Gospel, books of al-Jaahiz, books of Ibn Qutaiba, al-Kaamil of al-Mubarrad, books of Ibn al-Muqaffi’ etc. So how could he be relied when he does not mention his Isnad and quotes from such unreliable sources? Ibn Katheer (15\/121) notified that he had Shi’i leaning even though he was from the Umavi lineage.<\/li>\n<li>Sharh Ibn Abil Hadeed: The detailed commentary on <a href=\"http:\/\/twelvershia.net\/2015\/11\/11\/examining-nahjul-balagha-and-the-eloquence-of-ali\/\" rel=\"external nofollow\">Nahj al-Balagha<\/a> of Shareef Ridha compiled by Abdul Hameed bin Hibatullah bin Husain, Abu Haamid Ibn Abil Hadeed (d.656AH). He was a Mu’atazali on the madhhab of Baghdadi Mu’tazalites, that is those who preferred Ali over Abu Bakr and had more shi’i tendencies than their Basari predecessors who were more like Ahl as-Sunnah in these matters. Like any other Mu’tazali he was ignorant of the science of hadith criticism and hence collected good and bad he found, accepting all that which supports his creed and rejecting all that which goes against his creed. He does not narrate with his chain but many a times gives reference to a specific book which may not be a reliable book.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">After all these, those Shia who think that the mere existence of a report in a Sunni book accounts for its authenticity should study more regarding the methodology of Ahl as-Sunnah. The narration “Take half of your religion from Humayra (Aisha),” was also quoted by Ibn Manzoor in the same book, but shia due to their hatred of Sayyidah Aisha declare that to be fabricated and consider this one to be acceptable. But we consider both of them to be fabricated and unreliable. We do not consider any narration in any of our books to be reliable even if it supports our claim until its authenticity is proven through reliable sources through reliable Isnad. Those who doubt this may refer to the books written on the topics of fabricated narrations, he will see a section dedicated to those traditions which were fabricated in praise of different companions.<\/p>\n<p style=\"text-align: justify;\">Coming back to the narration under discussion, the particular statement, i.e. “Kill this Na’thal…,” was attributed to Sayyidah ‘Aaisha (ra) by some sunni historians and linguists who were not expert in hadith criticism like Ibn Atheer, Ibn Manzoor etc. This was attributed to Aisha (ra), in a narration, by Ubaid bin Abi Salamah, who was one of her relatives, in her presence and she did not deny. But this was reported by Saif bin Umar who was abandoned and there was sufficient gap between the incident and the narrator. [Tabari (4\/458-9)]<\/p>\n<p style=\"text-align: justify;\">This has also been mentioned by Abu Mikhnaf. Some say the first one to call Uthman a Na’thal was Aisha (ra) as mentioned by Ibn Abil Hadeed in Sharh Nahj al-Balaghah (6\/215) without specifying who actually claimed. These are only claims which some authors inherited from others.  While there could be some indication that she was critical of Uthman’s (ra) policies and actions but there is no proof in that to suggest that she wanted to kill him or was in support of his murder. These kinds of reports are unreliable because of three main reasons:<\/p>\n<ol style=\"text-align: justify;\" start=\"1\">\n<li>They were reported by unreliable authors like Abu Mikhnaf, al-Waqidi, Saif bin Umar, Ibn al-Kalbi etc.<\/li>\n<li>Even they did not connect their chains to the eyewitnesses of the incident, hence the reports in most cases remain disconnected.<\/li>\n<li>The established facts indicate otherwise. Among those is the fact that Aisha always denied this accusation just as Ali bin Abi Talib denied it.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">It has been narrated by Ahmad in “Fadhail as-Sahaba”, Bukhari in “Khalq Af’aal al-‘Ibaad” and Al-Baladhuri in Ansab al-Ashraf through Ibn Shihaab az-Zuhri from ‘Urwah from Aisha that she said, ‘If I wanted to kill Uthman I would have been killed too.’ This tradition is authentic. In other traditions she said, ‘By Allah, Uthaman was killed unjustly.’ And there are other traditions suggesting the same.<\/p>\n<p style=\"text-align: justify;\">It could be that some people might have falsely attributed these kinds of things to ‘Aisha. This is understood from the tradition related by Ibn Sa’d (3\/60), Ibn Shabbah in “Tarikh al-Madinah” (4\/1225) and Al-Baladhuri in “Ansab Al-Ashraf” (5\/597) through the route of A’amash from Khaithama from Masrooq that after hearing the criticism of Aisha against those who killed Uthman he said to her, ‘This has been done by you. You wrote to the people to revolt against him.’ She replied, ‘No, by the One in whom believed the believers and disbelieved the disbelievers, I did not write to them with the black (i.e. ink) on the white (i.e. paper) until this sitting of mine. A’mash said, ‘So they used to believe that it was fabricated in her name.’<\/p>\n<p style=\"text-align: justify;\">Ibn Katheer said in al-Bidayah (10\/340): This is authentic from her. In this and other traditions similar to it is the proof that these Khawarij had fabricated letters in the name of Sahaba, to incite people against Uthman.<\/p>\n<p style=\"text-align: justify;\">This also clarifies another tradition present in Ansab al-Ashraf (5\/596) through the route of Wakee’ from Qais bin Muslim from Umm al-Hajjaj al-‘Awfiyyah that on the enquiry of Ashtar an-Nakha’i regarding Uthman she replied, ‘Ma’adhAllah if I command to shed the blood of muslims and to murder their leader (Imam) and to legitimate (to downgrade) their sanctity.’ So Al-Ashtar said, ‘You wrote to us and now when the fight has initiated you have started to forbid us.’  In the version of Ibn Shabbah, in his “Tarikh al-Madeenah” (4\/1224), it also adds the comment of al-A’amash that on that day A’isha (ra) took oath which no one else took before or after her. Then he mentioned her oath as in the previous tradition.<\/p>\n<p style=\"text-align: justify;\">Another tradition quoted by the compiler of Shia encyclopedia is as follows:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">While Ibn Abbas was setting out for Mecca, he found Aisha in al-Sulsul (seven miles south of Medina). Aisha said: “O’ Ibn Abbas, I appeal to you by God, to abandon this man (Uthman) and sow doubt about him among the people, for you have been given a sharp tongue. (By the current siege over Uthman) people have shown their understanding, and light is raised to guide them. I have seen Talha has taken the possession of the keys to the public treasuries and storehouses. If he becomes Caliph (after Uthman), he will follow in the path of his parental cousin Abu-Bakr.” Ibn Abbas said: “O’ Mother (of believers), if something happens to that man (i.e., Uthman), people would seek asylum only with our companion (namely, Ali).” Aisha replied: “Be quiet! I have no desire to defy or quarrel with you.”<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Reference: History of al-Tabari, English version, v15, pp 238-239<\/span><\/p>\n<h2 style=\"text-align: justify;\"><strong>Reply<\/strong><\/h2>\n<p style=\"text-align: justify;\">This contains al-Waqidi and Abu Bakr bin Abi Sabrah both of whom were abandoned. [See Tarikh at-Tabari (4\/407), Meezan al-E’itedal (4\/503-4)]<\/p>\n<p style=\"text-align: justify;\">Another report given by Rawafidh is the consultation between Marwan and ‘Aisha (ra):<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">“We pray that you stay in Medina, and that Allah may save this man (Uthman) through you.” Aisha said: “I have prepared my means of transportation and vowed to perform the pilgrimage. By God, I shall not honor your request… I wish he (Uthman) could fit to one of my sacks so that I could carry him. I would then through him into the sea.”<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Reference: “al-Ansab al-Ashraf”, by al-Baladhuri, v4, part 1, p75<\/span><\/p>\n<h2 style=\"text-align: justify;\"><strong>Reply<\/strong><\/h2>\n<p style=\"text-align: justify;\">This was mentioned by Ibn Sa’d in Tabaqat (2\/27) and al-Baladhuri in Ansab al-Ashraaf (5\/565) without relating any Isnad to it rather Ibn Sa’d, who was later on quoted by al-Baladhuri and Ibn ‘Asakir, attributed it to some unknown people with the phrase “They say”. From Sharh Nahj al-Balaghah (3\/7) it appears that the actual source of this report is al-Waqidi, the abandoned narrator, who narrated this in Kitab ad-Daar. WAllahu A’alam<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Bismillah All praises due to Allah and may His mercy and blessings be upon His Last and Final Messenger Muhammad, his family and companions. Shia Imamis have always been very critical of many of the close companions of the Prophet <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/08\/19\/was-sayyidah-aisha-bint-abi-bakr-ra-involved-in-the-murder-of-uthman-ra\/\" title=\"Was Sayyidah ‘Aisha bint Abi Bakr (ra) involved in the murder of Uthman (ra)?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-2382","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2382","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2382"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2382\/revisions"}],"predecessor-version":[{"id":2776,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2382\/revisions\/2776"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2382"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2382"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}