{"id":2412,"date":"2015-09-03T21:00:49","date_gmt":"2015-09-03T21:00:49","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2412"},"modified":"2015-09-16T21:26:39","modified_gmt":"2015-09-16T21:26:39","slug":"who-was-the-bravest-companion-ibn-hazm","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/09\/03\/who-was-the-bravest-companion-ibn-hazm\/","title":{"rendered":"Who was the bravest companion? [Ibn Hazm]"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2412\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>Who was the bravest companion?<\/strong><\/p>\n<p style=\"text-align: justify;\">By<\/p>\n<p style=\"text-align: justify;\"><strong>Abu Muhammad Ibn Hazm<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Introduction<\/strong><\/p>\n<p style=\"text-align: justify;\">This is one of the issues which Shia love to raise against the personality of companions like Abu Bakr and ‘Umar. Their problem is that they think bravery is to kill people in Jihad and if someone couldn’t kill with his power than he is not brave. And hence, they conclude, Abu Bakr and ‘Umar were not brave. If that is the case then people like Pharaoh, Nimrod, Stalin and all the mass murderers would have to be listed at the top of all the braves.<\/p>\n<p style=\"text-align: justify;\">Among the believers Bara bin Malik al-Ansari on his own killed one hundred men besides those whom he killed with the help of others. Hamza, Abu Dujanah al-Ansari, ‘Aasim bin Thabit, Talha, Zubair, Sa’d were all known for their specialty in tackling the enemy. But no one prefers them over ‘Ali bin Abi Talib or over Abu Bakr and ‘Umar, may Allah be well pleased with them all.<\/p>\n<p style=\"text-align: justify;\">Once a person presents himself to face the enemy he is proven to be a brave one regardless of how much of them he could kill or defeat. Abu Bakr and ‘Umar, may Allah be pleased with them, never missed any battle with the Prophet (sallallahu ‘alaihi wa sallam) and they were seen defending the Prophet (sallallahu ‘alaihi wa sallam) during harsh conditions especially in Uhud and Hunain. How could such a person be cowardly? If it is just because there is hardly any narration describing how they killed a Mushrik during battle then what could be the response regarding the Prophet (sallallahu ‘alaihi wa sallam) who never killed anyone in battle except Ubayy bin Khalaf? If they say that the Prophet (sallallahu ‘alaihi wa sallam) was the bravest but he was a leader and hence did not get involved in fighting then we shall let ‘Ali (ra) falsify this claim. Hence Imam Ahmad records in Musnad (1042), Abu Ya’la (302, 412) and others with an authentic Isnad through Abu Ishaq from Harithah bin Mudharrib that ‘Ali said:<\/p>\n<p style=\"text-align: justify;\"><strong>لَمَّا حَضَرَ الْبَأْسُ يَوْمَ بَدْرٍ اتَّقَيْنَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَكَانَ مِنْ أَشَدِّ النَّاسِ، مَا كَانَ – أَوْ: لَمْ يَكُنْ – أَحَدٌ أَقْرَبَ إِلَى الْمُشْرِكِينَ مِنْهُ<\/strong><\/p>\n<p style=\"text-align: justify;\">“When the fighting grew intense on the day of Badr we sought shelter by drawing closer to the Messenger of Allah (sallallahu ‘alaihi wa sallam), who was one of the strongest of men, and nobody was closer to the (army of the) disbelievers than him.”<\/p>\n<p style=\"text-align: justify;\">We see that during the harsh time even brave like ‘Ali (ra) used to seek shelter with the Messenger of Allah (sallallahu ‘alaihi wa sallam) but still he did not kill anyone except Ubayy. (A man with bad intentions may even claim that `Ali is cowardly since he hid behind his cousin in battle and we are sure the Shia would have made this claim if the speaker was`Umar)<\/p>\n<p style=\"text-align: justify;\">So what is bravery? Let us look at the meaning of Shaja’ah [Arabic of bravery] in Arabic dictionary. Al-Jawhari says in “As-Sihaah” (3\/1235):<\/p>\n<p style=\"text-align: justify;\"><strong>شدَّة القلب عند البأس<\/strong><\/p>\n<p style=\"text-align: justify;\">“It is the stability of heart during trial.”<\/p>\n<p style=\"text-align: justify;\">Even the English word bravery means ‘able or ready to face and endure danger, disgrace or pain’. So not being able to kill someone or not being able to conquer some place does not indicate cowardice. Indeed, those who were killed by ‘Ali during the battles were more than those who were killed by Abu Bakr and ‘Umar. But it only proves that ‘Ali encountered more famous combatants than them not that they were hiding for their life. (Since usually the deaths of famous men are much more likely to be recorded in books than the death of random soldiers)<\/p>\n<p style=\"text-align: justify;\">As for running away from battles, then there is no indication that any of the two Shaikhs left the battle field. There were two incidents in Prophetic history when Muslims ran from the battle field when they couldn’t handle the enemies’ fierce attack. But in none of them, with any shred of evidence, Abu Bakr and ‘Umar left the battle field. So called proofs which some Shia authors quote to prove that they ran away from the battlefield are nothing but sheer misrepresentation of the context. If Allah willed I will compile a refutation on such arguments.<\/p>\n<p style=\"text-align: justify;\">The following passage I translated from Minhaj as-Sunnah (8\/87-89) of Shaykh al-Islam Ibn Taymiyyah who quoted ‘Allamah Ibn Hazm from “Al-Fisal” (4\/107).<\/p>\n<p style=\"text-align: justify;\"><strong>Translation<\/strong><\/p>\n<p style=\"text-align: justify;\">Ibn Hazm said:<\/p>\n<p style=\"text-align: justify;\">We see that they claim that ‘Ali was the greatest in waging Jihad against disbelievers and attacking and fighting them among all the companions.<\/p>\n<p style=\"text-align: justify;\">Abu Muhammad (Ibn Hazm) said: This is wrong as the Jihad is classified in three categories;<\/p>\n<ol>\n<li style=\"text-align: justify;\">One of them is calling towards Allah,<\/li>\n<li>Second is to do Jihad during war by ideas and strategies<\/li>\n<li>And the third is to do jihad with hands by killing and hitting.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">We find that with regards to the first type of Jihad no person superseded Abu Bakr and ‘Umar after the Messenger of Allah (sallallahu ‘alaihi wa sallam). As for Abu Bakr then we find that the senior companions accepted Islam on his hands. As compared to him, ‘Ali does not have much share in this. As for ‘Umar then we see that the day he became Muslim, Islam was strengthened and the worship of Allah was being done openly. This is the greatest Jihad and these two persons were alone in such Jihad of the first two categories (during early days) which has no equal and ‘Ali does not have participation in it.<\/p>\n<p style=\"text-align: justify;\">With regards to the second category then we find that it is specifically for Abu Bakr and then for ‘Umar.<\/p>\n<p style=\"text-align: justify;\">As for the third category which is stabbing, hitting and combating then we find that it is the lowest level of Jihad because of the obvious reason that the Messenger of Allah (sallallahu ‘alaihi wa sallam), with the agreement of Muslims, was selective in doing the most virtuous of actions and we see that his – may Allah sends <em>Salaat<\/em> and salutation upon him – Jihad in most of the cases was restricted within the first two categories which is to call towards Allah – the Mighty and Majestic – and planning and forwarding. His least involvement (among the three categories) was in stabbing, hitting and combating. This is not because of cowardice but in reality he was absolutely the bravest of all earthly beings with his hands and soul and the most complete to attain succor. But he would look for the best and then next after it from the acts, and then he would prefer it and get involved with it. We find that, during Badr and other battles, Abu Bakr would not leave him and sometimes even ‘Umar was included in it. They were distinguished in this case unlike ‘Ali and all other companions, except in rare cases.<\/p>\n<p style=\"text-align: justify;\">Then after that we ponder over the third category of Jihad which is to stab, to hit and to combat. We see that ‘Ali was not alone in this, but many other companions also had the same share like Talha, Zubair and Sa’d and those martyred in early Islam like Hamza, ‘Ubaidah bin Harith and Mus’ab bin ‘Umair, and from Ansar Sa’d bin Mu’adh, Simak bin Kharshah, Abu Dujanah and others. Also Abu Bakr and ‘Umar do have a good share in it even if they did not get involved in it like these people which is because of their participation in a better Jihad in association with the Messenger of Allah (sallallahu ‘alaihi wa sallam) and to aid him during battles. And he sent them for war more than he sent ‘Ali. He sent Abu Bakr towards Bani Fazarah and elsewhere and he sent ‘Umar towards Bani Fulan. On the other hand we do not know ‘Ali was sent for any battle except at a fort of Khaibar which he conquered [and he had sent Abu Bakr and ‘Umar there, before ‘Ali, but they could not conquered it]. So Abu Bakr and ‘Umar were involved in the highest level of Jihad and besides that they have their share with ‘Ali in the lower category of Jihad.<\/p>\n<p style=\"text-align: justify;\">-End of Ibn Hazm&#8217;s words-<\/p>\n<p style=\"text-align: center;\">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<\/p>\n<p>As for who is the real coward, let us quote the leaders of the Shia sect who all agree that the reason their last Imam is hiding is because of his fear of death.<\/p>\n<p>&nbsp;<\/p>\n<p>al-Tusi in his book al-Ghaybah page 203, al-Murtada in his book al-Shafi volume 4 page 149 and al-Mufid in his book al-Fusoul al-Mukhtarah page 395:<\/p>\n<p>&nbsp;<\/p>\n<p>لا سبب للغيبة ولا علة تمنعه من الظهور الا خوف الامام على نفسه من القتل<\/p>\n<p>&nbsp;<\/p>\n<p>“The only reason behind the ghaybah (occultation) of the Mahdi and the reason that he cannot appear is that he fears that he will be killed.”<\/p>\n<p style=\"text-align: center;\">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<\/p>\n<p><strong>Refuting Shia doubts regarding `Umar ibn al-Khattab:<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>The proofs that the Shia present to accuse `Umar of cowardice are well known and they aren&#8217;t many so we will refute all of them below in a very brief way.<\/p>\n<p>&nbsp;<\/p>\n<p><strong><span style=\"color: #000080;\">&#8211;Did `Umar (ra) run away from Uhud?&#8211;<\/span><\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>The first narration they present is from al-Tabari&#8217;s book:<\/p>\n<p>&nbsp;<\/p>\n<p>حدثنا : أبو هشام الرفاعي ، قال : ، ثنا : أبوبكر بن عياش ، قال : ، ثنا : عاصم بن كليب ، عن أبيه ، قال : خطب عمر يوم الجمعة ، فقرأ : آل عمران ، وكان يعجبه إذا خطب أن يقرأها ، فلما إنتهى إلى قوله : إن الذين تولوا منكم يوم التقى الجمعان ، قال : لما كان يوم أحد هزمناهم ، ففررت حتى صعدت الجبل ، فلقد رأيتني أنزو كأنني أروى ، والناس يقولون : قتل محمد ! فقلت : لا أجد أحداًً يقول قتل محمد إلاّ قتلته ، حتى إجتمعنا على الجبل ، فنزلت : إن الذين تولوا منكم يوم التقى الجمعان<\/p>\n<p>&nbsp;<\/p>\n<p>From ibn Jarir al-Tabari in Jami&#8217;i al-Bayan 4\/193:<\/p>\n<p style=\"text-align: justify;\">Abu Hisham al-Rifa&#8217;ee said: Abu Bakr ibn &#8216;Ayyash said: &#8216;Issam ibn Kulaib from his Father: &#8216;Umar made a sermon on Friday so he read Surat aal-&#8216;Imran and he liked to recite it when he made his sermons and when he ended on &#8220;Indeed, those of you who turned back on the day the two armies met&#8221; He said: On the day of Uhud we defeated them so I fled and climbed the mountain &#8230; (until the end of the narration).<\/p>\n<p style=\"text-align: justify;\">Hadith grading:<br \/>\n-Abu Hisham ibn Yazeed al-Rifa&#8217;ee al-Kufi is weak by consensus of the scholars of Hadith according to al-Bukhari, so this narration is extremely weak.<\/p>\n<p>&nbsp;<\/p>\n<p>The second narration is that of Ibn Hisham al-Hamiree in Seerat al-Nabi 2\/281:<\/p>\n<p>&nbsp;<\/p>\n<p>قال الراوي : قال إبن هشام : وكان ضرار لحق عمر بن الخطاب يوم أحد ، فجعل يضربه بعرض الرمح ويقول : إنج يابن الخطاب لا أقتلك !! فكان عمر يعرفها له بعد إسلامه.<\/p>\n<p>&nbsp;<\/p>\n<p>Ibn Hisham said: and Dirar pursued &#8216;Umar ibn al-Khattab on the day of Uhud and he began hitting him with the bottom of the spear&#8230;(until the end)<br \/>\nHadith grading:<br \/>\n-Between Ibn Hisham and the battle of Uhud are fifty years so this narration is Mursal and weak and it doesn&#8217;t mention him running away.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">These are pretty much the only narrations that mention anything about `Umar ibn al-Khattab (ra), the same two narrations are found in several books so they&#8217;re just being repeated. for example the Shia they&#8217;ll quote from al-Dhurr al-Manthur by al-Suyuti and make it sound as if it&#8217;s a different narration whereas in reality this is the exact same narration of ibn Jarir al-Tabari, or they might quote it from Kanzul-&#8216;Ummal by al-Muttaqi al-Hindi and say that this is a different source whereas in reality al-Hindi quoted it from al-Suyuti who in turn quoted it from Ibn Jarir with the exact same weak Sanad.<\/p>\n<p>Other things which the Shia might use:<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">-They might use the narration of Ibn Katheer in al-Seerah al-Nabawiyah who took it from al-Beihaqi with its Isnad from `Ammar from Abi al-Zubair from Jabir and this narration doesn&#8217;t even mention `Umar (ra) so it&#8217;s useless.<\/p>\n<p style=\"text-align: justify;\">-They might use the saying of al-Fakhr al-Razi who is an Asha`ari in his Tafseer and his saying is not backed by any proof from the Quran or the Ahadith so it&#8217;s useless.<\/p>\n<p style=\"text-align: justify;\">-They might quote the saying of an Orientalist called Marsden Jones who commented on the book al-Maghazi by al-Waqidi and the sayings of all Orientalists aren&#8217;t worth anything in Islam.<\/p>\n<p style=\"text-align: justify;\">-They might use a saying from the book Mu`ujam al-Buldan by al-Hamawi and this doesn&#8217;t even have a Sanad so it&#8217;s useless.<\/p>\n<p style=\"text-align: justify;\">-They may quote the sayings of Ibn abi al-Hadeed who is a Shi`ite\/Mu`atazili, he is weak and his sayings are ignored altogether.<\/p>\n<p style=\"text-align: justify;\">The truth of course was that Abu Bakr and `Umar were from the bravest of men in that battle as authentically reported by the experts.<\/p>\n<p style=\"text-align: justify;\">We read in Dala’il al-Nubuwwah li-Abu Nu`aym in an authentic report:<\/p>\n<p style=\"text-align: justify;\">[Al-Zuhri from `Abdullah bin Ka`b bin Malik who said: Ka`b was the first to recognize the Prophet (saw) after the defeat of the Muslims, and after the rumors spread that Rasul-Allah (saw) got killed. Ka`b said: I recognized his eyes radiating from under the battle helmet, so I called in my loudest voice: “O Muslims, I bear good news; this is Rasul-Allah (saw).” When they realized this they carried him to the narrow roads (for safety), with him was Abu Bakr, `Umar, `Ali, Talhah, al-Zubayr, al-Harith bin al-Simah and a group of Muslims. When he was lying in the road, Ubay bin Khalaf tracked him saying: “O Muhammad, may I perish if I don’t make you perish.” We said: “O Rasul-Allah (saw) should one of us go to him and face him?” He replied: “Leave him (to me).” Then he (saw) leaned down and grabbed a spear from al-Harith and charged towards ibn Khalaf with such a force that we all fell back from around him like the hairs on the back of a camel fly, the spear struck ibn Khalaf sending him flying off of his horse.]<\/p>\n<p style=\"text-align: justify;\">It was also reported:<\/p>\n<p style=\"text-align: justify;\">[Ibn `Abbas said: Sa`d bin `Ubadah told me: A group from the companions of the Prophet (saw) gave him an oath of allegiance until death on the day of Uhud when the Muslims were defeated, so they were patient and they persevered and protected him with their bodies, the man among them would say: “May my self be sacrificed for yours O Rasul-Allah (saw). May my face be a protection for yours O RasulAllah (saw).” Until several of them died and from these men were Abu Bakr, `Umar, `Ali, al-Zubayr, Talhah, Sa`d, Sahl bin Hunayf, ibn abi al-Aqlah, al-Harith bin al-Simah, abu Dujanah and al-Habbab bin alMundhir. Rasul-Allah (saw) tried climbing a large rock but could not because he carried two heavy armors, so Talhah bin `Ubaydullah carried him and supported him until he climbed it so he (saw) said: “Talhah has deserved it (meaning Jannah).”<\/p>\n<p style=\"text-align: justify;\">Not only that, but Abu Bakr was from those who continued to ride against the disbelievers even after the battle ended to make sure they won&#8217;t return and harm the Muslims.<\/p>\n<p style=\"text-align: justify;\">We read in Sahih al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">[`A’ishah said to `Urwah: Regarding the Holy Verse: {Those [believers] who responded to Allah and the Messenger after injury had struck them. For those who did good among them and feared Allah is a great reward.} She said to `Urwah: &#8220;O my nephew! Your father, al-Zubayr and Abu Bakr were among them (i.e. those who responded to the call of Allah and the Rasul). When Rasul-Allah (saw), suffered what he suffered on the day of Uhud and the pagans left, the Prophet was afraid that they might return. So he said: ‘Who will go on their (i.e. pagans&#8217;) track?’ He then selected seventy men from among them (for this purpose). Among them were Abu Bakr and al-Zubayr.]<\/p>\n<p><strong><span style=\"color: #000080;\">&#8211;Did `Umar (ra) run away from Hunayn?&#8211;<\/span><\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>Shia bloggers will accuse `Umar ibn al-Khattab (ra) of being a coward and running away from the battle of Hunayn without providing sufficient evidence or conducting any research, they base their accusation on a narration of Bukhari that doesn’t really serve their purpose at all as you will see:<\/p>\n<p>&nbsp;<\/p>\n<p>أَبِي مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ، قَالَ: خَرَجْنَا مَعَ النَّبِيِّ  عَامَ حُنَيْنٍ، فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ، فَرَأَيْتُ رَجُلًا مِنَ الْمُشْرِكِينَ قَدْ عَلَا رَجُلًا مِنَ الْمُسْلِمِينَ، فَضَرَبْتُهُ مِنْ وَرَائِهِ عَلَى حَبْلِ عَاتِقِهِ بِالسَّيْفِ، فَقَطَعْتُ الدِّرْعَ وَأَقْبَلَ عَلَيَّ، فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ، ثُمَّ أَدْرَكَهُ الْمَوْتُ، فَأَرْسَلَنِي فَلَحِقْتُ عُمَرَ بْنَ الْخَطَّابِ، فَقُلْتُ: مَا بَالُ النَّاسِ، قَالَ: أَمْرُ اللَّهِ<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Narrated Abu Qatada: We set out in the company of Allah’s Apostle on the day (of the battle) of Hunain. When we faced the enemy, the Muslims retreated and I saw a pagan throwing himself over a Muslim. I turned around and came upon him from behind and hit him on the shoulder with the sword He (i.e. the pagan) came towards me and seized me so violently that I felt as if it were death itself, but death overtook him and he released me. I followed `Umar bin Al Khattab and asked (him), “What is wrong with the people(fleeing)?” He replied, “This is the Will of Allah,” After the people returned, the Prophet sat and said, “Anyone who has killed an enemy and has a proof of that, will posses his spoils.” [Sahih al-Bukhari, Book 53, Hadith 370]<\/p>\n<p style=\"text-align: justify;\">This narration does not state that `Umar (ra) ran away, it states that the Muslims were defeated and a group of them retreated, the narrator simply asks `Umar (ra) what&#8217;s going on and he answers him that victory and defeat are by the will of Allah. The Shia due to their hatred and ill-will conclude that `Umar (ra) was from the people who fled even though it isn&#8217;t clearly mentioned, they will soon know the virtue of giving people the benefit of the doubt when they realize their injustice.<\/p>\n<p style=\"text-align: justify;\">Their first issue is that they jumped to a biased conclusion without solid evidence, their second issue is that any enemy of `Ali (ra) can use this against him and claim that `Ali (ra) was from those who fled as the narrator simply says &#8220;The Muslims retreated&#8221; and in another version he says “The Muslims were defeated and I was defeated with them” as you all know`Ali (ra) is included since he is one of the Muslims.<\/p>\n<p style=\"text-align: justify;\">The reality of the matter (as usual) is that the Shia are wrong since `Umar (ra), Abu Bakr (ra) and others from among the Mouhajirun and the Ansar have stood their ground and defended the Prophet peace be upon him.<\/p>\n<p style=\"text-align: justify;\">In Musnad Ahmad we read the authentic report:<\/p>\n<p style=\"text-align: justify;\">[`Abdul-Rahman bin Jabir, from Jabir bin `Abdullah that he said: When we faced the valley of Hunayn, we went down into one of the steep valleys of Tihamah and we continued our descent during the dark early morning, but the enemy was laying in ambush in the caves and narrow paths and they were well prepared. By Allah, what shocked us most were their soldiers who attacked us all at once, and the people (Muslims) were defeated in retreat, so the Prophet (saw) went to the right and shouted: “O people, come to me, I am Rasul-Allah, I am Muhammad ibn `Abdillah.” But the camels were pushing and shoving against one another, and the people were running, except that with Rasul-Allah (saw) was a group from the Mouhajiroun, the Ansar, and his household but they were not many. From those who held their positions with him were Abu Bakr and `Umar, and from his household was `Ali and `Abbas and his son al-Fadl bin `Abbas as well as abu Sufiyan bin al-Harith and Rabi`ah bin al-Harith, and Ayman bin `Ubayd who was the son of Umm Ayman, and Usamah ibn Zayd; also a man from Hawazin on his white camel holding a black banner whose tip ended with a sharp spear.]<\/p>\n<p style=\"text-align: justify;\">The report is authentic and Ibn Ishaq declares hearing from `Asim at the end of the report in Musnad Ahmad, he also declares hearing from another authentic chain in Dala&#8217;il al-Nubuwwah by al-Bayhaqi where Ahmad ibn`Abdul-Jabbar narrates from Yunus bin Bukayr from the book of Ibn Ishaq and this chain is authenticated by the experts.<\/p>\n<p style=\"text-align: justify;\">So as we can clearly see from the authentic texts a group from the Mouhajirun and the Ansar remained with the Prophet peace be upon him and amongst them were Abu Bakr and ‘Umar may Allah be pleased with them, and not only did `Umar (ra) fight but he also received two female captives as recorded in Bukhari:<\/p>\n<p style=\"text-align: justify;\">Narrated Nafi`: `Umar bin Al-Khattab said, “O Allah’s Apostle! I vowed to observe I`tikaf for one day during the Pre-lslamic period.” The Prophet ordered him to fulfill his vow. `Umar gained two lady captives from the war prisoners of Hunayn and he left them in some of the houses at Mecca. When Allah’s Apostle freed the captives of hunain without ransom, they came out-walking in the streets. ‘Umar said (to his son), “O `Abdullah! See what is the matter.” `Abdullah replied, “Allah’s Apostle has freed the captives without ransom.” He said (to him), “Go and set free those two slave girls.” [Sahih al-Bukhari Book 53 Hadith 372]<\/p>\n<p style=\"text-align: justify;\">In fact it was narrated by al-Tirmidhi, al-Hakim and Ahmad that the people who stood their ground with the Prophet (saw) were between 80 to 100 men.<\/p>\n<p style=\"text-align: justify;\">InshaAllah this is useful for the followers of truth so peace be upon our Prophet and his family and Companions<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Who was the bravest companion? By Abu Muhammad Ibn Hazm Introduction This is one of the issues which Shia love to raise against the personality of companions like Abu Bakr and ‘Umar. Their problem is that they think bravery is <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/09\/03\/who-was-the-bravest-companion-ibn-hazm\/\" title=\"Who was the bravest companion? [Ibn Hazm]\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6,1],"tags":[],"class_list":{"0":"post-2412","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2412","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2412"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2412\/revisions"}],"predecessor-version":[{"id":2452,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2412\/revisions\/2452"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2412"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2412"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2412"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}