{"id":2435,"date":"2015-09-05T20:00:02","date_gmt":"2015-09-05T20:00:02","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2435"},"modified":"2016-01-29T19:29:51","modified_gmt":"2016-01-29T19:29:51","slug":"ashura-lies-and-fabrications","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/09\/05\/ashura-lies-and-fabrications\/","title":{"rendered":"&#8216;Ashura: Lies and Fabrications"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2435\" alt=\"\" \/><\/p>\n<p style=\"text-align: center;\"><strong>&#8216;Ashura: Lies and Fabrications<\/strong><\/p>\n<p style=\"text-align: justify;\">This work is a summary of a series of lectures conducted by Ayatollah Murtadha al-Mutahhari during &#8216;Ashura in Iran in 1969. In these lectures Mutahhari discusses the many fabrications regarding the martyrdom of al-Husayn ibn &#8216;Ali (ra), and specifically the spurious stories that have been falsely attributed to this event by Shias. He demonstrates the fact that many myths have been created around this event – created specifically for the purpose of whipping the people into a frenzy and making them shed false tears.<\/p>\n<p style=\"text-align: justify;\">Muttahhari sought (in 1969) to bring accountability to both the reciters of these events and the listeners. He emphasized that it was the responsibility of all parties involved to end the mythmaking and storytelling, and to focus instead on the factual retelling of the martyrdom of al-Husayn (ra).<\/p>\n<p style=\"text-align: justify;\"><strong>A Failed Majlis<\/strong><\/p>\n<p style=\"text-align: justify;\">It is a tradition in Shia culture for people to host gatherings during ‘Ashura, and it is viewed as a mark of prestige for the average person.<\/p>\n<p style=\"text-align: justify;\">Al-Muttahhari mentions to us a majlis which was hosted in Iran; a majlis which failed spectacularly.<\/p>\n<p style=\"text-align: justify;\">The reason for its failure was that the recitor of the majlis decided to stick only to the factual retelling of the event of ‘Ashurra, and omit all the fabricated tales.<\/p>\n<p style=\"text-align: justify;\">According to al-Muttahhari the following occurred:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">“By chance, some days later this gentleman himself happened to host a majlis in his mosque and he invited the same waiz; to make the rawdah. But before his taking his seat on the minbar the host said to the wa&#8217;iz, <strong><em>“I want to hold a model majlis in which nothing is said except the true narrative. Make it a point not to recount any episode except out of the reliable books. You shouldn&#8217;t touch any of that abominable stuff!&#8217;<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The wai&#8217;z replied, “The majlis is hosted by you. Your will, will be done.”<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">On the first night, the gentleman himself sat there facing the qiblah in the prayer niche, close to the minbar. The wai&#8217;z; began his sermon, and when the time came to recite the tragic narrative, <strong><em>as he had committed himself to recite nothing but the true accounts, the majlis remained unmoved and frozen as he spoke on.<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The gentleman was now upset. He was the host of the majlis and he thought about what the people would say behind his back. The women would certainly say, “To be sure, the Aqa&#8217;s intent was not sincere, and so the majlis was a fiasco.”<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>Had his intentions been good and were his motives sincere the majlis would have been rocked with the howls and-groans of mourners crying their eyes out.<\/em><\/strong> He saw that it would all end up in a loss of face. What should he do? Quietly, he signaled to the wai&#8217;z, <strong><em>“Get a bit of that abominable stuff!” (i.e. Lie and recite the fabricated stories)<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The expectation of the people that the majlis should go wild with mourning is itself a source of falsehoods. <strong><em>Accordingly, most of the fabrications that have occurred have been for the purpose of drawing tears, nothing else.”<\/em><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>In summary<\/strong>, a man wanted to host a majlis in which only a factual retelling occurred. Unfortunately, no one cried or wailed at the plain facts of ‘Ashurra, and the host felt embarrassed. He then told the recitor to mention the fabricated stories so that people would cry and his majlis would be a success.<\/p>\n<p style=\"text-align: justify;\"><strong>Examples of Fabrications<\/strong><\/p>\n<p style=\"text-align: justify;\">Below we will quote a few examples of the lies and fabrications that al-Muttahhari mentioned in his lectures.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Husayn as a child interrupts his father, ‘Ali, while he is giving a sermon and cries for water:<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">They say that one day &#8216;Ali, the Commander of the Faithful, may Peace be upon him, was delivering a sermon from the <em>minbar<\/em>. Suddenly Imam Husayn (<em>&#8216;a<\/em>) said, &#8216;I am thirsty.&#8217;<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Imam &#8216;Ali said, &#8216;Let someone bring water for my son.&#8217; The first person to get up was a little boy, Abu al-Fadl al-&#8216;Abbas (<em>&#8216;a<\/em>). He went out and got a jar of water from his mother.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">When he returned carrying the jar on his head, his head was drenched in water as it spilled from the sides. This story is narrated in its elaborate detail. Then, when the Commander of the Faithful&#8217;s eyes fell on this scene, tears flowed from his eyes.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">He was asked why he was crying. He told them that the ordeals that this young son of his would face had come to his mind.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">You know the rest of the story, which serves the purpose of a point of departure for switching to the tragic scenes of <em><a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a><\/em>. Hajji Nuri has an excellent discussion at this point.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">He writes, “Now that you say that &#8216;Ali was delivering a sermon from the <em>minbar<\/em>, you should know that &#8216;Ali spoke from the <em>minbar<\/em> and delivered sermons only during the period of his caliphate.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Hence, the episode must have occurred in Kufah. At that time Imam Husayn was a man of about thirty-three years.”<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Then he remarks, <strong><em>“Is it at all a sensible thing for a man of thirty-three years to say all of a sudden, in a formal gathering while his father is delivering a sermon, &#8216;I am thirsty!&#8217; &#8216;I want water!”<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>If an ordinary man does such a thing, it would be considered ill-mannered of him.<\/em><\/strong> Moreover, Hadrat Abu al-Fadl, too, was not a child at that time but a young man of at least fifteen years.” You see how they have fabricated the story! Is such a story worthy of Imam Husayn? Aside from its fictitious character, what value does it have?<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Does it elevate the station of Imam Husayn or does it detract from it? It is definitely detracting to the dignity of the Imam, as it ascribes a false act to the Imam and detracts from is station by bringing the Imam down to the level of a most ill-mannered person who, at a time when his father &#8211; a man like &#8216;Ali &#8211; is delivering a sermon, feels thirsty and instead of waiting for the session to be over, suddenly interrupts his father&#8217;s sermon to ask for water.&#8217;<\/p>\n<p style=\"text-align: justify;\"><strong>Al-Husayn’s Caravan Departs Mecca in Splendor<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Another example of such fabrications is the story of a messenger who has brought a letter for Abu &#8216;Abd Allah (<em>&#8216;a<\/em>) and he awaits a reply. The Imam tells him to come after three days and collect the reply. After three days on inquiring he is told that the Imam was departing the same day.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">He says to himself, “Now that he is setting out, let us go and watch the majesty and glamour of the prince of the Hijaz He goes and there he sees the Imam, together with other Hashimis among men, seated on splendid chairs. Then the camels are brought bearing the litters draped in silk and brocade.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Then the ladies emerge and with much honor and ceremony they are escorted into these litters. This description continues in this vein until they make the digression to switch to the scene of the eleventh day of Muharram, to compare the glamour and honor of this day with the sorry state of the womenfolk on the latter day. Haji Nuri calls such descriptions into question. He says, “It is history which says that when Imam Husayn left Madinah he recited this Qur&#8217;anic verse:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong>“He left it in the state of fear and concern”. (28:21)<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">That is, he likened his own departure to that of Moses, son of &#8216;Imran, when he fled for the fear of the Pharaoh.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong>“He said, “It might be that my Lord will guide me to the right path.””<\/strong>(28:22)<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The Imam had departed with a most simple caravan. Does the greatness of Imam Husayn lie in his sitting, for instance, on golden chairs? Or does the greatness of his family and womenfolk lie in their using litters draped in silk and brocade, or their possessing fine horses and camels and a retinue of lackeys and servants?!<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Layla the mother of ‘Ali al-Akbar<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Another example of tahrif in the accounts of &#8216;Ashura&#8217; is the famous story of Layla, the mother of Hadrat &#8216;Ali&#8217; Akbar, a story that is not supported even by a single work of history. Of course, Ali&#8217; Akbar had a mother whose name was Layla, but not a single historical work has stated that Layla was present at Karbala&#8217;. But you see how many pathetic tales there are about Layla and Ali&#8217; Akbar, including the story of Layla&#8217;s arrival at &#8216;Ali Akbar&#8217;s side at the time of his martyrdom.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">I have heard this story even in Qum, in a majlis that had been held on behalf of Ayatullah Burujerdi, though he himself was not attending. In this tale, as &#8216;Ali Akbar leaves for the battlefield the Imam says to Layla, “I have heard from my grandfather that God answers a mother&#8217;s prayer for the sake of her child. Go into a solitary tent, unfurl your locks and pray for your son. It may be that God will bring our son safe back to us.”<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">First of all, there was no Layla in Karbala&#8217; to have done that. Secondly, this was not Husayn&#8217;s logic and way of thinking. Husayn&#8217;s logic on the day of &#8216;Ashara&#8217; was the logic of self-sacrifice. All historians have written that whenever anyone asked the Imam for the leave to go to battlefield, the Imam would at first try to restrain him with some excuse or another that he could think of, excepting the case of &#8216;Ali&#8217; Akbar about whom they write:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Thereat he asked his father&#8217;s permission to go forth to fight, and he gave him the permission.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">That is, as soon as &#8216;Ali Akbar asked for permission, the Imam told him to depart. Nevertheless, there is no dearth of verses which depict the episode in quite a different light, including this one:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>Rise, O father, let us leave this wilderness,<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>Let us go now to Layla&#8217;s tent.<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Another case relating to the same story, which is also very amazing, is the one that I heard in Tehran. It was in the house of one of the eminent scholars of this city where one of the speakers narrated the story of Layla. It was something which I had never heard in my life.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">According to his narrative, after Layla went into the tent, she opened the locks of her hair and vowed that if God were to bring &#8216;Ali Akbar back safely to her and should he not be killed in <em>Karbala<\/em>&#8216; she would sow basil (<em>rayhan<\/em>) all along the way from <em>Karbala<\/em>&#8216; to Madinah, a distance of 300 parasangs. Having said this, he began to sing out this couplet:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">I have made a vow, were they to return<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">I will sow basil all the way to Taft!<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">This Arabic couplet caused me greater surprise as to where it came from. On investigating I found that the Taft mentioned in it is not <em>Karbala<\/em>&#8216; but a place related to the famous love legend of Layla and Majnun. Taft was the place where the legendary Layla live. This couplet was composed by Majnun al-&#8216;Amiri and sung for the love of Layla, and here this man was reciting it while attributing it to Layla, the mother of &#8216;Ali Akbar, conjuring a fictitious connection with <em>Karbala<\/em>&#8216;.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Just imagine, were a Christian or a Jew, or for that matter some person with no religious affiliation, were to be there and hear these things, will he not say what a nonsensical hagiography these people have? He would not know that this tale has been fabricated by that man, but he would say, <em>na&#8217;udubillah<\/em>, how senseless were the women saints of this people to vow sowing basil from <em>Karbala<\/em>&#8216; to Madinah!<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Husayn Prays Salat Al-Khawf and then Conducts a Marriage Ceremony while the Battle is Raging<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong> <\/strong>A worse fabrication is the one mentioned by Hajji Nuri. As you know, in the heat of the battle on the day of &#8216;Ashura&#8217;, the Imam offered his prayers hurriedly in the form of <em>salat al-khawf<\/em> and there was no respite even to offer full prayers. In fact, two of the companions of the Imam came to stand in front of him to shield the Imam (against the arrows) so that he may offer two rak&#8217;ahs of the <em>salat al-khawf<\/em>.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The two of them fell from the injuries inflicted under the shower of the arrows. The enemy would not even give respite for offering prayers. Nevertheless, they have concocted a story that the Imam called for a wedding ceremony on this day, declaring, &#8216;It is my wish to see one of my daughter wedded to Qasim.&#8217; Obviously, one cannot take one&#8217;s wishes to one&#8217;s grave.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">By God, see what kind of things they have attributed to a man like Husayn ibn &#8216;Ali, things the like of which we sometimes hear from persons of a very mediocre character, who express a wish to see the wedding of their son or daughter in their life. And this is said to have occurred at a time when there was hardly any respite even for offering prayers.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">They say that the Hadrat said, &#8216;I want to wed my daughter to my nephew here and now, even if it is just an appearance of a wedding.&#8217; One of the things that was an inseparable part of our traditional <em>ta&#8217;ziyahs<\/em> was the wedding of Qasim, the boy bridegroom.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Such an episode is not mentioned in any reliable book of history. According to Hajji Nuri, Mulla Husayn Kashifi was the first man to write this story in a book named <em>Rawdat al-shuhada&#8217;<\/em> and it is totally fictitious. The case here is similar to the one about which the poet says:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>Many are the appendages that they have clapped upon it,<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>You will hardly recognize it when you see it again.<\/em><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Za’far the Jinn comes to Fight for al-Husayn <\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">We have attributed several companions to Husayn ibn &#8216;Ali that he did not have, such as the Za&#8217;far the Jinn. Similarly, there are some names among the enemies that did not exist. It is mentioned in the book <em>Asrar al-shahadah<\/em> that &#8216;Umar ibn Sa&#8217;d&#8217;s army in <em>Karbala<\/em>&#8216; consisted of one million and sixty thousand men. One may ask, where did they come from? Were they all Kufans? Is such a thing possible?<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Abbas could Defeat an Entire Army<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">It is also written in that book that Imam Husayn himself personally killed three hundred thousand men in combat. The bomb that destroyed Hiroshima killed sixty thousand people. I calculated that if we assume that a swordsman kills one man every second, it would take eighty-three hours and twenty minutes to massacre a force of three hundred thousand.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Later, when they saw that this number of those felled by the Imam did not fit with a day&#8217;s duration, they said that the day of &#8216;<em>Ashura<\/em> was also seventy-two hours long!<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Similar things are said concerning Hadrat Abu al-Fadl, that he killed twenty-five thousand men. I calculated that if one man were killed per second, it would require six days and fifty and odd hours to kill that many.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Therefore, we have to admit what Hajji Nuri, this great man, says, that if one wanted to mourn the Imam today and narrate the ordeals of Abu &#8216;Abd Allah, may Peace be upon him, one should lament over these new tragedies, over these falsehoods, which have been incorporated in the accounts of his martyrdom.<\/p>\n<p style=\"text-align: justify;\"><strong>Al-Araba’in (40 days) Tradition is Based on a Lie<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Another example relates to the day of <em>&#8216;Arba&#8217;in<\/em>. At the time of <em>&#8216;Arba&#8217;in<\/em> everyone relates the narrative that leads the people to imagine that the captives of the Imam&#8217;s family arrived at <em>Karbala<\/em>&#8216; on the day of <em>&#8216;Arba&#8217;in<\/em>, and that Imam Zayn al-&#8216;Abidin met Jabir (ibn &#8216;Abd Allah al-Ansari) there. However, excepting the <em>Luhuf<\/em>, whose author is Sayyid ibn Tawus and who has denied it in his other books, or at least has not confirmed it, such an episode is not mentioned in any other book, nor does it seem very reasonable to believe it.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">But is it possible to expunge these stories, which are repeated every year, from the people&#8217;s minds? Jabir was the first visitor to Imam Husayn grave, and the significance of <em>&#8216;Arba&#8217;in<\/em> is also nothing except that it is the occasion for the <em>ziyarah<\/em> of Imam Husayn&#8217;s tomb.<\/p>\n<p style=\"text-align: justify;\"><strong>Does Fatima Mourn ‘Ashura Every Year?<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Why is there so much encouragement for and emphasis on visiting the shrine of Husayn ibn &#8216;Ali?<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">We should reflect over these questions. Some might say that it is for the sake of condoling with Hadrat Zahra&#8217; and offering her consolation! But is it not ridiculous to imagine that Hadrat Zahra&#8217; should still need consolation after fourteen hundred years, whereas, in accordance with the explicit statements of Imam Husayn and according to our creed, since his martyrdom Imam Husayn and Hadrat Zahra have been together in heaven?<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">What a thing to say! Is it correct to think of Hadrat Zahra as a little child that goes on weeping, even after fourteen centuries, and whom we have to go and console? Such kind of belief is destructive for religion. Imam Husayn (<em>&#8216;a<\/em>) established the practical ideology of Islam and he is the practical model for Islamic movements.<\/p>\n<p style=\"text-align: justify;\"><strong>Water was Cut off for Three Days<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">According to one of two reports, on the day of &#8216;Ashura&#8217; Abu al-Fadl came to the Imam and said, “Dear brother, now give me the permission. This breast of mine is suffocated and I can bear it no more. I want to sacrifice my life for your sake.”<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">I don&#8217;t know the reason why Imam responded to Hadrat Abu al-Fadl&#8217;s request in the manner that he did. Abu &#8216;Abd Allah himself knows better. He said, “Brother, now that you want to leave, try to get some water for these children.”<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Hadrat Abu al-Fadl had already come to receive the nickname <em>Saqqa<\/em> (water carrier), as earlier, on one or two occasions, at nights he had been able to pass through the enemy&#8217;s ranks to fetch water for the children in Abu &#8216;Abd Allah&#8217;s camp. <strong><em>It was not the case that they had not drunk any water for three days and nights.<\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Access to water had been closed for three days and nights<strong><em>, but during this time they had been able to get some water on one or two occasions, including the night of &#8216;Ashura&#8217;, when they had taken bath and washed their bodies.<\/em><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong><em> <\/em><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The Women, such as Zainab bint ‘Ali, would Run out of the Tents to the Fallen<\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The Imam had told them not to come out of the tents as long as he was alive (Don&#8217;t believe those who say that the women kept running out every now and then. Never.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The Imam had ordered them to remain in the tents as long as he was alive). He had told them that they must not make any untoward utterance which might reduce their reward with God. He had told them that they would find deliverance and that their ultimate end would be a good one, that God will punish their enemies.<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><strong><em>They did not have the Imam&#8217;s permission to come out of their tents, and they did not. <\/em><\/strong><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">Husayn ibn Ali&#8217;s sense of manly honor and their own sense of feminine honor did not permit them to come out. Accordingly, when they heard the Imam utter <em>&#8216;La hawl wala quwatta illa billahil aliyyil azim&#8217;<\/em>, they felt reassured. And as the Imam had come back to them once or twice after bidding them farewell, they still expected the Imam to return.<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/p>\n<p style=\"text-align: justify;\">The death of al-Husayn (ra) was certainly a tragedy and a great crime and shame upon those who committed it.<\/p>\n<p style=\"text-align: justify;\">The question is – what did al-Husayn (ra) die for? Did he die in order to keep his honor and make a stand?<\/p>\n<p style=\"text-align: justify;\">Or did he die so that he may become a figure of legend and make-belief?<\/p>\n<p style=\"text-align: justify;\">We ask all the sincere Shi’i readers to take a moment and reflect on what exactly they are doing every year during ‘Ashura.<\/p>\n<p style=\"text-align: justify;\">Are you commemorating the martyrdom of al-Husayn (ra), or are you, instead, sitting and listening to fairy tales invented just to make you cry?<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>&#8216;Ashura: Lies and Fabrications This work is a summary of a series of lectures conducted by Ayatollah Murtadha al-Mutahhari during &#8216;Ashura in Iran in 1969. In these lectures Mutahhari discusses the many fabrications regarding the martyrdom of al-Husayn ibn &#8216;Ali <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/09\/05\/ashura-lies-and-fabrications\/\" title=\"&#8216;Ashura: Lies and Fabrications\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-2435","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2435","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2435"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2435\/revisions"}],"predecessor-version":[{"id":3008,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2435\/revisions\/3008"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2435"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2435"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2435"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}