{"id":2534,"date":"2015-10-16T11:23:43","date_gmt":"2015-10-16T11:23:43","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2534"},"modified":"2015-10-18T11:09:53","modified_gmt":"2015-10-18T11:09:53","slug":"washing-of-the-feet-in-wudu-answering-shii-contentions-part-1","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/10\/16\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-1\/","title":{"rendered":"Washing of the Feet in Wudu: Answering Shi’i Contentions Part 1"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2534\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\">Download this article in <a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/10\/Washing_feet_Quran_part1.pdf\" rel=\"external nofollow\">PDF<\/a><\/p>\n<p style=\"text-align: justify;\">Bismillah<\/p>\n<p style=\"text-align: justify;\">All praises due to Allah.<\/p>\n<p style=\"text-align: justify;\">May His mercy and blessings be upon Muhammad, his family and companions.<\/p>\n<p style=\"text-align: justify;\">This is a refutation of Shi’i contentions with regards to the act of washing the feet in Wudu. Shia say this is an innovation and against the command of Allah in Quran which is to wipe the feet.<\/p>\n<p style=\"text-align: justify;\">This writing will be a refutation of all the arguments provided by Shi&#8217;ites including that by Shia scholar Abdul Husain Sharafuddin al-Musawi, the author of famous forged conversation <em>“al-Muraja’at”<\/em>, who has written against Sunni the viewpoint in his book <em>“al-Masaail al-Fiqhiyyah”<\/em> which is translated in English as “Juristic Questions”. This book can be accessed at Shia website al-islam.org.<\/p>\n<p style=\"text-align: justify;\">This refutation is broadly divided into two sections:<\/p>\n<ol style=\"text-align: justify;\">\n<li>Regarding the interpretation of the verse of Wudu<\/li>\n<li><a href=\"http:\/\/twelvershia.net\/2015\/10\/18\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-2\/\" rel=\"external nofollow\">Regarding narrations related to washing and wiping of feet.<\/a><\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><strong>VERSE OF WUDU (ABLUTION) AND ITS INTERPRETATION<\/strong><\/p>\n<p style=\"text-align: justify;\">Here our discussion is particularly on the portion of the verse which speaks of wiping or washing of feet.<\/p>\n<p style=\"text-align: justify;\">Abdul Husain said:<\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><em>The evidence of the Shia for this matter was the Quranic verse (O you who believe! when you rise up to prayer, wash your faces and your hands as far as the elbows and wipe your heads and your feet to the (two) ankles. 5:6) <\/em><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\"><em>Imam ar-Razi sufficed us in showing the point of the argument in this verse when he declared: “The evidence of those, who thought that wiping the feet was obligatory, was based upon the two kinds of reciting the phrase (and your feet) mentioned in the verse of wudu’. Ibn Katheer, Hamza, Abu Amr an Aasim recited the phrase in genitive and Nafi’, ibn Aamir and Aasim recited it in accusative. Reciting it in genitive determined that (your feet) was coupled to (your heads) and then as it was obligatory to wipe the head it would be obligatory to wipe the feet. As for reciting it in accusative, it also determined that it was obligatory to wipe the feet because the saying (and wipe your heads) made (your heads) as object and (your feet) was coupled to (your heads) so both of them were objects of the verb (wipe)”<\/em><\/p>\n<p style=\"text-align: justify;\">I say: Even though Fakhruddin Ar-Razi said it but he is not the only person to be looked at in matters of Quranic interpretations. In fact, wiping is not necessitated in case of any of the two recitations; with <em>Jar<\/em> or with <em>Nasb<\/em>. Basically there are three types of recitation of the phrase “<em>wa arjulakum<\/em>” two of which are Mutawatir and the third one is <em>shaadh<\/em> (unreliable):<\/p>\n<ol style=\"text-align: justify;\">\n<li>With <em>Nasb<\/em> I.e. <em>Wa arjulakum<\/em>. This is the recitation of Nafe, Ibn Amir, Hafs, Kisai and Yaqoob among the famous reciters of Quran.<\/li>\n<li>With <em>Jarr<\/em> I.e. <em>wa arjulikum<\/em>. This is the recitation of Ibn Katheer, Abu Amr, Hamza and Abu Bakr from Aasim.<\/li>\n<li>With <em>Damma<\/em> I.e. <em>wa arjulukum<\/em>. This is attributed to Hasan. This is unreliable.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><strong>RECITATION WITH <em>NASB<\/em><\/strong><\/p>\n<p style=\"text-align: justify;\">This is the most prevalent recitation as it is the recitation of Hafs who has narrated it from Aasim. The implication derived from this recitation is that the object ((your feet)) is linked with the command of washing as the <em>I’arab<\/em> it has is the <em>I’irab<\/em> of the body parts which are to be washed mentioned in the verse. This differs with the <em>I’irab<\/em> of portion asked to be wiped.<\/p>\n<p style=\"text-align: justify;\">Hence, apparently this is a command for washing the feet. This is how early exegetes have interpreted it. However, some of the scholars, excluding Shia scholars, have claimed that even this recitation supports wiping because there cannot occur a third phrase between <em>ma’toof<\/em> and <em>ma’toof alaih<\/em>. This was the opinion of Ar-Razi and Ibn Hazm. However, this is not supported by facts as we shall see. Some examples of occurrence of a phrase between <em>ma’toof<\/em> and <em>ma’toof alaih<\/em>:<\/p>\n<p style=\"text-align: justify;\">(1) Allah the Exalted says:<\/p>\n<p style=\"text-align: justify;\">وَصَدٌّ عَنْ سَبِيلِ اللَّهِ وَكُفْرٌ بِهِ وَالْمَسْجِدِ الْحَرَام<\/p>\n<p style=\"text-align: justify;\">“ but averting [people] from the way of Allah and<\/p>\n<p style=\"text-align: justify;\">disbelief in Him and [preventing access to] al-Masjid al-Haram” [2:217]<\/p>\n<p style=\"text-align: justify;\">Here <em>“al-Masjid al-Haram”<\/em> is <em>ma&#8217;toof<\/em> and “averting from the way of Allah” is <em>ma’toof ‘alaihi<\/em> and between them is the phrase “and disbelief in him”.<\/p>\n<p style=\"text-align: justify;\">(2) Allah says:<\/p>\n<p style=\"text-align: justify;\">فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ * وَلَهُ<\/p>\n<p style=\"text-align: justify;\">الْحَمْدُ فِي السَّمَاوَاتِ وَالْأَرْضِ وَعَشِيًّا وَحِينَ<\/p>\n<p style=\"text-align: justify;\">تُظْهِرُونَ<\/p>\n<p style=\"text-align: justify;\">[Surat Ar-Room 17 &#8211; 18]<\/p>\n<p style=\"text-align: justify;\">“So exalted is Allah when you reach the evening<\/p>\n<p style=\"text-align: justify;\">and when you reach  the  morning. And  to  Him  is<\/p>\n<p style=\"text-align: justify;\">[due  all]  praise  throughout the  heavens  and  the  earth.<\/p>\n<p style=\"text-align: justify;\">And  [exalted  is He]  at  night  and when  you  are  at  noon.&#8221;<\/p>\n<p style=\"text-align: justify;\">Here the portion “And to him due all praise throughout the heavens and the earth” occurs between <em>ma’toof<\/em> and <em>ma’toof alaih<\/em> and this is acknowledged in the Tafsir Kabeer (25\/88).<\/p>\n<p style=\"text-align: justify;\">There are many other examples mentioned by scholars like Mahmud al-Aalusi. It is also illogical to raise objection on this interpretation as early companions and <em>Tab’een<\/em> have interpreted it as such and they were the people of this language.<\/p>\n<p style=\"text-align: justify;\">Here is the list of those scholars from <em>Sahaba<\/em> and <em>Taba&#8217;een<\/em> who have interpreted it as such, as opposed to the unreliable claims of Ibn Hazm and Ar-Razi:<\/p>\n<ol>\n<li style=\"text-align: justify;\">Abdullah b. Mas&#8217;ud<\/li>\n<li>Ibn ‘Abbas, but there are also narrations stating otherwise<\/li>\n<li>Urwah b. Zubair, one of the great seven Fuqaha among Taba’een<\/li>\n<li>Mujahid, the great mufassir of Qur’an<\/li>\n<li>As-Suddi<\/li>\n<li>Ibrahim An-Nakha’i, the jurist of Kufa<\/li>\n<li>Dahhak etc.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">These scholars were masters of Arabic and Quran but they did not see any problem when a phrase exists between <em>ma’toof<\/em> and <em>ma’toof ‘alaih<\/em>. Besides them a huge number of early commentators of Quran also did not see it problematic. In conclusion, the objection raised on this interpretation is unreliable and that is why most of the scholars did not pay any attention towards it.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><strong>RECITATION WITH <em>KASRA<\/em><\/strong><\/p>\n<p style=\"text-align: justify;\">The second <em>mutawatir<\/em> way of reciting it is with the <em>Kasra<\/em> on <em>Laam<\/em> I.e. <em>wa arjulikum<\/em>. Based on this recitation many scholars have interpreted it to mean wiping of the feet. The most apparent conclusion drawn from this recitation is that the feet should be wiped because the Arabic for feet takes the <em>I&#8217;arab<\/em> of the head and also coming in succession to it which is commanded to be wiped. Even though it is the first possibility with this recitation but it is not the only possibility with this recitation. We have to interpret a verse by looking at the practice and command of the Prophet (sallallahu ‘alaihi wa sallam).<\/p>\n<p style=\"text-align: justify;\"><strong><u>Reason for interpreting the particular reading against the most apparent meaning :<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">Both the recitations are <em>Mutawatir<\/em> and hence they can only interpret and cannot overrule each other, therefore interpreting one with washing and another with wiping in the same condition is not possible. Hence what we have to do is to look into traditions and which of the two interpretations are correct in light of the actions and sayings of the Prophet (sallallahu alaihi wa sallam). As Allah (subhanahu wa ta’ala) states in Quran:<\/p>\n<p style=\"text-align: justify;\">وَأَنْزَلْنَا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ<\/p>\n<p style=\"text-align: justify;\">إِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّرُونَ<\/p>\n<p style=\"text-align: justify;\">[Surat An-Nahl 44]<\/p>\n<p style=\"text-align: justify;\">“ And  We  revealed  to  you  the message  that<\/p>\n<p style=\"text-align: justify;\">you  may  make  clear to  the  people  what  was<\/p>\n<p style=\"text-align: justify;\">sent  down  to  them  and  that they might  give  thought.”<\/p>\n<p style=\"text-align: justify;\">Hence it was the duty of the Prophet (sallahu alahi wa sallam) to interpret the Quran for us. So when we look at his actions and sayings we see that he always washed his feet and commanded to do so. Narrations of washing are so many that <em>Tawatur<\/em> can easily be claimed regarding it. On the other hand there is not a single authentic narration which shows wiping of the feet by Prophet (sallallahu alaihi wa sallam). [Authenticity of different narrations will be discussed in the next section]<\/p>\n<p style=\"text-align: justify;\">Since we are now sure about the interpretation given by the Prophet (sallahu alaihi wa sallam), hence we need to interpret the verse in light of it. We see that the recitation with <em>Nasb<\/em> and the Sunnah of the Prophet (sallallahu alaihi wa sallam) both clearly supports washing, so the problem remains with the other recitation which is with <em>Kasra<\/em>. We now look at the possibility of interpreting it in light of other clear evidence. We find the following answers to the problem which are in line with language, logic and textual evidence:<\/p>\n<ol style=\"text-align: justify;\">\n<li>The <em>Kasra<\/em> is due to its proximity with the nearby word. Or,<\/li>\n<li>The <em>“MasH”<\/em> mentioned with regards to feet is light washing of them.<\/li>\n<li>The wudu method, in this particular recitation, is regarding travellers and therefore wiping is prescribed over socks in this verse.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">We will expand these answers one by one, Insha Allah.<\/p>\n<p style=\"text-align: justify;\"><strong><em><u>Jarr ‘ala al-Jiwar<\/u><\/em><\/strong><\/p>\n<p style=\"text-align: justify;\">This means a word accepts <em>Kasra<\/em> or <em>Jarr<\/em> of the nearby word even if technically it should not have been <em>Majroor <\/em>(affected by Jarr). Many of the scholars have admitted its possibility in Arabic language while some have objected to it. Those who pointed out its possibility include the grammarian al-Akhfash and Abu Ubaidah. Besides them other scholars who have pointed out its possibility include As-Samarqandi, AlBaghwi, al-Bayhaqi, An-Nasafi, Ath-Tha&#8217;albi, Jalal al-Muhalli, Ibn Jawzi, Ibn Katheer, Al-Aalusi, Ash-Shinqiti etc. [Refer to their <em>Tafaseer<\/em> under the commentary of the verse of wudu]<\/p>\n<p style=\"text-align: justify;\">Ar-Razi was one of those who totally denied any existence of it in Qur’an and so he was quoted by the Shi&#8217;as like Abdul Husain. Following are the objections of Ar-Razi:<\/p>\n<ol style=\"text-align: justify;\">\n<li>Such usage in Arabic is considered <em>Lahn<\/em> (weakness in speech).<\/li>\n<li>It is done only when there is no possibility of confusion for readers.<\/li>\n<li>It occurs without <em>‘Atf<\/em>. (I.e. waw)<\/li>\n<li>Interruption between <em>ma’toof<\/em> and <em>ma’toof alaih<\/em> by a non-relevant phrase or sentence is disliked even in common speech.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">Scholars like Mahmud al-Aalusi and Muhammad Amin Ash-Shinqiti have answered these claims in detail. I&#8217;ll be presenting the summary of their response here point by point, Insha Allah.<\/p>\n<ol style=\"text-align: justify;\">\n<li>The great grammarians like Al-Akhfash, Abul Baqa and all the specialists of Arabic language have approved of the existence of it and no one denied it except Az-Zajjaj. His denial after his affirmation of the existence of <em>Jarr ala al-Jiwar<\/em> in their speeches indicates the lack of research from his side.<\/li>\n<li>To claim that it is from the condition of <em>Jarr ’ala al-Jiwar<\/em> that the matter is not confused, is not accepted as the grammarians have not mentioned any such rule. Yes, some of them have mentioned it as a condition for the beauty in <em>Kalam<\/em> (speech) with the condition which is fulfilled here, and that is this portion which is asked to be wiped is limited with the ankles and wiping do not occur with limit in Arabic speech.<\/li>\n<li>Scholars have pointed out its occurrence even with <em>Atf<\/em>. See the Tafsir <em>Ruh al-Ma&#8217;ani<\/em> by the Mufti of Baghdad Allama Mahmud al-Aalusi and <em>Adwa alBayan<\/em> by Allama Shinqiti for examples of such usage in Arabic.<\/li>\n<li>It causes effect only when the interpolated portion is totally irrelevant which is not the case here is. Besides, examples have already been given of such usage while discussing the recitation with <em>Nasb<\/em>.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><strong><em><u>MasH<\/u><\/em><\/strong><strong><u>  here means washing<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">Another answer which many of the commentators of Quran have pointed out that مسح in reference to feet means (a little) washing. This was pointed out by Abu Zaid al-Ansari and Abu Hatim As-Sijistani among the scholars of Arabic language.<\/p>\n<p style=\"text-align: justify;\">If it is said that how could a single word in a sentence have two meanings? How مسح for head is wiping and for feet is washing in the same verse? The answer is, it is possible that real meaning of a word and its metaphorical meaning be combined in a single sentence. Quran mentions:<\/p>\n<p style=\"text-align: justify;\">يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنْتُمْ<\/p>\n<p style=\"text-align: justify;\">سُكَارَىٰ حَتَّىٰ تَعْلَمُوا مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا<\/p>\n<p style=\"text-align: justify;\">عَابِرِي سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا<\/p>\n<p style=\"text-align: justify;\">[Surat An-Nisa 43]<\/p>\n<p style=\"text-align: justify;\">“ O  you  who  have  believed,  do  not  approach  prayer  while  you<\/p>\n<p style=\"text-align: justify;\">are  intoxicated  until  you know  what  you  are  saying  or  in  a<\/p>\n<p style=\"text-align: justify;\">state  of  janabah,  except  those  passing  through  [a place  of<\/p>\n<p style=\"text-align: justify;\">prayer]&#8230;”<\/p>\n<p style=\"text-align: justify;\">In the above verse, a same word الصلاة (salaah) is used once for prayer and secondly for Masjid.<\/p>\n<p style=\"text-align: justify;\">It is also to be noted that the verse of Wudu was revealed years after the Wudu was prescribed, and hence there was no possibility for confusion. Besides the limit prescribed in the verse for the feet which is till ankles, supports this view as in Arabic limits are not given for wiping. See <em>Tafaseer<\/em> mentioned earlier.<strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The wiping is over socks<\/strong><\/p>\n<p style=\"text-align: justify;\">Many scholars have mentioned this. This is very much plausible considering the fact that a verse when comes with different <em>mutawatir<\/em> readings then both readings, by rule, are separately taken as two different verse while deriving the rulings. Hence, with <em>Nasb<\/em> it is for person under normal condition while with <em>Kasra<\/em> it is for those travelling while wearing socks.<\/p>\n<p style=\"text-align: justify;\">If it is said, what is the basis for this, the answer would be: The basis is all those narrations which mention washing for normal condition and wiping over socks, which are explicit and they are not singular reports which could be rejected by calling them mistakes or forgeries.<\/p>\n<p style=\"text-align: justify;\">Also, the basis is the verse itself where if the المسح is taken in general then it will contradict the other proven recitation. And Allah knows best.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Download this article in PDF Bismillah All praises due to Allah. May His mercy and blessings be upon Muhammad, his family and companions. This is a refutation of Shi’i contentions with regards to the act of washing the feet in Wudu. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/10\/16\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-1\/\" title=\"Washing of the Feet in Wudu: Answering Shi’i Contentions Part 1\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,12,4],"tags":[],"class_list":{"0":"post-2534","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fiqh","9":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2534","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2534"}],"version-history":[{"count":17,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2534\/revisions"}],"predecessor-version":[{"id":2572,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2534\/revisions\/2572"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2534"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2534"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2534"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}