{"id":2566,"date":"2015-10-18T11:08:21","date_gmt":"2015-10-18T11:08:21","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2566"},"modified":"2015-11-11T12:08:53","modified_gmt":"2015-11-11T12:08:53","slug":"washing-of-the-feet-in-wudu-answering-shii-contentions-part-2","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/10\/18\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-2\/","title":{"rendered":"Washing of the Feet in Wudu: Answering Shi’i Contentions Part 2"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2566\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\">Download this article in <a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/10\/Washing_feet_hadiths_part2.pdf\" target=\"_blank\" rel=\"external nofollow\">PDF<\/a><\/p>\n<p style=\"text-align: right;\">Click <a href=\"http:\/\/twelvershia.net\/2015\/10\/16\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-1\/\" target=\"_blank\" rel=\"external nofollow\">here<\/a> to read Part 1<\/p>\n<p style=\"text-align: justify;\"><strong>Part 2 &#8211; Discussion on narrations (Hadiths)<\/strong><\/p>\n<p style=\"text-align: justify;\">In this section, we shall analyse the narrations regarding washing and wiping the feet. This will be done in following steps:<\/p>\n<ol style=\"text-align: justify;\">\n<li>Authenticity and <em>Tawatur<\/em> of narrations regarding washing.<\/li>\n<li>Narrations which indicates wiping of feet.<\/li>\n<li>View of Ali b. Abi Talib<\/li>\n<li>Logical conclusion<\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><strong><u>Narrations of washing<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">Narrations of washing of feet (which is a portion from detailed description of Wudu) are so many that it can easily be termed <em>Mutawatir<\/em>. Following is the list of companions who have reported this from the Messenger of Allah (sallallahu alaihi wa sallam). I have avoided severely weak or rejected narrations even though some slightly weak narrations may have been included.<\/p>\n<p style=\"text-align: justify;\"><strong>Umar b. Khattab :<\/strong> Muslim<\/p>\n<p style=\"text-align: justify;\"><strong>Uthman b. Affan :<\/strong> Agreed upon<\/p>\n<p style=\"text-align: justify;\"><strong>Ali b. Abi Talib : <\/strong>Abu Dawud, Tirmidhi, Nasai<\/p>\n<p style=\"text-align: justify;\"><strong><a href=\"http:\/\/twelvershia.net\/2015\/01\/11\/abu-huraira\/\" rel=\"external nofollow\">Abu Hurairah<\/a> : <\/strong>Agreed upon<\/p>\n<p style=\"text-align: justify;\"><strong>Aisha Umm al-Mumineen :<\/strong> Muslim<\/p>\n<p style=\"text-align: justify;\"><strong>Mustawrid b. Shaddad : <\/strong>Abu Dawud, Tirmidhi, Tahawi.<\/p>\n<p style=\"text-align: justify;\"><strong>Abu Jubair al-Kindi :<\/strong> Ibn Hibban, Tahawi<\/p>\n<p style=\"text-align: justify;\"><strong>Abdullah b. Harith b. Jaz&#8217; :<\/strong> Ahmad, Ibn Khuzaima<\/p>\n<p style=\"text-align: justify;\"><strong>Jabir b. Abdullah :<\/strong> Ibn Majah, Ahmad<\/p>\n<p style=\"text-align: justify;\"><strong>Abdullah b. ‘Amr b. ‘Aas :<\/strong> Agreed upon<\/p>\n<p style=\"text-align: justify;\"><strong>Ibn Abbas :<\/strong> Bukhari<\/p>\n<p style=\"text-align: justify;\"><strong>Mu&#8217;awiyah b. Abi Sufyan :<\/strong> Abu Dawud<\/p>\n<p style=\"text-align: justify;\"><strong>Abu Rafe&#8217; : <\/strong>Tahawi<\/p>\n<p style=\"text-align: justify;\"><strong>Rubayyi’ bint Mu’awwidh :<\/strong> Abu Dawud<\/p>\n<p style=\"text-align: justify;\"><strong>Abdullah b. Zaid b. Aasim :<\/strong> Agreed upon<\/p>\n<p style=\"text-align: justify;\"><strong>Amr b. ‘Absah :<\/strong> Ibn Khuzaima, Hakim, Tahawi.<\/p>\n<p style=\"text-align: justify;\"><strong>Abu Malik al-Ash’ari :<\/strong> Ahmad, Ibn Abi Shaibah<\/p>\n<p style=\"text-align: justify;\"><strong>Abu Bakrah Ath-Thaqafi :<\/strong> Bazzar<\/p>\n<p style=\"text-align: justify;\"><strong>Anas b. Malik :<\/strong> Abu Dawud, Ibn Khuzaimah<\/p>\n<p style=\"text-align: justify;\"><strong>Bara b. Azib : <\/strong>Ahmad.<\/p>\n<p style=\"text-align: justify;\"><strong><u>Narrations used in support of wiping<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">(1). Abu Dawud (858), Nasai (1136) and Ibn Majah (460) narrate through Hammam from Ishaq b. Abdullah b. Abi Talha from Ali b. Yahya b. Khallad from his father from Rifa’ah b. Rafi&#8217; that the Messenger of Allah (sallallahu alaihi wa sallam) said to the person who was constantly offering his salaah in a wrong manner, “Indeed the prayer of any of you will not be accepted until he completes his Wudu as it is prescribed by Allah; hence he washes his face and hands till elbow, and wipes over his head and his feet till ankles&#8230;” And then he mentioned the full description.<\/p>\n<p style=\"text-align: justify;\">The narrators of this narration are reliable and hence the isnad of this is apparently authentic. However when we give it a closer look we see that portion describing the method of Wudu has been reported from Ishaq b. Abdullah b. Abu Talha only by Hammam.<\/p>\n<p style=\"text-align: justify;\">Let us compare the Asaneed (chains) of this tradition. This narration is narrated through Ali b. Yahya b. Khallad from his father from Rifa&#8217;ah b. Rafi&#8217; from the Messenger of Allah (sallallahu alaihi wa sallam). From Ali b. Yahya this was narrated by the following:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Muhammad b. Ajlaan: Ahmad (18997), Nasai (1313), Ibn Hibban (1787)<\/li>\n<li>Dawud b. Qais: Musannaf Abdur-Razzaq (3739), Nasai (1314), Tabrani (4520).<\/li>\n<li>Muhammad b. Ishaq: Abu Dawud (860)<\/li>\n<li>Muhammad b. Amr b. Alqamah: Ahmad (18995), Abu Dawud (859), Ibn Hibban (1787).<\/li>\n<li>Shareek b. Abi Nimr:<\/li>\n<li>Yahya b. Ali b. Yahya: Musnad Tayalisi (1469), Abu Dawud (861), Tirmidhi (302), Nasai (667).<\/li>\n<li>Ishaq b. Abdullah b. Abu Talha<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">None of the above narrators narrates it with the wording commanding to wipe the feet except for Ishaq b. Abdullah b. Abu Talha. Even from Ishaq only Hammam mentions it while Hammad b. Salmah does not mention it as it is reported by Abu Dawud (857) and others.<\/p>\n<p style=\"text-align: justify;\">Now if we look at the narration of Hammam then it appears that some narrators have included the verse of Qur&#8217;an after the statement “Do Wudu as commanded by Allah&#8230;”. This addition is not part of the hadith but rather someone (either Hammam or Ishaq himself) has included the modified form of the Quranic verse as an interpretation of the statement of the Prophet (sallallahu alaihi wa sallam).<\/p>\n<p style=\"text-align: justify;\">(2). Tahawi (1\/35) through Shareek from As-Suddi from Abd Khair from Ali regarding wiping.<\/p>\n<p style=\"text-align: justify;\">Even though Shareek is weak but still this narration doesn&#8217;t support wiping over feet in Wudu. The complete version of this has been narrated by Ahmad in Musnad (943) through the same chain of Shareek but it mentions that “This is the Wudu of the person who is still in the state of purity (Wudu)”.<\/p>\n<p style=\"text-align: justify;\">This is how it was also narrated by Sufyan Thawri from As-Suddi with the same meaning. Imam Ahmad narrated it in Musnad (970), Ibn Khuzaimah in his Sahih (200). Tahawi narrated the short version which caused the confusion.<\/p>\n<p style=\"text-align: justify;\">(3) Al-A&#8217;amash narrates from Abu Ishaq from Abd Khair from Ali. But Hafs b. Ghiyath narrates it from al-A’amash, and Hafs was one of the most reliable persons while narrating from him, with the wording “If the religion was based on analogy then the upper side of the socks were more worthy to be wiped than the bottom of it.” Yazeed b. Abdul Aziz also narrates it in similar fashion.<\/p>\n<p style=\"text-align: justify;\">But Wakee’ narrates it without mentioning “socks” although he did interpret it to mean “over the socks”. See Sunan Abu Dawud (no. 162-164)<\/p>\n<p style=\"text-align: justify;\">What we conclude from the above is that there is a huge conflict (Idhtirab or إضطراب ) in the apparent wording of this version of hadith. The hadith is normally rejected when there is significant conflict in the wording or Isnad of hadith and if we literally take this narration then this has to be rejected as well. But when the reconciliation is possible between different wordings then the hadith is not classified as weak. Here, in the above version in which wiping over feet is mentioned, reconciliation is possible as scholars, including wakee&#8217; b. Jarrah, have pointed out. They say it means the feet when it is covered by socks. This is the most plausible explanation in light of the famous opinion of Ali b. Abu Talib (which shall be discussed soon).<\/p>\n<p style=\"text-align: justify;\">The scholar of Hadith, Imam Daarqutni said after discussing differences in the wording and Isnad of this particular narration:<\/p>\n<p style=\"text-align: justify;\">وَالصَّحِيحُ مِنْ ذَلِكَ قَوْلُ مَنْ قَالَ: كُنْتُ أَرَى أَنَّ بَاطِنَ الْخُفَّيْنِ أَحَقُّ بِالْمَسْحِ مِنْ أَعْلَاهُمَا.<\/p>\n<p style=\"text-align: justify;\">وَكَذَلِكَ قَالَ حَكِيمُ بْنُ زَيْدٍ، عَنْ أَبِي إسحاق<\/p>\n<p style=\"text-align: justify;\">“The correct version from all these is that which has the wording “I used to consider the bottom of the socks more worthy to be washed than the top of it&#8230;” And this is how Hakeem b. Zaid narrate it from Abu Ishaq.”<\/p>\n<p style=\"text-align: justify;\">He further said:<\/p>\n<p style=\"text-align: justify;\">وَمِمَّا يُقَوِّي مَا ذَكَرْنَاهُ، مَا رَوَاهُ خَالِدُ بْنُ عَلْقَمَةَ، وَعَبْدُ الْمَلِكِ بْنُ سَلْعٍ، وَالْحَسَنُ بن عقبة أبو كيران، وَغَيْرُهُمْ، عَنْ عَبْدِ خَيْرٍ أَنَّ عَلِيًّا غَسَلَ قَدَمَيْهِ ثَلَاثًا، وَقَالَ: هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ<\/p>\n<p style=\"text-align: justify;\">“This view is supported by the narration reported by Khalid b. Alqama, Abdul Malik b. Sala’, Hasan b. Uqbah Abu Kairan and others from Abd Khair that Ali washed his feet thrice and said, “This is how I saw the Messenger of Allah (sallallahu alaihi wa sallam) doing”.” See Al-‘Ilal by Ad-Daarqutni (4\/45-46)<\/p>\n<p style=\"text-align: justify;\">(3). Tahawi (1\/35) reports through Ibn Abi Fudaik from Ibn Abi Dhi’b from Nafi&#8217; from Ibn Umar:<\/p>\n<p style=\"text-align: justify;\">أَنَّهُ كَانَ إِذَا تَوَضَّأَ وَنَعْلَاهُ فِي قَدَمَيْهِ , مَسَحَ ظُهُورَ قَدَمَيْهِ بِيَدَيْهِ , وَيَقُولُ: «كَانَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ هَكَذَا»<\/p>\n<p style=\"text-align: justify;\">“While performing Wudu, with his shoe covering his feet, he would wipe over the back of his feet with his hands. He used to say, ‘The Messenger of Allah (sallallahu alaihi wa sallam) used to do it in this way’.”<\/p>\n<p style=\"text-align: justify;\">Ibn Khuzaimah (199) narrated it with a different chain.<\/p>\n<p style=\"text-align: justify;\">Apparently this is authentic as all of its narrators are reliable. Scholars have different explanation regarding it. According to Imam At-Tahawi it was abrogated later on. Al-Bazzar said that this is for person renewing his Wudu.<\/p>\n<p style=\"text-align: justify;\">In any case, there is no evidence in it to support wiping over feet as this narration is for wiping over the shoe. Scholars such as Ibn Khuzaimah interpret that all of the narrations mentioning wiping over the feet while wearing the shoe are regarding that person who already has his Wudu. This is the most plausible explanation in light of authentic narrations quoted earlier which explicitly mentions that Prophet (sallallahu alaihi wa sallam) wiped over his shoe when he was in state of purity. Allah knows best.<\/p>\n<p style=\"text-align: justify;\">Besides all these, there is evidence that Ibn Umar himself used to wash his feet during Wudu as it has been reported by Tahawi (1\/41-42) through Abu Awana and Shu’bah both of who narrate it from Abu Bishr from Mujahid from Ibn Umar. Similarly, Tahawi narrates it through Ibn Majishoon from Abdullah b. Dinar from Ibn Umar. So it is illogical that Ibn Umar would publicly attribute something to the Prophet (sallallahu alaihi wa sallam) and then goes against it.<\/p>\n<p style=\"text-align: justify;\">(4) Tahawi (1\/35) narrates through Ibn Lahee’ah from Abul Aswad from Abbad b. Tamim from his uncle regarding wiping. Ibn Khuzaimah (201) has narrated it with another chain.<\/p>\n<p style=\"text-align: justify;\">Here the uncle of Abbad b. Tamim is Abdullah b. Zaid. His description of Wudu is well famous and agreed upon by all scholars and it mentions washing of feet. (See the list of companions who have narrated the washing of feet)<\/p>\n<p style=\"text-align: justify;\">So this particular and short version, if it is authentic, has to be understood and interpreted in the light of agreed upon and detailed version of Abdullah&#8217;s hadith.<\/p>\n<p style=\"text-align: justify;\"><strong><u>Wudu of the person with Wudu: <\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">If a person is in state of Wudu and wants to renew it then as per the view of Ali b. Abu Talib he just needs to wipe on his body parts of Wudu instead of washing them again. This has been reported by Sufyan Thawri and Shareek al-Qadhi from Ismail As-Suddi from Abd Khair from Ali as mentioned earlier. It was also narrated by Abdul Malik b. Maisirah from Nazzaal b. Saburah from Ali as in Musnad Ahmad (583, 1005, 1173), Sunan Nasai (130), Sahih Ibn Khuzaima (16, 202), Sahih Ibn Hibban (1057, 1340, 1341, 5326) and others.<\/p>\n<p style=\"text-align: justify;\">However in Sahih Bukhari this narration is recorded with incomplete wording which caused ignorant folks like the author of &#8220;shiapen&#8221; to claim that this was done for hiding the truth. The complete version does say that the method mentioned in this hadith is for those who are in state of purity (with Wudu). However in their ignorance they have also quoted the Musnad Tayalisi (141) which does mention the portion:<\/p>\n<p style=\"text-align: justify;\">هَذَا وُضُوءُ مَنْ لَمْ يُحْدِثْ»<\/p>\n<p style=\"text-align: justify;\">“This is the ablution of those who already have their Wudu”<\/p>\n<p style=\"text-align: justify;\"><strong><u>View of Ali bin Abi Talib<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">There is no doubt that Ali bin Abi Talib used to wash his feet. Among his companions following people reported to have seen him washing his feet during wudu:<\/p>\n<p style=\"text-align: justify;\">Husain b. Ali (ra)<\/p>\n<p style=\"text-align: justify;\">Ibn Abbas<\/p>\n<p style=\"text-align: justify;\">Zirr b. Hubaish<\/p>\n<p style=\"text-align: justify;\">Abd khair<\/p>\n<p style=\"text-align: justify;\">Abu Huyyah al-Kharifi<\/p>\n<p style=\"text-align: justify;\">The narration of Husain (ra) Imam Nasai records in Sunan (95) :<\/p>\n<p style=\"text-align: justify;\">أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ قَالَ: أَنْبَأَنَا حَجَّاجٌ قَالَ: قَالَ ابْنُ جُرَيْجٍ، حَدَّثَنِي شَيْبَةُ، أَنَّ مُحَمَّدَ بْنَ عَلِيٍّ أَخْبَرَهُ قَالَ: أَخْبَرَنِي أَبِي عَلِيٌّ، أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ قَالَ: دَعَانِي أَبِي عَلِيٌّ بِوَضُوءٍ، فَقَرَّبْتُهُ لَهُ &#8221; فَبَدَأَ فَغَسَلَ كَفَّيْهِ ثَلَاثَ مَرَّاتٍ قَبْلَ أَنْ يُدْخِلَهُمَا فِي وَضُوئِهِ، ثُمَّ مَضْمَضَ ثَلَاثًا، وَاسْتَنْثَرَ ثَلَاثًا، ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مَرَّاتٍ، ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى إِلَى الْمِرْفَقِ ثَلَاثًا، ثُمَّ الْيُسْرَى كَذَلِكَ، ثُمَّ مَسَحَ بِرَأْسِهِ مَسْحَةً وَاحِدَةً، ثُمَّ غَسَلَ رِجْلَهُ الْيُمْنَى إِلَى الْكَعْبَيْنِ ثَلَاثًا، ثُمَّ الْيُسْرَى كَذَلِكَ، ثُمَّ قَامَ قَائِمًا، فَقَالَ: نَاوِلْنِي. فَنَاوَلْتُهُ الْإِنَاءَ الَّذِي فِيهِ فَضْلُ وَضُوئِهِ فَشَرِبَ مِنْ فَضْلِ وَضُوئِهِ قَائِمًا &#8220;. فَعَجِبْتُ فَلَمَّا رَآنِي قَالَ: «لَا تَعْجَبْ؛ فَإِنِّي رَأَيْتُ أَبَاكَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ مِثْلَ مَا رَأَيْتَنِي صَنَعْتُ يَقُولُ لِوُضُوئِهِ هَذَا وَشَرِبِ فَضْلِ وَضُوئِهِ قَائِمًا»<\/p>\n<p style=\"text-align: justify;\">Ibn Juraij narrates that he heard from Shaiba from Abu Jafar al-Baqir from Ali b. Husain from his father from Husain that his Ali b. Abi Talib called him with the vessel having water for ablution&#8230;until the end of hadith which describe the ablution including the washing of feet. Finally he stood and drank the remaining water of the vessel. At the end Ali (ra) said to Husain, “Do not be astonished, for I have seen your father (the Messenger of Allah) doing just as you have seen me doing&#8230;”<\/p>\n<p style=\"text-align: justify;\">This chain is authentic and it was judged so by Sh Nasiruddin al-Albani in his rulings on Nasai. Here is a brief analysis of its narrators:<\/p>\n<p style=\"text-align: justify;\">Ibn Juraij was Thiqah, Faqih and Virtuous. He would do Tadlees but in the above narration he has clearly pointed out his hearing through the term “Haddathani”.<\/p>\n<p style=\"text-align: justify;\">Shaibah b. Nasaah was the Qadi of Madinah. Ibn Numair, Ibn Maeen, Ibn Hibban, Nasai, Ibn Saad have declared him Thiqah. [Tahdheeb al-Kamaal (12\/609)]<\/p>\n<p style=\"text-align: justify;\">All other narrators above them were reliable with agreement of scholars and they were from the Imams of Shia Imamis.<\/p>\n<p style=\"text-align: justify;\">The hadith of Ibn Abbas from Ali is recorded by Abu Dawud (117) which mentions the washing of feet. There is some dispute regarding its isnad. Shaykh al-Albani considered it Hasan.<\/p>\n<p style=\"text-align: justify;\">The hadith of Zirr b. Hubaish is in Abu Dawud (114) through Rabi’ah al-Kinani from Minhal b. Amr from Zirr b. Hubaish from Ali b. Abi Talib. Its narrators are reliable and the hadith was declared sahih by Al-Albani and Shuaib Arnaut.<\/p>\n<p style=\"text-align: justify;\">The hadith of Abd Khair is reported in Sunan and other books. Abu Dawud (111-113) and Nasai (92-94) report it through Khalid b. Alqamah from Abd Khair from Ali. Tirmidhi narrates it in Sunan (49) through Abu Ishaq from Abd Khair. This narration is authentic without any doubt.<\/p>\n<p style=\"text-align: justify;\">The hadith of Abu Hayya is also narrated in Sunan. Abu Dawud (116), Tirmidhi (49), Nasai (96,115) and Ibn Majah (456) through Abul Ahwas and others from Abu Ishaq from Abu Hayyah b. Qais from Ali (ra).<\/p>\n<p style=\"text-align: justify;\">Abu Hayyah is disputed narrator. Al-Dhahabi said he was not known, while Ibn Hajar said he was maqbool which means his narrations are acceptable if backed by other narrators. On the other hand Ibn Hibban listed him among Thiqaat and Ibn Jarud quotes from Ibn Numair that he was Thiqah. Ahmad b. Hanbal called him “shaykh”. See Tahdheeb.<\/p>\n<p style=\"text-align: justify;\">All these indicates that Abu Huyyah is a considerable narrator in light of other narrations.<\/p>\n<p style=\"text-align: justify;\">After this there remains no doubt that washing the feet was the opinion of Ali (ra) not wiping. And Allah knows best.<\/p>\n<p style=\"text-align: justify;\"><strong><u>Logical conclusion<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">We have proved in the previous section that Quranic verse do not necessarily support the practice of wiping over the feet during ablution. One of the two famous recitations clearly supports washing of feet while the other recitation may or may not support washing. But based on other internal and external factors we can be sure that it doesn&#8217;t rule out washing. This has been proven in enough details in the first section.<\/p>\n<p style=\"text-align: justify;\">When we look at the second source of Islamic laws (Hadith) then we see that washing was a prevalent practice during the time of the Messenger of Allah (sallallahu alaihi wa sallam) and after him. There are so many witnesses to it that it cannot be claimed that it was a false attribution on the Prophet (sallallahu alaihi wa sallam). Only very selected narrations have been reported about wiping as a Sunnah but they have their defects which doesn&#8217;t qualify them to stand against a practice which was reported in Mutawatir form. I have clarified it in the second section.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Download this article in PDF Click here to read Part 1 Part 2 &#8211; Discussion on narrations (Hadiths) In this section, we shall analyse the narrations regarding washing and wiping the feet. This will be done in following steps: Authenticity <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/10\/18\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-2\/\" title=\"Washing of the Feet in Wudu: Answering Shi’i Contentions Part 2\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,12,1],"tags":[],"class_list":{"0":"post-2566","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fiqh","9":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2566","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2566"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2566\/revisions"}],"predecessor-version":[{"id":2739,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2566\/revisions\/2739"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2566"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2566"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2566"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}