{"id":2581,"date":"2015-10-20T02:59:05","date_gmt":"2015-10-20T02:59:05","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2581"},"modified":"2015-11-11T12:17:17","modified_gmt":"2015-11-11T12:17:17","slug":"further-refuting-rts-on-this","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/10\/20\/further-refuting-rts-on-this\/","title":{"rendered":"Further refuting RTS on this"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2581\" alt=\"\" \/>What we warned our readers from seems to have happened, we said that the Rafidah have a bad habit of altering their articles after they&#8217;ve been refuted and we saw that RTS did just that to their article on the &#8220;<a href=\"http:\/\/twelvershia.net\/2013\/06\/07\/response-to-rafidi-companion-of-the-prophet-saw\/\" rel=\"external nofollow\">Rafidi Companion of the Prophet (saw)<\/a>&#8220;, so let us go through their objections to our article very quickly.<\/p>\n<p><strong>Objection One:<\/strong><\/p>\n<p>RTS seems to not care how they translate their Arabic so when we corrected them they said:<\/p>\n<p><span style=\"color: #ff0000;\">((It is not of great significance whether Zaid ibn Arqam said either, since it does not change the context in which it was said.))<\/span><\/p>\n<p>Although in reality it does, as one expression is very different from the other and it makes the text appear a lot more dramatic.<\/p>\n<p><span style=\"color: #ff0000;\">((Imam Alee (a.s) reminded people of the incident of Ghadeer 23 years after the demise of the Prophet (saw).))<\/span><\/p>\n<p>This proves that `Ali did not believe this to be related to his leadership, otherwise he should have reminded them of it during Abu Bakr&#8217;s reign on the first day after the Prophet&#8217;s (saw) demise. He reminded them of it only during the Fitnah when some Muslims fought him and cursed him, so he reminded them that if they loved the Prophet (saw) they must also love him as their love and friendship are tied.<\/p>\n<p><span style=\"color: #ff0000;\">((It is clear that Zaid ibn Arqam was emphasising that there is nothing to be surprised about and that he heard the Prophet (saw) giving the right of successorship to Imam Alee (a.s).))<\/span><\/p>\n<p>No, it isn&#8217;t clear nor were the words &#8220;leadership\/successorship&#8221; even mentioned in the text. Zayd only asked abu al-Tufayl why he found it strange and then affirmed that he heard it from the Messenger (saw). If it was related to leadership then Zayd should not have asked him why he found it strange, it would have been clearly justified to find something like this strange since `Ali in that scenario would have been a divinely appointed leader and this means the entire nation was misguided and sinful for choosing Abu Bakr, `Umar and `Uthman over him. Besides, are RTS implying that the people fighting alongside `Ali were dying a death of Jahiliyyah as they didn&#8217;t know the divine right of `Ali? So RTS uses guesswork and conjecture to assume that this was referring to leadership without solid evidence, while we say it didn&#8217;t refer to leadership based on our historical and linguistic reading.<\/p>\n<p><span style=\"color: #ff0000;\">((Holy Qur&#8217;aan {9:71} If Imam Alee (a.s) was referring to ordinary friendship and Aboo Tufayl (r.a) understood this as mere friendship, then this verse already states that the believing men and women are protecting friends of one and another.))<\/span><\/p>\n<p>Except that the verse is general and the Hadith is specific to `Ali ibn abi Talib and shows that his love and friendship is tied directly to that of the Prophet (saw), thus it is a very big deal to know this narration yet still hold enmity towards him as his opponents from banu Umayyah and the Khawarij did. This narration also affirms that `Ali is a true believer and that he will be on the correct path whereas any regular Muslim can or cannot be a true believer, he may even be a hypocrite. After learning this major Hadith abu al-Tufayl found it odd that Mu`awiyah and the Harouriyyah were opposing him and fighting him.<\/p>\n<p>Secondly, Ghadeer happened in the time when some believers showed enmity and hatred towards `Ali due to the events in Yemen, so even if verse {9:71} already established this matter yet the circumstances required for the Prophet (saw) to remind them of it in a way that they will never forget. Reminding the believers of what benefits them and grants them success is a divine order:<\/p>\n<p>{So remind, if the reminder should benefit} [87:9]<\/p>\n<p>{So remind, [O Muhammad]; you are only a reminder.} [88:21]<\/p>\n<p>{We know very well what they say; thou art not a tyrant over them. Therefore remind by the Qur&#8217;an him who fears My threat.} [50:45]<\/p>\n<p>Since RTS are using a Qur&#8217;anic verse that illustrates that the word Mawla meant friendship and love between the believers, then why don&#8217;t they also bring out a verse that shows `Ali&#8217;s appointment? Or is the Muwalat of the believers more important that Allah would mention it and then ignore `Ali&#8217;s divine right?<\/p>\n<p><strong>Objection Two:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">((It is indeed amazing that our opponents are suggesting that Imam Alee (a.s) was ignorant as to why people referred to him as Maula, and sought clarity from those that referred to him with this moniker.))<\/span><\/p>\n<p>We aren&#8217;t suggesting, this was the clear text of the report. Or are you suggesting that `Ali asks useless questions? Why in the world would he ask a silly rhetorical question? What is he testing their proficiency in Arabic when they&#8217;re pure Arabs who know full well what they&#8217;re saying?<\/p>\n<p>Imagine if the believers said to the Prophet (saw): &#8220;Peace be upon you O messenger.&#8221; Then he (saw) replies with a silly rhetorical question: &#8220;What do you mean by messenger? Do I carry letters from city to city?&#8221; Then they reply: &#8220;No, no, we meant you&#8217;re a messenger of God!&#8221;<\/p>\n<p>That is a silly scenario that only an ignorant would conjure in his empty head. The fact that this happened shows that the usage of the word was not clear at all which supports the view of the Muslims and humiliates the Rafidah.<\/p>\n<p><span style=\"color: #ff0000;\">((The fact is, Imam Alee (a.s) posed this rhetorical question so that the response would serve as clear evidence of his being the individual that inherited the authority to rule over the Ummah following the death of the Prophet (saw). Imam Alee (a.s) posed the question beautifully, &#8220;How can I be your Master when you are Arabs (free men?)&#8221; By doing so, he was pointing out that one meaning of Maula is Master, wherein the context is between a Master and his slave. The authority that a Master possesses over his slave is that of absolute authority, the slave is subservient to his every instruction))<\/span><\/p>\n<p><span style=\"color: #333333;\">Again, by saying this was rhetorical, RTS show that they don&#8217;t accept the apparent meaning of the text and wish to give it their own special twist based on conjecture and guesswork. We say: Taking the apparent meaning of a text is much wiser and closer to the truth than twisting the words and imagining what hidden meanings it could carry since religion is built upon what is clear not what is vague.<\/span><\/p>\n<p>Secondly, they said that `Ali was our owner and we are his slaves and this is incorrect as Islam came to free humanity from slavery and saying that we are in the position of his slaves would make no sense as that would entail a great confusion since we&#8217;d be all slaves for the same person and therefore we could not marry each-other nor could we give charity etc&#8230; as slaves are not allowed to do so in Islamic Fiqh. To conclude, we are neither the Prophet&#8217;s (saw) slaves nor `Ali&#8217;s slaves and so to understand the word Mawla as &#8220;Master of a slave&#8221; is evidence that `Ali had no clue what they meant and that the usage of this word was not explicit at all.<\/p>\n<p>Thirdly, to accuse the Prophet (saw) of using such unclear words that carry countless meanings in order to announce something as important as divine successorship is in itself an insult to the Prophet (saw) and his message so ponder on this dear reader.<\/p>\n<p><span style=\"color: #ff0000;\">((Imam Alee (a.s) therefore in his infinite wisdom))<\/span><\/p>\n<p>Since when was his wisdom infinite? What is he a god?<\/p>\n<p><span style=\"color: #ff0000;\">((The fact that the men clarified why Imam Alee (a.s) had authority over them and that he (a.s) did not interject to refute their understanding of Maula, evidences the fact that it was indeed Alee (a.s) who was given the mantle of leadership and authority over the Ummah at Ghadeer Khumm.))<\/span><\/p>\n<p><span style=\"color: #333333;\">Again RTS is hallucinating, none of this was even mentioned in the report. The entire incident is that of a group of men (including abu Ayyoub) referred to `Ali with the word &#8220;Mawla&#8221;, `Ali asked how can they say this if they&#8217;re free-men from the Arabs, they clarified that they meant it in the context of the Prophet&#8217;s (saw) words. RTS without providing evidence argued that they meant leadership, we disagree and our evidence is that abu Ayyoub was later a soldier in Mu`awiyah&#8217;s army under Yazid&#8217;s command as is recorded in history books, therefore he doesn&#8217;t believe in divine Imamah (Check his biography in al-Siyar).<\/span><\/p>\n<p><strong>Objection Three:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">((The opponents go out of their way to assert that every Hadeeth stating Imam Alee (a.s) as being the Maula\/Wali means &#8216;friend.&#8217; As we discussed earlier, this term has a plethora of meanings and it must be understood according to the context it is applied in.))<\/span><\/p>\n<p>RTS admits that the word Mawla is not of one specific meaning therefore cancelling his own argument that in Ghadir it had to mean leadership.<\/p>\n<p>We also say in Hadith al-Ghadir Mawla never meant leadership as that opposes a plethora of narrations and the Seerah of `Ali who openly said in Sahih al-Bukhari to his uncle that he is unsure who the leader will be after the messenger&#8217;s (saw) passing. It also is an insult to `Ali who would never be silent if he knew the Prophet&#8217;s (saw) will was being cancelled and Allah&#8217;s orders being disobeyed, `Ali would have died while fighting any usurper in this case especially if the usurpers are weak cowards who flee at the first sign of danger as the Rafidah claim.<\/p>\n<p><strong>Objection Four:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">(( In terms of the narrator, &#8216;Ma&#8217;rouf bin Khurboudh&#8217; he was weakened by ibn Ma&#8217;een however later he changed his position about him.))<\/span><\/p>\n<p>RTS here show us that they&#8217;re deceitful liars, they write that ibn Ma`in changed his mind here:<\/p>\n<p><span style=\"color: #ff0000;\">((Ma&#8217;rouf bin Khurboudh Al-Makki, narrated from Abi Tufayl and Al-Baqir from Aboo Dawood, and Abu Asim and Ibn Ma&#8217;een has weakened him, but he has changed his view, and Aboo Hatim said: He wrote his hadeeth.))<\/span><\/p>\n<p>Although the Arabic text states:<\/p>\n<p>ضعفه ابن معين و قواه غيره<\/p>\n<p>This means: &#8220;Ibn Ma`in weakened him and others strengthened him&#8221;<\/p>\n<p>It doesn&#8217;t say Ibn Ma`in changed his view as was deceptively written by RTS.<\/p>\n<p>Also when a scholar says that someone&#8217;s Hadith is &#8220;written&#8221; or &#8220;we wrote his Hadith&#8221; it still means the person is weak, and that if he narrates something without support from other narrators then it is dropped. Thus the Hadith is still weak and so is RTS&#8217;s entire argument.<\/p>\n<p><strong>Objection Five:<\/strong><\/p>\n<p>This objection is silly so we&#8217;ll disregard it completely.<\/p>\n<p><strong>Objection Six:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">((We are not suggesting that the knowledge disclosed to Imam Alee (a.s) was secret in that he (a.s) was party to aspects of the Deen unbeknown to others.))<\/span><\/p>\n<p>RTS claims this and this is incorrect and opposes Shiite faith, RTS should ask his scholars before uttering rubbish since it is an integral part of Tashayyu` to believe that the Imams had secret books and knowledge from the Prophet (saw). Heck it is claimed in their books that the Imams had Suhuf with the names of all their Shia until the day of judgement, or the name of all kings who will rule and so on and so forth&#8230; Abu al-Tufayl just denied this and proved that he wasn&#8217;t an Imami deviant.<\/p>\n<p>RTS then goes on to discuss `Ali&#8217;s knowledge and this has nothing to do with abu al-Tufayl being a Rafidi deviant or not.<\/p>\n<p>As for other people &#8220;daring&#8221; to claim vast knowledge, we mentioned that as stated previously in the main refutation. We add, Ibn Mas`oud said: &#8220;I do not know anyone alive who knows more than me about Allah&#8217;s book.&#8221; And abu Dharr said: &#8220;The Prophet (saw) never left us until there wasn&#8217;t even a bird in the sky that we didn&#8217;t have knowledge regarding it.&#8221; And these men died in `Ali&#8217;s time.<\/p>\n<p><strong>Objection Seven:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">((It is common sense that if one persistently demands something from another person and that individual through their stubbornness dismisses that demand, there will come a point where a line will be drawn on the issue while desisting from making any further demands and it will be said, &#8220;Enough is enough!&#8221; The decision not to appeal any further, in no way means that one has accepted that person’s viewpoint.))<\/span><\/p>\n<p>Well the narration quoted does not show that Fatimah was persistent or that she asked more than once, in fact it only shows that she asked one time and then accepted Abu Bakr&#8217;s judgement. As usual RTS include their own fiction into every narration and start concluding things that aren&#8217;t even part of the main text of that Hadith.<\/p>\n<p>As for this narration it is discussed in detail here under this title:<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/2014\/05\/08\/prophetic-inheritance-qa\/\" rel=\"external nofollow\">WHAT IS THE OPINION ON THE NARRATION WHERE FATIMAH REPLIES TO ABU BAKR WITH “You know best”?<\/a><\/p>\n<p>We show above what is the judgement on the first part of the narration which says &#8220;His family inherited him.&#8221;<\/p>\n<p><strong>Objection Eight:<\/strong><\/p>\n<p>RTS weakens a narration although in his article a few of the narrations he uses are weak, so he shows his double standard by suddenly becoming academic and trying to weaken the chain of al-Hasan&#8217;s Hadith.<\/p>\n<p>Then again RTS make their own analysis and reject what is clear from the meaning of the narration and use some lame excuse as to why al-Hasan didn&#8217;t mean the actual Raj`ah they believe in rather he meant some other Raj`ah.<\/p>\n<p><strong>Objection Nine:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">((As for the argument that Imam Alee (a.s) was not referring to himself since he did not die twice from separate blows and thereafter come to life on each occasion, it is not necessary that the similiarity needs to be identical to the letter. ))<\/span><\/p>\n<p>RTS shoot themselves in the leg by just writing the above and therefore we say: Yes, since it doesn&#8217;t have to be to the letter then `Ali will also not return after his death and the similitude ends with `Ali being struck twice in battle while calling people towards his Lord.<\/p>\n<p>So when RTS say:<\/p>\n<p><span style=\"color: #ff0000;\">((By the same token, we will likewise argue that Imam Alee (a.s) was highlighting a similarity between him and Dhu-Al-Qurnayn, whilst not necessarily to the same letter, but the similarity existed as in he would succumb to blows to the head and would be resurrected in the future.))<\/span><\/p>\n<p>We say to them, who told you that the similitude includes the resurrection? How can you be certain that abu al-Tufayl meant this? Fact is, you aren&#8217;t certain and so this accusation against abu al-Tufayl fails.<\/p>\n<p><strong>Objection Ten:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">((We have no qualms on Al-Shareef Al-Murtada&#8217;s statement. It is well known that the vast majority of companions of Imam Alee (a.s) believed in the leadership of Aboo Bakr, Umar and Uthman. The term &#8216;Shi&#8217;ee&#8217; in early history did not carry the same connotation that it does today. Earlier Sunnis were also once referred to as Shi&#8217;a.))<\/span><\/p>\n<p>RTS shoots himself another time by admitting this and based on this we tell them: abu al-Tufayl is a Sunni who sided with `Ali politically, not a deviant Kaysani as your narrations claim.<\/p>\n<p>So far RTS has presented no new argument other than just arguing back uselessly without evidence, the only time they presented a new argument based on evidence and not guesswork it turns out they were lying as you witnessed previously.<\/p>\n<p>RTS then continues his lame romantic story with this:<\/p>\n<p><span style=\"color: #ff0000;\">((During that era of upheaval one of the last remaining companions of the Prophet (saw) was a witness to a sermon that would later change his life))<\/span><\/p>\n<p>They then mention `Ali&#8217;s sermon where he mentioned al-Ghadeer, we previously stated that we disagree on their understanding of it so we say: No, nothing changed in abu al-Tufayl&#8217;s life.<\/p>\n<p><strong>Objection Eleven:<\/strong><\/p>\n<p>RTS simply mentions the narration of Ghadeer and that of <a href=\"http:\/\/twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\" rel=\"external nofollow\">Thaqalayn<\/a>, we have refuted these sufficiently in these links.<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/2014\/11\/01\/rasul-allah-saw-and-the-divine-order-of-imamah\/\" rel=\"external nofollow\">Rasul-Allah (saw) and the divine order of Imamah<\/a><\/p>\n<p><a href=\"http:\/\/twelvershia.net\/2014\/11\/13\/rasul-allah-saw-and-the-future-of-the-ummah\/\" rel=\"external nofollow\">Rasul-Allah (saw) and the future of the Ummah<\/a><\/p>\n<p><a href=\"http:\/\/twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\" rel=\"external nofollow\">An In-Depth Study of Hadithul Thaqalayn<\/a><\/p>\n<p>Also in the end the liar from RTS says:<\/p>\n<p><span style=\"color: #ff0000;\">((What is even more interesting is that Bukhari abandoned the narrations of Aboo Al-Tufayl and stopped narrating from him and anything else which was inclined towards Tashayyu.))<\/span><\/p>\n<p>This is a lie, al-Bukhari narrates from him in the Sahih (Refer to Fath-ul-Bari 1\/225 #127) and also narrates several reports from him in his book al-Adab al-Mufrad.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>What we warned our readers from seems to have happened, we said that the Rafidah have a bad habit of altering their articles after they&#8217;ve been refuted and we saw that RTS did just that to their article on the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/10\/20\/further-refuting-rts-on-this\/\" title=\"Further refuting RTS on this\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-2581","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2581","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2581"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2581\/revisions"}],"predecessor-version":[{"id":2747,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2581\/revisions\/2747"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2581"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2581"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2581"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}