{"id":2600,"date":"2015-10-23T19:21:22","date_gmt":"2015-10-23T19:21:22","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2600"},"modified":"2018-10-30T14:56:52","modified_gmt":"2018-10-30T14:56:52","slug":"issues-of-ghaybah-part-14","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/10\/23\/issues-of-ghaybah-part-14\/","title":{"rendered":"Issues of Ghaybah [Part-15] &#8211; The excuse as to why we must believe our leader was a kid"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2600\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon this nation and its Prophet,<\/p>\n<p style=\"text-align: justify;\">In this fifteenth part, we will discuss the matter of the young age of the 12th Imam when he received authority and was supposed to lead all of humanity. By doing so we will be refuting Shiite preachers like al-Mufid and al-Murtada who are known for using lame excuses to argue against their opponents.<\/p>\n<p style=\"text-align: justify;\">Today&#8217;s Shia believe that their current leader was a five year old boy. As far as this sect being one that claims &#8220;Lutf&#8221; or divine grace, they fail miserably in this case since if this concept was indeed existent then Allah would only allow a capable mature man to lead humanity. This is for a simple reason, which is that the human intellect will reject the idea of a small kid being the leader of all humanity, since kids are not wise, they aren&#8217;t intelligent, they are not physically able to bear the burdens of the message and they are completely unreliable.<\/p>\n<p style=\"text-align: justify;\">Therefore, if a five year old came to you and claimed he was the divine leader of humanity and the best human alive (as that is from the conditions of Imamah according to them), any normal person would smile at the kid and walk away, this of course means that God&#8217;s plan would not be fulfilled and the guidance would not reach anybody nor would they benefit from this divine leader. This contradicts &#8220;lutf&#8221; because God knows that men will never be convinced that God would choose a small kid as divine leader and thus they would be much less likely to believe in him than if he was an old man. This is similar to God appointing a famous liar to be a divine leader, that would contradict &#8220;Lutf&#8221; as God knows that men aren&#8217;t going to follow his teachings and guidance since the chosen one was popular for his lies and trickery.<\/p>\n<p style=\"text-align: justify;\">Since Twelvers believe in this ridiculous hidden five year old&#8217;s divine leadership, they sought to justify it. They searched for precedents of young boys being appointed as Prophets in past nations and they stumbled upon Sulayman, `Isa and Yahya peace be upon them.<\/p>\n<p style=\"text-align: justify;\">We will look into these stories and see if there are any similarities and we will rely on the most popular Islamic source when it comes to stories of the Prophets which is &#8220;Qasas-ul-Anbiya'&#8221; by al-Hafidh Ibn Kathir.<\/p>\n<p style=\"text-align: justify;\"><strong>Sulayman bin Dawoud (as):<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>{And Sulayman inherited Dawoud. He said, &#8220;O people, we have been taught the language of birds, and we have been given from all things. Indeed, this is evident bounty.&#8221; &#8211; And gathered for Solomon were his soldiers of the jinn and men and birds, and they were [marching] in rows.} [27:16-17]<\/strong><\/p>\n<p style=\"text-align: justify;\">When Sulayman (as) was at his father&#8217;s funeral, in the presence of thousands of his subjects from farmers and religious men and soldiers, he ordered the birds to shade his father and the people in attendance from the sun and so the sky was covered with birds. Sulayman (as) was only one of Dawoud&#8217;s (as) many children, but he was a chosen prophet and he was his father&#8217;s heir as was popular to all and nobody competed with him.<\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">We notice that there is no relation between this story and that of the 12th Shiite Imam. Slayman (as) was made king after his father passed and he had pointed to him during his life and his kingdom was vast and his matter was known. Sulayman (as) was a prophet of God, he had signs and miracles and the people followed him after his father Dawoud (as).<\/span><\/p>\n<p style=\"text-align: justify;\">Was Sulayman&#8217;s (as) birth secret? No. Was the child hidden by his father out of fear for him? No. Did the child go into occultation at the age of five? No. Did God expect Dawoud&#8217;s (as) people to believe that he had a secret hidden son that nobody saw or heard of nor did anyone observe his mother&#8217;s pregnancy? No. Then it goes without saying that God would not expect from them to believe that this little hidden child is their leader and the divine ruler of humanity.<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"line-height: 1.5;\">`Isa bin Mariyam (as):<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>{So she pointed to him. They said, &#8220;How can we speak to one who is in the cradle a child?&#8221; &#8211; [`Isa] said, &#8220;Indeed, I am the servant of Allah. He has given me the Scripture and made me a prophet.&#8221;} [19:29-30]<\/strong><\/p>\n<p style=\"text-align: justify;\">`Isa&#8217;s (as) story is famous, he was born without a father and when he was born the idols of the pagans were all crushed and demolished miraculously, and then his mother brought him publicly in front of her people and Allah granted him the miracle of speech in a way that no intelligent man had any doubts about his prophet-hood except a stubborn disbeliever. Then as an adult he was known by the tribes in those lands and he performed miracles and revived the dead by Allah&#8217;s command and he was a prophet of guidance for his people.<\/p>\n<p style=\"text-align: justify;\">`Isa (as) only feared his Lord and he fulfilled his mission and finally when faced with his enemies and certain death, Allah raised him and protected him.<\/p>\n<p style=\"text-align: justify;\">We notice that there is no relation between this story and that of the 12th Shiite Imam. `Isa&#8217;s (as) prophet-hood was popular and public and he was not hidden, and Allah does not expect the people to believe that a young child can be a prophet or guide so He blessed him with miracles so that nobody may deny his status.<\/p>\n<p style=\"text-align: justify;\">Did Mariyam (as) hide the fact that she had a baby? No. Did she hide the baby after he was born? No. Did the secret baby then go into occultation and disappear from his people completely without a trace after his mother&#8217;s death? No. Did Allah expect the people to take her word seriously when she claimed she had a baby of divine origins? No, Allah made sure to make the matter known and popular through miracles and signs so that no one may deny and `Isa (as) was popular among his people.<\/p>\n<p style=\"text-align: justify;\"><strong>Yahya bin Zakariya (as):<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>{[Allah] said, &#8220;O Yahya, take the Scripture with determination.&#8221; And We gave him judgement [while yet] a boy} [19:12]<\/strong><\/p>\n<p style=\"text-align: justify;\">Prophet Zakariya (as) when he reached old age wished for a son to succeed him in prophet-hood and continue his mission after his death. Allah then told Yahya (as) when he was at the age of youth to adhere to the book of Musa (as), the Torah, and to follow its teachings. Allah then bestowed upon Yahya (as) a good understanding of those scriptures and blessed him with wisdom. Yahya (as) was the only sinless human, he committed no sins by Allah&#8217;s will and through His protection and this was a miracle that was exclusive to him. Yahya (as) and `Isa (as) were cousins, and `Isa (as) would ask Yahya (as) for advice and benefit from him and their mothers were pregnant with them at the same time. Yahya (as) was also known as the most beautiful man of his time, so when the woman of the king of that land tried to seduce him, he refused and so she ordered his execution. The men came to him as he prayed alongside his father Zakariya (as) and they took him and murdered him.<\/p>\n<p style=\"text-align: justify;\">We notice that there is no relation between this story and that of the 12th Shiite Imam. Here we have a prophet of God, who asked God to bless him with a son, so God blessed him with a son who was a prophet, the son was pious and wise at a young age and he accompanied his father as he grew and aided him until he was murdered.<\/p>\n<p style=\"text-align: justify;\">Did Yahya (as) have a secret birth? No. Did Zakariya (as) hide his son so that no one may know of him? No. Did Yahya (as) disappear in his childhood and never be heard from again? No. As opposed to this, Yahya&#8217;s (as) prophet-hood was public and he was popular among his people for his wisdom and piety and he never went into any form of occultation even when faced with the danger of death.<\/p>\n<p style=\"text-align: justify;\">Were the people required to believe that Yahya (as) was the leader of humanity at the age of five? The answer is No, rather he was a young blessed boy who helped his father until he later died in his father&#8217;s life and none of the pious believers had any confusion regarding his divine mission or prophet-hood.<\/p>\n<p style=\"text-align: justify;\">Did God order the people to believe in a hidden boy and accept him as their divine leader, a child they never met, a child they never saw any signs from, a child who was concealed from them constantly and they could not derive any benefit from him in their worldly or religious affairs?<\/p>\n<p style=\"text-align: justify;\">Certainly Not!<\/p>\n<p style=\"text-align: justify;\">(PS. notice how Shia scream that it&#8217;s unwise for the Prophet (saw) to entrust the matter of leadership after him to his trusted Companions and disciples so they may pick a qualified man from among them who pleases Allah, yet they don&#8217;t find it unwise to leave the fate of the nation in the hands of a cowardly five year old kid.)<\/p>\n<p style=\"text-align: justify;\">Allah is the source of success and peace be upon our Prophet and his family and companions.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon this nation and its Prophet, In this fifteenth part, we will discuss the matter of the young age of the 12th Imam when he received <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/10\/23\/issues-of-ghaybah-part-14\/\" title=\"Issues of Ghaybah [Part-15] &#8211; The excuse as to why we must believe our leader was a kid\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-2600","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2600","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2600"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2600\/revisions"}],"predecessor-version":[{"id":4438,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2600\/revisions\/4438"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2600"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2600"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2600"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}