{"id":264,"date":"2013-05-02T00:54:11","date_gmt":"2013-05-02T00:54:11","guid":{"rendered":"http:\/\/twelvershia.net\/?p=264"},"modified":"2013-05-04T20:50:07","modified_gmt":"2013-05-04T20:50:07","slug":"response-to-alee-a-s-the-master-of-every-believer","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/05\/02\/response-to-alee-a-s-the-master-of-every-believer\/","title":{"rendered":"Response to: Alee (a.s) The Master of Every Believer"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=264\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>Response to: Alee (a.s) The Master Of Every Believer<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response by Farid to the article on RevisitingtheSalaf.org, entitled: Alee (a.s) The Master of Every Believer, which was published on the 16<sup>th<\/sup> of April, 2012, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/04\/alee-as-is-your-wali.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">Bismillah Alrahman Alraheem,<\/p>\n<p style=\"text-align: justify;\">In this article we will examine the famous narration of:<\/p>\n<p style=\"text-align: justify;\">علي ولي كل مؤمن بعدي<\/p>\n<p style=\"text-align: justify;\">Rough translation: &#8220;Ali is the Wali of every believer <span style=\"text-decoration: underline;\">after me<\/span>.&#8221;<\/p>\n<p style=\"text-align: justify;\">The term Wali, has multiple meanings, including: ally, friend, supporter, guardian and even master. The Shias, in this narration believe that it means that Ali is the master of all the believers. In this article, I will be proving that this narration is weak, even though I will admit that many Sunni scholars have accepted it as authentic, those that did however did not explain the word &#8220;Wali&#8221; as political leader or Khalifah.<\/p>\n<p style=\"text-align: justify;\">RTS says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Just like many of the present day Nawaasib, their foundering father ibn Taymiyyah had indigestion accepting Imam Alee (a.s) as the master of every believer after the Prophet (saw). This Naasibee attempts to cast doubts in regards to the authenticity of those Hadeeths. He has spewed his venom against the Ahlulbayt (a.s) which is rather apparent and this, just being a prime example of that. Insha&#8217;Allah Ta&#8217;ala, we shall investigate whether the narrations in regards to, &#8216;Alee is the Wali&#8217; are authentic or fabrications as claimed by some past and present day Nawaasib. But firstly, it is important to establish why ibn Taymiyyah rejected such narrations. The reason is clear, and that is because he insisted that the word &#8220;Wali&#8221; or &#8220;Mawla&#8221; in the Hadeeth about Imam Alee (a.s) meant &#8220;friendship.&#8221; If this was the case, then the words &#8220;after me&#8221; do not make sense, as Alee (a.s) was a friend of the Muslims during the life of the Prophet (saw) and after him. And it is on this point that ibn Taymiyyah casts doubt on the authenticity of those Hadeeths in which the Prophet (saw) said: &#8220;Alee is your Wali after me.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">As an objective Muslim, I have no problems with accepting that Ali was the master of the believers, nor does it cause me indigestion. I accept his narrations and I am proud to be a follower of his teachings. However, the authenticity of the narration is a completely different story. Without further ado, onto the evidence:<\/p>\n<p style=\"text-align: justify;\">For some odd reason RTS starts off by quoting this:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Ibn  Sa&#8217;d:<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> In a discussion between a Rafidhi and supposedly Hasan ibn Al-Hasan:<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\">فقال له الرافضي ألم يقل رسول الله عليه السلام لعلي من كنت مولاه فعلي مولاه؟ فقال أما والله أن لو يعني بذلك الامرة والسلطان لأفصح لهم بذلك كما أفصح لهم بالصلاة والزكاة وصيام رمضان وحج البيت ولقال لهم أيها الناس هذا وليكم من بعدي <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> The Rafidhi said: &#8216;Did not the Messenger of Allah (saw) say to Alee (a.s): &#8220;Whomever I am his Master (Mawla) then Alee is his Master (Mawla)?&#8221;&#8216; He said: &#8216;By Allah (swt), if he meant by that the leadership, then he should have clarified that, like he clarified the issue of Salat and Zakat and fasting in Ramadan and the Hajj of the House. He should have rather said: &#8220;O people this is your Master (Wali) after me&#8221;&#8216;.<\/span><\/p>\n<p>Source: Tabaqat Ibn Sa&#8217;d. Vol. 7, Pg. # 314.<\/p>\n<p style=\"text-align: justify;\">RTS thought that by quoting Al-Hasan bin Al-Hasan bin Ali bin Abi Talib’s denial of the addition “after me” would be evidence for his case. Instead, this is perhaps the strongest evidence that no such thing was mentioned by the Prophet (pbuh), for if the very grandson of Ali himself denied such a thing, then how can Ibn Taymiyyah or even myself be considered as Nasibi for doing the same?! Is it likely that the grandson of Ali was not aware of this fact, and that Ja’afar bin Sulaiman Al-Dhuba’ee was? No, it certainly is not.<\/p>\n<p style=\"text-align: justify;\">RTS goes on to quote the narrations:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Hadeeth itself which goes through Ja&#8217;far Ibn Sulaiman.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><br \/>\nImam Ahmad ibn Hanbal:<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\">حدثنا عبد الرزاق , وعفان المعنى , وهذا حديث عبد الرزاق قالا : ثنا جعفر بن سليمان ، قال : حدثني يزيد الرشك ، عن مطرف بن عبد الله ، عن عمران بن حصين ، قال : بعث رسول الله صلى الله عليه وسلم سرية وأمر عليهم علي بن أبي طالب رضي الله تعالى عنه فأحدث شيئا في سفره ، فتعاهد , قال عفان : فتعاقد أربعة من أصحاب محمد صلى الله عليه وسلم أن يذكروا أمره لرسول الله صلى الله عليه وسلم ، قال عمران : وكنا إذا قدمنا من سفر بدأنا برسول الله صلى الله عليه وسلم فسلمنا عليه ، قال : فدخلوا عليه ، فقام رجل منهم ، فقال : يا رسول الله ، إن عليا فعل كذا وكذا ، فأعرض عنه ، ثم قام الثاني ، فقال : يا رسول الله ، إن عليا فعل كذا وكذا ، فأعرض عنه ، ثم قام الثالث ، فقال : يا رسول الله ، إن عليا فعل كذا وكذا ، فأعرض عنه ، ثم قام الرابع , فقال : يا رسول الله ، إن عليا فعل كذا وكذا ، قال : فأقبل رسول الله صلى الله عليه وسلم على الرابع , وقد تغير وجهه ، فقال : &#8221; دعوا عليا ، دعوا عليا ، دعوا عليا ، إن عليا مني وأنا منه ، وهو ولي كل مؤمن بعدي &#8221; .<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Abdulrazaq and Affan narrated from Ja’far ibn Sulaiman from Yazid Al-Rashk from Motref ibn Abdullah from Imran ibn Hussain who said: The Messenger of Allah (saw) had sent an army with Alee ibn Abi Taalib as their commander to Yemen and he did something in that mission. Affan said: &#8216;Then four companions of the Messenger of Allah decided and agreed to report it to the Messenger of Allah (saw).&#8217; Imraan said: When we came back we met the Messenger of Allah (saw) and saluted him. He said: One of those companions stood up and said: O Messenger of Allah (saw), Alee (a.s) did such and such, the Prophet (saw) turned his face from him, then the second one stood up and said: O Messenger of Allah (saw), Alee did such and such, the Messenger of Allah turned his face from him, then the third one stood up and said: O Messenger of Allah (saw), Alee did such and such, the Messenger of Allah (saw) turned his face from him too, then the fourth one stood up and said: O Messenger of Allah (saw), Alee did such and such, the Messenger of Allah turned to them and said: &#8220;Leave Alee (a.s) alone he is from me and I am from him and he is Wali of every believer after me.&#8221;<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Footnote: Ahmad Mohammad Shaker comments on this Hadeeth and says: &#8216;The chain of this hadeeth is Saheeh (Authentic), and Yazid Al-Rashq is ibn Abi Yazid and he is Thiqa (Trustworthy) among all scholars as said before. This hadeeth is narrated by Al-Tirmdhi too in the chapter of Fazail-e-Alee (merits of Alee) and says: It is Hasan Gharib and not known other than hadeeth of Ja’far ibn Sulaiman, and Al-Hakim says it is Saheeh (Authentic) in the conditions of Muslim and Al-Dhahabi comfirms it. <\/span><\/p>\n<p><span style=\"color: #ff0000;\"> Source: Musnad Ahmad bin Hanbal. Vol. 15, Pg. # 78 &#8211; 79, H # 19813.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\">For some other odd reason, RTS then quotes the same narration over and over again, while using the same chain, Ja’afar bin Sulaiman, Yazeed bin Al-Rishk from Muttarif from Imran bin Husain. He quotes the same narration from Abdulrazaq, Al-Tirmithi, Abi Ya’ala, Ibn Hibban, Al-Nasa’ee, Ibn Abi Asim, Al-Thahabi, Ibn Hajar, Ibn Al-Mutaqqi Al-Hindi, and Al-Suyuti, as if the usage of additional sources would strengthen the narration.<\/p>\n<p style=\"text-align: justify;\">RTS then quotes the narration from the path of Al-Ajlah:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Hadeeth through Ajlah al-Kindi:<\/span><br \/>\n<span style=\"color: #ff0000;\"><br \/>\nImam Ahmad ibn Hanbal:<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\">حدثنا ابن نمير ، حدثني أجلح الكندي ، عن عبد الله بن بريدة ، عن أبيه بريدة ، قال : بعث رسول الله صلى الله عليه وسلم بعثين إلى اليمن ، على أحدهما علي بن أبي طالب ، وعلى الآخر خالد بن الوليد ، فقال : &#8221; إذا التقيتم فعلي على الناس ، وإن افترقتما ، فكل واحد منكما على جنده &#8221; ، قال : فلقينا بني زيد من أهل اليمن ، فاقتتلنا ، فظهر المسلمون على المشركين ، فقتلنا المقاتلة ، وسبينا الذرية ، فاصطفى علي امرأة من السبي لنفسه ، قال بريدة : فكتب معي خالد بن الوليد إلى رسول الله صلى الله عليه وسلم يخبره بذلك ، فلما أتيت النبي صلى الله عليه وسلم ، دفعت الكتاب ، فقرئ عليه ، فرأيت الغضب في وجه رسول الله صلى الله عليه وسلم ، فقلت : يا رسول الله ، هذا مكان العائذ ، بعثتني مع رجل وأمرتني أن أطيعه ، ففعلت ما أرسلت به ، فقال رسول الله صلى الله عليه وسلم : &#8221; لا  تقع في علي ، فإنه مني وأنا منه ، وهو وليكم بعدي ، وإنه مني وأنا منه ، وهو وليكم بعدي<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;Narrated ibn Namir narrated Ajlah Al-Kindi from Abdullaah ibn Buraidah from his father Buraidah, who said: The Messenger of Allah (saw) sent two missionaries to Yemen, one of them, Alee ibn Abi Talib and the other Khalid ibn Al-Walid. Then he said, if you meet, then Alee will lead over (both) groups (of soldiers), if you separate, then every one of you leads his (own) soldiers. He said, we saw Bani Zeid of the people of Yemen, whom we fought, and the Muslims overcame the infidels, so we killed the fighters and captured the others (women, children and elderly), and Alee kept a woman to himself, said Buraidah: Khalid ibn Al-Walid sent me with a letter to the Messenger of Allah (saw), telling him so (of this incident). Then when I came to the Prophet (saw), I gave him the letter and I saw anger in the face of the Messenger of Allah (saw) peace be upon him and I said, O Messenger of God, you sent me with a man and asked me to obey him, so I did (i.e. I’m just the messenger of this letter). The Messenger of Allah peace be upon him said: &#8220;Do not produce falsehoods about Alee (a.s), he is from me and I am (saw) from him (a.s), and he is your Master after me, he is from me (a.s) and I am from him, and he (a.s) is your Master after me (saw).&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">Then, finally, the last narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Imam Ahmad ibn Hanbal:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\">حدثنا عبد الله حدثنا يحيى بن حماد حدثنا أبو عوانة حدثنا أبو بلج حدثنا عمرو بن ميمون قال إني لجالس إلى ابن عباس إذ أتاه تسعة رهط فقالوا يا أبا عباس إما أن تقوم معنا وإما أن يخلونا هؤلاء قال فقال ابن عباس بل أقوم معكم قال وهو يومئذ صحيح قبل أن يعمى قال فابتدءوا فتحدثوا فلا ندري ما قالوا قال فجاء ينفض ثوبه ويقول أف وتف وقعوا في رجل له عشر وقعوا في رجل قال له النبي صلى الله عليه وسلم لأبعثن رجلا لا يخزيه الله أبدا يحب الله ورسوله قال فاستشرف لها من استشرف قال أين علي قالوا هو في الرحل يطحن قال وما كان أحدكم ليطحن قال فجاء وهو أرمد لا يكاد يبصر قال فنفث في عينيه ثم هز الراية ثلاثا فأعطاها إياه فجاء بصفية بنت حيي قال ثم بعث فلانا بسورة التوبة فبعث عليا خلفه فأخذها منه قال لا يذهب بها إلا رجل مني وأنا منه قال وقال لبني عمه أيكم يواليني في الدنيا والآخرة قال وعلي معه جالس فأبوا فقال علي أنا أواليك في الدنيا والآخرة قال أنت وليي في الدنيا والآخرة قال فتركه ثم أقبل على رجل منهم فقال أيكم يواليني في الدنيا والآخرة فأبوا قال فقال علي أنا أواليك في الدنيا والآخرة فقال أنت وليي في الدنيا والآخرة قال وكان أول من أسلم من الناس بعد خديجة قال وأخذ رسول الله صلى الله عليه وسلم ثوبه فوضعه على علي وفاطمة وحسن وحسين فقال إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا قال وشرى علي نفسه لبس ثوب النبي صلى الله عليه وسلم ثم نام مكانه قال وكان المشركون يرمون رسول الله صلى الله عليه وسلم فجاء أبو بكر وعلي نائم قال وأبو بكر يحسب أنه نبي الله قال فقال يا نبي الله قال فقال له علي إن نبي الله صلى الله عليه وسلم قد انطلق نحو بئر ميمون فأدركه قال فانطلق أبو بكر فدخل معه الغار قال وجعل علي يرمى بالحجارة كما كان يرمى نبي الله وهو يتضور قد لف رأسه في الثوب لا يخرجه حتى أصبح ثم كشف عن رأسه فقالوا إنك للئيم كان صاحبك نرميه فلا يتضور وأنت تتضور وقد استنكرنا ذلك قال وخرج بالناس في غزوة تبوك قال فقال له علي أخرج معك قال فقال له نبي الله لا فبكى علي فقال له أما ترضى أن تكون مني بمنزلة هارون من موسى إلا أنك لست بنبي إنه لا ينبغي أن أذهب إلا وأنت خليفتي قال وقال له رسول الله أنت وليي في كل مؤمن بعدي وقال سدوا أبواب المسجد غير باب علي فقال فيدخل المسجد جنبا وهو طريقه ليس له طريق غيره قال وقال من كنت مولاه فإن مولاه علي قال وأخبرنا الله عز وجل في القرآن أنه قد رضي عنهم عن أصحاب الشجرة فعلم ما في قلوبهم هل حدثنا أنه سخط عليهم بعد قال وقال نبي الله صلى الله عليه وسلم لعمر حين قال ائذن لي فلأضرب عنقه قال أوكنت فاعلا وما يدريك لعل الله قد اطلع إلى أهل بدر فقال اعملوا ما شئتم حدثنا أبو مالك كثير بن يحيى قال حدثنا أبو عوانة عن أبي بلج عن عمرو بن ميمون عن ابن عباس نحوه<\/span><\/p>\n<p style=\"text-align: justify;\" align=\"right\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Umar ibn Maymun said: &#8220;I was sitting once in the company of ibn Abbas when nine men came to him and said, &#8216;O iAbbas! Either come to debate with us, or tell these folks that you prefer a private debate.&#8217; He had not lost his eye-sight yet he said: &#8216;I rather debate with you.&#8217; So they started talking, but I was not sure exactly what they were talking about. Then he stood up and angrily said: &#8220;Woe to them! Woe to them! They are debating about a man who has ten merits nobody else ever had. They are arguing about a man whom the Holy Prophet (saw) has said, &#8216;I shall dispatch a man whom Allah (swt) shall never humiliate, one who is loved by Allah (swt) and His Messenger (saw).&#8221; So each one of them thought to him such an honour belonged. The Holy Prophet (saw) inquired about Alee saying, &#8216;where is Alee?&#8217; When the latter came unto him, with his eyes swelling in ailment, he (pbuh) blew in his eyes, shook the standard thrice and gave it to him. Alee came back victorious with Safiyya bint Huyay [Al-Akhtab] among his captives. Ibn Abbas proceeded to say, &#8220;Then the Messenger of Allah (saw) sent someone (Aboo Bakr) with Surat Al-Tawbah, but he had to send Alee after him to discharge the responsibility, saying: Nobody can discharge it except a man who is of me, and I am of him.&#8217; ibn Abbas also said, &#8220;The Messenger of Allah (saw), with Alee sitting beside him, asked his cousins once: &#8220;Who among you elects to be my Wali in this life and the life hereafter?&#8221; They all declined, but Alee who said: &#8220;I would like to be your Wali in this life and the life to come.&#8221; Whereupon the Prophet (saw) responded by saying: &#8220;You are indeed  my Wali in this life and the life hereafter.&#8221; Ibn Abbas continues to say that Alee was the first person to accept Islam after Khadijah, and that the Messenger of Allah (pbuh) took his own robe and put it over Alee, Faatima, Hassan and Hussain, then recited the verse saying: &#8220;Allah wishes to remove all abomination from you, O Ahl al-Bayt [people of my household] and purify you with a perfect purification (Qur&#8217;an, 33:33).&#8221; He has also said: &#8220;Alee bought his own soul, he put on the Prophet&#8217;s garment and slept in his bed when the infidels sought to murder him until the Messenger of Allah (saw) went on Tabuk expedition accompanied by many people.&#8221; Alee asked him: &#8216;May I join you?&#8217; The Messenger of Allah (pbuh) refused, whereupon Alee (a.s) wept. The Prophet (pbuh) then asked him: Does it not please you that your status to me is similar to that of Haroon is to Musa, except there is no Prophet after me? It is not proper for me to leave this place before assigning you as my vicegerent.&#8217; The Messenger of Allah (pbuh) has also said the following to him: &#8220;You are my heir among every believer after me.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff00ff;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff00ff;\"><span style=\"color: #ff0000;\">Ibn Abbas has said: &#8220;The Messenger of Allah<\/span><span style=\"color: #ff0000;\"> closed down all doors leading to his mosque except that of Alee (a.s), who used to enter the mosque on his way out even while in the state of Janaba (impurity). The Messenger of Allah (saw) has also said: &#8216;Whoever accepts me as the Wali, let him\/her take Alee as the Wali too.&#8217; And Allah (swt) has revealed in His book that he is satisfied with them, the companions of the tree, because he knew what is in their hearts, did he then reveal that he is not pleased with them?! Then said: &#8216;The Messenger of Allah (saw) said to Umar when he wanted to kill one of the people of Badr, &#8216;will you kill him?!&#8217; You do not know maybe Allah (swt) has said to the people of Badr do whatever you want!?&#8221;<\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #808000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: The chain is Saheeh (Authentic!). Abu Balj, his name is Yahya ibn Salim and it is said he is Yahya ibn Abi al-Aswad al-Fazari, and he is Thiqa, ibn Mo&#8217;een, ibn Sa’d, Al-Nasa&#8217;i and Dar al-Qutni and the others say: &#8216;He is &#8216;Thiqa&#8217; (Trustworthy), and in Al-Tahdheeb that Bukhari says: &#8220;There is a problem about him&#8221; and I do not know where does Bukhari say this? Because his biography is in Tarikh Al-Kabir of Bukhari but he has not degraded him, he has not written about him in his Al-Saghir too, and not he nor Nasa&#8217;i have not mentioned him in Dhuhafa, he has narrated from Shohba and has not narrated except from Thiqa (Trustworthy).<\/span><\/p>\n<p style=\"text-align: justify;\">RTS then went on to quote other books that quoted this same narration of Abu Balj through other sources, like Al-Haythami, Ibn Katheer, Al-Hakim, Abu Dawud Al-Tayalisi, Al-Buseeri, and Ibn Abi Asim.<\/p>\n<p style=\"text-align: justify;\">Readers, be aware that the first two narrations comes from Shia narrators, which is why RTS makes it clear that the last one is a “Hadeeth With No Shi&#8217;ee In The Chain”, implying that the first two do have Shias. However is this a problem?<\/p>\n<p style=\"text-align: justify;\">RTS quotes Al-Albani who says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><br \/>\nIf someone claims: This witnessing hadith (by Ajli al-Kindi) is narrated by a Shi&#8217;ee, while the narrator of the other witnessed hadeeth too, Ja&#8217;far ibn Sulayman, is a Shi&#8217;ee, does that not make the hadith objectionable?<\/span><\/p>\n<p><span style=\"color: #ff0000;\"> I (Al-Albani) say: No! This is because the only conditions for the acceptability of hadeeth&#8217;s are the truthfulness and good memory of the narrator. As for his sectarian beliefs, that is a matter between him and his Lord only and He is sufficient for him. This is why we see Al-Bukhari and Muslim and others narrating from several of the truthful ones among the deviants, like the Khawarij and the Shi&#8217;ites and others. <\/span><\/p>\n<p style=\"text-align: justify;\">Al-Albani (rahimahu Allah) is correct in saying that Al-Bukhari and Muslim accepted the narrations of innovators, however, this was the case for innovators who narrated narrations that had nothing to do with their innovations. However, if the narration is evidence for the innovation of the innovator, then it is to be rejected.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar said in Al-Nukhba:<\/p>\n<p style=\"text-align: justify;\">والثاني يقبل من لم يكن داعية في الأصح إلا أن روى ما يقوي بدعته فيرد على المختار وبه صرح الجوزجاني شيخ النسائي<\/p>\n<p style=\"text-align: justify;\">Rough translation: The second (innovations that lead to <i>fisq<\/i> and not <i>kufur<\/i>) are accepted if the narrator was not a caller, and this is the more correct opinion, except if the narrator narrates what strengthens his innovation, then it is rejected, and that is the chosen (opinion), and Al-Jawzajani, the teacher of Al-Nasa’ee stated this.<\/p>\n<p style=\"text-align: justify;\">Due to this contemporary scholars like Al-Shaikh Muqbil in Al-Shafa’a (p.108) accepted this view. He said:<\/p>\n<p style=\"text-align: justify;\">فبما أن هذين الراويين غاليان في التشيع والحديث موافق لمذهبهما فالحديث ضعيف<\/p>\n<p style=\"text-align: justify;\">Rough translation:<\/p>\n<p style=\"text-align: justify;\">Since these two narrators are extreme in their <i>tashayyu<\/i> and the hadith supports their <i>mathhab<\/i>, then the hadith is <i>da’eef<\/i> (weak).<\/p>\n<p style=\"text-align: justify;\">As we can see, there is a difference of opinion in this issue, and as we will discuss, and by carrying on with breaking down the aspects of this hadith, we will understand how the innovation of these narrators affected their narration.<\/p>\n<p style=\"text-align: justify;\">Firstly, the narration of Al-Ajlah Al-Kindi is weak, regardless of the strengthening provided by Al-Iraqi. He was weakened by Al-Qattan, Abu Hatim, Al-Nasa’ee, Al-Jawzajani, Abu Dawud, Ibn Sa’ad, Al-Uqaili, Ibn Hibban, Al-Saji, Ibn Jarud, and Abu Al-Arab. See Ikmal Mughlatay and Ibn Hajar’s Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">Even those that strengthened him didn’t strengthen him completely. For example, Yaqoub bin Sufyan Al-Fasawi, who made <i>tawtheeq<\/i> of him said that his hadith is soft. Ibn Ma’een, who referred to him as a <i>thiqa,<\/i> used other wordings like <i>salih<\/i> and <i>la ba’asa bihi,<\/i> implying that he isn’t a top tier narrator. Ibn Adi also referred to him as a <i>shi’ee<\/i>. Regardless, the majority of the scholars have weakened him, as we can see, so his narration is rejected.<\/p>\n<p style=\"text-align: justify;\">As for Ja’afar bin Sulaiman, he is a Shi’ee according to Ibn Sa’ad, Al-Muqadami, Ibn Adi, Ibn Hibban, Al-Azdi, Al-Duri, and Yazeed bin Harun. See Al-Tatheeb.<\/p>\n<p style=\"text-align: justify;\">It becomes even more apparent that Al-Ajlah made a mistake when we go back to other narrations of Buraida Al-Aslami, since none of them have the addition that includes the term “after me”.<\/p>\n<p style=\"text-align: justify;\">For example, we find an authentic narration from Sa’eed bin Jubair from Ibn Abbas from Buraida in the Musnad (16\/475) without this addition. Abdul Jaleel bin Atiya (22\/483), Ali bin Suwaiyid bin Manjoof (22\/506), and Sa’ad bin Ubaida (22\/511) (Sa’ad narration is by Al-A’amash who narrated with ‘<i>an’ana<\/i>)<i> <\/i>also narrated it without the addition from Abdullah bin Buraida from his father. All of these can also be found in Musnad Ahmad. With this in mind, it is quite clear that neither Buraida, nor his son, said the word “after me”, since none of the reliable narrators mentioned such a thing when narrating from them.<\/p>\n<p style=\"text-align: justify;\">Ja’afar bin Sulaiman, being a contemporary of Al-Ajlah, may have heard this narration in this form, and narrated it in the same manner. Unlike what Al-Albani is implying, an innovator may be affected by his innovation, but without it having anything to do with his truthfulness. Ja’afar bin Sulaiman wouldn’t be lying by adding the terms “after me”, but rather, would be narrating the narration according to the meaning that he has understood it in.<\/p>\n<p style=\"text-align: justify;\">It should also be known that there are other chains that support the version without the addition and are of the highest authenticity. This includes the narration of Sa’ad bin Abi Waqqas and Sa’eed bin Wahb, both of which are in Khasa’is Ali (p. 75-76).<\/p>\n<p style=\"text-align: justify;\">The narration is also authentic in Sunan Al-Tirmithi (p. 845) in the narration of Abu Al-Tufail from either Zaid bin Arqam or Abi Sareeha. It too doesn’t contain this addition.<\/p>\n<p style=\"text-align: justify;\">With the above in mind, one can easily be reassured that Buraida, Sa’ad, Zaid bin Arqam\/Abi Sareeha, and Sa’eed bin Wahb, through authentic chains, have narrated this without the addition of “after me”, and that these narrations are stronger than the narrations that include the addition.<\/p>\n<p style=\"text-align: justify;\">Finally, the last narration that includes the addition is the narration of Abu Balj Al-Wasiti. However, his narration, while appearing to be strong, includes a hidden defect. We find in Sharh Ilal Al-Tirmithi by Ibn Rajab (p.493) that Ahmad questioned the narration of Amr bin Maymoon from Ibn Abbas, perhaps since the former is much older than him. Then Ibn Rajab adds that Abdul Ghani Al-Hafith believed that Abu Balj made a mistake in the narration and meant to say Maymoon Abu Abdullah (who is weak) when he said Amr bin Maymoon. Ibn Rajab sees this opinion as a valid one.<\/p>\n<p style=\"text-align: justify;\">So, in conclusion, the addition can be found in the narrations of weak narrators, and only one strong Shi’ee narrator, Ja’afar bin Sulaiman Al-Dhuba’ee, and this conflicts with all the authentic narrations that do not include this addition, therefore the addition is weak.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Response to: Alee (a.s) The Master Of Every Believer The following is a response by Farid to the article on RevisitingtheSalaf.org, entitled: Alee (a.s) The Master of Every Believer, which was published on the 16th of April, 2012, and can <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/05\/02\/response-to-alee-a-s-the-master-of-every-believer\/\" title=\"Response to: Alee (a.s) The Master of Every Believer\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6],"tags":[],"class_list":{"0":"post-264","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/264","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=264"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/264\/revisions"}],"predecessor-version":[{"id":361,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/264\/revisions\/361"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=264"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=264"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=264"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}