{"id":2645,"date":"2015-10-30T22:54:52","date_gmt":"2015-10-30T22:54:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2645"},"modified":"2017-02-21T12:27:36","modified_gmt":"2017-02-21T12:27:36","slug":"the-shia-mahdi","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/10\/30\/the-shia-mahdi\/","title":{"rendered":"The Shia Mahdi: the history of confusion"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2645\" alt=\"\" \/><\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong>The Shia Mahdi<\/strong><\/span><\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\">&#8211;<em>The History Of Confusion<\/em>&#8211;<\/span><\/p>\n<p style=\"text-align: right;\"><span style=\"color: #808080;\">Download PDF <a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/10\/The-Shia-Mahdi-A-history-of-confusion.pdf\" rel=\"external nofollow\">(here)<\/a><\/span><\/p>\n<p style=\"text-align: justify;\">The belief in the “messiah” is a widespread belief shared by the majority of religions, it is the belief that at the end of times we shall be delivered by a promised one, a savior who will lead us to God, vanquish our enemies and rule humanity with justice. Just as the Jews in Arabia awaited a promised prophet at the end of times to grant them victory so did the Christians as they await the second advent of `Isa (as) who will rule a kingdom with no end. The Muslims are no different in this regard; our Prophet (saw) had promised us that we shall be under the authority of a fair and just ruler; he is the guided one, the Mahdi who will be born at the end of times. The savior of the Muslims shall rule for seven years according to reliable mainstream narrations then the authority will be transferred to prophet `Isa (as) who will rule forty years and defeat the enemies of Islam and their Dajjal.<\/p>\n<p style=\"text-align: justify;\">Many legitimate books discussed the Mahdi and what our Prophet (saw) said about him based on the reliable and authentic reports, from them we list “Al-Ahadith al-Waridah fil-Mahdi fi Mizan al-Jarh wal-Ta`dil” by `Abdul-`Alim `Abdul-`Azim &amp; “Al-Mahdi wa Fiqh Ashrat-ul-Sa`ah” by Muhammad bin Ahmad bin Isma`il al-Muqaddim and plenty of others…<\/p>\n<p style=\"text-align: justify;\">Our research in this piece shall not be regarding the true Mahdi that the majority of Muslims believe in nor is it related to the beliefs of the average Muslim you may encounter, rather we will be discussing historical personalities who were falsely claimed to be the “Mahdi” by a small group of deviants calling themselves “The Shia”. For this purpose we shall go through the books of the Shia sects as well as the books of the expert scholars and renowned historians who interacted with such sects and often debated their leaders and collected their books, all while documenting the early beliefs held by these groups, especially those of the various Shia sects.<\/p>\n<p style=\"text-align: justify;\">Note: Many people throughout history claimed to be the Mahdi, even in our days one may find a few especially in Iran, Yemen and `Iraq. The claimants were Hashemites, Arabs and even non-Arabs; this research will only cover those who were documented in the early days and were claimed to be Mahdies only by the Shia groups.<\/p>\n<p style=\"text-align: justify;\">To give the readers an idea of how obsessed certain Muslims have become with the character of “The Mahdi”, we refer you to an article published by the economist called “Iran’s multiplicity of messiahs” on Apr 27th 2013, Tehran (print edition). We quote some passages:<\/p>\n<p style=\"text-align: justify;\">[EARLIER this year Iran’s authorities arrested a score of men who, in separate incidents, claimed to be the Mahdi, a sacred figure of Shia Islam, who was “hidden” by God just over a millennium ago and will return some time to conquer evil on earth. (etc…)<\/p>\n<p style=\"text-align: justify;\">Iran’s economic doldrums may have helped to cause this surge in people claiming to be mankind’s saviour—and in women saying they were the Mahdi’s wife. (etc…)<\/p>\n<p style=\"text-align: justify;\">Last year a seminary expert, Mehdi Ghafari, said that more than 3,000 fake Mahdis were in prison. Mahdi-complexes are common, says a Tehran psychiatrist. (etc…)<\/p>\n<p style=\"text-align: justify;\">The most famous case was that of Ayatollah Boroujerdi, who was sentenced to 11 years in prison in 2007 for allegedly—among other things—claiming he was the Mahdi. (etc…)<\/p>\n<p style=\"text-align: justify;\">Mr Ahmadinejad has called his administration “the government of the hidden imam”. Last month he told a batch of new Iranian ambassadors to consider themselves “envoys of the Mahdi”. (etc…)]<\/p>\n<p style=\"text-align: justify;\">May Allah save us from deviance,<\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong>-Sources used in this research-<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Main Shia sources relied upon in this study:<\/p>\n<p style=\"text-align: justify;\">-Firaq al-Shi`ah by Sa`d bin `Abdullah al-Ash`ari al-Qummi [d.299AH] &amp; Hasan bin Musa al-Nawbakhti [d.310AH]<\/p>\n<p style=\"text-align: justify;\">Description: This book is actually two books, al-Maqalat wal-Firaq by Sa`d al-Qummi and Firaq al-Shi`ah by Hasan al-Nawbakhti.  Al-Nawbakhti who is a popular Imami philosopher and theologian first wrote his book and then al-Qummi who is an Ithna-`Ashari scholar of Hadith adopted it and added to it his own explanations and comments and so both books were merged and published as one.<\/p>\n<p style=\"text-align: justify;\">-Al-Zinah fil-Kalimat al-Islamiyyah al-`Arabiyyah by Ahmad bin Hamdan al-Razi [d.322AH]<\/p>\n<p style=\"text-align: justify;\">Description: While being a linguistic book, al-Zinah is known to have an entire volume dedicated to the origins of the names and titles of Islamic sects. The author Ibn Hamdan being an Isma`ili Shia took great care of listing the various different Shia sects and seems to agree with al-Nawbakhti’s work for the most part.<\/p>\n<p style=\"text-align: justify;\">-Al-Maniyah wal-Amal Sharh al-Milal wal-Nihal by al-Mahdi Ahmad bin al-Murtada al-Hasani [d.840AH]<\/p>\n<p style=\"text-align: justify;\">Description: A rare book of sects written by the popular Zaydi Shia scholar Ibn al-Murtada. This author had access to some of the rarest of lost books quotes early scholars such as abu `Isa al-Warraq [d.247AH], al-Qadi `Abdul-Jabbar [d.415AH] and al-Hakim al-Jushami [d.494AH]. This book describes the Mu`tazili sects in great detail while also listing some interesting information related to the Imamiyyah and the Zaydi Shia.<\/p>\n<p style=\"text-align: justify;\">-Bihar-ul-Anwar al-Jami` li-Akhbar al-A’immah al-Athar by Muhammad Baqir al-Majlisi [d.1111AH]<\/p>\n<p style=\"text-align: justify;\">Description: An encyclopedia of Shia traditions written by the father of modern day Ithna-`Ashari Shia. In the thirty seventh volume of his book he quotes details about the various Shia sects from the book “al-Fusoul” by the popular early Rafidi preacher al-Shaykh al-Mufid [d.413AH].<\/p>\n<p style=\"text-align: justify;\">-The Occultation of the Twelfth Imam: A Historical Background by Jasim M. Husayn [contemporary]<\/p>\n<p style=\"text-align: justify;\">Description: A book recently written by a Twelver Shia researcher on the topic of their 12<sup>th<\/sup> hidden Imam.<\/p>\n<p style=\"text-align: justify;\"><strong><br \/>\n<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong>-List of men the Shia claimed to be the “Mahdi” at the end of times-<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>1) `Ali ibn abi Talib:<\/strong><\/p>\n<p style=\"text-align: justify;\">The first of the ideological Shia was a sect called “al-Saba’iyyah” and they founded the belief in Ghaybah and Raj`ah.<\/p>\n<p style=\"text-align: justify;\">[A group said: `Ali was not killed and he did not die. They said that he would not die until he had driven the Arabs with his cane and filled the earth with justice and fairness, after it has been filled with oppression and injustice. This was the first sect in Islam that believed in Waqf (stopping at a certain man’s leadership and not granting it to others after his death), after the Prophet (saw), and his family. They were also the first extremists (Ghulat). They were called “al-Saba’iyyah”, the followers of <a href=\"http:\/\/twelvershia.net\/2014\/09\/18\/abdullah-ibn-saba-the-book\/\" rel=\"external nofollow\">Abdullah ibn Saba<\/a>’ who disowned Abu Bakr, Umar, `Uthman and the rest of the Companions, then he claimed that `Ali ordered him to do this so `Ali questioned him about it and he confessed so he ordered his execution] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[He (Ibn Saba’) was the first to declare that the Imamah of `Ali was mandatory, he disowned his enemies and attacked his opponents and accused them of Kufr] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[And they claimed his (`Ali’s) Ghaybah (occultation) after his death and stopped (made Wuqouf) at his leadership (not exceeding it to others from his children). They said he is al-Qa’im who shall arise, that he is alive not dead, he shall not die until he rules the Arabs with his stick and fills the earth with justice and equality just as it was filled with tyranny.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[And his (Ibn Saba’s) companions claimed that `Ali was in the clouds, and that thunder is his voice and lightning is his whip] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\"><strong>2 – 3) Al-Hasanayn “Al-Hasan &amp; al-Husayn”:<\/strong><\/p>\n<p style=\"text-align: justify;\">The Hasanayn were both thought to be the awaited saviors by some of their Shia.<\/p>\n<p style=\"text-align: justify;\">[They did not establish Imamah for anybody else after them (Meaning after the first three Imams), they instead believed in their Raj`ah(return) but not to teach people their religion. However, they shall return to seek vengeance, kill their enemies and (punish) those who usurped their rights; this is their belief concerning the appearance of the Mahdi and the rising of al-Qa’im.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\"><strong>4) Muhammad ibn `Ali “Ibn al-Hanafiyyah”:<\/strong><\/p>\n<p style=\"text-align: justify;\">It was a group of the early Shia who claimed Ibn al-Hanafiyyah was the Mahdi and they are known as the “Kaysaniyyah”.<\/p>\n<p style=\"text-align: justify;\">[A group said that Muhammad bin al-Hanafiyyah was the Imam al-Mahdi, he is the executor of `Ali ibn abi Talib’s will, none of his household may disobey his command, they cannot take anyone other than him as their leader nor can they raise their swords without his permission.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They claimed that Muhammad ibn al-Hanafiyyah is Imam al-Mahdi, he is the awaited al-Qa’im who shall fill the earth with justice as it was filled with oppression. They claimed he appointed al-Mukhtar as leader of his Shia and ordered him to seek vengeance for al-Husayn and called him Kaysan.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[Al-Mukhtar was a “Kaysani” who believed in Raj`ah, he said that Muhammad bin al-Hanafiyyah will die then be resurrected with his Shia and will fill the earth with justice. He also claimed that his rebellion was ordered by him (Ibn al-Hanafiyyah) (…etc…) And he dominated al-Koufah until a group of its people fled to al-Basarah seeking their aid against al-Mukhtar, so the Basri army marched behind Mus`ab bin al-Zubayr and fought (al-Mukhtar) in Koufah. In Mus`ab’s army was `Ubaydullah bin `Ali ibn abi Talib and Muhammad bin al-Ash`ath bin Qays so al-Mukhtar killed them both then he was killed] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\">[This sect believed in the Imamah of abu al-Qasim Muhammad bin Amir-ul-Mu’minin ibn Khawlah al-Hanafiyyah and they claimed he was the Mahdi who fills the earth with justice and fairness just as it was once filled with oppression and tyranny, and that he is alive, he never died nor will he die until he appears with truth (…etc…) They argued he was the Mahdi based on the prophetic-narration: “The days and nights shall not end until Allah sends a man from my household, his name matches mine and so does his Kuniyah and his father’s name (…etc…) They argued that from the names of Amir-ul-Mu’minin was `Abdullah because he said: “I am the slave of Allah (`Abdullah), and the brother of Allah’s messenger (saw) and the greatest Siddiq, no one claims it after me except a liar.”] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>5) `Abdullah bin Muhammad “abu Hashim”:<\/strong><\/p>\n<p style=\"text-align: justify;\">The eldest son of Ibn al-Hanafiyyah was also the “Mahdi” according to a group of Shia.<\/p>\n<p style=\"text-align: justify;\">[A group attributed to him the same statement the Kaysani sect attributed to his father before him: That he is al-Mahdi, he is alive not dead, he can revive the dead and they went into extremes in raising his status.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They said that `Abdullah was dead but he will make a return (Raj`ah) and that he is the Mahdi who will emerge to fill the earth with justice just as it was filled with tyranny.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[It was also said that from them were some who said that `Abdullah bin Muhammad is alive and he never died and that he is al-Qa’im] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>6) `Abdullah “The descendant of Ja`far bin abi Talib”:<\/strong><\/p>\n<p style=\"text-align: justify;\">`Abdullah bin Mu`awiyah bin `Abdullah bin Ja`far bin abi Talib was also said to be the Mahdi.<\/p>\n<p style=\"text-align: justify;\">[A group said: `Abdullah bin Mu`awiyah is al-Mahdi, who was mentioned by the messenger (saw) and his family and he will lead the world, to fill it with goodness and justice after it was filled with injustice and oppression. Then, when he died, he will leave his position to someone from Bani Hashim from the descendant of `Ali bin Abi Talib.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They claimed that `Abdullah bin Mu`awiyah is alive and never dies, that he is dwelling in the mountains of Asbahan and will not die until he rises and he is al-Qa’im al-Mahdi whom the Prophet (saw) promised so he will fill the earth with justice as it was filled with tyranny and then hand it to a man from banu Hashim at the moment of his death.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\"><strong>7) Muhammad “The descendant of Ibn al-Hanafiyyah”:<\/strong><\/p>\n<p style=\"text-align: justify;\">The “Hashimi” Shia believed the Mahdi to be from Muhammad bin `Ali’s progeny.<\/p>\n<p style=\"text-align: justify;\">[So `Ali bin Muhammad (bin al-Hanafiyyah) made his son al-Hasan bin `Ali the executor of his will, his mother is Umm Walad, and al-Hasan made his son `Ali bin al-Hasan the executor of his will, his mother is Lubanah bint abi Hashim, and `Ali made his son al-Hasan bin `Ali the executor of his will, his mother is `Aliyyah bint `Awn bin `Ali bin Muhammad bin al-Hanafiyyah. For them the execution of the will is restricted to the descendants of Ibn al-Hanafiyyah and no one else, from them shall appear al-Qa’im al-Mahdi, they are the pure Kaysani sect who were popular for this title, this group specifically is known as “al-Mukhtariyyah.”] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They claimed that aba Hashim appointed his brother `Ali bin Muhammad, and `Ali appointed his son al-Hasan bin `Ali, and al-Hasan appointed his son `Ali bin al-Hasan, so the Imamah according to them is in the children of Muhammad bin al-Hanafiyyah, it does not go to anyone else and from them will arise al-Qa’im al-Mahdi.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\"><strong>8) Ja`far bin Muhammad:<\/strong><\/p>\n<p style=\"text-align: justify;\">Aba `Abdillah was claimed to be the Mahdi by a group of his Shia and they became known as the “Nawousiyyah”.<\/p>\n<p style=\"text-align: justify;\">[A group said: Ja`far bin Muhammad did not die and he will not die until he revolts and rule the people and he is al-Qa’im al-Mahdi, they narrated from him that he said: “If you see my head tumbling down from atop a mountain, do not believe it as I am the (awaited) one.” And they narrated from him: “If there should come to you a person claiming that he washed me and shrouded me and buried me; do not believe him for I am the one, the possessor of the sword.” This group I called “al-Nawousiyyah”.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They were called that because a man from the people of Basarah called Ibn Nawous claimed that Ja`far bin Muhammad didn’t die; he shall remain alive until he reappears and receives authority; he is al-Qa’im al-Mahdi. Him and his followers claimed that they narrated from him (Ja`far) that he said: “If you see my head dropping down from a mountain then do not be fooled, for I am your companion, the owner of the sword.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[The “Nawousiyyah” who are attributed to one of their leaders from the people of Basarah called Nawous. They claimed that Ja`far bin Muhammad is alive, he never died nor will he die until he rules the earth, and he is the awaited Mahdi.] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\">[Until the opinions differed after the death of abi `Abdillah Ja`far bin Muhammad, a group said: Aba `Abdillah is alive not dead, he doesn’t die until he appears and fills the earth with justice and fairness as it was filled with tyranny and oppression because he is al-Qa’im al-Mahdi. They clung to a narration by `Anbasah bin Mus`ab from abu `Abdillah that he said: “If there comes to you someone informing you that he had washed me, shrouded me and buried me, do not believe him.” This group was called “al-Nawousiyyah” because their leader was a man from Basarah called `Abdullah ibn Nawous.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>9) Isma`il bin Ja`far:<\/strong><\/p>\n<p style=\"text-align: justify;\">Isma`il was claimed to be alive and in Ghaybah by a group of his father’s Shia and they are a group of “al-Isma`iliyyah”.<\/p>\n<p style=\"text-align: justify;\">[A group claimed that the Imam after Ja`far is his son Isma`il bin Ja`far, they denied the death of Isma`il during his father&#8217;s life – saying it was a trick plotted by his father, who was afraid for him, so he hid him. They claimed Isma`il would not die until he ruled the world and cared for the people and that he was al-Qa’im, because his father appointed him for the Imamah after him and told them about it and the Imam cannot say except the truth.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[Many people believed in his Imamah during the life of Ja`far from his companions and he never opposed them, some folks even said that Isma`il never died but that his father sent him into a state of Ghaybah out of fear for him. They said: “How can it be so (meaning his death), when Ja`far had appointed him over us and order us to obey him (etc…)”] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\"><strong>10) Muhammad bin Isma`il bin Ja`far:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group from the “Qaramitah” said he was the final Imam and Mahdi.<\/p>\n<p style=\"text-align: justify;\">[They were originally of the same belief as the “Mubarakiyyah” but then they differed with them and said: There shall not be after Muhammad (saw) except seven Imams: They were `Ali bin Abi Talib, al-Hasan, al-Husayn, `Ali bin al-Husayn, Muhammad bin `Ali, Ja`far bin Muhammad and Muhammad bin Isma`il bin Ja`far, who was al-Qaim al-Mahdi and a messenger.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They claimed that Muhammad bin Isma`il is alive not dead, that he is hidden and occluded (Gha’ib Mustatir) in the lands of the Romans (Christian lands). The meaning of al-Qa’im according to them is that he shall be sent with a new law and message to abrogate those of Muhammad (saw)] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\"><strong>11) Musa bin Ja`far:<\/strong><\/p>\n<p style=\"text-align: justify;\">Musa was claimed to be the hidden savior by a great group of his father’s companions, later called “al-Waqifah” or “al-Mamtourah”.<\/p>\n<p style=\"text-align: justify;\">[The second group said: Musa bin Ja`far did not die, nor will he die until he rules the world from east to west. He would fill it with justice after it had been filled with oppression. They claimed that he was al-Qa’im al-Mahdi. They said that he feared death so he left the prison unseen during the day, however the Sultan and his followers claimed his death to fool the people with a (random) man who died in prison (…etc…) They narrated from his father Ja`far reports in which he said: “He (Musa) is al-Qa’im al-Mahdi, even if you spot his head tumbling down a mountain then do not believe it for he is the one to rise.”] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[As for those who claimed it (Imamah) for Musa, then they differed regarding (his son) `Ali after his death until some folks stopped at Musa and claimed he is alive not dead.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[They claimed that he is alive and undying and that he is al-Qa’im who fills the earth with justice as it was filled with oppression. They stopped on his Imamah denying `Ali bin Musa after him and they narrated from Ja`far that he said that al-Qa’im is called after the prophet of the Torah (etc…)] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[A group of them stopped(Waqf) at abi al-Hasan Musa and claimed that he is alive and that he’s the awaited(al-Muntazar) Mahdi while another group of them said that he died by he shall be resurrected and he’s al-Qa’im. The Waqifah then differed regarding al-Rida and those who later came from the family of Muhammad (saw) after abi al-Hasan Musa, some of them said they were the deputies of abu al-Hasan and his generals and judges until the time of his appearance and that they aren’t Imams and they never claimed it at all. The others said they were misguided, sinful oppressors and they harshly criticized al-Rida and made Takfir on him and his progeny. Then an odd group who were once upon truth adopted a very silly belief so they denied abi al-Hasan’s death and imprisonment and claimed that this was an illusion to fool the people and claimed that he was alive in occultation, he was the Mahdi (etc…)] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>12) Muhammad bin `Abdullah “al-Nafs-ul-Zakiyyah son of al-Muthanna”:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group of the “Jaroudiyyah” claimed Ghaybah for a couple of individuals.<\/p>\n<p style=\"text-align: justify;\">[It had been attributed to some of them that they believed in Ghaybah, as in the belief of a hidden leader whose appearance is awaited as the Imamiyyah believed. This was narrated by abu `Isa al-Warraq who said: The Jaroudiyyah differed, some said that Muhammad bin `Abdullah (bin al-Hasan bin al-Hasan bin `Ali bin abi Talib) is alive, he isn’t dead and will appear.] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\">Note: abu `Isa is Muhammad bin Haroun al-Warraq [d.247AH] a companion of the disbeliever Ibn al-Rawandi, he is a Mu`tazili and the Ithna `Ashari Shia consider him from their companions, he wrote about sects and comparative religion.<\/p>\n<p style=\"text-align: justify;\">[When abu Ja`far died, his companions split into two groups: The first believed in the Imamah of Muhammad bin `Abdullah bin al-Hasan bin al-Hasan bin `Ali bin Abi Talib who revolted in Madinah and was killed there. They claimed that he was al-Qa’im al-Mahdi and he is the Imam while denying his death. They said he is alive, not dead and he lives in a mountain (…etc…) according to them he dwells therein until his appearance because the messenger (saw) said: “The Qa’im al-Mahdi’s name matches mine and his father’s name matches my father’s.”] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They differed on the identity of the awaited Imam, is he Muhammad bin `Abdullah bin al-Hasan who was killed in al-Madinah in the time of al-Mansour. A sect claimed it and said he wasn’t killed.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>13) Muhammad bin al-Qasim “abu Ja`far al-Taliqani”:<\/strong><\/p>\n<p style=\"text-align: justify;\">Another of the Zaydi extremists claimed it for Muhammad al-Sufi bin al-Qasim bin `Ali bin `Umar bin `Ali bin Husayn bin `Ali ibn abi Talib.<\/p>\n<p style=\"text-align: justify;\">[Another group claimed similarly (the occultation) in Muhammad bin al-Qasim al-Taliqani] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\">[Or is he (The awaited Qa’im) Muhammad bin al-Qasim bin `Ali bin al-Husayn the one from al-Taliqan who was imprisoned by (Caliph) al-Mu`tasim until he died. A sect has claimed this and denied his death.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>14) Yahya bin `Umar “abu al-Husayn Sahib al-Koufah”:<\/strong><\/p>\n<p style=\"text-align: justify;\">Another group from the “Jaroudiyyah” claimed it for Yahya bin `Umar bin Yahya bin Husayn bin Zayd bin `Ali bin Husayn bin `Ali bin abi Talib.<\/p>\n<p style=\"text-align: justify;\">[And a group said about Yahya bin `Umar the one (who rebelled) in al-Koufah similarly (that he was in Ghaybah and will return)] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\">[Or is he (The awaited Qa’im) Yahya bin `Umar the one from al-Koufah, from the descendants of Zayd bin `Ali, he called for his own leadership and a great group followed him but he was killed in the time of (Caliph) al-Musta`in Billah thus a third group believed in him and denied his death.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>15) Husayn bin al-Qasim bin `Ali “Al-`Ayani”:<\/strong><\/p>\n<p style=\"text-align: justify;\">Husayn bin Qasim bin `Ali bin `Abdullah bin Muhammad bin al-Qasim was claimed to be the awaited one, by a sect of the Shia in Yemen.<\/p>\n<p style=\"text-align: justify;\">[The “Mutarrifiyyah” are the followers of Mutarrif bin Shihab, they separated from the “Zaydiyyah” in many of their opinions and fundamentals which led many of the Zaydi scholars to label them as disbelievers. As for the “Husayniyyah” they exclusively claimed that al-Husayn bin al-Qasim bin `Ali who was killed in Raydah (in Yemen) had not died and that he must reappear before his death and these two sects are extinct] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\"><strong>16) Abu Muslim al-Khurasani:<\/strong><\/p>\n<p style=\"text-align: justify;\">A branch of the “Kaysaniyyah” practiced great Ghulu and claimed “Mahdawiyyah” for their leaders.<\/p>\n<p style=\"text-align: justify;\">[A group from them called the “Muslimiyyah” the companions of aba Muslim `Abdul-Rahman al-Khurasani, they said he was the Imam after he was killed, and they claimed he was alive, he never died nor was he killed. They permitted the prohibitions (of Islam), abandoned the obligatory duties and considered that faith was simply reduced to knowing their Imam (of their time).] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[They used to be attributed to a leader they had called Rizzam, from them are those who claimed that aba Muslim is alive and did not die, and they worshipped by dropping obligatory acts (such as Salat, Siyam &amp; Zakat)] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[People from the “Rafidah” in Khurasan that appeared in the era of abu Muslim al-Khurasani and embraced the belief of the “Hulouliyyah”, they claimed that the divine godly spirit had united with abu Muslim’s body, and they claimed his Imamah.] (Ibn al-Murtada)<\/p>\n<p style=\"text-align: justify;\"><strong>17) Muhammad bin `Abdullah “Descendant of al-Husayn”:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group of Shia called “al-Mughiriyyah” claimed that he was the Mahdi.<\/p>\n<p style=\"text-align: justify;\">[Then Muhammad bin `Abdullah bin al-Hasan bin al-Husayn bin `Ali ibn abi Talib who rebelled in Madinah. They said he is alive and never dies nor was he killed, he is al-Qa’im al-Mahdi who lives in a mountain called al-Tamiyah (…etc…) that he is the Imam after Muhammad bin `Abdullah until he emerges and fills the earth with justice as it was filled with oppression.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\"><strong>18) Al-Hasan bin `Ali “al-`Askari”:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group of the “Qat`iyyah” from the companions of al-Hasan al-`Askari claimed that he is the Mahdi and by doing so became “Waqifah”.<\/p>\n<p style=\"text-align: justify;\">[One group said that al-Hasan bin `Ali is alive not dead, but he only disappeared and he is al-Qa’im, for it is impossible for him to die not leaving an acknowledged son since the earth cannot be devoid of an Imam. We have established the Imamah of al-Hasan bin `Ali, furthermore the narration states that the Qa’im has two Ghaybahs, this was one of them and he shall reappear and be known before his second Ghaybah.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[A group said that al-Hasan is alive and not dead, he is al-Qa’im and it isn’t permitted for him to pass away apparently without leaving a son as the earth cannot be devoid of an Imam, we have also narrated that the Imam has two Ghaybahs as he will appear and be known and then reappear after a second Ghaybah. A second group said al-Hasan died but he shall be resurrected since he is al-Qa’im and we think that the word Qa’im (The one to rise) means that he shall rise after death.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\"><strong>19) Muhammad bin `Ali “al-`Askari”:<\/strong><\/p>\n<p style=\"text-align: justify;\">He is the brother al-Hasan al-`Askari and a group of al-Hasan’s Shia claimed Mahdawiyyah for him after al-Hasan died without leaving behind a son.<\/p>\n<p style=\"text-align: justify;\">[When `Ali bin Muhammad bin `Ali bin Musa al-Rida died, a group from his companions believed in the Imamah of his son, Muhammad, who died in (the city of) Surra-man-Ra’a (Samarra’) during his father&#8217;s life, they also claimed he was alive and he never died, their argument was that his father pointed to him and informed them of his Imamah after him. They said that the Imam cannot lie nor can al-Bada’ occur in such matters; they said that even though his death appears to have taken place in his father’s time but in reality he didn’t die, his father had feared for him so he hid him (Ghayyabahu) and he was al-Mahdi] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">Note: Al-Bada’ is the popular belief that some early Shia had, it means that Allah may change his judgment based on the changing circumstances and that things appear to be a certain way to Him but then something else would happen so He would alter His judgment as a result. The expert scholars said that this was a ruse used by the Shia in case their “divine predictions” fail and so al-Bada’ would be their excuse just as Taqiyyah is an excuse for their contradictions.<\/p>\n<p style=\"text-align: justify;\">[A fifth group said that al-Hasan died and he was never an Imam, we were wrong to claim it for him since the true Imam was Muhammad bin `Ali the brother of Hasan and Ja`far who died in his father’s life. This is because al-Hasan passed without leaving a son while Ja`far is undeserving since he is openly corrupt and so was al-Hasan although he hides it. Therefore, since both men’s Imamah is false then we realized that the true Imam was Muhammad since he had a progeny and his father pointed to him and he is al-Qa’im al-Mahdi and nobody else otherwise Imamah falls.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">[A group from them said that the Imam after abu al-Hasan is Muhammad bin `Ali the brother of abu Muhammad. They claimed that his father `Ali had appointed him during his life but this Muhammad died in his father’s life so they rejected his death and they claimed he never died and he is the living awaited Imam.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>20) Ja`far bin `Ali “al-`Askari”:<\/strong><\/p>\n<p style=\"text-align: justify;\">He was called “al-Kazzab” by the followers of his brother and they denied him the status of Imamah especially since he denied that his brother al-Hasan had any children but another group of his father’s Shia had another opinion.<\/p>\n<p style=\"text-align: justify;\">[They believed in the Imamah of Ja`far based on that and debated others about it. This group is very harsh against abu Muhammad al-Hasan bin `Ali, they accuse him and those who followed him of disbelief. They also go to extremes in their belief concerning Ja`far and claimed he was al-Qa’im and preferred him over the commander of believers `Ali ibn abi Talib as well as al-Hasan wal-Husayn and the rest of the Imams and their reason for doing so is that: The Qa’im is the best of creations after the messenger of Allah (saw).] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[A few from the group deviated from the original path and said that the Imam after Muhammad bin `Ali bin Muhammad bin `Ali bin Musa is his brother Ja`far bin `Ali and they claimed that his father pointed to him after Muhammad and that he is the Qa’im after his father] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>21) Muhammad “The first” bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">A son some group claimed al-Hasan had two years before his death and he is the Mahdi.<\/p>\n<p style=\"text-align: justify;\">[The sixth group said that al-Hasan bin `Ali had a son called Muhammad and he pointed to him and thus it isn’t as they claimed that he passed without successors. How can he be an established Imam and the executor of his father’s will as was popular among the closest of people as well as the general public and then he dies without a successor!? Rather, his successor is present and born two years before his death (…etc…) They claimed that his father ordered him to hide during his life out of fear for him so he is hiding and scared from his uncle Ja`far and others from his enemies and this is one of his Ghaybahs so he is al-Imam al-Qa’im. He was known in his father’s life and he appointed him and he has no other children so he is without a doubt the Imam.] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[The sixth group said that al-Hasan bin `Ali had a son unlike they said about his death without children and his name was Muhammad, born two years before his father’s passing, he is afraid and hiding from Ja`far (his uncle) and others from his enemies and he is the Imam al-Qa’im.] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\"><strong>22) Muhammad “The second” bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">A son some group claimed al-Hasan had eight months after his death and he is the Mahdi.<\/p>\n<p style=\"text-align: justify;\">[The seventh said: Rather, his son was born eight months after his passing, as for those who claimed that he had a son during his life then they’re liars and impostors. If that were the case then it (the pregnancy) would not have been hidden just as previous ones weren’t hidden. However, he passed without having any known children and one cannot be so arrogant in these matters nor must one deny what was witnessed in plain sight and known by all. In previous pregnancies the matter was established and apparent and recorded by the Sultan while being witnessed by the common folk but in this case his inheritance wasn’t even split due to this issue, so he had a son who was born eight months after his death and he requested that he be named Muhammad. This was what he willed and he is hidden and unseen. This group used as evidence and argument what was narrated from abu al-Hasan al-Rida: “You shall be trialed through the fetus in his mother’s womb and the infant.” They said this was him (meaning Muhammad bin al-Hasan).] (Al-Qummi &amp; al-Nawbakhti)<\/p>\n<p style=\"text-align: justify;\">[The seventh said: No, he had a son who was born eight months after his death and as for the son they claimed was born two years before his death, this is false since it cannot be hidden and one must not be so arrogant since there was a pregnancy after his passing and this was claimed (by some)] (Ibn Hamdan al-Razi)<\/p>\n<p style=\"text-align: justify;\">NOTE: What is ironic is that the Shia sect called “Ithna `Ashariyyah” or “twelver” who is dominant in our days believes that the 12<sup>th<\/sup> Imam was five years old when his father passed away. In other words, they disagree with the above-mentioned teams.<\/p>\n<p style=\"text-align: justify;\">[His (12<sup>th<\/sup> Imam’s) age at the time of his father’s death was five years old when Allah had given him wisdom, decisive speech and made him a sign for the worlds] (Al-Irshad al-Mufid)<\/p>\n<p style=\"text-align: justify;\">We shall mention them below.<\/p>\n<p style=\"text-align: justify;\"><strong>23) Muhammad “The third” bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">The one born five years before his father’s death.<\/p>\n<p style=\"text-align: justify;\">[Many of them said that his age was five years at that point since his father passed away at two-hundred sixty and the birth of al-Qa’im was in the year two-hundred fifty five] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>24) Muhammad “The fouth” bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">[Some said, he was born in the year two-hundred fifty two and that his age at his father’s passing was eight. They claimed that his father never died until Allah perfected his intellect and taught him wisdom and decisive speech and made him unique from among all his creations (…etc…) And they said the one responsible for this affair is alive not dead, and he never dies even if he remained for a thousand years until he fills the earth with (…etc…) At the time of his appearance he shall be a strong young man who is in his thirties and this was from his miracles and this was from his signs.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\">Note: Al-Mufid didn’t know how right he was since the so called savior has been absent for more than a thousand two-hundred years now.<\/p>\n<p style=\"text-align: justify;\"><strong>25) Muhammad “The fetus” bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group apparently claimed that the Ghaybah of this so called Mahdi is in his mother’s womb.<\/p>\n<p style=\"text-align: justify;\">[A group said that aba Muhammad died without an apparent child. However, there was pregnancy in his female servants and the Qa’im after al-Hasan is the one carried by his mother and that she never gave birth to him yet but it’s permitted for her to remain pregnant for a hundred years until she delivers him then he’d appear.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>26) Muhammad “The deceased” bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group claimed their Mahdi was dead but will return from death at the end of times.<\/p>\n<p style=\"text-align: justify;\">[Another group said: The Imam after al-Hasan is his son Muhammad, he is the awaited one. However, Muhammad died but he shall be revived and will rise with the sword to fill the earth with justice and equality just as it was filled with (etc..)] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>27) `Ali bin al-Hasan:<\/strong><\/p>\n<p style=\"text-align: justify;\">A group said they believed al-Hasan had a son but decided his name was `Ali.<\/p>\n<p style=\"text-align: justify;\">[A group said that the Imam after al-Hasan is his awaited son and that he is `Ali bin al-Hasan and not Muhammad bin al-Hasan like the “Qat`iyyah” claim. This group literally believed in the same things the “Qat`iyyah” did concerning the occultation and the waiting word for word.] (Al-Majlisi)<\/p>\n<p style=\"text-align: justify;\"><strong>28) Mahdies after the Mahdi:<\/strong><\/p>\n<p style=\"text-align: justify;\">In fact, the Shia sects where so out of control and far from Allah’s guidance that they began to claim a large number of Mahdies to appear after their Mahdi.<\/p>\n<p style=\"text-align: justify;\">[From abi Hamzah, from abi `Abdillah (as) in a long narration that he said: “O aba Hamzah, after al-Qa’im there shall be eleven Mahdies from us from the progeny of al-Husayn (as).”] (Bihar-ul-Anwar al-Majlisi)<\/p>\n<p style=\"text-align: justify;\">[From Amir-ul-Mu’minin (as), he said: The messenger of Allah (saw) said on the night of his death to `Ali (as): “O aba al-Hasan, bring me a pen and paper” So he (saw) wrote his entire will until he reached one section then said: “O `Ali, there will be after me twelve Imams and after them shall come twelve Mahdies. You O `Ali are the first of the twelve Imams.”] (Bihar-ul-Anwar al-Majlisi)<\/p>\n<p style=\"text-align: justify;\">-End of list-<\/p>\n<p style=\"text-align: justify;\"><strong><br \/>\n<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong>-The split of the Imamiyyah after the death of the 11<sup>th<\/sup> Imam-<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">As for the confusion of the followers of the `Askari Imams from the descendants of al-Rida, they became confused and split into many groups (around twenty) after the death of al-Hasan al-`Askari without any children to succeed him. Below we will quote the work by J. M. Husayn and in order to give our readers a description of how confused the Shia were concerning this alleged 12<sup>th<\/sup> Imam.<\/p>\n<p style=\"text-align: justify;\">We quote J. M. Husayn below:<\/p>\n<p style=\"text-align: justify;\">Sa’d al-Qummi counted fifteen schisms, whereas al-Nawbakhti and al-Mufid enumerated them as fourteen. Al-Mas`udi thinks that there were twenty sects (in al-Murouj), while al-Shahristani counts only eleven. Nevertheless a study of the claims of these factions reveals that there were apparently only five major schisms.<\/p>\n<p style=\"text-align: justify;\">However, each of these became further split over the theological and traditional arguments employed to support their claims. At any rate it seems important to set down the major claims of these schisms in order to achieve a clear conception of the Imamiyyah at that time.<\/p>\n<p style=\"text-align: justify;\"><strong>Schism I: the Waqifah at al-`Askari<\/strong><\/p>\n<p style=\"text-align: justify;\">What brought the people of this faction together was their claim that the eleventh Imam, al-`Askari, was al-Qa’im al-Mahdi although they differed as to how he became al-Qa’im.<\/p>\n<p style=\"text-align: justify;\">i) The first faction of this schism deemed that al- `Askari had not died, but had gone into occultation. They based their assumption on the traditions reported from the previous Imams, which said that an Imam could not die without having a publicly acknowledged son to succeed him, because the world cannot be without a Proof.<\/p>\n<p style=\"text-align: justify;\">While the people were not obliged to accept the Imamate of those who were now laying claim to it, they should acknowledge the Imamate of al­`Askari whose Imamate had been confirmed by the testament of the former Imam. They also maintained that they had a tradition which said that al-Qa’im had two occultations.<\/p>\n<p style=\"text-align: justify;\">Therefore, since al-`Askari had not left a publicly acknowledged son and since the earth cannot remain for an hour without a Proof, it was right to claim that he had not died but was hidden, and that he was truly al-Qa’im.<\/p>\n<p style=\"text-align: justify;\">This was his first occultation, after which he would rise again. Then, when his rising became known, he would conceal himself once more in his second occultation.<\/p>\n<p style=\"text-align: justify;\">In their discussions with their opponents, they tried to distinguish themselves from the Imamiyyah who had stopped at the seventh Imam, Musa al-Kadhim (183\/799), claiming he was al-Qa’im al-Mahdi, by faulting them for stopping at al-Kadhim. They pointed out that he had died and left his successor, `Ali al-Rida (202\/817) as well as other sons, while al-`Askari had obviously passed away and left no heir.<\/p>\n<p>ii) The second faction of the Waqifah at al-`Askari believed that he had died, but was then raised to life, and was al-Qa’im al-Mahdi Basically, the members of this faction established their doctrine on a transmission from Imam Ja`far al-Sadiq, who said that al-Qa’im was called al-Qa’im because he would &#8220;rise&#8221; again after his death. They stated that it was certain that al-`Askari had died without leaving a successor and without designating anyone as his legatee.<\/p>\n<p style=\"text-align: justify;\">Thus there was no doubt about his being al-Qa’im, nor about his being alive after death, although he concealed himself for fear of his foes. They supported their theories with a saying of Imam `Ali bin Abi Talib, contained in his advice to his follower <a href=\"http:\/\/twelvershia.net\/2015\/01\/22\/dua-kumayl-not-authentic\/\" rel=\"external nofollow\">Kumayl <\/a>bin Ziyad, &#8220;O Allah, indeed You do not leave the earth without a Qa’im with proof from You, whether manifest or hidden, for then Your proofs and Your signs would be invalidated.&#8221;<\/p>\n<p style=\"text-align: justify;\">On the basis of `Ali&#8217;s words they concluded that al-`Askari was absent and hidden, but that he would rise to fill the earth with peace and justice after it had been filled with tyranny.<\/p>\n<p style=\"text-align: justify;\">iii) Al-Waqifah al-la Adriyyah also stopped at al-`Askari. They deemed that he had died and had been the Imam. Although the earth could not be without a Proof from Allah, they were not sure who had succeeded al-`Askari, his son or his brother. Therefore they stopped at the Imamate of al-`Askari, and decided to make no decision until the matter became clear to them.<\/p>\n<p style=\"text-align: justify;\">Unfortunately, the contemporary sources do not mention anyone as representing the three factions of al-Waqifah at al-`Askari. However, from the doctrine of the first faction of the Waqifah, it seems that its partisans lived in places which were far from Samarra’, the city of the Imam. Since they were not present at the moment of his death, they tended to believe that he had not in fact died, but was al-Qa’im al-Mahdi.<\/p>\n<p style=\"text-align: justify;\"><strong>Schism II: The Ja`farites<\/strong><\/p>\n<p style=\"text-align: justify;\">The representatives of this schism claimed that the Imam after al­`Askari was his youngest brother, Ja`far, but they differed as to how the Imamate had passed on to him, and therefore split into four factions.<\/p>\n<p style=\"text-align: justify;\">i) The first faction believed that al- `Askari had died and that he had held the Imamate by the testament of his father. Since the Imamate can only pass to the eldest living son of the former Imam, the Imamate passed from `Ali al-Hadi not to his eldest son Muhammad, who had died before him, but to al-`Askari, who was the elder of the two sons who had outlived their father.<\/p>\n<p style=\"text-align: justify;\">This faction believed that al-`Askari had not left a publicly acknowledged son to take over the Imamate and, therefore, his sole remaining brother, Ja`far, was the Imam. In order to support their dogma they were obliged to repeat the Fatahiyyah&#8217;s arguments about the Imamate. The latter claimed that Musa al-Kadhim received the Imamate, not from his father Ja`far al-Sadiq, but from his eldest brother `Abd Allah, according to the tradition which says that the Imamate passes on to the eldest son of the Imam when he dies.<\/p>\n<p style=\"text-align: justify;\">Like the Fathiyya, this faction of the Ja`farites accepted the authenticity of the tradition which says that the Imamate will not fall to two brothers after al-Hasan and al-Husayn. But they maintained that this could only be applied if al-`Askari had left a son. Since al-`Askari had passed away without leaving a publicly acknowledged successor, his brother Ja`far was the designated Imam and the Imamate would pass on in his offspring.<\/p>\n<p style=\"text-align: justify;\">They also recognized `Abd Allah bin Ja`far al-Sadiq as the seventh Imam. Consequently Ja`far was thirteenth in the chain of Imams.<\/p>\n<p style=\"text-align: justify;\">ii) The second faction of the Ja`farites contended that the eleventh Imam had himself designated Ja`far as his successor according to the principle of al-Bada&#8217;. The same thing had happened in the case of Isma`il, the eldest son of Imam Ja`far al­Sadiq. God had clarified His ultimate decision concerning him by taking away his soul and placing his brothers `Abd Allah and Musa consecutively in the Imamate instead.<\/p>\n<p style=\"text-align: justify;\">Similarly, in the case of Ja`far bin `Ali, God had entrusted al-`Askari with the Imamate, but thereafter He had made it clear that the Imamate should not pass on in the progeny of al-`Askari. Therefore He transferred it to his brother Ja`far, who was the Imam after al-`Askari&#8217;s death. Like the previous factions, this faction used the argument and dogma of the Fatahiyyah to support their viewpoint.<\/p>\n<p style=\"text-align: justify;\">This sect was probably more popular than the first among the theologians, especially in Kufah. Its leader was a Kufi theologian called `Ali bin Tahl or al-Talhi al-Khazzaz, who had been famous amongst the surviving members of the Fatahiyyah for his skill in theological discussions. He upheld Ja`far&#8217;s Imamate and encouraged people to take his side. He was supported in his propaganda by the sister of Faris bin Hatim bin Mahawiyyah al-Qazwini, although she rejected the Imamate of al- `Askari and claimed that the Imamate had been transferred to Ja`far from his father, `Ali al-Hadi.<\/p>\n<p style=\"text-align: justify;\">She may have had this claim because her brother, Faris bin Hatim, was killed on the order of al- `Askari. It is also possible that the Kufan scholastic family Banu Faddal, who were active supporters of the Fatahiyyah, adopted the doctrine of this faction, especially Ahmad bin al-Hasan bin `Ali bin Muhammad bin Faddal, who died in 260\/874, and his brother `Ali.<\/p>\n<p style=\"text-align: justify;\">iii) The members of this faction claimed that the Imamate had passed on to Ja`far through the designation of his father. They based their doctrine on a tradition attributed to Ja`far al-Sadiq, which states that the Imamate cannot be held by two brothers after al-Hasan and al-Husayn. Since Muhammad, the eldest son of `Ali al-Hadi, died during the lifetime of his father, and since the Imamate should belong to those who survive the death of their father, it had not been transferred to Muhammad.<\/p>\n<p style=\"text-align: justify;\">They may have accepted the Imamate of al-`Askari because he was the eldest son after the death of his father, but they rejected his Imamate after his death, because he had passed away without leaving a publicly acknowledged son as his successor. It was a matter of course to them, they said, that the Imam could not die without leaving a publicly acknowledged and well­ known successor, designated by him and entrusted with the Imamate.<\/p>\n<p style=\"text-align: justify;\">Therefore the claim of al-`Askari to the Imamate must be invalid. So it was inevitable that the Imam was Ja`far, by the designation of his father.<\/p>\n<p style=\"text-align: justify;\">It is worth mentioning that this faction existed within the lifetime of al- `Askari. When the tenth Imam died in 254\/868 the majority of his followers accepted the Imamate of his eldest surviving son, al­`Askari, as confirmed by the testament of his father, but a minority took Ja`far&#8217;s side. He became more powerful after al- `Askari&#8217;s death, since some of al- `Askari&#8217;s adherents abandoned his Imamate and accepted that of Ja`far. A leading scholar of this faction was `Ali bin Ahmad bin Bashshar, who wrote a book on the Ghaybah and disputed fiercely with his opponents.<\/p>\n<p style=\"text-align: justify;\">There is some evidence that this faction achieved a certain degree of success by persuading a few of the people who had accepted al- `Askari&#8217;s Imamate to join their side. Al-Saduq and al-Majlisi report a letter attributed to the Twelfth Imam, and sent to his agent, `Uthman bin Sa`id al-`Umari. This letter reveals that an adherent of this faction argued with a Twelver called al-Mukhtar, and succeeded in making him accept the Imamate of Ja`far. The sister of Faris bin Hatim, who was mentioned above, was one of the partisans of this group.<\/p>\n<p style=\"text-align: justify;\">iv) The followers of this faction were called al-Nafisiyyah. They believed that the tenth Imam had designated his eldest son Muhammad as his legatee. Then, according to the principle of Bada&#8217;, Allah took away his life while his father was still alive.<\/p>\n<p style=\"text-align: justify;\">But when Muhammad bin `Ali passed away, by the order of his father, he designated his brother Ja`far as his successor. He entrusted his testament, the books, the secret knowledge and the weapons needed by the community to his trustworthy young slave called Nafis. And he ordered him to hand them over to his brother Ja`far when his father died.<\/p>\n<p style=\"text-align: justify;\">However, when Muhammad died, the adherents of al-`Askari discovered the secret arrangement and the role of Nafis. Since Nafis was afraid of them and feared that the Imamate might be cut short, he called Ja`far and handed over the trust of Muhammad bin `Ali al­ Hadi. Ja`far himself claimed that the Imamate had been passed to him from his brother, Muhammad.<\/p>\n<p style=\"text-align: justify;\">The members of this faction denied the testament of al-Hasan al-`Askari, because his father, they claimed, had neither designated him nor changed his testament from Muhammad. Nafis was killed by being drowned in a well.<\/p>\n<p style=\"text-align: justify;\"><strong>Schism III: The Muhammadiyyah<\/strong><\/p>\n<p style=\"text-align: justify;\">This sect denied the Imamate of Ja`far and al-`Askari and considered Muhammad, who had died in the lifetime of his father, as their Imam. They argued that `Ali al-Hadi, the tenth Imam, had neither designated nor indicated either al-`Askari or Ja`far as his legatee. Therefore neither of them had any right to make claims upon the Imamate.<\/p>\n<p style=\"text-align: justify;\">Since the Imam could not die without leaving a successor, and since al-`Askari had passed away and not left a publicly acknowledged or well-known son, his Imamate was invalidated. Ja`far, they added, was not worthy of putting forward a claim because his immorality and sinfulness were infamous. His wicked character could not be prudent fear (Taqiyyah) in the face of his enemies, for Taqiyyah cannot be practiced by committing sins.<\/p>\n<p style=\"text-align: justify;\">They concluded that since it was forbidden for the Imamate to be nullified, they were obliged to return to the Imamate of Muhammad bin `Ali, since he had left offspring and his acts were distinguished by probity and virtue. Others of them even considered him as al-Qa’im al-Mahdi and some of them went as far as to deny his death.<\/p>\n<p style=\"text-align: justify;\"><strong>Schism IV: The Qat`iyyah<\/strong><\/p>\n<p style=\"text-align: justify;\">This faction constituted the greater portion of the Imamiyyah. They believed that al-`Askari had died and left a son to succeed him, but they differed about the day of his birth, his name, and whether or not he was al-Qa’im al-Mahdi. For this reason they split into six groups:<\/p>\n<p style=\"text-align: justify;\">i) The first group maintained that al- `Askari had died and left a son called Muhammad. According to Sa`d al-Qummi, they held that his son had come of age, while, according to al-Nawbakhti and al-Shahristani, they believed that he had been born two years before his father&#8217;s death. He was the Imam because his father had designated him so, and because it was well-known that al- `Askari had left no other son. So inevitably he was the Imam and al-Qa’im.<\/p>\n<p style=\"text-align: justify;\">But due to fear of his uncle, Ja`far, he went into concealment and this became one of his occultations. This group built their doctrine on a tradition attributed to Ja`far al-Sadiq, which says that al-Qa’im&#8217;s date of birth is hidden from the people, information concerning him is obscure, and the people cannot know him.<\/p>\n<p style=\"text-align: justify;\">Unfortunately little is known about this faction, but al-Saduq, while trying to prove the birth of the Twelfth Imam, mentions traditions which are presumably attributed to this faction&#8217;s adherents. One of these was called Ya&#8217;qub bin Manfush, who claimed that he had visited al-`Askari and asked him about his successor. Al-`Askari showed him his son, who was between eight and ten years old, indicating that his son would succeed him. Another was called Daw&#8217; bin Ali al-`Ijli, who maintained that he had met al-`Askari in his house where he saw his son, who was then two years old.<\/p>\n<p style=\"text-align: justify;\">ii) The members of this group held the same dogma as the previous faction. They agreed with them on the death of al- `Askari, but they thought that he had left a successor whose name was not Muhammad but &#8216;Ali. They said that al-`Askari had no son except &#8216;Ali, who had been seen by his father&#8217;s trustworthy followers. According to Sa`d al-Qummi this sect had few adherents and they were concentrated within the suburbs (the Sawad) of Kufah.<\/p>\n<p style=\"text-align: justify;\">iii) This sect held that the Imam after al-`Askari was his son, who had been born eight months after his father&#8217;s death and had then gone into concealment. They argued that those who claimed that a son was born to him during his lifetime were making false statements, because al- `Askari had died without leaving a publicly acknowledged son.<\/p>\n<p style=\"text-align: justify;\">But the pregnancy had been known to the caliph as well as other people, and for this reason the caliph delayed dividing his share in the state until the pregnancy was proved invalid. In fact, they said, the son was born eight months after the death of his father and was ridden, and his father had ordered that he be called Muhammad.<\/p>\n<p style=\"text-align: justify;\">They based their doctrine on a tradition attributed to the eighth main, `Ali bin Musa al-Riďa, which says, &#8220;You would test the fetus which is within the womb of his mother, and the suckling child.&#8221;<\/p>\n<p style=\"text-align: justify;\">iv) The partisans of this faction held that al-`Askari had no sons at all. The arguments about a hidden son, who was born during the lifetime of al- `Askari, were rejected by them, because they had searched for him during the life of the eleventh Imam using various means, but had failed to find him.<\/p>\n<p style=\"text-align: justify;\">But since the Imam cannot die without leaving an heir, they claimed that a slave girl had conceived a child belonging to al- `Askari, and that when she gave birth to him he would be the Imam, even if, as they are reported to have said by al-Mufid, the pregnancy should last a hundred years. They established their doctrine on a tradition of al-Sadiq, which states that al-Qa’im is he whose conception and date of birth are hidden from the people.<\/p>\n<p style=\"text-align: justify;\">v) This faction held that the Imam after al- `Askari was his son Muhammad, who was the Awaited One (al-Muntazar). They claimed that he had died but would rise to life with the sword to fill the earth with peace and justice after it had been filled with tyranny and injustice.<\/p>\n<p style=\"text-align: justify;\">This group is mentioned neither by Sa`d al-Qummi nor by al-Nawbakhti. Presumably the latter dealt with it but this discussion was later dropped from his work, since al-Mufid who based his information on al-Nawbakhti&#8217;s work, mentions this group in al­`Uyun wal-Mahasin.<\/p>\n<p style=\"text-align: justify;\">vi) This group, entitled the Imamiyyah by Sa`d al-Qummi and al-Nawbakhti, held that al- `Askari had died and that inevitably Allah&#8217;s Hujjah (proof) on earth was his son. He was his sole successor and legatee, charged with the affairs of the Imamate after him in accordance with the method laid down by previous tradition. Thus the Imamate should pass on to his offspring until the Day of Resurrection, but he was absent and hidden by an order.<\/p>\n<p style=\"text-align: justify;\">It was prohibited to seek him out before he chose to manifest himself, because his adherents would endanger his life and their own if they looked for him. In spite of his occultation a few reliable followers could contact him. He was born on 15th Sha&#8217;ban 256\/29th July 868.<\/p>\n<p style=\"text-align: justify;\">Basically this group directed their arguments against those factions which supported the Imamate of Muhammad and Ja`far. With the partisans of Muhammad they argued that the Imamate could be held neither by the descendants of Muhammad, who had died during his father&#8217;s lifetime, nor by his legatee, such as his brother or someone else, because there was no evidence or proof for accepting the Imamate of a son who had died before his father. Perhaps this argument was also directed against the Nafisiyyah.<\/p>\n<p style=\"text-align: justify;\">Presumably with the Ja`farites they argued that the Imamate could not pass from brother to brother after al-Hasan and al-Husayn, and that the Imamate should fall to the eldest son of the preceding Imam. The eleventh Imam al- `Askari, was designated by the testament of his father, so the Imamate had to pass to his offspring. They also said that it was improper for the faithful to select an Imam for themselves. Allah had to choose him and to manifest him at the proper time.<\/p>\n<p style=\"text-align: justify;\">This faction constituted the majority of the Imamiyyah who had accepted the Imamate of al- `Askari, such as Abu Sahl Isma`il bin `Ali al-Nawbakhti, al-Hasan bin Musa al-Nawbakhti, Sa`d bin `Abd Allah al-Ash`ari al-Qummi (the author of Kitab al-Maqalat wal-Firaq), `Uthman bin Sa`id al- `Umari and his son Muhammad.<\/p>\n<p style=\"text-align: justify;\"><strong>Schism V: The Cessation of the Imamate<\/strong><\/p>\n<p style=\"text-align: justify;\">This group held that from the moment al-`Askari died there was no longer an Imam. Al-Nawbakhti, al-Mufid and al-Shahristani considered this group as one faction, whereas Sa`d al-Qummi was presumably more accurate when he divided it into two, since the partisans of this schism agreed on the death of al-`Askari and the cessation of the Imamate, while they differed on the dogma of al-Qa’im al-Mahdi as follows:<\/p>\n<p style=\"text-align: justify;\">i) The first group deemed that it had been confirmed by successive transmission that al-`Askari would die without leaving a successor. For this reason there was no Imam after al-`Askari and the Imamate ceased. This, they contended, was reasonable and permitted. Since the cessation of the prophecy after Muhammad was possible, the cessation of the Imamate was also possible.<\/p>\n<p style=\"text-align: justify;\">They established their doctrine on a transmission attributed to the sixth Imam, Ja`far al-Sadiq, which states that the earth cannot be without a Proof unless Allah becomes angry at the sins of His creatures and retains him from them for as long as He wills. This group did not believe in the rising of al-Qa’im al-Mahdi.<\/p>\n<p style=\"text-align: justify;\">ii) The people of the second group held the same doctrine as the previous faction, but they separated from them over the dogma of al-Qa’im al-Mahdi They said that since al-`Askari had passed away without leaving a successor, the Imamate had ceased until Allah raised the Qa&#8217;im from among the Imams who had died, such as al-Hasan al- `Askari, or from among any of his descendants.<\/p>\n<p style=\"text-align: justify;\">Furthermore the rising of al-Qa’im al-Mahdi was inevitable because this was confirmed by successive tradition. They considered the period after the death of al- `Askari and the rise of al-Qa’im as an interval of time devoid of prophecy and Imamate, like the period between Jesus and Muhammad.<\/p>\n<p style=\"text-align: justify;\">There is some evidence that many people from various countries doubted the existence of the Twelfth Imam, such as Muhammad bin Ali bin Mahzayar al-Ahwazi from al-Ahwaz, and many of the persons from Banu Talib in Medina who had been agents of the eleventh Imam.<\/p>\n<p style=\"text-align: justify;\">This historical and theological survey suggests that on the death of al- `Askari, the Imamiyyah fell into problems similar to those which had beset them after the death of the seventh Imam, Musa al-Kadhim. They split into al-Waqifah, Muhammadiyyah, Ja`fariyyah and Qat`iyyah.<\/p>\n<p style=\"text-align: justify;\">(…etc…)<\/p>\n<p style=\"text-align: justify;\">Thus, as al-Mufid and al-Tusi state, all these divisions and splits gradually vanished, except for the Qat`iyyah, who became the Twelvers in the fourth\/tenth century.<\/p>\n<p style=\"text-align: justify;\">-End of quote-<\/p>\n<p style=\"text-align: justify;\"><strong><br \/>\n<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong>-What really happened after the death of the 11<sup>th<\/sup> Imam?-<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">In order to find out what really happened from a historical perspective, aside from the fairy tales and mythical stories invented by the various competing Shia sects, we must turn to the books written by reliable scholars and expert historians.<\/p>\n<p style=\"text-align: justify;\">We quote the leader of the Mu`tazillah al-Qadi `Abdul-Jabbar who quotes from the head of Mu`tazillah aba al-Qasim al-Balkhi [d.329AH]<\/p>\n<p>[He said: And al-Hasan bin `Ali (al-`Askari) died in my time and left behind no children, so they (i.e his followers) became confused.] (Kitab-ul-Imamah min Al-Mughni)<\/p>\n<p style=\"text-align: justify;\">We quote Imam `Ali bin Ahmad ibn Hazm al-Dhahiri [d.456AH]<\/p>\n<p style=\"text-align: justify;\">[Then al-Hasan (al-`Askari) died without leaving behind any descendants, so they (The Shia) split into groups and most believed that al-Hasan had a son whom he had concealed, it was also said that he was born after al-Hasan’s death from a female servant of his called Saqil and this is the most popular story, others said from a servant called Narjis and others said from a servant called Sawsan but what is most apparent in their view is that she was Saqil. This woman called Saqil had claimed pregnancy after the death of her master al-Hasan bin `Ali and this was why his inheritance was frozen for seven years. Ja`far bin `Ali who was al-Hasan’s brother had disputes with her regarding this inheritance so a group of men from the government sided with her staunchly while others sided with Ja`far. Finally, it was revealed that there was no pregnancy and Ja`far acquired his brother’s inheritance; al-Hasan had died in the year two hundred and sixty. Meanwhile, the fanaticism of the Rafidah towards this Saqil and her claims increased so much that (the Caliph) al-Mu`tadid had to imprison her after around twenty years from her masters’ death; she was then found in the house of al-Hasan bin Ja`far al-Nawbakhti the writer so they carried her to the castle of al-Mu`tadid where she remained until she died in (Caliph) al-Muqtadir’s time. They (the Shia) have been waiting for this person since more than a hundred and eighty years.] (Al-Fasl fil-Milal Ibn Hazm)<\/p>\n<p style=\"text-align: justify;\">In other words, as the reader can already tell from all the above, it’s very clear that the 11<sup>th<\/sup> Imam had no children, this in turn led his followers to differ among themselves and divide to many sects which in itself shows that the man had no successor for if he did, then there is no sound explanation for all the chaos above.<\/p>\n<p style=\"text-align: justify;\">Some of al-`Askari’s followers denied his Imamah after they saw that he left no heir while others jumped from him to his brothers Ja`far and Muhammad since they had no choice. The majority were in a very tough spot as they already narrated many reports claiming the man was a legitimate Imam so they couldn’t go back on their words or their necks and livelihoods were on the line, so they decided to tell people that he did in fact have a son and they spread this and they differed on almost every aspect of this son’s existence because they didn’t plan their lies carefully, they would use excuses that his father showed him to only a select few individuals and then hid him from the public eye out of fear for him or that his mother didn’t appear pregnant since Imams are born from the thighs of their mothers not their wombs or that the Imam can grow in one day like an average human grows in one week and that’s how he was able to escape and go into hiding or that he had now disappeared completely but still sends them letters from an unknown location and only one man can communicate with him as an emissary or that his existence must remain a secret and so nobody must utter his name in public or even in written form and the narrations are famous so refer back to the books of the folks.<\/p>\n<p style=\"text-align: justify;\">The above-mentioned group of lunatics is what exists today as “Twelver Shia”, but the reality of the matter is that the man passed without a known heir and what the previous team said was nothing but a claim. The followers of al-`Askari wished to retrieve the fortunes that their deceased Imam received in his life from the naïve Shia, they feared that since he passed away then his inheritance would go to their enemy Ja`far bin `Ali al-`Askari whom they had branded as an immoral liar. Allah knows best whether Ja`far was in reality as they claimed or if he was an upright pious man who suffered a campaign of defamation by rival Shia gangs who opposed his Imamah for it is a known habit of the Shia to try and raise the status of their Imams by insulting others. It also seems that some of the heads of the Shia thought that the best way to prevent this was to claim that al-Hasan had a son who happened to be in his mother’s womb and that one of his father’s female servants was pregnant with him. Knowing how wealthy al-`Askari was he must have had quite a few female servants and so these Shia differed on which one was the mother, some said Narjis, some said Rayhanah and others said Sawsan as well as many others. One of these women called Saqil, -apparently a Nubian slave girl from Africa- she became greedy for her master’s wealth and so she stepped up and openly claimed to be the divine savior’s mother and she was backed by some of the most prominent Shia clerics and figure-heads. However, Ja`far wasn’t going to remain silent and watch his rightful inheritance be stolen by a band of thugs, so he disputed with them and fought them for it until the matter reached the ears of the Sultan. The Sultan then sent expert women to verify whether Saqil was truly pregnant and they exposed her for the liar that she was and Ja`far acquired his right. The Shia are popular for being a stubborn bunch and they never admit their misguidance so even after all of this they kept sanctifying Saqil for twenty years and claiming that she was the hidden Imam’s mother and they became so great in number that the Sultan became cautious so he called for her and they found her hidden in the house of one of the men of Nawbakht, then she was arrested in the palace until her death.<\/p>\n<p style=\"text-align: justify;\">Next we quote Imam abu al-`Abbas ibn Tayymiyyah al-Harrani [d.728AH]<\/p>\n<p style=\"text-align: justify;\">[We say: It was stated by Imam abu al-Husayn `Abdul-Baqi bin Qani` [d.351AH] and Imam abu Ja`far Muhammad bin Jarir al-Tabari [d.310AH] as well as others from the scholars of history and genealogy that al-Hasan bin `Ali al-`Askari had no descendants or children. As for the Imamiyyah who claim that he had a son who entered the cellar while still a child, some of them said: “He was two years old” others said: “He was three” and some said: “He was five”, I say: If this character was in fact present and known, then according to Allah’s laws which were established in the Qur’an, the Sunnah and the consensus, he should be placed under the guardianship of whoever can take care of him such as his mother or his grandmother, and his wealth must be placed under the responsibility of the executor of his father’s will, a near relative or a representative of the Sultan, this is because he is an orphan that lost his father and Allah says: {Test well the orphans, until they reach the age of marrying; then, if you perceive in them right judgment, deliver to them their property; consume it not wastefully and hastily ere they are grown. If any man is rich, let him be abstinent; if poor, let him consume in reason. And when you deliver to them their property, take witnesses over them; God suffices for a reckoner.} [4:6] One cannot hand to this child his money until he reaches the age of marriage and maturity as Allah declared, so how then can a person who can’t be responsible for his own body and property be the leader of all Muslims, immune to error and that the one who denies him is a disbeliever!? Then by their own consensus whether he happened to exist or not, then they do not benefit anything from him in their world or religion, nor did he teach anyone anything and we do not know of a good deed that he accomplished or a bad one, nor did we achieve through him any of the benefits of leadership, or its goals in general. On the contrary, if this character happens to actually exist then his existence is only a cause of harm for the people of the earth, this is because those who insist on believing in him have not benefitted from his grace nor did they fulfill their interests with his aid, while those who deny him will be punished and tortured on the day of judgment according to them. Therefore, he is pure evil, there is no goodness in him whatsoever and this kind of creature cannot be the work of the all-wise God of justice. If they say: “He concealed himself from the people only because of their oppression.” We say: This oppression was also there in the time of his fathers but they never went into occultation (etc…)] (Al-Minhaj Ibn Taymiyyah)<\/p>\n<p style=\"text-align: justify;\">Next we quote Imam Shams-ul-Din Muhammad al-Dhahabi [d.748AH]<\/p>\n<p style=\"text-align: justify;\">[He is the seal of the twelve masters who are said to be infallible by the Imamiyyah -Nobody is infallible except a prophet- This individual called Muhammad is the one they claim is the successor, the divine proof, the owner of the time, the one who entered the cellar in Samarra’ and that he is alive and never dies until he appears and fills the earth with justice as it was filled with oppression. By Allah, we wish this was true but they’ve been waiting for four-hundred and seventy years and the truth is that whoever refers you to an absent leader did not do you justice let alone a non-existent leader! (etc…)<\/p>\n<p style=\"text-align: justify;\">Our Mawla, Imam `Ali: He is from the rightly guided Caliphs, he has been guaranteed heaven may Allah be pleased with him, we love him deeply but we do not claim his infallibility just as we do not claim it for Abu Bakr al-Siddiq.<\/p>\n<p style=\"text-align: justify;\">His sons, Hasan and Husayn: They are the Sibtayn of Rasul-Allah (saw), the masters of the youth of paradise, they are worthy of being Caliphs.<\/p>\n<p style=\"text-align: justify;\">Zayn-ul-`Abidin: Of great repute, from the heads of the pious scholars, worthy of leadership, there were those of his level in his time and they exceeded him in issuing verdicts and narrating.<\/p>\n<p style=\"text-align: justify;\">His son abu Ja`far al-Baqir: A master, a religious leader, a jurist worthy of Caliphate.<\/p>\n<p style=\"text-align: justify;\">His son Ja`far al-Sadiq: Of high status, from the heads of knowledge, he was more deserving of Caliphate than abu Ja`far al-Mansour.<\/p>\n<p style=\"text-align: justify;\">His son Musa: Had big status and descent knowledge, more deserving of Caliphate than Haroun, in his time he had equals in virtue and merit.<\/p>\n<p style=\"text-align: justify;\">His son `Ali: Of high status, he had knowledge and understanding, he was also charismatic, al-Ma’moun made him heir to his throne due to his honor but he died in the year two-hundred and three.<\/p>\n<p style=\"text-align: justify;\">His son Muhammad: From the masters of his people, he did not reach his fathers’ level of knowledge and jusrisprudence.<\/p>\n<p style=\"text-align: justify;\">The same can be said about his son al-Hadi: A venerated man of honorable descent and so was his son al-Hasan al-`Askari.<\/p>\n<p style=\"text-align: justify;\">As for this Muhammad (etc…) They claimed he entered a cellar in his father’s house while his mother looked at him and never came out until this hour and he was seven or less as was said.<\/p>\n<p style=\"text-align: justify;\">Al-Qadi Ibn Khallikan [d.681AH] stated: “It was said: Rather, he entered while he was seventeen in the year two-hundred seventy five. It was also said: Rather, in the year (two-hunded) sixty five and that he is alive.” We seek refuge in Allah from foolishness.<\/p>\n<p style=\"text-align: justify;\">Let’s propose for the sake of the argument that this myth took place then, (we ask) who saw him? Who do we rely on to inform us of his life? Who informed us of his infallibility and vast knowledge? This is clear deviance that causes confusion and misguidance (…etc…) And from those who declared that al-Hasan al-`Askari died without children were Imam abu Ja`far Muhammad bin Jarir al-Tabari [d.310AH] and Imam abu Muhammad Yahya bin Sa`id al-Hashimi [d.318AH] and they are both sufficient for you in knowledge and reliability.] (Al-Siyar al-Dhahabi)<\/p>\n<p style=\"text-align: justify;\">Next we quote al-Imam Muhammad bin Abu Bakr ibn al-Qayyim al-Jawziyyah [d.751AH]<\/p>\n<p style=\"text-align: justify;\">[As for the Imami Rafidah they have a fourth opinion: They say that the Mahdi is Muhammad bin al-Hasan al-`Askari the awaited one, from the children of al-Husayn not al-Hasan and that he is present in the lands but hidden from the sight. He entered the cellar in Samarra’ when he was a small child more than five-hundred years ago and was never seen or heard of again. They await his return daily as they place horses on the entrance of the cellar and yell to him: “Come out our leader! Come out!” then they return in disappointment and this is their habit so as the poet says: “Is it not yet the time that this cellar gives birth to the one you speak of O ignorant &#8212; Nay, your brains are excused since you believe in the (holy trinity) of the ghoul, the phoenix (and the hidden Imam).” These folks (the Rafidah) have become a disgrace upon humanity and a laughing-stock for men of understanding.] (Al-Manar-ul-Munif Ibn al-Qayyim)<\/p>\n<p style=\"text-align: justify;\">Next we quote al-Imam abu al-Fida’ Isma`il bin `Umar bin Kathir [d.774AH]<\/p>\n<p style=\"text-align: justify;\">[Regarding the narration of the twelve leaders who are all from Quraysh, they are not the same twelve claimed by the Rafidah, as those last ones did not acquire authority over the people except for `Ali and his son al-Hasan. The last of them as they (the Rafidah) claim is the awaited Mahdi in the cellar of Samarra’ and he does not exist nor did any eye witness him nor is there any trace.] (Al-Bidayah wal-Nihayah Ibn Kathir)<\/p>\n<p style=\"text-align: justify;\"><strong><br \/>\n<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong>-Listing his name in the books of genealogy-<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">One may ask at the end of all this, if this matter is so clear as we’ve seen above, then how-come we find in several books of genealogy, such as “`Umadat-ul-Talib” by the Zaydi Shia Ibn `Inabah [d.828AH] or “Ansab-ul-Talibiyin” by Husayn bin `Abdullah al-Samarqandi [d.1043AH] we find in such books that al-Hasan al-`Askari had a son or even more than one son and daughter as opposed to what was mentioned above and some books may include a physical description of him which is odd since nobody has supposedly seen him nor are they supposed to mention his name according to their authentic narrations let alone describe his features.<\/p>\n<p style=\"text-align: justify;\">We will mention a few samples of this below,<\/p>\n<p style=\"text-align: justify;\">The Zaydi Shia scholar Jamal-ul-Din ibn `Inabah [d.828AH] mentions:<\/p>\n<p style=\"text-align: justify;\">[He had descendants from two of his sons, they are: abu Muhammad al-Hasan al-`Askari who is the twelfth one for them (For the Imami Shia), he had great knowledge and piety, his mother is Umm Walad, he is the father of Muhammad al-Mahdi who is al-Qa’im al-Muntazar according to the Imamiyyah, he is born of a female servant called Narjis or another as was said.] (Al-`Umdah Ibn `Inabah)<\/p>\n<p style=\"text-align: justify;\">The Shafi`i scholar Abu al-`Abbas Shihab-ul-Din al-Qalqashandi [d.821AH] mentions:<\/p>\n<p style=\"text-align: justify;\">[Al-Ja`afirah(Ja`farites): A lineage from the children of al-Husayn al-Sabt from banu Hashim of the `Adnanites, they are the children of Ja`far al-Sadiq bin Muhammad al-Baqir bin `Ali Zayn-ul-`Abidin bin al-Husayn al-Sabt. As for al-Husayn his lineage will be mentioned under the letter “Alif” and “Al-Lam ma` al-Ha’”, as for Ja`far then he is from the twelve leaders according to the Ithna-`Ashariyyah(Twelvers), they are Amir-ul-Mu’minin `Ali ibn abi Talib, then his son al-Hasan al-Sabt, then his brother al-Husayn al-Sabt, then his son `Ali Zayn-ul-`Abidin, (…etc…) then his son al-Hasan al-`Askari, then his son Muhammad al-Mahdi who is the twelfth one, and they (the Shia) believe he is alive and await his appearance] (Nihayat-ul-Irab fi Ansab-ul-`Arab Al-Qalqashandi)<\/p>\n<p style=\"text-align: justify;\">The Shafi`i scholar Abu al-`Abbas ibn Khallikan Al-Irbili [d.681AH] mentions:<\/p>\n<p style=\"text-align: justify;\">[Abu al-Qasim Muhammad, son of al-Hasan al-`Askari son of `Ali al-Hadi son of Muhammad al-Jawad who was previously mentioned, the twelfth of the twelve leaders in the belief of the Imamiyyah, known as al-Hujjah, he is the one whom the Shia claim is the awaited Qa’im and Mahdi, he is also the one who is from the cellar according to them and they (the Shia) have many stories about him, they await his reappearance at the end of times from that cellar in Surra-man-Ra’a. His birth was on Friday, the middle of Sha`ban in 255 hijri, when his father died he was five years of age, his mother’s name is Khamt, it was also said Narjis. The Shia say: He entered the cellar in his father’s house while his mother looked at him and never returned to her, this was in 265 hijri while he was nine. Ibn al-Azraq had mentioned in his history book that this Hujjah whom we speak of was born on the ninth of Rabi`-ul-Awwal in the year 258 hijri, and it was said: the eight of Sha`ban in the year 256 hijri and that is more correct, and that when he entered the cellar he was four, it was also said: five, and it was said: he entered in the year 275 hijri while he was seventeen. Allah knows best what’s true from among this and may Allah have mercy on him.] (Wafiyat-ul-A`iyan Ibn Khallikan)<\/p>\n<p style=\"text-align: justify;\">Notice that the scholar above is a known man from Ahlul-Sunnah, yet he mentions Muhammad in the children of al-`Askari. In other words he mentions it although he doesn’t really believe this individual was al-Mahdi nor does he believe his parents were divine Imams, similarly he mentions a couple of other so called Mahdies in his book.<\/p>\n<p style=\"text-align: justify;\">This dear readers is because the books of genealogy -or books of “Ansab” as they are known- are more like story books, these types of books are usually the most unreliable of books unlike books of Hadith or books of `Aqidah or Fiqh. The authors will record all that was mentioned historically about every personality they list out of academic integrity, in our case since a group of people claimed that al-Hasan had a son who disappeared, the scholars will mention this son, they will also mention his titles and Kuniyah in addition to any dates of birth or death they come across. Notice the scholar above for instance said “May Allah have mercy on him” meaning that if he did in fact have this son then he is most likely dead in that so called cellar. The example of this is similar to the books that document Hadith narrators, otherwise known as books of “Rijal”, these books will list what is known about the narrators of prophetic-traditions yet some of these narrators are completely unknown, some are in fact fictional characters, yet the scholars still include them in their compilations since they were previously mentioned as parts of certain chains or events.<\/p>\n<p style=\"text-align: justify;\">We leave the conclusions for the intelligent readers and peace be upon our Prophet and master Muhammad ibn `Abdillah and his Family and Companions.<\/p>\n<p style=\"text-align: justify;\">Written by Hani bin Mulhim bin Amin bin Mulhim bin Khalil bin Ibrahim al-Tarabulsi.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Shia Mahdi &#8211;The History Of Confusion&#8211; Download PDF (here) The belief in the “messiah” is a widespread belief shared by the majority of religions, it is the belief that at the end of times we shall be delivered by <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/10\/30\/the-shia-mahdi\/\" title=\"The Shia Mahdi: the history of confusion\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-2645","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2645","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2645"}],"version-history":[{"count":15,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2645\/revisions"}],"predecessor-version":[{"id":2652,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2645\/revisions\/2652"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2645"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2645"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2645"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}