{"id":2656,"date":"2015-11-01T15:06:52","date_gmt":"2015-11-01T15:06:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2656"},"modified":"2018-02-16T12:02:17","modified_gmt":"2018-02-16T12:02:17","slug":"who-was-hujr-bin-adi","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/01\/who-was-hujr-bin-adi\/","title":{"rendered":"Who was Hujr bin Adi ?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2656\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2021 \" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"hujr bin adi\" width=\"464\" height=\"79\" \/><\/a><!--more--><\/p>\n<h1 style=\"text-align: justify;\">Who was Hujr bin Adi ?<\/h1>\n<p style=\"text-align: justify;\">This piece, while a refutation in nature, can also be consumed as a stand-alone biography of Hujr bin `Adi, for it covers all the main aspects of his life. Though mainly, it is a response to Dr. Sayed Ammar Nakshawani’s “Hujr ibn Adi Al-Kindi – A Victim of Terror.” Even though Nakshawani’s work includes false allegations from cover to cover, we have decided to focus on the content that revolves around Hujr bin `Adi alone.<\/p>\n<p style=\"text-align: justify;\">Nakshawani’s alleges that Hujr bin `Adi was a companion of the Prophet &#8211; peace be upon him &#8211; , that he was a distinct early Shi’i identity, and that Mu`awiyah killed Hujr because he loved `Ali. These three allegations will be studied below in their respective sections:<\/p>\n<ul>\n<li style=\"text-align: justify;\"><strong>Was Hujr bin Adi a Companion of the Prophet &#8211; peace be upon him &#8211; ?<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Was Hujr a Shi&#8217;i?<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Nakshawani’s Narrative for the Execution of Hujr bin Adi<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Criticizing Nakshawani’s Narrative<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Why was Hujr bin Adi really Killed? <\/strong><\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><\/h2>\n<h2 style=\"text-align: justify;\"><strong>1- Was Hujr bin Adi a Companion of the Prophet &#8211; peace be upon him &#8211; ?<\/strong><\/h2>\n<p style=\"text-align: justify;\">Nakshawani makes this claim by saying the following (p. 15): “This work is dedicated to Hujr b. Adi, the revered companion of Prophet Mohammad (PBUH).” He also says (p. 16): “Prophet Mohammad (PBUH) loved Hujr.”<\/p>\n<p style=\"text-align: justify;\">Nakshawani includes evidences like quotes from Ibn Al-Atheer who said (p. 16), “Hujr and his brother Hani’ b. Adi came to the Prophet.” In addition, he also quotes two narrations (p. 105) in his appendix that suggest that Hujr was a companion.<\/p>\n<p style=\"text-align: justify;\">The first narration has nothing to do with Hujr bin `Adi, but rather Al-Hakim confused him with another narrator named Hujair bin Makhshi Al-Hilali. This is the chain:<\/p>\n<p style=\"text-align: justify;\">عباد بن عمرو ثنا عكرمة بن عمار ثنا مخشى بن حجر بن عدي عن أبيه : أن النبي صلى الله عليه و سلم<\/p>\n<p style=\"text-align: justify;\">[&#8230; `Ikrimah bin `Ammar, we were told by Makhshi bin Hujr bin `Adi, from his father: That the Prophet (saw) &#8230;]<\/p>\n<p style=\"text-align: justify;\">See Musnad Al-Harith #381, Al-Ahaad wal Mathani by Ibn Abi Asim #1682, Al-Sahaba by Ibn Mandah #434, and others to see that this is a mistake. It is important to be aware that Hujr did not have a son named Makhshi (as the narration suggests), but rather, his sons were `Abdullah and `Abdulrahman. See Al-Mustadrak #6007. So the mistake is writing &#8220;Makhshi bin Hujr&#8221; instead of &#8220;Makhshi bin Hujair&#8221; as one can clearly see when referring to earlier sources such as al-Ahad wal-Mathani by Ibn abi `Asim.<\/p>\n<p style=\"text-align: justify;\">As for the second narration, it too has an issue, for Nakshawani reports it from a secondary source (Al-Isabah) that is quoting a primary source (Mu’jam Ibn Qani’). The secondary source does not quote the full chain of the primary source, which leaves us with a disconnected chain.<\/p>\n<p style=\"text-align: justify;\">More importantly, the top experts in the field, Al-Bukhari and Ibn Abi Hatim, as well as Khalifa bin Khayyat and Ibn Hibban, all state that he is a T<em>abi’ee (follower)<\/em>. This content can be found on the same page that Nakshawani quoted from in Al-Isabah (bio of Hujr bin `Adi) but his bias and sectarian agenda caused him to dismiss it.<\/p>\n<p style=\"text-align: justify;\">Due to the existence of this difference of opinion, the burden of proof is upon Nakshawani to prove that Hujr bin `Adi is a companion of the Prophet – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">From the above, it can safely be said that Nakshawani would have major problems proving the companionship of Hujr bin `Adi, let alone the emotionally driven claim that the Prophet – peace be upon him – loved Hujr.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>2- Was Hujr bin Adi a Shi&#8217;i?<\/strong><\/h2>\n<p style=\"text-align: justify;\">Nakshawani states confidently that (p. 24): “By analyzing the life of this great companion of the Prophet Muhammad (PBUH), we are able to see a distinct Shi’i identity\/theology in the formative period of Islamic history.”<\/p>\n<p style=\"text-align: justify;\">Nakshawani is unclear as to what he means by a “distinct Shi’i identity\/theology”. The reader is left guessing as to what is meant by this throughout the coming chapters. Nakshawani does not provide a Hujr that believes in Twelve Imams, their infallibility, a hidden Mahdi, <em>raja’a<\/em>, <em>taqiyyah<\/em>, or anything else that we associate with Imami Shiasm today.<\/p>\n<p style=\"text-align: justify;\">Perhaps Nakshawani is referring to Hujr’s response (p. 59) to those that asked him to renounce `Ali in which he replied, “Meeting Allah, His Apostle, and his <em>wasi<\/em> (Imam Ali) is more attractive to us than entering the fire.” However, the Arabic text does not include these words, but merely the words, “No we shall not!” (لسنا فاعلي ذلك)<\/p>\n<p style=\"text-align: justify;\">Furthermore, the belief that Shia ideology existed during the time of `Ali is a view that most Sunnis hold, so Nakshawani does not have not have to go out of his way to prove that Hujr believed in `Ali’s appointment. Surely, even Nakshawani must know that `Abdullah bin Saba’ propagated that `Ali was the successor of the Prophet – peace be upon him – during the time of `Ali. See Firaq Al-Shia (p. 32).<\/p>\n<p style=\"text-align: justify;\">The simple reality is that not enough is known about Hujr bin `Adi’s life for one to speculate about his ideology. As for his political alignments, we find him in an honorable position. Nakshawani states (p. 29): “He fought in the Ridda and later took part in the battle of al-Qadisiyyah on the Sasanian front. He fought alongside ‘Ali b. Abu Talib in the Battles of the Camel and Siffin and was one of his staunch supporters.” According to Nakshawani himself, Hujr bin `Adi participated in the wars that illustrated his support of the political affairs of Abu Bakr (Ridda), `Umar (al-Qadisiyyah), and `Ali (the Camel and Siffin). In other words Hujr was a Shia of Abu Bakr and `Umar as well as `Ali and if Mu`awiyah had disobeyed Abu Bakr during his caliphate then Hujr would have opposed Mu`awiyah in Abu Bakr&#8217;s time the same way he opposed him in `Ali&#8217;s time.<\/p>\n<p style=\"text-align: justify;\">Another piece of evidence that would suggest that he isn’t an Imami is that he didn’t believe in the Imamah of Al-Hasan. Al-Shareef Al-Murtadha, in his Tanzeeh Al-Anbiya’ (p. 223) quotes him saying to al-Hasan, “O’ you who have blackened the faces of the believers!” This was said by Hujr after Al-Hasan pledged allegiance to Mu’awiyah. Such harsh language cannot have come from someone who saw Al-Hasan as an infallible Imam.<\/p>\n<h2 style=\"text-align: justify;\"><strong>3- Nakshawani’s Narrative of the Execution of Hujr bin Adi <\/strong><\/h2>\n<p style=\"text-align: justify;\">By far the lengthiest chapter in the book, Nakshawani includes a whopping five-page account of the death of Hujr (p. 55-60). Sarcasm aside, this chapter, the only really relevant chapter in the book, shows Nakshawani at his best. The following is a summary of the relevant information from those five pages about the execution of Hujr bin Adi according to Nakshawani:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Amr b. Hurayth al-Makhzumi had been appointed as Ziyad’s representative in Kufah when he had left for Basra. Amr’s speech, anti-Ali in its stance, was interrupted by Hujr and his partisans. Sinan b. Hurayth al-Dabbi was sent to inform Ziyad in Kufah of what had happened. He conveyed to him the message that Hujr and his followers were now in a position of strength in Kufah. Ziyad sent warning to Hujr through personalities such as Jarir b. Abdullah al-Bajali and Khalid b. Urfuta al-Udhri that such behavior would not be tolerated. Hujr could not tolerate their public attacks seeking to defile the character of Ali, which he believed to be attacks against the very core of the religion of Islam. (p. 55)<\/p>\n<p style=\"text-align: justify;\">Ziyad, recognizing the power of Hujr’s stand, sent out groups to find Hujr. Muhammad b. al-Ash’ath b. Qays was given three days to find Hujr. If he did not, then all the plam [sic] trees that he owned and his houses would be destroyed and he would be executed. Hujr had to flee, including movements made from al-Nakha’i, an area led by Abdullah b. al-Harith al-Nakha’i towards Azd. Muhammad received a letter from Hujr that he would surrender himself if he were to be pardoned and sent to Muawiya, in expectation of amnesty from the caliph. Hujr b. Yazid al-Kindi and Jarir b. Abdullah al-Bajali accompanied Muhammad to Ziyad who granted Hujr amnesty in a prison cell for ten days. Thirteen of Hujr’s loyal partisans were pursued and captured by Ziyad. (p. 56)<\/p>\n<p style=\"text-align: justify;\">When Hujr and his companions rebelled, Ziyad attacked their stance and revolt. He first forged a story that they were looking to dissolve the caliphate of Mu’awiya by revolting against his governor in Iraq. Secondly, he used their love for the family of the Prophet (the Ahl al-Bayt) as a negative belief which had to be destroyed. The origin of Islam was built on the foundation of love and its expression for Muhammad’s near ones, but was now seen as a threatening armour in the hands of Hujr and his followers. Seventy men of different tribes signed the accusations of Ziyad. (p. 57)<\/p>\n<p style=\"text-align: justify;\">Wa’el b. Hujr al-Hadrami and Kathir b.Shihab al-Harithi were ordered to ensure Hujr was taken to Mu’awiya, who refused to meet him, although he did meet Ziyad’s messengers, two miles from Damascus in Marj ‘Adhra, Hujr and his companions were imprisoned. Yazid b. Asad al-Bajali sought to advise Mu’awiya to spread Hujr and his followers to different parts of the region and thus break their stand against him. Ziyad however wanted a quick resolution to end their lives and keep stability in the region. “If you want stability in this misr, please do not send Hujr and his followers to Kufah again”. (p. 57-58)<\/p>\n<p style=\"text-align: justify;\">Hujr was represented by Malik b. Hubayra al-Sakuni, but to no avail. Mu’awiya firmly believed that Hujr was the instigator and ordered that this innocent man who stood up against the injustice of the pulpits of Kufah was to be executed alongside six of his followers. Shaban states that for Mu’awiya “it was effective, but unusually harsh and high handed”. (p. 58)<\/p>\n<p style=\"text-align: justify;\">The policemen took Hujr and his faithful companions to Marj ‘Adhra, where they were quickly imprisoned. Mu’awiya and Ziyad then exchanged letters with each other. Not only did they bring Mu’awiya’s order to kill Hujr and his companions, they also brought shrouds with them. “Indeed the commander of faithful has ordered me to kill you, for you are the root of error, the origin of unbelief and tyranny, and the supporter of Abu Turab. He has ordered me to kill your companions unless you retract your disbelief, curse your leader, and renounce him”, Mu’awiya’s officials declared to Hujr. “Indeed patience to the punishment of the sword is easier for us than what you summon us to. Meeting Allah, his apostle, and his wasi (Imam Ali) is more attractive to us than entering the fire”, said Hujr and his companions.<\/p>\n<p style=\"text-align: justify;\">The graves were dug for Hujr and his companions. They performed their prayers throughout the night. When morning came, the policemen went to retrieve them. “Let me perform my ritual ablution and say my prayers”, requested Hujr. They let him pray, and after he was finished they took him away. “By Allah, I had not performed a prayer lighter than this prayer”, he said. “were it not for that, you think that I am impatient for death, I would increase it”.<\/p>\n<p style=\"text-align: justify;\">Then Hujr said: “O Allah, we ask you to show enmity towards our people. Indeed, the Kufans have testified against us, and the Syrians have come to kill us. By Allah, if you kill me in the village of ‘Adhra, I will be the first Muslim horseman to be killed in its valley, and the first Muslim man at whom its dogs will bark”.<\/p>\n<p style=\"text-align: justify;\">Then Hubda b.Fayyad al-Quda’i walked towards him with his sword while Hujr had his. Hubda trembled and said to Hujr: “You have claimed that you are patient towards death. Therefore renounce your leader and we will let you go”.<\/p>\n<p style=\"text-align: justify;\">Hujr replied: “Of course, I am patient towards death. For I see a grave has been dug, a shroud has been spread, and a sword has been drawn. Indeed, by Allah, even if I am impatient towards death, I will not say what displeases the Lord!” (p. 58-59)<\/p>\n<p style=\"text-align: justify;\">A few close associates of Mu’awiya interceded for seven companions of Hujr. The rest of Hujr’s companions were put to the sword. Hujr’s final words were, “Leave me shackled with iron and stained with blood. For I will meet Mu’awiya on the straight path tomorrow. I will testify against him before Allah”. Mu’awiya mentioned these words of Hujr when he was about to die: “Hujr, my day will be long because of you”, he said. (p. 60)<\/p>\n<p style=\"text-align: justify;\">\n<\/blockquote>\n<h2 style=\"text-align: justify;\"><strong>Criticizing Nakshawani’s Narrative<\/strong><\/h2>\n<p style=\"text-align: justify;\">In summary, Nakshawani is suggesting that Hujr bin `Adi was killed because he spoke against the oppressive regime of Mu’awiyah that promoted the cursing of Ali on the pulpits. Nakshawani (p. 55) states that, “Amr’s speech, anti-Ali in its stance, was interrupted by Hujr and his partisans.”<\/p>\n<p style=\"text-align: justify;\">He then comments (p. 57): “The origin of Islam was built on the foundation of love and its expression for Muhammad’s near ones, but was now seen as a threatening armour in the hands of Hujr and his followers.”<\/p>\n<p style=\"text-align: justify;\">Finally, before Hujr is executed (p. 58), he is told that he is “the supporter of Abu Turab. He (Mu’awiyah) has ordered me to kill your companions unless you retract your disbelief, curse your leader, and renounce him.”<\/p>\n<p style=\"text-align: justify;\">However, all of the above is problematic. The first narration comes from the path of Lut bin Yahya, who is a hadith forger (See his biography in Mizan Al-I’itidal), while the second narration does not even exist in the source provided by Nakshawani.<\/p>\n<p style=\"text-align: justify;\">Ironically though, the narrative that Nakshawani provides shows Mu’awiyah in a very positive light. According to Nakshawani, Mu’awiyah killed Hujr bin `Adi after being duped by his subordinates. Nakshawani states that Ziyad “first forged a story that they were looking to dissolve the caliphate of Mu’awiya by revolting against his governor in Iraq.” He then adds that “Seventy men of different tribes signed the accusations of Ziyad”. (p. 57)<\/p>\n<p style=\"text-align: justify;\">Can one really blame Mu`awiyah for killing Hujr in such circumstances?<\/p>\n<p style=\"text-align: justify;\">The most important question is, why would Hujr bin `Adi be free to roam around Kufa in the first place though?<\/p>\n<p style=\"text-align: justify;\">Nakshawani (p. 31) previously stated that “Hujr b. ‘Adi al-Kindi rose with a force of four thousand for crushing the enemy (Mu’awiya) and overtook him at Tadmur.”<\/p>\n<p style=\"text-align: justify;\">Wouldn’t the “blood thirsty” Mu’awiyah rather kill `Ali’s general from day one instead of letting him stick around?<\/p>\n<p style=\"text-align: justify;\">Not only that, but Nakshawani (p. 55) admits that Hujr was on Mu’awiyah’s payroll and used to receive “2,500 dirhams at the time.”<\/p>\n<p style=\"text-align: justify;\">In other words, Hujr, an ex-general of Mu’awiyah’s sworn enemy, who was on Mu’awiyah’s payroll, was executed when men from seventy different tribes signed accusations that he wanted to overthrow the government. That&#8217;s pretty much the entire story.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Why was Hujr bin Adi really killed? <\/strong><\/h2>\n<p style=\"text-align: justify;\">Most sources that have discussed the execution of Hujr bin Adi and its reasons include weak chains that revolve around Abu Mikhnaf. However, we have come across an authentic narration in Mustadrak Al-Hakim that provides us with the real background to what transpired at the death of Hujr.<\/p>\n<p style=\"text-align: justify;\">Al-Hakim #6014 narrates:<\/p>\n<p style=\"text-align: justify;\">Ibn Sireen said: “Ziyad gave a lengthy sermon, so Hujr bin Adi shouted: ‘The prayer!’ Ziyad kept on going. He said, ‘The prayer!’ and grabbed some stones in his hand, and his companions grabbed some stones into their hands (ready to throw them). He (Ziyad) then came down (from the pulpit) and prayed. He then wrote to Mu’awiyah about him. Mu’awiyah wrote back, ‘Send him to me,’ and he was sent. When he (Hujr) came, he said, ‘Peace be onto you, O’ Commander of the Believers.’ He (Mu’awiyah) said, ‘Oh! Now I’m the Commander of the Believers?! I will not dismiss you!’ He then ordered that he is to be put to death. When he was taken, he asked permission, then prayed two prostrations. He then said, ‘Don’t remove the steel from within me and do not wash me, for I am going to dispute this.’”<\/p>\n<p style=\"text-align: justify;\">In other words, it was Hujr’s undermining of the position of Ziyad and Mu’awiyah’s government that led him to his execution, and not his love for Ali. It also goes without saying that his position as an open enemy to Mu’awiyah made it all the easier for his execution to seem justified in the eyes of Mu’awiyah and those that he consulted in killing Hujr.<\/p>\n<p style=\"text-align: justify;\">May Allah have mercy upon Hujr bin Adi. He lived in a time of great <em>fitna<\/em>. May Allah accept his righteous deeds and wash away his sins, and may he never again be a gimmick that is used to raise false banners again.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2610 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" alt=\"hujr bin adi\" width=\"426\" height=\"179\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg 426w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah-300x126.jpg 300w\" sizes=\"auto, (max-width: 426px) 100vw, 426px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The article includes a biography of Hujr bin Adi and a response to Sayed Ammar Nakshawani&#8217;s allegations surrounding his life. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/01\/who-was-hujr-bin-adi\/\" title=\"Who was Hujr bin Adi ?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,6],"tags":[],"class_list":{"0":"post-2656","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2656","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2656"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2656\/revisions"}],"predecessor-version":[{"id":4316,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2656\/revisions\/4316"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2656"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2656"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2656"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}