{"id":2668,"date":"2015-11-04T02:34:02","date_gmt":"2015-11-04T02:34:02","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2668"},"modified":"2016-01-29T19:35:18","modified_gmt":"2016-01-29T19:35:18","slug":"response-to-we-cry-for-husayn-as-so-did-the-prophet","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/04\/response-to-we-cry-for-husayn-as-so-did-the-prophet\/","title":{"rendered":"Response to: We Cry for Husayn (AS) so did the Prophet"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2668\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to Yasser Al-Madani&#8217;s article entitled: &#8220;We Cry for Husayn (as) so did the Prophet of Islam (s).&#8221; The original article can be found on the <a href=\"http:\/\/www.al-islam.org\/articles\/we-cry-husayn-so-did-prophet-islam-s-yasser-al-madani\" rel=\"external nofollow\">al-Islam.org website.<\/a><\/p>\n<p style=\"text-align: justify;\">Bismillah Al-Rahman Al-Raheem,<\/p>\n<p style=\"text-align: justify;\">We could focus on the actual liability of <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">al-Husayn’s death<\/a> as attributed to Yazid personally, or Yazid’s character as an individual, but these issues are far less important than addressing some of the trumped up reports to “commemorate” his death. Al-Madani tells us that Shi’ites commemorate Ashura, the day on which al-Husayn was purportedly killed, to not only remember his passing but also to learn about Islam. If that is truly the case, than Islam teaches us to seek out the truth. Instead, we see al-Madani regurgitating the same unreliable reports as many other Shi’ites to discuss the event – and justifying a bid’a (marking this event as a yearly religious holiday) – something his sources don’t support. We can begin by addressing some absurdities.<\/p>\n<p style=\"text-align: justify;\">He said:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><strong>an archer from the army of Yazid (may Allah’s curse be upon him) shoots a triple-headed arrow, which lodges into Imam al-Hussain’s (AS) heart. He pulls out the arrow causing blood to gush out. The Holy Imam is thirsty. He cries: “O Allah, I am thirsty”… Even when the accursed Shimr approached Imam al-Hussain (AS) to severe his blessed head, he said: “When I approached Hussain ibn Ali and my eyes fell on him, the light of his face so gripped me that I forgot my intention to kill him.”<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The level of exaggeration is remarkable. Not only are we to believe that al-Husayn’s heart was pierced by a three headed arrow, but that he pulled the arrow out himself and then even cried out in decibels audible to survivors (who are archers shooting from a distance). We are then to believe that al-Husayn remained alive with a heart and throat pierced long enough that a foot soldier &#8211; Shimr, one of ‘Ali’s own Shi’a prior to this incident &#8211; came over to kill him – implying that he wasn’t dead until Shimr beheaded him. Somehow al-Husayn was gushing blood from wounds to vital organs, but was still able to speak and remained alive until Shimr, his known killer, delivered the final blows.<\/p>\n<p style=\"text-align: justify;\">If these are the stories being told on the commemoration day of al-Husayn’s death, are we really learning about Islam or are we just being told fairy tales?<\/p>\n<p style=\"text-align: justify;\">He continues:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><strong>It is reported that when Imam al-Hussain was killed, the sky rained down blood. It has been recorded that Imam Ja’far as-Sadiq (AS) has said: “…For no one the heavens wept for forty days save Yahya and Hussain…”<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">We are then told to believe that the Heavens wept literal blood, which filled jugs, for a period of forty days. Forty days – the skies rained blood but no account of these wells and jugs of blood exist in a single authentic report? No temporally contemporary non-Muslim chronicler noticed the sky raining blood for forty days? No authentic report of this remarkable phenomenon somehow reached us? Is that even plausible?<\/p>\n<p style=\"text-align: justify;\">In the sources al-Madani uses, Agha Pooya – a Shi’I scholar, even tries to diminish the traditions by interpreting the sky raining blood to mean that the moon was red. But the traditions, which are clearly absurd, suggest entire wells were filled with blood (as per the citation from ibn Hajar). Madani cites both, but which is it? Was the moon just red or did we have over a month of raining blood?<\/p>\n<p style=\"text-align: justify;\">al-Madani states, &#8220;<strong>Show me such a spectacle of human greatness in an event other than <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a> and I will commemorate its memory instead of Karbala!<\/strong>&#8220;<\/p>\n<p style=\"text-align: justify;\">Sure, in Badr 300 men aided by angels overcame an army of well-equipped soldiers in battle and protected Islam. A true spectacle of human greatness such that even the Qur’an mentions it, and yet our Shi’ite brothers revile the very men who participated with the Prophet in this historic battle for the survival of Islam. And how many of them yearly celebrate this victory of Islam?<\/p>\n<p style=\"text-align: justify;\">Back to al-Madani&#8217;s argumentation, he asks, &#8220;<strong>Let me ask you a question, if a Muslim cries over the passing away of their own relatives, then how can they not cry over the grandson of the Messenger of Allah (S)?<\/strong>&#8220;<\/p>\n<p style=\"text-align: justify;\">It is because we’ve been taught that there is a fixed period for mourning after the passing of a person.<\/p>\n<p style=\"text-align: justify;\">Narrated Um−`Atiya: We were forbidden to mourn for a dead person for more than three days except in the case of a husband… (Bukhari)<\/p>\n<p style=\"text-align: justify;\">It’s one thing to hear a story and cry over the circumstances. But setting aside a particular day for wailing about an unlawful killing, after mourning beyond three days was declared impermissible, is against the teachings of Islam.<\/p>\n<p style=\"text-align: justify;\">Al-Madani continues:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><strong>The Holy Qur’an praises crying and those who cry for a legitimate cause. The Holy Qur’an describes many of the Prophets and their followers when they cried, “When the verses of the Most Gracious were recited unto them, they fell down prostrating and weeping”<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">This ayah deliberately deprived of context by the author is about people who cry in awe of the Qur’an and its miracle. The man is literally comparing the crying of a person hearing the Qur’an to crying over make-believe accounts associated with the death of al-Husayn. If it was Allah’s intent that this ayah be a justification for commemorating martyrdom, and not an ayah about the awe of wahi, it would’ve said so.<\/p>\n<p style=\"text-align: justify;\">Most importantly, al-Madani says, &#8220;<strong>Moreover, we cry over the martyrdom of Imam al-Hussain (AS) for the Holy Prophet (S) wept for Imam al-Hussain (AS).<\/strong>&#8220;<\/p>\n<p style=\"text-align: justify;\">Traditions of this nature were reported through different chains. Al-Husayn would’ve been aware of this Prophetic tradition before embarking on his journey. And if al-Husayn was aware that he was actually going to die while approaching Kerbala at that point in time, then he led women and children to their death knowingly. What sort of man takes women and children to be murdered? To become ‘sacrifical lambs’ (Madani’s words) in an unsuccessful campaign to allegedly overthrow Yazid’s government? What lessons are these people deriving from such absurdities? In the author’s own words:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><strong>He looks around, searching for members of his family and his companions, only to find them brutally slaughtered and slain like sacrificial lambs, lying there on the ground soaked in blood. He hears the innocent crying and wailing of the children and the women. Tears flow down his holy face.<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">And this very aspect of al-Husayn’s martyrdom points to the reality that he wasn’t aware he would be martyred or that he was actually marching into a battle that day. That he wasn’t fomenting a rebellion, and that his motives at that point, far be it to fight the government of Yazid, were very different. Because it is one thing to set out and seek death against a tyrant. It’s another to take your family, women and children to the slaughter. It is one thing for the willing martyr to give his own life for Allah – but another entirely to lead women and children into death with you.<\/p>\n<p style=\"text-align: justify;\">Further, one of the traditions cited by Madani reads:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><strong>Ummul Fadhl the daughter of al-Harith said that she entered on the Messenger of Allah (S) and she said: “Oh! Messenger of Allah, I saw a strange dream last night. He said: And what is it? She said: It was difficult. He said: And what is it? She said: I saw, as if, a piece of your body was severed and was put in my lap! The Messenger of Allah (S) said: You saw well &#8211; Fatima will give birth, God willing, a boy so he will be in your lap. Then Fatima gave birth to al-Hussain (AS) and he was in my lap &#8211; just as the Messenger of Allah (S) said. So I entered one day on the Messenger of Allah (S) and put him in his lap, but I noticed that the eyes of the Messenger of Allah (S) pouring tears! So I said: Oh! Prophet of Allah, my parents are your ransom, what is with you? He said: Gabriel (AS) came to me and informed me that my nation (ummah) will kill this son of mine.<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">If we accept this tradition as true, it contradicts another point made by the author. The author is angered at the thought that the people who opposed and ultimately led to the battle that Husayn died in were non-Muslim. This tradition however implies that they were Muslim as it has Gabriel suggesting that the Prophet’s own Ummah will kill Husayn. Madani wants to have his cake and eat it too. If al-Husayn was a martyr and not somebody who was simply killed unlawfully, he must’ve been killed by non-Muslims – but the very traditions he uses to suggest Prophetic awareness of this event contradicts this.<\/p>\n<p style=\"text-align: justify;\">Al-Madani concludes that &#8220;<strong>we cry for Imam al-Hussain (AS) because so did the Prophet of Islam, Muhammad (S). Every year we continue and revive the message of Karbala by mourning.<\/strong>&#8220;<\/p>\n<p style=\"text-align: justify;\">In conclusion, based on Madani’s own statements, the marking of this event appears to have less to do with learning about Islam and more about spreading exaggerated stories that have no merit about a renowned Sahabi’s demise. How do we learn about Islam in this commemoration if we’re telling unbelievable fantasies of men ripping arrows out of their hearts and continuing to live?<\/p>\n<p style=\"text-align: justify;\">And even though the Prophet cried for al-Husayn, he did so on one occasion according to this report &#8211; when news of the death reached him. He didn’t turn it into a yearly commemoration. So the argument of our friends holds no weight. If the Prophet wanted us to commemorate this event yearly – and he was aware of it – he would’ve told us to do so. Case closed.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to Yasser Al-Madani&#8217;s article entitled: &#8220;We Cry for Husayn (as) so did the Prophet of Islam (s).&#8221; The original article can be found on the al-Islam.org website. Bismillah Al-Rahman Al-Raheem, We could focus on the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/04\/response-to-we-cry-for-husayn-as-so-did-the-prophet\/\" title=\"Response to: We Cry for Husayn (AS) so did the Prophet\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,12],"tags":[24],"class_list":{"0":"post-2668","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fiqh","9":"tag-karbala"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2668","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2668"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2668\/revisions"}],"predecessor-version":[{"id":3012,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2668\/revisions\/3012"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2668"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2668"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2668"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}