{"id":2683,"date":"2015-11-04T23:24:07","date_gmt":"2015-11-04T23:24:07","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2683"},"modified":"2015-11-05T20:33:47","modified_gmt":"2015-11-05T20:33:47","slug":"the-elevated-chain-its-definition-and-importance","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/04\/the-elevated-chain-its-definition-and-importance\/","title":{"rendered":"The elevated chain: Its definition and importance."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2683\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Introduction to the concept of `Uluw-ul-Isnad (elevation of the chain):<\/h1>\n<p style=\"text-align: justify;\">An important element in Hadith sciences which was very vital for the early Hadith scholars is what is known as `Uluw-ul-Isnad or the elevation of chain, this concept was a badge of honor for every Muhaddith(Hadith scholar) who was able to implement it to the fullest in their compilations. We will explain this advanced term for our readers in a very easy and beneficial way then compare its implications on both Sunni and Shia Hadith literature.<\/p>\n<p style=\"text-align: justify;\">The elevated chain or Al-Isnad-ul-`Ali is considered from the strongest and most relied upon chains of transmission of narrations. To over simplify it, the difference between an elevated chain and a regular chain is that the elevated one contains less narrators. For example, if two major scholars existed in the same time, both of them were narrating the same prophetic-tradition, yet one scholar has heard this report through the path of four men up to the Prophet (saw) while the other heard it through the path of six, then the scholar with the shorter chain would be the most sought after in his time, for a shorter chain means a narration is much more accurate and less likely to contain defects.<\/p>\n<p style=\"text-align: justify;\">The more people the chain contains, the more risk it faces in transmitting the original text safely without error and this is due to many logical reasons. From those reasons is that each narrator when receiving a report from his teacher and writing it down may accidentally mishear it completely or a certain part of it, he may misunderstand it and write it based on his own faulty understanding instead of transmitting it word for word, he may understand it perfectly yet commit a copyist error while writing it in his book and so on and so forth from an endless list of reasons.<\/p>\n<p style=\"text-align: justify;\">This was why scholars travel from city to city and from land to land in order to acquire the shortest chains possible and the nearest of chains to the Prophet (saw). We will give a detailed scenario below which if understood will clarify the entire matter perfectly if God wills.<\/p>\n<p style=\"text-align: justify;\">In the past, the city of Basarah contained a big scholar of Hadith called Abu `Isa, this man is the teacher of two students of knowledge called Zayd and `Amr. The teacher abu `Isa informs his students of narration that was being narrated by the top scholar of Baghdad called `Abdullah. Abu `Isa says to his two students that he is too sick and could not travel to Baghdad to hear this report, so he had sent another student of his called Muhammad who in turn heard this narration from `Abdullah in Baghdad and transmitted it back to him. Zayd and `Amr both hear this prophetic report from their teacher and learn it.<\/p>\n<p style=\"text-align: justify;\">Zayd wishes to narrate that report to his colleagues so he recites the following chain: I was told by abu `Isa (his teacher), from Muhammad (the student), from `Abdullah (in Baghdad), from Sa`id, from Ibn `Abbas, that the Prophet (saw) said so and so…<\/p>\n<p style=\"text-align: justify;\">`Amr being the better student, he is not satisfied with this, he is a young man who fears Allah and has great respect for the tradition of Rasul-Allah (saw), he knows that the way of the scholars of Hadith is to verify and seek the closest path to their beloved Prophet (saw), he wishes to feel the blessing of being nearer to Rasul-Allah’s (saw) divine guidance so he decides to pack his bags and travel to Baghdad.<\/p>\n<p style=\"text-align: justify;\">After his journey of knowledge, `Amr returns and narrates a more solid and detailed version of that same report with the following chain: I heard `Abdullah (in Baghdad) say, I was told by Sa`id, from Ibn `Abbas that the Prophet (saw) said so and so…<\/p>\n<p style=\"text-align: justify;\">As a result, `Amr has three people between him and the Prophet (saw) while Zayd has five and so all serious students of knowledge in Basarah will dismiss Zayd’s narration and learn `Amr’s Hadith since he has obtained an elevated chain.<\/p>\n<h1 style=\"text-align: justify;\">The elevation of the Isnad in the words of the scholars:<\/h1>\n<p style=\"text-align: justify;\">Shia scholar Muhammad Rida Jadidi says in “Mu`jam Mustalahat-ul-Rijal”:<\/p>\n<p style=\"text-align: justify;\">العالي في السند ، وقد يقال عالي الإسناد:هو قليل الواسطة مع اتصاله<\/p>\n<p style=\"text-align: justify;\">[The elevated among the chains, can also be referred to as `Ali-ul-Isnad: Is the one with the least intermediaries while being connected.]<\/p>\n<p style=\"text-align: justify;\">Shia scholar Hasan al-Sadr says in “Nihayat-ul-Dirayah”:<\/p>\n<p style=\"text-align: justify;\">الثالث : العالي  إذا كان الحديث ( قصير السلسلة ) يسمى ( عالي ) السند<\/p>\n<p style=\"text-align: justify;\">[Thirdly: The elevated one: If the narration has a short chain it is called `Ali-al-Sanad.]<\/p>\n<p style=\"text-align: justify;\">And<\/p>\n<p style=\"text-align: justify;\">وطلب العلو فيه سنة مؤكدة ، وهو مما عظمت رغبة المتقدمين والمتأخرين فيه ، لأنه أقل كلفا ، وأبعد عن الخطأ ، وأقرب الى الصحة ، لأنه إذا طال السند كثرت مظان التحذير ، وإذا قل قلت<\/p>\n<p style=\"text-align: justify;\">[Asking for elevation is an established tradition and was greatly desired by the early scholars as well as the late ones, because it is further from error and closer to the truth because if the chain is longer then the risks grow but if it’s smaller then it’s less.]<\/p>\n<p style=\"text-align: justify;\">Al-Hakim al-Nishapuri says in “Ma`rifat `Uloum al-Hadith”:<\/p>\n<p style=\"text-align: justify;\">فأما طلب العالي من الأسانيد فإنها مسنونة كما ذكرناه وقد رحل في طلب الإسناد العالي غير واحد من الصحابة<\/p>\n<p style=\"text-align: justify;\">فهذا الراكب إنما كان يركب في طلب عالي الإسناد ولو اقتصر على النازل لوجد بحضرته من يحدثه به&#8230;<\/p>\n<p style=\"text-align: justify;\">[As for asking for the most elevated of chains then it is an established tradition as we have mentioned and more than one from the Sahabah traveled to seek them (…etc…) This traveller only travels to seek what is the most elevated of chains and if he had wished to settle for a lower chain he could have easily found it near him.]<\/p>\n<p style=\"text-align: justify;\">Imam ibn al-Salah said in “al-Muqaddimah”:<\/p>\n<p style=\"text-align: justify;\">قلت العلو يبعد الإسناد من الخلل ، لأن كل رجل من رجاله يحتمل أن يقع الخلل من جهته سهوا أو عمدا ، ففي قلتهم قلة جهات الخلل ، وفي كثرتهم كثرة جهات الخلل ، وهذا جلي واضح<\/p>\n<p style=\"text-align: justify;\">[I say: Elevation pushes away mistakes from the chain since each narrator can commit a possible mistake whether un-intentionally or otherwise. The least there are from them, the least are the causes of mistakes and vice-versa, and this is clear and apparent.]<\/p>\n<p style=\"text-align: justify;\">In fact sometimes the scholars would take their traditions from popular but less reliable narrators simply because their chains are shorter than other more reliable scholars of their time. Al-Khatib al-Baghdadi describes the hardships that scholars of Hadith used to endure in order to get the highest of chains in “al-Kifayat fi `Ilm al-Riwayah”:<\/p>\n<p style=\"text-align: justify;\"> فهم أغمار وحملة أسفار قد تحملوا المشاق الشديدة وسافروا إلى البلدان البعيدة ، وهان عليهم الدأب والكلال واستوطئوا مركب الحل والارتحال وبذلوا الأنفس والأموال وركبوا المخاوف والاهوال ، شعث الرؤوس شحب الألوان ، خمص البطون ، نواحل الأبدان ، يقطعون أوقاتهم بالسير في البلاد طلباً لما علا من الإسناد ، لا يريدون شيئا سواه ولا يبتغون إلا إياه<\/p>\n<p style=\"text-align: justify;\">[They are like fast horses carrying heavy loads, they endured many hardships and traveled to distant lands, (…etc…) they sacrifice their selves and wealth while facing fears and calamities, their hair is messed up and their faces are pale, they are thin with empty stomachs because they spend their time journeying in the lands, asking for the most elevated of chains, they do not desire anything else.]<\/p>\n<p style=\"text-align: justify;\">It is even mentioned that some of the narrators who commit Tadlis (<a href=\"http:\/\/twelvershia.net\/2014\/07\/20\/oral-transmission-the-declaration-of-hearing-from-the-scholars\/\" rel=\"external nofollow\">refer to our article here<\/a>) also did it in certain instances to shorten their chains and make them appear more valuable.<\/p>\n<h1 style=\"text-align: justify;\">Al-Kulayni and his attempt to collect the teachings of the infallible:<\/h1>\n<p style=\"text-align: justify;\">The top Shia scholar Muhammad bin Ya`qoub al-Kulayni [258-329 hijri] is the popular author of the most important Shia Hadith book “al-Kafi”. He was born in Kulayn and then moved to Qum which was a Shia stronghold and religious center; he also traveled to al-Ray which was under the authority of a Shia government backed by the `Abbasi Caliphate, and finally he was buried in Bab al-Koufah. Al-Kulayni whom they deem as the most reliable of scholars and award with the title “Thiqat-ul-Islam”, this man placed great efforts that cost him twenty years of his life in order to collect the reliable narrations of the infallible leaders in his book in order to guide the Shia through them and so they may rely on them in their daily lives and preserve them for future generations.<\/p>\n<p style=\"text-align: justify;\">In the introduction of the English version of al-Kafi, they write many words of praise for al-Kulayni from several Shia scholars, including al-Majlisi who described him as: “He is unparalleled among all the scholars we have seen. The study of his compiling Hadith, his manner of editing them, proves him to be a Divinely gifted scholar.” Al-Tusi, the great scholar has called him the most dependable expert in Hadith, the man of highest esteem and a scholar in Hadith. Ibn Tawous said: “Al-Kulayni is the most eloquent and the most truthful in the knowledge of Hadith.” So it’s clear that we’re not talking about anybody here and that this man has something unique to offer in the field of Hadith.<\/p>\n<p style=\"text-align: justify;\">Al-Kulayni was asked by the desperate Shia of his time to collect this book for them since knowledge in those days was dying. He accepted this task by saying the following in the introduction of his book:<\/p>\n<p style=\"text-align: justify;\">“I have understood your concerns about the conditions of the people of our times who seem to have agreed up on ignorance to be the standard and authority in their dealings. They cooperate and work together to establish the ways and the manners of ignorance and distance themselves from knowledge and the people of knowledge (…etc…) You have mentioned that you are confused in the issues of the verification of hadith due to the difference in variously narrated texts and that you know the reason for variation but you do not find reliable people to discuss with. You have said that you wish you had a book sufficient (Kafi) that would contain all issues of the religion. A book that would provide a student all the material that he would need is urgently needed. A book is needed that would help people to have proper guidance in the matters of religion to follow the correct instructions of the truthful people and the prevailing Sunnah, the basis of practices. So that one would fulfill his responsibilities towards Allah, the Most Majestic, the Most Gracious, and follow the Sunnah of (the Holy Prophet). You have said, that you hope such a book would, Allah willing, help our brothers in faith to find the right guidance.”<\/p>\n<p style=\"text-align: justify;\">Al-Kulayni then responds to the above request:<\/p>\n<p style=\"text-align: justify;\">“Allah, the Most Majestic, the Most Gracious, has made the compilation of the book that you had wished for possible. I hope it will prove to be up to your expectations.”<\/p>\n<p style=\"text-align: justify;\">We learn from the above that the Shia were in a time of confusion and ignorance, they were at a cross-roads and the matter was very serious so al-Kulayni had to spend twenty years of his life to acquire what he deems correct from the authentic teachings of the Imams in order to save his brothers in faith.<\/p>\n<h1 style=\"text-align: justify;\">The time of al-Kulayni’s compilation:<\/h1>\n<p style=\"text-align: justify;\">We had previously mentioned that al-Kulayni was writing his book in a time when the Shia were strong and dominant in several parts of the land. They had also just tightened their political grip on the city of al-Ray which was a Shafi`i city and they began writing their books and preaching their beliefs openly. However, a much more unique phenomenon was taking place during al-Kulayni’s life, it was the minor occultation.<\/p>\n<p style=\"text-align: justify;\">The minor occultation was a time when the hidden 12th Imam had not yet cut-off all contact with humanity, it was a time when a few select people of special status were able to directly communicate with him, they are the Sufara’ (emissaries) who were four in total as well as many of their Wukala’ (representatives).<\/p>\n<p style=\"text-align: justify;\">To explain, we quote the Shia Muhammad Sadiq al-Sadr in his book “Tareekh al-Ghaybah al-Sughra”:<\/p>\n<p style=\"text-align: justify;\">الفارق بين السفراء الأربعة، وبين الوكلاء الآخرين يمكن تلخيصه في أمرين رئيسيين: (أحدهما): أن السفير يواجه الإمام شخصياً، ويراه مباشرة، ويسلمه الكتب والحوائج والأموال، وغيرها، ويتسلم منه الأجوبة والتعليمات الخاصة والعامة.. بينما الوكيل ليس كذلك، بل هو على اتصال بالإمام (عليه السلام) بواسطة السفير، فالوكيل همزة وصل بين الشيعة وبين السفير غالباً. (ثانيهما): أن مسؤولية السفير في الحفاظ على الدين، وعلى الشيعة عامة ﻻ تخص بلداً، أو قطراً معيناً، بينما الوكيل مسؤوليته محدودة بمنطقته، أو بلده<\/p>\n<p style=\"text-align: justify;\">[The difference between the four Sufara’ (emissaries) and the other Wukala’ (representatives) can be summarized in two main points: The emissary meets the Imam personally, he sees him directly and hands him the letters and needs and money, he also receives from him the answers (signed by him) and special instructions (…) As for the representative, he can only contact the Imam through the emissary, he is usually a liaison (link) between the Shia and the emissary. Secondly: The emissary’s responsibility to guard the religion and the Shia is general, not restricted to a country or province. Whereas, the representative’s responsibility is limited to his area or town.]<\/p>\n<p style=\"text-align: justify;\">Next we quote Ja`far al-Subhani in “Seerat-ul-A’immah”:<\/p>\n<p style=\"text-align: justify;\">من المؤكد انّه كان للإمام وكلاء آخرون في مناطق مختلفة مثل بغداد، الكوفة، الأهواز، همدان، قم، الري، آذربايجان، نيشابور، وهم إمّا يتصلون بالإمام من خلال هؤلاء السفراء الأربعة وينقلون مشاكلهم ومسائلهم إليه ـ عجّل اللّه تعالى فرجه الشريف ـ ، وكانت التواقيع تصدر بحقهم من قبل الإمام<\/p>\n<p style=\"text-align: justify;\">[Surely the Imam had other representatives in different lands such as Baghdad, al-Koufah, al-Ahwaz, Hamdan, Qum, al-Ray, Azerbayjan and Nishapour. These men contact the Imam through the four emissaries who in turn transmit their questions and problems to the Imam who would reply with signed letters.]<\/p>\n<p style=\"text-align: justify;\">In Majlisi’s book “Bihar-ul-Anwar” we read Ibn Tawous’ statement regarding al-Kafi:<\/p>\n<p style=\"text-align: justify;\">والشيخ محمد بن يعقوب كان حيّاً في زمن وكلاء المهدي ـ صلوات الله عليه ـ : عثمان بن سعيد العمري ، وولده أبي جعفر محمد ، وأبي القاسم بن روح ، وعليّ بن محمد السيمري ، وتوفي محمد بن يعقوب قبل وفاة علي بن محمد السيمري ، لأن علي بن محمد السيمري توفّي في شعبان سنة تسع وعشرين وثلاثمائة والكليني توفي ببغداد سنة ثمان وعشرين وثلاثمائة ، فتصانيف الكليني ورواياته في زمن الوكلاء المذكورين في وقت يجد طريقاً إلى تحقيق منقولاته وتصديق مصنفاته<\/p>\n<p style=\"text-align: justify;\">[Shaykh Muhammad bin Ya`qoub al-Kulayni was alive during the time of the four emissaries of the Mahdi: `Uthman bin Sa`eed al-`Amiri, his son abu Ja`far Muhammad, abu al-Qasim bin Rouh and `Ali bin Muhammad al-Samuri. Al-Kulayni passed away before al-Samuri (…etc…) so all the works and the collections (of Hadith) of al-Shaykh Muhammad ibn Ya`qoub al-Kulayni had been completed during the life time of the special representatives of Imam al-Mahdi. It is a ground to believe the veracity of his collection of Hadith.]<\/p>\n<p style=\"text-align: justify;\">Shia scholar Ja`far al-Subhani tells us of the special status of one of these four emissaries in his book “Seerat-ul-A’immah”:<\/p>\n<p style=\"text-align: justify;\">محمد بن عثمان ـ كأبيه ـ يعد من كبار الشيعة وكان يحظى باحترام وتقدير الشيعة، و هم يثقون بتقواه وعدالته، وكان من أصحاب الإمام العسكري الموثوق بهم كما قال الإمام العسكري رداً على سؤال أحمد بن إسحاق، وهو:عمّن آخذ وقول من أقبل؟: «العمري وابنه ثقتان، فما أدّيا إليك فعنّي يؤدّيان، وما قالا لك فعنّي يقولان، فاسمع لهما وأطعهما فانّهما الثقتان المأمونان<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin `Uthman bin Sa`eed: Like his father before him, he was from the biggest of the Shia who acquired their respect as they trust his piety and honesty. He was from the reliable companions of al-Imam al-`Askari as the Imam himself stated when answering Ahmad bin Ishaq: “Who should I learn from and whose saying can I trust (after you die)?” The Imam replied: “Al-`Amiri and his son are trustworthy so whatever they tell you then it is from me, obey them and listen to them for they are both reliable and trusted.”]<\/p>\n<p style=\"text-align: justify;\">Al-Subhani then says that Muhammad bin `Uthman was in charge for forty years and he had many representatives in the lands and he would manage the affairs of the Shia and that during his time plenty of letters from the hidden Imam reached us.<\/p>\n<p style=\"text-align: justify;\">We learn from the above that:<\/p>\n<p style=\"text-align: justify;\">A- Al-Kulayni lived in the time of the four emissaries of the Imam and their representatives.<\/p>\n<p style=\"text-align: justify;\">B- The official representatives of the hidden Imam were present in at least four of the cities al-Kulayni resided in.<\/p>\n<p style=\"text-align: justify;\">C- The 11th Imam ordered his followers to take their religion from the emissaries.<\/p>\n<h1 style=\"text-align: justify;\">Al-Kulayni’s options at the time of compilation:<\/h1>\n<p style=\"text-align: justify;\">Kulayni was faced with two choices as a renowned scholar of Hadith and an expert in his field as the Shia described him. His example was that of a man who wished to travel to a city and to do that he could either go directly through a safe and short asphalt road OR he could take a long muddy road through a dangerous forest.<\/p>\n<p style=\"text-align: justify;\">The first way: Al-Kulayni could take his religion from the closest possible infallible guide in order to shorten the number of narrators and achieve `Uluw-ul-Isnad (The elevated chain). In this case, the closest two Imams for him would be al-`Askari and al-Qa’im, this way he’d have only one narrator between himself and the infallible and therefore his narrations would be safe from error and far from any criticism due to the weakness or reliability of narrators. He can do this by requesting those narrations from the companions of the 11th Imam or by sending a letter to the 12th Imam through his emissaries and representatives as instructed by the Imam himself.<\/p>\n<p style=\"text-align: justify;\">The second way: To collect the same texts of those reports but through narrations with long chains of transmission linking him to a very distant infallible guide. This method would be much harder as he needs to place more effort in collecting these texts from various Shia scholars and books throughout the lands and these reports will be full of contradictions, additions and fabrications due to the long chains filled with weak and anonymous narrators.<\/p>\n<h1 style=\"text-align: justify;\">Observations about al-Kulayni’s chosen method:<\/h1>\n<p style=\"text-align: justify;\">After learning about the importance of the elevated chains and the options available to al-Kulayni during the time of compilation, we realize that there are a lot of question marks about his chosen method in gathering the Shia Hadith literature in al-Kafi.<\/p>\n<p style=\"text-align: justify;\">We observe that the vast majority of his narrations (which are around sixteen thousand) come through the path of two Imams, al-Sadiq and al-Baqir with chains such as these:<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 3\/489:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ أَبِي حَمْزَةَ أَوْ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim, from his father, from `Amro bin `Uthman, from Muhammad bin `Udhafir, from abu Hamzah or Muhammad bin Muslim, from Imam abu Ja`far (as), he said: etc…]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 3\/492:<\/p>\n<p style=\"text-align: justify;\">مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Yahya, from some of our companions, from al-Hasan bin `Ali bin abi Hamzah, from abi Baseer, from Imam abu `Abdillah (as), he said: etc…]<\/p>\n<p style=\"text-align: justify;\">The above method is very odd and problematic since al-Kulayni could have just settled for much shorter chains as described above. Instead we find him quoting chains composed of four, five and even six men in order to reach al-Baqir [died 114 hijri] or al-Sadiq [died 148 hijri] who died in Madinah instead of al-`Askari [died 260 hijri] who died in `Iraq and thus was closer to him in time and location.<\/p>\n<p style=\"text-align: justify;\">Al-Kulayni was capable of narrating from al-`Askari and even his father al-Hadi [died 254 hijri] but their narrations together are so rare in his book that they are easily less than one percent and this is very odd since he should have completely relied on them.<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/409:<\/p>\n<p style=\"text-align: justify;\">علي بن محمد ، عن سهل بن زياد ، عن محمد بن عيسى ، عن محمد بن الريان قال : كتبت إلى العسكري عليه السلام جعلت فداك<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Muhammad, from Sahl bin Ziyad, from Muhammad bin `Isa, from Muhammad bin al-Rayyan: I wrote to Imam al-`Askari (as) etc…]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/513:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ كَتَبَ مُحَمَّدُ بْنُ حُجْرٍ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) يَشْكُو<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Muhammad, from some of our companions, he said: Muhammad bin Hajar wrote to Imam abi Muhammad (as) etc…]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 7\/15:<\/p>\n<p style=\"text-align: justify;\">مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ عَنْ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنِ الْحَسَنِ بْنِ رَاشِدٍ قَالَ سَأَلْتُ الْعَسْكَرِيَّ ( عليه السلام ) بِالْمَدِينَة<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Ja`far al-Razzaz, from Muhammad bin `Isa and Muhammad bin Yahya, from Muhammad bin Ahmad, from Muhammad bin `Isa bin `Ubayd, from al-Hasan bin Rashid who said: I asked al-`Askari (as) etc…]<\/p>\n<p style=\"text-align: justify;\">In this case we still find that al-Kulayni places an average of three men between himself and the last two visible Imams. The small number of reports he transmits from them shows that he had completely dismissed them and raises more question marks on his methodology which left us with a book, more than half of which is weak.<\/p>\n<h1 style=\"text-align: justify;\">The Imam’s responsibility towards his Shia:<\/h1>\n<p style=\"text-align: justify;\">The Imam of the time is present as a grace (lutf) for humankind and guiding them is his purpose and mission. Al-Hasan al-`Askari could have facilitated this process and made al-Kulayni’s task of saving the Shia much easier if he had chosen one of the following:<\/p>\n<p style=\"text-align: justify;\">The first matter: The Imam takes the initiative and compiles the Hadith literature in a big book so that the nation may be guided through it, by doing so he would completely solve the problem of chains since there would be no need for a chain in this case and many copies of this book would be distributed in the lands the same way `Uthman sent copies of his official Mushaf after uniting the Muslims on it.<\/p>\n<p style=\"text-align: justify;\">The second matter: The Imam could have transmitted the Hadith literature to his closest and biggest companions and they in turn would transmit it to the Shia the same way Ja`far al-Sadiq offered his companions all the knowledge he received from his fathers then they transmitted it to his Shia. This way, there would be no need for chains composed of five and six men, al-Kulayni could have wrote a much smaller book with chains composed of only one or two individuals maximum, they are well known and reliable since they are the Imam’s trusted companions.<\/p>\n<p style=\"text-align: justify;\">There is no reason to transmit the traditions of infallible guides such as al-Sadiq or al-Baqir with long chains of non-infallible men unless al-Sadiq was the last of the Imams and their seal. However, we know that Imamah continued a long time after al-Sadiq and the Imams received all knowledge from their father al-Sadiq in a much more accurate and complete way than the likes of Zurarah or abu Baseer who are capable of error, forgetfulness or even lying.<\/p>\n<h1 style=\"text-align: justify;\">Verifying the Shia Hadith literature through the Imam of the time:<\/h1>\n<p style=\"text-align: justify;\">If the Imams were to fail in fulfilling their responsibility, then comes the role of the leaders of the Shia such as Kulayni to carry-out the mantle.<\/p>\n<p style=\"text-align: justify;\">The first mission: In this scenario it becomes al-Kulayni’s duty to seek the emissaries and transfer the requests and pleas of all the Shia which would motivate the 12th Imam to gather all the Hadithi-literature he possesses and hand it to them in a very short time since he is capable of this miraculous work. This would not be an issue since we know that the hidden Imam used to receive many requests in all matters of religion and he would answer even the smallest of religious queries, he would also answer worldly requests such as interceding for his Shia and supplicating for them so that Allah may bless them or protect them or lighten their burdens.<\/p>\n<p style=\"text-align: justify;\">The second mission: If al-Kulayni did not think of the first method, then his second task would be harder. He must collect whatever reports are found in the books by himself and then after many years and when his book is complete, he must present this book to the hidden Imam through the emissaries and representatives. The Imam would then check the contents and weed-out all the false and fabricated narrations such as the narrations of Tahreef found in al-Kafi. This would not be unprecedented as the Shia have presented their books to the Imams before, such as `Ubaydullah bin `Ali al-Halabi and his book which he presented to al-Sadiq, or the books of the companions of al-Sadiq that were later presented to al-Rida so he may erase the fabrications of the extremists, or the books of Yunus bin `Abdul-Rahman and al-Fadl bin Shadhan who were presented to al-Hasan al-`Askari.<\/p>\n<h1 style=\"text-align: justify;\">An explanation for al-Kulayni’s major mistake:<\/h1>\n<p style=\"text-align: justify;\">Al-Kulayni who was the leader of the Shia in his time as they described him has committed a big blunder; he has wasted the only chance the Shia had of verifying the validity and divinity of their Hadith-literature. We decided to try and explain why such an expert scholar of Hadith and a renowned Muhaddith would fall into basic mistakes that even a student of Hadith would not commit.<\/p>\n<p style=\"text-align: justify;\">First possibility: Al-Kulayni was not an expert scholar of Hadith nor was he even qualified for such a big task so he wasted twenty years of his life on copying many weak reports from unknown scholars and books instead of seeking the Imam of his time and his emissaries. This also means that the Shia simply praised him since they had no other choice because he was the author of their biggest and oldest book.<\/p>\n<p style=\"text-align: justify;\">Second possibility: Al-Kulayni avoided narrating anything from the last couple of Imams such as al-Jawad, al-Hadi and al-`Askari because he knew they were nowhere near as knowledgeable as their fathers before them, this is why the Shia as a whole avoided narrating much from them since they had nothing to offer and this is reflected in Shia Hadith literature.<\/p>\n<p style=\"text-align: justify;\">Third possibility: Al-Kulayni did not attempt to contact the emissaries or their representatives and ask them for this favor since he knew they were incapable of it because in reality, they’re frauds and liars who only excel in robbing the Shia and producing scribbles of paper then claiming they received it from the hidden Imam. Due to al-Kulayni’s lack of trust and since he had no other choice, he ended up having to collect the old Shia narration from the time of al-Sadiq and al-Baqir.<\/p>\n<h1 style=\"text-align: justify;\">`Uluw-ul-Isnad in Sahih al-Bukhari:<\/h1>\n<p style=\"text-align: justify;\">Muhammad bin Isma`eel al-Bukhari [194-256 hijri] is arguably the greatest scholar of Hadith according to Ahlul-Sunnah and the author of their most authentic book after Allah’s book. The author al-Bukhari did not believe in the infallibility of anybody after the chosen Messenger peace be upon him, so his goal was not to narrate with short chains from Ja`far bin Muhammad or his father. There are 183 years between al-Bukhari and our infallible guide Muhammad bin `Abdillah (saw) yet al-Bukhari was able to narrate with chains as short as three links between him and the Prophet (saw).<\/p>\n<p style=\"text-align: justify;\">Sahih al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">حدثنا مكي بن إبراهيم قال :حدثنا يزيد بن أبي عبيد عن سلمة قال : سمعت النبي – صلى الله عليه وسلم – يقول<\/p>\n<p style=\"text-align: justify;\">[We were told by Makki bin Ibrahim, he said: Yazid bin abi `Ubayd told us, from Salamah, he said: I heard the Prophet (saw) etc…]<\/p>\n<p style=\"text-align: justify;\">Sahih al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">حدثنا خلاد ابن يحيى حدثنا عيسى بن طهمان قال : سمعت انس بن مالك رضي الله عنه يقول :نزلت آية الحجاب<\/p>\n<p style=\"text-align: justify;\">[We were told by Khallad ibn Yahya: `Isa bin Tahman told us, he said: I heard Anas ibn Malik say: The verse of the veil had descended etc…]<\/p>\n<p style=\"text-align: justify;\">Sahih al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ<\/p>\n<p style=\"text-align: justify;\">[We were told by Sulayman bin Harb, he said: Shu`bah told us, from Qatadah, from Anas, from the Prophet (saw) etc…]<\/p>\n<p style=\"text-align: justify;\">Sahih al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ: حَدَّثَنَا زُهَيْرٌ، قَالَ: حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ الْبَرَاءِ بْنِ عَازِبٍ، أَنّ النَّبِيَّ<\/p>\n<p style=\"text-align: justify;\">[We were told by `Amro bin Khalid, he said: Zuhayr told us, he said: abu Ishaq told us, from al-Bara’ bin `Azib: That the Prophet (saw) etc…]<\/p>\n<p style=\"text-align: justify;\">Most traditions in al-Bukhari are composed of four to five men. Al-Kulayni who was two years old when al-`Askari died still narrates from him through three men as opposed to a hundred and eighty years between the Prophet (saw) and al-Bukhari. This is not surprising when you know that al-Bukhari had traveled far and wide and took the religion from the most prominent and expert Hadith scholars of his time unlike someone else.<\/p>\n<p style=\"text-align: justify;\">And peace be upon our Prophet and his nation until the day of judgement.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Introduction to the concept of `Uluw-ul-Isnad (elevation of the chain): An important element in Hadith sciences which was very vital for the early Hadith scholars is what is known as `Uluw-ul-Isnad or the elevation of chain, this concept was a <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/04\/the-elevated-chain-its-definition-and-importance\/\" title=\"The elevated chain: Its definition and importance.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-2683","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2683","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2683"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2683\/revisions"}],"predecessor-version":[{"id":2691,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2683\/revisions\/2691"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2683"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2683"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}