{"id":2711,"date":"2015-11-09T21:16:30","date_gmt":"2015-11-09T21:16:30","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2711"},"modified":"2018-10-30T14:58:31","modified_gmt":"2018-10-30T14:58:31","slug":"issues-of-ghaybah-part-16","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/09\/issues-of-ghaybah-part-16\/","title":{"rendered":"Issues of Ghaybah [Part-16] &#8211; Refuting the argument about other Shia Mahdies being dead"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2711\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon this nation and its Prophet,<\/p>\n<p style=\"text-align: justify;\">As you all know, many different Shia sects claimed they are truthful, each sect believed in a different Mahdi whom they claimed did not die and will return to fill the earth with justice, such as the Nawousiyyah who believed Ja`far was the Mahdi, the Kaysaniyyah who believed Ibn al-Hanafiyyah is the Mahdi or the Waqifiyyah who believed Musa was the Mahdi.<\/p>\n<p style=\"text-align: justify;\">Twelver Shia scholars believe al-`Askari&#8217;s son is the Mahdi so they try refuting these other sects. From their most common arguments is that these other men cannot be the awaited Mahdi since we heard that they died or that people saw their execution.<\/p>\n<p style=\"text-align: justify;\">Review our article (<a href=\"http:\/\/twelvershia.net\/2015\/10\/30\/the-shia-mahdi\/\" rel=\"external nofollow\">here<\/a>) to see the various men claimed to be &#8220;The awaited Mahdi&#8221; by different Shia sects.<\/p>\n<p style=\"text-align: justify;\"><strong>The Twelver argument:<\/strong><\/p>\n<p style=\"text-align: justify;\">We quote al-Mufid from Bihar al-Anwar vol.37 pg.12:<\/p>\n<p style=\"text-align: justify;\">[As for the sect of Nawousiyyah, by denying the death of abi `Abdillah (as) (then claiming his Mahdawaiyyah) they have committed the fault of rejecting what is known by necessity and what was witnessed. This is because knowing his death is just like knowing his father&#8217;s death before him, in this case there would be no difference between this sect and other sects of extremists who rejected the death of Ameer-ul-Mu&#8217;mineen (as), or those who denied the death of al-Husayn (as) then claimed that it had only appeared to the people.]<\/p>\n<p style=\"text-align: justify;\">We quote al-Tusi from al-Ghaybah pg.23:<\/p>\n<p style=\"text-align: justify;\">[What proves the corruption of the Madhab of al-Waqifah who stopped at abu al-Hasan Musa (as) and said: &#8220;He is the Mahdi&#8221;. Their belief is corrupt due to his apparent death, it became famous just as his father&#8217;s death became famous and his grandfather as well as his fathers before them. If we were to be suspicious about whether he truly died, then we&#8217;d be no different than the Nawousiyyah, the Kaysaniyyah, the Ghulaat and the Mufawwidah who also rejected the death of his past fathers (as).]<\/p>\n<p style=\"text-align: justify;\"><strong>Refuting the Twelver argument:<\/strong><\/p>\n<p style=\"text-align: justify;\">So as you can see, their main argument usually is that the man is not the Mahdi, since his death was reported or witnessed and then it became popular knowledge. We will refute this argument from their own books and what they narrated from their own Imams below Insha-Allah.<\/p>\n<p style=\"text-align: justify;\">The Shia narrated the following about the identity of the &#8220;Qa&#8217;im&#8221;  and his signs in their books of Hadith.<\/p>\n<p style=\"text-align: justify;\">We read in both Al-Ghaybah by al-Tusi and Al-Imamah wal-Tabsirah by Ibn Babuwayh:<\/p>\n<p style=\"text-align: justify;\">Sulayman b. Dawud narrated from `Ali b. Abi Hamza from Abu Basir. He said: I heard Abu Ja`far (as) saying: There are four traditions (sunan) from four prophets in the possessor of this affair (Mahdi): a tradition from Musa, a tradition from `Isa, a tradition from Yusuf, and a tradition from Muhammad (saw). As what [is from] Musa it is (he will) fear, being vigilant. As to what [is from] Yusuf it is the imprisonment. As to what [is from] `Isa, so it will be said: He died, and he did not die. And as to what [is from] Muhammad (saw) it is the sword.<\/p>\n<p style=\"text-align: justify;\">We read in Kama-ul-Deen by Ibn Babuwayh:<\/p>\n<p style=\"text-align: justify;\">My father and Ibn al-Walid, from al-Himyari from Muhammad b. `Isa from Sulayman b. Dawud from Abu Basir: The possessor of this affair shall have four traditions (sunan) from four prophets: a tradition from Musa, a tradition from `Isa, a tradition from Yusuf, and a tradition from Muhammad (saw). As for Musa then he is fearful and on the lookout. as for Yusuf then it is the prison, as for `Isa it shall be said: &#8220;He died&#8221; but he did not die, as for Muhammad (saw) then it is the sword.<\/p>\n<p style=\"text-align: justify;\">We observe in al-Ghaybah bin al-Nu`mani:<\/p>\n<p style=\"text-align: justify;\">`Ali b. Ahmad narrated to us from `Ubaydullah b. Musa from `Abdullah b. Jabala from al-Hasan b. Abi Hamza from Abu Basir. He said: I heard Abu Ja`far al-Baqir (as) saying: There are four traditions (sunan) from four prophets in the possessor of the affair: a tradition from Musa, a tradition from `Isa, a tradition from Yusuf, and a tradition from Muhammad (saw). So I said: What is the tradition of Musa? He said: (He will) fear, being vigilant. I said: What is the tradition of `Isa? So he said: It will be said regarding him what is said regarding `Isa. I said: So what is the tradition of Yusuf? He said: The prison and the absence. I said: And what is the tradition of Muhammad (saw)? He said: When he rises, he will take the course of the conduct of the Messenger of Allah (saw), except that he will clarify the ways of Muhammad (saw), and put the sword upon his shoulder for eight months in turmoil and tumult until Allah is pleased. I said: How will he know the pleasure of Allah? He said: Allah will cast mercy in his heart.<\/p>\n<p style=\"text-align: justify;\">The narrations above in which a companion of the Imam asks about the signs of Sahib-ul-Amr (The awaited Mahdi), the Imam explains that he shall resemble four different prophets in four different things. Based on these four signs we shall see whether these descriptions fit the 12th Imam and whether the Twelvers have a ground to stand on in refuting other Shia sects.<\/p>\n<p style=\"text-align: justify;\">1- The awaited Qa&#8217;im will be like Muhammad (saw) in that he shall declare armed struggle and fight with the sword, this is of course after he rises and appears. All Shia sects agree on this concept and that&#8217;s the only way the earth will be filled with justice as it was filled with oppression in such a short time.<\/p>\n<p style=\"text-align: justify;\">2- The awaited Qa&#8217;im will be like Musa (as) in that he shall be followed by his enemies and so he will be very cautious while in a state of fear. All Shia sects agree on this and this is the excuse they use as to why those men disappeared without trace.<\/p>\n<p style=\"text-align: justify;\">3- The awaited Qa&#8217;im will be like Yusuf (as) in that he shall be imprisoned by his enemies. In this sense we see that the Kaysani as well as the Waqifi Shia have more right for their claims than the Qat&#8217;i Ithna-`Ashariyyah. This is because Ibn al-Hanafiyyah, the Mahdi of the Kaysaniyyah was imprisoned in the time of `Abdullah bin al-Zubayr, also Musa bin Ja`far the Mahdi of the Waqifah was imprisoned by the Caliph of his time. On the other hand, Muhammad bin al-Hasan al-`Askari who is the Mahdi of the Twelvers was never imprisoned or caught.<\/p>\n<p style=\"text-align: justify;\">4- The awaited Qa&#8217;im will be like `Isa (as) and this is because `Isa (as) was made to appear as if he died but he never really died. This is why the people will differ, it shall be popularly known that he died while others will deny it, such as in our days only the Muslims believe he did not die on the cross. This fact alone cancels the argument of the likes of al-Mufid, al-Tusi and al-Murtada who say that other so called Mahdies are not legitimate because it&#8217;s said that they died or that some people claimed to have witnesses their death, well in this case it would not be any different than those who claimed to witness `Isa&#8217;s (as) death as it was made to appear.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon this nation and its Prophet, As you all know, many different Shia sects claimed they are truthful, each sect believed in a different Mahdi whom <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/09\/issues-of-ghaybah-part-16\/\" title=\"Issues of Ghaybah [Part-16] &#8211; Refuting the argument about other Shia Mahdies being dead\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[16],"class_list":{"0":"post-2711","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2711","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2711"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2711\/revisions"}],"predecessor-version":[{"id":4440,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2711\/revisions\/4440"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2711"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2711"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2711"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}