{"id":2722,"date":"2015-11-10T11:31:10","date_gmt":"2015-11-10T11:31:10","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2722"},"modified":"2015-12-12T23:02:52","modified_gmt":"2015-12-12T23:02:52","slug":"a-criticism-of-forty-hadith-the-awaited-savior-of-humanity","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/10\/a-criticism-of-forty-hadith-the-awaited-savior-of-humanity\/","title":{"rendered":"A Criticism of: &#8220;Forty Hadith: The Awaited Savior of Humanity&#8221;"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2722\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\">Introduction<\/h3>\n<p style=\"text-align: justify;\">The following are the hadith gradings to Abdul-Rahim Mugahi’s “Forty Hadith: The Awaited Savior of Humanity”. The piece can be found on <a href=\"http:\/\/www.al-islam.org\/forty-hadith-awaited-savior-humanity-abdul-rahim-mugahi\" rel=\"external nofollow\">al-islam.org.<\/a><\/p>\n<p style=\"text-align: justify;\">Ironically, the text is a testament to the abundance of fabrications by early Shias when it comes to narrations about Al-Mahdi. As we will see below, out of the forty narrations, only one is authentic according to Shia hadith standards. We have included notes about incorrect referencing and half-quotes below.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">The most interesting narrations are hadith #24 which indicates that Al-Mahdi will kill all non-Muslims, hadith #37 that suggests that Al-Mahdi will appear in a state of fear, and hadith #40 that is an indirect merit for the companions of the Prophet (peace be upon him).<\/span><\/p>\n<h3 style=\"text-align: justify;\">The Narrations about the Awaited Savior<\/h3>\n<p style=\"text-align: justify;\">1- The Messenger of Allah (peace be upon him and his family) has said: “Al-Mahdi is from my progeny; his face is like the brightly illuminated moon.”<br \/>\nBiharul Anwar, Volume 51, Page 85; Kashful Ghammah<\/p>\n<p style=\"text-align: justify;\"><strong>Note<\/strong>: The narration continues: “His color is the color of an Arab and his body is the body of an Israelite.”<br \/>\n<strong>Weak<\/strong>: The author of Al-Kashf does not include a chain of narrators to Huthaifa the companion of the Prophet peace be upon him.<\/p>\n<p style=\"text-align: justify;\">2- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon them both) has said: “The city of Qum has been named so because its inhabitants will gather with the Qa’im from Ale Muhammad and will stand alongside him, will strive to be hold firm to (their belief and assistance) of him and will assist him.”<br \/>\nSafinatul Bihar, Volume 2, Page 446<br \/>\n<strong>Weak<\/strong>: The author does not provide a source.<\/p>\n<p style=\"text-align: justify;\">3- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon them both) has said: “There will be thirteen women alongside al-Qa’im.” Al-Mufadhal asked the Imam: “And what will their role be?” The Imam replied: “They will treat the injured and look after the sick just as the [women did] at the time of the Messenger of Allah [during the battles].”<br \/>\nIthbatul Hudat, Volume 7, Page 150<br \/>\n<strong>Note<\/strong>: The narration continues that these will include women like Um Ayman and Sumayyah the mother of Ammar.<br \/>\n<strong>Weak<\/strong>: The narration includes Mohammad bin Imran who is anonymous according to Al-Jawahiri in his Al-Mufeed min Mu’jam Rijal Al-Hadith (p. 563).<\/p>\n<p style=\"text-align: justify;\">4- The Messenger of Allah (peace be upon him and his family) has said: “Congratulations to the person who meets the Qa’im [one who will rise] from my Ahlul Bayt and has firm belief in him before his advent. He will have love for his friends, and will distance himself from his enemies and will have love for the leaders of guidance (the Imams) who came before him. Indeed these are my true friends, those whom I have love and affection for and (they) are the noblest of people from my nation.”<br \/>\nBiharul Anwar, Volume 52, Page 129; al-Ghaybah of Shaykh Tusi<br \/>\n<strong>Weak<\/strong>: Ayman bin Muharriz has not be graded as trustworthy by any early hadith scholar.<\/p>\n<p style=\"text-align: justify;\">5- Imam Hasan ibn ‘Ali al-’Askari (peace be upon them both) has said: “… I swear by Allah that he (Imam al-Mahdi) shall go into an occultation such that none shall be saved [during that period] from destruction, except the person whom Allah, Glorious and Grand is He, makes firm on the belief of his Imamate [of Imam al-Mahdi] and whom He grants the Divine ability (tawfiq)to supplicate for his speedy advent.”<br \/>\nKamal ad-Din, Volume 2, Page 384<br \/>\n<strong>Weak<\/strong>: Ali bin Abdullah Al-Warraq is anonymous according to Al-Jawahiri (p. 403).<\/p>\n<p style=\"text-align: justify;\">6- Imam Muhammad ibn ‘Ali al-Jawad (peace be upon them both) has said: “… Indeed al-Qa’im is from among us (the Ahlul Bayt) and he is al-Mahdi &#8211; the one whom it is obligatory to wait for during his occultation and obey during his advent, and he is the third from my progeny …”<br \/>\nKamal ad-Din, Volume 2, Page 377<br \/>\n<strong>Weak<\/strong>: Abu Turab Al-Ruyani has not be graded as trustworthy by any early hadith scholar.<\/p>\n<p style=\"text-align: justify;\">7- Imam ‘Ali ibn Abi Talib (peace be upon both of them) has said: “[When Imam al-Mahdi makes his advent] the following of the lower desires will be transformed into the following of guidance (of Allah) after the following of the guidance (of Allah) had been transformed into the following of the lower desires; and the thoughts and opinions (of the people) will be in line with the Qur’an after the Qur’an had previously been put in line and accordance with the people’s thoughts and opinions.”<br \/>\nBiharul Anwar, Volume 51, Page 120; <a href=\"http:\/\/twelvershia.net\/2015\/12\/12\/nahjul-balagha-contradicts-shia-teachings\/\" rel=\"external nofollow\">Nahjul Balagha<\/a><br \/>\n<strong>Weak<\/strong>: It is narrated by Al-Shareef Al-Radhi through a chainless report.<\/p>\n<p style=\"text-align: justify;\">8- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “I swear by Allah that your Imam will go into an occultation for a number of years … [during that period] the eyes of the true believers shall be filled with tears [due to being separated from him].”<br \/>\nBiharul Anwar, Volume 51, Page 147; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration includes Mohammad bin Esam and Mohammad bin Musawir. Both are anonymous according to Al-Jawahiri (See: p. 550 and p. 577)<\/p>\n<p style=\"text-align: justify;\">9- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “Indeed the possessor of the command (Imam al-Mahdi) has a house which is referred to as, ‘The House of Praise’. In this house there is a lamp which has been glowing since the day he was born and will continue to do so until the day he makes his advent with the sword, and it will not be put out.”<br \/>\nBiharul Anwar, Volume 52, Page 158; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration includes Al-Hasan bin Ali Al-Bata’ini who is a liar. See Khulasat Al-Aqwal by Al-Hilli (p. 334).<\/p>\n<p style=\"text-align: justify;\">10- Imam ‘Ali ibnil Husain al-Sajjad (peace be upon both of them) has said: “Indeed the people who live during the time of his occultation, have firm belief in his (the 12th Imam’s) Imamate and are awaiting his advent are the best people of every age since Allah, Great is His Mention, has granted them from the intellect, understanding and cognizance needed which would permit them to live during the period of the occultation, as if they were living during the time of his advent.”<br \/>\nBiharul Anwar, Volume 52, Page 122; al-Ihtijaj<br \/>\n<strong>Weak<\/strong>: The report is disconnected for there are centuries between the author and Abu Hamza Al-Thammali.<\/p>\n<p style=\"text-align: justify;\">11- A man once asked Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) how he should send his salutations upon Imam al-Qa’im (may Allah hasten his advent) and the Imam replied: ”Say: Greetings be upon you, O’ Remnants of Allah [As-Salamu ‘Alaykum Ya Baqiyatullah]!”<br \/>\nBiharul Anwar, Volume 52, Page 373, Tafsir Furat ibn Ibrahim<br \/>\n<strong>Weak<\/strong>: The report comes through Ja’afar bin Mohammad bin Malik who is a fabricator of hadith according to Al-Najashi (p. 122).<\/p>\n<p style=\"text-align: justify;\">12- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “When our Qa’im makes his advent, he will place his hand over the heads of the servants and their intellects will join together and their ethical traits will be perfected.”<br \/>\nBiharul Anwar, Volume 52, Page 336, Kharaij of al-Rawandi<br \/>\n<strong>Weak<\/strong>: The narration is weak due to disconnection for Al-Rawandi is a late scholar and did not meet Mohammad bin Eisa.<\/p>\n<p style=\"text-align: justify;\">13- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “When al-Qa’im makes his advent, not a single place of land will remain except that the call to the testimony of, ‘There is no creature worthy of worship except for Allah and indeed Muhammad is the Messenger of Allah’will be given (there).”<br \/>\nBiharul Anwar, Volume 52, Page 340; Tafsir al-’Ayyashi<br \/>\n<strong>Weak<\/strong>: The report includes no chain to the main narrator.<\/p>\n<p style=\"text-align: justify;\">14- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “ … During that time (the period of the occultation), await the advent (of the Imam) every morning and evening … ”<br \/>\nUsul al-Kafi, Volume 1, Page 323<br \/>\n<strong>Weak<\/strong>: The narrator from Al-Mufadhal bin Omar is unknown. The chain includes a narrator referred to as “someone” and “some of his peers”.<\/p>\n<p style=\"text-align: justify;\">15- The Messenger of Allah (peace be upon him and his family) has said: “Al-Mahdi is the peacock [ornament] of the people of Paradise.”<br \/>\nBiharul Anwar, Volume 51, Page 105; Tara’if<br \/>\n<strong>Weak<\/strong>: The narration does not include a chain.<\/p>\n<p style=\"text-align: justify;\">16- It has been narrated from ‘Ali ibnil Husain, the Ornament of the Worshippers (peace be upon both of them) that he said: “When our Qa’im makes his advent, Allah, the Noble and Glorious, will remove all maladies from our Shi’a (followers) and will make their hearts [as firm] as pieces of iron. He will make the physical strength of one man equal to that of forty men, and they will be the rulers over the entire Earth and its sovereigns.”<br \/>\nMisbahul Mutahajjid, Page 737<br \/>\n<strong>Note<\/strong>: I could not find the narration in Misbah Al-Mutahajjid, but I found it in Al-Bihar 52\/317, and it is taken from Al-Khisal.<br \/>\n<strong>Weak<\/strong>: The narration includes Al-Hasan bin Thuwair bin Abi Fakhita who is anonymous.<\/p>\n<p style=\"text-align: justify;\">17- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “Knowledge is contained in twenty-seven letters (parts) and everything which all of the (previous) messengers brought was merely two of these letters and until the day (when al-Mahdi makes his advent), the people will not be given knowledge except of these two letters. So then when our Qa’im makes his advent, he will bring with him the other twenty-five letters (of knowledge) and he will spread these among the people and add these to the previous two letters (parts) such that he will have imparted the twenty-seven letters (of knowledge) to them.”<br \/>\nWasa’il ash-Shi’a, Volume 7, Page 326, hadith10<br \/>\n<strong>Note<\/strong>: The narration cannot be found in Al-Wasa’el but it is in Al-Bihar 52\/336.<br \/>\n<strong>Weak<\/strong>: Al-Majlisi is quoting Al-Rawandi who is a late scholar and does not include his chain to Musa bin Omar.<\/p>\n<p style=\"text-align: justify;\">18- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) said: “When the Qa’im of the Ahlul Bayt makes his advent, he will divide (the riches) with equity and will show justice among the people. So whoever obeys him, has obeyed Allah; and whoever goes against him, has gone against Allah. Indeed al-Mahdi was named as such because he will guide to the hidden affairs.”<br \/>\nBiharul Anwar, Volume 97, Page 117<br \/>\n<strong>Weak<\/strong>: The narration includes Amr bin Shimr who is very weak according to Al-Najashi (p. 287).<\/p>\n<p style=\"text-align: justify;\">19- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “… May my father and my mother be sacrificed for that person whose name is the same as my name, and whose title of appellation is the same as my title of appellation and he is the seventh person (from my progeny) after me …”<br \/>\nMisbahul Mutahajjid, Page 680<br \/>\n<strong>Note<\/strong>: The narration isn’t in Al-Misbah, but in Al-Bihar 24\/241 from Al-Ghaiba by Al-Nu’mani.<br \/>\n<strong>Weak<\/strong>: The narration includes Mohammad bin Sinan who is very weak according to Al-Najashi (p. 328).<\/p>\n<p style=\"text-align: justify;\">20- The Messenger of Allah (peace be upon him and his family) has said: “… Paradise is for that person who meets him (al-Mahdi), and paradise is for to that person who loves him, and paradise is for that person who has belief in him (and his Imamate).”<br \/>\nWasa’il ash-Shi’a, Volume 7, Page 327, hadith1<br \/>\n<strong>Note<\/strong>: The hadith is not in Al-Wasa’il, but in Al-Bihar 52\/309.<br \/>\n<strong>Weak<\/strong>: Ahmad bin Thabit Al-Dawalibi is anonymous according to Al-Jawahiri (p. 23).<\/p>\n<p style=\"text-align: justify;\">21- The Messenger of Allah (peace be upon him and his family) has said: “The appointed time (of the Day of Resurrection) will not come until the one from among us (the Ahlul Bayt) will rise with the truth and make his advent [Imam al-Mahdi], and this will take place when Allah, the Noble and Grand permits. So whoever obeys him shall be saved, and whoever goes against him will be destroyed…”<br \/>\nWasa’il ash-Shi’a, Volume 7, Page 325, hadith6<br \/>\n<strong>Note<\/strong>: The hadith is not in Al-Wasa’il, but in Al-Bihar 51\/65.<br \/>\n<strong>Weak<\/strong>: The narration includes Al-Hasan bin Abdullah bin Mohammad bin Al-Abbas Al-Razi, and he was not strengthened by the scholars, which makes him anonymous.<\/p>\n<p style=\"text-align: justify;\">22- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “ … When alQa’im makes his advent, at that time, friendship and unity will be established to such a degree that a person will be able to put his hand in his brother-in-faith’s pocket and take whatever he needs without his brother preventing him from doing so!”<br \/>\nWasa’il ash-Shi’a, Volume 7, Page 324, hadith3<br \/>\n<strong>Weak<\/strong>: The narration is a quote from Al-Mufeed’s Ikhtisaas, which includes a disconnected chain until Aban.<\/p>\n<p style=\"text-align: justify;\">23- The Commander of the Faithful, ‘Ali ibn Abi Talib (peace be upon both of them) said: “When our Qa’im makes his advent, the skies will send down their rain; the Earth will bring forth its produce; enmity will be removed from the hearts of the servants; wild animals and beasts will live [in peace] with one another and will not stampede each other; [and life will be such that] if a woman wanted to walk from ‘Iraq to Sham (Syria), then every step that she took will be on luscious, green grass and she will be able to display her adornments (jewelry, etc…) [and not a single person will try and steal them from her] – no animal will attack her, nor will she have any fear about them [the wild beasts].”<br \/>\nBiharul Anwar, Volume 52, Page 316; al-Khisal<br \/>\n<strong>Weak<\/strong>: The narration includes Al-Yaqteeni who was weakened by Al-Tusi and Al-Saduq. See Al-Fihrist p. 171.<\/p>\n<p style=\"text-align: justify;\">24- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “Revelation (from Allah (awj)) will come to him (Imam al-Mahdi) and he will act according to the revelation by the command of Allah.”e to him (Imam al-Mahdi) and he will act according to the revelation by the command of Allah.”<br \/>\nBiharul Anwar, Volume 52, Page 390<br \/>\n<strong>Note<\/strong>: <strong>The narration include that Al-Mahdi will kill all non-Muslims, but this was not included in the text:<\/strong><br \/>\n<strong> ويقتل الناس حتى لا يبقى إلا دين محمد [ ويسير ] بسيرة سليمان بن داود<\/strong><br \/>\n<strong> Translation: He will kill all the people except those upon the religion of Mohammad, and he shall act like Sulaiman bin Dawud.<\/strong><br \/>\n<strong> Weak: <\/strong>Al-Majlisi is quoting Ibn Tawus, but the latter provides no source for the narration.<\/p>\n<p style=\"text-align: justify;\">25- Imam ‘Ali ibn Musa al-Ridha (peace be upon both of them) has said: “ … So when he [Imam al-Mahdi] will make his advent, the Earth with radiate with the celestial illumination of its’ Lord and the scale of justice will be positioned among mankind such that not a single person will oppress another individual …”<br \/>\nBiharul Anwar, Volume 52, Page 321; Kamal ad-Din<br \/>\n<strong>Weak<\/strong>: The narration has Ali bin Ma’bad and he is anonymous according to Al-Jawahiri (p. 414).<\/p>\n<p style=\"text-align: justify;\">26- The Commander of the Faithful, ‘Ali ibn Abi Talib (peace be upon both of them) has said: “Await the relief and do not despair from the mercy of Allah, because indeed the most beloved of actions with Allah, the Noble and Grand, is awaiting the relief.”<br \/>\nBiharul Anwar, Volume 52, Page 123; al-Khisal<br \/>\n<strong>Weak<\/strong>: This is another portion of hadith #23. See above.<\/p>\n<p style=\"text-align: justify;\">27- The Messenger of Allah (peace be upon him and his family) has said: “Awaiting the relief with patience is (a form of) worship.”<br \/>\nBiharul Anwar, Volume 52, Page 145; Da’wat of Rawandi<br \/>\n<strong>Weak<\/strong>: No source is given.<\/p>\n<p style=\"text-align: justify;\">28- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “When al-Qa’im makes his advent … wealth will be distributed among the people in such an equitable manner that not a single person will be seen in need of zakat&#8230;”<br \/>\nBiharul Anwar, Volume 52, Page 390<br \/>\n<strong>Weak<\/strong>: This is another portion of hadith #24. See above.<\/p>\n<p style=\"text-align: justify;\">29- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “ … Indeed if I were to live to see that (the advent of Imam al-Mahdi), then I would have availed myself to serve the Sahib al-Amr (for life).”<br \/>\nBiharul Anwar, Volume 52, Page 234; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration includes Ahmad bin Omar Al-Halabi who is anonymous according to Al-Jawahiri (p. 36).<\/p>\n<p style=\"text-align: justify;\">30- The Messenger of Allah (peace of Allah be upon him and his family) has said: “A group of people will rise up from the East and will prepare the groundwork for the government of alMahdi.”<br \/>\nBiharul Anwar, Volume 51, Page 87; Kashful Ghammah<br \/>\n<strong>Weak<\/strong>: The narration comes through the path of the companion of the Prophet peace be upon him Abdullah bin Al-Harith bin Jaz’ who is anonymous according to Shias.<\/p>\n<p style=\"text-align: justify;\">31- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) has said: “During the period of his [Imam al-Mahdi’s] government, wisdom shall be disbursed among the people such that a woman sitting in her house [with no ‘formal’ religious training] will be able to pass judgement by the Book of Allah, the High, and the Sunnah of the Messenger of Allah (peace be upon him and his family).”<br \/>\nBiharul Anwar, Volume 52, Page 352; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration comes through the path of Ibrahim bin Ishaq Al-Nahawandi who is weak according to Al-Najahi (p. 19).<\/p>\n<p style=\"text-align: justify;\">32- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “Surely the possessor of this command (Imam al-Mahdi) will go into an occultation. So the servant should have consciousness (Taqwa)of Allah during the period of the occultation and should hold firm to his religion.”<br \/>\nBiharul Anwar, Volume 52, Page 135; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration comes from the path of Yaman Al-Tammar who is anonymous according to Al-Jawahiri (p. 676).<\/p>\n<p style=\"text-align: justify;\">33- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “Know your Imam because indeed if you have a deep cognizance of him and this command (his advent) is brought close or delayed, then it will have no effect upon you [and your faith].”<br \/>\nBiharul Anwar, Volume 52, Page 135; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration comes from two paths, but both are weak, due to the anonymity of Ibrahim bin Hashim Al-Qummi who was not strengthened by any early scholar according to Al-Hilli in Khulasat Al-Aqwal (p. 49), and Mu’alla bin Mohammad who is weakened by Al-Najashi (p. 418).<\/p>\n<p style=\"text-align: justify;\">34- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “Indeed if I were to live to see him (al-Mahdi) then I would have been his servant for the duration of my life.”<br \/>\nBiharul Anwar, Volume 51, Page 148; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration is weak due to the anonymity of Khallad Al-Saffar according to Al-Jawahiri (p. 210).<\/p>\n<p style=\"text-align: justify;\">35- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) has said: “A person who says: ‘O Allah! Send your blessings upon Muhammad and the family of Muhammad and hasten their succor.’ after his Salatul Fajr and Salatul Zuhr will not die until he sees al-Qa’im from the family of Muhammad, peace be upon them all.”<br \/>\nSafinatul Bihar, Volume 2, Page 49<br \/>\n<strong>Weak<\/strong>: The narration is disconnected since Ahmad bin Abi Nasr Al-Bizanti did not hear from Abi Baseer.<\/p>\n<p style=\"text-align: justify;\">36- It has been narrated from Imam Hasan ibn ‘Ali al-’Askari (peace be upon both of them) that “ … One who dies and does not have a cognizance of him (Imam al-Mahdi) dies the death of the period of decadence (pre-Islamic times) … ”<br \/>\nBiharul Anwar, Volume 51, Page 160; Kamal ad-Din<br \/>\n<strong>Weak<\/strong>: The narration comes from the path of Al-Talqani who is not reliable according to Al-Khoei in his Mu’jam Al-Rijal 15\/231. The narration also comes from the path of Abu Al-Mufadhal Al-Shaibani, who is weak according to Al-Najashi (p. 396).<\/p>\n<p style=\"text-align: justify;\">37- Imam Muhammad ibn ‘Ali al-Baqir (peace be upon both of them) said: “ … Indeed he (alMahdi) will come and I swear by Allah that there will be three hundred and ten and some odd number of men with him and among them there will be fifty women who will all gather together in Makkah (to help him) &#8230; ”<br \/>\nBiharul Anwar, Volume 52, Page 223; Tafsir of al-’Ayyashi<br \/>\n<strong> Note: The narration states that Al-Mahdi appears while in a state of fear.<\/strong><br \/>\n<strong>Weak<\/strong>: The narration is by Al-Ayyashi in his Tafseer and is a disconnected report.<\/p>\n<p style=\"text-align: justify;\">38- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “Each one of you must prepare (your weapons) for the advent of al-Qa’im (peace be upon him), even if it be (as little as) an arrow, because when Allah the High, knows that a person has this intention, then He will give him a longer life.”<br \/>\nBiharul Anwar, Volume 52, Page 366; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The narration includes Al-Hasan bin Ali Al-Bata’ini who is a liar. See Khulasat Al-Aqwal by Al-Hilli (p. 334).<\/p>\n<p style=\"text-align: justify;\">39- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “A person who would like to be among the companions of al-Qa’im should be in a state of (active) waiting (Intizar), and perform all of his deeds with Wara’[a level higher than Taqwa] and with the most beautiful etiquette and then one will be counted as being in a state of (true) waiting (Intizar). Then if such a person was to die and al-Qa’im was to make his advent after this, then that person would receive the reward as the one who witnessed his (al-Mahdi’s) advent.”<br \/>\nBiharul Anwar, Volume 52, Page 140; al-Ghaybah of al-Nu’mani<br \/>\n<strong>Weak<\/strong>: The chain is the same as the previous one. See above.<\/p>\n<p style=\"text-align: justify;\">40- Imam Ja’far ibn Muhammad as-Sadiq (peace be upon both of them) said: “The person from amongst you who dies while awaiting this command [the advent of Imam al-Mahdi] is like a person who was with al-Qa’im in his tent … no rather, he would be like a person who was fighting along-side him with his sword … no rather, by Allah, he would be like the person who attained martyrdom along-side the Messenger of Allah (peace be upon him and his family).”<br \/>\nBiharul Anwar, Volume 52, Page 126; al-Mahasin<br \/>\n<strong>Authentic: All the narrators are reliable and the chain is connected. There are scholars like Al-Mohseni and Al-Radhi who reject the reliability of the book itself, but that is an opinion that is not held by most Shia scholars. Ironically, the narration shows a confused Imam that keeps changing his mind about the high status of those that await the emergence of Al-Mahdi. It is also even more ironic that the narration suggests that the highest merit is to die during Jihad as a Companion of the Prophet peace be upon him.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Introduction The following are the hadith gradings to Abdul-Rahim Mugahi’s “Forty Hadith: The Awaited Savior of Humanity”. The piece can be found on al-islam.org. Ironically, the text is a testament to the abundance of fabrications by early Shias when it <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/10\/a-criticism-of-forty-hadith-the-awaited-savior-of-humanity\/\" title=\"A Criticism of: &#8220;Forty Hadith: The Awaited Savior of Humanity&#8221;\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3820,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"class_list":{"0":"post-2722","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2722","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2722"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2722\/revisions"}],"predecessor-version":[{"id":2897,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2722\/revisions\/2897"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3820"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2722"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2722"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2722"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}