{"id":2726,"date":"2015-11-11T08:47:03","date_gmt":"2015-11-11T08:47:03","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2726"},"modified":"2016-11-14T10:18:29","modified_gmt":"2016-11-14T10:18:29","slug":"examining-nahj-al-balagha-and-the-eloquence-of-ali","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/11\/examining-nahj-al-balagha-and-the-eloquence-of-ali\/","title":{"rendered":"Examining Nahj Al-Balagha and the Eloquence of Ali"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2726\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2021 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"nahj al-balagha\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a><\/p>\n<h1 style=\"text-align: justify;\">Examining Nahj Al-Balagha and the Eloquence of Ali<\/h1>\n<p style=\"text-align: justify;\">Long before anyone even heard of <a href=\"http:\/\/twelvershia.net\/2015\/12\/12\/nahjul-balagha-contradicts-shia-teachings\/\" rel=\"external nofollow\">Nahjul Balagha<\/a>, it was eloquence of the Qur’an has always been a testimony for the authenticity of the message of Islam. As soon as the Qur’an was made public, it won the hearts of men and women, while simultaneously filling the souls of the arrogant with fear and discomfort. Their dreams, hopes, and economy were laid to waste by words that are neither poetry nor prose. Mohammad &#8211; peace be upon him &#8211; exclaimed that these are the words of the Creator… and his message was accepted by the masses ever since.<\/p>\n<p style=\"text-align: justify;\">It is no surprise that even we in today’s standards are in awe of Allah’s words. The unattainable eloquence of the text serves as a reminder of the temporal world that we live in, and that to Him we return.<\/p>\n<p style=\"text-align: justify;\">This article though, is not about the eloquence of Allah, but of the eloquence of Ali, for Shias claim that he was so eloquent that his words too pierced the hearts of the masses and pulled in converts to Islam. However, they have not stopped at that, but rather, they have exaggerated his eloquence and have claimed that it is “above the speech of the creation” (Ma Huwa Nahj Al-Balagha p.5 by Al-Shihristani) and that his speech is the “brother of the Qur’an.” (See Al-Tharee’a by Agha Buzurk 14\/111) It goes without saying that such statements put him above the rest of the Sahaba, Abu Bakr included.<\/p>\n<p style=\"text-align: justify;\">When asked for proof of this, Shias usually provide two evidences. They would either provide the Sunni with a copy of Nahj Al-Balagha (The Peak of Eloquence) or they would present the Sunni with a sermon by Ali that does not contain any dots.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Who Collected Nahj Al-Balagha?<\/strong><\/h2>\n<p style=\"text-align: justify;\">Even though it is popular opinion today that Shias believe that Nahj Al-Balagha was collected by Al-Shareef Al-Murtadha, we find that the earliest Shia scholar held the view that it was in fact penned by his brother Al-Shareef Al-Radhi.<\/p>\n<p style=\"text-align: justify;\">This view is held by the top Rijali scholars like Al-Najashi (p. 398) and Muntajab Al-Deen (p. 176). Furthermore, Al-Radhi himself states that he is the author of Nahj Al-Balagha. See Masadir Nahj Al-Balagha 1\/103-111.<\/p>\n<p style=\"text-align: justify;\">Moreover, Ibn Abi Al-Hadeed states in the introduction of his famed exegesis that Al-Radhi was indeed the compiler.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Nahj Al-Balagha: Authorship and Eloquence<\/strong><\/h2>\n<p style=\"text-align: justify;\">Nahj Al-Balagha is a collection of sermons and sayings that have been attributed to Ali. I specifically use the word “attributed” because that is all that it is. According to popular Shia opinion, the collection was gathered by Al-Shareef Al-Murtadha (d. 436) or his brother Al-Radhi (d. 406).<\/p>\n<p style=\"text-align: justify;\">Al-Thahabi writes in Al-Murtadha’s biography in Siyar A’alam Al-Nubala’ 2\/2774:<\/p>\n<p style=\"text-align: justify;\">“He is the compiler of Nahj Al-Balagha that contains words that have been attributed to Imam Ali (may Allah be pleased with him). It contains no chains. Some of it is false and within it is some truth. However, it contains fabrications that the Imam would never speak of, god-forbid.”<\/p>\n<p style=\"text-align: justify;\">Al-Thahabi is correct. Nahj Al-Balagha, is after all, a collection of sayings, and sayings do not have any weight without chains of narrations.<\/p>\n<p style=\"text-align: justify;\">Moreover, Al-Shareef Al-Murtadha and Al-Radhi were fifth century scholars with no direct access to Ali or his words anymore than any of their contemporaries. That being said, academically, it is far greater a crime to accept everything that has been attributed to Ali in this book than it is to reject it completely.<\/p>\n<p style=\"text-align: justify;\">It was in light of this that the Shia scholar Al-Sayyed Abdul Zahra’ Al-Hussaini authored his “Masadir Nahj Al-Balagha wa Asaneeduh”. This four volume work is a collection of Nahj Al-Balagha itself along with commentary that includes other references for the attributed speeches one by one.<\/p>\n<p style=\"text-align: justify;\">However, it is not surprising that many of the sermons and sayings in Abdul Zahra’s book do not contain chains of narrations. One does not need to look further than the very first sermon. After Abdul Zahra’ provides six additional sources to the sermon 1\/297, he then claims that it is impossible that these sources came together to fabricate this sermon (even though its chainless).<\/p>\n<p style=\"text-align: justify;\">Unfortunately for Abdul Zahra’, the claim is not that Al-Shareef Al-Radhi, concocted these sermons himself, but rather, that these sermons are fabricated. The earliest source that Abdul Zahra’ provides for this sermon is Mohammad bin Al-Hasan Al-Harrani, a fourth century scholar. Since that is the case, how could anyone be so lenient in accepting a narration simply because it existed in a fourth century source?!<\/p>\n<p style=\"text-align: justify;\">Abdul Zahra’ then admits that the eloquence of “text does not require a chain.” In other words, this admittance suggests that it is the biases of Abdul Zahra’ that leads him to accepting the report as authentic.<\/p>\n<p style=\"text-align: justify;\">Sadly, this level of scholarship is the best any Shia scholar can do. Truly, they cannot do anything more than to claim that: This is so eloquent; it must have been said by Ali!<\/p>\n<p style=\"text-align: justify;\">The second sermon cannot be verified either. It is also documented in two later sources and only the last sentence or two can be found in an earlier fourth century source. None of these include chains either.<\/p>\n<p style=\"text-align: justify;\">Furthermore, what is one to do with short pieces of sermons and texts? Take for example what we find in Word of Wisdom #169: It is wiser to abstain then to repent.<\/p>\n<p style=\"text-align: justify;\">How about Word of Wisdom #186: Death is never very far.<\/p>\n<p style=\"text-align: justify;\">Refer to the chapter of <a href=\"http:\/\/www.al-islam.org\/articles\/various-sayings-imam-ali-ibn-abi-talib-imam-ali-ibn-abu-talib#sayings-imam-%E2%80%98ali-nahjul-balagha\" rel=\"external nofollow\">“Saying of Imam ‘Ali (A.S.) from Nahj Al-Balagha”<\/a> for many more examples of these short saying.<\/p>\n<p style=\"text-align: justify;\">Truly, there is wisdom in these words. Yet, could these not have come from any wise person? The Arabic books of literature are loaded with the most eloquent of sayings of wisdom. Surely, a biased Shi’ee will say, “Only Imam Ali could have uttered such pearls.”<\/p>\n<p style=\"text-align: justify;\">To such weak-minded opinions a response is not warranted.<\/p>\n<p style=\"text-align: justify;\">It is very ironic that Shias will jump in the defense of Nahj Al-Balagha, when virtually every Shia will argue that there is no authentic book other than the book of Allah. It is as if they only say such a thing when criticizing Sunnis, but among themselves, they believe in the complete authenticity of Nahj Al-Balagha. Shias need to free themselves from such a double-standard.<\/p>\n<p style=\"text-align: justify;\">I add, most of these long sermons cannot be found in their final form in which they are found today in al-Nahj. Scholars are able to find bits and scraps of sentences used in different narrations but they aren&#8217;t the full sermons as we know them, so where did al-Radhi get those specific sermons in their entirety? This isn&#8217;t just in one or two sermons, but in a big number of them.<\/p>\n<p style=\"text-align: justify;\">What casts further doubts on their honesty, is that `Ali has a few popular sermons that are known yet these sermons were not included in Nahj-ul-Balaghah. He even has a long sermon in praise of Abu Bakr which was obviously omitted even though it has a chain. Even big shia scholars such as al-Kulayni did not include these sermons in his encyclopedia al-Kafi and acted as if he never heard of them.<\/p>\n<p style=\"text-align: justify;\">Indeed. One could simply end a debate with Shias that affirm the authenticity of Nahj Al-Balagha by asking the following questions:<\/p>\n<p style=\"text-align: justify;\">1- Is there any other book authentic other than the book of Allah?<\/p>\n<p style=\"text-align: justify;\">2- How do you know that Nahj Al-Balagha is authentic when it has no chains and comes from a fifth century source?<\/p>\n<p style=\"text-align: justify;\">3- How can you attribute a text to Ali simply on the basis of eloquence when it is mostly a subjective matter? Perhaps the words of wisdom belonged to the Prophet peace be upon him, or to another Imam. An even likelier scenario is that some of these words of wisdom were by others, but were erroneously attributed to Ali. An even likelier scenario is that many of these sermons were in reality fabrications by eloquent Arabs who wanted to attribute their views to Ali in the same way that fabricators have fabricated narrations in jurisprudence and ideology to the Prophet &#8211; peace be upon him &#8211; and the Twelve Imams.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Sermon without Dots <\/strong><\/h2>\n<p style=\"text-align: justify;\">An additional piece of evidence of the semi-divine eloquence of Ali is his sermon that does not include any dots. Laymen Shia take great pride in this, assuming that only one with that only Ali may be able to accomplish such a feat.<\/p>\n<p style=\"text-align: justify;\">The idea behind this is that the sermon does not contain any of the following letters:<\/p>\n<p style=\"text-align: justify;\">ب – ت – ث – ج – خ – ذ – ز – ش – ض – ظ – غ – ف – ق – ن – ي<\/p>\n<p style=\"text-align: justify;\">The exclusion of fifteen letters from Arabic alphabet, more than half of the letters, is indeed a severe handicap, which makes it especially difficult to come up with an eloquent speech.<\/p>\n<p style=\"text-align: justify;\">The sermon can be found on <a href=\"http:\/\/www.al-islam.org\/articles\/various-sayings-imam-ali-ibn-abi-talib-imam-ali-ibn-abu-talib#sayings-imam-%E2%80%98ali-nahjul-balagha\" rel=\"external nofollow\">al-islam.org.<\/a><\/p>\n<p style=\"text-align: justify;\">Of course, the attribution of the sermons to Ali in the first place needs to be confirmed, but yet, the emotional Shi’ee refuses to even consider that man has the ability to attain such brilliance, and thus, no academic research is required.<\/p>\n<p style=\"text-align: justify;\">Furthermore, we have found that Ibn Al-Jawzi in his Ajeeb Al-Khutab (See Majmu’ Rasa’il Ibn Al-Jawzi p. 99-134), has included a sermon authored by himself, in which he has excluded all the letters with dots. He states in his introduction:<\/p>\n<p style=\"text-align: justify;\">I was discussing with some of my friends regarding the Arabic alphabet. One of them argued that any discourse or term cannot be fully viable unless all the letters of the alphabet exist within it. He spoke of a sermon with him where the letter: “Alif”, is omitted from it. I got excited and decided to write sermons. From each I omit a letter from the alphabet. I wrote twenty-nine sermons based on the letters of alphabet’s number; then I added a sermon that doesn’t contain any dots. The sermons reached the number of thirty. I collected them in a book entitled: “The Astonishing Sermons”. (p. 99)<\/p>\n<p style=\"text-align: right;\">الحمد لله الواحد الأحد، وكل أحد سواه مطلع الأعداد، العادل الصمد، ولا والد ولا ولد، ملك وصور وحكم، ولا مساعد ولا إسعاد، وأمهل وأهلك أهل الرد والإلحاد، وسمك السماء ومسك ولا حامل ولا عماد، وسطح المهاد وأوسع ولا أوطار ولا وساد، وكل طامع حاد عما سمع حال حاله لما حاد، ولا وصول إلا لواله صد لأمل الوصال حلاوة الوساد، ولا ورد إلا الساهر وأورد طعم المورود مرار السهاد، إله وعد أهل السعادة أعلى محل وأكرم مراد، وهدى أهل الإهمال سوء المرصاد وهول المعاد، عالم سامع مدرك مسمع لا عمل لعامل إلا ما أراد، الملهد هالك والموحد مالك ومسلك السلامة سعادة الوراد، أحمده وأوحده حمدا أعده للأهوال الحداد، وأمدح رسوله أكرم العموم وأكرم الآحاد، سلام الله واصل ما لاح لامع وأدلهم سواد، مواصل صدور أهل الكمال والسداد، وسلم وكرم. وصلى على محمد المكرم .ـ<\/p>\n<p style=\"text-align: justify;\">Just in case, a cheeky Shi’ee tries to point out the dots in the “Taa Al-Marboota” at the end of words like Al-Sa’ada (السعادة), we simply counter by pointing out that the sermon attributed to Ali does the same:<\/p>\n<p style=\"text-align: justify;\">The falsely attributed sermon includes:<\/p>\n<p style=\"text-align: right;\">وها هو إمامكم وحل حرمكم مملكا، عروسكم <strong>المكرمه<\/strong>، وما مهر لها كما مهر رسول الله أم <strong>سلمه<\/strong><\/p>\n<p style=\"text-align: justify;\">The text is translated as: “<em>your domain will thus be rightful, your brides <strong>honored<\/strong>, and let her [bride] dower be just as the Messenger of Allah (<\/em><em>ص<\/em><em>) had paid to Umm <strong>Salamah<\/strong>.”<\/em><\/p>\n<p style=\"text-align: justify;\">We have bolded the words that in reality do include dots, for Al-Mukaramah (المكرمة) and Um Salama (أم سلمة) are correctly written with them.<\/p>\n<p style=\"text-align: justify;\">Another scholar that also was known for his eloquence was Ibn Al-Batookh Al-Hanbali, who also wrote sermons without certain letters and has a sermon without any dots. See Masadir Nahj Al-Balagha 1\/269.<\/p>\n<p style=\"text-align: justify;\">More importantly, there is no evidence that the sermon of Ali that is free from dots is authentically attributed to him. Al-Radhi not including it in his book is sufficient proof that it either did not exist at his time, or that he recognized it to be a fabrication. I add, Arabic words at the time did not have dotted-letters either-way, old manuscripts of political letters, documents or Qur&#8217;anic scripture did not have dots below or above letters, these were only added much later by abu al-Aswad al-Du&#8217;ali in order to make the recitation easier for non-Arabs.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2610 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" alt=\"nahj al-balagha\" width=\"426\" height=\"179\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg 426w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah-300x126.jpg 300w\" sizes=\"auto, (max-width: 426px) 100vw, 426px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Examining Nahj Al-Balagha and the Eloquence of Ali Long before anyone even heard of Nahjul Balagha, it was eloquence of the Qur’an has always been a testimony for the authenticity of the message of Islam. As soon as the Qur’an <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/11\/examining-nahj-al-balagha-and-the-eloquence-of-ali\/\" title=\"Examining Nahj Al-Balagha and the Eloquence of Ali\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,14],"tags":[],"class_list":{"0":"post-2726","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-popular-topics"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2726","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2726"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2726\/revisions"}],"predecessor-version":[{"id":2895,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2726\/revisions\/2895"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2726"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2726"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2726"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}