{"id":2786,"date":"2015-11-25T22:29:27","date_gmt":"2015-11-25T22:29:27","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2786"},"modified":"2016-03-30T19:43:20","modified_gmt":"2016-03-30T19:43:20","slug":"defense-sunni-view-quran","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/25\/defense-sunni-view-quran\/","title":{"rendered":"In Defense of the Sunni View of the Qur’an"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2786\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">In Defense of the Sunni View of the Qur’an<\/h1>\n<p style=\"text-align: justify;\"><strong>Introduction<\/strong><\/p>\n<p style=\"text-align: justify;\">Unlike our usual refutations, instead of focusing on specific points made by opponents, we have decided to write a general article refuting Shia allegations against Ahl Al-Sunnah that revolve around their view of the authenticity of the Qur’an.<\/p>\n<p style=\"text-align: justify;\">We have covered in a <a href=\"http:\/\/twelvershia.net\/2014\/07\/24\/authentic-shia-narration-declaring-the-corruption-of-the-quran\/\" rel=\"external nofollow\">previous article<\/a> that Shias have authentic and explicit narrations that clearly state that the Qur’an has been manipulated. That article should be reviewed to see the major difference between the so called “Sunni Tahreef” and the Shia Tahreef. We have also written a few articles on certain Shia scholars and their clear opinions concerning Tahfreef.<\/p>\n<p style=\"text-align: justify;\">It is a sad fact that Shias often confuse certain aspects of Qur’anic sciences. Due to the complex nature of the documentation and the revelation of the Qur’an, Shias have made false claims time and time again. Often, we find hypocrisy, since these claims are a lot closer to home than they think. Yet, they choose to argue that variant recitations and abrogated verses are actually Tahreef.<\/p>\n<p style=\"text-align: justify;\">With this in mind, we will soon observe that Shias have continuously accused Sunnis of the opinion of Tahreef Al-Qur’an, when in reality they are referring to verses that have been abrogated in recitation. The difference between the two cases is that the former view implies that man was the cause of the removal or change in the Qur’an, while the latter implies that Allah alone caused such a change. The difference between the two opinions is the difference between Islam and disbelief.<\/p>\n<p style=\"text-align: justify;\">We have divided the article as follows for easy reading:<\/p>\n<ul>\n<li style=\"text-align: justify;\"><strong>Abrogation of Verses<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Examples of Abrogated Verses<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Background on the Recitations of the Qur’an<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Did the Recitations come from the Reciters, the Prophet, or Allah?<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Is it Permissible to recite with a Recitation that goes Against the Uthmani Script?<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>Examples of Authentic Variant Recitations<\/strong><\/li>\n<li style=\"text-align: justify;\"><strong>The Companions Accuse the Compiler of the Qur’an of Making Mistakes<\/strong><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>In Allah&#8217;s name we begin,<\/p>\n<h2 style=\"text-align: justify;\"><strong>Abrogation of Verses<\/strong><\/h2>\n<p style=\"text-align: justify;\">Allah (subhanahu wa ta’ala) says in the Holy Qur’an:<\/p>\n<p style=\"text-align: justify;\">ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها<\/p>\n<p style=\"text-align: justify;\"><strong>Whichever verse We abrogate or cause to be forgotten, We bring one better than it or like it. (2:106)<\/strong><\/p>\n<p style=\"text-align: justify;\">The scholars have observed three kinds of abrogation. The first is the abrogation of the ruling alone. The second is the abrogation of the ruling and the recitation. The third is the abrogation of recitation alone.<\/p>\n<p style=\"text-align: justify;\">The existence in the abrogation of recitation is a commonly accepted view according to many Islamic scholars, even ones from outside the Sunni school. Jalal Al-Deen Al-Suyuti in his Al-Itqaan quotes several examples of this form. Such narrations usually include a companion saying, “We used to read such and such during the life of the Prophet.” When returning to the Qur’an, we do not find these verses within it. Scholars refer to such as an abrogation of verses.<\/p>\n<p style=\"text-align: justify;\">Even though the abrogation of recitation has been something that has always been accepted by Muslim scholars, we do find that there are some that have doubted the existence of it. Their main argument is that they do not see the wisdom of such a thing and that abrogation of recitation creates nothing but confusion.<\/p>\n<p style=\"text-align: justify;\">However, such an argument holds no weight, since it is not required for the creation to understand the wisdom of the actions of Allah as a requirement to accepting those actions.<\/p>\n<p style=\"text-align: justify;\">According to Sulaiman Al-Lahim, in his introduction to Al-Nahhas’ Al-Nasikh wal Mansookh (1\/118), one of the wisdoms of the existence of the abrogation of recitation is that it makes the Qur’an easier to memorize. He quoted the following verse:<\/p>\n<p style=\"text-align: justify;\">الآن خفف الله عنكم وعلم أن فيكم ضعفا<\/p>\n<p style=\"text-align: justify;\">For the present Allah has made light your burden, and He knows that there is weakness in you. (8:66)<\/p>\n<p style=\"text-align: justify;\">By returning to the context of the verse, we find that Allah is decreasing what He expects from the Muslims at war. This is indeed a mercy upon them, for they were expected to stand up to armies that are up to ten times in number, but then the number was decreased to twice in number.<\/p>\n<p style=\"text-align: justify;\">Similarly, the abrogation of those verses is a form of mercy as well, since Allah&#8217;s words can never run out, and having the Qur’an in its final state makes it easier to memorize than what it could have been if no abrogation of recitation existed.<\/p>\n<p style=\"text-align: justify;\">Al-Suyuti in Al-Itqan (p.470) quotes Ibn Al-Jawzi for another benefit of the existence of the abrogation of recitation, which is that it personifies the obedience of the Ummah in following the teachings of Allah, even without absolute certainty, and this is similar to how Ibrahim (alaihi alsalam) accepted that he had to kill his son, even though it was just a dream as certain as he would have been if he received such an order through an angel. This type of acceptance of the rulings of Allah (i.e. via abrogation verses, and Ibrahim’s acceptance of his dream) demonstrates a high level of faith and deserves a higher reward. This is why some teachings were revealed as Qur&#8217;an while others came in the form of Sunnah, Allah wishes to test this nation through the Sunnah and see how they deal with its texts, how they study it, preserve it and deal with the differences of opinions among themselves in an Islamic manner.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Examples of Abrogated Verses<\/strong><\/h2>\n<p style=\"text-align: justify;\">1- Ubai bin Ka’ab suggests that Surat Al-Ahzab was at one time as long as Al-Baqara.<\/p>\n<p style=\"text-align: justify;\">The narration, from Musnad Ahmad #20261, is as follows:<\/p>\n<p style=\"text-align: justify;\">“From Zir, he said: Ubai said to me: How do you read Surat Al-Ahzab or how long is it? I said: Seventy three verses. He said: I saw it when it was as long as Al-Baqara, and we read from it: If the old man and the old woman commit adultery then stone them, a preventative measure from Allah, and Allah is the All-wise and All-knowing.”<\/p>\n<p style=\"text-align: justify;\">We comment: If the narration implies Tahreef, then why didn’t Ubai teach the verses as a part of the Qur’an? He was a famous teacher of the Qur’an, and he even taught it to Ibn Abbas, Abu Huraira, Abu Abdulrahman Al-Sulami, Abdullah bin Sa’ib and Abdullah bin Ayyash, and yet, none of his students have documented this verse as a part of it. The conclusion is simple; it is that he believed that this verse was abrogated.<\/p>\n<p style=\"text-align: justify;\">Note: For more on this topic, refer to our article that exposes <a href=\"http:\/\/twelvershia.net\/2015\/09\/19\/response-to-the-collection-and-preservation-of-the-quran\/\" rel=\"external nofollow\">the hypocrisy of Al-Khoei<\/a>, who attributes the view of abrogation to the Imams, while simultaneously accusing Sunnis of holding the view and interpreting it as Tahreef.<\/p>\n<p style=\"text-align: justify;\">2- Another famous example is Al-Bukhari #2286. The narration is a quote by Abu Musa Al-‘Ash’ari in which he said that a verse once existed in the Qur’an that goes as follows: “If there were two valleys full of riches, for the son of Adam, he would long for a third valley, and nothing would fill the stomach of the son of Adam but dust.” The same verse is recited by Ubai bin Ka’ab and Ibn Mas’ud. Yet, even though they all used to recite this verse in the past, each of them has stopped doing so, and they did not teach this verse as a part of the Qur’an. This, once again, is clear evidence that abrogation has occurred to this verse and the Surah that it belonged in.<\/p>\n<p style=\"text-align: justify;\">As we have stated before, Ubai taught Ibn Abbas, Abu Huraira, Abu Abdulrahman Al-Sulami, Abdullah bin Sa’ib and Abdullah bin Ayyash, and yet, he didn’t teach these verses.<\/p>\n<p style=\"text-align: justify;\">Ibn Mas’ud taught Alqama, Al-Aswad, Masrouq, Zir, Zaid bin Wahb, Abu Amr Al-Shaybani, and Abu Abdulrahman Al-Sulami, and didn’t teach these verses.<\/p>\n<p style=\"text-align: justify;\">Abu Musa Al-Ash’ari taught Abu Raja’a Al-Atardi and Hitan bin Abdullah, and never taught these verses.<\/p>\n<p style=\"text-align: justify;\">It is clear that they intentionally didn’t teach these verses, since they believed that they were abrogated.<\/p>\n<p style=\"text-align: justify;\">`A&#8217;ishah says about this in Musnad abi Ya`la:<\/p>\n<p style=\"text-align: justify;\">فَكُنَّا نَرَى أَنَّهُ مِمَّا نُسِخَ مِنَ الْقُرْآنِ<\/p>\n<p style=\"text-align: justify;\">&#8220;We believed that it was from what was abrogated from the Qur&#8217;an.&#8221;<\/p>\n<p style=\"text-align: justify;\">3- Another one of our favorite examples is the abrogation within the verse of Mutah. Refer to <a href=\"http:\/\/twelvershia.net\/2015\/02\/12\/prohibition-mutah-marriages\/\" rel=\"external nofollow\">this article<\/a> for more.<\/p>\n<p style=\"text-align: justify;\">4- Also, refer to our article on the verse about suckling and its abrogation: <a href=\"http:\/\/twelvershia.net\/2013\/07\/20\/response-to-open-challenge-to-the-sons-of-aisha\/\" rel=\"external nofollow\">Response to: Challenge to the Sons of Aisha.<\/a><\/p>\n<p style=\"text-align: justify;\">It is also important to add that abrogations are not exclusive to Ahl Al-Sunnah. By returning to Al-Idda and we have found a clear statement from Al-Tusi regarding the permissibility of this form of abrogation. In Chapter 7, he calls Section 4:<\/p>\n<p style=\"text-align: justify;\">في ذكر جواز نسخ الحكم دون التّلاوة ، ونسخ التّلاوة دون الحكم<\/p>\n<p style=\"text-align: justify;\">“The permissibility of the abrogation of laws without recitation and the abrogation of recitations without laws.” We suggest that readers read the full chapter in order to see Al-Tusi’s reasons for accepting these forms of abrogation.<\/p>\n<p style=\"text-align: justify;\">If the above is clear, one can easily determine when a narration falls under the category of abrogation. Surely, it is nothing compared to the Tahreef that the Shias believe in where the names of the Ahlulbayt are removed by the Sahaba.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Background on the Recitations of the Qur’an<\/strong><\/h2>\n<p style=\"text-align: justify;\">The matter of the various recitations of the Qur’an may be confusing to some. Yet, by understanding the origins and reasons for the existence of such a matter will make things much clearer to all readers.<\/p>\n<p style=\"text-align: justify;\">In the Saheeh Al-Bukhari #4608 and Saheeh Muslim #1354 we find that after the conquest of Makkah, Omar bin Al-Khattab spotted Hisham bin Hakeem bin Hizam reading Surat Al-Furqan in a different method than which he used to read it in. He dragged Hisham to the Prophet (salalahu alaihi wa salam) and made him read it. The Prophet (salalahu alaihi wa salam) agreed to the recitation of both men and said that the Qur’an was revealed in seven Ahruf (plural of Harf, meaning Wajh = way).<\/p>\n<p style=\"text-align: justify;\">A questioner may ask: Aren&#8217;t both Umar and Hakeem from Quraysh, if so why did they recite differently? The answer is that Hakeem embraced Islam very late, it was after the conquest of Makkah as opposed to Umar, so Hakeem may have heard non-Qurashi recitations. In fact, Hakeem may have been taught some verses by non-Qurashi reciters.<\/p>\n<p style=\"text-align: justify;\">In Tafseer al-Tabari 1\/23, Zayd bin Arqam tells his companions in the Masjid that a man once came to the Prophet (saw), he said: &#8220;`Abdullah bin Mas`oud taught me a Surah which I heard from Ubay bin Ka`b and Zayd but their recitations differed, which do I take?&#8221; The Prophet (saw) remained silent and `Ali was sitting besides him. `Ali answered him: &#8220;Let each man recite as he was taught, all are beautiful and good.&#8221;<\/p>\n<p style=\"text-align: justify;\">Also in al-Tabari 1\/32, Ubay was in the Masjid, he said: when a man entered to pray and he recited in a way that I rejected, then another entered and he recited a different recitation that I also rejected. We all entered upon the Prophet (saw) and Ubay told him so the Prophet (saw) accepted both their recitations, then said: O Ubay, it was said to me to recite the Qur&#8217;an in one way(Harf) so I replied: &#8220;O Lord make it easy for my nation.&#8221; and this happened more than once until it was said: &#8220;Recite in seven Ahruf(ways).&#8221;<\/p>\n<p style=\"text-align: justify;\">In another narration in Sunan Al-Tirmithi #2868 from Ubai bin Ka’ab we find the Prophet (salalahu alaihi wa salam) saying, “O Jibreel, I was sent to an Ummah of those that are illiterate, among them are old women, old men, slaves, children, and men that never read a word,” Jibreel replied, “O Mohammad! The Qur’an was revealed under seven Ahruf.” Al-Tirmithi says that this narration is Hasan Saheeh.<\/p>\n<p style=\"text-align: justify;\">In Saheeh Muslim #1355, Ibn Abbas narrates that the Prophet (salalahu alaihi wa salam) kept asking Jibreel to add more to the recitation of the Qur’an until he reached seven variations. In Tafseer al-Tabari Ibn Shihab says: &#8220;I heard that these seven ways are always related to one matter and do not differ in Halal or Haram.&#8221;<\/p>\n<p style=\"text-align: justify;\">By examining these narrations and those like it, we come to realize that the existence of such variations was a mercy for the Ummah and that it allowed people to be able to read the Qur’an all over Arabia with their mother-tongue.<\/p>\n<p style=\"text-align: justify;\">In summary, different Arabs from different tribes were having difficulty in reciting verses from the Qur’an in the tongue of Quraish. For example, the term Buyoot (Houses), in some recitations, is pronounced as Biyoot. Even though many people have no problem with either recitation today, we find that even great Qur’anic scholars in the past like Abu Bakr bin Al-Arabi the Maliki Andulusian scholar was not able to recite it in the latter fashion. (Refer to Kashf Akatheeb Zakariah Butrus wa Amthaluhu Hawl Al-Qur’an Al-Kareem p. 80) If that was the case with a scholar of the Qur’an, then one can only imagine how much harder it would’ve been for old men, women, and sheepherders of the first Islamic century to go against their mother tongues.<\/p>\n<p style=\"text-align: justify;\">Sh. Hasan Dhiya’a Al-Deen Itir, the author of “Al-Ahruf Al-Saba’a” indicates that there were many differences in the Arabian tongues, in which Arabs would pronounce words differently in their Harakaat, in the inclusion of a Haraka or a Sukoon, in the actual changing of letters, in the inclusion of a Hamza in place of a Waaw or Yaa’, in the changing of the positions of letters, in the addition or removal of letters, in the tone of letters with the Alif, in the masculinisation and feminization of words, in the I`iraab, in the version of plurals, in the way one ends a sentence with a Taa’, and others. Refer to pages 24-26 for examples.<\/p>\n<p style=\"text-align: justify;\">Now, these examples may be lost upon those that have not practiced the Arabic tongue, however, we still find versions of these today where we find words like الذي Al-Ladhi being pronounced by Egyptians as Al-Lazi الزي and as Ilee إلي by the Arabs of the GCC or as Yallee يلي in the Levant. In all cases, these are the same words, but pronunciations’ differ and yet, are still all a part of the Arabic language.<\/p>\n<p style=\"text-align: justify;\">With this in mind, it becomes clear that the existence of such variations did make the Qur’an much easier to read for outsiders.<\/p>\n<p style=\"text-align: justify;\">Sh. Hasan Dhiya’a Al-Deen Itir (p. 214 – 228) also includes that the existence of the variations of recitations led to many benefits apart from the care that the Arabs received from it, this included that the Qur’an became easier to memorize, which led to make the da’awa easier, and that such a matter was a form of I’ijaaz that the Kuffar could not imitate. Moreover, it proved that the Qur’an is from Allah, since no book can be revealed in such a variety and yet, not fall into contradiction. Furthermore, it led to unity amongst the Arabs through their tongues. Do note that even though the variations do often focus on the differences in the tongues of the Arabs, but it also includes other differences in recitation that do not fall into such. Refer to p. 220.<\/p>\n<p style=\"text-align: justify;\">What did cause confusion to some though was the fact that we find some recitations attributed to companions today that do not exist in the current recitations of the Qur’an.<\/p>\n<p style=\"text-align: justify;\">According to the scholars of the Qur’an, we find that this occurred during the time of Uthman when Islam was starting to spread vastly. We saw above examples of how the Prophet (saw) taught his Companions that difference in recitation is a mercy and that all have their sanctity. However, people in the distant lands that embraced Islam after many years from the Prophet&#8217;s (saw) death had no knowledge of this and so they would often challenge each other’s recitations claiming that their recitation is better than the recitation of others. Such claims are Haram and are very dangerous since all these recitations were from Allah. Due to this, Uthman ordered all personal copies of the Qur’an to be burned and spread a Qur’an that was void of major changes in the writing of the text in order for the differences to be minimal. More importantly, he instructed the writers to heavily rely on the tongue of Quraish but in a way that made it possible for the letters of the words to hold more than one recitation. Due to this, one could read the word مالك as ملك when it is only written as ملك, since the writing can hold the letter Alif. Due to this method, one can read the Qur’an through several different Ahruf while still sticking to one text. Moreover, the differences between different townspeople would decrease since they are all referring to the Masahif of Uthman.<\/p>\n<p style=\"text-align: justify;\">`Ali orders his followers in the authentic narrations to never criticize Uthman for burning the Masahif since he did this after consulting them and the majority agreed with his decision. Burning those Masahif may have led to losing some forms of recitation for some of the verses but this does not conflict with Allah&#8217;s promise to protect the Qur&#8217;an, since those recitations are only additional tools for convenience. Therefore, preserving one recitation is sufficient for the Qur&#8217;an to be preserved. The ten Qira&#8217;aat\/recitations that are relied upon today are a mixture of the seven Ahruf\/ways in which the Arabs memorized the Qur&#8217;an. The ten recitations take special care to stick as closely as possible to the Uthmani script to avoid any of the problems that emerged in Uthman&#8217;s era.<\/p>\n<p style=\"text-align: justify;\">The topic is wide and may be confusing, so we suggest those fluent in Arabic to return to the following books for a more complete explanation:<\/p>\n<p style=\"text-align: justify;\">1- Al-Ahruf Al-Saba’a by Hasan Dhiya’a Al-Deen Itir<\/p>\n<p style=\"text-align: justify;\">2- Al-Ibana by Makki bin Abi Talib<\/p>\n<p style=\"text-align: justify;\">3- Al-Juman fi Uloom Al-Qur’an v.2 by Adil Hasan Ali<\/p>\n<p style=\"text-align: justify;\">4- Rasm Al-Masahif by Al-Farmawi<\/p>\n<p style=\"text-align: justify;\">5- Munjid Al-Muqri’een by Al-Jazari<\/p>\n<p style=\"text-align: justify;\">6- Kashf Akatheeb Zakariah Butrus wa Amthaluhu Hawl Al-Qur’an Al-Kareem<\/p>\n<p style=\"text-align: justify;\">Ironically, one of the most infamous Shia propagation sites, ShiaPen, have made use of narrations in which we find different Qira’aat in order to attack the Sunni position, by accusing Sunnis of believing in Tahreef. However, the Sunnis on the other hand hold the view that these are merely various recitations and have nothing to do with Tahreef.<\/p>\n<p style=\"text-align: justify;\">Furthermore, when we return to the <a href=\"http:\/\/www.shiapen.com\/comprehensive\/tahreef\/preface.html\" rel=\"external nofollow\">Preface section<\/a> we find that ShiaPen have given themselves the very same excuse when Sunnis have pointed out narrations of Tahreef in their books. ShiaPen said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Some hadiths contain the chains with reliable narrators, whilst one cannot therefore reject such chains of transmission it is necessary to make interpretations [taweel] and reasonings to such hadiths as the scholars have said that some of these hadiths refer to the commentary [Tafseer] and interpretation of the Quran, <strong><u>others are about recitation [qirat]<\/u><\/strong> and reasons of their revelation with some discussing the meanings.<\/span><\/p>\n<p style=\"text-align: justify;\">So, as we can see, it is an acceptable argument.<\/p>\n<p style=\"text-align: justify;\">We also find in Majma’a Al-Bayan by Al-Tabrasi 7\/313 that he said:<\/p>\n<p style=\"text-align: justify;\">وفي قراءة أهل البيت عليهم السلام: ( واجعل لنا من المتقين إماما ) . والقراءة المشهورة : ( واجعلنا للمتقين إماما)<\/p>\n<p style=\"text-align: justify;\">“In the recitation of Ahlulbayt (alaihim alsalam): Make among us from the Mutaqeen an Imam, and in the famous recitation: Make us Imams for the Mutaqeen.”<\/p>\n<p style=\"text-align: justify;\">Notice that Al-Tabrasi suggests that two recitations exist for this verse and that the recitation of Ahlulbayt is different than the recitation that we find in the current Qur’an. According to Al-Tabrasi, this is not Tahreef, but merely a different recitation.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Did the Recitations come from the Reciters or from Allah? <\/strong><\/h2>\n<p style=\"text-align: justify;\">Ahl Al-Sunnah are unanimous that the recitations come from Allah alone, but there is a difference of opinion amongst Shias as to the source of these recitations. Al-Khoei argues that they are from the reciters and that they do not hold weight and they are not considered to be part of the Qur’an. He is criticized by the Shia scholar Abdul Hadi Al-Fadhli in his Al-Qira’aat Al-Qur’aniya (p. 82) who accepts the Sunni position that the recitations are from Allah.<\/p>\n<p style=\"text-align: justify;\">The simplest evidence that the recitations are from Allah is the fourth verse from Surat Al-Fatiha, where we find the word: <strong>Maalik (<\/strong><strong>مالك<\/strong><strong>).<\/strong> Most Muslims today read it as such and this was how it was read by ‘Asim, Al-Kisa’ee, Ya’qoub, and Khalaf. However, it is reported from Nafi’, Ibn Katheer, Abu Amr, Ibn Amer, Hamza, and Abu Ja’afar Al-Madani, that they have all recited it as <strong>Malik (<\/strong><strong>ملك<\/strong><strong>). <\/strong>From this, we understand that the reciters did not simply make an error by reciting it differently, for the majority of them read Malik (ملك), not just one or two. This recitation, is furthermore, <em>mutawatir<\/em> not only from them and the companions of the Prophet – peace be upon him &#8211; , but from the Prophet himself.<\/p>\n<p style=\"text-align: justify;\">Is it inconceivable for the Prophet – peace be upon him – to only recite one version, in this most important Surah, and have the majority of the people make a mistake. Not a single Muslim child today would make such a mistake, let alone those that dedicated themselves to preserving the Qur’an.<\/p>\n<p style=\"text-align: justify;\">With this in mind, we easily re-affirm the position of Ahl Al-Sunnah that the variant recitations are from Allah alone.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Is it Permissible today to recite with a Recitation that goes Against the Uthmani Script?<\/strong><\/h2>\n<p style=\"text-align: justify;\">The scholars of Ahl Al-Sunnah unanimously agree that it is not permissible to do so in our days.<\/p>\n<p style=\"text-align: justify;\">Their reasoning is simple. Uthmani script is Mutawatir whereas the recitations that do not agree with it only reach us through some individual narrations here or there. There is always a possibility of a mistake in a recitation when it comes through a single narrator and contradicts the Uthmani script. Due to this, scholars are extra careful and go the extra mile by declaring such recitations: <em>shaath <\/em>(irregular).<\/p>\n<p style=\"text-align: justify;\">It is important to be aware that Ibn Shanbuth, a scholar of the Qira’aat (d. 328 AH), was one of the few scholars that held the opinion that reciting the Qur’an through such variations was acceptable, even if they were not Mutawatir. Abu Al-Qasim Al-Zinji narrates that he was at the meeting place in which Ibn Shanbuth admitted in front of a group of scholars and Ibn Muqla the minister that he read the verse “&#8230;on every <u>serviceable<\/u> boat by force&#8230;” (18:79) (see Ma’rifat Al-Qura’a by Al-Thahabi p. 310-312). He admitted to reading these irregular recitations and was punished for doing so. There were no accusations of Tahreef from any of the scholars onto him, nor were there any accusations by him that the Muslims have tampered with the Qur’an. He simply chose to recite a verse in a way that differed with the preserved Qur&#8217;anic text because he must have came across it through some narration by Ibn `Abbas and liked it, he did not say the preserved text was tampered nor did those who punished him claim that his irregular recitation is not from Allah.<\/p>\n<p style=\"text-align: justify;\">It is in light of this, that Ahl Al-Sunnah are open to accepting that narrations are indeed authentically attributed to a companion, but will be careful and not recite it in prayer as a part of the Qur’an just in case a narrator made a mistake.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Examples of Authentic Variant Recitations<\/strong><\/h2>\n<p style=\"text-align: justify;\"><strong>1- <\/strong>عن ‏ ‏عبد الله بن مسعود ‏ ‏قال أقرأني رسول الله ‏ ‏صلى الله عليه وسلم:‏ ‏إني أنا الرزاق ذو القوة المتين<\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger of Allah taught me to recite<\/strong><strong>: <\/strong><em>“<u>I am <\/u>the Bestower of sustenance, the Lord of Power, the Strong”.<\/em><em> (51: 58)<\/em><\/p>\n<p style=\"text-align: justify;\">2- قال جرير: وقرأتها في مصحف أبي بن كعب: يوفيهم الله الحق دينهم<\/p>\n<p style=\"text-align: justify;\">Jarir said: ‘I read it in Ubai bin Ka’ab’s Mushaf as ‘Allah <u>the just<\/u> will pay back to them their reward in full. (24:25)<\/p>\n<p style=\"text-align: justify;\">3- قرأ أبو الدرداء: والذكر والأنثى<\/p>\n<p style=\"text-align: justify;\">Abu Darda’a recited: By the male and the female. (92:3)<\/p>\n<p style=\"text-align: justify;\">4- كان ابن عباس يقرأ وكان أمامهم ملك يأخذ كل سفينة <u>صالحة<\/u> غصبا<\/p>\n<p style=\"text-align: justify;\">وكان يقرأ وأما الغلام فكان <u>كافرا<\/u> وكان أبواه مؤمنين‏<\/p>\n<p style=\"text-align: justify;\"><strong>Ibn Abbas used to recite:<\/strong> And in front (ahead) of them there was a king who used to seize every <u>serviceable<\/u> boat by force. (18.79) and: And as for the boy <u>he was a disbeliever and<\/u> his parents were believers. <strong>(18.80)<\/strong><\/p>\n<p style=\"text-align: justify;\">5- يا أيها النبي إذا طلقتم النساء فطلقوهن <u>في قبل <\/u>عدتهن‏‏<\/p>\n<p style=\"text-align: justify;\">O Prophet! When ye do divorce women, divorce them at <u>the commencement of<\/u> their prescribed periods (65:1)<\/p>\n<p style=\"text-align: justify;\">6- صراط من أنعمت عليهم غير المغضوب عليهم وغير الضالين 1:7<\/p>\n<p style=\"text-align: justify;\">Note: The wordings are too similar, so a translation is not necessary.<\/p>\n<p style=\"text-align: justify;\">7- <u>عتى<\/u> حين 12:35<\/p>\n<p style=\"text-align: justify;\">Note: The word: <em>Hatta<\/em> in one Arabic dialect, is pronounced: `Atta.<\/p>\n<p style=\"text-align: justify;\">8- <u>كالصوف<\/u> المنفوش 101:5<\/p>\n<p style=\"text-align: justify;\">Note: The word: ‘<em>Ihn<\/em> apparently did not exist in one dialect, so Allah permitted the recitation with the word: <em>Soof.<\/em><\/p>\n<p style=\"text-align: justify;\">If the above is clear, one can easily spot a different recitation in other examples. It is distinguishable from the Tahreef that the Shias believe in as we have stated above.<\/p>\n<p style=\"text-align: justify;\">For those that are curious about the affects of the variant recitations and how they sound practically, refer to this <a href=\"https:\/\/youtu.be\/_lelqh3GXO8\" target=\"_blank\" rel=\"external nofollow\">clip<\/a> of Hamza Al-Zayyat’s (d. 156) recitation of Al-Fatiha.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Companions Accuse the Compiler of the Qur’an of Making Mistakes<\/strong><\/h2>\n<p style=\"text-align: justify;\">At first glance, this may seem like an extremely problematic issue. Though, like the earlier aspects of Qur’anic sciences, this has got nothing to do with Tahreef. Moreover, there is a consensus amongst all Muslims that the Uthmani Script does not match the pronunciation of words.<\/p>\n<p style=\"text-align: justify;\">An obvious example from the Qur’an is the word: <em>‘Ula’ika<\/em> (أولئك). The correct pronunciation of this word is أُلائك , however, a و was added to differentiate between it and other words like إليك. Do remember that dotting was not used in the earliest Qur’ans.<\/p>\n<p style=\"text-align: justify;\">Another example is the word: Mi’a (مائة). The correct pronunciation is مئة, however, an أ was added to differentiate between مئة and فئة.<\/p>\n<p style=\"text-align: justify;\">One doesn’t even need to go as far as the first page of the Qur’an, the words: بسم الله الرحمن الرحيم.<\/p>\n<p style=\"text-align: justify;\">If one looks closely, one would realize that according to the agreed upon standards of pronunciation today, we would write: باسم اللاه الرحمان الرحيم.<\/p>\n<p style=\"text-align: justify;\">In other words, to say that certain words in the Qur’an were incorrectly written does not indicate the belief in Tahreef, but rather, is a position that is very acceptable and rational.<\/p>\n<p style=\"text-align: justify;\">We have found though four different authentic (somewhat) examples of such statements that we would like to look deeper into.<\/p>\n<p style=\"text-align: justify;\">1- Ibn Abbas would read تستأذنوا instead of تستأنسوا, and would say that this is an error from the scribe. (24:27)<\/p>\n<p style=\"text-align: justify;\">2- Ibn Abbas would read أفلم يتبين instead of أفلم يايئس, and would say that the scribe made an error. (13:31)<\/p>\n<p>3- A’isha was asked about a number of verses and she said that they are mistakes from the scribe.<\/p>\n<p>a) لكن الراسخون 4:162<\/p>\n<p>b) والمقيمين 4:162<\/p>\n<p>c) والصابئون 5:69<\/p>\n<p>d) لساحران 20:63<\/p>\n<p style=\"text-align: justify;\">In short, with the exception of the (24:27) and (4:162), all of these verses do in fact go against the pronunciation of the words. We have provided the wording according to modern standards above, however, the Uthmani Script lists them as follows:<\/p>\n<p style=\"text-align: justify;\"> الرسخون – والصبون – لسحرن &#8211; يايئس<\/p>\n<p style=\"text-align: justify;\">As for (4:162), we find it matching with the pronunciation, so it is very possible that this was a general statement on part of A’isha since she was simply responding to all these narrations by saying, “This is a mistake from the scribe,” without specifying the mistakes.<\/p>\n<p style=\"text-align: justify;\">As for (24:27), we find nothing in the verse that could be interpreted as a mistake in pronunciation. Though, we do find in Sa’eed bin Mansour’s exegesis of the Qur’an 6\/409 that Ibn Abbas said, “I think this may be a mistake from the scribe,” suggesting that he is unsure if it is a recitation or not.<\/p>\n<p style=\"text-align: justify;\">Another possible explanation for the above statements by A’isha and Ibn Abbas is that they were simply not aware of the other recitations. As we have previously mentioned above, the view that the Uthmani Script goes against pronunciation is one that is agreed upon. With this in mind, they were very open to criticizing the script, since the Qur’an is taught orally while the written text is a supplementary tool. With this in mind, it becomes understandable that they never held the untouchable view of the Uthmani Script that we hold today. This doesn&#8217;t mean they believe the Qur&#8217;an is tampered, for Ibn `Abbas says in the authentic narration:<\/p>\n<p style=\"text-align: justify;\">كَيْفَ تَسْأَلُونَ أَهْلَ الْكِتَابِ عَنْ شَىْءٍ، وَكِتَابُكُمُ الَّذِي أُنْزِلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَحْدَثُ، تَقْرَءُونَهُ مَحْضًا لَمْ يُشَبْ<\/p>\n<p style=\"text-align: justify;\">&#8220;Why do you ask the people of the scripture about anything while your Book (Qur&#8217;an) which has been revealed to Allah&#8217;s Apostle (saw) is newer and the latest? You recite it pure, undistorted and unchanged&#8221;<\/p>\n<p style=\"text-align: justify;\">It is important to keep in mind that this is not a belief in Tahreef, but rather, in this possibility, it is the belief that Zaid bin Thabit, under Uthman’s supervision, erred in writing verses. Regardless, this does not taint the promise of Allah to keep the Qur’an preserved, since people during their times did recite the Qur’an in the same way that they (i.e. A’isha and Ibn Abbas) recited, and it didn’t matter if the state endorsed a script that contained errors, for people learned the Qur’an orally.<\/p>\n<p style=\"text-align: justify;\">Once again, this view, if indeed held by A’isha and Ibn Abbas, was held simply because they were not aware of the authenticity of the opposing recitation. This is unlike any statement of Tahreef, in which bad intentions to corrupt the religion of Allah is the reason as to why verses were changed and played around with. Once again, refer to our <a href=\"http:\/\/twelvershia.net\/2014\/07\/24\/authentic-shia-narration-declaring-the-corruption-of-the-quran\/\" rel=\"external nofollow\">examples from authentic Shia sources.<\/a><\/p>\n<p style=\"text-align: justify;\">Another possibility that is mentioned by some Sunni scholars is that above narrations that are attributed to A&#8217;isha and Ibn Abbas are weak. However, we do hold that position due to the lack of evidence for their claim.<\/p>\n<p style=\"text-align: justify;\">We conclude from the paragraphs above, that the orthography and recitation of the Qur&#8217;an are two different things, ignorant Shia may not be able to grasp it but it&#8217;s very clear for anyone with basic Arabic skills. As for the basis of the revelation, then it is the 7 ways of the Arabs including the way of Quraysh, and then the 10 recitations and the Uthmani text that are based on them.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah the Most Gracious Most Merciful<\/p>\n<p style=\"text-align: justify;\">* For any specific questions regarding accusations of Tahreef, feel free to reach us through our e-mail.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In Defense of the Sunni View of the Qur’an Introduction Unlike our usual refutations, instead of focusing on specific points made by opponents, we have decided to write a general article refuting Shia allegations against Ahl Al-Sunnah that revolve around their <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/25\/defense-sunni-view-quran\/\" title=\"In Defense of the Sunni View of the Qur’an\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3818,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[],"class_list":{"0":"post-2786","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2786","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2786"}],"version-history":[{"count":11,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2786\/revisions"}],"predecessor-version":[{"id":3138,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2786\/revisions\/3138"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3818"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2786"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2786"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2786"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}