{"id":2791,"date":"2015-11-18T01:38:53","date_gmt":"2015-11-18T01:38:53","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2791"},"modified":"2016-07-24T21:39:20","modified_gmt":"2016-07-24T21:39:20","slug":"the-reliance-of-shias-upon-sunni-rijal","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/18\/the-reliance-of-shias-upon-sunni-rijal\/","title":{"rendered":"The Reliance of Shias upon Sunni Rijal"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2791\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\">The Reliance of Shias upon Sunni Rijal<\/h3>\n<p style=\"text-align: justify;\">The following is a brief article that demonstrates that reliance of Shias upon Sunni Rijal. Please refer to our <a href=\"http:\/\/twelvershia.net\/2014\/06\/02\/shia-hadith-vs-sunni-hadith\/\" rel=\"external nofollow\">earlier articles <\/a>to witness the superiority of Sunni hadith science over Shia hadith sciences.<\/p>\n<p style=\"text-align: justify;\">The first condition for accepting a hadith as authentic, as listed by hadith scholars, is the connectivity of the chain. The existence of a disconnection causes the narration to be regarded as weak, for one cannot know where the narration came from if there was a disconnection.<\/p>\n<p style=\"text-align: justify;\">A simple is the narration of Urwah bin Al-Zubair from the Prophet – peace be upon him. According to Yahya bin Ma’een, Urwah was born around the year 24 AH. Due to his late birth, he could not have heard from the Prophet – peace be upon &#8211; , and therefore, all his narrations from the Prophet – peace be upon him – are graded as weak.<\/p>\n<p style=\"text-align: justify;\">As one can see, it is extremely important to know the year of the birth and death of narrators, for it solves a very important issue. If a narrator declares hearing a hadith though he wasn’t born at the time of his “teacher”, he then is branded: a liar. Similarly, if we are not sure if a narrator heard from a person or not, knowing whether he lived in the same time and place or not allows us to ascertain if he heard from him or not.<\/p>\n<p style=\"text-align: justify;\">Ironically, this, one of the most important aspects of Rijali sciences, is one that is almost monopolized by Sunnis, since Shias have no choice but to rely on Sunni scholars for this information.<\/p>\n<p style=\"text-align: justify;\">This is clearest when studying the work of Al-Tusi. Even though he doesn’t usually state where he got his information from, he does mention in the brief biography of Jabir bin Yazeed Al-Ju’fi (Rijal Al-Tusi p. 129):<\/p>\n<p style=\"text-align: justify;\">“Jabir bin Yazeed bin Al-Harith bin Abd Yaghooth Al-Ju’fi, died in the year 128 according to <strong>Ibn Hanbal<\/strong>. <strong>Yahya bin Ma’een <\/strong>said: He died in the year 132.”<\/p>\n<p style=\"text-align: justify;\">Do be aware that Jabir Al-Ju’fi was one of the most important Shia hadith narrators of all time.<\/p>\n<p style=\"text-align: justify;\">In another interesting biography, Al-Tusi (Al-Rijal p. 125) mentions the biography of Ayoob Al-Sakhtiyani that he “shaved his head from year to year, and split it if it grew.” He then states that he died in the plague of Al-Basra in the year 131 AH. This random description of this narrator is the only precise and detailed one that we have of any narrator in the book. Not surprisingly, we find this to be a paraphrased from Tabaqat Ibn Sa’ad 7\/187.<\/p>\n<p style=\"text-align: justify;\">Keep in mind that Ibn Sa’ad predates Al-Tusi by two hundred years.<\/p>\n<p style=\"text-align: justify;\">Other interesting aspects of Al-Tusi’s weakness in this field is that he does not include any information of the year of birth or death of any narrator that was a companion of Al-Redha, Al-Jawad, Al-Hadi, or Al-Askari. He does only include one narrator from the companions of Musa Al-Kathim: Al-Hasan bin Mohammed bin Sama’a, who Al-Tusi (Al-Rijal p. 335) mentions to have died on 263 AH.<\/p>\n<p style=\"text-align: justify;\">The only chapter that has a decent amount of birth\/death information is the chapter on the companions of Al-Sadiq. However, it is quite clear to the reader upon studying Al-Tusi’s intro (p. 17) that the chapter of Al-Sadiq’s companions is based on the book that was compiled by the Zaydi historian Ibn Uqdah, who Al-Tusi has obviously copied from. Al-Tusi is very much aware that Ibn Uqdah was a Zaydi, as he clearly states that in Ibn Uqdah’s biography (Al-Rijal p. 409).<\/p>\n<p style=\"text-align: justify;\">Below is a list of those that narrated from the Prophet – peace be upon him – whose years of deaths have been mentioned by Al-Tusi. Al- Tusi mentions 468 in his Rijal.<\/p>\n<p style=\"text-align: justify;\">The first question we asked ourselves is: Why would Al-Tusi or any Shia have any knowledge of the years of deaths of those that narrated from the Prophet anyway?! It is not like they narrate any hadiths in the first place. Rather, this is another proof that Al-Tusi is simply quoting what he found in Sunni books. We have quoted the earlier Sunni source besides the year of death.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Anas bin Al-Harith – Killed in <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a> (Al-Jarh wal Ta’deel 1\/213)<\/li>\n<li>Ubai bin Mu’ath – Killed in B’ir Ma’oona (Ibn Sa’ad 3\/381)<\/li>\n<li>Anas bin Mu’ath &#8211; Killed in B’ir Ma’oona (Ibn Sa’ad 3\/381)<\/li>\n<li>Anasa – Killed in either Badr or Uhud (Ibn Sa’ad 3\/35)<\/li>\n<li>Ayman bin Um Ayman – Killed in Uhud (Ibn Sa’ad 2\/115 said he died in Hunain)<\/li>\n<li>Unais bin Qatada – Killed in Uhud (Ibn Sa’ad 3\/354)<\/li>\n<li>Al-Bara’a bin Malik – Killed in Tustur (Ibn Sa’ad 7\/12)<\/li>\n<li>Al-Bara’a bin Ma’roor – Died during the time of the Prophet – peace be upon him &#8211; and was one of the Nuqaba’a (Ibn Sa’ad 3\/466)<\/li>\n<li>Bilal bin Rabah – Died in Dimashq in the year 18 and was buried at Bab Al-Sagheer (Ibn Sa’ad 3\/180 Al-Waqidi says 20 AH)<\/li>\n<li>Basheer bin Sa’ad – He fought in Badr. He was under Khalid bin Al-Waleed and was killed during the time of Abu Bakr. (Ibn Sa’ad 3\/493 ed. Al-Khanji) Note: Al-Tusi assumed that he was killed in Yemen, but according to Sunni narrations, he was in Yemen, but was not killed there.<\/li>\n<li>Bishr bin Al-Bara’a – Died due to poisoning at Khaibar (Ibn Hibban 1\/265) (Ibn Sa’ad 3\/429)<\/li>\n<li>Thabit bin Qais – Killed in Al-Yamama (Ibn Sa’ad 4\/342 ed. Al-Khanj)<\/li>\n<li>Ja’far bin Abi Talib – Killed in Mu’tah (Ibn Sa’ad 4\/31 ed. Al-Khanji)<\/li>\n<li>Abu Thar – His name was Jundub bin Junada, Jundub bin Al-Sakan, or Burair bin Junada. He died in Al-Rabatha (Abu Ahmad Al-Hakim 4\/43)<\/li>\n<li>Jubair bin Mut’im – Died in the year 58 (Al-Mada’ini – Al-Tahtheeb 1\/292)<\/li>\n<li>Hamza bin Abdulmutalib – The lion of Allah, Abu Amara or Abu Ya’ala, who was killed in Uhud (Ibn Sa’ad 3\/7)<\/li>\n<li>Huthaifa bin Al-Yaman – Died after fourty days after the bay’a to Ali (Ibn Hibban – Died after fourty days after the death of Uthman)<\/li>\n<li>Al-Harith bin Hisham – Killed in Yarmook (Al-Mada’ini – Al-Tahtheeb 1\/339)<\/li>\n<li>Al-Harith bin Aws – Killed in Uhud (Ibn Sa’ad – 3\/334)<\/li>\n<li>Al-Harith bin Anas – Killed in Uhud (Ibn Sa’ad – 3\/334)<\/li>\n<li>Al-Harith bin Qais – Died during the Caliphate of Omar (Ibn Sa’ad 3\/444)<\/li>\n<li>Haritha bin Al-Nu’man – Died during the time of Mu’awiya (Ibn Sa’ad 3\/372)<\/li>\n<li>Haritha bin Suraqa – Killed in Badr (Ibn Sa’ad 3\/387)<\/li>\n<li>Hakeem bin Hizam – Abu Khalid. Died in the year 60, at the age of 120. (Al-Bukhari in Al-Awsat 1\/209)<\/li>\n<li>Mohammed bin Safwan – Died in the year 43 AH during the month of Safar and was prayed upon by Marwan bin Al-Hakam (Ibn Hibban 1\/431 – Under Mohammed bin Maslama)<\/li>\n<li>Mohammed bin Talha bin Ubaidullah – Killed in the battle of Al-Jamal (Ibn Hibban 1\/432)<\/li>\n<li>Mohammed or Mahmood or Samra Al-Ghafari – Killed in Qanat.<\/li>\n<li>Mohammed bin Abi Bakr – Killed in Egypt in 38 AH (Al-Tabari 3\/916)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">It should be noted that there are more &#8220;Narrators from the Prophet&#8221; with years of death in Al-Tusi’s book than in any other category in his book, except for the narrators from Ja’afar Al-Sadiq. There should be no doubt that the vast majority of his information in regards to dates, with the exception of that chapter (and the last chapter of late Shias that did not meet the Imams), was taken from Sunni sources.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Reliance of Shias upon Sunni Rijal The following is a brief article that demonstrates that reliance of Shias upon Sunni Rijal. Please refer to our earlier articles to witness the superiority of Sunni hadith science over Shia hadith sciences. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/18\/the-reliance-of-shias-upon-sunni-rijal\/\" title=\"The Reliance of Shias upon Sunni Rijal\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-2791","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2791","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2791"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2791\/revisions"}],"predecessor-version":[{"id":3378,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2791\/revisions\/3378"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2791"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2791"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2791"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}