{"id":2836,"date":"2015-11-28T20:44:52","date_gmt":"2015-11-28T20:44:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2836"},"modified":"2019-03-06T02:53:35","modified_gmt":"2019-03-06T02:53:35","slug":"the-400-usool-in-shia-hadith","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/11\/28\/the-400-usool-in-shia-hadith\/","title":{"rendered":"Myth of the 400 Usul in the Shi’ite Tradition"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2836\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2021 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"400 usool\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a><\/p>\n<p>The 400 Usūl (foundations) have continuously been claimed to be the backbone of the Twelver Shi’ite hadith corpus. Major Shi’ite traditionists, such as Al-Kulayni and Al-Saduq, allegedly based their later hadith collections on these earlier works.<\/p>\n<p>Shi’ite polemicists often attempt to argue that the Shi’ite hadith corpus is superior to its Sunni counterpart simply because it is based upon these 400 <em>Usūl<\/em>. The reasoning provided is that these 400 books, according to Al-Tabrasi, Al-Muhaqqiq Al-Hilli, Al-Shahid Al-Thani, Al-Baha’i and Mir Damad <a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a>, were compiled during the life of Ja’far Al-Sadeq, such that his students directly transcribed his reports without the need for chains of transmission.<\/p>\n<p>These <em>Usūl<\/em>, however, did not fare well with the progression of time, as most of them have gone extinct (perhaps due to the carelessness of early Shi’ite authorities responsible for the preservation of traditions from the imams.) Fortunately, 16 of the 400 <em>Usūl<\/em> have survived, and around 30 manuscripts have been identified in Iran, Iraq and India. <a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p><span style=\"font-size: 18pt;\"><strong>The 16 Extant <em>Usūl<\/em><\/strong><\/span><\/p>\n<p>The extant 16 <em>Usūl<\/em> we possess today, however, shed light on the problematic nature of the 400 <em>Usūl<\/em> and their reliability.<\/p>\n<p>First, we shall list the extant 16 <em>Usūl<\/em> and the number of traditions found in each of them:<\/p>\n<ol>\n<li>The book of Zaid Al-Zarrad (34 reports)<\/li>\n<li>The book of Abi Sa’eed Abbad Al-‘Asfari (19 reports)<\/li>\n<li>The book of ‘Asim b. Humaid Al-Hannat (100 reports)<\/li>\n<li>The book of Zaid Al-Narsi (51 reports)<\/li>\n<li>The book of Ja’far b. Mohammad b. Shurayh Al-Hadhrami (123 reports)<\/li>\n<li>The book of Mohammad b. Al-Muthanna Al-Hadhrami (60 reports)<\/li>\n<li>The book of Durust b. Abi Mansur (62 reports)<\/li>\n<li>The book of Abdulmalik b. Hakeem (6 reports)<\/li>\n<li>The book of Al-Muthanna b. Al-Walid Al-Hannat (23 reports)<\/li>\n<li>The book of Khallad Al-Sindi (8 reports)<\/li>\n<li>The book of Husain b. Uthman b. Sharik (44 reports)<\/li>\n<li>The book of ‘Abdullah b. Yahya Al-Kahili (13 reports)<\/li>\n<li>The book of Salam b. Abi ‘Amrah (10 reports)<\/li>\n<li>Nawadir ‘Ali b. Asbaat (30 reports)<\/li>\n<li>A narration on Al-Malahim (1 report)<\/li>\n<li>The book of Al-Alaa’ b. Razin (59 report)<\/li>\n<\/ol>\n<p>These 16 <em>Usūl<\/em>, however, are actually 15 in number, since “A narration on Al-Malahim” simply is a single report and not an entire <em>asl<\/em>. Moreover, contrary to popular belief, these <em>Usūl<\/em> aren’t lengthy collections. Some are perhaps not longer than a single page as demonstrated in the small number of reports found in some of them.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>The Authors of the <em>Usū<\/em>l and their Reliability<\/strong><\/span><\/p>\n<p>Another matter that must be addressed is the reliability of these authors. Were they all reliable companions of Ja’far Al-Sadiq?<\/p>\n<p>The answer, unsurprisingly, is “no.” Several of the authors listed above were, in fact, obscure and unknown transmitters. Below is a little list of some of the weak authors of each of the 16 <em>Usūl:<\/em><\/p>\n<ol>\n<li>Zaid Al-Zarrad – Unknown (<em>majhūl<\/em>).<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/li>\n<li>Abbad Al-Asfari – Unknown (<em>majhūl<\/em>).<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/li>\n<li>Zaid Al-Narsi – Unknown (<em>majhūl<\/em>).<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/li>\n<li>Ja’afar b. Mohammad b. Shurayh – Unknown (<em>majhūl<\/em>).<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/li>\n<li>Khallad Al-Sindi – Unknown (<em>majhūl<\/em>).<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/li>\n<\/ol>\n<p><span style=\"font-size: 18pt;\"><strong>Unverified Ascription to their Alleged Authors<\/strong><\/span><\/p>\n<p>As seen in the previous section, five of the 15 authors listed are not even reliable according to Twelver hadith standards. Nevertheless, let us evaluate the rest of the books and, more specifically, their ascription to their alleged authors.<\/p>\n<ol>\n<li>The 2 chains of transmission listed in the Book of ‘Asim b. Humaid are weak and unreliable.<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a> Al-Tusi and Al-Najashi, in their works, list their own isnads to the book. Due to the weakness of our copy’s isnads and our inability to access Al-Tusi and Al-Najashi’s copies of the book, there is no way to verify whether the book we possess today is the same book they possessed and transmitted.<\/li>\n<li>The surviving fragment from the Book of Durust b. Abi Mansur is primarily transmitted by ‘Ubaydullah b. ‘Abdillah Al-Dihqan <a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a>, who was weak.<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a> Again, there is no way to verify whether the fragment we possess today is identical to Al-Tusi and Al-Najashi’s (lost) copies of the book, especially considering the fact that the first later Shi’ite figure to “rediscover” the book was the 13<sup>th<\/sup> century scholar, Nasrallah Al-Qazwini.<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a><\/li>\n<li>All chains of transmission for the Book of Abdulmalik b. Hakeem converge to Ja’far b. Muhammad b. Hakim. Al-Khoei weakened isnads for this book due to Ja’far’s obscurity.<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/li>\n<li>The isnad mentioned at the preface of ‘Abdullah bin Yahya Al-Kahili’s book is weak due to Mohammad b. Ahmad b. Al-Hasan b. Al-Hakam, who was obscure and unknown.<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a> Again, the isnads mentioned in earlier biographical works do not establish this book’s authenticity, as we cannot cross-reference our copy with the lost copies cited in those works to verify that they are the same book.<\/li>\n<li>The isnad to the book of Salaam b. Abi Amrah is weak due to the obscurity of Al-Qasim b. Mohammad b. Al-Hussain.<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a><\/li>\n<li>The extant manuscript we possess of Al-Alaa’ b. Razeen’s book has no chain of transmission, and it can be dated back to the 9<sup>th <\/sup>century AH.<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a> Al-Najashi, Al-Mufid and others listed their isnads to the book; however, we do not possess their copies such that we can ascertain that they are the same.<\/li>\n<li>Mohammad bin Al-Muathana’s book is exclusively transmitted by Ahmad b. Zaid b. Ja’far Al-Azdi, who is obscure and unknown.<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a><\/li>\n<\/ol>\n<p><span style=\"font-size: 18pt;\"><strong>The “Authentic” <em>Usūl<\/em> that have Reached Us:<\/strong><\/span><\/p>\n<ul>\n<li>The Book of Muthana b. Al-Walid Al-Hannat : It consists of 23 reports. Only one of those reports is directly transmitted from Ja’far Al-Sadeq. The rest contain an intermediary between the author and Ja’far.<\/li>\n<li>The Book of Husain b. Uthman b. Sharik: It consists of 44 report from Al-Sadiq, Al-Baqir, and Al-Kazem. 35 of these reports are from Ja’afar Al-Sadiq. Only four of those the 35 reports are directly transmitted from Ja’far.. A lot of the other reports are transmitted through unreliable intermediaries, such as “a man” (see hadith #16, #21, #22, #23, #25, #26, #29, #33) or “someone” (see hadith #4, #5, #27, #28, #30, #32, #36, #44).<\/li>\n<li>Nawadir Ali b. Asbaat: It consists of 30 reports, and none of them are directly transmitted from Al-Sadeq. Several traditions actually come through two intermediaries, such as reports #12 and #13. The author, Ali b. Asbaat, according to Al-Tusi<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a>,was a companion of Al-Jawad (d. 220) and not Al-Sadiq (d. 148).<\/li>\n<\/ul>\n<p>The final report in the book of Ali b. Asbaat is a must-read narration in which ‘Ali, Abu Bakr, ‘Umar, Abdulrahman b. Awf, and Salman Al-Farsi ride a flying carpet and meet the “People of the Cave” mentioned in Surat Al-Kahf. The “People of the Cave” are then quoted testifying that ‘Ali is their <em>Mawla<\/em> and Imam, while Abu Bakr, Omar, and Abdulrahman, are consequently humiliated.<\/p>\n<p>In conclusion, out of the sixteen <em>Usūl<\/em> we possess today, there is not a single authentic book from a reliable direct student of Ja’far Al-Sadiq.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>Tampering with the <em>Usūl<\/em><\/strong><\/span><\/p>\n<p>Substantive evidence exists to prove that a great number of the books compiled by the imam’s students were, in fact, tampered with and distorted by various forgers at various points in history! Al-Kashi, in the biographical entry of Al-Mughirah b. Sa’id, authentically reported that Yunus b. ‘Abdurrahman was once told:<\/p>\n<blockquote><p>“O Abu Muhammad, how strict are you in hadith! Most of what you disapprove of is regarding what our companions have transmitted. What is it that drives you to reject reports?”<\/p>\n<p>Yunus replied: Hisham b. Al-Hakam informed me that he heard Abu ‘Abdillah (as) saying: “Do not accept a report ascribed to us unless it is in-line with the Quran and Sunnah, or when it is corroborated by our earlier hadith; <u>for Al-Mughirah b. Sa’id – may Allah curse him – inserted hadiths into the books of my father’s companions which my father never uttered. <\/u><\/p><\/blockquote>\n<p>Yunus later said:<\/p>\n<blockquote><p>“I arrived to Iraq, and I found a bundle of Abu Ja’far’s (as) companions. I also found that the companions of Abu ‘Abdillah (as) were abundant, so I heard from them and I acquired their books. I then presented them to Abu Al-Hasan Al-Redha (as) and he disapproved of many of the reports as hadiths from Abu ‘Abdillah.”<\/p>\n<p>He (Al-Redha) then told me: “Abu Al-Khattab had lied upon Abu ‘Abdillah (as). May Allah curse Abu Al-Khattab. <u>The companions of Abu Al-Khattab insert these hadiths into the books of Abu ‘Abdillah’s companions till this day….”<\/u> <a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a><\/p><\/blockquote>\n<p>Al-Kashi, in this context, similarly reported with an authentic isnad that Hisham b. Al-Hakam said:<\/p>\n<blockquote><p>I heard Abu ‘Abdillah (as) say: “Al-Mughirah b. Sa’id used to purposely lie upon my father, and he used to acquire the books of my father’s companions. Al-Mughirah’s companions, who were disguised among my father’s companions, used to acquire the books from my father’s companions. They then used to offer them to Al-Mughirah, who would proceed to insert <em>kufr<\/em> and <em>zandaqah<\/em> into them, and then he would ascribe that to my father. He then used to give the books to his companions and command them to disseminate them among the Shia. Thus, any of the <em>ghuluww<\/em> found in the books of my father’s companions was inserted by Al-Mughirah b. Sa’id.<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a><\/p><\/blockquote>\n<p>As evident from the past excerpts, many of the books of the imams’ companions were compromised during their lives, let alone centuries later after their death. The imams clearly were not capable of preventing this phenomenon from taking place, as they are only quoted warning their Shia of fabrications that have been inserted into their companions’ books. The forged and distorted books of the imams’ companions seemed to have been widely circulated among the Shia. This is clear in Yunus b. ‘Abdurrahman’s report, where he mentioned that he had acquired books from Abu ‘Abdillah’s companions in Iraq only to later discover that much of them was fabricated.<\/p>\n<p>Asides from the questionable authorship and unreliable transmission of these books, the widespread tampering that has occurred with these documents further detracts from their historical value.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>What About the Other 384 <em>Usūl<\/em>?<\/strong><\/span><\/p>\n<p>Not much is known about the remaining 384 <em>Usūl<\/em>. <a href=\"http:\/\/www.islam4u.com\/ar\/almojib\/%D9%85%D8%A7-%D9%87%D9%8A-%D8%A7%D9%84%D8%A3%D8%B5%D9%88%D9%84-%D8%A7%D9%84%D8%A3%D8%B1%D8%A8%D8%B9%D9%85%D8%A7%D8%A6%D8%A9-%D8%9F#footnote13_1far7g9\" rel=\"external nofollow\">Agha Buzurgh Tehrani<\/a>, however, listed the names of 126 <em>Usūl<\/em>, most of which are extinct. We would like to thank brother Abu Jafar Herz for providing us with this list. According to the article cited above, the authors of the <em>Usūl<\/em> are 400 in number, as is the view of Al-Muhaqqiq Al-Hilli and Al-Shaheed Al-Awwal.<\/p>\n<p>After analyzing this list of <em>Usūl,<\/em> we have made several observations that will be of great insight regarding the veracity of these books. Some of Agha Buzurgh’s commentary has further confirmed our conclusions.<\/p>\n<ol>\n<li>Asides from the obscure authorship of a variety of these <em>Usūl<\/em>, some of the authors of these books were liars, forgers and non-Twelvers who have been cursed by the Imams. Al-Tusi, in his <em>Fihrist<\/em>, mentioned that ‘Ali b. Abi Hamzah was the author of an <em>Asl<\/em> and that he was a <em><a href=\"#_ftn20\" name=\"_ftnref20\"><strong>[20]<\/strong><\/a><\/em> In his biographical entry, Al-Kashi listed a variety of condemnations from the Imams upon ‘Ali b. Abi Hamzah<\/li>\n<\/ol>\n<p>Ibrahim Al-Shabboot, in <em>Al-Du’afaa<\/em>, described ‘Ali b. Abi Hamzah saying:<\/p>\n<blockquote><p>“There should be no doubt that this man has been condemned in authentic and sound reports, and that these reports agree that he is a liar, an opponent of Al-Redha (as). [They also confirm] his stubbornness in the face of the truth, that he used to steal the money of Al-Redha (as), and that he was the leader of a misguided group.” <a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a><\/p><\/blockquote>\n<ol start=\"2\">\n<li>Though the author of an <em>Asl <\/em>may be a reliable transmitter, his <em>Asl <\/em>may be worthless. Al-Tusi described Ahmed b. ‘Umar Al-Hallal saying: “He is reliable. His <em>Asl <\/em>is terrible.” <a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/li>\n<li>Many of these supposed <em>Usūl<\/em> were never referred to as “<em>Usūl<\/em>” by early Shi’ite biographers and historiographers, such as Al-Tusi, Al-Najashi and Ibn Shehr Ashub. Rather, they were only called “<em>Usūl<\/em>” by later figures, such as Ibn Tawus (d. 664), Al-Shaheed Al-Thani (d. 965), or Al-Hurr Al-Ameli (d. 1104).<\/li>\n<\/ol>\n<p>See the descriptions of the <em>Usūl<\/em> of Aban b. Mohammad Al-Bajali, Mohammad b. Qais Al-Asadi, and Ziyad b. Marwan by Agha Buzurgh Tahrani in his Dhari’ah.<\/p>\n<ol start=\"4\">\n<li>Some of these <em>Usūl<\/em> were attributed to later fourth century figures who were not direct students of the imams, such as Humaid b. Ziyad (d. 310).<\/li>\n<li>Some of the authors of these <em>Usūl<\/em> were not known for authoring an <em>Asl<\/em>. They were only included in the list because a figure, at one point, referred to “an <em>Asl<\/em> of their work”, meaning, a copy or a manuscript of their work. See the biographies of Ali b. Ahmad b. Abi Al-Qasim, Ali b. Isma’eel bin Shu’aib, and Ali b. Abdulwahid, in Al-Dharee’ah by Agha Buzurgh.<\/li>\n<li>Early Shi’ite biographers and historiographers, such Al-Najashi, were often not aware of whether certain books were Usūl or not. In the biography of Marwak b. ‘Ubaid (p. 425), Al-Najashi briefly describes Marwak’s book, <em>Al-Nawadir<\/em>, saying:  “Our Qommi companions say that it is one of the <em>Usūl<\/em>.”<\/li>\n<\/ol>\n<p>This quote indicates that that Al-Najashi was not fully aware of the book’s status such that he quoted unnamed authorities to describe the book. It also indicates that there wasn’t necessarily a consensus regarding the status of a book as an <em>Asl<\/em>.<\/p>\n<ol start=\"7\">\n<li>The author of the list cited above, Salih Al-Kirbasi, deceptively attempts to inflate the number of <em>Usūl.<\/em> As stated above, the <em>Usūl<\/em> were compiled by four hundred traditionists, and the author of the article has included 126 names. Numbers 47-50 are all authored by Hareez b. Abdullah Al-Sijistani, while numbers 63 to 66 were all authoted by Hafs b. Abdullah Al-Sijistani. The names of the books attributed to both figures are identical, which is natural because the name “Hafs” merely is a copyist error. In other words, Al-Kirbasi attempted to expand his list to 126 books, when it actually should have consisted of 118 books.<\/li>\n<li>Copyist errors in manuscripts often led to the assumption that certain books were <em>Usūl<\/em>. Agha Buzurgh mentioned that certain manuscripts of Al-Fihrist by Al-Tusi would sometimes refer to a <em>Kitab<\/em> as an <em>Asl<\/em> and vice versa. See the biographies of Isma’il b. Aban, Ibrahim b. Salih, and Al-Hasan b. Al-Saree.<\/li>\n<\/ol>\n<p><span style=\"font-size: 18pt;\"><strong>Conclusion<\/strong><\/span><\/p>\n<p>The texts known as the 400 <em>Usūl<\/em> suffer from a variety of defects that cast doubts upon their reliability as historical texts. These defects manifest in a variety of phenomenon, such as:<\/p>\n<ol>\n<li>The extinction of most of the 400 <em>Usūl<\/em><\/li>\n<li>The unreliability of their authors<\/li>\n<li>The inauthentic ascription of <em>Usūl<\/em> to their alleged authors<\/li>\n<li>The compromise of their integrity due to continuous tampering with their contents<\/li>\n<\/ol>\n<p>It is indeed bizarre how some Shi’ite polemicists boast about these documents while they, in reality, should be a source of shame due to their blunderous transmission and preservation Various other potential defects exist within these texts, and perhaps we can further delve into this matter with more detail when more <em>Usūl<\/em> are found, God willing.<\/p>\n<p style=\"text-align: center;\"><span style=\"text-decoration: underline;\"><strong><span style=\"font-size: 18pt;\">Sources<\/span><\/strong><\/span><\/p>\n<p><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Diya Al-Din Al-Mahmudi. <em>Al-Usul Al-Sittah ‘Ashar min Al-Usul Al-Awwaliyyah<\/em>, ed. Neamatullah Al-Jalili and Mahdi Ghulam-Ali, (Qom, 1423), 5.<\/p>\n<p><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Ibid., 103-112.<\/p>\n<p><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Muhammad Al-Jawaheri. <em>Al-Mufid min Mo’jam Rijal Al-Hadith<\/em>, (Qom, 1424), 239.<\/p>\n<p><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Ibid., 299.<\/p>\n<p><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Ibid., 239.<\/p>\n<p><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Ibid., 112.<\/p>\n<p><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Ibid., 210.<\/p>\n<p><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Muslim Al-Dawari. <em>Usul ‘Ilm Al-Rijal bayn Al-Nadhariyyah wal-Tatbiq<\/em> ed. Hasan Al-‘Ubudi, II, 26.<\/p>\n<p><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Hossein Modarresi, Hossein Modarresi, <em>Tradition and Survival: A Bibliographical Survey of early Shī’ite <\/em><\/p>\n<p><em>   Literature<\/em>, I, 83.<\/p>\n<p><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Muhammad Al-Jawaheri. <em>Al-Mufid min Mo’jam Rijal Al-Hadith<\/em>, (Qom, 1424), 364.<\/p>\n<p><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Diya Al-Din Al-Mahmudi. <em>Al-Usul Al-Sittah ‘Ashar min Al-Usul Al-Awwaliyyah<\/em>, ed. Neamatullah Al-Jalili and Mahdi Ghulam-Ali, (Qom, 1423), 60.<\/p>\n<p><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Abu Al-Qasem Al-Khoei, <em>Mo’jam Rijal Al-Hadith<\/em> ed., (Najaf, 1992) , 12, 23.<\/p>\n<p><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Ali Al-Namazi Al-Shahrudi, <em>Mustadrakat ‘Ilm Rijal Al-Hadith<\/em>, (Tehran, 1415), 6, 409.<\/p>\n<p><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Muslim Al-Dawari. <em>Usul ‘Ilm Al-Rijal bayn Al-Nadhariyyah wal-Tatbiq<\/em> ed. Hasan Al-‘Ubudi, II, 39.<\/p>\n<p><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Diya Al-Din Al-Mahmudi. <em>Al-Usul Al-Sittah ‘Ashar min Al-Usul Al-Awwaliyyah<\/em>, ed. Neamatullah Al-Jalili and Mahdi Ghulam-Ali, (Qom, 1423), 157.<\/p>\n<p><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> Muhammad Al-Jawaheri. <em>Al-Mufid min Mo’jam Rijal Al-Hadith<\/em>, (Qom, 1424), 29.<\/p>\n<p><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Muḥammad b. Al-Hasan Al-Tūsī, <em>Rijāl Al-Tūsī <\/em>ed. Jawad Al-Qayyumi Al-Asfahani, (Qum, 1373), 376.<\/p>\n<p><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> Abu ‘Amr Al-Kashi, <em>Ikhtiyar Ma’rifat Al-Rijāl <\/em>ed. Jawad Al-Qayyumi, (Qum, 1427), 195.<\/p>\n<p><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> Ibid., 195-6.<\/p>\n<p><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> Muḥammad b. Al-Hasan Al-Tūsī, <em>Al-Fihrist<\/em> ed. Muḥammad Sadeq Al-Bahr Al-‘Ulum ,(Najaf), 126.<\/p>\n<p><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> Ibrahim Al-Shabboot. <em>Du’afaa’ Al-Ruwat<\/em>. (Beirut, 2010), 337.<\/p>\n<p><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> Muḥammad b. Al-Hasan Al-Tūsī, <em>Rijāl Al-Tūsī <\/em>ed. Jawad Al-Qayyumi Al-Asfahani, (Qum, 1373), 352.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The 400 Usūl (foundations) have continuously been claimed to be the backbone of the Twelver Shi’ite hadith corpus. Major Shi’ite traditionists, such as Al-Kulayni and Al-Saduq, allegedly based their later hadith collections on these earlier works. Shi’ite polemicists often attempt <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/11\/28\/the-400-usool-in-shia-hadith\/\" title=\"Myth of the 400 Usul in the Shi’ite Tradition\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-2836","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2836","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2836"}],"version-history":[{"count":12,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2836\/revisions"}],"predecessor-version":[{"id":4601,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2836\/revisions\/4601"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}