{"id":2886,"date":"2015-12-12T22:38:49","date_gmt":"2015-12-12T22:38:49","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2886"},"modified":"2015-12-14T10:15:27","modified_gmt":"2015-12-14T10:15:27","slug":"nahjul-balagha-contradicts-shia-teachings","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/12\/12\/nahjul-balagha-contradicts-shia-teachings\/","title":{"rendered":"Nahjul Balagha Contradicts Shia Teachings"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2886\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\">Download this article in <a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/12\/contemplations_nahjalbalagha.pdf\" target=\"_blank\" rel=\"external nofollow\">PDF<\/a><\/p>\n<p style=\"text-align: center;\"><strong><em>Ta’amulaat fee Kitaab Nahjul Balagha <\/em><\/strong><\/p>\n<p style=\"text-align: center;\"><strong>(Contemplations on the Peak of Eloquence)<\/strong><\/p>\n<p style=\"text-align: center;\"><strong><br \/>\n<\/strong><\/p>\n<p style=\"text-align: center;\">Written by Muhammad Saadiq<\/p>\n<p style=\"text-align: center;\">(may Allah reward him)<\/p>\n<p style=\"text-align: center;\">Translation: Hani ‘al-Taraabulsee’<\/p>\n<p style=\"text-align: center;\">(May Allah forgive him)<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Praise be to God only and may his peace and blessings be upon our prophet Muhammad, his family, and his companions.<\/p>\n<p style=\"text-align: justify;\">Dear respected reader: The reality of the Islamic nation is not hidden from you, its weakness and divisions, surrounded by ordeals and chaos. The reasons of this weakness are many, from them: The great differences within this nation, you will find them divided to sects (Ahlul-Sunnah wal-Jamaa`ah, Ithna `Ashariyyah, Isma`eeliyyah &amp; Khawaarij, etc…) You will find that the followers of each sect are divided among themselves, for example: The Ithna `Ashariyyah (Twelvers) are divided to Usouliyyah, Akhbaariyyah, and Shaykhiyyah; each group having their own internal differences and the same can be said about Ahlul-Sunnah (Sunnies). In the midst of all this, you will have a hard time finding one who has dedicated himself for reform and unity even though the religious texts place a lot of emphasis on uniting against the enemy as Allah says: {And hold you fast to God&#8217;s bond, together, and do not scatter}[3:103] On the contrary, you will observe that constructive dialogue is missing; when a writer writes a book or treatise directed at his opponent, his jealousy will cause him to do injustice, then the opponent will read that book or treatise thinking of nothing except how to refute its author. Rarely will you find a person who will accept criticism and read with intellect while seeking the truth or at least acknowledge his own mistakes in order to fix them, this a result of the absence of dialogue, the love of the self and the lack of sincerity.<\/p>\n<p style=\"text-align: justify;\">Dear reader: The book in your hands is very brief but very important since it has utilized constructive dialogue in addition to respectable dissertations that are much required today, it also has authentic information without exaggeration or provocation. The author (of this book) decided to be brief and simple – may Allah reward him – so that the serious researcher may work towards unifying the sects that adhere to the Book of Allah and the tradition of His Messenger by finding the truths held inside their main books.<\/p>\n<p style=\"text-align: justify;\">Dear reader: Do not be hasty in your judgment; you must read carefully and ignore the narrations that oppose intellect and instinct for they are the cause of division.<\/p>\n<p style=\"text-align: justify;\">I beg your pardon for these long words,<\/p>\n<p style=\"text-align: justify;\">Saalih bin `Abdullah al-Darweesh<\/p>\n<p style=\"text-align: justify;\">Judge at the Grand Court &#8211; al-Qateef<\/p>\n<p style=\"text-align: justify;\"><strong>INTRODUCTION<\/strong><\/p>\n<p style=\"text-align: justify;\">Praise be to God and may His peace and blessings be upon our master Muhammad, his family, companions and those who follow his guidance until the day of judgment.<\/p>\n<p style=\"text-align: justify;\">Loving the Messenger (peace be upon him) and his family is obligatory upon the Muslims without extremism; the Muslim must hold on to whatever was established from their virtues in the book and authentic traditions, he must also reject baseless reports that were inserted into the narrations. We were taught by the Messenger (peace be upon him) to worship Allah in our prayer by sending our peace and greetings on Muhammad and his family before concluding the prayer, and to say as is recorded in the authentic tradition: “O Lord, Send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Ibraaheem and upon the family of Ibraheem; indeed, You are praiseworthy and glorious.”<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a> And he (peace be upon him) also said: “I remind you by Allah regarding my household.”<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p><strong>The blessing of intellect:<\/strong><\/p>\n<p style=\"text-align: justify;\">Allah has preferred humankind over the beasts with the intellect and He did not hold accountable those who were deprived of this blessing since they cannot differentiate. Allah says {And have shown him the two ways}[90:10] and {Indeed, We guided him to the way, be he grateful or be he ungrateful.}[76:3]<\/p>\n<p style=\"text-align: justify;\">Allah has also given glad tidings to those of intellect and understanding in his holy book {Those who eschew the serving of idols and turn penitent to God, for them is good tidings! So give thou good tidings to My servants &#8211; who give ear to the Word and follow the fairest of it. Those are they whom God has guided; those &#8212; they are men possessed of minds.}[39:17-18] and {Your God is One God; there is no god but He, the All-merciful, the All-compassionate. &#8211; Surely in the creation of the heavens and the earth and the alternation of night and day and the ship that runs in the sea with profit to men, and the water God sends down from heaven therewith reviving the earth after it is dead and His scattering abroad in it all manner of crawling thing, and the turning about of the winds and the clouds compelled between heaven and earth &#8212; surely there are signs for a people having understanding.}[2:163-164]<\/p>\n<p style=\"text-align: justify;\">The intellect is one of the sources of legislation for the Shia, Zainul Deen Al-Amili, also known as al-Shaheed al-Thaanee says: “The foundations: the Book, traditions, consensus and intellect.”<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a> In al-Kaafee the Messenger (peace be upon him) says: “Allah did not bestow upon his slaves anything better than the intellect.”<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a> In Al-Kafi as well, “We heard Aba `Abdillah say: “No treasure is greater than the intellect.” Also in that same book Ibn Al-Sukayt asked al-Ridaa: “What is the divine argument upon the creations today?” Al-Ridaa replied: “The intellect, through it you recognize the truth about Allah from the lies attributed to Allah so that you abandon them.” Ibn Al-Sukayt said: “This is, by Allah, the answer!”<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/p>\n<p style=\"text-align: justify;\">Therefore we must think, we must allow our brains to function because the lack of research shames us and he who does not read has lent his brain to others, and relied on inheritance for knowledge and religion.<\/p>\n<p style=\"text-align: justify;\">Dear reader: The above is sufficient in order for you to think and use your head for what we shall present.<\/p>\n<h2 style=\"text-align: center;\"><strong>The Words of Imam Ali in Nahjul Balagha<\/strong><\/h2>\n<h3 style=\"text-align: justify;\"><strong>The status of Nahjul Balagha:<\/strong><\/h3>\n<p style=\"text-align: justify;\">One of the top contemporary Shia scholars, Al-Hadi Kaashif-ul-Ghitaa’ wrote that: “Nahjul Balagha or what abu al-Hasan Muhammad al-Ridaa chose from the speech of our master, the chief of believers… from the greatest of Islamic books in rank… a light for its seeker, a salvation for its holder, an argument for whoever adopts it, and a treasure for the one who understands it.”<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a> He also said: “Our belief regarding Nahjul Balagha is that all that it contains from sermons, letters, advice and wisdom is like that which is narrated from the Prophet (peace be upon him) and his household in the authentic and relied upon collections.”<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a> He also said about the commentary of Nahjul Balagha by Shaykh Muhammad `Abduh (One of the Shaykhs of al-Azhar in Egypt), he said: “From the best of its commentators is the grand scholar Muhammad `Abduh for he has explained it with briefly.”<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p>\n<p style=\"text-align: justify;\">As for the scholars of Ahlul-Sunnah, some of them said: “Al-Shareef al-Radee compiled it for them and he was aided by his brother al-Murtada, their method was to seek short sermons attributed to the chief of believers then add to it… what is correct from the words of the chief of believers in Nahjul Balagha amounts to the tenth or half of that, the rest are the words of al-Radee and al-Murtada.”<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a> It was also said that the author was al-Shareef al-Murtada (d.436 AH) and although there is a huge gap between them and `Ali may Allah be pleased with him yet they narrate from him directly without chain. This method was also adopted by the contemporary author of Mustadrak Nahjul Balagha.<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a> How can he narrate from `Ali who lived in the first century while he himself died in the fourteenth century without mentioning sources or any chains of transmission!? But who knows, maybe after centuries from now another will come and narrate from `Ali may Allah be pleased with him with that same methodology!!<\/p>\n<p style=\"text-align: justify;\">Despite the status of this book in the eyes of Shia and the status of `Ali, who is claimed to be protected from lying, error, and forgetfulness; he is a leader whose obedience is God’s obedience, yet we find them contradicting what they attributed to `Ali in al-Nahj. Why would the Shia oppose Allah’s Book, the traditions of the messenger (peace be upon him) and the words of their leader!? The evidence for their opposition to Nahjul Balagha is the following:<\/p>\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><strong>First matter:<\/strong> Where is the divine text of `Ali’s appointment? How can `Ali reject leadership if there was such an appointment!?<\/h3>\n<h3><\/h3>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> In Nahjul Balagha we find a sermon by `Ali, when they went to offer him their pledge of allegiance after `Uthmaan’s martyrdom may Allah be pleased with both, he said: Leave me and seek someone else, we are about to face a matter with multiple faces and colors, which neither hearts can stand nor intelligence can accept… If you leave me then I am the same as you are. It is possible I would listen to and obey whomever you make in charge of your affairs. I am better for you as a counselor than as chief. (Sermon 91)<\/p>\n<p style=\"text-align: justify;\">How odd. If the matter of leadership was as the Shia portray it, a divine appointment for `Ali and his eleven children as stated in al-Kaafee: “From abi `Abdillah: Leadership is a promise by Allah given to named men, none of them can withhold it from his successor.”<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a> How then can `Ali say “Leave me and find another”? Do the Shiites accuse him of disobedience? Where is their love for `Ali? According to Sunnis, `Ali is from the best of Companions and most obedient, he was given glad tidings of paradise. However, we see `Ali here in Nahjul Balagha deciding that leadership is permissible for him as well as others, he says that he’d rather be a follower than a chief, unlike how the Shiites see it.<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> `Ali says according to what they narrate in Nahjul Balagha when addressing Talhah and al-Zubayr may Allah be pleased with them all: By Allah, I had no desire for leadership (Khilaafah) nor any interest in assuming authority, but you yourselves invited me to it and prepared me for it. (Sermon 205)<\/p>\n<p style=\"text-align: justify;\">Can anyone say after this that there’s a divine text, while `Ali says that he has no desire for Khilaafah? Or that they pushed him into accepting it? If there was an appointment he wouldn’t have refused, but what can one do when the Shia decided that whoever rejects “Imaamah” has disbelieved?!<\/p>\n<p style=\"text-align: justify;\">Ibn Baabuwayh al-Qummee says explicitly: “We (the Shia) believe concerning the denier of the leadership of the commander of the faithful `Ali bin abi Taalib as well as the Imams after him, that he is like the denier of prophet-hood. Our belief concerning the one who accepts the commander of faithful but rejected one of the Imams after him, then it is as if he believed in all prophets except Muhammad (peace be upon him).”<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a> Al-Tousee says: “Rejecting leadership is disbelief, just as rejecting prophet-hood is disbelief since ignorance concerning both is on an equal footing.”<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong> In Nahjul Balagha, `Ali describes how he received his oath of allegiance: You drew out my hand towards you for allegiance but I held it back and you stretched it but I contracted it. Then you crowded over me as the thirsty camels crowd on the watering cisterns. [Sermon 228]<\/p>\n<p style=\"text-align: justify;\">This description of the event by `Ali shows that he did not wish for it, but that he rejected it until he found himself cornered by them.<\/p>\n<p style=\"text-align: justify;\"><strong>4-<\/strong> `Ali also mentioned the matter of successorship and leadership in Nahjul Balagha, he said: We are happy with the destiny ordained by Allah and have submitted to the command of Allah… I looked at my affairs and found that my obedience (meaning to past Caliphs) preceded my allegiance, while my pledge was binding me towards (the obedience of) another (meaning another man who was in charge). [Sermon 37]<\/p>\n<p style=\"text-align: justify;\">Thus, Allah’s command which `Ali had submitted to was that Abu Bakr may Allah be pleased with them both was the successor, so where then is Allah’s supposed command concerning `Ali’s successorship!?<\/p>\n<p style=\"text-align: justify;\">Ali Al-Bahraanee says in Manaar Al-Huda: “When he (`Ali) saw that, he went to al-Siddeeq after the emigrants and supporters pledged allegiance, he said with his own words while he was the chief of believers and the leader of Muslims, he had no cause for Taqiyyah so he (`Ali) spoke openly about the past events: I walked at that moment towards Abu Bakr, I pledged allegiance and I participated in those events (i.e. al-Riddah wars). So Abu Bakr took charge of those affairs and he dealt with them expertly while I accompanied him as his advisor, I obeyed him constantly as long as he obeyed Allah.<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a><\/p>\n<p style=\"text-align: justify;\">`Ali was obedient to Abu Bakr’s commands. When a group of non-believers came to Madeenah and saw some weakness in the Muslims since they were scattered all-over the lands to fight the renegades, al-Siddeeq felt alarmed, and saw danger was eminent then ordered that the capital be guarded on the outskirts with soldiers. He then ordered `Ali, Zubayr, Talhah, and `Abdullah to take charge of them until they sensed they were safe.<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><strong>Second matter: `Ali may Allah be pleased with him announces his love for Abu Bakr, `Umar, `Uthmaan and praises the companions of the Messenger (peace be upon him) may peace be upon them all.<\/strong><\/h3>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> It was mentioned in Nahjul Balagha that `Umar bin al-Khattaab when he sought `Ali’s opinion – may Allah be pleased with both – as he departed to battle the Persians, `Ali told him: In this matter, victory or defeat is not dependent on the smallness or greatness of forces. It is Allah&#8217;s religion which He has raised above all faiths, and His army which He has mobilized and extended, till it has reached the point where it stands now, and has reached its present positions. We hold a promise from Allah, and He will fulfill His promise and support His army. The position of the head of government (i.e. leader) is that of the thread for beads, as it connects them and keeps them together. If the thread is broken, they will disperse and be lost, and will never come together again. The Arabs today, even though small in number are big because of Islam and strong because of unity. You should remain like the axis for them, and rotate the mill (of government) with (the help of) the Arabs, and be their root. Avoid battle, because if you leave this place the Arabs will attack you from all sides and directions till the unguarded places left behind by you will become more important than those before you. If the Persians see you tomorrow they will say, &#8220;He is the root (chief) of Arabia. If we do away with him we will be in peace.&#8221; In this way this will heighten their eagerness against you and their keenness to aim at you. As for what you say that they have set out to fight against the Muslims then Allah detests their setting out more than you do, and He is more capable of preventing what He detests. As regards your idea about their (large) number, in the past we did not fight on the strength of large numbers but we fought on the basis of Allah&#8217;s support and assistance. [Sermon 146]<\/p>\n<p style=\"text-align: justify;\">Ponder on this dear reader and notice this praise for `Umar’s status by `Ali and his fear for him (i.e. in case harm befalls him if he set out for war). How do we reconcile this with the claim about `Ali that he hated `Umar and cursed him!?<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> Also in Najhul Balagha, `Umar sought `Ali’s advice when he decided to march and battle the armies of Rome (i.e. Byzantine Empire): Allah has taken upon Himself for the followers of this religion the strengthening of boundaries and hiding of the secret places. Allah helped them when they were few and could not protect themselves. He is Living and will not die. If you will yourself proceed towards the enemy and clash with them and fall into some trouble, there will be no place of refuge for the Muslims other than their remote cities, nor anyone for them to return to after you. Therefore, you should send there an experienced man and send with him people of good performance who are well-intentioned. If Allah grants you victory, then this is what you want. If it is otherwise, you would serve as a support for the people and a returning place for the Muslims. [Sermon 134]<\/p>\n<p style=\"text-align: justify;\">Think my brother, if `Umar was truly a disbelieving apostate as the Shia claim why would `Ali describe him as a “support for the people and a returning place for the Muslims,” does he say what he doesn’t believe or is this the truth that has been hidden away from the people of desires?<\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong> Al-Radee included in his Nahjul Balagha what `Ali wrote to Mu`aawiyah may Allah be pleased with both: Verily, those who swore allegiance to Abu Bakr, `Umar, and `Uthmaan have sworn allegiance to me on the same basis on which they swore allegiance to them. Therefore, he who has witnessed (this matter) has no choice (but to accept), and he who was absent has no right to reject; and consultation is confined only to the Muhaajireen (emigrants) and the Ansaar (supporters). If they agree on an individual and announce him as leader it will be Allah&#8217;s pleasure. If anyone rebels against their agreement by means of objection or innovation they will return him to the position from where he kept away. If he refuses they will fight him for following a course other than that of the believers and Allah will judge him based on his decision. [Letter 6]<\/p>\n<p style=\"text-align: justify;\">We observe that Imaam `Ali proves the legitimacy of his position as Khaleefah by relying on the legitimacy of the three who preceded him. This is clear evidence that `Ali acknowledged the authority of Abu Bakr, `Umar, and `Uthmaan in this letter he wrote to Mu`aawiyah. He also informs us that authority is established by agreement of Muslims on a single man, especially the emigrants and supporters in the first century who gathered around Abu Bakr and `Umar, thus he who has witnessed (this matter) has no choice (but to accept), and he who was absent has no right to reject.<\/p>\n<p style=\"text-align: justify;\"><strong>4-<\/strong> `Ali says in Nahjul Balagha: May Allah reward such and such man,<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a> he straightened the curve, cured the disease, abandoned mischief, and established the Sunnah.<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a> He departed (from this world) with untarnished clothes and little shortcomings. He achieved good (of this world) and remained safe from its evils. He offered Allah&#8217;s obedience and feared Him as He deserved. He went away and left the people in dividing ways wherein the misled cannot obtain guidance and the guided cannot attain certainty. [Sermon 227]<\/p>\n<p style=\"text-align: justify;\">Al-Shareef the author has removed the words Abu Bakr and `Umar and instead wrote “such and such” in order to safeguard his (corrupt) beliefs. It was due to this vagueness that the commentators on al-Nahj differed on whether this was aimed at Abu Bakr or `Umar, although most said it was the former as is apparent as he praised him excessively. As for the Shia, the best they could do was say was that the Imaam said this to win over the people’s hearts since they loved the Shaykhayn.<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a> It’s clear to any unbiased reader that this is an attribution of lying for worldly reasons and a cause for the loss of religion, it isn’t conceivable that the Imaam would praise the two if they were corrupt. Furthermore, what urgency would cause him to go to such length in praising them!? Also, this lie would misguide the nation and the so-called infallible cannot be accused of it. So ponder upon this.<\/p>\n<p style=\"text-align: justify;\">The Twelver Imaamiyyah have become confused with such texts, since it’s in Nahjul Balagha and the book is supposed to be authentic with certainty. Their scholar Maytham al-Bahraanee<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a> says concerning this: “Know that the Shia have asked questions regarding this matter: These praises that were directed towards one of the two men conflict with our consensus about their sins and corruption. Either these words are not his (`Ali’s) or our consensus is erroneous.” Then they decided that these words only came out of his mouth as Taqiyyah and that he said it to: “Attract the hearts of those who believe in the leadership of al-Shaykhayn.”<a href=\"#_ftn20\" name=\"_ftnref20\">[20]<\/a> Meaning: `Ali acted in front of them although he believed otherwise inwardly! We on the other hand say that what `Ali said is the honest truth as he does not fear the reproach of any reproacher in Allah’s faith.<a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a><\/p>\n<p style=\"text-align: justify;\"><strong>5-<\/strong> Imaam `Ali had also married his daughter Umm Kulthoum to `Umar as recorded in Kitaab-ul-Talaaq from Furou`-ul-Kaafee, under the Chapter of the Widow 6\/115-116. `Ali had also named his own children after the first three Caliphs (refer to Kash-ul-Ghummah by al-Arbali and al-Irshaad by al-Mufeed).<\/p>\n<p style=\"text-align: justify;\"><strong>6-<\/strong> We read in Nahjul Balagha what `Ali said regarding `Uthmaan may Allah be pleased with both: By Allah, I do not know what to say to you. I know nothing which you do not know, nor can I lead you to any matter of which you are not aware. You certainly know what we know, we have not come to know anything before you which we could tell you; nor did we learn anything in secret which we should convey to you. You have seen as we have seen and you have heard as we have heard. You sat in the company of the Prophet of Allah (peace be upon him) as we did. (Abu Bakr) Ibn Abi Quhaafah and (`Umar) Ibn al-Khattaab were not more worthy of acting righteously than you are, since you are nearer than both of them to the Prophet of Allah (peace be upon him) through kinship, and you also hold relationship to him by marriage (of his daughters) which they do not hold. [Sermon 164]<\/p>\n<p style=\"text-align: justify;\">Observe dear reader the praise of `Ali for `Uthmaan and those before him, he told him that he is more worthy of these righteous acts than Abu Bakr and `Umar, thus declaring that they were both righteous and that `Uthmaan has more right to be so. Why then do `Ali’s so called lovers curse the man? Did they follow their Imaam or oppose him!?<\/p>\n<p style=\"text-align: justify;\"><strong>7-<\/strong> It was also written in one of their commentaries of Nahjul Balagha: “When `Uthmaan was besieged in his own house, `Ali stood and defended him with his hands and words.”<a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/p>\n<p style=\"text-align: justify;\"><strong>8-<\/strong> Then there is `Ali sermon in Nahjul Balagha to his soldiers that revolves around his praise for the Sahaabah in general. He compares them to his own Shia. Here is a part of it: I have seen the Companions of the Prophet (peace be upon him) but I do not find anyone resembling them from among you! They began the day with dust on their hair and faces (in hardship of life); they passed the night in prostration and standing in prayer. Sometimes they put down their foreheads (when prostrating) and sometimes their cheeks (when supplicating). With the recollection of their resurrection it is as though they stood on live coal. It seemed that in between their eyes there were signs like knees of goats, resulting from long prostrations. When Allah was mentioned their eyes flowed freely till their shirt collars were drenched. They trembled for fear of punishment and hope of reward as the tree trembles on the day of stormy wind. [Sermon 96]<\/p>\n<p style=\"text-align: justify;\"><strong>9-<\/strong> He also said while praising the Sahaabah and complaining about his own Shia in Nahjul Balagha: Where are those who when invited to Islam they accepted it!? They read the Qur&#8217;aan and lived according to it. They were exhorted to fight and they leapt (towards it) as she-camels leap towards their young. They took their swords out of the sheaths and went out into the world in groups and rows. Some of them perished and some survived. The good news of survival does not please them nor do they get consoled about the dead. Their eyes have turned white with weeping. Their bellies are emaciated because of fasting. Their lips are dry because of (constant) praying. Their color is pale because of wakefulness. Their faces bear the dust of God-fearing. These are my brothers who have departed. We should be justified if we feel eager for them and bite our hands in their separation. [Sermon 120]<\/p>\n<p style=\"text-align: justify;\"><strong>10-<\/strong> Nahjul Balagha also prohibits the Shia from abusing, cursing, slandering, and accusing even those who fought `Ali of disbelief or wickedness, under the chapter title: “During the battle of Siffeen, the Commander of the Faithful heard some of his men abusing the Syrians.” He said: I dislike for you to curse, but if you describe their deeds and recount their situations, that would be a better mode of speaking and a more convincing way of arguing. Instead of abusing them you should say: &#8220;O Allah! Save our blood and their blood, produce reconciliation between us and them, and lead them out of their misguidance so that he who is ignorant of the truth may know it, and he who inclines towards rebellion and revolt may turn away from it.&#8221; [Sermon 206]<\/p>\n<p style=\"text-align: justify;\"><strong>11-<\/strong> Additionally, we find what `Ali wrote to the people of various localities in Nahjul Balagha, describing what took place between him and the people of Siffeen: The whole thing began thus that we and the Syrians met in an encounter although we believe in one and the same God and our message in Islam is the same. We did not have more of a belief in Allah than them, or in acknowledging His Messenger (peace be upon him), nor did they upon us. In fact, there was complete unity except that we differed on the question of `Uthmaan&#8217;s blood and we are innocent from it! [Letter 58]<\/p>\n<p style=\"text-align: justify;\">`Ali may Allah be pleased with him did not describe anyone of those who fought him with disbelief, even the Khawaarij, nor did he take their progenies, or money as war booty. He did not label his enemies as renegades, like what Abu Bakr and the Companions did when fighting Banu Haneefah. `Ali used to ask Allah to be pleased with Talhah, al-Zubayr, and their army, and considered them as well as Mu`aawiyah’s army to be Muslims. It was established with authentic reports from Sunni and others sources that `Ali ordered his men to call on the day of al-Jamal: “Do not follow those who flee nor harm the wounded or take their money.”<a href=\"#_ftn23\" name=\"_ftnref23\">[23]<\/a> Plenty of reports mention that he would say about Mu`aawiyah’s soldiers: “They are all Muslims, neither hypocrites nor disbelievers.”<a href=\"#_ftn24\" name=\"_ftnref24\">[24]<\/a> This is well documented even in the main Shia sources: From Ja`far, from his father, from `Ali (may Allah be pleased with him), that he did not attribute any of his opponents during war to paganism or hypocrisy. Rather, he would only say: “They transgressed against us.”<a href=\"#_ftn25\" name=\"_ftnref25\">[25]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><strong>Third matter:<u> <\/u><\/strong>`Ali criticizes those who claim to be his Shia yet disobey him from the people of Koufah. We find in Nahjul Balagha many texts that suggest this and we will present a few:<\/h3>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> `Ali says to his Shia: By Allah, I wish Mu`aawiyah exchanges with me like Dinars with Dirhams, so that he takes from me ten of you (Shia) in return for one from them (i.e. one of his Syrian soldiers). O people of Koufah, I have experienced in you three things and two others: you are deaf in spite of having ears, dumb in spite of speaking, and blind in spite of having eyes. [Sermon 96]<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> In Nahjul Balagha he also says: O’ Allah, they are disgusted of me and I am disgusted of them. They are weary of me and I am weary of them. Change them for me with better ones and change me for them with a worse one. [Sermon 25]<\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong> In Nahjul Balagha he says about the Koufans: O you who appear like men but aren’t men! Your intelligence is that of children and your wit is that of the occupants of the curtained canopies (women kept in seclusion from the outside world). I wish I had not seen you nor known you. By Allah, this acquaintance has brought about shame and resulted in repentance. May Allah fight you! You have filled my heart with pus and loaded my bosom with rage. You made me drink mouthful of grief one after the other. You shattered my counsel by your disobedience and caused me disappointment. [Sermon 27]<\/p>\n<p style=\"text-align: justify;\">`Ali’s way, his established actions, and words differ greatly from some of those who claim his love. They have broken his command so many times that he had to constantly reprimand them while they continue to do what angers him to this very day, and he is free of them.<\/p>\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><strong>Fourth matter: <\/strong>`Ali prohibits his followers from being extreme in their love.<\/h3>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> We read in Nahjul Balagha that `Ali said to the Prophet (peace be upon him) after his death (when washing his body in preparation for burial): If you had not ordered endurance and prevented us from bewailing, we would have produced a store of tears. [Sermon 234]<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> In Nahjul Balagha as well, `Ali said: He who beats his hand on his thigh in time of affliction ruins all his good actions. [Saying 136]<\/p>\n<p style=\"text-align: justify;\">Allah most glorious says: {And those who endure with fortitude misfortune, hardship and peril} [2:177] And He says: {Yet give thou good tidings unto the patient &#8211; who, when they are visited by an affliction, say, &#8216;Surely we belong to God, and to Him we return&#8217; &#8211; upon those rest blessings and mercy from their Lord, and those &#8212; they are the truly guided.} [2:155-156-157]<\/p>\n<p style=\"text-align: justify;\">Will the Imaams of Ahlul-Bayt accept what is being done today by the laypeople and the Shia scholars? Did they order grief (as a practice) on `Aashoura’ and other days!?<\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong> We find in Nahjul Balagha that `Ali said: With regard to me, two categories of people will be ruined, namely he who loves me too much and the love takes him away from rightfulness, and he who hates me too much and the hatred takes him away from rightfulness. The best man with regard to me is he who is on the middle course. So be with him and be with the great majority (of Muslims) because Allah&#8217;s hand (of protection) is on keeping unity. You should beware of division. [Sermon 127]<\/p>\n<p style=\"text-align: justify;\"><strong>4-<\/strong> We read what opposes the Twelver Shia view of infallibility in Nahjul Balagha: Do not meet me with flattery and do not think that I shall take it ill if a true thing is said to me, because the person who feels disgusted when truth is said to him or a just matter is placed before him would find it more difficult to act upon them. Therefore, do not abstain from saying a truth or pointing out a matter of justice because I myself am not above making mistakes nor are my actions free from error. [Sermon 216]<\/p>\n<p style=\"text-align: justify;\">In Nahjul Balagha as well `Ali also advises his son al-Hasan may Allah be pleased with both: If anything of this advice is not understood by you then attribute it to your ignorance of it, because when you were first born you were born ignorant. Thereafter, you acquired knowledge. There are many matters of which you are ignorant and in which your sight first wonders and your eye wanders then after this you see them. [Letter 31]<\/p>\n<p style=\"text-align: justify;\">Here is `Ali admitting to the people that he and his son are capable of mistakes. How then could the Shias say that the Imaam is immune to error and forgetfulness!?<\/p>\n<p style=\"text-align: justify;\">`Ali used to call on his Lord with the following supplication mentioned by the author of Nahjul Balagha: O’ Allah, forgive me what Thou knowest about me more than I do. If I return (to the sins) Thou return to forgiveness. O’ Allah, forgive me what I had promised to myself but Thou didst not find its fulfillment with me. O’ Allah, forgive me that with what I sought nearness to Thee with my tongue but my heart opposed and did not perform it. O’ Allah, forgive me winking of the eye, vile utterances, desires of the heart, and errors of speech. [Sermon 77]<\/p>\n<p style=\"text-align: justify;\">Does it not oppose this idea of absolute infallibility when `Ali himself asks Allah to forgive him his sins and even the smallest moments of inattention?<\/p>\n<p style=\"text-align: justify;\">Infallibility according to Shia has developed until it reached what their leader al-Majlisee (d. 1111 AH) and author of Bihaar al-Anwaar said: “Know that the Imami Shia have agreed about the infallibility of Imaams (as) from: Major and minor sins, they cannot commit an error neither intentionally or unintentionally, nor do they forget or fall into error.”<a href=\"#_ftn26\" name=\"_ftnref26\">[26]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Majlisee bestows complete immunity upon his leaders from all conceivable defects, they are protected from all small and big sins, they do not fall into error, they never forget.<\/p>\n<p style=\"text-align: justify;\"><strong>5-<\/strong> We read in Nahjul Balagha that `Ali said: I advise you to practice fear of Allah who gave you good clothing and bestowed an abundance of sustenance on you. If there was anyone who could secure a ladder to everlasting life or a way to avoid death it was Sulaymaan bin Daawoud (as). [Sermon 182]<\/p>\n<p style=\"text-align: justify;\">This contradicts the chapter title that al-Kulaynee placed in his book al-Kaafee: “That the Imaams know when they die and they do not die except by their choice.” How could then be when `Ali says: “If anyone could find a way to avoid death.”<\/p>\n<p style=\"text-align: justify;\"><strong>6-<\/strong> `Ali says about the Prophet (peace be upon him) in Nahjul Balagha: Allah deputized the Prophet after a gap from the previous prophets when there was much dispute (among the people). With him Allah exhausted the series of prophets and ended the revelation.) [Sermon 133]<\/p>\n<p style=\"text-align: justify;\">Yet we read in their book al-Kaafee: Al-Hasan bin `Abbaas al-Ma`roufee wrote to al-Ridaa (as): May I be a ransom for you, tell me what is the difference between a messenger, a prophet and an Imaam. He wrote back: The messenger sees Jibreel and hears him and acquires the revelation and maybe he’ll see in his dreams, visions like those of Ibraaheem (as). A prophet may hear the words or may see the form without being able to hear. An Imaam is the one who hears the words but does not see the form.”<a href=\"#_ftn27\" name=\"_ftnref27\">[27]<\/a><\/p>\n<p style=\"text-align: justify;\">I add that in al-Bihaar are nineteen narrations stating that Allah spoke to `Ali and that Jibreel dictated to him.<a href=\"#_ftn28\" name=\"_ftnref28\">[28]<\/a><\/p>\n<p style=\"text-align: justify;\">Some of the narrations mention the different types of revelation the Imaam receives. Ja`far says: “From us are those who hear whispers in their ears, from us are those who are visited in their dream, from us are those who hear as if a chain fell on a container and from us are those who see an image greater than Jibreel and Meekaa’eel.”<a href=\"#_ftn29\" name=\"_ftnref29\">[29]<\/a><\/p>\n<p style=\"text-align: justify;\">Furthermore, they elevated them to a station higher than messengers and prophets that they do not even require revelations! Al-Kulaynee writes in al-Kaafee the chapter “If the Imaams wish to know (a matter) they will know it.” In it, he mentions three reports stating that if the Imaams wished to know; they would know.<a href=\"#_ftn30\" name=\"_ftnref30\">[30]<\/a><\/p>\n<p style=\"text-align: justify;\">We conclude that the revelation in case of the Imaam is not by Allah’s will alone such as the case with messengers and prophets, instead it’s up to the Imaam to decide if he wishes. They went further and said that the Imaams travel to the Most Merciful’s throne each Friday night to circulate around it and collect whatever they desire of knowledge; abu `Abdillah says: “On the night of Friday, the Messenger of Allah (peace be upon him) and we the Imaams go to the throne, our souls are not returned to our bodies except after we receive beneficial knowledge, otherwise we would have ran out.”<a href=\"#_ftn31\" name=\"_ftnref31\">[31]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Kulaynee placed a chapter titled: “The Imaams are those in authority under Allah’s command and they are the treasuries of his knowledge.”<a href=\"#_ftn32\" name=\"_ftnref32\">[32]<\/a> He included six narrations that talk about this in it. He wrote another chapter titled “The Imaams inherited the knowledge of the prophets and the legatees before them.”<a href=\"#_ftn33\" name=\"_ftnref33\">[33]<\/a> In it are seven narrations. Another chapter, he entitled: “The Imaams possess all the knowledge that was bestowed upon the angels, the prophets and the messengers.”<a href=\"#_ftn34\" name=\"_ftnref34\">[34]<\/a> In it are four reports.<\/p>\n<p style=\"text-align: justify;\">Shia books mention that the Messenger (peace be upon him) was teaching `Ali secrets and knowledge all of his life and they exaggerated so much that no intellect can accept their claims, they even said: “`Ali continued being taught from the Prophet’s (peace be upon him) own mouth even after his (the Prophet’s) death.” Al-Majlisee even wrote an entire chapter on this titled: “What he was taught by the Messenger of Allah (peace be upon him) upon and after his passing.”<a href=\"#_ftn35\" name=\"_ftnref35\">[35]<\/a><\/p>\n<p style=\"text-align: justify;\">The first narration stated that `Ali said: The Messenger (peace be upon him) advised me (at the moment of his death) saying: “If I die, wash me with six buckets from the well of Ghars. When you’re done, place me in my shroud, and place your mouth on mine.” `Ali said: I did, and he taught me all what was, and what is to be until the Day of Judgment. The second narration said that the messenger (peace be upon him) said: “O `Ali, when I die, wash me, shroud me, then sit me up, ask me, and write it down.” <a href=\"#_ftn36\" name=\"_ftnref36\">[36]<\/a><\/p>\n<p style=\"text-align: justify;\">The rest of the narrations follow suit, until finally they say that whenever `Ali was informed of anything, he’d respond: “This is what the Prophet (peace be upon him) told me after he died.”<a href=\"#_ftn37\" name=\"_ftnref37\">[37]<\/a><\/p>\n<p style=\"text-align: justify;\"><strong><br \/>\n<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">Dear respected reader: I find that this amount is sufficient for us and we will meet again God-willing. We have to be patient while following the path and collect the traditions that unite us as a nation. Let us be callers to reform and closeness. This is surely the path, for we must show the rank of Aal-ul-Bayt from the books of Sunnah. We must work sincerely to filter out the (corrupted) narrations of the Imaams, and we must rely on the Holy Qur’aan as the main source of unity for the Muslims. This, God-willing, will be our next topic so until then farewell. If harsh words were spoken, then I apologize. Farewell.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Al-Bukhaaree 6352<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Muslim 2408<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Al-Rawdah al-Bahiyyah 3\/62<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Al-Kaafee (One of the main Shia books.) 1\/12<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Al-Kaafee 1\/29<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Mustadrak Nahjul Balagha (intro) pg. 5<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> ibid pg191<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Ibid pg192<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Mukhtasar al-Tuhfah by Dehlawee pg. 58<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Al-Haadee bin `Abbaas Kaashif-ul-Ghataa’ (d.1361 AH)<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Kaafee 1\/278<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Al-`Itiqaadaat lil-Qummee pg111<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Talkhees-ul-Shaafee 4\/131<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Manaar-ul-Huda lil-Bahraanee pg. 373, Naasikh-ul-Tawaareekh 3\/532<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Sharh-ul-Nahj 4\/228 Tabreez print, Al-Shee`ah wa Aalul-Bayt li-Ihsaan Ilaahee pg71<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> The Mu`tazilee Shia Ibn abi al-Hadeed in his Sharh 12\/3 says: The one meant here is `Umar bin al-Khattaab, I have found the original copy of Nahjul Balagha in abi al-Hasan al-Radee’s own handwriting and he wrote “`Umar” under the word “such and such”. He also says: I asked the head of the order of Ahlul-Bayt, abu Ja`far Yahya bin abi Zayd al-`Alawee and he said “`Umar bin al-Khattaab”, I told him: “Would the chief of believers praise him this much!?” He replied: “Yes.” He also said in 2\/4: If the chief of believers admitted that he departed with untarnished clothes and that he obeyed Allah and feared him, then this is the utmost praise.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Refer to earlier sources such as Taareekh-ul-Tabaree or Taareekh Ibn Shubbah to see that he was in fact talking about `Umar.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> Shaykhayn: A term that refers to Abu Bakr and `Umar in most Shia writings.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> Also known as Kamaal-ul-Deen, he is one of the commentators on al-Nahj and one of their popular scholars in Bahrayn.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> Sharh al-Nahj li-Maytham al-Bahraanee 4\/98<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> Usoul Madhab-ul-Shee`ah li-Naasir al-Qafaari pg764<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> Sharh al-Nahj lil-Bahraanee 4\/354<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref23\" name=\"_ftn23\">[23]<\/a> Usoul Madhab al-Shee`ah Naasir al-Qafaaree<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref24\" name=\"_ftn24\">[24]<\/a> Minhaaj-ul-Sunnah 4\/181<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref25\" name=\"_ftn25\">[25]<\/a> Qurb-ul-Isnaad 62, Wasaa’il-ul-Shee`ah 11\/62<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref26\" name=\"_ftn26\">[26]<\/a> Bihaar-ul-Anwaar 25\/209<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref27\" name=\"_ftn27\">[27]<\/a> Al-Usoul min Al-Kaafee 1\/76<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref28\" name=\"_ftn28\">[28]<\/a> Bihaar-ul-Anwaar 39\/151-157<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref29\" name=\"_ftn29\">[29]<\/a> Ibid 26\/358, Basaa’r-ul-Darajaat pg63<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref30\" name=\"_ftn30\">[30]<\/a> Al-Kaafee 1\/258<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref31\" name=\"_ftn31\">[31]<\/a> Ibid 1\/254, Bihaar-ul-Anwaar 26\/88-89, Basaa’ir al-Darajaat pg36<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref32\" name=\"_ftn32\">[32]<\/a> Al-Kaafee 1\/191-192<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref33\" name=\"_ftn33\">[33]<\/a> Ibid 1\/223-226<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref34\" name=\"_ftn34\">[34]<\/a> Ibid 1\/255-256<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref35\" name=\"_ftn35\">[35]<\/a> Bihaar-ul-Anwaar 40\/213-218<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref36\" name=\"_ftn36\">[36]<\/a> Ibid 40\/213, Basaa’ir al-Darajaat pg80<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref37\" name=\"_ftn37\">[37]<\/a> Bihaar-ul-Anwaar 40\/215<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Download this article in PDF Ta’amulaat fee Kitaab Nahjul Balagha (Contemplations on the Peak of Eloquence) Written by Muhammad Saadiq (may Allah reward him) Translation: Hani ‘al-Taraabulsee’ (May Allah forgive him)     Praise be to God only and may <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/12\/12\/nahjul-balagha-contradicts-shia-teachings\/\" title=\"Nahjul Balagha Contradicts Shia Teachings\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-2886","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2886","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2886"}],"version-history":[{"count":11,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2886\/revisions"}],"predecessor-version":[{"id":2914,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2886\/revisions\/2914"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2886"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2886"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2886"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}