{"id":2915,"date":"2016-02-27T04:29:42","date_gmt":"2016-02-27T04:29:42","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2915"},"modified":"2018-05-10T03:19:17","modified_gmt":"2018-05-10T03:19:17","slug":"tashbeeh","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/02\/27\/tashbeeh\/","title":{"rendered":"Tashbeeh &#038; Tajseem in Shia texts"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2915\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>WARNING:<\/strong><\/span> This article glances briefly at some dangerous ideas that are too advanced for the regular layperson, please seek the aid of your local qualified scholar to address any doubts.<\/p>\n<p style=\"text-align: justify;\">This article is an attempt by this weak slave to write a simple introduction to the topic of &#8220;Asmaa&#8217; wal-Sifaat&#8221; and the different ways that the nation has adopted in dealing with them.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s define what are the Asmaa&#8217; wal-Sifaat of Allah (swt),<\/p>\n<p style=\"text-align: justify;\">&#8220;Asmaa'&#8221; plural of &#8220;Ism&#8221; means NAMES, they are the 99 names of Allah that we all know and accept today. Such as (e.g. The Almighty, The Passionate, The Merciful, The Wise etc&#8230;) They teach us about the absolute perfection of The Creator (swt).<\/p>\n<p style=\"text-align: justify;\">&#8220;Sifaat&#8221; plural of &#8220;Sifah&#8221; means ATTRIBUTES, Allah would attribute a certain description to himself -whether in Qur&#8217;an or Hadith- such as {Allah has become angry with him} [4:93] In this verse, Allah has attributed anger to himself, He has described himself as being angry with certain individuals.<\/p>\n<p style=\"text-align: justify;\">Now if you look at Allah&#8217;s 99 names, you will not find &#8220;The Angry&#8221; as one of them, since this is an attribute(Sifah) not an Ism(name). One cannot turn an attribute into a name.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s take another example, knowledge for instance, Allah says: {Allah knows that you used to deceive yourselves}[2:187] We see Allah describing himself as having known something, He attributed knowledge to himself. If we look at Allah&#8217;s names we also find that He is called &#8220;The Knower&#8221;.<\/p>\n<p style=\"text-align: justify;\">Here&#8217;s how things begin to get complicated, when a layman ponders upon the above verse, how did God know that we deceived ourselves? Is His knowledge similar to ours?<\/p>\n<p style=\"text-align: justify;\">Then one realizes that when The Creator knows something it isn&#8217;t like when his creations know something. Simply because the religious texts all show that God is all-knowing and He knows the unseen, so He must have always known this matter, He can&#8217;t have been ignorant of it at any point, His knowledge is eternal. On the other hand, the creatures know something after ignorance, they learn of it after having been ignorant and they may even forget it in the future.<\/p>\n<p style=\"text-align: justify;\">So far so good, but then people will have different thoughts and will dive deeper and discuss whether God&#8217;s knowledge is pre-existent as part of Him or a separate entity, whether it was created or un-created, and the philosophical discussions go even further until you get folks who say God&#8217;s knowledge is not Him, it&#8217;s not different from Him nor a part of Him.<\/p>\n<p style=\"text-align: justify;\">The words and ideas of the Islamic thinkers and intellectuals as well as those philosophers from foreign cultures all affected the development of the concept of God in people&#8217;s minds. The discussions became as complex as the human species and this matter of speculative theology engulfed the lands especially in the time of Banu al-`Abbas, it was a time when a torrent of new ideas spread in this nation and the scholars of Islam dealt with this flow of ideas in very different ways.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s talk about the ways Muslims dealt with Allah&#8217;s (swt) Names &amp; Attributes,<\/p>\n<p style=\"text-align: justify;\">In Islam, it is our belief that God transcends all creations, He is far exalted above them. However, Muslims differed on how to elevate God in a way that suites His majesty, just like they differed on the nature of His &#8220;knowledge&#8221; as illustrated above although each party is claiming to have elevated God.<\/p>\n<p style=\"text-align: justify;\">This becomes more apparent when we see their difference on more vague attributes, the best examples of this would be verses such as these:<\/p>\n<p style=\"text-align: justify;\">{He (Allah) said: O Iblis! What hindereth thee from falling prostrate before that which I have created with both My hands?} [38:75]<\/p>\n<p style=\"text-align: justify;\">{Indeed, your Lord is Allah, who created the heavens and earth in six days and then established Himself above the Throne.} [7:54]<\/p>\n<p style=\"text-align: justify;\">In these two verses we see Allah has attributed to himself parts (i.e. hands) and a location (i.e. above the throne), and if Muslims differed on &#8220;knowledge&#8221; then there&#8217;s definitely going to be a great difference here due to the fact that this topic directly affects our understanding of the far-exalted God.<\/p>\n<p style=\"text-align: justify;\">The people of the Qiblah divided into several opinions when it comes to dealing with the Names &amp; Attributes of Allah especially those with anthropomorphic implications: Affirming them (Ithbaat), Interpreting them (Ta&#8217;weel) and Withholding (Tawaqquf).<\/p>\n<p style=\"text-align: justify;\">Those who interpret are several groups:<\/p>\n<p style=\"text-align: justify;\">1-Groups that denied all of Allah&#8217;s names and attributes. [e.g. Jahmiyyah, Falaasifah (Philosophers), Baatiniyyah (Esoteric groups like Qaraamitah), Ghulaat-ul-Soufiyyah (Extremist Soufies)].<\/p>\n<p style=\"text-align: justify;\">For example, they won&#8217;t describe Allah as Knower, instead they say &#8220;He is not ignorant&#8221; nor will they describe Him as Living, they will say &#8220;He is not dead&#8221;. They have other creative ways and views as well about how to reject Allah&#8217;s attributes.<\/p>\n<p style=\"text-align: justify;\">As far as Allah&#8217;s Names, they will tell you that we cannot accept His Names as that would entail Tashbeeh (Likening Allah to His creation). For instance, if we call Allah &#8220;The Powerful&#8221; then we have likened Him to others of His creatures who are described as powerful, if we call him &#8220;The Merciful&#8221; then we&#8217;ve likened Him to merciful creatures like our Prophet (saw).<\/p>\n<p style=\"text-align: justify;\">In this group some groups are Waaqifah, meaning they stop and neither confirm nor deny. For example the Qaraamitah will tell you: &#8220;We cannot say He is Merciful or He isn&#8217;t&#8221; As affirming Mercy for Him is Tashbeeh (likening Allah to His creation) and denying it is likening Allah to the non-existence.<\/p>\n<p style=\"text-align: justify;\">Another example are Al-Laa Adriyyah (Agnostics) who don&#8217;t affirm or deny, for example they say: &#8220;We cannot say whether He&#8217;s alive nor dead&#8221; and &#8220;We cannot say whether He exists or He doesn&#8217;t&#8221; We simply do not know. Thus they are ignorant.<\/p>\n<p style=\"text-align: justify;\">2-Groups that affirmed Allah&#8217;s names but denied his attributes. They gave various interpretations to attributes they thought likened The Creator to His creatures. [e.g. Mu`tazillah, Zaydiyyah (Zaydi Shia), Muta&#8217;akhireen al-Ithnaa-`Ashariyyah (Late Imami Shia), al-Dhaahiriyyah, some of the Khawaarij]<\/p>\n<p style=\"text-align: justify;\">An example of their methods when it comes to Allah&#8217;s attributes: {And your Lord has come and the angels, rank upon rank} [89:22] They explained: The verse means the &#8220;command&#8221; of your Lord has come. Not that He came or attributed to himself the act of &#8220;coming&#8221;.<\/p>\n<p style=\"text-align: justify;\">As far as Allah&#8217;s Names, they will accept them but just as names without meaning for the most part, so they will say &#8220;He is the knower without knowledge&#8221; meaning Allah is Knower with­out being characterized by any attribute of knowledge. This is because they believe that Allah&#8217;s attributes cannot be distinct from Him as that would create two eternal beings, Allah and Allah&#8217;s knowledge which is independent from Him. The difference here is, when they say Allah is The Knower, they don&#8217;t mean that He possesses knowledge, as that would mean knowledge is a separate entity but they mean that His knowledge is His essence.<\/p>\n<p style=\"text-align: justify;\">Another example, they will say that Allah is &#8220;The Powerful&#8221; without power. Affirming the name and denying the attribute, for if they say &#8220;Powerful with a power&#8221; that means the power is either created and therefore Allah was not powerful before it was created, they say Allah cannot change over time and this is why we reject it. They will say, if Allah&#8217;s power was not created that means it is as ancient as Allah, this leads us to believe in the multiplicity of beginningless entities, Allah and His power which in turn negates His Oneness.<\/p>\n<p style=\"text-align: justify;\">3-Groups that affirmed His names and a few of his attributes while interpreting the rest. (e.g. Kullaabiyah, Ashaa`irah, Maatureediyyah).<\/p>\n<p style=\"text-align: justify;\">Similar to the group above them with the difference that they affirmed around seven of Allah&#8217;s attributes: Life, Knowledge, Will, Hearing, Seeing, Speech and Power.<\/p>\n<p style=\"text-align: justify;\">For example, if we look at the verse mentioning Allah&#8217;s &#8220;hands&#8221;: {[Allah] said, &#8220;O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [already] among the haughty?&#8221;} [38:75]<\/p>\n<p style=\"text-align: justify;\">They will say: Hands here mean powers. Or they will say: Attributing something to Allah is only in order to glorify Him, just as Allah says &#8220;My House&#8221; as referring to the Ka`bah although it is a creature, then these &#8220;My Hands&#8221; can also be a creature of Allah. Or they will say: Attributing hands in the language to something does not necessarily mean that thing possesses physical body-parts, for example: {falsehood does not come to it from between its hands nor from behind it.} [41:42] This doesn&#8217;t mean the book has hands but the Arabic expression means &#8220;from in front of it&#8221;. They will list various interpretations to deny the attribution of body-parts to Allah.<\/p>\n<p style=\"text-align: justify;\">As for Allah&#8217;s Names, they affirmed them and explained them and their attributes. They did not just affirm the names as empty words without meaning or depth such as some of the previous groups. For example, they would affirm &#8220;The Merciful&#8221; and discuss Allah&#8217;s attribute of mercy, and they would affirm &#8220;The Just&#8221; then discuss Allah&#8217;s justice. However, if the name entails attributing something to Allah which they disbelieve in, for example &#8220;The High&#8221; means Allah is attributing a location to Himself, so they will give the name a different interpretation such as: Having a high honor and whatnot. Another example &#8220;The Light&#8221;, instead of accepting it as is, they interpreted it as meaning: The guide.<\/p>\n<p style=\"text-align: justify;\">4-Groups that affirmed Allah&#8217;s names and attributes in a way that suites his majesty without asking questions. [Jumhour-ul-Salaf, Ahlul-Hadeeth, Jumhour-ul-Hanaabilah (Most Hanbalis)]<\/p>\n<p style=\"text-align: justify;\">They affirm all names and attributes as they are without likening Allah to His creations. For example they will say: Allah exists and human-beings also exist but this does not mean that our existence is like Allah&#8217;s existence, for Allah Has always been in existence and shall remain eternal whereas humans have been brought into existence by Allah and they shall perish by His order.<\/p>\n<p style=\"text-align: justify;\">Another example is that they will say: We affirm Allah describing Himself as powerful even though certain humans are described as powerful, such as Alexander or Genghis Khan, this does not mean that Allah is like His creation since His power differs in nature than their power which is limited by physical strength and whatever authority they have over armies for a duration of their short existence. Allah&#8217;s power however is absolute, it transcends all, is beyond imagination and He has complete control over the universe and its creation.<\/p>\n<p style=\"text-align: justify;\">As for what may imply likening Allah to His creatures, for example in this verse:<\/p>\n<p style=\"text-align: justify;\">{They measure not God with His true measure. The earth altogether shall be His handful on the Day of Resurrection, and the heavens shall be rolled up in His right hand. Glory be to Him! High be He exalted above that they associate!} [39:67]<\/p>\n<p style=\"text-align: justify;\">Or this<\/p>\n<p style=\"text-align: justify;\">{Surely your Lord is God, who created the heavens and the earth in six days &#8212; then sat Himself upon the Throne, covering the day with the night it pursues urgently &#8212; and the sun, and the moon, and the stars subservient, by His command. Verily, His are the creation and the command. Blessed be God, the Lord of all Being} [7:54]<\/p>\n<p style=\"text-align: justify;\">Their way of dealing with such texts is: {We believe in it; all is from our Lord} [3:7]<\/p>\n<p style=\"text-align: justify;\">They will say: We believe in this text and we do not ask &#8220;How?&#8221; We affirm what Allah affirms for Himself in a way that suites His majesty and only He knows the truth of all things. This is why they will consider things like &#8220;hands&#8221; to be an attribute and pass by such texts without asking any questions.<\/p>\n<p style=\"text-align: justify;\">This group will also rely on prophetic-traditions and reports from the first generations (al-Salaf) to interpret similar texts if available.<\/p>\n<p style=\"text-align: justify;\">5-Groups that refuse to address the texts. [Jama`ah min al-Salaf]<\/p>\n<p style=\"text-align: justify;\">They withhold their own opinions and will not make any interpretations, they will also refuse to comment on any texts where the Creator attributes to Himself a matter possessed by the creation. They pass through such texts without diving into the meaning, leaving the matter completely up to Allah out of fear of His punishment.<\/p>\n<p style=\"text-align: justify;\">Several groups of Muslims refused to address the texts for different reasons.<\/p>\n<p style=\"text-align: justify;\">6-Groups that affirm the names and attributes of Allah literally in a physical way. [Qudama&#8217;-ul-Raafidah (Early Imami Shia), Al-Sabaa&#8217;iyyah (Followers of Ibn Saba&#8217;), Ba`d Ghulaat-ul-Soufiyyah (Some Extremist Soufies), Ba`d Ghulaat Ahlul-Hadeeth]<\/p>\n<p style=\"text-align: justify;\">Some from the extremists of the people of Hadith in order to refute the Jahmiyyah and heretics of their time opposed them by diving into anthropomorphism.<\/p>\n<p style=\"text-align: justify;\">Among the more extreme Soufi circles, some affirmed everything for Allah since they view that Allah and His creations are one and the same, they believed in Wahdat-ul-Wujoud or the Unity of Being. While this belief remains controversial among them to this day yet the Soufis were not the first to announce such anthropomorphic beliefs, they were beaten to it by the Shia who announced such beliefs during the life of `Ali ibn abi Talib.<\/p>\n<p style=\"text-align: justify;\">The first of them were groups established by a Jewish convert called `Abdullah Ibn Saba&#8217;, they believed in Tajseem and claimed Allah was a man (`Ali ibn abi Talib), they also claimed al-Bada&#8217; for God, meaning that Allah may be ignorant of a matter and change His judgement based on what He observes from later events, this is also considered Tashbeeh. Other Shia groups were influenced  and ended up committing Tashbeeh, they accepted the texts in a physical way, thus literally reducing Allah to a body as we will read below. They also likened their own saints to Allah in many ways and attributed to them godly qualities as is seen from their books and writings to this day.<\/p>\n<p style=\"text-align: justify;\">It is these groups which we are mainly interested in since they are the ones recognized as the innovators of Tajseem and Tashbeeh.<\/p>\n<p style=\"text-align: justify;\">Al-Jahidh the early 3rd century Mu`tazili scholar said in his book &#8220;al-Hujaj fil-Nubuwwah&#8221; about the Imami Shia of his time:<\/p>\n<p style=\"text-align: justify;\">ليس على ظهرها رافضي إلا وهو يزعم أن ربه مثله<\/p>\n<p style=\"text-align: justify;\">[There isn&#8217;t on the surface of the earth a Rafidi except that he claims his Lord resembles him.]<\/p>\n<p>Abu al-Husayn Al-Khayyat, Mu`tazili scholar from the 3rd century also stated in his book &#8220;Al-Intisar&#8221;:<\/p>\n<p style=\"text-align: justify;\">[As for the opinion of the Rafidah in general, it is that Allah almighty has a volume, an image, a limit, He moves and stops, closer and further and He gets heavier and lighter. His knowledge is created, He had no knowledge before He knew and most of them attribute al-Bada&#8217; to Him, which is that Allah says He will do something then a matter appears to Him so He refrains. This is the Tawheed of the entirety of the Rafidah, except a few among them who accompanied the Mu`tazilah and adopted proper Tawheed so the rest of the Rafidah exiled and disowned them. As for the majority of Rafidah and their scholars, such as Hisham bin Salim, Shaytan-ul-Taq, `Ali bin Maytham, Hisham bin al-Hakam, `Ali bin Mansur and al-Sakkak then they all believe in what we previously mentioned.]<\/p>\n<p style=\"text-align: justify;\">We will go through a brief overview of some beliefs held by early leaders of the Imamiyyah as written in the book &#8220;Maqaalat-ul-Tashbeeh&#8221; by Jabir bin Idris, refer to his book for more detailed sources.<\/p>\n<p style=\"text-align: justify;\">Shia leader Bayan bin Sam`an al-Tamimi said that Allah is a man made from light in the image of a human, then he shall perish except for His face. He also claimed that a godly part was incarnated inside `Ali and it united with him an this godly spirit transmigrated from Imam to Imam until it reached Bayan himself. [Maqalat al-Islamiyin 1\/66, al-Farq bayn al-Firaq 216, al-Tabsir fil-Din 119, Khitat al-Maqrizi 3\/596, Minhaj-ul-Sunnah 2\/502, I`tiqadat Firaq al Muslimin wal-Mushrikin 87]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called al-Mughirah bin Sa`id al-Koufi who claimed God was Muhammad bin `Ali, that he knew the unseen and that he had sent him as his messenger. Al-Mughirah and his followers went to such extremes that they claimed their Lord was a man from light wearing a crown on his head, that he had body parts as any man does, that he has insides and a heart filled with wisdom, they also said Allah&#8217;s body is based on the alphabetical letters, that &#8220;Aliph&#8221; represents the legs, &#8220;`Ayn&#8221; represents the eyes and &#8220;Haa'&#8221; is a great matter which he could not even mention. [Maqalat al-Islamiyin 1\/69, al-Fasl li ibn Hazm 5\/43, al-Ma`arif 623, al-Milal wal-Nihal 1\/176, al-Tabsir fil-Din 119, al-Kamil li ibn al-Athir 4\/230, Minhaj al-Sunnah 1\/260, Khitat al-Maqrizi 3\/296, al-Farq bayn al-Firaq 118, I`tiqadat Firaq al-Muslimin wal-Mushrikin 88, Mizan al-I`tidal 4\/160, Lisan al-Mizan 7\/23]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called abu Mansour al-Mustanir al-`Ijli claimed he was the successor to Muhammad bin `Ali. He said `Ali ibn abi Talib was a lump that descended from the heavens and said that `Ali was god. He then claimed he was god&#8217;s son and that he was made to ascend to the heavens and threatened to choke all his enemies. [Al-Fasl 5\/45, Firaq al-Shia 38, Maqalat al-Islamiyin 1\/75, al-Farq bayn al-Firaq 212, al-Ma`arif 623, al-Milal wal-Nihal 1\/179, al-Khitat 3\/297]<\/p>\n<p style=\"text-align: justify;\">ِAnother Shia leader was abu al-Khattab al-Asadi who claimed Ja`far bin Muhammad was a god and his followers established pilgrimage in Ja`far&#8217;s name. He was a polytheist who said al-Hasan and al-Husayn were god&#8217;s children then he claimed god-hood for the prophets, the household and himself. [Al-Farq bayn al-Firaq 223, al-Fasl 5\/48, al-Milal wal-Nihal 1\/179, Minhaj al-Sunnah 2\/506]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader is `Abdullah bin Mu`awiyah bin Ja`far bin abi Talib, a greedy descendant of Ja`far al-Tayyar who sought authority. His followers went to extremes and said that god&#8217;s soul was transmitted to Adam (as) then it moved from prophet to prophet until it ended with the Imams and finally `Abdullah bin Mu`awiyah. They said that `Abdullah knew the unseen and that Allah was a light embedded into `Abdullah. [Tarikh ibn Khaldoun 3\/121, Mizan al-I`tidal 3\/363, Firaq al-Shia 31, Maqalat al-Islamiyin 1\/67, al-Khitat 3\/396, al-Farq bayn al-Firaq 222, al-Tabsir 125]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called Dawoud al-Jawaribi al-Rafidi said Allah was a carcass made from blood, flesh, bones and a head of thick black hair but He doesn&#8217;t resemble any other man. He did not believe God had a beard or genitals and refused to answer anyone who mentions them. [Sharh Nahj al-Balaghah li ibn abi al-Hadid 1\/294, Maqalat al-Islamiyin 1\/183, al-Milal 1\/105, al-Bid&#8217; wal-Tarikh lil Maqdisi 5\/140]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader was Zurarah ibn A`yun whose followers believed in Bada&#8217; and that Allah&#8217;s attributes were created or are emergent and that they are of the nature of the attributes of the creations. In other words, they claimed Allah was not all-hearing, all-seeing and almighty until He created those things for Himself. [al-Tabsir fil-Din 119, Minhaj al-Sunnah 2\/395, Maqalat al-Islamiyin 1\/111, Al-Farq bayn al-Firaq 76, Al-A`lam lil Zarkali 3\/43]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called Hisham bin al-Hakam al-Koufi said Allah is a body of equal height, width and depth. He said that his god can move at times and remain idle at others, he also claimed his god has friction with the throne and that it fits him perfectly. [Al-Tanbih wal-Radd `ala Ahl al-Ahwa&#8217; 36, Sharh al-Nahj 1\/294, al-Ghuniyah lil-Jaylani 1\/93, Al-Burhan fi `Aqa&#8217;id ahl al-Adyan 72, al-Farq bayn al-Firaq 71, Maqalat al-Islamiyin 1\/106, al-Tabsir 120, al-Milal 1\/184, Minhaj al-Sunnah 1\/71]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called Hisham bin Salim al-Jawaliqi said Allah is not a body but is black light in the image of a human, he possesses five senses, is composed of a hand, a foot and an eye but not made from flesh and blood. [Maqalat al-Islamiyin 1\/108, Al-Milal 1\/185, I`tiqadat Firaq al-Muslimin wal-Mushrikin 95, Sharh al-Nahj 1\/194, Minhaj al-Sunnah 2\/218,al-Khitat 3\/293]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called Yunus bin `Abdul-Rahman al-Qummi, the servant of `Ali bin Yaqtin, he said Allah&#8217;s upper body is hollow while the lower half is full. He also said that the angels carry Allah and that they are able to do so even if He is too great the same way a rooster&#8217;s small thin legs can support its larger body. [Al-Farq bayn al-Firaq 76, Maqalat al-Islamiyin 1\/110, al-Milal wal-Nihal 1\/188, I`tiqadat Firaq al-Muslimin wal-Mushrikin 98]<\/p>\n<p style=\"text-align: justify;\">Another Shia leader called abu Ja`far al-Ahwal (known as Shaytan-ul-Taq) he claimed Allah does not know a matter until it occurs and that His knowledge is emergent. He believed Allah is light in the image of a godly-man. [Sharh Nahj al-Balaghah 1\/294, Al-Tabsir fil-Din 121, Maqalat al-Islamiyin 1\/111, Al-Milal 1\/187]<\/p>\n<p style=\"text-align: justify;\">Note dear reader that many of the Rafidah listed above share similar beliefs when it comes to Tashbeeh and Tajseem yet they still have their differences and exclusive ideas as well.<\/p>\n<p style=\"text-align: justify;\">Next we shall quote some reports about how the early Imami Shia were involved in such corrupt opinions.<\/p>\n<p style=\"text-align: justify;\">We look at the book &#8220;al-Tawheed&#8221; by al-Saduq:<\/p>\n<p style=\"text-align: justify;\">حدثنا علي بن أحمد بن محمد بن عمران الدقاق رضي‌الله‌عنه ، قال : حدثنا محمد بن أبي عبد الله الكوفي ، عن محمد بن إسماعيل البرمكي ، عن الحسين ابن الحسن ، عن بكر بن صالح ، عن الحسين بن سعيد عن إبراهيم بن محمد الخزاز ، ومحمد بن الحسين ، قالا : دخلنا على أبي الحسن الرضا عليه‌السلام فحكينا له ما روي أن محمدا صلى‌الله‌عليه‌وآله رأى ربه في هيئة الشاب الموفق في سن أبناء ثلاثين سنة رجلاه في خضرة  وقلت : إن هشام بن سالم وصاحب الطاق والميثمي يقولون إنه أجوف إلى السرة والباقي صمد ، فخر ساجدا ، ثم قال : سبحانك ما عرفوك ولا وحدوك<\/p>\n<p style=\"text-align: justify;\">[We were told by Ahmad bin Muhammad bin `Imran al-Daqqaq (rah), Muhammad bin abi `Abdillah al-Koufi told us, from Muhammad bin Isma`il al-Barmaki, from al-Husayn bin al-Hasan, from Bakr bin Salih, from al-Husayn bin Sa`id, from Ibrahim bin Muhammad al-Khazzaz and Muhammad bin al-Husayn, they both said We entered upon abu al-Hasan (as) and told him about what they narrated from Muhammad (saw) that he saw his Lord in the image of a handsome man in His thirties wearing green. I told him: Hisham bin Salim, abu Ja`far al-Ahwal Sahib-ul-Taq and Ahmad bin al-Hasan ibn Maytham al-Tammar all say that He (Allah) is void up until His navel and the rest is full. So he (as) fell in prostration and said: &#8220;Glory be to You, they didn&#8217;t know You nor unify You.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Note: al-Daqqaq is supported by Muhammad bin abi `Abdillah al-Asadi (Thiqah) in al-Kafi.<\/p>\n<p style=\"text-align: justify;\">حدثنا حمزة بن محمد العلوي رحمه‌الله ، قال : أخبرنا علي بن إبراهيم بن هاشم ، عن محمد بن عيسى ، عن يونس بن عبد الرحمن ، عن محمد بن حكيم ، قال : وصفت لأبي الحسن عليه‌السلام قول هشام الجواليقي وما يقول في الشاب الموفق ووصفت له قول هشام بن الحكم ، فقال : إن الله عزوجل لا يشبهه شيء<\/p>\n<p style=\"text-align: justify;\">[We were told by Hamzah al-`Alawi (rah), `Ali bin Ibrahim bin Hashim told us, from Muhammad bin `Isa, from Yunus bin `Abdul-Rahman, from Muhammad bin Hakim, he said: &#8220;I described to abu al-Hasan (as) the opinion of Hisham al-Jawaliqi regarding (Allah resembling) the handsome young man and I also described to him the opinion of Hisham bin al-Hakam, so he said: &#8220;Allah does not resemble anything.&#8221;]<\/p>\n<p style=\"text-align: justify;\">حدثنا علي بن أحمد بن محمد بن عمران الدقاق رحمه‌الله ، قال : حدثنا محمد بن يعقوب ، قال : حدثنا علي بن محمد ، رفعه ، عن محمد بن الفرج الرخجي ، قال : كتبت إلى أبي الحسن عليه‌السلام : أسأله عما قال هشام بن الحكم في الجسم ، وهشام بن سالم في الصورة ، فكتب عليه‌السلام : دع عنك حيرة الحيران ، واستعذ بالله من الشيطان ، ليس القول ما قال الهشامان<\/p>\n<p style=\"text-align: justify;\">[We were told by `Ali bin Ahmad bin Muhammad bin `Imran al-Daqqaq (rah), Muhammad bin Ya`qoub told us, `Ali bin Muhammad told us, up to Muhammad bin al-Faraj al-Rakhji: I wrote to abu al-Hasan (as) asking him about what Hisham bin al-Hakam said regarding the body (of god) and what Hisham bin Salim said regarding the image (of god), so he wrote back: &#8220;Ignore the confusion of the confused ones and seek refuge from the devil, the truth is not what the two Hishams say.&#8221;]<\/p>\n<p style=\"text-align: justify;\">أبي رحمه‌الله ، قال : حدثنا أحمد بن إدريس ، قال : حدثنا محمد بن عبد الجبار ، عن صفوان بن يحيى ، عن علي بن أبي حمزة ، قال : قلت لأبي عبد الله عليه‌السلام : سمعت هشام بن الحكم يروي عنكم : أن الله عزوجل جسم ، صمدي ، نوري ، معرفته ضرورة ، يمن بها على من يشاء من خلقه  فقال عليه‌السلام : سبحان من لا يعلم أحد كيف هو إلا هو ، ليس كمثله شيء ، وهو السميع البصير<\/p>\n<p style=\"text-align: justify;\">[My father (rah) said: Ahmad bin Idris told us, Muhammad bin `Abdul-Jabbar told us, from Safwan bin Yahya, from `Ali bin abi Hamzah, I said to abu `Abdillah (as): I heard Hisham bin al-Hakam narrate from you (the household) that Allah is a full body of light and that knowing Him is necessary but He only blesses whom He wishes with it from His creations. He (as) said &#8220;Glory be to Allah! No one knows how He is except Him, nothing is like Him and He is all-seeing, all-hearing!&#8221;]<\/p>\n<p style=\"text-align: justify;\">حدثنا علي بن أحمد بن عبد الله بن أحمد بن أبي عبد الله البرقي رضي‌الله‌عنه ، عن أبيه ، عن جده أحمد بن أبي عبد الله ، عن أحمد بن محمد بن أبي نصر ، عن محمد بن حكيم ، قال : وصفت لأبي إبراهيم عليه‌السلام قول هشام الجواليقي ، وحكيت له قول هشام بن الحكم : إنه جسم ، فقال : إن الله لا يشبهه شيء ، أي فحش أو خناء أعظم من قول من يصف خالق الأشياء بجسم أو صورة أو بخلقة أو بتحديد أو أعضاء<\/p>\n<p style=\"text-align: justify;\">[We were told by `Ali bin Ahmad bin `Abdullah bin Ahmad bin abi `Abdillah al-Barqi (rah), from his father, from his grandfather Ahmad, from Ahmad bin Muhammad bin abi Nasr, from Muhammad bin Hakim: I described to abu Ibrahim (as) the opinion of Hisham al-Jawaliqi and told him about the belief of Hisham bin al-Hakam that He (Allah) is a body. He (as) replied: &#8220;Allah does not resemble anything, what filthiness is greater than describing the creator as a body or an image or likens Him to His creations or limits Him and attributes parts to Him.]<\/p>\n<p style=\"text-align: justify;\">حدثنا علي بن أحمد بن محمد بن عمران الدقاق رضي‌الله‌عنه ، قال : حدثنا محمد بن أبي عبد الله الكوفي ، قال : حدثنا محمد بن إسماعيل البرمكي ، عن الحسين بن الحسن ، والحسين بن علي ، عن صالح بن أبي حماد عن بكر بن صالح ، عن الحسين بن سعيد ، عن عبد الله بن المغيرة ، عن محمد بن زياد ، قال : سمعت يونس بن ظبيان يقول : دخلت على أبي عبد الله عليه‌السلام فقلت له : إن هشام بن الحكم يقول قولا عظيما إلا أني أختصر لك منه أحرفا ، يزعم : أن الله جسم لأن الأشياء شيئان : جسم وفعل الجسم ، فلا يجوز أن يكون الصانع بمعنى الفعل ، ويجوز أن يكون بمعنى الفاعل<\/p>\n<p style=\"text-align: justify;\">[We were told by `Ali bin Ahmad bin Muhammad bin `Imran al-Daqqaq (rah), he said: Muhammad bin abi `Abdillah al-Koufi told us, Muhammad bin Isma`il al-Barmaki told us, from al-Husayn bin al-Hasan and al-Husayn bin `Ali, from Salih bin abi Hammad, from Bakr bin Salih, from al-Husayn bin Sa`id, from `Abdullah bin al-Mughirah, from Muhammad bin Ziyad, he said: I heard Yunus bin Dhabiyan say: I entered upon abi `Abdillah (as) and said: Hisham bin al-Hakam says a great thing! I shall summarize: He claims Allah is a body since everything is one of two: Either an actor or an action and the creator cannot be an action but an actor.]<\/p>\n<p style=\"text-align: justify;\">عن علي بن العباس ، عن الحسن بن عبد الرحمن الحماني  ، قال : قلت لأبي الحسن موسى ابن جعفر عليهما‌السلام : إن هشام بن الحكم زعم : أن الله جسم ليس كمثله شيء<\/p>\n<p style=\"text-align: justify;\">[Same chain as above from al-Barmaki, from `Ali bin `Abbas, from al-Hasan bin `Abdul-Rahman al-Hamani: I said to abu al-Hasan Musa (as): Hisham bin al-Hakam claims Allah is a body which does not resemble anything.]<\/p>\n<p style=\"text-align: justify;\">حدثنا علي بن أحمد بن محمد بن عمران الدقاق رحمه‌الله ، عن محمد بن يعقوب الكليني ، عن علي بن محمد ، عن سهل بن زياد ، عن إبراهيم بن محمد الهمداني ، قال كتبت إلى الرجل يعني أبا الحسن عليه‌السلام : أن من قبلنا من مواليك قد اختلفوا في التوحيد ، فمنهم من يقول جسم ، ومنهم من يقول صورة<\/p>\n<p style=\"text-align: justify;\">[We were told by `Ali bin Ahmad bin Muhammad bin `Imran al-Daqqaq (rah), from Muhammad bin Ya`qoub al-Kulayni, from `Ali bin Muhammad, from Sahl bin Ziyad, from Ibrahim bin Muhammad al-Hamdani: I wrote to aba al-Hasan (as): In our land your servants have differed about Tawheed, a group says (god is) an image and another says (god is) a body.]<\/p>\n<p style=\"text-align: justify;\">حدثنا محمد بن الحسن بن أحمد بن الوليد <span class=\"rfdAlaem\">رضي‌الله‌عنه<\/span> ، قال : حدثنا محمد بن يحيى العطار ، قال : حدثنا محمد بن أحمد ، قال : حدثنا محمد بن عيسى ، عن هشام بن إبراهيم قال : قال العباسي قلت له ـ يعني أبا الحسن <span class=\"rfdAlaem\">عليه‌السلام<\/span> ـ : جعلت فداك أمرني بعض مواليك أن أسألك عن مسألة قال : ومن هو؟ قلت : الحسن بن سهل  قال : في أي شيء المسألة؟ قال : قلت في التوحيد ، قال : وأي شيء من التوحيد؟ قال : يسألك عن الله جسم أو لا جسم؟ قال : فقال لي : إن للناس في التوحيد ثلاثة مذاهب مذهب إثبات بتشبيه ، ومذهب النفي ، ومذهب إثبات بلا تشبيه. فمذهب الاثبات بتشبيه لا يجوز ، ومذهب النفي لا يجوز ، والطريق في المذهب الثالث إثبات بلا تشبيه<\/p>\n<p style=\"text-align: justify;\">[We were told by Muhammad bin al-Hasan bin Ahmad bin al-Walid (rah), Muhammad bin Yahya al-`Attar said, Muhammad bin Ahmad said, Muhammad bin `Isa said, from Hisham bin Ibrahim, he al-`Abbasi, I told abu al-Hasan (as): May I be your ransom, some of your followers asked me to ask you something, he (as) who is he? I said: al-Hasan bin Sahl, he (as) said regarding what? I said: regarding Tawheed, he asks whether Allah is a body or not? He (as) replied: People have split to three groups: Affirming with Tashbeeh, denying and affirming without Tashbeeh. Affirming with Tashbeeh is impermissible, and denying is impermissible so the path is the third, to affirm without Tashbeeh.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Then he narrates with his chains to some of the companions of the Imams who were all complaining that the Shia in their lands have differed concerning Tawheed.<\/p>\n<p style=\"text-align: justify;\">عن محمد بن علي القاساني ، قال : كتبت إليه عليه‌السلام :أن من قبلنا قد اختلفوا في التوحيد<\/p>\n<p style=\"text-align: justify;\">[&#8230; from Muhammad bin `Ali al-Qasani, he said: I wrote to him (as): The people of our land have differed about Tawheed (meaning whether god is an image or a body and whatnot).]<\/p>\n<p style=\"text-align: justify;\">عن بشر بن بشار النيسابوري ، قال : كتبت إلى أبي الحسن عليه‌السلام بأن من قبلنا قد اختلفوا في التوحيد ، منهم من يقول هو جسم ، ومنهم من يقول صورة<\/p>\n<p style=\"text-align: justify;\">[&#8230; from Bishr bin Bashar al-Nishapuri, he said: I wrote to abu al-Hasan (as): The people of our land have differed about Tawheed, some say an image and others say a body.]<\/p>\n<p style=\"text-align: justify;\">حدثنا أحمد بن محمد بن يحيى العطار رحمه‌الله ، عن أبيه ، عن سهل بن زياد ، قال : كتبت إلى أبي محمد عليه‌السلام سنة خمس وخمسين ومائتين : قد اختلف يا سيدي أصحابنا في التوحيد منهم من يقول هو جسم ، ومنهم من يقول هو صورة ، فإن رأيت يا سيدي أن تعلمني من ذلك ما أقف عليه<\/p>\n<p style=\"text-align: justify;\">[We were told by Ahmad bin Muhammad bin Yahya al-`Attar (rah), from his father, from Sahl bin Ziyad, he said: I wrote to abu Muhammad (as) in the year 255 hijri: O master, our companions differed in Tawheed, some say body and others say image. If you can inform me of the correct opinion O master.]<\/p>\n<p style=\"text-align: justify;\">حدثنا علي بن أحمد بن عبد الله بن أحمد بن أبي عبد الله البرقي رحمه‌الله ، عن أبيه ، عن جده أحمد بن أبي عبد الله ، عن أبيه ، عن عبد الله بن بحر ، عن أبي ـ أيوب الخزاز ، عن محمد بن مسلم ، قال : سألت أبا جعفر عليه‌السلام عما يروون أن الله عزوجل خلق آدم على صورته  فقال : هي صورة محدثة مخلوقة ، اصطفاها الله واختارها على سائر الصور المختلفة ، فأضافها إلى نفسه كما أضاف الكعبة إلى نفسه والروح إلى نفسه<\/p>\n<p style=\"text-align: justify;\">[We were told by `Ali bin Ahmad bin `Abdullah bin Ahmad bin abi `Abdilah al-Barqi (rah), from his father, from his grandfather Ahmad, from his father, from `Abdullah bin Bahr, from abi Ayyoub al-Khazzaz, from Muhammad bin Muslim: I asked aba Ja`far (as) about what they narrate concerning Allah creating Adam (as) upon His image. He said: &#8220;It is a created image, He chose it out of different images and attributed it to Himself just as He attributed the Ka`bah to Himself and the soul to Himself.&#8221;]<\/p>\n<p style=\"text-align: justify;\">حدثني محمد بن موسى بن المتوكل رحمه‌الله ، قال : حدثنا عبد الله بن جعفر الحميري ، عن أحمد بن محمد بن عيسى ، عن الحسن بن محبوب ، عن يعقوب السراج ، قال : قلت لأبي عبد الله عليه‌السلام : إن بعض أصحابنا يزعم أن لله صورة مثل صورة الإنسان ، وقال آخر : إنه في صورة أمرد جعد قطط ، فخر أبو عبد الله ساجدا ، ثم رفع رأسه ، فقال : سبحان الله الذي ليس كمثله شيء<\/p>\n<p style=\"text-align: justify;\">[We were told by Muhamad bin Musa al-Mutawakkil (rah), `Abdullah bin Ja`far al-Himyari told us, from Ahmad bin Muhammad bin `Isa, from al-Hasan bin Mahboub, from Ya`qoub al-Sarraj: I said to abi `Abdillah (as): Some of our companions claim that Allah is an image like the image of a man and another said in the image of an adolescent whose beard has not grown on his face; He was also shaggy and curly. Upon hearing this abu `Abdillah (as) fell in prostration saying: &#8220;Glory be to Allah there is nothing like Him.&#8221;]<\/p>\n<p style=\"text-align: justify;\">حدثنا محمد بن موسى بن المتوكل رحمه‌الله ، قال : حدثنا علي بن إبراهيم بن هاشم ، عن أبيه ، عن الصقر بن ( أبي ) دلف ، قال : سألت أبا الحسن علي بن محمد بن علي بن موسى الرضا عليهم‌السلام عن التوحيد ، وقلت له : إني أقول بقول هشام ابن الحكم ، فغضب عليه‌السلام ثم قال : ما لكم ولقول هشام ، إنه ليس منا من زعم أن الله عزوجل جسم<\/p>\n<p style=\"text-align: justify;\">[We were told by Muhammad bin Musa (rah), `Ali bin Ibrahim told us, from his father, from al-Saqr bin abi Dalf, I asked aba al-Hasan `Ali (as) about Tawheed: I share the opinion of Hisham bin al-Hakam. So he (as) became angry and said: &#8220;What&#8217;s wrong with the people and Hisham!? He is not from us who claims Allah is a body.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Zaydi and Mu`tazili scholar Nashuwan al-Himyari wrote on pg.200 of his book &#8220;al-Hur-ul-`In&#8221; regarding the Qat`i Shia sect:<\/p>\n<p>وقال هشام بن الحكم من القطيعة ومن قال بقوله: هو شيء جسيم، لا طويل ولا عريض، نور من الأنوار، له قدر من الأقدار، مصمت ليس بما فوق ولا متخلل، وهو كالسنبلة والذرة، يتلألأ من كل نواحيه. وقالوا: لا يعقل شيئاً إلا موجوداً أو معدوماً، والموجود عندهم ما كان جسيماً محتملاً للصفات، وما خرج من الصفات، فهو عندهم عدم خارج من الوجود. وقالوا: لم يكن في مكان، ثم أحدث المكان فاستوى بحدث الحركة<\/p>\n<p>وقالت الجوالقة &#8211; منهم هشام بن سالم، وشيطان الطاق، ومن قال بقولهما &#8211; : هو صورة من الصور على صورة الإنسان، إلا أنه نور من الأنوار، ليس له لحم ولا دم، وله حواس؛ قالوا: ولا يعقل عالماً أبداً يدرك علماً، إلا بالحواس، وأحالوا أن يوصف بغير ما تحيط به أوهامهم<\/p>\n<p style=\"text-align: justify;\">[As for the Qat`iyyah, Hisham bin al-Hakam and those of his opinion said: He (i.e god) is a bodily-thing, not long or wide, a light from lights, has a specific volume, he is full (without gap) but not prevaded; like an ear of wheat that shines from all sides. They also argued: There cannot be anything except existent or nonexistent. For them, what exists must have a body and attributes whereas what does not hold attributes is nonexistent and null. They say: He was not situated in a place then he created a place and settled during the event of movement.<\/p>\n<p style=\"text-align: justify;\">As for the Jawaliqah -from them is Hisham bin Salim and Shaytan-ul-Taq and their followers- they said: He is upon the image of a human, except he is a type of light, having no flesh or blood but he has senses. They said: A knower cannot know without the senses. They said it is impossible for him to be described except by what they imagined him.]<\/p>\n<p style=\"text-align: justify;\">As we can see from the above reports, anthropomorphism was adopted by the heads of the Shia sect in the early days and was wide spread among the followers. In fact Qum was the stronghold of Imami Shia in its time and they were all believers in Tashbeeh and Tajseem.<\/p>\n<p style=\"text-align: justify;\">Shia leader al-Shareef al-Murtada says in &#8220;Rasa&#8217;il al-Murtada&#8221;:<\/p>\n<p style=\"text-align: justify;\">إنّ أعظم الفقه وجمهوره، بل جميعه، لا يخلو سنده ممّن يذهب مذهب الواقفة وإلى غلاة وخطّابية وإلى قمّيٍّ مشبّه مجبّر، وإنّ القمّيين كلّهم أجمعين، من غير استثناء لاَحـد منهـم ـ إلاّ أبا جعفر بن بابويه رحمه الله ـ بالاَمس كانوا مشبّهة مجبّرة، وكتبهم وتصانيفهم تشهد بذلك<\/p>\n<p style=\"text-align: justify;\">[The greatest amount of (Shia) Fiqh, rather all of it, reaches us through chains containing a Waqifi, a Ghaali (extremist), a Khattabi or a Qummi who believes in Jabr and Tashbeeh. The Qummies, all of them -with the exception of Ibn Babuwayh &#8211; until just yesterday were all Mushabbihah and Mujabbirah, their books and works are a testimony to this.]<\/p>\n<p>He also accuses a large group of Shia leaders and companions of the Imams of Tajseem in his &#8220;Rasa&#8217;il&#8221;:<\/p>\n<p>وقال هشام بن الحكم، وعلي بن منصور، وعلي بن إسماعيل بن ميثم، ويونس بن عبد الرحمن مولى آل يقطين، وابن سالم الجواليقي، والحشوية و جمَاعة المشبهة: إن الله عز و جلَ في مكان دون مكان، وأنه يتحرك وينتقل، تعالى الله عن ذلك<\/p>\n<p>[Hisham bin al-Hakam, `Ali bin Mansur, `Ali bin Isma`il bin Maytham, Yunus bin `Abdul-Rahman Mawla Aal-Yaqtin, Ibn Salim al-Jawaliqi as well as the Hashwiyyah, all these Mushabbihah (anthropomorphists) say: &#8220;God is in one location then in another, He moves around with motion.&#8221; Exalted be God above this.]<\/p>\n<p style=\"text-align: justify;\">After learning all of this, one ponder as to when did the Imami Shia reject such beliefs and move to the other side of the spectrum? Ibn Taymiyyah answers this in &#8220;Minhaj-ul-Sunnah&#8221;:<\/p>\n<p style=\"text-align: justify;\">[Towards the end of the third century, some of the Shia began to embrace the opinions of the Mu`tazilah such as Ibn al-Nawbakhti the author of &#8220;Al-Araa&#8217; wal-Diyanaat&#8221; and his likes, then after them came al-Mufid bin al-Nu`man and his followers. This is why you will find that the authors who wrote about the beliefs of sects did not mention that the Shia agreed with the Mu`tazilah about Tawheed and `Adl except when talking about the late Shia, as for their early predecessors they were only known for Tajseem.]<\/p>\n<p style=\"text-align: justify;\">Shia leader al-Shareef al-Murtada himself found this problematic so he had to ask his teacher al-Mufid about it as he wrote in &#8220;al-Hikayat&#8221;:<\/p>\n<p style=\"text-align: justify;\">فإني لا أزال أسمع المعتزلة يدعون على أسلافنا : أنهم كانوا &#8211; كلهم &#8211; مشبهة . وأسمع المشبهة من العامة يقولون مثل ذلك . وأرى جماعة من أصحاب الحديث من الإمامية يطابقونهم على هذه الحكاية ، ويقولون : إن نفي التشبيه إنما أخذناه من المعتزلة ! فأحب أن تروي لي حديثا يبطل ذلك<\/p>\n<p style=\"text-align: justify;\">[I (al-Murtada) keep hearing the Mu`tazilah claim that our (Shia) predecessors were all upon Tashbeeh. I also hear the same from al-`Aamah (Sunnies) who are Mushabbihah. Then I see a group from the Imami scholars of Hadith agreeing with them about this story and saying: &#8220;We (Shia) have taken the rejection of Tashbeeh from the Mu`tazillah.&#8221; I would love if you refute this for me.]<\/p>\n<p style=\"text-align: justify;\">The last thing to address, is that some modern day Shia think their books do not contain any narrations that imply anthropomorphism if taken literally, so we list a few examples beginning with al-Kafi 2\/200:<\/p>\n<p style=\"text-align: justify;\">عَنْهُ عَنْ أَحْمَدَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَطْعَمَ ثَلَاثَةَ نَفَرٍ مِنَ الْمُسْلِمِينَ أَطْعَمَهُ اللَّهُ مِنْ ثَلَاثِ جِنَانٍ فِي مَلَكُوتِ السَّمَاوَاتِ الْفِرْدَوْسِ وَ جَنَّةِ عَدْنٍ وَ طُوبَى [وَ] شَجَرَةٍ تَخْرُجُ مِنْ جَنَّةِ عَدْنٍ غَرَسَهَا رَبُّنَا بِيَدِهِ<\/p>\n<p style=\"text-align: justify;\">[From him again, from Ahmad from Safwan bin Yahya, from abi Hamzah, from abi Ja`far (as), he said: The messenger (saw) said: Whoever feeds three from the Muslims (as charity), Allah will feed him from three gardens from the kingdom of heaven, al-Firdaws, `Adan and Toubah is a tree in `Adan which our Lord has planted with His hand.]<\/p>\n<p style=\"text-align: justify;\">It is also narrated with these chains:<\/p>\n<p style=\"text-align: justify;\">مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَبْدِ الْقَهَّارِ عَنْ جَابِرٍ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ<br \/>\nعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبِي الْمَغْرَاءِ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Yahya, from Muhammad bin al-Husayn, from Musa bin Sa`dan, from `Abdullah bin al-Qasim, from `Abdul-Qahhar, from Jabir al-Ju`fi, from abu Ja`far (as)&#8230;]<\/p>\n<p style=\"text-align: justify;\">[Some of our companions, from Ahmad bin Muhammad bin `Isa, from al-Husayn bin Sa`id, from Fadalah bin Ayyub, from abi al-Maghra&#8217;, from Muhammad bin Muslim, from Abban bin Taghlib: I heard aba `Abdillah (as) say&#8230;]<\/p>\n<p style=\"text-align: justify;\">Or in 3\/256:<\/p>\n<p style=\"text-align: justify;\">مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبِي الْمَغْرَاءِ قَالَ حَدَّثَنِي يَعْقُوبُ الْأَحْمَرُ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) نُعَزِّيهِ بِإِسْمَاعِيلَ فَتَرَحَّمَ عَلَيْهِ ثُمَّ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ نَعَى إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) نَفْسَهُ إلى أن قال: ثُمَّ يَأْخُذُ الْأَرْضَ بِيَمِينِهِ وَ السَّمَاوَاتِ بِيَمِينِهِ وَ يَقُولُ أَيْنَ الَّذِينَ كَانُوا يَدْعُونَ مَعِي شَرِيكاً أَيْنَ الَّذِينَ كَانُوا يَجْعَلُونَ مَعِي إِلَهاً آخَرَ<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Yahya, from Ahmad bin Muhammad bin `Isa, from al-Husayn bin Sa`id, from Fadalah bin Ayyub, from abi al-Maghra&#8217;, he said: Ya`qoub al-Ahmar told me: We entered upon abi `Abdillah (as) to console him about the passing of his son Isma`il (&#8230;until the Imam said about Allah&#8230;) Then He (i.e Allah) grabs the earth with His right hand and the heavens with His right hand and says: &#8220;Where are those who associated partners with Me? Those who took beside another god?&#8221;]<\/p>\n<p style=\"text-align: justify;\">Or 1\/126 of al-Kafi:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ ( عليه السلام ) جَعَلَنِيَ اللَّهُ فِدَاكَ يَا سَيِّدِي قَدْ رُوِيَ لَنَا أَنَّ اللَّهَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ عَلَى الْعَرْشِ اسْتَوَى وَ أَنَّهُ يَنْزِلُ كُلَّ لَيْلَةٍ فِي النِّصْفِ الْأَخِيرِ مِنَ اللَّيْلِ إِلَى السَّمَاءِ الدُّنْيَا وَ رُوِيَ أَنَّهُ يَنْزِلُ عَشِيَّةَ عَرَفَةَ ثُمَّ يَرْجِعُ إِلَى مَوْضِعِهِ فَقَالَ بَعْضُ مَوَالِيكَ فِي ذَلِكَ إِذَا كَانَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ فَقَدْ يُلَاقِيهِ الْهَوَاءُ وَ يَتَكَنَّفُ عَلَيْهِ وَ الْهَوَاءُ جِسْمٌ رَقِيقٌ يَتَكَنَّفُ عَلَى كُلِّ شَيْ‏ءٍ بِقَدْرِهِ فَكَيْفَ يَتَكَنَّفُ عَلَيْهِ جَلَّ ثَنَاؤُهُ عَلَى هَذَا الْمِثَالِ فَوَقَّعَ ( عليه السلام ) عِلْمُ ذَلِكَ عِنْدَهُ وَ هُوَ الْمُقَدِّرُ لَهُ بِمَا هُوَ أَحْسَنُ تَقْدِيراً وَ اعْلَمْ أَنَّهُ إِذَا كَانَ فِي السَّمَاءِ الدُّنْيَا فَهُوَ كَمَا هُوَ عَلَى الْعَرْشِ وَ الْأَشْيَاءُ كُلُّهَا لَهُ سَوَاءٌ عِلْماً وَ قُدْرَةً وَ مُلْكاً وَ إِحَاطَةً .<br \/>\nوَعَنْهُ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى مِثْلَهُ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Muhammad, from Sahl bin Ziyad, from Muhammad bin `Isa, he said: I wrote to abi al-Hasan `Ali bin Muhammad (as): May Allah take my soul in your service, O my master, it is narrated to us that Allah is in one place and not in another place on the Throne resting. He comes down to the sky above the earth every night during the last half of the night. It is narrated that He comes down at the ninth evening of the month of Dhul-Hijjah and then He returns back to His place. Certain individuals among your servants have said that if He would be found in certain places and not in other places the air must have come in contact with Him and would surround Him because air is a thin form of body that surrounds everything proportionate to its size. How then the air would surround Allah, the Most Holy and the Most High, According to this assumption? The Imam (as) replied in writing: &#8220;He has the knowledge of this. He is the best One in determining all things. You must, However, note that His being in the sky over the earth is just as Him being on the Throne. All things to Him are the same in the matters of His knowledge and power, domination and control.&#8221;<br \/>\nAlso narrated from him, from Muhammad bin Ja`far al-Koufi, from Muhammad bin `Isa like it.]<\/p>\n<p style=\"text-align: justify;\">This narration is important as we see the Imam accepting the text of the narration as it is and saying &#8220;Allah knows best how this takes place.&#8221; This was affirmed by the commentators of al-Kafi.<\/p>\n<p style=\"text-align: justify;\">`Ali Akbar Ghifari said in his commentary:<\/p>\n<p style=\"text-align: justify;\">قوله (ع): علم ذلك عنده أي علم كيفية نزوله عنده سبحانه وليس عليكم معرفة ذلك<\/p>\n<p style=\"text-align: justify;\">[His (as) saying: &#8220;He has the knowledge of this&#8221; meaning knowledge of how His descent takes place Glory be to Him and you (Shia) are not responsible for knowing how it happens.]<\/p>\n<p style=\"text-align: justify;\">The same was stated by al-Mazindarani, abu al-Hasan al-Sha`rani and Ibn Haydar al-Na&#8217;ini:<\/p>\n<p style=\"text-align: justify;\">فوقع (عليه السلام)) من غير تكذيب المروي بل مع الإشعار بتصديقه (علم ذلك عنده) أي علم ذلك المذكور من الآية والرواية عنده تعالى لأنه من المتشابهات التي لا يستقل بتأويلها عقول البشر<\/p>\n<p style=\"text-align: justify;\">قوله: «علم ذلك عنده» ظاهره تصديق المنقول وأنه تعالى ينزل وأن الهواء يتكنف أي يحيط به لكن لا يعلم كيفية إحاطته به ومقدار ما يشغل الفضاء إلا هو<\/p>\n<p style=\"text-align: justify;\">قوله: (علم ذلك عنده) أي علم كيفية نزوله بعدما لم يكن عنده سبحانه، وليس عليكم معرفة ذلك<\/p>\n<p style=\"text-align: justify;\">Al-Narsi in his Asl on pg 54:<\/p>\n<p style=\"text-align: justify;\">زيد عن عبد الله بن سنان قال سمعت أبا عبد الله ع يقول إن الله ينزل في يوم عرفة في أول الزوال إلى الأرض على جمل أفرق يصال بفخذيه أهل عرفات يمينا وشمالا ولا يزال كذلك حتى إذا كان عند المغرب ونفر الناس وكل الله ملكين بجبال المازمين يناديان عند المضيق الذي رأيت يا رب سلم سلم والرب يصعد إلى السماء ويقول جل جلاله امين امين يا رب العالمين فلذلك لا تكاد ترى صريعا ولا كسيرا<\/p>\n<p style=\"text-align: justify;\">[Zayd from `Abdullah bin Sinan, he said: I heard aba `Abdillah (as) saying: On the day of `Arafah, Allah descends at the time of noon on top of a camel with split hair which divides the people of `Arafat as it dashes between them left and right. (&#8230;until he says&#8230;) And the Lord may he be glorified ascends to the sky saying&#8230;]<\/p>\n<p style=\"text-align: justify;\">Or al-Kafi 4\/28:<\/p>\n<p style=\"text-align: justify;\">عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَجِيزُوا لِأَهْلِ الْمَعْرُوفِ عَثَرَاتِهِمْ وَ اغْفِرُوهَا لَهُمْ فَإِنَّ كَفَّ اللَّهِ تَعَالَى عَلَيْهِمْ هَكَذَا وَ أَوْمَأَ بِيَدِهِ كَأَنَّهُ يُظِلُّ بِهَا شَيْئاً<\/p>\n<p style=\"text-align: justify;\">[Some of our companions, from Ahmad bin Muhammad bin Khalid, from Isma`il bin Mihran, from Sayf bin `Umayrah, from abi `Abdillah (as), he said: Forgive the people of goodness their mistakes and shortcomings for Allah&#8217;s palm is over them like such&#8221; And he gestured with his hand as if shading something.]<\/p>\n<p style=\"text-align: justify;\">Or 2\/7:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ أَنَّ رَجُلًا سَأَلَ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ جَلَّ وَ عَزَّ وَ إِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَ أَشْهَدَهُمْ عَلى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى إِلَى آخِرِ الْآيَةِ فَقَالَ وَ أَبُوهُ يَسْمَعُ ( عليه السلام ) حَدَّثَنِي أَبِي أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَبَضَ قَبْضَةً مِنْ تُرَابِ التُّرْبَةِ الَّتِي خَلَقَ مِنْهَا آدَمَ ( عليه السلام ) فَصَبَّ عَلَيْهَا الْمَاءَ الْعَذْبَ الْفُرَاتَ ثُمَّ تَرَكَهَا أَرْبَعِينَ صَبَاحاً ثُمَّ صَبَّ عَلَيْهَا الْمَاءَ الْمَالِحَ الْأُجَاجَ فَتَرَكَهَا أَرْبَعِينَ صَبَاحاً فَلَمَّا اخْتَمَرَتِ الطِّينَةُ أَخَذَهَا فَعَرَكَهَا عَرْكاً شَدِيداً فَخَرَجُوا كَالذَّرِّ مِنْ يَمِينِهِ وَ شِمَالِهِ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim, from his father, from ibn abi `Umayr, from Ibn Udhaynah, from Zurarah, that a man asked aba Ja`far (as) about the verse And [mention] when your Lord took from the children of Adam &#8211; from their loins &#8211; their descendants and made them testify of themselves, [saying to them], &#8220;Am I not your Lord?&#8221; They said, &#8220;Yes, we have testified.&#8221;} He (as) said in front of his father: My father told me that Allah took a fist full of dust from which He created Adam (as), then poured pure water (etc&#8230;) then He rubbed it thoroughly until they emerged like atoms from His right and left]<\/p>\n<p style=\"text-align: justify;\">Or 2\/172:<\/p>\n<p style=\"text-align: justify;\">عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ عِيسَى بْنِ أَبِي مَنْصُورٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَا وَ ابْنُ أَبِي يَعْفُورٍ وَ عَبْدُ اللَّهِ بْنُ طَلْحَةَ فَقَالَ ابْتِدَاءً مِنْهُ يَا ابْنَ أَبِي يَعْفُورٍ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سِتُّ خِصَالٍ مَنْ كُنَّ فِيهِ كَانَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ وَ عَنْ يَمِينِ اللَّهِ فَقَالَ ابْنُ أَبِي يَعْفُورٍ وَ مَا لَهُمْ لَا يَرَوْنَ وَ هُمْ عَنْ يَمِينِ اللَّهِ فَقَالَ يَا ابْنَ أَبِي يَعْفُورٍ إِنَّهُمْ مَحْجُوبُونَ بِنُورِ اللَّهِ أَ مَا بَلَغَكَ الْحَدِيثُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ إِنَّ لِلَّهِ خَلْقاً عَنْ يَمِينِ الْعَرْشِ بَيْنَ يَدَيِ اللَّهِ وَ عَنْ يَمِينِ اللَّهِ وُجُوهُهُمْ أَبْيَضُ مِنَ الثَّلْجِ وَ أَضْوَأُ مِنَ الشَّمْسِ الضَّاحِيَةِ يَسْأَلُ السَّائِلُ مَا هَؤُلَاءِ فَيُقَالُ هَؤُلَاءِ الَّذِينَ تَحَابُّوا فِي جَلَالِ اللَّهِ<\/p>\n<p style=\"text-align: justify;\">[Some of our companions, from Ahmad bin Muhammad bin Khalid, from his father, from Fadalah bin Ayyub, from `Umar bin Abban, from `Isa bin abi Mansour, he said: I was with abu `Abdillah (as) along with ibn abi Ya`four and `Abdullah bin Talhah. He (as) initiated ibn abi Ya`four by saying: Six traits, if one were to possess them then he&#8217;d be in Front of Allah most glorious and on the Right of Allah.&#8221; Ibn abi Ya`four said: &#8220;How can they not be seen if they&#8217;re on Allah&#8217;s right?&#8221; He (as) replied: &#8220;They are concealed by Allah&#8217;s light. Have you not heard the Hadith of the messenger (saw) where he says: Allah has creatures to the right of His throne in Front of Allah and on the Right side of Allah, their faces are white like snow etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Or 2\/126:<\/p>\n<p style=\"text-align: justify;\">عنه عن محمد بن علي عن عمر بن جبلة الأحمسي عن أبي الجارود عن أبي جعفر ع قال : قال رسول الله (صلى الله عليه وآله) : المتحابون في الله يوم القيامة على أرض زبرجدة خضراء في ظل عرشه عن يمينه &#8211; وكلتا يديه يمين &#8211; وجوههم أشد بياضا وأضوء من الشمس الطالعة يغبطهم بمنزلتهم كل ملك مقرب وكل نبي مرسل يقول الناس : من هؤلاء ؟ فيقال : هؤلاء المتحابون في الله<\/p>\n<p style=\"text-align: justify;\">[From him, from Muhammad bin `Ali, from `Umar bin Jabalah al-Ahmasi, from abi al-Jaroud, from abi Ja`far (as): The messenger (saw) said: On the day of judgement, those who love each-other for the sake of Allah will stand on a floor of green aquamarine in the shade of His throne, to His right -and both His Hands are right- their faces lighter and more radiant than the sun&#8230;]<\/p>\n<p style=\"text-align: justify;\">Same is in Qurb al-Isnad by al-Himyari:<\/p>\n<p style=\"text-align: justify;\">حدثني السندي بن محمد عن صفوان بن مهران الجمال عن أبي عبد الله ع قال : &#8221; قال رسول الله صلى الله عليه وآله : عن يمين الله &#8211; وكلتا يديه يمين &#8211; عن يمين العرش قوم على وجوههم نور لباسهم من نور على كراسي من نور فقال له علي : يا رسول الله من هؤلاء ؟ فقال له : شيعتنا وأنت إمامهم &#8220;<\/p>\n<p style=\"text-align: justify;\">[I was told by al-Sindi bin Muhammad, from Safwan bin Mihran al-Jammal, from abi `Abdillah (as): The messenger (saw) said: On Allah&#8217;s right -and both His hands are right- and on the right of the throne will be people, dressed in light&#8230;]<\/p>\n<p style=\"text-align: justify;\">The first Majlisi in al-Rawdah 13\/25:<\/p>\n<p style=\"text-align: justify;\">روى المصنف في الصحيح و علي بن إبراهيم في الحسن كالصحيح، عن جابر عن أبي جعفر عليه السلام قال: قال أمير المؤمنين عليه السلام إن الله تبارك و تعالى (لما أحب) أن يخلق خلقا بيده إلى أن قال فاغترف ربنا عز و جل غرفة بيمينه من الماء العذب الفرات و كلتا يديه يمين فصلصلها في كفه فجمدت<\/p>\n<p style=\"text-align: justify;\">[The author narrated in the Sahih and `Ali bin Ibrahim in al-Hasan kal-Sahih, from Jabir, from abi Ja`far (as), he said: The chief of believers (as) said: When Allah most high liked to create a creation with his hand (&#8230;etc&#8230;) so our Lord scooped up with His right hand some pure water from Euphrates and both of His hands are right, He left it to dry in His hand until it became solid]<\/p>\n<p style=\"text-align: justify;\">Also in al-Mahaasin 1\/280:<\/p>\n<p style=\"text-align: justify;\">أحمد بن أبي عبد الله البرقي عن النضر بن سويد، عن يحيى بن عمران الحلبي، عن معلى أبي عثمان، عن علي بن حنظلة، عن أبي عبد الله (ع) قال: اختصم رجلان بالمدينة، قدري ورجل من أهل مكة فجعلا أبا عبد الله (ع) بينهما إلى أن قال: كتاب كتبه الله بيمينه، وكلتا يديه يمين، فيه أسماء أهل الجنة بأسمائهم وأسماء آبائهم وعشائرهم، مجمل عليهم لا يزيد فيهم رجلا ولا ينقص منهم أحدا أبدا، وكتاب كتبه الله، فيه أسماء أهل النار<\/p>\n<p style=\"text-align: justify;\">[Al-Barqi, from al-Nadir bin Suwayd, from Yahya bin `Imran al-Halabi, from Mu`alla bin abi `Uthman, from `Ali bin Handhalah, from abi `Abdillah (as): Two men disputed in Madinah, a Qadari and a man from Makkah so they made aba `Abdillah (as) the judge. (&#8230;until he said&#8230;) A book that Allah has written with His right and both His hands are right, containing the names of the dwellers of heaven (etc&#8230;)]<\/p>\n<p style=\"text-align: justify;\">Also in Tahdheeb al-Ahkaam 3\/3 #3, Majlisi graded &#8220;Sahih&#8221; in Malaadh-ul-Akhiyar 4\/636:<\/p>\n<p style=\"text-align: justify;\">وعنه عن محمد بن يحيى عن عبد الله بن محمد عن علي بن الحكم عن أبان عن أبي عبد الله عليه السلام قال: إن للجمعة حقا وحرمة فإياك أن تضيع أو تقصر في شئ من عبادة الله تعالى، والتقرب إليه بالعمل الصالح، وترك المحارم كلها، فان الله يضاعف فيه الحسنات، ويمحو فيه السيئات، ويرفع فيه الدرجات قال: وذكر أن يومه مثل ليلته، قال: فان استطعت أن تحييه بالصلاة والدعاء فافعل فان ربك ينزل من أول ليلة الجمعة إلى سماء الدنيا فيضاعف فيه الحسنات ويمحو فيه السيئات فان الله واسع كريم.<\/p>\n<p style=\"text-align: justify;\">[From him, from Muhammad bin Yahya, from `Abdullah bin Muhammad, from `Ali bin al-Hakam, from Abban, from abi `Abdillah (as), he said: Friday has its sanctity and right, do not waste a thing from Allah&#8217;s worship (etc&#8230;) If you are able to spend (that day) in prayer and supplication then do so because your Lord descends in the beginning of every Friday evening to the worldly sky to increase the rewards (etc&#8230;)]<\/p>\n<p style=\"text-align: justify;\">Two narrations from Kitab-ul-Tawheed by Saduq pg.154-155:<\/p>\n<p style=\"text-align: justify;\">3-<br \/>\nحدثنا محمد بن الحسن بن أحمد بن الوليد رحمه الله قال حدثنا محمد بن ‏الحسن الصفار عن أحمد بن محمد بن عيسى عن أحمد بن محمد بن أبي نصر عن الحسين ‏بن موسى عن عبيد بن زرارة عن أبي عبد الله ع قال سألته عن قول الله عز و ‏جل يَوْمَ يُكْشَفُ عَنْ ساقٍ قال كشف إزاره عن ساقه و يده الأخرى على رأسه فقال ‏سبحان ربي الأعلى‏<\/p>\n<p style=\"text-align: justify;\">[I was told by Muhammad bin al-Hasan bin Ahmad bin al-Walid (rah), we were told by Muhammad bin al-Hasan al-Saffar, from Ahmad bin Muhammad bin `Isa, from Ahmad bin Muhammad bin abi Nasr, from al-Husayn bin Musa, from `Ubayd bin Zurarah, from abi `Abdillah (as): I asked him about Allah&#8217;s words {Upon the day when the leg shall be bared, and they shall be summoned to bow themselves} He (as) lifted his lower garment and exposed his leg while his hand was on his head, then he said: &#8220;Praise be to the Lord most high.&#8221;]<\/p>\n<p style=\"text-align: justify;\">2-<br \/>\nأبي رحمه الله قال حدثنا سعد بن عبد الله عن إبراهيم بن هاشم عن ابن ‏فضال عن أبي جميلة عن محمد بن علي الحلبي عن أبي عبد الله ع في قوله عز و جل ‏يَوْمَ يُكْشَفُ عَنْ ساقٍ قال تبارك الجبار ثم أشار إلى ساقه فكشف عنها الإزار قال ‏و يدعون إلى السجود فلا يستطيعون قال أفحم القوم و دخلتهم الهيبة و شخصت ‏الأبصار و بلغت القلوب الحناجر خاشعة أبصارهم ترهقهم ذلة و قد كانوا ‏يدعون إلى السجود و هم سالمون ‏<\/p>\n<p style=\"text-align: justify;\">[My father (rah) told me, Sa`d bin`Abdullah told us, from Ibrahim bin Hashim, from Ibn Faddal, from abi Jamilah, from Muhammad bin `Ali al-Halabi, from abi `Abdillah (as) about His words {Upon the day when the leg shall be bared} He (as) said: &#8220;May The Almighty be glorified.&#8221; then he (as) pointed to his leg and lifted the lower garment exposing it (etc&#8230;)]<\/p>\n<p style=\"text-align: justify;\">Al-`Allamah al-Majlisi in `Ayn-ul-Hayah 1\/368:<\/p>\n<p style=\"text-align: justify;\">وروي بسند معتبر عن أبي جعفر الباقر انّه قال : إذا كان الرجل على يمينك على رأي ثم تحوّل إلى يسارك فلا تقل الاّ خيراً ، ولا تبرأ منه حتى تسمع منه ما سمعت وهو على يمينك ، فإنّ القلوب بين أصبعين من أصابع الله يقلّبها كيف يشاء ساعة كذا وساعة كذا ، وانّ العبد ربما وفّق للخير<\/p>\n<p style=\"text-align: justify;\">[It was narrated with a reliable chain from abi Ja`far al-Baqir (as) that he said: &#8220;If a person to your right had an opinion then he turned to your left, do not say except what is good and do not disown him until you hear from him what you heard when he was on the right; for the hearts are between two fingers from the fingers of Allah, He flips them as He wishes, once like this and once like that, the slave may be successful in attaining goodness.&#8221;]<\/p>\n<p>To our amusement, al-Murtada attempted to defend the position of Hisham bin al-Hakam in al-Shafi 1\/83-84:<\/p>\n<p>فأما ما رمي به هشام بن الحكم رحمه الله بالتجسيم فالظاهر من الحكاية عنه القول بجسم لا كالأجسام. ولا خلاف في أن هذا القول ليس تشبيه ولا ناقض لأصل<\/p>\n<p>[As for the accusation that Hisham bin al-Hakam (rah) was a Mujassim; What&#8217;s apparent from the story is that he believed that God was a body unlike other bodies and there is no difference among us that this statement does not constitute Tashbih nor contradict any foundation.]<\/p>\n<p style=\"text-align: justify;\">And glory be to Allah the One Creator.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>WARNING: This article glances briefly at some dangerous ideas that are too advanced for the regular layperson, please seek the aid of your local qualified scholar to address any doubts. This article is an attempt by this weak slave to write a simple <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/02\/27\/tashbeeh\/\" title=\"Tashbeeh &#038; Tajseem in Shia texts\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-2915","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2915","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2915"}],"version-history":[{"count":15,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2915\/revisions"}],"predecessor-version":[{"id":4360,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2915\/revisions\/4360"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2915"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2915"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2915"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}