{"id":2918,"date":"2015-12-21T20:34:55","date_gmt":"2015-12-21T20:34:55","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2918"},"modified":"2015-12-21T20:34:55","modified_gmt":"2015-12-21T20:34:55","slug":"al-radi-distorting-nahj-ul-balaghah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2015\/12\/21\/al-radi-distorting-nahj-ul-balaghah\/","title":{"rendered":"Distortion of Sermon 227 of Nahj-ul-Balaghah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2918\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In this topic we will discuss the crime of the authors of Nahj-ul-Balaghah, al-Sharif al-Radi and his brother al-Murtada.<\/p>\n<p style=\"text-align: justify;\">In the Nahj we have many sermons and sayings attributed `Ali ibn abi Talib, most of these are fabricated according to the expert scholars and traditionalists. The Shia however, view this book as purely authentic and see it as the greatest book after Allah&#8217;s book.<\/p>\n<p style=\"text-align: justify;\">The issue the Shia had to face was the strong criticism of Ahlul-Sunnah, they said to them: These sermons and sayings which you attribute to `Ali, where did you get them from? Nahj-ul-Balaghah is a very late book with no chains of transmission  (Isnad), how did al-Radi even get these? We cannot find the vast majority of these in the main Sunni and Shia books!<\/p>\n<p style=\"text-align: justify;\">In response, Shia scholars tried desperately to find other sources that mentioned these sermons in order to defend their holy book. They failed miserably for the most part and this topic will show you that not only did they fail but it resulted in some big scandals such as the one regarding Sermon 227.<\/p>\n<p style=\"text-align: justify;\">If we open the popular copy of Nahj-ul-Balaghah to sermon 227, we read the following title:<\/p>\n<p style=\"text-align: justify;\">&#8220;About a companion who passed away from this world before the occurrence of troubles.&#8221;<\/p>\n<p style=\"text-align: justify;\">`Ali says:<\/p>\n<p style=\"text-align: justify;\">لله بلادُ فُلاَن، فَلَقَدْ قَوَّمَ الاْوَدَ، وَدَاوَى الْعَمَدَ، وَأَقَامَ السُّنَّةَ، وَخَلَّفَ الْفِتْنَةَ! ذَهَبَ نَقِيَّ الثَّوْبِ، قَلِيلَ الْعَيْبِ، أَصَابَ خَيْرَهَا، وَسَبَقَ شَرَّهَا، أَدَّى إِلَى اللهِ طَاعَتَهُ، وَاتَّقَاهُ بِحَقِّهِ، رَحَلَ وَتَرَكَهُمْ فِي طُرُق مَتَشَعِّبَة، لاَ يَهْتَدِي بِهَا الضَّالُّ، وَلاَ يَسْتَيْقِنُ الْمُهْتَدِي.<\/p>\n<p style=\"text-align: justify;\">[May Allah reward such and such man, he straightened the curve, cured the disease, abandoned mischief, and established the Sunnah. He departed (from this world) with untarnished clothes and little shortcomings. He achieved the goodness (of this world) and remained safe from its evils. He offered Allah’s obedience and feared Him as He deserved. He went away and left the people in dividing ways wherein the misled cannot obtain guidance and the guided cannot attain certainty.]<\/p>\n<p style=\"text-align: justify;\">Magnificent, but this leaves one question&#8230; WHO IS THIS MAN?<\/p>\n<p style=\"text-align: justify;\">Judging from `Ali&#8217;s words this is a great man who affected many people&#8217;s lives or so it seems, a man whom people sought guidance from, a man who left a big gap after his passing. Surely it cannot be just any random unknown &#8220;companion&#8221; who died now could it? Rarely have we ever seen `Ali attribute such major praise to anyone so he definitely cannot be an unknown personality.<\/p>\n<p style=\"text-align: justify;\">If we refer to the oldest and most popular commentary on Nahj-ul-Balaghah, written by the Mu`tazili Shia Ibn abi al-Hadid [died. 656 AH].<\/p>\n<p style=\"text-align: justify;\">Ibn abi al-Hadid says in Sharh Nahj-ul-Balaghah 12\/3: &#8220;The one meant here is `Umar bin al-Khattab, I have found the original copy of Nahjul Balagha in abi al-Hasan al-Radi’s own handwriting and he wrote “`Umar” under the word “such and such”.&#8221;<\/p>\n<p style=\"text-align: justify;\">He also writes: &#8220;I asked the head of the order of Ahlul-Bayt, abu Ja`far Yahya bin abi Zayd al-`Alawi (about this matter) and he said: “`Umar bin al-Khattab”, I told him: “Would the chief of believers praise him this much!?” He replied: “Yes.”&#8221;<\/p>\n<p style=\"text-align: justify;\">Furthermore, he said in 2\/4: &#8220;If the chief of believers admitted that he departed with untarnished clothes and that he obeyed Allah and feared him, then this is the utmost praise.&#8221;<\/p>\n<p style=\"text-align: justify;\">I say: This is shocking, Ibn abi al-Hadid is known for his Shia leanings, yet he&#8217;s saying al-Radi wrote &#8220;`Umar&#8221; with his own handwriting under the words &#8220;such and such&#8221;. Ibn abi al-Hadid himself was surprised that he had to ask the &#8220;Naqib&#8221; or the head of the order of prophetic-household in his time who confirmed that `Ali was praising Ibn al-Khattab.<\/p>\n<p style=\"text-align: justify;\">Before we further investigate this, we wonder why would al-Radi write his name in that fashion? It seems as though there was a conflict, it is possible that al-Radi was initially pressured to remove the name by the extremist Shia who could never accept this fact. It could also be that his corrupt brother al-Murtada, a deviant Rafidi, he could have been behind the removal of the name. Al-Radi being the more noble of the two, his consciousness did not allow him to participate in that charade.<\/p>\n<p style=\"text-align: justify;\">Why did we accuse al-Murtada of this instead of al-Radi? Other than the fact that whoever read al-Murtada&#8217;s book knows for a fact how much of a deceitful Rafidi he is and how sly and stubborn he is when it comes to supporting his false beliefs, we will list this short story from the book &#8220;Sharh Nahj-ul-Balaghah&#8221; by Ibn abi al-Hadid 1\/24:<\/p>\n<p style=\"text-align: justify;\">[I read in the handwriting of Muhammad bin Idris al-Hilli, the Imami jurist, he said: It was narrated by abu Hamid Ahmad bin Muhammad al-Isfarayini, the Shafi`i jurist, he said: One day I was with Fakhr-ul-Malik abi Ghalib Muhammad bin Khalaf, the minister of Baha&#8217;-ul-Dawlah and his son Sultan-ul-Dawlah when abu al-Hasan al-Radi entered upon him. So he (i.e. the minister) venerated him, he praised him and left whatever was in his hands in order to speak with him until he (i.e. al-Radi) had to leave. After that, abu al-Qasim al-Murtada entered upon him but the minister did not show much respect nor did he honor him, instead he busied himself with whatever was in his hands from paper-work. Al-Murtada sat for a short while, he asked for some favors which the minister fulfilled then left, so I (i.e. abu Hamid) said: &#8220;May Allah forgive you O minister! This was al-Murtada, he is the outspoken jurist who is learned in several fields, he is the best of the two! Abu al-Hasan al-Radi is only a poet.&#8221; He replied to me: &#8220;When this Majlis ends and the people leave I shall answer you.&#8221;<\/p>\n<p style=\"text-align: justify;\">(Abu Hamid mentions that he remained until people left and only the guards and servants remained, then they left after he had his feast)<\/p>\n<p style=\"text-align: justify;\">The minister told the servant: &#8220;Bring me the two letters I handed you earlier&#8221; He brought them and told me: &#8220;This is a letter from al-Radi, he wrote it to me, telling me that his son was born. I sent him a thousand Dinars and said: This is to pay for the midwife, as the habit is between friends in these times. However, al-Radi returned my gift and wrote me this letter.&#8221; I opened the letter and read his (short) apology for not accepting the gift: &#8220;We the household do not permit a strange midwife to intrude in our affairs, our old women take care of it without charging a fee or taking a gift.&#8221; The minister said: &#8220;That&#8217;s that. As for al-Murtada, we had charged some tax over the properties in Badouriya so that we may spend it on digging an opening for the river known as Nahr-`Isa, this tax has included one of al-Sharif al-Murtada&#8217;s properties in al-Dahiriyyah with the amount of twenty Dirhams for the price of one Dinar. Al-Murtada wrote to me several days ago about this, please read his letter.&#8221; So I read his letter and it was one hundred lines long! Within it he speaks of his loyalty and servitude to the minister and tries to acquire his sympathy and win his heart so that his property may be exempt from those few Dirhams that were imposed on it.<\/p>\n<p style=\"text-align: justify;\">Fakhr-ul-Malik said: &#8220;Now, which of the two brothers do you see more worthy of honor and praise? This outspoken jurist and unique scholar with such (a horrible) character, or that other one who is only popular for his poetry but possesses such (a noble) character!?&#8221; I said: &#8220;May Allah grant our master the minister more success!&#8221;]<\/p>\n<p style=\"text-align: justify;\">The story basically shows how miserly and greedy al-Murtada is and how he tried with a long pathetic letter to weasel his way out of paying his dues like everyone else, this dishonesty and corrupt attitude is reflected in most of his writings believe it or not so one cannot but suspect that he was behind the removal of `Umar&#8217;s name as opposed to his brother who couldn&#8217;t do it.<\/p>\n<p style=\"text-align: justify;\">Returning to our previous topic, al-Radi [died. 406 AH] can&#8217;t have traveled back in time to hear this, he must have quoted this sermon from past books, so we dug for the sources of this sermon in past books. Shia scholars wrote in the sources of this sermon that it is found in Tarikh-ul-Tabari, written by Ibn Jarir al-Tabari [died. 310 AH], when we went back to check unlike most Shia who accepted the sermon blindly, we found this.<\/p>\n<p style=\"text-align: justify;\">Tarikh al-Tabari 4\/419:<\/p>\n<p style=\"text-align: justify;\">حدثني عمر قال حدثنا علي قال حدثنا ابن دأب وسعيد بن خالد عن صالح بن كيسان عن المغيرة بن شعبة قال لما مات عمر رضي الله عنه بكته ابنة أبي حثمة فقالت واعمراه أقام الأود وأبرأ العمد أمات الفتن وأحيا السنن خرج نقي الثوب بريئا من العيب قال وقال المغيرة بن شعبة لما دفن عمر أتيت عليا وأنا أحب أن أسمع منه في عمر شيئا فخرج ينفض رأسه ولحيته وقد اغتسل وهو ملتحف بثوب لا يشك أن الأمر يصير إليه فقال يرحم الله ابن الخطاب لقد صدقت ابنة أبي حثمة لقد ذهب بخيرها ونجا من شرها أما والله ما قالت ولكن قولت<\/p>\n<p style=\"text-align: justify;\">[We were told by `Umar, we were told by `Ali, he said: Ibn Da&#8217;b and Sa`id bin Khalid told me, from Salih bin Kaysan, from al-Mughirah bin Shu`bah, he said: When `Umar died may Allah be pleased with him, the daughter of abu Hathmah cried him saying: &#8220;O `Umar, he straightened the curve, cured the disease, he buried the Fitnah and established the Sunnah. He departed (from this world) with untarnished clothes and little shortcomings.&#8221; Mughirah said: When `Umar was buried I went to `Ali as I liked to hear what he had to say about `Umar, I saw him brushing his hair and beard while being wrapped in a cloth after bathing, he had no doubt that authority would be his, he then said: &#8220;May Allah have mercy upon Ibn al-Khattab, the daughter of abi Hathmah spoke the truth for he achieved the goodness (of this world) and remained safe from its evils. By Allah, she never said it (knowing it) but she was taught it.&#8221;]<\/p>\n<p style=\"text-align: justify;\">We also found it in an even earlier source, Tarikh al-Madinah by Ibn Shubah al-Numayri [died. 262 AH], He writes on 2\/91:<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادِ بْنِ عَبَّادٍ، قال: حَدَّثَنَا غَسَّانُ بْنُ عَبْدِ الْحَمِيدِ، قَالَ: بَلَغَنَا أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكِ بْنِ عُيَيْنَةَ الأَزْدِيَّ حَلِيفَ بَنِي الْمُطَّلِبِ، قَالَ: لَمَّا انْصَرَفْنَا مَعَ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ مِنْ جِنَازَةِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ دَخَلَ فَاغْتَسَلَ، ثُمَّ خَرَجَ إِلَيْنَا فَصَمَتَ سَاعَةً، ثُمَّ قَالَ: &#8221; لِلَّهِ بَلاءُ نَادِبَةِ عُمَرَ لَقَدْ صَدَقَتِ ابْنَةُ أَبِي حَثْمَةَ حِينَ، قَالَتْ: وَاعُمَرَاهُ، أَقَامَ الأَوَدَ وَأَبْدَأَ الْعَهْدَ، وَاعُمَرَاهُ، ذَهَبَ نَقِيَّ الثَّوْبِ، قَلِيلَ الْعَيْبِ، وَاعُمَرَاهُ أَقَامَ السُّنَّةَ وَخَلَّفَ الْفِتْنَةَ &#8220;، ثُمَّ قَالَ: &#8221; وَاللَّهِ مَا دَرَتْ هَذَا وَلَكِنَّهَا قُوِّلَتْهُ وَصَدَقَتْ، وَاللَّهِ لَقَدْ أَصَابَ عُمَرُ خَيْرَهَا وَخَلَّفَ شَرَّهَا، وَلَقَدْ نَظَرَ لَهُ صَاحِبُهُ فَسَارَ عَلَى الطَّرِيقَةِ مَا اسْتَقَامَتْ، وَرَحَلَ الرَّكْبُ، وَتَرَكَهُمْ فِي طُرُقٍ مُتَشَعِّبَةٍ لا يَدْرِي الضَّالُّ وَلا يَسْتَيْقِنُ الْمُهْتَدِي<\/p>\n<p style=\"text-align: justify;\">[We were told by Muhammad bin `Abbad bin `Abbad, he said: Ghassan bin `Abdul-Hamid told us, he said: It has reached us that `Abdullah bin Malik bin `Uyaynah al-Azdi the ally of banu al-Muttalib said: When we left with `Ali may Allah be pleased with him from `Umar&#8217;s funeral, he entered his house and bathed and came out, he remained silent for a while then said: &#8220;May Allah reward the woman who grieved for `Umar&#8217;s passing, the daughter of Abu Hathmah spoke the truth when she said: O `Umar! He straightened the curve and fulfilled the oath. O `Umar! He departed (from this world) with untarnished clothes and little shortcomings. O `Umar! He established the Sunnah and abandoned mischief.&#8221; He then said: &#8220;By Allah, she didn&#8217;t know these matters but she was taught to say them and she spoke the truth. By Allah, he achieved the goodness (of this world) and remained safe from its evils; he had looked at his companion and followed the path wherever it was straight, the rider left them in dividing ways wherein the misled cannot obtain guidance and the guided cannot attain certainty.&#8221;]<\/p>\n<p style=\"text-align: justify;\">May Allah punish the criminals.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In this topic we will discuss the crime of the authors of Nahj-ul-Balaghah, al-Sharif al-Radi and his brother al-Murtada. In the Nahj we have many sermons and sayings attributed `Ali ibn abi Talib, most of these are fabricated according to the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2015\/12\/21\/al-radi-distorting-nahj-ul-balaghah\/\" title=\"Distortion of Sermon 227 of Nahj-ul-Balaghah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-2918","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2918","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2918"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2918\/revisions"}],"predecessor-version":[{"id":2927,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2918\/revisions\/2927"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2918"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2918"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2918"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}