{"id":2937,"date":"2016-01-03T03:48:28","date_gmt":"2016-01-03T03:48:28","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2937"},"modified":"2019-10-14T12:02:46","modified_gmt":"2019-10-14T12:02:46","slug":"ibn-taymiyyah-and-ahlulbayt","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/01\/03\/ibn-taymiyyah-and-ahlulbayt\/","title":{"rendered":"Ibn Taymiyyah and Ahlulbayt"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2937\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Ibn Taymiyyah and Ahlulbayt<\/h1>\n<p style=\"text-align: justify;\">The following article emits light on the view of Ibn Taymiyyah on Ahlulbayt. The article will be split into six sections:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Quotes in praise of Ali<\/li>\n<li>Quotes in praise of Fatima<\/li>\n<li>Quotes in praise of Al-Hasan and Al-Hussain<\/li>\n<li>Refutations of Quotes by Ibn Taymiyyah that Suggest that he Hated Ali<\/li>\n<li>Refutation of a Quote by Ibn Taymiyyah that Suggests that he Hated Fatima<\/li>\n<li>Refutation of a Quote by Ibn Taymiyyah that Suggests that he Hated Al-Hasan and Al-Husain<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The article will not be dealing with foolish objections, like testimonies from opponents of Ibn Taymiyyah that have accused him of being a Nasibi, for his opponents attempted to accuse him of every condemnable trait.<\/p>\n<p style=\"text-align: justify;\">We will also not be discussing Ibn Taymiyyah’s opinions regarding other members of Ahlulbayt, since even the Shias themselves have condemned various members of Ahlulbayt and only restrict Ahlulbayt to the fourteen “infallibles”.<\/p>\n<p style=\"text-align: justify;\">Narrations of merits of Ali that were weakened by Ibn Taymiyyah will also not be given any weight, since Ibn Taymiyyah has also weakened narrations of merits of other Sahaba, and it is a known fact that he is not a Rafithi, so to assume that weakening narrations in merits of Ali makes one a Nasibi is preposterous.<\/p>\n<p style=\"text-align: justify;\">Please note that the first three sections of this article are quoted from Dr. Qarmushi’s <em>Ahlulbayt ind Shaikh Al-Islam Ibn Taymiyyah. <\/em><\/p>\n<p style=\"text-align: justify;\"><em> <\/em><\/p>\n<p style=\"text-align: justify;\"><strong>Quotes in praise of Ali<\/strong><\/p>\n<p style=\"text-align: justify;\">1-“ The first person to have accepted Islam from adult free men is Abu Bakr, from the free children is Ali, from the slaves is Zaid bin Haritha, and from the women is Khadijah the mother of the believers, and this is according to the consensus of scholars.” Majmu’ Al-Fatawa 4\/462<\/p>\n<p style=\"text-align: justify;\">2- “The best of the Awliya’ of Allah from this nation are Abu Bakr, Omar, Uthman, and Ali, and those like them from the <em>sabiqeen al-awaleen<\/em> (early Muslims).” Majmu’ Al-Fatawa 2\/223<\/p>\n<p style=\"text-align: justify;\">3- “Ali is the best from all those that pledged under the tree, except for the three, and anyone that chooses anyone above him other than the three is not from Ahlulsunnah.” Minhaj Al-Sunnah 4\/396<\/p>\n<p style=\"text-align: justify;\">4- “He (Ali) is placed ahead of the people of Badr, Al-Ridhwan, and the earliest of the Muhajireen and Ansar.” Minhaj Al-Sunnah 4\/396<\/p>\n<p style=\"text-align: justify;\">5- “Being married to Fatima is a merit for Ali, while Uthman marrying two of his (the Prophet’s) daughters is a merit for Uthman.” Minhaj Al-Sunnah 4\/36<\/p>\n<p style=\"text-align: justify;\">6- “Omar in the issues of deen, in foundations and branches, would follow what was taught by the Messenger – peace be upon him &#8211; , and he would seek the consultation of Ali, as well as others from the people of consultation.” Majmu Al-Fatawa 20\/313<\/p>\n<p style=\"text-align: justify;\">7- Ibn Taymiyyah mentioned Ali as one of those that Omar has chosen as “the people of consultation”, thus nominating him as a possible caliph. Minhaj Al-Sunnah 8\/420<\/p>\n<p style=\"text-align: justify;\">8- Ibn Taymiyyah mentioned him as the fourth rightly guided caliph, and they are the best of the nation. Majmu Al-Fatawa 11\/129<\/p>\n<p style=\"text-align: justify;\">9- “The waging war against them (the Khawarij) was one of his greatest deeds and it was from his wars that are to be praised, for the Prophet – peace be upon him – promoted warring with them.” Al-Istiqama 1\/259<\/p>\n<p style=\"text-align: justify;\">10- “As for Uthman, Ali, and Al-Husain – may Allah be pleased with them &#8211; , they were killed as oppressed martyrs according to the consensus of Ahlulsunnah.” Al-Masa’il wa Ajwiba p. 71.<\/p>\n<p style=\"text-align: justify;\">11- Ibn Taymiyyah quoted a narration about the battle of Khaibar, that the Messenger of Allah – peace be upon him – said that: I will give the flag to a man tomorrow that will be victorious in his conquest, one who loves Allah and His messenger, and is loved by Allah and His messenger.” Ibn Taymiyyah refers to this as one of the most authentic merits of Ali. He then comments: <strong>This is a testimony by the Prophet – peace be upon him – of Ali’s faith inwardly and outwardly, and proof that he is an ally of Allah and His messenger, and that it is an obligation for believers to be his ally, <span style=\"text-decoration: underline;\">and it is a response to Nasibis that think that he is a <em>kaffir<\/em> <\/span>(disbeliever) and a <em>fasiq<\/em> (a wretched person) like the Khawarij.<\/strong> Minhaj Al-Sunah 5\/44-46<\/p>\n<p style=\"text-align: justify;\">12- Ibn Taymiyyah states that hadith Al-Manzilah is a merit for Ali. Minhaj Al-Sunnah 4\/371<\/p>\n<p style=\"text-align: justify;\">13- Ibn Taymiyyah lists narrations as merits for Ali and states that “there are ten narrations in the Saheeh (excluding other books) about Ali.”<\/p>\n<p style=\"text-align: justify;\"><strong>Quotes in Praise of Fatima<\/strong><\/p>\n<p style=\"text-align: justify;\">1- “The best of Ahlulbayt are Ali, Fatima, Al-Hasan, and Al-Hussain, those that he wrapped around them the cloak and supplicated for them exclusively.” Al-Ikhtiyarat Al-Fiqhiya p. 55<\/p>\n<p style=\"text-align: justify;\">2- “(She is) the most valuable person to him from his family.” Minhaj Al-Sunnah 4\/587<\/p>\n<p style=\"text-align: justify;\">3- “(She is) the most honorable woman.” Iqtidha’ Al-Sirat Al-Mustaqeem 1\/295<\/p>\n<p style=\"text-align: justify;\">4- “(She is) the chief of the women of the worlds.” Jami’ Al-Masa’il 3\/106<\/p>\n<p style=\"text-align: justify;\">5- “(She is) the chief of the women of paraside.” Minhaj Al-Sunnah 8\/245<\/p>\n<p style=\"text-align: justify;\">6- “The best women in this nation are: Khadijah, A’isha, and Fatima.” Majmu’ Al-Fatawa 4\/394<\/p>\n<p style=\"text-align: justify;\"><strong>Quotes in Praise of Al-Hasan and Al-Hussain<\/strong><\/p>\n<p style=\"text-align: justify;\">1- “There is no doubt that Al-Hasan and Al-Hussain are the flowers of the Prophet – peace be upon him – in this world, and that he – peace be upon him – brought them with him into the cloak, and said: ‘O’ Allah, they are my Ahlulbayt, send <em>rijs<\/em> away from them and cleanse them,’ and that he – peace be upon him – brought them with him to <em>mubahala<\/em>, and their merits are many, and they are from the leaders of the believers.” Minhaj Al-Sunnah 4\/41.<\/p>\n<p style=\"text-align: justify;\">2- “They are from the companions that were promised heaven.” Minhaj Al-Sunnah 4\/168<\/p>\n<p style=\"text-align: justify;\">3- “Since Al-Hasan and Al-Hussain were the chiefs of the youth of heaven, yet, were born after the Hijra during times of strength in Islam, and did not face the hardships faced by their predecessors, Allah bestowed upon them hardships to raise their levels.” Majmu Al-Fatawa 27\/473<\/p>\n<p style=\"text-align: justify;\">4- “Al-Hussain was killed as an oppressed martyr and those that killed him were oppressors.” Minhaj Al-Sunnah 5\/585<\/p>\n<p style=\"text-align: justify;\">5- “As for his (Al-Hasan’s) death, then it is said that he was poisoned, and this is a form of martyrdom and a merit to his name, even if he wasn’t killed during a battle.” Minhaj Al-Sunnah 4\/42<\/p>\n<p style=\"text-align: justify;\">6- “Allah brought peace between through Al-Hasan between the people of Iraq and Shaam, and the Prophet – peace be upon him – mentioned this as a merit for Al-Hasan.” Majmu Al-Fatawa 28\/549<\/p>\n<p style=\"text-align: justify;\">7- After narrating a narration in praise of Al-Hasan and Usama bin Zaid, Ibn Taymiyyah commented, “In this narration, he (the Prophet) combined Al-Hasan and Usama – may Allah be pleased with them – by mentioning that he loved them, and by asking Allah to love them, and his love for them is known through multiple authentic hadiths.”<\/p>\n<p style=\"text-align: justify;\"><strong>Refutations of Quotes by Ibn Taymiyyah that Suggest that he Hated Ali<\/strong><\/p>\n<p style=\"text-align: justify;\">Before listing the arguments and refutations we would like readers to be aware that some of Ibn Taymiyyah’s statements come in the form of debate responses. So in response to a criticism to Abu Bakr, he would argue something along the lines of “if this is true about Abu Bakr, then Ali is just as guilty or even more so.” When taken out of context, these allegations are read as, “Ali is guilty of <em>x<\/em>.”<\/p>\n<p style=\"text-align: justify;\">1- Argument: While comparing Abu Bakar with Ali bin Abi Talib (as), Ibn Taimiyah states in Minhaj al-Sunnah, Volume 7 page 331: “His reign is better than Ali’s reign and his benefit to Muslims in their religion and life is greater than Ali’s.”<\/p>\n<p style=\"text-align: justify;\">Response: Preference of Abu Bakr or his reign as a caliph over Ali and his reign does not make Ibn Taymiyyah a Nasibi, but rather, this is the belief of every Sunni.<\/p>\n<p style=\"text-align: justify;\">2- Argument: Minhaj al-Sunnah, Volume 8 page 230: “Ali fought to secure obedience and rule the people and money, so how can that be deemed as fighting for sake of religion?”<\/p>\n<p style=\"text-align: justify;\">Response: The text is taken out of context. The context in full is a refutation to those that say that Abu Bakr fought the apostates for wealth. Ibn Taymiyyah responds that Abu Bakr never took any wealth nor put any of his relatives in power, so it is easier to attribute Ali to such a sin than to attribute Abu Bakr.<\/p>\n<p style=\"text-align: justify;\">3- Argument: We read in Minhaj al-Sunnah, Volume 8 page 205: There are two opinions as to whether Ali’s conversion to Islam released him from kufr or not”<\/p>\n<p style=\"text-align: justify;\">Response: The quote is taken out of context, for Ibn Taymiyyah is refuting the allegation that the caliphs were oppressors since they used to be disbelievers before Islam. In response, Ibn Taymiyyah argues that their conversion to Islam is a greater merit to them than Ali’s conversion since they were adults and conversion is a bigger responsibility and harder for adults. He asks: Do Islamic regulations apply to converts that haven’t hit puberty? He then argues that there is a difference of opinion since Shafi’ees do not believe that Islamic regulations apply until then. He is in no way suggesting that Ali is a non-Muslim. Rather, Ibn Taymiyyah sees Ali’s conversion to Islam as a child as a merit, as seen in the merits section above.<\/p>\n<p style=\"text-align: justify;\">4- Argument: Minhaj al-Sunnah, Volume 4 page 137: “Ali intended to marry so as to hurt her (Fatima) on purpose.”<\/p>\n<p style=\"text-align: justify;\">Response: The quote is taken out of context. Ibn Taymiyyah is refuting the idea that Abu Bakr hurt Fatima. He states that Abu Bakr did not do it intentionally, but it was due to his his <em>ijtihad<\/em> and that he has no personal benefit from hurting her. Ibn Taymiyyah then refers to the incident that is accepted by all Sunnis that Ali wanted to get a second wife, and that this action would hurt Fatima. In other words, he has a purpose, which is to get a second wife, and that purpose would hurt Fatima.<\/p>\n<p style=\"text-align: justify;\">5- Argument: Minhaj al-Sunnah, Volume 7 page 172: “Allah had revealed for Ali {O ye who believe! Draw not near unto prayer when ye are drunken, till ye know that which ye utter,} when he prayed and recited and then got mixed up.”<\/p>\n<p style=\"text-align: justify;\">Response: There is a consensus that this verse was revealed before the prohibition of alcohol. To condemn Ali of drinking alcohol during the time of prohibition is like condemning him for not praying five times a day before the revelation of the mandatory prayers. In other words, Ibn Taymiyyah was not condemning Ali, but rather, refuting Shias that were quoting verses that supposedly condemn Abu Bakr by suggesting that he could also exaggerate verses out of proportion as they did if he had issues with Ali.<\/p>\n<p style=\"text-align: justify;\">6- Argument: Minhaj al-Sunnah, Volume 3 page 53: “When he (the Prophet) ordered them to offer the night prayer, Ali (ra) came up with the prepared excuse that ‘if Allah wants he will wake us up’, the prophet realized that this was merely an argument that was not right, therefore he recited <em>{but man is more than anything contentious}<\/em>“.<\/p>\n<p style=\"text-align: justify;\">Response: The narration is from the Saheehain and speaks of the Prophet – peace be upon him – attempting to wake Ali and Fatima up for a night prayer. Like the above, it is not a real condemnation for Ali or Fatima since the night prayer is not obligatory and to not practice it is not a sin.<\/p>\n<p style=\"text-align: justify;\">7- Argument: Minhaj al-Sunnah, Volume 8 page 161: “Ali, there is disagreement about him as to whether he had memorized the whole Quran or not.”<\/p>\n<p style=\"text-align: justify;\">Response: To blatantly state that Ali did not memorize the Qur’an completely is not a sign of a Nasibi, for memorizing the Qur’an completely is not mandatory upon Muslims. Ibn Taymiyyah does not even go that far, but merely mentions a difference of opinion as to whether Ali memorized it or not. Ibn Taymiyyah only mentions this when comparing Uthman and Ali. He states that Uthman was more knowledgeable when it came to the Qur’an and that Ali was more knowledgeable when it came to the Sunnah. Once again, these are not signs of a Nasibi. Rather, a Nasibi would refer to Ali is someone who is ignorant in the Qur’an and the Sunnah.<\/p>\n<p style=\"text-align: justify;\">8- Argument: Minhaj al-Sunnah, Volume 4 page 20: “His (Allamah Heli’s) statement that Ali would pray one thousand raka, surely there is no virtue in it”<\/p>\n<p style=\"text-align: justify;\">Response: Indeed, there is no virtue in praying a thousand prostrations, since the Prophet – peace be upon him – did not pray a thousand prostrations. Rather, it would be an innovation, and Islam has prohibited monasticism. Ibn Taymiyyah then states: This (merit) is a lie.<\/p>\n<p style=\"text-align: justify;\">9- Argument: Minhaj al-Sunnah, Volume 7 pages 529 – 530: “None of the four imams nor the other of the jurists refer to him (Ali) in their jurisprudence.”<\/p>\n<p style=\"text-align: justify;\">Response: None of the four Imams referred took their jurisprudence from the three other caliphs either. Rather, all the Imams took their schools from the Qur’an, the hadith, their direct teachers, and would benefit from supporting evidences from the Sahaba, including the four caliphs. This does not make the Imams Nasibis or Rafithis.<\/p>\n<p style=\"text-align: justify;\"><strong>Refutations of a Quote by Ibn Taymiyyah that Suggests that he Hated Fatima<\/strong><\/p>\n<p style=\"text-align: justify;\">Argument: Minhaj al-Sunnah, Volume 5 page 522: Verily Abu Bakr is an Imam who did not act for himself but for the Muslims and as for the money, he did not take it for himself but for the Muslims whilst Fatima was demanding it for herself. Ibn Taymiyyah then likened the anger of Fatima to the anger of hypocrites.<\/p>\n<p style=\"text-align: justify;\">Response: Fatima believed she inherited Fadak and assumed that she had ownership rights. Her anger is justified due to that assumption, unlike the hypocrites, which is why Ibn Taymiyyah then says, “How is it possible for him (Abu Bakr) to prevent (the rights) of the chief of the women of the worlds (if she was correct in her claim)?!”<\/p>\n<p style=\"text-align: justify;\"><strong>Refutation of a Quote by Ibn Taymiyyah that Suggests that he Hated Al-Hasan and Al-Husain<\/strong><\/p>\n<p style=\"text-align: justify;\">Argument: Minhaj al-Sunnah, Volume 4 page 19: “To be deemed as the most ascetic and knowledgeable people of their time, this is a proofless claim.”<\/p>\n<p style=\"text-align: justify;\">Response: Indeed, there is no proof that Al-Hasan and Al-Hussain were the most knowledgeable people of their time or most ascetic. From a Sunni standpoint, both Ibn Abbas and Ibn Omar were known to be more knowledgeable, for they have narrated multitudes of more hadiths than Al-Hasan and Al-Hussain, and were known for their religious rulings. More importantly, to deny that one was the “most knowledgeable” or “most ascetic” in an era does not make one a hater, or in this case, a Nasibi.<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/p>\n<p style=\"text-align: justify;\">There is no doubt in mind that the praise that Ibn Taymiyyah has for these four members of Ahlulbayt are far greater than his praise for most of the Sahaba. However, those with diseases in their hearts will take Ibn Taymiyyah’s refutations out of context in order to make it seem as though he was a Nasibi.<\/p>\n<p style=\"text-align: justify;\">Don’t hesitate to re-read the above merits of Ahlulbayt from the words of Ibn Taymiyyah for it to sink in once again.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This article emits light on the view of Ibn Taymiyyah on Ahlulbayt The article will be split into six sections:  His statements in praise of Ali, Fatima, Ha.. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/01\/03\/ibn-taymiyyah-and-ahlulbayt\/\" title=\"Ibn Taymiyyah and Ahlulbayt\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,6],"tags":[],"class_list":{"0":"post-2937","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2937","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2937"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2937\/revisions"}],"predecessor-version":[{"id":4924,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2937\/revisions\/4924"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2937"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2937"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2937"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}