{"id":2945,"date":"2016-01-14T18:59:46","date_gmt":"2016-01-14T18:59:46","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2945"},"modified":"2016-01-16T09:47:41","modified_gmt":"2016-01-16T09:47:41","slug":"ammar-calls-them-to-paradise-and-they-call-him-to-hellfire","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/01\/14\/ammar-calls-them-to-paradise-and-they-call-him-to-hellfire\/","title":{"rendered":"Examining: Ammar calls Them To Heaven and They Call him to Hellfire"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2945\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Bismillah Al-Rahman Al-Raheem<\/p>\n<p style=\"text-align: justify;\">The narration: “Woe onto Ammar, he will be killed by the transgressive group,” is a narration that has been graded as Mutawatir by the people of knowledge. However, there is a statement that has caused confusion to many, and it is: “He calls them to paradise and they call him to hellfire,” and we barely find explanations for these words. Most of those that have explained them simply stick to explaining what is meant by “the transgressive group” and what went down between Ali and Mu’awiyah, and they go into detail when explaining these things, but seldom do we find anything comprehensive for “they call him to hellfire.”<\/p>\n<p style=\"text-align: justify;\">This narration appears twice in Saheeh Al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">Firstly, in the Book of Prayer, from the path of Abdulaziz bin Al-Mukhtar from Khalid Al-Hatha’ and so on.<\/p>\n<p style=\"text-align: justify;\">Al-Bukhari said (427): Ibn Abbas said to me and to his son Ali, “Go to Abu Sa’eed and listen to what he narrates.” So we went and found him in a garden looking after it. He picked up his garment, wore it and sat down and started narrating until the topic of the construction of the mosque reached. He said, “We were carrying one brick at a time while Ammar was carrying two. The Prophet &#8211; peace be upon him &#8211; saw him and started removing the dust from his body and said, ‘Woe onto `Ammar. He will he killed by the transgressive group. He will be inviting them to Paradise and they will invite him to Hellfire.’ Ammar said, ‘I seek refuge with Allah from affliction.’&#8221;<\/p>\n<p style=\"text-align: justify;\">Secondly, he narrates it in the Book of Jihad, from the path of Abdulwahab Al-Thaqafi from Khalid Al-Hatha’ and so on.<\/p>\n<p style=\"text-align: justify;\">Al-Bukhari said (2601): Ibn Abbas said to me and Ali bin Abdullah, “Go to Abi Sa’eed and hear his hadith,” So we came to him and his brother at a wall that they were irrigating, and when he saw us he wrapped his garment and sat, then said, “We used to move the bricks for the Masjid one at a time, while Ammar moved two at a time. The Prophet (peace be upon him) passed by and wiped the dust from Amma’s head and said, ‘Woe to Ammar, he will be killed by the transgressive group. Ammar calls them to Allah and they call him to hellfire.’”<\/p>\n<p style=\"text-align: justify;\">Now, most contemporaries copy Ibn Hajar’s understanding of the hadith from his Fath Al-Bari. He explains that Mu’awiyah is the caller to hellfire and says: “They believed that they were calling to heaven and they weren’t in reality, but they are excused due to what appeared to them in their <em>ijtihad<\/em> and cannot be blamed, so their calling to go against Ali is actually a call to hellfire, but it doesn’t necessitate hellfire since they were <em>mujtahideen<\/em>.”<\/p>\n<p style=\"text-align: justify;\"><a href=\"https:\/\/islamqa.info\/en\/201963\" rel=\"external nofollow\">Refer to this article for more on this possible interpretation.<\/a><\/p>\n<p style=\"text-align: justify;\">However, Al-Kashmiri in his Al-Faydh Al-Bari 2\/72 responded to this popular interpretation: “I do not find this interpretation satisfying, because these wordings are taken from the Qur’an and are used for the disbelievers, and I do not wish to apply this upon the Sahaba may Allah be pleased with them, Allah has said (upon the tongue of a follower of Musa): ‘How is it that I call you to salvation and you call me to the hellfire?’ (Ghafir: 41) He also said, ‘Those are callers to hellfire and Allah calls to paradise.’ (Al-Baqara: 221).”<\/p>\n<p style=\"text-align: justify;\">He (Al-Kashmiri) then stated that Mu’awiyah is who is meant by the “transgressive group.”<\/p>\n<p style=\"text-align: justify;\">He continues: “As for him saying, ‘he calls them to heaven,’ then it is a continuation of how he is with the disbelievers and Quraish, and a signal to what he faced from Quraish and their torture, and their forcing upon him to disbelieve, but he would only say: ‘Allah is one’.”<\/p>\n<p style=\"text-align: justify;\">Al-Kashmiri was correct in this but he left out the strongest evidence for his opinion, and he was beaten to it by Ibn Battal in his explanation of Saheeh Al-Bukhari 5\/27 who said something similar: “To ‘call them to Allah’ is – and Allah knows best – about the people of Makkah that caused him to leave his home and tortured him for the sake of Allah due to him calling them to Allah. It is not possible for this to refer to Muslims at all since they have entered the call of Allah, and Allah only calls those that are out of Islam. As for ‘they call him to hellfire’, then it is another evidence of that, for the polytheists in Makkah attempted to bring him back to their religion, which is hellfire. If someone were to say, ‘That <em>fitna<\/em> was during the early days of Islam, and he said, ‘they call him,’ in future tense.’ This is responded to by saying, ‘The Arabs may refer to the past by speaking in future tense.’ So, ‘To call them to Allah,’ is about Ammar’s known times in Makkah, and he (peace be upon him) spoke of this because of the intensity of Ammar in lifting the bricks was like the intensity in the times in Makkah and his patience while being tortured, and this is a merit for Ammar and a sign of his patience and strength for the sake of Allah.”<\/p>\n<p style=\"text-align: justify;\">Be aware that Ibn Battal did not go on to explain the meaning of “the transgressive group”, and that is due to a reason that has been hidden for many, and it is because this line is not in Saheeh Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar said: “It is possible that what is meant by ‘call him to hellfire’ are the disbelievers of Quraish, as stated by some commentators, however, the addition in Ibn Al-Sakan’s, Kareema’s, and Al-Saghaani’s copy, which he checked with Al-Firabri’s, clarifies that it is referring to his killers.”<\/p>\n<p style=\"text-align: justify;\">We can understand from Ibn Hajar here that the inclusion of both statements in Al-Bukhari is enough to hold the view that these two are connected, but there is an issue with this conclusion, which is that they were definitely not said by the Prophet – peace be upon him – at one occasion.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>The First Evidence: The Combining of both Terms cannot be found in Any Other Paths Except this one<\/strong><\/h2>\n<p style=\"text-align: justify;\">The hadith: “He will be killed by the transgressive group” is authentic and <em>mutawatir<\/em> from a group of companions, and has been narrated from:<\/p>\n<p style=\"text-align: justify;\">1- Um Salama<\/p>\n<p style=\"text-align: justify;\">2- Abu Huraira<\/p>\n<p style=\"text-align: justify;\">3- Abdullah bin Amr bin Al-Aas<\/p>\n<p style=\"text-align: justify;\">4- Amr bin Al-Aas<\/p>\n<p style=\"text-align: justify;\">5- Mu’awiyah<\/p>\n<p style=\"text-align: justify;\">6- Khuzaimah bin Thabit<\/p>\n<p style=\"text-align: justify;\">7- Abu Qatada<\/p>\n<p style=\"text-align: justify;\">8- Ali<\/p>\n<p style=\"text-align: justify;\">9- Huthaifa<\/p>\n<p style=\"text-align: justify;\">10- Amr bin Hazm<\/p>\n<p style=\"text-align: justify;\">11- Abu Ayoob<\/p>\n<p style=\"text-align: justify;\">12- Zaid bin Abi Awfa<\/p>\n<p style=\"text-align: justify;\">13- Abu Al-Yasr<\/p>\n<p style=\"text-align: justify;\">14- Anas<\/p>\n<p style=\"text-align: justify;\">15- Ammar<\/p>\n<p style=\"text-align: justify;\">16- Uthman<\/p>\n<p style=\"text-align: justify;\">17- Abu Mas’ud<\/p>\n<p style=\"text-align: justify;\">18- Ibn Abbas<\/p>\n<p style=\"text-align: justify;\">19- Abu Rafi’<\/p>\n<p style=\"text-align: justify;\">20- Jabir bin Abdullah<\/p>\n<p style=\"text-align: justify;\">21- Jabir bin Samura<\/p>\n<p style=\"text-align: justify;\">22- Ibn Mas’ud<\/p>\n<p style=\"text-align: justify;\">23- Ka’b bin Malik<\/p>\n<p style=\"text-align: justify;\">24- Abu Umama<\/p>\n<p style=\"text-align: justify;\">25- A’isha<\/p>\n<p style=\"text-align: justify;\">26- Usama bin Shareek<\/p>\n<p style=\"text-align: justify;\">And <strong>NONE<\/strong> of these narrations include the statement: “He calls them to heaven and they call him to hellfire”. Is it possible for all these people to simply narrate one portion of the narration and leave the rest?<\/p>\n<p style=\"text-align: justify;\">Perhaps even more surprising is the narration in Saheeh Muslim through the path of <strong>Abi Nadhra<\/strong> from Abi Sa’eed (#5192) that does not include: “He calls them to heaven and they call him to hellfire”.<\/p>\n<p style=\"text-align: justify;\">An additional piece of evidence against the combining of both terms is in Imam Ahmad’s Fadha’il Al-Sahaba (1546) through an authentic chain from Mujahid but disconnected from the Prophet – peace be upon him – that he said: “Woe onto Ammar, he calls them to heaven and they call him to hellfire, and that is the way of the wicked.”<\/p>\n<p style=\"text-align: justify;\">As for Mujahid, not combining “he will be killed by the transgressive group” with the other first statement is evidence that this is how he heard it, and Mujahid did not fall into a mistake of combining the two statements.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Second Evidence: Abu Sa’eed’s admittance that he did not hear the Prophet – peace be upon him – say: “He will be killed by the transgressive group.”<\/strong><\/h2>\n<p style=\"text-align: justify;\">Imam Ahmad narrated in his Musnad (#10588) from Ibn Abi Adi, from Dawud, from Abi Nadhra, from Abi Sa’eed that he said: My companions narrated to me, and I did not hear it from the Messenger – peace be upon him &#8211; , that he wiped his head and said: “Woe onto you Ibn Sumayya (Ammar), you will be killed by the transgressive group.”<\/p>\n<p style=\"text-align: justify;\">This is clear proof that Abu Sa’eed did not hear this statement.<\/p>\n<p style=\"text-align: justify;\">In Saheeh Muslim (#5192) Abu Sa’eed mentions the same hadith while saying, “I was told by he who is better than me, Abu Qatada.”<\/p>\n<h2 style=\"text-align: justify;\"><strong>How did these two narrations get combined though?!<\/strong><\/h2>\n<p style=\"text-align: justify;\">That is the first question that will come to the mind of the reader after reading the above. In reality, these two narrations were not combined in Saheeh Al-Bukhari. As stated previously, the term “he will be killed by the transgressive group” was not explained by Ibn Battal because it wasn’t in his copy of the Saheeh.<\/p>\n<figure id=\"attachment_2958\" aria-describedby=\"caption-attachment-2958\" style=\"width: 150px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/20160116_120056-e1452936711877.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-2958\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/20160116_120056-e1452936711877-150x150.jpg\" alt=\"Copy of a modern Saheeh Al-Bukhari with brackets around &quot;he will be killed by the transgressive sect&quot;. Darrusalam \/ Riyadh 2nd Edition (1999).\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/20160116_120056-e1452936711877-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/20160116_120056-e1452936711877-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/20160116_120056-e1452936711877-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/20160116_120056-e1452936711877-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a><figcaption id=\"caption-attachment-2958\" class=\"wp-caption-text\">Copy of a modern Saheeh Al-Bukhari with brackets around &#8220;he will be killed by the transgressive sect&#8221;.<br \/>Darrusalam \/ Riyadh<br \/>2nd Edition (1999).<\/figcaption><\/figure>\n<figure id=\"attachment_2959\" aria-describedby=\"caption-attachment-2959\" style=\"width: 150px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/old-bukhari.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-2959\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/old-bukhari-150x150.jpg\" alt=\"An ancient copy of Saheeh Al-Bukhari, written in the year 653 AH. The marks above indicate that &quot;he will be killed by the transgressive group&quot; was taken from Al-Hamawi's copy of Saheeh Al-Bukhari. Nour Uthmaniya #654 (folio 19)\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/old-bukhari-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/old-bukhari-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/old-bukhari-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/old-bukhari-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a><figcaption id=\"caption-attachment-2959\" class=\"wp-caption-text\">An ancient copy of Saheeh Al-Bukhari, written in the year 653 AH. The marks above indicate that &#8220;he will be killed by the transgressive group&#8221; was taken from Al-Hamawi&#8217;s copy of Saheeh Al-Bukhari.<br \/>Nour Uthmaniya #654 (folio 19)<\/figcaption><\/figure>\n<p style=\"text-align: justify;\">Ibn Hajar himself says, “Al-Humaidi did not include it in his Jam’ (compilation of the Saheehain), and said: Al-Bukhari never mentioned it. The same was said by Abu Mas’ud too.”<\/p>\n<p style=\"text-align: justify;\">Abu Nu’aym Al-Hadded mentioned it in his <em>mustakhraj<\/em> 4\/467 through Abdulaziz bin Al-Mukhtar from Khalid without adding: “he will be killed by the transgressive group”. He then included this addition without a chain, and said: “I don’t think Al-Bukhari included this statement.”<\/p>\n<p style=\"text-align: justify;\">I add: This is explicit evidence from Abu Nu’aym that Al-Bukhari was not the only person to narrate it in this manner.<\/p>\n<p style=\"text-align: justify;\">Al-Bayhaqi stated in his Dala’il Al-Nubuwa 2\/548 that it isn’t in Saheeh Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\">Ibn Al-Muhib Al-Samit said in Tarteeb Musnad Ahmad p. 354 after mentioning the paths of Al-Bukhari: “It doesn’t include ‘he will be killed by the transgressive group.’”<\/p>\n<p style=\"text-align: justify;\">Al-Thahabi said in his Tareekh: Al-Bukhari mentioned it without: “He will be killed by the transgressive group”.<\/p>\n<p style=\"text-align: justify;\">Al-Qastalani mentioned in Al-Irshad that this statement cannot be found in Abu Thar Al-Harawi’s copy of Saheeh Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\">These statements from these scholars contradict the opinion of Ibn Hajar, and there is no doubt that they have seen copies of Saheeh Al-Bukhari with the additions, but rejected that it was included by Al-Bukhari himself.<\/p>\n<p style=\"text-align: justify;\">However, one should know that these statements were combined in other sources, other than Al-Bukhari. Al-Bayhaqi narrated it in his Dala’il 2\/547 with a chain from Abdulaziz bin Al-Mukhtar from Khalid Al-Hathaa’, and he stated that this is how others have narrated from Khalid Al-Hathaa’.<\/p>\n<p style=\"text-align: justify;\">However, Imam Ahmad in his Musnad (#10740) narrated from Ghundar, from Shu’ba, from Khalid, the same narration, without: “he calls them to heaven and they call him to hellfire.” Al-Hakim narrated in Al-Mustadrak (#2605) in the same way from Abdulaziz bin Al-Mukhtar from Khalid, and Al-Bayhaqi in his Dala’il 2\/547 too, with an authentic chain from Abdulwahab from Khalid.<\/p>\n<p style=\"text-align: justify;\">We understand from the above that this narration came to us from Khalid Al-Hathaa’ in three variations; with the first statement on its own, with the second on its own, and with both statements together. It is clear that the confusion here is from Khalid himself. However, it was copyist errors that allowed the combining of both variations into Saheeh Al-Bukhari, when Al-Bukhari only included one statement.<\/p>\n<p style=\"text-align: justify;\">In conclusion, we can tell from the above that the narration speaks of the reality of the time. Ammar did not call Mu’awiyah or the “transgressive group” to heaven, nor did Mu’awiyah call Ammar to hellfire. Rather, Ammar called the disbelievers to heaven and they called him to the hellfire. There is no evidence at all that what is meant by the “callers of hellfire” is the “transgressive group” other than the combining of both terms in this one single hadith, and this article has clarified that the Prophet – peace be upon him – said these two statements at different times.<\/p>\n<p style=\"text-align: justify;\">And praise be to Allah the most gracious and most merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Bismillah Al-Rahman Al-Raheem The narration: “Woe onto Ammar, he will be killed by the transgressive group,” is a narration that has been graded as Mutawatir by the people of knowledge. However, there is a statement that has caused confusion to <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/01\/14\/ammar-calls-them-to-paradise-and-they-call-him-to-hellfire\/\" title=\"Examining: Ammar calls Them To Heaven and They Call him to Hellfire\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":2958,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-2945","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2945","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2945"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2945\/revisions"}],"predecessor-version":[{"id":2961,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2945\/revisions\/2961"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/2958"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2945"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2945"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2945"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}