{"id":2951,"date":"2016-01-14T23:31:02","date_gmt":"2016-01-14T23:31:02","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2951"},"modified":"2016-01-15T00:04:07","modified_gmt":"2016-01-15T00:04:07","slug":"ali-the-best-judge","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/01\/14\/ali-the-best-judge\/","title":{"rendered":"`Ali the best of judges"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2951\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Peace be upon you and Glorified Be Allah, He is The Best Of Judges.<\/p>\n<p style=\"text-align: justify;\">In this article we shall tackle a narration often quoted by Shia to prove that `Ali was the legitimate leader and all the rest were usurpers.<\/p>\n<p style=\"text-align: justify;\">The Shia will quote the following from Sunan Ibn Majah:<\/p>\n<p style=\"text-align: justify;\">[Abi Qillabah narrated from Anas bin Malik (ra):<br \/>\nthat the Messenger of Allah (saws) said: “The most merciful of my Ummah towards my Ummah is Abu Bakr (ra); the one who adheres most sternly to the religion of Allah is `Umar (ra); the most sincere of them in shyness and modesty is `Uthman (ra); the best of them in judgement is `Ali bin Abi Talib (ra); the best in reciting the Book of Allah is Ubay bin Ka`b (ra); the most knowledgeable of what is lawful and what is unlawful is Mu`adh bin Jabal (ra); and the most knowledgeable of the rules of inheritance (Fara&#8217;id) is Zayd bin Thabit (ra). and every nation has a trustworthy guardian, and the trustworthy guardian of this Ummah is Abu `Ubaydah bin al-Jarrah.”]<\/p>\n<p style=\"text-align: justify;\">The Shia will then state that the narration is authentic and that since `Ali is the best judge then he is most worthy of being in a position of leadership.<\/p>\n<p style=\"text-align: justify;\">We refute this below,<\/p>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> `Ali ibn abi Talib was not mentioned in the manuscripts of Sunan ibn Majah.<\/p>\n<p style=\"text-align: justify;\">The researcher of Sunan ibn Majah and popular scholar of Hadith, Shaykh al-Arna&#8217;out says in his Tahqeeq 1\/107, that the words: &#8220;The best of them in judgement is `Ali.&#8221; These words are not found in the manuscripts of Sunan ibn Majah. He says: &#8220;This is (only) present in the published version (of the Sunan)  and the Sharh of Al-Sindi.&#8221;<\/p>\n<p style=\"text-align: justify;\">Furthermore, the head of the contemporary scholars of Hadith, Shaykh al-Albani when discussing this specific report in his encyclopedia &#8220;Al-Silsilah al-Sahihah&#8221;, he did not show any indication of the addition being present.<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> The treatise of Ibn `Abdul-Hadi on the chains of this report.<\/p>\n<p style=\"text-align: justify;\">Ibn `Abdul-Hadith the famous Muhaddith has written a treatise (Risalah) on the subject of this narration, it is called &#8220;Risalat Ibn `Abdul-Hadi fi Fada&#8217;il al-Sahabah.&#8221; In his treatise he lists all chains and texts for this narration, we find that the chains for these reports are almost all weak, `Ali is not mentioned in most of them but those that mention him seem to add other names such as &#8220;Abu Hurayyrah is a container of knowledge&#8221; and &#8220;Salman has great knowledge that cannot be attained&#8221; and &#8220;Mu`awiyah is the best ruler and the most qualified.&#8221; The chains listing these types of additions are of course all disconnected and very weak. Main point here is that the author quotes from Ibn Majah&#8217;s Sunan that same narration however `Ali&#8217;s name is nowhere to be found therein:<\/p>\n<p style=\"text-align: justify;\">وَقَالَ أَبُو عَبْدِ اللَّهِ بْنُ مَاجَهْ فِي سُنَنِهِ ، ثنا مُحَمَّدُ بْنُ الْمُثَنَّى ، ثنا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ ، ثنا خَالِدٌ الْحَذَّاءُ ، عَنْ أَبِي قِلابَةَ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : &#8221; أَرْحَمُ أُمَّتِي بِأُمَّتِي أَبُو بَكْرٍ ، وَأَشَدُّهُمْ فِي دِينِ اللَّهِ عُمَرُ ، وَأَصْدَقُهُمْ حَيَاءً عُثْمَانُ ، وَأَقْرَؤُهُمْ لِكِتَابِ اللَّهِ أُبَيُّ بْنُ كَعْبٍ ، وَأَعْلَمُهُمْ بِالْحَلالِ وَالْحَرَامِ مُعَاذُ بْنُ جَبَلٍ ، وَأَفْرَضُهُمْ زَيْدُ بْنُ ثَابِتٍ ، أَلا وَإِنَّ لِكُلِّ أُمَّةٍ أَمِينًا وَإِنَّ أَمِينَ هَذِهِ الأُمَّةِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ<\/p>\n<p style=\"text-align: justify;\">The research shows that Ibn Majah&#8217;s chain (abu Qillabah from Anas) does not contain the words &#8220;and the best in judgement is `Ali&#8221;, this is clear for anyone who looks at the early sources such as Sunan al-Tirmidhi which contains that same chain without the addition. The research also shows that no authentic narration from the Prophet (saw) states that `Ali was the best in judgement. Rather, the only authentic narration mentioning `Ali is one in which `Umar bin al-Khattab says: &#8220;The best of us in judgement is `Ali; the best of us in reciting Allah&#8217;s book is Ubay.&#8221; This is not a prophetic-tradition.<\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong> The only authentic chain for this report?<\/p>\n<p style=\"text-align: justify;\">We conclude from the above  that the only connected and authentic chain for this report is that of abu Qillabah from Anas and it does not mention `Ali&#8217;s name. However, a lot of scholars consider this Hadith to be Mursal by Abu Qillabah. Among them al-Daraqutni, al-Khatib al-Baghdadi, Ibn `Abd-ul-Barr, Ibn Taymiyyah and Ibn `Abd-ul-Hadi. Al-Albani also retracted his authentication as mentioned by Mashoor Hasan. Only the part which says &#8220;Abu `Ubaydah is the trustee of this nation&#8221; is connected whereas all other things were declared to be Mursal. This also seems to be the view of Bukhari as he has only reported the part which speaks of Abu `Ubaydah in his Sahih with this same chain of Khalid from Abu Qillabah from Anas.<\/p>\n<p style=\"text-align: justify;\"><strong>4-<\/strong> The chain of Jabir bin `Abdullah in al-Tabarani&#8217;s book.<\/p>\n<p style=\"text-align: justify;\">Some opponents claimed that the narration about `Ali being the best judge is authentic from another path, they say abu al-Hasan al-Haythami in his book Majma`-ul-Zawa&#8217;id has quoted this report from al-Tabarani in Al-Mu`jam al-Awsat and that he declared the chain &#8220;Hasan&#8221;. The opponent says that this was also quoted by a later scholar, Ibn Hajar al-Haythami in al-Sawa`iq al-Muhriqah but when we open al-Tabarani&#8217;s book today we do not find it, therefore we conclude that Sunni scholars are tampering with their books to remove `Ali&#8217;s virtues!<\/p>\n<p style=\"text-align: justify;\">We respond,<\/p>\n<p style=\"text-align: justify;\">First of all, the grading of abu al-Hasan al-Haythami in his book al-Majma` are not reliable, this is because the book is huge and he gives really quick judgements on most reports thus they&#8217;re inaccurate ones.<\/p>\n<p style=\"text-align: justify;\">Secondly, the narration is weak due to Mindal bin `Ali being in the chain so this proves our point. Ibn `Abdul-Hadi wrote about this chain in his treatise: The burden of this Hadith is on Muhammad bin Al-Walid who was Ibn Abban al-Qalanisi al-Baghdadi, servant of Bani Hashim and he was a liar. Ibn `Adi said: He would fabricate stories, and would attribute it to the Prophet (saws), and also steal (narrations), and mix up chains etc&#8230;<\/p>\n<p style=\"text-align: justify;\">Thirdly, there is no &#8220;Sunni conspiracy&#8221; since this report is not in Al-Mu`jam al-Awsat to begin with. It was abu al-Hasan al-Haythami who made a mistake, the report is instead found in Al-Mu`jam al-Saghir by al-Tabarani. Ibn Hajar al-Haythami simply copied abu al-Hasan al-Haythami&#8217;s mistake from his book.<\/p>\n<p style=\"text-align: justify;\"><strong>5-<\/strong> Was this addition reported by Ibn Hibban?<\/p>\n<p style=\"text-align: justify;\">An opponent may quote a book called &#8220;Zawa&#8217;id Ibn Hibban&#8221; written by al-Haythami, it is a book written by al-Haythami to show the reports that Ibn Hibban added to the famous compilations of Hadith in his own book &#8220;Sahih Ibn Hibban&#8221;. The narration here is the same one from abu Qillabah from Anas but with the inclusion of `Ali.<\/p>\n<p style=\"text-align: justify;\">Again we say this is a mistake in copying, since if we refer to Ibn Hibban&#8217;s original book &#8220;Sahih Ibn Hibban&#8221; we do not find these words present, so al-Haythami or a later copyist is responsible for this incorrect addition. We find the report as we all know it without mention of `Ali but we find a valuable addition, abu Hatim Ibn Hibban actually gives us some commentary on the text of this report. He says that this text is narrated in a fashion which omits the word &#8220;min&#8221; (In English &#8220;From&#8221;) for linguistic reasons, he says:<\/p>\n<p style=\"text-align: justify;\">قَالَ أَبُو حَاتِمٍ: هَذِهِ أَلْفَاظٌ أُطْلِقَتْ بِحَذْفِ الْـ &#8220;مِنْ&#8221; مِنْهَا يُرِيدُ بِقَوْلِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: &#8220;أَرْحَمُ أَمَّتِي&#8221; أَيْ: مِنْ أَرْحَمِ أُمَّتِي وَكَذَلِكَ قَوْلُهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: &#8220;وَأَشَدُّهُمْ فِي أَمْرِ اللَّهِ&#8221; يُرِيدُ: مِنْ أَشَدِّهِمْ ومن أصدقهم حياء ومن أقرأهم لِكِتَابِ اللَّهِ وَمِنْ أَفْرَضِهِمْ وَمِنْ أَعْلَمِهِمْ بِالْحَلَالِ وَالْحَرَامِ يُرِيدُ أَنَّ هَؤُلَاءِ مِنْ جَمَاعَةٍ فِيهِمْ تِلْكَ الْفَضِيلَةُ وَهَذَا كَقَوْلِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْأَنْصَارِ: &#8220;أَنْتُمْ أَحَبُّ النَّاسِ إِلَيَّ&#8221;, يُرِيدُ مِنْ أَحَبِّ النَّاسِ مِنْ جَمَاعَةٍ أُحِبُّهُمْ وَهُمْ فيهم<\/p>\n<p style=\"text-align: justify;\">[Abu Hatim says: These expressions were uttered with the omission of the word &#8220;From&#8221;, so he peace be upon him intends to say: &#8220;The most merciful of my nation&#8221; meaning &#8220;From the most merciful of my nation&#8221; etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">So, the meaning as explained by the great early scholar is that the Prophet (saw) was saying: &#8220;Abu Bakr is from the most merciful of my nation&#8221; and &#8220;Ubay is from the best of my nation in recitation&#8221; and &#8220;Mu`adh is from the most knowledgeable in the lawful and unlawful.&#8221; etc&#8230;<\/p>\n<p style=\"text-align: justify;\">Al-Muttaqi al-Hindi when quoting this report in Kanz-ul-`Ummal from Ibn Hibban does not mention `Ali in that version.<\/p>\n<p style=\"text-align: justify;\"><strong>6-<\/strong> Did al-Albani authenticate this report in Sahih-ul-Jami` from Ibn `Umar?<\/p>\n<p style=\"text-align: justify;\">The opponents quote that al-Albani said this report (with the inclusion of `Ali) was authentic in his book Sahih-ul-Jami`. This however is not accurate, al-Albani ruled that it was authentic only due to the fact that he deems one version of it to be authentic, which is the version that does not contain `Ali&#8217;s name as stated in detail in his other book &#8220;Al-Silsilah al-Sahihah&#8221;. This is common in the words of some scholars who will say &#8220;Hadith of Thaqalayn is authentic&#8221; although they don&#8217;t mean all of its versions are authentic, rather only some.<\/p>\n<p style=\"text-align: justify;\">As for this chain, Ibn `Abd-ul-Hadi said about it: &#8220;This narration is corrupt in this form and the burden is on Kawthar bin Hakim, for scholars have weakened him and abandoned him.&#8221;So it isn&#8217;t authentic.<\/p>\n<p style=\"text-align: justify;\">Note: al-Albani retracted his authentication of this narration in general as stated earlier.<\/p>\n<p style=\"text-align: justify;\"><strong>7-<\/strong> Is there any argument for the Shia in this narration?<\/p>\n<p style=\"text-align: justify;\">It is sufficient to refer to Minhaj-ul-Sunnah by Ibn Taymiyyah to see a very detailed refutation of this matter.<\/p>\n<p style=\"text-align: justify;\">In short No, Shia have quoted a narration that does not require us to accept `Ali as the sole candidate and the best man from among the others listed. In fact it contains great praise for other companions which conflicts with everything Shia believe. It poses questions which they cannot answer, such as:<\/p>\n<p style=\"text-align: justify;\">If Abu Bakr is the most merciful of the companions towards them, how could he usurp `Ali&#8217;s right and rob him and his wife of their inheritance?<\/p>\n<p style=\"text-align: justify;\">If `Umar is the most stern in following the religion and submitting to Allah&#8217;s religion then how can he give an oath of allegiance to Abu Bakr and abandon the Prophet&#8217;s (saws) appointment of `Ali at Ghadir?<\/p>\n<p style=\"text-align: justify;\">If `Ali was the chosen infallible, then how can Ibn al-Jarrah be the most trusted guardian of this nation instead of `Ali?<\/p>\n<p style=\"text-align: justify;\">etc&#8230;<\/p>\n<p style=\"text-align: justify;\">Secondly, let&#8217;s agree on the narration&#8217;s authenticity for the sake of the argument, the word Qada&#8217; in this report or &#8220;judgement&#8221; has a specific meaning. This Arabic word can mean one of two things, A- Judging between two opponents based on the evidences and claims of each party and ruling for one over the other, B- Issuing religious verdicts to people who seek to know the lawful and unlawful. What is intended in this report is the first kind of judgement not the second and it does not mean that `Ali is the best of the companions in any way.<\/p>\n<p style=\"text-align: justify;\">If I wished to know a religious ruling I would seek out Mu`adh who has the best knowledge of Halal and Haram, if I wished to learn how to split my family&#8217;s inheritance in a complicated scenario I would seek Zayd since he is the most experienced in it according to the above report. However, `Ali being better in judging simply means he is more intelligent when it comes to settling disputes between opponents, that he is a good listener, that he can rule in a diplomatic way so as to please all sides and that he is patient among other qualities. It doesn&#8217;t mean he was the most knowledgeable let alone the best man alive.<\/p>\n<p style=\"text-align: justify;\">Abu Bakr for instance was described as being the most merciful of the companions, this to any sane man is more valuable as a quality for a leader to possess than being a good judge. From Allah&#8217;s greatest names is the merciful, we recite it before every Qur&#8217;anic verse and it is a great quality for a human to have especially if he&#8217;s in a position of leadership. Our issue with our leaders today is not that they lack knowledge or are too dumb to judge in matters, our issue is that they are not merciful towards their followers which leads them to greed and tyranny.<\/p>\n<p style=\"text-align: justify;\">This narration summarizes &#8220;judgement&#8221; in a way that anybody can understand:<\/p>\n<p style=\"text-align: justify;\">Umm Salamah said that the Prophet (saws) said, &#8220;You people present your case to me and some of you may be more eloquent in presenting his argument. So if I give someone&#8217;s right to another because of the latter&#8217;s presentation of the case then I am really giving him a peice of fire; so he should not take it.&#8221; [Agreed upon]<\/p>\n<p style=\"text-align: justify;\">Thirdly, Ahlul-Sunnah have no issue if `Ali was to be the most knowledgeable, knowledge alone does not determine the status of a man in the sight of Allah. On the day of judgement we will see simple ignorant men having superiority over scholars and judges and reaching a higher rank in heaven.<\/p>\n<p style=\"text-align: justify;\">Finally, if `Umar praised `Ali saying: &#8220;The best of us in judgement is `Ali and the best in recitation is Ubay.&#8221; Then the praise of the companions for each-other is known and accepted, the Shia will have to accept that Ubay recited better than their infallible though.<\/p>\n<p style=\"text-align: justify;\">Ibn Mas`oud for example said in the authentic report: &#8220;`Umar was the most knowledgeable of us about Allah, the most learned of us regarding the book of Allah and most knowledgeable regarding the religion of Allah.&#8221;<\/p>\n<p style=\"text-align: justify;\">`Ali also said in the Sahih: &#8220;O `Umar! You have not left behind you a person whose deeds I like to imitate and meet Allah with more than I like your deeds.&#8221; If `Umar was an ignorant and was not qualified would he like to meet Allah with his deeds?<\/p>\n<p style=\"text-align: justify;\">`Ali also said in the Sahih: &#8220;The best of this nation after its Prophet (saw) are Abu Bakr and `Umar.&#8221; And he said in the narration of Fadak: &#8220;O Aba Bakr, we acknowledge your virtue and what Allah has given you.&#8221;<\/p>\n<p style=\"text-align: justify;\">Similarly, `Umar said praising `Ali: &#8220;May God keep me away from a dilemma that aba al-Hasan cannot solve.&#8221; And he said: &#8220;If it were not for `Ali then `Umar would have perished.&#8221;<\/p>\n<p style=\"text-align: justify;\">`Ali also praised `Umar by saying: &#8220;He straightened the curve, cured the disease, abandoned mischief, and established the Sunnah. He departed (from this world) with untarnished clothes and little shortcomings. He achieved the goodness (of this world) and remained safe from its evils. He offered Allah’s obedience and feared Him as He deserved. He went away and left the people in dividing ways wherein the misled cannot obtain guidance and the guided cannot attain certainty.&#8221;<\/p>\n<p style=\"text-align: justify;\">In conclusion, the companions always praised and loved each-other and most importantly they feared Allah, so fear Allah!<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Peace be upon you and Glorified Be Allah, He is The Best Of Judges. In this article we shall tackle a narration often quoted by Shia to prove that `Ali was the legitimate leader and all the rest were usurpers. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/01\/14\/ali-the-best-judge\/\" title=\"`Ali the best of judges\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-2951","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2951","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2951"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2951\/revisions"}],"predecessor-version":[{"id":2956,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2951\/revisions\/2956"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}