{"id":2970,"date":"2016-01-20T15:35:33","date_gmt":"2016-01-20T15:35:33","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2970"},"modified":"2016-01-20T15:35:33","modified_gmt":"2016-01-20T15:35:33","slug":"response-to-nebil-husayns-the-veneration-of-the-companions-in-imami-shiism","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/01\/20\/response-to-nebil-husayns-the-veneration-of-the-companions-in-imami-shiism\/","title":{"rendered":"Response to Nebil Husayn’s: “The Veneration of the Companions in Imami Shi’ism”"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2970\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to the introduction in Sayed Ammar Nakshawani’s poor written: <a href=\"http:\/\/twelvershia.net\/2016\/01\/20\/book-review-the-ten-granted-paradise-by-ammar-nakshawani\/\" rel=\"external nofollow\">“The Ten Granted Paradise”<\/a>. The introduction, is an essay penned by Ph.D Candidate Nebil Husayn, is entitled <a href=\"http:\/\/scholar.princeton.edu\/nhussen\/publications\/veneration-companions-im%C4%81m%C4%AB-sh%C4%AB%E2%80%98ism\" rel=\"external nofollow\">“The Veneration of Companions in Imami Shi’ism”.<\/a><\/p>\n<p style=\"text-align: justify;\">The introduction briefly touches upon the view of Shias in regards to companions and suggests that Imami Shias do not hate all the companions of the Prophet peace be upon him. Most importantly, the essay includes a criticism by the author towards the narration of the “ten promised paradise” that Sunnis accept as authentic. Below, we have quoted the complete criticisms of the author before sharing our thoughts on his views.<\/p>\n<p style=\"text-align: justify;\"><strong>Sunni hadith literature famously names a list of “ten promised Paradise,” beginning with the first four caliphs, Talhah, Zubayr, Sa’d b. Abi Waqqas, ‘Abd al-Rahman b. ‘Awf, Abu ‘Ubaydah al-Jarrah and Sa’id b. Zayd. However, the report is doubted in the Imami tradition for a few reasons. First, the hadith is considered a “solitary report,” which some theologians did not consider to be valid in establishing theological tenets. Second, the only Companion who may have narrated this report was Sa’id b. Zayd who included himself in list. In the light of the Qur’anic prohibition, “And do not claim purity for yourselves” (Q53:32), Shaykh al-Mufid argues that testimony attesting to one’s own character is not considered authoritative in legal disputes (see al-Ifsah p. 71-89). The hadith of Sa’id can be rejected since other trustworthy witnesses besides the claimant himself have not corroborated it. Al-Mufid also cites one narrative in which Imam Ali heard the hadith, rejected its attribution to the Prophet, and considered it the claim of Sa’id (al-Kafi’ah, p. 24-5). According to al-Amini, recensions of the hadith that are attributed to ‘Abd al-Rahman b. ‘Awf (d. 32 AH) are unacceptable since there is a missing link between him and the next narrator, Hamid b. ‘Abd al-Rahman (d. 107 AH). Hamid was either born a year after ibn Awf’s death or in the same year (see al-Ghadir, 10:122). Third, the hadith names the most famous political rivals of Ali and polemically guarantees their salvation, when members of the community hotly debated the righteousness and openly condemned some of the Companions for over a century (e.g. Talhah, Zubayr and Ali himself). Thus, the hadith reflects late second-century Sunni attempts to become non-partisan by rehabilitating all Companions as righteous rather than acknowledging earlier debates and tensions. Sunnism eventually claimed that all six individuals named in the council to elect the third caliph represented those surviving Companions promised Paradise. An indication of the non-existence of the hadith and\/or this theological belief at the time of the election is Sa’id b. Zayd’s conspicuous absence. Why doesn’t ‘Umar or anyone on the council request Sa’id’s presence if the Prophet had named them all together? Finally, the hadith clearly ignores the names of (1) famous Ansar from Medina, (2) those Meccans guaranteed Paradise who were not from Quraish (e. g. Ammar b. Yasir and his family), and (3) those who supported Ali’s wars during his caliphate.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>(The Ten Granted Paradise p. 15-17)<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">In summary, Nebil Husayn presents his case with three types of arguments in order to reject the hadith:<\/p>\n<ol style=\"text-align: justify;\">\n<li>a) Arguments revolving around Sa’eed bin Zaid.<\/li>\n<li>b) The suggestion that the hadith is a late fabrication.<\/li>\n<li>c) The suggestion that the narration does not mention others who have also been promised paradise.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Now, even though Nebil Husayn has raised the above, it is only the first point that holds any weight due to the evidences provided by the author. Apart from his speculations, nothing tangible is provided.<\/p>\n<p style=\"text-align: justify;\">Nebil Husayn did not provide evidence that the narration is a late second century report. Upon simply inspecting Mahdh Al-Shayd by Ibn Abdulhadi p. 129-133, we find that the hadith was narrated by at least three different narrators from the very first century: Riyah bin Al-Harith, Abdulrahman bin Al-Akhnas, and Abdullah bin Thalim. In addition to those men, Humaid bin Abdulrahman also narrated from Sa’eed the same hadith. See Sunan Al-Tirmithi #3681. Furthermore, the view that it is a late fabrication contradicts all the previous evidences brought forth by Husayn.<\/p>\n<p style=\"text-align: justify;\">As for Husayn’s other suggestion, we can simply dismiss it by arguing that the Prophet &#8211; peace be upon him &#8211; did not intend to name all those that were promised paradise, but simply to single out some of the best of his companions that deserved to be singled out.<\/p>\n<p style=\"text-align: justify;\">In regards to arguments that revolve around Sa’eed bin Zaid, we find that Nebil Husayn is arguing that the narration should be rejected since the hadith of Sa’eed is a “solitary report”, it is a narration of his own merit, to state one’s merits goes against the Qur’an, and that Ali rejected Sa’eed’s narration.<\/p>\n<p style=\"text-align: justify;\">Firstly, we would like to point out to readers that the term “solitary report” refers to a<em>had<\/em> hadiths, basically, these are hadiths that have not reached the level of<em> mutawatir <\/em>(consecutive). Even though we acknowledge that some theologians have rejected <em>ahad<\/em> narrations in ideology, we would like to point out that this is not the position of Sunni or Shia scholars. According to Al-Shaikh Abdulsamad, the father of Al-Baha’ee, the Qur’an, the appearance of the Prophet (pbuh), the Qibla, prayers, and the number of prostrations, the pilgrimage, and amount of the paid alms are <em>mutawatir,<\/em> while “<em>Mutawatir<\/em> in hadith is almost non-existent, due to the rarity of such in the narrations of the Prophet (pbuh) and the Imams.” See Dirasat fil Hadith by Hashim Ma’rouf Al-Hasani (p. 36). In other words, if Nebil Husayn was to insist that this is the view of Shias, then he might as well kiss the Imamate of the his Imams goodbye, since their appointment is not <em>mutawatir.<\/em><\/p>\n<p style=\"text-align: justify;\">As for Sa’eed bin Zaid narrating his own merit and it going against Qur’anic instructions, we found that Ali was guilty of doing the same. In Khasa’is Ali by Al-Nasa’ee alone, we found Ali narrating his own merits twenty-one times. See hadiths 1, 7, 8, 14, 25, 31, 32, 66, 67, 71, 73, 85, 100, 103, 114, 122, 146, 147, 149, 152, 178. Of course, this is nothing compared to the amount of merits that Ali has narrated about himself in Shia books, let alone the infallible Imams. So if Shias wish to reject the merits of Sa’eed bin Zaid for narrating it himself, then they might as well reject the merits of the Imams as well. Perhaps it would be safer for Nebil Husayn to consult books of Qur’anic exegesis before tossing out such blanket statements in order to knock down a merit of a companion of the Prophet &#8211; peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">As for the hadith that Nebil Husayn alludes to in Al-Mufeed’s Al-Kafi’ah, we find the text to be too awkward to accept. Perhaps this is why Husayn chose to not quote the text. The narration includes an angry Ali cursing A’isha’s army, Talha responding by citing the narration of the ten promised heaven while only naming nine, Ali challenging him to name all ten, Talha admitting that Ali is the tenth, and finally, Ali damning him again. The illogical report is weak due to the two centuries of disconnection between Al-Mufeed and Amr bin Shimr.<\/p>\n<p style=\"text-align: justify;\">In conclusion, it is safe to say that the narration of the ten promised paradise is an authentically transmitted hadith due to the reliability of Sa’eed bin Zaid, with or without it being corroborated.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah the Most Gracious Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the introduction in Sayed Ammar Nakshawani’s poor written: “The Ten Granted Paradise”. The introduction, is an essay penned by Ph.D Candidate Nebil Husayn, is entitled “The Veneration of Companions in Imami Shi’ism”. The introduction <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/01\/20\/response-to-nebil-husayns-the-veneration-of-the-companions-in-imami-shiism\/\" title=\"Response to Nebil Husayn’s: “The Veneration of the Companions in Imami Shi’ism”\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-2970","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2970","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2970"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2970\/revisions"}],"predecessor-version":[{"id":2971,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2970\/revisions\/2971"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2970"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2970"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2970"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}