{"id":2999,"date":"2016-01-29T17:13:57","date_gmt":"2016-01-29T17:13:57","guid":{"rendered":"http:\/\/twelvershia.net\/?p=2999"},"modified":"2016-11-14T13:57:30","modified_gmt":"2016-11-14T13:57:30","slug":"karbala-the-facts-and-the-fairytales","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/","title":{"rendered":"Karbala &#8211; the Facts and the Fairy-tales"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=2999\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Karbala &#8211; the Facts and the Fairy-tales<\/h1>\n<p style=\"text-align: justify;\">The martyrdom of Al-Hussain at Karbala has truly become a tale of epic proportions. It would not be an outrageous claim if one were to suggest that across the globe there is a continuous <em>matam <\/em>(seasonal mourning processions) event in which the story of Al-Hussain at Karbala is being told. The tragedy of Al-Hussain is a tragedy without a doubt, though, for the Shia, it is a tragedy for all the wrong reasons, for there is little doubt that Shias have no idea of what truly transpired at Karbala. Instead, they are fed with fairy-tales and fabrications that know no end.<\/p>\n<p style=\"text-align: justify;\">We request our Sunni readers to ask your Shia acquaintance to share with you the story of Karbala. There is little doubt that the zealous Shia will take this opportunity to share the tales that he has heard. Then, we request that you pop the most awkward question possible: Would you mind providing a source for this?<\/p>\n<p style=\"text-align: justify;\">We are certain that the Shia will have nothing more to say other than: 1) this is what we were told at the <em>matam<\/em>, 2) everyone knows this, or 3) my mom told me.<\/p>\n<p style=\"text-align: justify;\">The Shia has not yet realized the kind of predicament that he is in. This is because of their blind faith in those three “sources”.<\/p>\n<p style=\"text-align: justify;\">Sadly, most Shias have never read through a book about the martyrdom of Al-Hussain. Yes, they do have one lying on their shelf, but they have never attempted to read it. Instead, they’d rather “listen” to the events of Karbala at their gatherings.<\/p>\n<p style=\"text-align: justify;\">Why would this be considered a dilemma though?<\/p>\n<h4 style=\"text-align: justify;\">We list out answers below in short and we will expand on them as we go along:<\/h4>\n<ol>\n<li><strong>Twelver Shias have no Idea what their “Real” Sources are in Regards to Karbala<\/strong><\/li>\n<li><strong>Statistics demonstrate Shia Manipulation of the Events of Karbala<\/strong><\/li>\n<li><strong>One Single Twelver Shia Narration does have a Chain!<\/strong><\/li>\n<li><strong>The Earliest “Shia” Sources<\/strong><\/li>\n<li><strong>Popular Re-tellings of Al-Hussain’s Martyrdom Conflict with the Earliest Shia Version<\/strong>\n<ul>\n<li><strong>Al-Hussain’s Reasons for  heading to Kufa<\/strong><\/li>\n<li><strong>The Actions of Abu Al-Fadhl Al-Abbas in Karbala<\/strong><\/li>\n<li><strong>Did Al-Hussain save Islam? <\/strong><\/li>\n<li><strong>Al-Hussain&#8217;s Final Advice to Sayeda Zainab<\/strong><\/li>\n<\/ul>\n<\/li>\n<li><strong>The Real Tragedy at Karbala<\/strong><\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>1- Twelver Shias have no Idea what their “Real” Sources are in Regards to Karbala<\/strong><\/h2>\n<p style=\"text-align: justify;\">By sources, we mean books, or narrations, or texts. Receiving these narratives from parents or other family members is not sufficient. They simply weren’t there in the year 61 AH, nor were their grand-parents for that matter. The well-read English-speaking modern Shia, will most likely have picked up one of three books. &#8220;Nafsul Mahmoom&#8221; by Abbas Al-Qummi, &#8220;Maqtal Al-Hussain&#8221; by Al-Muqarram, or &#8220;A Probe into the History of Ashura&#8221; by Ibrahim Ayaati are<strong> the three most popular English books about Karbala.<\/strong><\/p>\n<p style=\"text-align: justify;\">However, all three of these books are relatively modern, and can be considered to be contemporary works. A Probe into the History of Ashura is the weakest of the three. Originally, it was a collection of lectures about the lessons of Ashura, which was then collected as a book. Abbas Al-Qummi attempts to keep the analysis to a minimal. Al-Qummi focuses on actually providing the reader with the proper source material for what makes up the events of the battle of Karbala. Abdulrazzaq Al-Muqarram sticks to the middle path. Al-Muqarram provides both an analysis of events while providing a multitude of quotations from the earlier sources.<\/p>\n<h3 style=\"text-align: justify;\">Source Material<\/h3>\n<p style=\"text-align: justify;\">As for the source material, it is mainly based off four earlier works. They are Al-Irshaad by Al-Mufeed (413 AH), Ibn Shahrashoub’s (558 AH) Manaqib, Ibn Tawus’ (664 AH) Al-Lahoof, and Mohammad bin Abi Talib’s Tasliyat Al-Mujalis (10<sup>th<\/sup> century).<\/p>\n<p style=\"text-align: justify;\">The first two sources in the list are books that contain a lot of information about the twelve Imams, while the last two are specifically about Al-Hussain and his martyrdom in Karbala. Sadly, none of the four sources rely on chains of narrations. This is extremely problematic since the reader does not have the ability to judge which report is authentic. More importantly, none of these four men were at Karbala, nor were their parents or grandparents present. However, <em>shaikhs<\/em> at the <em>matam<\/em> today, feel obligated to preach what is found in these four books as if every single word was canon.<\/p>\n<h3 style=\"text-align: justify;\">The Solution<\/h3>\n<p style=\"text-align: justify;\">Of course, the modern Shia preacher will not restrict themselves to what these four books contain without a doubt. Indeed, they will need to spice things up once in a while by providing their own exaggerations.<\/p>\n<p style=\"text-align: justify;\">In all cases, taking knowledge from sources that have been so disconnected from the reality of Karbala is hazardous. The status of Al-Hussain in the hearts of the Shia youth will allow for anything to flow in with the fabrications. This includes a corrupt ideology that has been entangled with the events of Karbala.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan2.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3000 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan2-150x150.jpg\" alt=\"Scan2\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan2-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan2-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan2-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan2-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Ayatollah Mohammad Asif Muhsini describes this phenomenon by saying, “Most of the details of what occurred in Karbala are unknown, though the masses ask for what causes them to weep, and the preachers seek wealth and status, and this is what caused the current matter of the storytellers.” (Mashra’at Bihar Al-Anwar 2\/156)<\/p>\n<p style=\"text-align: justify;\">For further reading on this topic, be sure to check out <a href=\"http:\/\/twelvershia.net\/2015\/09\/05\/ashura-lies-and-fabrications\/\" rel=\"external nofollow\">another one of our articles<\/a> on the topic of how Shia scholars accuse preachers at Hussainiyat of fabricating stories in order to appeal to their fanbase.<\/p>\n<h2 style=\"text-align: justify;\"><strong>2- Statistics demonstrate Shia Manipulation of the Events of Karbala<\/strong><\/h2>\n<p style=\"text-align: justify;\">There are many ways for one to show how far Shia historians went in order to manipulate the events of Karbala to greater extremes. Below, we have included one set of statistics that display this fact. This was done when we compared the names of some of the companions of Al-Hussain and the number of those that they have killed during the battle of Karbala. To compile this little comparison, we relied on two sources: Al-Saduq’s (381 AH) Amali (p. 126-128) and Ibn Shahrashoub’s (558 AH) Manaqib (4\/1006-1013). Notice that in a small time frame of two centuries, statistics have been distorted considerably over the coming centuries in favor of a more epic battle.<\/p>\n<p style=\"text-align: justify;\">Al-Saduq in Al-Amali shows Al-Hurr bin Yazeed killing eighteen men (18), while Ibn Shahrashoub states that the number killed were “forty-something” (40+).<\/p>\n<p style=\"text-align: justify;\">Then, Al-Saduq mentions that Habeeb bin Muthahir killed thirty-one men (31), while Ibn Shahrashoub mentions exactly twice as much as sixty-two (62).<\/p>\n<p style=\"text-align: justify;\">He (Al-Saduq) mentions that Zuhair bin Al-Qayn killed nineteen men (19), while Ibn Shahrashoub adds a hundred and one more men to make the number: a hundred and twenty (120).<\/p>\n<p style=\"text-align: justify;\">Al-Saduq mentions that Abdullah bin Muslim bin Aqeel killed three (3), while Ibn Sharhashoub mentions that he killed ninety-eight (98)!!<\/p>\n<p style=\"text-align: justify;\">Note, that is how disproportional things may get in a mere two hundred years. Imagine how bad has it gotten since then.<\/p>\n<h3 style=\"text-align: justify;\">Other Children of Ali and Al-Hussain?<\/h3>\n<p style=\"text-align: justify;\">It should also be noted that those that took part in Karbala that had names of the first three Caliphs were never given any attention. The sources mentioned earlier do refer to the participation of Abu Bakr bin Ali, Abu Bakr bin Al-Hussain, Omar bin Ali, and Uthman bin Ali, however, none of them were said to have killed anyone, with the exception of Omar bin Ali who killed one man according to one Shia narration. Perhaps it was their names that prevented the storytellers and fabricators from ascribing glorious feats to their names.<\/p>\n<p style=\"text-align: justify;\">More fun facts from even earlier historians:<\/p>\n<p style=\"text-align: justify;\">According to the early Shia historian Abu Mikhnaf (158 AH), only eighty-eight men (88) from Omar bin Sa’ad’s army were killed. (Tareekh Al-Tabari 3\/1053)<\/p>\n<p style=\"text-align: justify;\">Abu Mikhnaf also said that Omar bin Sa’ad’s army was four-thousand (4,000) men large. (Tareekh Al-Tabari 3\/1053)<\/p>\n<p style=\"text-align: justify;\">Ibn Shahrashoub being a much later Shia author suggests that the number was thirty-five thousand (35,000) men!! (Manaqib Aal Abi Talib 4\/1004)<\/p>\n<h2 style=\"text-align: justify;\"><strong>3- One Single Twelver Shia Narration actually does have a Chain!<br \/>\n<\/strong><\/h2>\n<p style=\"text-align: justify;\">Due to the lack of a complete text that examines the events of Karbala from beginning to end, a contemporary by the name of Mohammad Jawad Al-Tabasi collected his &#8220;Maqtal Al-Husaini Al-Ma’thoor&#8221;, in which he built his book upon the traditions that have been attributed to the Imams directly. His effort was a solid one, though it was the lack of data that ultimately betrayed him, for there was only one narration in his book that provided any clear image of the events that transpired in Karbala.<\/p>\n<p style=\"text-align: justify;\">From his collection, the closest thing to a direct narration of the events of Karbala can be found in Amali Al-Saduq (381 AH). The narration is nine pages long. The modern Shia <em>matam<\/em> preacher will be saddened by how limiting nine pages must be, but alas, this is all that Shias really have to work with, if they wanted to be loyal to the text. Objectively, nine pages is by no means “small” narration, though, it is not long enough to fill the time slots at Hussainiyat <em>matams<\/em>.<\/p>\n<p style=\"text-align: justify;\">Unfortunately for those that do not read Arabic, we are not interested in putting in the effort to translate fabrications. Indeed, this narration is a fabrication according to the standards of Ahlul-Sunnah and Shias alike.<\/p>\n<p style=\"text-align: justify;\">The chain goes as follows:<\/p>\n<p style=\"text-align: justify;\">Al-Saduq, from Mohammad bin Omar Al-Baghdaadi, from Abu Sa’eed Al-Hasan bin Uthman bin Ziyad Al-Tusturi, from Ibrahim bin Ubaidullah bin Musa bin Yunus bin Abi Ishaaq Al-Sabee’ee, from Mareesa bint Musa bin Yunus bin Abi Ishaaq, from Safiyya bint Yunus bin Abi Ishaaq, from Bahja bint Al-Harith bin Abdullah Al-Taghlabi, from Abdullah bin Mansour, from Ja’afar Al-Sadiq.<\/p>\n<h3 style=\"text-align: justify;\">Chain Criticism<\/h3>\n<p style=\"text-align: justify;\">Most of the narrators in this chain are anonymous according to both Sunni and Shia rijali standards. Sunnis go the extra mile by accusing Al-Hasan bin Uthman of being a liar. See his biography in Lisan Al-Mizan where Abu Ali Al-Nisapuri and Ibn Adi both accuse him of lying. Even the Shia scholar Ni’matullah Salihi reached the same conclusion about Al-Hasan bin Uthman. (See Al-Shaheed Al-Khalid p. 346)<\/p>\n<h3 style=\"text-align: justify;\">Textual Criticism<\/h3>\n<p style=\"text-align: justify;\">Moreover, the narration itself is extremely problematic for several reasons:<\/p>\n<ul>\n<li style=\"text-align: justify;\">The narration mentions that Utba bin Abi Sufyan is appointed as governor of Madinah, when in reality, Utba died in the year 44AH according to Ibn Zabr Al-Rib’ee 1\/143.<\/li>\n<li style=\"text-align: justify;\">Al-Hussain leaves Madinah and heads directly to Iraq. This contradicts the established fact that he went to Makkah where he spent months there before leaving to Iraq.<\/li>\n<li style=\"text-align: justify;\">Ubaidullah bin Ziyad kills Sinan bin Anas, the killer of Al-Hussain, when Sinan brings in Al-Hussain’s head. This is illogical and goes against the established fact that Sinan was alive and stayed alive until the time of Al-Hajjaj. (See Al-Tabarani’s Mu’jam 2\/704)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The narration provided by Al-Saduq does one thing differently though. It contains exaggerations that cannot be found in earlier sources that have been provided by Sunnis. These include visions by Al-Hussain, his certain knowledge of his martyrdom, and tales about how he killed people by supplicating against them. Even though the modern Shia may reject that these are exaggerations, one needs to keep in mind that it is only because they have been used to the exaggerated narratives every time they walk into a <em>matam<\/em>.<\/p>\n<h2 style=\"text-align: justify;\"><strong>4- The Earliest “Shia” Sources<\/strong><\/h2>\n<p style=\"text-align: justify;\">Perhaps there are two other sources that may be interpreted to be “Shia sources”. We use that word loosely since we hold the opinion that these two have nothing to do with the Imami narrative. The first of these is a narration by Mohammad Al-Baqir, the fifth Shia Imam. In this narration, his student, Ammar Al-Duhani asks him to narrate to him the events of Karbala “as if he could see it.” The narration itself is not too long either and it can exclusively be found in Sunni sources. Scholars that often quote this report do so through Tareekh Al-Tabari, though it can be found elsewhere. Of course, Shias often shun this narration simply because it comes through a Sunni source.<\/p>\n<p style=\"text-align: justify;\">Sunnis shouldn’t blame Shias though, since we feel the same way about their sources. Ironically, Sunnis themselves take this narration with a grain of salt because it comes through the path of a narrator named Khaled bin Yazeed Al-Qasri, who is extremely weak in his narrations. Some Sunnis have flat out rejected this narration for the same purpose.<\/p>\n<p style=\"text-align: justify;\">The other source is perhaps the most important complete early source about the events of Karbala. Abu Mikhnaf Lut bin Yahya’s rendition of Maqtal Al-Hussain has always been the skeleton of the Karbala narrative. Fabricators often would keep his narration as the base, but then add onto it. This is very clear in the actual battle of Karbala if one were to compare Abu Mikhnaf’s narration and the late sources that have been mentioned above.<\/p>\n<h3 style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/tusturi0002.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3002 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/tusturi0002-150x150.jpg\" alt=\"karbala\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/tusturi0002-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/tusturi0002-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/tusturi0002-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/tusturi0002-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/al-salihi.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3001 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/al-salihi-150x150.jpg\" alt=\"karbala\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/al-salihi-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/al-salihi-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/al-salihi-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/al-salihi-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Abu Mikhnaf&#8217;s Reliability<\/h3>\n<p style=\"text-align: justify;\">In regards to the reliability of Abu Mikhnaf’s tradition, Al-Tusturi, in his Mu’jam Al-Rijal 8\/620 says that “his book Maqtal Al-Hussain (as), that is narrated by Al-Tabari and Abu Al-Faraj, is the most authentic <em>maqtal<\/em> (retelling of the death of Al-Hussain), for he narrates these events usually through one single intermediary.” Al-Najashi, similarly, when speaking about Abu Miknaf p. 320, says, “There is an acceptance to what he narrates.” Ayatullah Al-Salihi makes a very similar statement in his Al-Shaheed Al-Khalid (p. 39), where he argues that Al-Murtadha and Al-Tusi both relied on Abu Mikhnaf&#8217;s version through Al-Tabari. Al-Salihi continues to build the case for Abu Mikhnaf by saying that he was a student of Ja&#8217;afar. All in all, the man is considered reliable by their standards&#8230; but does that he mean his narration is authentic as they claim?<\/p>\n<h3 style=\"text-align: justify;\">Abu Mikhnaf&#8217;s Teachers<\/h3>\n<p style=\"text-align: justify;\">Of course, such statements are never satisfying to researchers, which is why we took it upon ourselves to list the teachers of Abu Mikhnaf in his Maqtal Al-Hussain, in order to see if his narrations are reliable according to Shia standards:<\/p>\n<h4 style=\"text-align: justify;\">Narrators that are weak according to Al-Jawahiri:<\/h4>\n<ol>\n<li>Abdulrahman bin Jundub – He is anonymous according to Al-Jawahiri p. 309.<\/li>\n<li>Yunus bin Abi Ishaaq – He is anonymous according to Al-Jawahiri p. 678.<\/li>\n<li>Qudama bin Sa’eed – He is anonymous according to Al-Jawahiri p. 468.<\/li>\n<li>Al-Harith bin Ka’ab Al-Wabili – He is anonymous according to Al-Jawahiri p. 124.<\/li>\n<li>Aqaisa – He is anonymous according to Al-Jawahiri p. 376.<\/li>\n<li>Isma’eel bin Abdulrahman Al-Suddi – He is anonymous according to Al-Jawahiri p. 67.<\/li>\n<li>Al-Harith bin Husaira – He is anonymous according to Al-Jawahiri p 123.<\/li>\n<li>Amr bin Murra – He is anonymous according to Al-Jawahiri p. 437.<\/li>\n<li>Ata’a bin Al-Sa’ib – He is anonymous according to Al-Jawahiri p. 374.<\/li>\n<li>Uqba bin Basheer – He is anonymous according to Al-Jawahiri p. 375.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h4>Narrators that cannot be found in early Shia Rijal books:<\/h4>\n<p><strong> <\/strong><\/p>\n<ol>\n<li> Al-Hajjaj bin Ali<\/li>\n<li> Abu Al-Mukhariq Al-Rasibi<\/li>\n<li> Numair bin Wa’la<\/li>\n<li> Al-Saq’ab bin Zuhair<\/li>\n<li> Al-Mu’ala bin Kulaib<\/li>\n<li> Mujalid bin Sa’eed<\/li>\n<li> Al-Hasan bin ‘Uqba<\/li>\n<li> Yusuf bin Yazeed<\/li>\n<li>Abu Janah Yahya bin Abi Hayya Al-Kalbi<\/li>\n<li>Sulaiman bin Abi Rashid<\/li>\n<li>Ja’afar bin Huthaifa Al-Ta’ee<\/li>\n<li>Sa’eed bin Mudrik<\/li>\n<li>Hisham bin Al-Waleed<\/li>\n<li>Omar bin Khalid<\/li>\n<li> Lawthan<\/li>\n<li> Uqba bin Abi Al-Ayzar<\/li>\n<li> Jameel bin Murthid<\/li>\n<li> Al-Nadhr bin Salih<\/li>\n<li> Abdullah bin Asim Al-Fa’ishi<\/li>\n<li> Fudhail bin Khadeej<\/li>\n<li> Ali bin Hanthala<\/li>\n<li> Suwaid bin Hayya<\/li>\n<li> Thabit bin Hubaira<\/li>\n<li> Yahya bin Hani’ &#8211;<\/li>\n<li> Al-Hussain bin Uqba Al-Muradi<\/li>\n<li> Zuhair bin Abdulrahman<\/li>\n<li> Amr bin Shu’aib<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h4>Others:<\/h4>\n<ol>\n<li>Mohammad bin Qais – There are many people with this name and Abu Mikhnaf was not clear about the entity of his teacher, therefore, we cannot comment on his status and cannot accept his report.<\/li>\n<li>Abu Ali Al-Ansari – There is not enough information about this narrator to identify him or accept his report.<\/li>\n<li>Abu Al-Dahhak &#8211; There is not enough information about this narrator to identify him or accept his report.<\/li>\n<li>Ja’far bin Mohammad bin Ali – <strong>6th Shia Imam<\/strong><\/li>\n<li>Abu Hamza Al-Thamali – <strong>Trustworthy<\/strong> according to Shia.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">As we can see from the above, out of the forty-two teachers that Abu Mikhnaf has relied on, only two are reliable according to Shia standards.<\/p>\n<p style=\"text-align: justify;\">One of the two narrations is by Abu Hamza Al-Thamali and it is about reactions to the death of Al-Hussain in Dimashq (Syria). Abu Mikhnaf narrates it from Abu Hamza, from Abdullah Al-Thamali, from Al-Qasim bin Bikheet. The latter two are both anonymous for they cannot be found in early Shia Rijal books.<\/p>\n<h3 style=\"text-align: justify;\">One Authentic Shia Narration<\/h3>\n<p style=\"text-align: justify;\">That leaves us with one narration that could be considered authentic according to Shia standards. We are considerate of our choice of words too, since there are Shias scholars that may consider it weak since the path to Abu Mikhnaf is questionable. Regardless, we chose to translate in full. We have quoted it from Tareekh Al-Tabari 3\/1052:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3003 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan-150x150.jpg\" alt=\"Scan\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/Scan-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Abu Mikhnaf said: from Ja’afar bin Mohammad bin Ali:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">When Al-Hussain was killed, they found thirty-three stabs and thirty-four wounds. Sinan bin Anas used to forcefully approach anyone that would get near the body because he wanted to be the one that gets the head. He then did, and gave it to Khawli. Everything that was on Al-Hussain was taken. Bahr bin Ka’ab took his parts. Qais bin Al-Ash’ath took his cloak. Qais, then, became known as “The Cloak.” His sandals were taken by a Al-Aswad, a man from Bani Awd. His sword was taken by a man from Bani Nahshal bin Darim, and it reached Habeeb bin Budail at the end.<\/p>\n<p style=\"text-align: justify;\">The people came to his clothes, accessories, and camels, and they took all of it. The people came to the women, the booty, and his equipment, to the extent that a woman would fight over the clothes on her back until it was taken away from her.<\/p>\n<p style=\"text-align: justify;\">\n<\/blockquote>\n<h2 style=\"text-align: justify;\"><strong>5- Popular Retellings of Al-Hussain’s Martyrdom Conflict with the Earliest Shia Versions<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<h3 style=\"text-align: justify;\"><strong>a) Al-Hussain’s Reasons for  heading to Kufa <\/strong><\/h3>\n<p style=\"text-align: justify;\">If one was to simply come across the events that led up to Karbala, one would have no doubt that Al-Hussain’s revolution was intercepted and quelled. His intention, as one can clearly see in the earliest reports, was to fill the land with justice and to politically reign over the nation. This also was the perfect time to do so since he had the support from the people of Kufa that he did not have when Mu&#8217;awiayh was in power.<\/p>\n<p style=\"text-align: justify;\">However, according to the modern Shia interpretation, Al-Hussain knew that he was going to die by going to Kufa. In other words, he was sacrificing his own life for the sake of Islam. Twelvers hold this belief because it fits in with their ideology that the Imams know when they are going to die.<\/p>\n<p style=\"text-align: justify;\">One of the staunchest supporters of this theory is <a href=\"http:\/\/www.al-islam.org\/maqtal-al-husayn-abd-al-razzaq-al-muqarram\/al-husayn-s-prior-knowledge-his-martrydom\" rel=\"external nofollow\">Abdulrazzaq Al-Muqarram<\/a>. He says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">He made many such explicit and implicit statements in Medina, in Mecca, and on the way to Kufa, statements that you will read in this book in their entirety. They all testify that he (‘a), was fully aware of his being killed on the day with which he was familiar and in the land of Karbala’. So, can anyone doubt this fact if he reads his sermon in Mecca when he wanted to travel from there to Iraq? In that sermon, he said, “<em>I can see my limbs being cut to pieces by wild beasts in an area between al-Nawawees<\/em> <em>and Karbala’, so they will fill with my body empty stomachs and starved pouches;<\/em> there is no way to avert an event already decreed.”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">We beg to differ of course. There is no evidence that suggests that Al-Hussain knew of what was to come and there are too many evidences that suggest otherwise.<\/p>\n<h4 style=\"text-align: justify;\">Response to Al-Muqarram<\/h4>\n<p style=\"text-align: justify;\">Below are some points from the earliest version of the events of Karbala by Abu Mikhnaf:<\/p>\n<ul>\n<li style=\"text-align: justify;\">When asked about where he wanted to go after fleeing Madinah, Abdullah bin Mutee’ asked Al-Hussain where he was heading to. Al-Hussain replied: Currently, I am going to Makkah, then I will make <em>istikhara<\/em> (a prayer in which one asks Allah for guidance when making a tough decisions) as to where to head off to next. He also mentions his intention of making <em>istikhara<\/em> to Ibn Abbas (Tareekh Al-Tabari 3\/1012, 3\/1025)<\/li>\n<li style=\"text-align: justify;\">Al-Hussain writes a letter to the people of Kufa in which he states that he will send his cousin Muslim bin Aqeel to verify their need for him, and it is only then when he will make a move to Kufa. (Tareekh Al-Tabari 3\/1013)<\/li>\n<li style=\"text-align: justify;\">Muslim bin Aqeel had no idea that Al-Hussain knew that he was marching towards his doom until the last moments in his life. If Muslim held previous knowledge, he wouldn’t have requested sending a warning to Al-Hussain. (Tareekh Al-Tabari 3\/1022)<\/li>\n<li style=\"text-align: justify;\">Al-Hussain spent four months in Makkah (Tareekh Al-Tabari 3\/1024). He had no reason to spend all that time in Makkah if his purpose was to get killed.<\/li>\n<li style=\"text-align: justify;\">Al-Hussain justifies his leaving towards Kufa because of the letters that he received (Tareekh Al-Tabari 3\/1025)<\/li>\n<li style=\"text-align: justify;\">Al-Hussain asks Al-Farazdaq about the status of the people of Kufa in order to learn if he can trust them. (Tareekh Al-Tabari 3\/1028)<\/li>\n<li style=\"text-align: justify;\">Al-Hussain heads to Kufa with women and children from his family. This is not an action that one would take if one believed that they would be massacred. His intention was to arrive in Kufa, live in Kufa, and reign over it. (Tareekh Al-Tabari 3\/1029)<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h4>One More Piece of Evidence<\/h4>\n<p style=\"text-align: justify;\">Out of all the above, this is the most important narration that solidifies the view that Al-Hussain had no idea what he was getting himself into:<\/p>\n<p style=\"text-align: justify;\">Abu Mikhnaf states: As for what was told to me by Mujalid bin Sa’eed, Al-Saq’ab bin Zuhair Al-Asadi, and others of the traditionalists, and this is the view of the community of the traditionalists, is that he (Al-Hussain) said: Choose one out of three things for me: Either I go back from whence I came, or I put my hand in the hand of Yazeed and we settle this ourselves, or you send me to a Muslim border town and I live amongst them. (Tareekh Al-Tabari 3\/1036)<\/p>\n<p style=\"text-align: justify;\">This statement speaks volumes, it shows that when al-Hussein faced the army of Omar bin Sa’ad he wished to settle things peacefully and return safely with his family. It suggests that Al-Hussain was not only having second thoughts, but changed his mind about the rebellion once he realized that he was outnumbered and that he was marching towards not only his death, but the massacre of his own family.<\/p>\n<h3><strong>b) The Actions of Abu Al-Fadl Al-Abbas in Karbala<\/strong><\/h3>\n<p style=\"text-align: justify;\">According to popular retellings today, there is no character that is blown out of proportion as Abu Al-Fadhl Al-Abbas bin Ali bin Abi Talib. The tragic story of his death during battle has captured the hearts and minds of all Shias around the world, to the extent that Al-Abbas is referred to by the extreme Shia as Bab Al-Hawa’ij (The Door to Needs). Extreme Shias, sadly, ask him for their sustenance and have turned him into a godly figure.<\/p>\n<p style=\"text-align: justify;\">The modern Shia, when asked about Abu Al-Fadhl Al-Abbas will tell you that the army of Omar bin Sa’ad prevented Al-Hussain and his companions, who were dying of thirst, from drinking from a water resource nearby. Al-Abbas, headed over to gather some water and was confronted by the army of Omar bin Sa’ad. Al-Abbas bravely challenged thousands of men, killing tens, if not hundreds, if not thousands, depending on who you ask. Then, Al-Abbas’ arm was cut off during the battle. However, he continued to fight. Then, his other arm was cut off. Al-Abbas continued to head towards Al-Hussain’s camp with the container of water clenched between his teeth, but alas, the army of Omar bin Sa’ad killed him before he could make it back. <a href=\"https:\/\/www.youtube.com\/watch?v=ZtCHMX56CjA\" rel=\"external nofollow\">This scene<\/a> has been translated into film and is seen as an accurate representation of the events by the modern Shia.<\/p>\n<h4 style=\"text-align: justify;\">Original Version?<\/h4>\n<p style=\"text-align: justify;\">However, the narration of Abu Mikhnaf, the earliest Shia version, conflicts with this version completely.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/karbala.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3004 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/01\/karbala-150x150.jpg\" alt=\"karbala\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/karbala-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/karbala-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/karbala-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/01\/karbala-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>First of all, Al-Abbas does not go to retrieve water alone, but is accompanied by thirty riders and twenty foot-soldiers. Furthermore, there is no mention of any casualties, with the exception of one of the companions of Amr bin Al-Hajjaj, from the army of Omar bin Sa’ad. He was stabbed by Nafi’ bin Hilal. The narration ends with Al-Abbas and Nafi’ succeeding in retrieving the water. Al-Abbas never has his arms cut off, nor is he portrayed as a one-man army. (Tareekh Al-Tabari 3\/1036)<\/p>\n<p style=\"text-align: justify;\">It is important to be aware Al-Abbas is only mentioned in battle once more in the narration of Abu Mikhnaf (Tareekh Al-Tabari 3\/1050) and there is no mention of any superhuman strength. He makes no other appearances or contributions.<\/p>\n<h3><strong>c) Did Al-Hussain save Islam? <\/strong><\/h3>\n<p style=\"text-align: justify;\">This is a question that Shias do not pose to themselves, even though it is often heard on pulpits that Al-Hussain’s rebellion saved Islam.<\/p>\n<p style=\"text-align: justify;\">The origin of this reasoning is the suggestion that Yazeed was so corrupt that his reign would lead to the complete destruction of Islam and the erasure of Shari’ah law.<\/p>\n<p style=\"text-align: justify;\">Of course, such arguments cannot be supported with any evidence. Shias often attempt to provide narrations that suggest that Yazeed was a womaniser or a drunkard. However, neither sin is anywhere as severe as denying the Imamate of the Imam, let alone the usurpation of the position of the Imam. Hence, by Shia standards, Abu Bakr and Omar are infinitely worse than Yazeed, for the latter only came to power through inheritance, while Abu Bakr and Omar actively took Ali’s &#8220;divinely ordained rights&#8221;. In other words, Al-Hussain’s rise against Yazeed could not logically have anything to do with immoral behaviour by Yazeed.<\/p>\n<p style=\"text-align: justify;\">Next, we ask, how did Al-Hussain save the Shari’ah? Al-Hussain was not able take the reins of the nations from Yazeed, and eventually, a few years later, Yazeed died from natural causes.<\/p>\n<p style=\"text-align: justify;\">Al-Hussain’s rebellion did not cause a ripple in the ideology of the Muslims of the time, nor did it change the political situation. For the next ninety years, Bani Umayyah stayed in power. The rest of the Twelve Imams disappeared from the lime lights of early Islamic politics. It is not logical to conclude that Al-Hussain was politically victorious or that he was able to save Islam, nor was there anything special about Yazeed for one to assume that Islam was in a great new danger in the first place. The only victory for Al-Hussain is his martyrdom and the rewards that Allah will bestow upon him for  attaining that martyrdom.<\/p>\n<h3><strong>d) Al-Hussain&#8217;s Final Advice to Sayeda Zainab<\/strong><\/h3>\n<p style=\"text-align: justify;\">In the earliest narration by Abu Mikhnaf, when Al-Hussain realized that he was going to battle, he said to Sayeda Zainab: “O’ sister, do not break what I swore, for you shall not tear your pockets, scratch your face, or call for death upon yourself because of what becomes of me.” (Tareekh Al-Tabari 3\/1039)<\/p>\n<p style=\"text-align: justify;\">In modern times, <a href=\"http:\/\/www.al-islam.org\/maqtal-al-husayn-abd-al-razzaq-al-muqarram\" rel=\"external nofollow\">Abdulrazzaq Al-Muqarram<\/a> calls for the exact opposite. He says: “The things that remind people of al-Husayn (‘a), in their various methods, such as commemorative <em>majalis<\/em>, mournings, beating the cheeks at homes and in the streets&#8230;, help promote the sect.” He also provides late narrations to support this position.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2><strong>6- The Real Tragedy<\/strong><\/h2>\n<p style=\"text-align: justify;\">Since we have established two different accounts, examining the claims as to what makes a greater tragedy is necessary. As we have pointed out, the modern Shia position is that Al-Hussain knowingly sacrificed himself for the greater good. Not only that, but he sacrificed his family, by bringing them along with him to get sacrificed by the army.<\/p>\n<p style=\"text-align: justify;\">Contemporary Shias like Al-Muqarram argue that Al-Hussain brought women with him as witnesses. Their role was to speak of what they saw, in order to expose Yazeed and his actions. Yet, this argument does not stand, for it cannot be applied to the children, like Abdullah the infant, as well as the children of Abdullah bin Jafa’ar bin Abi Talib, whom Al-Hussain brought along to be sacrificed along with him.<\/p>\n<h3 style=\"text-align: justify;\">The Sunni View<\/h3>\n<p style=\"text-align: justify;\">The Sunni position states that Al-Hussain’s martyrdom was a tragedy due to the circumstances. The view held by Sunnis is supported by the earliest Shia position, as per the narration of Abu Mikhnaf,<\/p>\n<p style=\"text-align: justify;\">Al-Hussain was enticed into joining the people of Kufa by the pleas of their people. Were it not for their pleas, he wouldn’t have been a victim. Continuing on, the people of Kufa ditched Al-Hussain out of fear for their own safety. Most importantly, as soon as Al-Hussain realized his predicament, he wishes for his safety and the safety of his family. He appeals to the religiosity of his opponents. Al-Hussain asks them to be sent to Yazeed directly, or to be left to go back from whence he came. However, the pride and tyranny of Umar bin Sa&#8217;ads army outweighed their humanity. Ultimately, they killed Al-Hussain, who did not wish for any bloodshed.<\/p>\n<p style=\"text-align: justify;\">Al-Hurr bin Yazeed puts it perfectly when he cries: “Don’t you accept from these men what they propose?! If the Turks and the Daylam requested this, it would have been impermissible to reject them!”<\/p>\n<p style=\"text-align: justify;\">That is the tragedy and peace be upon al-Hussein our master.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The martyrdom of Al-Hussain at Karbala has truly become a tale of epic proportions. It would not be an outrageous claim if one were to suggest that across the globe there is a continuous matam&#8230;. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" title=\"Karbala &#8211; the Facts and the Fairy-tales\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3820,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15],"tags":[24],"class_list":{"0":"post-2999","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-featured-posts","8":"tag-karbala"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2999","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=2999"}],"version-history":[{"count":18,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2999\/revisions"}],"predecessor-version":[{"id":3537,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/2999\/revisions\/3537"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3820"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=2999"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=2999"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=2999"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}