{"id":3016,"date":"2016-02-22T20:32:15","date_gmt":"2016-02-22T20:32:15","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3016"},"modified":"2017-02-14T12:37:51","modified_gmt":"2017-02-14T12:37:51","slug":"the-vague-appointment-of-ali","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/02\/22\/the-vague-appointment-of-ali\/","title":{"rendered":"The Vague Appointment of `Ali"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3016\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Imami Shia claim and base their entire religion on the appointment of `Ali bin abi Talib through a divine text as leader of mankind after Rasul-Allah (saw). When asked for evidence they will throw any virtue they find for `Ali in the faces of their opponents but most of these texts do not include any signs of him being appointed. The main two narrations relied upon in this regard by the Imami Shia are:<\/p>\n<p style=\"text-align: justify;\">a- Hadith al-Ghadeer: A vague text that can be given a plethora of valid interpretations and thus does not constitute solid evidence especially when taking into consideration the context, such as: Location and circumstances.<\/p>\n<p style=\"text-align: justify;\">b- Hadith al-Manzilah: A vague text that rather seems to point to the opposite of what Imami Shia claim and this is reinforced by its context and the circumstances in which it took place.<\/p>\n<p style=\"text-align: justify;\">We wonder though, since Imami Shia believe in twelve Imams not just one, did they all appoint their successors through vague and unclear texts? Or was it only our Prophet (saw) who had the misfortune of not picking the right time along with the worst choice of words? (Sarcasm)<\/p>\n<p style=\"text-align: justify;\">In order to know this we refer to the books of the Shia and turn our attention to a book that specializes in this matter, Al-Khazzaz al-Qummi (d.400 AH) wrote a book called &#8220;Kifayat al-Athar&#8221; in order to prove the legitimacy of the leadership of the 12 men, he made sure to include texts of appointment for each man, we will quote from this the relevant sections while omitting chains. We may also quote a few from al-Kafi by al-Kulayni.<\/p>\n<p style=\"text-align: justify;\">Bismillah,<\/p>\n<p style=\"text-align: justify;\"><strong>1- `Ali ibn abi Talib:<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/180<\/p>\n<p style=\"text-align: justify;\">يا بني أنت ولي الأمر<\/p>\n<p style=\"text-align: justify;\">When `Ali was on his death bed, he approached his son Al-Hasan and said “O’ my son, you are the person of authority.”<\/p>\n<p style=\"text-align: justify;\"><strong>2- Al-Hasan bin `Ali:<\/strong><\/p>\n<p style=\"text-align: justify;\">He says,<\/p>\n<p style=\"text-align: justify;\">الأئمة بعد رسول الله صلى الله عليهوآله وسلم اثنا عشر، تسعة من صلب أخي الحسين<\/p>\n<p style=\"text-align: justify;\">&#8220;The leaders after the messenger of Allah (saw) are twelve, nine from the progeny of my brother al-Husayn.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/182<\/p>\n<p style=\"text-align: justify;\">واختارني علي عليه السلام بالإمامة، واخترت أنا الحسين عليه السلام<\/p>\n<p style=\"text-align: justify;\">Al-Hasan said to Ibn Al-Hanafiyyah: “`Ali chose me for <i>leadership<\/i>, and I choose Al-Husayn.”<\/p>\n<p style=\"text-align: justify;\"><strong>3- Al-Husayn bin `Ali:<\/strong><\/p>\n<p style=\"text-align: justify;\">He says,<\/p>\n<p style=\"text-align: justify;\">أخبرك يا أخا العرب، إن الإمام والخليفة بعد رسول الله صلى الله عليه وآله وسلم أمير المؤمنين علي عليه السلام والحسن وأنا وتسعة من ولدي منهم علي ابني<\/p>\n<p style=\"text-align: justify;\">&#8220;I shall tell you my Arab brother, the leader and successor after the messenger of Allah (saw) is the cheif of believers `Ali (as) and al-Hasan and myself, then nine of my descendants including this son of mine `Ali.&#8221;<\/p>\n<p style=\"text-align: justify;\">He was also asked,<\/p>\n<p style=\"text-align: justify;\">فقلت: بأبي وأمي يا ابن رسول الله إن كان ما نعوذ بالله أن نراه فيك فإلى من؟ قال: إلى علي ابني هذا، هو الإمام وأبو الأئمة<\/p>\n<p style=\"text-align: justify;\">&#8220;I said: May my parents be a ransom for you O son of Rasul-Allah (saw), if what we fear for you takes place then who shall succeed you? He replied: &#8220;It goes to my son `Ali, he is the leader and the father of the leaders.&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>4- `Ali bin Husayn:<\/strong><\/p>\n<p style=\"text-align: justify;\">He says about al-Baqir,<\/p>\n<p style=\"text-align: justify;\">يا بني إن الإمامة في ولده إلى أن يقوم قائمنا عليه السلام فيملأها قسطا وعدل وأنه الإمام أبو الأئمة معدن الحلم وموضع العلم يبقره بقرا<\/p>\n<p style=\"text-align: justify;\">&#8220;O son, leadership is in his (al-Baqir&#8217;s) progeny until that one rises (as) so he may fill it with justice, he (al-Baqir) is the leader, father of leaders, the essence of gentleness and the place of deep knowledge.&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>5- Muhammad bin `Ali:<\/strong><\/p>\n<p style=\"text-align: justify;\">He said that the leaders are twelve after the Messenger (saw) then listed them until he said,<\/p>\n<p style=\"text-align: justify;\">وأنا ثم بعدي هذا ووضع يده على كتف جعفر<\/p>\n<p style=\"text-align: justify;\">&#8220;ِAnd myself, then after me (in leadership) is this one, and he placed his hand on Ja`far&#8217;s shoulder.&#8221;<\/p>\n<p style=\"text-align: justify;\">A man asks him who shall succeed him in leadership,<\/p>\n<p style=\"text-align: justify;\">فإن كان هذا كائن يا ابن رسول الله فإلى من بعدك؟ قال:إلى جعفر وهو سيد أولادي وأبو الأئمة، صادق في قوله وفعله<\/p>\n<p style=\"text-align: justify;\">If something should happen O son of Rasul-Allah (saw), then who is after you? He replied: &#8220;To Ja`far, he is the master of my children and the father of the leaders, truthful in his words and actions.&#8221;<\/p>\n<p style=\"text-align: justify;\">Muhammad bin Muslim sat with al-Baqir when his son Ja`far came in, so al-Baqir said,<\/p>\n<p style=\"text-align: justify;\">يا محمد هذا إمامك بعدي فاقتد به واقتبس من علمه<\/p>\n<p style=\"text-align: justify;\">&#8220;O Muhammad, this is your leader after me, so follow his example and take from his knowledge.&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>6- Ja`far bin Muhammad:<\/strong><\/p>\n<p style=\"text-align: justify;\">Says that the leaders are twelve then counts until he says,<\/p>\n<p style=\"text-align: justify;\">ثم أنا، وبعدي موسى ولدي<\/p>\n<p style=\"text-align: justify;\">&#8220;Then myself, and after me is my son Musa&#8221;<\/p>\n<p style=\"text-align: justify;\">He was asked,<\/p>\n<p style=\"text-align: justify;\">قلت: فمن بعدك يا ابن رسول الله؟ قال: إني قد أوصيت إلى ولدي موسى وهو الإمام بعدي<\/p>\n<p style=\"text-align: justify;\">I said: Who is after you O son of Rasul-Allah (saw)? He (as) replied: &#8220;I have tasked my son Musa with the execution of my will and he is the leader after me.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/309<\/p>\n<p style=\"text-align: justify;\">قُلْتُ لَهُ إِنْ كَانَ كَوْنٌ وَ لَا أَرَانِي اللَّهُ ذَلِكَ فَبِمَنْ أَئْتَمُّ قَالَ فَأَوْمَأَ إِلَى ابْنِهِ مُوسَى<\/p>\n<p style=\"text-align: justify;\">He was asked: If a tragedy should happen then who should I follow as leader? He (Ja`far) pointed towards his son Musa.<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/310<\/p>\n<p style=\"text-align: justify;\">دَعَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَبَا الْحَسَنِ ( عليه السلام ) يَوْماً وَ نَحْنُ عِنْدَهُ فَقَالَ لَنَا عَلَيْكُمْ بِهَذَا فَهُوَ وَ اللَّهِ صَاحِبُكُمْ بَعْدِي<\/p>\n<p style=\"text-align: justify;\">One day, Aba `Abdillah (as) called on aba all-Hasan (as) while we sat around him then told us: &#8220;By Allah, stick with this one for he is the one you shall accompany after me.&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>7- Musa bin Ja`far:<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/190<\/p>\n<p style=\"text-align: justify;\">اشهدوا أن ابني هذا وصيي والقيم بأمري وخليفتي من بعدي<\/p>\n<p style=\"text-align: justify;\">Al-Kadhim said: “Bare witness that this son of mine is the executor of my will, the one in charge of my affair and my successor after me.”<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/312<\/p>\n<p style=\"text-align: justify;\">فَأَشَارَ إِلَى ابْنِهِ أَبِي الْحَسَنِ ( عليه السلام ) فَقَالَ هَذَا صَاحِبُكُمْ مِنْ بَعْدِي<\/p>\n<p style=\"text-align: justify;\">When asked He pointed to his son abu al-Hasan (as) and said: &#8220;This is the one you shall accompany after me.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/313<\/p>\n<p style=\"text-align: justify;\">فَأَخْبِرْنِي مَنِ الْإِمَامُ بَعْدَكَ فَقَالَ ابْنِي فُلَانٌ يَعْنِي أَبَا الْحَسَنِ<\/p>\n<p style=\"text-align: justify;\">He was asked: Inform me of the leader after you. He responded: This son of mine meaning aba al-Hasan.<\/p>\n<p style=\"text-align: justify;\"><strong>8- `Ali bin Musa:<\/strong><\/p>\n<p style=\"text-align: justify;\">He said to his companion,<\/p>\n<p style=\"text-align: justify;\">يا دعبل الإمام بعدي محمد ابني<\/p>\n<p style=\"text-align: justify;\">&#8220;O Da`bal, the leader after me is my son Muhammad.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/320<\/p>\n<p style=\"text-align: justify;\">When asked,<\/p>\n<p style=\"text-align: justify;\">فَقَالَ لِي الْإِمَامُ ابْنِي<\/p>\n<p style=\"text-align: justify;\">He told me: The leader is my son. (He had no son except Muhammad according to al-Mufid)<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/321<\/p>\n<p style=\"text-align: justify;\">فَلَا أَرَانَا اللَّهُ يَوْمَكَ فَإِنْ كَانَ كَوْنٌ فَإِلَى مَنْ فَأَشَارَ بِيَدِهِ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ هُوَ قَائِمٌ بَيْنَ يَدَيْهِ فَقُلْتُ جُعِلْتُ فِدَاكَ هَذَا ابْنُ ثَلَاثِ سِنِينَ فَقَالَ وَ مَا يَضُرُّهُ مِنْ ذَلِكَ فَقَدْ قَامَ عِيسَى ( عليه السلام ) بِالْحُجَّةِ وَ هُوَ ابْنُ ثَلَاثِ سِنِينَ<\/p>\n<p style=\"text-align: justify;\">They said to him: May we not see that day (when you die) but if it comes then to who shall it pass? He (as) pointed to his son abu Ja`far (as) who stood in front of him, I said: May I be your ransom, this is a three year old kid? He (as) answered: &#8220;No harm, `Isa (as) established the argument while at the age of three.&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>9- Muhammad bin `Ali:<\/strong><\/p>\n<p style=\"text-align: justify;\">الإمام بعدي ابني علي، أمره أمري وقوله قولي وطاعته طاعتي<\/p>\n<p style=\"text-align: justify;\">He said: &#8220;The leader after me is my son `Ali, his command is mine, his word is mine and his obedience is my obedience.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/323<\/p>\n<p style=\"text-align: justify;\">الْأَمْرُ مِنْ بَعْدِي إِلَى ابْنِي عَلِيٍّ<\/p>\n<p style=\"text-align: justify;\">He said: &#8220;The one in charge of the affair after me is my son `Ali.&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>10- `Ali bin Muhammad:<\/strong><\/p>\n<p style=\"text-align: justify;\">He said,<\/p>\n<p style=\"text-align: justify;\">الإمام بعدي الحسن ابني، وبعد الحسن ابنه القائم<\/p>\n<p style=\"text-align: justify;\">&#8220;The leader after me is my son al-Hasan, and after al-Hasan is his son who shall rise.&#8221;<\/p>\n<p style=\"text-align: justify;\">And he said,<\/p>\n<p style=\"text-align: justify;\">الخلف من بعدي ابني الحسن<\/p>\n<p style=\"text-align: justify;\">&#8220;The successor after me is my son al-Hasan.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/326<\/p>\n<p style=\"text-align: justify;\">فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ هَذَا صَاحِبُنَا بَعْدَكَ فَقَالَ لَا صَاحِبُكُمْ بَعْدِيَ الْحَسَنُ<\/p>\n<p style=\"text-align: justify;\">I said to him: May I be your ransom, is this the one we must accompany after you? He answered: &#8220;No, your companion after me is al-Hasan.&#8221;<\/p>\n<p style=\"text-align: justify;\">As for al-`Askari mentioning his hidden son, we won&#8217;t include it out of respect for the reader&#8217;s intellect.<\/p>\n<p style=\"text-align: justify;\">So here we observe, that the Shia narrations above are very clear in that a man appointed another as leader, the texts are too explicit and cannot be given any interpretations other than that a certain individual was indeed awarded leadership and given authority.<\/p>\n<p style=\"text-align: justify;\">Even though we as Muslims believe all such texts are late fabrications by some Koufans and Qummies, yet at least the fabricators of these texts knew well enough what words they must use to establish their beliefs clearly. This is why in Shia books you will find other texts of appointment for `Ali that are explicit since the Shia themselves were never satisfied with Ghadeer or Manzilah.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Imami Shia claim and base their entire religion on the appointment of `Ali bin abi Talib through a divine text as leader of mankind after Rasul-Allah (saw). When asked for evidence they will throw any virtue they find for `Ali <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/02\/22\/the-vague-appointment-of-ali\/\" title=\"The Vague Appointment of `Ali\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3833,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,5],"tags":[48],"class_list":{"0":"post-3016","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-imamah","10":"tag-imamate"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3016","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3016"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3016\/revisions"}],"predecessor-version":[{"id":3065,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3016\/revisions\/3065"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3833"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3016"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3016"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3016"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}