{"id":3026,"date":"2016-02-11T21:34:31","date_gmt":"2016-02-11T21:34:31","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3026"},"modified":"2018-01-04T16:12:02","modified_gmt":"2018-01-04T16:12:02","slug":"aishas-jealousy-and-surat-al-tahreem","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/02\/11\/aishas-jealousy-and-surat-al-tahreem\/","title":{"rendered":"A&#8217;isha&#8217;s Jealousy and Surat Al-Tahreem"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3026\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Unlike our usual content, in which we provide refutation upon refutation to every little point that is brought up by Shias, in this article, we will briefly be discussing the jealousy of the Mother of Believers A’isha and the verses of Surat Al-Tahreem.<\/p>\n<p style=\"text-align: justify;\">According to the Merriam-Webster’s Definition of Jealousy page, we find that jealousy is described as: “an unhappy or angry feeling caused by the belief that someone you love (such as your husband or wife) likes or is liked by someone else.”<\/p>\n<p style=\"text-align: justify;\">To make matters even clearer to readers, we have taken it upon ourselves to study A’ishas behavior in other hadiths. The theme of jealousy was not uncommon.<\/p>\n<h2 style=\"text-align: justify;\"><strong>A’isha’s Admittance of her Jealousy<\/strong><\/h2>\n<p style=\"text-align: justify;\">Before getting into that, we remind our readers that A’isha herself narrated from the Prophet – peace be upon him &#8211; that he said: “The best from amongst you are those that are the best of you to your wives, and I am the best from amongst you with his wives.” Sunan Al-Tirmithi #3830. Al-Tirmithi authenticates this narration.<\/p>\n<p style=\"text-align: justify;\">It is needless to say that the Prophet’s – peace be upon him – had the best of qualities and was revered for it by all those that surrounded him. It was not hard for those that were close to him to get attached to his nature and his wives were very much in love with him because of those qualities.<\/p>\n<p style=\"text-align: justify;\">The jealousy of A’isha was not a well kept secret. Decades after the death of the Prophet – peace be upon him – she would tell her nephew Urwa of how her jealousy drove her actions when she was much younger. In Saheeh Al-Bukhari #5565, a group of Jews pass by the Prophet – peace be upon him – and say, “Al-Saam (death) be upon you” A’isha cursed them intensely by saying, “Al-Saam and curses be upon you.” The Prophet – peace be upon him – calms her down and advises her to show kindness even when faced with such people.<\/p>\n<p style=\"text-align: justify;\">In Saheeh Muslim #5030, during A’isha’s “night”, the Prophet – peace be upon him – left her. When he returned, he asked, “What is wrong A’isha? Were you jealous (that I left)?” She said: “How could someone like me not be made jealous over someone like you?!” In a similar narration in Saheeh Muslim #750 she states that she thought that the Prophet – peace be upon him – went to one of his other wives, and that drove her check up on him.<\/p>\n<p style=\"text-align: justify;\">A’isha was immensely jealous of Khadijah, the deceased wife of the Prophet – peace be upon him &#8211; , since he had not loved any of his wives as much as he loved Khadijah. A’isha in Saheeh Al-Bukhari #3532 said, “I was not jealous of any of the Prophet’s – peace be upon him – wives as much as I was made jealous by Khadijah,” for the Prophet – peace be upon him – used to praise her even after her death. In another narration in Al-Bukhari #3536, A’isha describes that she was jealous by the visitation of Khadijah’s sister Haala, in which the Prophet – peace be upon him – seemed overjoyed since she reminded him of Khadijah. A’isha, driven by jealousy, comments that Allah has replaced his “old wife” with a new one that is better than the old one.<\/p>\n<p style=\"text-align: justify;\">Some narrations are even more explicit than others. In Saheeh Al-Bukhari #5234, A’isha complains of a severe headache. The Prophet – peace be upon him – aware of his close death said, “If that happened while I was alive, I would ask forgiveness for you and supplicate to Allah for you.” She said, “I think you would like it for me to die, and if that happened, you would be having intercourse with one of your wives during that very night.”<\/p>\n<p style=\"text-align: justify;\">In one narration by Anas in Saheeh Al-Bukhari #4824, the Prophet – peace be upon him – was in the house of A’isha when Um Salama sent some food to him. A’isha was filled with so much jealousy, that she broke the plate that the food was sent on. The Prophet – peace be upon him – did not rebuke her. He empathized with her and simply said to those that were present, “Your mother (of the believers) was made jealous.”<\/p>\n<p style=\"text-align: justify;\">Though, as we’ve mentioned above, what really got to A’isha was that there were always a fear of an additional woman that she would have to share her husband with. She narrates in an authentic chain in Musnad Ahmad #25161 that Juwairiyah was a beautiful woman and that A’isha hated her as soon as she saw her because she knew that the Prophet – peace be upon him – would be attracted to her. Of course, her fears were confirmed when he eventually married her soon after.<\/p>\n<p style=\"text-align: justify;\">In one heart-warming narration from Saheeh Al-Bukhari #4810, A’isha and <a href=\"http:\/\/www.twelvershia.net\/2016\/02\/13\/hafsa-in-the-eyes-of-sunnis-and-shias\/\">Hafsa<\/a> are travelling with the Prophet – peace be upon him – while the rest of his wives were in Madinah, meaning that they would get more alone time with him. While on the way, Hafsa suggested to A’isha that they should switch camels. A’isha did not mind doing so. Though, it was night and the Prophet – peace be upon him – could not make them out. He approached A’isha’s camel thinking that it was being ridden by her. He met Hafsa, greeted her, and continued until they got off their camels, and perhaps even entered camp. A’isha, filled with jealousy, got on the ground and cried, “O’ Allah, send a scorpion or a snake to bite me, for I am powerless to say anything to him!”<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Reasons for A’isha’s Jealousy<\/strong><\/h2>\n<p style=\"text-align: justify;\">The very definition is often ignored by Shias when dissecting the actions of A’isha and turning them against her, since much of her actions were driven by her extreme attachment to the Prophet – peace be upon him – and her love for him.<\/p>\n<p style=\"text-align: justify;\">The factors that drove this jealousy were many. Perhaps the most obvious of these factors is that the Prophet – peace be upon him – was married to multiple women. Now, having to share a man with one other woman is bad enough, let alone having to share her with several women. Keep in mind that the Prophet – peace be upon him – was fair with his wives and would give each one of his wives a “night”. With that in mind, it was uncommon for A’isha to not be with her husband for a whole week.<\/p>\n<p style=\"text-align: justify;\">Another factor was the age of A’isha. As we find in authentic reports in the Saheehain through Urwa bin Al-Zubair and Al-Aswad, A’isha was nine years old when her marriage to the Prophet – peace be upon him – was consummated. With that in mind, she was the only teenager from amongst his wives. By the time the Prophet – peace be upon him – passed away, A’isha was around eighteen years old.<\/p>\n<p style=\"text-align: justify;\">Another factor was that A’isha was the only virgin from amongst the wives of the Prophet – peace be upon him &#8211; . The rest of his wives were either divorced or widows. That perhaps made it easier for them to cope with having to share him, since they were married before, and were thankful that they had the chance to be married again.<\/p>\n<p style=\"text-align: justify;\">An important factor to keep in mind is that A’isha was one of the earliest marriages. After the death of Khadijah, the Prophet – peace be upon him – first married Sawda bint Zum’a, who was in her fifties, then married A’isha. So, for A’isha, things simply grew worse every once in a while when the Prophet – peace be upon him – got married to someone new. It isn’t so hard to understand that the first wife, in a regular marriage, would be filled with a lot more jealousy than the fourth wife, who is entering a marriage while being fully aware that she has to share her husband with three other women.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Context of Surat Al-Tahreem 1-12<\/strong><\/h2>\n<p style=\"text-align: justify;\">Surat Al-Tahreem is often quoted by Shias in order to attack A’isha and <a href=\"http:\/\/twelvershia.net\/2016\/02\/13\/hafsa-in-the-eyes-of-sunnis-and-shias\/\" rel=\"external nofollow\">Hafsa<\/a>. Firstly, it is important to be aware of the verses in question. Then, we will briefly provide the Shia argument, and end it off with providing the context behind the verses.<\/p>\n<p style=\"text-align: justify;\">The verses from <a href=\"http:\/\/www.searchtruth.com\/chapter_display.php?chapter=66&amp;translator=5&amp;mac=\" rel=\"external nofollow\">Surat Al-Tahreem 1-12<\/a> are as follows:<\/p>\n<ol style=\"text-align: justify;\">\n<li style=\"text-align: justify;\">O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you, seeking to please your wives? And Allah is Oft-Forgiving, Most Merciful.<\/li>\n<li style=\"text-align: justify;\">Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Maula (Lord, or Master, or Protector) and He is the All-Knower, the All-Wise.<\/li>\n<li style=\"text-align: justify;\">And (remember) when the Prophet (صلى الله عليه وسلم) disclosed a matter in confidence to one of his wives (Hafsah), then she told it (to another i.e. &#8216;Aishah). And Allah made it known to him; he informed part thereof and left a part. Then when he told her (Hafsah) thereof, she said: &#8220;Who told you this?&#8221; He said: &#8220;The All-Knower, the All-Aware (Allah) has told me.&#8221;<\/li>\n<li style=\"text-align: justify;\">If you two (wives of the Prophet صلى الله عليه وسلم : &#8216;Aishah and Hafsah رضي الله عنهما) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet صلى الله عليه وسلم likes); but if you help one another against him (Muhammad صلى الله عليه وسلم), then verily, Allah is his Maula (Lord, or Master, or Protector), and Jibril (Gabriel), and the righteous among the believers; and furthermore, the angels are his helpers.<\/li>\n<li style=\"text-align: justify;\">It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you &#8211; Muslims (who submit to Allah), believers, obedient (to Allah), turning to Allah in repentance, worshipping Allah sincerely, given to fasting or emigrants (for Allah&#8217;s sake), previously married and virgins.<\/li>\n<li style=\"text-align: justify;\">O you who believe! Ward off yourselves and your families against a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not, (from executing) the Commands they receive from Allah, but do that which they are commanded.<\/li>\n<li style=\"text-align: justify;\">(It will be said in the Hereafter) O you who disbelieve (in the Oneness of Allah &#8211; Islamic Monotheism)! Make no excuses this Day! You are being requited only for what you used to do.<\/li>\n<li style=\"text-align: justify;\">O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will expiate from you your sins, and admit you into Gardens under which rivers flow (Paradise) &#8211; the Day that Allah will not disgrace the Prophet (Muhammad صلى الله عليه وسلم) and those who believe with him. Their Light will run forward before them and (with their Records &#8211; Books of deeds) in their right hands. They will say: &#8220;Our Lord! Keep perfect our Light for us [and do not put it off till we cross over the Sirat (a slippery bridge over the Hell) safely] and grant us forgiveness. Verily, You are Able to do all things.&#8221;<\/li>\n<li style=\"text-align: justify;\">O Prophet (Muhammad صلى الله عليه وسلم)! Strive hard against the disbelievers and the hypocrites, and be severe against them; their abode will be Hell, and worst indeed is that destination.<\/li>\n<li style=\"text-align: justify;\">Allah sets forth an example for those who disbelieve: the wife of Nuh (Noah) and the wife of Lut (Lot). They were under two of our righteous slaves, but they both betrayed them (their husbands by rejecting their doctrine). So they [Nuh (Noah) and Lut (Lot) عليهما السلام] availed them (their respective wives) not against Allah and it was said: &#8220;Enter the Fire along with those who enter!&#8221;<\/li>\n<li style=\"text-align: justify;\">And Allah has set forth an example for those who believe: the wife of Fir&#8217;aun (Pharaoh), when she said: &#8220;My Lord! Build for me a home with You in Paradise, and save me from Fir&#8217;aun (Pharaoh) and his work, and save me from the people who are Zalimun (polytheists, wrong-doers and disbelievers in Allah).<\/li>\n<li style=\"text-align: justify;\">And Maryam (Mary), the daughter of &#8216;Imran who guarded her chastity. And We breathed into (the sleeve of her shirt or her garment) through Our Ruh [i.e. Jibril (Gabriel) ], and she testified to the truth of the Words of her Lord [i.e. believed in the Words of Allah: &#8220;Be!&#8221; &#8211; and he was; that is &#8216;Îsa (Jesus), son of Maryam (Mary) as a Messenger of Allah], and (also believed in) His Scriptures, and she was of the Qanitun (i.e. obedient to Allah) .<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">Shias, often go out of their way in order to prove that these verses suggest that A’isha and Hafsa were disbelievers.<\/p>\n<p style=\"text-align: justify;\">Though, one should always start by examining the context of the verses which can be found in Saheeh Al-Bukhari #2288 which is narrated by Ibn Abbas through Omar and A’isha. The narration starts off with Ibn Abbas asking Omar about the two women that are described in the verses above, suggesting that this was not common knowledge amongst the companions of the Prophet – peace be upon him – even though many years have passed since the incident. Omar did not hold back by hiding the name of his beloved daughter, but immediately stated that the verses were about Hafsa and A’isha. He then carried on with the narration, stating that he had issues with his wife’s attitude, since she has become aggressive ever since coming to Madinah, since the women in Madinah were not as submissive as the Makkan women. His wife then lashed back at him one day, while claiming that the wives of the Prophet – peace be upon him – would talk back to him and would give him the silent treatment. Omar, shocked, rushed to Hafsa, wondering if she treated the Prophet – peace be upon him – in such a manner. She admitted that she did. Omar, then, advised her not do so, then went back home. Then, one night, there was a knock on the door, and Omar opened up to hear news that the Prophet – peace be upon him – divorced his wives. Omar entered upon Hafsa and found her crying. Hafsa then said that she was not unsure if he did.<\/p>\n<p style=\"text-align: justify;\">Omar then explained to Ibn Abbas that the Prophet – peace be upon him – isolated himself from his wives for twenty-nine days, and that he did this when Hafsa shared her “secret” with A’isha.<\/p>\n<p style=\"text-align: justify;\">Even though Omar does not go into the details of what happened, A’isha herself does include those details in another hadith in Saheeh Al-Bukhari #4531. She states that the Prophet – peace be upon him – used to drink honey when he was at Zaynab bin Jahsh’s house. So, A’isha and Hafsa, driven by jealousy, agreed to ask him if he ate <em>maghafeer<\/em>, which is a plant with a foul smell. When Hafsa carried that out, the Prophet – peace be upon him – decided to forbid honey upon himself.<\/p>\n<p style=\"text-align: justify;\">Why did he do this? It was out of his love for Hafsa.<\/p>\n<p style=\"text-align: justify;\">The first verse in Surat Al-Tahreem states: O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you, seeking to <strong>please your wives?<\/strong><\/p>\n<p style=\"text-align: justify;\">He then said, “I swear that you will not tell anyone about this.”<\/p>\n<p style=\"text-align: justify;\">Hafsa, however, did speak of this to A’isha, as Omar stated above, and thus, the verses were revealed.<\/p>\n<p style=\"text-align: justify;\">By returning to Saheeh Al-Bukhari #2288 we find the conclusion of the events. It was after those twenty-nine days that Allah revealed the Verse of <em>Takhyeer<\/em>, in which the Prophet – peace be upon him – gave his wives the option to choose to a divorce. The Prophet – peace be upon him – suggested that she should consult her parents before making a decision, he then recited:<\/p>\n<p style=\"text-align: justify;\">O Prophet (Muhammad صلى الله عليه وسلم)! Say to your wives: &#8220;If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner (divorce).<\/p>\n<p style=\"text-align: justify;\">&#8220;But if you desire Allah and His Messenger, and the home of the Hereafter, then verily, Allah has prepared for Al-Muhsinat (good-doers) amongst you an enormous reward.&#8221;<\/p>\n<p style=\"text-align: right;\"><em>Surat Al-Ahzab 28-29<\/em><\/p>\n<p style=\"text-align: justify;\">A’isha said, “In a matter such as this would I need to consult my parents?! I want Allah, want Allah, His messenger, and the home of the Hereafter.”<\/p>\n<h2 style=\"text-align: justify;\"><strong>Allegations and Responses<\/strong><\/h2>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Shias often present portions of the verses that state that their “hearts were inclined” against the Prophet – peace be upon him – or against truth. They would also argue that Allah and the angels are the allies of the Prophet – peace be upon him &#8211; , suggesting that A’isha and Hafsa were not his allies. Furthermore, verse ten in the <em>surah<\/em> speaks of two evil wives of the previous prophets, suggesting that A’isha and Hafsa were evil in nature as well.<\/p>\n<p style=\"text-align: justify;\">Shias will also use verse five against A’isha and Hafsa. They’ll argue that Allah stated that he would provide the Prophet – peace be upon him – with wives that were “believers” in order to suggest that A’isha and Hafsa were not.<\/p>\n<p style=\"text-align: justify;\">Of course, all of these suggestions are easily diffused by pointing to the fact that the Prophet – peace be upon him – stayed married to both A’isha and Hafsa. This suggests that A’isha and Hafsa repented, as per Allah’s order in verse four. The Prophet – peace be upon him – aware of their repentance, died while being bound to them because of his love for them. The intelligent Sunni will simply ask Shias: Why didn’t the Prophet – peace be upon him – divorce them if Allah had declared them to be disbelievers? Shias will have no good response. They will argue that the wives of Nuh and Lut were the same, though, Shias would need to prove that Allah has declared to Nuh and Lut that their wives were disbelievers, and there is no evidence that they were privy to that information.<\/p>\n<p style=\"text-align: justify;\">More importantly, if Shias want to argue context, we will of course point them to verse eight, in which Allah commands the believers to repent, in the same way that he ordered A’isha and Hafsa to repent.<\/p>\n<p style=\"text-align: justify;\">Shias will also argue that Allah could substitute them with wives who were “believers”, suggesting that they were not believers. In response, we say that this does not negate that A’isha and Hafsa were both believers for the verse also states that Allah could substitute them with “virgins” and “previously married women” too, and those descriptions undeniably fit A’isha, who was the only virgin from amongst the wives of the Prophet – peace be upon him &#8211; , while Hafsa had a previous husband.<\/p>\n<p style=\"text-align: justify;\">Of course, by returning to the origin of the issue, we realize that what caused this ordeal was caused by none other than jealousy. It was due to the love that A’isha and Hafsa had for the Prophet – peace be upon him – that drove them to overstepping their bounds and fall into sin. Of course, a Shia with darkness in his heart will attempt to overlook that while likening the actions of A’isha and Hafsa to the worst of disbelievers who rejected Allah and His messenger.<\/p>\n<p style=\"text-align: justify;\">Perhaps it is best to ask this one question that Shias will never have a good answer for: What did the Muslim <em>ummah<\/em> gain from the Prophet’s – peace be upon him – marriage from A’isha and Hafsa if they were disbelievers? A realistic answer should be: Nothing more than the misguidance of 90% of the Muslim <em>ummah<\/em> who were led to believe that A’isha’s and Hafsa’s version of Islam is what the Prophet – peace be upon him – was upon, and henceforth, causing misguidance to the majority of the Muslims who will end upon in hellfire for all eternity.<\/p>\n<p style=\"text-align: justify;\">The nail in the coffin for Shias that will not empathize with jealous wives is this authentic narration from Ja&#8217;afar Al-Sadiq:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/02\/aisha-jealousy.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3030 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/02\/aisha-jealousy-150x150.jpg\" alt=\"aisha jealousy\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/aisha-jealousy-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/aisha-jealousy-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/aisha-jealousy-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/aisha-jealousy-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Ishaq bin Ammar said to Abu Abdullah (as): &#8220;A woman annoys a man due to her jealousy.&#8221;<\/p>\n<p style=\"text-align: justify;\">He (as) said: &#8220;That is because of her love.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>&#8211; Al-Kafi 5\/1123<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Unlike our usual content, in which we provide refutation upon refutation to every little point that is brought up by Shias, in this article, we will briefly be discussing the jealousy of the Mother of Believers A’isha and the verses <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/02\/11\/aishas-jealousy-and-surat-al-tahreem\/\" title=\"A&#8217;isha&#8217;s Jealousy and Surat Al-Tahreem\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3030,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,4],"tags":[],"class_list":{"0":"post-3026","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3026","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3026"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3026\/revisions"}],"predecessor-version":[{"id":4260,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3026\/revisions\/4260"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3030"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3026"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3026"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3026"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}