{"id":3033,"date":"2016-02-13T20:38:24","date_gmt":"2016-02-13T20:38:24","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3033"},"modified":"2018-01-04T16:21:12","modified_gmt":"2018-01-04T16:21:12","slug":"hafsa-in-the-eyes-of-sunni-and-shias","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/02\/13\/hafsa-in-the-eyes-of-sunni-and-shias\/","title":{"rendered":"Hafsa in the Eyes of Sunnis and Shias"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3033\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">She is Hafsa bint <a href=\"http:\/\/www.twelvershia.net\/2016\/11\/29\/ashra-mubashra\/\">Omar bin Al-Khattab<\/a> bin Nufail bin Abd Al-Uzza bin Rabah bin Abdullah bin Qurt bin Razah bin Adi bin Ka’ab bin Lu’ay Al-Qurashiyya.<\/p>\n<p style=\"text-align: justify;\">She is the elder sister of Abdullah bin Omar.<\/p>\n<p style=\"text-align: justify;\">Her mother is Zainab bint Math’oun, the sister of Uthman, Al-Sa’ib, and Qudama, the sons of Math’oun bin Habeeb bin Wahb bin Huthafa bin Jumah.<\/p>\n<p style=\"text-align: justify;\">Hafsa was born five years before the revelation while Quraish were building the Ka’aba.<\/p>\n<p style=\"text-align: justify;\">She was previously married to Khunais bin Huthafa Al-Qurashi Al-Sahami. He passed away after returning from the battle of Badr.<\/p>\n<p style=\"text-align: justify;\">She was then married off to the Prophet – peace be upon him – by Omar bin Al-Khattab thirty months after the Hijra, one month before the battle of Uhud.<\/p>\n<p style=\"text-align: justify;\">There is a difference of opinion regarding the time of her death with some historians claiming that she passed away in either the year forty-one or the year forty-five after the Hijra.<\/p>\n<p style=\"text-align: justify;\">Refer to Nisa’ Al-Rasool wa Awlaaduhu by Al-Dimyati for the details of her general biography above.<\/p>\n<p style=\"text-align: justify;\">According to a narration in Saheeh Al-Bukhari #4603, the very copy of the Qur&#8217;an, which was compiled by Abu Bakr, was handed over to Omar upon the death of the former, and finally was entrusted to Hafsa upon her father&#8217;s death.<\/p>\n<p style=\"text-align: justify;\">This article will examine the following aspects of Hafsa and her life:<\/p>\n<ul>\n<li style=\"text-align: justify;\">\n<h3>Hafsa’s Narrations<\/h3>\n<\/li>\n<li style=\"text-align: justify;\">\n<h3>The Marriage of Hafsa to the Prophet<\/h3>\n<\/li>\n<li style=\"text-align: justify;\">\n<h3>The Prophet’s – peace be upon him – divorce of Hafsa<\/h3>\n<\/li>\n<li style=\"text-align: justify;\">\n<h3>The Shia View of Hafsa<\/h3>\n<\/li>\n<li style=\"text-align: justify;\">\n<h3>The Correct Position Regarding Hafsa<\/h3>\n<\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>Hafsa’s Narrations<\/strong><\/h2>\n<p style=\"text-align: justify;\">Unlike A’isha, there is not much that is known about the life of Hafsa. If one were to go through all her hadiths, one would probably not be able to find twenty in total.<\/p>\n<p style=\"text-align: justify;\">By returning to Musnad Abi Ya’ala (p. 1262-1266) we find a decent amount of her narrations. Most of them reflect practices by the Prophet – peace be upon him – in worship, like that he used to pray two prostrations before the Fajr prayer, one of his supplications before going to bed, and that he used to sit down while praying his <em>nafilah<\/em> (non-obligatory) prayers one year before he passed away, while reciting very slowly. She also narrated specifics about his fasting rituals, apart from the mandatory fasting.<\/p>\n<p style=\"text-align: justify;\">Even though most of Hafsa’s narrations aren’t too significant in importance as other major ideological traditions or ones that revolve around jurisprudence, they do provide us with an insider’s view of the prophetic household.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Marriage of Hafsa to the Prophet<\/strong><\/h2>\n<p style=\"text-align: justify;\">In Saheeh Al-Bukhari #3704, we find a narration that explains how the marriage occurred in specific. Ibn Omar narrates that Hafsa bint Omar stayed without marriage after the death of her husband Khunais bin Huthafa who participated in Badr. Omar one day approached Uthman bin Affan and suggested Hafsa to him. Uthman, after a few nights said that he was not interested in getting married at the moment. Omar then suggested Hafsa to Abu Bakr. Abu Bakr did not respond to him with anything. Omar was angered by Abu Bakr’s silence due to their close relationship. Then, several nights later, the Prophet – peace be upon him – got engaged to Hafsa, then they got married. One day, Abu Bakr came to Omar and said, “Perhaps you were angered when you presented Hafsa to me and I did not respond to you.” He said, “Indeed.” He replied, “What prevented me from getting back to you was that I was aware that the Messenger of Allah – peace be upon him – spoke of her, and I did not want to bring up what he said in secrecy, but if he left her, then I would have accepted (her as a wife).”<\/p>\n<p style=\"text-align: justify;\">Ibn Hisham, in his biography of the Prophet – peace be upon him &#8211; states that the dowry paid to her was four hundred dirhams.<\/p>\n<p style=\"text-align: justify;\">According to today’s pricing of $0.50 for a <a href=\"http:\/\/www.silvergrambars.com\/\" rel=\"external nofollow\">gram of silver<\/a>, her dowry according to a modern conversion would come out at around $600.<\/p>\n<p style=\"text-align: justify;\">Years later, Hafsa and A’isha were driven by their jealousy of Zainab bint Jahsh to plot against her. After all, it is human nature for a wife that is sharing her husband with other women to hold such feelings. The Prophet – peace be upon him – used to spend a lot of time with Zainab, who used to feed the Prophet – peace be upon him – honey. So, A’isha and Hafsa agreed to ask the Prophet – peace be upon him – if he was eating <em>maghafeer<\/em>, which is a foul-smelling plant, in order to get him to stop appreciate Zainab’s honey so much. Out of the Prophet’s – peace be upon him – love for Hafsa, he swore upon himself to stop eating honey. The whole nature of the incident ended with Allah reprimanding A’isha and Hafsa for their actions in the Holy Qur’an. The Prophet – peace be upon him – ultimately gave his wives the choice if they wanted to stay married to him or if they wanted to be set free from him. He recited:<\/p>\n<p style=\"text-align: justify;\">O Prophet (Muhammad صلى الله عليه وسلم)! Say to your wives: &#8220;If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner (divorce).<\/p>\n<p style=\"text-align: justify;\">&#8220;But if you desire Allah and His Messenger, and the home of the Hereafter, then verily, Allah has prepared for Al-Muhsinat (good-doers) amongst you an enormous reward.&#8221;<\/p>\n<p style=\"text-align: justify;\">Al-Ahzab 28-29<\/p>\n<p style=\"text-align: justify;\">The wives, Hafsa included, chose Allah and decided to stay with the Prophet – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">Refer to this article for the complete <a href=\"http:\/\/twelvershia.net\/2016\/02\/11\/aishas-jealousy-and-surat-al-tahreem\/\" rel=\"external nofollow\">context of the event<\/a>.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Prophet’s – peace be upon him – divorce of Hafsa<\/strong><\/h2>\n<p style=\"text-align: justify;\">Even though there is a consensus amongst the Muslims that the Prophet – peace be upon him – <strong>died while being bound to Hafsa by marriage,<\/strong> there is more to say as to whether he divorced her temporarily during his life.<\/p>\n<p style=\"text-align: justify;\">There seems to be some confusion as to whether the Prophet – peace be upon him – divorced Hafsa or not. The narrations come through the paths of several companions like Anas, Uqba bin Amer, and Ammar bin Yasser. Often, these narrations state that the Prophet – peace be upon him – was ordered by Jibreel to re-marry her, but none of these are authentic according to Sunni hadith standards.<\/p>\n<p style=\"text-align: justify;\">The strongest of these narrations can be found in Sunan Abi Dawud #1943. The narration states that Omar said that “the Messenger of Allah – peace be upon him – divorced Hafsa, but then re-married her.” Al-Bazzar in his Musnad #189 states that this narration can only be found from the path of Salih bin Salih from Salama bin Kuhail from Sa’eed bin Jubair from Ibn Abbas from Omar.<\/p>\n<p style=\"text-align: justify;\">Now, even though this narration is authentic, there is some doubt as to whether the Prophet – peace be upon him – did divorce her or not, and the reason is because this narration seems to be based upon another narration which is also narrated from Ibn Abbas through Omar.<\/p>\n<p style=\"text-align: justify;\">In Saheeh Al-Bukhari #2288, Ubaidullah bin Abdullah bin Abi Thawr narrates from Ibn Abbas from Omar in a lengthy hadith in which Omar’s companion tells him that the Prophet – peace be upon him – divorced his wives. Omar goes to Hafsa to confirm this. He finds her crying because the Prophet – peace be upon him – abandoned his wives, but states that she is not aware of him divorcing them. He then enters upon the Prophet – peace be upon him – who confirms that he did not divorce his wives. In a similar narration in Saheeh Muslim #2704, Simak narrates from Ibn Abbas from Omar that suggests the very same as the above. Al-Tirmithi #3240 expresses that this narration has come through multiple paths from Ibn Abbas.<\/p>\n<p style=\"text-align: justify;\">With this in mind, it seems that there are two possibilities in regards to the narration from Sunan Abi Dawud above. The narration is either speaking about the exact same scenario, which makes it a clear contradiction to the multiple routes from Ibn Abbas. If we were to hold the opinion that it is referring to the same scenario, then the narrations of Al-Bukhari and Muslim should be taken over it, due to the multiple established routes to Ibn Abbas. The other possibility is that the narration in Sunan Abi Dawud is referring to a completely different scenario, however, that seems to be unlikely since it would have reached us through another path instead of through Ibn Abbas from Omar once again.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Shia View of Hafsa<\/strong><\/h2>\n<p style=\"text-align: justify;\">There is not much content from Shia books about Hafsa. If one were to ask a Shi’ee why all the hate for Hafsa, they would most likely quote the Sunni narration about the <em>maghafeer<\/em> that was mentioned above. Not surprisingly, there are narrations in Shia books that paint Hafsa in a diabolical fashion.<\/p>\n<p style=\"text-align: justify;\">For example, Hafsa is mentioned in Qurb Al-Isnad (p. 99), through a disconnected chain, that she was one of those that testified that Fatima does not deserve an inheritance from her father – peace be upon him &#8211; . According to Shias, this makes her a co-conspirator against Fatima.<\/p>\n<p style=\"text-align: justify;\">In Al-Kafi 6\/1273, we find Hafsa saying, “If he divorced us, we would find those that are worthy of us from our own tribe.” Ironically, when the above verses from Surat Al-Ahzab 28-29 are revealed, Hafsa decides to stay with the Prophet – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">In a very strange authentic report that can be found in Al-Kafi 5\/1164, Abu Bakr and Omar ask Um Salama about the Prophet’s – peace be upon him – sexual performance. She states that he is “just like any other man.” The Prophet – peace be upon him – is infuriated by people asking about his private life in such a way, but luckily, Jibreel comes with some Hareesa that was made in heaven, which gives him the sexual strength of forty men.<\/p>\n<p style=\"text-align: justify;\">Ironically, in Mahasin Al-Barqi 2\/170, we find a similar Hareesa story, with the exception that Hafsa is the wife that is asked about his sexual strength. She comments, “He is just a man like other men.”<\/p>\n<p style=\"text-align: justify;\">As for the main reason that the Shias hate Hafsa, we present it to them from their own sources. Ali bin Ibrahim Al-Qummi in his exegesis of Surat Al-Tahreem (p. 710) said:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The reason of the revelation was when the Messenger of Allah &#8211; peace be upon him and his progeny – were in one of the houses of his wives, Mariya Al-Qutbiya was with him serving him, and this was during Hafsa’s “day”, while Hafsa was outside. The Messenger of Allah &#8211; peace be upon him and his progeny – then had intercourse with Mariya and Hafsa knew about it. She was angered and approached the Messenger of Allah &#8211; peace be upon him and his progeny – and said: “O’ Messenger of Allah! This happens in my day, in my house, and on my bed?!” The Messenger of Allah felt ashamed of her and said, “That is enough, for I shall forbid Mariya upon myself and never have intercourse with her again, and I will share a secret with you, and if you tell anyone, then may Allah, His angels, and all mankind damn you.” She said, “What is it?” He said, “Abu Bakr will be the caliph after me, then after him, your father (Omar).” She said, “Who told you this?” He said, “Allah told me.” Hafsa then told A’isha on the same day, and A’isha told her father Abu Bakr, who then went to Omar and said, “A’isha told me that she heard from Hafsa something, but I do not trust her, so ask Hafsa yourself.” Omar then went to Hafsa and said, “What is this that you told A’isha?” She denied everything and said, “I didn’t say such a thing.” Omar then said, “If it is true, then tell me so that we can take action.” She said, “Yes, the Messenger of Allah did say that.” The four got together to poison the Messenger of Allah and Jibreel came with the verse:<\/p>\n<p style=\"text-align: justify;\"><em>“<\/em><em>O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you&#8230; Allah has already ordained for you (O men) the absolution from your oaths,”<\/em> meaning that Allah made it possible for him to absolve his oath&#8230;<\/p>\n<p style=\"text-align: justify;\"><em>“And Allah is your Maula (Lord, or Master, or Protector) and He is the All-Knower, the All-Wise. <\/em><em>And (remember) when the Prophet disclosed a matter in confidence to one of his wives, then she told it,”<\/em> meaning that when she spoke of it&#8230;<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0001.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-3034 size-thumbnail\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0001-150x150.jpg\" alt=\"hafsa\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0001-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0001-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0001-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0001-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0002.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-3035 size-thumbnail\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0002-150x150.jpg\" alt=\"hafsa\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0002-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0002-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0002-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/02\/hafsa0002-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a><em>“<\/em><em>And Allah made it known to him,”<\/em> meaning that Allah made clear to His prophet what she spoke of and what they intended to do&#8230;<\/p>\n<p style=\"text-align: justify;\"><em>“<\/em><em>He informed part thereof,”<\/em> meaning that he told her (of what Allah told him), and asked: Why did you speak of what I told you?<\/p>\n<p style=\"text-align: justify;\"><em>“And left a part,”<\/em> meaning that he did not tell them of what they planned to do (in regards to poisoning him).<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Today, due to the above narrations, we find Shia clerics <a href=\"http:\/\/www.twelvershia.net\/2017\/09\/15\/lanat\/\">cursing<\/a> Hafsa. Some, like <a href=\"https:\/\/www.youtube.com\/watch?v=LqdVa2kNcV4\" rel=\"external nofollow\">Yasser Al-Habeeb making <em>takfeer <\/em>of Hafsa<\/a> by claiming that she is one of the four worst creations of Allah. He states that she is in forth place only after Abu Bakr, Omar, and A&#8217;isha, and that she is more evil than Mu&#8217;awiyah and <a href=\"http:\/\/www.twelvershia.net\/2017\/12\/31\/yazeed-war-people-madinah-makkah\/\">Yazeed<\/a>.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Correct Position Regarding Hafsa<\/strong><\/h2>\n<p style=\"text-align: justify;\">The problem once again with the Sunni-Shia divide is a matter of sources. The Shia sources provide narrations of crimes and condemnations about Hafsa, while Sunni sources make no mention of such narrations.<\/p>\n<p style=\"text-align: justify;\">The only possible scenarios are that these condemnations about Hafsa did exist but the Sunnis hid them and decided not to narrate them, or that the Shias fabricated these narrations.<\/p>\n<p style=\"text-align: justify;\">Personally, we trust the Sunni sources much more for several reasons, as we have expressed in previous articles. Of course, one does not have to refer to external articles instead of the usage of basic reasoning to ultimately decide that these Shia fabrications have no place in Islam. There is not a Muslim alive that would willingly marry a corrupt character that Shias have made Hafsa out to be. Yet, the Shias have no issue admitting that the Prophet – peace be upon him – was married to such a corrupt person.<\/p>\n<p style=\"text-align: justify;\">One simply has to ask himself: What does the Prophet – peace be upon him – gain by being married to her?<\/p>\n<p style=\"text-align: justify;\">Surely, nothing is gained other than this misguidance of 90% of Muslims who assumed that his marriage to her is a great merit.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>She is Hafsa bint Omar bin Al-Khattab bin Nufail bin Abd Al-Uzza bin Rabah bin Abdullah bin Qurt bin Razah bin Adi bin Ka’ab bin Lu’ay Al-Qurashiyya. She is the elder sister of Abdullah bin Omar. Her mother is Zainab <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/02\/13\/hafsa-in-the-eyes-of-sunni-and-shias\/\" title=\"Hafsa in the Eyes of Sunnis and Shias\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3034,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-3033","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3033","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3033"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3033\/revisions"}],"predecessor-version":[{"id":4261,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3033\/revisions\/4261"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3034"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3033"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3033"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3033"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}