{"id":3084,"date":"2016-03-06T19:08:14","date_gmt":"2016-03-06T19:08:14","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3084"},"modified":"2016-03-30T15:36:56","modified_gmt":"2016-03-30T15:36:56","slug":"is-jabir-bin-hayyan-a-student-of-jafar-al-sadiq","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/03\/06\/is-jabir-bin-hayyan-a-student-of-jafar-al-sadiq\/","title":{"rendered":"Is Jabir bin Hayyan a student of Ja`far al-Sadiq?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3084\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Many Shia today believe in countless fairy-tales, one of which is that the father of chemistry &#8220;Jabir bin Hayyan bin `Abdullah al-Azdi&#8221; was a student of Ja`far al-Sadiq or that he learned chemistry from him.<\/p>\n<p style=\"text-align: justify;\">We will quote the following article in whole from &#8220;realtashayyu&#8221; blog, it was posted on WEDNESDAY, 2 OCTOBER 2013.<\/p>\n<p style=\"text-align: justify;\">This article is divided into four sections:<\/p>\n<p style=\"text-align: justify;\">1) Determining whether the infallibles (as) actually had advanced knowledge of natural sciences (in fact anything which is not directly related to Islamic issues)?<\/p>\n<p style=\"text-align: justify;\">2) What did the Shia mutaqaddamin (the classical scholars) say about Jaber ibn al Hayyan?<\/p>\n<p style=\"text-align: justify;\">3) On what basis do latter Shia clerics claim that Jaber ibn Hayyan was a student of Imam Ja&#8217;fer al Sadiq (as)?<\/p>\n<p style=\"text-align: justify;\">4) Examining one of the famous earliest sources which mention Jaber ibn Hayyan (most importantly, what does it actually say)?<\/p>\n<p style=\"text-align: justify;\">5) Investigating the claim that Jaber ibn Hayyan&#8217;s studentship of Imam Ja&#8217;far al Sadiq (as) is a unanimous view of all Muslims, and upheld by major sunni scholars and historians (please note, this article is only concerned with academic scholarly view, examination of lay people views is beyond scope due to irrelevance)<\/p>\n<p style=\"text-align: justify;\">Important note: This article has not dealt with the views of each individual orientalist scholar (such as Donaldson etc) who have written about Jaber but without providing solid sources or at the very best citing same original sources which have been examined in themselves in this article, to avoid digression and repetition. Similarly, the views of some strict rijali scholars, such as Ayatullah Shaikh Hussain al Radhy who believes in the view of Jaber being a student of Imam al Sadiq (as), have been ignored for individual consideration as they are based on the same sources which have been examined in this article. Same applies for all other clerics.<\/p>\n<p style=\"text-align: justify;\">Did the infallibles (as) even have knowledge of natural sciences?<\/p>\n<p style=\"text-align: justify;\">&#8216;Al Ijtihad&#8217; by Ayatullah Fadlullah, Page 240 (Arabic page posted at bottom of the post)<\/p>\n<p style=\"text-align: justify;\">&#8216;As for what is the extent of their (the infallibles) knowledge, so that is a separate issue (apart from their infallibility). There are scholars who say that the infallibles do not have the knowledge of ghaib, for Syed al Murtada and a large group of our classical scholars believed that the Prophet (pbuh) and the Imams (as) do not have any knowledge other than what they have been assigned to preach in terms of religious teachings and jurisprudence. As for other fields of knowledge such as physics and chemistry, so those are fields which they (the infallibles) did not have any knowledge of.&#8217;<\/p>\n<p style=\"text-align: justify;\">ويقول الشيخ الطوسي أيضاً في كتابه المذكور: «ولم نوجب أن يكون [الإمام] عالماً بما لا تعلُّق له بالأحكام الشرعية<\/p>\n<p style=\"text-align: justify;\">Shaikh Tusi wrote in his book Talkhis al Shafi (Volume 1 page 252): &#8220;It is not wajib for the Imam to have any knowledge of things which are not directly related to Islamic laws.<\/p>\n<p style=\"text-align: justify;\">What did the early Shia rijal scholars say about Jaber b. Hayyan?<\/p>\n<p style=\"text-align: justify;\">أعيان الشيعة &#8211; السيد محسن الأمين &#8211; ج ١ &#8211; الصفحة ٦٦٩<\/p>\n<p style=\"text-align: justify;\">A&#8217;yan al Shia by Ayatullah Muhsin al Amin, Volume 1 Page 669<\/p>\n<p style=\"text-align: justify;\">لم يذكر أحد من أصحابنا الذين ألفوا في رجال الشيعة وأصحاب الأئمة كالطوسي والنجاشي ومن عاصرهم أو تقدمهم أو تأخر عنهم جابر بن حيان من تلاميذ الصادق ولا من أصحابه ولا ذكروه في رجال الشيعة وهم أعرف بهذا الشأن من غيرهم<\/p>\n<p style=\"text-align: justify;\">None of our rijal scholars such as Shaikh Tusi and Shaikh Najashi, neither their contemporary scholars or their predecessors and successors, ever mentioned that Jabir bin Hayyan was a student of Imam Ja&#8217;far al Sadiq (as) or his companion. Neither did any of our early rijal scholars include him in the list of shia rijal, and these scholars knew better about this issue than anyone else.<\/p>\n<p style=\"text-align: justify;\">&#8216;Imam al Sadiq and the four madhabs&#8217; by Ayatullah Asad Haydar, Page 445 (Arabic page posted at bottom of the post)<\/p>\n<p style=\"text-align: justify;\">&#8216;Some scholars are of the view that Jaber ibn Hayyan is just a fictitious character, and the name is a fabrication, invented by the authors in this field (i.e. chemistry\/alchemy). They support this view by the fact that while the personality of Jaber ibn Hayyan is supposed to be great, yet there is no mention of him at all in Arabic history.&#8217;<\/p>\n<p style=\"text-align: justify;\">What are the sources which mention Jaber b. Hayyan, upon which the modern shia clerics base their information?<\/p>\n<p style=\"text-align: justify;\">معجم رجال الحديث &#8211; السيد الخوئي &#8211; ج ٤ &#8211; الصفحة ٣٢٨<\/p>\n<p style=\"text-align: justify;\">Mu&#8217;jam Rijal al Hadith by Ayatullah Khoei, Volume 4 Page 328<\/p>\n<p style=\"text-align: justify;\">جابر بن حيان:<br \/>\nالصوفي الطرسوسي، أبو موسى من مشاهير أصحابنا القدماء، كان عالما بالفنون الغريبة وله مؤلفات كثيرة أخذها من الصادق عليه السلام، وقد تعجب غير واحد من عدم تعرض الشيخ والنجاشي لترجمته، وقد كتب في أحواله وذكر مؤلفاته كتب عديدة من أراد الاطلاع عليها فليراجعها، قال جرجي زيدان في مجلة الهلال على ما حكي عنه: &#8221; أنه من تلامذة الصادق عليه السلام، وإن أعجب شئ عثرت عليه في أمر الرجل أن الأوروبيين اهتموا بأمره أكثر من المسلمين والعرب، وكتبوا فيه وفي مصنفاته تفاصيل، وقالوا إنه أول من وضع أساس الشيمي الجديد وكتبه في مكاتبهم كثيرة، وهو حجة الشرقي على الغربي إلى أبد الدهر<\/p>\n<p style=\"text-align: justify;\">Jabir b. Hayyan is one of the famous classical scholars. He was an expert in rare fields of knowledge, and he has many works which he compiled by gaining knowledge from Imam Ja&#8217;far al Sadiq (as). Many scholars have been surprised due to lack of any mention of him at all by Shaikh Tusi and Shaikh Najashi.<\/p>\n<p style=\"text-align: justify;\">Many books have been written about him and his works, one who wishes to know further should refer to them. Jurji Zaydan (a secular Lebanese novelist and journalist from a Christian family, who also briefly became a free mason) wrote in his magazine &#8216;al Hilal&#8217;: &#8220;He was from the students of Imam Ja&#8217;far al sadiq (as), and the most surprising thing I have seen about him is that the Europeans have given more importance to him than the Muslims and the Arabs themselves. They have written detailed works about him and his books, and they say that he is the first one to establish the foundations of modern alchemy (practical chemistry) and their libraries contain many of his books. He is the hujjah for the East over the West till the end of times.&#8221;<\/p>\n<p style=\"text-align: justify;\">تنقيح المقال للعلامة المامقاني ,الجزء الرابع عشر ::: 16 ـ 30<\/p>\n<p style=\"text-align: justify;\">Tanqihul Maqal by Allama Mamqani, Volume 14 Page 26<\/p>\n<p style=\"text-align: justify;\">حصيلة البحث<br \/>\nأقول : إنّ موضوع رجال الشيخ والنجاشي هو ترجمة وذكر رواة الشيعة وليس موضوع كتابهما ذكر المخترعين والفلاسفة والشعراء أو غيرهم من أرباب العلوم ، ولعله لهذا لم يذكرا المعنون ، فتفطّن.<br \/>\nوقد عنونه وترجم له ابن النديم في فهرسته وابن خلكان وغيرهما ؛ لأنّ موضوع تآليفهم أعمّ من الرواة وغيرهم<\/p>\n<p style=\"text-align: justify;\">The bottomline is that the topic of Rijal al Tusi and Rijal al Najashi is to deal with the biographies of Shia narrators of ahadith. Their topic is not to deal with inventors, philosophers, poets or scholars from other fields of knowledge, so perhaps that is why they did not mention him, so think about it.<\/p>\n<p style=\"text-align: justify;\">Ibn al Nadim (385 AH), Ibn al Khalikan (a latter shafi&#8217;i scholar) and others did list him because the topic of their books was more encompassing than just narrators of hadith and others.<\/p>\n<p style=\"text-align: justify;\">As Ibn al Nadim is one of the earliest sources which mention Jaber b. Hayyan, who exactly is Ibn al Nadim?<\/p>\n<p style=\"text-align: justify;\">معجم رجال الحديث &#8211; السيد الخوئي &#8211; ج ١٦ &#8211; الصفحة ٧٢<\/p>\n<p style=\"text-align: justify;\">Mu&#8217;jam Rijal al Hadith by Ayatullah Koei, Volume 16 Page 72<\/p>\n<p style=\"text-align: justify;\">&#8211; محمد بن إسحاق أبي يعقوب النديم:<br \/>\nأبو الفرج صاحب الفهرست المعروف بفهرست ابن النديم، ذكره النجاشي في ترجمة بندار بن محمد بن عبد الله.<br \/>\nوقد نقل عن فهرسته الشيخ الطوسي &#8211; قدس سره &#8211; في الفهرست في موارد، منها: ترجمة داود بن أبي زيد (285).<br \/>\nأقول: الظاهر أن الرجل من العامة، وإلا لترجمه النجاشي والشيخ في كتابيهما، ولم يثبت وثاقته أيضا، فإن مجرد نقل النجاشي والشيخ عنه لا يدل على وثاقته<\/p>\n<p style=\"text-align: justify;\">Muhammd b. Ishaq abi Ya&#8217;qoob al Nadim: Abu Faraj, author of the book &#8216;Al Fhrist&#8217; which is famous as &#8216;Fihrist ibn al Nadim&#8217;. Shaikh Najashi mentioned him in the biography of Bindar b. Muhammd b. Abdullah. Shaikh Tusi also quoted from his Fihrist (i.e. Fihrist ibn al Nadim) in his Fihrist (i.e. Fihrist al Tusi), including in the biography of Dawood b. abi Zaid.<\/p>\n<p style=\"text-align: justify;\">I (i.e. Ayatullah Khoei) say: &#8220;It is apparent that this man (Ibn al Nadim) is from the &#8216;aama, and other than him being mentioned by Najashi and Tusi in their rijal books, his reliability is also not established, because after all just a mere quotation of him by Najashi and Tusi does not prove his reliability.&#8221;<\/p>\n<p style=\"text-align: justify;\">المفيد من معجم رجال الحديث &#8211; محمد الجواهري &#8211; الصفحة ٤٩٨<\/p>\n<p style=\"text-align: justify;\">&#8216;Al Mufid min Mu&#8217;jam Rijal al Hadith&#8217; by Shaikh Jawahiri, page 498<\/p>\n<p style=\"text-align: justify;\">محمد بن إسحاق أبي يعقوب النديم: أبو الفرج صاحب الفهرست المعروف بفهرست ابن النديم &#8211; عامي &#8211; مجهول<\/p>\n<p style=\"text-align: justify;\">Muhammd b. Ishaq abi Ya&#8217;qoob al Nadim: Abu Faraj, author of the book &#8216;Al Fhrist&#8217; which is famous as &#8216;Fihrist ibn al Nadim&#8217;. A majhool aami.<\/p>\n<p style=\"text-align: justify;\">Regardless of Ibn al Nadim being a majhool &#8216;aami, what did he actually say about Jaber b. Hayyan?<\/p>\n<p style=\"text-align: justify;\">وجاء في &#8220;الفهرست&#8221; لابن النديم: ((هو أبو عبد الله جابر بن حيان بن عبد الله الكوفي المعروف بالصوفي واختلف الناس في أمره فقالت الشيعة أنه من كبارهم وأحد الأبواب وزعموا أنه كان صاحب جعفر الصادق رضي الله عنه وكان من أهل الكوفة<\/p>\n<p style=\"text-align: justify;\">Ibn al Nadim wrote in al Fihrist (page 435): He is (his full name is) Abu Abdullah Jaber b. Hayyan b. Abdullah al Kufi, better known as the sufi. The people have differed about his affair. The Shia claim that he is one of their greats and one of the &#8216;baab&#8217;, and they believe that he was a companion of Imam Jafer al Sadiq (ra) and a resident of Kufa.<\/p>\n<p style=\"text-align: justify;\">What do sunni scholars and historians say about Jaber ibn al Hayyan?<\/p>\n<p style=\"text-align: justify;\">سيرالأعلام والمشهورين في العرب صنعة كانت متداولة بين الكتاب والوراقين.و أشهر هؤلاء على الإطلاق هو أبو عثمان الجاحظ 150-255هـ \/ 767 -869 م. فإننا لا نجد عنده ذكرا لعالم في الكيمياء اسمه جابر بن حيان<\/p>\n<p style=\"text-align: justify;\">Recording the biographies of scholars and famous people in the Arab world was a popular trade among the writers and compilers, among whom the most well known by far is Abu Uthman al Jahiz (150-255 AH \/ 767-869 AD). But we do not find any mention from him of a chemist named Jaber bin Hayyan.<\/p>\n<p style=\"text-align: justify;\">مجموع فتاوى ابن تيمية &#8211; (ج 7 \/ ص 59)<br \/>\nوَأَمَّا جَابِرُ بْنُ حَيَّانَ صَاحِبُ الْمُصَنَّفَاتِ الْمَشْهُورَةِ عِنْدَ الْكِيمَاوِيَّةِ فَمَجْهُولٌ لَا يُعْرَفُ وَلَيْسَ لَهُ ذِكْرٌ بَيْنَ أَهْلِ الْعِلْمِ وَلَا بَيْنَ أَهْلِ الدِّينِ<\/p>\n<p style=\"text-align: justify;\">Collection of Ibn al Taymiyyah&#8217;s fatawa (Volume 7 page 59): &#8220;As for Jaber ibn Hayyan, author of works that are famous among chemists, is a majhool person. He is unknown and there is no mention found of him among the people of knowledge and religion.&#8221;<\/p>\n<p style=\"text-align: justify;\">This is supported by Ayatullah Fadlullah who says the Imams may not know sciences and physics and their main mission is related to spreading the message of Islam, we quote al-Istihad 240:<\/p>\n<p style=\"text-align: justify;\">مفردة المعصوم تعني أن المعصوم لا يخطئ في قول و لا فعل و لا فكر أما ما هو حجم علمه؟ فهذا أمر آخر. هنالك من يقول أن المعصوم لا يعلم الغيب, فالسيد المرتضى و جماعة من علمائنا يقولون: إن النبي و الأئمة لا يعلمون إلا ما هم مكلفون بتبليغه من قضايا الدين و الشريعة. أما العلوم الأخرى كالفيزياء و الكيمياء, فذلك أمر قد لا يعلمون به<\/p>\n<p style=\"text-align: justify;\">Review the article in Arabic here: <a href=\"http:\/\/www.dd-sunnah.net\/forum\/showthread.php?t=169806\" rel=\"external nofollow\">dd-sunnah.net<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Many Shia today believe in countless fairy-tales, one of which is that the father of chemistry &#8220;Jabir bin Hayyan bin `Abdullah al-Azdi&#8221; was a student of Ja`far al-Sadiq or that he learned chemistry from him. We will quote the following <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/03\/06\/is-jabir-bin-hayyan-a-student-of-jafar-al-sadiq\/\" title=\"Is Jabir bin Hayyan a student of Ja`far al-Sadiq?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-3084","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3084","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3084"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3084\/revisions"}],"predecessor-version":[{"id":3133,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3084\/revisions\/3133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3084"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3084"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3084"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}