{"id":3164,"date":"2016-04-09T01:19:01","date_gmt":"2016-04-09T01:19:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3164"},"modified":"2016-06-07T22:38:40","modified_gmt":"2016-06-07T22:38:40","slug":"the-possibility-of-tawatur-between-sunnah-shia","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/04\/09\/the-possibility-of-tawatur-between-sunnah-shia\/","title":{"rendered":"The possibility of Tawatur between Sunnah &#038; Shia"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3164\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">This is our second article concerning the topic of Tawatur, in this article we will go in-depth in a practical way as opposed to our first article which discussed the matter in more of a theoretical manner.<\/p>\n<p style=\"text-align: justify;\">In our last article on this subject (<a href=\"http:\/\/twelvershia.net\/2014\/08\/25\/understanding-the-mutawatir-and-the-tawatur\/\" rel=\"external nofollow\">found here<\/a>) we offered the definition of the Mutawatir, the conditions of Tawatur and how the scholars greatly differed on what makes a Hadith Mutawatir thus rendering it as a subjective matter. We have listed criticisms against the theory of Tawatur such as the opinion that many narrators can in fact conspire upon a lie if they wish to advertise and spread a certain idea, even the Shia will consider the narration where `Ali says “Abu Bakr and `Umar are the best of this nation” as fabricated even though it has a great amount of chains (<a href=\"http:\/\/twelvershia.net\/2013\/12\/26\/detailed-research-on-the-chains-of-hadith-ul-afdaliyyah-narration-of-superiority\/\" rel=\"external nofollow\">review this here<\/a>) In the end, based on the evidence and arguments we concluded that the mass-transmissmitted or recurrently narrated reports (Mutawatir Hadiths) only serve to increase the popularity of a report but in no way establish the authenticity.<\/p>\n<p style=\"text-align: justify;\">In this article, we will address another question: Is it possible for Ahlul-Sunnah and the Twelver Shia to obtain a Mutawatir narration by relying solely on their own sources?<\/p>\n<p style=\"text-align: justify;\">Below are the conditions we chose to follow in our research.<\/p>\n<p style=\"text-align: justify;\"><em>1-The Earliness:<\/em><br \/>\nIn order to achieve this, we will study the early sources of Sunnies and Twelvers, we chose the year 460 after Hijrah as the divider between early and late sources. The significance of this year is that it is the year the last great Shia Hadith scholar al-Tusi (460 AH) passed away, it is around that same period that the great Sunni Hadith scholar al-Bayhaqi also passed away (458 AH). Again the emphasis in these studies is always on the early sources, so late books like Kanz-ul-`Ummal by al-Muttaqi al-Hindi or Bihar-ul-Anwar by al-Majlisi will be dismissed due to being extremely late.<\/p>\n<p style=\"text-align: justify;\"><em>2-The Chains:<\/em><br \/>\nThe sources we will consider for this study are the books of Hadith, which are any book of Fiqh, Tafsir, Fada’il, Amali etc… as long as it has chains. We cannot include sources that are chainless, so for Sunnies books like Hilm-u-Mu`awiyah by Ibn abi al-Duniya are rejected and likewise for the Twelvers books like Tafsir al-`Ayyashi are rejected.<\/p>\n<p style=\"text-align: justify;\"><em>3-The Legitimacy:<\/em><br \/>\nBooks who are rejected and deemed unreliable by the scholars of each school will not be considered. For example, the Sunni book al-Fiqh al-Absat falsely attributed to abu Hanifa al-Nu`man, this book is rejected since it’s actually by a liar called Ibn Mutayyi` al-Balkhi. From the Shia side we have books like Tafsir al-Qummi whom they insist is not correctly attributed to `Ali bin Ibrahim al-Qummi. Shia scholars like Muslim al-Dawuri and Muhammad Asif Muhsini researched the reliability of such Hadith books.<\/p>\n<p style=\"text-align: justify;\"><em>4-The Sect:<\/em><br \/>\nThe Sunnies will be judged based on Sunni sources, and so will the Twelvers. Therefore, Zaydi books like Maqatil al-Talibiyin, Musnad Zayd, al-Gharat by al-Thaqafi or Ibn `Uqdah’s Fada’il will not be accepted, Mu`tazili books like al-Muwafaqah by Ibn al-Samman will not be considered and Ibadi books like Musnad al-Rabi` will also not be accepted.<\/p>\n<p style=\"text-align: justify;\">\nWe glance from a distance at the sources of both schools and we observe the following right from the outset.<\/p>\n<h2 style=\"text-align: justify;\">The sources of the Sunni schools:<\/h2>\n<p style=\"text-align: justify;\">We notice this school has a gigantic amount of early Hadithi sources, the sources are categorized into different types such as books of Sunan: (Sunan abu Dawoud, Sunan al-Daraqutni, Sunan al-Darimi). Books of Tafsir: (Tafsir Sa`id bin Mansour, Tafsir `Abdul-Razzaq, Tafsir Ibn abi Hatim). Musnad books: (Musnad al-Shashi, Musnad abi Ya`la, Musnad Ibn al-Ja`d). As well as many other categories: Amali, Ajza’, Jawami`, Mashyakhat, Zuhd, Manaqib, Amwal, Fawa’id etc…<\/p>\n<p style=\"text-align: justify;\">The number we estimate is printed from such books of Hadith today is around 1,500 (Includes some of the later collections). Many are still in manuscript form and much more was lost. However, the great amount of books that survived makes it quite easy to find a single narration in a hundred or more of these books simultaneously and thus we’d have sufficient evidence that the chains were not invented in later times and this also makes Tawatur possible.<\/p>\n<p style=\"text-align: justify;\">The second thing we mention is the variety in the authors of these books, you will find infamous scholars from Nisabur, Asbahan , Bukhara, Misr, Basarah, Madinah, Makkah, Maru, Yaman, Dimashq, Andalus, Baghdad, Maqdis etc…<\/p>\n<p style=\"text-align: justify;\">This variety makes it less likely that these authors have conspired or agreed to repeat lies and this is a strong boost to the Tawatur of their narrations and their authenticity.<\/p>\n<p style=\"text-align: justify;\">The third thing is the reliability of narrators, you will find most narrators are known and famous scholars and you will not find much reliance on unknown individuals. This further strengthens the authenticity of the narrations and gives the chains more legitimacy since we know they are reaching us through qualified, reliable and popular scholars.<\/p>\n<h2 style=\"text-align: justify;\">The sources of the Twelver Shia school:<\/h2>\n<p style=\"text-align: justify;\">We notice a big difference of opinion on what they consider acceptable or reliable sources, some of their scholars will reject Tafsir al-Qummi while others accept it, some will accept al-Ja`fariyat (a.k.a Ash`athiyat) while others won’t, some will accept Basa’ir al-Darajat while others won’t, some will accept Tafsir al-`Askari but others won’t, some will cast doubt on certain copies of some books such as Qurb al-Isnad, Sahifat-ul-Rida and whatnot. The doubts concerning the accuracy of the attribution of some of these books to their authors and the doubts concerning the authenticity of some of the surviving copies of these books such as Asl Zayd al-Narsi (One of the 16 surviving Shia Usoul) is a weakness and reduces the chances of Tawatur.<\/p>\n<p style=\"text-align: justify;\">We notice the number of early sources is very small compared to those possessed by Ahlul-Sunnah. We mention them here: Kulayni’s Kafi, Saduq’s books, Tusi’s books, Mahasin by al-Barqi, Nawadir by Ahmad bin Muhammad bin `Isa, sixteen Usoul, Qurb-ul-Isnad by Himyari, Kamil al-Ziyarat by Ibn Qawlawayh, Basa’ir al-Darajat by al-Saffar, Ghaybat-ul-Nu`mani, Mufid’s books, Al-Imamah wal-Tabsirah by Ibn Babuwayh senior, Kifayat-ul-Athar by al-Khazzaz, Husayn bin Sa`id al-Ahwazi’s Zuhd, Muqtadab-ul-Athar by Ahmad bin `Abdul-`Aziz, Kanz-ul-Fawa’id by al-Karajiki, Al-Tabari al-Saghir’s books, Kitab-ul-Tibb by Bistam’s two unknown sons.<\/p>\n<p style=\"text-align: justify;\">Then they have books that have reached them as an entire block with one chain and they are Sulaym bin Qays, Masa’il `Ali bin Ja`far, Tawhid al-Mufaddal and al-Sahifa al-Sajjadiyyah. These are not books that contain chains for their narrations; rather they are attributed to certain Imams or companions of their Imams through certain chains, so the whole book reaches us through that chain and either the whole thing is authentic or weak. These are less relied upon books except for Masa’il `Ali bin Ja`far which they deem to be more authoritative.<\/p>\n<p style=\"text-align: justify;\">We remind the reader that some harsh criticisms were directed towards a bunch of these books but we won’t be too harsh and we’ll consider all of these as legitimate for the purposes of this research. For example the sixteen Usoul are in and of themselves bad books (<a href=\"http:\/\/twelvershia.net\/2015\/11\/28\/the-400-usool-in-shia-hadith\/\" rel=\"external nofollow\">review why here<\/a>)<\/p>\n<p style=\"text-align: justify;\">Overall, as you can see the total number of the early sources the Twelvers rely upon is around 20. Are twenty authors enough to establish Tawatur? That’s a subjective matter to say the least but that is assuming we find the same Hadith reported in all twenty sources, mostly with unique chains without them having quoted it from each-other.<\/p>\n<p style=\"text-align: justify;\">We also notice that several of these sources do not help when it comes to boosting the strength of the narrations, simply because these authors are quoting each-other’s books on many occasions and not narrating with their own chains. For instance al-Tusi’s two books are just repetitions as the author is simply quoting from earlier books, so if you found that a narration is in both al-Kafi and al-Istibsar, it doesn’t mean you have two unique chains rather it’s the author of al-Istibsar simply quoting the author of al-Kafi and this does not add much in terms of establishing Tawatur.<\/p>\n<p style=\"text-align: justify;\">We observe that a number of Twelver sources in general were suddenly discovered after centuries of being lost such as books found by al-Majlisi (1111 AH) who himself states that some of the manuscripts he came across were in very bad condition. This raises doubts about their authenticity and the possibility of forgery unlike books that have always been popular and widespread.<\/p>\n<p style=\"text-align: justify;\">As opposed to the sources of Ahlul-Sunnah, we find that Twelver books have much less variety in terms of their sources, most narrators and narrations come through the people of Qum who in turn got them from the people of Kufah. This does not help in establishing Tawatur as it causes uncertainty in the heart as to whether the people of this town manipulated their texts to suite their beliefs.<\/p>\n<p style=\"text-align: justify;\">As opposed to the sources of Ahlul-Sunnah, we find that Twelver sources contain a large number of unknown narrators, in the vast majority of cases nothing is known about a narrator except his name. This does not help in establishing Tawatur as it raises concerns about the reliability and motives of those individuals.<\/p>\n<h2 style=\"text-align: justify;\">BUKHARI VS KULAYNI: BATTLE FOR TAWATUR.<\/h2>\n<p style=\"text-align: justify;\">In this article we will compare the possibility of Tawatur in Sunni and Shia books through their main Hadith scholars: Muhammad bin Isma`il al-Bukhari and Muhammad bin Ya`qub al-Kulayni.<br \/>\nHadith scholars often introduce chapters related to the fundamentals of faith at the beginning of their collections. Therefore, both scholars started their books with topics that they deem to be important and quoted the most valuable of narrations at the beginning of each chapter.<\/p>\n<p style=\"text-align: justify;\">Taking this into consideration, we decided to take the first three chapters of each book, and take the first narration from each of the three chapters then search for the number of early sources which have also reported that same narration.<\/p>\n<p style=\"text-align: justify;\">Whether those particular narrations are reported with the same chain or different chains does not matter as we are not trying to establish the Tawatur of the chains rather we are experimenting with the possibility of realizing Tawatur through Sunni or Shia collections. More than likely, none of the reports mentioned below are Mutawatir in and of themselves but we need to discover if they have been mass-transmitted by the authors and scholars of both schools.<\/p>\n<p style=\"text-align: justify;\">Let’s give two scenarios to highlight the significance of this study for today’s Muslims.<\/p>\n<p style=\"text-align: justify;\"><em><span style=\"text-decoration: underline;\">Scenario A:<\/span><\/em><\/p>\n<p style=\"text-align: justify;\">A Nasibi is trying to convince you that Mu`awiyah ibn abi Sufiyan is one of the greatest Companions. He brings forth twenty chains to prove his claim and declares that since there are so many chains then the matter is Mutawatir and thus his belief is true regardless of the authenticity of chains.<\/p>\n<p style=\"text-align: justify;\">Upon investigation, you discover that the man has only quoted three books. One of the books is very late and therefore it’s discarded by default since Muslims never base their beliefs on late narrations. The other two books are early, one contains eighteen chains and the other contains a single report.<\/p>\n<p style=\"text-align: justify;\">The conclusion here is that the man’s claim of Tawatur is rejected, since his twenty chains are in reality coming to us via three sources. So it’s as if he only quoted three ways to back-up his beliefs and that is a very small number. Furthermore, one of the sources is very late which raises great doubts since it is considered extremely unlikely that a late source would contain a narration not supported or found in any of the early sources. This makes his belief very weak and greatly raises the possibility of it being a fabrication or a later innovation. In fact, it’s almost certain that this belief was held by nobody in the early days due to the lack of any early sources mentioning it (a.k.a no historical evidence) and that it was a late attempt by a minority of dishonest individuals.<\/p>\n<p style=\"text-align: justify;\"><em><span style=\"text-decoration: underline;\">Scenario B:<\/span><\/em><\/p>\n<p style=\"text-align: justify;\">A man quotes a narration that is only narrated by one Companion. Let’s say `Abdullah ibn `Abbas for example and let’s assume that only two of his students narrated this Hadith from him. Technically speaking the narration is not Mutawatir since it’s only reported by one Companion. However, this Hadith is found in the books of twenty early scholars, each with his respective chain up to the two students of Ibn `Abbas.<\/p>\n<p style=\"text-align: justify;\">Based on this we establish the narration’s popularity among the Muslims and the people of knowledge and we can trace back this belief to the early Islamic period through these chains. Thus, this belief is actually much stronger as it has been mass transmitted by the first Muslims and we know for a fact that they all held such beliefs in the early days. This makes it a lot more reliable than the one transmitted via twenty chains in scenario ‘A’ and greatly lowers the possibility of it being a fabrication by some late innovators.<\/p>\n<p style=\"text-align: justify;\">It is our firm belief that Islam was practiced in its purest form, away from all innovations and fabrications in the time of the Prophet (saw) and his generation. The more time passed the more falsehood began to creep into Islamic society and the more corruption began to spread. This is because logic and intellect dictate that the religion is taught in its purest form by the prophets who were tasked with the divine missions, in their time people would understand the religion better than their children ever could then knowledge is naturally lost with the passage of time and the ideas and notions become twisted and corrupted. It is very far from reality to suggest that religions start out with corruption and then get purer and nobler after centuries because if the first generations are corrupt then no accurate knowledge would be transmitted to the later generations nor would the texts be preserved.<\/p>\n<p style=\"text-align: justify;\">We hope that the two scenarios above shed some light on the mechanics of Hadith transmission and the value of mass transmission of Islamic texts in the early reliable sources.<\/p>\n<p style=\"text-align: justify;\">With this in mind we theorize that the Twelver Shia cannot fulfill the conditions of “Tawatur” for their reports, not because they don’t have multipile chains for certain beliefs they hold but because they do not have a sufficient number of early sources that they preserved in order to establish it. So if a Twelver claims that a certain belief he holds is Mutawatir and presents twenty chains from his books to prove this, then you will realize after close inspection that these twenty chains are no more than six or seven, as the majority of these chains will be present in the books of one man -usually Saduq- and the others only have one or two chains in their possession or they may even be quoting from that same man’s book (such as Tusi who often quotes Kulayni and Saduq).<\/p>\n<p style=\"text-align: justify;\">In Allah’s name let’s begin the investigation with this list,<\/p>\n<p style=\"text-align: justify;\"><strong>BUKHARI’s first:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Under chapter: “Beginning Of Divine Revelation”, Hadith: “The deeds are by the intentions etc…”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Early Supporting Sources:<\/p>\n<p style=\"text-align: justify;\">1-Aba Hanifa al-Nu`man (d.150 AH)<br \/>\n2-Aba `Abdillah Malik bin Anas al-Madani (d.179 AH)<br \/>\n3-`Abdullah bin al-Mubarak al-Turki (d.180 AH)<br \/>\n4-Waki` bin al-Jarrah al-Kufi (d.190 AH)<br \/>\n5-Abu Dawud al-Tayalisi (d.204 AH)<br \/>\n6-`Abdullah bin al-Zubayr al-Hamidi (d.219 AH)<br \/>\n7-Aba `Abdillah Ahmad bin Hanbal (d.241 AH)<br \/>\n8-Hannad bin al-Sarri bin Mus`ab al-Kufi (d.243 AH)<br \/>\n9-Abu `Isa Muhammad al-Tirmidhi (d.279 AH)<br \/>\n10-Abu al-Husayn Muslim bin Hajjaj (d.261 AH)<br \/>\n11-Hasan bin `Ali bin `Affan al-`Amiri (d.270 AH)<br \/>\n12-Abu Dawud al-Sajistani (d.275 AH)<br \/>\n13-Ibn Majah Muhammad al-Qazwini (d.273 AH)<br \/>\n14-Abu Bakr ibn abi `Asim al-Shaybani (d.287 AH)<br \/>\n15-Abu Bakr Ahmad bin `Amr al-Bazzar (d.292 AH)<br \/>\n16-Ahmad bin Shu`ayb al-Khurasani al-Nasa&#8217;i (d.303 AH)<br \/>\n17-Abu al-`Abbas al-Hasan al-Nasawi (d.303 AH)<br \/>\n18-Abu Muhammad ibn al-Jarud al-Nisaburi (d.307 AH)<br \/>\n19-Abu Ja`far ibn Jarir al-Tabari (d.310 AH)<br \/>\n20-Muhammad bin Ishaq bin Khuzaymah al-Sulami (d.311 AH)<br \/>\n21-Abu `Ali Hasan bin `Ali al-Tusi (d.312 AH)<br \/>\n22-Abu `Awanah Ya`qub al-Isfarayini (d.316 AH)<br \/>\n23-Muhammad bin Ibrahim bin al-Mundhir (d.318 AH)<br \/>\n24-Aba Ja`far Ahmad bin Muhammad al-Tahawi (d.321 AH)<br \/>\n25-`Abdul-Rahman ibn abi Hatim al-Razi (d.327 AH)<br \/>\n26-Abu al-Husayn Muhammad ibn al-Muhtadi-Billah (d.330 AH)<br \/>\n27-Abu `Uthman Sa`id al-Bahiri (d.330 AH)<br \/>\n28-Muhammad bin `Abdul-`Aziz bin `Ali al-Mu’adhin (d.330 AH)<br \/>\n29-Muhammad bin Ziyad bin al-A`rabi al-Hashimi (d.340 AH)<br \/>\n30-`Abdullah bin Muhammad bin Ya`qub al-Harithi (d.340 AH)<br \/>\n31-Muhammad ibn Hibban al-Busti (d.354 AH)<br \/>\n32-Abu Bakr Muhammad bin `Abdullah al-Bazzaz al-Shafi`i (d.354 AH)<br \/>\n33-Sulayman bin Ahmad aba al-Qasim al-Tabarani (d.360 AH)<br \/>\n34-Isma`il bin al-Qasim al-Halabi (d.370 AH)<br \/>\n35-Muhammad bin Ahmad bin Ibrahim al-Razi (d.371 AH)<br \/>\n36-Yusuf bin al-Qasim al-Mayanaji al-Qadi (d.375 AH)<br \/>\n37-Abu Ahmad al-Hakim al-Kabir (d.378 AH)<br \/>\n38-Abu Bakr ibn al-Muqri’ al-Asbahani (d.381 AH)<br \/>\n39-Abu Muhammad Hasan bin `Ali al-Jawhari al-Shirazi (d.381 AH)<br \/>\n40-Aba al-Hasan `Ali bin `Umar al-Daraqutni (d.385 AH)<br \/>\n41-Muhammad ibn Mundah al-Asbahani (d.395 AH)<br \/>\n42-Abu al-Husayn ibn Jumay` al-Saydawi (d.402 AH)<br \/>\n43-Al-Husayn ibn Talhah al-Na`ali (d.413 AH)<br \/>\n44-Tammam bin Muhammad al-Razi (d.414 AH)<br \/>\n45-Musafir bin Muhammad bin Haji al-Dimashqi (d.420 AH)<br \/>\n46-Abu `Ali bin Muhammad bin Shadhan (d.426 AH)<br \/>\n47-Aba al-Qasim `Abdul-Malik ibn Bishran (d.430 AH)<br \/>\n48-Aba Nu`aym Ahmad bin `Abdullah al-Asbahani (d.430 AH)<br \/>\n49-Al-Hasan bin Muhammad al-Khallal al-Baghdadi (d.439 AH)<br \/>\n50-Abu `Amr `Uthman bin Sa`id al-Dani (d.444 AH)<br \/>\n51-Abu Ya`la al-Khalili al-Qazwini (d.446 AH)<br \/>\n52-Muhammad bin Salamah al-Shihab-ul-Quda`i (d.454 AH)<br \/>\n53-Ibn Hazm al-Dhahiri (d.456 AH)<br \/>\n54-Abu `Ali al-Hasan al-Wakhshi (d.457 AH)<br \/>\n55-Ahmad bin Husayn bin `Ali al-Bayhaqi (d.458 AH)<\/p>\n<p style=\"text-align: justify;\"><strong>KULAYNI’s first:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Under chapter: “Intelligence And Ignorance”, Hadith: “When God created intelligence He made it speak etc…”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Early Supporting Sources:<\/p>\n<p style=\"text-align: justify;\">1-Ahmad bin Muhammad bin Khalid al-Barqi (d.274 AH)<br \/>\n2-`Ali ibn Babuwayh al-Saduq al-Qummi (d.381 AH)<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Comment: We found Kulayni’s narration in 2 early Twelver Shia works. Saduq lists it in some of his books like al-Faqih, al-Ikhtisas, al-Amali and al-Ma`ani. Al-Barqi quotes it in al-Mahasin. However, al-Kulayni quotes his own narration from al-Barqi’s same book so it doesn’t help much in creating Tawatur.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><strong>BUKHARI’s second:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Under chapter: “Your Invocation Means Your Faith”, Hadith: “Islam was founded upon these five etc…”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Early Supporting Sources:<\/p>\n<p style=\"text-align: justify;\">1-`Abdullah bin al-Zubayr al-Hamidi (d.219 AH)<br \/>\n2-Al-Qasim bin Sallam Al-Khurasani al-Harawi (d.224 AH)<br \/>\n3-Abu Bakr ibn abi Shaybah al-Kufi (d.235 AH)<br \/>\n4-Aba `Abdillah Ahmad bin Hanbal (d.241 AH)<br \/>\n5-Muhammad bin Aslam al-Tusi (d.242 AH)<br \/>\n6-Muhammad bin Yahya al-`Adani (d.243 AH)<br \/>\n7-Abu Muhammad `Abdul-Hamid al-Kashshi (d.249 AH)<br \/>\n8-Abu `Isa Muhammad al-Tirmidhi (d.279 AH)<br \/>\n9-Abu al-Husayn Muslim bin Hajjaj (d.261 AH)<br \/>\n10-Muhammad bin Nasr al-Mirwazi (d.294 AH)<br \/>\n11-Abu al-`Abbas al-Hasan al-Nasawi (d.303 AH)<br \/>\n12-Ahmad bin Shu`ayb al-Khurasani al-Nasa&#8217;i (d.303 AH)<br \/>\n13-Abu Ya`la Ahmad bin `Ali al-Musuli (d.307 AH)<br \/>\n14-Abu Bishr Muhammad al-Dulabi al-Warraq (d.310 AH)<br \/>\n15-Muhammad bin Ishaq bin Khuzaymah al-Sulami (d.311 AH)<br \/>\n16-Abu Bakr bin Muhammad al-Khallal al-Baghdadi (d.311 AH)<br \/>\n17-Aba Ja`far Ahmad bin Muhammad al-Tahawi (d.321 AH)<br \/>\n18-`Abdullah bin Muhammad bin Sa`id bin abi Mariyam (d.330 AH)<br \/>\n19-Muhammad bin `Amr al-Bakhtari (d.339 AH)<br \/>\n20-Hamzah bin Yusuf al-Sahmi (d.345 AH)<br \/>\n21-Abu Bakr Muhammad bin `Abdullah al-Bazzaz al-Shafi`i (d.354 AH)<br \/>\n22-Muhammad ibn Hibban al-Busti (d.354 AH)<br \/>\n23-Abu Bakr Muhammad bin Husayn al-Ajurri (d.360 AH)<br \/>\n24-Sulayman bin Ahmad aba al-Qasim al-Tabarani (d.360 AH)<br \/>\n25-Abu Bakr ibn al-Muqri’ al-Asbahani (d.381 AH)<br \/>\n26-Abu Muhammad Hasan bin `Ali al-Jawhari al-Shirazi (d.381 AH)<br \/>\n27-`Ubaydullah ibn Battah al-`Ukbari (d.387 AH)<br \/>\n28-Abu al-Husayn ibn Sam`un al-Wa`idh (d.387 AH)<br \/>\n29-Muhammad ibn Mundah al-Asbahani (d.395 AH)<br \/>\n30-Abu al-Fath Muhammad ibn abi al-Fawaris (d.412 AH)<br \/>\n31-Hibatullah al-Hasan al-Lalika’i (d.418 AH)<br \/>\n32-Lahiq bin Muhammad bin Ahmad al-Iskaf (d.420 AH)<br \/>\n33-Aba Nu`aym Ahmad bin `Abdullah al-Asbahani (d.430 AH)<br \/>\n34-Muhammad bin al-Fadl bin Nadhif al-Misri al-Farra’ (d.431 AH)<br \/>\n35-Ahmad bin Husayn bin `Ali al-Bayhaqi (d.458 AH)<\/p>\n<p style=\"text-align: justify;\"><strong>KULAYNI’s second:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Under chapter: “The Necessity To Seek Knowledge And The Recommendations To Learn”, Hadith: “Seeking knowledge is obligatory for every muslim etc…”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Early Supporting Sources:<\/p>\n<p style=\"text-align: justify;\">1-Ahmad bin Muhammad bin Khalid al-Barqi (d.274 AH)<br \/>\n2-Muhammad bin al-Hasan al-Saffar (d.290 AH)<br \/>\n3-Aba `Abdillah Muhammad al-Mufid (d.413 AH)<br \/>\n4-Abu Ja`far Muhammad al-Tusi (d.460 AH)<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Comment: We found this tradition in 4 other early Twelver Shia Hadith books. Mufid and Tusi in their Amali, Barqi in his Mahasin and Saffar in his Basa’ir.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><strong>BUKHARI’s third:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Under chapter: “Regarding The Deeds Of Faith”, Hadith: “Faith consists of more than sixty branches etc…”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Early Supporting Sources:<\/p>\n<p style=\"text-align: justify;\">1-Ma`mar bin Rashid al-Azdi (d.154 AH)<br \/>\n2-Abu Dawud al-Tayalisi (d.204 AH)<br \/>\n3-Al-Qasim bin Sallam Al-Khurasani al-Harawi (d.224 AH)<br \/>\n4-Abu Bakr ibn abi Shaybah al-Kufi (d.235 AH)<br \/>\n5-Aba `Abdillah Ahmad bin Hanbal (d.241 AH)<br \/>\n6-Abu `Isa Muhammad al-Tirmidhi (d.279 AH)<br \/>\n7-Abu al-Husayn Muslim bin Hajjaj (d.261 AH)<br \/>\n8-`Abbas bin `Abdullah al-Tarqufi al-Bakusa’i (d.267 AH)<br \/>\n9-Abu Dawud al-Sajistani (d.275 AH)<br \/>\n10-Ibn Majah Muhammad al-Qazwini (d.273 AH)<br \/>\n11-`Abdullah bin Ahmad bin Hanbal (d.290 AH)<br \/>\n12-Muhammad bin Nasr al-Mirwazi (d.294 AH)<br \/>\n13-Ahmad bin Shu`ayb al-Khurasani al-Nasa&#8217;i (d.303 AH)<br \/>\n14-Abu Bakr bin Muhammad al-Khallal al-Baghdadi (d.311 AH)<br \/>\n15-Abu `Ali Hasan bin `Ali al-Tusi (d.312 AH)<br \/>\n16-Muhammad bin Ibrahim bin Ja`far al-Jurajani (d.330 AH)<br \/>\n17-`Abdullah bin Muhammad bin Sa`id bin abi Mariyam (d.330 AH)<br \/>\n18-Aba Hafs al-Zayyat bin Bukayr (d.330 AH)<br \/>\n19-Abu Sa`id bin al-A`rabi al-Sufi al-Basri (d.340 AH)<br \/>\n20-`Uthman ibn Wardan al-Samarqandi (d.345 AH)<br \/>\n21-Muhammad ibn Hibban al-Busti (d.354 AH)<br \/>\n22-Abu Bakr Muhammad bin Husayn al-Ajurri (d.360 AH)<br \/>\n23-Sulayman bin Ahmad aba al-Qasim al-Tabarani (d.360 AH)<br \/>\n24-Isma`il bin al-Qasim al-Halabi (d.370 AH)<br \/>\n25-Abu Hafs `Umar bin Ahmad Ibn Shahin (d.385 AH)<br \/>\n26-`Ubaydullah ibn Battah al-`Ukbari (d.387 AH)<br \/>\n27-`Isa bin `Ali bin `Isa al-Katib al-Baghdadi (d.391 AH)<br \/>\n28-Muhammad ibn Mundah al-Asbahani (d.395 AH)<br \/>\n29-Muhammad bin al-Husayn aba `Abdul-Rahman al-Sulami (d.412 AH)<br \/>\n30-Abu Sa`d Ahmad al-Malini al-Sufi (d.412 AH)<br \/>\n31-Hibatullah al-Hasan al-Lalika’i (d.418 AH)<br \/>\n32-Musafir bin Muhammad bin Haji al-Dimashqi (d.420 AH)<br \/>\n33-Aba Nu`aym Ahmad bin `Abdullah al-Asbahani (d.430 AH)<br \/>\n34-Aba al-Qasim `Abdul-Malik ibn Bishran (d.430 AH)<br \/>\n35-Muhammad bin al-Fadl bin Nadhif al-Misri al-Farra’ (d.431 AH)<br \/>\n36-Ibn Hazm al-Dhahiri (d.456 AH)<br \/>\n37-Ahmad bin Husayn bin `Ali al-Bayhaqi (d.458 AH)<\/p>\n<p style=\"text-align: justify;\"><strong>KULAYNI’s third:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Under chapter: “The Quality Of Knowledge Its Virtue And The Virtue Of The Scholars”, Hadith: “Knowledge consists of only three kinds etc…”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Early Supporting Sources:<\/p>\n<p style=\"text-align: justify;\">1-`Ali ibn Babuwayh al-Saduq al-Qummi (d.381 AH)<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Comment: Only 1 source supports Kulayni’s narration. Saduq quotes it in his two books al-Amali and in Ma`ani al-Akhbar.<\/p>\n<\/blockquote>\n<h2 style=\"text-align: justify;\">CONCLUSION:<\/h2>\n<p style=\"text-align: justify;\">After researching the six important narrations above, we reach the conclusion that it is highly unlikely that the Twelver Shia can claim that their narrations are mass transmitted (Mutawatir). The difficulty for the Twelvers will arise when returning to their limited early sources and this is due to the fact that they do not have many reliable books to begin with. As the readers saw above, some of the most important of Twelver narrations can barely be found in five sources out of around twenty that can be relied upon according to their standards. We are not claiming that the Twelver sources do not contain a Mutawatir report here or there but we are assuring the readers that such reports will not be mentioned in a large number of sources. Therefore, if a Shia is hoping to quote seventy or forty sources for any of his beliefs and claim Tawatur, then we wish him good luck as that will never happen. A Shia will have to lower his standards for “Tawatur” greatly in order to be able to claim that some of his beliefs are indeed Mutawatir in his own books. So instead of setting a high standard for Tawatur, he can at best hope for forteen or sixteen sources. On the other hand, Ahlul-Sunnah have in their possession a large number of reliable early sources. This big number of sources serves as a means to verify the legitimacy of the chains quoted by the Sunni authors and it also enables the possibility of acquiring Mutawatir reports. This is why when a Twelver wishes to claim a matter is Mutawatir, he will give a long list of Sunni sources or a mixture of Sunni and Shia sources since their books are insufficient.<br \/>\nAllah is the best guide.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This is our second article concerning the topic of Tawatur, in this article we will go in-depth in a practical way as opposed to our first article which discussed the matter in more of a theoretical manner. In our last <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/04\/09\/the-possibility-of-tawatur-between-sunnah-shia\/\" title=\"The possibility of Tawatur between Sunnah &#038; Shia\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-3164","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3164","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3164"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3164\/revisions"}],"predecessor-version":[{"id":3262,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3164\/revisions\/3262"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3164"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3164"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3164"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}