{"id":3171,"date":"2016-04-14T18:17:51","date_gmt":"2016-04-14T18:17:51","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3171"},"modified":"2017-02-14T13:05:18","modified_gmt":"2017-02-14T13:05:18","slug":"mirza-abu-al-qasim-al-qummi-tahreef","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/04\/14\/mirza-abu-al-qasim-al-qummi-tahreef\/","title":{"rendered":"Mirza abu al-Qasim al-Qummi &#038; Tahreef"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3171\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Mirza abu al-Qasim bin Muhammad Hasan al-Qummi (d.1231 AH) in his book al-Qawanin al-Muhkamah fil-Usoul vol.2 discusses the Qur&#8217;an and its preservation. The text is advanced and the author&#8217;s weak Arabic requires us to explain some of the texts we&#8217;re quoting.<\/p>\n<p style=\"text-align: justify;\">He begins on page 321 by stating his opinion:<\/p>\n<p style=\"text-align: justify;\">أما تواتر القرآن في الجملة ووجوب العمل بما في أيدينا اليوم فمما لا شك فيه ولا شبهة تعتريه لكن تواتر جميع ما نزل على محمد صلى الله عليه وآله غير معلوم وكذا وجوب تواتره<\/p>\n<p style=\"text-align: justify;\">[As for the Qur&#8217;an being Mutawatir in general and the necessity of using whatever is in our hands today (from Allah&#8217;s book) then there are no doubts about this. However, the Tawatur of all the revelation that Muhammad (saw) received is not confirmed nor is the necessity of its Tawatur.]<\/p>\n<p style=\"text-align: justify;\">Comment: He is saying that the Qur&#8217;an we have in our hands today is mass transmitted and we must utilize it to extract rulings BUT it&#8217; not confirmed that this Qur&#8217;an contains all the revealed verses nor that all of those revelations reached us through mass transmission, such a matter isn&#8217;t necessary in his opinion. (You will see why below)<\/p>\n<p style=\"text-align: justify;\">What he means above is that the Qur&#8217;an became mass transmitted after certain alterations took place. (As you will also see below)<\/p>\n<p style=\"text-align: justify;\">He continues on the same page by informing us of why Tawatur can&#8217;t be claimed for all revelation. He does so by showing that the Shia differed on the matter of the corruption of Allah&#8217;s book and lists examples of scholars who believe and others who disbelieve in it.<\/p>\n<p style=\"text-align: justify;\">He then quotes some books containing narrations and how some scholars dealt with them or how they explained corruption to be related to the interpretation of verses. Then on page 326 he writes:<\/p>\n<p style=\"text-align: justify;\">ثم ذكر قول الصحابة لنبيهم صلى الله عليه وآله على الحوض إذا سئلهم كيف خلفتموني في الثقلين من بعدي فيقولون أما الأكبر فحرفناه وبدلناه وأما الأصغر فقتلناه ثم يذادون عن الحوض وأما الدليل على الثاني فقوله تعالى لا يأتيه الباطل من بين يديه ولا من خلفه ولا دلالة فيه أصلا كما لا يخفى وقوله تعالى إنا نحن نزلنا الذكر وإنا له لحافظون وفيه أنه لا يدل على عدم التغيير في القرآن الذي بأيدينا فيكفي كونه محفوظا عند الأئمة عليهم السلام<\/p>\n<p style=\"text-align: justify;\">[Then he mentioned the saying of the Companions to the Prophet (saw) on the fount when he (saw) asks: &#8220;How did you succeed me in the two weighty things?&#8221; They reply: &#8220;As for the bigger one we corrupted it and changed it. As for the smallest of the two, we have murdered them. So they are chased away from the fount. Regarding the evidence for the second, it is Allah&#8217;s words {Falsehood shall not approach it from in front of it nor from behind} This (verse) does not constitute evidence ( for its preservation) as is clear. Then there is Allah&#8217;s saying {It is we who have revealed the remembrance and it is we who shall guard it} This (too) does not prove that the Qur&#8217;an in our hands is safe from corruption for it is sufficient that the Imams (as) have it preserved with them]<\/p>\n<p style=\"text-align: justify;\">Comment: You can see that he writes above that the two verses are not acceptable evidence to prove that the Qur&#8217;an we have in our hands today is unchanged. He says it can simply mean that it&#8217;s preserved with the 12 Imams.<\/p>\n<p style=\"text-align: justify;\">He continues:<\/p>\n<p style=\"text-align: justify;\">ولا ريب أن ما في أيدينا أيضا محفوظ من أن يتطرق إليه نقص آخر أو زيادة مع احتمال أن يراد من قوله تعالى لحافظون لعالمون<\/p>\n<p style=\"text-align: justify;\">[No doubt that what is in our hands is also preserved from undergoing other deletions or an addition, taking into account that it&#8217;s possible that the meaning of {It is we who shall guard it} means &#8220;Know it&#8221;.]<\/p>\n<p style=\"text-align: justify;\">Comment: Notice that he says &#8220;what we have today is safe from undergoing other deletions&#8221; Meaning, the Qur&#8217;an has already had verses deleted from it but since it became mass transmitted today then no further deletions shall take place. He also rejects additions generally. Then he gives a different interpretation to the popular verse above and claims it means &#8220;We know it&#8221; instead of &#8220;We shall preserve it&#8221;.<\/p>\n<p style=\"text-align: justify;\">He writes on pg.327:<\/p>\n<p style=\"text-align: justify;\">وفيه أنه لم يخرج بذلك عن كونه معجزا لبقاء الأسلوب والبلاغة اللذين هما مناط الاعجاز بحالهما بل سائر وجوه الاعجاز أيضا مع أنه لم يدخل الاخبار على حصول الزيادة وادعى على عدمها أيضا الاجماع الشيخ والطبرسي<\/p>\n<p style=\"text-align: justify;\">[Furthermore, it (meaning the Qur&#8217;an in our hands) continues to be a miraculous text due to the fact that both its style and eloquence remained present, they are the center of miraculous texts and even other miraculous factors (remained therein). Although the narrations have not declared that any additions took place and consensus was claimed on this by al-Shaykh and al-Tubrusi]<\/p>\n<p style=\"text-align: justify;\">Comment: He is saying that even after the book was corrupted yet it can still be considered a miraculous text since the corruption did not alter the style and eloquence. He believes that addition has not taken place and that only addition can affect the miraculous nature of the text not the deletion.<\/p>\n<p style=\"text-align: justify;\">والذي له مدخلية في الاخراج عن حد الاعجاز هو الزيادة غالبا وكذلك لم يظهر وقوع التحريف في آيات الاحكام مع أنه لو وقع فليس بأعظم من غيبة الإمام عليه السلام<\/p>\n<p style=\"text-align: justify;\">[What can play a major role in ruining the miraculous nature (of the text) are usually the additions. In addition, it doesn&#8217;t appear that corruption has reached the verses of religious rulings although even if it did then it is no greater than the absence of our Imam (as)]<\/p>\n<p style=\"text-align: justify;\">Comment: The author affirmed what we said above that deletions do not harm the beauty of the text. Then he says that the corruption didn&#8217;t seem to affect any of the verses containing religious laws therefore they are still present. He adds, that even if the verses of the laws were in fact corrupted, then it&#8217;s a lot less worse than the Imam who is hiding. So there&#8217;s nothing that guarantees the safety of such verses from corruption since the loss of the Imam is more important for them than the loss of some verses.<\/p>\n<p style=\"text-align: justify;\">Next the author discusses the prophetic order to refer to the book of Allah and hold fast to its rulings in the light of the above.<\/p>\n<p style=\"text-align: justify;\">He says on page 328:<\/p>\n<p style=\"text-align: justify;\">ما ورد من هذه الأخبار عن النبي صلى الله عليه وآله وسلم لا ينافي ما ذكرنا فإنه أمر أيضا بالتمسك بالأوصياء عليهم السلام مع أنهم صاروا ممنوعين عن التبليغ<\/p>\n<p style=\"text-align: justify;\">[What was reported from those narrations from the Prophet (saw) does not conflict with what we previously mentioned (That the Qur&#8217;an has been corrupted) for he has also ordered us to hold on to the legatees (as) although they are currently prevented from preaching]<\/p>\n<p style=\"text-align: justify;\">Comment: As is clear, the author says that the narrations of the Prophet (saw) do not oppose the belief in Tahreef. The Prophet (saw) ordered us to obey the 12 Imams according to the author but they&#8217;re not available. Similarly, the verses that were deleted by some evil men according to his sect are also unavailable.<\/p>\n<p style=\"text-align: justify;\">وأما ما ورد من الأئمة عليهم السلام فلا ينافي تجويزهم العمل بها من باب التقية وحكم الله الظاهري<\/p>\n<p style=\"text-align: justify;\">[As for what was reported from the Imams (as) with this regard, then it also doesn&#8217;t conflict as they permitted it out of Taqiyyah and following Allah&#8217;s apparent laws]<\/p>\n<p style=\"text-align: justify;\">Comment: He means that those narrations where the Imams ordered their followers to read the same Qur&#8217;an we&#8217;re reading and present the narrations to Allah&#8217;s book. He says this was only out of Taqiyyah.<\/p>\n<p style=\"text-align: justify;\">كما سنقول في القراءات السبعة المتواترة ما يقرب من ذلك أو نقول إنا لا نلتزم تغيير الاحكام فيما ذكر في الكتاب الذي بأيدينا اليوم بل هي صحيحة وإن كان لا ينافي ذلك حذف بعض الكلمات منه كذكر أسماء أهل البيت عليهم السلام والمنافقين وعدم ذكر بعض الأحكام أيضا<\/p>\n<p style=\"text-align: justify;\">[We will say something similar regarding the seven Mutawatir recitations. We say that we do not hold the opinion that the rulings were changed in the Book we hold in our hands today rather they&#8217;re correct although this does not conflict with believing that some words were deleted such as the names of Ahlul-Bayt (as) or the hypocrites or even some rulings too]<\/p>\n<p style=\"text-align: justify;\">Comment: He says that holding on to the seven recitations is also out of Taqiyyah and repeats that he doesn&#8217;t believe the rulings found in the present Qur&#8217;an have been corrupted although other types of corruption crept into our Book.<\/p>\n<p style=\"text-align: justify;\">The author then mentions that the above can be opposed by the claim that the seven recitations were mass transmitted and some of their scholars claimed consensus on this and some even went further to include the other three recitations. He then moves on to mention another group of their scholars who objected to this and disbelieved in the mass transmission of the seven recitations.<\/p>\n<p style=\"text-align: justify;\">He says on page 330, that those who claim Tawatur for these recitations imply that they&#8217;re mass transmitted directly from Allah through the Prophet (saw). He says this is incorrect based on what he wrote in the previous section about how all the Books were burned by `Uthman.<\/p>\n<p style=\"text-align: justify;\">نعم إن كان مرادهم تواترها من الأئمة عليهم السلام بمعنى تجويزهم قرائتها والعمل على مقتضاها فهذا هو الذي يمكن أن يدعى معلوميتها من الشارع لأمرهم بقرائة القرآن كما يقرء الناس وتقريرهم لأصحابهم على ذلك وهذا لا ينافي عدم علمية صدورها عن النبي صلى الله عليه وآله ووقوع الزيادة والنقصان فيه والاذعان بذلك والسكوت عما سواه أوفق بطريقة الاحتياط<\/p>\n<p style=\"text-align: justify;\">[Whereas if they meant that it is mass transmitted from the Imams (as) that they permitted their followers to recite the Book and work with its rulings then this is a legitimate claim since they ordered that the Qur&#8217;an be recited the way the people recited it and they accepted this. This doesn&#8217;t conflict with it having came from the Prophet (saw) but then having been exposed to additions and deletions however remaining silent in this regard was better out of precaution.]<\/p>\n<p style=\"text-align: justify;\">On page 333 he quotes after a long discussion of what was meant by the &#8220;seven letters&#8221; in the popular narration:<\/p>\n<p style=\"text-align: justify;\">وكيف كان فدعوى تواتر السبعة عن النبي صلى الله عليه وآله محل كلام &#8230; نعم اتفق التواتر في الطبقات اللاحقة وأيضا تواترها عنهم كيف يفيدوهم من آحاد المخالفين استبدوا بآرائهم كما تقدم وإسنادهم إلى النبي صلى الله عليه وآله إن ثبت فلا حجة<\/p>\n<p style=\"text-align: justify;\">[Either way, the mass transmission of the seven recitation directly from the Prophet (saw) is disputed [etc] Yes, Tawatur did occur in later stages but how can this be useful for them (meaning the Shia) if it came through individuals from among our opponents who had complete control over this matter and their chains to the Prophet (saw) even if they were able to establish them then they are still not binding upon us]<\/p>\n<p style=\"text-align: justify;\">That&#8217;s the end of his chapter regarding the Book of Allah and from this we conclude the following:<\/p>\n<p style=\"text-align: justify;\">A- He casts doubt on the seven recitations preserved by the nation.<\/p>\n<p style=\"text-align: justify;\">B- He casts great doubt on the Book compiled by `Uthman.<\/p>\n<p style=\"text-align: justify;\">C- He refutes any arguments in support of the safety of the Qur&#8217;an from corruption.<\/p>\n<p style=\"text-align: justify;\">D- He does not view that the corruption of the Qur&#8217;an is a great matter since the occultation of his Imam is a greater calamity in his opinion.<\/p>\n<p style=\"text-align: justify;\">E- He doesn&#8217;t think additions took place as it would affect the miraculous nature of the text but is ultimately unsure of this.<\/p>\n<p style=\"text-align: justify;\">F- He believes deletions and omissions took place and doesn&#8217;t seem to object to this.<\/p>\n<p style=\"text-align: justify;\">G- He believes the verses containing rulings in the Qur&#8217;an are intact and correct even though some rulings may have been deleted.<\/p>\n<p style=\"text-align: justify;\">H- He believes the Imams ordered the Shia to recite the Qur&#8217;an in our hands today and to present the narrations to Allah&#8217;s book but only out of Taqiyyah.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Mirza abu al-Qasim bin Muhammad Hasan al-Qummi (d.1231 AH) in his book al-Qawanin al-Muhkamah fil-Usoul vol.2 discusses the Qur&#8217;an and its preservation. The text is advanced and the author&#8217;s weak Arabic requires us to explain some of the texts we&#8217;re <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/04\/14\/mirza-abu-al-qasim-al-qummi-tahreef\/\" title=\"Mirza abu al-Qasim al-Qummi &#038; Tahreef\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3818,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[53],"class_list":{"0":"post-3171","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran","9":"tag-tahreef"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3171","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3171"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3171\/revisions"}],"predecessor-version":[{"id":3177,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3171\/revisions\/3177"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3818"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}