{"id":320,"date":"2013-05-05T21:23:02","date_gmt":"2013-05-05T21:23:02","guid":{"rendered":"http:\/\/twelvershia.net\/?p=320"},"modified":"2013-05-05T21:35:33","modified_gmt":"2013-05-05T21:35:33","slug":"response-to-the-queer-sahaba","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/05\/05\/response-to-the-queer-sahaba\/","title":{"rendered":"Response to: The Queer Sahaba"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=320\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Response to: The Queer Sahaba<\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on RevisitingtheSalaf.org entitled: The Queer Sahaba, which was published on the 5<sup>th<\/sup> of April, 2012, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/04\/effeminate-companions.html\" rel=\"external nofollow\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #800000;\">Short Introduction and ruling of &#8220;Mukhannatheen&#8221;: <\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">Mukhannath means &#8220;effeminate man&#8221; and the scholars of Fiqh have listed three types:<\/p>\n<p style=\"text-align: justify;\"><strong>A<\/strong>&#8211; Those who are born effeminate, they wear normal respectable clothes and try to act like average people but one can observe from their actions that they are indeed effeminate.<\/p>\n<p style=\"text-align: justify;\"><strong>B<\/strong>&#8211; Those men who go out of their way to look and act like women, whether they are born effeminate or become so later.<\/p>\n<p style=\"text-align: justify;\"><strong>C<\/strong>&#8211; The rare case of a hermaphrodite, a creation of Allah who has both male and female genitals at the same time.<\/p>\n<p style=\"text-align: justify;\">Regarding group &#8220;<strong>A<\/strong>&#8220;, it was known that some men in some societies were born effeminate, and since back in those days society was small and all the people knew each-other well, these men would be allowed to approach women if it is known that they do not have sexual urges or desires towards women, such as the man who sat in the presence of the mothers of believers (ra). When the Prophet (SAWS) learned that this man did indeed have some sexual desire towards women, and when he saw how he described the body of another woman, he forbade him from entering upon them ever again.<\/p>\n<p style=\"text-align: justify;\">Regarding group &#8220;<strong>B<\/strong>&#8220;, they are men who try to look like women, they would wear their clothes and act in a womanly fashion, so in order to remove their bad example from society the Prophet (SAWS) and the rightly guided Caliphs (ra) after him would punish them, they would be exiled or imprisoned until they cease from their evil acts, they are cursed by the Prophet (SAWS). Finally, if it is known that any &#8220;Mukhannath&#8221; or effeminate man, commits an act of sodomy with another man, they would be punished by death.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>al-Mukhannatheen in the words of the scholars:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">The Mukhannatheen in the Hanafi Madhab:<\/p>\n<p>&#8220;al-Mukhannath according to us is as follows: If he was a Mukhannath who commits lewd actions, then he is like the other men, but rather he is a Fasiq and must be kept away from women. On the other hand, if he had some feminine softness in his limbs and his tongue, as a result of him being created this way, and he does not desire women, and he is not effeminate in the sense of committing lewd actions, in this case some of our scholars have allowed them to be left with women.&#8221;<\/p>\n<p>source: al-Mabsout 12\/382.<\/p>\n<p style=\"text-align: justify;\">The Mukhannatheen in the Maliki Madhab:<\/p>\n<p>&#8220;The Mukhannath is not necessarily one who is known for lewd acts, al-Mukhannath means having a strong femininity in his features which make him resemble the woman in her softness and speech and looks and tone and thinking and actions, regardless if he had lewdness or not. And the origin of Takhannuth is languidness and softness as we described, and if he had no desire for women, and was weak of mind, then he would be from those who are permitted to enter upon women.&#8221;<\/p>\n<p>source: al-Tamheed lima fil-Ma`ani wal-Muwatta&#8217; min Asaneed 22\/273.<\/p>\n<p style=\"text-align: justify;\">The Mukhannatheen in the Shafi`i Madhab:<\/p>\n<p>&#8220;He who has the characteristics of a woman in features and movements, if he was originally born like such then there is no guilt.&#8221;<\/p>\n<p style=\"text-align: justify;\">source: Mughni al-Muhtaj fi Ma`rifat Ma`ani al-Alfaz 4\/430.<\/p>\n<p style=\"text-align: justify;\">The Mukhannatheen in the Hanbali Madhab:<\/p>\n<p>&#8220;The Mukhannath who has no sexual desire, if he looked at one (a woman) his ruling would be that of a (male) Mahram, but if a Mukhannath had desires and understood women&#8217;s charm then his ruling (when he looks) would be like any other man.&#8221;<br \/>\nsource: al-Mughni 7\/462.<\/p>\n<p>al-Imam al-Nawawi said:<\/p>\n<p>&#8220;A Mukhannath is the one who carries in his movements, in his appearance and in his language the characteristics of a woman. There are two types; the first is the one in whom these characteristics are innate, he did not put them on by himself, and therein is no guilt, no blame and no shame, as long as he does not perform any (illicit) act or exploit it for money (prostitution etc.). The second type acts like a woman out of immoral purposes and he is the sinner and blameworthy.&#8221;<\/p>\n<p>al-Imam ibn Hajar said:<\/p>\n<p>&#8220;As for those who were afflicted with it since birth, then he is ordered to make an effort to leave it, and to try gradually, but if he does not, and if he goes too far in acting like a woman then he is blameworthy, especially if he takes pleasure in his effeminacy.  As for those who completely allowed it in case it was a part of their creation, such as al-Nawawi, and said: &#8220;That in this case there is no blame&#8221;, what is meant here are those who try hard to leave the languidness of the limbs when walking and the suppleness in speech after receiving treatment. Otherwise, if getting rid of this condition is possible, even if gradually and through time, then not placing an effort to do so would make one blameworthy.&#8221;<\/p>\n<p>source: Fath-ul-Bari 10\/332.<\/p>\n<p>Contemporary scholar ibn Baz says:<\/p>\n<p>&#8220;Takhannuth is to act like women, this does not mean that he is a sodomite(gay) as some laypeople today might think.&#8221;<\/p>\n<p>source: Majmu` Fatawa wa Maqalat ibn Baz 3\/452.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Refutation of RTS&#8217;s article:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">RTS starts of the article with the following:<\/p>\n<p style=\"text-align: justify;\"> <span style=\"color: #ff0000;\">Mukhannathun (مُخَنَّث ) or commonly known in the west as &#8216; effeminate  ones&#8217; are men who resemble women or as we would now call transgendered, or male-to-female transsexuals. Various &#8220;mukhannathun&#8221; appear in several books of Rijal and Hadeeth. It is said these transexuals accepted Islam however lived in the boundaries of Medina and Makkah. We wish to make it clear that we are in no way attacking hermaphrodites for they are a creation from Allah (swt).  <\/span><\/p>\n<p style=\"text-align: justify;\">We say: The term “Mukhannath” in the Arabic language refers to three types of people. It refers to a hermaphrodites, those with two reproductive organs and demonstrates no interest in the opposite sex, it refers to transvestites, who attempt to look like women, and it also refers to those men who are born effeminate or who are brought up in a way that they may cause them to be effeminate. The hermaphrodite is a creation of Allah and there are no verses or narrations that criticize this form of Mukhannath. The  transvestite Mukhannath, is the form that it criticized by the Messenger (pbuh) in the prophetic narrations. As for the last type, it depends if they commit any unlawful acts, so there is nothing special about them. It is important to differentiate between the three in order to understand the correct position towards them in the eyes of the Shari’ah.<\/p>\n<p style=\"text-align: justify;\">RTS continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">There is however evidence that points to hermaphrodites possessing acts such as buggery which if why the Sunnah of the Prophet (saw) has always been to keep a distance with such persons in that they should not live within the family unit. <\/span><\/p>\n<p style=\"text-align: justify;\">If RTS is suggesting that Mukhanathoon are having sexual intercourse with males, then this is completely incorrect. The Messenger (pbuh) had legislated the death punishment for acts of Sodomy. To “keep a distance” from those that perform such an action would be an understatement.<\/p>\n<p style=\"text-align: justify;\">RTS continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Just like nowadays, hermaphrodites existed during the lifetime of the Prophet (saw) and their coming into contact with him (saw), taking the Shahada and dying on that faith automatically places them within the definition of Sahabah (Companion).  We wish to reiterate that the fact that certain hermaphrodite companions existed in no way gives us the right to mock these individuals but we see some effeminate behaviors they exhibited, swayed towards their being inclined towards transvestism, as we shall evidence in this article.<\/span><\/p>\n<p style=\"text-align: justify;\">There is no immediate connection between a person who is born as effeminate and a person who goes out of his way to look and act like a woman. As for hermaphrodites they are a medical condition. A person who is effeminate since childhood is accepted in society as long as he does not try to appear like a woman or in other words becomes a transvestite.<\/p>\n<p style=\"text-align: justify;\">RTS says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Now since the Bakri’s have the same nauseam rant that each and every aspect of the lives of the Sahabah should be an inspiration for today’s Bakri community then we invite these Bakri’s to desist from attacking effeminate males and  transvestism  and suggesting they are plagues of a kuffar society, they should instead wholeheartedly embrace these forms of sexuality and fashion sense, and adopt these styles, whether that be at home, the workplace or during their Islamic study circles so that it is known to all asunder that the Salafis are those who have no shame in following the Sahabah of the Prophet (saw) no matter how they behaved or dressed.<\/span><\/p>\n<p style=\"text-align: justify;\">Indeed, nobody should attack hermaphrodites, for they are the creation of Allah. As for transvestites; they are cursed by the tongue of Mohammad (pbuh), for it is their free will that causes them to act in such a way.<\/p>\n<p style=\"text-align: justify;\">Ibn Abbas narrated:<\/p>\n<p style=\"text-align: center;\"><strong>لعن رسول الله صلى الله عليه وسلم المتشبهين من الرجال بالنساء والمتشبهات من النساء بالرجال<\/strong><\/p>\n<p style=\"text-align: justify;\">The Messenger (pbuh) cursed the men that imitate women and the women that imitate men. (Saheeh Al-Bukhari #5435)<\/p>\n<p style=\"text-align: justify;\">So, no, there is no evidence that suggests that one should adopt these styles or accept their “sexuality.”<\/p>\n<p style=\"text-align: justify;\">As for the companions (ra), Allah tell us to follow ONLY their good acts, since Allah knows that they&#8217;re not infallible and they are imperfect humans:<\/p>\n<p style=\"text-align: justify;\">{And the first to lead the way, of the Muhajirin and the Ansar,<strong> and those who followed them in <span style=\"text-decoration: underline;\">goodness<\/span><\/strong> &#8211; Allah is well pleased with them and they are well pleased with Him, and He hath made ready for them Gardens underneath which rivers flow, wherein they will abide for ever. That is the supreme triumph.} [Qur&#8217;an 9:100]<\/p>\n<p style=\"text-align: justify;\">RTS says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is important to note the sources that have been used are books that are biographies of companions thus no ambiguity as to who these individuals are. Now to introduce some of these roles models for the present day Salaf let us take a look as to who they are.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;HEET&#8217;<\/span><\/p>\n<p style=\"text-align: right;\"><strong><span style=\"color: #ff0000;\">وقع ذكره في صحيح البخاري من طريق سفيان بن عتبة عن هشام بن عروة عن أبيه عن زينب بنت أبي سلمة عن أم سلمة قالت: دخل علي رسول الله صلى الله عليه وآله وسلم وعندي مخنث فسمعته يقول لعبد الله بن أبي أمية: إن فتح الله عليكم الطائف فعليك بابنة غيلان فإنها تقبل بأربع وتدبر بثمان فقال النبي صلى الله عليه وآله وسلم: &#8221; لا يدخل عليكم هذا . قال سفيان: قال بن جريج: اسم المخنث هيت. والحديث عند مسلم وأبي داود والنسائي دون تسميته .<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">He has been mentioned in Saheeh Al-Bukhari from the chain of Sufyan son of Ayeena, from Hisham son of Arwa from his father, from Zainab daughter of Abi Salma from Umma Salama she said: &#8220;The Messenger of Allah (saw) came to us and amongst us was a Hermaphrodite  , and so he heard him say to Abdullah son of Ubay Ummaya: &#8220;If Allah opened Ta&#8217;ef for you, on you is to go with the daughter of Gaylan (a fat girl), four folds of fat from the front and eight from the back. So then the Prophet (saw) said: &#8220;Don&#8217;t let this man enter&#8221; Sufyan said and ibn Jareeh said: The name of the Hermaphrodite was Heet. The Hadeeth in Muslim, Dawood, Nisa&#8217;i without the name&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Source: Al-Isaba, Vol 11,  Pg. 262 &#8211; 265, Person # 9070.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS’ confusion gets the best of him again. Heet, as we find in the narration, is either a hermaphrodite or is known in society as being effeminate since his childhood, not a transvestite or one who intentionally imitates women. The Prophet (pbuh) was unaware that this man “understood” women&#8217;s charms, but when he showed sexual urges in his definition and description of Bint Ghaylaan. When this became clear, the Prophet (pbuh) ordered that Heet would be separated away from other women. The narration does not imply that the man was a transvestite, nor was he expelled away from Al-Madinah.<\/p>\n<p style=\"text-align: justify;\">RTS does include quotes that some Mukhannatheen were expelled from Al-Madinah or punished, but those narrations are all weak or disconnected, like the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Al-Waqidi mentioned that he was the servant of Fakhita, the daughter of Amru, the son of &#8216;A&#8217;eth, the son of Imran, the son of Makhzum, and that he and Wahayt were in the houses of the Prophet (saw) and that he said to Aisha, when he had heard that she had asked for a girl to engage for her brother, Abdul-Rahman, the son of Aboo Bakr: &#8220;Take &#8216;fulana&#8217; (&#8216;such a girl&#8217;), for she would accept four and would get along with eight!&#8221; Then the Prophet (saw), and he banished him to Al-Hama, in which he stayed there until the caliphate of Umar.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\">And:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And ibn Wahb narrated in his Jami&#8217; of Al-Harith, the son of Abdul-Rahman, of Abi-Dhi&#8217;ib, of Abi-Salama, the son of Abdul-Rahman, that there were two effeminates at the time of the Messenger of Allah (saw) one named Hayt, and the other Mate&#8217;. Mate&#8217; died and Hayt stayed. Moreover, ibn Wahb said: &#8220;I was told by the one who heard Aba-Ma&#8217;shar saying that the Prophet (saw) ordered for him, then he was hit&#8221;.<\/span><\/p>\n<p style=\"text-align: justify;\">Both narrations are not acceptable since Abu Ma’ashar and Al-Waqidi are second century historians who didn&#8217;t witness the events. Both are also considered to be weak by Hadith scholars.<\/p>\n<p style=\"text-align: justify;\">And:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Annah, the Hermaphrodite: He was mentioned by Al-Barudi, who narrated through Ibraheem bin Muhajir, who narrates of Abu Bakr bin Hafsa, who said: &#8220;Aisha said to a Transexual that was in Medina named Annah: &#8216;Will you not lead us to a woman whom we would engage to Abdul-Rahman bin Abu Bakr?&#8217; He said: &#8216;Yes&#8217;, and he described a woman that would accept four and would get along with eight!&#8221; Then the Messenger of Allah (saw) heard him, and he said: &#8216;O Annah! Get out from Medina to Hamra&#8217; al-Asad, and let your home be there! And do not enter Medina except if there is an &#8216;Eid (day of rejoice) for the people!.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Source: Al-Isaba, Vol 1,  Pg. 269, Person # 288.<\/span><\/p>\n<p style=\"text-align: justify;\">This narration is from Abu Bakr bin Hafs who never heard from A’isha. (Al-Maraseel, p. 257, Mu’asasat Al-Risala, 1418, second edition)<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Imam Tabbrani reported with a  chain from Anbasah bin Saeed from Hammad the servant of Banu Ummayya from Junah and from from Wathilah bin al-Asqaa who said, &#8220;The messenger of Allah cursed the homosexuals and he ordered saying&#8221; get them out of your homes and he the messenger of Allah took Anjasha out of his home and Umar to the same to so and so&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Source: Al-Isaba, Vol 1,  Pg. 239, Person # 261.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS in this quotation manipulated the text and removed the word لين (weak\/soft). The quote in Arabic says:<\/p>\n<p style=\"text-align: center;\"><strong><span style=\"color: #ff0000;\">فأخرج الطبراني بسند لين<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">&#8220;Al-Imam Al-Tabarani reported with a weak chain&#8230;&#8221;<\/p>\n<p style=\"text-align: justify;\">Further evidence that suggests that all these narrations are unreliable is that they all disagree on what the name of the Mukhannath is. One suggests that it is Mati’, the other says that it is ‘Annah, while the narration in the Saheeh refers to him as Heet.<\/p>\n<p style=\"text-align: justify;\">In conclusion, there are no authentic narrations that suggest that the Mukhannath should be expelled from society, in the case that he is asexual to women or in the case that he dresses normally or tries to act normally and does not voluntarily dress like women and act like them. The Mukhannath, in the narration in Saheeh Al-Bukhari was only separated away from the women because he showed sexual interest towards women, and because he described  the sexuality of another woman to a foreign man, and the Prophet (pbuh) forbade that a woman should describe the sexuality of another woman to a man. Moreover, it is absurd for RTS to suggest that Ahl Al-Sunnah should follow the path of hermaphrodites or transvestites; the former because man does not have a hand in his own creation, and the latter because the action of imitating women is condemned by the Prophet (pbuh).<\/p>\n<p style=\"text-align: justify;\">InshaAllah we succeeded in explaining the matter of &#8220;Takhneeth&#8221; for the readers and InshaAllah they benefit from our articles and refutations.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Response to: The Queer Sahaba The following is a response to the article on RevisitingtheSalaf.org entitled: The Queer Sahaba, which was published on the 5th of April, 2012, and can be found here. Short Introduction and ruling of &#8220;Mukhannatheen&#8221;: Mukhannath <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/05\/05\/response-to-the-queer-sahaba\/\" title=\"Response to: The Queer Sahaba\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-320","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/320","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=320"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/320\/revisions"}],"predecessor-version":[{"id":367,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/320\/revisions\/367"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=320"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=320"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=320"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}