{"id":3203,"date":"2016-05-07T17:59:52","date_gmt":"2016-05-07T17:59:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3203"},"modified":"2017-02-16T21:23:58","modified_gmt":"2017-02-16T21:23:58","slug":"response-to-abu-bakr-and-aisha-extreme-abusive-language","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/05\/07\/response-to-abu-bakr-and-aisha-extreme-abusive-language\/","title":{"rendered":"Response to Abu Bakr and Aisha Extreme Abusive Language"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3203\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to Wilayat’s “Abu Bakr &amp; Aisha [Extreme Abusive Language].” The article can be found on the <a href=\"http:\/\/wilayat.net\/index.php?option=com_content&amp;view=article&amp;id=2300:abu-bakr-a-aisha-extreme-abusive-language&amp;catid=176:aisha-bint-abi-bakr&amp;lang=en&amp;Itemid=108\" rel=\"external nofollow\">Wilayat website.<\/a><\/p>\n<p style=\"text-align: justify;\">The article contains several allegations against Sunnism. These include:<\/p>\n<p style=\"text-align: justify;\">&#8211; The Abusive Language of Abu Bakr?<\/p>\n<p style=\"text-align: justify;\">&#8211; The Alteration of Salafis of the Text to Hide this Act?<\/p>\n<p style=\"text-align: justify;\">&#8211; A’isha is Abusive like Abu Bakr?<\/p>\n<p style=\"text-align: justify;\">&#8211; The Permissibility of Abusing Companions?<\/p>\n<p style=\"text-align: justify;\">1- The Abusive Language of Abu Bakr?<\/p>\n<p style=\"text-align: justify;\">The accusation towards Abu Bakr was not given a context by the author of the article, perhaps since the context would weaken the Shi’ee accusation placed against Abu Bakr. The narration, which can be found in <a href=\"http:\/\/sunnah.com\/bukhari\/54\/19\" rel=\"external nofollow\">Saheeh Al-Bukhari<\/a>, includes a disbeliever who told the Prophet – peace be upon him – “O Muhammad! Won&#8217;t you feel any scruple in extirpating your relations? Have you ever heard of anyone amongst the Arabs extirpating his relatives before you? On the other hand, if the reverse should happen, (nobody will aid you, for) by Allah, I do not see (with you) dignified people, but people from various tribes who would run away leaving you alone.” In other words, Urwa was reprimanding the Prophet – peace be upon him – for his actions against Quraish, whilst warning him of the disloyalty of his followers. It was only then when Abu Bakr lost his cool and told Urwa to “suck on Al-Laat’s clitoris.”<\/p>\n<p style=\"text-align: justify;\">It is needless to say that anyone that is familiar with Al-Laat would be aware that it is a statue that was worshiped by the pagan Arabs. More importantly, it did not have a clitoris, but rather, this was a figure of speech.<\/p>\n<p style=\"text-align: justify;\">The narration continues without the Prophet – peace be upon him – reprimanding Abu Bakr for his language.<\/p>\n<p style=\"text-align: justify;\">Of course, it was never the opinion of Ahl Al-Sunnah that Abu Bakr was an infallible. Though, we do not hold the opinion that Abu Bakr was a foul-mouthed person either. Though, how could this occur in light of the narration above?<\/p>\n<p style=\"text-align: justify;\">Due to the moderate nature of Ahl Al-Sunnah, we do not hold the view that one can be referred to as a foul-mouthed person through one incident. Similarly, one is not branded “a liar” through one lie, for the Prophet – peace be upon him – said, “A person will continue to lie under he is recorded as a liar.” (Saheeh Muslim #4721)<\/p>\n<p style=\"text-align: justify;\">With this in mind, as well as the other merits of <a href=\"http:\/\/twelvershia.net\/2015\/01\/27\/book-virtues-hazrat-abu-bakr\/\" rel=\"external nofollow\">Abu Bakr that can be found in various authentic narrations<\/a>, it becomes clear that one should not be labelled as foul-mouthed or immoral from one incident.<\/p>\n<p style=\"text-align: justify;\">2- The Alteration of Salafis of the Text to Hide this Act?<\/p>\n<p style=\"text-align: justify;\">The author, after providing the narration in Arabic, includes an English translation in which the words: “Suck the clitoris of Al-Laat” are translated into a general “abused him” without providing the exact wordings of the abuse.<\/p>\n<p style=\"text-align: justify;\">The author comments: <span style=\"color: #800000;\">“But Salafies must realise that this is the disease of Sahaba Worship and making &#8220;Tehrif&#8221; in their books is the same as Jews and Christians who also made Tehrif in their books earlier too.”<\/span><\/p>\n<p style=\"text-align: justify;\">Indeed, this is an improper translation of the text, and the translator, Muhsin Khan, felt that it was problematic to include this translation in his book. In our humble opinion, this action by Muhsin Khan was incorrect. Instead, he should have translated it as it is.<\/p>\n<p style=\"text-align: justify;\">However, readers should rest assured that this is not a common trait and nobody should be blamed except for the translator. Today, we see Saheeh Al-Bukhari printed in Arabic through many publishers with the correct wording. Moreover, we find that Al-Bukhari himself, and all the narrators in the chain as well, had no issues with providing the exact wording that came from Abu Bakr. In other words, it is unfair for the author to suggest that this is a common occurrence within Sunni and Salafi circles.<\/p>\n<p style=\"text-align: justify;\">3- A’isha is Abusive like Abu Bakr?<\/p>\n<p style=\"text-align: justify;\">The author of the article provides a narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“They then sent Zainab bint Jahsh who went to him and used harsh words saying, &#8220;Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal terms.&#8221; On that she raised her voice and abused &#8216;Aisha to her face so much so that Allah&#8217;s Apostle looked at &#8216;Aisha to see whether she would retort. &#8216;Aisha started replying (Abusing) to Zainab till she silenced her. The Prophet then looked at &#8216;Aisha and said, &#8220;She is really the daughter of Abu Bakr.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">The author of the article comments:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“When we see these 2 Traditions side by side then we understand completely why Rasool (saw) told Aisha that she is really the daughter of Abu Bakr.”<\/span><\/p>\n<p style=\"text-align: justify;\">Indeed, if one were to extract two narrations from the tens of thousands of narrations from hadith compilations, one could draw up links between them. However, we maintain the view that Abu Bakr was not known to be foul-mouthed. If we were to look at the narration with objectivity, we would conclude that the Prophet – peace be upon him – is comparing A’isha with Abu Bakr in her strength in character.<\/p>\n<p style=\"text-align: justify;\">Even though the Shias will perhaps reject this interpretation, we ask them to provide the proof that Abu Bakr was known to be a foul-mouthed person.<\/p>\n<p style=\"text-align: justify;\">In the meantime, they can ask themselves, “Why would the Prophet – peace be upon him – even tolerate such actions or stay married to such a vile woman?”<\/p>\n<p style=\"text-align: justify;\">4- The Permissibility of Abusing Companions?<\/p>\n<p style=\"text-align: justify;\">The author of the article argues the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“But note here Wivers of RAsool (saw) abusing each other. Both of them are Sahabiaat. Are Nasibies not stick to their Standards here and declare both of them to be Kafirs and issue fatwa of their Killing?”<\/span><\/p>\n<p style=\"text-align: justify;\">The author, who is apparently a bachelor, has apparently never tasted the jealousy of women amongst one another. In this scenario, we have an isolated case in which A’isha and Zaynab abused one another.<\/p>\n<p style=\"text-align: justify;\">In another narration in Muslim #4472, we find her saying about Zaynab, “I have never seen a woman better in religion, god-fearing, more truthful, good to her family, charitable, like Zaynab.”<\/p>\n<p style=\"text-align: justify;\">This is very much unlike how Shias act towards the Sahaba, in which their abuse towards the Sahaba is a part of their religion and believe that they are getting closer to Allah by abusing the companions of the Prophet – peace be upon him – and his wives.<\/p>\n<p style=\"text-align: justify;\">&#8230;and no, the TSN Team does not endorse killing Shias or making a blanket <em>takfeer<\/em> against them.<\/p>\n<p style=\"text-align: justify;\">We add, that there are authentic narrations that attribute a similar thing to al-Husayn. We read the following in Tarikh Dimashq, Tarikh ul-Islam and al-Matalib-ul-`Aliyah:<\/p>\n<p style=\"text-align: justify;\">وَقَالَ إِسْحَاقُ: أنا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ عَوْنٍ، عَنْ عُمَيْرِ بْنِ إِسْحَاقَ، قَالَ: كَانَ مَرْوَانُ أَمِيرًا عَلَيْنَا سِنِينَ، فَكَانَ يَسُبُّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ كُلَّ جُمُعَةٍ عَلَى الْمِنْبَرِ، ثُمَّ عُزِلَ مَرْوَانُ، وَاسْتُعْمِلَ سَعِيدُ بْنُ الْعَاصِ سِنِينَ، فَكَانَ لَا يَسُبُّهُ، ثُمَّ عُزِلَ سَعِيدٌ، وَأُعِيدَ مَرْوَانُ، فَكَانَ يَسُبُّهُ، فَقِيلَ لِلْحَسَنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا: أَلَا تَسْمَعُ مَا يَقُولُ مَرْوَانُ؟ فَلَا تَرَدُّ شَيْئًا؟ إلخ<\/p>\n<p>[Ishaq said, Isma`il bin Ibrahim told us, from Ibn `Awn, from `Umayr bin Ishaq, he said: &#8220;Marwan was our governor for two years and he used to insult `Ali may Allah be pleased with him etc&#8230;]<\/p>\n<p>(He continues in a long narration until al-Husayn tells Marwan&#8217;s messenger)<\/p>\n<p>فَقَالَ الْحُسَيْنُ رَضِيَ اللَّهُ عَنْهُ: &#8221; أَكَلْتَ بَظْرَ أُمِّكَ إِنْ لَمْ تُبْلِغْهُ عَنِّي مَا أَقُولُ لَهُ<\/p>\n<p>[&#8230; So al-Husayn told him: &#8220;May you eat your mother&#8217;s clitoris if you do not inform him (Marwan) of what I said&#8221;]<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to Wilayat’s “Abu Bakr &amp; Aisha [Extreme Abusive Language].” The article can be found on the Wilayat website. The article contains several allegations against Sunnism. These include: &#8211; The Abusive Language of Abu Bakr? &#8211; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/05\/07\/response-to-abu-bakr-and-aisha-extreme-abusive-language\/\" title=\"Response to Abu Bakr and Aisha Extreme Abusive Language\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3850,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[17],"class_list":{"0":"post-3203","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-abu-bakr"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3203","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3203"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3203\/revisions"}],"predecessor-version":[{"id":3247,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3203\/revisions\/3247"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3850"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3203"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3203"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3203"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}