{"id":3207,"date":"2016-05-09T18:13:20","date_gmt":"2016-05-09T18:13:20","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3207"},"modified":"2016-05-02T03:37:51","modified_gmt":"2016-05-02T03:37:51","slug":"response-to-who-killed-aisha-a-conspiracy-of-muawiyyah-marwan-responding-to-the-accusation-that-aisha-was-responsible-for-the-death-of-uthman","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/05\/09\/response-to-who-killed-aisha-a-conspiracy-of-muawiyyah-marwan-responding-to-the-accusation-that-aisha-was-responsible-for-the-death-of-uthman\/","title":{"rendered":"Response to Who Killed Aisha? A conspiracy of Muawiyyah &#038; Marwan (Responding to the Accusation that A’isha was Responsible for the Death of Uthman)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3207\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to Wilayat’s “Who Killed Aisha? A conspiracy of Muawiyyah &amp; Marwan”. The article can be found on <a href=\"http:\/\/wilayat.net\/index.php?option=com_content&amp;view=article&amp;id=2271:who-killed-aisha-a-conspiracy-of-muawiyyah-a-marwan&amp;catid=176:aisha-bint-abi-bakr&amp;lang=en&amp;Itemid=108\" rel=\"external nofollow\">the Wilayat website<\/a>.<\/p>\n<p style=\"text-align: justify;\">Our response to this article has been split into two parts for the sake of clarity. In this part of the refutation, we will simply focus on the accusation that A’isha played a role in the martyrdom of Uthman.<\/p>\n<p style=\"text-align: justify;\">The author provided four narrations that suggest that A’isha killed Uthman. We will provide each one with our commentary.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">1- <strong>When the situation became extremely grave, Uthman ordered Marwan Ibn al-Hakam and Abdurahman Ibn Attab Ibn Usayd to try to persuade Aisha to stop campaigning against him. They went to her while she was preparing to leave for pilgrimage, and they told her: &#8220;We pray that you stay in Medina, and that Allah may save this man (Uthman ) through you.&#8221; Aisha said: &#8220;I have prepared my means of transportation and vowed to perform the pilgrimage. By God, I shall not honor your request&#8230; I wish he (Uthman ) was in one of my sacks so that I could carry him. I would then throw him into the sea.&#8221; <\/strong><\/span><br \/>\n<a href=\"http:\/\/www.answering-ansar.org\/answers\/who_really_killed_uthman\/ansab_al_ashraf_v6_p192_193.jpg\" data-mce-=\"data-mce-\" rel=\"external nofollow\"> Ansab al-Ashraf, Volume 6 pages 192-193<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Upon returning to the above mentioned source, we found that the narration is weak since the source is quoting Abu Mikhnaf, the infamous liar, and does not provide a chain for the narration. In other words, it suffers from an unreliable narrator and a disconnected narration.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">2- In Tabaqat al Kubra, Volume 3 page 82 we read the testimony of famous Tabayee namely Masrooq which has also been quoted by the Abu Sulaiman and has declared the tradition as authentic:<\/span><\/p>\n<p><span style=\"color: #800000;\"> <strong>&#8220;Musrooq said to Aisha, Uthman died because of you, you wrote to people and incited them against him&#8221;.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Response:<\/p>\n<p style=\"text-align: justify;\">The deceptive author did not include the narration in full, but rather, only quoted the middle of the narration in order to strengthen his view. This is the narration in Arabic:<\/p>\n<p style=\"text-align: right;\">قال: أخبرنا أبو معاوية الضرير قال: أخبرنا الأعمش عن خيثمة عن مسروق عن عائشة قالت: حين قتل عثمان: تركتموه كالثوب النقي من الدنس ثم قربتموه تذبحوه كما يذبح الكبش، هلا كان هذا قبل هذا؟ فقال لها مسروق: هذا عملك، أنت كتبت إلى الناس تأمرهم بالخروج إليه، قال فقالت عائشة: لا والذي آمن به المؤمنون وكفر به الكافرون ما كتبت إليهم بسوداء في بيضاء حتى جلست مجلسي هذا. قال الأعمش: فكانوا يرون أنه كتب على لسانها.<\/p>\n<p style=\"text-align: justify;\">A’isha criticizes the killers and then is met by Masrooq’s accusations. She then said, “By He who is believed in by the believers and is rejected by the disbelievers, I did not write anything to them up until this very moment.”<\/p>\n<p style=\"text-align: justify;\">Al-A’amash commented, “They believe that it was (a forgery) written in her name.”<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">3- Also in Iqd al Fareed, Volume 2 page 93 we read that:<strong>&#8220;Mugheera bin Shuba approached Aisha and she said to him, &#8216;In Jamal some of the arrows that were fired, nearly pierced my skin.&#8217; Mugheera replied &#8216;If only an arrow had killed you, that would have acted as penance for the fact that you had incited the people to kill Uthman &#8220;.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Once again, the author does not include the refutation by A’isha in order to strengthen his argument. We shall quote the narration in full then translate her response:<\/p>\n<p style=\"text-align: right;\">قال لها المغيرة: وددتُ والله أن بَعضها كان قتلك. قالت: يرحمك الله، ولم تقول هذا؟ قال: لعلَها تكون كَفّارة في سَعْيك على عُثمان. قالت: أما والله لئن قلتَ ذلك لما عَلم الله أني أردتُ قتله، ولكن علم اللّه أني أردتُ أن يُقاتَل فقوتلتُ، وأردتً أن يُرمى فرُميت، وأردت أن يعصى فعُصيت، ولو علم مني أني أردتُ قتلَه لقُتلت.<\/p>\n<p style=\"text-align: justify;\">She replied: “By Allah, you say such, but Allah knows that I did not wish to kill him, but He knows that I wanted him to be fought, and therefore, I was fought, and I wanted him to be hurled upon, and I was hurled upon, and I wanted him to be disobeyed, and I was disobeyed, <u>and if He knew that I wanted him dead, then I would have been dead<\/u>.”<\/p>\n<p style=\"text-align: justify;\">It should also be known that the narration is weak and the author does not provide a chain for the narration.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">4- <strong>Ibn Jarir Tabari &#8211; Ziyaad bin Ayub &#8211; Muassab bin Sulaiman al-Tamimi &#8211; Muhammad &#8211; Asim bin Kulayb &#8211; his father:<\/strong><\/span><br \/>\n<span style=\"color: #800000;\"> <strong>During the time of Uthman bin Affan, I had a dream. I saw a man who was ruling the people while he was ill in bed, <u>and a woman was by his head. The people were after him and hastened toward him and had she forbidden them, they would have stopped. But she did not<\/u>, so they seized and killed him. I used to recount this dream of mine to everyone, whether settled or nomad, and they were surprised and did not know what it meant. <\/strong><\/span><br \/>\n<span style=\"color: #800000;\"> <strong>Then when Uthman was killed the news reached us as we were returning from a raid, and my companions said: ‘You dream Kulayb!’. When we got to Basrah, and we had not been there long when someone said: ‘Talha and al-Zubayr are coming and the Mother of the Faithful is with them’. This alarmed the people and they were surprised, but they were claiming to the people that they had only come out of anger over Uthman and in penance over the way they had not supported him. The Mother of the Faithful spoke up: <u>&#8220;We became angry at Uthman on your behalf because of three things he did: giving command to youths, expropriating common property and beating (people) with whips and sticks<\/u>&#8220;.<\/strong><\/span><br \/>\n<span style=\"color: #800000;\">  History of Tabari, English Edition, volume 16, pages 99-100<\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Once again, the deceptive author does not quote the rest of the narration:<\/p>\n<p style=\"text-align: right;\">وإن أم المؤمنين تقول غضبنا لكم على عثمان في ثلاث إمارة الفتى وموقع الغمامة وضربة السوط والعصا فما أنصفنا إن لم نغضب له عليكم في ثلاث جررتموها إليه حرمة الشهر والبلد والدم<\/p>\n<p style=\"text-align: justify;\">The Mother of the Believers said, “We were angered for your sake for three matters: His appointment of the youth, the Al-Ghamama area, and the beatings with the whips and sticks, and we would be unfair if we were not angered by you for three actions that you have caused: The sanctity of the forbidden month, the forbidden land, <strong><u>and the forbidden blood<\/u><\/strong>.”<\/p>\n<p style=\"text-align: justify;\">We comment: In other words, A’isha was against the killing of Uthman.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">5- In ‘al Imama wal Siyasa’ page 60 we read that: <\/span><\/p>\n<p><span style=\"color: #800000;\"> <strong>&#8220;Someone asked Muhammad bin Talha who killed Uthman ? He replied that &#8220;one third of his death was attributable to Aisha and one third was due to my father Talha&#8221;<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">The deceitful author once again left out the end of the narration. We quote it and provide the correct translation:<\/p>\n<p style=\"text-align: right;\">أقبل غلام من جهينة إلى محمد بن طلحة، فقال له: حدثني عن قتلة عثمان، قال: نعم، دم عثمان على ثلاثة أثلاث، ثلث على صاحبة الهودج، وثلث على صاحب الجمل الأحمر، وثلث على علي بن أبي طالب .<\/p>\n<p style=\"text-align: justify;\">“A young man from Juhaina (tribe) came to Mohammad bin Talha and said, ‘Tell me about the killers of Uthman.’ He said, ‘Yes, the blood of Uthman is split into thirds, a third by who is in canopy (A’isha), a third by the one on the red camel (Talha), and a third by Ali bin Abi Talib.”<\/p>\n<p style=\"text-align: justify;\">The narration is weak and does not contain a chain. Plus, the author of the book Al-Imamah wal Siyasa, which is attributed to Ibn Qutaiba, is differed upon, with many academics rejecting the attribution of the book to him. Refer to Al-Awasim min Al-Qawasim (p. 167) by Ibn Al-Arabi where in which he casts doubt on this book. The editor, Muhib Al-Deen Al-Khateeb adds that Ibn Qutaiba never went to Egypt, while the book was written by someone that has been to Egypt.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">In conclusion, we find it very clear that there is no tangible evidence that A’isha was responsible for the death of Uthman, but rather, it is<em> <\/em>well-established that A’isha played a role in avenging Uthman. Refer to the history of the Minor Battle of the Camel for more on this topic.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to Wilayat’s “Who Killed Aisha? A conspiracy of Muawiyyah &amp; Marwan”. The article can be found on the Wilayat website. Our response to this article has been split into two parts for the sake of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/05\/09\/response-to-who-killed-aisha-a-conspiracy-of-muawiyyah-marwan-responding-to-the-accusation-that-aisha-was-responsible-for-the-death-of-uthman\/\" title=\"Response to Who Killed Aisha? A conspiracy of Muawiyyah &#038; Marwan (Responding to the Accusation that A’isha was Responsible for the Death of Uthman)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-3207","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3207","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3207"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3207\/revisions"}],"predecessor-version":[{"id":3208,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3207\/revisions\/3208"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3207"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3207"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3207"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}