{"id":3234,"date":"2016-05-28T20:05:56","date_gmt":"2016-05-28T20:05:56","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3234"},"modified":"2016-05-03T16:52:05","modified_gmt":"2016-05-03T16:52:05","slug":"response-to-ayesha-and-her-narrations-an-analysis","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/05\/28\/response-to-ayesha-and-her-narrations-an-analysis\/","title":{"rendered":"Response to: Ayesha and her Narrations: an Analysis"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3234\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to SlaveOfAhlubait’s “ayesha and her narrations: an analysis”. The article can be found on <a href=\"https:\/\/ahlubait.wordpress.com\/2011\/12\/23\/ayesha-and-her-narrations-an-analysis\/\" rel=\"external nofollow\">his blog<\/a> and on the <a href=\"http:\/\/wilayat.net\/index.php?option=com_content&amp;view=article&amp;id=2277:ayesha-and-her-narrations-an-analysis&amp;catid=176:aisha-bint-abi-bakr&amp;lang=en&amp;Itemid=108\" rel=\"external nofollow\">Wilayat website<\/a>.<\/p>\n<p style=\"text-align: justify;\">This article, by SlaveOfAhlubait, collects “contradictions” in the narrations of A’isha, in order to suggest that she was a lousy hadith narrator, and thus, we should reject her hadiths altogether.<\/p>\n<p style=\"text-align: justify;\">SlaveOfAhlubait provides three examples of these so-called “contradictions”:<\/p>\n<p style=\"text-align: justify;\">-INCIDENT OF JEW LADY AND PUNISHMENT IN GRAVE<\/p>\n<p style=\"text-align: justify;\">-PRAYER OF CHASHT (dhuhaa)<\/p>\n<p style=\"text-align: justify;\">&#8211; SHOULD LIZARDS BE KILLED OR NOT?<\/p>\n<p style=\"text-align: justify;\">We shall respond to each of these allegations with the necessary evidences.<\/p>\n<h2 style=\"text-align: justify;\">1- INCIDENT OF JEW LADY AND PUNISHMENT IN GRAVE<\/h2>\n<p style=\"text-align: justify;\">SlaveOfAhlubait spends a good deal of time providing narrations in which the Prophet – peace be upon him – is asked about the punishment of the grave. His answer differs in the hadiths, even though the primary narrator of the hadith is A’isha, who has narrated the hadith to several student: Jasra, Sa’eed, Urwa, Thakwan, and Masrooq. We would like to add that Amra is also one of the narrators of this hadith, but SlaveOfAhlubait forgot to include her narration. Some of the narrations suggest that the Prophet – peace be upon him – was not aware of the punishment of the grave when he was first asked about it, while other narrations suggest that he was aware.<\/p>\n<p style=\"text-align: justify;\">SlaveOfAhlubait argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“As per the narrations of jasra (narration 1) and masrooq (narration 7 &amp; 8), he was aware of it at that time. Rather if we see the narration of zakwan (narration 6), we find that holy prophet asws gave even further details for that. But on the other hand, when we see narrations of saeed (narration 2) and arwa (narration 3,4,5) he was not aware of it.”<\/span><\/p>\n<p style=\"text-align: justify;\">There is no reason to suggest that these are contradictions by A’isha when all of these narrations can be reconciled. Ibn Hajar explains in Fath Al-Bari: “What the Prophet – peace be upon him – rejected was that the punishment of the grave would occur to those upon monotheism, then, the Prophet – peace be upon him – was made aware that it could occur to whomever Allah wills, and thus, he affirmed it and warned of it.”<\/p>\n<p style=\"text-align: justify;\">In other words, when the Prophet – peace be upon him – affirms the existence of the punishment of the grave, he was merely affirming it for non-Muslims. As for the negation, then it is in regards to Muslims, and in the same hadith he comes to learn through revelation that it occurs upon Muslims as well.<\/p>\n<p style=\"text-align: justify;\">In any case, A’isha could have been expressing the story in more than one manner, though, as we can see, this can be reconciled, and does not lead to a contradiction.<\/p>\n<p style=\"text-align: justify;\">Similarly, we find verses in the Qur’an that seem to contradict one another, like the duration of the creation of the earth, or the question of what is man created from: water, dust, clay, nothing, a blood clot, etc. Of course, this is not the time or place to reconcile these verses, and these allegations so-called &#8220;contradictions&#8221; in the Qur’an have been answered on various Islamic websites online. Though, we bring this to the attention to readers to become aware that the lack of reflection upon verses and hadiths can lead to one assuming the existence of contradictions when there aren’t any.<\/p>\n<h2 style=\"text-align: justify;\">2- PRAYER OF CHASHT (dhuhaa)<\/h2>\n<p style=\"text-align: justify;\">SlaveOfAhlubait provides narrations from the students of A’isha. He argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“If we actually see narrations of Ayesha in this regard, we see that there is not just confusion, rather contradictions in regards to whether holy prophet asws offered them or not, whether he offered it 2 rakat or he offered 4 or he offered 4 &amp; increased it. Different narrations are telling us different facts.”<\/span><\/p>\n<p style=\"text-align: justify;\">This issue is easily reconcilable. The biggest contradiction in these narrations is that Urwa goes against all the other students of A’isha (Abdullah bin Shaqeeq, Mua’atha, Um Tharra) by saying that the Prophet – peace be upon him – never prayed the Dhuha prayers.<\/p>\n<p style=\"text-align: justify;\">There are a number of ways to reconcile this:<\/p>\n<p style=\"text-align: justify;\">1- To reject the narration of Urwa, since he is in the minority. Therefore, he would be accused of being the mistaken one in the narration and not A’isha.<\/p>\n<p style=\"text-align: justify;\">2- The likelier possibility is explained by returning to the narration of Urwa in other books. We find that in Muwatta Malik #324, Saheeh Al-Bukhari #1106, and Saheeh Muslim #1174, that Urwa narrates from A’isha, “I never <strong><u>saw<\/u> <\/strong>the Prophet – peace be upon him – pray the Dhuha prayers.”<\/p>\n<p style=\"text-align: justify;\">3- Another interpretation is that A’isha rejected that the Prophet – peace be upon him – prayed them regularly, and this is supported by the narration of Abdullah bin Shaqeeq when she says, “No (he doesn’t pray it), unless he comes back from travels.”<\/p>\n<p style=\"text-align: justify;\">We prefer the second interpretation. If Shias argue that the narration of Um Tharra states that the Prophet – peace be upon him – prayed Dhuha in the house of A’isha then we say that the narration is much weaker than the narration of Urwa, and that it cannot be the preferred narration.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\">3- SHOULD LIZARDS BE KILLED OR NOT?<\/h2>\n<p style=\"text-align: justify;\">SlaveOfAhlubait argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“So we see 3 narrations, authenticity is proven, in which Ayesha told us that there was no such order from holy prophet asws for killing lizards<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">And<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">On the other hand, we see her own action contradicted that, rather she killed them since she heard hadeeth of prophet asws<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Again we see the same issue and this means that either it was Ayesha who was forgetting and narrating in different forms or that it was narrators who were even changing the meanings, rather making them contradictory<\/strong>”<\/span><\/p>\n<p style=\"text-align: justify;\">The narration that states that A’isha was ordered to kill lizards by the Prophet – peace be upon him – is weak. This is because it comes through the path of Sa’iba the Mawlat of Al-Fakih bin Al-Mugheera, and there is no evidence of her reliability. This is supported by the narration provided by SlaveOfAhlubait himself in Musnad Ahmad 11\/149. The only narration that states that Nafi’ heard this narration from A’isha is on 11\/447, but it contains an anonymous narrator by the name of Abdullah bin Abdulrahman bin Abi Umayyah.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<br \/>\n<\/strong><\/h2>\n<p style=\"text-align: justify;\">As we can see from the above, the author of the article could not provide binding proof that A’isha was unreliable in hadith. We find the author clutching at straws by arguing that A’isha contradicted herself in the amount of prostrations that the Prophet – peace be upon him – performed in a non-obligatory prayer. Even if we held the opinion that she contradicted herself here, is that sufficient evidence to reject her narrations? The view of Ahl Al-Sunnah is that the companions were fallible in actions and their memory. However, there is no proof that any companions accused A’isha of being unreliable in teaching the <em>sunnah<\/em> of the Prophet – peace be upon him &#8211; . Even <strong>if<\/strong> one held the view that she made a few mistakes, as the author of the article argues, that does not even amount to a single percent of the amount of narrations that she narrated. It is with this in mind that we conclude that the very intention of weakening A’isha through providing a few so-called “contradictions” is ludicrous.<\/p>\n<p style=\"text-align: justify;\">&#8230;and praise be to Allah the Most Gracious and Most Merciful.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to SlaveOfAhlubait’s “ayesha and her narrations: an analysis”. The article can be found on his blog and on the Wilayat website. This article, by SlaveOfAhlubait, collects “contradictions” in the narrations of A’isha, in order to <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/05\/28\/response-to-ayesha-and-her-narrations-an-analysis\/\" title=\"Response to: Ayesha and her Narrations: an Analysis\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[21],"class_list":{"0":"post-3234","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-aisha"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3234","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3234"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3234\/revisions"}],"predecessor-version":[{"id":3237,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3234\/revisions\/3237"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3234"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3234"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3234"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}