{"id":3250,"date":"2016-06-02T20:07:27","date_gmt":"2016-06-02T20:07:27","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3250"},"modified":"2019-03-09T17:52:56","modified_gmt":"2019-03-09T17:52:56","slug":"adalat-al-sahaba","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/06\/02\/adalat-al-sahaba\/","title":{"rendered":"Trustworthiness of the Sahabah as Hadith Transmitters (Adalah Al-Sahabah)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3250\" alt=\"\" \/>The integrity (&#8216;<em>Adalah)<\/em> of the Sahabah often is a focal point of Sunni-Shia polemics. For centuries, Shi&#8217;ite polemicists (and others) have strawmanned and misconstrued the concept by claiming that it is a baseless dogmatic and theological byproduct of Sunni polemics. Unfortunately, many Sunnis similarly seem to to misunderstand the nature of &#8216;<em>Adalah<\/em>, it&#8217;s basis and its implications. Thus, we have decided to outline the concept and contextualize it for the reader to correct any potential misunderstandings.<\/p>\n<p>Since the &#8216;<em>Adalah <\/em>of the Sahabah is directly intertwined with the Sahabah themselves, it is important that we first define what a Sahabi is:<\/p>\n<p><strong><span style=\"font-size: 18pt;\">What is a Sahabi?<\/span><\/strong><\/p>\n<p>The standard definition of a Sahabi, as stated by Ibn Hajar, is:<\/p>\n<blockquote><p>One who met the Prophet believing in him and subsequently died in a state of Islam. (Ibn Hajar 1:8).<\/p><\/blockquote>\n<p>This definition is not exclusive to Ibn Hajar. Rather, Bukhari mentioned a similar description in his <em>Sahih<\/em>. He said:<\/p>\n<blockquote><p>Whoever accompanied the Prophet or saw him from the Muslims, then he is from his companions. (Bukhari 2:5)<\/p><\/blockquote>\n<p>Similar definitions are cited by Ahmed b. Hanbal, &#8216;Ali b. Al-Madini and other notable hadith critics and theologians. The nature of this companionship is further elaborated on by the<\/p>\n<p>4th century Ash&#8217;ari theologian, Al-Baqillani. He said:<\/p>\n<blockquote><p>There is no disagreement among the linguists that the term Sahabi is derived from general companionship, and not derived from a more specific form of companionship. Thus, it would apply to anyone who accompanied anyone else for a short or long period of time. (Al-Baghdadi 51)<\/p><\/blockquote>\n<p>Al-Baqillani then said:<\/p>\n<blockquote><p>Similarly, it could be said: &#8220;I accompanied someone for an interval, a period of time, a year, a month, a day خق an hour&#8221;. Thus, the concept of &#8220;Sahabah&#8221; applies to instances of little and significant companionship.  Linguistically, this would entail that anyone who accompanied the Prophet for even a single hour is called a companion of the Prophet. (Al-Baghdadi 51)<\/p><\/blockquote>\n<p>We will further expound on this matter later in this paper when discussing the implications of &#8216;Adalah. Nevertheless, this shall suffice as a brief outline to the definition of a &#8220;Sahabi.&#8221;<\/p>\n<p><strong><span style=\"font-size: 18pt;\">What is <em>&#8216;Adalah<\/em>?<\/span><\/strong><\/p>\n<p>When historical reports are transmitted through intermediaries, their contents are often prone to corruption. This corruption in their content primarily stems from two phenomena: (1) malicious tampering with the reports and (2) unintentional errors in the transmission of those reports. The early hadith critics thus made the acceptance of historical reports contingent upon several criteria that ensured the integrity of the reports&#8217; transmission.<\/p>\n<p>&#8216;<em>Adalah<\/em> was hence deemed a necessary condition for the acceptance of a transmitter&#8217;s reports. The purpose of &#8216;Adalah was to ensure that transmitters did not maliciously tamper with reports or fabricate their own traditions. Perhaps the earliest figure to outline the necessary qualities of a reliable transmitter was Imam Al-Shafi&#8217;i (d. 204). In his treatise, <em>Al-Risalah<\/em>, he said:<\/p>\n<blockquote><p>From those qualities is that he is trusted in his faith, truthful in his speech, conscious of what he transmits etc. (Al-Shafi&#8217;i 1:369)<\/p><\/blockquote>\n<p>The ultimate purpose of this criterion, as stated, was to ensure that transmitters possessed enough consciousness of God that would deter them from forging and tampering with reports. It does not entail that the transmitters are infallible or incapable of committing major and minor sins, hence why Al-Shafi&#8217;i, on another occasion, said:<\/p>\n<blockquote><p>We do not know of anyone who was granted observance of God&#8217;s commands except that he had mixed it with some sin. (Ibn Abi Hatem 1:232)<\/p><\/blockquote>\n<p>Thus, demonstrating that a transmitter, at one point in his life, may have committed a major sin does not necessarily negate the quality of <em>&#8216;Adalah <\/em>from him. It does not necessarily entail that he is more inclined to tamper with reports as a transmitter. What must be noted, in this context, is that the concept of <em>&#8216;Adalah <\/em>is not related to a transmitter&#8217;s political and\/or theological leanings, hence why various Shi&#8217;ite, Khariji, and Qadari (etc.) transmitters were deemed <em>&#8216;Udul <\/em>(reliable).<\/p>\n<p>Another noteworthy point is the issue of misinterpretation. Some Sahabis may have erred judgement and participated in conflicts as a result of a misinterpretation of texts or a misunderstanding. Such individuals are not analogous to open <em>fussaq <\/em>who choose to sin knowing that their actions are abominable. Rather, one who commits a mistake genuinely believing that he was doing the correct thing is not a <em>fasiq<\/em>, rather he is excused. This, however, does not entail that his actions were correct or beyond criticism.<\/p>\n<p>Some polemicists will often cite later definitions of &#8216;<em>Adalah<\/em>, which were influenced by texts of Usul Al-Fiqh, which have nothing to do with the concept of <em>Adalah <\/em> as per the transmission of hadith. The concept of &#8216;<em>Adalah <\/em>according to the scholars of Usul had an entirely different context and served an entirely different purpose.<\/p>\n<p>These notes will prove to be important when discussing the issue of &#8216;<em>Adalah<\/em> Al-Sahabah, which is regularly misconstrued by our Shi&#8217;ite counterparts.<\/p>\n<h2><span style=\"font-size: 18pt;\">Why Are the Sahaba &#8216;<em>Udul<\/em>?<\/span><\/h2>\n<p>Sunni scholarship has concluded that the quality of &#8216;<em>Adalah<\/em> indeed collectively spans the majority of the Sahabah.<\/p>\n<p>What are the implications of that?<\/p>\n<p>Nothing, asides from the fact that the companions of the Prophet were reliable transmitters of hadith. It does not entail that they never committed major sins, nor does it entail that they were not prone to error . This claim, before anything else, is a historical claim. The Sunni hadith critics evaluated the transmission of the Sahabah and observed them to be collectively truthful transmitters of hadith. Ibn Taymiyyah thus described this phenomenon saying:<\/p>\n<blockquote><p>The companions of the Prophet are among the most truthful people in their speech. No one among them is known to have purposely lied upon the Prophet, even though some of them used to err and commit sins, and they were not infallible. With that being said, the critics have evaluated and tested their transmission, and they observed it in light of how hadiths usually are evaluated. Not a single one of them was found to have purposely lied, unlike the second generation, which spanned a group of people from Kufah who used to lie. (Ibn Taymiyyah 2:457)<\/p><\/blockquote>\n<p>It is indeed ironic that Shi&#8217;ite polemicists who, for example, accuse Abu Hurayrah of fabricating reports cannot reproduce a single authentic example of one of Abu Hurayrah&#8217;s alleged fabrications. This <a href=\"http:\/\/www.twelvershia.net\/2019\/03\/05\/abu-hurayrah-the-mirage-of-lies\/\">article<\/a> is a great example of this phenomenon, where Shi&#8217;ite polemicists are exposed grasping at straws in a desperate attempt to vilify Abu Hurayrah.<\/p>\n<p>The Sahabah&#8217;s truthfulness can be exhibited through other means as well. Al-Khatib Al-Baghdadi, in Al-Kifaya, argued that the &#8216;<em>A<\/em><em>dalah<\/em> of the Sahaba was evident through means other than the Qur’an and Sunnah. He argued that their &#8216;<em>A<\/em><em>dalah<\/em> was demonstrated in their migration, <em>jihad<\/em> with their limbs, which led them to wage war with their own families, the spending of their wealth for the sake of the the religion, and their efforts in spreading the religion are all clear evidences for their &#8216;<em>A<\/em><em>dala. <\/em>(Al-Baghdadi 48)<\/p>\n<p>Indeed, these are powerful indicators for their truthfulness with regards to matter of this religion. If someone had enough commitment to the cause such that he was willing to abandon his own home, fight his own tribe, spend his own wealth, and put his life at risk, then indeed this would indicate that this individual&#8217;s commitment was genuine.<\/p>\n<p>Allah, in various instances in the Quran, praised the companions of the Prophet. He described the <em>Muhajireen<\/em> saying:<\/p>\n<blockquote><p><em>“For the poor emigrants who were expelled from their homes and properties, seeking bounty from Allah and [His] approval and supporting (the cause of) Allah and His Messenger, [there is also a share]. Those are the truthful.” <\/em>[Quran 59:8]<\/p><\/blockquote>\n<p>He then addressed the Ansar saying:<\/p>\n<blockquote><p><em>“And [also for] those who were settled in the Home [i.e. al-Madinah] and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what they [i.e. the emigrants] were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul – it is those who will be the successful.” <\/em>[Quran 59:8]<\/p><\/blockquote>\n<p>Shi&#8217;ite polemicists  may attempt to argue that these verses do not refer to all of the companions; rather, they reverse to the <em>Muhajirin <\/em>and the <em>Ansar<\/em>. In, reality, this appeal is entirely irrelevant, as most of the major companions and transmitters of hadith fall under the categories mentioned in the verses. Thus, excluding the rest of the Sahabah from the praise mentioned in these verses has almost no effect on the Sunni hadith corpus.<\/p>\n<p>These verses, however, are not the only evidences cited to argue for the <em>&#8216;Adalah <\/em>of the Sahabah. Rather, the argument is based on a cumulative case which spans various verses, texts and historical indicators. These verses, at the end of the day, all revolve around the same point mentioned earlier: an individual&#8217;s willingness to sacrifice his own life and wealth in contribution to the cause is indicative of his genuine commitment to that cause. Allah thus openly stated that he was pleased with them, and Allah is never pleased and contented with individuals who He knew were condemned to Hell.<\/p>\n<h2>&#8216;<em>Adalah<\/em> of the Sahabah in Twelver Shi&#8217;ism<\/h2>\n<p>What is ironic is that the concept of &#8216;<em>Adalah<\/em>, which was intended to be a historical concept regarding the transmission of hadith, was reduced to a rigid dogmatic polemical tool in the Twelver sect.  Shi&#8217;ite theology simply argued that companions who sided with &#8216;Ali b. Abi Taleb were reliable, and transmitters who did not were unreliable. This preposterous reduction of <em>&#8216;Adalah <\/em>to an arbitrary theological tool demonstrates the frailty of the opposing narrative. A man&#8217;s relationship to &#8216;Ali with respect to his later conflicts has no implications on his status of a transmitter.<\/p>\n<p>In this context, Shi&#8217;ite polemicists often cite inauthentic reports, such as &#8220;No one loves you except a believer&#8221; and &#8220;Whoever curses &#8216;Ali has cursed me&#8221;; these texts, however are not authentic. Even if these reports were authentic, they would not entail what Shi&#8217;ite polemics attempt to argue, since most of the companions refrained from participating in the later conflicts between &#8216;Ali and his opponents (as demonstrated in this <a href=\"http:\/\/www.twelvershia.net\/2018\/09\/10\/did-the-sahabah-all-fight-each-other\/\">article)<\/a><span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.twelvershia.net\/2018\/09\/10\/did-the-sahabah-all-fight-each-other\/\">.<\/a><\/span><\/p>\n<p>In his booklet on the Sahabah, Shi&#8217;te Ayatollah Al-Milani’s stated that the Sahaba who were to be respected were the ones who passed away during his life. However, those that lived after the Prophet fell into two categories: (1) Those that followed his will, <em>sunnah <\/em> and orders. They are to be respected. Al-Milani, of course, is referring to those that supported Ali. (2) The second group consists of those those that went against the alleged Prophetic will, and they should not be respected according to Al-Milani. (Al-Milani 8-9)<\/p>\n<p>Al-Milani makes no attempt to outline his view regarding to those that we simply do not have enough information about to judge as to whether they pledged their allegiance to Ali or not.<\/p>\n<p>Shia Ayatollah Al-Sanad is even clearer in his book, Adalat Al-Sahaba. In his book, he said:<\/p>\n<blockquote><p>“Those that upheld the order (to love Ahlulbayt) from amongst the Sahaba are of <em>A<\/em><em>dala<\/em>, and those that left this order, who have disregarded this covenant, are those that are out of the fold of <em>Adalah<\/em>.” (Al-Sanad 212)<\/p><\/blockquote>\n<p>These appeals all embody circular reasoning, since the Shi&#8217;ite is already presuming the validity of the notion of <em>Imamah <\/em>prior to his evaluation of the Sahabah. In other words, the Shi&#8217;ite is approaching a historical matter with theological presuppositions which influence his judgement of past historical figures. He then proceeds to anachronistically project his theological sentiments onto individuals who lived 1400+ years ago, assuming his later theological narrative is an authority in this context.<\/p>\n<p>Such an appeal is problematic for several reasons, as stated. A man&#8217;s stance regarding &#8216;Ali&#8217;s later conflicts has no historical implications on his reliability as a transmitter of hadith. It does not make him any more\/less likely to forge reports. Thus, it is ironic how Shi&#8217;ites misconstrue the Sunni narrative as a baseless dogmatic theological notion, while their very own narrative is grounded in theology and dogma.<\/p>\n<h2>Shi&#8217;ite Misconceptions on &#8216;<em style=\"font-weight: bold;\">Adalah <\/em>Al-Sahabah<\/h2>\n<p>Shi&#8217;ite polemicists usually cite three main objections to the notion of <em>&#8216;Adalah <\/em>Al-Sahabah, which indicate their incomprehension of the concept:<\/p>\n<ul>\n<li>The apostasy of certain companions<\/li>\n<li>The existence of hypocrites during the Prophet&#8217;s life<\/li>\n<li>The presence of companions who were <em>fasiq<\/em><\/li>\n<\/ul>\n<p>The first point regarding the apostasy of certain previous companions of the Prophet is entirely irrelevant to the discussion at hand, for we have demonstrated in our definition of &#8220;Sahabah&#8221; that such individuals are excluded from the category of &#8220;<em>Sahabah<\/em>.&#8221; Not a single Sunni believes that the apostates who died as disbelievers were companions of the Prophet, let alone reliable transmitters.<\/p>\n<p>The appeal to the presence of hypocrites during the Prophetic era does not negate the notion of <em>&#8216;Adalah <\/em>Al-Sahabah. Rather, this appeal merely is an <em>ad hoc<\/em> that can actually go both ways, as hypocrites have existed since the Prophetic era till this day. One can thus argue that any later transmitter who was endorsed by Shi&#8217;ite or Sunni authorities may have been a hypocrite. Alas, such appeals are a failed venture. The correct methodology to espouse in this regard is to evaluate each transmitter in this regard: Is there sufficient evidence for one to believe that he was a hypocrite? Or was he not a hypocrite?<\/p>\n<p>If no evidence exists to substantiate the claim that a Sahabi was a hypocrite, then the default is that he is a reliable transmitter. Nevertheless, the vast majority of the Sahabah, as demonstrated earlier were not hypocrites. The renowned historian, Ibn Ishaq, for example, comprehensively listed the names of many hypocrites at the time. He also provided evidences from the Quran and historical reports to argue for their hypocrisy (Ibn Hisham 1:519-527). Such individuals would not be considered reliable. What is ironic, however, is that none of these individuals actually transmitted hadith, so the entire appeal made by Shi&#8217;ites is irrelevant.<\/p>\n<p>Finally, there is no doubt of the existence of both major and minor sins amongst the companions. As stated in the previous sections, merely committing a major\/minor sin does not entail that a transmitter is untrustworthy. Rather, as stated by Al-Shafi&#8217;i, there is not a single human who has not mixed observance with sin. Thus, this appeal actually is irrelevant to the concept of <em>&#8216;Adalah <\/em>in light of the definitions mentioned in this article. The Shi&#8217;ites must actually provide textual and\/or historical indicators which indicate that a transmitter is unreliable in his transmission. If they cannot, then they have demonstrated that their entire narrative is nothing but a polemical conspiracy theory.<\/p>\n<p>What is ironic is that the few examples the Shi&#8217;ites can present only further demonstrate the concept of <em>&#8216;Adalah<\/em> Al-Sahabah, since these are &#8220;exceptions that prove the rule.&#8221; The fact that Shi&#8217;ite polemicist can only cite a handful of names, such as Busr b. Arta&#8217;ah (whose companionship is contested) and Abu Al-Ghadiyah Al-Juhani, out of tens of thousands of companions merely demonstrates the general rule that the majority of the Sahabah were not like such individuals. What is further ironic is that these companions barely transmit any hadiths, making them totally irrelevant to the discussion at hand.<\/p>\n<p>This discussion, in reality, is mostly relevant with regards to the prolific transmitters of Prophetic traditions among the Sahabah:<\/p>\n<ul>\n<li>Abu Hurayrah<\/li>\n<li>&#8216;Abdullah b. &#8216;Umar<\/li>\n<li>&#8216;Abdullah b. &#8216;Amr<\/li>\n<li>Anas b. Malek<\/li>\n<li>&#8216;A&#8217;isha b. Abi Bakr<\/li>\n<li>&#8216;Abdullah b. Abbas<\/li>\n<li>Jabir b. &#8216;Abdillah<\/li>\n<li>Abu Sa&#8217;id Al-Khudri<\/li>\n<\/ul>\n<p>Other prolific transmitters, such as &#8216;Abdullah b. Mas&#8217;ud, played a significant role in the transmission of hadith as well. The majority of the Sunni hadith corpus is based on transmission from the aforementioned individuals, who are known as <em>Al-Mukthirin<\/em>. Excluding Sahabis, such as Mu&#8217;awiyah, from the circle of &#8216;Adalah will have almost no implications on the hadith corpus (even though we would, in principle, object to such an exclusion.)<\/p>\n<h2><strong>Conclusion<\/strong><\/h2>\n<p>The Companions of the Prophet – peace be upon him – are evidently reliable according to various textual\/historical indicators, texts from the Qur’an &amp; the Sunnah and the the consensus of specialists. The reliability of the companions is not an arbitrary theological axiom, as insinuated by ignorant skeptics. Rather, it is inferred from various textual indicators, and it cannot be based on a person&#8217;s role in &#8216;Ali&#8217;s later conflicts in history, as claimed by the Shias.<\/p>\n<p>It is ironic that Shi&#8217;ite polemicists often attempt to attack the Sunni notion of &#8216;<em>Adalah<\/em> Al-Sahabah, which is primarily historical, yet their alternative rule is to judge the reliability of transmitters based on their role in &#8216;Ali b. Abi Taleb&#8217;s later conflicts. Such a preposterous suggestion renders the concept arbitrary and useless, as it reduces it to a dogmatic Twelver polemical tool.<\/p>\n<p>Either way, the (hypothetical) existence of exceptions does not nullify the general rule, as Shia scholars have ironically admitted when it came to their own <em>rijali <\/em>rulings, as demonstrated in this article.<\/p>\n<blockquote><p>And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct &#8211; Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment. [Quran 9:100]<\/p><\/blockquote>\n<p>And Allah is the best of witnesses.<\/p>\n<h2 style=\"text-align: center;\"><span style=\"text-decoration: underline;\"><strong>Sources<\/strong><\/span><\/h2>\n<p>Al-Baghdadi, Ahmed b. ‘Ali. <em>Al-Kifayah fi ‘Ilm Al-Riwayah<\/em>. Edited by Abu Abdullah Al-Surqi and Ibrahim Al-Madani, Al-Maktabah Al-‘Ilmiyyah.<\/p>\n<p>Al-Bukhari, Muhammad b. Isma’il. <em>Sahih Al-Bukhari<\/em>. Edited by Muhammad Al-Nasser, 1st ed., Dar Tawq Al-Najah, 1422.<\/p>\n<p>Al-Milani, Ali. <em>Al-Sahabah<\/em>. 1st ed., Markaz Al-Abhath Al-Aqadiyyah, 1421.<\/p>\n<p>Al-Sanad, Muhammad. <em>&#8216;Adalat Al-Sahabah<\/em>. 1st ed., 2004.<\/p>\n<p>Ibn Abi Hatem, &#8216;Abdurrahman. <em>Adab Al-Shafi&#8217;i wa Manaqibih<\/em>. Edited by Abdulghani Abdulkhaleq, 1st ed., Dar Al-Kutub Al-&#8216;Ilmiyyah, 2003.<\/p>\n<p>Ibn Hajar, Ahmed. <em>Al-Isabah fi Tamyiz Al-Sahabah<\/em>. Edited by Adel Abdulmawjud and Muhammad Awadh, 1st ed., Dar Al-Kutub Al-&#8216;Ilmiyyah, 1415.<\/p>\n<p>Ibn Hisham, &#8216;Abdulmalik. <em>Al-Seerah Al-Nabawiyyah<\/em>. Edited by Mustafa Al-Saqqa et al., 2nd ed., Maktabat wa Matba&#8217;at Mustafa Al-Babi Al-Halabi, 1955.<\/p>\n<p>Ibn Taymiyyah, Ahmed. <em>Minhaj Al-Sunnah fi Naqd Kalam Al-Shia wal-Qadariyyah<\/em>. Edited by Muhammad Rashad Salem, 1st ed., Imam Saud University, 1986.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The integrity (&#8216;Adalah) of the Sahabah often is a focal point of Sunni-Shia polemics. For centuries, Shi&#8217;ite polemicists (and others) have strawmanned and misconstrued the concept by claiming that it is a baseless dogmatic and theological byproduct of Sunni polemics. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/06\/02\/adalat-al-sahaba\/\" title=\"Trustworthiness of the Sahabah as Hadith Transmitters (Adalah Al-Sahabah)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-3250","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3250","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3250"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3250\/revisions"}],"predecessor-version":[{"id":3253,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3250\/revisions\/3253"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3250"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3250"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3250"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}