{"id":3269,"date":"2016-06-11T08:43:23","date_gmt":"2016-06-11T08:43:23","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3269"},"modified":"2017-02-14T13:05:18","modified_gmt":"2017-02-14T13:05:18","slug":"muhammad-baqir-al-majlisi-tahreef","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/06\/11\/muhammad-baqir-al-majlisi-tahreef\/","title":{"rendered":"Muhammad Baqir al-Majlisi &#038; Tahreef"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3269\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Muhammad Baqir al-Majlisi (d.1111 AH) also known as al-`Allamah is the father of modern day Shiasm, he was the top and most influential scholar in the Safavid empire and the author of the biggest Shia Hadith encyclopedia &#8220;Bihar-ul-Anwar al-Jami`li Durar Akhbar al-A&#8217;immah al-Athar&#8221;.<\/p>\n<p style=\"text-align: justify;\">Shia would like to argue that the man does not believe in Tahrif or the corruption of the Qur&#8217;an. They believe he is innocent of this. In order to support their view, the average Shia laymen will bring forth the following quote, half a sentence from the man&#8217;s book and claim it to be the ultimate truth in this regard.<\/p>\n<p style=\"text-align: justify;\">Concerning the following verse {It is we who have revealed the remembrance and we are the Guardians} We find in Bihar-ul-Anwar 9\/113 this interpretation:<\/p>\n<p style=\"text-align: justify;\">إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ أي القرآن وَ إِنَّا لَهُ لَحافِظُونَ عن الزيادة و النقصان و التغيير و التحريف و قيل نحفظه من كيد المشركين فلا يمكنهم إبطاله و لا يندرس و لا ينسى و قيل المعنى و إنا لمحمد حافظون‏<\/p>\n<p style=\"text-align: justify;\">[{It is we who have revealed the remembrance} Meaning the Qur&#8217;an. {And we are the Guardians} Meaning guarding it from additions, deletions, alterations and corruption. It was also said: Guarding it from the schemes of the polytheists who won&#8217;t be able to destroy it or cause it to be lost and forgotten. It was also said {We are the Guardians} Meaning to Guard Muhammad.]<\/p>\n<p style=\"text-align: justify;\">At a first glance you think it is odd, since al-Majlisi writes in his books things such as the following from Hayat-ul-Qulub (translated from Persian) 2\/541 onward:<\/p>\n<p style=\"text-align: justify;\">إن علي بن أبي طالب وليي، ووصيي، وخليفتي من بعدي، ولكن أصحابه عملوا عمل قوم موسى، فاتبعوا عجل هذه الأمة وسامريها أعني أبا بكر وعمر فغصب المنافقون خلافته، خلافة رسول الله، وتجاوزوا إلى خليفة الله أي الكتاب الذي أنزله فحرفوه، وغيروه، وعملوا به ما أرادوه<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) announced at Ghadir that:<\/p>\n<p style=\"text-align: justify;\">[&#8220;`Ali bin abi Talib is my beloved friend, executor of my will and my successor after me.&#8221; (&#8230;until he says&#8230;) However, his Companions committed the acts of Musa&#8217;s (as) folks and followed the calf  and Samaritan of this nation -He means Abu Bakr and `Umar- and so the hypocrites usurped his right to succession, the succession to the Messenger of Allah (saw). They exceeded this to Allah&#8217;s successor -Meaning the revealed Book- so they corrupted it, altered it and did with it what they please.]<\/p>\n<p style=\"text-align: justify;\">As for the English version translated online by (Sayyid Athar Husayn S.H. Rizvi), the readers can also find this in volume 2 under the title &#8220;The Prophet informs that a great mischief has entered Medina at night&#8221;:<\/p>\n<p style=\"text-align: justify;\">[After doing this to one Caliph of God, then the other Caliph, which was the book of God they mutilated and changed and made it into what they pleased. (&#8230;until he said&#8230;) The love of Abu Bakr had deep roots in their hearts just as in the hearts of Bani Israel were devoted to the calf and Samiri]<\/p>\n<p style=\"text-align: justify;\">And if the reader was to refer to volume 3 of that same book, he would see plenty of narrations quoted by al-Majlisi claiming that verses were revealed in a very different way than the way we have them now. For instance he will quote a Qur&#8217;anic verse:<\/p>\n<p style=\"text-align: justify;\">{And say: The truth is from your Lord, so let him who please believe, and let him who please disbelieve} [18:29]<\/p>\n<p style=\"text-align: justify;\">Then he wrote under it:<\/p>\n<p style=\"text-align: justify;\">[Ibn Mahyar has related from Imam Sadiq (as) that this verse was revealed in this way: &#8220;And say: the truth is from your Lord <span style=\"color: #ff0000;\">about the Wilayah(authority) of Ali bin Abi Talib<\/span>, so let him who please believe, and let him who please disbelieve&#8221;]<\/p>\n<p style=\"text-align: justify;\">These types of texts clearly imply that he doesn&#8217;t think the Qur&#8217;an is free from corruption, so how can we reconcile between this and the above statement?<\/p>\n<p style=\"text-align: justify;\">Well for those familiar with Shia beliefs the reconciliation is quite easy. Fact is that the above interpretation does not mean in any way that al-Majlisi believes in the protection of our Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">Reason being, is that many Shia hold the belief that Allah is guarding the Qur&#8217;an even though they&#8217;re still believing in Tahrif! How you ask?<\/p>\n<p style=\"text-align: justify;\">Well they hold the belief that the complete and legitimate Qur&#8217;an was collected by Ali whereas the Companions collected an inferior version which they played with and corrupted.The Companions refused Ali&#8217;s correct collection so `Ali handed it to his children to guard it and never showed it to anyone. Today, they believe that the complete and correct Qur&#8217;an is still in the possession of their hidden leader (12th Imam). In this way they believe that YES Allah is in fact guarding the correct Qur&#8217;an from harm and corruption by keeping it safe with His representative the hidden Imam.<\/p>\n<p style=\"text-align: justify;\">For example, in Bihar al-Anwar 99\/126 al-Majlisi quotes the narration of their Imam `Ali al-Hadi who is teaching his companion a supplication. In this supplication the 12 Imams are mentioned and glorified. They&#8217;re described as many things such as:<\/p>\n<p style=\"text-align: justify;\">وَ حَمَلَةِ كِتَابِ اللَّهِ وَ أَوْصِيَاءِ نَبِيِّ اللَّهِ وَ ذُرِّيَّةِ رَسُولِ اللَّه‏<\/p>\n<p style=\"text-align: justify;\">[(They) are the carriers of Allah&#8217;s Book, the legatees of Allah&#8217;s prophet, the progeny of the Messenger of Allah etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi comments in Bihar al-Awar 99\/136:<\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">و حملة كتاب الله أي عندهم تمام الكتاب على ما نزل من غير نقص و تغيير و معناه و تأويله و بطونه و ذرية رسول الله‏<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">[The &#8220;Carriers of Allah&#8217;s Book&#8221; (i.e. Imams) Meaning those who have the complete Qur&#8217;an, as it was revealed, without any loss, addition or change. They know its explanation, its interpretation and its hidden meanings.]<\/span><\/p>\n<p style=\"text-align: justify;\">As you can see dear reader, the ones who have the complete unchanged Qur&#8217;an are the 12 Shia Imams, that&#8217;s how they believe it&#8217;s preserved unlike the one in our hands today.<\/p>\n<p style=\"text-align: justify;\">This is not the end of it though, we all know that al-Majlisi&#8217;s Bihar encyclopedia is so big -110 volumes in total- that it contains many other books inside it. Yes, al-Majlisi in his Bihar quotes entire other books and treatise by earlier Shia scholars.<\/p>\n<p style=\"text-align: justify;\">For an un-informed reader, you&#8217;d think that the above interpretation is by al-Majlisi himself. Truth however is that the above words are not his own, the interpretation of the verses are copied and summarized by him from the book of al-Fadl bin al-Hasan al-Tabrasi (d.548 AH).<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi writes the above interpretations in a section he called &#8220;تفسير الآيات&#8221; meaning &#8220;Interpreting the verses&#8221;. This is a large section but it isn&#8217;t his own words rather those of abu `Ali al-Fadl al-Tabrasi. It is sufficient to go a couple of pages back to the beginning of the section on interpretation and read.<\/p>\n<p style=\"text-align: justify;\">Bihar al-Anwar 9\/64:<\/p>\n<p style=\"text-align: justify;\">تفسير قال الطبرسي رحمه الله في قوله تعالى‏<\/p>\n<p style=\"text-align: justify;\">[Tafsir: Al-Tabrasi may Allah have mercy on him said regarding The Most High&#8217;s words etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Then to confirm, we open the book Majma`-ul-Bayan fi Tafsir al-Qur&#8217;an by al-Fadl al-Tabrasi, on the chapter of Surat-ul-Hijr, verse 9, we read:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">فقال { إنا نحن نزلنا الذكر } أي القرآن { وإنا له لحافظون } عن الزيادة والنقصان والتحريف والتغيير <span style=\"color: #333333;\">عن قتادة<\/span><\/span> وابن عباس ومثله لا يأتيه الباطل من بين يديه ولا من خلفه وقيل معناه متكفل بحفظه إلى آخر الدهر على ما هو عليه فتنقله الأمة وتحفظه عصراً بعد عصر إلى يوم القيامة لقيام الحجة به على الجماعة من كل من لزمته دعوة النبي صلى الله عليه وسلم عن الحسن <span style=\"color: #ff0000;\">وقيل يحفظه من كيد المشركين ولا يمكنهم إبطاله ولا يندرس ولا ينسى<\/span> عن الجبائي وقال الفراء يجوز أن يكون الهاء في له كناية عن النبي صلى الله عليه وسلم فكأنه قال <span style=\"color: #ff0000;\"><span style=\"color: #333333;\">إنا نزلنا القرآن<\/span> وإنا لمحمد صلى الله عليه وسلم لحافظون<\/span><\/p>\n<p style=\"text-align: justify;\">As you can see, the parts in red are word for word and letter for letter what al-Majlisi quoted from al-Fadl al-Tabrasi. All al-Majlisi did was remove the unnecessary filling content such as the names of folks who held these opinions (Ibn `Abbas, Qatadah, Jaba&#8217;i, Farra&#8217;) as well as  references to other verses for the sake of brevity.<\/p>\n<p style=\"text-align: justify;\">It is therefore inaccurate to attribute the above to al-Majlisi and consider it his opinion since he&#8217;s simply quoting the words of an early Shia Mufassir without commenting on it. Furthermore, the Shia Mufassir himself (i.e. al-Fadl al-Tabrasi) is quoting Sunni &amp; Mu`tazili opinions and narrations so it isn&#8217;t even the Shia interpretation.<\/p>\n<p style=\"text-align: justify;\">That&#8217;s as far as the deceptive Shia defense and below I will share with you more facts so that by the end of this piece you will be convinced without the shadow of a doubt that the man openly believes in Tahrif and you will see the truth of what we say.<\/p>\n<p style=\"text-align: justify;\">First of all, if I was a scholar who did not believe in the corruption of the Qur&#8217;an, would I include entire chapters in my books that speak of how the Qur&#8217;an was corrupted and changed?<\/p>\n<p style=\"text-align: justify;\">In volume 89 of his Bihar encyclopedia, al-Majlisi writes about many topics pertaining to the Qur&#8217;an. He includes several chapters about Tahrif and cites many evidences to show the strength of this belief in Shia creed.<\/p>\n<p style=\"text-align: justify;\">He begins in al-Bihar 89\/40:<\/p>\n<p style=\"text-align: justify;\">باب ما جاء في كيفية جمع القرآن و ما يدل على تغييره‏<\/p>\n<p style=\"text-align: justify;\">[Chapter: What&#8217;s mentioned regarding the collection of the Qur&#8217;an and the proof that it was distorted.]<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi literally fills this chapter with texts proving the Qur&#8217;an was corrupted from page 40 until page 66.<\/p>\n<p style=\"text-align: justify;\">All the while making comments like these, such as in al-Bihar 89\/48:<\/p>\n<p style=\"text-align: justify;\">أقول: قد وردت أخبار كثيرة في كثير من الآيات أنها نزلت على خلاف القراءات المشهورة كآية الكرسي و قوله وَ كَذَلِكَ جَعَلْنَاهُمْ أَئِمَّةً وَسَطاً و غيرهما<\/p>\n<p style=\"text-align: justify;\">[I say: Many narrations have reached us regarding many verses, that the way they were revealed was different than the popular recitations. Such as Ayat-ul-Kursi and Allah&#8217;s words: &#8220;Thus we have made you moderate Imams&#8221; as well as others.]<\/p>\n<p style=\"text-align: justify;\">I need not remind you that the real verse reads like this.<\/p>\n<p style=\"text-align: justify;\">{Thus We made you a moderate community} [2:143]<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s quote an example from the type of reports in these pages as well as al-Majlisi&#8217;s commentary on it. We read in al-Bihar 89\/60:<\/p>\n<p style=\"text-align: justify;\">عَنِ ابْنِ نُبَاتَةَ قَالَ: سَمِعْتُ عَلِيّاً ع يَقُولُ كَأَنِّي بِالْعَجَمِ فَسَاطِيطُهُمْ فِي مَسْجِدِ الْكُوفَةِ يُعَلِّمُونَ النَّاسَ الْقُرْآنَ كَمَا أُنْزِلَ قُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ أَ وَ لَيْسَ هُوَ كَمَا أُنْزِلَ فَقَالَ لَا مُحِيَ مِنْهُ سَبْعُونَ مِنْ قُرَيْشٍ- بِأَسْمَائِهِمْ وَ أَسْمَاءِ آبَائِهِمْ وَ مَا تُرِكَ أَبُو لَهَبٍ إِلَّا لِلْإِزْرَاءِ عَلَى رَسُولِ اللَّهِ ص- لِأَنَّهُ عَمُّهُ<br \/>\nأقول: سيأتي في تفسير النعماني ما يدل على التغيير و التحريف‏<\/p>\n<p style=\"text-align: justify;\">[(&#8230;) from Ibn Nabatah, he said: I heard `Ali (as) say: &#8220;It is as if I can see (in the future) the foreigners setting up their tents near the mosque of Kufah, teaching people the Qur&#8217;an as it was (correctly) revealed.&#8221; I said: &#8220;O chief of believers, is the Qur&#8217;an (today) not as Allah revealed it?&#8221; He replied: &#8220;No, the names of seventy individuals from Quraysh and the names of their fathers were erased from it. They had only left the name of abu Lahab to mock the Messenger (saw) since he was his uncle.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Now let&#8217;s read al-Majlisi&#8217;s commentary, will he defend the Qur&#8217;an since he doesn&#8217;t believe in Tahrif as they claim? He writes:<\/p>\n<p style=\"text-align: justify;\">[I say: In Tafsri al-Nu`mani shall come what proves the distortion and corruption.]<\/p>\n<p style=\"text-align: justify;\">MashaAllah, it seems he wishes to give us more evidences of the corruption and distortion. In fact, on the same page he starts copying the full treatise by the Persian Shia scholar Sa`d al-Ash`ari al-Qummi as reported by their narrator Ibn Qawlawayh. This treatise offers an entire long list of verses that were distorted and what they were actually supposed to be before corruption.<\/p>\n<p style=\"text-align: justify;\">He writes:<\/p>\n<p style=\"text-align: justify;\">جَعْفَرُ بْنُ مُحَمَّدِ بْنِ قُولَوَيْهِ عَنْ سَعْدٍ الْأَشْعَرِيِّ الْقُمِّيِّ أَبِي الْقَاسِمِ رَحِمَهُ اللَّهُ وَ هُوَ مُصَنِّفُهُ رَوَى مَشَايِخُنَا عَنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ عَلَيْهِ السَّلَامُ وَ سَاقَ الْحَدِيثَ إِلَى أَنْ قَالَ بَابُ التَّحْرِيفِ فِي الْآيَاتِ الَّتِي هِيَ خِلَافُ مَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ مِمَّا رَوَاهُ مَشَايِخُنَا رَحْمَةُ اللَّهِ عَلَيْهِمْ عَنِ الْعُلَمَاءِ مِنْ آلِ مُحَمَّدٍ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ عَلَيْهِم‏<\/p>\n<p style=\"text-align: justify;\">[Ja`far bin Muhammad bin Qawlawayh, from Sad al-Ashari al-Qummi abi al-Qasim may Allah have mercy on him who is the author, he says: Our teachers narrated from our companions, from abi `Abdillah (as) that he said: The chief of believers (as) said: And he mentions the report until he reaches: &#8220;Chapter: On the corruption of verses that are different from what Allah had revealed as narrated by our teachers may Allah&#8217;s mercy be upon them, from the scholars of the family of Muhammad (as).&#8221;]<\/p>\n<p style=\"text-align: justify;\">Then he begins the treatise with the following:<\/p>\n<p style=\"text-align: justify;\">ْ قَوْلُهُ جَلَّ وَ عَزَّ كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِالْمَعْرُوفِ وَ تَنْهَوْنَ عَنِ الْمُنْكَرِ وَ تُؤْمِنُونَ بِاللَّهِ فَقَالَ أَبُو عَبْدِ اللَّهِ ع لِقَارِئِ هَذِهِ الْآيَةِ وَيْحَكَ خَيْرُ أُمَّةٍ يَقْتُلُونَ ابْنَ رَسُولِ اللَّهِ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ آلِهِ فَقَالَ جُعِلْتُ فِدَاكَ فَكَيْفَ هِيَ فَقَالَ أَنْزَلَ اللَّهُ كُنْتُمْ خَيْرَ أَئِمَّةٍ أَ مَا تَرَى إِلَى مَدْحِ اللَّهِ لَهُمْ فِي قَوْلِهِ تَأْمُرُونَ بِالْمَعْرُوفِ وَ تَنْهَوْنَ عَنِ الْمُنْكَرِ وَ تُؤْمِنُونَ بِاللَّهِ فَمَدْحُهُ لَهُمْ دَلِيلٌ عَلَى أَنَّهُ لَمْ يَعْنِ الْأُمَّةَ بِأَسْرِهَا أَ لَا تَعْلَمُ أَنَّ فِي الْأُمَّةِ الزُّنَاةَ وَ اللَّاطَةَ وَ السُّرَّاقَ وَ قُطَّاعَ الطَّرِيقِ وَ الظَّالِمِينَ وَ الْفَاسِقِينَ أَ فَتَرَى أَنَّ اللَّهَ مَدَحَ هَؤُلَاءِ وَ سَمَّاهُمُ الْآمِرِينَ بِالْمَعْرُوفِ وَ النَّاهِينَ عَنِ الْمُنْكَرِ كَلَّا مَا مَدَحَ اللَّهُ هَؤُلَاءِ وَ لَا سَمَّاهُمْ أَخْيَاراً بَلْ هُمُ الْأَشْرَار<\/p>\n<p style=\"text-align: justify;\">[Allah&#8217;s words {You are the best nation that hath been raised up for mankind. Ye enjoin right conduct and forbid indecency; and ye believe in Allah} [3:110] So aba `Abdillah (as) told the reciter: &#8220;Woe to you! The best nation kill the son of the Messenger (saw)!?&#8221; He said: &#8220;May I be your sacrifice! How do I recite it then?&#8221; He (as) answered: &#8220;You are the best Imams that hath been raised for mankind.&#8221; He (as) continued: &#8220;Do you not see Allah&#8217;s praise for them here {Ye enjoin right conduct and forbid indecency; and ye believe in Allah} This praise means He never intended the entire nation. Do you not know that this nation includes adulterers, sodomites, thieves, bandits, oppressors and wicked folks? Do you think Allah would praise them and describe them as (etc&#8230;)]<\/p>\n<p style=\"text-align: justify;\">And he continues with a long list of so called corrupt verses for six pages until he begins a new chapter.<\/p>\n<p style=\"text-align: justify;\">Majlisi writes in al-Bihar 89\/66:<\/p>\n<p style=\"text-align: justify;\">باب تأليف القرآن و أنه على غير ما أنزل الله عز و جل‏<\/p>\n<p style=\"text-align: justify;\">[Chapter: The compilation of the Qur&#8217;an and how it differs from what Allah revealed.]<\/p>\n<p style=\"text-align: justify;\">He writes right under this title:<\/p>\n<p style=\"text-align: justify;\">فمن الدلالة عليه في باب الناسخ و المنسوخ منه الآية في عدة النساء في المتوفى عنها زوجها و قد ذكرنا ذلك في باب الناسخ و المنسوخ و احتجنا إلى‏ إعادة ذكره في هذا الباب ليستدل على أن التأليف على خلاف ما أنزل الله جل و عز<\/p>\n<p style=\"text-align: justify;\">[The evidence for this is found in a previous chapter on &#8220;the abrogation and the abrogated&#8221;, such as the verse related to the waiting period a woman must observe after the death of her husband. We only wish to repeat it in this chapter so that we can prove that the compilation (of this Qur&#8217;an) is different from what Allah most glorious revealed.]<\/p>\n<p style=\"text-align: justify;\">Then al-Majlisi begins citing quite a few examples of how the verses were jumbled up and how our Qur&#8217;an contains verses in incorrect positions that make no sense. We mention a part of what he says as a sample:<\/p>\n<p style=\"text-align: justify;\">فهذه الآية مع قصة إبراهيم صلى الله عليه متصلة بها فقد أخرت و هذا دليل على أن التأليف على غير ما أنزل الله جل و عز في كل وقت للأمور التي كانت تحدث فينزل الله فيها القرآن و قد قدموا و أخروا لقلة معرفتهم بالتأليف و قلة علمهم بالتنزيل على ما أنزله الله و إنما ألفوه بآرائهم و ربما كتبوا الحرف و الآية في غير موضعها الذي يجب قلة معرفة به و لو أخذوه من معدنه الذي أنزل فيه و من أهله الذي نزل عليهم لما اختلف التأليف و لوقف الناس على عامة ما احتاجوا إليه من الناسخ و المنسوخ و المحكم و المتشابه و الخاص و العام<\/p>\n<p style=\"text-align: justify;\">[(&#8230;) This verse and the story of Ibrahim (as) are supposed to be connected but it was pushed back and this proves that the compilation is not in accordance with what Allah revealed every time an event took place requiring a verse to descend. They (i.e Sahabah) have advanced some verses (to certain locations) and pushed others back (to other locations) due to their lack of knowledge in both the compilation and the revelation as Allah intended. They (i.e Sahabah) only compiled it based on their own opinions in a way that they&#8217;d write a word or a verse in an incorrect location due to their lack of knowledge. If they had taken it from its rightful source (i.e Ahlul-Bayt) whom it originally was revealed for, and from its rightful people (i.e Ahlul-Bayt) whom it descended on, then the compilation wouldn&#8217;t have differed so much and the people would have been able to acquire what they needed from verses that are abrogated, abrogating, explicit, vague, specific and general.]<\/p>\n<p style=\"text-align: justify;\">This dear reader is because physical Tahrif is mainly of three kinds:<\/p>\n<p style=\"text-align: justify;\">A- Addition (Ziyadah): To believe that compilers inserted into the Qur&#8217;an words that were not revealed by Allah.<\/p>\n<p style=\"text-align: justify;\">B- Deletion (Nuqsan): To believe that compilers removed verses from the Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">C- Order (Tartib): To believe that compilers corrupted the order of the words and the verses in the Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">All three types above are equal in harm and all three distort the original message and prevent people from learning the correct religion as Allah intended for it. So far al-Majlisi has confirmed two from the above.<\/p>\n<p style=\"text-align: justify;\">In order to show you how devastating the third type of Tahrif is and how to distorts the message and corrupts the religious teachings, we will quote al-Majlisi&#8217;s own words about a verse that he believes was removed from its proper context and maliciously inserted into another verse to confuse the people.<\/p>\n<p style=\"text-align: justify;\">In volume 35, al-Majlisi mentions the verse of purification as evidence for the infallibility of the household. Then he quotes the argument of Ahlul-Sunnah that the verse cannot possibly be talking about the five people of the cloak (Ahlul-Kisa&#8217;) since it is located as part of a verse that is addressing the mothers of believers.<\/p>\n<p style=\"text-align: justify;\">The full verse is:<\/p>\n<p style=\"text-align: justify;\">{Remain in your houses; and display not your finery, as did the pagans of old. And perform the prayer, and pay the alms, and obey God and His Messenger. People of the House, God only desires to put away from you abomination and to cleanse you.} [33:33]<\/p>\n<p style=\"text-align: justify;\">In Bihar al-Anwar 35\/234:<\/p>\n<p style=\"text-align: justify;\">بما ستقف عليه في كتاب القرآن مما سننقل من روايات الفريقين أن ترتيب القرآن الذي بيننا ليس من فعل المعصوم حتى لا يتطرق إليه الغلط<\/p>\n<p style=\"text-align: justify;\">The first thing al-Majlisi does is refer the readers to the chapter we were previously talking about in volume 89 to prove that the order of words and verses is incorrect.<\/p>\n<p style=\"text-align: justify;\">[You will see in &#8220;Kitab-ul-Qur&#8217;an&#8221; (i.e volume 89) the reports we copied from both teams (i.e Sunnah &amp; Shia) proving that the order of compilation of the Qur&#8217;an in our hands is not the work of the infallible so that errors may not creep into it.]<\/p>\n<p style=\"text-align: justify;\">In other words, errors did creep into it and thus our Qur&#8217;an has errors since the compilers were the Companions not the infallible `Ali.<\/p>\n<p style=\"text-align: justify;\">Now let&#8217;s see how al-Majlisi will refute Ahlul-Sunnah and what his first argument is going to be.<\/p>\n<p style=\"text-align: justify;\">On the same page we read:<\/p>\n<p style=\"text-align: justify;\">فلعل آية التطهير أيضا وضعوها في موضع زعموا أنها تناسبه أو أدخلوها في سياق مخاطبة الزوجات لبعض مصالحهم الدنيوية و قد ظهر من الأخبار عدم ارتباطها بقصتهن فالاعتماد في هذا الباب على النظم و الترتيب ظاهر البطلان‏<\/p>\n<p style=\"text-align: justify;\">[It&#8217;s possible that they also placed the verse of purification in a location which they claimed is suitable. They inserted it into the verse addressing the wives for worldly benefits although it&#8217;s been proven from the narrations that it&#8217;s unrelated to their (i.e wives) story and so relying on the order of compilation in this regard is clearly faulty.]<\/p>\n<p style=\"text-align: justify;\">So here&#8217;s Majlisi&#8217;s first argument, that the Companions shoved one verse in the middle of another verse for worldly benefits.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s see his second argument in al-Bihar 35\/235:<\/p>\n<p style=\"text-align: justify;\">و لو سلم عدم التغيير في الترتيب فنقول سيأتي أخبار مستفيضة بأنه سقط من القرآن آيات كثيرة فلعله سقط مما قبل الآية و ما بعدها آيات لو ثبتت لم يفت الربط الظاهري بينها و قد وقع في سورة الأحزاب بعينها ما يشبه هذا فإن الله سبحانه بعد ما خاطب الزوجات بآيات مصدرة بقوله تعالى يا نساء النبي إِنْ كُنْتُنَّ تُرِدْنَ الْحَياةَ الدُّنْيا الآية عدل إلى مخاطبة المؤمنين بما لا تعلق له بالزوجات بآيات كثيرة ثم عاد إلى الأمر بمخاطبتهن و عيرهن بقوله سبحانه يا أَيُّهَا النَّبِيُّ قُلْ لِأَزْواجِكَ وَ بَناتِكَ وَ نِساءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ و قد عرفت اعتراف الخصم فيما رووا أنه كان قد سقط منها آية فألحقت فلا يستبعد أن يكون الساقط أكثر من آية و لم يلحق غيرها<\/p>\n<p style=\"text-align: justify;\">[If we agree for the sake of argument that there was no alteration in the order of verses. You will soon see plentiful narrations stating that many verses were dropped from the Qur&#8217;an. Therefore, it&#8217;s possible that the verses preceding it were dropped as well as what came after it but had they been included then the apparent meaning would be suitable. In fact, the chapter of Surat-ul-Ahzab had something similar happen to it, for Allah addressed the wives with verses starting with {O women of the prophet: If you desire the present life and its adornment} then He switched to address the believers in a way that&#8217;s unrelated to the wives in many verses. Then He returned to address them with an order {O Prophet, say to thy wives and daughters and the believing women, that they draw their veils close to them} And you know that the opponents (i.e Sunnies) have admitted in their narrations that a verse was lost from this chapter then it was later inserted, so it isn&#8217;t unlikely that more than one verse were dropped]<\/p>\n<p style=\"text-align: justify;\">First of all he made a mistake, there&#8217;s no verse that says &#8220;O women of the prophet: If you desire the present life and its adornment&#8221; the man seems to have mixed two verses.<\/p>\n<p style=\"text-align: justify;\">Secondly, his second argument is worse than his first one. He&#8217;s saying if we agree for the sake of argument that Qur&#8217;anic words and verses are properly organized, then we all know that there&#8217;re missing verses that were not included by the Companions.<\/p>\n<p style=\"text-align: justify;\">To further clarify and strengthen his argument, he quotes this Shia narration right under the above paragraph:<\/p>\n<p style=\"text-align: justify;\">وَ رَوَى الصَّدُوقُ فِي كِتَابِ ثَوَابِ الْأَعْمَالِ بِإِسْنَادِهِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ع سُورَةُ الْأَحْزَابِ فِيهَا فَضَائِحُ الرِّجَالِ وَ النِّسَاءِ مِنْ قُرَيْشٍ وَ غَيْرِهِمْ يَا ابْنَ سِنَانٍ إِنَّ سُورَةَ الْأَحْزَابِ فَضَحَتْ نِسَاءَ قُرَيْشٍ مِنَ الْعَرَبِ وَ كَانَتْ أَطْوَلَ مِنْ سُورَةِ الْبَقَرَةِ وَ لَكِنْ نَقَصُوهَا وَ حَرَّفُوهَا<\/p>\n<p style=\"text-align: justify;\">[Al-Saduq reported in the book &#8220;Thawab-ul-Amal&#8221; from the path of `Abdullah bin Sinan, from abu `Abdullah (as): O ibn Sinan, Surat-ul-Ahzab contained the scandals of the men and women of Quraysh as well as others. Surat-ul-Ahzab exposed the women of Quraysh from the Arabs and was longer than Surat-ul-Baqarah but they removed from it and corrupted it]<\/p>\n<p style=\"text-align: justify;\">I ask the Shia, do these arguments sound like arguments coming from a man who doesn&#8217;t believe in Tahrif? When you debate Ahlul-Sunnah do you people also use arguments like these?<\/p>\n<p style=\"text-align: justify;\">Now that things have been clarified for unbiased reader, we will go even further to quote some of the commentaries of al-Majlisi on various Shia narrations that declare the Qur&#8217;an to be corrupted.<\/p>\n<p style=\"text-align: justify;\">In Maladh-ul-Akhiyar 1\/259, al-Majlisi comments on a narration in Tahdhib-ul-Akhbar by al-Tusi:<\/p>\n<p style=\"text-align: justify;\">َ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ع عَنْ قَوْلِهِ تَعَالَى- فَاغْسِلُوا وُجُوهَكُمْ وَ أَيْدِيَكُمْ إِلَى الْمَرافِقِ فَقَالَ لَيْسَ هَكَذَا تَنْزِيلُهَا إِنَّمَا هِيَ فَاغْسِلُوا وُجُوهَكُمْ وَ أَيْدِيَكُمْ مِنَ الْمَرافِقِ ثُمَّ أَمَرَّ يَدَهُ مِنْ مِرْفَقِهِ إِلَى أَصَابِعِه‏<\/p>\n<p style=\"text-align: justify;\">The narration says [I asked aba `Abdillah (as) about Allah&#8217;s words {Wash your faces and hands <span style=\"color: #ff0000;\">until<\/span> the elbows} [5:6] He (as) replied: This isn&#8217;t how it was revealed, it is {Wash your faces and hands <span style=\"color: #ff0000;\">from<\/span> the elbows.} Then he (as) passed his hand from his elbow until his fingers.]<\/p>\n<p style=\"text-align: justify;\">It is no secret that the Imam here is saying the Qur&#8217;an is incorrect. Al-Majlisi writes below:<\/p>\n<p style=\"text-align: justify;\">و قال الفاضل البهائي رحمه الله: لعل المراد من التنزيل التأويل، كما يقال: ينبغي تنزيل الحديث على كذا، و إلا فهي متواترة فكيف يمكن نفيها. انتهى. و يرد عليه: أنه إن أردتم تواترها إلى القراء أو تواتر ما اشترك بينها إلى من جمع القرآن فمسلم، و أما تواترها عن النبي صلى الله عليه و آله فغير مسلم. و قد دلت الأخبار المتواترة بالمعنى على النقص و التغيير في الجملة، لكن لا يمكن الجزم في خصوص موضع، و أمرنا بقراءته و العمل به على ما ضبطه القراء إلى أن يظهر القائم عليه السلام‏<\/p>\n<p style=\"text-align: justify;\">[Al-Fadil al-Baha&#8217;i may Allah have mercy on him said: Maybe what is meant by &#8220;This isn&#8217;t how it was revealed&#8221; is the divine interpretation, for example they say: &#8220;The narration was revealed for such and such&#8221; Otherwise, it (i.e the verse) is mass transmitted so we cannot reject it.<\/p>\n<p style=\"text-align: justify;\">(Majlisi says) We can respond to him that: If you mean that it is mass transmitted up until the reciters or those who compiled the Qur&#8217;an then we accept this. However, if you mean that it is mass transmitted from the Prophet (saw) then this is not accepted. The mass transmitted narrations have generally proved the deletion and distortion but we cannot be certain about a certain location. We&#8217;ve been ordered to recite it and work with it according to how the reciters transmitted it until al-Qa&#8217;im (i.e 12th Imam) appears.]<\/p>\n<p style=\"text-align: justify;\">This is very interesting, we see a narration clearly imply Tahrif. Al-Baha&#8217;i says maybe what&#8217;s meant is the divine interpretation and not that the verse itself is corrupted. He argues that the verse is mass transmitted so how can we reject it?<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi refutes him by saying it&#8217;s not true that the verse is mass transmitted from the Prophet (saw). He says it is mass transmitted from the reciters hinting that the mass transmission took place after the verses were corrupted by the Companions. Then he says that mass transmitted reports all stated that the Qur&#8217;an was indeed a victim of deletion and distortion. Finally, he says they were ordered to recite Qur&#8217;an as the people of Sunnah do until the 12th rises with the complete Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi wrote his book &#8220;Mir&#8217;at-ul-`Uqul&#8221; to comment on the authenticity and interpretation of the narrations in al-Kafi by al-Kulayni.<\/p>\n<p style=\"text-align: justify;\">You may have read above that al-Majlisi suggested that Ayat-ul-Kursi has been corrupted. The story is that al-Kulayni and `Ali bin Ibrahim both quote narrations in their books where this verse is different than the one we have in our Qur&#8217;an today. Below is al-Majlisi&#8217;s commentary on the narration of al-Kafi.<\/p>\n<p style=\"text-align: justify;\">He writes in al-Mir&#8217;at 26\/314 regarding narration #437:<\/p>\n<p style=\"text-align: justify;\">و هذا الخبر يدل على أنه قد أسقط من آية الكرسي كلمات و قد ورد في بعض الأدعية المأثورة فليكتب آية الكرسي على التنزيل، و هو إشارة إلى هذا<\/p>\n<p style=\"text-align: justify;\">[This report is evidence that Ayat-ul-Kursi is missing some words. It has been mentioned in the supplications of the Imams that one must &#8220;Write Ayat-ul-Kursi as it was revealed&#8221; and that points towards this.]<\/p>\n<p style=\"text-align: justify;\">He then quotes the narration from Tafsir al-Qummi as support.<\/p>\n<p style=\"text-align: justify;\">Next, in al-Mir&#8217;at 26\/77, Majlisi authenticates narration #212 which talks about the corruption of Surat-ul-Nisa&#8217; verse 59:<\/p>\n<p style=\"text-align: justify;\">The original verse is like this:<\/p>\n<p style=\"text-align: justify;\">فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّـهِ وَالرَّسُولِ<\/p>\n<p style=\"text-align: justify;\">{If you disagree on a matter then return it to Allah and the Messenger} [4:59]<\/p>\n<p style=\"text-align: justify;\">On the other hand, the narration states that abu Ja`far al-Baqir recited it like this:<\/p>\n<p style=\"text-align: justify;\">فَإِنْ خِفْتُمْ تَنَازُعاً فِي الْأَمْرِ فَأَرْجِعُوهُ إِلَى اللَّهِ وَ إِلَى الرَّسُولِ وَ إِلَى أُولِي الْأَمْرِ مِنْكُم‏<\/p>\n<p style=\"text-align: justify;\">&#8220;If you fear disagreement in the matter then return it to Allah, to his Messenger and those in authority among you.&#8221;<\/p>\n<p style=\"text-align: justify;\">So al-Majlisi wrote:<\/p>\n<p style=\"text-align: justify;\">قوله عليه السلام:&#8221; فإن خفتم تنازعا&#8221; ظاهره أنها هكذا نزلت، و يحتمل أن يكون الغرض تفسير الآية بأنه ليس المراد تنازع الرعية و أولي الأمر، كما ذهب إليه أكثر المفسرين، بل هو خطاب للمأمورين الذين قيل لهم&#8221; أَطِيعُوا اللَّهَ&#8221; أي إن اشتبه عليكم أمر و خفتم فيه تنازعا، لعدم علمكم به، فَرُدُّوهُ إِلَى اللَّهِ وَ الرَّسُولِ و الرد إلى أولي الأمر أيضا داخل في الرد إلى الرسول، لأنهم إنما أخذوا علمهم عنه، و ظاهر كثير من الأخبار أن قوله:&#8221; وَ أُولِي الْأَمْرِ مِنْكُمْ&#8221; كان مثبتا هيهنا فأسقط<\/p>\n<p style=\"text-align: justify;\">[His saying (as): &#8220;If you fear disagreement&#8221; is apparent in that this is how it was revealed. It&#8217;s possible that the purpose is to interpret the verse that what&#8217;s intended is not a disagreement between the subjects and those in authority like most Mufassirin said. Rather it is addressing those who were told {Obey Allah} meaning if the matter got confusing and feared it could lead to a conflict then return it to Allah and the Messenger. Returning the matter to those in authority is also included when returning things to the Messenger since they took their knowledge from him. What&#8217;s apparent from many narrations that {And those in authority among you} was established in the verse but was dropped.]<\/p>\n<p style=\"text-align: justify;\">Majlisi admits that the apparent wording of the narration shows that this is indeed how it was revealed according to their Imam. Then he states that many narrations show that a part of the verse was dropped towards the end.<\/p>\n<p style=\"text-align: justify;\">In al-Mir&#8217;at 26\/316 #439 he comments on the verse:<\/p>\n<p style=\"text-align: justify;\">{They were touched by poverty and hardship and were shaken until [even their] messenger} [2:214]<\/p>\n<p style=\"text-align: justify;\">However, their Imam recites in the narration:<\/p>\n<p style=\"text-align: justify;\">َ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ع يَقْرَأُ- وَ زُلْزِلُوا ثُمَّ زُلْزِلُوا- حَتَّى يَقُولَ الرَّسُول‏<\/p>\n<p style=\"text-align: justify;\">&#8220;And were shaken <span style=\"color: #ff0000;\">then shaken<\/span> until [even their] messenger&#8221;<\/p>\n<p style=\"text-align: justify;\">He says:<\/p>\n<p style=\"text-align: justify;\">و الظاهر أنه كان عن بكر بن محمد فزيد فيه- أبي- من النساخ و يدل على أنه سقط عن الآية قوله- ثم زلزلوا<\/p>\n<p style=\"text-align: justify;\">[What&#8217;s apparent is that it was (narrated) from Bakr bin Muhammad but the word &#8220;father&#8221; had been added by the copyist. This also proves that the part &#8220;then shaken&#8221; was dropped from the verse.]<\/p>\n<p style=\"text-align: justify;\">Next, al-Majlisi comments on the narration of their Imams that the Qur&#8217;an revealed upon Muhammad (saw) is seventeen-thousand verses. This is in al-Mir&#8217;at 12\/525 #28:<\/p>\n<p style=\"text-align: justify;\">فالخبر صحيح و لا يخفى أن هذا الخبر و كثير من الأخبار الصحيحة صريحة في نقص القرآن و تغييره، و عندي أن الأخبار في هذا الباب متواترة معنى، و طرح جميعها يوجب رفع الاعتماد عن الأخبار رأسا بل ظني أن الأخبار في هذا الباب لا يقصر عن أخبار الإمامة فكيف يثبتونها بالخبر<\/p>\n<p style=\"text-align: justify;\">[The narration is authentic and it is no secret that many from the authentic narrations are explicit in that the Qur&#8217;an suffered from deletion and corruption. In my view, the narrations in this regard (i.e narrations of Tahrif) are mass transmitted in meaning and so discarding all of them would lead to the rejection of all our narrations in general. I actually think that the narrations in this regard are not any less than the narrations concerning Imamah]<\/p>\n<p style=\"text-align: justify;\">In Mir&#8217;at al-Uqul 3\/31 al-Majlisi comments on their narration that nobody claimed to have collected the full Qur&#8217;an except `Ali bin abi Talib:<\/p>\n<p style=\"text-align: justify;\">ما ادعى أحد أي غير الأئمة عليهم السلام و المراد بالقرآن كله ألفاظه و حروفه جميعا، و المراد بكما أنزل، ترتيبه و إعرابه و حركاته و سكناته و حدود الآي و السور، و هذا رد على قوم زعموا أن القرآن ما في المصاحف المشهورة، و كما قرأه القراء السبعة و أضرابهم‏<\/p>\n<p style=\"text-align: justify;\">[The words &#8220;Nobody claimed&#8221; means nobody except the Imams (as), and what&#8217;s meant by &#8220;collected the Qur&#8217;an&#8221; means in its entirety, with all its words and letters. What&#8217;s meant by &#8220;As it was revealed&#8221; means the order of verses, the grammatical marks and stops, the limits of verses and chapters. This (narration) refutes those folks who claim that the Qur&#8217;an is what is now found within the widespread Masahif or what the seven reciters and their likes have recited]<\/p>\n<p style=\"text-align: justify;\">As you can observe, the man is very open that what&#8217;s found today is not the correct Qur&#8217;an. He literally says the narration refutes those who claim the Qur&#8217;an is what is found with us today!<\/p>\n<p style=\"text-align: justify;\">He continues:<\/p>\n<p style=\"text-align: justify;\">و اختلف أصحابنا في ذلك، فذهب الصدوق ابن بابويه و جماعة إلى أن القرآن لم يتغير عما أنزل و لم ينقص منه شي‏ء، و ذهب الكليني و الشيخ المفيد قدس الله روحهما و جماعة إلى أن جميع القرآن عند الأئمة عليهم السلام، و ما في المصاحف بعضه‏<\/p>\n<p style=\"text-align: justify;\">[Our Companions differed in this, al-Saduq ibn Babuwayh and a group held the opinion that the Qur&#8217;an was not changed from how it was revealed nor is anything missing. Whereas, al-Kulayni, Shaykh al-Mufid and a group may Allah sanctify their souls believed that the entire Qur&#8217;an is with the Imams (as) and what we have with us in our Mushaf today is a part of it]<\/p>\n<p style=\"text-align: justify;\">And to which group do you think al-Majlisi belongs dear reader?<\/p>\n<p style=\"text-align: justify;\">He continues:<\/p>\n<p style=\"text-align: justify;\">و جمع أمير المؤمنين صلوات الله عليه كما أنزل بعد الرسول صلى الله عليه و آله و سلم و أخرج إلى الصحابة المنافقين فلم يقبلوا منه، و هم قصدوا لجمعه في زمن عمر و عثمان‏ كما سيأتي تفصيله في كتاب القرآن‏<\/p>\n<p style=\"text-align: justify;\">[The chief of believers (as) collected it as it was revealed after the Messenger of Allah (saw) and he brought it out to the hypocrite Companions who refused it. They sought to collect it in `Umar and `Uthman&#8217;s reigns as you will see in detail in Kitab-ul-Qur&#8217;an (i.e volume 89)]<\/p>\n<p style=\"text-align: justify;\">That&#8217;s the typical Shia story believed by the vast majority of scholars, do you think they&#8217;ll accept that `Ali&#8217;s compilation is similar to ours? Of course they&#8217;ll say the one collected by the Companions is inferior to the one collected by `Ali.<\/p>\n<p style=\"text-align: justify;\">Then he quotes al-Mufid in al-Masa&#8217;il al-Sarawiyyah:<\/p>\n<p style=\"text-align: justify;\">قال شيخنا السديد المفيد روح الله روحه في جواب المسائل السروية<\/p>\n<p style=\"text-align: justify;\">In brief al-Mufid declares the Qur&#8217;an to be missing verses, he describes `Ali&#8217;s perfect Qur&#8217;an and says in the end that the Imams ordered us to recite our Qur&#8217;an until the Qa&#8217;im rises.<\/p>\n<p style=\"text-align: justify;\">Majlisi concludes:<\/p>\n<p style=\"text-align: justify;\">و الأخبار من طريق الخاصة و العامة في النقص و التغيير متواترة، و العقل يحكم بأنه إذ كان القرآن متفرقا منتشرا عند الناس، و تصدي غير المعصوم لجمعه يمتنع عادة أن يكون جمعه كاملا موافقا للواقع، لكن لا ريب في أن الناس مكلفون بالعمل بما في المصاحف و تلاوته حتى يظهر القائم عليه السلام، و هذا معلوم متواتر من طريق أهل البيت عليهم السلام و أكثر أخبار هذا الباب مما يدل على النقص و التغيير و سيأتي كثير منها في الأبواب‏<\/p>\n<p style=\"text-align: justify;\">[The narrations from the path of the Shia and the mainstream Muslims regarding deletion and distortion are mass transmitted. The intellect judges that if the Qur&#8217;an was spread in various locations with different people, then a group of non-infallible men were tasked with collecting it, it&#8217;s natural that it won&#8217;t be collected in its entirety or in accordance with how it was revealed. No doubt, the people are religiously obliged to adhere to what&#8217;s in the Mushaf (today), they are to recite it (as it is) until al-Qa&#8217;im (as) appears. This is known and mass transmitted from the way of Ahlul-Bayt (as) and most narrations in this topic are proofs for deletions and corruption and you will see much of it in the (following) chapters]<\/p>\n<p style=\"text-align: justify;\">The man&#8217;s creed is crystal by now I suppose, no need for comments. He believes in Tahrif and this inferior Qur&#8217;an of ours, we&#8217;re stuck with it until the brave hidden leader comes out of his hole.<\/p>\n<p style=\"text-align: justify;\">Now it should not come as a shock that al-Majlisi&#8217;s students also believe in the same thing, for example Ni`matullah al-Jaza&#8217;iri. Even his family members held the same beliefs, al-Majlis will tell us of his father&#8217;s beliefs below.<\/p>\n<p style=\"text-align: justify;\">Muhammad Baqir al-Majlisi quotes the words of his father Muhammad Taqi al-Majlisi in al-Fawa&#8217;id al-Tarifah fi Sharh al-Sahifah al-Sharifah pg.58:<\/p>\n<p style=\"text-align: justify;\">When discussing this verse:<\/p>\n<p style=\"text-align: justify;\">{And [remember, O Muhammad], when We told you, &#8220;Indeed, your Lord has encompassed the people.&#8221; And We did not make the sight which We showed you except as a trial for the people, as was the accursed tree [mentioned] in the Qur&#8217;an. And We threaten them, but it increases them not except in great transgression.} [17:60]<\/p>\n<p style=\"text-align: justify;\">قال الوالد العلامة قدس الله روحه: أي ما جعلنا حكاية الشجرة الملعونة في القرآن الا فتنة للناس وامتحانا لهم, والظاهر أن هذه  تخصيص بعد تعميم, لان الرؤيا أعم من بني أمية وغيرهم من التيمي والعدوي وبني العباس, والظاهر أن لعنهم كان في القرآن صريحا فاسقطه عنه الثلاثة كما ورد في الأخبار (ونخوفهم ) أي الناس لئلا يتابعوا أئمة الجور أو التابعين و المتبوعين. أنتهى كلامه رفع الله مقامه<\/p>\n<p style=\"text-align: justify;\">[My father, the grand scholar may Allah sanctify his soul said: &#8220;This means, we only mentioned the story of the cursed tree in the Qur&#8217;an as a trial to test the people. What&#8217;s apparent is that it&#8217;s a specification after a generalization, since its sight is more general than that of Banu Umayyah, the Taymi (i.e Abu Bakr), the `Adawi (i.e `Umar) and Banu al-`Abbas because what&#8217;s apparent is that they were (all) cursed clearly in the Qur&#8217;an but the three (i.e first three Caliphs) have erased it from the Qur&#8217;an as the narrations stated. His word {We threaten them} meaning the people so they wouldn&#8217;t follow the tyrant leaders and their followers.&#8221; His words end here may Allah raise his rank.]<\/p>\n<p style=\"text-align: justify;\">So this cursed tree, which they believe refers to Banu Umayyah, is also referring to Abu Bakr, `Umar and Banu al-`Abbas who were all clearly cursed in the Qur&#8217;an but the evil Caliphs distorted Allah&#8217;s book and erased their names.<\/p>\n<p style=\"text-align: justify;\">In the end, we would have quoted the words of some Shia scholars who admitted that al-Majlisi believes in Tahrif however do we really need to? A person would have to be quite thick headed in order to not see this truth. If al-Majlisi&#8217;s own words aren&#8217;t sufficient for some then nobody else can convince them.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Muhammad Baqir al-Majlisi (d.1111 AH) also known as al-`Allamah is the father of modern day Shiasm, he was the top and most influential scholar in the Safavid empire and the author of the biggest Shia Hadith encyclopedia &#8220;Bihar-ul-Anwar al-Jami`li Durar <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/06\/11\/muhammad-baqir-al-majlisi-tahreef\/\" title=\"Muhammad Baqir al-Majlisi &#038; Tahreef\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3818,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[4],"tags":[53],"class_list":{"0":"post-3269","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-quran","8":"tag-tahreef"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3269","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3269"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3269\/revisions"}],"predecessor-version":[{"id":3421,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3269\/revisions\/3421"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3818"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3269"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3269"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3269"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}