{"id":3299,"date":"2016-06-19T20:00:53","date_gmt":"2016-06-19T20:00:53","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3299"},"modified":"2016-06-20T13:05:01","modified_gmt":"2016-06-20T13:05:01","slug":"response-to-then-i-was-guided","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/06\/19\/response-to-then-i-was-guided\/","title":{"rendered":"Response to: Then I Was Guided"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3299\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Response to: Then I Was Guided<\/h1>\n<p style=\"text-align: justify;\"><strong>by Sh. Uthman Al-Khamīs<\/strong><\/p>\n<p style=\"text-align: justify;\">Translated by Hani Salhab Al-Tarabulsi<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">*Note: The original page referencing provided by Sh. Uthman Al-Khamees was kept. Though, we have added the titles of the chapters in English from Tijani’s Then I Was Guided for those that want to review the original text. Points 32 and 61 do not seem to have been included in the English translation of Then I Was Guided.<\/p>\n<p style=\"text-align: justify;\"><strong>**Those that are experiencing difficulties reading the text on mobile due to dropped symbols, please access the Full Version of the website at the very bottom of this article.<\/strong><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/exposing-tijani\/\" rel=\"external nofollow\">Back to Exposing Tijani page<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong><u>1- <\/u><\/strong><u>Tijani writes on pg.24 [Then I was Guided \/ In Egypt]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Some of al-Azhar&#8217;s Shaykhs used to come to these meetings and liked what I recited from the Qur’ānic verses and the sayings of the great Prophet Muḥammad (peace be upon him). Besides that, they were impressed by my strong arguments and asked me from which university I had graduated from. I used to answer them proudly that I graduated from al-Zaytūnah University<\/strong>.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">And on the same page, he said:<\/p>\n<p style=\"text-align: justify;\"><strong>Some of them even told me that my place was there, i.e. at al-Azhar… I sat on the VIP rostrum between father Shnudah and the Azhari Shaykh. I was also asked to address the meeting, which I did with ease.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">After all this, he says on pg.54 [Then I was Guided \/ A Meeting with the Al Ulama’]:<\/p>\n<p style=\"text-align: justify;\"><strong>I was surprised by the intelligence of that young boy<a href=\"#_ftn1\" name=\"_ftnref1\"><strong>[1]<\/strong><\/a> who seemed to have learnt what he was saying in the same way that one recites a Surah from the Qur’ān… He continued his discussion with me as if he was a teacher teaching a student. In fact I felt weak before him and wished that I had gone with my friend instead of staying with the young boys. I was not able to answer any question related to jurisprudence or history that they asked me.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He is sought by the scholars of al-Azhar University and he boasts about it. Then suddenly, he turns incapable when facing Shī`ah boys in Najaf and tries to run away. This whole story is just an attempt by Tijani to show that Shī`ah boys are more knowledgeable than the scholars of al-Azhar. Interestingly, he wouldn’t mention the name of these Azhari scholars nor the date and location of this meeting or even the names of those who invited him to al-Azhar.<\/p>\n<p style=\"text-align: justify;\">These are not statements by a man who respects his readers and himself.<\/p>\n<p style=\"text-align: justify;\">Let’s look at Tijani himself, after he learned from the scholars and boys of Najaf, what did he become? A compulsive liar, who throws thoughtless accusations and invents stories to trick his readers.<\/p>\n<p style=\"text-align: justify;\">Dear reader, what we’ll include throughout the pages of this book will show you how much of a deceitful liar and transgressing oppressor he is, in addition to his deviance from the academic methodology. It will expose his ignorance and his bad intentions, and we will see what becomes of him in the near future.<\/p>\n<p style=\"text-align: justify;\"><u>2- Tijani says on pg.25 [Then I was Guided \/ In Egypt]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Didn’t He (i.e Allāh) say in the sacred (Qudsi) narration: “My slave, give Me and you shall become like Me. You say to the thing ‘Be’ and it is.”?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This “Ḥadīth-Qudsi” as Tijani claimed is nonexistent in the books that collect fabricated reports<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a>. Therefore, it is surely from the nonsense invented by extreme Sufis which Tijani was brought up upon.<\/p>\n<p style=\"text-align: justify;\">Whoever finds this narration then let him point it to us and we will be from the thankful.<\/p>\n<p style=\"text-align: justify;\"><u>3- Tijani said pg.28 [Then I was Guided \/ A Meeting on Board the Ship]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I told Mun`im: If I knew you were a Shī`ah I wouldn’t have talked to you. He asked: Why? I said: Because you aren’t Muslims, you worship `Alī ibn Abī Ṭālib. As for the moderate ones among you, they worship Allāh but they don’t believe in the messege of Muḥammad but curse Jibril and accuse him of betraying the trust.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">(Tijani then claims he received this information from history books such as Fajr-ul-Islam, Duha al-Islam and Dhuhr-ul-Islam by Aḥmad Amin.)<\/p>\n<p style=\"text-align: justify;\">I say: This is an explicit lie for Aḥmad Amin never mentioned these statements.<\/p>\n<p style=\"text-align: justify;\">Yes, we do believe some Shī`ah sects believe in `Alī’s god-hood such as the Saba’iyyah. However, Aḥmad Amin mentioned in his books the Twelver Shī`ah sect and never attributed to them `Alī’s god-hood, the rejection of the message of Muḥammad or cursing Jibril.<\/p>\n<p style=\"text-align: justify;\">He attributed to them however, other blasphemous sayings that they’re proud of, like the return of their Imams to life after death<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a>, that their Imams know the unseen<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a>, they revive the dead<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a>, that the Qur’ān is corrupted<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a>, that all Companions are apostates except three<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a>, among other clear blasphemy.<\/p>\n<p style=\"text-align: justify;\"><u>4- Tijani wrote on pg.29 [Then I was Guided \/ A Meeting on Board the Ship]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Shī`ah Mun`im said: “Aḥmad Amin himself visited `Iraq and I was among the professors who met him in Najaf. When we reproached him about his writings regarding the Shī`ah, he apologized saying: I know nothing about you folks, I’ve never been in contact with Shī`ah before this day.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie attributed to Aḥmad Amin. If this was true why did he not retract these statements from his books? Furthermore, al-Amin had quoted these beliefs from their relied upon books so how can he say he knew nothing about the Shī`ah!?<\/p>\n<p style=\"text-align: justify;\">Aḥmad Amin himself writes in his book, after listing their deviancies: “This, in summary, is the view of the Shī`ah concerning the Imams. It is taken from their most reliable of books based on the words of their Imams without any commentaries or footnotes.”<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p>\n<p style=\"text-align: justify;\">Why didn’t Tijani bring this up during the life of Aḥmad Amin so that he could be confronted about it!?<\/p>\n<p style=\"text-align: justify;\">I add, Aḥmad Amin’s books are readily available. He quotes the words of al-Kulayni from al-Kafi and refers to Nahj-ul-Balaghah, Wasa’il-ul-Shi`ah, Bihar-ul-Anwar and Waqfat-ul-Za’irin by al-Majlisi among other Shī`ah books. I ask: Is reading these books and quoting from them not sufficient for him? Why then would he say: “I know nothing about the Shī`ah”!?<\/p>\n<p style=\"text-align: justify;\"><u>5- He wrote on pg.30[Then I was Guided \/ A Meeting on Board the Ship]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I found his opinion to be good and I accompanied him to a secluded place, away from people. I performed ablution, and then asked him to lead me in prayer in order to test his prayer, thinking that I would redo my prayer later on.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: If this is true, then it shows his malicious intentions, his inconsideration towards the importance of prayer on top of his expertise in Taqiyyah.<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p>\n<p style=\"text-align: justify;\">This is an action that no believer dares to do, no God-fearing man would pray a prayer to the Almighty knowing that it’s corrupt and unacceptable!<\/p>\n<p style=\"text-align: justify;\">Tijani himself said on pg.31 that he prayer Maghrib with his Shī`ah brother Mun`im, then he said: “We headed towards the restaurant… and he led us in `Isha’.”<\/p>\n<p style=\"text-align: justify;\">I say: The Shī`ah have only three timings of prayer as opposed to Sunnah. They combine Maghrib and `Isha’ as one, so either Tijani is lying or his Shī`ah friend is returning the favor by practicing Taqiyyah with him. A pot that found its lid!<\/p>\n<p style=\"text-align: justify;\"><u>6- He wrote on pg.34 [Then I was Guided \/ My First Visit to Iraq]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Just as Muḥammad the Messenger of Allāh (peace be upon him) is the master of all the prophets, `Abdul-Qādir is the master of all the close friends of Allāh. His feet are on the necks of all the saints, and it was him who said, &#8220;Everyone goes around the house seven times, while the house circulates around my tents.&#8221; I tried to convince him (i.e. Mun`im) that Shaykh `Abdul-Qādir came to see his followers and treat them if they were ill and comfort them if they were depressed.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">This paragraph shows a deep deviancy that Tijani had before he embraced Tashayyu`<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a>, (assuming he’s telling the truth in the first place). This also shows the strong resemblance of Sufism and Tashayyu`<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a> which are two sides of the same coin.<\/p>\n<p style=\"text-align: justify;\">According to the people of Sunnah, anyone who believes that al-Jīlānī or anybody else from among the dead, can come to his seekers and lovers openly and heal their illnesses or relieve their distress, is a disbeliever who left the folds of Islam.<\/p>\n<p style=\"text-align: justify;\">Allāh most High said: {To Him is the call of truth; and those upon whom they call, apart from Him, answer them nothing, but it is as a man who stretches out his hands to water that it may reach his mouth, and it reaches it not. The prayer of the unbelievers goes only astray.} [13:14]<\/p>\n<p style=\"text-align: justify;\">He also said: {Say: &#8216;Call on those you have asserted apart from God; they possess not so much as the weight of an ant in the heavens nor in the earth; they have no partnership in either of them, nor has He in them any supporter.&#8217;} [34:22]<\/p>\n<p style=\"text-align: justify;\">Shaykh al-Aalusi said regarding Allāh’s words {Surely those upon whom you call, apart from God, shall never create a fly} [22:73]<\/p>\n<p style=\"text-align: justify;\">“It is criticism towards those who go to extremes in venerating the close-friends of Allāh – they seek their aid in distress – while ignoring the mention of Allāh. They sacrifice for them and even the moderate ones among them say, ‘They are our means to God. We only sacrifice for Allāh but offer the reward for His close-friend’. It is no secret, that their first words resemble those of the idol worshippers who argued {We only serve them that they may bring us nigh in nearness to God} [39:3]<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p>\n<p style=\"text-align: justify;\">Shaykh Abū Bakr al-Ḥanbali said: “Greater polytheism is six kinds: Calling on other than Allāh &#8211; such as prophets and saints &#8211; to provide: Livelihood, health or other matters. This is because Allāh most High said: {Do not call, apart from God, on that which neither profits nor hurts thee, for if thou dost, then thou wilt surely be of the evildoers} [10:106]<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p>\n<p style=\"text-align: justify;\">The statement, &#8220;Everyone goes round the house seven times, while the house circulates around my tents,&#8221; is blasphemous, and it is not established that `Abdul-Qādir al-Jīlanī said it.<\/p>\n<p style=\"text-align: justify;\"><u>7- Tijani wrote on pg.37 [Then I was Guided \/ Abdul Qadir al-Jilani and Musa al-Kazim]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>In truth, I did not know much about Islamic history because our teachers used to prevent us, under the pretext that it was a dark history and that reading it would be of no benefit to us.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Truly, the rope of lying is short<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a> since Tijani wrote on pg.23, “They liked me for my enthusiasm, frankness and deep knowledge.” He also previously mentioned that he had read all of Aḥmad Amin’s books of history (return to section 5).<\/p>\n<p style=\"text-align: justify;\">Describing Islamic history as being dark is a Shī`ah view; nobody says this except the Shī`ah. Even Orientalists acknowledge that Islamic history contains many golden ages, especially in the era of the rightly-guided Caliphs.<\/p>\n<p style=\"text-align: justify;\">If Tijani’s teachers were describing the great Islamic history as being dark, then our Sunni teachers and scholars tell us otherwise. The history books of our scholars are great in number, describing the lives of our pious predecessors, but if Tijani wants a dark history then he may want to check out the history of the Shī`ah. The Shī`ah have never achieved a victory for Islam at any point, nor did they conquer, nor did they resist an enemy. On the contrary, their fight was always against Ahlul-Sunnah, and history repeats itself today.<\/p>\n<p style=\"text-align: justify;\">In the past, we do not know them for their Jihad in the name of Islam, but we do know is as follows:<\/p>\n<p style=\"text-align: justify;\">a- Their support of the Mongols who invaded Baghdad and destroyed it. This was through the Shī`ah minister Ibn al-`Alqami and the Shī`ah scholar al-Nasīr al-Ṭūsī.<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a><\/p>\n<p style=\"text-align: justify;\">The Shī`ah scholar, al-Mīrza Muḥammad Bāqir al-Musawi al-Khawansārī al-Asbahānī said in the biography of Nasīr-ul-Dīn al-Ṭūsī:<\/p>\n<p style=\"text-align: justify;\">“He is the wise, outspoken, venerated researcher… from what is known and popular about him is he was granted the ministry in the protected land of Iran by Sultan Hulagu Khan (grandson of Genghis Khan), from the great Sultans of the Mongols. He came as part of the escort for the (Mongol) Sultan to Baghdad in order to guide the servants of God and attempt to reform the lands and extinguish tyranny and corruption by removing the capital of the kingdom of Banu al-`Abbās and causing a mass slaughter directed at the followers of those oppressors until their filthy blood spilled to form rivers. It gushed into the river of al-Dajlah and from it to the fires of hell and the dwelling place of the evildoers.”<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Khomaynī as well blessed Tusī’s action and considered it a victory for Islam. He said, “If the circumstance of Taqiyyah forced any of us (i.e. Shī`ah) to be from the servants of the Sultans, then we must refrain from doing so even if it leads to our death. Unless, presenting oneself as an apparent follower will lead to a real victory for Islam and Muslims, such as what `Alī bin Yaqtīn and Nasīr-ul-Dīn al-Tusī did.”<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a><\/p>\n<p style=\"text-align: justify;\">We learned what Nasīr-ul-Din al-Tusī did, so what did `Alī bin Yaqtīn do?<\/p>\n<p style=\"text-align: justify;\">Their Shī`ah scholar Ni`matullah al-Jaza’irī writes: “In the narrations, `Alī bin Yaqtīn was the minister of (`Abbāsi Caliph) al-Rasheed, when a group from the opponents (i.e Sunnies) were gathered in a prison he was in charge of. Ibn Yaqtin ordered his servants to demolish the ceiling on their heads and he managed to kill around five hundred of them. He then wished to rid himself of the blood on his hands, so he sent a letter to the Imam, our master Musa al-Kadhim who told him: “If you had asked me before then you wouldn’t have had their blood on your hand but since you didn’t then repent for each one by sacrificing a goat and the goat is more valuable than they are.” So look at this good way of offering blood-money, it is less than that the blood-money paid for their younger brother, which is the blood-money price of a hunting dog (twenty Dirhams), and less than that of their elder brothers, the Jews and Zoroastrians (eight hundred Dirhams). They will be even more worth even less in the after-life.”<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a><\/p>\n<p style=\"text-align: justify;\">b- Their support for the crusaders against the Muslims during the crusades and opening the fronts for them to enter.<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a><\/p>\n<p style=\"text-align: justify;\">c- Conducting celebrations when the Ottoman army was beaten by the Russians and their constant wars against the Ottoman Empire.<a href=\"#_ftn20\" name=\"_ftnref20\">[20]<\/a><\/p>\n<p style=\"text-align: justify;\">d- Slaughtering the pilgrims and removing the black-stone and taking it to al-Ihsa’.<a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a><\/p>\n<p style=\"text-align: justify;\">As for modern times:<\/p>\n<p style=\"text-align: justify;\">a- Khomaynī’s statement that the road to Jerusalem must pass by `Iraq. Then his praise for Nasīr-ul-Dīn al-Ṭūsī who caused a massacre in Baghdad in the days of the Tattar.<a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/p>\n<p style=\"text-align: justify;\">b- Murdering the preachers of Ahlul-Sunnah in Iran such as Aḥmad Mufti Zādeh, Aḥmad Kasravi, Al-Burqu`ī, Mudhaffariyān and many others.<a href=\"#_ftn23\" name=\"_ftnref23\">[23]<\/a><\/p>\n<p style=\"text-align: justify;\">c- The Palestinian massacre of Sabra and Shateela at the hands of (the Shī`ah) Amal movement.<a href=\"#_ftn24\" name=\"_ftnref24\">[24]<\/a><\/p>\n<p style=\"text-align: justify;\">d- Their statements about liberating the Ka`bah and the Prophet’s (peace be upon him) mosque.<a href=\"#_ftn25\" name=\"_ftnref25\">[25]<\/a> The explosions in the Haram of Makkah.<a href=\"#_ftn26\" name=\"_ftnref26\">[26]<\/a><\/p>\n<p style=\"text-align: justify;\">As well as many others but it is sufficient to take what their scholar al-Ahqaqī al-Ha’irī about the Islamic conquests on Persian: “The people of Rome and the people of Iran had both received big shocks as a result of the attacks of the Muslims. The treatment they endured at the hands of the primitive Bedouins who never understood the great spirit of Islam had created in them a hatred for the Arabs and their faith. It is the harsh nature of the Bedouin thugs, coupled with the destruction they had inflicted on the most beautiful cities in the east and the west. The attacks by the worshippers of desires who had a thirst for the modesty of that kingdom and that empire…”<a href=\"#_ftn27\" name=\"_ftnref27\">[27]<\/a><\/p>\n<p style=\"text-align: justify;\">Observe well dear reader, see how this contemporary Shī`ah scholar describes the Companions who conquered the lands of Persia (that the nationalistic author longs to) he describes them as a bunch of primitive Bedouins, thugs who worship desires and thirst for the modesty of Persian women. We don’t comprehend what modesty was there in Persia at the time, when it was part of their culture for a brother to marry his sister!?<\/p>\n<p style=\"text-align: justify;\">Would a Muslim say this? This is the main reason for the Shī`ah’s hatred towards `Umar, it is that he destroyed the Persian Empire. It is also the same reason that they glorify al-Ḥusayn’s children rather than those of al-Ḥasan, for al-Ḥusayn’s children are the Persian uncles from his wife Shahrabanu bin Yezdagirt<a href=\"#_ftn28\" name=\"_ftnref28\">[28]<\/a>. Also their glorification for Salman al-Farisi without the rest of the Companions until they claimed he received revelation,<a href=\"#_ftn29\" name=\"_ftnref29\">[29]<\/a> of course because he’s Persian.<\/p>\n<p style=\"text-align: justify;\">This is also why they narrated in their books from `Alī ibn Abī Ṭālib, that he said about (Persian King) Chosroes: “Allāh has saved him from the torment of the fire, hell is forbidden for him.”<a href=\"#_ftn30\" name=\"_ftnref30\">[30]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>8- Tijani said on pg.40 [Then I was Guided \/ Abdul Qadir al-Jilani and Musa al-Kazim]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I wished to defend the Wahhābiyyah in my mind so I said: &#8220;Therefore, Doctor, you are a Wahabi in ideology, for they believe in what you are saying, there are no beloved friends of God (Awliyā’).&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say, First of all: Calling Ahlul-Sunnah by the name “Wahhābi” is an attempt to defame them. They did not call themselves this name, although in it is an honor for them, since they are followers not innovators.<\/p>\n<p style=\"text-align: justify;\">Secondly: His word, “They say, there are no beloved friends of Allāh,” is a clear lie. Praise be to God, we believe in Awliyā’, our books everywhere are a testament to his lie.<\/p>\n<p style=\"text-align: justify;\">Shaykh Muḥammad ibn `Abdul-Wahhāb bin Sulaymān al-Tamīmī<a href=\"#_ftn31\" name=\"_ftnref31\">[31]<\/a> in his book:<\/p>\n<p style=\"text-align: justify;\">“It is obligatory upon you to love the Awliyā’ and to follow them. It is also obligatory to affirm their Karamat<a href=\"#_ftn32\" name=\"_ftnref32\">[32]<\/a> for no one rejects their Karamat except the misguided innovator. Allāh’s correct religion is in the middle between two extremes.”<a href=\"#_ftn33\" name=\"_ftnref33\">[33]<\/a><\/p>\n<p style=\"text-align: justify;\">I had hoped that Tijani would have brought forth one book from the books of those he brands “Wahhābi” where this claim is mentioned.<\/p>\n<p style=\"text-align: justify;\">Scholars of Ahlul-Sunnah only reject Tijani’s delusions which he attributed to `Abdul-Qadir al-Jīlānī in the previous sections.<\/p>\n<p style=\"text-align: justify;\"><u>9- Tijani wrote on pg.44 [Then I was Guided \/ Skepticism and Questioning]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>We Ahlul-Sunnah believe, that he (i.e. The Prophet) is infallible only when it comes to conveying the Qur’ān.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Who made you a spokesperson for the people of Sunnah? Why do you speak on their behalf when you weren’t from them before or after you embraced Tashayyu`!?<a href=\"#_ftn34\" name=\"_ftnref34\">[34]<\/a><\/p>\n<p style=\"text-align: justify;\">We have the right to ask Tijani to point us to the source of this statement: “Ahlul-Sunnah only consider the prophet infallible when transmitting Qur’ān”.<\/p>\n<p style=\"text-align: justify;\">The actual belief of the people of Sunnah with regards to infallibility, is that prophets are infallible when conveying the message, whether Qur’ān or otherwise. Our Prophet Muḥammad (peace be upon him) for example is protected in transmitting both the Book and the Sunnah {Nor doth he speak of (his own) desire. It is naught save an inspiration that is inspired} [53:3-4]<\/p>\n<p style=\"text-align: justify;\">The Qur’ān is revelation and the Sunnah is also revelation. The difference is that the Qur’ān is Allāh’s speech whereas the Sunnah is that of the Messenger’s (peace be upon him) speech amongst other differences we need not mention here.<\/p>\n<p style=\"text-align: justify;\">Therefore, Ahlul-Sunnah believe in the infallibility of the Prophet (peace be upon him) in transmitting his message whether Qur’ān or Sunnah. They also believe that he is divinely protected from all major sins and character flaws. However, they differed on minor mistakes and the truth is that prophets do commit minor mistakes but do not insist upon them as evidenced by the following:<\/p>\n<p style=\"text-align: justify;\">1- {And Adam disobeyed his Lord, and so he erred} [20:121]<\/p>\n<p style=\"text-align: justify;\">2- {O Prophet, why forbiddest thou what God has made lawful to thee} [66:1]<\/p>\n<p style=\"text-align: justify;\">3- {He frowned and turned away that the blind man came to him.} [80:1-2]<\/p>\n<p style=\"text-align: justify;\">4- {And he cast down the Tablets, and laid hold of his brother&#8217;s head, dragging him to him} [7:150]<\/p>\n<p style=\"text-align: justify;\">5- {It is not for any Prophet to have prisoners} [8:67]<\/p>\n<p style=\"text-align: justify;\">6- {Fearing other men; and God has better right for thee to fear Him} [33:37]<\/p>\n<p style=\"text-align: justify;\">7- {Now had he not been of those that glorify God, he would have tarried in its belly until the day they shall be raised} [37:143-144]<\/p>\n<p style=\"text-align: justify;\">8- {And Dawud thought that We had only tried him; therefore he sought forgiveness of his Lord, and he fell down, bowing, and he repented} [38:24]<\/p>\n<p style=\"text-align: justify;\">9- {God pardon thee! Why gavest thou them leave} [9:43]<\/p>\n<p style=\"text-align: justify;\">10- {Nuh, he is not of thy family; it is a deed not righteous. Do not ask of Me that whereof thou hast no knowledge} [11:46]<\/p>\n<p style=\"text-align: justify;\">Al-Qadī `Iyād said: “As for the actions of the limbs, the Muslims agreed on the infallibility of the Prophets in this regard, from indecency, major sins and flaws. There is no difference on them being protected from withholding the message or failing to convey it properly.<\/p>\n<p style=\"text-align: justify;\">As for the minor mistakes, a group from the predecessors and others permitted them for the prophets. Another group of researchers and speculative theologians deemed them infallible in both major and minor sins.<\/p>\n<p style=\"text-align: justify;\">Some of our religious leaders said: Either-way, there must be no difference that they do not insist on committing those minor mistakes or falling into many of them. Nor would they commit a minor mistake that drops their modesty and virtue or causes them to lose their reputation as these are all forbidden for prophets by consensus.”<a href=\"#_ftn35\" name=\"_ftnref35\">[35]<\/a><\/p>\n<p style=\"text-align: justify;\">He also said: “You have seen O’ observer that what we established is truth and that he is infallible, peace be upon him, from ignorance regarding Allāh and His attributes, and that he was in a state of ignorance when it comes to these matters after prophet-hood, according to intellect and consensus, or before it, according to the texts and reports. Nor is he ignorant about any matter from what he propagated from religious laws or conveyed from his Lord from revelation according to intellect and law. Furthermore, he is protected from lying or changing his statements from the time Allāh sent him in his mission, whether intentionally or unintentionally, and that it is impossible for him to do so according to law, consensus, observation and evidence. We surely elevate him from this before his prophet-hood and we elevate him from major sins by consensus and from repeatedly falling into forgetfulness, error and mistakes in religious matters he established for the nation. His infallibility is sustained in all conditions such as when he’s happy, angry, upset or joking.”<a href=\"#_ftn36\" name=\"_ftnref36\">[36]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>10- He said on pg.45 [Then I was Guided \/ Abdul Qadir al-Jilani and Musa al-Kazim]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Mun`im told me: “Have you read the interpretation of the verse {Surely Allāh and His angels bless the Prophet. O you who believe call for (Divine) blessing on him and salute him always} [33:56] All the commentators, Shī`ah and Sunnis, agreed that the Companions of the Prophet, about whom the above Qur’ānic verse was revealed, cared to see the Prophet and said, &#8220;O Messenger of Allāh we know how to salute you, but we do not know how to send prayers to you.&#8221; He said. &#8220;Say, may Allāh bless Muḥammad and the household of Muḥammad in the same way as you bless Ibrāhīm and the household of Ibrāhīm in the world, You are the Praiseworthy and the Glorious, and do not pray on me by the shortened (al-Batrā&#8217;) prayer.&#8221; They said, “And what is the shortened prayer, O Messenger of Allāh?&#8221; He said, “Why do you say may Allāh bless Muḥammad and then stop, for Allāh is perfect and only accepts perfection.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The Messenger of Allāh (peace be upon him) is truthful, for he said: “If you possess no shyness, so as you wish.”<a href=\"#_ftn37\" name=\"_ftnref37\">[37]<\/a><\/p>\n<p style=\"text-align: justify;\">Allāh is the greatest! A grevieous word it is that comes out of their mouths; they speak nothing but a lie. Have the Sunni commentators agreed on this lie!? What is odd is that Tijani in his footnotes references Tafsīr Ibn al-Athīr! We’ve not heard of this book nor did those who wrote Ibn al-Athīr’s biography ever mention that he had a book of Tafsīr! The audacity this man has when he lies is astounding. Then I returned to the books of commentators and found no trace of this version of the narration.<\/p>\n<p style=\"text-align: justify;\">The narration itself is authentic, however it begins with, “We learned how to salute you…” and ends with “…you are the Praiseworthy and the Glorious.”<\/p>\n<p style=\"text-align: justify;\">As for the shortened prayer, it is from Tijani’s lies. No commentator mentioned it in their Qur’ānic commentaries. Such as al-Ṭabarī, Ibn Kathīr, Ibn al-`Arabī, al-Qurtubī, al-Nasfī, al-Shawkānī, Ibn al-Jawzī, Ibn Taymiyyah<a href=\"#_ftn38\" name=\"_ftnref38\">[38]<\/a>, Ibn `Atiyyah, al-Nasā’ī and al-Suyūtī. How then did Tijani permit himself to say: “The scholars of Tafsīr have consensus, both Sunnah and Shī`ah’”!?<\/p>\n<p style=\"text-align: justify;\">Al-Sakhāwī said: It is narrated from him (peace be upon him) in a report in which’s chain I did not come across, “Do not pray upon me a shortened prayer.” They asked, “What is the shortened prayer?” He said, “You say: ‘May Allāh send His blessing upon Muḥammad,’ then you go silent.” Instead say, “Allāh send your blessings upon Muḥammad and Muḥammad’s family.” This was reported by Abū Sa`d in Sharaf-ul-Mustafā.”<a href=\"#_ftn39\" name=\"_ftnref39\">[39]<\/a><\/p>\n<p style=\"text-align: justify;\">This statement, as al- Sakhāwī said, has no chain. Then this compulsive liar says the commentators agreed on it. Is there a bigger lie than this!?<\/p>\n<p style=\"text-align: justify;\">If one were to say, “These are Mun`ims words not Tijani’s.” We respond: Tijani approved his lie and included it in his book as an argument. In one of his audio tapes he refers the same narration to al-Bukhārī and Muslim. Furthermore we ask: Do the Shī`ah of our days pray the complete or shortened prayer? As you know, they never mention the part about our Master Ibrāhīm (peace be upon him).<\/p>\n<p style=\"text-align: justify;\"><u>11- Tijani wrote on pg.54 [Then I was Guided \/ A Meeting with the al-Ulama’]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>We do not recognize anything other than the four Madhabs, anything else is not a part of Islam.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This statement can only be made by two men, a liar or an ignorant man.<\/p>\n<p style=\"text-align: justify;\">Nobody from amongst the scholars of the Muslims ever said that there is nothing in Islam except for the four Madhabs.<\/p>\n<p style=\"text-align: justify;\">The whole story of these Madhabs (religious schools) is that those religious leaders had students who spread their ways and opinions. None of the four religious leaders ordered the people to follow him, nor did they say the truth was with them exclusively. Rather, they asked people to follow the truth wherever it may be and forbade people from emulating them blindly.<\/p>\n<p style=\"text-align: justify;\">Imam Abū Ḥanīfah said: “It is not permissible for anyone to repeat what we say unless he knows where we got our opinion from.”<\/p>\n<p style=\"text-align: justify;\">Imam al-Shāfi`ī said: “If the narration is proven authentic then it becomes my Madhab.”<\/p>\n<p style=\"text-align: justify;\">Similar words are popularly narrated from Mālik and Aḥmad.<a href=\"#_ftn40\" name=\"_ftnref40\">[40]<\/a><\/p>\n<p style=\"text-align: justify;\">We ask Tijani a simple question: What was the Madhab of Abū Bakr, `Umar, `Uthmān, `Alī and the other Companions before the four schools emerged?<\/p>\n<p style=\"text-align: justify;\">The truth is that no one utters the nonsense that Tijani utters except an ignorant man like himself (when he was Sunni) or a liar (when he became a Shī`ah).<\/p>\n<p style=\"text-align: justify;\"><u>12- He writes on pg.54 [Then I was Guided \/ A Meeting with the al-Ulama’]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Brother Mun`im said: Abū Ḥanīfah was a student under Ja`far al-Sādiq. In this regard, Abū Hanīfah recites the following poetry: “If it weren’t for the two years – al-Nu`mān would have perished.” Mālik then took from Abū Ḥanīfah.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is from the endless lies of the Shī`ah.<\/p>\n<p style=\"text-align: justify;\">Abu Ḥanīfah is not from the students of Ja`far, nor was Mālik from the students of Abū Hanīfah.<\/p>\n<p style=\"text-align: justify;\">Tijani took this statement from the books of the Shī`ah.<\/p>\n<p style=\"text-align: justify;\">Al-Anṭākī himself has said those same words.<a href=\"#_ftn41\" name=\"_ftnref41\">[41]<\/a><\/p>\n<p style=\"text-align: justify;\">Abu Ḥanīfah simply narrated from Ja`far a narration or two.<\/p>\n<p style=\"text-align: justify;\">As for his claim, “Mālik has taken from Abū Ḥanīfah,” and al-Anṭākī said, “He took Ja`far’s knowledge from Abū Ḥanīfah”. I say: Ja`far was not counted among the most reliable of narrators in Mālik’s eyes, in fact Mālik never narrated from him without supporting narrators.<a href=\"#_ftn42\" name=\"_ftnref42\">[42]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>13- He wrote on pg.56[Then I was Guided \/ A Meeting with the al-Ulama’]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Mun`im said: Did you know that all the Islamic groups, regardless of their sects agree on the Holy Qur’ān?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: You are truthful if you meant the Islamic groups that are still upon Islam.<\/p>\n<p style=\"text-align: justify;\">As for the groups that attribute themselves to Islam, while Islam is innocent from them, these ones are not in agreement with us regarding this Holy Qur’ān.<\/p>\n<p style=\"text-align: justify;\">The Twelver Shī`ahs that Mun`im and Tijani belong to does not believe in the preservation of the Qur’ān. Rather several Twelver Shī`ah scholars reported the consensus of the Shī`ah about the corruption of the Qur’ān. This is indeed a long research that we can’t get into here but there is no harm in mentioning some Shī`ah scholars who openly declared this.<\/p>\n<p style=\"text-align: justify;\">1- Abū al-Ḥasan al-Fatūni said: Know that the only truth according to the following mass transmitted narrations and other reports, is that after the death of the Messenger of Allāh (peace be upon him) this Qur’ān underwent through alterations. Those who compiled it have dropped many words and verses from it. In a way, it is possible for us to say that this belief is from the necessities of the Shī`ah Madhab.<a href=\"#_ftn43\" name=\"_ftnref43\">[43]<\/a><\/p>\n<p style=\"text-align: justify;\">2- `Adnān al-Bahrānī said: There is a consensus about the corruption and alteration (of the Qur’ān) by the group of truth (i.e Twelver Shī`ah), and it is from the necessities of their Madhab.<a href=\"#_ftn44\" name=\"_ftnref44\">[44]<\/a><\/p>\n<p style=\"text-align: justify;\">3- Abū al-Qāsim `Alī al-Kūfī said: The people of traditions and narrations have agreed, whether from among the near ones and the mainstream ones, that the Qur’ān in people’s hands is incomplete.<a href=\"#_ftn45\" name=\"_ftnref45\">[45]<\/a><\/p>\n<p style=\"text-align: justify;\">4- Al-Mufīd said: The plentiful narrations have reached us from the Imams of guidance, from the family of Muḥammad, that the Qur’ān has been corrupted and that the oppressors committed deletions and omission.<a href=\"#_ftn46\" name=\"_ftnref46\">[46]<\/a><\/p>\n<p style=\"text-align: justify;\">5- Abū Mansūr al-Tabrasī said: If I were to explain to you all what was dropped, corrupted, changed and things of this nature, it would take too long, and it would expose what Taqiyyah has shrouded from the virtues for the pious friends of God and the flaws of their enemies.<a href=\"#_ftn47\" name=\"_ftnref47\">[47]<\/a><\/p>\n<p style=\"text-align: justify;\">6- Yūsuf al-Baḥrānī said: It is no secret that these narrations are explicit and clear statements and they are backing our chosen position. If anyone were to criticize these plentiful and widespread narrations then we can criticize all other narrations since they are from the same fundamental books, chains, narrators and transmitters. The saying of those who don’t believe in corruption is based on nothing except thinking well of the Imams of tyranny, that they didn’t betray the greater trust, although it is apparent that they betrayed the other trust which was more harmful for the religion.<a href=\"#_ftn48\" name=\"_ftnref48\">[48]<\/a><\/p>\n<p style=\"text-align: justify;\">Can Tijani and his mate Mun`im still say: The Islamic groups are in agreement upon the Qur’ān?<\/p>\n<p style=\"text-align: justify;\">They cannot, unless they accuse their own Twelver sect of disbelieving.<\/p>\n<p style=\"text-align: justify;\">In any case, I do not claim the consensus of the Twelver Shī`ah on the corruption of the Qur’ān but it’s their own scholars who claim this as you’ve seen!!<\/p>\n<p style=\"text-align: justify;\"><u>14- Tijani says pg.57 [Then I was Guided \/ A Meeting with the al-Ulama’]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Khū’ī said: Muslims are equal brothers whether Shī`ah or Sunnah. They worship Allāh alone, without associating partners. Their Qur’ān is one, their prophet is one and their Qiblah is one. The Shī`ah and the Sunnah are only different in matters of jurisprudence (Fiqh).<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Shī`ah scholar Ni`matullah al-Jazā’irī responds: We do not unite with the Sunnies upon a god, a prophet or a leader. The Lord whose prophet is Muḥammad and successor is Abū Bakr is not our Lord nor is that our prophet.<a href=\"#_ftn49\" name=\"_ftnref49\">[49]<\/a><\/p>\n<p style=\"text-align: justify;\">Shī`ah scholar al-Kāshānī says: “Whoever rejects the leadership of any of them (the twelve Imams) then he is in the rank one of one who rejects the prophet-hood of all the prophets (peace be upon them).”<a href=\"#_ftn50\" name=\"_ftnref50\">[50]<\/a><\/p>\n<p style=\"text-align: justify;\">Shī`ah scholar al-Māmqānī says: “The most that can be benefitted from the reports is that the ruling of ‘disbeliever’ and ‘polytheist’ will be applied to anybody who is not a Twelver in the after-life.”<a href=\"#_ftn51\" name=\"_ftnref51\">[51]<\/a><\/p>\n<p style=\"text-align: justify;\">In fact Tijani himself said in one of his lecture in London – and the tapes are available &#8211; that: “The Lord that is pleased with the successor of his prophet being Abū Bakr is not a Lord we want.”<\/p>\n<p style=\"text-align: justify;\">Who do we believe then!?<\/p>\n<p style=\"text-align: justify;\">Whoever wishes to know more, then let him return to the book “Ḥaqīqat-ul-Shī`ah” by `Abdullāh al-Mawṣilī may Allāh have mercy on him.<\/p>\n<p style=\"text-align: justify;\"><u>15- Tijani says on pg.66 [Then I was Guided \/ A Meeting with Al Sayyid Muhammad Baqir al Sadr]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I asked him (i.e Bāqir al-Ṣadr) about the stone they prostrate on. He replied: “What should be known before anything else is that we do not prostrate for the stone, we prostrate on the stone. What is established for us (i.e Twelvers) and for Ahlul-Sunnah too, is that the best prostration is that which is on the ground or on whatever comes from the earth other than food. It is not correct to prostrate on anything else.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He lies upon the people of Sunnah.<\/p>\n<p style=\"text-align: justify;\">Imam ibn Qudamah says in his book<a href=\"#_ftn52\" name=\"_ftnref52\">[52]<\/a>: “It is not necessary for any person in prayer to have any of his organs (of prostration) touch the ground directly. Al-Qadi said: If he were to prostrate on the tail of his turban or his sleeve, then his prayer is correct in agreement. This is the Madhab of Mālik and Abū Ḥanīfah.”<\/p>\n<p style=\"text-align: justify;\">We reject the Shī`ah’s glorification of these stones<a href=\"#_ftn53\" name=\"_ftnref53\">[53]<\/a>, to the extent where they fabricated narrations in this regard and attributed them to Ahlul-Bayt. On top of that, the Messenger (peace be upon him), `Alī and al-Ḥasan are all considered greater than Ḥusayn according to Sunnah and Shī`ah, and yet they do not glorify their sand the same way they do with al-Ḥusayn’s sand.<\/p>\n<p style=\"text-align: justify;\">If only the matter stopped on prostrating on the stone as al-Ṣadr said, but it exceeded it to sanctifying this sand.<\/p>\n<p style=\"text-align: justify;\">Mūsa al-Mūsawī said: “Many from those who prostrate on this sand, kiss it and use it for blessings and in some cases they may eat pieces of the of Karbalā’ sand to cure their illnesses!! I do not know when this innovation infiltrated the ranks of the Shī`ah. The Prophet (peace be upon him) never prostrated on stones from Karbalā’, nor did Imam `Alī or the Imams after him prostrate on anything called: Stone of Karbalā’”.<a href=\"#_ftn54\" name=\"_ftnref54\">[54]<\/a><\/p>\n<p style=\"text-align: justify;\">That is a testament of a Shī`ah scholar on their reality today.<\/p>\n<p style=\"text-align: justify;\">The Shī`ah believe that the sand of the land where al-Ḥusayn was martyred is sufficient in healing illnesses and diseases of all kinds. By doing so, they oppose Allāh’s words:<\/p>\n<p style=\"text-align: justify;\">{And if God visits thee with affliction none can remove it but He} [6:17]<\/p>\n<p style=\"text-align: justify;\">{He who answers the constrained, when he calls unto Him, and removes the evil} [27:62]<\/p>\n<p style=\"text-align: justify;\">{And when I sicken, then He healeth me} [26:80]<\/p>\n<p style=\"text-align: justify;\">When they believe that this sand is a cure then they resemble the pagans who thought their stone idols could cause benefit or harm.<\/p>\n<p style=\"text-align: justify;\">From what they’ve narrated about the sand:<\/p>\n<p style=\"text-align: justify;\">They attribute to Ja`far al-Sādiq that he said: “The clay of Ḥusayn’s grave is a cure from all illnesses. Whenever you consume it, say: In Allāh’s name and by Allāh, O’ Lord make it a vast blessing, a beneficial knowledge and a cure to all afflictions.”<a href=\"#_ftn55\" name=\"_ftnref55\">[55]<\/a><\/p>\n<p style=\"text-align: justify;\">They attribute to Muḥammad al-Bāqir that he said: “The clay of Ḥusayn’s grave is cure from all illness and safety from all fear and it shall fix whatever it is used for.”<a href=\"#_ftn56\" name=\"_ftnref56\">[56]<\/a><\/p>\n<p style=\"text-align: justify;\">There are many other narrations that revolve around this that their scholar al-Majlisī had to write an entire chapter on it in his book.<a href=\"#_ftn57\" name=\"_ftnref57\">[57]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>16- Tijani wrote on pg.68 [Then I was Guided \/ A Meeting with Al Sayyid Muhammad Baqir al Sadr]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Bāqir al-Ṣadr said: The Muslims call upon the saints and Imams to be their means to Allāh. This isn’t polytheism since both Sunni and Shī`ah Muslims agree on this since the time of the Prophet (peace be upon him) until our very day. Except for Wahhābis, they are the Saudi scholars I’ve mentioned who opposed the consensus of Muslims with this belief and accused them of disbelief thus permitting the spilling of their blood.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Ibn Taymiyyah said: “Those who call upon prophets and righteous men, after their death, near their graves or anywhere else are from the polytheists who call upon other than Allāh, such as those who call on the planets or worshiped prophets and angels. Allāh most High says: {It belongs not to any mortal that God should give him the Book, the Judgment, the Prophethood, then he should say to men, &#8216;Be you servants to me apart from God.&#8217; Rather, &#8216;Be you masters in that you know the Book, and in that you study.&#8217; He would never order you to take the angels and the Prophets as Lords; what, would He order you to disbelieve, after you have surrendered?} [3:79-80]<\/p>\n<p style=\"text-align: justify;\">And He says: {Say: &#8216;Call on those you asserted apart from Him; they have no power to remove affliction from you, or to transfer it. Those they call upon are themselves seeking the means to come to their Lord, which of them shall be nearer; they hope for His mercy, and fear His chastisement. Surely thy Lord&#8217;s chastisement is a thing to beware of.} [17:56-57]<\/p>\n<p style=\"text-align: justify;\">And He says: {Belongs not sincere religion to God? And those who take protectors, apart from Him &#8212; &#8216;We only serve them that they may bring us nigh in nearness to God&#8217; &#8212; surely God shall judge between them touching that whereon they are at variance. Surely God guides not him who is a liar, unthankful.} [39:3]<\/p>\n<p style=\"text-align: justify;\">And He says: {Say: &#8216;Call on those you have asserted apart from God; they possess not so much as the weight of an ant in the heavens nor in the earth; they have no partnership in either of them, nor has He in them any supporter.&#8217; Intercession will not avail with Him save for him to whom He gives leave} [34:22-23]<\/p>\n<p style=\"text-align: justify;\">And he says: {They serve, apart from God, what hurts them not neither profits them, and they say, &#8216;These are our intercessors with God.&#8217; Say: &#8216;Will you tell God what He knows not either in the heavens or in the earth?&#8217; Glory be to Him! High be He exalted above that they associate!} [10:18]<\/p>\n<p style=\"text-align: justify;\">The question is: What is the difference between their actions and those of pagans!?<\/p>\n<p style=\"text-align: justify;\">Verses like these are numerous in the Qur’ān. It prohibits calling upon other than Allāh, even angels and prophets or anybody else. That is polytheism as opposed to what you may ask them during their life from supplication and intercession.<a href=\"#_ftn58\" name=\"_ftnref58\">[58]<\/a><\/p>\n<p style=\"text-align: justify;\">This is what our pious predecessors, the Companions and followers and those who followed them were upon.<\/p>\n<p style=\"text-align: justify;\">Is what al-Ṣadr and Tijani said truth or falsehood and lies, that nobody except Wahhābis say this!?<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><u>17- Tijani wrote pg.68 [Then I was Guided \/ A Meeting with Al Sayyid Muhammad Baqir al Sadr]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Sadr said: They (i.e Wahhābi authorities) beat the elderly pilgrims to Allāh’s sacred house simply for saying: “Peace be upon you O’ Messenger of Allāh.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie. All of us say “Peace be upon you O’ Messenger of Allāh,” and nobody beat us for it. In fact, nobody beats up the Shī`ah who are committed to this Sunnah and they know this full well, so why resort to such lies!?<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><u>18- He wrote on pg.68 [Then I was Guided \/ A Meeting with Al Sayyid Muhammad Baqir al Sadr]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Sharaf-ul-Dīn is a Shī`ah scholar who traveled on pilgrimage to Allāh’s sacred house in the time of `Abdul-`Azīz Aal-Sa`ūd. He was from among the scholars invited to the royal castle to be congratulated on the occasion of `Īd-ul-Adhā as was the habit. When his turn arrived he shook the king’s hand and offered him a gift. It was a Qur’ān wrapped with leather so the king took it, he kissed it and placed it on his forehead to show it due honor and respect.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Sayyed Sharaf-ul-Dīn then told him: “O’ King, why do you honor this goat’s leather?”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The king responded: “I meant to glorify the Qur’ān that’s inside it, not the leather.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Sayyed Sharaf-ul-Dīn said: “Well done O’ King. We do the same when we kiss the windows of the prophetic grave and its door. We know it is metal that does not harm or benefit but we seek the one beyond the wood and metal. We seek to honor the Messenger of Allāh just as you intend to honor Allāh’s book by kissing the goat’s leather.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Those who were present praised Allāh and were impressed, they told him: “You speak truth!”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The king back at the time had to permit all pilgrims to seek blessings from the prophetic relics until the next king ascended the throne and returned things to the way they were before.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The tale is invented.<\/p>\n<p style=\"text-align: justify;\">What is fascinating about these stories is that they never appear until after the death of the people who supposedly witnessed them, such as this story or that of Mun`im with Aḥmad Amīn in section 4. Similarly is the book of al-Murāja`āt, which was a series of letters between Shaykh-ul-Azhar Salīm al-Bishrī and the Shī`ah Sharaf-ul-Dīn al-Mūsawī, and many other stories.<\/p>\n<p style=\"text-align: justify;\">If we are to say that kissing the Qur’ān is permissible, then this is an analogy with discrepancy. Since honoring the book containing Allāh’s words – which are one of His attributes – does not lead to anything other than glorifying Allāh. We do not fear that the one who does so will fall into polytheism as a result. As opposed to glorifying the grave of the Prophet (peace be upon him), which would lead to glorifying the Prophet (peace be upon him) and giving him some of the Lord’s attributes.<\/p>\n<p style=\"text-align: justify;\">Secondly, glorifying the Prophet’s (peace be upon him) grave and turning it into a place of worship and regular visitation has been prohibited in several narrations so we cannot utilize our independent reasoning while there is clear-cut textual evidence, such as:<\/p>\n<p style=\"text-align: justify;\">The Prophet (peace be upon him) said: “Those (nations) before you used to take their prophets’ graves and those of their righteous as places of worship, so do not turn graves into houses of worship, I forbid you from such.” This was narrated by Muslim. <a href=\"#_ftn59\" name=\"_ftnref59\">[59]<\/a><\/p>\n<p style=\"text-align: justify;\">The Shī`ah have become victims of many polytheistic rituals, such as calling the dead, circulating around graves, fearing them more than fearing Allāh and many other practices.<\/p>\n<p style=\"text-align: justify;\">The best example of this is the book “al-Qasas-ul-`Ajībah” by their scholar `Abdul-Ḥusayn Dastaghīb, one of their top Shī`ah scholars these days, wherein he mentions how they seek the graves leaving aside Allāh.<\/p>\n<p style=\"text-align: justify;\"><u>19- Tijani wrote pg.73 [Then I was Guided \/ Skepticism and Perplexity]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>We (i.e Ahlul-Sunnah) celebrate the day of `Ashurā’ as an Islamic holiday where charity is offered and all kinds of fancy foods are cooked while kids run after adults to receive money for toys and sweets.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This shows that Tijani doesn’t know the first thing about the beliefs of Ahlul-Sunnah. He simply moved from the innovation of Tasawwuf to that of Tashayyu` whereas Allāh’s religion is the middle path, neither lenient nor extreme.<\/p>\n<p style=\"text-align: justify;\">None of the scholars of Ahlul-Sunnah said that `Ashurā’ was an Islamic holyday for celebration, our `Id is only on two occasions, al-Adha and al-Fitr. As for `Ashurā’, it is a day for fasting as was the way of our Prophet (peace be upon him). It is the day where Allāh saved Mūsa (as) and so the tradition is to fast not feast as the Shī`ah know, especially those living among Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">Regardless, Shī`ah scholars like Abū Ja`far al-Tūsī<a href=\"#_ftn60\" name=\"_ftnref60\">[60]<\/a> and Muḥammad bin al-Ḥasan al-Ḥurr al-`Amilī<a href=\"#_ftn61\" name=\"_ftnref61\">[61]<\/a> have narrated in their own books three narrations about the virtues of fasting `Ashurā’.<\/p>\n<p style=\"text-align: justify;\">The first: From Abī `Abdillah, from his father, that `Alī said: “Fast `Ashurā’, the ninth and tenth, for it erases the sins of a year.”<\/p>\n<p style=\"text-align: justify;\">The second: From Abī al-Ḥasan: “The Messenger of Allāh (peace be upon him) fasted the day of `Ashurā’.”<\/p>\n<p style=\"text-align: justify;\">The third: From Ja`far, from his father: “The fasting of `Ashurā’ is atonement for a year’s (sins).”<\/p>\n<p style=\"text-align: justify;\"><u>20- He wrote on pg.74 [Then I was Guided \/ Skepticism and Perplexity]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Our scholars do not issue Fatwa or speak except to please the authorities that guarantee their livelihood, the same authorities that appoint and remove whomever they wish.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani speaks the truth this time because Sufi scholars – assuming they have scholars – only say what pleases their governments. If Tijani means the scholars of Ahlul-Sunnah in general then he has lied and this isn’t odd from his behavior. For the sake of brevity we repeat what Allāh says {Say: &#8216;Produce your proof, if you speak truly.&#8217;} [2:111]<\/p>\n<p style=\"text-align: justify;\">As an example, return to the stories of Imam al-Zuhrī with Caliph Hishām bin `Abdul-Malik<a href=\"#_ftn62\" name=\"_ftnref62\">[62]<\/a>, that of Imam Mālik with Abū Ja`far al-Mansūr<a href=\"#_ftn63\" name=\"_ftnref63\">[63]<\/a>, that of al-`Izz bin `Abdul-Salām with the Mamlukes<a href=\"#_ftn64\" name=\"_ftnref64\">[64]<\/a>, that of Ibn Taymiyyah with al-Nāsir Qalawun and Baybars al-Jāshinkīr<a href=\"#_ftn65\" name=\"_ftnref65\">[65]<\/a>, that of Al-Imam al-Awzā`ī with `Abdullāh bin `Ali<a href=\"#_ftn66\" name=\"_ftnref66\">[66]<\/a>, that of Ibn Abī Dhi’b with Abī Ja`far al-Mansūr<a href=\"#_ftn67\" name=\"_ftnref67\">[67]<\/a>, that of Aḥmad bin Ḥanbal with al-Mu`tasim<a href=\"#_ftn68\" name=\"_ftnref68\">[68]<\/a> and many others.<\/p>\n<p style=\"text-align: justify;\">Then look at our contemporary scholars for they are the furthest people away from hypocrisy. Rather hypocrisy and Taqiyyah are from the traits of the Shī`ah. As for the people of Sunnah, they do not worship Allāh through Taqiyyah like the Shī`ah scholars do even with their followers.<\/p>\n<p style=\"text-align: justify;\"><u>21- He writes on pg.75 [Then I was Guided \/ Skepticism and Perplexity]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The messenger of Allāh said: “Search for your religion until you are labeled a fool.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">He attributed this to Ṣaḥīḥ al-Bukhārī in the footnotes.<\/p>\n<p style=\"text-align: justify;\">This is an ignorant lie as neither Bukhārī nor any of the authors of the six books have reported such a thing. In fact this isn’t found in any of the Ḥadīth books of Ahlul-Sunnah, so whoever finds it, please point us to it, if not, then cry out to Tijani: “You lie!”<\/p>\n<p style=\"text-align: justify;\">This narration resembles the Sufi scholars who say: “Most dwellers of paradise are imbeciles.” This is why they’re known as the fanatics.<\/p>\n<p style=\"text-align: justify;\"><u>22- He wrote pg.78 [Then I was Guided \/ A Journey to Hijaz]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>There is heavy security (i.e near the prophetic-grave) composed of unmannerly soldiers who take turns in monitoring and guarding every door. In their hands are whips that are used to strike whoever moves near the room or tries to look inside.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Madīnah is present, the Masjid is present, the grave is present and this wasn’t too long ago. Whatever Tijani has claimed is a lie for every Sunni and Shī`ī knows it. It would have been even better if he had said: “They are fully armed, killing many of those who greet the Messenger of Allāh (peace be upon him).”<\/p>\n<p style=\"text-align: justify;\">Glory be to Allāh: Nobody from the creations saw those whips except Tijani!?<\/p>\n<p style=\"text-align: justify;\">The biggest calamity is that this man still finds those who believe him, even though he did not witness any of these things, except in the books of the Shī`a.<\/p>\n<p style=\"text-align: justify;\"><u>23- He wrote pg.78 [Then I was Guided \/ A Journey to Hijaz]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>This resembles what one of the trusted and virtuous told us, when he said: “We used to circulate around the house when a young man had a stomach ache and threw up. The soldiers guarding the black-stone beat him up and kicked him out while in a terrible state. They accused him of bringing worth impurity to dirty the Ka`bah and they testified against him, so he was executed on that same day.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani summarized the tale, since after the execution, the young man was hung from the Ka`bah for three days and three nights. All regional and international news outlets reported on it. It was the headline of every newspaper and was broadcast through satellite. Although for some reason nobody saw or heard of it except Tijani and this person whom Tijani trusts.<\/p>\n<p style=\"text-align: justify;\"><u>24- He wrote on pg.83 [Then I was Guided \/ A Journey to Hijaz]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I visited al-Baqī ` graveyard and I stood requesting mercy for the souls of Ahlul-Bayt. Next to me, an elderly man cried and I noticed from his crying that he was a Shī`ah.<a href=\"#_ftn69\" name=\"_ftnref69\"><strong>[69]<\/strong><\/a><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>He faced the Qiblah and began praying, so a soldier dashed towards him, as if he had been monitoring his movements, and he kicked him with his boot while in prostration, flipping him on his back. The poor man remained unconscious for a couple of minutes while the soldier began beating on him and cursing. My heart felt soar for that elderly man, and I thought he had died, so my curiousity and enthusiasm got the best of me as I said to the soldier, &#8220;You must not do that! Why did you beat him while he was praying?&#8221; He rebuked me and said, &#8220;You be quiet and do not interfere, or else I will do to you what I have just done to him!&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I said: What is strange in this story and what is unbelievable is how it ended, because the habit of Tijani’s stories is that the man would be arrested and executed.<\/p>\n<p style=\"text-align: justify;\">I add, how did Tijani not rebuke this old man for turning his backside towards the graves in his prayer?<\/p>\n<p style=\"text-align: justify;\">Shī`ah scholar al-Majlisī said: “The sixth action is two prostrations that must be done in the name of the visit upon completion. If it were a visit to the Prophet (peace be upon him), then he does this in al-Rawdah, but if it were a visit to the Imams, then he does this near the head. He may also perform it in the mosque of that grave. It is permitted, as has been narrated, that praying both prostrations towards the grave even if he turned his backside towards the Qiblah.”<a href=\"#_ftn70\" name=\"_ftnref70\">[70]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>25- Tijani wrote on pg.91 [Then I was Guided \/ The Companions of the Prophet as seen by the Shi’a and the Sunnis]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>They authored in this field (i.e life of Companions) many books such as Usd-ul-Ghābah fi Tamyīz al-Sahābah, Al-Isābah fī Ma`rifat-ul-Sahābah, Mīzān-ul-I`tidāl and other books that discussed the lives of the Companions which contained analysis and criticisms.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Let’s go back to the words of Tijani in section 1.<\/p>\n<p style=\"text-align: justify;\">Just to see what kind of knowledge this man enjoys, he said that he has impressed the scholars of al-Azhar… then we re-read what he wrote on this page.<\/p>\n<p style=\"text-align: justify;\">Tijani didn’t not get a single name from the above correct. The correct names are as follows: Usd-ul-Ghābah fi Ma`rifat-ul-Sahābah, al-Isābah fī Tamyīz-ul-Sahābah. As for Mīzān-ul-I`tidāl, it is a book by Imam al-Dhahabī and he wrote in its intro: “As for the Companions, I did not mention them in this book due to their honorable position; the weakness in the reports came from those who narrated from them.”<a href=\"#_ftn71\" name=\"_ftnref71\">[71]<\/a><\/p>\n<p style=\"text-align: justify;\">This book al- Mīzān contains no mention of any Companion so how did it become a book written about the Companions with analysis and criticisms regarding their lives!? Glory be to the One who combined in you ignorance, lies and the claim of having knowledge.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><u>26- Tijani wrote on pg.93 [Then I Was Guided \/ The Companions of the Prophet as seen by the Shi’a and the Sunnis]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>And that every Muslim must love them as a reward for the Muḥammadan Message.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">He means: Loving the household as a reward for the Islamic message. While referencing this verse: {I ask of you no fee therefor, save lovingkindness among kinsfolk} [42:23]<\/p>\n<p style=\"text-align: justify;\">Shaykh-ul-Islam ibn Taymiyyah said: It has been established through authentic reports from Sa`īd bin Jubayr, that Ibn `Abbās was asked about the verse. Sa`īd answered: “To love the relatives of Muḥammad (peace be upon him).” So Ibn `Abbās said: “You were hasty. The Prophet (peace be upon him) had relations with all branches of Quraysh so he told them: I do not ask you for a wage except to treat me with love and kindness due to the close relations between us.”<a href=\"#_ftn72\" name=\"_ftnref72\">[72]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Taymiyyah further said: “What points to this is that He never said “loving kindness <strong>for<\/strong> the kinsfolk,” as in this other verse: {Whatever ye take as spoils of war, lo! A fifth thereof is for Allāh, and for the messenger and for the kinsman} [8:41] This shows that the Prophet (peace be upon him) never asked for any wage to begin with but his reward is with Allāh. This is what his brothers, the other prophets said and he was the best of them.”<a href=\"#_ftn73\" name=\"_ftnref73\">[73]<\/a><\/p>\n<p style=\"text-align: justify;\">Prophet Nuh (peace be upon him) said: {I ask of you no wage for this; my wage falls only upon the Lord of all Being} [26:109]<\/p>\n<p style=\"text-align: justify;\">Prophet Hud (peace be upon him) said: {I ask of you no wage for this; my wage falls only upon the Lord of all Being} [26:127]<\/p>\n<p style=\"text-align: justify;\">Prophet Salih (peace be upon him) said: {I ask of you no wage for this; my wage falls only upon the Lord of all Being} [26:145]<\/p>\n<p style=\"text-align: justify;\">Prophet Lut (peace be upon him) said: {I ask of you no wage for this; my wage falls only upon the Lord of all Being} [26:164]<\/p>\n<p style=\"text-align: justify;\">Prophet Shu`ayb (peace be upon him) said: {I ask of you no wage for this; my wage falls only upon the Lord of all Being} [26:180]<\/p>\n<p style=\"text-align: justify;\">As for all Qur’ānic instructions on how to treat the kinsmen of the Prophet (peace be upon him) and of any person, they say: for the kinsfolk, and not: among the kinsfolk. Since the Prophet (peace be upon him) never asks for any wage for his message, but rather, his wage is from Allāh.<\/p>\n<p style=\"text-align: justify;\">{Say: &#8216;I ask of you no wage for it, neither am I of those who take things upon themselves’.} [38:86]<\/p>\n<p style=\"text-align: justify;\">{Say: &#8216;I have asked no wage of you; that shall be yours. My wage falls only upon God’} [34:47]<\/p>\n<p style=\"text-align: justify;\">{Thou askest of them no wage for it; it is nothing but a reminder unto all beings} [12:104]<\/p>\n<p style=\"text-align: justify;\">With the exception in Ayat-ul-Shūra:<\/p>\n<p style=\"text-align: justify;\">{Say: &#8216;I do not ask of you a wage for this, except for him who wishes to take to his Lord a way.&#8217;} [25:57]<\/p>\n<p style=\"text-align: justify;\">As for their love, it isn’t a wage for the message, rather it is a divine order.<\/p>\n<p style=\"text-align: justify;\"><u>27- On pg.95 [Then I Was Guided \/ The Companions and the Peace Treaty of al Hudaibiyah]: <\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Companions never obeyed the Prophet (peace be upon him) when he said: &#8220;Go and slaughter (the sacrifices) and shave your heads.&#8221; By Allāh, not one man stood.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Tijani then mentions the story of `Umar when he told the Prophet (peace be upon him): “Are we not upon truth and our enemies upon falsehood!?” …until the end of that story.<\/p>\n<p style=\"text-align: justify;\">I say: We address this from three angles.<\/p>\n<p style=\"text-align: justify;\">Firstly: Their delay was not out of disobedience towards the Prophet (peace be upon him), but they only wished for him to change his opinion and enter Makkah or that a revelation would descend from Allāh, for the Prophet (peace be upon him) had promised them to enter the sacred mosque.<\/p>\n<p style=\"text-align: justify;\">Secondly: During that same truce, the Prophet (peace be upon him) ordered `Alī ibn Abī Ṭālib to erase his name but `Alī refused. Ahlul-Sunnah never criticized `Alī for disobedience. Refer to section 47 of this book.<\/p>\n<p style=\"text-align: justify;\">Thirdly: We ask, why did the Companions shave and slaughter after they saw the Messenger (peace be upon him) doing so without even giving the order? Similarly, we also say: `Alī, just like the rest of the Companions, did not shave or slaughter, but do you condemn him for it?<\/p>\n<p style=\"text-align: justify;\"><u>28- He wrote on pg.103 [Then I Was Guided \/ The Companions in the Military Detachment under Usamah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The story in brief, is that the Messenger (peace be upon him) prepared an army to invade the Romans, two days before his death. He (peace be upon him) appointed Usamah as chief Usāmah bin Zayd who was an eighteen year old. He (peace be upon him) also placed the heads of the Muhājirūn and Ansār such as Abū Bakr, `Umar, Abū `Ubaydah and others in the army.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: His master Sharaf-ul-Dīn al-Mūsawī beat him to this lie in “al-Murāja`āt” when he claimed that Abū Bakr and `Umar were a part of this army by consensus of traditionalists.<a href=\"#_ftn74\" name=\"_ftnref74\">[74]<\/a><\/p>\n<p style=\"text-align: justify;\">Both Tijani and al-Mūsawī are openly lying. Praise be to God, the books of the traditionalists are available and so are the history books. So where was this consensus mentioned and by whom?<\/p>\n<p style=\"text-align: justify;\">What is known is that `Umar was in Usāmah’s army while Abū Bakr was the leader of prayer.<\/p>\n<p style=\"text-align: justify;\"><u>29- He wrote pg.98 [Then I Was Guided \/ The Companions and the Raziyat Yawm al Khamis (The Calamity of Thursday)]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Ibn `Abbās said: Thursday, and what a Thursday that was! The Messenger&#8217;s pain became very severe, and he said, &#8220;Come here, I will write you a document which will prevent you from straying from the right path.&#8221; But `Umar said that the Prophet was under the spell of the pain, and that they had the Qur’ān, which was sufficient, being the Book of Allāh. The people at the house then differed and quarreled amongst themselves, some of them said they should prepare the document so that the Prophet could write so they wouldn’t stay, while others supported `Umar&#8217;s view. When the debate became heated and the noise became louder, the Messenger of Allāh said to them, &#8220;Leave me alone.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The Shī`ah attempt to turn this story into a dangerous matter, to attack the Companions of the Prophet (peace be upon him), and they saw that this story is suitable.<\/p>\n<p style=\"text-align: justify;\">Their points are as follows:<\/p>\n<ol style=\"text-align: justify;\">\n<li>Why didn’t the Companions obey the order of the Prophet (peace be upon him)?<\/li>\n<li>The Prophet (peace be upon him) intended to write a will for `Alī.<\/li>\n<li>This document can cause the deviance or guidance of the entire Nation.<\/li>\n<li>The Companions succeeded in preventing the Prophet (peace be upon him) from writing it.<\/li>\n<li>The Prophet (peace be upon him) became angry because the Companions didn’t obey.<\/li>\n<li>`Umar accused the Prophet (peace be upon him) of being delusional.<a href=\"#_ftn75\" name=\"_ftnref75\">[75]<\/a><\/li>\n<\/ol>\n<p style=\"text-align: justify;\">To refute these doubts we begin by seeking Allāh’s aid:<\/p>\n<p style=\"text-align: justify;\">Answer (1): The Companions never responded to the request of the Prophet (peace be upon him) out of compassion, while seeing him in such a painful state. We ask the Shī`ah, is this book a part of the message that the Prophet (peace be upon him) was ordered to deliver or not?<\/p>\n<p style=\"text-align: justify;\">If yes, then he had to deliver it, but still never did so. This constitutes an attack on the Prophet (peace be upon him) and a rejection of Allāh’s words: {Today I have completed your religion for you.} [5:3]<\/p>\n<p style=\"text-align: justify;\">We can also ask them another question: Where was `Alī ibn Abī Ṭālib on this event, was he present or not? Why didn’t he take the initiative and write the book?<\/p>\n<p style=\"text-align: justify;\">This is because Imam Aḥmad reported in his Musnad, that `Alī ibn Abī Ṭālib said: “The Prophet (peace be upon him) ordered me to bring him a tablet so he may write for the Nation a thing that will prevent their misguidance after him. I feared he may pass away while I did that, so I said: I can memorize, I am aware. He said: He willed for us to guard the prayer, offer charity and to properly treat what our right hand possesses.” Aḥmad Shākir said “The chain is good”.<a href=\"#_ftn76\" name=\"_ftnref76\">[76]<\/a><\/p>\n<p style=\"text-align: justify;\">So `Alī was the one ordered to write, why then didn’t he obey and write!?<\/p>\n<p style=\"text-align: justify;\">Answer (2): They said the Prophet (peace be upon him) wished to write a will for `Alī’s appointment! This is false as proven by what the Prophet (peace be upon him) dictated above.<\/p>\n<p style=\"text-align: justify;\">Answer (3): The narration does not declare that the Prophet (peace be upon him) never delivered the message. `Alī’s ḥadīth shows that he did announce what he wished to have written.<\/p>\n<p style=\"text-align: justify;\">Answer (4): Regarding the Companions’ success in preventing the Prophet (peace be upon him), we say that wasn’t their intention as the Prophet (peace be upon him) didn’t write it down but he just said it verbally.<\/p>\n<p style=\"text-align: justify;\">Answer (5): The anger of the Prophet (peace be upon him) resembles his words to `Alī in Hudaybiyyah, “Erase it O `Ali!” but `Alī refused until the Prophet (peace be upon him) took it and erased it with his hand.<\/p>\n<p style=\"text-align: justify;\">Answer (6): As for `Umar accusing the Prophet (peace be upon him) of being delusional, this is a lie and this wasn’t uttered by `Umar. This statement: “Is he delusional?” was uttered by certain folks who witnessed the event. The authentic report in the two Ṣaḥīḥs –as quoted by the author – states the following: “They said: What is wrong with him? Is he delusional?”<a href=\"#_ftn77\" name=\"_ftnref77\">[77]<\/a> In plural tense, not singular, and that’s why some scholars dismissed that it be from the words of `Umar.<\/p>\n<p style=\"text-align: justify;\">Imam Ibn Ḥajar says: “It appears to me that the nearest possibility to truth is the third one by al-Qurtubī. Those who said it must be from those who recently entered Islam, since it was known that whoever is in great pain would be burdened by it instead of being able to explain what he wishes.”<a href=\"#_ftn78\" name=\"_ftnref78\">[78]<\/a><\/p>\n<p style=\"text-align: justify;\">Shaykh al-Dihlawī said: “Where would they prove that the one who uttered those words is `Umar, when most narrations contain ‘they said’ in plural?”<a href=\"#_ftn79\" name=\"_ftnref79\">[79]<\/a><\/p>\n<p style=\"text-align: justify;\">This was also the opinion of al-Suwaydī who mentioned that a group of the late traditionalists including Ibn Ḥajar declared this.<\/p>\n<p style=\"text-align: justify;\">What these scholars declared is also what’s apparent from al-Nawawī’s words, when he says as he comments: “This is what’s intended by their words ‘Is he delusional?’ and `Umar’s words ‘He is overcome by pain’” So he differentiated between the two.<\/p>\n<p style=\"text-align: justify;\">This proves Tijani’s slander when attributing those words to `Umar without evidence. Rather, the apparent evidence opposes his claim although this isn’t a legitimate criticism towards `Umar even if established. This is also not a legitimate criticism towards those other Companions who actually said it since the text does not imply what the author claims, and this can be explained in angles.<\/p>\n<p style=\"text-align: justify;\">The first angle: What is authentic and established is that this expression was said in the context of a question: “Is he delusional?” as opposed to what some reports contained: “He is delusional”. The author held on to the second version although the expert researchers authenticated the first version such as al-Qadī `Iyādh<a href=\"#_ftn80\" name=\"_ftnref80\">[80]<\/a>, al-Qurtubī<a href=\"#_ftn81\" name=\"_ftnref81\">[81]<\/a>, al-Nawawī<a href=\"#_ftn82\" name=\"_ftnref82\">[82]<\/a> and Ibn Ḥajar.<a href=\"#_ftn83\" name=\"_ftnref83\">[83]<\/a><\/p>\n<p style=\"text-align: justify;\">They stated that this was a rhetorical question to show disapproval towards those who said: “Don’t write.”<\/p>\n<p style=\"text-align: justify;\">After mentioning the Prophet’s (peace be upon him) infallibility when it comes to transmitting the message in all of his conditions, al-Qurtubī said that this was established among the Companions. This is why it’s not possible that their statement: “Is he delusional?” was due to them doubting his words during sickness. Rather it was only uttered by some as an objection towards the ones who were reluctant in bringing the writing material, as if to tell them: “Why did you stop? Do you think he is delusional? If not, then bring forth the writing material for he (peace be upon him) only speaks the truth!” This is the best way to interpret this.<a href=\"#_ftn84\" name=\"_ftnref84\">[84]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: This shows the agreement among the Companions on the impossibility of the Prophet (peace be upon him) ever being delusional. This is because those who said it, used it as an argument to compel their opponents and therefore Tijani’s claim crumbles.<\/p>\n<p style=\"text-align: justify;\">Second way: It is possible that this expression was uttered by them when they were in a state of shock and confusion during that great calamity. A similar thing happened to `Umar and others upon the death of the Prophet (peace be upon him) as al-Qurtubī said.<a href=\"#_ftn85\" name=\"_ftnref85\">[85]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: In this sense, those who uttered it are excused since men aren’t taken into account if they are in a state of mental blackout or when the brain shuts down. This can happen in cases of extreme sadness or extreme happiness such as the story of a man who lost his mount then found it after losing hope so he said: “O Lord, you are my slave, and I am your Lord!” He erred due to his great joy.<a href=\"#_ftn86\" name=\"_ftnref86\">[86]<\/a><\/p>\n<p style=\"text-align: justify;\">Third way: These words were issued in the presence of the Messenger of Allāh (peace be upon him) and senior Companions, but they never rebuked those who said it, so this shows that they’re excused either way.<\/p>\n<p style=\"text-align: justify;\">As for what he claimed about `Umar opposing the Messenger (peace be upon him) when he said: “You have Allāh’s Book, it is sufficient for us,” and that he never obeyed the order pertaining to that document.<\/p>\n<p style=\"text-align: justify;\">We respond: None of `Umar’s words show any opposition to the Prophet (peace be upon him) as Tijani misunderstood. This is shown in different ways below.<\/p>\n<p style=\"text-align: justify;\">The first angle: It appeared to `Umar and those of his opinion from among the Companions, that the Messenger’s (peace be upon him) request was not an obligatory order, rather it was out of guidance to what is best, as was explained by al-Qadī `Iyād, al-Qurtubī, al-Nawawī and Ibn Ḥajar.<a href=\"#_ftn87\" name=\"_ftnref87\">[87]<\/a><\/p>\n<p style=\"text-align: justify;\">Then later, `Umar’s opinion proved to be the best, because the Prophet (peace be upon him) himself decided to abandon writing that document. If it were obligatory, then he wouldn’t do that, even if they differed as that was his way.<a href=\"#_ftn88\" name=\"_ftnref88\">[88]<\/a><\/p>\n<p style=\"text-align: justify;\">The second angle: `Umar’s words “The Book of Allāh is sufficient for us,” was a reply to those who differed with him, not a response to the Prophet’s (peace be upon him) order. This is apparent as he says “You (in plural) have Allāh’s Book,” when addressing that group who opposed him.<a href=\"#_ftn89\" name=\"_ftnref89\">[89]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>30- Tijani said on pg.117 [Then I Was Guided \/ The Opinion of the Quran regarding the Companions]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Allāh’s saying {God has promised those that believe, and do deeds of righteousness from them; they shall have; forgiveness and a mighty wage.} [5:9] (Allāh’s words: “From them,” shows that some of them will not be included in God’s forgiveness and reward. It also shows that some Companions are not described as being believers or having righteous deeds.)<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Maybe Tijani didn’t learn enough from the children of Najaf and was hasty in his interpretation of Allāh’s book. Maybe he should learn more from them before he presents his arguments to the scholars of al-Azhar whom he claims are ignorant men.<\/p>\n<p style=\"text-align: justify;\">Tijani’s statement here can mean only one of two bitter things.<\/p>\n<p style=\"text-align: justify;\">Either he’s a liar for claiming that “from” (من) is of a partitionary function, or he is an ignorant in the Arabic tongue, for he has described himself as being ignorant compared to the children of Najaf.<\/p>\n<p style=\"text-align: justify;\">In brief, the word “from” in the verse is of an explanatory function not a partitionary one.<\/p>\n<p style=\"text-align: justify;\">Imam al-Qurtubī said: “The word ‘From’ in His saying: {From them}, does not play the role of a practitioner between two groups of Companions. Rather it has a general function such as Allāh’s words {So shun the filth from the idols} [22:30].”<a href=\"#_ftn90\" name=\"_ftnref90\">[90]<\/a><\/p>\n<p style=\"text-align: justify;\">In addition, the word “from” can also have an affirmative role such as: {And We reveal from the Qur’ān that which is a healing}, [17:82] even though all the Qur’ān is healing, unless Tijani believes what his master al-Nūrī al-Ṭabrasī believes, that the Qur’ān contains silly verses<a href=\"#_ftn91\" name=\"_ftnref91\">[91]<\/a> – may Allāh curse whoever says this without repenting.<\/p>\n<p style=\"text-align: justify;\">Imam al-Nasafī said: “The ‘from’ in His saying: {From them}, is explanatory just as His saying: {So shun the filth from the idols} [22:30]”<a href=\"#_ftn92\" name=\"_ftnref92\">[92]<\/a><\/p>\n<p style=\"text-align: justify;\">Is the great Tijani now going to tell us that Allāh ordered us to shun only some of the idols?<\/p>\n<p style=\"text-align: justify;\">Imam Ibn al-Jawzī said: Al-Zajjāj said there are two opinions regarding: {From}. The first is what describes their kind such as: {So shun the filth from the idols}. Ibn al-Anbārī said: The verse means that Allāh promised the believers of this kind, who were the Companions. The second, is that it is a promise for those of them that remain upon faith and righteous deeds.<a href=\"#_ftn93\" name=\"_ftnref93\">[93]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Kathīr said: {From} is to describe their kind.<a href=\"#_ftn94\" name=\"_ftnref94\">[94]<\/a><\/p>\n<p style=\"text-align: justify;\">Maḥmūd Ṣafī said: {From} to describe the kind.<\/p>\n<p style=\"text-align: justify;\">‘From’ comes to explain the kind and often times it comes after: ‘Whatever’ (ما) and ‘Whatsoever’ (مهما) as they have a greater claim to it due to their vagueness. Like such {Whatever Allāh grants to people from mercy &#8211; none can withhold it} [35:2] and {For whatever we abrogate from verse.} [2:106]<\/p>\n<p style=\"text-align: justify;\">Other examples of it coming after the others, is {They will be adorned therein with bracelets from gold} [18:31].<\/p>\n<p style=\"text-align: justify;\">In Ibn al-Anbārī’s book, it is written that some heretics held on to the word “from” in the verse, in order to attack certain Companions since they thought: {From them}, is partitionary, although it is explanatory as in: “Those who believed are these folks”.<\/p>\n<p style=\"text-align: justify;\">Such as Allāh’s saying: {Those [believers] who responded to Allāh and the Messenger after injury had struck them. For those who did good from them and feared Allāh is a great reward} [3:172].<\/p>\n<p style=\"text-align: justify;\">And all were God-fearing Muslims.<\/p>\n<p style=\"text-align: justify;\">And Allāh’s saying: {And if they do not desist from what they are saying, there will surely afflict the disbelievers from among them a painful punishment.} [5:73].<a href=\"#_ftn95\" name=\"_ftnref95\">[95]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Zamakhsharī said: The meaning of: {From them}, is explanatory such as Allāh’s saying: {So shun the filth from the idols}.<\/p>\n<p style=\"text-align: justify;\">Abū al-Baqā’ al-`Ukbarī said: {From them}, is to clarify the kind, to give them preference by mentioning them specifically.<a href=\"#_ftn96\" name=\"_ftnref96\">[96]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Nisāburī said: His saying: {From them}, is to clarify the kind.<a href=\"#_ftn97\" name=\"_ftnref97\">[97]<\/a><\/p>\n<p style=\"text-align: justify;\">Moreover, his claim that “from” is partitionary makes the verse self-contradicting, since it was revealed for those who believed and did righteous deeds aside from anyone else.<\/p>\n<p style=\"text-align: justify;\">Allāh said: {Muḥammad is the Messenger of God, and those who are with him are hard against the unbelievers, merciful one to another. Thou seest them bowing, prostrating, seeking bounty from God and good pleasure. Their mark is on their faces, the trace of prostration. That is their likeness in the Torah, and their likeness in the Gospel: as a seed that puts forth its shoot, and strengthens it, and it grows stout and rises straight upon its stalk, pleasing the sowers, that through them He may enrage the unbelievers. God has promised those who believe and do deeds of righteousness from them forgiveness and a mighty wage.} [48:29]<\/p>\n<p style=\"text-align: justify;\">Contemplate on some of their qualities in the verse:<\/p>\n<p style=\"text-align: justify;\">a- Their love for the Messenger (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">b- Their harshness against the disbelievers.<\/p>\n<p style=\"text-align: justify;\">c- Their mercy between each-other.<\/p>\n<p style=\"text-align: justify;\">d- Their constant bowing, prostration and worship.<\/p>\n<p style=\"text-align: justify;\">e- They seek God’s bounty and pleasure.<\/p>\n<p style=\"text-align: justify;\">f- Allāh enrages the disbelievers by their mere mention.<\/p>\n<p style=\"text-align: justify;\"><u>31- Tijani said on pg.118 [Then I Was Guided \/ The Opinion of the Quran regarding the Companions]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Since they have accompanied the Messenger (peace be upon him) in his farewell pilgrimage and they’ve pledged allegiance to Imam `Alī at Ghadīr Khum after the Messenger (peace be upon him) had appointed him for successorship, just as Abū Bakr did.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">He also said on pg.165 [Then I Was Guided \/ The Reasons Behind the Enlightenment]:<\/p>\n<p style=\"text-align: justify;\"><strong>Abū Bakr and `Umar congratulated him, and this text is agreed upon by the Sunnah and the Shī`ah.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a false claim, for it hasn’t been established that any believer including Abū Bakr and `Umar have congratulated `Alī on that day, and this is because there was no reason to do so.<\/p>\n<p style=\"text-align: justify;\">If I had intended to refute this in my book, I would have presented the story of Ghadīr with the authentic chain and refuted his lies in detail. However, the purpose of this book is to present what these folks possess of lies and deceptions<a href=\"#_ftn98\" name=\"_ftnref98\">[98]<\/a>. His saying that the text is agreed upon is a pure lie that he directs upon Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">It is our right to ask two questions to Tijani and those who are upon his opinion:<\/p>\n<p style=\"text-align: justify;\">A- Who reported this agreement among of Ahlul-Sunnah?<\/p>\n<p style=\"text-align: justify;\">B- Where do we find this agreement?<\/p>\n<p style=\"text-align: justify;\">The narration that contains Abū Bakr and `Umar congratulating `Alī on the day of Ghadīr contains `Alī bin Zayd bin Jud`ān in its chain. He was the only person to exclusively narrate this addition aside from all others who narrated the story of Ghadīr. The narration itself is reported by Aḥmad in his Musnad.<a href=\"#_ftn99\" name=\"_ftnref99\">[99]<\/a><\/p>\n<p style=\"text-align: justify;\">This is what the expert scholars say regarding `Alī ibn Jud`ān.<\/p>\n<p style=\"text-align: justify;\">Hammād bin Zayd said: “He used to flip the chains.” Ibn Khuzaymah said: “I do not rely on him due to the weakness of his memorization.” Ibn `Uyaynah said: “He is weak.” Ibn Ma’īn said: “He is nothing.” Yaḥyā Al-Qattān said: “His narrations are to be avoided.” Aḥmad bin Ḥanbal said: “He is weak.” Yazīd bin Zuray` said: “He was a Rafidī.”<a href=\"#_ftn100\" name=\"_ftnref100\">[100]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>32- On pg. 125 Tijani said [Then I Was Guided \/ The Tradition about Following the Path of the Jews and Christians]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The messenger of Allāh (peace be upon him) cursed those who dropped out (from Usamah’s detachment) after he had enlisted them.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie. It was never established that the Messenger (peace be upon him) cursed those who left Usāmah’s army and the burden of proof is upon the claimant. Tijani himself says that he shall only use arguments that which are agreed upon and authentic.<\/p>\n<p style=\"text-align: justify;\"><u>33- On pg.134 Tijani said [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ Their Testimony that they Themselves have Changed the Tradition of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger (peace be upon him) said: “Whoever abuses `Alī has abused me, and whoever abused me has abused Allāh, and whosoever shall do this will be dropped in hell-fire on his nose.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This also is a lie upon the Messenger (peace be upon him). The narration isn’t correct nor established according to Ahlul-Sunnah. It was reported by al-Ḥākim<a href=\"#_ftn101\" name=\"_ftnref101\">[101]<\/a> and it contains three defects:<\/p>\n<p style=\"text-align: justify;\">a- Abū Isḥāq al-Sabī`ī: He did not declare hearing this narration and is a known Mudallis.<a href=\"#_ftn102\" name=\"_ftnref102\">[102]<\/a><\/p>\n<p style=\"text-align: justify;\">b- Muḥammad bin Sa`d al-`Awfī: Al-Khatīb and al-Dhahabī considered him weak, but al-Dāraqutnī said: “There is no harm in him”.<\/p>\n<p style=\"text-align: justify;\">c- Abū `Abdillah al-Jadalī: Reliable, but is a strict Shī`ah, and this narration supports his innovation.<a href=\"#_ftn103\" name=\"_ftnref103\">[103]<\/a><\/p>\n<p style=\"text-align: justify;\">It was established among the scholars that whenever an innovator relates a Ḥadīth that strengthens his innovation then it is rejected even if he was reliable. How then, after all this, can he claim this narration is acceptable for Ahlul-Sunnah?<\/p>\n<p style=\"text-align: justify;\"><u>34- Tijani wrote on pg.137[Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>History has recorded for him these words: “I wish I was my family&#8217;s sheep. They would fatten me as much as they desire. When I am as fat as I can be, they would be visited by their loved ones, and they would then roast a part of me and cut the other parts into pieces, then they would have eaten me, and lastly, they would have relieved me with their bowel evacuation, I wish I had been all that, rather than a human.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani here is talking about Abū Bakr al-Siddīq, but where is the chain of transmission for this? Who said this was established from the words of Abū Bakr?<\/p>\n<p style=\"text-align: justify;\">Did not Maryam say: {She said, &#8216;Would that I had died before this, and become a thing forgotten!&#8217;} [19:23]<\/p>\n<p style=\"text-align: justify;\">Didn’t the giant Shī`ah scholar al-Majlisī report in his main book that Salmān al-Farisī said: “I wish I were a sheep for my parents, they’d eat my meat and rip my leather, I wish this rather than having heard of hell-fire.”<\/p>\n<p style=\"text-align: justify;\">And Abū Dharr said: “I wish my mother was infertile and she never bore me so that I wouldn’t know the fire.”<\/p>\n<p style=\"text-align: justify;\">Al-Miqdād said: “I wish I were a bird in the empty desert, one that wouldn’t receive punishment or reward, one than hearing about the hell-fire.”<\/p>\n<p style=\"text-align: justify;\">And `Alī said: “I wish the beasts would have ripped my flesh, I wish my mother never bore me than having heard of the hell-fire.” `Alī then placed his hand on his head and cried: “O’ how long my journey is, O’ how little provisions I have in my journey to Judgement Day.”<a href=\"#_ftn104\" name=\"_ftnref104\">[104]<\/a><\/p>\n<p style=\"text-align: justify;\">If the above was established from the words of Abū Bakr, `Alī, Salmān, Abū Dharr and al-Miqdād it wouldn’t harm them, as it is in the context of fearing Allāh and feeling as if they could have done better.<\/p>\n<p style=\"text-align: justify;\"><u>35- Tijani wrote on pg.142 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Furthermore, the verse of purification is also an evidence for her infallibility, it was revealed regarding her, her husband and children, as `Ā’ishah testified. <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Then Tijani referred to Ṣaḥīḥ Muslim.<\/p>\n<p style=\"text-align: justify;\">I say: There’s deception in these words. He attempted to give the illusion that the verse was revealed for the sake of `Ali, Fātimah, Ḥasan and Ḥusayn, then pointed to Ṣaḥīḥ Muslim.<\/p>\n<p style=\"text-align: justify;\">There’s nothing in that narration proving that the verse was revealed for their sake. In Ṣaḥīḥ Muslim it only says that the Prophet (peace be upon him) recited that verse for them, not that it was specifically revealed for them.<a href=\"#_ftn105\" name=\"_ftnref105\">[105]<\/a><\/p>\n<p style=\"text-align: justify;\">Shaykh-ul-Islam Ibn Taymiyyah said: “The content of this narration is that the Prophet (peace be upon him) supplicated to Allāh for them so that He may remove from them Rijs and purify them. At best, this means that he (peace be upon him) supplicated so that Allāh would make them from the God-fearing ones who are purified from Rijs, it is the duty of every Muslim to avoid Rijs and every Muslim is ordered to be pure.<\/p>\n<p style=\"text-align: justify;\">The most High said: {God does not desire to make any impediment for you; but He desires to purify you, and that He may complete His blessing upon you; haply you will be thankful.} [5:6]<\/p>\n<p style=\"text-align: justify;\">And {Take of their wealth a freewill offering, to purify them and to cleanse them thereby, and pray for them} [9:103]<\/p>\n<p style=\"text-align: justify;\">And {God loves those who repent, and He loves those who cleanse themselves} [2:222]<\/p>\n<p style=\"text-align: justify;\">Therefore, at best we can say that this supplication is for them to do what they’re ordered and avoid what’s prohibited… The people of the cloak were ordered to avoid Rijs and purify themselves, so the Prophet (peace be upon him) asked Allāh to help them in fulfilling these orders so that they may not be deserving of reproach and punishment, but praise and reward instead.”<a href=\"#_ftn106\" name=\"_ftnref106\">[106]<\/a><\/p>\n<p style=\"text-align: justify;\">He also said: “Allāh most High’s saying {People of the House, God only desires to put away from you Rijs and to thoroughly purify you} [33:33]<\/p>\n<p style=\"text-align: justify;\">Is similar to His saying: {God does not desire to make any impediment for you; but He desires to purify you} [5:6]<\/p>\n<p style=\"text-align: justify;\">And {God desires to make clear to you, and to guide you in the institutions of those before you, and to turn towards you; God is All-knowing, All-wise; and God desires to turn towards you, but those who follow their lusts desire you to swerve away mightily} [4:26-27]<\/p>\n<p style=\"text-align: justify;\">And {God desires ease for you, and desires not hardship for you}. [2:185]<\/p>\n<p style=\"text-align: justify;\">Allāh’s Will in these verses includes His love of the matters He wished and that He legislated it for the believers. This does not mean that He created the matter He wished or decreed it must happen. Nor does it mean that this matter is inevitable and the evidence is that the Prophet (peace be upon him) even after the verse of purification was revealed, he (peace be upon him) still went and supplicated: “O Lord, these are my household, remove from them Rijs and purify them thoroughly.” He asked Allāh to remove uncleanliness and to cleanse them. If this verse was simply telling us that Allāh had removed from them the Rijs and purified them, then the Prophet (peace be upon him) did not need to call and ask for this.<\/p>\n<p style=\"text-align: justify;\">Furthermore, the Shī`ah are rejecters of predestination, so how can they use such a verse when according to them Allāh’s Will is not always fulfilled, and they distinguish between His legislative Will and the Will of destiny.”<a href=\"#_ftn107\" name=\"_ftnref107\">[107]<\/a><\/p>\n<p style=\"text-align: justify;\">He also adds: “The household are not only `Alī, Fātimah, Ḥasan and Ḥusayn in both Sunni and Shī`ah beliefs. Shī`ah include Ḥusayn’s children, especially the Imams, even they they were never in a cloak, while they exclude al-Ḥasan’s children. In fact, they don’t even view that all of Ḥusayn’s children are purified, read what they say about Ja`far bin `Alī bin Muḥammad, the brother of al-Ḥasan al-`Askari.<a href=\"#_ftn108\" name=\"_ftnref108\">[108]<\/a><\/p>\n<p style=\"text-align: justify;\">As for the people of Sunnah, `Ali, Fātimah, Ḥasan and Ḥusayn are from the household as evidenced by the narration of the cloak. The wives are also from the household as evidenced by the verse of purification. The families of `Aqīl, Ja`far and `Abbās are all from the household as evidenced by the report of Zayd bin Arqam in Ṣaḥīḥ Muslim.<\/p>\n<p style=\"text-align: justify;\">Zayd said that “his household are those who were deprived from receiving charity and they’re the families of `Alī, `Abbās, Ja`far and `Aqīl.”<a href=\"#_ftn109\" name=\"_ftnref109\">[109]<\/a><\/p>\n<p style=\"text-align: justify;\">Allāh placed the words in the verse with the masculine plural instead of the feminine plural because the previous and following verses were specific to women, whereas the verse of purification is not exclusive for women, but it includes the Messenger of Allāh (peace be upon him) who is the head of the household and its master.<\/p>\n<p style=\"text-align: justify;\">And so, the verse is directed at the Prophet (peace be upon him) and his wives. It began with addressing the women {O women of the Prophet} and ended in feminine {And mention what is recited in your houses}.<\/p>\n<p style=\"text-align: justify;\">Mentioning the others with a parenthetical phrase, without any signs or clear hint, without warning that the topic has shifted from one matter to another is in opposition to eloquence which is the best attribute of Allāh’s speech.”<a href=\"#_ftn110\" name=\"_ftnref110\">[110]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>36- He wrote on pg.143 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I found that `Uthmān’s killers were primarily the Companions, with the mother of believers `Ā’ishah at their forefront. She called them to murder him and spill his blood publicly: “Kill Na`thal for he has apostated.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Glory to Allāh, this is a great calumny.<\/p>\n<p style=\"text-align: justify;\">By Allāh this is a lie by Tijani and whoever followed his path. This narration is from the path of the famous liar Sayf ibn `Umar al-Tamīmī.<a href=\"#_ftn111\" name=\"_ftnref111\">[111]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Nasā’ī described him as “Liar.” And Ibn Ḥibbān said: “He narrates fabrications from reliable narrators, he was accused of heresy.”<a href=\"#_ftn112\" name=\"_ftnref112\">[112]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>37- Tijani wrote pg.143 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>We also find Ṭalhah, al-Zubayr, Muḥammad bin Abī Bakr and other famous Companions who have besieged him and prevented him from water, to force him to retire.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie, nothing new.<\/p>\n<p style=\"text-align: justify;\">If Tijani was honest, why not mention a chain for his story and references it? Is it established according to Ahlul-Sunnah? Is Muḥammad bin Abū Bakr really a famous Companion as he just claimed? How can this be when he was born on the farewell pilgrimage only three months before the Prophet (peace be upon him) died!?<\/p>\n<p style=\"text-align: justify;\"><u>38- Tijani wrote on pg.143 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Historians tell us that the Companions were the ones who prevented the burial of his body in the grave site of the Muslims, thus he was buried in Hush-Kawkab without being washed or shrouded.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Would it harm `Uthmān if he was buried in Hush-Kawkab without being washed or shrouded? Wasn’t `Alī ibn Abī Ṭālib killed and buried at night in `Iraq and they dug more than one hole so that the Khawarij may not be able to identify his grave?<a href=\"#_ftn113\" name=\"_ftnref113\">[113]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Ḥusayn bin `Alī was also killed and his grave was not known except what’s claimed in Syria, Egypt and Iraq among other locations. He too was not washed or shrouded. So, does this harm him? By Allāh it is of no harm for any of them may Allāh be pleased with them.<\/p>\n<p style=\"text-align: justify;\">The issue that Tijani is trying to raise is that the Companions stopped `Uthmān’s burial in Baqī`, not the Khawarij who rebelled against him, and prevented his washing and shrouding. As for the location of his burial, al-Ṭabarī mentions in his history more than one narration, in one he was buried in Hush-Kawkab while in another he was buried in al-Baqī`.<a href=\"#_ftn114\" name=\"_ftnref114\">[114]<\/a><\/p>\n<p style=\"text-align: justify;\">As for Ibn Kathīr, he mentions that Hush-Kawkab is right behind al-Baqī` from the eastern side, and so he’s buried there, and Allāh knows best.<a href=\"#_ftn115\" name=\"_ftnref115\">[115]<\/a><\/p>\n<p style=\"text-align: justify;\">As for his claim that the Companions were the ones who stood in the way, this was a story narrated by al-Ṭabarī through the path of al-Wāqidī from `Abdullāh al-Hudhalī from `Abdullāh bin Sa`idah.<a href=\"#_ftn116\" name=\"_ftnref116\">[116]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Wāqidī is Muḥammad bin `Umar, Imam Aḥmad said about him: “He is a liar.” Abū Hātim and al-Nasā’ī both said: “He fabricates stories.” Others have weakened him too.<\/p>\n<p style=\"text-align: justify;\">`Abdullāh al-Hudhali was described by al-Bukhārī as a heretic while al-Nasā’ī said: “He isn’t reliable”.<\/p>\n<p style=\"text-align: justify;\"><u>39- Tijani wrote on pg.145 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Ā’ishah was on her way back from Makkah when they informed her of `Uthmān bin `Affan’s death, so she rejoiced, but then became angry as she learned that the people offered allegiance to `Alī. She said: “I wished the sky would drop to the earth rather than Ibn Abī Ṭālib receiving authority.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie and a false claim. What happened to his promise about not mentioning anything except what was established according to Ahlul-Sunnah?<\/p>\n<p style=\"text-align: justify;\">This narration is in Ṭabarī’s history<a href=\"#_ftn117\" name=\"_ftnref117\">[117]<\/a> from the path of Sayf bin `Umar and he is a liar as discussed in section 36.<\/p>\n<p style=\"text-align: justify;\"><u>40- On pg.145 Tijani wrote [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>When she heard of his death, she prostrated out of thankfulness.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He means `A’ishah, she prostrated to thank Allāh when she heard of `Alī’s death.<\/p>\n<p style=\"text-align: justify;\">Tijani stated that this tale is to be found in the books of the historians who documented the events of the year 40 hijri.<\/p>\n<p style=\"text-align: justify;\">This is a two-headed lie!<\/p>\n<p style=\"text-align: justify;\">First of all, the story itself is a baseless lie.<\/p>\n<p style=\"text-align: justify;\">Secondly, when referring to the historians who documented the events of the 40<sup>th<\/sup> year of hijrah, we find:<\/p>\n<p style=\"text-align: justify;\">Khalīfah bin Khayyāt never mentioned it in his history book.<\/p>\n<p style=\"text-align: justify;\">Al-Ṭabarī never mentioned it in his history book.<\/p>\n<p style=\"text-align: justify;\">Ibn Kathīr never mentioned it in his history book.<\/p>\n<p style=\"text-align: justify;\">Al-Dhahabī never mentioned it in his history book.<\/p>\n<p style=\"text-align: justify;\">Al-Mas`ūdī never mentioned it in his history book.<\/p>\n<p style=\"text-align: justify;\">Ibn al-Athīr never mentioned it in his history book.<\/p>\n<p style=\"text-align: justify;\">So who are these historians who mentioned this slander when documenting the 40<sup>th<\/sup> year? We couldn’t even find this false statement anywhere. Would anyone who respects his readers lie like this?<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\"><u>41- Tijani wrote on pg.145 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>However, Ṭalhah and al-Zubayr brought her fifty men whom they bribed to swear that the well is not that of al-Haw’ab and so she (i.e `A’ishah) continued her journey to Baṣra. Historians mention that this is the first falsified testimony in Islam.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Where’s that condition you placed about not arguing except with what’s established according to both teams? Since when is that nonsense established? Who are these historians anyway? May Allāh defeat you; have you not found a lie that is smaller than this one!?<\/p>\n<p style=\"text-align: justify;\">What’s strange is that Tijani is very daring when it comes to making things up. He attributed the above to al-Ṭabarī although I could never find it in his book. Assuming it actually is there, what is the chain? Is it authentic and established according to the people of Sunnah?<\/p>\n<p style=\"text-align: justify;\"><u>42- He wrote on pg.147 and pg.169 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves] and [The Disagreement between Fatimah and Abu Bakr]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Ā’ishah interrupted the burial ceremony of al-Ḥasan, master of the youth of paradise; she prevented his burial next to his grandfather the Messenger (peace be upon him) saying: “Don’t admit into my house anybody I dislike.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The leaders of the Shī`ah use all logical and illogical means and tools to ruin the image of the Companions of the Messenger (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">If you were truly truthful in what you accuse the Companions of, then at least be satisfied with what is authentically established and don’t seek lies and deceptive methods.<\/p>\n<p style=\"text-align: justify;\">This story is one lie from his sea of lies, so is it established? And where is your source?<\/p>\n<p style=\"text-align: justify;\"><u>43- He states on pg.149 &amp; pg.206 [Then I Was Guided \/ The Opinion of the Companions about Each Other \/ The Testimony of the Shaykhan against Themselves]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>How can they consider him a just Companion (i.e Mu`āwiyah) when he poisoned al-Ḥasan bin `Alī the master of the youth of paradise and killed him.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is also not established and it is a lie as usual. Where is the commitment to only narrate what is acceptable according to the standards of Ahlul-Sunnah?<\/p>\n<p style=\"text-align: justify;\"><u>44- Tijani wrote on pg.162 [Then I Was Guided \/ A Dialogue with a Scholar]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Alī was the most knowledgeable of the Companions and the most courageous according to the consensus of the nation.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">If he means the consensus of the Shī`ah nation, then he can claim as he likes.<\/p>\n<p style=\"text-align: justify;\">If he is talking about us Sunnies, then he lies, but it isn’t surprising anymore.<\/p>\n<p style=\"text-align: justify;\">Where is the consensus? Who reported it? Yes, it is nothing but a claim that anyone can make.<\/p>\n<p style=\"text-align: justify;\">`Alī according to the people of Sunnah is from the bravest of Companions and from the most knowledgeable. As for him being the bravest and most knowledgeable, then that is incorrect. For a detailed refutation of him being the most knowledgeable refer to section 54.<\/p>\n<p style=\"text-align: justify;\">As for his statement that `Alī was the bravest, we reply with the following:<\/p>\n<p style=\"text-align: justify;\">Bravery can be explained by two things, the first thing is a strong and unfaltering heart when facing danger.<\/p>\n<p style=\"text-align: justify;\">The second is to be of a strong body and be able to kill many opponents on the field.<\/p>\n<p style=\"text-align: justify;\">The first matter shows true bravery whereas the second shows the toughness of the body. However, not everybody blessed with a tough body has necessarily possessed a strong brave heart and vice-versa. This is why you will see a man killing a lot of opponents as long as he has the support of his allies, but if he gets fearful he will be struck with cowardice. On the other hand, there is a man who is blessed with a steady heart, standing firm in the face of danger, even if he did not kill scores of men. This latter one is very much needed in chiefs and leaders more than the former. If the leader is brave hearted he will advance and hold his ground without backing up, his supporters will fight besides him. If he was weak hearted, he would falter and retreat, even if he was tough and skillful.<\/p>\n<p style=\"text-align: justify;\">The Prophet (peace be upon him) was the most perfect of men when it came to this courage of army commanders, yet he only killed one man called Ubay Abī Khalaf with his own hands, and he never killed anyone before or after Uhud, even though he was braver than all Companions.<\/p>\n<p style=\"text-align: justify;\">`Alī and others used to seek safety behind the Prophet (peace be upon him) since he was braver<a href=\"#_ftn118\" name=\"_ftnref118\">[118]<\/a> even though they had more kills than he did.<\/p>\n<p style=\"text-align: justify;\">If the bravery required for leaders is that of the heart, then no doubt Abu Bakr was braver than `Umar and `Umar was braver than `Uthmān, `Alī, Ṭalḥa and al-Zubayr. This is known by all those who studied their biographies and stories. Abu Bakr took on the horrors alongside the Prophet (peace be upon him) without cowardice or failure. He used to step into danger to protect the Messenger (peace be upon him) with his body. He struggled against the pagans with his hand, his tongue and his wealth before anyone else.<\/p>\n<p style=\"text-align: justify;\">On the day of Badr, he was with the Prophet (peace be upon him) in their command center under a canopy, while knowing full well that the enemy is targeting the location of the Messenger (peace be upon him), but he remained steady and strong-willed.<\/p>\n<p style=\"text-align: justify;\">When the Prophet (peace be upon him) passed away, he stood and delivered a sermon to remind the Muslims, so he strengthened them and encouraged them to face the coming challenges. He prepared Usāmah’s army and engaged the renegades in battle and fought those who withheld their charities.<\/p>\n<p style=\"text-align: justify;\">The courage required for leadership was not found in such a complete way in anybody after the Messenger (peace be upon him) more than Abū Bakr and `Umar.<\/p>\n<p style=\"text-align: justify;\">As for the number of kills, there is no doubt others from the Companions had killed more pagans than `Alī, so if bravery is decided by who kills more, then many Companions are braver than `Alī. Al-Barā’ bin Mālik killed a hundred men in duels excluding those he assisted in killing.<\/p>\n<p style=\"text-align: justify;\">As for Khālid bin al-Walīd, the number of men he killed is beyond count. In the battle of Mu’tah alone he broke nine swords, and no doubt he killed much more than `Alī.<a href=\"#_ftn119\" name=\"_ftnref119\">[119]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>45- Tijani wrote on pg.167[Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Text Regarding the Succession the the Caliphate]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>After the Ansār gave their oaths to Abū Bakr al-Siddīq, Sa`d said: “By Allāh I shall never pledge allegiance until I throw at you every arrow in my possession…” So he never prayed with them nor attended their Friday prayers or accompanied them in the Ifāḏa (one of the rituals of the pilgrimage).<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is false. It is a lie. This wasn’t established that Sa`d bin `Ubādah did this.<\/p>\n<p style=\"text-align: justify;\">This narration Tijani mentioned is taken from his brother in falsehood: Abī Mikhnaf Lūt bin Yaḥyā.<a href=\"#_ftn120\" name=\"_ftnref120\">[120]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Ma`īn said: “Abū Mikhnaf is unreliable.” Abū Ḥātim said: “His narrations are abandoned.” Ibn Taymiyyah said: “Lūt bin Yaḥyā is known for his lies among the people of knowledge.” Ibn Ḥajar said: “A corrupt historian not to be trusted.”<\/p>\n<p style=\"text-align: justify;\">The narration that is reported by the people of Sunnah, as recorded by Aḥmad bin Ḥanbal, is a lot more reliable: `Affan told us, Abū `Awanah told us, from Dawūd bin `Abdullāh al-Awdi, from Ḥumayd bin `Abdul-Raḥmān, he said:<\/p>\n<p style=\"text-align: justify;\">“The Messenger (peace be upon him) passed away while Abū Bakr was with a group in Madīnah. He came and uncovered the Prophet’s (peace be upon him) face and kissed it. He said: ‘May my father and mother be sacrificed for you. You are pure in life and death…’<a href=\"#_ftn121\" name=\"_ftnref121\">[121]<\/a> And you know O Sa`d that the Messenger (peace be upon him) said: ‘If the people entered a valley and the Ansar enter another one, I would enter the valley of the Ansar.’ And you know O’ Sa`d that the Messenger (peace be upon him) said: ‘Quraysh are in charge of this affair, the righteous people follow the righteous from among Quraysh while the wicked people follow the wicked from among them.’ Sa`d responded: ‘You are truthful, we are the advisers and you are the chiefs.’”<a href=\"#_ftn122\" name=\"_ftnref122\">[122]<\/a><\/p>\n<p style=\"text-align: justify;\">This report is ‘Ḥasan Mursal’ and is considered a lot better than the narration of Abū Mikhnaf. That narration doesn’t even make sense. How could he even perform the Ifāḏa alone? Is he alone at the pilgrimage? Are these but the words of a mad man?<\/p>\n<p style=\"text-align: justify;\"><u>46- He wrote on pg.168 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Disagreement between Fatimah and Abu Bakr]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Whoever follows this tragedy (i.e. dispute about Fadak) and looks at it from all sides, knows for certain that Abu Bakr intentionally hurt Fātimah and accused her of lies so that she may not later argue with texts about the appointment of Ghadīr regarding her husband’s claim to authority. We find many evidences for this, for example: What the historians reported about her going to the gatherings of the Ansār to ask for their support and allegiance for her cousin.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Allāhu Akbar!! He prevents her from having Fadak so she may not later bring up the topic of Ghadīr and `Alī’s supposed appointment!! What silliness is this!? We thank Allāh for the blessing of the intellect.<\/p>\n<p style=\"text-align: justify;\">These words are clearly foolish; Fātimah is greater than having to circle around the gatherings places of men to ask for support and allegiance for her cousin `Alī, while he sits at home. Is this how the Shī`ah respect the daughter of the Messenger (peace be upon him) and the mistress of the women of the worlds? What ever happened to Allāh’s instructions to {remain in your houses} [33:33]? Or is this exclusively about `Ā’ishah only?<\/p>\n<p style=\"text-align: justify;\">Isn’t Fātimah the one who received a male servant while she wore clothes that weren’t enough to simultaneously cover both her head and feet? Then when the Prophet (peace be upon him) saw this, he told her: “There is no harm, it is only your father and your boy.”<a href=\"#_ftn123\" name=\"_ftnref123\">[123]<\/a><\/p>\n<p style=\"text-align: justify;\">Then, the story of Abū Bakr accusing Fātimah of being a liar is in itself a lie. Tijani and his likes are incapable of providing a correct chain for it. The only thing Abū Bakr did is mention the narration of the Prophet (peace be upon him): “We do not leave an inheritance.”<\/p>\n<p style=\"text-align: justify;\"><u> <\/u><\/p>\n<p style=\"text-align: justify;\"><u>47- He wrote on pg.175 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ Ali was more Entitled the to Leadership]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>If we were to leave virtues and seek faults, we would not be able to find for `Alī bin Abī Ṭālib even one sin in the books of either team. Whereas, we can find many sins for others in the Ṣaḥīḥ books of Ahlul-Sunnah, in the biography and history books.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Maybe Tijani isn’t being fair because he studied under the boys at Najaf. If he wanted to be fair, he should take a course under the boys of Ahlul-Sunnah, that way, everything would be even.<\/p>\n<p style=\"text-align: justify;\">`Alī may Allāh be pleased with him according to the people of Sunnah is from the leaders of guidance and god-fearing. However, he isn’t infallible and he has errors just like anybody else, but they are covered in a sea of good deeds.<\/p>\n<p style=\"text-align: justify;\">I stopped at this point specifically and hesitated to write anything. I asked many of my scholars, who are reliable and wise, if I am allowed to mention what I consider to be mistakes on the part of `Alī, whether in Sunni or Shī`ah sources, in order to prove his humanity and non-infallibility? Even though I would never intend to wrong a leader from the leaders of guidance, but the Shī`ah push us to get into these matters to refute their doubts and deception.<\/p>\n<p style=\"text-align: justify;\">I received mixed replies and in the end I lean towards mentioning them so as to silence the voices of falsehood.<\/p>\n<p style=\"text-align: justify;\">In truth, the mistakes attributed to `Alī in the books of the Shī`ah are much greater and incomparable with those in Sunni books. Its content in Shī`ah books are what caused me to be so reluctant.<\/p>\n<p style=\"text-align: justify;\">If this decision was correct then it is from Allāh, but if it is wrong then that’s from myself and the devil, may Allāh forgive me.<\/p>\n<p style=\"text-align: justify;\">Mistakes of `Alī in Sunni books:<\/p>\n<p style=\"text-align: justify;\">1- `Ikrimah said: `Alī burned some folks and this reached Ibn `Abbās so he said: If I were in his place I would not have burned them because the Prophet (peace be upon him) said: “Do not torture with the fire for it is Allāh’s punishment.” If I were in his stead I would have simply killed them since the Prophet (peace be upon him) said: “Kill whoever changes his religion.”<a href=\"#_ftn124\" name=\"_ftnref124\">[124]<\/a><\/p>\n<p style=\"text-align: justify;\">2- `Alī bin Abī Ṭālib said: The Prophet (peace be upon him) knocked on my door one night and said to me and Fātimah: “Will you not get up to pray?” I replied: “O Messenger (peace be upon him), our selves are in Allāh’s hand, so if he wishes for us to rise, we would rise.” He (peace be upon him) left without replying to us then I heard him say as he hit his hand on his thigh: {Man is more than anything contentious} [18:54].<a href=\"#_ftn125\" name=\"_ftnref125\">[125]<\/a><\/p>\n<p style=\"text-align: justify;\">3- Shī`ah always bring up the matter of Fātimah’s anger and say that Abū Bakr made her angry and so he incurs the wrath Allāh and his Messenger (peace be upon him). So read this: Al-Miswar said that he heard the Messenger on the pulpit saying: ‘Banu Hāshim bin al-Mughīrah asked for permission to wed their daughter to `Alī ibn Abī Ṭālib and I do not permit it, unless `Alī wishes to divorce my daughter and marry theirs. Fātimah is a part of me whatever hurts her hurts me.”<a href=\"#_ftn126\" name=\"_ftnref126\">[126]<\/a><\/p>\n<p style=\"text-align: justify;\">In another narration, when Fātimah heard of `Alī’s intention she went to the Prophet (peace be upon him) saying: “Your people say that you do not get angry for your daughters. `Alī, here, is going to marry the daughter of Abī Jahl.”<a href=\"#_ftn127\" name=\"_ftnref127\">[127]<\/a><\/p>\n<p style=\"text-align: justify;\">So, who made her angry here!?<\/p>\n<p style=\"text-align: justify;\">4- Al-Barā’ said: When the Prophet (peace be upon him) conducted a truce at Hudaybiyyah, `Alī was tasked with writing the document. `Alī wrote: “Muḥammad the Messenger of Allāh”. So the pagans said: “Don’t write ‘Messenger,’ if you were a Messenger we wouldn’t have fought you.” He (peace be upon him) told `Alī: “Erase it.” `Alī replied: “I will not erase it!” So the Messenger (peace be upon him) took it and erased it with his own hand.<a href=\"#_ftn128\" name=\"_ftnref128\">[128]<\/a> This was narrated by Al-Bukhārī and Majlisī.<a href=\"#_ftn129\" name=\"_ftnref129\">[129]<\/a><\/p>\n<p style=\"text-align: justify;\">5- `Alī came to the Prophet (peace be upon him) and told him: “Abu Ṭālib has died.” The Prophet (peace be upon him) said: “Go and take care of his burial,” `Alī said “But he died a polytheist!” The Prophet (peace be upon him) repeated: “Go and take care of his burial.”<a href=\"#_ftn130\" name=\"_ftnref130\">[130]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: If this was a story about Abū Bakr or `Umar, the Shī`ah would have cried, “Why don’t they carry out the orders of the Messenger!?” or “Why do they act like they’re teaching the Prophet!?” and things of this nature.<\/p>\n<p style=\"text-align: justify;\">6- `Abbās and `Alī entered upon `Umar, so al-`Abbās said: “O’ Commander of the faithful, judge between me and this man” – They were disputing over the land of Banū al-Naḏīr – So `Alī and `Abbās cursed each-other etc…<a href=\"#_ftn131\" name=\"_ftnref131\">[131]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: How could `Alī curse his uncle al-`Abbās!?<\/p>\n<p style=\"text-align: justify;\">7- `Alī said: I used to have a lot of pre-seminal discharges and I was shy to ask the Prophet (peace be upon him) about it due to Fātimah. I asked al-Miqdād to ask him for me and so the Prophet (peace be upon him) answered: “He washes his organ and does ablution.”<a href=\"#_ftn132\" name=\"_ftnref132\">[132]<\/a><\/p>\n<p style=\"text-align: justify;\">Shī`ah often say: How can `Umar be a Caliph if he doesn’t know the ruling of Tayamum (cleansing oneself with sand)? We say, how can `Alī be a Caliph if he doesn’t know how to clean himself from pre-seminal discharges.<\/p>\n<p style=\"text-align: justify;\">As for the stories in the Shī`ah books, I seek the forgiveness of Allāh when mentioning them since they reflect the maliciousness of their narrators, so without further ado:<\/p>\n<p style=\"text-align: justify;\">1- `Alī said: I travelled with the Messenger (peace be upon him) and he had nobody to serve him except me and he also had one cover for sleeping. `Ā’ishah was with him and he (peace be upon him) used to sleep between me and her under one cover. Then when he would rise to pray the night he would fold the cover from the middle between me and `Ā’ishah until it touched the bed under us.<a href=\"#_ftn133\" name=\"_ftnref133\">[133]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: See how this sly narrative attacks the Messenger (peace be upon him), `Alī and `A’ishah. They made it as if the Messenger (peace be upon him) doesn’t care about his honor, may Allāh curse whoever fabricated this story.<\/p>\n<p style=\"text-align: justify;\">What’s worse is that they narrate from Abū `Abdillāh al-Ṣādiq that he was asked about a man and a woman who were found together under one cover? He replied: “They are both lashed one hundred times.”<a href=\"#_ftn134\" name=\"_ftnref134\">[134]<\/a><\/p>\n<p style=\"text-align: justify;\">2- `Alī said: The Messenger (peace be upon him) came in the morning while we (i.e `Alī &amp; Fātimah) were under our cover. So he (peace be upon him) said to us: “al-Salāmu `Aleykum,” but we were shy and silent because of our situation. So the Prophet (peace be upon him) repeated again: “al-Salāmu `Aleykum.” And we remained silent.<a href=\"#_ftn135\" name=\"_ftnref135\">[135]<\/a><\/p>\n<p style=\"text-align: justify;\">How can they not return the greeting to the Messenger (peace be upon him) after he greeted them twice!?<\/p>\n<p style=\"text-align: justify;\">3- Ibn `Abbās said that Fātimah entered her house and found `Alī’s head on the lap of a female servant who was gifted to him by Ja`far. Fātimah became jealous, like any woman would, so she took her shawl and decided to seek the Prophet (peace be upon him) in order to complain about him.<a href=\"#_ftn136\" name=\"_ftnref136\">[136]<\/a><\/p>\n<p style=\"text-align: justify;\">4- `Alī said: I am the side of Allāh and His word. I am Allāh’s heart and His door from which He is sought. Enter the door while in prostration and I shall forgive you your sins and reward the righteous. The hour shall come to be through me and by my hand and concerning me the corrupt ones will be in doubt. I am the first and the last, the outward and the inward, I know all.<a href=\"#_ftn137\" name=\"_ftnref137\">[137]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: What’s left for Allāh!? No doubt this statement entails explicit disbelief and `Alī is innocent from it. You Shī`ah attributed such blasphemy in your books to `Alī bin Abī Ṭālib may Allāh honor his face!<\/p>\n<p style=\"text-align: justify;\">5- Abū `Abdillāh al-Ṣādiq said that `Alī prayed Dhuhr then turned and saw a skull, so the Chief of Believers (`Alī) began speaking to it… and it preoccupied him until sunset. He spoke to it in three languages from the bible so that the Arabs never understood its speech. It said: “I shall not return.” Then, it got away. So `Alī supplicated to Allāh and He sent seventy thousand angels with seventy thousand chains, placing them on its neck and dragging it until it became clear white.<a href=\"#_ftn138\" name=\"_ftnref138\">[138]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: How could `Alī delay `Asr prayer until sunset? No doubt this myth belongs in Shī`ah books.<\/p>\n<p style=\"text-align: justify;\">6- Abū `Abdillāh said: A horrible woman spoke to the Chief of Believers while on the pulpit: “This is the killer of the beloved!” So `Alī looked at her and said to her: “You have a filthy tongue! You’re brazenly shameless! You’re akin to men! You don’t menstruate like women! You have an organ hanging near your groin!”<a href=\"#_ftn139\" name=\"_ftnref139\">[139]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: The chief of believers could never say such filthy words but don’t be surprised dear reader of their indecent vocabulary and their attribution of such words to their own Imams.<\/p>\n<p style=\"text-align: justify;\">If `Umar had said it they would have spread it far and wide without rest.<\/p>\n<p style=\"text-align: justify;\">7- Abū `Abdillāh said: While the Chief of Believers was between a group from his companions a man came to him saying: “O’ Chief of Believers, I had a relationship with a young boy so purify me!” `Alī refused to do so until he told him on the third time: “The Messenger (peace be upon him) had three rulings for your likes, a strike with a sword, burning with a fire or thrown from atop a mountain.” …Then he stood while crying until he sat in the hole that the Chief of Believers dug for him. He looked at the fire around him, then the Chief of Believers began to cry and said: “Allāh has forgiven your sin. Stand up and never do it again.”<a href=\"#_ftn140\" name=\"_ftnref140\">[140]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: Did `Alī just refuse to implement God’s law!?<\/p>\n<p style=\"text-align: justify;\">8- Abū `Abdillāh said: `Umar was brought a woman who clung to a man from the Ansār whom she loved. She took an egg and spilled the whites on her clothes and between her legs. `Alī stood up and looked between her thighs and then accused her.<a href=\"#_ftn141\" name=\"_ftnref141\">[141]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: May Allāh be pleased with him and brighten his face, how can he look between the thighs of a female who isn’t a relative!? Do Shī`ah apply this ruling of jurisprudence today? And who here is attacking `Alī, the Sunnis or the Shī`ah?<\/p>\n<p style=\"text-align: justify;\">9- Ḥabīb bin Thābit said: There was an argument between `Alī and Fātimah. The Prophet (peace be upon him) entered, so they brought him a seat. He sat and `Alī came as well as Fātimah, both sat at either side… they remained until he (peace be upon him) managed to reconcile between the two.<a href=\"#_ftn142\" name=\"_ftnref142\">[142]<\/a><\/p>\n<p style=\"text-align: justify;\">These are just a few samples out of many that we mention in haste:<\/p>\n<p style=\"text-align: justify;\">1- Changing the base of the Caliphate from the Prophet’s (peace be upon him) city to the city of Kufah.<\/p>\n<p style=\"text-align: justify;\">2- Abandoning the Prophet’s (peace be upon him) order for him to be his successor.<\/p>\n<p style=\"text-align: justify;\">3- Marrying off his daughter Umm Kulthum to `Umar.<a href=\"#_ftn143\" name=\"_ftnref143\">[143]<\/a><\/p>\n<p style=\"text-align: justify;\">4- He never gave Fadak to his children when he became Caliph.<\/p>\n<p style=\"text-align: justify;\">5- He never punished `Uthmān’s killers.<\/p>\n<p style=\"text-align: justify;\">6- He placed his own relatives in authority such as Muḥammad bin Abī Bakr, whom he looked after, `Abdullāh, `Ubaydullāh, Qatham and Thumamah sons of `Abbās (his cousins), and he appointed his own sons as his successors as Shī`ah claim.<\/p>\n<p style=\"text-align: justify;\">7- He never shaved his head or slaughtered in Hudaybiyah.<\/p>\n<p style=\"text-align: justify;\">8- He prayed twenty prostrations of Tarāwīḥ.<\/p>\n<p style=\"text-align: justify;\">9- He was seeking the protection of the Prophet (peace be upon him) at Badr.<\/p>\n<p style=\"text-align: justify;\">10- He differed in views with al-Ḥasan at Ṣiffīn.<\/p>\n<p style=\"text-align: justify;\">11- He differed with al-Ḥasan regarding the lashing of al-Walīd bin `Uqbah.<\/p>\n<p style=\"text-align: justify;\">12- He went and sat between the Prophet (peace be upon him) and `Ā’ishah and caused her to say: “Couldn’t you find anything other than my thigh?”<a href=\"#_ftn144\" name=\"_ftnref144\">[144]<\/a><\/p>\n<p style=\"text-align: justify;\">Regardless of all this, you can’t even find one Sunni who criticizes `Alī due to these. Only the Khawārij and Nawāṣib did such things, and the Khawārij aren’t even from Ahlul-Sunnah, while the Nawasib are non-existent today from what I know.<\/p>\n<p style=\"text-align: justify;\"><u>48- He wrote on pg.175 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ Ali was more Entitled the to Leadership]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Uthmān’s Caliphate was a historical joke, this is because `Umar nominated six and ordered them to pick one man from among themselves. He said: “If four men agree and two insist to disagree then kill them both men. If the six split into two teams, then take the opinion of the three with `Abdul-Raḥmān bin `Awf. If the allotted time passes and the six continue to disagree then kill them all.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Subḥān-Allāh! Tijani avoided the authentic report of al-Bukhārī and headed straight towards the narration of the liar Abū Mikhnaf! He then wrote in pg.88:<\/p>\n<p style=\"text-align: justify;\">[As I was about to embark on a long and difficult research, I promised myself to depend only on the authentic narrations that are accepted by both the Shī`ah and the Sunnah.]<\/p>\n<p style=\"text-align: justify;\">We say, the Prophet (peace be upon him) taught us that “the signs of a hypocrite are three, if he speaks he lies, if he promises he breaks it, and if he’s entrusted he betrays.”<a href=\"#_ftn145\" name=\"_ftnref145\">[145]<\/a> Agreed upon by al-Bukhārī and Muslim.<\/p>\n<p style=\"text-align: justify;\">The story quoted by Tijani is a lie by another liar called Abū Mikhnaf.<a href=\"#_ftn146\" name=\"_ftnref146\">[146]<\/a><\/p>\n<p style=\"text-align: justify;\">Below is al-Bukhārī’s narration of the Shūra (consultation) event.<\/p>\n<p style=\"text-align: justify;\">Imam al-Bukhārī said: Mūsā bin Ismā`īl told us, Abū `Awānah told us, from Ḥuṣayn, from `Amr ibn Maymūn (who mentions the story of `Umar’s death), “So they told `Umar: ‘O chief of believers, choose a successor.’ He said: ‘I do not find anyone more worthy of it except those men that the Prophet (peace be upon him) died while being pleased with.’ He named `Ali, `Uthmān, al-Zubayr, Ṭalḥa, Sa`d and `Abdul-Raḥmān. He said: ‘My son `Abdullāh may attend but he gets no say in the matter. If Sa`d should become chosen as the leader then that’s good, but if it doesn’t then let whoever is in charge to rely on his opinions, for I did not relieve him of his post (in `Iraq) because he’s incapable or a traitor.’ He continued: ‘My will to the Caliph after me is to treat the Muhājirūn well, know their right and respect their sanctity. As for the Ansār who settled in the city and adopted the faith before them, I desire him to be good towards them, accept the deeds of those who are good and excuse the wrong-doers among them. I also desire that he treats the people of the distant lands well as they are the protectors of Islam and the source of wealth and the source of rage to the enemy. I also desire that nothing be taken from them except from their surplus with their consent. I also desire that he is well to the Bedouin-Arabs, as they are the origin of the `Arabs and the material of Islam. He should take from what is inferior, amongst their properties and distribute that to the poor amongst them. I also desire that he takes care of Allāh&#8217;s and His Apostle&#8217;s protectees, to fulfill their contracts and to fight for them, and not to overburden them.’”<a href=\"#_ftn147\" name=\"_ftnref147\">[147]<\/a><\/p>\n<p style=\"text-align: justify;\">This is the story of the consultation. It does not contain anything about spilling the blood of the Prophet’s (peace be upon him) Companions especially since `Umar testified that he (peace be upon him) died while being pleased with them.<\/p>\n<p style=\"text-align: justify;\"><u>49- Tijani said on pg.176 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ Ali was more Entitled the to Leadership]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>There hasn’t been a single legitimate oath of allegiance in Islamic history, from the time of the Caliphs until Kemāl Ataturk, except for that of the Chief of Believers `Alī bin Abī Ṭālib.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie for nobody disputed with Abū Bakr al-Siddīq when he became Caliph, nor `Umar, nor `Uthmān. As for `Ali, he did not receive the allegiance of the people of the Levant and most Companions were outside Madīnah when he received authority, and the matter was not stable for him as it has been for the first three Caliphs.<\/p>\n<p style=\"text-align: justify;\"><u>50- Tijani also wrote on pg.176 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Prophetic Traditions which that Indicate that ‘Ali should be Followed]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>I shall not use as reference except what has been agreed upon by both sects. From these narrations are:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>A- I am the city of knowledge and `Alī is its gate.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This Ḥadīth is not correct and was weakened by most people of knowledge and here’s what they said.<\/p>\n<p style=\"text-align: justify;\">1- Bukhārī: Rejected. It hasn’t been reported from an authentic way.<a href=\"#_ftn148\" name=\"_ftnref148\">[148]<\/a><\/p>\n<p style=\"text-align: justify;\">2- Abū Ḥātim: It is baseless.<a href=\"#_ftn149\" name=\"_ftnref149\">[149]<\/a><\/p>\n<p style=\"text-align: justify;\">3- Abū Zur`ah: Many people were exposed by narrating it.<a href=\"#_ftn150\" name=\"_ftnref150\">[150]<\/a><\/p>\n<p style=\"text-align: justify;\">4- Tirmidhī: This narration is odd and rejected.<a href=\"#_ftn151\" name=\"_ftnref151\">[151]<\/a><\/p>\n<p style=\"text-align: justify;\">5- `Uqaylī: Nothing is authentic concerning this text.<a href=\"#_ftn152\" name=\"_ftnref152\">[152]<\/a><\/p>\n<p style=\"text-align: justify;\">6- Ibn Hibban: This thing is baseless.<a href=\"#_ftn153\" name=\"_ftnref153\">[153]<\/a><\/p>\n<p style=\"text-align: justify;\">7- Dāraqutnī: A shaky narration that isn’t established.<a href=\"#_ftn154\" name=\"_ftnref154\">[154]<\/a><\/p>\n<p style=\"text-align: justify;\">8- Ibn al-Jawzī: Is not authentic and has no basis.<a href=\"#_ftn155\" name=\"_ftnref155\">[155]<\/a><\/p>\n<p style=\"text-align: justify;\">9- Nawawī: Fabricated.<a href=\"#_ftn156\" name=\"_ftnref156\">[156]<\/a><\/p>\n<p style=\"text-align: justify;\">10- Ibn Taymiyyah: Fabricated.<a href=\"#_ftn157\" name=\"_ftnref157\">[157]<\/a><\/p>\n<p style=\"text-align: justify;\">11- Dhahabī: Fabricated.<a href=\"#_ftn158\" name=\"_ftnref158\">[158]<\/a><\/p>\n<p style=\"text-align: justify;\">12- Albānī: Fabricated.<a href=\"#_ftn159\" name=\"_ftnref159\">[159]<\/a><\/p>\n<p style=\"text-align: justify;\">Will Tijani still run his mouth and say he only relies on what is agreed upon!?<\/p>\n<p style=\"text-align: justify;\"><u>51- He wrote on pg.177 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Prophetic Traditions which that Indicate that ‘Ali should be Followed]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>This is ibn `Abbās saying: My knowledge and that of the Companions of Muḥammad (peace be upon him) when compared to `Alī’s knowledge is like a drop in the seven seas.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Then Tijani wrote in the footnote:<\/p>\n<p style=\"text-align: justify;\"><strong>The Ṣaḥīḥs of Ahlul-Sunnah and their books are in agreement about `Alī’s superiority in knowledge over all of them.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: You lied! Where is this consensus and who mentioned it?<\/p>\n<p style=\"text-align: justify;\">Ibn Taymiyyah wrote: “The scholars of Ahlul-Sunnah have agreed that the most knowledgeable man after the Messenger (peace be upon him) is Abū Bakr and then `Umar. More than one scholar mentioned the consensus regarding Abū Bakr’s superior knowledge. Not one from Abū Bakr’s verdicts has been found to be in opposition with a divine text, whereas many verdicts by `Umar and `Alī were found to be in opposition to the extent that al-Shāfi`ī collected a volume about the disagreements between `Alī and Ibn Mas`ūd. Multiple scholars mentioned that Abū Bakr had more knowledge than `Alī, such as Imam Mansūr bin `Abdul-Jabbār al-Sam`āni one of the Shāfi`ī leaders. In the Ṣaḥīḥayn<a href=\"#_ftn160\" name=\"_ftnref160\">[160]<\/a> from Abū Sa`īd al-Khudari: Abū Bakr was the most knowledgeable of us concerning the Prophet (peace be upon him).”<a href=\"#_ftn161\" name=\"_ftnref161\">[161]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Hazm said: “Those from the Rafidah argued that `Alī was the most knowledgeable, but this is a lie, since the knowledge of a Companion is proven from two ways: The first is the great number of narrations and verdicts he issues. The second is the number of times the Prophet (peace be upon him) relied upon him. We looked and found that the Prophet (peace be upon him) had appointed Abū Bakr as leader of prayer in his presence and the presence of all senior Companions like `Umar and `Ali. We also found that he appointed him over the charities, and so by necessity, he must have knowledge of handling the alms, which is a pillar of Islam. We also found that he (peace be upon him) placed him in charge of the pilgrimage, and so by necessity, he must know more than the rest of them about Ḥajj and these are all pillars of Islam. Then we found that he regularly sat with him, talked with him and accompanied him in a way that he was able to see his rulings and verdicts more than `Ali.”<a href=\"#_ftn162\" name=\"_ftnref162\">[162]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>52- Tijani said on pg.178 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Prophetic Traditions which that Indicate that ‘Ali should be Followed]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The narration of: Whomever I was his Mawlā then `Alī is his Mawlā. O Lord, befriend whoever befriends him and be the enemy of his enemy. Grant victory to his supporters and forsake who forsook him and direct the truth with him wherever he may be.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani mentioned this after the narration of: I am the city of knowledge and `Alī is its gate, as part of what he claims is agreed upon between the two sects.<\/p>\n<p style=\"text-align: justify;\">He said on pg.94 [The Companions of the Prophet as seen by the Shi’a and the Sunnis]:<\/p>\n<p style=\"text-align: justify;\"><strong>I do not rely except on what they all agree on.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">And on pg.88 [The Beginning of the Research]:<\/p>\n<p style=\"text-align: justify;\"><strong>I shall not use as reference except what has been agreed upon by both sects.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Did he fulfill his promise? This version of the narration he quoted is a lie attributed to the Messenger (peace be upon him). What is authentically attributed to the Messenger (peace be upon him) is only: “Whomever I am his Mawlā, `Alī is his Mawlā.”<\/p>\n<p style=\"text-align: justify;\">Some from the people of knowledge accepted the addition of: “O Lord, befriend whoever befriends him and be the enemy of his enemy.” The addition of: “Grant victory to his supporters and forsake who forsook him and direct the truth with him wherever he may be,” is a pure lie that neither Tijani nor his masters can bring an authentic chain for.<\/p>\n<p style=\"text-align: justify;\">Also this contradicts reality, since the nation (according to Shī`ah) had all forsaken him after the death of the Prophet (peace be upon him) until `Uthmān’s death, yet still they were victorious in the reign of the first three Caliphs.<\/p>\n<p style=\"text-align: justify;\">When `Uthmān was killed, three parties emerged. A party that supported him, a party that opposed him and one that stood on the sidelines without getting involved. Those who supported `Alī were not victorious, rather it was their opponents, and they received authority and conquered the lands. `Alī was mainly victorious in fighting the Khawārij.<\/p>\n<p style=\"text-align: justify;\">As for the authentic report “Whomever I was his Mawlā then `Alī is his Mawlā”, this does not prove `Alī’s leadership, and we will discuss a few points pertaining to this.<\/p>\n<p style=\"text-align: justify;\">First point: If the Prophet (peace be upon him) wished to inform the people that `Alī will succeed him then this speech would have been delivered at Ḥajj not after it. It is known that this event occurred after pilgrimage, on the road to Madīnah, at the pond of Khum.<\/p>\n<p style=\"text-align: justify;\">Second point: The location of Ghadīr Khum lies between Makkah and Madīnah in an area called al-Juḥfah. This place is near the town of Rābigh and only 15 kilometers away from it. Therefore, Ghadīr is 160 kilometers away from Makkah, so it can’t possibly be a gathering point for pilgrims.<a href=\"#_ftn163\" name=\"_ftnref163\">[163]<\/a><\/p>\n<p style=\"text-align: justify;\">Third point: Their scholar `Abdul-Ḥusayn Sharaf-ul-Dīn al-Mūsawī said in his book regarding “Whomever I was his Mawlā then `Alī is his Mawlā”:<\/p>\n<p style=\"text-align: justify;\">“Wasn’t the Prophet (peace be upon him) ordered to announce it (i.e `Alī’s leadership), wasn’t he pressured to do so in a manner that resembles a threat from Allāh, when He said: {O Messenger, deliver that which has been sent down to thee from thy Lord; for if thou dost not, thou wilt not have delivered His Message. God will protect thee from men.} [5:67]”<a href=\"#_ftn164\" name=\"_ftnref164\">[164]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: What’s apparent from these words is that the Prophet (peace be upon him) had never announced `Alī’s right to leadership before this event. Therefore, all evidences used by the Shī`ah before the time of Ghadīr can no longer be taken as clear proofs about his leadership. This event took place only three months before the death of the Prophet (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">Fourth point: The Prophet (peace be upon him) was no longer afraid of anyone after the farewell pilgrimage, so the people of Makkah, Madīnah and what surrounds them are all either obedient or defeated hypocrites so why would Allāh say: {God will protect thee from men}?<\/p>\n<p style=\"text-align: justify;\">Fifth point: Clarifying the meaning of the word ‘Mawlā’ and does it mean what the Shī`ah claim it does.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Why didn’t the Prophet (peace be upon him) announce the word ‘Caliph’ in a way that is explicit and clear without ambiguity?<\/li>\n<li>If we agree for the sake of the argument that he’s got more claim to the believers than themselves, where does this prove that he’s appointed as leader? Allāh said: {Lo! those of mankind who have the best claim to Abraham are those who followed him.} [3:68]<\/li>\n<li>Allāh said about the disbelievers: {Hell-fire is your home and it is most worthy of you (Mawlākum).} [57:15]<\/li>\n<li>If we agree, for the sake of the argument, that he’s most worthy of leadership, then that means it shall end up with him. Otherwise, he would have become the leader right there in the life of the Prophet (peace be upon him).<\/li>\n<li>Ibn al-Sukayt said: “Wilāyah is authority while Walāyah and Wilayah are support.”<a href=\"#_ftn165\" name=\"_ftnref165\">[165]<\/a><\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The Mawlā is from Walāyah and al-Wālī is from al-Wilāyah, but the Prophet (peace be upon him) said “Mawlā” and not “Wāli”.<\/p>\n<p style=\"text-align: justify;\">This is why the people of jurisprudence say: “If the Wālī and the Walī both attend then which will be more rightful in leading the funeral prayer?” (Al-Wālī is the one in authority and the Walī is one that is close to the deceased.)<\/p>\n<p style=\"text-align: justify;\">Other matters remain, but I left them so as to not prolong, so whoever wishes to learn more can return to Minhāj-ul-Sunnah al-Nabawiyyah by Ibn Taymiyyah.<a href=\"#_ftn166\" name=\"_ftnref166\">[166]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>53- On pg.179 Tijani wrote: [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Prophetic Traditions which that Indicate that ‘Ali should be Followed]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The narration of: “`Alī is from me and I am from `Alī, no one can execute my duty except myself or `Alī.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This narration revolves around Abū Isḥāq al-Sabī`ī and he’s a famous Mudallis, who would make Tadlīs from weak narrators. If he were to declare hearing, then his report is accepted without doubt, but we refrain from accepting his narrations if he does not declare that he heard from his source.<\/p>\n<p style=\"text-align: justify;\">Abū Isḥāq al-Jawzajānī said: “Some persons in Kufah had loathsome beliefs (i.e. Shī`ah), and they were the heads of the traditionalists in that city, such as: Abū Isḥāq, al-A`mash, Mansūr, Zubayd and others from their generation. People accepted them for their truthfulness and the honesty of their narrations, but refrained from accepting what they narrated disconnection narrations, out of fear that the origins of those narrations were not correct. As for Abū Isḥāq, he narrated from unknown narrators and their narrations reached the people of knowledge only through what Abū Isḥāq had narrated.”<a href=\"#_ftn167\" name=\"_ftnref167\">[167]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>54- Tijani wrote on pg.179 [Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Prophetic Traditions which that Indicate that ‘Ali should be Followed]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>This resembles what the Messenger of Allāh said to `Alī at another occasion: “You O’ `Alī shall clarify for my nation what they differ upon after me.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: By Allāh the Messenger (peace be upon him) never said such a thing; it is only what the fabricators had inserted.<\/p>\n<p style=\"text-align: justify;\">In it is Ḏirār bin Ṣurad and he’s a liar.<a href=\"#_ftn168\" name=\"_ftnref168\">[168]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Ma`īn said: “Liar.” Nasā’ī said: “Not reliable.” Dhahabī said: I believe this was forged by Ḏirār bin Ṣurad.<\/p>\n<p style=\"text-align: justify;\">Don’t forget the promise of Tijani dear readers, that he won’t bring forth except what is authentic!<\/p>\n<p style=\"text-align: justify;\"><u>55- On pg.180Then I Was Guided \/ The Reasons Behind the Enlightenment \/ The Prophetic Traditions which that Indicate that ‘Ali should be Followed:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Narration of the House and the Day of Warning<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger of Allāh said while pointing to `Ali: “This is my brother, executor of my will and my successor after me, so listen to him and obey.” This is also from the authentic reports.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This narration is a lie attributed to the Messenger of Allāh (peace be upon him) and Tijani keeps lying to Allāh’s servants.<\/p>\n<p style=\"text-align: justify;\">The report includes Abū Maryam al-Kūfī who is an abandoned liar. Ibn Kathir said: “This was solely reported by `Abdul-Ghaffār bin al-Qasim Abū Maryam. He is an abandoned Shī`ah liar. Ibn al-Madīnī and others accused him of fabricating reports.<a href=\"#_ftn169\" name=\"_ftnref169\">[169]<\/a><\/p>\n<p style=\"text-align: justify;\">Shaykh-ul-Islam Ibn Taymiyyah said regarding the story of Ḥadīth al-Dār:<\/p>\n<p style=\"text-align: justify;\">1-The children of `Abdul-Muttalib were nowhere near forty when this verse was revealed.<a href=\"#_ftn170\" name=\"_ftnref170\">[170]<\/a><\/p>\n<p style=\"text-align: justify;\">2-Not everybody who helped spread the religion qualified to be a leader.<\/p>\n<p style=\"text-align: justify;\">3- Ḥamzah, Ja`far and `Ubaydah bin al-Ḥārith also accepted and had more of an impact upon acceptance than `Alī.<\/p>\n<p style=\"text-align: justify;\">4-The actual events of the Day of the Warning is established in the Ṣaḥīḥayn from the path of Ibn `Abbās. It says that the Prophet (peace be upon him) climbed on al-Safā to warn the people, but it has no mention of `Alī at all.<\/p>\n<p style=\"text-align: justify;\">5-`Alī bin Abī Ṭālib, at the time, was no older than eleven, so how can he be in charge of his fathers and cousins? It is also known that `Alī never supported the Prophet (peace be upon him) in Makkah, rather it was the Prophet (peace be upon him) taking care and looking after `Alī.<\/p>\n<p style=\"text-align: justify;\"><u>56- Tijani wrote on pg.187 [Then I Was Guided \/ The Correct Prophetic Traditions which Indicate the Fact that it is Compulsory to Follow the Ahl al Bayt \/ The Prophetic Tradition of the Two Weighty Things]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The third incident that took place at the start of Abū Bakr’s Caliphate was when `Umar disagreed with him and interpreted Qur’ānic and prophetic texts. This is the same story of Khālid bin al-Walīd who killed Mālik bin Nuwayrah unjustly and slept with his wife on that same night.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Mālik bin Nuwayrah’s story is popular in history books. He had prevented the offering of the alms after the Prophet (peace be upon him) died. It was further narrated that he even followed Sajāḥ who claimed to be a prophetess, but what’s more well-known is the first matter.<\/p>\n<p style=\"text-align: justify;\">Most historians mentioned this story without mentioning Tijani’s version about killing him unjustly and sleeping with his wife on that same night.<\/p>\n<p style=\"text-align: justify;\">Imam al-Ṭabarī reports: “When Khālid bin al-Walīd caught them, they were imprisoned in a cold night that kept getting colder. Khālid ordered a man to loudly announce: ‘Make sure to keep your prisoners warm,’ but in the dialect of the tribe of Kinānah this expression meant ‘kill’. Upon hearing this, Ḏirār bin al-Azwar executed Mālik. Khālid then married Umm Tamīm bint al-Minhāl and left her until her until Tuhr<a href=\"#_ftn171\" name=\"_ftnref171\">[171]<\/a> ended.<a href=\"#_ftn172\" name=\"_ftnref172\">[172]<\/a><\/p>\n<p style=\"text-align: justify;\">This is the report of Ibn Kathīr who mentions a very similar version to al-Ṭabarī before him with the following at the end: When she (i.e. Umm Tamīm) became lawful for him he consummated the marriage. It was said that Khālid called on Mālik bin Nuwwayrah and gave him a harsh lecture for following Sajāḥ and withholding the alms. He said: “Did you not know that it (i.e. Zakat) is as much of an obligation as prayers?” Mālik said: “Your Companion (i.e. Muḥammad) used to claim so.” So Khālid said: “He’s our Companion? Isn’t he your Companion too!? O Ḏirār, strike his neck!!” So he was executed.<a href=\"#_ftn173\" name=\"_ftnref173\">[173]<\/a><\/p>\n<p style=\"text-align: justify;\">The story of Ibn Nuwayrah was also mentioned by Abū al-Rabī` al-Kalā`ī in his book “Ḥurūb al-Riddah” but there’s no mention of what Tijani stated.<\/p>\n<p style=\"text-align: justify;\">As for `Umar’s words to Khālid: “O enemy of Allāh! You killed a Muslim man then took his wife!? I’ll be sure to stone you.”<\/p>\n<p style=\"text-align: justify;\">We certainly must ask Tijani at this point: Where is the chain for this? Indeed, it was mentioned in some history books, but what use to us is it without a chain?<\/p>\n<p style=\"text-align: justify;\">Mālik bin Nuwayrah said: “This money, we used to offer it to your Companion (i.e. Muḥammad) during his life but he died, so what does that have to do with Abū Bakr?” Khālid then became enraged and said: “Is he our Companion and not yours!?” Then he ordered Ḏirār to strike his neck. It was said also that Mālik followed Sajāḥ the false prophetess.<a href=\"#_ftn174\" name=\"_ftnref174\">[174]<\/a><\/p>\n<p style=\"text-align: justify;\">In a third report: Khālid may Allāh be pleased with him, when he spoke to them, stopped them from doing what they were doing and took prisoners, he said to his companions: “Warm up your prisoners.” It was a cold night and in the language of Thaqīf to warm a man means to kill him<a href=\"#_ftn175\" name=\"_ftnref175\">[175]<\/a>, so they thought Khālid intended to execute them.<\/p>\n<p style=\"text-align: justify;\">No matter which of the three reports is correct, Khālid bin al-Walīd cannot be criticized as he only did this due to his own reasoning free from any ill intentions.<\/p>\n<p style=\"text-align: justify;\">Concerning Khālid killing Mālik, the report of him entering on his wife on the same night is a lie. Yes, after Khālid killed him and took prisoners, he did take the man’s wife, but he never specifically killed him just to get to her nor did he sleep with her on the same night as the liar says.<a href=\"#_ftn176\" name=\"_ftnref176\">[176]<\/a><\/p>\n<p style=\"text-align: justify;\">It is popularly reported from Khālid’s words, that he used to say: “To meet the enemy on a rainy night is more beloved to me than being offered a bride or to receive the glad tidings of a newborn.”<a href=\"#_ftn177\" name=\"_ftnref177\">[177]<\/a><\/p>\n<p style=\"text-align: justify;\">He was from the great leaders whom the Prophet (peace be upon him) described as: “A sword that Allāh unsheathed upon the pagans.”<a href=\"#_ftn178\" name=\"_ftnref178\">[178]<\/a><\/p>\n<p style=\"text-align: justify;\">This is why when Khālid committed this act `Umar told Abū Bakr: “Relieve Khālid from his duty, he can’t control his sword.” Abū Bakr replied: “By Allāh No! He is a sword Allāh unsheathed upon the pagans.”<a href=\"#_ftn179\" name=\"_ftnref179\">[179]<\/a><\/p>\n<p style=\"text-align: justify;\">Didn’t you previously say that you wouldn’t argue with what wasn’t authentic?<\/p>\n<p style=\"text-align: justify;\">The chain of this narration isn’t authentic since al-Ṭabarī got it through the path of Muḥammad bin Ḥumayd al-Rāzi.<a href=\"#_ftn180\" name=\"_ftnref180\">[180]<\/a><\/p>\n<p style=\"text-align: justify;\">Bukhārī said: “He is weak.” Abū Zur`ah accused him of lying. Ṣālih Jazarah said: “We used to accuse Ibn Ḥumayd of everything he told us. I’ve not seen anyone with greater audacity.” Ibn Kharāsh said: “Ibn Ḥumayd told us and by Allāh he used to lie.”<\/p>\n<p style=\"text-align: justify;\"><u>57- Tijani said on pg.193 [Then I Was Guided \/ The Correct Prophetic Traditions which Indicate the Fact that it is Compulsory to Follow the Ahl al Bayt \/ The Prophetic Tradition of the Ship]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger of Allāh said: The example of my household in you is like that of Nūh’s ark, whoever rides it is saved and whoever falls behind shall drown. The example of my household is only like that of the gate of unburdening for Banū Isra’īl, whoever enters is forgiven.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I said: Are these the authentic and agreed upon narrations you kept promising?<\/p>\n<p style=\"text-align: justify;\">The first narration is not authentic rather it’s a lie which was weakened by al-Dhahabī<a href=\"#_ftn181\" name=\"_ftnref181\">[181]<\/a>, Ibn Kathīr<a href=\"#_ftn182\" name=\"_ftnref182\">[182]<\/a>, al-Albānī<a href=\"#_ftn183\" name=\"_ftnref183\">[183]<\/a>, al-Wādi`ī<a href=\"#_ftn184\" name=\"_ftnref184\">[184]<\/a> and others.<\/p>\n<p style=\"text-align: justify;\">The narration contains the following people:<\/p>\n<p style=\"text-align: justify;\">-Mufaddal bin Ṣāliḥ: Bukhārī and Abū Ḥātim said his narrations are rejected.<\/p>\n<p style=\"text-align: justify;\">-Ḥanash al-Kinānī: Bukhārī said they criticized his narrations, Nasā’ī said he isn’t strong and Ibn Hibbān said: He narrates exclusively from `Alī things that do not resemble the narrations of the trusted ones.<\/p>\n<p style=\"text-align: justify;\">-Abū Isḥāq al-Sabī`ī: Reliable but is a Mudallis who didn’t declare hearing.<\/p>\n<p style=\"text-align: justify;\">As for the second narration, al-Haythamī said: Ṭabarānī narrated it in al-Ṣaghīr and Awṣaṭ and in it is a group of narrators I didn’t recognize.<a href=\"#_ftn185\" name=\"_ftnref185\">[185]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>58- Tijani wrote on pg.195 [Then I Was Guided \/ The Correct Prophetic Traditions which Indicate the Fact that it is Compulsory to Follow the Ahl al Bayt \/ The Prophetic Tradition: “He Who Wishes to Live Like Me”]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger said: “Whoever wishes to live like me, die like me and dwell in the garden of Eden planted by my Lord, then let him love `Alī and love his lover and follow my household after me for they are my progeny that are created from the same clay as I…”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Tijani said: It’s worthy of noting here that at the beginning of the research I had doubts about the authenticity of this Ḥadīth. I found it too much to handle as it contained threats to those who opposed `Alī and the household, especially since this report is explicit. The effect diminished when I went through Al-Iṣābah by Ibn Ḥajar who commented on it saying: “In the chain is Yaḥyā bin Ya`lā al-Muḥāribī and he is terribly weak.” Ibn Ḥajar thus removed some of the issues I had since it seemed that Yaḥyā was an untrusted narrator who made fabricated this narration. However, Allāh wanted to show me the full truth and so one day I read a book called Munāqashāt `Aqā’idiyyah fi Maqālāt Ibrahīm al-Jabhān and I learned therein that Yaḥyā al-Muḥāribī is a reliable transmitter that is accepted by both Muslim and Bukhārī. What is the purpose of all this falsification, deception and aggression on a man who was considered to be a reliable transmitter by the authors of the Ṣaḥīḥs? …Ibn Ḥajar branded him as feeble for no other reason than his narration regarding love for `Alī.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani went into detail about this narration and criticized Ibn Ḥajar, accusing him in his religion and blamed him for forgery. We need to go over several points with Tijani now.<\/p>\n<p style=\"text-align: justify;\">First point: The narration is not authentically attributed to the Prophet (peace be upon him). It is reported by al-Ḥākim.<a href=\"#_ftn186\" name=\"_ftnref186\">[186]<\/a> Al-Ṭabarānī.<a href=\"#_ftn187\" name=\"_ftnref187\">[187]<\/a> Al-Haythamī<a href=\"#_ftn188\" name=\"_ftnref188\">[188]<\/a> and Abū Nu`aym<a href=\"#_ftn189\" name=\"_ftnref189\">[189]<\/a>, all from the path of Yaḥyā bin Abī Ya`lā al-Aslamī who is very weak, and not al-Muḥāribī.<\/p>\n<p style=\"text-align: justify;\">Second point: As you’ve just seen, this isn’t from the narration of Yaḥyā bin Ya`lā al-Muḥāribī. Tijani and others are incapable of producing this narration from the path of Al-Muḥāribī.<\/p>\n<p style=\"text-align: justify;\">Third point: His statement: “Ibn Ḥajar branded him as feeble for no other reason than this narration.” Of course this is a lie since al-Muḥāribī never narrated it!<\/p>\n<p style=\"text-align: justify;\">Fourth point: Tijani claimed that this narration is explicit and cannot be interpreted in any other way and that it contains threats to the extent that he doubted its authenticity. This is an exaggeration and it does not change the truth.<\/p>\n<p style=\"text-align: justify;\">Fifth point: Tijani claimed he never found this except after researching and reading the book by al-Jabhān but this is a lie. Why? This is obvious since Tijani mentioned that he read “al-Murāja`āt” and found it amazing and couldn’t let go of it. He also mentioned that he revised that book multiple times.<a href=\"#_ftn190\" name=\"_ftnref190\">[190]<\/a><\/p>\n<p style=\"text-align: justify;\">`Abdul-Ḥusayn the author of al-Murāja`āt had mentioned this issue in his book and mentioned that Ibn Ḥajar stated: “In the chain is al-Muḥāribī and he is terribly weak.” `Abdul-Ḥusayn replied by saying al-Muḥāribī is reliable. However, he was incapable, just like Tijani, to produce a single chain for the report containing al-Muḥāribī.<\/p>\n<p style=\"text-align: justify;\">The whole story is that Tijani wants to deceive the reader into believing that he had researched and read books before reaching the truth, as if he found the truth out on his own.<\/p>\n<p style=\"text-align: justify;\">What makes things clearer is that Tijani copied the statement of the author of al-Murāja`āt word for word. Whereas, the story about researching and looking into it himself in the Ṣaḥīḥayn and al-Iṣābah are all from lies. Truly, the rope of lies are short.<\/p>\n<p style=\"text-align: justify;\">Sixth point: Why did Ibn Ḥajar say al-Muḥāribī is terribly weak when he is reliable? There are two possibilities:<\/p>\n<p style=\"text-align: justify;\">One: An error in printing or copying.<\/p>\n<p style=\"text-align: justify;\">Two: The likelier of the two is that Ibn Ḥajar confused al-Muḥāribī with al-Aslamī, since both are called Yaḥyā bin Ya`lā. So he mistakenly wrote al-Muḥāribī instead of al-Aslamī and only the Glorious One is free from error. The evidence for this possibility is that Ibn Ḥajar did in fact declare that al-Muḥāribī in is trustworthy in his book al-Taqrīb.<\/p>\n<p style=\"text-align: justify;\">`Abdul-Ḥusayn, Tijani and their comrades only attacked al-Ḥafidh Ibn Ḥajar since they love fishing in troubled waters, but Allāh willed for the truth to remain clear.<\/p>\n<p style=\"text-align: justify;\"><u>59- Tijani said on pg.198 [Then I Was Guided \/ The Correct Prophetic Traditions which Indicate the Fact that it is Compulsory to Follow the Ahl al Bayt \/ The Prophetic Tradition: “He Who Wishes to Live Like Me”]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>An example is the narration of: “The caliphs after me are twelve, all of them are from Quraysh.” In a variation of the narration, it states that “all are from Banū Hāshim”.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>These reports are found in Bukhārī, Muslim and all Ṣaḥīḥs of Ahlul-Sunnah wal-Jamā`ah.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: May Allāh destroy the liars. The narration of: “The caliphs after me are twelve, all of them are from Quraysh,” is popular, but this isn’t the correct text. Rather, what the popular variation states that “the affairs of the people will continue to be conducted as long as they’re ruled by twelve men, all of them from Quraysh.”<\/p>\n<p style=\"text-align: justify;\">There are also other versions and there is no harm in mentioning them:<\/p>\n<p style=\"text-align: justify;\">-This matter shall not come to pass until twelve caliphs come to rule, all from Quraysh.<\/p>\n<p style=\"text-align: justify;\">-Islam shall remain glorious until twelve caliphs pass, all of them from Quraysh.<\/p>\n<p style=\"text-align: justify;\">-The religion will continue to be upright until the hour or until you’ve been ruled by twelve caliphs, all of them from Quraysh.<\/p>\n<p style=\"text-align: justify;\">-This religion will remain glorious and resilient until twelve caliphs, all from Quraysh.<a href=\"#_ftn191\" name=\"_ftnref191\">[191]<\/a><\/p>\n<p style=\"text-align: justify;\">Perhaps you have noticed a couple of things dear reader:<\/p>\n<p style=\"text-align: justify;\">One: The difference in the texts between what is written in Ṣaḥīḥ Muslim compared to what Tijani wrote.<\/p>\n<p style=\"text-align: justify;\">Two: None of these narrations include “all of them are from Banū Hāshim”. This was from Tijani’s endless sack of lies, as it seems.<\/p>\n<p style=\"text-align: justify;\">Regarding the first matter, you saw that the correct texts do not imply what Tijani wishes for us to believe for several reasons:<\/p>\n<p style=\"text-align: justify;\">-The narration states that those twelve will be caliphs who will rule the people.<\/p>\n<p style=\"text-align: justify;\">&#8211; None of the men Shī`ah believe in ruled except `Alī and Ḥasan.<\/p>\n<p style=\"text-align: justify;\">-The narration states that religion will remain in a state of glory until the rule of these twelve comes to pass. However, Shī`ah believe the 12<sup>th<\/sup> man never came out, yet Muslims are living in disgrace and weakness, and Allāh knows that the Prophet (peace be upon him) never lied nor was he accused of lying.<\/p>\n<p style=\"text-align: justify;\">A questioner might ask: Is it a coincidence that the Prophet (peace be upon him) said, “Until twelve rule,” or, “until twelve receive authority over Muslims,” and that the number of Shī`ah divine leaders is also twelve?<\/p>\n<p style=\"text-align: justify;\">Answer: It definitely is no coincidence, since the earliest of Shī`ah never believed in the leadership of twelve men in specific and that is why they split into many sects. Some of them only believed in `Alī’s divine leadership and they’re called Saba’iyyah. Another group believed in his divine leadership and that of his children Ḥasan, Ḥusayn and Muḥammad, and they’re called Kaysāniyyah. Another group believed in the divine leadership of these men until Ja`far bin Muḥammad and stopped at this number. As for Twelvers, they believe in the leadership of the Awaited One.<\/p>\n<p style=\"text-align: justify;\">Other teams also existed with many differences, so whoever wishes to learn more can refer to the book of al-Nawbakhtī about Shī`ah sects.<\/p>\n<p style=\"text-align: justify;\">You O’ dear brother see that the belief in the twelve came very late, otherwise the early Shī`ah themselves would not have differed this much. Those narrations have only been invented a while after the Prophet (peace be upon him) and most of the Shī`ah Imams had already passed away.<a href=\"#_ftn192\" name=\"_ftnref192\">[192]<\/a><\/p>\n<p style=\"text-align: justify;\">It has become clear, dear reader, that the Shī`ah themselves have attempted to match the number of their leaders to the number uttered by the Prophet (peace be upon him) in that narration.<\/p>\n<p style=\"text-align: justify;\">Finally: The authentic report says: “All of them are from Quraysh,” and the Prophet (peace be upon him) would never mention what is general if he intended what is more specific. This opposes eloquence and clarity of speech; these are two major qualities of our Prophet (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">For instance, if I were to say, “I shall offer a Dirham for every Arab.” Then, when an Egyptian comes asking for a Dirham I tell him, “I’m sorry I meant the Syrians only.” He would accuse me of foolishness and idiocy and yell, “Well why didn’t you say: For every Syrian, then!?”<\/p>\n<p style=\"text-align: justify;\">If the Prophet (peace be upon him) had meant `Alī and his children, he would have simply said, “They are `Alī and his children.” Even if he said: “All of them are from Banū Hāshim,” it wouldn’t have been clear, since they were many, and Quraysh are more numerous.<\/p>\n<p style=\"text-align: justify;\">If Tijani and his likes argue based on the similarity between both numbers, then what about the narration by Imam Muslim, in which the Messenger (peace be upon him) says: “In my nation are twelve hypocrites”<a href=\"#_ftn193\" name=\"_ftnref193\">[193]<\/a>?<\/p>\n<p style=\"text-align: justify;\"><u>60- Tijani wrote on pg.200 [Then I Was Guided \/ The Correct Prophetic Traditions which Indicate the Fact that it is Compulsory to Follow the Ahl al Bayt \/ The Prophetic Tradition: “He Who Wishes to Live Like Me”]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Bukhārī had reported in his Ṣaḥīḥ, in the Chapter of Wills, as well as Muslim in his Ṣaḥīḥ, in the Chapter of Wills, that it was mentioned to `Ā’ishah that the Prophet (peace be upon him) had passed his will to `Ali.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He cut off a part of the narration. May Allāh treat him as he deserves!<\/p>\n<p style=\"text-align: justify;\">His example is like one who takes this verse: {And they say, &#8216;None shall enter Paradise except that they be Jews or Christians.&#8217; Such are their fancies. Say: &#8216;Produce your proof, if you speak truly.&#8217;} [2:111]<\/p>\n<p style=\"text-align: justify;\">Then one would argue that Allāh mentions in His book that the Jews and Christians only enter heaven, without continuing the rest of the verse and how Allāh responds to this claim.<\/p>\n<p style=\"text-align: justify;\">Tijani, here, tried to do this. He said when mentioning `Ā’ishah that the Prophet (peace be upon him) passed a will to `Alī without continuing the narrative. However, I shall continue it for him: Al-Aswad bin Yazīd said: “They mentioned to `Ā’ishah that `Alī was made to be the executioner of the Prophet’s (peace be upon him) will. She asked: ‘When did he pass him a will? I was resting him (peace be upon him) on my chest, then he asked for a bucket and slid himself to sleep on my lap and passed away without me noticing. When then did he pass this will?’”<a href=\"#_ftn194\" name=\"_ftnref194\">[194]<\/a><\/p>\n<p style=\"text-align: justify;\">So she denies those that said that “the Messenger (peace be upon him) passed a will to `Alī.”<\/p>\n<p style=\"text-align: justify;\"><u>61- Tijani wrote on pg.208 [Who Created the Term: Ahlul Sunnah?]<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger of Allāh said about his household: “Do not precede them and perish, nor abandon them and perish. Do not teach them as they are more knowledgeable than you.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This narration is a lie upon the Prophet (peace be upon him), so please remind yourself dear reader about Tijani’s promise to not rely on anything except what was agreed upon by Sunnah and Shī`ah, and that he only uses as evidence that which is authentic. With this in mind you will know how much of a deceitful liar Tijani really is.<\/p>\n<p style=\"text-align: justify;\">The report was mentioned by al-Haythamī and it contains Ḥakīm bin Jubayr.<a href=\"#_ftn195\" name=\"_ftnref195\">[195]<\/a><\/p>\n<p style=\"text-align: justify;\">Aḥmad said: “He is weak and rejected.” Al-Dāraqutnī said: “Abandoned.” Shu`bah said: “I fear the torment of the fire should I narrate from him.” Jawzajānī said: “Liar.”<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> He means a young Shī`ah boy he met at a religious Shī`ah school in Najaf.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Meaning, it isn’t found in the reliable books or the unreliable ones.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Duḥā al-Islam 3\/212<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Dhuhr-ul-Islam 4\/113<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Duḥā al-Islam 3\/219<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Ibid 3\/217<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Ibid 3\/210<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Ibid 3\/220<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Taqiyyah: Means dissimilation, it is the Shī`ah practice of lying or faking certain actions to save one’s self, to win people’s hearts or for any multitude of benefits<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Tashayyu` is the Arabic equivalent of writing “Shī`ahsm”<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Check the book “`Alaqah bayn al-Shi`ah wal-Tasawwuf” by Dr. Falah Isma`il<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Bayan-ul-Shirk wa Wasa’iluhu `ind al-Hanafiyyah pg.32<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Bayan-ul-Shirk wa Wasa’iluhu `ind al-Hanabilah pg.14<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Arabic proverb<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Bidāyah wal-Nihāyah 13\/213-217,283<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> Rawdat-ul-Jannat fi Ahwal al-`Ulama’ wal-Sadat 1\/300-301<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Hukumah al-Islamiyyah pg.142<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> Al-Anwar al-Nu`maniyyah 2\/308<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> Al-Khomayniyyah Warithat al-Harakat-ul-Haqidah pg.73<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> Al-I`tida’at-ul-Batiniyyah `ala al-Muqaddasat al-Islamiyyah pg.160<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> Brotokolat Ayyam Qum pg.63<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> Dhahara al-Islam 4\/120-121<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref23\" name=\"_ftn23\">[23]<\/a> Wa Ja’a Dawr-ul-Majus 1\/478<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref24\" name=\"_ftn24\">[24]<\/a> Amal wal-Mukhayyamat-ul-Filistiniyyah pg.53 onwards<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref25\" name=\"_ftn25\">[25]<\/a> Brotokolat Ayyam Qum pg.63 onwards<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref26\" name=\"_ftn26\">[26]<\/a> In the year 1987<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref27\" name=\"_ftn27\">[27]<\/a> Risalat-ul-Iman pg.323<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref28\" name=\"_ftn28\">[28]<\/a> Bihar al-Anwar 45\/329<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref29\" name=\"_ftn29\">[29]<\/a> Rijal al-Kashshi pg.21<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref30\" name=\"_ftn30\">[30]<\/a> Bihar al-Anwar 41\/14<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref31\" name=\"_ftn31\">[31]<\/a> Founder of what they call today “Wahhābi” movement. Born in 1115 hijri in `Uyaynah, studied in Hijāz, Shām and Basarah. He called to monotheism and suppression of innovations. He debated with strong arguments and evidence and gained supporters and followers. His opponents accused him of Takfir and other grotesque matters. The neutral person must read his books before judging, such as “al-Tawhīd”, “Kashf-ul-Shubuhat” and “Mukhtasar-ul-Sīrah”. Whoever followed his way is branded Wahhābī but his followers never called themselves that. He died in 1206 Hijri.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref32\" name=\"_ftn32\">[32]<\/a> Karamat: Plural of Karāmah, special blessings that Allāh sends to his beloved friends if He wishes<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref33\" name=\"_ftn33\">[33]<\/a> Kashf-ul-Shubuhāt pg.111 found within the book Al-Tarq ila al-Jannah<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref34\" name=\"_ftn34\">[34]<\/a> As he claimed in his book The Shi’ah are the Real Ahlul-Sunnah and it shall be answered<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref35\" name=\"_ftn35\">[35]<\/a> A summary from “al-Shifa” 2\/784<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref36\" name=\"_ftn36\">[36]<\/a> Ibid 2\/848<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref37\" name=\"_ftn37\">[37]<\/a> Fath-ul-Bari: Kitāb Ahādith-ul-Anbiyā’ #3483<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref38\" name=\"_ftn38\">[38]<\/a> His book Daqā’iq-ul-Tafsīr<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref39\" name=\"_ftn39\">[39]<\/a> Al-Qawl-ul-Badī` pg.46<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref40\" name=\"_ftn40\">[40]<\/a> Sifat Salat-ul-Nabi by Albānī pg.45-55<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref41\" name=\"_ftn41\">[41]<\/a> Why I chose the Madhab of the Shī`ah by al-Antaqi pg.2 (This man is another convert to Shī`asm like Tijani)<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref42\" name=\"_ftn42\">[42]<\/a> This is what is established in books of Rijāl so return to Ja`far’s bio in al-Tahdhīb, al-Jarḥ wal-Ta`dīl &amp; al-Mīzan<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref43\" name=\"_ftn43\">[43]<\/a> Mir’āt-ul-Anwār 2<sup>nd<\/sup> intro pg.36<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref44\" name=\"_ftn44\">[44]<\/a> Mashāriq-ul-Shumūs pg.126<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref45\" name=\"_ftn45\">[45]<\/a> Fasl-ul-Khitāb pg.27<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref46\" name=\"_ftn46\">[46]<\/a> Awa’il al-Maqālāt pg.98<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref47\" name=\"_ftn47\">[47]<\/a> Al-Iḥtijāj 1\/155<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref48\" name=\"_ftn48\">[48]<\/a> Al-Durar Al-Najafiyyah pg.298<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref49\" name=\"_ftn49\">[49]<\/a> Al-Anwār al-Nu`māniyah<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref50\" name=\"_ftn50\">[50]<\/a> Minhāj-ul-Najāt pg.48<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref51\" name=\"_ftn51\">[51]<\/a> Tanqīh-ul-Maqāl 1\/208<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref52\" name=\"_ftn52\">[52]<\/a> Al-Mughnī 1\/305<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref53\" name=\"_ftn53\">[53]<\/a> These stones are made from the sands of Karbalā’.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref54\" name=\"_ftn54\">[54]<\/a> Al-Shī`ah wal-Taṣhīh pg.15<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref55\" name=\"_ftn55\">[55]<\/a> Bihār al-Anwār 98\/129<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref56\" name=\"_ftn56\">[56]<\/a> Ibid 98\/131<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref57\" name=\"_ftn57\">[57]<\/a> Ibid 98\/118<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref58\" name=\"_ftn58\">[58]<\/a> With modification from “Qa`idah Jalilah fil-Tawassul” pg.217-220<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref59\" name=\"_ftn59\">[59]<\/a> Sahih Muslim Kitab-ul-Masajid 23<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref60\" name=\"_ftn60\">[60]<\/a> Al-Istibṣār 2\/134<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref61\" name=\"_ftn61\">[61]<\/a> Wasa’il al-Shi`ah 7\/337<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref62\" name=\"_ftn62\">[62]<\/a> Siyar A`lām 5\/339<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref63\" name=\"_ftn63\">[63]<\/a> Ibid 8\/79<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref64\" name=\"_ftn64\">[64]<\/a> Tabaqāt al-Shafi`iyyah al-Kubrā 8\/216<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref65\" name=\"_ftn65\">[65]<\/a> `Uqud Durriyah pg.132-184<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref66\" name=\"_ftn66\">[66]<\/a> Siyar A`lām 7\/144<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref67\" name=\"_ftn67\">[67]<\/a> Ibid 7\/144<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref68\" name=\"_ftn68\">[68]<\/a> Miḥnat-ul-Imam Aḥmad pg.3<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref69\" name=\"_ftn69\">[69]<\/a> Tijani knew the man was a Shī`ah since it’s known that Shī`ah are attached to burial sites and they hold on to the dead and wail near their graves.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref70\" name=\"_ftn70\">[70]<\/a> Bihār al-Anwār 98\/134<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref71\" name=\"_ftn71\">[71]<\/a> Mīzān-ul-I`tidāl pg.2 the author mentioned those whose companionship was disputed like Bishr and Marwan then concluded that the two were not Companions.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref72\" name=\"_ftn72\">[72]<\/a> Sahih al-Bukhārī – Kitāb-ul-Tafsīr #4818<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref73\" name=\"_ftn73\">[73]<\/a> Minhaj-ul-Sunnah 4\/25<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref74\" name=\"_ftn74\">[74]<\/a> Al-Muraja`at, letter 90, pg.644 in footnote<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref75\" name=\"_ftn75\">[75]<\/a> To be with the Truthful pg.118<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref76\" name=\"_ftn76\">[76]<\/a> Musnad Aḥmad, researcher Aḥmad Shākir 2\/84 #693<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref77\" name=\"_ftn77\">[77]<\/a> Reported by Bukhārī and Muslim<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref78\" name=\"_ftn78\">[78]<\/a> Fatḥ-ul-Bāri 8\/133<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref79\" name=\"_ftn79\">[79]<\/a> Mukhtasar al-Tuḥfah al-Ithnā `Ashariyyah pg.250<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref80\" name=\"_ftn80\">[80]<\/a> Al-Shifā 2\/886<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref81\" name=\"_ftn81\">[81]<\/a> Al-Mufahhim 4\/559<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref82\" name=\"_ftn82\">[82]<\/a> Sharḥ Saḥīḥ Muslim 11\/93<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref83\" name=\"_ftn83\">[83]<\/a> Fatḥ-ul-Bārī 8\/133<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref84\" name=\"_ftn84\">[84]<\/a> Al-Mufahhim 4\/559<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref85\" name=\"_ftn85\">[85]<\/a> Ibid 4\/560<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref86\" name=\"_ftn86\">[86]<\/a> Muslim #2747<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref87\" name=\"_ftn87\">[87]<\/a> Al-Shifā 2\/887, Al-Mufahhim 2\/559, Sharḥ Muslim 11\/91<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref88\" name=\"_ftn88\">[88]<\/a> Fatḥ-ul-Bārī 1\/209<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref89\" name=\"_ftn89\">[89]<\/a> Copied with modification from “Al-Intisār lil-Ṣaḥbi wal-Āl” pg.286-291<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref90\" name=\"_ftn90\">[90]<\/a> Jāmi` Aḥkām-ul-Qur’ān 16\/395<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref91\" name=\"_ftn91\">[91]<\/a> Fasl-ul-Khiṭāb pg.211<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref92\" name=\"_ftn92\">[92]<\/a> Tafsīr al-Nasafī 4\/164<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref93\" name=\"_ftn93\">[93]<\/a> Zād-ul-Masīr 7\/450<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref94\" name=\"_ftn94\">[94]<\/a> Tafsīr-ul-Qur’ān al-`Adhīm 7\/344<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref95\" name=\"_ftn95\">[95]<\/a> I`rāb-ul-Qur’ān 26\/272<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref96\" name=\"_ftn96\">[96]<\/a> Imlā’ ma Manna bihi al-Raḥmān pg.128<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref97\" name=\"_ftn97\">[97]<\/a> Gharā’ib al-Qur’ān on the margins of Tafsīr al-Ṭabarī 26\/69<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref98\" name=\"_ftn98\">[98]<\/a> Look for the book “Ḥuqba min al-Tārīkh” by our author for the detailed story of Ghadir<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref99\" name=\"_ftn99\">[99]<\/a> Musnad Aḥmad 4\/281<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref100\" name=\"_ftn100\">[100]<\/a> Rafidi: A rejecter, a derogatory term attributed to extremist Shī`ah.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref101\" name=\"_ftn101\">[101]<\/a> Mustadrak al-Ḥākim 3\/121<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref102\" name=\"_ftn102\">[102]<\/a> Tadlīs: A person who doesn’t declare hearing directly from his teachers making his narrations unreliable due to the possibility that he narrated from an unreliable intermediary source.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref103\" name=\"_ftn103\">[103]<\/a> In the old days, the Shī`ah was one who preferred `Alī over `Uthmān or even over Abū Bakr and `Umar. He may have certain innovations, but they are bearable if he’s known to be truthful. However, if he narrates what supports his sect then it won’t be accepted, since they were popular for lying and Taqiyyah.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref104\" name=\"_ftn104\">[104]<\/a> Bihār al-Anwār 43\/89<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref105\" name=\"_ftn105\">[105]<\/a> Ṣaḥīḥ Muslim &#8211; Kitāb al-Fadā’il #2424<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref106\" name=\"_ftn106\">[106]<\/a> Minhāj al-Sunnah 5\/14<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref107\" name=\"_ftn107\">[107]<\/a> Minhāj al-Sunnah 7\/71<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref108\" name=\"_ftn108\">[108]<\/a> Al-Kāfī 1\/504<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref109\" name=\"_ftn109\">[109]<\/a> Ṣaḥīḥ Muslim &#8211; Kitāb al-Fadā’il #2424<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref110\" name=\"_ftn110\">[110]<\/a> Mukhtasar al-Tuhfah al-Ithna `Ashariyyah pg.649<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref111\" name=\"_ftn111\">[111]<\/a> Tarīkh Ṭabarī 3\/477<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref112\" name=\"_ftn112\">[112]<\/a> Refer to his biography in Tahdhīb-ul-Tahdhīb and Mīzān-ul-I`tidāl.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref113\" name=\"_ftn113\">[113]<\/a> Al-Bidāyah wal-Nihāyah 7\/342-343<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref114\" name=\"_ftn114\">[114]<\/a> Tarīkh Al-Ṭabarī 3\/438<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref115\" name=\"_ftn115\">[115]<\/a> Al-Bidāyah wal-Nihāyah 7\/199<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref116\" name=\"_ftn116\">[116]<\/a> Tarīkh Al-Ṭabarī 3\/439<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref117\" name=\"_ftn117\">[117]<\/a> Ibid 3\/476<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref118\" name=\"_ftn118\">[118]<\/a> Majlisī narrated that `Alī used to stay behind the Prophet (peace be upon him) on Badr. Biḥār al-Anwār 16\/232<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref119\" name=\"_ftn119\">[119]<\/a> With modifications from “Minhāj-ul-Sunnah” 8\/77 and onwards<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref120\" name=\"_ftn120\">[120]<\/a> Tarīkh al-Ṭabarī 2\/455<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref121\" name=\"_ftn121\">[121]<\/a> Then he mentions the story of al-Saqīfah until the part about Sa`d.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref122\" name=\"_ftn122\">[122]<\/a> Musnad Aḥmad 1\/5<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref123\" name=\"_ftn123\">[123]<\/a> Sunan Abū Dāwūd – Kitāb-ul-Libās #4106<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref124\" name=\"_ftn124\">[124]<\/a> Ṣaḥīḥ Bukhārī – Kitāb-ul-Istitābah #6922<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref125\" name=\"_ftn125\">[125]<\/a> Ibid – Kitāb al-Tahajjud #1127<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref126\" name=\"_ftn126\">[126]<\/a> Ṣaḥīḥ Muslim – Kitāb-ul-Fadā’il #93<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref127\" name=\"_ftn127\">[127]<\/a> Ibid – Kitāb-ul-Fada’il #96<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref128\" name=\"_ftn128\">[128]<\/a> Ṣaḥīḥ Bukhārī – Kitāb-ul-Ṣulh #2698<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref129\" name=\"_ftn129\">[129]<\/a> Biḥār al-Anwār 38\/328<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref130\" name=\"_ftn130\">[130]<\/a> Musnad Aḥmad 1\/97<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref131\" name=\"_ftn131\">[131]<\/a> Sahih Bukhārī – Kitab al-Maghazi #4033<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref132\" name=\"_ftn132\">[132]<\/a> Ṣaḥiḥ Muslim – Kitāb-ul-Hayḏ #17<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref133\" name=\"_ftn133\">[133]<\/a> Biḥār al-Anwār 40\/2<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref134\" name=\"_ftn134\">[134]<\/a> Kāfī 7\/181<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref135\" name=\"_ftn135\">[135]<\/a> Biḥār al-Anwār 43\/82<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref136\" name=\"_ftn136\">[136]<\/a> Ibid 39\/207<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref137\" name=\"_ftn137\">[137]<\/a> Ibid 39\/348 Al-Biḥār is considered from the eight mainly relied upon books according to Twelver Shī`ah, its author is viewed as one of the biggest of their scholars and was awarded the title: Baqir `Ulūm-ul-A’immah.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref138\" name=\"_ftn138\">[138]<\/a> Ibid 41\/166<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref139\" name=\"_ftn139\">[139]<\/a> Ibid 41\/293<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref140\" name=\"_ftn140\">[140]<\/a> Kāfī 7\/201<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref141\" name=\"_ftn141\">[141]<\/a> Biḥār al-Anwār 4\/303<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref142\" name=\"_ftn142\">[142]<\/a> Kashf-ul-Ghummah 1\/467<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref143\" name=\"_ftn143\">[143]<\/a> Since they claim `Umar is a disbeliever.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref144\" name=\"_ftn144\">[144]<\/a> Biḥār al-Anwār 39\/194<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref145\" name=\"_ftn145\">[145]<\/a> Ṣaḥiḥ Bukhārī – Kitāb-ul-Imān #33, Ṣaḥiḥ Muslim – Kitāb-ul-Īmān #106<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref146\" name=\"_ftn146\">[146]<\/a> We had previously clarified this man’s condition in section 47<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref147\" name=\"_ftn147\">[147]<\/a> Ṣaḥiḥ Bukhārī – Kitāb-ul-Fadā’il #3700<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref148\" name=\"_ftn148\">[148]<\/a> Al-Maqāṣid al-Ḥasanah pg.170<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref149\" name=\"_ftn149\">[149]<\/a> Kashf-ul-Khafā 1\/235<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref150\" name=\"_ftn150\">[150]<\/a> Tarīkh Baghdād 11\/205<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref151\" name=\"_ftn151\">[151]<\/a> Sunan al-Tirmidhī – Kitāb-ul-Manāqib #3723<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref152\" name=\"_ftn152\">[152]<\/a> Al-Du`afā’ al-Kabīr 3\/150<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref153\" name=\"_ftn153\">[153]<\/a> Al-Majrūhīn 2\/151<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref154\" name=\"_ftn154\">[154]<\/a> Al-`Ilal 3\/247<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref155\" name=\"_ftn155\">[155]<\/a> Al-Mawdū`āt 1\/349<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref156\" name=\"_ftn156\">[156]<\/a> Fath-ul-Malik-ul-`Alī pg.51<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref157\" name=\"_ftn157\">[157]<\/a> Majmū` al-Fatāwā 18\/377<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref158\" name=\"_ftn158\">[158]<\/a> Talkhīs al-Mustadrak 3\/126<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref159\" name=\"_ftn159\">[159]<\/a> Da`īf-ul-Jāmi` 1416<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref160\" name=\"_ftn160\">[160]<\/a> Ṣaḥiḥ Bukhārī – Kitāb-ul-Manāqib #904, Ṣaḥiḥ Muslim – Kitāb-ul-Fadā’il #2<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref161\" name=\"_ftn161\">[161]<\/a> Minḥāj-ul-Sunnah 7\/500 and onwards<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref162\" name=\"_ftn162\">[162]<\/a> Al-Faṣl fil-Milal wal-Niḥal 4\/212<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref163\" name=\"_ftn163\">[163]<\/a> Some alleged that the Messenger (peace be upon him) said this in the parting point of all pilgrims<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref164\" name=\"_ftn164\">[164]<\/a> Murāja`āt – letter #12 pg.140<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref165\" name=\"_ftn165\">[165]<\/a> Lisān al-`Arab 15\/407<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref166\" name=\"_ftn166\">[166]<\/a> Minhāj al-Sunnah 7\/313 and onwards.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref167\" name=\"_ftn167\">[167]<\/a> Tahdhīb al-Tahdhīb 8\/66<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref168\" name=\"_ftn168\">[168]<\/a> Mīzān al-I`tidāl 2\/328 under name Dirār bin Ṣurad<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref169\" name=\"_ftn169\">[169]<\/a> Bidāyah wal-Nihāyah 3\/38<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref170\" name=\"_ftn170\">[170]<\/a> The narration states that those who were invited were forty in number.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref171\" name=\"_ftn171\">[171]<\/a> Tuhr: White discharge signaling the end of a woman’s menses.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref172\" name=\"_ftn172\">[172]<\/a> Tarīkh Ṭabarī 2\/502<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref173\" name=\"_ftn173\">[173]<\/a> Bidāyah wal-Nihāyah 6\/326<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref174\" name=\"_ftn174\">[174]<\/a> This was mentioned by Shī`ah scholar Ibn Tāwūs: “Banū Tamīm disbelieved and united behind Mālik bin Nuwayrah al-Yarbū`ī” Refer to Fasl-ul-Khitāb pg.105<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref175\" name=\"_ftn175\">[175]<\/a> Lisān al-`Arab 1\/76<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref176\" name=\"_ftn176\">[176]<\/a> Bidāyah wal-Nihāyah 6\/326<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref177\" name=\"_ftn177\">[177]<\/a> Ibid 7\/117<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref178\" name=\"_ftn178\">[178]<\/a> Fatḥ-ul-Bārī – Kitāb Fadā’il al-Saḥābah #3757 and the full report has been transmitted by Ibn `Asākir 8\/15 and al-Silsilah al-Ṣaḥīḥah #1237<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref179\" name=\"_ftn179\">[179]<\/a> Al-Kāmil fil-Tārīkh 2\/242<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref180\" name=\"_ftn180\">[180]<\/a> Tārīkh Ṭabarī 5\/503<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref181\" name=\"_ftn181\">[181]<\/a> Mīzān al-I`tidāl 4\/167<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref182\" name=\"_ftn182\">[182]<\/a> Tafsīr al-Qur’ān 7\/191<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref183\" name=\"_ftn183\">[183]<\/a> Da`īf al-Jami` al-Saghīr #1972<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref184\" name=\"_ftn184\">[184]<\/a> Riyād-ul-Jannah pg.213<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref185\" name=\"_ftn185\">[185]<\/a> Majma` al-Zawā’id 9\/168<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref186\" name=\"_ftn186\">[186]<\/a> Mustadrak al-Ḥākim 3\/128<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref187\" name=\"_ftn187\">[187]<\/a> Mu`jam Kabīr 5\/67<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref188\" name=\"_ftn188\">[188]<\/a> Majma` al-Zawā’id 9\/108<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref189\" name=\"_ftn189\">[189]<\/a> Ḥilyat-ul-Awliyā’<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref190\" name=\"_ftn190\">[190]<\/a> Then I was Guided pg.87,159<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref191\" name=\"_ftn191\">[191]<\/a> Ṣaḥīḥ Muslim – Kitāb al-Imārah #1821-1822<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref192\" name=\"_ftn192\">[192]<\/a> See Ḥuqba min al-Tārīkh by the author of this book.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref193\" name=\"_ftn193\">[193]<\/a> Ṣaḥīḥ Muslim – Kitāb Ṣifāt al-Munāfiqīn #2779<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref194\" name=\"_ftn194\">[194]<\/a> Ṣaḥīḥ Bukhārī – Kitāb al-Waṣāyā #2741, Ṣaḥīḥ Muslim – Kitāb al-Waṣiyyah #1636<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref195\" name=\"_ftn195\">[195]<\/a> Majma`-ul-Zawā’id 9\/63-64<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Response to: Then I Was Guided by Sh. Uthman Al-Khamīs Translated by Hani Salhab Al-Tarabulsi *Note: The original page referencing provided by Sh. Uthman Al-Khamees was kept. Though, we have added the titles of the chapters in English from Tijani’s <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/06\/19\/response-to-then-i-was-guided\/\" title=\"Response to: Then I Was Guided\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10],"tags":[33],"class_list":{"0":"post-3299","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-books","8":"tag-tijani"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3299","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3299"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3299\/revisions"}],"predecessor-version":[{"id":3310,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3299\/revisions\/3310"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3299"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3299"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3299"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}