{"id":3314,"date":"2016-06-23T23:32:23","date_gmt":"2016-06-23T23:32:23","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3314"},"modified":"2017-02-14T13:05:18","modified_gmt":"2017-02-14T13:05:18","slug":"al-kulayni-and-tahreef","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/06\/23\/al-kulayni-and-tahreef\/","title":{"rendered":"Al-Kulayni and Tahreef"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3314\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Muhammad bin Ya`qub al-Kulayni is disputably the top Twelver Shia Hadith scholar to ever walk the earth. They trust him and honor him to no end, even going as far as bestowing upon him the title of &#8220;Thiqat-ul-Islam&#8221;. Al-Kulayni is the author of their main book of Hadith &#8220;al-Kafi&#8221; which is a large 8 volume collection of traditions and beliefs relied upon by the Twelvers throughout their history.<\/p>\n<p style=\"text-align: justify;\">However, is he a Muslim who believes in the authenticity of our holy book or is he on the other side of the fence?<\/p>\n<p style=\"text-align: justify;\">Twelvers will jump right up and shout: &#8220;It is the evil Wahhabi scholars who accuse Kulayni of Tahrif!!&#8221;<\/p>\n<p style=\"text-align: justify;\">Is this the truth though? We find out below,<\/p>\n<p style=\"text-align: justify;\"><strong>A- The biggest of Shia scholars testify that al-Kulayni clearly believes in Tahrif.<\/strong><\/p>\n<p style=\"text-align: justify;\">Shia leader al-Fayd al-Kashani writes in the sixth introduction of his book &#8220;Tafsir al-Safi&#8221;:<\/p>\n<p style=\"text-align: justify;\">[As for the belief of our teachers may Allah have mercy on them, then what is apparent from Thiqat-ul-Islam al-Kulayni is that he believed in the corruption of the Qur&#8217;an and that it suffered from deletions. This is because he narrated texts in this regard inside his book al-Kafi and never criticized them in any way, although he mentioned in the introduction of his book that he trusts whatever he narrates therein. The same can also be said about his teacher `Ali bin Ibrahim al-Qummi etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Shia leader Muhammad Baqir al-Majlisi writes in his large book &#8220;Mir&#8217;at-ul-`Uqul&#8221; 3\/31:<\/p>\n<p style=\"text-align: justify;\">[Our Companions differed regarding this (i.e Tahrif), al-Saduq ibn Babuwayh and a group held the opinion that the Qur’an is unchanged from how it was revealed and that nothing is missing. Whereas, al-Kulayni, Shaykh al-Mufid and a group of scholars, may Allah sanctify their souls, they believed that the complete Qur’an is with the Imams (as) and that what we have in our Book today is only a part of it.]<\/p>\n<p style=\"text-align: justify;\">Shia leader al-Nuri al-Tabrasi wrote in the third introduction of his popular book &#8220;Fasl-ul-Khitab&#8221;:<\/p>\n<p style=\"text-align: justify;\">[Mentioning the opinions of our scholars may Allah be pleased with them all, regarding whether the Qur&#8217;an was changed or unchanged. You must know that they have several opinions in this regard, two of which are famous: The first opinion is that distortions and deletions have occurred in it (i.e the Qur&#8217;an), this is the belief of our venerated scholar Ali bin Ibrahim al-Qummi, the teacher of al-Kulayni. He announced this explicitly at the beginning of his book of Tafsir and filled it with such narrations, while noting that he declared his commitment to only mentioning in it what he receives from his trusted teachers. This was also the belief of his student, Thiqat-ul-Islam al-Kulayni may Allah have mercy on him as attributed to him by a group of scholars. This is because al-Kulayni reported a large amount of explicit narrations in this regard (i.e Tahrif) in Kitab-ul-Hujjah especially in the chapter &#8220;Al-Nukat wal-Nutaf min al-Tanzil&#8221; as well as in Kitab-ul-Rawdah, he never objected to them nor did he give them a convenient interpretation. (&#8230;until he said&#8230;) This too, is the explicit belief of the trusted Muhammad bin Ibrahim al-Numani, al-Kulayni&#8217;s student and the author of the popular book &#8220;al-Ghaybah&#8221;, he mentioned it in his small book of Tafsir which he restricted only to mentioning the categories of verses, it serves as an explanation for the introduction of `Ali bin Ibrahim al-Qummi&#8217;s Tafsir.]<\/p>\n<p style=\"text-align: justify;\">This is confirmed in &#8220;Tafsir al-Qummi&#8221;, if you are to refer to the introduction of the researcher, their Shia scholar Al-Sayyid Tayyib al-Musawi al-Jaza&#8217;iri on pg.23-24:<\/p>\n<p style=\"text-align: justify;\">[As for the Shia, they agreed that there are no additions inserted into the Qur&#8217;an, in fact they claimed a consensus on this. As for deletions, a group of Imami scholars believed it they never took place and they strongly rejected this, such as al-Saduq, Sayyid al-Murtada, abu `Ali al-Tabrasi in &#8220;Majma al-Bayan&#8221; and al-Shaykh al-Tusi in &#8220;al-Tibyan&#8221;. However, it&#8217;s clear from the words of other scholars and early traditionalists as well as late ones, that they believed in deletions such as al-Kulayni, al-Barqi, al-`Ayyashi, al-Nu`mani, Furat bin Ibrahim, Ahmad bin abi Talib al-Tabrasi author of &#8220;al-Ihtijaj&#8221;, al-Majlisi, al-Sayyid al-Jaza&#8217;iri, al-Hurr al-`Amili, al-`Allamah al-Fatuni and al-Sayyid al-Bahrani. In order to prove their belief, they held on to the verses and narrations that cannot be overlooked. What reduces the shock is that the corruption that took place in their opinions is very small, it is restricted to the verses of love (towards the household) without changing any ruling or altering the general meaning that constitutes the soul of the Qur&#8217;an.]<\/p>\n<p style=\"text-align: justify;\">Their popular scholar al-Sayyid Habibullah al-Musawi al-Khu&#8217;i said in his book &#8220;Minhaj-ul-Bara`ah&#8221; 2\/198:<\/p>\n<p style=\"text-align: justify;\">[Majority of Akhbaris as reported by al-Sayyid al-Jaza&#8217;iri in his treatise &#8220;Manba`-ul-Hayah&#8221; and his book &#8220;al-Anwar&#8221; believed that corruption, addition and deletion have occurred. This opinion was held by Ali bin Ibrahim al-Qummi, his student Muhammad bin Ya`qub al-Kulayni, Shaykh Ahmad bin abi Talib al-Tabrasi and the grand scholar and traditionalist al-Majlisi may Allah sanctify their souls.]<\/p>\n<p style=\"text-align: justify;\">Their scholar Ayatullah al-Sayyid Yusuf al-Tabrizi said in &#8220;Durar al-Fawa&#8217;id&#8221; 1\/303:<\/p>\n<p style=\"text-align: justify;\">[As for the corruption, as in deletion, they have differed on it. What is popular among Usulis is that it never happened and this was adopted by a group of scholars such as al-Saduq in &#8220;al-I`tiqadat&#8221; among others. As for those who believed in distortion, they are a group of the ancient traditionalists such as al-Kulayni, his teacher `Ali bin Ibrahim al-Qummi the author of the commentary, al-Nu`mani, Sa`d bin `Abdullah al-Ash`ari as well as most Akhbaris. Some of our researchers have concluded that corruption took place through deletion, however this has not affected the verses which contain rulings as is the belief of al-Muhaqqiq abu al-Qasim bin Hasan al-Qummi in &#8220;al-Qawanin&#8221;.]<\/p>\n<p style=\"text-align: justify;\">Their scholar al-`Allamah Yusuf al-Bahrani says in &#8220;al-Durar al-Najafiyyah&#8221; 4\/66:<\/p>\n<p style=\"text-align: justify;\">[A group believed that it happened (i.e Tahrif), the respected and trusted `Ali bin Ibrahim al-Qummi has affirmed this with certainty in his commentary. It is also what&#8217;s apparent from his student al-Kulayni in &#8220;al-Kafi&#8221; where he reported a lot of narrations pointing to omissions and deletions without rejecting them nor offering another interpretation. This is also what&#8217;s apparent from the respected and trusted Ahmad bin abi Talib al-Tabrasi in &#8220;al-Ihtijaj&#8221; and it is also quite apparent in my own opinion. Our teacher, the traditionalist Shaykh `Abdullah bin Salih al-Bahrani has affirmed it with certainty as well in his book &#8220;Muniyat-ul-Mumarisin&#8221; and this was the chosen opinion by the teacher of the sect al-Mufid in &#8220;Ajwibat al-Masa&#8217;il al-Sarawiyyah&#8221;etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Their scholar Ayatullah Sayyid `Ali Fani Isfahani said in &#8220;Aara&#8217; Hawl al-Qur&#8217;an&#8221; pg.88:<\/p>\n<p style=\"text-align: justify;\">[The fifth question: Who are those that believe in Tahrif and what are their evidences?<\/p>\n<p style=\"text-align: justify;\">The answer is that a group of traditionalists and collectors of narrations have observed in our reports what appears to imply corruption through deletion so they believed in this. (&#8230;until he says&#8230;) This appears to be the opinion of al-Kulayni who narrated clear reports about it without making any comments. Al-Sayyid Ni`matullah al-Jaza&#8217;iri  also adopted the position of Tahrif in his two commentaries on the &#8220;Tahdhibayn&#8221; and he conducted a prolonged research concerning it in a treatise he called &#8220;Manba` al-Hayah&#8221;.]<\/p>\n<p style=\"text-align: justify;\">In addition to other well known Shia scholars who attributed this belief to al-Kulayni but we need not translate more quotes as the above are sufficient for us.<\/p>\n<p style=\"text-align: justify;\">We ask, after all this do the Shia laymen still insist that it is the &#8220;Wahhabies&#8221; who attribute Tahrif to your scholar? Or is it his own comrades who confirm his belief in Tahrif?<\/p>\n<p style=\"text-align: justify;\"><strong>B- Al-Kulayni reports many narrations in his book clearly implying Tahrif.<\/strong><\/p>\n<p style=\"text-align: justify;\">The man collected in his large book plenty of reports that clearly imply the distortion and corruption of Allah&#8217;s book.<\/p>\n<p style=\"text-align: justify;\">What is important to note here is that the author of al-Kafi has divided his book into three parts. The first part is called &#8220;Usul al-Kafi&#8221; and it contains the foundations and most important pillars in the belief system of the Twelvers, the second part is called &#8220;Furu` al-Kafi&#8221;  and it contains the branches and general laws of Twelver jurisprudence, the third part is the least important and is called &#8220;Rawdat-ul-Kafi&#8221; and it contains some stories and odd events.<\/p>\n<p style=\"text-align: justify;\">Al-Kulayni has designated a specific chapter called &#8220;Bab Fihi Nukatun wa Nutafun min al-Tanzil fil-Walayah&#8221; in which he collects a large number of such reports. Of course since Tahrif is from the foundations of his faith he includes this chapter in volume one of Usul al-Kafi.<\/p>\n<p style=\"text-align: justify;\">Other similar narrations will be scattered all throughout the eight volumes of al-Kafi, so let us list a few examples for you below:<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/414:<\/p>\n<p style=\"text-align: justify;\">[(with his chain) Abu Basir, from abi `Abdillah (as), regarding Allah&#8217;s saying: &#8220;And whoever obeys Allah and His Messenger in loving `Ali and loving of the leaders after him has certainly attained a great attainment&#8221; He (as) said: &#8220;This is how it was revealed.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Whereas the verse in our Qur&#8217;an today only says:<\/p>\n<p style=\"text-align: justify;\">{And whoever obeys Allah and His Messenger has certainly attained a great attainment} [33:71]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/416:<\/p>\n<p style=\"text-align: justify;\">[(with his chain) from `Abdullah bin Sinan, from abi `Abdillah (as) regarding Allah&#8217;s saying: &#8220;And We had already taken a promise from Adam concerning Muhammad, `Ali, Fatimah, Hasan, Husayn and the leaders from their progeny, but he forgot&#8221; He (as) said: &#8220;By Allah, this is the way it was revealed upon Muhammad (saw).&#8221;]<\/p>\n<p style=\"text-align: justify;\">Whereas the verse in our Qur&#8217;an today only says:<\/p>\n<p style=\"text-align: justify;\">{And We had already taken a promise from Adam before, but he forgot; and We found not in him determination.} [20:115]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/417:<\/p>\n<p style=\"text-align: justify;\">[(with his chain) from Jabir, from abi Ja`far (as), he said: &#8220;Jibril (as) revealed this verse to Muhammad (saw) like this: How wretched is that for which they sold themselves &#8211; that they would disbelieve in what Allah has revealed about `Ali through [their] outrage.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Whereas the verse in our Qur&#8217;an today only says:<\/p>\n<p style=\"text-align: justify;\">{How wretched is that for which they sold themselves &#8211; that they would disbelieve in what Allah has revealed through [their] outrage} [2:90]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/422:<\/p>\n<p style=\"text-align: justify;\">[(with his chain) from abu Basir, from abi `Abdillah (as) regarding Allah&#8217;s saying: &#8220;A questioner asked about a punishment bound to happen &#8211; To the disbelievers in `Ali&#8217;s love; of it there is no preventer.&#8221; He (as) said: &#8220;By Allah, this is how Jibril (as) revealed it to Muhammad (saw).&#8221;]<\/p>\n<p style=\"text-align: justify;\">Whereas the verse in our Qur&#8217;an today only says:<\/p>\n<p style=\"text-align: justify;\">{A questioner asked about a punishment bound to happen &#8211; To the disbelievers; of it there is no preventer.} [70:1-2]<\/p>\n<p style=\"text-align: justify;\">In fact, al-Kulayni has a chapter in his first volume called: &#8220;That nobody collected the entire Qur&#8217;an except the Imams (as)&#8221;<\/p>\n<p style=\"text-align: justify;\">Under it he reports narrations such as, al-Kafi 1\/228:<\/p>\n<p style=\"text-align: justify;\">[(with his chain) from Jabir, he said: I heard aba Ja`far (as) saying: &#8220;No one can claim that he has gathered the entire Qur&#8217;an as it was revealed except a liar. It was only collected and memorized, as Allah revealed it, by `Ali (as) and the Imams after him (as).]<\/p>\n<p style=\"text-align: justify;\">In addition to plenty of other examples. However, a Shia will quickly jump and say that these reports can be weak.<\/p>\n<p style=\"text-align: justify;\">If that&#8217;s the objection then let us quote for this Shia authentic narrations from al-Kafi that clearly imply Tahrif.<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 2\/634:<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Al-Hakam from Hisham bin Salim from Abi `Abdullah (as), he said, “The Qur’an that Jibril (as) brought down to Muhammad (saw) has seventeen thousand verses.”]<\/p>\n<p style=\"text-align: justify;\">It goes without saying that our Qur&#8217;an today is a lot less, it&#8217;s around six thousand verses.<\/p>\n<p style=\"text-align: justify;\">Shia will try to object to this report by two methods:<\/p>\n<p style=\"text-align: justify;\">A- They will try to weaken the narrator and we refuted them (<a href=\"http:\/\/twelvershia.net\/2014\/02\/19\/response-to-hadeeth-17000-verses-in-the-quraan-saheeh\/\" rel=\"external nofollow\">here<\/a>).<\/p>\n<p style=\"text-align: justify;\">B- They will say it&#8217;s originally seven thousand not seventeen. They say it&#8217;s a copyist error. This too is false since if one were to return to the manuscripts of al-Kafi he&#8217;d realize that the vast majority of them state it is 17,000. It&#8217;s not possible all writers got it wrong while a single one got it right.<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 8\/184:<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from Ibn Abi `Umayr from Umar bin Udhaynah from Burayd bin Muawiyah, he said: Abu Ja`far (as) recited, “O you who have believed, obey Allah and obey the Messenger and those in authority among you. And if you fear disagreement in this matter, refer it to Allah and the Messenger and those in authority among you,” He then said, “How can he order to obedience but not in disagreement? He said this to those that were ordered, those that were told to: Obey Allah and obey His Messenger.”]<\/p>\n<p style=\"text-align: justify;\">The Qur&#8217;an we have today says:<\/p>\n<p style=\"text-align: justify;\">{O’ you who have believed, obey Allah and obey the Messenger and those in authority among you. And if you disagree on something, refer it to Allah and the Messenger} [4:59]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 8\/290<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from `Ali bin Asbat from `Ali bin abi Hamzah from abu Baseer from abu `Abdillah (as): &#8220;And they followed [instead] what the devils had recited with the authority of the devils during the reign of Solomon.&#8221; And he also recited: &#8220;Ask the Children of Israel how many a sign of evidence We have given them. So from them is he who believed, and from them is he who rejected, and from them is he who affirmed, and from them is he who changed, And whoever exchanges the favor of Allah [for disbelief] after it has come to him – then indeed, Allah is severe in penalty.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Correct verses are as follows:<\/p>\n<p style=\"text-align: justify;\">{And they followed [instead] what the devils had recited during the reign of Solomon.} [2:102]<\/p>\n<p style=\"text-align: justify;\">and:<\/p>\n<p style=\"text-align: justify;\">{Ask the Children of Israel how many a sign of evidence We have given them. And whoever exchanges the favor of Allah [for disbelief] after it has come to him – then indeed, Allah is severe in penalty.} [2:211]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 8\/184:<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from `Ali bin Asbat from `Ali bin abi Hamzah from abu Baseer from abu `Abdillah (as): &#8220;And if We had decreed upon them, “Kill yourselves and submit to the Imam in (full, willing) submission or Leave your homes,” they would not have done it, except for a few of them. And if the opponents did what they were instructed to do, it would have been better for them and a firmer position [for them in faith].&#8221; and in this verse: &#8220;and then find within themselves no discomfort from what you have judged in the matter of the leadership, and submit to Allah their obedience in [full, willing] submission.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Correct verses are as follows:<\/p>\n<p style=\"text-align: justify;\">{And if We had decreed upon them, “Kill yourselves” or “Leave your homes,” they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith].} [4:66]<\/p>\n<p style=\"text-align: justify;\">And:<\/p>\n<p style=\"text-align: justify;\">{But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} [4:65]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 8\/205:<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from ibn abi `Umayr from Hammad bin `Uthman that he said: I recited to abu `Abdullah (as) {Two just men from among you} He (as) said it is &#8220;A just man among you&#8221; He (as) said: “This is from the mistakes of the writers.”]<\/p>\n<p style=\"text-align: justify;\">Correct verse is as follows:<\/p>\n<p style=\"text-align: justify;\">{O you who have believed, do not kill game while you are in the state of ihram. And whoever of you kills it intentionally – the penalty is an equivalent from sacrificial animals to what he killed, as judged by two just men among you as an offering [to Allah] delivered to the Ka’bah, or an expiation: the feeding of needy people or the equivalent of that in fasting, that he may taste the consequence of his deed. Allah has pardoned what is past; but whoever returns [to violation], then Allah will take retribution from him. And Allah is Exalted in Might and Owner of Retribution.} [5:95]<\/p>\n<p style=\"text-align: justify;\">Al-Kafi 1\/391:<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from ibn abi `Umayr from ibn Uthaynah from Zurarah or Burayd from abi Ja`far (as) that he said: “Allah addressed Ameer-ul-Mu’mineen in his book.” I said: “Where?” he (as) said: “In his saying {And if, when they wronged themselves, they had come to you, and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful. But no, by your Lord, they will not [truly] believe until they make you, judge concerning that which they agreed on, that if Allah put Muhammad to death they shall never return this matter to bani Hashim and then find within themselves no discomfort from your judgement on them to either kill or forgive [them] and that they submit in [full, willing] submission.}”]<\/p>\n<p style=\"text-align: justify;\">Correct verse is as follows:<\/p>\n<p style=\"text-align: justify;\">{And We did not send any messenger except to be obeyed by permission of Allah. And if, when they wronged themselves, they had come to you, [O Muhammad], and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful.} [4:64]<\/p>\n<p style=\"text-align: justify;\">{But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} [4:65]<\/p>\n<p style=\"text-align: justify;\">For those seeking more authentic narrations, return to our article (<a href=\"http:\/\/twelvershia.net\/2014\/07\/24\/authentic-shia-narration-declaring-the-corruption-of-the-quran\/\" rel=\"external nofollow\">here<\/a>).<\/p>\n<p style=\"text-align: justify;\"><strong>C- Al-Kulayni trusted the contents of his book and wished for us to adopt them as part of our faith.<\/strong><\/p>\n<p style=\"text-align: justify;\">A Shia will argue: Well, how do we know al-Kulayni believes in these? What if he&#8217;s just collecting narrations in his book without accepting all the contents?<\/p>\n<p style=\"text-align: justify;\">We reply: You do not seem to understand why al-Kulayni authored his book in the first place. He received complains from the Shia that knowledge was being lost and that the people were in great confusion as to what the correct teachings of Ahlul-Bayt are. Al-Kulayni then decided to aid them by collecting the reports he trusts and compiling his book in a way that every Shia belief has reports that back it up.<\/p>\n<p style=\"text-align: justify;\">Therefore, al-Kulayni lists the Shia beliefs as chapter titles then lists supporting narrations under each chapter to prove that it is from the true Shia faith. While al-Kulayni may not necessarily believe in the authenticity of every individual narration on its own, for instance he may declare a belief then list five narrations under it. Al-Kulayni doesn&#8217;t need to necessarily believe in the authenticity of all five yet it&#8217;s sufficient for him that one or two are authentic and the rest serve as a back-up to reinforce this belief.<\/p>\n<p style=\"text-align: justify;\">In our case, it is enough for al-Kulayni to mention loads of narrations clearly implying the distortion of the Qur&#8217;an, by doing so he has established this belief even if he doesn&#8217;t necessarily believe every single report is authentic.<\/p>\n<p style=\"text-align: justify;\">Below you will see the words of al-Kulayni and the words of other Shia scholars that clearly point to what we wrote above.<\/p>\n<p style=\"text-align: justify;\">Al-Kulayni confirmed the authenticity of his reports in the introduction of his book 1\/8:<\/p>\n<p style=\"text-align: justify;\">[Verily, you solemnly wished that you possess a book which is sufficient, brings together the entire Islamic sciences of the knowledge of religion within it, wholly satisfies the needs of the student, acts as a reference for the seekers of guidance, and would be used by those who want to attain the knowledge of religion and practice upon it by deriving authentic [Sahih] narrations of the truthful ones (as) and the upright and acted upon traditions from it—through which the compulsory duties of Allah, the Powerful and Exalted, and the tradition of His Prophet (saws) can be fulfilled. And you said: ‘If that happens, I can hope that (the book) would be a means through which Allah will rectify our brothers and people of our religious community through his support and grace, and take them closer to their salvation.’]<\/p>\n<p style=\"text-align: justify;\">From the above we conclude that the man clearly asked for reliable authentic teachings, so al-Kulayni answered the call saying:<\/p>\n<p style=\"text-align: justify;\">[Allah, all praise to him, has facilitated the compilation of what you requested. I hope that (this book) will be in accordance with the wishes you had in mind.]<\/p>\n<p style=\"text-align: justify;\">Meaning, he confirms that the book he compiled is indeed sufficient for them and is up to the standards in terms of authenticity and reliability.<\/p>\n<p style=\"text-align: justify;\">Shia leader and expert in the field of narrations, al-Hurr al-`Amili commented on this in &#8220;Khatimat Tafsil al-Wasa&#8217;il&#8221; 30\/196:<\/p>\n<p style=\"text-align: justify;\">[This is also an explicit declaration of authenticity of the narrations in his book due to various points. One of these points is: His statement: ‘Authentic narrations.’ It is well-known that neither did he mention a rule that distinguishes the rigorously authentic [Sahih] narration from the other categories in (the book), even if there is a non-authentic narration in it, nor were the terminologies of the later scholars absolutely present during his time, as it will be further explained. Thus, it is known that all the narrations in it are correct [Sahih] by the terminology of the early scholars, with the meaning of being proven from the infallible on the basis of categorical indications or consecutiveness [Tawatur].]<\/p>\n<p style=\"text-align: justify;\">He also wrote in &#8220;Wasa&#8217;il al-Shi`ah&#8221; 20\/96-97:<\/p>\n<p style=\"text-align: justify;\">[The authors of the four books and their likes were more than capable of distinguishing what&#8217;s authentic from what isn&#8217;t. How then is it when we&#8217;re talking about the head of the traditionalists (i.e Kulayni) and the leader of the truthful sect?]<\/p>\n<p style=\"text-align: justify;\">Shia leader Husayn al-Nuri al-Tabrasi writes in &#8220;Mustadrak al-Wasa&#8217;il&#8221; 3\/532:<\/p>\n<p style=\"text-align: justify;\">[Al-Kafi from among the four (main) books is like the sun between the stars. If the unbiased one were to contemplate, he&#8217;d realize that there&#8217;s no need to check the condition of individual narrators in its chains. He would feel that it&#8217;s trustworthy and he&#8217;d be at ease with regards to its reports, in terms of their issuance and that they&#8217;re established and authentic.]<\/p>\n<p style=\"text-align: justify;\">Shia Ayatullah Muhammad Mahdi al-Asifi says the following about al-Kafi as is quoted in &#8220;Riyad al-Masa&#8217;il&#8221; by Sayyid `Ali Tabataba&#8217;i 1\/31:<\/p>\n<p style=\"text-align: justify;\">[He—may Allah have mercy on him—has collected what he found authentic from the narrations of the guiding Imams (as) in this encyclopedia of his (i.e al-Kafi).]<\/p>\n<p style=\"text-align: justify;\">Shia Ayatullah abu Talib al-Tabrizi confirms this in &#8220;Mu`jam al-Mahasin&#8221; pg.17:<\/p>\n<p style=\"text-align: justify;\">[He (i.e al-Kulayni) has declared the authenticity of its narrations in his introduction, when he said: ‘Verily, you solemnly wished that you possess a book would be used by those who want to attain the knowledge of religion and practice upon it by deriving authentic [Sahih] narrations of the truthful ones (as)…’ to: ‘Allah, all praise to him, has facilitated the compilation of what you requested. I hope that (this book) will be in accordance with the wishes you had in mind.’]<\/p>\n<p style=\"text-align: justify;\">Shia leader `Abdul-Husayn Sharaf-ul-Din al-Musawi wrote in letter 110 of &#8220;Al-Muraja`at&#8221; pg.311:<\/p>\n<p style=\"text-align: justify;\">[Al-Kafi, al-Tahdhib, al-Istibsar and Man La Yahduruhu al-Faqi are mass transmitted, their contents are certainly authentic and al-Kafi is the oldest, best and most accurate of them.]<\/p>\n<p style=\"text-align: justify;\">Shia leader al-Fayd al-Kashani wrote in the second introduction of &#8220;Al-Wafi&#8221; pg.23:<\/p>\n<p style=\"text-align: justify;\">[The authors of both books (al-Kafi &amp; al-Faqih) have taken the path recognized by the early scholars by declaring as authentic [Sahih] what they rely upon and feel comfortable towards. They have declared the authenticity of all the content in their two books from the narrations, even if much of it would not be considered correct according to the standards of the late scholars.]<\/p>\n<p style=\"text-align: justify;\">Their popular scholar `Abdul-Rasul al-Ghafar wrote in &#8220;Al-Kulayni wal-Kafi&#8221; pg.391-392:<\/p>\n<p style=\"text-align: justify;\">[When al-Kulayni sensed the need and realized the necessity of such a book, he began working on &#8220;al-Kafi&#8221; and was cautious to not include in it except what is authentic from the reports of Ahlul-Bayt (as). This is why he struggled for twenty years, comparing narrations, scrutinizing them, researching their chains, narrators and texts. (&#8230;until he says&#8230;) Knowing that he lived in the period of minor occultation, where he was near the four emissaries and so he would visit them as well as the representatives of the (hidden) Imam (as).]<\/p>\n<p style=\"text-align: justify;\">Other Shia scholars admitted that al-Kulayni believed in the authenticity of his book but they said his opinions are not binding as he can make mistakes in judging the authenticity of these reports.<\/p>\n<p style=\"text-align: justify;\">Sayyid Muhammad Mujahid al-Tabataba&#8217;i writes in &#8220;Mafatih al-Usul&#8221; pg.332:<\/p>\n<p style=\"text-align: justify;\">[Indeed, the testimony of al-Kulayni concerning the authenticity of (the narrations) he has recorded in al-Kafi, just as it is possible that it is in consideration of his knowledge and certainty of their issuance from the Imams (as), in which case it is permissible to depend upon them and its status will be the same as of all the reports of just individuals, it is (also) possible that it is in consideration of his independent judgment [Ijtihad] and their appearance to him on the basis of conjectural proof. In this case it is impermissible to depend upon them, for the conjecture of a scholar capable of independent judgment [Mujtahid] is not proof for those of the same stature.]<\/p>\n<p style=\"text-align: justify;\">In brief he says al-Kulayni&#8217;s Ijtihad is not binding upon other scholars since they can differ in their judgment of what&#8217;s authentic.<\/p>\n<p style=\"text-align: justify;\">Ayatullah Husayn `Ali al-Muntazari writes in &#8220;Dirasat fil-Makasib al-Muharramah&#8221; 3\/123:<\/p>\n<p style=\"text-align: justify;\">[The belief of al-Kulayni about the correctness of traditions is not a legal proof because he is not an infallible according to us!]<\/p>\n<p style=\"text-align: justify;\"><strong>D- Objections or arguments that may arise in opposition to the above.<\/strong><\/p>\n<p style=\"text-align: justify;\">Here we reach the end of our article and we shall mention our opponent&#8217;s weak defense to what we established above.<\/p>\n<p style=\"text-align: justify;\">-Their first argument will be: Kulayni says to refer back to Allah&#8217;s book and dismiss what opposes it.<\/p>\n<p style=\"text-align: justify;\">We answer: Why didn&#8217;t he dismiss them then? Instead, we find that he includes them and quotes a lot of them in his book.<\/p>\n<p style=\"text-align: justify;\">This is because the above is listed in the introduction of al-Kafi, the context is that the man was describing to al-Kulayni how it is impossible for him and his people to differentiate between all contradicting narrations coming from  the Imams.<\/p>\n<p style=\"text-align: justify;\">This is why al-Kulayni&#8217;s book does not have much contradictions, since al-Kulayni did not include the reports that oppose what he thinks are the correct teaching of Ahlul-Bayt. Al-Kulayni included only what he wished for the Shia to adhere to including plenty of reports about Tahrif.<\/p>\n<p style=\"text-align: justify;\">Al-Kulayni tells the man in the introduction that the Imams specified three ways to distinguish what&#8217;s correctly attributed to them:<\/p>\n<p style=\"text-align: justify;\">1- Present the conflicting reports to Allah&#8217;s book and reject what opposes it.<\/p>\n<p style=\"text-align: justify;\">(This does not conflict with the belief in the corruption of the Qur&#8217;an, because al-Kulayni and his likes believed the Qur&#8217;an was simply missing some of `Ali&#8217;s merits and the flaws of his opponents. As for the general context and rulings, they are intact and thus one is able to present narrations to it and see which ones hold-up.)<\/p>\n<p style=\"text-align: justify;\">2- Present the conflicting reports to the beliefs of Ahlul-Sunnah and dismiss what agrees with them.<\/p>\n<p style=\"text-align: justify;\">(Ahlul-Sunnah believe the Qur&#8217;an is un-distorted and so the opposite would be to accept the Shia reports declaring the corruption of the Qur&#8217;an)<\/p>\n<p style=\"text-align: justify;\">3- Follow the consensus of the Shia.<\/p>\n<p style=\"text-align: justify;\">(Shia have a lot of disagreements and that&#8217;s why Kulayni wrote al-Kafi in the first place. This option is invalid)<\/p>\n<p style=\"text-align: justify;\">-Their second argument will be: A narration is reported in al-Kafi 8\/53 that implies the Qur&#8217;an is un-tampered.<\/p>\n<p>The report in question is regarding a letter by abu Ja`far Muhammad bin `Ali:<\/p>\n<p style=\"text-align: justify;\">[(with his chain) Yazid bin `Abdullah, from whoever told him, he said: Abu Ja`far (as) wrote etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">The long narration continues with the Imam criticizing the commoners until he writes:<\/p>\n<p style=\"text-align: justify;\">[The result of their abandonment of the Book, is that they upheld its letters but distorted its limits. They read it but do not care for it, so the ignorant among them is pleased with their memorization whereas the scholars are aggrieved at their lack of care]<\/p>\n<p style=\"text-align: justify;\">We answer: This does not mean that the Qur&#8217;an is unchanged. When the Imam says &#8220;They upheld its letters but distorted its limits&#8221; he means that they took great care of reciting it in the best manner and cared more for the pronunciation of its letters than they did for respecting its laws, limits and rulings.<\/p>\n<p style=\"text-align: justify;\">Their renowned scholar Al-Shaykh Yusuf al-Bahrani writes in &#8220;Al-Durar al-Najafiyyah&#8221; 4\/69:<\/p>\n<p style=\"text-align: justify;\">[As for the narration in &#8220;al-Kafi&#8221;, what&#8217;s apparent is that it means that the commoners upheld the letters &#8211; meaning, by reciting with good voices and adhering to the etiquette of recitation as well as all favorable means they established among themselves, in addition to finishing its entire recitation on a regular basis. However, they corrupted its limits by giving it their own personal interpretations without returning back to the people of revelation (i.e Imams) to learn its laws and prohibitions. This is what&#8217;s apparent from the narration, thus it contains no evidence for what they claim.]<\/p>\n<p style=\"text-align: justify;\">Of course, al-Bahrani is disproving those who argued with the report to prove the Qur&#8217;an is un-tampered and un-corrupted, he answered as you saw above by saying this is clearly not the case and the report does not constitute legitimate evidence for their stance.<\/p>\n<p style=\"text-align: justify;\">We hope that this is sufficient evidence for all those with intellect that al-Kulayni is one of the staunchest believers in Tahrif, that this isn&#8217;t a &#8220;Wahhabi&#8221; accusation as they claim and we hope that the article is a solid testament to the corruption of Twelver Shia faith.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Muhammad bin Ya`qub al-Kulayni is disputably the top Twelver Shia Hadith scholar to ever walk the earth. They trust him and honor him to no end, even going as far as bestowing upon him the title of &#8220;Thiqat-ul-Islam&#8221;. Al-Kulayni is the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/06\/23\/al-kulayni-and-tahreef\/\" title=\"Al-Kulayni and Tahreef\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3818,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[53],"class_list":{"0":"post-3314","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran","9":"tag-tahreef"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3314","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3314"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3314\/revisions"}],"predecessor-version":[{"id":3335,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3314\/revisions\/3335"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3818"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3314"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3314"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3314"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}