{"id":3317,"date":"2016-06-23T20:00:22","date_gmt":"2016-06-23T20:00:22","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3317"},"modified":"2016-06-23T06:40:03","modified_gmt":"2016-06-23T06:40:03","slug":"response-to-ask-those-who-know","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/06\/23\/response-to-ask-those-who-know\/","title":{"rendered":"Response to: Ask Those Who Know"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3317\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Response to: Ask Those Who Know<\/h1>\n<p style=\"text-align: justify;\"><strong>by Sh. Uthmān Al-Khamīs<\/strong><\/p>\n<p style=\"text-align: justify;\"><em>Translated by Hānī Salḥab Al-Ṭarābulsī<\/em><\/p>\n<p style=\"text-align: justify;\">\n<p>*Note: The original page referencing provided by Sh. Uthmān Al-Khamīs was kept. Though, we have added the titles of the chapters in English from Tijani’s Ask Those Who Know for those that want to review the original text.<\/p>\n<p><strong>**Those that are experiencing difficulties reading the text on mobile due to dropped symbols, please access the Full Version of the website at the very bottom of this article.<\/strong><\/p>\n<p><a href=\"http:\/\/twelvershia.net\/exposing-tijani\/\" data-slimstat-type=\"2\" data-slimstat-callback=\"true\" data-slimstat-tracking=\"false\" rel=\"external nofollow\">Back to Exposing Tijani page<\/a><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\"><u>1- Tijani said on pg.7 [Ask Those Who Know \/ Introduction]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Through this, the nation would unite under a fundamental rule, a rule that forms the center pivot of everything founded by the Messenger when he said: “I am leaving among you two weighty things. If you hold onto them you shall never go astray. They are Allah’s book and the progeny from my household.” Ṣaḥīḥ Muslim.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie since this version of the report is not found in Ṣaḥīḥ Muslim.<\/p>\n<p style=\"text-align: justify;\">Here is what Muslim wrote: From Zayd bin Arqam: One day, the Prophet (peace be upon him) stood to deliver a sermon in a pond known as Khum, located between Makkah and Madinah. He praised Allah and offered wisdom then said: “O people, I am no more than a human. May Lord’s messenger is soon to come for me and I shall depart. I am leaving among you two weighty things: The first of which is Allah’s book, it contains knowledge and guidance so hold on to it firmly.” He encouraged us to adhere to Allah’s book then said: “And my household, by Allah I remind you of my household.” (He repeated thrice).<\/p>\n<p style=\"text-align: justify;\">Ḥoṣayn told Zayd: “Who are the household? Aren’t his wives from his household?” Zayd responded: “They are from his household but here he meant those of his household that are forbidden from receiving charity after him.” He asked: “And they are?” Zayd answered: “The families of `Alī, `Aqīl, Ja`far and `Abbās.” He said: “They’ve all been prohibited from taking charity!?” Zayd said: “Yes.”<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p>\n<p style=\"text-align: justify;\">The report doesn’t mention holding on to them, it states that they have their weight and rank in society so he (peace be upon him) ordered the people to fulfill their rights, honor them and love them.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>2- Tijani said on pg.12 [Ask Those Who Know \/ Open letter to Sayyid Abu&#8217;l-Hasan al-Nadawi]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>He met with a group of scholars from the people of Sunnah and a long discussion took place. They told him: “The household are the wives of the Prophet and you know nothing from the Qur’an.” I (i.e Tijani) said: “Ṣaḥīḥ Bukhārī and Ṣaḥīḥ Muslim declare the opposite of what you say.” They said: “Everything the Shia use as an argument from Bukhārī, Muslim or the other books of Sunnah are fabrications that they themselves inserted into our books.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani seems too fond of inventing stories. He does not abandon lying even if it became a mark on his face and his lies are exposed in the eyes of every sane person.<\/p>\n<p style=\"text-align: justify;\">He often claims to have met with these scholars of Ahlul-Sunnah and tells us of how he exposed their ignorance. Would he ever name these individuals for us? Or instead resort to his old tactic of saying: “I have debated a scholar from Ahlul-Sunnah” then mention a dead man’s name, like his Shia comrades do? The renowned scholars of Sunnah are well-known, so will he not debate them if he is truthful!?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>3- Tijani wrote on pg.39 [Ask Those Who Know \/ The Second Question: On the Infallibility of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>You believe the Messenger of Allah is only infallible while teaching the Qur’an. Apart from this, he is like any other human, correct at times and wrong at others.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Return to our detailed refutation to his book “Then I Was Guided” at section 9. He repeated a similar statement there.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>4- Tijani said on pg.40 [Ask Those Who Know \/ The Second Question: On the Infallibility of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>One of them expressed his opinion: “The Messenger surely contradicted many Qur’anic rulings as the situation demanded.” I was surprised and said: “Offer me one example of such contradictions.” He said: “The Qur’an declares that a hundred lashes are to be given to the adulterer and the adulteress. However, the Messenger of Allah decided to stone them even though this is nowhere to be found in God’s Book.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Tijani then wrote a long silly discourse that we skipped then said:<\/p>\n<p style=\"text-align: justify;\"><strong>I, in turn, tried to convince him, but to no avail, since the scholars of Ahlul-Sunnah are convinced by this.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The longer you live, the more wonders that you will see! Now the Shia are the ones defending the Messenger of Allah (peace be upon him) and his Sunnah!?<\/p>\n<p style=\"text-align: justify;\">In which of the books of Ahlul-Sunnah can we find these silly concepts? Tijani is trying hard and utilizing all means of deception to attribute such beliefs to the people of Sunnah. Unfortunately, we still do not know the person he is discussing with.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>5- Tijani said on pg.43 [Ask Those Who Know \/ The Second Question: On the Infallibility of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>We can’t forget to mention the man’s mentality (i.e Mu`āwiyah) and his belief concerning the Messenger. It is not too far off from his father’s beliefs as he suckled it from the breast of a woman who ate livers and was popular for wickedness and prostitution.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Allah most High says: {Indeed, those who [falsely] accuse chaste, unaware and believing women are cursed in this world and the Hereafter; and they will have a great punishment} [24:23]<\/p>\n<p style=\"text-align: justify;\">This is how this slanderer throws accusation towards the believing women, but this isn’t odd coming from people whose entire faith revolves around cursing, abusing and attacking people’s honor. You will never come across a religion on the face of this earth that contains the curses, abuse and slander found in the Shia faith. Below are a few samples of how they insult people’s honor:<\/p>\n<p style=\"text-align: justify;\">a- They narrate from `Alī bin abī Ṭālib that he used to sleep with `Ā’ishah under one cover in the presence of the Messenger of Allah (peace be upon him).<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p style=\"text-align: justify;\">b- They narrate that `Umar was afflicted with a disease in his anus that can only be relieved by semen.<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<p style=\"text-align: justify;\">c- `Uthmān was feminine and used to play with his genitals.<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p>\n<p style=\"text-align: justify;\">d- The mother of Ṭalḥah bin `Ubaydullāh was a prostitute who had a known flag. She was impregnated by adultery and gave birth to Ṭalḥah, so the men differed, causing her to pick `Ubaydullāh and attributing Ṭalḥah to him.<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/p>\n<p style=\"text-align: justify;\">e- Regarding `Amr bin al-`Ās, they called him: “A sinner, son of a sinner, and a son of a prostitute. He’s a scheming sly man.”<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/p>\n<p style=\"text-align: justify;\">f- They narrate that the mother of believers `Ā’ishah collected forty Dīnārs from acts of treachery.<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/p>\n<p style=\"text-align: justify;\">…among other foul mouthed accusations.<\/p>\n<p style=\"text-align: justify;\">As for abu Sufyān, he embraced Islam and practiced it well, and Allah tells us {Do not say to one who gives you [a greeting of] peace &#8220;You are not a believer&#8221;} [4:94]<\/p>\n<p style=\"text-align: justify;\">And as for Hind, she was not known for acts of promiscuity or wickedness, rather she was one of the women who pledged allegiance to the Prophet (peace be upon him) and he recited to them: {O Prophet, when the believing women come to you pledging to you that they will not associate anything with Allah, nor will they steal, nor will they commit unlawful sexual intercourse, nor will they kill their children, nor will they bring forth a slander they have invented between their arms and legs, nor will they disobey you in what is right &#8211; then accept their pledge and ask forgiveness for them of Allah. Indeed, Allah is Forgiving and Merciful.} [60:12]<\/p>\n<p style=\"text-align: justify;\">Hind then asked him: “Would a free woman ever commit adultery!?”<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>6- Tijani wrote on pg.69 [Ask Those Who Know \/ The Third Question: Who are the Ahlul-Bayt?]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Because Ahlul-Sunnah narrate in their Ṣaḥīḥs that the verse of purification was revealed regarding the five: Muḥammad, `Alī, Fāṭimah, Ḥasan and Ḥusayn.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Refer back to the detailed response in “Then I Was Guided” section 35.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>7- Tijani said on pg.75 [Ask Those Who Know \/ `Ā&#8217;ishah during the Life of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Many a times did `Ā’ishah wrong the Messenger of Allah and tell him false stories. However, the Prophet was compassionate and kind, of high morals and deep patience. He often said to her: &#8220;Your devil has confused you, O `Ā&#8217;ishah&#8221;. He would usually feel sorry for her and Ḥafsah bint `Umar due to Allah&#8217;s threats.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: His statement that `Ā’ishah wronged the Prophet (peace be upon him) many times, this is a lie as testified by the books of Sunnah, and they all prove his love for `Ā’ishah, as was reported by Bukhārī<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a>. The people used to only send him gifts when he was in `Ā’ishah’s house, as was reported by al-Bukhārī<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a>. He even used to spend with her two nights, unlike the rest of the mothers of believers. As for Shia books, they are unreliable sources, since they contain plenty of lies and this book here is the best example to illustrate this as well as the other books that al-Tijani authored. As for his statement, “Your devil was confused you,” and that “he felt sorry whenever Allah threatened her,” these are all shameless lies.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>8- Tijani states on pg.74 [Ask Those Who Know \/ `Ā&#8217;ishah during the Life of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Ā’ishah reached a high rank, a lofty status and achieved more fame than other of the other wives of the Prophet. Even we gather all of their virtues they wouldn’t reach a tenth of a tenth<a href=\"#_ftn11\" name=\"_ftnref11\"><strong>[11]<\/strong><\/a> from the status of `Ā’ishah bint Abi Bakr. This is what Ahlul-Sunnah say about her.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani seems very fond of saying: “A tenth of a tenth”. In his other book he writes that: “Some researchers have gathered the narrations of the rightly-guided Caliphs, the ten promised heaven, the mothers of believers and the purified household but all of them together couldn’t reach a tenth of a tenth of what Abū Hurayrah narrated on his own.”<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Tijani only says: “Tenth of a tenth,” to exaggerate. We are entitled to ask, who from among the people of Sunnah said that `Ā’ishah’s virtues are a hundred times more than those of the other Mothers of the Believers?<\/p>\n<p style=\"text-align: justify;\">Just so that we can show you how much of a liar al-Tijani is, here are the statements of the scholars of Ahlul-Sunnah:<\/p>\n<p style=\"text-align: justify;\">Al-Ḥāfidh said in al-Fatḥ: Abū Bakr bin abī Dāwūd said: Khadījah is better than `Ā’ishah since Jibrīl (peace be upon him) greeted her of his own choice, whereas he was ordered by Allah to greet Khadījah. Ibn al-`Arabī claimed that there is no dispute about Khadījah being better than `Ā’ishah, but it has been argued that there is an established difference of opinion since the early ages, although what appears to be stronger is Khadījah’s superiority.<\/p>\n<p style=\"text-align: justify;\">Imam al-Subkī said: `Ā’ishah has countless merits, but what we choose as our belief is that Fāṭimah was better, then Khadījah and then `Ā’ishah.<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: Other scholars preferred `Ā’ishah, while some said we do not prefer one over the other.<\/p>\n<p style=\"text-align: justify;\">These are the statements of the scholars of Sunnah, while what we have quoted previously were the lies of al-Tijani.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>9- Tijani said on pg.78 [Ask Those Who Know \/ `Ā’ishah during the Life of the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>In order for you to also learn that the verse of removing abomination and purification is far from her (i.e `Ā’ishah) just as far as the sky is from the earth.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: How can she be included in this verse when you people have narrated that she slept with `Alī in one bed?<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a> Or that she collected forty Dīnārs by cheating<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a>? Or that `Alī sat on her thigh<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a>?<\/p>\n<p style=\"text-align: justify;\">This is how you people view `Ā’ishah, whereas Allah mentions that the Prophet’s (peace be upon him) wives are Mothers of Believers, and no doubt you Shia refuse for her to be your mother, while she refuses to be yours.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>10- Tijani wrote on pg.93 [Ask Those Who Know \/ `Ā’ishah after the Prophet]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Bukhārī, Aḥmad, Tirmidhī and Ibn Mājah all reported from `Ā’ishah, that she said: I have never been as jealous from any wife of the Prophet like I was from Khadījah. He always mentioned her and praised her so I said to him: Why do you mention a red cheeked, old lady from Quraysh who died ages ago? Allah Has surely replaced her for you with someone better. Upon hearing this, the Prophet’s (peace be upon him) face changed in a way that only happened during revelation. He said: Allah has not replaced her with anyone better, she believed in me when people rejected me, she believed me when people accused me, she shared her money with me when people withheld their own and Allah granted me children through her alone from among the women.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He lied! This version of the report is not found in al-Bukhārī’s book. Her narration there ends with the part: “…has surely replaced her for you with someone better”. Muslim reported it similarly in his Ṣaḥīḥ.<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a><\/p>\n<p style=\"text-align: justify;\">The addition al-Tijani falsely attributed to al-Bukhārī is found only in Musnad Aḥmad<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a> in the words of Mujālid bin Sa`īd.<\/p>\n<p style=\"text-align: justify;\">Aḥmad said about him: “He is nothing.” Ibn Ma`īn said: “His words are not an argument.” Dāraquṭnī said: “Weak.” Nasā’ī said: “He is not strong.”<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">11- Tijani wrote on pg.124 [Ask Those Who Know \/ The Qur&#8217;an reveals the Truth about some Companions]<\/p>\n<p style=\"text-align: justify;\"><strong>From them are those who claimed prophet-hood, such as Musaylamah al-Kazzab, Ṭulayḥah, Sajāḥ bint al-Ḥārith and their followers who were all Companions.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Those are the companions of al-Tijani and Iblīs (may Allah curse him), except for Tulayḥah, since he repented and returned to Islam. As for the Messenger of Allah (peace be upon him), they do not have the honor of being his Companions, nor did any of the people of knowledge say so.<\/p>\n<p style=\"text-align: justify;\">Musaylamah claimed prophet-hood during the life of our Prophet (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">Sajāḥ had never seen the Prophet (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">Tulayḥah was a renegade from among the renegades who later repented.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>12- Tijani stated on pg.144 [Ask Those Who Know \/ The Companions&#8217; Position regarding the Orders of the Prophet during his Lifetime]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Either way, most traditionalists and historians mentioned that `Umar bin al-Khattab said: “The Messenger of Allah is delirious.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Who are those historians and traditionalists that mentioned this? Where did they do this?<\/p>\n<p style=\"text-align: justify;\">The answer as usual is that this was from Tijani’s pockets.<\/p>\n<p style=\"text-align: justify;\">On pg.179 of his book, Tijani attributes these words to `Umar then cites al-Bukhārī as reference. Therefore, we ask intelligent Shias to look this up in al-Bukhārī, if they find it then that’s that, but if they don’t, then they should know that al-Tijani is a liar.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>13- Tijani said on pg.184 [Ask Those Who Know \/ Abu Bakr after the death of the Prophet, His denial of the Truthful and Pure Fatimah al-Zahra’ and his Usurpation of her Rights]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>For this reason, you find all historians, Qur’anic commentators and traditionalists mentioning that Fāṭimah (peace be upon her) claimed Fadak as her property, but Abu Bakr accused her of lying and requested witnesses. So she brought forth `Alī bin abi Ṭālib and Umm Ayman, but Abu Bakr deemed their testimony insufficient.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani mentioned historians, Qur’anic commentators and traditionalists, but he forgot to mention writers, thinkers, clowns, magicians and liars.<\/p>\n<p style=\"text-align: justify;\">What al-Tijani wrote is no more than a lie that hadn’t been established. Would Tijani name those historians, Qur’anic commentators and traditionalists? What’s amusing is that he shamelessly wrote that this was chronicled by ALL historians, Qur’anic commentators and traditionalists.<\/p>\n<p style=\"text-align: justify;\">Furthermore, didn’t the Messenger of Allah (peace be upon him) say: “Fear Allah and be just between your children.”<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a> Reported by Muslim.<\/p>\n<p style=\"text-align: justify;\">When Bashīr bin Sa`d gifted his son al-Nu`mān a garden, the Prophet (peace be upon him) said: “I will not be a witness to this tyranny.”<a href=\"#_ftn20\" name=\"_ftnref20\">[20]<\/a> Reported by Muslim. How then would the Prophet (peace be upon him) give Fadak to Fatimah and leave the rest of his daughters with nothing?<\/p>\n<p style=\"text-align: justify;\">Fadak was acquired from Khaybar at the start of the 7<sup>th<\/sup> year of Hijrah. Zaynab, his daughter, passed away on the 8<sup>th<\/sup> year, while Umm Kulthūm passed away in the 9<sup>th<\/sup> year. Moreover, didn’t you people always claim that Fadak was an inheritance? How is it that now it suddenly became a gift!?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>14- Tijani said on pg.192 [Ask Those Who Know \/ Fatima is a Part of the Prophet, and the Prophet is Angered when she is Angered]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>However, al-Bukhārī then contradicted himself by affirming that `Umar bin al-Khattāb divided the Prophet’s inheritance among the wives.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani, in the above, combined a lie and a deception.<\/p>\n<p style=\"text-align: justify;\">`Umar was not charged with dividing the prophetic inheritance nor did any scholar state the Prophet’s (peace be upon him) wives inherited him. This is nothing more than a “discovery” by al-Tijani in our modern times.<\/p>\n<p style=\"text-align: justify;\">As for his deception, it is that `Umar was not dividing inheritance; it was the Prophet’s (peace be upon him) share from Khaybar that he had reserved for his family.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>15- Tijani wrote on pg.205 [Ask Those Who Know \/ `Umar bin al-Khattab was more severe than his Companion on the traditions of the Prophet of Allah and forbade the People from transmitting them]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Then after him came upon us the third of the Caliphs, `Uthmān, who followed the same method as his companions before him. He climbed the pulpit and said openly: “Nobody is allowed to narrate from the Messenger of Allah anything we haven’t heard in the times of Abu Bakr and `Umar.” Reported by Aḥmad, volume 1 page 363.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Will any intelligent individual please open Musnad Aḥmad to cross check this reference Tijani cited for us?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>16- On pg.222 [`Umar bin al-Khattab contravenes the Book of Allah with his Personal Reasoning]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The event of `Umar and `Ammār about Tayammum. He says at the end of it:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>`Umar said: “Fear Allah O `Ammār.” So `Ammār said: “If you wish I won’t relate it.”<\/strong><\/p>\n<p style=\"text-align: justify;\">Tijani comments:<\/p>\n<p style=\"text-align: justify;\"><strong>Glory be to Allah! `Umar wasn’t simply satisfied with contradicting the explicit texts of Qur’an and Sunnah, he went further to prevent other Companions from opposing his opinion and compelled `Ammār to say: “If you wish I wouldn’t relate it.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>How can we not marvel at such reasoning? He contradicts it and stubbornly sticks to his opinion even though a Companion reported a text in this regard?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: What is truly marvelous is how any sane Shīa can read all your lies then remain upon your faith! A truthful person won’t lie and a corrupt one will never speak truthfully.<\/p>\n<p style=\"text-align: justify;\">Al-Tijani – May God treat him as he deserves – has omitted a part of the story to reach his goal. If he were to complete the story it wouldn’t be of any use for him. The omitted part states that after `Amm<strong>ā<\/strong>r said: “If you wish I won’t relate it.” `Umar told him: “If you think it is true, then do as you wish.”<a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a> Reported by Muslim.<\/p>\n<p style=\"text-align: justify;\">Thus `Umar never prevented `Amm<strong>ā<\/strong>r bin Y<strong>ā<\/strong>sir from narrating, as Tijani claims.<\/p>\n<p style=\"text-align: justify;\">It is important for us to remind the intelligent Shīa of Fāṭimah’s position when Abu Bakr narrated to her the words of the Messenger of Allah (peace be upon him) concerning Fadak, yet she opposed the clear text according to the Shīa. Will they condemn Fāṭimah for her rejection as they do with `Umar?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>17- Tijani wrote on pg.247 [Ask Those Who Know \/ Questions and Answers which are Indispensible for Every Researched]<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Wahhabies have spread among the heedless ones that sending the complete blessing upon him (i.e the Prophet), is in fact, polytheism.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Won’t any sane Shīa respond to al-Tijani’s great slander!? Has any Shīa heard this kind of silliness before!?<\/p>\n<p style=\"text-align: justify;\">Without a doubt, this is a scandalous lie that none would dare to utter, except one who was rendered blind by Allah. One who was deceived by the devil into thinking his filthy actions are acts of goodness!<\/p>\n<p style=\"text-align: justify;\">Won’t al-Tijani please inform us of where he came across these matters? Or is it from the teachings of the boys of Najaf?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>18- Tijani says on pg.261 [Ask Those Who Know \/ The Prophet inflicts a Vile Penalty and mutilates Muslims]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Can any Muslim believe that the same Messenger of Allah, who had forbidden mutilation, order the mutilation of those people by cutting their hands and feet then branding their eyes for no other reason than having killed his herder? If the narrator told us that those people had mutilated the herder, there would have been some justification for the Prophet to order a similar punishment, but that is not found.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Imam Muslim reported in his Ṣaḥīḥ from Anas: “The Prophet (peace be upon him) only branded the eyes of those people because they branded the eyes of the herders.”<a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/p>\n<p style=\"text-align: justify;\">In short, Tijani’s statement: “That is not found,” reflects his ignorance, if we assume that he wasn’t lying.<\/p>\n<p style=\"text-align: justify;\">Did al-Tijani not read Allah most High’s words: {Indeed, the penalty for those who wage war against Allah and His Messenger and strive upon earth [to cause] corruption is none but that they be killed or crucified or that their hands and feet be cut off from opposite sides or that they be exiled from the land.} [5:33]<\/p>\n<p style=\"text-align: justify;\">Or was this also an addition the Companions inserted into Allah’s book?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>19- Tijani said on pg.263 [Ask Those Who Know \/ The Prophet loves Intercourse]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Bukhārī said: Mu`adh bin Hishām said: My father told me, from Qatādah that he said: Anas told us: “The Messenger of Allah used to go around all his wives during the night and day in one hour while they were eleven.” I asked Anas: “Was he able to bear it?” Anas replied: “We used to say that it was as if he had been given the power of thirty men.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Tijani commented: This report is surely a fabrication to degrade the honor of the Messenger… How could Anas know that the Messenger of Allah was having intercourse with eleven women in one hour? Did the Prophet (peace be upon him) tell him this or was he present?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>I seek refuge in Allah from false statements! How did he know he had the power of thirty men?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>These are accusations against the Messenger of Allah who spent his life struggling, worshipping and teaching his nation. What were those ignorant people thinking when they narrated these insults? It is as if their minds were tainted by animalistic lust… etc.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: There are a few points here to be examined.<\/p>\n<p style=\"text-align: justify;\">Firstly, the Prophet (peace be upon him) having the power of thirty men in intercourse, does not conflict with his infallibility.<\/p>\n<p style=\"text-align: justify;\">Secondly, if he goes around his wives through Ḥalāl means (unlike Mut`ah) in one night, it also doesn’t oppose his infallibility.<\/p>\n<p style=\"text-align: justify;\">Thirdly, why does al-Tijani go all out viciously attacking Ahlul-Sunnah when similar reports are found within Shia sources?<\/p>\n<p style=\"text-align: justify;\">a- Imam Abū al-Ḥasan said: “The Messenger of Allah was as strong as forty or so men. While being married to nine women, he used to go pass by all of them every night.”<a href=\"#_ftn23\" name=\"_ftnref23\">[23]<\/a><\/p>\n<p style=\"text-align: justify;\">b- The Imams Bāqir and Ṣādiq said that the Prophet (peace be upon him) never slept until he kissed Fāṭimah’s face and placed his face between her breasts.<a href=\"#_ftn24\" name=\"_ftnref24\">[24]<\/a><\/p>\n<p style=\"text-align: justify;\">Who here is degrading the greatness of the Messenger (peace be upon him)!? Would the Shias bury their faces between the breasts of their mature daughters!?<\/p>\n<p style=\"text-align: justify;\">Also, Anas was the servant of the Messenger (peace be upon him) and he was aware of things that nobody else was aware of.<\/p>\n<p style=\"text-align: justify;\">Plus, where was all this jealousy when his leader al-Khomaynī said: “There is no harm in seeking sexual pleasure from a suckling infant by kissing, hugging and placing one’s genital between her thighs.”<a href=\"#_ftn25\" name=\"_ftnref25\">[25]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>20- Tijani wrote on pg.318 [Ask Those Who Know \/ Some examples of the Interpolation of Traditions containing Realities which expose `Umar bin al-Khattab]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>What is known among early and late scholars is that `Alī bin abī Ṭālib had a claim over the Caliphate through the Messenger of Allah, even if they did not admit to the declaration of his appointment.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: If he meant the Shia scholars, then yes, they say even more than this. Whereas, if he meant the scholars of Ahlul-Sunnah, then he has lied and there is nothing new here.<\/p>\n<p style=\"text-align: justify;\">{Only they invent falsehood who believe not Allah&#8217;s revelations, and (only) they are the liars.} [16:105]<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>21- Tijani finally wrote on pg.325 [Narrations disparaging the Ahlul-Bayt please al-Bukhārī]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Bukhārī turned towards the Nawāṣib and the Khawārij who waged war against the household and killed them. You see him narrating from Mu`āwiyah, `Amr bin al-`Ās, abū Hurayrah, Marwān bin al-Ḥakam and from Muqātil bin Sulaymān, who was known as the Dajjāl… Bukhārī also accepted as binding evidence the reports of the Khawārij, the Murji’ah, the Mujassimah as well as a few unknown individuals that nobody has heard of.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: As for Mu`āwiyah, abū Hurayrah and `Amr, they are all Companions of the Messenger (peace be upon him). Marwān is differed upon and the majority believes that he isn’t a Companion, but nobody accuses him of lying in narrations.<\/p>\n<p style=\"text-align: justify;\">As for Muqātil bin Sulaymān, there is no trace of him in the books of Bukhārī, Muslim, Tirmidhī, abu Dāwūd, Nasā’ī or ibn Mājah.<\/p>\n<p style=\"text-align: justify;\">By Allah the One and Only! Al-Tijani utters lies as if nobody will hold him accountable. I marvel more and more at how any sane Shia can accept to follow a heedless liar like Tijani.<\/p>\n<p style=\"text-align: justify;\">On top of this, his statement that al-Bukhārī narrates from Mujassimah and unknown individuals is a lie.<\/p>\n<p style=\"text-align: justify;\">As for the Khawārij, the Murji’ah and the Shia, the scholars of Ahlul-Sunnah narrate from them if they are reliable without being concerned with their innovations.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Ṣaḥīḥ Muslim – Kitab Fada’il al-Sahabah #36<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Biḥār al-Anwār 40\/2<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Al-Anwār Al-Nu`māniyyah 1\/63<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Al-Sirāṭ-ul-Mustaqīm 3\/30<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Al-Tara’if by Ibn Ṭāwūs pg.495<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Fi Dhilāl al-Tashayyu` as quoted from Awjaz-ul-Khiṭāb pg.154<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Mashāriq Anwār al-Ya`qīn pg.86<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Tafsīr al-Ṭabarī 28\/51<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Ṣaḥīḥ al-Bukhārī – Kitab Fada’il al-Sahabah #3662<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Ibid #3775<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Meaning a hundredth<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> The Shia are the real Ahlul-Sunnah pg.221<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Fatḥ-ul-Bārī 7\/172<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Refer to our response to his book “Ask Those Who Know” section 5.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> <em>Ibid<\/em>.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> Ask Those Who Know pg.98<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Fatḥ-ul-Bārī – Kitāb Manāqib al-Anṣār #2821, Ṣaḥīḥ Muslim – Kitāb Fadā’il al-Ṣahābah #78<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> Musnad Aḥmad 6\/117-118<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> Ṣaḥīḥ Muslim – Kitāb-ul-Hibāt (13)<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> <em>Ibid<\/em> (14)<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> Ṣaḥīḥ Muslim – Kitāb al-Ḥayd #112<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> Ṣaḥīḥ Muslim – Kitāb al-Qisāmah #14<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref23\" name=\"_ftn23\">[23]<\/a> Al-Kāfī 5\/565<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref24\" name=\"_ftn24\">[24]<\/a> Biḥār al-Anwār 43\/44,78<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref25\" name=\"_ftn25\">[25]<\/a> Taḥrīr al-Wasīlah 2\/241 Question #12<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Response to: Ask Those Who Know by Sh. Uthmān Al-Khamīs Translated by Hānī Salḥab Al-Ṭarābulsī *Note: The original page referencing provided by Sh. Uthmān Al-Khamīs was kept. Though, we have added the titles of the chapters in English from Tijani’s <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/06\/23\/response-to-ask-those-who-know\/\" title=\"Response to: Ask Those Who Know\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10],"tags":[33],"class_list":{"0":"post-3317","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-books","8":"tag-tijani"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3317","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3317"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3317\/revisions"}],"predecessor-version":[{"id":3318,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3317\/revisions\/3318"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3317"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3317"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3317"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}