{"id":333,"date":"2013-05-03T19:42:31","date_gmt":"2013-05-03T19:42:31","guid":{"rendered":"http:\/\/twelvershia.net\/?p=333"},"modified":"2013-05-03T19:42:31","modified_gmt":"2013-05-03T19:42:31","slug":"ali-ra-destroys-the-shia-belief-of-godly-grace-lutf-al-ilahi","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/05\/03\/ali-ra-destroys-the-shia-belief-of-godly-grace-lutf-al-ilahi\/","title":{"rendered":"`Ali (ra) destroys the Shia belief of Godly Grace (Lutf al-ilahi)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=333\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">May the peace and blessings of Allah be on the Prophet Muhammad and his pure family and noble companions and all those who followed them in goodness until the day of judgement. When one observes the Twelver Shia belief in Imamah and compares it with that of Mu`tazilah he will realize that both teams conclude that it is obligatory by means of `Aql(intellect). However, the difference between the two groups is that the Mu`tazillah say that it is obligatory upon the slaves of Allah to appoint their leaders to run their affairs while the Shia claim it is obligatory upon the creator to appoint a leader for his slaves.<\/p>\n<p>The Shia chose a better term to describe this belief and said it is Lutf(Grace) from Allah and he does it out of kindness, the Shia will explain their belief in Lutf by saying: &#8220;We believe that Lutf is obligatory upon Allah because he wishes the obedience of his slaves, and he hates their disobedience. So if Allah knew that his slaves would follow in obedience and avoid disobedience if an Imam is appointed, then the Will of appointing an Imam is necessary for his Will of their obedience, because Willing something is also Willing what can help achieve it. That is the meaning we believe in when we say Obligatory upon Allah.&#8221;<\/p>\n<p>Let us quote in support of the above, the famous Shia website &#8220;al-islam.org&#8221;, in which they say:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #3366ff;\">Lutf is the action on part of God which would help to bring His creatures nearer to His devotion and‑obedience, and facilitate moral correction. It must be mentioned here that &#8220;Allah has ordered us to be just, but He Himself treats us with something better than justice, names tafaddul‑grace.&#8221; (Tafaddul has same meaning as lutf.)<\/span><\/p>\n<p><span style=\"color: #3366ff;\">The belief that lutf is morally incumbent upon God is the distinctive belief of the Shi&#8217;ah Ithna­&#8217;Asharis. The Sunnis do not believe that lutf is in­cumbent upon God.<\/span><\/p>\n<p><span style=\"color: #3366ff;\">Link:<\/span> <a title=\"External link\" href=\"http:\/\/www.al-islam.org\/adl_ilahi\/4.htm\" rel=\"nofollow external\">&#8216;Adl-ilahi<\/a><\/p>\n<p style=\"text-align: justify;\">Let us also quote from the same website an article they wrote called &#8220;Leadership and Infallibility (Part 1 of 2)&#8221;, they said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #3366ff;\">Imamat is the Grace (Lutf) of Allah which attracts mankind towards His obedience and keeps them away from His disobedience, without compelling them in any way. When Allah orders mankind to do something yet He is aware that either they can not do it, or it is very difficult for them to do it without His assistance, then if Allah does not provide His assistance, He would be contradicting His own aim. Obviously, such negligence is evil according to reason. As such, Grace (Lutf) is one of Allah&#8217;s character, and He is purified\/exalted from inadequacy of lacking such attribute.<\/span><\/p>\n<p><span style=\"color: #3366ff;\">Link:<\/span> <a title=\"External link\" href=\"http:\/\/www.al-islam.org\/encyclopedia\/chapter1b\/5.html\" rel=\"nofollow external\">Leadership and Infallibility<\/a><\/p>\n<p style=\"text-align: justify;\">Let me quote the `Aqaed section of the Shia website &#8220;academyofislam.org&#8221;, they state:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #3366ff;\">The need for a religious guide. Although human beings have been given their conscience to understand right from wrong, and then given heavenly books and Prophets to guide them, it is still possible that many people may stray from the right path. To prevent this from happening, Allah sends leaders who continue to guide to the truth. This is a mercy of Allah and in Islamic terminology is known as Lutf. Lutf is the grace of Allah through which mankind get more than just what is required, more perhaps than what they deserve. In His kindness Allah gives more so that human may benefit and get a better chance of remaining on the right path. An Imam is a Lutf of Allah to give human beings the advantage of continuous Divine guidance.<\/span><\/p>\n<p><span style=\"color: #3366ff;\">Link: <\/span><a title=\"External link\" href=\"http:\/\/academyofislam.org\/Madrasah\/Lessons\/Aqaed\/Aqaed-Imamat.pdf\" rel=\"nofollow external\">Aqaed-Imamah<\/a><\/p>\n<p style=\"text-align: justify;\">Now that the reader understands what the Twelver Shia belief of Lutf(Grace) is concerning the divine appointment of an Imam, as an obligation incumbent on Allah, we must mention that the Scholars of Islam from all groups and schools of thought have refuted this belief in detail. We write this article because of the dangerous texts found within the main Shia &#8220;bible&#8221; called Nahjul-Balagha and because these texts that they attribute to their first divine Imam `Ali ibn abi Talib (ra) destroy the Shia theory of Lutf(grace) and that it is incumbent upon Allah.<\/p>\n<p>In these following Shia texts, `Ali ibn abi Talib (ra) will mention things that Allah did not do although doing them would have brought the slaves closer to his obedience and faster to the acceptance of the message.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The first thing:<\/strong> In the location of al-Ka`bah if it was filled with jewels and rubies it would have made it easier for the slaves to accept the message and submit.<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>&#8220;If Allah, the Glorified, had placed His sacred House and His great signs among plantations, streams, soft and level plains, plenty of trees, an abundance of fruits, a thick population, close habitats, golden wheat, lush gardens, green land, watered plains, thriving orchards and crowded streets, the amount of recompense would have decreased because of the lightness of the trial. If the foundation on which the House is borne and the stones with which it has been raised had been of green emerald and red rubies, and there had been brightness and effulgence, then this would have lessened the action of doubts in the breasts, would have dismissed the effect of Satan&#8217;s activity from the hearts, and would have stopped the surging of misgivings in people.&#8221;<\/strong><\/p>\n<p>Source: Nahjul-Balagha &#8211; Sermon 191<br \/>\nKnown as &#8220;al-Khutbah al-Qasi`ah&#8221;<br \/>\n(Sermon of Disparagement).<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The second thing:<\/strong> If Allah were to create Adam (as) from light instead of creating him from clay then accepting his superiority would have been easier.<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>Then He put His angels on trial concerning these attributes in order to distinguish those who are modest from those who are vain. Therefore, Allah, who is aware of whatever is hidden in the hearts and whatever lies behind the unseen said:<\/p>\n<p>. . . &#8220;Verily I am about to create man from clay,&#8221; And when I have completed and have breathed into him of My spirit, then fall ye prostrating in obeisance unto him. And did fall prostrating in obeisance the angels all together, Save lblis;&#8230; (Qur&#8217;an. 38:71-74)<br \/>\nHis vanity stood in his way. Consequently, he felt proud over Adam by virtue of his creation and boasted over him on account of his origin. Thus, this enemy of Allah is the leader of those who boast, and the fore-runner of the vain. It is he who laid the foundation of factionalism, quarreled with Allah about the robe of greatness, put on the dress of haughtiness and took off the covering of humility. Do you not see how Allah made him low on account of his vanity and humiliated him for his feigning to be high? He discarded him in this world and provided for him burning fire in the next world.<\/p>\n<p>If Allah had wanted to create Adam from a light whose glare would have dazzled the eyes, whose handsomeness would have amazed the wits and whose smell would have caught the breath, He could have done so; and if He had done so, people would have bowed to him in humility and the trial of the angels through him would have become easier.<\/strong><\/p>\n<p>Source: Nahjul-Balagha &#8211; Sermon 191<br \/>\nKnown as &#8220;al-Khutbah al-Qasi`ah&#8221;<br \/>\n(Sermon of Disparagement).<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The third thing:<\/strong> Giving the prophets kingdoms and power and treasures and leadership makes the people accept them and believe them.<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>&#8220;If the prophets possessed authority that could not be assaulted, or honour that could not be damaged or domain towards which the necks of people would turn and the saddles of mounts could be set, it would have been very easy for people to seek lessons and quite difficult to feel vanity. They would have then accepted belief out of fear felt by them or inclination attracting them, and the intention of them all would have been the same, although their actions would have been different.&#8221;<\/strong><\/p>\n<p>Source: Nahjul-Balagha &#8211; Sermon 191<br \/>\nKnown as &#8220;al-Khutbah al-Qasi`ah&#8221;<br \/>\n(Sermon of Disparagement).<\/p>\n<p style=\"text-align: center;\">==================================<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>The Twelver Shia sect is now faced with two choices.<\/strong><\/span><\/p>\n<p><strong>The first choice:<\/strong> Accepting everything `Ali (ra) said in his sermon above, and thus admitting that the theory of Godly Lutf is false because Allah did not do any of the Lutf mentioned above, so it is incorrect to say that Lutf is incumbent and obligatory on Allah, which leads the Shia to drop everything they built based on their reasoning and `Aql(intellect) concerning the divine appointment of an Imam.<\/p>\n<p><strong>The second choice:<\/strong> They stick to what their scholars wrote concerning Lutf and Imamah, but they disprove the infallibility of `Ali (ra) after he stated facts that opposed their sect.<\/p>\n<p>And peace and blessing be upon Muhammad and his family and companions.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>May the peace and blessings of Allah be on the Prophet Muhammad and his pure family and noble companions and all those who followed them in goodness until the day of judgement. When one observes the Twelver Shia belief in <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/05\/03\/ali-ra-destroys-the-shia-belief-of-godly-grace-lutf-al-ilahi\/\" title=\"`Ali (ra) destroys the Shia belief of Godly Grace (Lutf al-ilahi)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-333","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/333","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=333"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/333\/revisions"}],"predecessor-version":[{"id":336,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/333\/revisions\/336"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=333"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=333"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=333"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}