{"id":3347,"date":"2016-07-14T20:00:21","date_gmt":"2016-07-14T20:00:21","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3347"},"modified":"2016-07-14T13:22:47","modified_gmt":"2016-07-14T13:22:47","slug":"response-to-to-be-with-the-truthful","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/07\/14\/response-to-to-be-with-the-truthful\/","title":{"rendered":"Response to: To be with the Truthful"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3347\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Response to: To be with the Truthful<\/h1>\n<p style=\"text-align: justify;\"><strong>by Sh. Uthmān Al-Khamīs<\/strong><\/p>\n<p style=\"text-align: justify;\"><em>Translated by Hānī Salḥab Al-Ṭarābulsī<\/em><\/p>\n<p style=\"text-align: justify;\">*Note: The original page referencing provided by Sh. Uthmān Al-Khamīs was kept. Though, we have added the titles of the chapters in English from Tijani’s “To be with the Truthful” for those that want to review the original text.<\/p>\n<p style=\"text-align: justify;\"><strong>**Those that are experiencing difficulties reading the text on mobile due to dropped symbols, please access the Full Version of the website at the very bottom of this article.<\/strong><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/exposing-tijani\/\" rel=\"external nofollow\">Back to Exposing Tijani page<\/a><\/p>\n<p style=\"text-align: justify;\"><u> <\/u><\/p>\n<p style=\"text-align: justify;\"><u>1- Muhammad al-Tijani wrote on pg.15 [To be with the Truthful \/ The Prophetic Sunnah in the Perspective of Ahlul-Sunnah and Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Some of them add to the Sunnah of the Prophet (peace be upon him) the Sunnah of all Companions, no matter who the Companions is. This is due to their narration of: “My Companions are like the stars, whoever you hold onto from among them, you are saved.” And also because of the narration: “My Companions are a safety for my nation.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Tijani in the footnote referred to Ṣaḥīḥ Muslim and Musnad Aḥmad.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The above contains deception and lies. He gives the reader the illusion that both narrations are reported by Muslim and Aḥmad. Whereas, the narration “My Companions are like stars” is extremely weak and isn’t found in neither Muslim nor Aḥmad’s book.<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>2- Al-Tijani wrote on pg.18 [To be with the Truthful \/ The Prophetic Sunnah in the Perspective of Ahlul-Sunnah and Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>An example of this is the statement of the Prophet: “My nation’s scholars are better than the prophets of Banū Isrā’īl.” Or “The scholars are heirs to the prophets.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Tijani in the footnote referred us to Ṣaḥīḥ Bukhārī and Ṣaḥīḥ Tirmidhī.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He follows the previous method, listing two narrations, one of which is authentic whereas the other is fabricated. Then he references in the footnotes only the authentic one while giving the illusion that both reports are found in those sources.<\/p>\n<p style=\"text-align: justify;\">The narration of the scholars being better than the prophets is a lie attributed to the Prophet (peace be upon him). None of the Muslims dare to claim that those that aren’t prophets are better than prophets, except some groups who wrongly attribute themselves to Islam, whereas Islam is innocent of them.<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>3- Tijani wrote on pg.19 [To be with the Truthful \/ The Prophetic Sunnah in the Perspective of Ahlul-Sunnah and Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>What affirms the distinction of the household from all others is what’s apparent from the disagreement of the followers of the four schools of Ahlul-Sunnah in many matters of jurisprudence. Whereas, the twelve Imams from the household never differed in any single topic.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: They don’t differ on even one topic you say!? Beautiful words but are they true?<\/p>\n<p style=\"text-align: justify;\">Shia scholar Dildār `Alī said: “The narrations reported from the Imams greatly oppose one another, not one narration is safe from having another that contradicts it or opposes it to the extent that some weak minded ones have rejected the true faith (i.e Shiasm).”<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Fayd al-Kāshānī described the Shia and their differences: “You find that they will differ on a topic with twenty different opinions, or thirty, or more. If you wish, we can say that there isn’t a matter from the branches of religion that they never differed upon.”<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Ṭūsī said: “One of my friends reviewed with me the narrations of our companions and how they differed and contradicted one another. No report is free from being contradicted by another and no narration is safe from another that opposes it. This led our opponents to hold this against us as one of the biggest criticisms against our way.”<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/p>\n<p style=\"text-align: justify;\">Who do we believe then? Al-Tijani who admitted his ignorance compared to the boys of Najaf or the top leading scholars of the Shia?<\/p>\n<p style=\"text-align: justify;\">The Shia rely on those scholars, as for al-Tijani, he is either a liar or talking out of ignorance.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>4- Tijani wrote on pg.19 [To be with the Truthful \/ The Prophetic Sunnah in the Perspective of Ahlul-Sunnah and Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Then, after all this, Ahlul-Sunnah may disagree on the meaning of the authentic narration in the view of both sects, even when the narration is irrelevant to individuals, like the following one: “The disagreement in my nation is a mercy.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: As is the habit, Tijani lies upon the people of Sunnah for, this report is baseless. It doesn’t even contain a weak chain, let alone a strong one.<\/p>\n<p style=\"text-align: justify;\">Al-Subkī said: “This tradition isn’t known among scholars of ḥadīth and I didn’t come across an authentic, weak, or fabricated chain for it.” Al-Albānī said: “This has no basis.”<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>5- Tijani on pg.23 says [To be with the Truthful \/ The Prophetic Sunnah in the Perspective of Ahlul-Sunnah and Shia]<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>How big is the number of Companions who sat with the Messenger of Allah, heard his words then transmitted them without knowledge and understanding? This caused the meaning to be altered and sometimes even flipped to the opposite of what the Messenger had intended. This may also lead to disbelief since the Companion wouldn’t comprehend the true meaning.<\/strong><\/p>\n<p style=\"text-align: justify;\">He wrote in the footnotes<strong><em>:<\/em> <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Such as what abu Hurayrah narrated regarding Allah creating Adam in his image.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>However, Imam Ja`far al-Ṣādiq clarified the matter by saying: The Messenger of Allah heard two men cursing one another. One of them said: “May Allah increase your face in ugliness and all faces resembling it.” The Messenger told him: “Allah created Adam in his image.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The narration is in Muslim where abu Hurayrah says: “If anybody had a fight with his brother, let him avoid the face since Allah created Adam in his image.”<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/p>\n<p style=\"text-align: justify;\">Notice, dear reader, how al-Tijani misquoted the text to deceive us, may Allah treat him as he deserves. The Companions may Allah be pleased with them are the most knowledgeable people after the Messenger of Allah (peace be upon him) and they would narrate the Prophet’s (peace be upon him) sayings verbatim. If for argument’s sake, we accept that the Companions of the Messenger (peace be upon him) transmitted his words without knowledge or understanding, altering the meanings and flipping them, who then is supposed to understand? Perhaps a liar would, one who distorts the truth, like al-Tijani?<\/p>\n<p style=\"text-align: justify;\">Wasn’t the Prophet (peace be upon him) the one who sent his Companions to the people so they may teach them!?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>6- Tijani on pg.30 [To be with the Truthful \/ Belief in Prophet-hood by the Two Sects]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Another time, they narrated that he was forgetful during prayer and couldn’t recall how many prostrations he performed.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: We narrated it, so what became of it?<\/p>\n<p style=\"text-align: justify;\">The people of Sunnah believe their Prophet (peace be upon him) to be human. He is not a god who does not forget or stray.<\/p>\n<p style=\"text-align: justify;\">The Shia themselves narrate similarly, from al-Harawī, who said: I told al-Riḏā: “O’ son of the Messenger of Allah, some folks in Kufah claim that the Prophet did not forget while in prayer.” He said: “They lied! May God curse them! Only the One God does not forget.”<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p>\n<p style=\"text-align: justify;\">Thus their infallible Imam directed his curse upon the deniers of this.<\/p>\n<p style=\"text-align: justify;\">Additionally, from aba `Abdillāh Ja`far al-Ṣādiq: “The Prophet forgot and concluded with Taslīm after two Raka`āt.”<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p>\n<p style=\"text-align: justify;\">From `Alī, he said: The Prophet led us in Dhuhr prayer by performing five prostrations then performed a non-obligatory prayer, some of the people said: “O Messenger of Allah, has the prayer been extended?” He responded: “How so?” They said: “You performed five.”<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a><\/p>\n<p style=\"text-align: justify;\">The Prophet then faced the Qiblah, made Takbīr while sitting, then prostrated twice. I do not want to prolong, so I left out some other reports.<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a><\/p>\n<p style=\"text-align: justify;\">Their major scholar al-Ṣadūq himself says: The extremists and the Mufawwidah (those that claim that Allah gave the Ahlulbayt the ability to control the universe) may God curse them, deny that our Prophet forgets.<\/p>\n<p style=\"text-align: justify;\">This is another curse upon them by al-Ṣadūq.<\/p>\n<p style=\"text-align: justify;\">Then we also say that forgetfulness is natural in all humans. Only God the most High does not forget as Mūsā told us: {My Lord neither errs nor forgets} [20:52]<\/p>\n<p style=\"text-align: justify;\">Yūsha` bin Nūn also told Mūsā: {Indeed, I forgot the fish} [18:63] And Mūsā said to al-Khaḏir: {Do not blame me for what I forgot} [18:73].<\/p>\n<p style=\"text-align: justify;\">Allah told His messenger Muhammad (peace be upon him): {And remember your Lord when you forget} [18:24] And {We will make you recite so do not forget} [87:6].<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>7- On pg.30 [To be with the Truthful \/ Belief in Prophet-hood by the Two Sects]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>And they narrate that he used to wake up in the morning of Ramadan in a state of sexual impurity, missing the Fajr prayer.<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">I say: This is another lie by al-Tijani may Allah treat him as he deserves.<\/p>\n<p style=\"text-align: justify;\">Who said the Prophet (peace be upon him) woke up in a state of impurity and missed the Fajr prayer? Tijani directed us to Ṣaḥīḥ al-Bukhārī but that report does not state that he (peace be upon him) had missed that prayer. This was added by al-Tijani. The intention of the narrator is to clarify that sexual impurity does not annul the fast even if Fajr time came while one is in that condition.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>8- Tijani wrote on pg.30 [To be with the Truthful \/ Belief in Prophet-hood by the Two Sects]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>As for the Shia, according to the teachings of the Imams of Ahlulbayt, they elevate prophets above these trifles especially our Prophet Muhammad. They say he is immune to sins and errors, big or small, and he’s protected from mistakes, forgetfulness and magic… Shias believe that the narrations that suggest these matters are all fabricated by the Umayyads and their supporters.<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">I say: Then let’s share with the reader some Shia narrations that degrade the prophets of God peace be upon them.<\/p>\n<p style=\"text-align: justify;\">a- The Caliph al-Ma’mūn asked al-Riḏā about Allah’s words: {And [remember, O Muhammad], when you said to the one on whom Allah bestowed favor and you bestowed favor, &#8220;Keep your wife and fear Allah,&#8221; while you concealed within yourself that which Allah is to disclose.} [33:37]<\/p>\n<p style=\"text-align: justify;\">Al-Riḏā responded: The Messenger of Allah sought Zayd bin Harithah regarding a matter, so he went to his house and saw his wife bathing and said: “Glory be to the One who created you.”<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p>\n<p style=\"text-align: justify;\">In Tafsīr `Alī bin Ibrāhīm al-Qummī, from abu Ja`far, that Zaynab remained under Zayd for as long as Allah willed, but when they had a fight they went to the Prophet who looked at Zaynab and liked her.<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p>\n<p style=\"text-align: justify;\">Look, O’ reader, at how they insult the Messenger (peace be upon him). How can they claim that he (peace be upon him) looked at another man’s wife as she bathed then fell for her?<\/p>\n<p style=\"text-align: justify;\">Al-Kulaynī mentioned a similar story in his book al-Kāfī.<\/p>\n<p style=\"text-align: justify;\">b- That Allah’s Prophet Ismā`īl looked at a woman from Ḥimyar and liked her beauty, so he asked Allah to make her his wife. She had a husband at the time, thus Allah caused him to die, so she fell into sadness in Makkah until Allah removed this sadness, and caused her to marry Ismā`īl.<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a><\/p>\n<p style=\"text-align: justify;\">c- Ja`far bin Muhammad said: The Messenger of Allah used to never sleep until he placed his face between Fāṭimah’s breasts.<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a><\/p>\n<p style=\"text-align: justify;\">Fāṭimah was a grown woman, how can the Prophet (peace be upon him) put his face between her breasts (may Allah be pleased with her)!?<\/p>\n<p style=\"text-align: justify;\">d- Al-Riḏā from his fathers, he said: The Messenger of Allah said that Mūsā asked his Lord: “O’ Lord, make me from Muhammad’s nation.” So Allah answered: “O’ Mūsā, you will not reach this status.”<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a><\/p>\n<p style=\"text-align: justify;\">Mūsā (peace be upon him) does not deserve to be a man from Muhammad’s (peace be upon him) nation? Although according to them this nation are the Shia, thus making them all better than Mūsā (peace be upon him)!!<\/p>\n<p style=\"text-align: justify;\">e- `Alī bin abi Ṭālib used to sleep next to `Ā’ishah, the wife of the Prophet (peace be upon him), in one bed and under one cover.<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a><\/p>\n<p style=\"text-align: justify;\">f- Al-Riḏā said: Allah said to Adam: “They (i.e Muhammad, `Alī, Fāṭimah, Ḥāsan and Ḥusayn) are from your progeny. They are better than you and all My creations. If it weren’t for them I would not have created you, nor would I have created heaven, hell, the sky or the earth. Do not look at them with jealousy or I shall banish you. However, Adam looked with jealousy, desiring their rank, so the devil drove him to eat from the forbidden tree, and overpowered Eve, who had also looked at Fāṭimah with jealousy, until she ate from the tree.<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a><\/p>\n<p style=\"text-align: justify;\">I say: Why did Allah then punish them for eating from the tree, as is mentioned in the Qur’ān, if the original sin was having jealousy towards the Imams?<\/p>\n<p style=\"text-align: justify;\">g- `Alī bin abi Ṭālib said: He (i.e Allah) accused the prophets and messengers of lying just as He accused the brothers of Yūsuf when they said: “The wolf ate him,” and they were prophets sent to the deserts.<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a><\/p>\n<p style=\"text-align: justify;\">h- Allah revealed to Dāwūd: “I have forgiven your sin and placed its shame upon the children of Isrā’īl.” He said: “How O’ Lord, when you do not oppress?” Allah said: “Because they did not hurry to you and reproach you.”<a href=\"#_ftn20\" name=\"_ftnref20\">[20]<\/a><\/p>\n<p style=\"text-align: justify;\">i- Abu `Abdullāh said: When the elder Ya`qūb came to Yūsuf, he felt the pride of kingship, so he didn’t approach him to him. Jibrīl descended and told him: “O Yūsuf, extend your palm.” So a bright light shot-up towards the sky. Yusuf said: “O’ Jibrīl, what’s this light emerging from my palm?” He said: “Prophet-hood was removed from your progeny as punishment for not approaching the elder Ya`qūb. No prophet will be born from your progeny.”<a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a><\/p>\n<p style=\"text-align: justify;\">j- Abu Ja`far said: In the messengers is a reminder for mankind. A prophet used to obey Allah, the most glorious, but would then disobey, so Allah drove him out of heaven and threw him in the belly of the whale. Nothing could save him except his confession and repentance.<a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/p>\n<p style=\"text-align: justify;\">k- Abu `Abdullāh said: A prophet wished to persuade God to stop tormenting his people. Allah told him: “You shall cease from questioning me about a matter I decreed or I shall turn your face onto your backside.”<a href=\"#_ftn23\" name=\"_ftnref23\">[23]<\/a><\/p>\n<p style=\"text-align: justify;\">l- Abu Ja`far said: Pride entered the heart of Prophet Ezekiel, so he said: “What virtue does prophet Sulaymān hold over me if I am given this?” Upon saying this, a painful ulcer appeared on his liver.<a href=\"#_ftn24\" name=\"_ftnref24\">[24]<\/a><\/p>\n<p style=\"text-align: justify;\">m- A prophet from the children of Isrā’īl complained to Allah about his hardened heart and his inability to shed a tear (in worship).<a href=\"#_ftn25\" name=\"_ftnref25\">[25]<\/a><\/p>\n<p style=\"text-align: justify;\">n- The chief of believers said: Lubayd bin al-A`ṣam and Umm `Abdullāh, both of whom were Jews, cast a spell on the Messenger of Allah using eleven knots… The Prophet was unable to eat, drink, hear, see or approach his wives.<a href=\"#_ftn26\" name=\"_ftnref26\">[26]<\/a><\/p>\n<p style=\"text-align: justify;\">o- `Alī bin Ḥusayn said: “O’ whale!” A whale emerged from the sea like a high mountain saying: “I am at your service O’ friend of Allah…” He said: “Who are you?” He answered: “I am the whale of Yūnus (Jonah) ‘O master.” He said: “Tell us the tale.” He said: “O’ Master, Allah never sent a prophet without presenting him with your authority. Whoever accepted it from among the prophets was safe and sound, but those who refused it faced what Adam had faced when he disobeyed, what Nūh faced from fear of drowning, what Ibrāhīm faced from the fire, what Yūsuf faced in the well, what Ayyūb faced from affliction, and what Dāwūd faced from sinfulness! Until He sent forth Yūnus and told him: “Love the chief of believers `Alī and the guided leaders from his progeny.” He responded: “How can I love those whom I never saw?” He then left angrily. So Allah ordered me: “Devour Yūnus without mercy.” He remained in my belly forty days in the seas behind three dark barriers and screamed: “There is no God but Allah, I was from the oppressors! I have accepted the love of the chief of believers and the guided leaders!”<a href=\"#_ftn27\" name=\"_ftnref27\">[27]<\/a><\/p>\n<p style=\"text-align: justify;\">p- Abu Ja`far said: When the Messenger ascended to the sky… Then he said: “O Muhammad, where is Ibrāhīm?” They said: “He is with the children of the Shia.” So he entered heaven and encountered a tree with tubes going into the children’s mouths, whenever a tube would fall out of a child’s mouth, Ibrāhīm would stand and return it. He greeted him and asked about `Alī, he said: “I left him in charge of my nation.” He replied: “You’ve left behind the best successor. Allah ordered the angels to obey him (i.e `Ali) and these are the children of his Shia, I asked Allah for permission to be their caretaker so He allowed me to.”<a href=\"#_ftn28\" name=\"_ftnref28\">[28]<\/a><\/p>\n<p style=\"text-align: justify;\">Allahu akbar! Grave is the word that comes out of their mouths; they speak not except a lie.<\/p>\n<p style=\"text-align: justify;\">Prophet Ibrahim (peace be upon him) is a nanny for the children of the Shia now!? May Allah make ugly those who believe and narrate this.<\/p>\n<p style=\"text-align: justify;\">q- Al-Ṣādiq said: Dāwūd sent Awrīyā with a group. As Dāwūd climbed the wall to collect the bird, he found Urawi’s wife bathing. Upon sensing Dāwūd’s shadow, she covered her body with her hair, but Dāwūd still looked at her, and fell for her. (So Dāwūd wrote to his general:) Place the chest between you and your enemy and let Awrīyā bin Hannān stand in front of it. The general did as he was ordered and Awrīyā was killed, so Dāwūd married his wife and she bore him Sulaymān.<a href=\"#_ftn29\" name=\"_ftnref29\">[29]<\/a><\/p>\n<p style=\"text-align: justify;\">There are many more examples, but we choose to skip them so as to not prolong the matter.<\/p>\n<p style=\"text-align: justify;\">Ahlul-Sunnah exculpate the prophets of God from such silly things. And as for what they spoke of, regarding the spell that was casted upon the Messenger of Allah (peace be upon him), then they know that magic is present in the books of Sunnah and Shia, and it is an illness like any other, bearing no insult to the station of prophet-hood. It did not prevent him (peace be upon him) from delivering the message nor did it affect his credibility.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>9- Tijani on pg.27 [To be with the Truthful \/ Believing in Allah the Exalted by Both Sects]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Allah most high said concerning Mūsā: {He said: My Lord! Show me (Thy self), that I may gaze upon Thee. He said: Thou wilt not see Me} [7:143]<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The usage of “Wilt Not” in the verse according to al-Zamakhsharī implies “never-ness” (Ta’bīd) as grammarians observe. <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Tijani arguing with al-Zamakhsharī’s words is like a Christian arguing against Ahlul Sunnah by saying: “Shia admit to the corruption of the Qur’an.” Al-Zamakhsharī is a Mu`tazilī in his beliefs, similarly, the Shia too are Mu`tazilah when it comes to Allah’s names and attributes.<\/p>\n<p style=\"text-align: justify;\">As for “Will Not”, it does not always imply “never-ness” according to grammarians. You can refer to “Mughnī al-Labīb”, “Al-Tawḏīḥ wal-Takmīl” and other books of grammar to discover that al-Tijani claims things without evidence.<\/p>\n<p style=\"text-align: justify;\">What will al-Tijani say about Allah’s words {They will not ever wish for it} [2:95]?<\/p>\n<p style=\"text-align: justify;\">Firstly, if we are to claim that “will not” implies “never-ness,” then why does Allah affirm it by saying “ever”?<\/p>\n<p style=\"text-align: justify;\">Secondly, Allah has mentioned that disbelievers will wish for death and ask for it. He said: {And they cry: O’ master! Let thy Lord make an end of us.} [43:77]<\/p>\n<p style=\"text-align: justify;\">Moreover, seeing Allah is confirmed for the believers in the Book and the traditions. We shall quote verses since Tijani and other Shia reject the prophetic narrations.<\/p>\n<p style=\"text-align: justify;\">&#8211; {That day will faces be resplendent, Looking toward their Lord} [75:23].<\/p>\n<p style=\"text-align: justify;\">&#8211; {No! Indeed, from their Lord, that Day, they will be partitioned} [83:15]. If there’s a partition between the disbelievers and their Lord, then that means that believers will not have a partition between them and their Lord.<\/p>\n<p style=\"text-align: justify;\">&#8211; {For them who have done good is the best reward and extra} [10:26]. The “extra” can only be something better than the best reward.<\/p>\n<p style=\"text-align: justify;\">Furthermore, the verse of Mūsā (peace be upon him) that Tijani mentioned is evidence about seeing God in the after-life.<\/p>\n<p style=\"text-align: justify;\">&#8211; Allah did not reproach Mūsā (peace be upon him) for his request like He did with Nuh (peace be upon him) when he said that his son is from his family. Allah said: {Indeed, I advise you, lest you be among the ignorant} [11:46].<\/p>\n<p style=\"text-align: justify;\">&#8211; Allah revealed Himself to the mountain whereas Mūsā (peace be upon him) is more honorable in Allah’s sight than a mountain.<\/p>\n<p style=\"text-align: justify;\">&#8211; We previously stated that “wilt Not” does not imply “never-ness”. Ibn Mālik said: “Whoever sees that ‘wilt not’ is to deny with ‘never-ness’, his opinion must be rejected.”<a href=\"#_ftn30\" name=\"_ftnref30\">[30]<\/a><\/p>\n<p style=\"text-align: justify;\">&#8211; Allah placed a possibility in order to be seen, He mentioned that if the mountain remains in place, then he will see Him. Everything tied to a possibility is possible.<\/p>\n<p style=\"text-align: justify;\">&#8211; Allah never said: “I cannot be seen,” rather He said that Mūsā (peace be upon him) “will not see him,” meaning: in this life.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>10- On pg.56 [To be with the Truthful \/ A Commentary]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Ṭabarānī reported in al-Mu`jam al-Kabīr with an authentic chain, from Zayd bin Arqam and Ḥudhayfah bin Usayd: The Messenger of Allah delivered a sermon at Ghadīr Khum under some trees, he said: O people, I will be soon called… Whomsoever I am his Mawla, `Alī is also his Mawla…<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">I say: He lied when he said it has an authentic chain. What is strange is that al-Tijani was only satisfied by saying, “it is authentic,” whereas his teacher al-Mūsawī said that its authenticity is agreed upon.<a href=\"#_ftn31\" name=\"_ftnref31\">[31]<\/a> The truth is that it is very weak because of Zayd bin al-Ḥasan al-Anmātī.<a href=\"#_ftn32\" name=\"_ftnref32\">[32]<\/a><\/p>\n<p style=\"text-align: justify;\">Abu Ḥātim and al-Dhahabī both said: “His narrations are rejected.” Ibn Ḥajar said: “Weak.”<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>11- On pg.72 [To be with the Truthful \/ Discussing the Claim the Verse was revealed on `Arafah Day]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The opinion that {This day I have completed for you your religion} was revealed on `Arafah conflicts with the verse of Balāgh {O Messenger, deliver that which was revealed to you}. This verse orders the Messenger to transmit an important matter and the message is incomplete without it. It had been previously researched and clarified that this was revealed between Makkah and Madinah, after the farewell pilgrimage according to 120 Companions and more than 360 Sunni scholars.<a href=\"#_ftn33\" name=\"_ftnref33\"><strong>[33]<\/strong><\/a><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: How foul are his lies! A hundred and twenty Companions narrating that: {Today I have completed for you your religion} was revealed at Ghadīr Khum!!?<\/p>\n<p style=\"text-align: justify;\">I direct my question not just to al-Tijani, but to all scholars of the Shia institutes, and to every intelligent Shia who fears Allah: Who are these Companions? Where can we find their narrations? Will we get an answer? Will any intelligent Shia transmit our question to this compulsive liar? I hope they will.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>12- Tijani said on pg.87 [To be with the Truthful \/ The Significant Element in the Research]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>This is why he (i.e `Umar) stood to address the people upon his return to Madinah and said: It has reached me that one of you have said: “If `Umar dies, I will pledge allegiance to so and so.” By Allah, don’t be so self-conceited. The oath of allegiance to Abu Bakr was sudden and unplanned, yet it came to be and Allah guarded us from its evils” &#8230;he then said: “Whoever gives his pledge to a man without consulting the Muslims, then neither he nor the one who swore allegiance shall be obeyed, lest they both end up to be slain.”<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">I say: Tijani, may Allah treat him as he deserves, has omitted parts of the report.<\/p>\n<p style=\"text-align: justify;\">The narration according to al-Bukhārī says: “The oath of allegiance to Abu Bakr was sudden and unplanned, yet it came to be and Allah guarded us from its evils, for there is no one among you that is looked upon in admiration and respect like Abu Bakr. Whoever gives his pledge to a man etc…”<a href=\"#_ftn34\" name=\"_ftnref34\">[34]<\/a><\/p>\n<p style=\"text-align: justify;\">Look at this evil method, he mentions the whole narration as it is, then omits five words so that it suites his tastes.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>13- On pg.118 [To be with the Truthful \/ Disagreement about al-Thaqalayn]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The second cause: When pain overtook the Messenger of Allah, three days before his passing, he asked for writing material to prepare a document so they may never go astray. `Umar said: “The Messenger of Allah is delusional, Allah’s book is sufficient.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Tijani in the footnote wrote: Bukhārī reported it in his Ṣaḥīḥ.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He lies and fabricates may Allah treat him as he deserves.<\/p>\n<p style=\"text-align: justify;\">It’s neither in Ṣaḥīḥ al-Bukhārī or any other book (of Hadith) that `Umar accused the Messenger of Allah (peace be upon him) of being delusional.<\/p>\n<p style=\"text-align: justify;\">This was refuted in detail in our response to “Then I Was Guided” section 29.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>14- Tijani wrote on pg.133 [To be with the Truthful \/ Fate and Destiny in the view of Ahlul-Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>For me, the matter of fate and destiny was an unbreakable code in the past. I could not find a sufficient or proper explanation to convince my heart and put my mind at ease. I remained confused between what I learned in the school of Ahlul-Sunnah, that a man’s actions are predetermined…<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The liar insists on throwing accusations on the people of Sunnah, if only an intelligent Shia would refer back to our books and verify whether Tijani is honest or not.<\/p>\n<p style=\"text-align: justify;\">Imam al-Taḥāwi said while clarifying the Sunni creed: “The actions of the slaves originate from God and are acquired by the slaves.”<\/p>\n<p style=\"text-align: justify;\">Shaykh Ibn abi al-`Izz said: “People differed regarding the actions chosen by the slaves, the Jabariyyah and their leader al-Jahm bin Ṣafwān claimed that Allah arranges all the actions of the slaves, and thus, they are compelled to do them.” This is what al-Tijani attributed to Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">He continues: “The Mu`tazilah opposed them saying: All actions are by the choice of the creatures, they create them and they are not linked to God’s creations.”<\/p>\n<p style=\"text-align: justify;\">He concludes: “The people of truth said: The slaves by their own actions became obedient or disobedient and they’re created by God and the truth is that God alone is the creator of all creatures.”<a href=\"#_ftn35\" name=\"_ftnref35\">[35]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Taymiyyah said: The slaves are truly performing their actions and Allah Has created these actions. The slave is the one who believes or disbelieves, commits good or evil, performs prayers and fasts. They have their own will but Allah created them, their abilities and their will as He says: {For whoever wills among you to take a right course. And you do not will except that Allah wills &#8211; Lord of the worlds.} [81:28-29]<\/p>\n<p style=\"text-align: justify;\">Our teacher Muhammad bin Ṣāliḥ bin `Uthaymīn said: The slave’s actions are attributed to him yet the slave and his attributes are both Allah’s creatures. A slave’s action is generated by an inward will and a physical ability, if it weren’t for these two, the action would not come to be. The One who created both the will and the ability is Allah most high, thus the creator of a matter is also the creator of what caused it. Attributing the action of a slave to Allah’s creation is akin to attributing a matter to its cause, not a direct attribution, since it is the slave himself who is in reality carrying out the action and this is why it is attributed to him as an acquisition, whereas it is attributed to Allah in terms of creation and determination.<a href=\"#_ftn36\" name=\"_ftnref36\">[36]<\/a><\/p>\n<p style=\"text-align: justify;\">This is the belief of Ahlul-Sunnah, not as al-Tijani claimed.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>15- Tijani mentioned on pg.136 a silly conversation between himself and an alleged scholar of Ahlul Sunnah, without mentioning his name, of course. See [To be with the Truthful \/ Fate and Destiny in the view of Ahlul-Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>He answered me: “To you your religion and to me my own.” By doing so, closing the doors of this conversation. This is, in most cases, the argument of our scholars.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The enemy of Allah lied, the books of Sunnah are present and so are their scholars. The Shia, when incapable of debating them, resort to dissimulation and hypocrisy.<\/p>\n<p style=\"text-align: justify;\">One says the Qur’an is corrupt, another says it isn’t out of Taqiyyah. One says “Ahlul-Sunnah are our brothers.” Another says, “They’re children of adultery.” One says, “There is no difference between us,” and another says, “We cannot agree with them on anything.”<\/p>\n<p style=\"text-align: justify;\">Whoever wishes to learn the strength of the Sunni argument, let him seek out their scholars and books. Let me mention to you O’ intelligent Shia some of the books that refuted the doubts of your scholars, read them then judge:<\/p>\n<p style=\"text-align: justify;\">&#8211; Minhāj-ul-Sunnah (Ibn Taymiyyah).<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Shī`ah wa Ahlul-Bayt (Iḥsān Ilāhī)<\/p>\n<p style=\"text-align: justify;\">&#8211; Al- Shī`ah wal-Qur’an (Iḥsān Ilāhī)<\/p>\n<p style=\"text-align: justify;\">&#8211; Al- Shī`ah wal-Sunnah (Iḥsān Ilāhī)<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Khuṭūṭ al-`Arīḏah (Muḥib-ul-Dīn al-Khaṭīb)<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Shī`ah wa Tahrīf Al-Qur’an (Muhammad Malallah)<\/p>\n<p style=\"text-align: justify;\">&#8211; Ḥattā la Nankhadi` (`Abdullah al-Mūsuli)<\/p>\n<p style=\"text-align: justify;\">&#8211; Usūl Madhab al-Shī`ah (Nasir al-Qafārī)<\/p>\n<p style=\"text-align: justify;\">&#8211; Mukhtasar al-Tuhfah al-Ithna `Ashariyyah (al-Ālūsī)<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>16- Tijani wrote on pg.138 [To be with the Truthful \/ Fate and Destiny in the view of Ahlul-Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Shia as is known, do not believe in this (revelation after Muhammad), it is only an accusation by their enemies.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Let me add to what al-Tijani said, that it’s an accusation to Islam by a bunch of heretics. Islam is free from it, so will al-Tijani accept my words? I think not.<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Kulaynī said regarding the knowledge of the Imams: “As for what is imprinted in their hearts, it is an inspiration, and what is whispered in their ears are the words of the angel.”<a href=\"#_ftn37\" name=\"_ftnref37\">[37]<\/a><\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Majlisī placed a chapter in his Biḥār Al-Anwār and called it: “That they are spoken to (Muḥaddathūn) and offered understanding.”<a href=\"#_ftn38\" name=\"_ftnref38\">[38]<\/a><\/p>\n<p style=\"text-align: justify;\">Kulaynī also placed a chapter called: “That angels enter the house of the Imams, lay on their rugs and bring them news.”<a href=\"#_ftn39\" name=\"_ftnref39\">[39]<\/a><\/p>\n<p style=\"text-align: justify;\">They narrate from abu `Abdillah: “From us (i.e Imams) is one who hears the whisper in his ear, from us is one who is visited in his dream, from us is one who hears as if the sound of a chain hit a wash basin and from us is one who sees them (i.e angels) in a shape greater than Jibrīl and Mikā’īl.”<a href=\"#_ftn40\" name=\"_ftnref40\">[40]<\/a><\/p>\n<p style=\"text-align: justify;\">Allah shall prove the innocence of Imam Ja`far al-Ṣādiq from the nonsense they attributed to him.<\/p>\n<p style=\"text-align: justify;\">Will al-Tijani insist that it is an “accusation”?<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>17- On pg.155 [To be with the Truthful \/ Imitation (Taqlid)]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Since Ahlul-Sunnah believe that their difference is a mercy, so a Mālik<\/strong>ī<strong> can for example take the Ḥanaf<\/strong>ī<strong> opinion if he found in it a solution to his problem not available with Mālik.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Yes, a Malikī can refer to the opinion of abu Ḥanīfah if he found the truth to be with him since they (i.e Sunnies) do not believe anybody is infallible after the Messenger of Allah (peace be upon him).<\/p>\n<p style=\"text-align: justify;\">As for taking abu Ḥanīfah’s opinion if he found that it is a solution to his problem, Ahlul-Sunnah do not say this. Although some ignorant people may do it, by claiming their representation of the official Sunni position is an act of oppression.<\/p>\n<p style=\"text-align: justify;\">Will he not mention to us one scholar that says what he claims?<\/p>\n<p style=\"text-align: justify;\">Sulaymān al-Taymī said: “If you were to take the concession (Rukhṣah) of every scholar, then you would gather all evil within you.”<\/p>\n<p style=\"text-align: justify;\">Ibn `Abdul-Barr comments on the above: “There is a consensus upon this and I do not know any disagreement.”<a href=\"#_ftn41\" name=\"_ftnref41\">[41]<\/a><\/p>\n<p style=\"text-align: justify;\">Imam al-Awzā`ī says: “Whoever adopts the odd opinions of scholars has abandoned Islam.”<a href=\"#_ftn42\" name=\"_ftnref42\">[42]<\/a><\/p>\n<p style=\"text-align: justify;\">Imam al-Shāṭibī said: “The consensus was mentioned regarding those who follow the concessions (Rukhaṣ) of the Madhāhib without legal excuse, that it is a forbidden act of wickedness.”<a href=\"#_ftn43\" name=\"_ftnref43\">[43]<\/a><\/p>\n<p style=\"text-align: justify;\">These are the scholars of Sunnah and these are their words, unlike what al-Tijani described.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>18- On pg.166 [To be with the Truthful \/ (Belief in) Infallibility]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>{Then, We have made to inherit the book, those we chose from our slaves}. Whoever Allah chooses, no doubt must be guarded from error. This specific verse was the argument of Imam al-Riḏā from the Imams of Ahlul-Bayt, upon the scholars gathered by the `Abbasid Caliph al-Ma’mūn. He proved to them that the Imams of Ahlul-Bayt are the ones pointed to by the verse, that Allah chose them and made them inherit the knowledge of the book, so they (i.e scholars) submitted to him.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This story is nothing more than a lie just like any other lie. Shias possess nothing more than these invented stories to tickle the emotions of their followers. The Shia don’t even have any evidence that the verse is concerning `Alī and his progeny, nor does it say that the chosen one needs to be in authority over the people. The prophet of the children of Isrā’īl said regarding Ṭālūt as we find in the Qur’an: {And their prophet said to them, &#8220;Indeed, Allah has sent to you Saul as a king.&#8221; They said, &#8220;How can he have kingship over us while we are more worthy of kingship than him and he has not been given any measure of wealth?&#8221; He said, &#8220;Indeed, Allah has chosen him over you”} [2:247].<\/p>\n<p style=\"text-align: justify;\">This Ṭālūt was not an infallible even though he was chosen. He was only a king and alongside him were two prophets (Dāwūd and Shamūīl).<a href=\"#_ftn44\" name=\"_ftnref44\">[44]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>19- On pg.175 [To be with the Truthful \/ The Imams’ Knowledge]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Even if Imam Mālik bin Anas used to say: “No eye has seen, no ear has heard and no heart has thought of anybody better than Ja`far al-Ṣādiq in merit, knowledge, worship and piety.”<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: We do not deny Ja`far’s virtue, his knowledge or his piety may Allah have mercy on him. However, we reject lies and exaggerations, Imam Mālik may Allah have mercy on him never said those words. It is a lie and this sort of thing is expected of Tijani and his likes. We wish that Tijani found it sufficient to list the scholars who praised Imam Ja`far without lies and forgeries. Again, where is the authentic chain to Imam Mālik?<\/p>\n<p style=\"text-align: justify;\">Muṣ`ab said: Mālik never narrated from Ja`far bin Muhammad unless he paired him to another from the big narrators and places him after them.<a href=\"#_ftn45\" name=\"_ftnref45\">[45]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>20- He wrote on pg.188 [To be with the Truthful \/ Taqiyyah (Dissimulation)]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The honorable Companions have practiced Taqiyyah in the reign of tyrant rulers such as Mu`āwiyah who killed anybody who refused to curse `Alī bin abi Ṭālib.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: There are three matters:<\/p>\n<p style=\"text-align: justify;\">Firstly, he claimed the Companions practiced Taqiyyah with Mu`āwiyah.<\/p>\n<p style=\"text-align: justify;\">Secondly, he claimed Mu`āwiyah was an oppressor.<\/p>\n<p style=\"text-align: justify;\">Thirdly, he claimed that Mu`āwiyah killed anybody who refused to curse `Alī.<\/p>\n<p style=\"text-align: justify;\">All of these are lies, fabrications and slander, which is nothing new.<\/p>\n<p style=\"text-align: justify;\">Regarding the first: It is a lie and Tijani will not be able to provide one example. The best evidence exposing his lie is that the stance of al-Aḥnaf bin Qays<a href=\"#_ftn46\" name=\"_ftnref46\">[46]<\/a>, Sa`d bin abi Waqqāṣ<a href=\"#_ftn47\" name=\"_ftnref47\">[47]<\/a> among others.<\/p>\n<p style=\"text-align: justify;\">Regarding the second: If Mu`āwiyah was an oppressor then how could al-Ḥasan offer him authority over the entire nation, so he may torture them? In this case, all the blame falls on al-Ḥasan bin `Alī may Allah be pleased with him. Why would al-Ḥusayn pledge an oath of allegiance to him if he was an oppressor!?<\/p>\n<p style=\"text-align: justify;\">The truth is that he wasn’t an oppressor. He was from the best rulers and kings, may Allah have mercy on him. Though, he was not an infallible.<\/p>\n<p style=\"text-align: justify;\">Regarding the third: A pure lie, neither Tijani nor any Shia on the face of the planet who believes him, can bring forth one example of such a thing.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>21- On pg.196 [To be with the Truthful \/ Al-Mut`ah (or Temporary Marriage)]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>From Ibn `Abbās: “The Prophet did Mut`ah.” But `Urwah said: Abu Bakr and `Umar forbade Mut`ah. Ibn `Abbās then said: “What does little `Urwah say?” He said: “He says that Abu Bakr and `Umar forbade it.” So Ibn `Abbās said: “They will perish, I tell them about ‘the Prophet said’ and they reply with ‘Abu Bakr and `Umar prohibited.’”<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">I say: Tijani quoted this text as evidence for Mut`ah marriage.<\/p>\n<p style=\"text-align: justify;\">This is from Tijani’s deception, Ibn `Abbās and `Urwah were discussing the Mut`ah of Hajj not that of women. Shia themselves admit this since they say that Abu Bakr never forbade the Mut`ah of women, rather it was `Umar.<\/p>\n<p style=\"text-align: justify;\">The correct opinion is that the Mut`ah of women was forbidden by the Messenger (peace be upon him) as is reported in the Ṣaḥīḥayn from `Alī bin abi Ṭālib: “The Messenger of Allah (peace be upon him) forbade the meat of the domestic donkey and the Mut`ah of women on the day of Khaybar.”<a href=\"#_ftn48\" name=\"_ftnref48\">[48]<\/a><\/p>\n<p style=\"text-align: justify;\">Even the Shia reported it from `Alī in their books.<a href=\"#_ftn49\" name=\"_ftnref49\">[49]<\/a><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><u>22- Tijani wrote on pg.200 [To be with the Truthful \/ Claim of Tahrif of the Qur’an]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>What is attributed to the Shia, that they believe in the corruption of the Qur’an, is no more than a means of intimidation and demonization without any basis in Shia beliefs.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">He also said on that same page:<\/p>\n<p style=\"text-align: justify;\"><strong>I realized that it was only one of the fabricated vilifications aimed at causing people to have aversion to the Shia.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Do you see O’ reader how shameless is Tijani and his likes, claiming that the entire accusation of corruption is no more than a way to vilify and intimidate the Shia.<\/p>\n<p style=\"text-align: justify;\">If al-Tijani was the least bit honest he would have said: Yes, many Shia scholars believed the Qur’an is corrupt and some even spoke of a consensus such as Hāshim al-Bahrānī. Others claimed it to be from the necessities of Shia faith like abu al-Ḥasan al-Fatūnī, but we do not believe in this opinion nor do we believe that the Qur’an is corrupt. Everybody who claims it is corrupt has disbelieved, their opinions are rejected, like al-Majlisī, al-Nūrī, al-Kulaynī, al-Qummī and the rest. If they had not repented then they’re disbelievers.<\/p>\n<p style=\"text-align: justify;\">However, what he wrote us is nothing more than a sly escape covered by lies. So refer to our answer to his book “Then I Was Guided” section 29.<\/p>\n<p style=\"text-align: justify;\">&#8212;&#8212;&#8212;<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Silsilat-ul-Aḥādīth al-Da`īfah wal-Mawdū`ah #58<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Al-Albānī mentioned in al-Silsilah al-Da`īfah #466 a similar narration saying: “My nation’s scholars resemble the prophets of banū Isrā’īl.” This is baseless by consensus of scholars.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Asās-ul-Usūl pg.51 quoted from Ḥaqīqat-ul-Shi`ah pg.36<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Al-Wāfī – intro pg.9<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Introduction of Tahdhīb al-Aḥkām<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Silsilat al-Aḥādīth al-Da`īfah #57<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Ṣaḥīḥ Muslim – Kitāb al-Birr wa Al-Ṣila #115<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> `Uyūn Akhbār al-Riḏā pg.326, Biḥār al-Anwār 25\/350<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Tahdhīb al-Aḥkām 1\/186, Wasā’il al-Shī`ah 8\/198-199-201<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Tahdhīb al-Aḥkām 2\/349, Istibṣār 1\/377, Wasā’il 8\/233<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Biḥār Al-Anwār 17\/102<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> `Uyūn Akhbār al-Riḏā pg.113<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Tafsīr al-Qummī for this same verse, Biḥār al-Anwār 22\/218<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Al-Kāfī 4\/203<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Biḥār Al-Anwār 43\/78<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> `Uyūn Akhbār al-Riḏā pg.200<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Biḥār Al-Anwār 40\/2, Al-Iḥtijāj pg.84<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> `Uyūn Akhbār al-Riḏā pg.170, Biḥār Al-Anwār 16\/362<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> Biḥār Al-Anwār 40\/224<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> Al-Kāfī 5\/58<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> Ibid 2\/311<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> Ibid 8\/46<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref23\" name=\"_ftn23\">[23]<\/a> Biḥār Al-Anwār 97\/87<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref24\" name=\"_ftn24\">[24]<\/a> Ibid 63\/185<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref25\" name=\"_ftn25\">[25]<\/a> Ibid 36\/258<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref26\" name=\"_ftn26\">[26]<\/a> Ibid 60\/23<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref27\" name=\"_ftn27\">[27]<\/a> Ibid 61\/52<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref28\" name=\"_ftn28\">[28]<\/a> Ibid 18\/303<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref29\" name=\"_ftn29\">[29]<\/a> Ibid 14\/20-23<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref30\" name=\"_ftn30\">[30]<\/a> Al-Kāfiyah al-Shāfiyah<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref31\" name=\"_ftn31\">[31]<\/a> Murāja`āt – letter 53 pg.435<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref32\" name=\"_ftn32\">[32]<\/a> Mu`jam al-Kabīr 3\/180 #3052<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref33\" name=\"_ftn33\">[33]<\/a> Regarding al-Amīnī’s book “Al-Ghadīr”, it is full of useless repetitions and contains nothing from what al-Tijani claimed.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref34\" name=\"_ftn34\">[34]<\/a> Fatḥ-ul-Bārī – Kitāb-ul-Ḥudūd #6830<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref35\" name=\"_ftn35\">[35]<\/a> Sharḥ al-`Aqīdah al-Ṭaḥāwiyyah pg.430<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref36\" name=\"_ftn36\">[36]<\/a> Sharḥ al-`Aqīdah al-Wāsiṭiyyah pg.175<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref37\" name=\"_ftn37\">[37]<\/a> Al-Kafī 1\/264<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref38\" name=\"_ftn38\">[38]<\/a> Biḥār Al-Anwār 26\/66<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref39\" name=\"_ftn39\">[39]<\/a> Al-Kafī 1\/393<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref40\" name=\"_ftn40\">[40]<\/a> Biḥār Al-Anwār 26\/358<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref41\" name=\"_ftn41\">[41]<\/a> Jāmi` li Bayān al-`Ilm wa Faḏlih 2\/91<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref42\" name=\"_ftn42\">[42]<\/a> Siyar A`lām al-Nubalā’ 7\/125<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref43\" name=\"_ftn43\">[43]<\/a> Muwāfaqāt 4\/134<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref44\" name=\"_ftn44\">[44]<\/a> Tafsīr al-Ṣāfī by Kāshānī 1\/274<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref45\" name=\"_ftn45\">[45]<\/a> Look up Mālik’s words on Ja`far in Tahdhīb al-Tahdhīb and Mīzān al-I`tidāl under the latter’s bio.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref46\" name=\"_ftn46\">[46]<\/a> Mukhtasar Tarīkh Dimashq 11\/144<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref47\" name=\"_ftn47\">[47]<\/a> Siyar al-A`lām 3\/464<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref48\" name=\"_ftn48\">[48]<\/a> Ṣaḥīḥ Bukhārī – Kitāb al-Maghāzī #4216, Ṣaḥīḥ Muslim – Kitāb al-Nikāḥ #29<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref49\" name=\"_ftn49\">[49]<\/a> Wasā’il al-Shi`ah 21\/12, al-Tahdhīb 7\/251, al-Istibṣār 3\/142<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Response to: To be with the Truthful by Sh. Uthmān Al-Khamīs Translated by Hānī Salḥab Al-Ṭarābulsī *Note: The original page referencing provided by Sh. Uthmān Al-Khamīs was kept. Though, we have added the titles of the chapters in English from <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/07\/14\/response-to-to-be-with-the-truthful\/\" title=\"Response to: To be with the Truthful\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10],"tags":[],"class_list":{"0":"post-3347","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-books"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3347","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3347"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3347\/revisions"}],"predecessor-version":[{"id":3350,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3347\/revisions\/3350"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3347"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3347"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3347"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}