{"id":3381,"date":"2016-08-03T17:05:17","date_gmt":"2016-08-03T17:05:17","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3381"},"modified":"2016-08-03T17:05:17","modified_gmt":"2016-08-03T17:05:17","slug":"al-mukhtar-al-thaqafi-avenger-of-al-husain-or-two-faced-politician","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/08\/03\/al-mukhtar-al-thaqafi-avenger-of-al-husain-or-two-faced-politician\/","title":{"rendered":"Al Mukhtar Al Thaqafi – Avenger of Al Husain or Two-Faced Politician?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3381\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Al Mukhtar Al Thaqafi – Avenger of Al Husain or Two-Faced Politician?<\/h1>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Al Mukhtar Al Thaqafi has always been a controversial figure between Sunnis and Shias. His actions through the middle of the first century have caused a wave of transformations in the region. There is no doubt of the significance of his call to arms to avenge Al Husain. However, it is due to that call, that much of his other actions are overlooked. In this article, we will take a look at the beliefs of Al Mukhtar and his political allegiances in order to shed some light on his larger than life character.<\/p>\n<p style=\"text-align: justify;\">For the purposes of this article, we will only be referring to Abu Mikhnaf’s narrations about Al Mukhtar. Abu Mikhnaf is the earliest and most reliable Shia source for history. The reliability of Abu Mikhnaf’s tradition, is established by Al-Tusturi, in his Mu’jam Al-Rijal 8\/620 that “his book Maqtal Al-Hussain (as), that is narrated by Al-Tabari and Abu Al-Faraj, is the most authentic <em>maqtal<\/em> (retelling of the death of Al-Hussain), for he narrates these events usually through one single intermediary.” Al-Najashi, similarly, when speaking about Abu Miknaf p. 320, says, “There is an acceptance to what he narrates.”<\/p>\n<p style=\"text-align: justify;\">If, under any circumstances, Shias decide to reject Abu Mikhnaf’s reports about Al Mukhtar, then there will be nothing left of his history, since the vast majority of what has arrived us regarding his reports have been through the narrations of Abu Mikhnaf.<\/p>\n<p style=\"text-align: justify;\">Below, we will include details that most Shias are not aware of about the Al Mukhtar:<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<ul>\n<li>\n<h3><strong>The Shias Initially hated Al Mukhtar Al Thaqafi<\/strong><\/h3>\n<\/li>\n<li>\n<h3><strong>The Death of Umar bin Sa’ad and his Son<\/strong><\/h3>\n<\/li>\n<li>\n<h3><strong>Al Mukhtar’s Angels<\/strong><\/h3>\n<\/li>\n<li>\n<h3><strong>Al Mukhtar Al Thaqafi Claims that Mohammad bin Al-Hanafiyyah was the Mahdi and the Doubts of Ibrahim bin Al-Ashtar<\/strong><\/h3>\n<\/li>\n<li>\n<h3><strong>Al Mukhtar Al Thaqafi pledges Allegiance to Ibn Al-Zubair before betraying him<\/strong><\/h3>\n<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>The Shias Initially hated Al Mukhtar Al Thaqafi<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf reports via Al-Tabari 3\/1097 that “the Shias used to blame Al Mukhtar and curse him because he caused Al-Hasan bin Ali to be stabbed at Muthlim Sabat.”<\/p>\n<p style=\"text-align: justify;\">With the passage of time, many were drawn to him, due to his call for vengeance for Al-Hussain. However, others were aware of his wickedness, like Ubaidullah bin Ali bin Abi Talib, who sided with Ibn Al-Zubair (see 3\/1157). Ubaidullah is then killed by Al Mukhtar’s troops in the year 67 AH.<\/p>\n<p style=\"text-align: justify;\">For more on the views of <a href=\"http:\/\/www.revivingalislam.com\/2012\/01\/al-mukhtar-al-thaqafi-liar.html\" rel=\"external nofollow\">Ahlulbayt on Al Mukhtar<\/a>, refer to this fascinating article by a Shi’ee academic Nader Zaveri.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>The Death of Umar bin Sa’ad and his Son<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf 3\/1140 reports that the death of Umar bin Sa’ad did not occur in a battle, but rather, under very strange circumstances. Al Mukhtar initially wrote to Umar bin Sa’ad that he promises him safety, and that he bears witness upon himself to not cause harm to Umar bin Sa’ad for his actions in the past, implying his leading of the army that killed Al-Husain. He puts this in writing and makes this known to several Kufan noblemen. Though, he includes an exception, which states, “<em>ila an<\/em> <em>yaditha hadathan<\/em>,” meaning: Unless he commits a new act that calls for it. Abu Mikhnaf quotes Al-Baqir who explains that Al Mukhtar intended a double meaning, and in this case meant, “Unless he defecates.” Linguistically, the term <em>ahdatha<\/em> can refer to both scenarios, committing a crime and defecation; however, in this context of testimonies such as these, it is only used to mean the former. In other words, Al Mukhtar provided Umar bin Sa’ad a false sense of security, while allowing him to live in Kufa, until the time was right for him to avenge Al-Husain.<\/p>\n<p style=\"text-align: justify;\">When Al Mukhtar felt that the time is right, he sent his men to decapitate Umar bin Sa’ad. They brought his head to Al Mukhtar while he was with Hafs bin Umar, the former’s son. He then mocked him by saying, “Do you know this head?” Hafs then said, “We belong to Allah and to Him we return! Life is not worth living after him.” Al Mukhtar replied, “You are correct, for you will not live after him.” Al Mukhtar then put Hafs to death and decapitated him.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Al Mukhtar’s Angels<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf 3\/1138 reports that after Al Mukhtar comes to power in the year 66 AH, he goes into battle with Suraqa bin Mirdas. Upon Suraqa’s defeat, he beseeches Al Mukhtar to forgive him. He then swears that he saw the angels on Al Mukhtar’s side. Al Mukhtar uses this opportunity for publicity and forces Suraqa to bear witness that he saw the angels in front of a crowd. After making the testimony, Al Mukhtar tells him, “I know that you did not see any angels, but you said this so that I wouldn’t kill you, so go henceforth to wherever you wish, and do not turn my men against me.”<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Al Mukhtar Al Thaqafi Claims that Mohammad bin Al-Hanafiyyah was the Mahdi and the Doubts of Ibrahim bin Al-Ashtar<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf 3\/1094,1099 reports that six months after the passing away of Yazeed, on a Friday, in the middle of Ramadhan, Al Mukhtar entered Kufa. He attempted to gather the Shia under him, but most of them refused, and lined up behind Sulaiman bin Surad, the noble companion of the Prophet – peace be upon him &#8211; . Al Mukhtar then said to them: I was sent by the Mahdi Mohammad bin Ali ibn Al-Hanafiyyah as a faithful, entrusted, and chosen minister.<\/p>\n<p style=\"text-align: justify;\">This information is supported by other early Shia historians like Sa’ad bin Abdullah Al-Ash’ari and Al-Nawbakhti in Firaq Al-Shia’ p.33-34 who said, “A sect said that the Imam is Mohammad bin Ali bin Abi Talib Ibn Al-Hanafiyyah, after Ali, because he held the flag of his father on the day of Basra, instead of his brother Al-Hasan and Al-Hussain. They were called Al-Kaysaniyyah, and they are referred to as Al-Mukhtariyyah as well, and they were referred to as such after their leader Al Mukhtar bin Abi Ubaid Al Thaqafi, who called them to this, and his nickname was Kaysan. He is the one that called for the vengeance against those that killed Al-Husain bin Ali, and eventually killed Ubaidullah bin Ziyad and Umar bin Sa’ad, and he claimed that Mohammad bin Al-Hanafiyyah ordered him to do this, and that he is the Imam after his father.”<\/p>\n<p style=\"text-align: justify;\">Al-Kashshi p. 99 confirms this as well, when he says, “Al Mukhtar called the people to Mohammad bin Ali bin Abi Talib Ibn Al-Hanafiyya, and they are called Al-Kaysaniyya, and they are Al-Mukhtariyya.”<\/p>\n<p style=\"text-align: justify;\">Abu Mikhnaf 3\/1123 reports that Al Mukhtar provided the Shia a letter that was attributed to Mohammad bin Al-Hanafiyyah, which placed him as his appointed minister that would revolt on behalf of him. He did this in order to attain support from the Kufans. One of Al Mukhtar’s most significant followers, Ibrahim bin Al-Ashtar Al-Nakha’ee made it clear that he doubted the authenticity of the letter, yet, he decided to follow Al Mukhtar, since he agreed with his cause.<\/p>\n<p style=\"text-align: justify;\">Later, Ibrahim bin Al-Ashtar, successfully defeats Ubaidullah bin Ziyad and kills him. However, he never took Al Mukhtar seriously, which causes many of his troops to leave his army and return to Al Mukhtar (see 3\/1154). Upon Al Mukhtar’s death, Ibrahim bin Al-Ashtar swears allegiance to Ibn Al-Zubair, which suggests that he never had much loyalty to Al Mukhtar in the first place (see 3\/1160).<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Al Mukhtar Al Thaqafi pledges Allegiance to Ibn Al-Zubair before betraying him<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf 3\/1099 reports that Al Mukhtar went to Makkah after the martyrdom of Al-Husain. He tells Al-Zubair, “I have come to pledge to you, but that you do not act without me, and that I would be the first to receive permission from you, and that you place me in the best of positions if you come to power.”<\/p>\n<p style=\"text-align: justify;\">This report clearly portrays Al Mukhtar Al Thaqafi as a politician that is simply looking out for his best interest.<\/p>\n<p style=\"text-align: justify;\">Abu Mikhnaf then reports that Al Mukhtar fights valiantly under the wing of Ibn Al-Zubair. He continues to ally himself with Ibn Al-Zubair for five months after the martyrdom of Al-Husain, until he hears that the Kufans are in need of a leader. It is then where he sets forth towards Kufa.<\/p>\n<p style=\"text-align: justify;\">After gaining enough popularity in Kufa, and barely one year after taking it over, Al Mukhtar attempts to betray Ibn Al-Zubair. Abu Mikhnaf reports 3\/1145 that Al Mukhtar wrote: “I have received news that Abdulmalik bin Marwan is sending an army against you, and I wish to help you.” Ibn Al-Zubair accepts the aid outwardly, but suspected treachery. He then realizes that Al Mukhtar’s reinforcements were actually an army that was sent to take over Madinah, which was under Al-Zubair’s rule, and finally to lay siege on Makkah, his capital. Al-Zubair dispatches Abbas bin Sahl bin Sa’ad, who confirmed that this was the plot, and ultimately, defeated Al Mukhtar’s troops.<\/p>\n<p style=\"text-align: justify;\">These actions ultimately lead Al Mukhtar Al Thaqafi to his fall a year later when he is finally defeated and killed by the army of Ibn Al-Zubair, and not his initial enemies from Bani Umayyah.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Al Mukhtar Al Thaqafi – Avenger of Al Husain or Two-Faced Politician? Al Mukhtar Al Thaqafi has always been a controversial figure between Sunnis and Shias. His actions through the middle of the first century have caused a wave of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/08\/03\/al-mukhtar-al-thaqafi-avenger-of-al-husain-or-two-faced-politician\/\" title=\"Al Mukhtar Al Thaqafi – Avenger of Al Husain or Two-Faced Politician?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-3381","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3381","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3381"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3381\/revisions"}],"predecessor-version":[{"id":3383,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3381\/revisions\/3383"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3381"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3381"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3381"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}