{"id":3384,"date":"2016-08-04T20:10:28","date_gmt":"2016-08-04T20:10:28","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3384"},"modified":"2018-01-04T16:09:36","modified_gmt":"2018-01-04T16:09:36","slug":"response-to-the-shia-are-the-real-ahlul-sunnah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/08\/04\/response-to-the-shia-are-the-real-ahlul-sunnah\/","title":{"rendered":"Response to: The Shia are the Real Ahlul-Sunnah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3384\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Response to: The Shia are the Real Ahlul-Sunnah<\/h1>\n<p style=\"text-align: justify;\"><strong>by Sh. Uthmān Al-Khamīs<\/strong><\/p>\n<p style=\"text-align: justify;\"><em>Translated by Hānī Salḥab Al-Ṭarābulsī<\/em><\/p>\n<p style=\"text-align: justify;\">*Note: The original page referencing provided by Sh. Uthmān Al-Khamīs was kept. Though, we have added the titles of the chapters in English from Tijani’s “To be with the Truthful” for those that want to review the original text.<\/p>\n<p style=\"text-align: justify;\"><strong>**Those that are experiencing difficulties reading the text on mobile due to dropped symbols, please access the Full Version of the website at the very bottom of this article.<\/strong><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/exposing-tijani\/\" data-slimstat-type=\"2\" data-slimstat-callback=\"true\" data-slimstat-tracking=\"false\" rel=\"external nofollow\">Back to Exposing Tijani page<\/a><\/p>\n<p style=\"text-align: justify;\"><u>1- Tijani wrote on pg.46 [The Shia are the Real Ahlul-Sunnah \/ The Secret Why Sunni Sects are in the Majority]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>When Aḥmad bin Ḥanbal retracted his statement of the Qur’an being uncreated, out of fear of al-Mu`taṣim, he escaped hardship and became popular soon after. His shined the most in the era of al-Mutawakkil among the traditionalists and it is then that he added `Alī to be the fourth of the three Caliphs.<\/strong><\/p>\n<p style=\"text-align: justify;\">And he wrote on pg.93<\/p>\n<p style=\"text-align: justify;\"><strong>The Ḥanbali Madhab wouldn’t have become popular without the backing of `Abbasid authority, in the time of al-Mu`taṣim when Aḥmad bin Ḥanbal had retracted his Fatwa about the creation of the Qur’an.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: His statement that Aḥmad retracted his ruling of the Qur’an being uncreated is a shameless lie. Similarly, his statement that `Alī was made into the fourth Caliph only happened at that time is a lie and a calumny, for `Alī had always been the fourth Caliph according to Ahlul-Sunnah without disagreement.<\/p>\n<p style=\"text-align: justify;\">`Awf bin abi Jamīla said: I was with al-Ḥasan al-Baṣrī when the Companions of the Prophet (peace be upon him) were mentioned. Ibn Jawshan al-Ghaṭafānī said: “O’ Ḥasan, people look down on abu Mūsa al-Ash`ari due to his obedience to `Alī.” Upon hearing this, al-Ḥasan became angry and it showed on his face, he said: “Who then should be followed!? The chief of believers (`Uthmān) was wrongfully killed so the people sought the best man among them and gave their pledges. So who then should be followed!?” (He repeated more than once).<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Ḥasan al-Baṣrī is the leader of the tabi`īn, as for al-Mu`taṣim he was not a supporter of Aḥmad nor was there a Ḥanbali Madhab at the time. The Ḥanbali Madhab was founded after Aḥmad’s death may Allah have mercy on him.<\/p>\n<p style=\"text-align: justify;\"><u>2- Tijani wrote on pg.56 [The Shia are the Real Ahlul-Sunnah \/ &#8220;Ahlul-Sunnah&#8221; and the Obliteration of the Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Is abu Hurayrah’s mind greater than the mind of `Alī bin abi Talib who learned by heart one hundred thousand narrations from the Messenger of Allah without having written them!?<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: We don’t say that abu Hurayrah memorized more than `Alī, but rather, that he narrated more. The same is said when comparing abu Hurayrah to Abu Bakr, `Umar, `Uthmān and other early Muhajireen.<\/p>\n<p style=\"text-align: justify;\">His statement, that `Alī memorized one hundred thousand narrations, needs to be proven through reliable transmitters, otherwise, it is worthless.<\/p>\n<p style=\"text-align: justify;\">Furthermore, abu Hurayrah is not alone in having narrated a lot. Many of the younger Companions such as ibn `Abbās, ibn `Umar, ibn `Amr, abu Sa`īd, Jābir, `A’ishah, Anas and others narrated plenty and had dedicated their time to teaching.<\/p>\n<p style=\"text-align: justify;\">Abu Hurayrah narrated a lot due to several reasons, such as:<\/p>\n<p style=\"text-align: justify;\">a- He always stuck by the Prophet’s (peace be upon him) side, since he accompanied him for four years. He himself said: “People say: Abu Hurayrah narrates much. Know that if it weren’t for two verses I would not have narrated at all: {Lo! Those who hide the proofs and the guidance which We revealed,} until {I am the Relenting, the Merciful.} Our brothers from the Muhājireen were busy working in the markets, while the Anṣār were busy with trade. However, aba Hurayrah was always alongside the Messenger of Allah (peace be upon him), hoping to be fed. I’ve witnessed what you have not and I’ve heard what you have not.<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p style=\"text-align: justify;\">b- The Prophet (peace be upon him) asked Allah to strengthen his memory. Abu Hurayrah narrated: I said: “O’ Messenger of Allah (peace be upon him), I hear a lot from you but I keep forgetting.” He said: “Extend your cloak.” I extended it. He grabbed it with his hand, then told me: “Embrace it.” Since I did this I haven’t forgotten a thing.<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<p style=\"text-align: justify;\">c- Abu Hurayrah had dedicated his time for teaching.<\/p>\n<p style=\"text-align: justify;\">d- He had a lot of students, almost eight-hundred in total.<\/p>\n<p style=\"text-align: justify;\">e- He died much later than others, in the year 57 or 58 Hijri.<\/p>\n<p style=\"text-align: justify;\">Moreover, his narrations can be split into these categories:<\/p>\n<p style=\"text-align: justify;\">a- Weak narrations incorrectly attributed to abu Hurayrah.<\/p>\n<p style=\"text-align: justify;\">b- Repetitions, which is often the case.<\/p>\n<p style=\"text-align: justify;\">c- What he narrates from senior Companions, such as the ten and the Mothers of Believers, but he wouldn’t mention their names as he trusts them, and this is known as Mursal al-Ṣaḥabī.<\/p>\n<p style=\"text-align: justify;\">d- His own words and sayings.<\/p>\n<p style=\"text-align: justify;\">Bukhārī and Muslim have agreed on 326 narrations from abu Hurayrah only. Bukhārī narrated 93 from him exclusively, while Muslim narrated 98 from him exclusively. I add, most prophetic narrations reported by abu Hurayrah are not solely transmitted by him, but was backed by other Companions who also narrated them.<\/p>\n<p style=\"text-align: justify;\">What proves his great memorization is what al-Ḥākim wrote, that Marwān summoned abu Hurayrah and began asking him while a man, who hid in the room, would write down everything. When a year passed, he summoned him again and asked him about the same matters that were documented in the book, so abu Hurayrah repeated it all without additions or subtractions.<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p>\n<p style=\"text-align: justify;\">Testimonies of the people of knowledge concerning abu Hurayrah:<\/p>\n<p style=\"text-align: justify;\">Al-Shāfi`ī said: Abu Hurayrah was the best at memorizing narrations in his time.<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/p>\n<p style=\"text-align: justify;\">Abu Ṣāliḥ Dhakwān said: Abu Hurayrah was the best of the Prophet’s (peace be upon him) Companions in memorizing.<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Dhahabī said: An Imam, a Faqīh, a Mujtahid, a Ḥafith, a companion of the Messenger of Allah (peace be upon him) and master of the Ḥufāth.<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>3- Tijani says on pg.62 [The Shia are the Real Ahlul-Sunnah \/ &#8220;Ahlul-Sunnah&#8221; and the Obliteration of the Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>By all this, the narration of two weighty things becomes mass transmitted: “I have left with you two weighty things, Allah’s Book and my progeny etc…<\/strong><\/p>\n<p style=\"text-align: justify;\">He said in the footnotes: <strong>Reported Muslim and Tirmidhī.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie, the narration of al-Thaqalayn is not mass transmitter, nor did Muslim report this version of it. Refer to our detailed refutation in our response to “Ask those who know” Section 1.<\/p>\n<p style=\"text-align: justify;\"><u>4- Tijani wrote on pg.72 [The Shia are the Real Ahlul-Sunnah \/ Introducing the Imams of the Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Among them is the famous tradition which al-Bukhārī and Muslim and all those who succeeded them states: &#8220;The Imams after me are twelve: all of them will belong to Quraysh,&#8221; and according to another narration, &#8220;all of them will be the offspring of Hāshim.&#8221;<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">Refer to our response to “Then I was Guided” Section 59.<\/p>\n<p style=\"text-align: justify;\"><u>5- Tijani writes on pg.76 [The Shia are the Real Ahlul-Sunnah \/ Imams of Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>After the Companions fought and killed one another and accused each other of disbelief.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: As for fighting, it did happen, but as for accusations of disbelief, then this is from Tijani’s bag of lies. Will he not mention a source for this falsehood?<\/p>\n<p style=\"text-align: justify;\"><u>6- Tijani said on pg.78 [The Shia are the Real Ahlul-Sunnah \/ Imams of Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Another, is their abuse and curses upon the respected Companion `Ammār bin Yāsir under the borrowed name “`Abdullāh bin Saba’” and “Ibn al-Sawdā’”.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: I only wish to address the intelligent Shia in this book and ask: “Where are your heads?”<\/p>\n<p style=\"text-align: justify;\">What harm would it cause you, if you were to return to the books of Sunnah, which are readily available everywhere &#8211; praise be to God &#8211; , so that you can read what they wrote about `Ammār may Allah be pleased with him?<\/p>\n<p style=\"text-align: justify;\">I keep on marveling at al-Tijani’s endless lies. He would not need to lie if he was upon truth!?<\/p>\n<p style=\"text-align: justify;\"><u>7- Tijani says on pg.83 [The Shia are the Real Ahlul-Sunnah \/ The Prophet Appointed the Imams of the Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>What increases our certainty that the Twelve Imams of Ahlul-Bayt were not students under any of the nation’s scholars, is that none of the authors of histories, biographies and traditions documented that any of these Imams took knowledge from Companions or Tabi`īn.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: May Allah destroy these lies and the liars, and may He free the Household from such slander. The Twelve Imams of the Shia were not all from the scholars who were sought for their knowledge. Those known for their knowledge were al-Bāqir, al-Ṣādiq and al-Kādhim. `Alī Zayn-ul-`Abidīn was known for both his knowledge and piety, and so were the Companions: `Alī, Ḥasan and Ḥusayn, who were from among the biggest scholars.<\/p>\n<p style=\"text-align: justify;\">Muḥammad bin al-Ḥasan their awaited savior was never born, while Al-`Askarī, al-Jawād and al-Hādī were not known for any knowledge according to Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">Below, I mention those who narrated from them and those who they narrated from, coupled with their biographies. We excluded `Alī, Ḥasan and Ḥusayn, since they were Companions, whose justness were established, but we will mention their teachers and students. When a man narrates from another, then he has taken knowledge from him, and that knowledge is none other than the Book and the Traditions.<\/p>\n<p style=\"text-align: justify;\">1- `Alī bin abi Ṭālib: He narrated from the Prophet (peace be upon him), Abu Bakr, `Umar, al-Miqdād and his wife Fāṭimah. Countless people narrated from him.<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p>\n<p style=\"text-align: justify;\">2- al-Ḥasan bin `Alī: He narrated from the Prophet (peace be upon him), his own father, his brother Ḥusayn, his uncle Hind bin abi Hālah. From him narrated his son Ḥasan and `A’ishah, among others.<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p>\n<p style=\"text-align: justify;\">3- al-Ḥusayn bin `Alī: He narrated from the Prophet (peace be upon him), his father, his mother, his uncle and `Umar. From him narrated his brother al-Ḥasan and his own children, among others.<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a><\/p>\n<p style=\"text-align: justify;\">4- `Alī bin Ḥusayn: He narrated from his father, his uncle al-Ḥasan, ibn `Abbās, al-Miswar, abi Hurayrah, `A’ishah, Safīyyah, Umm Salamah, Sa`īd bin al-Musayyib, `Amr bin `Uthmān bin `Affān and Marwān, among others. A great amount of people narrated from him. He was from the leader of the Muslims in piety and knowledge.<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a><\/p>\n<p style=\"text-align: justify;\">5- Muḥammad bin `Alī: He narrated from his father, grandfathers Ḥasan and Ḥusayn, his father’s uncle Muḥammad bin al-Ḥanafiyyah, `Abdullah bin Ja`far al-Tayyār, Samurah bin Jundub, ibn `Abbās, ibn `Umar, abi Hurayrah, `A’ishah, Umm Salamah, Sa`d, Jābir bin `Abdullah, `Atā’ bin Yasār, Nu`aym al-Mujammar, Yazīd bin Hurmuz and others. A great amount of people narrated from him. He was trustworthy and virtuous.<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p>\n<p style=\"text-align: justify;\">6- Ja`far bin Muhammad: He narrated from his father, Muḥammad bin al-Munkadir, `Ubaydullah bin abi Rāfi`, `Atā’, `Urwah, Qāsim bin Muḥammad, Nafi` and al-Zuhrī. From him narrated Mālik, Shu`bah, abu Hanīfah, Sufyān al-Thawrī and bin `Uyaynah, among others.<\/p>\n<p style=\"text-align: justify;\">Al-Shafi`ī said: Reliable. Ibn Ma`īn said: Trusted and reliable. Abu Ḥātim said: Don’t ask about of someone of his (high) status. Ibn Ḥibbān said: He was from the heads of the Household in jurisprudence, knowledge and virtue. His narrations are binding proofs, except what comes through the path of his children. Mālik only narrated from him while pairing him with another. Yaḥyā bin Sa`īd criticized him.<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p>\n<p style=\"text-align: justify;\">7- Mūsā bin Ja`far: He narrated from his father, `Abdullah bin Dīnār and `Abdul-Malik bin Qudāmah. From him narrated his two brothers `Alī and Muḥammad, also Ṣāliḥ bin Yazīd and Muḥammad bin Ṣadaqah as well as his children Ibrāhīm, Ḥusayn, Ismā`īl, and `Alī.<\/p>\n<p style=\"text-align: justify;\">Abu Ḥātim said: A leader from the leaders of the Muslims.<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a><\/p>\n<p style=\"text-align: justify;\">8- `Alī bin Mūsā: He narrated from his father and `Ubaydullah bin Arta’ah. From him narrated his son Muḥammad, abu `Uthmān al-Māzinī, `Alī bin `Alī al-Da`balī, Ayyūb bin Mansūr, abu al-Ṣalt, al-Ma’mūn and `Alī bin al-Mahdī, among others.<\/p>\n<p style=\"text-align: justify;\">Ibn Ṭāhir said: He narrates oddities from his father. Al-Dhahabī commented: The chains leading up to him should be looked into, for he was one who was frequently lied upon.<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a><\/p>\n<p style=\"text-align: justify;\">Ibn Ḥibbān said: He narrates strange things from his father, making errors and mistakes.<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a><\/p>\n<p style=\"text-align: justify;\">9- Muḥammad bin `Alī: Died at the age of twenty five and was not known to be a student of knowledge or a teacher. None of the authors of the six main books narrated from him.<\/p>\n<p style=\"text-align: justify;\">10- `Alī bin Muḥammad: Ibn Kathīr said: He was pious.<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a> Dhahabī said: He was a jurist, a leader and pious.<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a><\/p>\n<p style=\"text-align: justify;\">11- Ḥasan bin `Alī: Ibn Ḥajar said that Ibn al-Jawzī weakened him in al-Mawdū`āt.<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>8- Tijani wrote on pg.86 [The Shia are the Real Ahlul-Sunnah \/ `Umar ibn al-Khattab &#8220;al-Faruq&#8221;]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Since `Umar was fond of intercourse, Allah revealed regarding him: {Allah knows that you used to deceive yourselves, so He accepted your repentance and forgave you.} This is because he was not patient during fasting and desired intercourse, and because water was too little, so he decided that it’d be easier to abandon prayer and rest until he found sufficient water to wash-up, then return to prayer.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is Tijani’s habit of lying and deception, mixing two stories and fooling people to thinking they’re one and the same.<\/p>\n<p style=\"text-align: justify;\">Then he deceived the readers again, may Allah punish him, by shamelessly declaring that `Umar had no patience for fasting when desiring intercourse.<\/p>\n<p style=\"text-align: justify;\">What is popular is that `Umar had intercourse with his wife at night during Ramadan, not during the fast, as the fraud claimed. The story is in Ṣaḥīḥ Bukhārī and it brings no mention of `Umar, rather, it was only concerning Qays bin Ṣirmah.<a href=\"#_ftn20\" name=\"_ftnref20\">[20]<\/a><\/p>\n<p style=\"text-align: justify;\">Moreover, his words about `Umar leaving prayer due to insufficient water, are lies. By Allah, I don’t know how to describe this slanderer, but I wish he would mention the source of this claim.<\/p>\n<p style=\"text-align: justify;\">I find it odd that Shias don’t walk up to al-Tijani and ask, “Why do you lie?” Why not just mention what’s correct? Then, if he spoke truth, he could be followed.<\/p>\n<p style=\"text-align: justify;\"><u>9- Tijani said on pg.86 [The Shia are the Real Ahlul-Sunnah \/ `A’ishah daughter of Abu Bakr &#8220;Mother of the Faithful&#8221;]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Until `A’ishah brought out the Prophet’s (peace be upon him) shirt and said: “`Uthman has ruined the way of the Prophet (peace be upon him) even before time could ruin his shirt.”<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie on al-Tijani’s part. `A’ishah never said so nor brought out the Prophet’s (peace be upon him) shirt. This, dear reader, is why al-Tijani never mentioned a source for this fabrication.<\/p>\n<p style=\"text-align: justify;\"><u> <\/u><\/p>\n<p style=\"text-align: justify;\"><u> <\/u><\/p>\n<p style=\"text-align: justify;\"><u>10- Tijani said on pg.89 [The Shia are the Real Ahlul-Sunnah \/ Oppressive Rulers Appointed the Imams of &#8220;Ahlul-Sunnah&#8221;]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>He innovated a school for himself in Islam called the Ḥanbali Madhab even though the scholars of his time testified that he was not a jurist.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: May God increase your ugliness and render your opinion loathsome! Couldn’t you find anybody to accuse except Imam Aḥmad who has been approved as an Imam by the whole nation? By the Lord, can you tell us which scholars said Aḥmad isn’t a jurist? Still, you cannot harm Aḥmad by your words, for barking of dogs cannot harm the clouds.<\/p>\n<p style=\"text-align: justify;\"><u>11- On pg.90 [The Shia are the Real Ahlul-Sunnah \/ Oppressive Rulers Appointed the Imams of &#8220;Ahlul-Sunnah&#8221;]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Alī bin abi <\/strong>Ṭā<strong>lib said that the biggest liar upon the Messenger of Allah is abu Hurayrah. `A’ishah bint Abi Bakr said the same.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Rather the biggest liar upon `Alī bin abi Ṭālib is yourself. Neither `Alī nor `A’ishah said any of this, and this is why al-Tijani doesn’t mention a source.<\/p>\n<p style=\"text-align: justify;\"><u>12- On pg.92 [The Shia are the Real Ahlul-Sunnah \/ The Secret Why Sunni Sects are in the Majority]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>If we are to revise history, we find that Mālik the founder of the Madhab sought closeness of the rulers, made peace with them and followed them.<\/strong><\/p>\n<p style=\"text-align: justify;\">By Allah you lie! What’s the source of your lie and what made you follow Mālik when you were a Sunni? How come you only learned of this after becoming Shia!?<\/p>\n<p style=\"text-align: justify;\">This charlatan claims to have been a Māliki scholar while it is widely known among biographers, and especially Māliki scholars, that Mālik was tortured by Caliph abu Ja`far al-Manṣūr, and was lashed until his shoulder got dislocated.<a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>13- On pg.93 [The Shia are the Real Ahlul-Sunnah \/ The Secret Why Sunni Sects are in the Majority]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Thus, abu Hanifah became the greatest of scholars and his Madhab attracted the biggest number of followers, even though his contemporary scholars went as far as calling him a disbeliever and a heretic. Among such scholars were both Imam Aḥmad ibn Ḥanbal and Imam abu al-Ḥasan al-Ash`ari.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The rope of lying is very short. Are you truly the legendary scholar who impressed the scholars of al-Azhar? Are you truly the one appointed as Mufti of his town? Yet, you continue to reveal your ignorance and impiety. How did Imam Aḥmad become a contemporary of abu Ḥanifah when the latter died at 150 Hijri and the former was born in 164 Hijri. As for al-Ash`arī, he was born after Aḥmad, in 260 Hijri, yet you describe him as a contemporary.<\/p>\n<p style=\"text-align: justify;\">Do you see O’ Shia how much knowledge this imposter has!?<\/p>\n<p style=\"text-align: justify;\"><u>14- On pg.93 [The Shia are the Real Ahlul-Sunnah \/ The Secret Why Sunni Sects are in the Majority]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Ibn Taymiyyah whom they awarded the title of Shaykh-ul-Islam and the Mujaddid, although his own contemporaries branded him as disbeliever, since he judged that all Muslims were polytheists for seeking blessings through the Prophet and interceding through him.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie, once again. The words of Shaykh-ul-Islam are known and they are the words of all the leaders of the pious predecessors. Refer back to the words of Shaykh-ul-Islam in our response to “Then I Was Guided” Section 16.<\/p>\n<p style=\"text-align: justify;\"><u>15- Tijani said on pg.94 [The Shia are the Real Ahlul-Sunnah \/ The Secret Why Sunni Sects are in the Majority]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Aḥmad bin Ḥanbal became a thing of the past since their Madhab today is the Wahhabi Madhab.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: By Allah this is a lie. Who refers to the Ḥanbali Madhab as the Wahhabi Madhab!? Won’t he mention a book that speaks of this? This man claims that he had been to Saudi Arabia and knew the opinions of Muhammad bin `Abdul-Wahhab, may Allah have mercy on him.<\/p>\n<p style=\"text-align: justify;\"><u>16- Tijani on pg.95 [The Shia are the Real Ahlul-Sunnah \/ The Secret Why Sunni Sects are in the Majority]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Among Ahlul-Sunnah it is said that it (i.e Muwatta’ Malik) is the best book after Allah’s book and some scholars even prefer it over Ṣaḥīḥ al-Bukhārī and give it precedence.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: You lied! None of the scholars of Ahlul-Sunnah place the Muwatta’ before Ṣaḥīḥ al-Bukhārī. It is only that al-Shafi`ī said: “After Allah’s book, no book under the heavens is more correct than Muwatta’ Mālik.” This however, was before Ṣaḥīḥ al-Bukhārī had come into existence.<\/p>\n<p style=\"text-align: justify;\">Praise be to the Lord who had combined within you both ignorance and dishonesty.<\/p>\n<p style=\"text-align: justify;\"><u>17- Tijani on pg.103 [The Shia are the Real Ahlul-Sunnah \/ Unavoidable Commentary Serving the Research]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>From what we’ve previously seen, we understand that Imam Mālik was from the Nawāsib since he never acknowledged the Caliphate of the chief of believers `Alī bin abi Ṭālib.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Again you lie when you say that Mālik never acknowledged `Alī bin abi Ṭālib. Won’t you please quote him say this? As for him being a Nāsibi, then this is true in your view, since your sect views that all Sunnis are Nāsibis, let alone an Imam of the Sunnah.<\/p>\n<p style=\"text-align: justify;\"><u>18- Tijani on pg.103 [The Shia are the Real Ahlul-Sunnah \/ Unavoidable Commentary Serving the Research]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The way of the people of Sunnah is a mixture of ibn `Umar’s harsh opinions, the lenience of ibn `Abbās, the oddities of ibn Mas`ūd and what Mālik found good from the traditions of the leaders, meaning Abu Bakr, `Umar and `Uthmān. It contains nothing from the tradition of the Prophet narrated by the purified Imams from his progeny.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: In the books of Sunnah what is narrated from `Alī is more than what’s narrated from Abu Bakr, `Uthmān and the rest of the ten, except for `Umar whose narrations are close to `Alī’s in number.<\/p>\n<p style=\"text-align: justify;\">Whoever wishes to get acquainted with the sources of Ahlul-Sunnah must refer to their books without relying on the words of frauds like al-Tijani. That being said, the Madhab of Ahlul-Sunnah is based on the Qur’an, the Sunnah, the Ijmā`, the opinions of all the Sahabah and Qiyas.<\/p>\n<p style=\"text-align: justify;\"><u>19- On pg.113 [The Shia are the Real Ahlul-Sunnah \/ Hadith al-Thaqalayn According to Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>What proves that the Shia are the followers of authentic prophetic-Sunnah is Hadith al-Thaqalayn that is narrated from the Messenger of Allah: “I am leaving you two weighty things, the Book of Allah and my progeny from my household; if you hold on to them you shall never stray after me; do not precede them or fall behind lest you perish and do not attempt to educate them for they are more knowledgeable than you.”<\/strong><\/p>\n<p style=\"text-align: justify;\">Tijani referenced it in the footnotes: <strong>Reported by Muslim, Tirmidhī, Mustadrak al-Ḥākim, Aḥmad etc…<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He lies, as is his habit, when claiming that it’s in Muslim, Tirmidhī, Ḥākim or Aḥmad’s books. This is a lie attributed to the Sayyid of the Creation (peace be upon him), so refer back to our response to Section #1 of our rebuttal to “Ask Those Who Know”.<\/p>\n<p style=\"text-align: justify;\"><u>20- Tijani said on pg.118 [The Shia are the Real Ahlul-Sunnah \/ Hadith al-Thaqalayn According to Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Do they not hear Allah’s words: {I do not ask you for this message any payment [but] only good will through kinship}. This was revealed concerning her (i.e Fatimah) and her husband and two sons.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Look at the detailed response to this in section #26 in our rebuttal to “Then I Was Guided”.<\/p>\n<p style=\"text-align: justify;\"><u>21- Tijani wrote on pg.120 [The Shia are the Real Ahlul-Sunnah \/ Hadith al-Thaqalayn According to Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The Messenger of Allah said:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>a- This is my brother, executioner of my will and my successor over you.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>b- I am the best prophet and `Alī is the best legatee, the best of who I leave after me.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>c- `Alī is with the truth and the truth is with him.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>d- `Alī is with the Qur’an and the Qur’an is with him.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>e- I fought for the Qur’an’s revelation and `Alī shall fight for its interpretation. He will clarify for my nation what they disagree on after me.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>f- Nobody conveys on my behalf except `Alī and he is the beloved friend of every believer after me.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>g- `Alī from me is as Hārūn was from Mūsā.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>h- `Alī is from me and I am from him and he is the gate to my knowledge.<\/strong><\/p>\n<p style=\"text-align: justify;\">Tijani wrote in the footnotes: <strong>All these narrations are authentic according to Ahlul-Sunnah wal-Jama`ah, and have been reported and authenticated by them.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: I have never witnessed anyone more daring in their lie than al-Tijani. None of the above is authentic according to the people of Sunnah except Ḥadīth al-Manzilah. We’ve already commented on several of these in previous pages, so here’s a breakdown for your pleasure, dear reader.<\/p>\n<p style=\"text-align: justify;\">a- This is my brother, executioner of my will and my successor over you.<\/p>\n<p style=\"text-align: justify;\">This was refuted in “Then I Was Guided” Section 55.<\/p>\n<p style=\"text-align: justify;\">b- I am the best prophet and `Alī is the best legatee, the best of who I leave after me.<\/p>\n<p style=\"text-align: justify;\">I did not find this version, but I found a close one where Jibrīl (peace be onto him) tells the Prophet (peace be upon him): “Allah made you the master of prophets and made your legatee the master of legatees.”<\/p>\n<p style=\"text-align: justify;\">Imam Dāraquṭnī commented by saying, “Fabricated.”<a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/p>\n<p style=\"text-align: justify;\">The report was mentioned by al-Albānī in his series of weak and fabricated reports in this form: “I am the seal of prophets and you O’ `Alī are the seal of friends of Allah.” He then said: “Fabricated.”<a href=\"#_ftn23\" name=\"_ftnref23\">[23]<\/a><\/p>\n<p style=\"text-align: justify;\">c- `Alī is with the truth and the truth is with `Alī.<\/p>\n<p style=\"text-align: justify;\">Al-Haythamī mentioned it and commented: “Narrated by al-Bazzar and it contains Sa`d bin Shu`ayb, and I don’t know him, while the rest of the narrators are of the Ṣaḥīḥ.<a href=\"#_ftn24\" name=\"_ftnref24\">[24]<\/a><\/p>\n<p style=\"text-align: justify;\">Al-Khaṭīb included it in his history under the biography of Yūsuf bin Muḥammad al-Mu’addib,<a href=\"#_ftn25\" name=\"_ftnref25\">[25]<\/a> with the chain of the narration that went through `Uqays Abi Sa`īd al-Taymī, and he is abandoned.<\/p>\n<p style=\"text-align: justify;\">d- `Alī is with the Qur’an and the Qur’an is with `Alī.<\/p>\n<p style=\"text-align: justify;\">Reported by al-Tabarānī<a href=\"#_ftn26\" name=\"_ftnref26\">[26]<\/a> through abu Sa`īd al-Taymī `Uqays whom al-Dāraqutni described as “abandoned.” Jawzajānī said that he was “not reliable.”<\/p>\n<p style=\"text-align: justify;\">e- I fought for the Qur’an’s revelation and `Alī shall fight for its interpretation.<\/p>\n<p style=\"text-align: justify;\">This comes through al-Ḥārith bin Ḥusayrah from Jābir al-Ju`fī and it is mentioned in al-Mūsawī’s book.<a href=\"#_ftn27\" name=\"_ftnref27\">[27]<\/a> Al-Ju`fī is a liar and al-Ḥārith is accused in his religion.<\/p>\n<p style=\"text-align: justify;\">f- No one conveys on my behalf except `Alī.<\/p>\n<p style=\"text-align: justify;\">Refer to our response to “Then I Was Guided” &#8211; section #53.<\/p>\n<p style=\"text-align: justify;\">g- `Alī from me is as Hārūn was from Mūsā<\/p>\n<p style=\"text-align: justify;\">This is authentic.<\/p>\n<p style=\"text-align: justify;\">h- Alī is from me and I am from him and he is the gate to my knowledge.<\/p>\n<p style=\"text-align: justify;\">Refer to our response to “Then I Was Guided” &#8211; section #50.<\/p>\n<p style=\"text-align: justify;\"><u>22- Tijani wrote on pg.121 [The Shia are the Real Ahlul-Sunnah \/ Hadith al-Thaqalayn According to Ahlul-Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>It has been scholarly and historically proven, as supported by the writings of biographers, that `Alī was, indeed, the only authority upon whom the Companions, whether they were learned or the ignorant.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Check our detailed response to this in our rebuttal to “Then I Was Guided” section #44.<\/p>\n<p style=\"text-align: justify;\"><u>23- Tijani states on pg.123 [The Shia are the Real Ahlul-Sunnah \/ Hadith al-Thaqalayn According to Ahlul-Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Both the Qur’an and Sunnah cannot protect us from misguidance since they’re silent, they’re incapable of speaking and they can be interpreted in multiple ways.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Is there any more misguidance after this misguidance?<\/p>\n<p style=\"text-align: justify;\">Allah, glory be to Him, says:<\/p>\n<p style=\"text-align: justify;\">{Indeed, this Qur&#8217;an guides to that which is most suitable}. [17:9]<\/p>\n<p style=\"text-align: justify;\">{This is the Book about which there is no doubt, a guidance for those conscious of Allah}. [2:2]<\/p>\n<p style=\"text-align: justify;\">{These are the verses of the clear Book}. [26:2]<\/p>\n<p style=\"text-align: justify;\">{And We have certainly made the Qur&#8217;an easy for remembrance, so is there any who will remember?} [54:17]<\/p>\n<p style=\"text-align: justify;\">{A Book whose verses have been detailed, an Arabic Qur&#8217;an for a people who know}. [41:3]<\/p>\n<p style=\"text-align: justify;\">The verses are plenty and so are the narrations. Who do we believe O’ Shia? Do we believe our Lord the Most High? Or a vile liar like this Tijani!?<\/p>\n<p style=\"text-align: justify;\">Do you see O’ readers how they attempt to push you away from your Lord’s book. It is as if they’re the ones mentioned by Allah when He said:<\/p>\n<p style=\"text-align: justify;\">{And those who disbelieve say, &#8220;Do not listen to this Qur&#8217;an and speak noisily during [the recitation of] it that perhaps you will overcome.&#8221;} [41:26]<\/p>\n<p style=\"text-align: justify;\">Won’t you think rationally!?<\/p>\n<p style=\"text-align: justify;\"><u>24- Tijani on pg.131 [The Shia are the Real Ahlul-Sunnah \/ The sources of Shari`ah according to Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Ahlul-Sunnah only intend Abu Bakr, `Umar and `Uthmān when they speak of the guided Caliphs. As for `Alī, he was not counted as one of them, but only included at a later time.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: We’re used to his lies by now, so who from among Ahlul-Sunnah said that `Alī isn’t from the guided Caliphs? It is common knowledge that the people of Sunnah follow the footsteps of their predecessors, so what reason drove them to acknowledge `Alī after such a long time and abandon their ways?<a href=\"#_ftn28\" name=\"_ftnref28\">[28]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>25- Tijani on pg.131 [The Shia are the Real Ahlul-Sunnah \/ The sources of Shari`ah according to Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The narration of my Companions are like the stars, whoever of them you emulate will lead you to guidance, was used by ibn al-Qayyim to argue for the authority of a Companion’s opinion.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: It baffles me how al-Tijani is able to lie so openly!<\/p>\n<p style=\"text-align: justify;\">This report was weakened by Ibn al-Qayyim in his book<a href=\"#_ftn29\" name=\"_ftnref29\">[29]<\/a> and stated that it was used as an argument by those who believe that the emulation of scholars is obligatory. After mentioning the various chains of this narration, he commented that: “None of these are established.”<\/p>\n<p style=\"text-align: justify;\"><u>26- Tijani on pg.143 [The Shia are the Real Ahlul-Sunnah \/ Taqlid and Maraji` According to Shia]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Shia continuously followed the Twelve Imams of the Household for nearly three centuries, in one fashion, where none of them would contradict the other.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He repeats another one of his usual lies, so return to our detailed response in “To Be With The Truthful” &#8211; section 3.<\/p>\n<p style=\"text-align: justify;\"><u>27- On pg.153 [The Shia are the Real Ahlul-Sunnah \/ The Righteous Caliphs According to Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Abdullah bin `Umar said while explaining the prophetic-narration “The Caliphs after me are twelve. All of them from Quraysh.” Ibn `Umar said: This nation shall be ruled by twelve Caliphs: Abu Bakr al-Siddīq, `Umar al-Farūq, `Uthmān Dhu-Nurayn, Mu`āwiyah and his son the kings of the Holy Land, al-Saffāḥ, al-Manṣūr, Jābir, al-Mahdi, al-Amīn and the chief of al-`Usab, all of them from the children of Ka`b bin Lu’ay. All of them are righteous and peerless.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: He lied again, may Allah serve him a suitable punishment! Where do we find these outrageous lies that he attributed to `Abdullah bin `Umar!? Did ibn `Umar know the unseen!? For he did not live in the time of al-Saffāḥ, al-Manṣūr and those that succeeded them.<\/p>\n<p style=\"text-align: justify;\"><u>28- On pg.183 [The Shia are the Real Ahlul-Sunnah \/ Talhah bin `Ubaydullah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>When we research this character (i.e Talḥah bin `Ubaydullah) in the books of history, we discover that he is a lover of this materialistic life. He was dragged and swayed by the pleasures of this world that he sold his religion and lost his soul. He was from those whose commerce did not prosper and he shall be regretful on the Day of Judgment.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is an ugly accusation by this malicious man towards a venerable Companion of the Messenger (peace be upon him). He was a man famous for his struggle in Allah’s cause. He sacrificed himself until they said on the day of Uḥud: “This is the day of Talḥah.” On that day, his right hand was paralyzed while he used it to defend the Messenger of Allah (peace be upon him).<\/p>\n<p style=\"text-align: justify;\"><u>29- Tijani states on pg.184 [The Shia are the Real Ahlul-Sunnah \/ Talhah bin `Ubaydullah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Talḥah said: Should the Messenger of Allah pass away, I shall marry `Ā’ishah, for she is my cousin.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: A false statement he and those of his ilk will not able to prove.<\/p>\n<p style=\"text-align: justify;\"><u>30- On pg.191 [The Shia are the Real Ahlul-Sunnah \/ Al-Zubayr bin al-`Awwam]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Ṭaha Ḥusayn says about this treachery (i.e that of Ṭalḥah and Zubayr): “Not only did they break their pledge to `Alī, but they also broke their truce with `Uthmān bin Ḥunayf and killed from the people of Baṣarah, those who condemned their violation of the truce, their jailing of the chief, their ransacking of the treasury and the killing of some of its guards.”<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: And who is this Ṭaha Ḥusayn so that his words would be taken seriously by Ahlul-Sunnah? All these words are simply lies and they’re unable to prove, and such rubbish has been included in history books generally, but none of it is authentic.<a href=\"#_ftn30\" name=\"_ftnref30\">[30]<\/a><\/p>\n<p style=\"text-align: justify;\"><u> <\/u><\/p>\n<p style=\"text-align: justify;\"><u>31- Tijani on pg.196 says [The Shia are the Real Ahlul-Sunnah \/ Sa`d bin abi Waqqas]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>He himself has narrated several of `Alī’s virtues such as what Imam al-Nasā’ī and Imam Muslim reported in their Ṣaḥīḥs: Sa`d said: “I heard the Messenger say that `Alī has three traits, having one of them is dearer to me than red camels: ‘He is from me as Hārūn was from Mūsā but there’s no prophet after me.’ And he said: ‘I shall give the standard tomorrow to a man who loves Allah and his prophet and is loved by them.’ And he said: ‘O’ people, who is your Wali?’ They said: ‘Allah and his Messenger (three times).’ Whereupon he grabbed `Alī’s hand and said: ‘Whoever accepts Allah and his Messenger as his Walis, then this man is also his Wali. O’ Allah befriend whoever befriends him and be the enemy of his enemy.’”<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a lie because neither Muslim nor al-Nasā’ī narrated it in this form. Whoever claims otherwise must prove it by specifying the volume, page number and the edition. Putting forth an unsubstantiated claim isn’t hard for anybody.<\/p>\n<p style=\"text-align: justify;\">As for the first two sections of the narration, they are authentic through other narrations.<\/p>\n<p style=\"text-align: justify;\"><u>32- Tijani on pg. 221 says [The Shia are the Real Ahlul-Sunnah \/ Abu Hurayrah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>Some researchers have gathered the total number of narrations of the righteous Caliphs, the Ten Promised Heaven, the Mothers of Believers and the Purified Household, and found that they do not constitute a hundredth of what abu Hurayrah narrated.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: What is narrated by abu Hurayrah from the Messenger of Allah (peace be upon him) are no more than 5,374 reports.<a href=\"#_ftn31\" name=\"_ftnref31\">[31]<\/a> Some are authentic, some aren’t and others are just repetitions. Some are what he narrated from the Prophet (peace be upon him), some are what he narrated from other Companions, in addition to both what was of his own opinion and what he heard to the Prophet (peace be upon him). Some he narrated exclusively and others he narrated alongside others.<\/p>\n<p style=\"text-align: justify;\">A tenth of this number would be around 537 and a hundredth of that is 54. Now compare this to the number of narrations of the Caliphs, the Ten, the Mother of Believers and the rest of the Household.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers `Ā’ishah narrated 2,210 narrations.<\/p>\n<p style=\"text-align: justify;\">The scholar of this nation, `Abdullah ibn `Abbās, narrated 1,660 narrations.<\/p>\n<p style=\"text-align: justify;\">The Fārūq, `Umar bin al-Khattāb, narrated 537 narrations.<\/p>\n<p style=\"text-align: justify;\">The father of the two prophetic-grandsons, `Alī bin abi Ṭālib, narrated 536 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers, Umm Salamah, narrated 378 narrations.<\/p>\n<p style=\"text-align: justify;\">Sa`d bin abi Waqqāṣ may Allah be pleased with him narrated 271 narrations.<\/p>\n<p style=\"text-align: justify;\">The possessor of two lights, `Uthmān bin `Affān, narrated 146 narrations.<\/p>\n<p style=\"text-align: justify;\">The Siddīq, Abu Bakr, narrated 142 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers, Umm Ḥabībah, narrated 65 narrations.<\/p>\n<p style=\"text-align: justify;\">`Abdul-Rahman bin `Awf, may Allah be pleased, with him narrated 65 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers, <a href=\"http:\/\/www.twelvershia.net\/2016\/02\/13\/hafsa-in-the-eyes-of-sunnis-and-shias\/\">Hafsa<\/a>, narrated 60 narrations.<\/p>\n<p style=\"text-align: justify;\">Sa`īd bin Zayd, may Allah be pleased with him, narrated 48 narrations.<\/p>\n<p style=\"text-align: justify;\">Al-Zubayr bin al-`Awwām, may Allah be pleased with him, narrated 38 narrations.<\/p>\n<p style=\"text-align: justify;\">Ṭalḥah bin `Ubaydullah, may Allah be pleased with him, narrated 38 narrations.<\/p>\n<p style=\"text-align: justify;\">Al-`Abbās bin `Abdul-Muṭalib, may Allah be pleased with him, narrated 35 narration.<\/p>\n<p style=\"text-align: justify;\">`Abdullah bin Ja`far, may Allah be pleased with him, narrated 25 narrations.<\/p>\n<p style=\"text-align: justify;\">Al-Faḏl bin al-`Abbās, may Allah be pleased with him, narrated 24 narrations.<\/p>\n<p style=\"text-align: justify;\">The Sayyid, al-Ḥasan bin `Alī, narrated 13 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers, Zaynab bint Jaḥsh, narrated 11 narrations.<\/p>\n<p style=\"text-align: justify;\">Abu `Ubaydah bin al-Jarrāḥ, may Allah be pleased with him, narrated 14 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers, Ṣafiyyah, narrated 10 narrations.<\/p>\n<p style=\"text-align: justify;\">Al-Ḥusayn bin `Alī, may Allah be pleased with him, narrated 8 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of Believers, Juwayriyyah, narrated 7 narrations.<\/p>\n<p style=\"text-align: justify;\">`Aqīl bin abi Ṭālib, may Allah be pleased with him, narrated 6 narrations.<\/p>\n<p style=\"text-align: justify;\">The Mother of believers, Sawdah, narrated 5 narrations.<a href=\"#_ftn32\" name=\"_ftnref32\">[32]<\/a><\/p>\n<p style=\"text-align: justify;\">The total of their narrations equals to 6,352, whereas abu Hurayrah only narrated 5,374 reports, 517 of these narrations were included in the two Ṣaḥīḥs.<\/p>\n<p style=\"text-align: justify;\">Therefore, their narration exceeds that of abu Hurayrah by a thousand. Then this filthy impostor comes and claims that their narrations altogether do not reach a hundredth of what abu Hurayrah has narrated!<\/p>\n<p style=\"text-align: justify;\">After all this, marvel at the Shia narrations and their numbers:<\/p>\n<p style=\"text-align: justify;\">Al-Ḥurr al-`Āmilī<a href=\"#_ftn33\" name=\"_ftnref33\">[33]<\/a> wrote: “Jābir al-Ju`fī has narrated from Imam al-Bāqir 70,000 reports and another 140,000 from the rest of the Imams.”<\/p>\n<p style=\"text-align: justify;\">Al-Najāshī<a href=\"#_ftn34\" name=\"_ftnref34\">[34]<\/a> wrote: “Abbān bin Taghlib narrated from Imam Ja`far 30,000 narrations.”<\/p>\n<p style=\"text-align: justify;\">Al-Ṣadūq<a href=\"#_ftn35\" name=\"_ftnref35\">[35]<\/a> wrote: “Muḥammad bin Muslim bin Rabāḥ heard from al-Bāqir 30,000 narrations and from al-Sādiq 16,000 narrations.”<\/p>\n<p style=\"text-align: justify;\"><u>33- Tijani wrote on pg.245 [The Shia are the Real Ahlul-Sunnah \/According to Shia, the Prophet&#8217;s Sunnah does not Contradict the Qur&#8217;an]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>It suffices you to know that the book titled al-Kāfī, though written by a great author, Muḥammad bin Ya`qūb al-Kulaynī, who delved in-depth in the science of Ḥadith, though Shia scholars never claimed that all its contents are authentic. Rather, some of them have discredited and labeled half of its contents as weak. Even the author of al-Kāfī himself does not claim that all the narrations he compiled in his book are authentic.<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: An unsubstantiated claim remains nothing more than just a claim.<\/p>\n<p style=\"text-align: justify;\">In this matter we have two bitter choices: Either al-Tijani is an ignorant or he is a liar. The second seems to be the case for two reasons.<\/p>\n<p style=\"text-align: justify;\">Firstly, his previous dishonesty as well as what is to come suggests this, and secondly, he has claimed that he is one of vast knowledge and deep research.<\/p>\n<p style=\"text-align: justify;\">Before you are the words of the relied upon Shia scholars concerning al-Kāfī:<\/p>\n<p style=\"text-align: justify;\">a- Al-Ṭabrasī said: Al-Kāfī among the four books<a href=\"#_ftn36\" name=\"_ftnref36\">[36]<\/a> is like the sun between the stars. If an unbiased observer contemplates, he’d learn that checking the conditions of the individuals in the chains of narrators is not required; rather, he’d feel comfortable about the issuance and authenticity of its reports.<a href=\"#_ftn37\" name=\"_ftnref37\">[37]<\/a><\/p>\n<p style=\"text-align: justify;\">b- Al-Ḥurr al-`Āmilī included a chapter which he referred to as the “Sixth Benefit” regarding the authenticity of the relied upon books (i.e. al-Kāfī and others) that were used to compile his book. He also authorized their transmission, attribution and the establishment of its narrations from the Imams.<a href=\"#_ftn38\" name=\"_ftnref38\">[38]<\/a><\/p>\n<p style=\"text-align: justify;\">The issue with the Shia is that they do not read their relied upon books, but only what their scholars order them to read.<\/p>\n<p style=\"text-align: justify;\">c- Sharaf-ul-Dīn al-Mūsawī said: Al-Kāfī, al-Istibṣār, al-Tahdhīb and Man Lā Yahduruhu al-Faqīh are all mass transmitted. Their contents are surely authentic and al- Kāfī is the oldest, the best, the greatest and most precise of them.<a href=\"#_ftn39\" name=\"_ftnref39\">[39]<\/a><\/p>\n<p style=\"text-align: justify;\">d- Muḥammad Ṣādiq al-Ṣadr said: What should be known by the reader is that even though the Shia are in agreement over the reliability of the four books and the authenticity of all their contents, yet they do not label them with the term “Ṣaḥīḥ” as their Sunni brothers did.<a href=\"#_ftn40\" name=\"_ftnref40\">[40]<\/a><\/p>\n<p style=\"text-align: justify;\">These are some statements of their scholars and there are many others.<\/p>\n<p style=\"text-align: justify;\">As for statement that the author of al-Kāfī did not considering the authenticity of the reports that he gathered, then it is a lie upon al-Kulaynī who clearly says the opposite in the introduction of his book:<\/p>\n<p style=\"text-align: justify;\">“Verily, you solemnly wished that you possessed a book which is sufficient, brings together all Islamic sciences, which wholly satisfy the needs of the student and acts as a reference for the seekers of guidance, and would be used by those who want to attain the knowledge of religion and practice upon it by deriving authentic narrations of the truthful ones.”<a href=\"#_ftn41\" name=\"_ftnref41\">[41]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>34- Al-Tijani said on pg. 251 [The Shia are the Real Ahlul-Sunnah \/ The Sunnah and the Qur&#8217;an According to Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>The author of the book Maqālāt al-Islamiyyīn cites Imam al-Ash`arī, the chief Imam of Ahlul-Sunnah wal-Jama`ah with regard to fundamentals saying: “The Sunnah abrogates the Qur&#8217;an and cancels its injunctions, whereas the Qur&#8217;an neither abrogates nor cancels the Sunnah.”<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This statement combines both ignorance and deception. O’ Shias, observe the man who claims to be from the scholars of Ahlul-Sunnah and observe his vast ignorance.<\/p>\n<p style=\"text-align: justify;\">The ignorance is in his statement is that the author of al-Maqālāt cites Imam al-Ash`arī. We’d love to ask Tijani who is this author of al-Maqālāt who is citing al-Ash`ari, for al-Ash`ari himself is the author of al-Maqālāt al-Islamiyyīn!!<\/p>\n<p style=\"text-align: justify;\">His deceptions can be explained in points:<\/p>\n<p style=\"text-align: justify;\">a- He said that al-Ash`arī is the Imam of Ahlul-Sunnah in fundamentals of faith and this is incorrect. This is only the view of the Ash`arīs. As for the people of Sunnah, their Imam in this is Muḥammad bin `Abdillah (peace be upon him), then his Companions, the scholars of the Tabi`īn and their followers.<\/p>\n<p style=\"text-align: justify;\">As for who is popularly known to be the Imam of Ahlul-Sunnah, then that is Aḥmad bin Ḥanbal, as al-Tijani is aware.<\/p>\n<p style=\"text-align: justify;\">b- He misquoted abu al-Ḥasan al-Ash`arī and these are his actual words:<\/p>\n<p style=\"text-align: justify;\">“They differed in regards to the Qur’an. Can the Qur’anic text be abrogated by something other than the Qur’an? As for the Sunnah, can it be abrogated by the Qur’an? They had three opinions:<\/p>\n<p style=\"text-align: justify;\">a- Some said the Qur’an can only be abrogated by the Qur’an and not by the Sunnah.<\/p>\n<p style=\"text-align: justify;\">b- Others said the Sunnah abrogates the Qur&#8217;an and cancels its injunctions, whereas the Qur&#8217;an neither abrogates nor cancels the Sunnah.<\/p>\n<p style=\"text-align: justify;\">c- Others said the Qur’an abrogates the Sunnah, but the Sunnah does not abrogate the Qur’an.<\/p>\n<p style=\"text-align: justify;\">d- Others said that both the Qur’an and the Sunnah are rulings from Allah. Knowing them and practicing upon them is obligatory upon the creations. It is possible that Allah would abrogate the Qur’an by the Sunnah at times and that Allah would abrogate the Sunnah by the Qur’an as well.<a href=\"#_ftn42\" name=\"_ftnref42\">[42]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>35- Tijani says on pg. 255 [The Shia are the Real Ahlul-Sunnah \/ The Sunnah and the Qur&#8217;an According to Ahlul-Sunnah wal-Jama`ah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>`Alī himself used to say: I am the greatest Siddīq, nobody claims it after me except a liar.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">I say: This is a fabricated report narrated by `Abbād bin `Abdullah. `Alī bin al-Madīnī described him as “weak”. Al-Bukhārī said: “He needs to be looked into.” Ibn al-Jawzī said: “This is a fabricated report.”<a href=\"#_ftn43\" name=\"_ftnref43\">[43]<\/a><\/p>\n<p style=\"text-align: justify;\"><u>36- Tijani says on pg. 289 [The Shia are the Real Ahlul-Sunnah \/ How Ahlul-Sunnah wal-Jama`ah contradict the Prophet&#8217;s Sunnah]:<\/u><\/p>\n<p style=\"text-align: justify;\"><strong>It suffices for us to know that Ahlul-Sunnah wal-Jama`ah are also called “Qadariyyah” due to their belief in that (i.e denying predestination).<\/strong><\/p>\n<p style=\"text-align: justify;\">I say: The Qadariyyah are not from Ahlul-Sunnah, rather they are from the misguided innovators.<a href=\"#_ftn44\" name=\"_ftnref44\">[44]<\/a><\/p>\n<p style=\"text-align: justify;\">In the end, I can only say to al-Tijani and those who believe and follow him what Allah said: {Come! We will summon our sons and your sons, and our women and your women, and ourselves and yourselves, then we will pray humbly (to our Lord) and invoke the curse of Allah upon those who lie.} [3:61]<\/p>\n<p style=\"text-align: justify;\">Will they answer this call?<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Aḥmad reported it in Faḏa’il al-Ṣaḥaba 2\/576-577 hadith #976.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Ṣaḥīḥ Bukhārī – Kitāb al-`Ilm #118, Ṣaḥīḥ Muslim – Kitāb al-Faḏā’il #2492<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Ṣaḥīḥ Bukhārī – Kitāb al-`Ilm #119, Ṣaḥīḥ Muslim – Kitāb al-Faḏā’il #2493<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Siyar A`lām al-Nubalā’ 2\/598<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Ibid 2\/599<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Al-Iṣāba 4\/203<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Al-Siyar 2\/578<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Tahdhīb al-Tahdhīb 7\/334<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Tahdhīb al-Kamāl 6\/220<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Ibid 6\/396<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Ibid 20\/382<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Ibid 26\/136<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Tahdhīb al-Kamāl 5\/74<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Ibid 29\/43<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Mīzān al-I`tidāl 3\/158<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> Al-Majrūḥīn 2\/106<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Bidāyah wal-Nihāyah 11\/17<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> Al-`Ibar 1\/364<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> Lisān al-Mīzān 2\/240<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> Ṣaḥīḥ al-Bukhārī – Kitāb al-Ṣawm #1910<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> Siyar al-A`lām 8\/80<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> Fawā’id Majmū`ah pg.383 #1138<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref23\" name=\"_ftn23\">[23]<\/a> Silsilah Da`īfah #694<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref24\" name=\"_ftn24\">[24]<\/a> Majma` al-Zawā’id 7\/235<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref25\" name=\"_ftn25\">[25]<\/a> Tarīkh Baghdād 14\/320<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref26\" name=\"_ftn26\">[26]<\/a> Mu`jam Saghīr pg.707<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref27\" name=\"_ftn27\">[27]<\/a> Al-Murāja`āt pg.420<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref28\" name=\"_ftn28\">[28]<\/a> Refer to the first section of this rebuttal.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref29\" name=\"_ftn29\">[29]<\/a> I`ilām al-Muwaqqi`īn 2\/174<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref30\" name=\"_ftn30\">[30]<\/a> Refer to the book “Ḥuqba min al-Tārīkh” by the author.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref31\" name=\"_ftn31\">[31]<\/a> Jawāmi` al-Siyar by ibn Ḥazm pg.275<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref32\" name=\"_ftn32\">[32]<\/a> Ibid.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref33\" name=\"_ftn33\">[33]<\/a> Khātimat Wasā’il al-Shī`ah pg.151<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref34\" name=\"_ftn34\">[34]<\/a> Rijāl al-Najāshī pg.9<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref35\" name=\"_ftn35\">[35]<\/a> Mashyakhat al-Ṣadūq pg.6<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref36\" name=\"_ftn36\">[36]<\/a> The four books are Al-Kāfī, al-Faqīh, al-Istibṣār and al-Tahdhīb.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref37\" name=\"_ftn37\">[37]<\/a> Al-Mustadrak al-Wasā’il 3\/532<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref38\" name=\"_ftn38\">[38]<\/a> Khātimat al-Wasā’il pg.61<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref39\" name=\"_ftn39\">[39]<\/a> Al-Murāja`āt #110, Remember that al-Tijani claimed he read al-Muraja`at more than once<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref40\" name=\"_ftn40\">[40]<\/a> Al-Shī`ah pg.127<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref41\" name=\"_ftn41\">[41]<\/a> Introduction of al-Kāfī<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref42\" name=\"_ftn42\">[42]<\/a> Maqālāt al-Islamiyyīn 2\/277<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref43\" name=\"_ftn43\">[43]<\/a> Mawdū`āt 1\/341<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref44\" name=\"_ftn44\">[44]<\/a> Return to our response to “To be with the Truthful” &#8211; section #14.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Response to: The Shia are the Real Ahlul-Sunnah by Sh. Uthmān Al-Khamīs Translated by Hānī Salḥab Al-Ṭarābulsī *Note: The original page referencing provided by Sh. Uthmān Al-Khamīs was kept. Though, we have added the titles of the chapters in English <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/08\/04\/response-to-the-shia-are-the-real-ahlul-sunnah\/\" title=\"Response to: The Shia are the Real Ahlul-Sunnah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10],"tags":[],"class_list":{"0":"post-3384","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-books"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3384","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3384"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3384\/revisions"}],"predecessor-version":[{"id":4259,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3384\/revisions\/4259"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3819"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3384"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3384"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3384"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}