{"id":3392,"date":"2016-08-07T20:00:16","date_gmt":"2016-08-07T20:00:16","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3392"},"modified":"2016-08-06T22:04:51","modified_gmt":"2016-08-06T22:04:51","slug":"al-tijanis-guidance-of-truth-a-brief-critical-examination-of-his-final-chapter","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/08\/07\/al-tijanis-guidance-of-truth-a-brief-critical-examination-of-his-final-chapter\/","title":{"rendered":"Al-Tijani’s “Guidance of Truth” – A Brief Critical Examination of his Final Chapter"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3392\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>Al-Tijani’s “Guidance of Truth” – A Brief Critical Examination of his Final Chapter<\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">The following is a response to Muhammad Al-Tijani Al-Samawi’s final chapter in “Then I was Guided.” The chapter was titled “The Guidance of Truth” and can be found <a href=\"https:\/\/www.al-islam.org\/then-i-was-guided-muhammad-al-tijani-al-samawi\/guidance-truth\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Background<\/strong><\/p>\n<p style=\"text-align: justify;\">In this story-driven chapter, Al-Tijani speaks of how through the guidance of Ahlulbayt he was able to prevent a tragedy from occurring. The story starts out as follows:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“In a small village in the south of Tunisia, during a wedding ceremony, an old lady sat in the middle of a group of ladies listening to them talking about a married couple. The lady expressed her astonishment about what she heard, and when she was asked why, she said that she had breast-fed both when they were babies. The ladies spread the news quickly among their husbands who investigated the matter. The woman&#8217;s father testified that the old lady had actually breast-fed his daughter, and the man&#8217;s father also testified that his son was breast-fed by the same old lady.<\/p>\n<p style=\"text-align: justify;\">Inevitably the two tribes were agitated by the news and started fighting each other, and each tribe accused the other of being the cause of this tragedy which would bring the wrath of Allah on them. What made it worse was the fact that that marriage had taken place ten years earlier and had produced three children. As soon as the woman heard the news she fled to her father&#8217;s house and refused to eat or drink anything, and she attempted suicide for she could not bear the shock of being married to her brother and giving birth to three children without knowing the real situation.<\/p>\n<p style=\"text-align: justify;\">As a result of the clashes between the two tribes, many people were injured until one particular Shaykh intervened and stopped the fighting and advised them to consult the learned scholars and ask them for their opinion in the matter and hopefully they could reach a solution.”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The families took it upon themselves to refer the matter to the scholars in order to find a solution to their problem. However, the Maliki scholars of Tunisia were in agreement that the marriage was void, since a drop of milk by a wet nurse causes the two to become siblings through suckling.<\/p>\n<p style=\"text-align: justify;\">Enter Tijani, the saviour of Gafsa, who gave his religious ruling that the couple are not siblings through suckling since they have not consumed enough breast milk to be considered as such. Al-Tijani argues that they would be only considered siblings if they “were breast-fed fifteen full and consecutive times by the same woman, or what could produce flesh and bone,” and that this was the religious ruling of Ali bin Abi Talib, and it should take precedence over the ruling of Malik.<\/p>\n<p style=\"text-align: justify;\">The woman’s father rejoiced, since his daughter was only breastfed on two or three occasions.<\/p>\n<p style=\"text-align: justify;\">Al-Tijani continues:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The religious adviser said, &#8220;Give us the authentic reference to the saying (of Imam ‘Ali) so that we may feel satisfied. I gave them &#8220;MinHajj al-Salihin&#8221; by al-Sayyid al-Khu&#8217;i, and he read aloud the chapter concerning breast-feeding and what it entails.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Sometime later, Al-Tijani was summoned to court to argue his case. Where in which he provides the same reference, though, it is rejected by the judge. Al-Tijani then provides a quote from Saheeh Al-Bukhari in which A’isha states that for the two to be related through suckling, they needed to have been suckled at least five times. Al-Tijani then provides quotations from Mahmoud Shaltoot who mentions that there is a difference of opinion between scholars in this subject.<\/p>\n<p style=\"text-align: justify;\">The chief judge accepts the evidence presented to him and rules that the marriage is not void, but that it is intact. The families of the husband and wife rejoice.<\/p>\n<p style=\"text-align: justify;\">In the end, Al-Tijani’s reputation gets a major boost and some even refer to him as “more knowledge able than anybody even the Republic&#8217;s Mufti.”<\/p>\n<p style=\"text-align: justify;\">Al-Tijani concludes by saying:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“The chief judge also talked to his friends and the case became famous. Thus, Allah prevailed on the cunning of those wicked people, some of them came to apologize, others were enlightened by Allah and became one of the faithful this is truly the grace of Allah. He gives it to whoever He likes. Allah is the Most Gracious.”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The term “enlightened” is used to describe one who has entered Shiasm, as is known in polemical circles.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>The Guidance of Ahl Al-Bayt<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Tijani’s final chapter attempts to put everything into place. His goal isn’t to simply provide a heart warming story in which he established a personal victory over the religious institution in Tunisia, but rather, that it was through the guidance of the teachings of Ahl Al-Bayt that he was able to literally save lives and solve this chaotic dispute. Furthermore, it was through these teachings that certain community members accepted Shiasm in the end. Al-Tijani is very specific with his words in this chapter. He preaches, “This is the Madhhab of Ahl al-Bayt,” and, “it is the grace of Ahl Al-Bayt’s way.”<\/p>\n<p style=\"text-align: justify;\">Though, what is meant by Ahl Al-Bayt here? We ask since “the way of Ahl Al-Bayt” is now often used as a buzz word, and this will become apparent to readers as we proceed. According to Al-Tijani, the “way of Ahl Al-Bayt” in this context is Ali bin Abi Talib.<\/p>\n<p style=\"text-align: justify;\">When questioned about his views on the number of sucklings, Al-Tijani argues against the group of Maliki holy men by asking, “Who is nearer (to the Prophet – peace be upon him), him (Malik) or Imam ‘Ali ibn Abi Talib?”<\/p>\n<p style=\"text-align: justify;\">He also claimed that, according to Ali, marriages between couples that have been breast-fed by the same woman are only forbidden if they “were breast-fed fifteen full and consecutive times by the same woman, or what could produce flesh and bone.&#8221;<\/p>\n<p style=\"text-align: justify;\">Ironically, Al-Tijani is unable to provide a reference to Ali’s opinion. Instead, he directed the Maliki holy men to Al-Khoei’s Minhaj Al-Saliheen. Upon returning to the chapter on suckling in the book 2\/267, we find that there are no quotes attributed to Ali at all. This is no surprise, since the book mainly consists of Al-Khoei’s personal opinions and religious rulings and it is not a hadith book. Even at court, Al-Tijani brings for Minhaj Al-Saliheen once again, in order to convince the judge of his opinion.<\/p>\n<p style=\"text-align: justify;\">Upon further research into the classical hadith books, we found what Al-Tijani was hiding.<\/p>\n<p style=\"text-align: justify;\">Al-Tusi in Tahtheeb Al-Ahkam 7\/1747, one of the four Shia books of hadith, quotes from Ali bin Abi Talib that he said, “Suckling once is like suckling a hundred times, she will never be <em>halal<\/em> for him.”<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi grades this narration in his commentary 12\/152 as authentic.<\/p>\n<p style=\"text-align: justify;\">In other words, the reason that Al-Tijani was so hesitant to provide a narration by Ali from a hadith book is because the opinion of Ali, according to Shia hadith standards, is the same opinion that Malik holds, which Al-Tijani is rejecting.<\/p>\n<p style=\"text-align: justify;\">Al-Tijani proceeds to provide a narration from Al-Bukhari in which A’isha states that “the Messenger of Allah (saw) in his lifetime only prohibited the marriage, if the couple were breast-fed on five occasions or more by the same woman.&#8221;<\/p>\n<p style=\"text-align: justify;\">Soon after, the judge accepts his opinion, and days later, certain individuals from the community embrace Shiasm.<\/p>\n<p style=\"text-align: justify;\">Al-Tijani is not clear as to why exactly they choose Shiasm. Was it through the guidance of the teachings of Ahl Al-Bayt? Unless Ahl Al-Bayt in this context is referring to the wives of the Prophet – peace be upon him – the story makes no sense.<\/p>\n<p style=\"text-align: justify;\">How could anyone convert to Shiasm due to this? Ali bin Abi Talib is never referenced through a source. The only opinion attributed to Ali is one that agrees with the traditional Maliki opinion. Most importantly, the only reference provided is a narration by A’isha. Did they convert to Shiasm because they liked A’isha’s narration in Al-Bukhari?!<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/p>\n<p style=\"text-align: justify;\">There is not much that needs to be said that hasn’t already been said by <a href=\"http:\/\/twelvershia.net\/exposing-tijani\/\" rel=\"external nofollow\">Sh. Uthman Al-Khamis<\/a>. Tijani has been exposed several times and his reputation is beyond repair. We can only wish that readers critically examine his work instead of casually reading so that they could witness his true nature.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Al-Tijani’s “Guidance of Truth” – A Brief Critical Examination of his Final Chapter The following is a response to Muhammad Al-Tijani Al-Samawi’s final chapter in “Then I was Guided.” The chapter was titled “The Guidance of Truth” and can be <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/08\/07\/al-tijanis-guidance-of-truth-a-brief-critical-examination-of-his-final-chapter\/\" title=\"Al-Tijani’s “Guidance of Truth” – A Brief Critical Examination of his Final Chapter\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-3392","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3392","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3392"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3392\/revisions"}],"predecessor-version":[{"id":3395,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3392\/revisions\/3395"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3392"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3392"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3392"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}