{"id":3401,"date":"2016-08-21T17:00:16","date_gmt":"2016-08-21T17:00:16","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3401"},"modified":"2017-02-16T21:23:58","modified_gmt":"2017-02-16T21:23:58","slug":"abu-bakr-the-chief-of-believers-in-hajj-9th-hijri-year","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/08\/21\/abu-bakr-the-chief-of-believers-in-hajj-9th-hijri-year\/","title":{"rendered":"Abu Bakr the Chief of believing pilgrims [9th Hijri year]"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3401\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: center;\"><strong><u>The Hajj led by Abu Bakr (ra) in 9 AH<\/u><\/strong><\/h1>\n<p style=\"text-align: justify;\"><strong>Introduction<\/strong><\/p>\n<p style=\"text-align: justify;\">One of the arguments scholars of Sunnah give to show the high status of Abu Bakr As-Siddiq is that he was appointed as the chief of pilgrims or Ameer-ul-Hajj, and since Hajj is the type of worship which includes all other types of `Ibadah hence it indicates that Abu Bakr was the most knowledgeable of them regarding the issues of Hajj.<\/p>\n<p style=\"text-align: justify;\">However Shiites have a different approach while dealing with this incident. They do not have any details regarding the leadership of Hajj. All they have is an incident related to the delivery of the Bara’ah to the inhabitants of Makkah and based on that they assumed that Abu Bakr was removed from the leadership when `Ali was ordered to deliver Bara&#8217;ah.<\/p>\n<p style=\"text-align: justify;\">Famous Shi`i scholar Ibn Mutahhar al-Hilli said while speaking about Abu Bakr:<br \/>\n[The Prophet (sallallahu ‘alaihi wa sallam) did not appoint him as a leader in any matter during his lifetime… And when he sent him with Bara’ah he took him back after three days. So how could any sane person accept the leadership of someone who is not liked by the Prophet, through the revelation from Allah, for the conveying of even ten verses of Bara’ah.]<\/p>\n<p style=\"text-align: justify;\">The Shia al-Sharif al-Murtada says in Al-Shafi:<br \/>\n[As for his saying (i.e. of Qadi Abdul Jabbar the Mu’atazalite) that Abu Bakr was the Ameer appointed by the Messenger of Allah (sallallahu alaihi wa sallam) during the season of Hajj and during the conquest of Makkah, then it is not accepted. Our companions [Shi’ites] say that when Abu Bakr was removed from the responsibility to deliver Bara&#8217;ah simultaneously he was also removed from the leadership of the Hajj&#8230;]<\/p>\n<p style=\"text-align: justify;\">It is utter falsehood to claim that Abu Bakr As-Siddiq was not appointed as an Ameer in any matter, as Al-Hilli claimed, or he was removed from the leadership of the Hajj expedition, as Sharif Murtada assumed. One thing to consider here is that there is contradiction between the views of Murtada and al-Hilli. According to Murtada, Abu Bakr was removed from the leadership while as per Al-Hilli he was never given the leadership in the first place, but rather he was only told to deliver the verses of Bara’ah.<\/p>\n<p style=\"text-align: justify;\">First to counter the claim of Al-Hilli that Abu Bakr was never given the leading role in any expedition, let me point out the fact that he was at least appointed as an Ameer or Imam during the following occasions:<\/p>\n<p style=\"text-align: justify;\">1. Hajj expedition in 9 AH.<br \/>\n2. Imam of Prayer during the final days of the Prophet (sallallahu alaihi wa sallam).<br \/>\n3. Military expedition towards Banu Fizarah in Najd in 7 AH.<br \/>\n4. Military expedition at Khaybar before `Ali was given the flag.<\/p>\n<p style=\"text-align: justify;\">There is no dispute regarding his leadership in the Hajj expedition during that year and even Al-Murtada accepted it but he claimed that he Abu Bakr (ra) was replaced by `Ali (ra) after three days<\/p>\n<p style=\"text-align: justify;\">Similarly, Ja`far Murtada al-`Amili also claimed in his encyclopedic “As-Sahih min Seerah al-Imam al-`Ali” that Abu Bakr was simultaneously removed from the leadership when the responsibility of delivering Bara&#8217;ah was taken away from him.<\/p>\n<p style=\"text-align: justify;\"><strong><u>Ali was sent to deliver Bara’ah only while Abu Bakr was leading the pilgrims:<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">Ahlus-Sunnah are in agreement that `Ali was sent to announce Bara&#8217;ah to the people of Makkah not to lead people in their pilgrimage. Imam Abu Ja`far al-Tahawi says in his famous book Sharh Ma`ani al-Aathar (9\/225) while answering the objections of those who thought there is a contradiction in these narrations:<\/p>\n<p style=\"text-align: justify;\">أَنَّهُ مَا فِي ذَلِكَ اضْطِرَابٌ كَمَا ذَكَرَ؛ لِأَنَّ الْإِمْرَةَ فِي تِلْكَ الْحِجَّةِ , إِنَّمَا كَانَتْ لِأَبِي [ص:226] بَكْرٍ خَاصَّةً , لَا شَرِيكَ لَهُ فِيهَا , وَكَانَتِ الطَّاعَةُ فِي الْأَمْرِ وَالنَّهْيِ الَّذِي يَكُونُ فِيهَا إِلَى أَبِي بَكْرٍ لَا إِلَى سِوَاهُ , فَمِنْ أَجْلِ ذَلِكَ بَعَثَ أَبَا هُرَيْرَةَ فِي الْمُؤَذِّنِينَ الَّذِينَ كَانُوا مَعَهُ لِيَمْتَثِلُوا مَا يَأْمُرُهُمْ بِهِ عَلِيٌّ رَضِيَ اللهُ عَنْهُ فِيمَا بَعَثَهُ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ , وَقَدْ دَلَّ عَلَى ذَلِكَ<\/p>\n<p style=\"text-align: justify;\">“There is no contradiction in them as they say. That is because the leadership during that Hajj was for Abu Bakr specifically; nobody was his associate in leadership. And obedience in command and forbiddance was for Abu Bakr and not for anyone else. And for that reason he (i.e Abu Bakr) sent Abu Hurayrah among the callers so that they could follow `Ali in what he tells them to announce as per the instruction of the Messenger of Allah (sallallahu ‘alaihi wa sallam).”<\/p>\n<p style=\"text-align: justify;\">Then Imam Tahawi mentions some narrations which I am also going to quote among other narrations to make this historic event clear. Among those hadith is the hadith Imam Nasai included in his Sunan (2958) through Shu`ba from Mughirah from `Aamir Ash-Sha`bi from Muharrar b. Abi Hurayrah from his father Abu Hurayrah (ra) who said, “I was with `Ali when the Messenger of Allah (sallallahu alaihi wa sallam) sent him with (the verses of) Bara’ah…”<\/p>\n<p style=\"text-align: justify;\">Abu Hurayrah came with `Ali (ra) to join Abu Bakr (ra). And later on Abu Bakr (ra) sent him with `Ali (ra) to aid him in announcing Bara’ah in front of each and every group of people living in Makkah. Hence, Imam Bukhari records in his Sahih [369, 1622, 3177, 4656], Muslim in his Sahih [1347], Nasai in Sunan [2957] and many others through Ibn Shihab from Humaid b. Abdur-Rahman from Abu Huraira, “Abu Bakr sent him, during the pilgrimage he was leading, with the group of people who were announcing that no polytheist would perform Hajj after that year and no one would circumambulate without clothes…” – This has also been narrated through Ibn Shihab from Ibn Musayyib from Abu Hurayrah as in Tafsir Ibn Abi Hatim [6\/1745]<\/p>\n<p style=\"text-align: justify;\">A more detailed description is narrated by Nasai in his Sunan [2993] and “Khasais `Ali” [78], Ad-Darimi in Sunan [1956], Ibn Khuzaima in Sahih [2974], Ibn Hibban in Sahih [6645] through Ibn Juraij from Abdullah b. Uthman b. Khuthaim from Abu Zubair from Jabir [ra]:<\/p>\n<p style=\"text-align: justify;\">“When the Messenger of Allah [sallallahu alaihi wa sallam] returned from the `Umrah of Ji`iranah he sent Abu Bakr to lead people in Hajj. We went with him until when he was was at al-`Urj the Iqamah of prayer was said and he stood up to say Takbeer. He stopped when he heard the grunting of the camel of the Messenger of Allah. He said, “This is the grunting of the camel of the Messenger of Allah [sallallahu alaihi wa sallam]. Something has been disclosed to the Messenger of Allah, and perhaps he is here and we will pray with him.” But it was `Ali on the camel. Abu Bakr asked him, “Are you here as a leader or as a messenger?” He answered, “Rather as a messenger. The Messenger of Allah sent me with Bara’ah so that I may recite it to the people at Hajj.” So we came to Makkah and one day before Tarwiyah Abu Bakr stood up and addressed the people, telling them about the rituals. When he finished his speech, `Ali stood up and recited the Bara’ah to the people until he finished it…. On the first day of Nafr, Abu Bakr stood up and addressed the people, telling them how to offer their sacrifice and how to stone the Jamarat, and teaching them their rituals. When he finished `Ali stood up and recited the Bara’ah…”<\/p>\n<p style=\"text-align: justify;\">All of its narrators are reliable except Ibn Khuthaim who was a disputed narrator. Nasai said, “He was not strong.” But at another place he declared him Thiqah. Ibn Ma’een declared him Thiqah in one of the reports. Al-‘Ijli, Ibn Sa’d and Ibn Hibban also declared him Thiqah. [Tahdhib al-Kamal]<\/p>\n<p style=\"text-align: justify;\">One may object to this report by saying that the `Umrah of Ji`iranah happened in the year 8 after Hijrah while Abu Bakr led the Hajj in the year 9 after Hijrah. So how it can be reconciled?<\/p>\n<p style=\"text-align: justify;\">The answer to it is that the narrator here is giving approximate dating and the narration only states that Abu Bakr led people after the `Umrah of Ji`iranah not that they both happened in the same year.<\/p>\n<p style=\"text-align: justify;\">This narration also emphasizes that it was Abu Bakr who taught people the Islamic rituals of Hajj and `Ali only announced the Bara’ah after him.<\/p>\n<p style=\"text-align: justify;\">Similar description is also mentioned in a narration reported by Ibn Jareer at-Tabari in his Tafseer (14\/113) through Abu Zur’ah al-Misri from Haiwah b. Shuraih from Abu Humaid b. Ziyad from Abu Mu’awaiyah al-Bajali from Abu Sahba’ al-Bakri that `Ali bin Abi Talib said: The Messenger of Allah (sallallahu ‘alaihi wa sallam) sent Abu Bakr b. Abi Quhafah to observe people in their Hajj and sent me with him to proclaim forty verses of Bara’ah. When he reached `Arafah he delivered his speech in front of people. When he completed the sermon he looked at me and said, “Stand O `Ali and deliver the message of the Messenger of Allah (sallallahu alaihi wa sallam).” So I stood and recited to them forty verses of Bara’ah…”<\/p>\n<p style=\"text-align: justify;\">This is not all as Tirmidhi narrates in Sunan [3091], Tabrani in “Al-Awsat” [928], Al-Haakim in “Al-Mustadrak” [4375] through Sufyan b. Husain from Hakam b. `Utaibah from Miqsam from Ibn `Abbas that when Abu Bakr heard the foot-steps of the she-camel of the Messenger of Allah [sallallahu alaihi wa sallam] he went back looking for it in fear, thinking of the Messenger of Allah [sallallahu alaihi wa sallam]. He found `Ali and submitted the order of the Messenger of Allah (sallallahu ‘alaihi wa sallam) to him. He told `Ali to announce those orders. So they both went and performed Hajj rituals. `Ali stood up in the days of Tashriq and announced… When he became tired Abu Bakr stood up and announced.<\/p>\n<p style=\"text-align: justify;\">This hadith was also reported by Al-Khawarazmi in “Manaqib `Ali” [pg.164, no. 195] and he adds, “This narration shows that the leader over the pilgrims was Abu Bakr and `Ali was given the task of delivering the verses of Bara’ah.”<\/p>\n<p style=\"text-align: justify;\">We see that all these narrations indicate that Abu Bakr was leading the people in Hajj and `Ali was there to deliver Bara’ah to the people of Makkah.<\/p>\n<p style=\"text-align: justify;\"><strong><u>Why was Abu Bakr stopped from delivering Bara’ah?<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">The reason given for deposing of Abu Bakr from this responsibility of delivering the Bara&#8217;ah, as per the wording of some reports, is that no one should deliver it except the Prophet himself or someone else from his household.<\/p>\n<p style=\"text-align: justify;\">Hence, the explanation given by scholars based on the apparent wording of the narration is that the Arabs would not accept the declaration of nullification of a pact or treaty except from the person who made the treaty or someone who is from his household.<\/p>\n<p style=\"text-align: justify;\">This explanation has been given by many scholars including Fakhruddin Ar-Razi in his Tafsir (15\/524), Muhibb at-Tabari in “Dhakhair al-‘Uqbah” (1\/70), Ibn Taiymiyya in Minhaj (8\/296), Ibn Hajar in Sharh al-Bukhari (8\/321) and Az-Zurqani in Sharh Mawahib al-Ladunniyah (4\/119).<\/p>\n<p style=\"text-align: justify;\">Although Islam does not support such trends but since declaration was for the disbelievers of Makkah and they had to face the consequence of it if they did not follow it therefore to establish the Hujjah on them their norm was followed. This is mentioned by ‘Allamah Muhibb at-Tabari in Dhakhair al ‘Uqbah (1\/70).<\/p>\n<p style=\"text-align: justify;\">Islam does not teach any such idea that `Ali (ra) was the only competent person to deliver the message of the Prophet (sallallahu alaihi wa sallam). In fact, Islam teaches:<\/p>\n<p style=\"text-align: justify;\">يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَنْ تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ<\/p>\n<p style=\"text-align: justify;\">{O  you  who  have  believed,  if  there  comes  to  you  a  disobedient  one  with  information, investigate,  lest  you  harm  a  people  out  of  ignorance  and  become,  over  what  you  have done,  regretful.} [49:6]<\/p>\n<p style=\"text-align: justify;\">This indicates that if a truthful and reliable person conveys something to you then trust him.<\/p>\n<p style=\"text-align: justify;\">The Prophet (sallallahu alaihi wa sallam) said, as reported in Sahih Bukhari (7078), during his sermon at Mina:<\/p>\n<p style=\"text-align: justify;\">اللهم اشهد، فليبلغ الشاهد الغائب، فإنه رب مبلغ يبلغه لمن هو أوعى له<\/p>\n<p style=\"text-align: justify;\">“O Allah be witness! So those of you who are present should convey it (i.e my message) to those who are absent for it is possible that the conveyor might convey it to someone who comprehends it better than him.”<\/p>\n<p style=\"text-align: justify;\">It is very popularly known that the Prophet (saw) would send many of his students and Companions to teach people religion, at all times. It is unheard of that only one man can deliver his message except in a very special situation like this one.<\/p>\n<p style=\"text-align: justify;\"><strong><u>Narrations being used to show that Abu Bakr was removed from leadership:<\/u><\/strong><\/p>\n<p>A- Tirmidhi (3090) narrates through Hammad b. Salamah from Simak b. Harb from Anas b. Malik that the Messenger of Allah (sallallahu alaiahi wa sallam) sent Abu Bakr with (the verses of) of Bara&#8217;ah. When he reached Dhul Hulaifah he said “No one will convey from me except myself or someone from my household”. Then he called `Ali and gave it to him.<\/p>\n<p style=\"text-align: justify;\">Tirmidhi said: This is Hasan Gharib. Albani also declared it Hasan<\/p>\n<p style=\"text-align: justify;\">Simak b. Harb in this chain is a well-known disputed narrator. Besides this there is no evidence in this that Abu Bakr was replaced by `Ali as a leader. This only speaks of the message of Bara’ah and how `Ali was asked to deliver it in place of Abu Bakr.<\/p>\n<p style=\"text-align: justify;\">A doubt may come to mind that if Abu Bakr returned back to Madinah then how he could have led the pilgrims!<\/p>\n<p style=\"text-align: justify;\">Firstly, the chain of this is not comparatively strong because Simak b. Harb is not that strong in hadith. Many scholars have criticized him due to mistakes he committed in hadith. Secondly, Abu Bakr could have returned back to the Prophet (sallallahu alaihi wa sallam) for only a short period of time, and then afterward he would have arrived to lead the pilgrims as the distance between Dhul Hulaifah and Madina is not too much. Thirdly, it could easily be understood that he asked him this AFTER he finished Hajj and returned to Madinah. And Allah knows best.<\/p>\n<p>B- Abdullah b. Ahmad narrates in Musnad (1297) through Muhammad b. Jabir from Simak from Hanash from `Ali that when the initial ten verses of Bara&#8217;ah were revealed Prophet sallallahu alaihi wa sallam sent Abu Bakr to deliver it. Then he called and said:<\/p>\n<p style=\"text-align: justify;\">أدرك أبا بكر، فحيثما لحقته فخذ الكتاب منه، فاذهب به إلى أهل مكة، فاقرأه عليهم<\/p>\n<p style=\"text-align: justify;\">“Find Abu Bakr and wherever you find him take the book from him. Then go towards the people of Makkah and recite it to them”<\/p>\n<p style=\"text-align: justify;\">`Ali took the book from him. Abu Bakr returned and asked the Prophet (sallallahu alaihi wa sallam) whether anything was revealed regarding him. He replied, “No, but Jibreel came to me and said, ‘No one shall convey it from you except you yourself or someone from your household’.”<\/p>\n<p style=\"text-align: justify;\">This chain is weak due to Muhammad b. Jabir al-Hanafi. Ibn Katheer said in al-Bidayah (7\/227): “This chain is weak and there Nakarah in its text.” He also weakened it in Tafsir.<\/p>\n<p style=\"text-align: justify;\">With regards to Muhammad b. Jabir al-Hanafi it is mentioned in “Taqreeb at-Tahdheeb” (1\/471): He was truthful. His books were lost and so his memory deteriorated. He mixed things too much. He turned blind therefore he was involved in Talqin.<\/p>\n<p>C- Imam Ahmad (4) reports through Israeel who said: Abu Ishaq said from Zaid b. Yasee’ from Abu Bakr as-Siddiq similar to the previous narration.<\/p>\n<p style=\"text-align: justify;\">Shuaib Arnaut weakened this narration and quoted Ibn Hajar from “Atraaf al-Musnad” where he said this is disconnected between Zaid and Abu Bakr. He also quoted Al-Jaurqani who said this narration is Munkar.<\/p>\n<p style=\"text-align: justify;\">Besides there is a mistake in this chain and the actual tradition is through Zaid from Ali (not Abu Bakr). This narration has also been narrated in Mursal form by Abu ‘Ubaid in “Al-Amwal” (457) and At-Tabari in Tafseer (14\/106) through Abu Ishaq from Zaid b. Yathee&#8217; in Mursal form. See al-‘Ilal (67) by Ad-Daarqutni.<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion<\/strong>: We see that either the narrations cited to claim that Abu Bakr never led the people in Hajj are weak or they are completely vague and thus cannot as evidence against clear and authentic narrations.<\/p>\n<p style=\"text-align: justify;\"><strong><u>The description reported in the strong and authentic narrations<\/u><\/strong><\/p>\n<p style=\"text-align: justify;\">Sahih ibn Khuzaymah:<\/p>\n<p style=\"text-align: justify;\">ثنا أَحْمَدُ بْنُ مَنْصُورٍ الرَّمَادِيُّ، ثنا عَبْدُ الرَّزَّاقِ، أَخْبَرَنِي مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، فِي قَوْلِهِ: بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ، قَالَ: &#8221; لَمَّا قَفَلَ النَّبِيُّ مِنْ حُنَيْنٍ، اعْتَمَرَ مِنَ الْجِعْرَانَةَ، ثُمَّ أَمَّرَ أَبَا بَكْرٍ عَلَى تِلْكَ الْحَجَّةِ<\/p>\n<p style=\"text-align: justify;\">[Ibn al-Musayyib, from abu Hurayrah regarding Allah’s words {Freedom from obligation (is proclaimed) from Allah and His messenger toward those of the idolaters with whom ye made a treaty.} [9:1] When the Prophet (saw) came back from the battle of Hunayn, he did `Umrah from al-Ji`ranah, then he appointed Abu Bakr as leader of that Hajj trip.]<\/p>\n<p style=\"text-align: justify;\">Jami` al-Bayan li-ibn Jarir al-Tabari:<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ: أَخْبَرَنَا أَبُو زُرْعَةَ وَهْبُ اللَّهِ بْنُ رَاشِدٍ، قَال: أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ: أَخْبَرَنَا أَبُو صَخْرٍ، أَنَّهُ سَمِعَ أَبَا مُعَاوِيَةَ الْبَجَلِيَّ، مِنْ أَهْلِ الْكُوفَةِ يَقُولُ: سَمِعْتُ أَبَا الصَّهْبَاءِ الْبَكْرِيَّ، وَهُوَ يَقُولُ: سَأَلْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ عَنْ يَوْمِ الْحَجِّ الأَكْبَرِ، فَقَالَ: إِنَّ رَسُولَ اللَّهِ &#8221; بَعَثَ أَبَا بَكْرِ بْنَ أَبِي قُحَافَةَ رَضِيَ اللَّهُ عَنْهُ يُقِيمُ لِلنَّاسِ الْحَجَّ، وَبَعَثَنِي مَعَهُ بِأَرْبَعِينَ آيَةً مِنْ بَرَاءَةٍ، حَتَّى أَتَى عَرَفَةَ، فَخَطَبَ النَّاسَ يَوْمَ عَرَفَةَ، فَلَمَّا قَضَى خُطْبَتَهُ الْتَفَتَ إِلَيَّ، فَقَالَ: قُمْ يَا عَلِيُّ، وَأَدِّ رِسَالَةَ رَسُولِ اللَّهِ فَقُمْتُ فَقَرَأْتُ عَلَيْهِمْ أَرْبَعِينَ آيَةً مِنْ بَرَاءَةٍ، ثُمَّ صَدَرْنَا حَتَّى أَتَيْنَا مِنًى، فَرَمَيْتُ الْجَمْرَةَ، وَنَحَرْتُ الْبَدَنَةَ، ثُمَّ حَلَقْتُ رَأْسِي، وَعَلِمْتُ أَنَّ أَهْلَ الْجَمْعِ لَمْ يَكُونُوا حَضَرُوا خُطْبَةَ أَبِي بَكْرٍ يَوْمَ عَرَفَةَ، فَطَفِقْتُ أَتَتَبَّعُ بِهَا الْفَسَاطِيطَ، أَقْرَؤُهَا عَلَيْهِمْ، فَمِنْ ثَمَّ إِخَالُ حَسِبْتُمْ أَنَّهُ يَوْمَ النَّحْرِ، أَلا وَهُوَ يَوْمُ عَرَفَةَ<\/p>\n<p style=\"text-align: justify;\">[Abu al-Sahba’ said: I asked `Ali ibn abi Talib may Allah be pleased with him about the day of the great Hajj, `Ali said: Rasul-Allah (saw) sent Abu Bakr ibn abi Quhafah may Allah be pleased with him to conduct for the people their Hajj, and he sent me alongside him with forty verses from Bara’ah. Abu Bakr had reached `Arafah and delivered his sermon, then he turned towards me and said: “Stand O `Ali, and deliver the message of Rasul-Allah (saw).” So I did that then we walked until we reached Mina, and I threw the stone and sacrificed then shaved, I realized that the people of al-Jami` never attended Abu Bakr’s sermon at `Arafah, so I moved from tent to tent reading them Abu Bakr’s sermon and telling them of the difference between the day of sacrifice and the day of `Arafah.]<\/p>\n<p style=\"text-align: justify;\">Sunan al-Nasa’i al-Sughra:<\/p>\n<p style=\"text-align: justify;\">أَخْبَرَنَا إِسْحَاق بْنُ إِبْرَاهِيمَ، قَالَ: قَرَأْتُ عَلَى أَبِي قُرَّةَ مُوسَى بْنِ طَارِقٍ، عَنْ ابْنِ جُرَيْجٍ، قَالَ: حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، &#8221; أَنَّ النَّبِيَّ حِينَ رَجَعَ مِنْ عُمْرَةِ الْجِعِرَّانَةِ بَعَثَ أَبَا بَكْرٍ عَلَى الْحَجِّ، فَأَقْبَلْنَا مَعَهُ، حَتَّى إِذَا كَانَ بِالْعَرْجِ ثَوَّبَ بِالصُّبْحِ، ثُمَّ اسْتَوَى لِيُكَبِّرَ، فَسَمِعَ الرَّغْوَةَ خَلْفَ ظَهْرِهِ، فَوَقَفَ عَلَى التَّكْبِيرِ، فَقَالَ: هَذِهِ رَغْوَةُ نَاقَةِ رَسُولِ اللَّهِ الْجَدْعَاءِ، لَقَدْ بَدَا لِرَسُولِ اللَّهِ فِي الْحَجِّ فَلَعَلَّهُ أَنْ يَكُونَ رَسُولَ اللَّهِ فَنُصَلِّيَ مَعَهُ، فَإِذَا عَلِيٌّ عَلَيْهَا، فَقَالَ لَهُ: أَبُو بَكْرٍ أَمِيرٌ، أَمْ رَسُولٌ؟ قَالَ: لَا، بَلْ رَسُولٌ أَرْسَلَنِي رَسُولُ اللَّهِ بِبَرَاءَةَ أَقْرَؤُهَا عَلَى النَّاسِ فِي مَوَاقِفِ الْحَجِّ، فَقَدِمْنَا مَكَّةَ، فَلَمَّا كَانَ قَبْلَ التَّرْوِيَةِ بِيَوْمٍ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ، فَخَطَبَ النَّاسَ، فَحَدَّثَهُمْ عَنْ مَنَاسِكِهِمْ حَتَّى إِذَا فَرَغَ قَامَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ، فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا، ثُمَّ خَرَجْنَا مَعَهُ، حَتَّى إِذَا كَانَ يَوْمُ عَرَفَةَ قَامَ أَبُو بَكْرٍ، فَخَطَبَ النَّاسَ، فَحَدَّثَهُمْ عَنْ مَنَاسِكِهِمْ، حَتَّى إِذَا فَرَغَ قَامَ عَلِيٌّ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا، ثُمَّ كَانَ يَوْمُ النَّحْرِ، فَأَفَضْنَا، فَلَمَّا رَجَعَ أَبُو بَكْرٍ خَطَبَ النَّاسَ، فَحَدَّثَهُمْ عَنْ إِفَاضَتِهِمْ، وَعَنْ نَحْرِهِمْ، وَعَنْ مَنَاسِكِهِمْ، فَلَمَّا فَرَغَ قَامَ عَلِيٌّ، فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا، فَلَمَّا كَانَ يَوْمُ النَّفْرِ الْأَوَّلُ، قَامَ أَبُو بَكْرٍ فَخَطَبَ النَّاسَ فَحَدَّثَهُمْ كَيْفَ يَنْفِرُونَ؟ وَكَيْفَ يَرْمُونَ؟ فَعَلَّمَهُمْ مَنَاسِكَهُمْ، فَلَمَّا فَرَغَ قَامَ عَلِيٌّ فَقَرَأَ بَرَاءَةٌ عَلَى النَّاسِ حَتَّى خَتَمَهَا<\/p>\n<p style=\"text-align: justify;\">[Abu al-Zubayr from Jabir, that the Prophet (saw) upon his return from the `Umrah of al-Ji`ranah, sent Abu Bakr as the chief of Hajj, so we followed him until we reached al-`Urj when he made the Iqamah of the morning, then he stood up to make Takbir when he (suddenly) heard grunting behind his back which made him stop. Abu Bakr said: “This is the grunting of Rasul-Allah’s (saw) camel, maybe he changed his mind and came so we may pray behind him!” However, it turned out to be `Ali, so Abu Bakr asked: “Are you sent as a leader or a messenger?” `Ali said: “No, I am only a messenger. Rasul-Allah (saw) sent me with the Surah of Bara’ah that I may recite it for the people during Hajj.” When we reached Makkah one day before Tarwiyah, Abu Bakr stood and delivered a sermon for the people, he taught them the rituals of Hajj and when he finished `Ali stood and recited the complete Surah of Bara’ah. On the day of `Arafah, Abu Bakr stood to address the people and teach them their Hajj then `Ali recited Bara’ah. Then came the day of sacrifice and we departed and Abu Bakr taught us about the departure and the sacrifice and after him `Ali stood and recited Bara’ah. Then finally on the day of stoning, Abu Bakr taught us and `Ali recited once again.]<\/p>\n<p style=\"text-align: justify;\">Some scholars do not accept the narrations of abu al-Zubayr from Jabir (ra) unless he declares hearing.<\/p>\n<p style=\"text-align: justify;\">Sirat Ibn Ishaq:<\/p>\n<p style=\"text-align: justify;\">قال ابن اسحاق: وحدثني حكيم بن حكيم بن عباد بن حنيف، عن أبي جعفر محمد بن علي رضوان الله عليه، أنه قال: «لما نزلت براءة على رسول الله صلى الله عليه وسلّم وقد كان بعث أبا بكر الصديق ليقيم للناس الحج، قيل له: يا رسول الله! لو بعثت بها إلى أبي بكر، فقال: لا يؤدي عني إلا رجل من أهل بيتي، ثم دعا علي بن أبي طالب رضوان الله عليه، فقال له: أخرج بهذه القصّة من صدر براءة، وأذن في الناس يوم النحر إذا اجتمعوا بمنى، أنه لا يدخل الجنّة كافر، ولا يحجّ بعد العام مشرك، ولا يطوف بالبيت عريان، ومن كان له عند رسول الله ـ صلى الله عليه وسلم ـ عهدٌ فهو له إلى مدته، فخرج علي بن أبي طالب رضوان الله عليه، على ناقة رسول الله صلى الله عليه وسلّم العضباء، حتّى أدرك أبا بكر بالطريق، فلما رآه أبو بكر بالطريق قال: أأمير أم مأمور؟ فقال: بل مأمور، ثم مضيا، فأقام أبو بكر للناس الحج والعرب إذ ذاك في تلك السنة على منازلهم من الحج، التي كانوا عليها في الجاهلية، حتّى إذا كان يوم النحر، قام علي بن أبي طالب رضي الله عنه، فأذن في الناس بالذي أمره به رسول الله’ ـ إلى أن قال: ـ ثم قدما على رسول الله<\/p>\n<p style=\"text-align: justify;\">[Ibn Ishaq said: Hakeem b. Hakeem b. `Abbad b. Hunayf narrated to me from Abu Ja`far al-Baqir who said: Bara’ah was revealed to the Messenger of Allah (sallallahu alaihi wa sallam), while he had already sent Abu Bakr As-Siddiq to establish Hajj for the people, it was said to him, “O Messenger of Allah, It is better that you send this to Abu Bakr.” He answered, “No one shall deliver it except a man from my household.” Then he called `Ali and said, “Go with this section of Bara’ah and announce to the people during the day of sacrifice [i.e. An-Nahr] when they assembled at Mina. Announce that no disbeliever shall enter paradise and no polytheist shall perform Hajj after this year. No one shall circumambulate the Ka`abah without clothes. And whosoever has a pact with the Messenger of Allah (sallallahu alaihi wa sallam) then it is to remain till its fixed time.” So `Ali went out on al-`Adhba the she-camel of the messenger of Allah until he found Abu Bakr on the way. Abu Bakr asked, “Are you sent as chief or as follower?” He replied, “Rather I am sent as a follower.” Then they went forward and Abu Bakr led people in hajj. Arabs in that year were on their old traditions of pilgrimage until the day of Sacrifice when `Ali stood up and announce among the people that which the Messenger of Allah (sallallahu alaihi wa sallam) commanded him…]<\/p>\n<p style=\"text-align: justify;\">Seerah Ibn Hisham [2\/545-546] Tafseer Tabri (14\/107-108)<\/p>\n<p style=\"text-align: justify;\">This Hadith by Muhammad al-Baqir is Hasan and Ibn Ishaq has narrated a lot of historical incidents through this chain. Hakeem b. Hakeem has been rated saduq by Ibn Hajar al-‘Asqalani and Hasan al-Hadith by Al-Dhahabi. This narration is the story of the event as narrated by Ahlul-Bayt to their followers and students.<\/p>\n<p style=\"text-align: justify;\">Ma`alim al-Tanzil lil-Baghawi:<\/p>\n<p style=\"text-align: justify;\">أَخْبَرَنَا عَبْدُ الْوَاحِدِ الْمَلِيحِيُّ، أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ النُّعَيْمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرْيَرَةَ قَالَ: بَعَثَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فِي تِلْكَ الْحَجَّةِ فِي مُؤَذِّنِينَ يَوْمَ النَّحْرِ، نُؤَذِّنُ بِمِنًى: أَلا لا يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلا يَطُوفُ بِالْبَيْتِ عُرْيَانُ قَالَ حُمَيْدُ بنُ عَبْدِ الرَّحْمَنِ: ثُمَّ أَرْدَفَ رَسُول اللَّهِ عَلِيًّا، فَأَمَرَهُ أَنْ يُؤَذِّنَ بِ بَرَاءَةٌ، قَالَ أَبُو هُرَيْرَةَ: فَأَذَّنَ مَعَنَا عَلَى أَهْلِ مِنًى يَوْمَ النَّحْرِ: أَلا لا يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلا يَطُوفُ بِالْبَيْتِ عُرْيَانُ<\/p>\n<p style=\"text-align: justify;\">[Humayd bin `Abdul-Rahman that abu Hurayrah said: Abu Bakr sent me during that Hajj in the company of two callers on the day of sacrifice, so that we may call in Mina: That after this year, no polytheist shall attend pilgrimage nor will a naked one circulate around the house. Humayd said: Then Rasul-Allah (saw) sent `Ali and ordered him to recite Bara’ah. Abu Hurayrah said: So `Ali called alongside us in Mina: That after this year, no polytheist shall attend pilgrimage nor will a naked one circulate around the house.]<\/p>\n<p style=\"text-align: justify;\">Tarikh ibn abi Khaythamah:<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا أَبِي، قَالَ جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ مُحَرِّرِ بْنِ أَبِي هُرَيْرَةَ، قَالَ: قَالَ أَبُو هُرَيْرَةَ: كُنْتُ أُنَادِي مَعَ عَلِيٍّ حِينَ أُذِّنَ لِلْمُشْرِكِينَ وَكَانَ إِذَا ضَحَلَ صَوْتُهُ، أَوِ اشْتَكَى حَلْقَهُ، أَوْ عَيِيَ مِمَّا يُنَادِي دَعَوْتُ مَكَانَهُ<\/p>\n<p style=\"text-align: justify;\">[Muharrir from abu Hurayrah: I was calling with `Ali when he called on the pagans, so whenever his voice weakens or his throat hurts or gets tired, I would stand in `Ali’s place and call.]<\/p>\n<p style=\"text-align: justify;\"><strong><u>What early historians say?<\/u><\/strong><\/p>\n<ol style=\"text-align: justify;\">\n<li>Isma’eel Al-Suddi [d.127] as reported Al-Tabari in tafsir (14\/108-109) through Muhammad b. Husain from Ahmed b. Mufaddal from Asbaat from him.<\/li>\n<li>Muhammad b. Ka’b al-Kurazi [d.110] as reported by Al-Tabari in Tafsir (14\/100).<\/li>\n<li>Al-Waqidi [d.207] explicitly mentions that when Abu Bakr asked `Ali whether he was used as a leader to lead Hajj, `Ali replied, “No, rather the Prophet has sent me to recite Bara’ah to the people.” Al-Waqidi narrate this from Ma’mar, Muhammad b. Abdullah, Ibn Abi Habiba, Ibn Abi Sabirah, Usama b. Zaid, Haritha b. Abi Imran and Abdul Hameed b. Ja`far. Maghazi [3\/1076-1077]<\/li>\n<li>Ibn Ishaq [d. 151] has narrated through Abu Ja`far al-Baqir that when Abu Bakr ra asked `Ali whether he had come as a leader or under [his] leadership, he answer, “Rather I am under [your] leadership.” Ibn Ishaq reports, “Then Abu Bakr led people in Hajj…”<\/li>\n<li>Abu Ja`far al-Tabari [d.310] also mentioned it and reported it through Al-Suddi and Muhammad b. Ka’b al-Kurazi. Tarikh Tabri (3\/122).<\/li>\n<li>Ibn Hibban also reported the incident in the same manner in his book “Ath-Thiqaat” [2\/113]<\/li>\n<li>Ibn Hazm Az-Zahiri also mentioned it in “Jawami’ as-Seerah” [p.258]<\/li>\n<li>Ibn habib Al-Baghdadi [d.245] mentioned that Abu Bakr led the people in the Hajj of the year 9 AH. Al-Muhabbar [p.12]<\/li>\n<li>Al-Mas’udi also said that Abu Bakr was sent as Ameer of Hajj and then `Ali followed his with the message of Bara’ah. Although he pointed out the differences among the people of Qibla regarding it. At-Tanbih wa al-Ishraf [1\/237]<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">In conclusion: Abu Bakr was appointed as the leader of the believers to Hajj in place of the Prophet (saw). The Prophet (saw) trusted Abu Bakr to teach people their religion and the new Islamic rituals of pilgrimage. `Ali was sent after Abu Bakr as his underling, since he is a direct blood-relation of the Prophet (saw) he conveyed his message to the pagans and the Arabs. `Ali clearly stated to Abu Bakr that he was not sent as a leader but as Abu Bakr’s follower as reported in authentic traditions of Jabir bin `Abdullah and Muhammad al-Baqir.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>One of the evidences to prove the high status of Abu Bakr As-Siddiq is that he was appointed as the chief of pilgrims or Ameer-ul-Haj by the Prophet (saw).  <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/08\/21\/abu-bakr-the-chief-of-believers-in-hajj-9th-hijri-year\/\" title=\"Abu Bakr the Chief of believing pilgrims [9th Hijri year]\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3850,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6,5],"tags":[17],"class_list":{"0":"post-3401","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail","8":"category-imamah","9":"tag-abu-bakr"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3401","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3401"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3401\/revisions"}],"predecessor-version":[{"id":3839,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3401\/revisions\/3839"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3850"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3401"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3401"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3401"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}