{"id":3439,"date":"2016-10-20T15:54:19","date_gmt":"2016-10-20T15:54:19","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3439"},"modified":"2016-10-26T00:31:29","modified_gmt":"2016-10-26T00:31:29","slug":"muslim-bin-aqeel-case-study-fabrication-karbala-narrative","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/","title":{"rendered":"Muslim bin Aqeel: A Case Study of Fabrication in the Karbala Narrative"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3439\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Muslim bin Aqeel: A Case Study of Fabrication in the Karbala Narrative<\/h1>\n<p style=\"text-align: justify;\">In this article, we will take a closer look at the fabrications and exaggerations that have occurred in the main Shia texts that revolve around the martyrdom of Muslim bin Aqeel at the hands of Ubaidullah bin Ziyad. The article takes a look at the <a href=\"http:\/\/twelvershia.net\/2016\/10\/26\/battle-of-karbala-critical-study\/\" rel=\"external nofollow\">battle<\/a> that takes place after the failed revolution in Kufa, at the house of the old woman, right before Muslim bin Aqeel is detained and finally killed.<\/p>\n<p style=\"text-align: justify;\">We have broken down the article as follows for the sake of clarity:<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<ul style=\"text-align: justify;\">\n<li><strong>Karbala Sources for this Study<\/strong><\/li>\n<li><strong>Muslim bin Aqeel’s Battle in the Original Maqtal Al-Hussain by Abi Mikhnaf<\/strong><\/li>\n<li><strong>Muslim bin Aqeel’s Battle in the “Improved” Maqtal Al-Hussain by Abi Mikhnaf<\/strong><\/li>\n<li><strong>A Brief Analysis<\/strong><\/li>\n<li><strong>Muslim bin Aqeel’s Battle in the Authentic Sunni Tradition<\/strong><\/li>\n<li><strong>Conclusion<\/strong><\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>Karbala Sources for this Study<\/strong><\/h2>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/scan0002-2\/\" rel=\"attachment wp-att-3443 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3443 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-150x150.jpg\" alt=\"muslim bin aqeel\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>For this study, we chose to rely upon the most authentic rendition of the martyrdom of Al-Hussain, which is known as Maqtal Al-Hussain by Abi Mikhnaf Lut bin Yahya. The edition that was relied upon was the Dar Al-Mahajjah Al-Baidha’ edition, which was edited and revised by Kamil Salman Al-Jburi. This edition was published in the year 2000.<\/p>\n<p style=\"text-align: justify;\">This previous work will be put beside the commonly distributed version of Maqtal Al-Hussain by Abi Mikhnaf Lut bin Yahya, which was published by Mu’asasat Al-A’alami, one of the biggest Shia publishing houses. This edition was published in the year 2007.<\/p>\n<p style=\"text-align: justify;\">Even though it may seem as though we are studying the same book, it will become very clear soon enough that the work of Abi Mikhnaf Lut bin Yahya has been tampered with greatly. Kamil Al-Jburi has made this very clear in his introduction, in which he describes the commonly distributed version of Maqtal Al-Hussain to be inaccurately attributed to Lut bin Yahya. He does admit that there are many similarities as we will soon see below.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/scan0001-2\/\" rel=\"attachment wp-att-3442 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3442 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-150x150.jpg\" alt=\"karbala\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Kamil Al-Jburi mentions that the original Maqtal Al-Hussain was preserved and quoted often by Al-Tabari, while the current version that has become widespread can be found in manuscript form in the Petersburg Library and only dates to the tenth century, which is pretty late compared to the former book.<\/p>\n<p style=\"text-align: justify;\">In regards to the authenticity of the report as per Shia standards, we can safely say that neither of the reports is authentic. The <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">“improved” version<\/a> cannot even be attributed to Abu Mikhnaf himself, while the original narration is the narration of Abi Mikhnaf from Qudama bin Sa’eed bin Za’ida. This narration is weak because of an anonymous narrator according to Shias. Refer to our article on Shia sources and <a href=\"http:\/\/twelvershia.net\/2016\/10\/24\/history-karbala-study-sources\/\" rel=\"external nofollow\">history of Karbala<\/a> for more. However, the purpose of the article is not to provide the reader with an authentic Shia version, but rather, to display the efforts of fabricators in order to exaggerate a narrative in order to appeal to Shia laymen.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Muslim bin Aqeel’s Battle in the Original Maqtal Al-Hussain by Abi Mikhnaf<\/strong><\/h2>\n<p style=\"text-align: justify;\">The following is a translation of the original Maqtal Al-Hussain, edited and revised by Kamil Al-Jburi (p. 72-73):<\/p>\n<p style=\"text-align: justify;\">When Ibn Ash’ath got up to bring Ibn Aqeel to him (Ubaidullah bin Ziyad), he called for Amr bin Huraith, who was in the Masjid, representing him in front of the people. He wrote: Send with Ibn Ash’ath sixty or seventy men from the tribe of Qais. He did not want to send people from his own tribe, since he knew that they would not want to face Ibn Aqeel. So he sent with him Amr bin Ubaidullah bin Abbas Al-Sulami with sixty or seventy people from the tribe of Qais. When they reached the house that Ibn Aqeel was in, he (Muslim) hear the steps of the horses and the sounds of the men, so he came out with his sword as they broke in, so he attacked them.<\/p>\n<p style=\"text-align: justify;\">Both him and Bukair bin Humran Al-Ahmari exchanged strikes, and Bukair struck the mouth of Muslim, cutting off his upper lip, and piercing his lower lip, exposing his two frontal teeth. Muslim then stuck him heavily, then again, between his neck and shoulder, which almost cut through him. When this was seen, they (the men) climbed the house and started tossing stones at him, and set some canes on fire, tossing them at him. When he saw that, he left the house with his sword, onto the street, and fought them.<\/p>\n<p style=\"text-align: justify;\">Mohammad bin Al-Ash’ath approached him and said: Boy, we will allow you safety, so do not cause yourself to be killed.<\/p>\n<p style=\"text-align: justify;\">He continued to fight them and recited (some poetry):<\/p>\n<p style=\"text-align: justify;\">I vowed that I will not die except a free man – Even though I have seen death as a torment<\/p>\n<p style=\"text-align: justify;\">Every man shall face evil someday – And mix the cold, the hot, and the bitter<\/p>\n<p style=\"text-align: justify;\">Push back the sunlight and make it stable – For I fear being lied to or to be fooled<\/p>\n<p style=\"text-align: justify;\">Mohammad bin Al-Ash’ath replied: You will not be lied or fooled, for these men are your cousins, and they will not kill you or harm you.<\/p>\n<p style=\"text-align: justify;\">By then, he (Muslim bin Aqeel) had already been hurt by the stones, and was tired from the fighting. So he put his back to the wall. Mohammad bin Al-Ash’ath approached him and said: You are safe. He (Muslim bin Aqeel) replied: I am safe? He said: Yes. The people said: You are safe. They all said this except for Amr bin Ubaidullah bin Al-Abbas Al-Sulami, who said: I have nothing to do with this. He then backed away.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Muslim bin Aqeel’s Battle in the “Improved” Maqtal Al-Hussain by Abi Mikhnaf<\/strong><\/h2>\n<p style=\"text-align: justify;\">The following is the translation of the “new and improved” version that has become common today. The edition is, as stated previously, the A’alami Edition (p. 60-65)<\/p>\n<p style=\"text-align: justify;\">He (Ubaidullah bin Ziyad) then called for Mohammad bin Ash’ath, then provided him with five hundred knights. He said: Move onwards, with this boy, and bring me Muslim bin Aqeel (as), dead or alive.<\/p>\n<p style=\"text-align: justify;\">They moved onwards until they reached the old woman’s house, and she heard the neighs of the horses, the slapping of their halters, and the sounds of the men, so she told Muslim. Muslim said: They are looking for me only. He then said: Bring my sword. He then prepared himself, armored up, and faced the men while waving his sword. The old woman said: Oh master, are you preparing yourself for death?! He replied: Sure, there is no escape from death.<\/p>\n<p style=\"text-align: justify;\">Then, he moved towards the door and ripped it off, and it was large. He faced them and fought them hard, killing a hundred and eighty knights. The rest were defeated.<\/p>\n<p style=\"text-align: justify;\">When Ibn Al-Ash’ath saw the bravery of Muslim (as), he sent to Ibn Ziyad (la) a letter saying: Supply me with horses and men. He sent to him five-hundred knights.<\/p>\n<p style=\"text-align: justify;\">Muslim bin Aqeel then came out and killed a lot of them, so Ibn Al-Ash’ath sent to Ibn Ziyad (la) a letter saying: Supply me with horses and men. Ibn Ziyad then wrote to him: May your mother cry upon you and may your people destroy you, a single man kills this many of you?! What if I sent you to someone who was more powerful – meaning Al-Hussain (as) &#8211; ?!<\/p>\n<p style=\"text-align: justify;\">Mohammad bin Al-Ash’ath then wrote: Do you think that you have sent me to a Kufan vendor or a random man from Al-Heera? You have sent me to a hero, a lion, and a sword of the Messenger of Allah (saw).<\/p>\n<p style=\"text-align: justify;\">Ibn Ziyad then sent five-hundred knights, and said: Promise him safety, or else he will kill you all.<\/p>\n<p style=\"text-align: justify;\">They cried onto him: Oh Muslim bin Aqeel, we promise you safety. He said: I will not give you any safety, O’ enemies of Allah and His messenger! He then fought with them harshly, and he exchanged two strikes with Bakr bin Humran. Muslim then struck him on the head and killed him. Then, he struck another person and killed him. They then, gathered onto the roofs, tossing flames at him, he then shouted:<\/p>\n<p style=\"text-align: justify;\">I vowed that I will not die except a free man – Even though I have seen death as a torment<\/p>\n<p style=\"text-align: justify;\">For I fear being lied to or to be fooled – Push back the sunlight and make it stable<\/p>\n<p style=\"text-align: justify;\">I will attack you and fear no punishment – The actions of a young man that will not flee<\/p>\n<p style=\"text-align: justify;\">Every betrayer shall be betrayed – and will be punished in a scorching hell<\/p>\n<p style=\"text-align: justify;\">He then attacked the men and fought them heavily, and killed a lot of them. Then, an accursed person came and said: I will lay a trap that he will not be able to escape from. They asked: How? He said: We will dig a well on the path and cover it, then attack him, then retreat, and I do not think that he will escape it. So, they did this while Muslim was unaware. They attacked him, then he attacked them, then they retreated, and he fell into a well. They gathered around the well and brought him out. Then Ibn Ash’ath (la) struck him on the face through his nose and mouth, breaking his frontal teeth.<\/p>\n<h2 style=\"text-align: justify;\"><strong>A Brief Analysis<\/strong><\/h2>\n<p style=\"text-align: justify;\">As we can see from the above, there are some extreme differences between the two renditions of the events. Even though both narrations are attributed to Abu Mikhnaf, we find a version that is much more reasonable in the original version.<\/p>\n<p style=\"text-align: justify;\">Both versions state that Muslim bin Aqeel is at the house of an old woman during the time. Both mention that Mohammad bin Al-Ash’ath is sent with men in order to capture him. Both narrations include attempts by his opponents to promise him safety. The outcome of him being secured and brought to Ubaidullah in Ziyad is the same, even though there are some major differences that are too apparent to ignore.<\/p>\n<p style=\"text-align: justify;\">First of all, the original version states that Muslim bin Aqeel is tricked into believing that he will be given safety. The “improved” version shows a defiant Muslim bin Aqeel that would not accept the peace offering.<\/p>\n<p style=\"text-align: justify;\">Other differences include the identity of the person that strikes his lip, as well as other minor details of his fight with Bakr\/Bukair bin Humran, and some slight differences in the poetry that is attributed to Muslim<\/p>\n<p style=\"text-align: justify;\">The most obvious alteration in the narration is that the original version states that Muslim bin Aqeel was fighting off sixty to seventy men. The narration does not mention how many people Muslim killed. In the “improved” version, Muslim faces five-hundred knights in the first round of fighting, and kills a hundred and eighty knights. He then faces another five hundred knights and defeats them. Then, he faces another five hundred, and defeats them, killing large amounts of men, but the narration does not state how many. <strong>In total, Muslim bin Aqeel defeats a thousand and five hundred knights, and kills <u>at least a hundred and eighty<\/u>.<\/strong><\/p>\n<p style=\"text-align: justify;\">The language and tone of the “improved” version is a lot more emotional as well.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Muslim bin Aqeel’s Battle in the Authentic Sunni Tradition<\/strong><\/h2>\n<p style=\"text-align: justify;\">For those curious, we have included the authentic Sunni version of the above events. An authentic version will provide the reader with the Sunni alternative. The narration can be found in Tareekh Al-Tabari 3\/1028. It does not include any of the exaggerations found in either of the two versions above:<\/p>\n<p style=\"text-align: justify;\">Al-Tabari, from Mohammad bin Ammar Al-Razi, from Sa’eed bin Sulayman, from Abbad bin Awwam, from Husain bin Abdulrahman said: Hilal bin Yasaf told me: I met them at night at the Masjid of the Ansar. Every time they passed by a road, towards the left or the right, a group of them, around thirty or forty or so, would retreat. He (Hilal) said: When they arrived by the market, at that dark night, they entered the mosque. It was said to Ibn Ziyad: By Allah, we do not see nor hear many people.<\/p>\n<p style=\"text-align: justify;\">He then ordered that the roof of the mosque be ripped open. It was then ripped open. He then ordered them to carry sticks with fires lit upon them. They entered and saw around fifty men. He (Hilal) said: He entered and climbed the pulpit and said: “Split into fours!” They obeyed and split into fours, each of them to a leader of their own little group. Then, a group came and attacked them and Muslim was hurt badly. Some of his men were killed and they were defeated. Muslim left and entered a house that was owned by someone from the Kinda tribe.<\/p>\n<p style=\"text-align: justify;\">A man came to Mohammad bin Al-Ash’ath while he was with Ibn Ziyad. He whispered to him: Muslim is at the house of so and so. Ibn Ziyad asked: What did he say? He said: Muslim is at the house of so and so. Ibn Ziyad said to two men: Bring him to me. They entered upon him while he was with a woman that had lit him a fire as he washed his wounds. They said: The governor calls upon you. He said: I want a promise (of safety). They said: We don’t have that authority.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">We often hear by Shias that Sunni scholars do not teach laymen about the history of Al-Hussain. Shias complain that his history and his death at <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a> are hidden away. However, we can clearly see above that the common rendition of the events that surround the martyrdom of Muslim bin Aqeel has been twisted in such a way that Shias should not be able to make such claims with a straight face. This is because Shia scholars are not teaching Shias the real version of the events. Not only that, but they are filling the hearts of the youth with the most exaggerated version. This is done in order to induce tears.<\/p>\n<p style=\"text-align: justify;\">With this in mind, we invite Shias to open their hearts to the more reasonable Sunni version of the events. <strong>The<\/strong> <strong>death of Muslim bin Aqeel was a tragedy, but it was not a tall tale.<\/strong> This view is more reasonable to the objective mind.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Muslim bin Aqeel: A Case Study of Fabrication in the Karbala Narrative In this article, we will take a closer look at the fabrications and exaggerations that have occurred in the main Shia texts that revolve around the martyrdom of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/\" title=\"Muslim bin Aqeel: A Case Study of Fabrication in the Karbala Narrative\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3820,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[24],"class_list":{"0":"post-3439","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"tag-karbala"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3439","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3439"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3439\/revisions"}],"predecessor-version":[{"id":3476,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3439\/revisions\/3476"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3820"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3439"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3439"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3439"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}