{"id":344,"date":"2013-05-03T22:18:04","date_gmt":"2013-05-03T22:18:04","guid":{"rendered":"http:\/\/twelvershia.net\/?p=344"},"modified":"2015-11-07T23:58:33","modified_gmt":"2015-11-07T23:58:33","slug":"ayat-al-tatheer","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/05\/03\/ayat-al-tatheer\/","title":{"rendered":"Ayat al Tatheer : An Isolated Verse or Not?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=344\" alt=\"\" \/><\/p>\n<p style=\"text-align: center;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2021 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png\" alt=\"tatheer\" width=\"608\" height=\"122\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_.png 608w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/05\/608px-Basmala.svg_-300x60.png 300w\" sizes=\"auto, (max-width: 608px) 100vw, 608px\" \/><\/a><\/p>\n<h1 style=\"text-align: left;\">Ayat al Tatheer : A Separate Verse or a Part of a Verse?<\/h1>\n<p style=\"text-align: center;\"><span style=\"color: #800000;\"><strong>بسم الله الرحمن الرحيم<br \/>\nالحمد لله نحمده و نستعينه و نستغفره و نسأله الهداية و حسن الخاتمة<br \/>\nربي اشرح لي صدري و يسر لي أمري واحلل عقدة من لساني يفقهوا قولي<\/strong><\/span><\/p>\n<p>&nbsp;<\/p>\n<p>The following is a critical examination of the grammar of Ayat al Tatheer.<\/p>\n<p>We have decided to split into into chapters for easy reading:<\/p>\n<ul>\n<li>Introduction<\/li>\n<li style=\"text-align: justify;\">The Positions of Shias Regarding Ayat Al Tatheer<\/li>\n<li style=\"text-align: justify;\">Narrations about Ayat Al Tatheer<\/li>\n<li style=\"text-align: justify;\">Is Ayat Al Tatheer a Separate Verse?<\/li>\n<li>Answer to Masculine Wording in Ayat Al Tatheer<\/li>\n<li>Independence of Text in Ayat al Tatheer<\/li>\n<li>Other Statements of Shia Scholars about Ayat al Tatheer<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3>Introduction<\/h3>\n<p style=\"text-align: justify;\">Is the Quranic verse [al-Ahzab 33:33] famous as Ayat Al Tatheer (verse of <a href=\"http:\/\/youpuncturedtheark.wordpress.com\/2010\/10\/09\/for-whom-the-verse-of-purificationtatheer-was-revealed-and-what-is-the-concept-of-purification-let-the-quran-answer\/\" rel=\"external nofollow\">purification<\/a>) a separate Verse or a part of a Verse? This is the question posed in this thread and if Allah wills it we shall provide the clear strong sufficient answer and end this matter once and for all.<\/p>\n<p>The related verses in Arabic:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين أمتعكن وأسرحكن سراحا جميلا ﴿٢٨﴾ وإن كنتن تردن اللـه ورسوله والدار الآخرة فإن اللـه أعد للمحسنات منكن أجرا عظيما  ﴿٢٩﴾ يا نساء النبي من يأت منكن بفاحشة مبينة يضاعف لها العذاب ضعفين وكان ذلك على اللـه يسيرا ﴿٣٠﴾ ومن يقنت منكن للـه ورسوله وتعمل صالحا نؤتها أجرها مرتين وأعتدنا لها رزقا كريما ﴿٣١﴾ يا نساء النبي لستن كأحد من النساء إن اتقيتن فلا تخضعن بالقول فيطمع الذي في قلبه مرض وقلن قولا معروفا ﴿٣٢﴾  وقرن في بيوتكن ولا تبرجن تبرج الجاهلية الأولى وأقمن الصلاة وآتين الزكاة وأطعن اللـه ورسوله إنما يريد اللـه ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا ﴿٣٣﴾ واذكرن ما يتلى في بيوتكن من آيات اللـه والحكمة إن اللـه كان لطيفا خبيرا ﴿٣٤﴾ سورة الأحزاب<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>English (Sahih International):<\/strong> <em>O Prophet, say to your wives, &#8220;If you should desire the worldly life and its adornment, then come, I will provide for you and give you a gracious release. (28) But if you should desire Allah and His Messenger and the home of the Hereafter &#8211; then indeed, Allah has prepared for the doers of good among you a great reward.&#8221; (29) O wives of the Prophet, whoever of you should commit a clear immorality &#8211; for her the punishment would be doubled two fold, and ever is that, for Allah, easy. (30) And whoever of you devoutly obeys Allah and His Messenger and does righteousness &#8211; We will give her her reward twice; and We have prepared for her a noble provision.  (31) O wives of the Prophet, you are not like anyone among women. If you fear Allah, then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech. (32) And abide in your houses and do not display yourselves as [was] the display of the former times of ignorance. And establish prayer and give zakah and obey Allah and His Messenger. Allah intends only to remove from you the impurity [of sin], O people of the [Prophet&#8217;s] household, and to purify you with [extensive] purification. (33) And remember what is recited in your houses of the verses of Allah and wisdom. Indeed, Allah is ever Subtle and Acquainted [with all things]. (34) &#8211;<\/em> [al-Ahzab]<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">If we should ask any person who has read these verses, any unbiased Muslim or non-Muslim, a Bedouin or an Arab Nomad in the desert about what these verses are talking about, his answer would be:<\/p>\n<p style=\"text-align: justify;\">&#8220;God tells his Prophet to order his wives of certain tasks, and to prohibit them from certain tasks, and to tell them that they are unique unlike any other women in society, then he clarifies his intention which is to purify (make tatheer of) them if they adhere to these orders and prohibitions.&#8221;<\/p>\n<p style=\"text-align: justify;\">In no way will you receive an answer other than this answer. However, the sect of  Twelver Shia claim that verse 33, or more specifically the last part of verse 33, is not aimed at the wives but is aimed at some other members of the household.<\/p>\n<p style=\"text-align: justify;\">The last part of the verse 33 is the one starting from &#8220;<em>Allah intends  only<\/em> &#8230;(until)&#8230;  <em>purification<\/em>&#8221; and in Arabic it starts from &#8220;Innama &#8230;(until)&#8230; Tatheera&#8221;.<\/p>\n<h2 style=\"text-align: justify;\">The Positions of Shias Regarding Ayat Al Tatheer<\/h2>\n<p style=\"text-align: justify;\">It is this claim that we shall discuss, and we know since we have researched this that the Twelver Shia sect is split on this specific issue on two positions:<\/p>\n<div style=\"text-align: justify;\">\n<div><strong>First Shia position:<\/strong> This verse was revealed about the five of Ahlul-Kisa&#8217; (people of the cloak), Shia Scholars such as al-`Allamah al-Majlisi, Grand Ayatullah `Ali al-Milani and Yusuf al-Bahrani say that this is a completely different verse, the position of this verse was changed by the Companions (ra) of the Prophet SAWS because they disliked Ahlul-Bayt (ra), they placed it in the middle of other verses which are talking about the wives of the Prophet SAWS but it should have been somewhere else.<\/div>\n<\/div>\n<p style=\"text-align: justify;\"><strong>I say:<\/strong> This opinion is pure and simple Tahreef, according to the Muslims if anyone says this then he is a Kafir, This order in which the Qur&#8217;an was placed in is a divinely inspired to the Prophet SAWS himself and no Muslim will disagree to this. However, do you not think that it is strange how these scholars adopted a position that the Qur&#8217;an is corrupted? Why couldn&#8217;t they have found another way out of this? Was there really no other way to explain the verses&#8217; position and context other than resorting to Tahreef? We will soon see why they adopted this position insha-Allah.<\/p>\n<div style=\"text-align: justify;\">\n<div><strong>Second Shia position:<\/strong> This verse was revealed about the five of Ahlul-Kisa&#8217; (people of the cloak), Scholars such as al-Tabrasi and Ja`far al-Subhani say that the last part of this verse: &#8220;Innama&#8230;..tatheera,&#8221; constitutes a parenthetical phrase in the midst of the the discourse directed at the Mothers of the Believers (ra), and that this parenthetical phrase has no relation to what comes before or after it, there are examples of this in the Qur&#8217;an and Hadith al-Kisa&#8217; proves that those five are the cause of revelation for this verse.<\/div>\n<\/div>\n<p style=\"text-align: justify;\"><strong>I say:<\/strong> According to these scholars, it is in its correct position but it has no relation to all the other verses who surround it. They say there are examples of such parenthetical phrases in the book of Allah. Also Hadith al-Kisa&#8217; proves that they are the cause of revelation.<\/p>\n<p style=\"text-align: justify;\">Firstly let us discuss who narrated these narrations?<\/p>\n<h2 style=\"text-align: justify;\">Narrations about Ayat Al Tatheer<\/h2>\n<p style=\"text-align: justify;\">We have one authentic narration from the Mother of believers `Aisha (ra) in Sahih Muslim in which she says that Allah&#8217;s Apostle SAWS went out one morning wearing a striped cloak of the black camel&#8217;s hair.<\/p>\n<p style=\"text-align: justify;\">And where did he go? He went to Umm Salama&#8217;s (ra) house and these verses were revealed in her house as she states in the authentic narrations:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>في بيتي أنزلت :  إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا  قالت : فأرسل رسول الله صلى الله عليه وسلم إلى فاطمة وعلي والحسن والحسين ، فقال : هؤلاء أهل بيتي ، وفي حديث القاضي والسمي : هؤلاء أهلي ، قالت : فقلت : يا رسول الله ! أما أنا من أهل البيت ؟ قال : بلى إن شاء الله تعالى<\/strong><br \/>\n<strong>الراوي: أم سلمة المحدث: الحاكم &#8211; المصدر: السنن الكبرى للبيهقي &#8211; الصفحة أو الرقم: 2\/150<\/strong><br \/>\n<strong>خلاصة حكم المحدث: صحيح سنده ثقات رواته<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> Umm Salmah (ra) said: In my house these verses were revealed &#8220;<em>Allah only wills to remove what is foul from  you Ahlul-Bayt and to purify you thoroughly.<\/em>&#8221; So the Prophet SAWS called for `Ali and Fatima and Hasan and Husein and then said: &#8220;These are my Ahlul-Bayt&#8221;, In the Hadith of al Qadi and al Summi he said: &#8220;They are my Ahel&#8221;. So I said: &#8220;O Messenger of Allah! aren&#8217;t I also from your Ahlul-Bayt?&#8221; He said: &#8220;Yes you are Insha-Allah.&#8221;<\/p>\n<p style=\"text-align: justify;\">Muhaddith: Al Hakim from al Sunan al kubrah for Bayhaqi.<br \/>\nHadith rank: Isnad SAHIH narrators all trustworthy.<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">And there are different versions of this narration, in one he SAWS says to her &#8220;Yes you are insha-Allah&#8221; and in another &#8220;You are upon goodness. (twice)&#8221; and some other versions&#8230;<\/p>\n<p style=\"text-align: justify;\">Now we did not open the topic to discuss the narrations as they&#8217;ve been discussed sufficiently in other articles online, what we need to know here is that the clear authentic narrations state that the verses were revealed before the event of the cloak and that in this event the Prophet SAWS only read the verses for them and made Du`a to them, he did not exclude the wives or anyone else from his Ahlul-Bayt, all he did was include the four other members, `Ali, Fatima, Hasan &amp; Husein (ra).<\/p>\n<p style=\"text-align: justify;\">It is also authentically narrated from ibn `Abbas (ra) that the verses were revealed exclusively for the wives of the Prophet SAWS.<\/p>\n<p style=\"text-align: justify;\">Anyway, if the verses were revealed before the event of the cloak, and before he SAWS called on `Ali&#8217;s (ra) family to make Du`a for them, then the saying of the Shia &#8220;They (the four) are the cause of revelation&#8221; is incorrect.<\/p>\n<p style=\"text-align: justify;\">As you all know there is something in Qur&#8217;anic sciences called <strong>أسباب النزول<\/strong> &#8220;Asbab al-Nuzoul&#8221; which translates to &#8220;The causes of the revelations&#8221;, this is basically an event which takes place and causes a verse to be revealed as a result, such as:<\/p>\n<div>\n<div style=\"text-align: justify;\"><em>They ask you, [O Muhammad], about the bounties [of war]. Say, &#8220;The [decision concerning] bounties is for Allah and the Messenger.&#8221; So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.<\/em> [al-Anfal 8:1]<\/div>\n<div style=\"text-align: justify;\"><\/div>\n<\/div>\n<p>So why was this revealed? what is the cause for revelation OR &#8220;Sabab al-Nuzoul&#8221;? we read in Sahih Muslim that it is related to the bounties from the battle of Badr:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>أخذ أبي من الخمس سيفا . فأتى به النبي صلى الله عليه وسلم . فقال : هب لي هذا . فأبى . فأنزل الله عز وجل : { يسألونك عن الأنفال قل الأنفال لله والرسول } الأنفال : 1\/8۔<\/strong><br \/>\n<strong>الراوي: سعد بن أبي وقاص المحدث: مسلم &#8211; المصدر: صحيح مسلم &#8211; الصفحة أو الرقم: 1748<\/strong><br \/>\n<strong>خلاصة حكم المحدث: صحيح<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> Sa`d bin abi Waqqas (ra) narrates: My father took a sword from the Khums then he went to the prophet SAWS and told him: &#8220;Grant me this sword&#8221; but the Prophet SAWS did not agree to grant him the sword, thus Allah revealed: {<em>They ask you about the bounties. Say, &#8220;The bounties are for Allah and the Messenger.&#8221;<\/em>}<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">This above illustrates the cause for the revelation for verse [8:1], it is an event which takes place then Allah reveals a verse because of it, but in our case it is incorrect to say that the four are the cause for the revelation of [33:33] because the cause must precede the revelation, this contradicts the authentic narrations that show that this verse had already been revealed before the event of the cloak.<\/p>\n<h2 style=\"text-align: justify;\">Is Ayat Al Tatheer a Separate Verse?<\/h2>\n<p style=\"text-align: justify;\">Secondly a Shia may say that the text of the narration shows that this was an independent verse that was revealed separately, this is because we only read in the Hadith of Umm Salamah (ra) a part of the verse and not a complete verse:<\/p>\n<p style=\"text-align: justify;\">((In my house these verses were revealed <strong>&#8220;<em>Allah only wills to remove what is foul from  you Ahlul-Bayt and to purify you thoroughly.<\/em>&#8220;<\/strong> So the Prophet SAWS called for `Ali and&#8230;))<\/p>\n<p style=\"text-align: justify;\">They will ask you why didn&#8217;t Umm Salamah (ra) mention the entire verse? Why only the last part? Then they will say that according to them this means that it is a separate verse altogether.<\/p>\n<p style=\"text-align: justify;\">This is incorrect, all you have to do is look up to the verse I provided as an example above in [al-Anfal 8:1] and then read the authentic narration in Sahih Muslim to see that Sa`d bin abi Waqqas (ra) did not mention the whole verse in the Hadith, so based on this can we say that Surat al-Anfal is 76 verses long instead of 75 verses?<\/p>\n<p style=\"text-align: justify;\">Can we say based on this that the <span style=\"color: #0000ff;\">Blue<\/span> part of the verse is separate from the <span style=\"color: #ff0000;\">Red<\/span> part of the verse and that they are two separate verses?<\/p>\n<div style=\"text-align: justify;\">\n<div><em><span style=\"color: #ff0000;\">They ask you, [O Muhammad], about the bounties [of war]. Say, &#8220;The [decision concerning] bounties is for Allah and the Messenger.&#8221;<\/span> <span style=\"color: #0000ff;\">So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.<\/span><\/em> [al-Anfal 8:1]<\/div>\n<div><\/div>\n<\/div>\n<p style=\"text-align: justify;\">Surely that is wrong.<\/p>\n<p style=\"text-align: justify;\">I will also provide another example, this verse from Surat al-Noor:<\/p>\n<div>\n<div style=\"text-align: justify;\"><em>And let not those of virtue among you and wealth swear not to give [aid] to their relatives and the needy and the emigrants for the cause of Allah, and let them pardon and overlook. Would you not like that Allah should forgive you? And Allah is Forgiving and Merciful.<\/em> [al-Noor 24:22]<\/div>\n<\/div>\n<p>In the cause of revelation in Sahih Muslim from the Hadith of `Aisha (ra) we read that Mistah had accused `Aisha (ra) of false allegations in the incident of Ifk, so Abu Bakr (ra) got angry at him:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>قالت فقال أبو بكر ، وكان ينفق على مسطح لقرابته منه وفقره : والله ! لا أنفق عليه شيئا أبدا . بعد الذي قال لعائشة . فأنزل الله عز وجل : { ولا يأتل أولوا الفضل منكم والسعة أن يؤتوا أولي القربى } [ 24 \/ النور \/ 22 ] إلى قوله : { ألا تحبون أن يغفر الله لكم }۔<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong>`Aisha (ra) narrated in a long Hadith: &#8230; Abu Bakr used to give to Mistah (some stipend) as a token of kinship with him and for his poverty and he (Abu Bakr) said: By Allah, now I would not spend anything for him. `Aisha said: It was upon this that Allah the Exalted and Glorious revealed this verse: {<em>And let not those of virtue among you and wealth swear not to give [aid] to their relatives and the needy and the emigrants for the cause of Allah, and let them pardon and overlook. Would you not like that Allah should forgive you?<\/em>}<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">So based on this narration in Sahih Muslim, could we say that the<span style=\"color: #0000ff;\"> Blue<\/span> part is a verse and the <span style=\"color: #ff0000;\">Red<\/span> part is a totally different verse? And Surat al-Noor would become 65 verses long?<\/p>\n<div style=\"text-align: justify;\">\n<div><em>And let not those of virtue among you and wealth swear not to give [aid] to their relatives and the needy and the emigrants for the cause of Allah, and let them pardon and overlook. Would you not like that Allah should forgive you?  And Allah is Forgiving and Merciful.<\/em> [al-Noor 24:22]<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Surely that is wrong.<\/p>\n<p style=\"text-align: justify;\">And another example from the Hadith of Mu`ath ibn Jabal (ra) regarding Surat al-Baqara:<\/p>\n<div>\n<div style=\"text-align: justify;\"><em>O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous &#8211;  (183) [Fasting for] a limited number of days. So whoever among you is ill or on a journey [during them] &#8211; then an equal number of days [are to be made up]. And upon those who are able [to fast, but with hardship] &#8211; a ransom [as substitute] of feeding a poor person [each day]. And whoever volunteers excess &#8211; it is better for him. But to fast is best for you, if you only knew. (184)<\/em> [al-Baqara 2:183-184]<\/div>\n<\/div>\n<p>We read the Hadith of Mu&#8217;ath (ra) in Sahih Sunan abu Dawoud by al-Albani:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>فإن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر ويصوم يوم عاشوراء فأنزل الله تعالى ( كتب عليكم الصيام كما كتب على الذين من قبلكم ) إلى قوله: طعام مسكين<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> Mu`ath (ra) said: The Prophet SAWS used to fast three days from each month and he would fast the day of `Ashura so Allah revealed: {<em>decreed upon you is fasting as it was decreed upon those before you that you may become righteous &#8211; (183) [Fasting for] a limited number of days. So whoever among you is ill or on a journey [during them] &#8211; then an equal number of days [are to be made up]. And upon those who are able [to fast, but with hardship] &#8211; a ransom [as substitute] of feeding a poor person [each day].<\/em>}<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Would this by any chance mean that the three different colors are three different verses?<\/p>\n<div style=\"text-align: justify;\">\n<div><em><span style=\"color: #0000ff;\">O you who have believed,<\/span> <span style=\"color: #ff0000;\">decreed upon you is fasting as it was decreed upon those before you that you may become righteous &#8211; (183) [Fasting for] a limited number of days. So whoever among you is ill or on a journey [during them] &#8211; then an equal number of days [are to be made up]. And upon those who are able [to fast, but with hardship] &#8211; a ransom [as substitute] of feeding a poor person [each day]. <\/span><span style=\"color: #008000;\"> And whoever volunteers excess &#8211; it is better for him. But to fast is best for you, if you only knew. (184)<\/span> <\/em>[al-Baqara 2:183-184]<\/div>\n<\/div>\n<p style=\"text-align: justify;\">A quick final example before we leave this matter, Surat al-Noor verse 31:<\/p>\n<div>\n<div style=\"text-align: justify;\"><em>And tell the believing women to lower their gaze and be modest, and to display of their adornment only that which is apparent, and to draw their veils over their bosoms, and not to reveal their adornment save to their own husbands or fathers or husbands&#8217; fathers, or their sons or their husbands&#8217; sons, or their brothers or their brothers&#8217; sons or sisters&#8217; sons, or their women, or their slaves, or male attendants who lack vigour, or children who know naught of women&#8217;s nakedness. And let them not stamp their feet so as to reveal what they hide of their adornment. And turn unto Allah together, O believers, in order that ye may succeed.<\/em> [al-Noor 24:31]<\/div>\n<\/div>\n<p>And in Sahih al-Bukhari we read:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>أن عائشة رضي الله عنها كانت تقول : لما نزلت هذه الآية : { وليضربن بخمرهن على جيوبهن } . أخذن أزرهن فشققنها من قبل الحواشي ، فاختمرن بها<\/strong><br \/>\n<strong>الراوي: صفية بنت شيبة المحدث: البخاري &#8211; المصدر: صحيح البخاري &#8211; الصفحة أو الرقم: 4759<\/strong><br \/>\n<strong>خلاصة حكم المحدث: صحيح<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> Narrated Safiya bint Shaiba: `Aisha used to say: &#8220;When (the verse): &#8220;They should draw their veils over their necks and bosoms,&#8221; was revealed, (the ladies) cut their waist sheets at the edges and covered their faces with the cut pieces.&#8221;<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">So now this makes it three separate verses according to the Shia?<\/p>\n<div style=\"text-align: justify;\">\n<div><em><span style=\"color: #0000ff;\">And tell the believing women to lower their gaze and be modest, and to display of their adornment only that which is apparent, and<\/span> <span style=\"color: #ff0000;\">to draw their veils over their necks and bosoms,<\/span> <span style=\"color: #008000;\">and not to reveal their adornment save to their own husbands or fathers or husbands&#8217; fathers, or their sons or their husbands&#8217; sons, or their brothers or their brothers&#8217; sons or sisters&#8217; sons, or their women, or their slaves, or male attendants who lack vigour, or children who know naught of women&#8217;s nakedness. And let them not stamp their feet so as to reveal what they hide of their adornment. And turn unto Allah together, O believers, in order that ye may succeed.<\/span><\/em>  [al-Noor 24:31]<\/div>\n<\/div>\n<p style=\"text-align: justify;\">I hope that the reader understands what is meant by &#8220;Asbab al-Nuzoul&#8221; or the causes for the revelations and how the companions (ra) may refer to a part of a verse and not necessarily all of it in a Hadith, this is very common as you see.<\/p>\n<p style=\"text-align: justify;\">So far what we have is:<\/p>\n<p style=\"text-align: justify;\">1- Nothing in the Hadith proves that the last part of [33:33] is a different verse like the Shia scholars claimed.<\/p>\n<p style=\"text-align: justify;\">2- The authentic narrations show us that the verses were revealed and then the Prophet SAWS would call on the four, they are not the cause of revelation.<\/p>\n<p style=\"text-align: justify;\">3- Ayat Al Tatheer is a part of a verse and not a separate verse, it is tied logically with what is before it and after it in terms of context.<\/p>\n<p>&nbsp;<\/p>\n<h2>Answer to Masculine Wording in Ayat Al Tatheer<\/h2>\n<p style=\"text-align: justify;\">During the course of the verses we observe the feminine usage of words such as <strong>وقر<span style=\"color: #ff0000;\">ن<\/span><\/strong> &#8220;Waqar<span style=\"color: #ff0000;\">na<\/span>&#8221; and <strong>واذكر<span style=\"color: #ff0000;\">ن<\/span><\/strong> &#8220;Waothkur<span style=\"color: #ff0000;\">na<\/span>&#8221; so the speech is directed at the wives since all colors in red before and after are feminine with the Arabic letter <span style=\"color: #ff0000;\"><strong>ن<\/strong><\/span> called &#8220;Nun al-Niswa&#8221; at the end of each word to prove that it is talking about females.<\/p>\n<div style=\"text-align: justify;\">\n<div><em>O wives of the Prophet,<span style=\"color: #ff0000;\"> you<\/span> are not like anyone among women. If you <span style=\"color: #ff0000;\">fear<\/span> Allah, then do not be <span style=\"color: #ff0000;\">soft<\/span> in speech [to men], lest he in whose heart is disease should covet, but <span style=\"color: #ff0000;\">speak<\/span> with appropriate speech. (32) And <span style=\"color: #ff0000;\">abide<\/span> in your <span style=\"color: #ff0000;\">houses<\/span> and do not <span style=\"color: #ff0000;\">display yourselves<\/span> as [was] the display of the former times of ignorance. And<span style=\"color: #ff0000;\"> establish<\/span> prayer and <span style=\"color: #ff0000;\">give<\/span> Zakah and <span style=\"color: #ff0000;\">obey<\/span> <span style=\"text-decoration: underline;\">Allah and His Messenger. Allah intends only to remove from you the impurity [of sin], O people of the [Prophet&#8217;s] household, and to purify you with [extensive] purification.<\/span> (33) And <span style=\"color: #ff0000;\">remember<\/span> what is recited in your <span style=\"color: #ff0000;\">houses<\/span> of the verses of Allah and wisdom. Indeed, Allah is ever Subtle and Acquainted [with all things].<\/em> (34)<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Everything highlighted in Red above is feminine in the Arabic Qur&#8217;anic text, it contains the speech to the Prophet&#8217;s SAWS wives ordering them to do things and forbidding them and promising them other things. So how can the Shia know that the part <span style=\"text-decoration: underline;\"><em>&#8220;Allah intends only to remove from you the impurity, O people of the household, and to purify you a thorough purification&#8221;<\/em><\/span> is an independent parenthetical phrase detached from all surrounding verses? is this apparent from the context of the verses and the verse itself or did you reach this conclusion based on an outside source other than the words of Allah?<\/p>\n<p style=\"text-align: justify;\">I explain,<\/p>\n<p style=\"text-align: justify;\">If an Arab or your average Muslim or a Bedouin in the desert during the time of the Prophet SAWS reads these verses, would he notice that Allah switched in the second half of verse [33:33] from addressing the wives and started addressing somebody else?<\/p>\n<p style=\"text-align: justify;\">If the Shia answer is yes then by all means show us something in the verses, a sign that hints that the previous topic ended and Allah stopped addressing the wives and he switched to talk to some other people about some other topic, show us the linguistic proof that supports your claim that a subject had ended and a new subject had begun in the middle of verse [33:33].<\/p>\n<p style=\"text-align: justify;\">If the Shia answers by saying that the proof is in Hadith al-Kisa&#8217; then this is a pathetic argument which shows ignorance in the language of the Arabs, because the claim that there is a parenthetical phrase in the middle of a discourse without any signs or hints or proofs from the phrase itself shows that there is no eloquence in the speech of Allah and it contradicts the definition of a parenthetical phrase as defined by the Arab scholars of language:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>أنها تأتي في أثناء الكلام – وليس المراد بالكلام هنا : المسند والمسند إليه فقط ، بل جميع ما يتعلق به من الفضلات والتوابع – فاصلة بين متلازمين ، سواء أكانا مفردين ، أو كانا جملتين متصلتين معنى ، وذلك لإفادة الكلام تقوية ، أو إيضاحا وبيانا ، لنكتة سوى دفع الإيهام<br \/>\nابن جني : الخصائص ج 1 ص 335۔<\/strong><\/p>\n<\/div>\n<\/div>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>هو أن يؤتى في أثناء الكلام ، أو كلامين متصلين معنى ، بشيئ يتم الغرض الأصلي بدونه ، ولا يفوت بفواته ، فيكون فاصلا بين الكلام أو الكلامين لنكتة<br \/>\nابن هشام الأنصاري : المغني ص 506۔<\/strong><\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Here we have quoted classical linguists such as Ibn Junay in &#8220;al-Khasa&#8217;is&#8221; vol.1 page 335 &amp; Ibn Hisham al-Ansari in &#8220;al-Mughni&#8221; page 506, they both define the parenthetical phrase saying that it comes in the middle of the discourse or between two connected phrases with the purpose of strengthening the meaning or giving an explanation or making a clarification, and that it should not matter to the original purpose of the sentence nor should the sentence be dependent on it for completion of meaning, and that <strong>the parenthetical phrase must come with a sign or hint which proves it.<\/strong><\/p>\n<p style=\"text-align: justify;\">The parenthetical phrase must be understood from the context of the language &#8211; it cannot be left to an external source to prove that it is parenthetical. No Arab hearing this verse on its own (which is how the Arabs understood the Qur&#8217;an) would imagine that these words are not meant for the Mothers of the Believers (ra). Furthermore, if there is no contextual evidence that this phrase is parenthetical, this would mean that the parenthetical phrase is completely random &#8211; yet Allah&#8217;s Speech is not random! I seek refuge in Allah from those who hint towards this.<\/p>\n<p style=\"text-align: justify;\">So as we said, Arabs understood the Qur&#8217;an in its apparent form and this was their religion, this is why the proof needs to be presented from the content itself and not from an outside source, Ayatullah al-Khoei says in his book of Tafseer &#8220;al-Bayan fi Tafseer al-Quran&#8221; page 264:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>البيان في تفسير القرآن &#8211; الخوئي ص 264۔<br \/>\nومما يدل على حجية ظواهر الكتاب وفهم العرب لمعانيه:۔<br \/>\nأن القرآن نزل حجة على الرسالة ، وأن النبي &#8211; ص &#8211; قد تحدى البشر على أن يأتوا ولو بسورة من مثله ، ومعنى هذا : أن العرب كانت تفهم معاني القرآن من ظواهره ، ولو كان القرآن من قبيل الالغاز لم تصح مطالبتهم بمعارضته ، ولم يثبت لهم إعجازه ، لانهم ليسوا ممن يستطيعون فهمه ، وهذا ينافي الغرض من إنزال القرآن ودعوة البشر إلى الايمان به۔<br \/>\nالروايات المتظافرة الامرة بالتمسك بالثقلين الذين تركهما النبي في المسلمين ، فإن من البين أن معنى التمسك بالكتاب هو الاخذ به ، والعمل بما يشتمل عليه ، ولا معنى له سوى ذلك۔<br \/>\nالروايات المتواترة التي أمرت بعرض الاخبار على الكتاب ، وأن ما خالف الكتاب منها يضرب على الجدار ، أو أنه باطل ، أو أنه زخرف ، أو أنه منهي عن قبوله ، أو أن الائمة لم تقله ، وهذه الروايات صريحة في حجية ظواهر الكتاب ، وأنه مما تفهمه عامة أهل اللسان العارفين بالفصيح من لغة العرب . ومن هذا القبيل الروايات التي أمرت بعرض الشروط على كتاب الله ورد ما خالفه منها۔<\/strong><\/p>\n<p><strong>Translation:<\/strong><\/p>\n<\/div>\n<div><\/div>\n<div style=\"text-align: justify;\">[&#8220;What proves <span style=\"text-decoration: underline;\">the authority of the outward appearance of the Qur&#8217;anic text<\/span> and the Arab&#8217;s understanding of its meanings:<\/div>\n<div style=\"text-align: justify;\">1- The Qur&#8217;an was revealed to deliver a divine argument to the message, the Prophet SAWS has challenged the people to bring even one similar verse, this means: <span style=\"text-decoration: underline;\">that the Arabs used to understand its meanings from its apparent words, and if the Qur&#8217;an was a book of secret codes then its miracles would not be proven because they wouldn&#8217;t understand it in the first place<\/span>, this beats the point of revealing it and calling humanity to believe in it.<\/div>\n<div style=\"text-align: justify;\"><\/div>\n<div style=\"text-align: justify;\">2- The great number of narrations ordering us to hold on to the two weighty things left behind by the Prophet SAWS, it <span style=\"text-decoration: underline;\">is clear that this means that we must work with what&#8217;s contained in the book.<\/span><\/div>\n<div style=\"text-align: justify;\"><\/div>\n<div style=\"text-align: justify;\">3- The Mutawatir <span style=\"text-decoration: underline;\">narrations telling us to present the narrations to the book of Allah, they say that what contradicts it should be slammed against the wall<\/span> as it is unacceptable and that it never came from the Imams, <span style=\"text-decoration: underline;\">these narrations are clearly telling us to take the apparent wording of the book because this is what the Arab speaking people understand.<\/span>&#8220;]<\/div>\n<\/div>\n<p>After this, the Shia will look for a way out, and he will reply with the only two things he could spot as possible &#8220;hints&#8221; or &#8220;proofs&#8221; to their parenthetical phrase argument:<\/p>\n<p>&nbsp;<\/p>\n<div>\n<div><strong>(A) Shia says:<\/strong> Allah was addressing them as &#8220;Wives&#8221; but then he switched to saying &#8220;Ahlul-Bayt&#8221;.<\/div>\n<\/div>\n<p style=\"text-align: justify;\"><strong>Answer:<\/strong> This is an old argument that we&#8217;ve replied to a thousand times, in countless Sunni and Shia narrations the wives are referred to as &#8220;Ahel&#8221; and &#8220;Ahlul-Bayt&#8221;, also in the Qur&#8217;an we find the wives being referred to as Ahlul-Bayt in other popular verses, so this argument fails by default.<\/p>\n<div>\n<div><strong>(B) Shia says:<\/strong> The feminine was used to address the wives in all surrounding verses, but Allah switched to addresses Ahlul-Bayt with masculine.<\/div>\n<\/div>\n<p><strong>Answer:<\/strong> The answer to this is in two parts, the first one is that we must first check the context of the verses, because the context gives us the meaning as the Shia scholars themselves admit:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>آية التطهير &#8211; السيد علي الميلاني &#8211; الصفحة 23۔<br \/>\nعندنا اصطلاح في علم الأصول، يقولون: بأن السياق قرينة في الكلام، أي أنه متى ما أردنا أن نفهم معنى كلام أو معنى كلمة، نراها محفوفة بأي كلام، وفي أي سياق، فالألفاظ التي تحف بهذه الكلمة، والسياق الذي جاءت الجملة في ذلك السياق، يكون معينا لنا أو معينا لنا على فهم المراد من تلك الكلمة أو الجملة، هذا شئ يذكرونه في علم الأصول، وهذا أيضا أمر صحيح في مورده ولا نقاش فيه۔<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> &#8220;In the science of Usool we say: The context is proof, meaning that when we need to know the meaning of some words or the meaning of a word, we look at what surrounds it and in what context it is found in, because the words that surround it and the context of the phrase that contains it will aid us in understanding that word or phrase, this is something they mention in `Ilm al-Usool and this is something correct, no one disputes it.&#8221; [Ayat al Tatheer, pg 23 &#8211; by: Grand Ayatullah Sayyed `Ali al-Milani]<\/p>\n<\/div>\n<\/div>\n<p>How I wish al-Milani would apply what he actually says to verse [33:33] that would help solve the whole problem I suppose.<\/p>\n<p>So we go back to the context to see who is Allah talking to?<\/p>\n<p>In verse 28, Allah says:<\/p>\n<div>\n<div><em>O Prophet, tell your wives&#8230;<\/em><\/div>\n<\/div>\n<p>In verse 31, Allah says:<\/p>\n<div>\n<div><em>O wives of the Prophet..<\/em>.<\/div>\n<\/div>\n<p style=\"text-align: justify;\">So the divine speech is directed towards the Prophet SAWS and the mothers of believers (ra), then after Allah tells them what they must do he clarifies that he only intends to purify the prophetic household, so he addresses all of them together by saying:<\/p>\n<p>In verse 33:<\/p>\n<div>\n<div><em>Allah but wills to remove from you all that is foul O people of the household&#8230;<\/em><\/div>\n<\/div>\n<p>So the Almighty gives this advice to the wives in order to purify the entire prophetic household that includes the Prophet SAWS and his wives.<\/p>\n<p>That is a reason for the use of masculine in:<\/p>\n<p>&nbsp;<\/p>\n<div>\n<div><em>Allah but wills to remove <span style=\"color: #0000ff;\">from <strong>you<\/strong><\/span> all that is foul O people of the household(AHLUL-BAYT) and to <span style=\"color: #0000ff;\">purify <strong>you<\/strong><\/span> a thorough purification.<\/em><\/div>\n<div><\/div>\n<div><\/div>\n<div>&#8220;innama yureedu Allahu liyuthhiba <span style=\"color: #0000ff;\"><strong>AAankumu<\/strong><\/span> alrrijsa ahla-albayti wa <span style=\"color: #0000ff;\"><strong>yutahhirakum <\/strong><\/span> tat-heeran&#8221;<\/div>\n<\/div>\n<p style=\"text-align: justify;\">However, the main reason for the use of masculine (above in blue) is not just the reason I presented. The main reason for the use of masculine around the word &#8220;Ahlul-Bayt&#8221; in the above verse is that the word &#8220;Ahlul-Bayt&#8221; or &#8220;Ahel&#8221;, this word in Arabic is a masculine word, so Allah would never use feminine to refer to a masculine word, if Allah were to actually use feminine then that&#8217;d be a grammatical error and Allah never commits grammatical errors. In English this would be called &#8220;collective noun&#8221; and they are always masculine, this in short is the answer as to why masculine is used.<\/p>\n<p>One needs to know that words in the Arabic language are categorized to either &#8220;masculine&#8221; or &#8220;feminine&#8221;, a quick example of this would be:<\/p>\n<p>The word &#8220;sword&#8221; in Arabic is a masculine word, while the word &#8220;table&#8221; is a feminine word.<\/p>\n<p>So the way you refer to both is different:<\/p>\n<p>In case of the sword:<\/p>\n<div>\n<div>\n<p><strong>رأيت سيفا <span style=\"color: #0000ff;\">فحملته<\/span> على ظهري<\/strong><br \/>\n<strong>Translation:<\/strong> I saw a sword so I <span style=\"color: #0000ff;\"><strong>carried it<\/strong><\/span> on my back<\/p>\n<\/div>\n<\/div>\n<p>In case of the table:<\/p>\n<div>\n<div>\n<p><strong>رأيت طاولة <span style=\"color: #ff0000;\">فحملتها<\/span> على ظهري<\/strong><br \/>\n<strong>Translation:<\/strong> I saw a table so I <span style=\"color: #ff0000;\"><strong>carried it<\/strong> <\/span>on my back<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">As you notice, both of them are referred to as &#8220;it&#8221; in English but the difference is that in the Arabic language the way you write &#8220;it&#8221; is different for masculine and feminine objects, notice for sword it is written like this<span style=\"color: #0000ff;\"> <strong>فحملته<\/strong><\/span> as if saying &#8220;carried HIM&#8221; but for table it is written like this <span style=\"color: #ff0000;\"><strong>فحملتها<\/strong><\/span> as if saying &#8220;carried HER&#8221;, this shows that in the Arabic you refer to something based on whether the word itself is a feminine word or a masculine word, this is the case with &#8220;Ahlul-Bayt&#8221; and &#8220;Ahel&#8221;, they are masculine words so Allah can never use feminine. Also as a collective noun it is masculine and not feminine even if it is referring to females.<\/p>\n<p>In the classical Arab book of language &#8220;Lisan al-`Arab&#8221; volume 11 page 28:<\/p>\n<div>\n<div>\n<p><strong>حكى سيبويه في جمع أهل أهلون وسئل الخليل لم سكنوا الهاء ولم يحركوها كما حركوا أرضين فقال لأن الأهل مذكر۔ لسان العرب ج 11 ص 28۔<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> Seebaweih said about the plural of Ahel: Ahloun, and al-Khalil was asked: why did they make Taskeen on the letter &#8220;Haa&#8221; of the word Ahel and did not make Tahreek for it like the word Ardeen? He replied: <span style=\"text-decoration: underline;\"><strong>Because the word Ahel is masculine.<\/strong><\/span><\/p>\n<\/div>\n<\/div>\n<p>And in the same volume on page 29:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>أهل المذهب: من يدين به۔ وأهل الإسلام: من يدين به۔ وأهل الأمر: ولاته۔<br \/>\nوأهل البيت: سكانه۔ وأهل الرجل: أخص الناس به۔ وأهل بيت النبي، صلى الله عليه وسلم: أزواجه وبناته وصهره، أعني عليا، عليه السلام، وقيل: نساء النبي، صلى الله عليه وسلم، والرجال الذين هم آله۔<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> Ahlul-Madhab: those who follow the Madhab. and Ahlul-Islam: those who believe in Islam. and Ahlul-Amr: the Wulat. and Ahlul-Bayt(Household): are those who live in it(House). and Ahlul-Rajol (Ahel of a man): are those who are closest to him. <strong><span style=\"text-decoration: underline;\">and Ahlul-Bayt of the Prophet SAWS are: his wives<\/span>,<\/strong> his daughters, his brother in law, I mean `Ali peace be upon him, <span style=\"text-decoration: underline;\"><strong>it is also said: The wives of the Prophet SAWS<\/strong><\/span> and the men who are from his Aal.<\/p>\n<\/div>\n<\/div>\n<p>I provide some examples:<\/p>\n<p>In Mustadrak al-Wasa&#8217;il by al-Mirza al-Noori 41\/220, we read the Hadith of  `Ali (ra) talking about marriage:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>عن علي ( عليه السلام ) ، قال : &#8221; من أراد منكم التزويج إلى أن قال فإذا <span style=\"color: #ff0000;\">زفت<\/span> زوجته <span style=\"color: #ff0000;\">ودخلت<\/span> عليه ، فليصل ركعتين ثم ليمسح يده على <span style=\"color: #ff0000;\">ناصيتها<\/span> ، ثم ليقل : اللهم بارك لي في أهلي و <span style=\"color: #0000ff;\">بارك لهم في<\/span> ، وما جمعت بيننا فاجمع بيننا في خير ويمن وبركة ، وإذا جعلتها فرقة فاجعلها فرقة إلى خير ، فإذا جلس إلى <span style=\"color: #ff0000;\">جانبها<\/span> فليمسح <span style=\"color: #ff0000;\">بناصيتها<\/span>۔ مستدرك الوسائل &#8211; الميرزا النوري ج 41 ص 220۔<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> From `Ali (as): &#8230;So when his wife is <span style=\"color: #ff0000;\"><strong>wed<\/strong><\/span> to him and she <span style=\"color: #ff0000;\"><strong>entered<\/strong><\/span> on him, he should pray two Raka`at then wipe his hand on <strong><span style=\"color: #ff0000;\">her forelock<\/span>,<\/strong> then he should say: &#8220;O Allah bless my Ahel for me and bless me <strong><span style=\"color: #0000ff;\">for them<\/span>,<\/strong> if you have gathered us then gather us for goodness and if you wish to separate us then make our separation into goodness.&#8221; then if he sits by her <span style=\"color: #ff0000;\"><strong>side<\/strong> <\/span>he would wipe <strong><span style=\"color: #ff0000;\">her forelock<\/span>.<\/strong><\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Above we have colored the feminine words with <span style=\"color: #ff0000;\">Red<\/span> and the masculine ones in <span style=\"color: #0000ff;\">Blue<\/span>, as you see `Ali (ra) is talking about the wife and he addresses her in feminine however when he reaches the part where he calls the wife &#8220;Ahel&#8221; he refers to her in masculine, this is because the word &#8220;Ahel&#8221; is a masculine word and `Ali (ra) could never use feminine in this location.<\/p>\n<p style=\"text-align: justify;\">The same is in Ayat al Tatheer when Allah refers to the wives as Ahlul-Bayt he uses masculine and these are the rules of the Arabic tongue, and what is meant here is that by following these orders and prohibitions from God they would be purified, as Allah said:<\/p>\n<div>\n<div><em>And when you ask [his wives] for something, ask them from behind a partition. <strong>That is <span style=\"text-decoration: underline;\">purer<\/span> for your hearts and their hearts.<\/strong><\/em> [33:53]<\/div>\n<\/div>\n<p>Another example is the verse about the Prophet Musa SAWS and his wife:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>إِذْ رَأَى نَارًا <span style=\"color: #0000ff;\">فَقَالَ لِأَهْلِهِ امْكُثُوا<\/span> إِنِّي آَنَسْتُ نَارًا لَعَلِّي <span style=\"color: #0000ff;\">آَتِيكُمْ<\/span> مِنْهَا بِقَبَسٍ أَوْ أَجِدُ عَلَى النَّارِ هُدًى<\/strong><\/p>\n<p>i.e: Ith raa naran faqala liahlihi <span style=\"color: #0000ff;\"><strong>omkuthoo<\/strong><\/span> innee anastu naran laAAallee <span style=\"color: #0000ff;\"><strong>ateekum<\/strong><\/span> minha biqabasin aw ajidu AAala alnnari hudan.<\/p>\n<p><strong>Translation:<\/strong> When he saw a fire and said to his Ahel, <strong>&#8220;<span style=\"color: #0000ff;\">Stay here<\/span>;<\/strong> indeed, I have perceived a fire; perhaps I can <span style=\"color: #0000ff;\"><strong>bring you<\/strong><\/span> a torch or find at the fire some guidance. [TaHa: 10]<\/p>\n<\/div>\n<\/div>\n<p>Here the word &#8220;Ahel&#8221; is referring to his wife only, but Musa (as) addressed her in the plural of masculine, even the Shia scholars of Tafseer admitted it such as al-Tabrasi in his &#8220;Jawami` al-Jami`&#8221; 2\/699:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>لم يكن مع موسى غير امرأته وقد كنى الله تعالى عنها بالأهل ، فتبع ذلك ورود الخطاب على لفظ الجمع وهو قوله : *  امكثوا * و *  ءاتيكم  * ، *  إني ءانست نارا &#8211; تفسير جوامع الجامع &#8211; الطبرسي ج 2 ص 699۔<\/strong><\/p>\n<p><strong>Translation:<\/strong> &#8220;Musa was accompanied by no one except his wife and Allah referred to her as his Ahel so she was addressed in the plural, this is his saying *omkuthoo* and *ateekum* and&#8230;&#8221;<\/p>\n<\/div>\n<div><\/div>\n<\/div>\n<p>Shia Sheikh al-Tarihi agreed while commenting on this verse in &#8220;Majma` al-Bahrain&#8221; 4\/218:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>قوله : * ( فقال لاهله امكثوا ) * نقل بعض شراح المغني انه قد تخاطب المرأة الواحدة بخطاب الجماعة الذكور ، يقول الرجل عن أهله فعلوا كذا &#8211; مجمع البحرين &#8211; الشيخ الطريحي ج 4 ص 218۔<\/strong><\/p>\n<p><strong>Translation:<\/strong> &#8220;Those who explained al-Mughni said that the woman can be addressed in the plural of masculine, as the man says about his Ahel: They did so and so (In the masculine plural form).&#8221;<\/p>\n<\/div>\n<\/div>\n<p>Another example if you notice in Surat Hud verse 73, the Angels are talking to Sarah the wife of Ibrahim SAWS:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>قَالُواْ أَتَعْجَبِينَ مِنْ أَمْرِ اللّهِ رَحْمَتُ اللّهِ وَبَرَكَاتُهُ عَلَيْكُمْ <span style=\"color: #0000ff;\">أَهْلَ الْبَيْتِ<\/span><\/strong><\/p>\n<p>i.e: &#8220;rahmatu Allahi wabarakatuhu <span style=\"color: #0000ff;\"><strong>AAalaykum ahla albayti<\/strong><\/span>&#8221;<\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> They said, &#8220;Are you amazed at the decree of Allah? May the mercy of Allah and His blessings<span style=\"color: #0000ff;\"> <strong>be upon you, people of the house.<\/strong> <\/span>Indeed, He is Praiseworthy and Honorable.&#8221; [Hud: 73]<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">She is a female being addressed in the plural of masculine which is the exact same case as verse [33:33].<\/p>\n<p style=\"text-align: justify;\">So in conclusion to this point we say that what the Shia have provided as &#8220;proofs&#8221; or &#8220;hints&#8221; for their parenthetical phrase argument were insufficient  and incorrect, to say that Allah stopped referring to them as wives and started referring to them as Ahlul-Bayt is not a proof because the wives are referred to usually as Ahlul-Bayt, and using the switch in the last part from feminine to plural of masculine as a proof is also incorrect since the Arabs refer to their wives in plural of masculine and the Prophet SAWS does this in several locations in the authentic narrations.<\/p>\n<p>&nbsp;<\/p>\n<h2>Independence of Text in Ayat al Tatheer<\/h2>\n<p style=\"text-align: justify;\">Now we begin another topic and we look at the verses once more:<\/p>\n<div style=\"text-align: justify;\">\n<div><strong>Transliteration:<\/strong><span style=\"color: #0000ff;\"> <strong>Waqarna fee buyootikunna wala tabarrajna tabarruja aljahiliyyati aloola waaqimna alssalata waateena alzzakata waatiAAna Allaha warasoolahu<\/strong> <\/span><span style=\"color: #800000;\"><strong>innama yureedu Allahu liyuthhiba AAankumu alrrijsa ahla albayti wayutahhirakum tatheeran<\/strong><\/span> (33:33)<\/div>\n<div><\/div>\n<div><strong>Translation:<\/strong> <span style=\"color: #0000ff;\"><strong>And abide in your houses and do not display yourselves as [was] the display of the former times of ignorance. And establish prayer and give zakah and obey Allah and His Messenger.<\/strong><\/span> <span style=\"color: #800000;\"><strong>Allah intends only to remove from you the impurity [Rijs], O people of the household, and to purify you with [extensive] purification.<\/strong><\/span> (33:33)<\/div>\n<\/div>\n<p style=\"text-align: justify;\">We remember that the Shia stated that the second part is a separate verse not linked to what is before it or after it, and now the question becomes: Is this correct grammatically? Can the second part be independent of the context that surrounds it?<\/p>\n<p style=\"text-align: justify;\">I have differentiated the two parts above with different colours and we can see that the second part which is known as Ayat al Tatheer starts from <strong>&#8220;Innama&#8221;<\/strong> and ends with <strong>&#8220;Tat-heeran&#8221;<\/strong>.<\/p>\n<p style=\"text-align: justify;\">Now we ask, can an independent phrase not linked to anything before it or after it, can it just begin with <strong>&#8220;Innama&#8221;<\/strong>? In the Arabic language the word <strong>&#8220;Innama&#8221;<\/strong> <strong>إنما<\/strong> is known to have the function of <strong>&#8220;Adat-Hasr&#8221;<\/strong> <strong>أداة حصر<\/strong> and this in English means that it has a function of restriction, it restricts the meaning.<\/p>\n<p>The classical Arab linguists such as al-Farra&#8217; and ibn Faris say in the book al-Bahr al-Muheet:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>قال الفراء : ولا يكون ابتداء إلا ردا على أمر ، ولا يكون ابتداء كلام . قال ابن فارس : والذي قاله الفراء صحيح وحجته : { إنما الولاء لمن أعتق } . قلت : ينبغي أن يكون الرد لأمر محقق أو مقدر ، وإلا لورد عليه { إنما الأعمال بالنيات } ونحوه .  من أحسن ما يستدل به أنها للحصر : قوله تعالى : { إنما يتقبل الله من المتقين } ; لأنه لم يتقبل من أخيه ، فلو كان يتقبل من غير المتقين لم يجز الرد على الأخ بذلك ، ولو كان المانع من عدم القبول فوات معنى في المتقرب به لا في الفاعل لم يحسن ذلك ، فكأنه قال : استوينا في الفعل وانحصر القبول في بعلة التقوى<\/strong><\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">They state that &#8220;Innama&#8221; cannot be used to begin a sentence unless it is linked to what came before it, it is only used at the beginning of speech if it is a response to something else; otherwise, it implies simple totality with no exceptions.<\/p>\n<p style=\"text-align: justify;\">This is because according to the scholars of language &#8220;Innama&#8221; does two functions, the function of:<\/p>\n<p><strong><span style=\"color: #ff0000;\">ما<\/span> النافية<\/strong> i.e. <strong>&#8220;<span style=\"color: #ff0000;\">(Ma)<\/span> al-Nafiyah&#8221;<\/strong><\/p>\n<p>and<\/p>\n<p><strong><span style=\"color: #0000ff;\">إلا<\/span> الإستثنائية<\/strong> i.e. <strong>&#8220;<span style=\"color: #0000ff;\">(illa)<\/span> al-Istithnaiyyah&#8221;<\/strong><\/p>\n<p>Where <span style=\"color: #ff0000;\"><strong>&#8220;Ma&#8221;<\/strong><\/span> has the function of negating, and <span style=\"color: #0000ff;\"><strong>&#8220;illa&#8221;<\/strong><\/span> has the function of making an exception.<\/p>\n<p>An example of the use of &#8220;Innama&#8221; in the beginning of a sentence without it being linked to anything before it:<\/p>\n<div>\n<div>\n<p><strong>إنما خلق الله الشمس<\/strong><\/p>\n<p><strong>Transliteration:<\/strong> Innama Khalaqa Allahu al-Shamsa<br \/>\n<strong>Translation:<\/strong> Allah only created the sun<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">As you can see this meaning is corrupt, we all believe that Allah created the sun but the sentence above implies that Allah created ONLY THE SUN, this saying is blasphemy as we know Allah created everything and not just the sun.<\/p>\n<p style=\"text-align: justify;\">This is because as we said before &#8220;Innama&#8221; has a restrictive function and in our case it restricted the creations of Allah to ONLY THE SUN, and as we said &#8220;Innama&#8221; in the Arabic language does the function of two tools and they are <span style=\"color: #ff0000;\"><strong>&#8220;Ma&#8221; ما<\/strong><\/span> (negation), and <span style=\"color: #0000ff;\"><strong>&#8220;illa&#8221; إلا<\/strong><\/span> (exception).<\/p>\n<p>So it is as if we are saying:<\/p>\n<div>\n<div>\n<p><strong><span style=\"color: #ff0000;\">ما<\/span> خلق الله<span style=\"color: #0000ff;\"> إلا<\/span> الشمس<\/strong><\/p>\n<p><strong>Transliteration:<\/strong> <span style=\"color: #ff0000;\"><strong>Ma<\/strong> <\/span>Khalaqa Allahu <span style=\"color: #0000ff;\"><strong>illa<\/strong> <\/span>al-Shamsa<br \/>\n<strong>Translation:<\/strong> Allah <span style=\"color: #ff0000;\"><strong>never<\/strong><\/span> created, <span style=\"color: #0000ff;\"><strong>except<\/strong><\/span> the sun<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Above you can see how <span style=\"color: #ff0000;\"><strong>&#8220;ma&#8221;<\/strong><\/span> does the function of denial or negation and this is the word in <span style=\"color: #ff0000;\"><strong>RED<\/strong> (never)<\/span>, so it gives the meaning that Allah never created anything but then comes the other tool <span style=\"color: #0000ff;\"><strong>&#8220;illa&#8221;<\/strong><\/span> and this is <span style=\"color: #0000ff;\"><strong>BLUE<\/strong> (except)<\/span> since it has the function of making an exception so it made an exception for the sun, thus the meaning would be that Allah never created anything except the sun, which is clear blasphemy.<\/p>\n<p style=\"text-align: justify;\">This is why we cannot use the tool <strong>&#8220;Innama&#8221;<\/strong> at the beginning of most sentences as it would restrict the meaning and imply totality UNLESS we are using it as part of a context, for example to reply to a deviant Mu`tazili like we will show below.<\/p>\n<p style=\"text-align: justify;\">The Mu`tazilah would say to you:<\/p>\n<div style=\"text-align: justify;\">\n<div>Allah created the Qur&#8217;an and the sun.<\/div>\n<\/div>\n<p style=\"text-align: justify;\">This is because they (Mu`tazilah) believe that the Qur&#8217;an was created and not eternal and this is a corrupt belief according to the Muslims, so in this case you can reply to him by using <strong>&#8220;Innama&#8221;<\/strong> exactly as it was used above, you would say:<\/p>\n<div style=\"text-align: justify;\">\n<div>&#8220;Allah only created the sun.&#8221; (Innama Khalaqa Allahu al-Shamsa).<\/div>\n<\/div>\n<p style=\"text-align: justify;\">In this occasion, even if you began your speech with <strong>&#8220;Innama&#8221;<\/strong> it no longer holds a corrupt blasphemous meaning as it did before, this is because as we said previously the tool <strong>&#8220;Innama&#8221;<\/strong> if used, has to be linked to the meaning or the context that came before it, in our situation it is a rebuttal to the Mu`tazili argument so the meaning would become:<\/p>\n<div style=\"text-align: justify;\">\n<div>&#8220;Allah created the sun only&#8221; (out of the two things the deviant mentioned).<\/div>\n<\/div>\n<p style=\"text-align: justify;\">So basically you are telling him that what he said is wrong and that from the things he mentioned (Qur&#8217;an &amp; Sun) Allah had created only the sun, and this is how <strong>&#8220;Innama&#8221;<\/strong> is linked to what came before it in context.<\/p>\n<p style=\"text-align: justify;\">In what cases can you use <strong>&#8220;Innama&#8221;<\/strong> at the beginning of a sentence without it being linked to what came before it?<\/p>\n<p style=\"text-align: justify;\"><strong>Answer:<\/strong> It can be used if the meaning you are going for is an absolute total meaning such as:<\/p>\n<div>\n<div>\n<p><strong>إنما الإ له الله<\/strong><\/p>\n<p><strong>Transliteration:<\/strong> Innama al-Ilah Allah<br \/>\n<strong>Translation:<\/strong> The God is only Allah<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">In this case, the use of Innama at the beginning is correct without any need for it to be linked to anything before it, since the meaning we are giving is an absolute one that there is no God except Allah.<\/p>\n<p style=\"text-align: justify;\">But we cannot start with <strong>&#8220;Innama Bilal Karim&#8221;<\/strong> or <strong>&#8220;The kind is only Bilal&#8221;<\/strong> because this is a Kufri statement that means: <strong>&#8220;No one is kind except Bilal&#8221;.<\/strong><\/p>\n<p style=\"text-align: justify;\">So, how is this relevant to our topic? how is it relevant to verse [33:33]?<\/p>\n<p style=\"text-align: justify;\">Well the Shia claim that the second part of the verse is independent and not linked to the context which surrounds it, the second part they are talking about begins with <strong>&#8220;Innama&#8221;<\/strong> and ends with <strong>&#8220;Tat-heeran&#8221;<\/strong>, so if it were to begin like this then the function of <strong>&#8220;Innama&#8221;<\/strong> would be in the absolute sense and it would replace <span style=\"color: #ff0000;\"><strong>&#8220;Ma&#8221;<\/strong> (negation)<\/span> and <span style=\"color: #0000ff;\"><strong>&#8220;illa&#8221;<\/strong>(exception)<\/span>, this would turn the meaning of Ayat al Tatheer to:<\/p>\n<div>\n<div>\n<p><strong><span style=\"color: #ff0000;\">ليس<\/span> يريد الله <span style=\"color: #0000ff;\">إلا<\/span> إذهاب الرجس و التطهير عن أهل البيت<\/strong><\/p>\n<p><strong>Transliteration:<\/strong> &#8220;<span style=\"color: #ff0000;\"><strong>Laysa<\/strong><\/span> Yuridu Allahu<span style=\"color: #0000ff;\"> <strong>illa<\/strong><\/span> Ithhab al-Rijs wa al Tatheer &#8216;an Ahlul-Bayt&#8221;<br \/>\n<strong>Translation:<\/strong> &#8220;Allah wants (wills) <span style=\"color: #ff0000;\"><strong>nothing<\/strong><\/span> <span style=\"color: #0000ff;\"><strong>except<\/strong><\/span> to remove the foul and impurity from Ahlul-Bayt&#8221;<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Which limits and restricts the limitless will of Allah almighty to nothing except purifying Ahlul-Bayt, as if Allah wants nothing else and this is without a doubt blasphemy and Kufr of the highest order.<\/p>\n<p style=\"text-align: justify;\">Whereas if the word Ahlul-Bayt is referring to the wives as Ahlul-Sunnah understand it, and if Ayat al Tatheer is linked in context to what is before it and after it (And it most certainly is) then the meaning would simply become:<\/p>\n<div style=\"text-align: justify;\">\n<div>&#8220;O wives if you follow the orders I gave you and stop yourselves from committing what I prohibited you from, then you shall be purified as I only intend to purify you O household through my orders and prohibitions.&#8221;<\/div>\n<\/div>\n<p style=\"text-align: justify;\">And this is indeed the correct meaning and the healthy understanding of these verses, this is how any Arab in the desert would understand it. Otherwise, how do we explain that this verse which has absolutely nothing to do with anything surrounding it, how do we explain that it suddenly jumped landed here, in the middle of speech directed towards the wives? Is Allah intentionally trying to misguide his followers? Because if the Shia say that what is understood from this is infallibility then this means that every Arab reading this 1400 years ago to this day would understand that the wives are infallible and this is the exact opposite of the Shia belief as they state that his wives are un-trustworthy and downright evil in some cases.<\/p>\n<p>&nbsp;<\/p>\n<h2>Other Statements of Shia Scholars about Ayat al Tatheer<\/h2>\n<p>Towards the end of this article, we look at what some of their scholars say:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>فيكون تلخيص الكلام :ليس يريد الله إلا إذهاب الرجس على هذا الحد عن أهل البيت ، فدل ذلك على أن إذهاب الرجس قد حصل فيهم . وذلك يدل على عصمتهم ، وإذا ثبت عصمتهم ثبت ما أردناه &#8211; كتاب التبيان للطوسي 8\/340۔<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> So the summary of this would be that: <strong><span style=\"color: #ff0000;\"><span style=\"text-decoration: underline;\">Allah wants nothing except to remove the Rijs<\/span> in this context from Ahlul-Bayt<\/span>,<\/strong> this proves that al-Rijs was removed from them. that proves their infallibility and if this is proven than what we want has been established. [al-Tusi, al-Tibyan: 8\/340]<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Have you noticed what this hypocrite al-Tusi is saying? Then he mentions that it is only restricted to this context so I ask WHAT CONTEXT? There is None according to your sect so stop misguiding people and playing with words!<\/p>\n<p>Then another Shia scholar shows us the lies of the likes of al-Tusi and al-Tabataba&#8217;i, we read:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>ويظهر من كلام العلماء الأبرار ( رضوان الله عليهم): أن الإرادة الإلهية المعبر عنها بقوله تعالى: (إِنَّمَا يُرِيدُ اللهُ لِيُذْهِبَ عَنْكُمُ..) قد تعلقت أولاً وبالذات بإذهاب الرجس، وبالتطهير ولكننا نقول:إن الظاهر هو أنها قد تعلقت أولاً وبالذات بأمر آخر، وهو نفس الأوامر والزواجر التي توجهت إلى زوجات النبي<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Translation:<\/strong> And it appears from the saying of the righteous scholars (ra): that the divine will that is expressed in his saying &#8220;Allah only intends to remove from you the foul&#8230;&#8221; is linked primarily and exclusively with removing the foul and with purifying, but we say: <span style=\"color: #ff0000;\"><strong>That what is apparent is that it is linked primarily and exclusively to another matter,<span style=\"text-decoration: underline;\"> it is linked to the same orders and prohibitions that were aimed at the Prophet&#8217;s SAWS wives.<\/span><\/strong><\/span> [Ja`far Murtada al-`Amili, Ahlul-Bayt fi Ayat al Tatheer: pg 66]<\/p>\n<\/div>\n<\/div>\n<p>Now that this is out of the way, we look at another part of the verse [33:33]:<\/p>\n<div>\n<div>\n<p>إنما يريد الله <span style=\"color: #800080;\">ل<\/span>يذهب<\/p>\n<p><strong>Transliteration:<\/strong> &#8220;innama yuridu Allahu <span style=\"color: #800080;\"><strong>li<\/strong><\/span>-yudh&#8217;hib&#8221;<br \/>\n<strong>Translation:<\/strong> &#8220;Allah only wants <span style=\"color: #800080;\"><strong>to<\/strong><\/span> remove&#8221;<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Here we have the word<span style=\"color: #800080;\"> <strong>&#8220;to&#8221;<\/strong><\/span> which in Arabic is the letter <span style=\"color: #800080;\"><strong>ل<\/strong><\/span> or<span style=\"color: #800080;\"> <strong>&#8220;Laam&#8221;<\/strong><\/span> that I highlighted in VIOLET color in &#8220;<span style=\"color: #800080;\"><strong>li<\/strong><\/span>-yudh&#8217;hib&#8221;, this letter which is placed before the word &#8220;yudh&#8217;hib&#8221; &#8220;remove&#8221; has a function that ties the removal of impurity with the orders and prohibitions directed at the mothers of believers. In Arabic it is called <strong>لام) التعليلية)<\/strong> or <strong>&#8220;Lam al-Ta`liliya&#8221;,<\/strong> its function is (consequential) so<span style=\"color: #800080;\"> <strong>&#8220;li&#8221;<\/strong> <\/span>implies consequence.<\/p>\n<p>An example of<span style=\"color: #800080;\"> <strong>&#8220;li&#8221;<\/strong><\/span> being used in a sentence is:<\/p>\n<div>\n<div>\n<p>جئت <span style=\"color: #800080;\">ل<\/span> أزورك<br \/>\n<strong>Transliteration:<\/strong> &#8220;ji&#8217;tu <span style=\"color: #800080;\"><strong>li<\/strong><\/span>-azurak&#8221;<br \/>\n<strong>Translation:<\/strong> &#8220;I came <span style=\"color: #800080;\"><strong>to<\/strong><\/span> see you&#8221;<\/p>\n<\/div>\n<\/div>\n<p>So it implies consequence, as if you are asking the question &#8220;Why did I come?&#8221; the answer:&#8221;To see you.&#8221;<\/p>\n<p>And just like <strong>&#8220;Innama&#8221;<\/strong> covers the function of <span style=\"color: #ff0000;\"><strong>&#8220;Ma&#8221;<\/strong><\/span> and <span style=\"color: #0000ff;\"><strong>&#8220;illa&#8221;<\/strong><\/span>, the <strong>&#8220;Lam al-Ta&#8217;aliliyah&#8221;<\/strong> covers the function of <strong>كي<\/strong> <span style=\"color: #800080;\"><strong>&#8220;Kay&#8221;<\/strong><\/span>, this is why it can be called <strong>&#8220;Lam kay&#8221;.<\/strong><\/p>\n<p>So it is as if you said:<\/p>\n<div>\n<div>\n<p><strong>جئت<span style=\"color: #800080;\"> كي<\/span> أزورك<\/strong><\/p>\n<p><strong>Transliteration:<\/strong> ji&#8217;tu <span style=\"color: #800080;\"><strong>Kay<\/strong><\/span> azurak<br \/>\n<strong>Translation:<\/strong> I came <span style=\"color: #800080;\"><strong>to<\/strong> <\/span>see you<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">And notice that whether you use <strong>&#8220;Lam&#8221;<\/strong> or <strong>&#8220;Kay&#8221;<\/strong> the English translation remains the same, this is because they have the same exact purpose.<\/p>\n<p style=\"text-align: justify;\">So in the sentence above, <strong>&#8220;I came to see you&#8221;<\/strong>, me seeing you is a consequence of me coming.<\/p>\n<p style=\"text-align: justify;\">And in our verse: &#8220;Allah only wants <span style=\"color: #800080;\"><strong>to<\/strong><\/span> remove&#8221;<\/p>\n<p style=\"text-align: justify;\">The <span style=\"color: #800080;\"><strong>&#8220;to&#8221;<\/strong><\/span> which is<span style=\"color: #800080;\"> <strong>&#8220;li&#8221;<\/strong><\/span> also implies consequence, So the cause of Allah&#8217;s removal of impurity is tied to the wives following the orders and prohibitions <strong>&#8220;abide in your houses&#8221;<\/strong>, <strong>&#8220;do not display yourselves&#8221;<\/strong> ect&#8230; the removal of impurity is a consequence of them following the Godly orders that came previously, and this is how <span style=\"color: #800080;\"><strong>&#8220;li&#8221;<\/strong><\/span> ties the meaning to what came before it.<\/p>\n<p style=\"text-align: justify;\">Otherwise, Allah could have used a tool which does not tie or link the meaning to the surrounding context, he could have used <span style=\"color: #800000;\"><strong>أن<\/strong> <strong>&#8220;An&#8221;<\/strong><\/span>, this would give us:<\/p>\n<div>\n<div>\n<p><strong>إنما يريد الله<span style=\"color: #800000;\"> أن<\/span> يذهب<\/strong><\/p>\n<p><strong>Transliteration:<\/strong> innama yuridu Allahu <span style=\"color: #800000;\"><strong>An<\/strong><\/span> yudh&#8217;hib<br \/>\n<strong>Translation:<\/strong> Allah only wants <span style=\"color: #800000;\"><strong>to<\/strong><\/span> remove<\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">And as you see in English there is absolutely no difference whether you use <span style=\"color: #800080;\"><strong>&#8220;li&#8221;<\/strong> <\/span>or <span style=\"color: #800000;\"><strong>&#8220;An&#8221;<\/strong><\/span>, the phrase would still be translated the exact same way as both of them would be translated as &#8220;<strong>to<\/strong> remove&#8221;.<\/p>\n<p style=\"text-align: justify;\">So what&#8217;s the difference then? the difference is that <span style=\"color: #800000;\"><strong>&#8220;An&#8221;<\/strong><\/span> does not tie the meaning to what is before it whereas <span style=\"color: #800080;\"><strong>&#8220;li&#8221;<\/strong><\/span> implies consequence as we stated and automatically links to the context before it, Allah specifically used<span style=\"color: #800080;\"> <strong>&#8220;li&#8221;<\/strong> <\/span>because the Ayat al Tatheer is linked to the orders and prohibitions aimed at the wives and as a consequence they get to be purified.<\/p>\n<p style=\"text-align: justify;\">Since both <span style=\"color: #800000;\"><strong>&#8220;An&#8221;<\/strong> <\/span>and <span style=\"color: #800080;\"><strong>&#8220;li&#8221;<\/strong> <\/span>translate the same way in English, this becomes a bit hard to express but the matter of the fact is that they are both quite distinct to the Arabs. In the case of<span style=\"color: #800080;\"> <strong>&#8220;li&#8221;<\/strong><\/span> we might express this by translating the verse as follows, with <strong>&#8220;this&#8221;<\/strong> in parentheses:<\/p>\n<div style=\"text-align: justify;\">\n<div>&#8220;Allah but wills <strong>[this]<\/strong> to remove from you all that is foul&#8230;<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Here, the interpolated word <strong>&#8216;[this]&#8217;<\/strong> refers to all that has been told to the Mothers of the Believers (ra) before.<\/p>\n<p style=\"text-align: justify;\">What is most ironic is that the Shia scholars like Ja`far al-`Amili and al-Tabataba&#8217;i, both admit that the<span style=\"color: #800080;\"> <strong>&#8220;li&#8221;<\/strong><\/span> in verse [33:33] is <strong>&#8220;Lam al-Ta`liliyah&#8221;<\/strong> and here we quote:<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>الطباطبائي في تفسيره (الميزان) لسورة (الاسراء) يقول : قوله تعالى: { ذرية من حملنا مع نوح إنه كان عبداً شكوراً } تطلق الذرية على الأولاد بعناية كونهم صغاراً ملحقين بآبائهم، وهي &#8211; على ما يهدي إليه السياق &#8211; منصوبة على الاختصاص ويفيد الاختصاص عناية خاصة من المتكلم به في حكمه فهو بمنزلة التعليل كقوله تعالى : { إنما يريد الله ليذهب عنكم الرجس أهل البيت }۔ [الأحزاب: 33] أي ليفعل بكم ذلك لأنكم أهل بيت النبوة۔<\/strong><\/p>\n<\/div>\n<\/div>\n<p>And<\/p>\n<div>\n<div>\n<p style=\"text-align: right;\"><strong>ويقول آيتهم العظمى جعفر مرتضى العاملي في كتابه (أهل البيت في آية التطهير &#8211; ص70) : واللام في «ليذهب» هي لام كي، وهي تفيد التعليل، أي أن ما بعدها يكون علة لما قبلها، كقولك: «جئت لأكرمك»؛ فمدخول اللام، وهو الإكرام، علة لما قبلها وهو المجيء۔<\/strong><br \/>\n<strong> فما ذكره البعض من أن متعلق الإرادة هو نفس إذهاب الرجس، ليس على ما يرام لا من حيث التركيب ولا من حيث المعنى حسبما أوضحناه۔<\/strong><\/p>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\">Therefore, in conclusion, we say that the second part of the verse [33:33] or Ayat al Tatheer cannot stand on its own without a previous context, unless the Shia think that the Arabs can begin with a consequential tool without having a context before it. Therefore the words <strong>&#8220;innama&#8230;..tat-heera&#8221;<\/strong> do not constitute an isolated parenthetical phrase, but rather are part of the general context of these Ayat.<\/p>\n<p style=\"text-align: center;\"><strong>&#8212; end &#8212;<\/strong><\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2610 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" alt=\"tatheer\" width=\"426\" height=\"179\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg 426w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah-300x126.jpg 300w\" sizes=\"auto, (max-width: 426px) 100vw, 426px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Ayat al Tatheer : A Separate Verse or a Part of a Verse? بسم الله الرحمن الرحيم الحمد لله نحمده و نستعينه و نستغفره و نسأله الهداية و حسن الخاتمة ربي اشرح لي صدري و يسر لي أمري واحلل عقدة <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/05\/03\/ayat-al-tatheer\/\" title=\"Ayat al Tatheer : An Isolated Verse or Not?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3818,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[],"class_list":{"0":"post-344","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/344","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=344"}],"version-history":[{"count":17,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/344\/revisions"}],"predecessor-version":[{"id":2701,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/344\/revisions\/2701"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3818"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=344"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=344"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=344"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}