{"id":3446,"date":"2016-10-21T16:19:35","date_gmt":"2016-10-21T16:19:35","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3446"},"modified":"2016-10-26T00:28:39","modified_gmt":"2016-10-26T00:28:39","slug":"abu-fadl-al-abbas-quest-for-water-at-karbala","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/10\/21\/abu-fadl-al-abbas-quest-for-water-at-karbala\/","title":{"rendered":"Abu Fadl Al-Abbas’ Quest for Water at Karbala"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3446\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">Abu Fadl Al-Abbas’ Quest for Water at Karbala<\/h1>\n<p style=\"text-align: justify;\">In this article, we decided to provide readers with the Shia narratives of Abu Fadl Al-Abbas’ Quest for water at Karbala.<\/p>\n<p style=\"text-align: justify;\">We have broken down the article as follows for the sake of clarity:<\/p>\n<ul style=\"text-align: justify;\">\n<li><strong>Karbala Sources for this Study<\/strong><\/li>\n<li><strong>Abu Fadl Al-Abbas at Karbala (“Improved” Version)<\/strong><\/li>\n<li><strong>Abu Fadl Al-Abbas at Karbala (Original Version)<\/strong><\/li>\n<li><strong>A Brief Analysis and Conclusion<\/strong><\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>Karbala Sources for this Study<\/strong><\/h2>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/scan0002-2\/\" rel=\"attachment wp-att-3443 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3443 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-150x150.jpg\" alt=\"abu fadl al-abbas\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Like our previous article on <a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/\" rel=\"external nofollow\">Muslim bin Aqeel<\/a>, we chose to rely upon the most authentic rendition of the martyrdom of Al-Hussain, which is known as Maqtal Al-Hussain by Abi Mikhnaf Lut bin Yahya. The edition that was relied upon was the Dar Al-Mahajjah Al-Baidha’ edition, which was edited and revised by Kamil Salman Al-Jburi. This edition was published in the year 2000.<\/p>\n<p style=\"text-align: justify;\">This previous work will be put beside the commonly distributed version of Maqtal Al-Hussain by Abi Mikhnaf Lut bin Yahya, which was published by Mu’asasat Al-A’alami, one of the biggest Shia publishing houses. This edition was published in the year 2007.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/scan0001-2\/\" rel=\"attachment wp-att-3442 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3442 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-150x150.jpg\" alt=\"karbala\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0001-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Even though it may seem as though we are studying the same book, it will become very clear soon enough that the work of Abi Mikhnaf Lut bin Yahya has been tampered with greatly. Kamil Al-Jburi has made this very clear in his introduction, in which he describes the commonly distributed version of Maqtal Al-Hussain to be inaccurately attributed to Lut bin Yahya. He does admit that there are many similarities as we will soon see below.<\/p>\n<p style=\"text-align: justify;\">Kamil Al-Jburi mentions that the original Maqtal Al-Hussain was preserved and quoted often by Al-Tabari, while the current version that has become widespread can be found in manuscript form in the Petersburg Library and only dates to the tenth century, which is pretty late compared to the former book.<\/p>\n<p style=\"text-align: justify;\">In regards to the authenticity of the report as per Shia standards, we can safely say that neither of the reports is authentic. The “improved” version cannot even be attributed to Abu Mikhnaf himself, while the original narration is the narration of Abi Mikhnaf from Sulayman bin Abi Rashid from Humaid bin Muslim. This narration is graded as weak in the eyes of Shias due to the anonymity of Sulayman. Refer to our article on Shia <a href=\"http:\/\/twelvershia.net\/2016\/10\/24\/history-karbala-study-sources\/\" rel=\"external nofollow\">sources of Karbala<\/a> for more.<\/p>\n<p style=\"text-align: justify;\">The purpose of the article is not to provide Shia readers with the authentic version of events, but rather, to show Shia readers how the work of Abu Mikhnaf was manipulated over time and greatly exaggerated.<\/p>\n<p style=\"text-align: justify;\">We have chosen to start off by providing readers with the commonly known “improved” version of Abu Mikhnaf’s narration before providing them with the original Abu Mikhnaf report.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Abu Fadl Al-Abbas at Karbala (“Improved” Version)<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf said (p. 106-p.111) :<\/p>\n<p style=\"text-align: justify;\">When the thirst became too much for Al-Hussain and his companions to handle, Al-Hussain (as) said to his brother Al-Abbas: O’ brother, bring your family and dig a well.<\/p>\n<p style=\"text-align: justify;\">They started to dig, but did not find any water. Al-Hussain (as) then said to Al-Abbas (as): O’ brother, head to the Euphrates and bring us some water. Al-Abbas responded: I hear you and obey.<\/p>\n<p style=\"text-align: justify;\">Al-Abbas (as) marched alongside his men on his right and left until they arrived at the Euphrates. The companions of Ibn Ziyad (la) saw him and asked: Who are you? They said: We are the companions of Al-Hussain (as). They said: What do you want? They replied: We have been overwhelmed by our thirst and the hardest thing for us is to see Al-Hussain (as) thirsty.<\/p>\n<p style=\"text-align: justify;\">When they heard this, they attacked them in one fell swoop, and Al-Abbas (as) and his companions started to attack them and killed some of their men. He then recited (poetry):<\/p>\n<p style=\"text-align: justify;\">I fight them with a guided head – Protecting the grandson of the Prophet Ahmad<\/p>\n<p style=\"text-align: justify;\">I strike them with a sword – Until they back away from fighting my master<\/p>\n<p style=\"text-align: justify;\">I am Al-Abbas the befriended – The son of Ali the one who has received satisfaction and aid<\/p>\n<p style=\"text-align: justify;\">He then attacked them and caused them to split to the right and the left. He killed some of their men, then recited:<\/p>\n<p style=\"text-align: justify;\">I do not fear death if it comes close – Until I am buried after meeting<\/p>\n<p style=\"text-align: justify;\">I protect with my soul the soul of the purified – I am patient and thankful for that meeting<\/p>\n<p style=\"text-align: justify;\">I strike the head and cause it to split – I am Al-Abbas who will cause a harsh meeting<\/p>\n<p style=\"text-align: justify;\">He arrived at the water and came down with a pouch which he filled. He then brought his hand down to drink, but then remembered the thirst of Al-Hussain (as). He then said: By Allah I will not taste water while my master Al-Hussain is thirsty. He then let the water flow away from his hand and left with the pouch on his back. He recited:<\/p>\n<p style=\"text-align: justify;\">O’ soul after (the death of) Al-Hussain you should not last – After him you should not stay<\/p>\n<p style=\"text-align: justify;\">How can Al-Hussain drink death – While you drink cold water?<\/p>\n<p style=\"text-align: justify;\">I could never do this for it is not an act of my religion – nor is it an act of a true believer<\/p>\n<p style=\"text-align: justify;\">He then returned from the water when he got sprayed with arrows until his shield looked like a hedgehog. Al-Abras bin Shayban hit him on the right hand, and it flew off while attached to a sword. He then took up his sword with his left hand and attacked the men while chanting:<\/p>\n<p style=\"text-align: justify;\">By Allah, even if you cut off my right – I will forever defend my religion<\/p>\n<p style=\"text-align: justify;\">And defend the true Imam – the grandson of the purified and trusted prophet<\/p>\n<p style=\"text-align: justify;\">A true prophet that came to us with my religion – entrusted by the trusted one<\/p>\n<p style=\"text-align: justify;\">He then attacked the men again and killed some of their men. He defeated their heroes while the pouch was on his back. When Ibn Sa’ad (la) saw him, he said: Shoot the pouch, for if Al-Hussain (as) drinks it, then he will kill all of you!<\/p>\n<p style=\"text-align: justify;\">They then attacked Al-Abbas heavily, but he killed a hundred and eighty of their knights. Then, Abdullah bin Yazeed Al-Shaybani struck his left hand and cut it off. He then clenched onto the sword with his teeth and started to attack them. He then chanted:<\/p>\n<p style=\"text-align: justify;\">O’ soul do not fear the disbelievers – And be happy with the news of the mercy of the Almighty<\/p>\n<p style=\"text-align: justify;\">To be with the Prophet, the master of the good – And with a group of the masters and the purified<\/p>\n<p style=\"text-align: justify;\">They cut off my left hand with their wickedness – so my Lord make them taste the heat of the fire<\/p>\n<p style=\"text-align: justify;\">He then attacked the men while his arms were leaking blood, and they attacked him together. He fought them heavily, and a man stuck him with a pole on his head which cut him and caused him to fall to the ground with his blood leaking.<\/p>\n<p style=\"text-align: justify;\">He then cried: Ya Aba Abdillah! Peace be to you!<\/p>\n<p style=\"text-align: justify;\">When Al-Hussain (as) heard his voice, he cried: O’ my brother! O’ my Abbas! O’ my heart!<\/p>\n<p style=\"text-align: justify;\">He then attacked the men and caused them to split away from him (Al-Abbas). He then carried him onto the back of his horse and entered his tent, put him down, and started crying heavily until everyone cried.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Abu Fadl Al-Abbas at Karbala (Original Version)<\/strong><\/h2>\n<p style=\"text-align: justify;\">Abu Mikhnaf (p. 143) said: Sulayman bin Abi Rashid told me: from Humaid bin Muslim:<\/p>\n<p style=\"text-align: justify;\">When the thirst became too extreme fro Al-Hussain to handle, he called for his brother Al-Abbas bin Ali. He then sent with him thirty men with horses and thirty footmen. He sent with him twenty pouches. They then got close to the water where Nafi’ bin Hilal Al-Jamali proceeded forward. Amr bin Al-Hajjaj asked: Who are you? He replied: Nafi’ bin Hilal. He said: Greetings my brother, what brings you here? He said: We came to drink from this water that you have blocked away from us. He replied: Drink up. He said: Nay, we shall not drink while Al-Hussain is thirsty. He replied: There is no chance that we will allow that, for we are placed here because we are to prevent you from the water.<\/p>\n<p style=\"text-align: justify;\">When his (Nafi’s) men came closer, he said to them: Fill your pouches.<\/p>\n<p style=\"text-align: justify;\">The men then entered towards the water and filled up their pouches. They then left. Amr bin Al-Hajjaj and his companions then struggled with them. Al-Abbas bin Ali and Nafi’ bin Hilal Al-Jamali then attacked them and backed them off. Then, they left and told their men to leave. The men then entered upon Al-Hussain with the pouches.<\/p>\n<h2 style=\"text-align: justify;\"><strong>A Brief Analysis and Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">As we can see from the above, <strong>the narrative that surrounds what occurred to Abu Al-Fadl Al-Abbas bin Ali at <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a> has been twisted severely<\/strong>. Nowhere in the original version of the events do we find Al-Abbas taking on massive numbers of troops, nor do we find him fighting large forces in a solo suicide mission. The original Abu Mikhnaf version of the reports do not include that he was even killed at the time, but rather, that he successfully is able to return to Al-Hussain with the pouches of water. This version of events are a lot more believable than the <a href=\"http:\/\/twelvershia.net\/2016\/10\/26\/battle-of-karbala-critical-study\/\" rel=\"external nofollow\">“improved” version<\/a> that suggests that Al-Abbas was able to defeat a hundred and eighty knights single-handedly (since his right arm was cut off at the time).<\/p>\n<p style=\"text-align: justify;\">So much from the “improved” version raises red flags. Not only are the details of the battle too vivid for it to be believable, but it is simply unacceptable to believe that all this poetry was preserved. Are we to believe that his wretched and accursed enemies were memorizing his battle hymns?! Perhaps the most obvious fabrication is that he was chanting lines of poetry while clenching the sword with his teeth. How could his enemies even make out what he was saying?! Let alone bother to document the poetry! Let us not forget that he attacked his foes with the sword between his teeth.<\/p>\n<p style=\"text-align: justify;\">It is very important for readers to be aware that the fabrications about Abu Fadl Al-Abbas do not end here. We have only provided a sample of the fabrications by providing two sources that are attributed to Abu Mikhnaf, only to give readers a little taste of how such falsehood develops. In recent times, much taller tales have been told about Abu Al-Fadl Al-Abbas. Murtadha Al-Mutahari, in 1969, in a group of lectures while speaking about such fabrications said, “Similar things are said concerning Hadrat Abu al-Fadl, that he killed twenty-five thousand men. I calculated that if one man were killed per second, it would require six days and fifty and odd hours to kill that many.” Refer to the <a href=\"https:\/\/www.al-islam.org\/al-tawhid\/vol13-no3\/ashura-misrepresentations-distortions-part-1-mutahhari\" rel=\"external nofollow\">al-islam.org article<\/a> for more on this topic by Al-Mutahari.<\/p>\n<p style=\"text-align: justify;\">In conclusion, we can only wish the best for the Shias that have been misguided into believing such tales. Truly, Abu Fadl Al-Abbas did not need such alterations to his history in order for him to be loved and respected. May Allah guide us all.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Abu Fadl Al-Abbas’ Quest for Water at Karbala In this article, we decided to provide readers with the Shia narratives of Abu Fadl Al-Abbas’ Quest for water at Karbala. We have broken down the article as follows for the sake <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/10\/21\/abu-fadl-al-abbas-quest-for-water-at-karbala\/\" title=\"Abu Fadl Al-Abbas’ Quest for Water at Karbala\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3881,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[24],"class_list":{"0":"post-3446","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"tag-karbala"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3446","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3446"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3446\/revisions"}],"predecessor-version":[{"id":3475,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3446\/revisions\/3475"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3881"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3446"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3446"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3446"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}