{"id":3466,"date":"2016-10-24T18:34:27","date_gmt":"2016-10-24T18:34:27","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3466"},"modified":"2016-10-24T18:36:27","modified_gmt":"2016-10-24T18:36:27","slug":"history-karbala-study-sources","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/10\/24\/history-karbala-study-sources\/","title":{"rendered":"History of Karbala &#8211; A Study of Sources"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3466\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\">History of Karbala &#8211; A Study of Sources<\/h1>\n<p style=\"text-align: justify;\">In our previous articles about certain events in the history of Karbala, we have taken a look at the major exaggerations that revolve around Muslim bin Aqeel, Abu Al-Fadl Al-Abbas, and Ali Al-Akbar. In this article, we will be taking a look at the source of exaggerations that played a role in shaping of the Shia view of the history of Karbala.<\/p>\n<p style=\"text-align: justify;\">In order to give the readers a clear view of what has led to these developments in the history of Karbala, we have split this article as follows:<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<ul style=\"text-align: justify;\">\n<li><strong>Abu Mikhnaf and his Role in Shaping the History of Karbala<\/strong>\n<ul>\n<li><strong>The Manuscripts of Maqtal Al-Hussain that have been attributed to Abi Mikhnaf<\/strong><\/li>\n<li><strong>The Published Editions of Maqtal Al-Hussain that has been attributed to Abi Mikhnaf<\/strong><\/li>\n<\/ul>\n<\/li>\n<li><strong>Introduction about the book Maqtal Al-Hussain<\/strong><\/li>\n<li><strong>Al-Jbouri’s Refutation to those that accept the commonly Distributed Book<\/strong><\/li>\n<li><strong>Abbas Al-Qummi View of the History of Karbala through Abu Mikhnaf<\/strong><\/li>\n<li><strong>Al-Nuri Al-Tabrasi’s View of the History of Karbala through Abu Mikhnaf<\/strong><\/li>\n<li><strong>Conclusion<\/strong><\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>Abu Mikhnaf and his Role in Shaping the History of Karbala<\/strong><\/h2>\n<p style=\"text-align: justify;\">It may come as a surprise to most Shias that the vast majority of their views comes through what revolves around one man. Abu Mikhnaf Lut bin Yahya, was a second century historian that documented the history of Karbala. However, his book did not survive and Shias had to rely on another book for the history of Karbala. Strangely, that other book is also attributed to Abu Mikhnaf, and his words are used by all modern lecturers and authors that have wrote about the history of Karbala.<\/p>\n<p style=\"text-align: justify;\">To give an idea to the readers as to how much this erroneous version has been circulated, we provided quotes from an expert on the topic of Karbala, the Shia historian Kamil Al-Jbouri:<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><strong>The Manuscripts of Maqtal Al-Hussain that have been attributed to Abi Mikhnaf<\/strong><\/h3>\n<p style=\"text-align: justify;\">Kamil Al-Jbouri states (p. 32-34):<\/p>\n<p style=\"text-align: justify;\">Maqtal Al-Hussain has many manuscripts that can be found in the storage facilities of the world. They can be found under titles like Maqtal Al-Hussain, or Akhbar Maqtal Al-Hussain, or Masra’ Al-Hussain, and similar titles. We shall name some of these for the sake of providing examples, not for the sake of naming all of the available manuscripts:<\/p>\n<p style=\"text-align: justify;\">1- A copy that was written in the year 988 Ah, which can be found in Petersburg under the number #1838, in 82 folios.<\/p>\n<p style=\"text-align: justify;\">2- Another copy which was written in the year 995 AH, in the Asian Museum in Berlin, in 111 folios.<\/p>\n<p style=\"text-align: justify;\">3- Another copy can be found from the 10th century AH \/ 16<sup>th<\/sup> century AD, though it is incomplete at the beginning and end, and can be found at Dar Al-Aathaar for manuscripts in Baghdad under the number #25768. It is 20.5&#215;12 in size and contains 11 lines per page. It is in 386 folios.<\/p>\n<p style=\"text-align: justify;\">4- Another copy was written in the year 1009 AH and can also be found in the Asian Museum in Berlin. It is registered under #9036 and can be found in 19 folios.<\/p>\n<p style=\"text-align: justify;\">5- Another copy is entitled “The History of the Maqtal of Abi Abdillah Al-Hussain – peace be onto him &#8211; ,” and it ends with the following: This is what has arrived us from the martyrdom of Al-Hussain. We have completed this on the twelfth of Thi Al-Q’ida. It was written by Ali bin Khalifa Al-Muqri, may Allah forgive them both. Amen.” It dates to the 11<sup>th<\/sup> century AH \/ 17<sup>th<\/sup> century AD, and can be found in a Russian library under 604 B.<\/p>\n<p style=\"text-align: justify;\">6- Another copy was written in the year 1149 AH. It is stored at the Tehran University under #684 and is in 254 folios.<\/p>\n<p style=\"text-align: justify;\">7- Another copy was written in 1222 AH \/ 1807 AD and is in Dar Al-Aathaar in Baghdad under #14102. It is 22.5&#215;16.5cm in size, [19] lines per page, and in 212 folios.<\/p>\n<p style=\"text-align: justify;\">8- Another copy was written in 1224 AH in the Asian Museum in Berlin under #9032 in 62 folios.<\/p>\n<p style=\"text-align: justify;\">9- Another copy was written in 1252 AH and can be found at Dar Al-Kutub in Egypt under #3192. The copy has a duplicate in Al-Imam Al-Hakeem Library in Najaf under #575.<\/p>\n<p style=\"text-align: justify;\">10- Another copy was written in 1263 AH and can be found in Al-Sayyed Mohammad Sa’eed Aal Thabit’s library in Karbala.<\/p>\n<p style=\"text-align: justify;\">11- Another copy was written by Musa Al-Hamoudi in the year 1264 AH \/ 1847 AD and can be found at the Dar Al-Aathaar in Baghdad under 1\/15354. It is 21.5&#215;15.5cm in size with 15 lines per page. It is in 140 folios.<\/p>\n<p style=\"text-align: justify;\">12- Another copy was written in 1370 AH \/ 1950 AD and can be found at the Dar Al-Aathaar in Baghdad under 24695. It is 21.5x17cm in size with 18 lines per page. It is in 72 folios.<\/p>\n<p style=\"text-align: justify;\">13- Another copy can be found in Al-Maktaba Al-Thahiriyyah with the name “Masra’ Al-Hussain which is attributed to Abi Mikhnaf” under #4303 in the history section. It is in 71 folios and they seem to be from the ninth century. It starts with: This is the martyrdom of Al-Hussain and what occurred to him and his family, including their deaths and captivity of their women. May Allah curse those that harmed them.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><strong>The Published Editions of Maqtal Al-Hussain that has been attributed to Abi Mikhnaf<\/strong><\/h3>\n<p style=\"text-align: justify;\">Kamil Al-Jbouri continues (p. 34-35):<\/p>\n<p style=\"text-align: justify;\">This book was published a number of times and can be found throughout the Islamic world. They are all very similar with minor differences. It was at times published as a separate book, while at other times published alongside other works.<\/p>\n<p style=\"text-align: justify;\">We shall name some of these for the sake of providing examples, not for the sake of naming all of the available publications:<\/p>\n<p style=\"text-align: justify;\">1- A lithography edition in 1287 AH, which was included inside Bihar Al-Anwar by Al-Alama Al-Majlisi.<\/p>\n<p style=\"text-align: justify;\">2- A lithography edition in 1301 AH.<\/p>\n<p style=\"text-align: justify;\">3- A lithography edition in Bombay 1311 AH, which was included in Al-Lahoof by Ali bin Musa bin Ja’afar bin Mohammad bin Tawus Al-Hasani. It was based on a copy from Ambrosiana. See Brockleman 1\/253.<\/p>\n<p style=\"text-align: justify;\">4- A copy within the end of Yanabee’ Al-Mawadda 2\/158-180 under the title: The 61<sup>st<\/sup> Chapter, the Inclusion of what is within the Book named Maqtal Abi Mikhnaf, which includes the martyrdom of Al-Hussain and his Companions.<\/p>\n<p style=\"text-align: justify;\">5- Published in Najaf 1343 AH.<\/p>\n<p style=\"text-align: justify;\">6- Published at the Haydariyya Publishing House in Najaf 1347 AH.<\/p>\n<p style=\"text-align: justify;\">7- Published in Bombay in India in the year 1349 AH.<\/p>\n<p style=\"text-align: justify;\">8- Published in the Ilmiyah Publishing House in Najaf in 146 pages in the year 1353 AH \/ 1934 AD.<\/p>\n<p style=\"text-align: justify;\">9- Published in Haydariyya Publishing House in Najaf in 144 pages in the year 1950 AH inside Al-Lahoof by Ibn Tawus.<\/p>\n<p style=\"text-align: justify;\">The book was also translated into German by Wustenfeld.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Introduction about the book Maqtal Al-Hussain<\/strong><\/h2>\n<p style=\"text-align: justify;\">Kamil Al-Jbouri (p. 30-32) of his edition of Maqtal Al-Hussain states:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/scan0002-2\/\" rel=\"attachment wp-att-3443 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3443 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-150x150.jpg\" alt=\"scan0002\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scan0002-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>The most famous person who has narrated what occurred at Al-Taff, as well as the scenes of great struggles and sacrifices, is Abu Mikhnaf Lut bin Yahya bin Sa’eed Al-Azdi Al-Kufi. He passed away in the year 157 AH. Most of the books of biographies and indexes have mentioned his book “Maqtal Al-Hussain”. Al-Najashi mentioned it in his book of biographies p. 245. Ibn Al-Nadeem mentioned it in his Fihrist p. 136. Al-Tusi mentioned it in his Fihrist p. 155. Yaqoot Al-Hamawi mentioned it in his Mu’jam Al-Udaba’ 17\/41. Ibn Shakir mentioned it in his Fawat Al-Wafiyaat 3\/225.<\/p>\n<p style=\"text-align: justify;\">The aforementioned book, Maqtal Al-Hussain – peace be onto him &#8211; , which was quoted by and relied upon by the great scholars of old is now lost. This is the case with the rest of his (Abu Mikhnaf’s) books. All that is left are fragments that can be found here and there in books of history and narrations.<\/p>\n<p style=\"text-align: justify;\">As for that which we find in front of us that has been attributed to him, then it is not by him. Not only that, but it is not by any of the relied upon historians. For it contains many narrations that Abu Mikhnaf had [no] idea about and are falsely attributed to the man. There are many that have lied upon him, which is evidence of his greatness.<\/p>\n<p style=\"text-align: justify;\">Evidences of this falsehood are that the language used is not the language of his times and it contains grammatical mistakes.<\/p>\n<p style=\"text-align: justify;\">If we were to assume that the origin of this narration is by Abi Mikhnaf, then the one that we find, which has been attributed to him, has gone through late revisions. These revisions of the text, with time led to more revisions, until the text became irrelevant to the author’s original. Though, some truth in it, and in some areas texts that have not changed, and this is the view of Wustenfeld when he studied the two texts which were popular at that time “Maqtal Al-Hussain” and “Al-Mukhtar Al-Thaqafi”.<\/p>\n<p style=\"text-align: justify;\">As for what has been documented by Al-Tabari about Maqtal Al-Hussain – peace be onto him &#8211; , in which he quotes from Abu Mikhnaf, and that what we find in this attributed book, we find that there is a similarity in both, especially in historical matters.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Al-Jbouri’s Refutation to those that accept the commonly Distributed Book<\/strong><\/h2>\n<p style=\"text-align: justify;\">He states (p. 35-36):<\/p>\n<p style=\"text-align: justify;\">I believe that Abu Mikhnaf has another book (other than the one that was mentioned above), which includes chains of narrators and is continuous in format. However, there were those that removed the chains of narrators to make it a lighter tale, one without chains. It had to have been different from the language that we find in this (commonly distributed) book. Then, the hands of tampering and copyist errors for a hold of it and gave us what we find today.<\/p>\n<p style=\"text-align: justify;\">In a serious attempt, I have gathered the narrations of Abi Mikhnaf that can be found in the early historical works and reorganized them, to be as closer to Abu Mikhnaf’s original work than what we find today. I have included titles under brackets like these [ ].<\/p>\n<p style=\"text-align: justify;\">I have also relied on Tareekh Al-Tabari as my main foundation and added onto it what I found in other works to fill in the gaps, or a narration that has come with some variance, or an addition, which were attributed to him (Abu Mikhnaf).<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<h3 style=\"text-align: justify;\"><span style=\"color: #993300;\"><strong>In order to provide readers with additional proof that the commonly distributed book does not belong to Abu Mikhnaf, we have provided the expert opinions of Abbas Al-Qummi and Al-Nuri Al-Tabrasi below.<\/strong><\/span><\/h3>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: justify;\"><strong>Abbas Al-Qummi View of the History of Karbala through Abu Mikhnaf<\/strong><\/h2>\n<p style=\"text-align: justify;\">He said in his book on the history of Karbala “Nafs Al-Mahmoom” p.11 while listing his sources for his book:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/?attachment_id=3463\" rel=\"attachment wp-att-3463 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3463 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0001-1-150x150.jpg\" alt=\"history of karbala\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0001-1-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0001-1-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0001-1-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0001-1-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>And (I quoted) from the Maqtal of Al-Kalbi through Tathkirat Al-Sibt and Tareekh Al-Tabari. <strong>And (I quoted) from Maqtal Abi Mikhnaf from Al-Tabari. <\/strong>I would also refer to Al-Sayyid Ibn Tawus (may Allah have mercy on him) by Al-Sayyid. I would refer to Ibn Al-Atheer Al-Jazari as Al-Jazari. I would refer to Mohammad bin Jareer Al-Tabari as Al-Tabari. I would refer to Abu Mikhnaf as Al-Azdi.<\/p>\n<p style=\"text-align: justify;\">I refer to the last person in that way, without using his (known) nickname for a reason. I did this so that mind would not assume that it is what has been published within the tenth volume of Bihar Al-Anwar. It has become clear to me that this is not the book of the known Abi Mikhnaf. Abu Mikhnaf is Lut bin Yahya bin Sa’eed bin Mikhnaf Al-Azdi Al-Ghamdi. He was a shaikh and a leader from amongt those of historical knowledge in Kufa. His narrations are relied upon and he narrates from Ja’afar bin Mohamamd Al-Sadiq – salutations be upon him &#8211; . His father was a companion of the Commander of the Believers, Al-Hasan, and Al-Hussain – peace be onto them &#8211; . Abu Mikhnaf has a lot of books, one of which is Maqtal Al-Hussain, which is quoted and relied upon by the great scholars of old. Those that review Tareekh Al-Tabari will realize that what he quotes from Maqtal Al-Hussain – peace be upon him – was mostly taken from Maqtal Abi Mikhnaf. <strong>Then, if we compare this attributed copy to him and the one that was quoted by Al-Tabari and other historians, we would realize that it is not by him (Abu Mikhnaf), nor is it by any of the relied upon historians. Due to this, I do not rely on this book when the information is exclusive to it.<\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>Al-Nuri Al-Tabrasi’s View of the History of Karbala through Abu Mikhnaf<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Nuri said in his Al-Lu’lu’ wal Marjan p. 187:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/?attachment_id=3462\" rel=\"attachment wp-att-3462 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3462 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0002-150x150.jpg\" alt=\"scanz0002\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0002-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0002-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0002-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/10\/Scanz0002-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Abu Mikhnaf Lut bin Yahya is one of the great hadithists and relied upon historians. His book “Maqtal Al-Hussain” is of the most reliable works due to the reliance of our great scholars from it along with his other works. Sadly, the original and correct version of the work does not exist. <strong>What we have is a version that has been attributed to him and it includes rejected views that go against the foundations of the school, which were added in by enemies or those that are ignorant, for some false goals. Due to this, Maqtal Al-Hussain is a book that is not reliable <\/strong>when it contains exclusive information that cannot be trusted, which is why we do not accept the story that Ahl Al-Bayt went to Karbala on the fortieth day, even though a similar statement can be found in Al-Lahoof.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">The commonly distributed version of Maqtal Al-Hussain, that Shias have been listening to and reading, is a falsely attributed version. The common Shia view of the history of Karbala has been distorted due to this. The correct version of Maqtal Al-Hussain can be found in earlier works like that of Al-Tabari and early historians.<\/p>\n<p style=\"text-align: justify;\">For more on the history of <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a>, refer to our original piece on the topic.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>History of Karbala &#8211; A Study of Sources In our previous articles about certain events in the history of Karbala, we have taken a look at the major exaggerations that revolve around Muslim bin Aqeel, Abu Al-Fadl Al-Abbas, and Ali <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/10\/24\/history-karbala-study-sources\/\" title=\"History of Karbala &#8211; A Study of Sources\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3820,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[24],"class_list":{"0":"post-3466","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"tag-karbala"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3466","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3466"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3466\/revisions"}],"predecessor-version":[{"id":3469,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3466\/revisions\/3469"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3820"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3466"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3466"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3466"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}