{"id":3489,"date":"2016-11-05T15:07:32","date_gmt":"2016-11-05T15:07:32","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3489"},"modified":"2016-11-05T15:07:32","modified_gmt":"2016-11-05T15:07:32","slug":"sunni-version-martyrdom-al-hussain","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/11\/05\/sunni-version-martyrdom-al-hussain\/","title":{"rendered":"Sunnis Version of the Martyrdom of Al-Hussain"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3489\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\"><strong>Sunnis Version of the Martyrdom of Al-Hussain<\/strong><\/h1>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">The following is a translation of Husain bin Abdulrahman’s retelling of the events of Karbala, from the story of <a href=\"http:\/\/twelvershia.net\/2016\/10\/20\/muslim-bin-aqeel-case-study-fabrication-karbala-narrative\/\" rel=\"external nofollow\">Muslim bin Aqeel<\/a> in Kufa to the very martyrdom of Al-Hussain in Karbala. The narration can be found in Tareekh Al-Tabari 3\/1028 through two chains provided by Al-Tabari. Al-Tabari’s first chain is weak due to the weakness of the narrator known as Abu Rabi’a, however, the second chain that he uses is authentic. Both chains lead up to one narration by Husain bin Abdulrahman. However, the first chain has a couple of additions that cannot be accepted as authentic. These additions are the conversations between Ibn Ziyad and his victims and Ibn Ziyad’s calling out to the knights for support. The rest of the narration is authentic and we have decided to include it with the additions to provide a better flow for the narration.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>The Death of Hani&#8217; bin Urwa<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Tabari said: Al-Husain bin Nasr narrated to me: Abu Rabi’a narrated to us, he said: Abu Awana narrated to us, from Ḥusain bin Abd Al-Rahman, he said: We were told that Al-Ḥusain…<\/p>\n<p style=\"text-align: justify;\">(Al-Tabari said:) and Mohammad bin Ammar Al-Razi said: Sa’id bin Sulaiman told us: Abbad bin Awwam told us that Ḥusain said: The people of Kufa wrote to Al-Husain bin Ali: “There are a hundred thousand on your side.” He sent to them Muslim bin Aqeel, who entered Kufa, then into the house of Hani’ bin Urwa, where the people gathered to him. Ibn Ziyad was then told of this.<\/p>\n<p style=\"text-align: justify;\">Al-Husain bin Nasr added in his narration: He then sent for Hani’, who came. He asked: “Didn’t I respect you? Wasn’t I generous with you? Didn’t I do such and such?” He said: “Yes.” He said: “How do you pay me back for that?” He said: “I pay you back by withholding from you.” He said: “You withhold from me?!” He said: He then took a cane and beat him, then he had him tied up, then he had him killed. Word of that arrived to Muslim bin Aqeel and he moved onwards with a large group of people. Word got to Ibn Ziyad, who ordered the gates of the palace to be closed, he then called out: “Forward! O’ knights of Allah!” Nobody responded to him, though it was thought that he had many people with him.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>The Death of Muslim bin Aqeel<\/strong><\/h2>\n<p style=\"text-align: justify;\">Ḥusain said: Hilal bin Yasaaf told me:<\/p>\n<p style=\"text-align: justify;\">I met them at night at the Masjid of the Ansar. Every time they passed by a road, towards the left or the right, a group of them around thirty or forty or so, would retreat. He (Hilal) said: When they arrived by the market, at that dark night, they entered the mosque. It was said to Ibn Ziyad: “By Allah, we do not see nor hear many people.” He then ordered that the roof of the mosque be ripped open. It was then ripped open. He then ordered them to carry sticks with fires lit upon them. They entered and saw around fifty men.<\/p>\n<p style=\"text-align: justify;\">He (Hilal) said: He entered and climbed the pulpit and said: “Split into fours!” They obeyed and split into fours, each of them to a leader of their own little group. Then, a group came and attacked them and Muslim was hurt badly. Some of his men were killed and they were defeated.<\/p>\n<p style=\"text-align: justify;\">Muslim left and entered a house that was owned by one of the Kinda tribe. A man came to Mohammad bin Al-Ash’ath while he was with Ibn Ziyad, he whispered to him: “Muslim is at the house of so and so.” Ibn Ziyad asked: “What did he say?” He said: “Muslim is at the house of so and so.” Ibn Ziyad said to two men: “Bring him to me.” They entered upon him while he was with a woman that had lit him a fire as he washed his wounds. They said: “The governor calls upon you.” He said: “I want a promise (of safety).” They said: “We don’t have that authority.” He then left with them until they reached (Ibn Ziyad), where he was tied up. He then said: “Tell me something, dead man…”<\/p>\n<p style=\"text-align: justify;\">Al-Husain added in his narration: “You son of a so and so! You have come to strip away my power?!”<\/p>\n<p style=\"text-align: justify;\">He was then put to death.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Al-Hussain is Surrounded<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Tabari narrated using his previous chain from Husain: Hilal bin Yasaaf told me:<\/p>\n<p style=\"text-align: justify;\">Ibn Ziyad ordered to not let anyone in or out of the roads between Waqisa to the path of Al-Sham to the path of Basra. Al-Ḥusain came by without noticing until he saw a group of Bedouins. He asked and they replied: “We have no idea except that we cannot enter or exist.” He (Hilal) said: He then headed towards Al-Sham, towards Yazeed. The horses obstructed him at Karbala. He beseeched them by Allah and Islam. He (Hilal) said: ‘Umar bin Sa’ad, Shimr bin Thi Al-Jawshan and Husain bin Numair were sent to him, and Al-Ḥusain beseeched them by Allah and Islam to allow him to go to the Commander of the Believers and to put his hand onto his. They said: “No, Ibn Ziyad gets to decide what to do with you.”<\/p>\n<p style=\"text-align: justify;\">Amongst them, upon a horse, was Al-Ḥurr bin Yazeed Al-Ḥanthali Al-Nahshali. When he heard them say this to Al-Ḥusain he said: “Don’t you accept from these men what they propose?! If the Turks and the Daylam requested this, it would have been impermissible to reject them!” They would not step down without the decision of Ibn Ziyad. Al-Hurr then turned his horse and headed towards Al-Ḥusain and his companions. They thought he was going to attack them. When he arrived close, he flipped over his shield, saluted them, then blasted towards the men of Ibn Ziyad and attacked them. He killed two of them, and was then killed, may Allah have mercy upon him.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>The Battle<\/strong><\/h2>\n<p style=\"text-align: justify;\">Al-Tabari reported, using the previous chain to Husain: Sa’ad bin ‘Ubaida narrated to me:<\/p>\n<p style=\"text-align: justify;\">Some elderly men from the people of Kufa were upon a hill crying. They were saying: “O’ Allah, grant victory (to Al-Husain).” I (Sa’ad) said: “O’ enemies of Allah! Why don’t you come down and support him?!” He (Sa’ad) said: Al-Husain approached to speak to a messenger of Ibn Ziyad. He said: I saw him wearing a black cloak. He then spoke and then left. Then, a man from Bani Tameem, Amr Al-Tuhawi, struck him with an arrow. I saw that arrow stuck between his shoulders on his cloak. They continued to reject him and he left back to his men.<\/p>\n<p style=\"text-align: justify;\">I saw them and they were around a hundred men, from the children of ‘Ali bin Abi Talib were five, and from Bani Hashim were sixteen, one from Bani Sulaim, an ally, and a man from Bani Kinana, an ally, and Ibn Omar bin Ziyad.<\/p>\n<p style=\"text-align: justify;\">Al-Tabari narrated using his previous chain from Al-Husain, he said: Sa’ad bin Ubaida told me:<\/p>\n<p style=\"text-align: justify;\">We were stationed within the water with Omar bin Sa’ad when a man whispered to him and said: “Ibn Ziyad sent Juwayria bin Badr Al-Tamimi and ordered him to kill you if you do not fight those men.” He (Sa’ad) said: He then got onto his horse, called for his gear, wore it, and then strode onwards with his men to battle. The head of Al-Husain was brought to Ibn Ziyad and placed between his hands. He then tapped it with his cane and said: “O’ Abu ‘Abdullah, you have grown some grey hairs.”<\/p>\n<p style=\"text-align: justify;\">He (Sa’ad) said: His women, daughters, and family were brought in, and the best thing that he (Ibn Ziyad) did was that he isolated them, and provided them with an amount (of money) and some clothing. He said: Then two of the younger sons of Abdullah bin Ja’afar, or the son of the son of Ja’afar, came towards a man from Tay’, they came towards him and he killed them, and then he brought their heads to be placed in front of Ibn Ziyad. He (Sa’ad) said: He (Ibn Ziyad) considered killing him (for this action), but ultimately ordered his house to be destroyed.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>How Al-Hussain was Martyred<\/strong><\/h2>\n<p style=\"text-align: justify;\">As for the very manner of which Al-Hussain was killed, we find an acceptable report that can be found in Mu’jam Al-Tabarani 2\/704.<\/p>\n<p style=\"text-align: justify;\">Al-Tabarani narrated: Mohammad bin Uthman bin Abi Shayba told us: Furat bin Mahboob told us: Abu Bakr bin Ayyash told us: Aslam Al-Manqari told me: I entered upon Al-Hajjaj, then Sinan bin Anas, the killer of Al-Ḥusain, entered. He was an elderly dark man, with henna, a long nose, and discoloration on his face. He stood towards Al-Hajjaj and Al-Hajjaj looked at him. He said: “Are you the killer of Al-Husain?” He said: “Yes.” He said: “How did you do it?” He said: “I rammed my spear into him and cut him up with my sword.” Al-Ḥajjaj said: “You will not be united with him in one abode (in the afterlife).”<\/p>\n<p style=\"text-align: justify;\">This narration is the most authentic narration about how Al-Ḥusain was killed, and it has a decent chain. Al-Furat bin Mahboob is an acceptable narrator. Refer to Ilal Al-Daraqutni 1\/218. As for Moḥammad bin Uthman bin Abi Shayba, there seems to be a difference of opinion as to whether he should be accepted or not as a reliable narrator, though it seems that he is acceptable as Al-Mu’allimi has concluded in his Tankil 1\/460-462 after he proved that most of the criticisms against him come from the path of Ibn ‘Uqda, who is accused of fabricating hadiths.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">We would like to point out that even though the amount of information regarding the events of <a href=\"http:\/\/twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\" rel=\"external nofollow\">Karbala<\/a> are not too detailed in Sunni sources, we can at least rest assured that the material is indeed authentic, as opposed to the material found in Shia sources, which is based upon disconnected reports that anyone can make up as well as anonymous narrators.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Sunnis Version of the Martyrdom of Al-Hussain &nbsp; The following is a translation of Husain bin Abdulrahman’s retelling of the events of Karbala, from the story of Muslim bin Aqeel in Kufa to the very martyrdom of Al-Hussain in Karbala. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/11\/05\/sunni-version-martyrdom-al-hussain\/\" title=\"Sunnis Version of the Martyrdom of Al-Hussain\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3820,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[24],"class_list":{"0":"post-3489","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"tag-karbala"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3489","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3489"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3489\/revisions"}],"predecessor-version":[{"id":3490,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3489\/revisions\/3490"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3820"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3489"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3489"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3489"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}