{"id":3494,"date":"2016-11-08T16:44:04","date_gmt":"2016-11-08T16:44:04","guid":{"rendered":"http:\/\/twelvershia.net\/?p=3494"},"modified":"2017-10-03T20:41:24","modified_gmt":"2017-10-03T20:41:24","slug":"shia-azan-examined","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2016\/11\/08\/shia-azan-examined\/","title":{"rendered":"Shia Azan Examined"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3494\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\"><\/h1>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/11\/08\/shia-azan-examined\/84704a2d6c444e00b8c24fe8201ebde5\/\" rel=\"attachment wp-att-3495 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3495 alignright\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/11\/84704a2d6c444e00b8c24fe8201ebde5-150x150.jpg\" alt=\"shia azan\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/84704a2d6c444e00b8c24fe8201ebde5-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/84704a2d6c444e00b8c24fe8201ebde5-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/84704a2d6c444e00b8c24fe8201ebde5-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a> In this article we examine the concept of the Shia Azan. Even though it is now a common practice in Shia mosques, there was once a time in which Shia Azan’s did not include, “I testify that Ali is the Wali of Allah.”<\/p>\n<p style=\"text-align: justify;\">Below, we will be listing the evidences against this false azan. We also took a look at Shia material online on this topic and decided to deal with some allegation by <a href=\"http:\/\/www.shiapen.com\/fiqh\/ali-un-wali-allah\/adhan-call-to-prayers.html\" rel=\"external nofollow\">Shiapen<\/a> regarding the Sunni Azan.<\/p>\n<ul style=\"text-align: justify;\">\n<li>The Intellect VS the Shia Azan<\/li>\n<li>The Opinion of Al-Saduq regarding the Shia Azan<\/li>\n<li>Tathweeb (Prayer is better than Sleep \/ Al-Salatu Khairun min Al-Nawm)<\/li>\n<li>Hayya Ala Khair-il-Amal<\/li>\n<li>Conclusion<\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\">The Intellect VS the Shia Azan<\/h2>\n<p style=\"text-align: justify;\">It is known by Ahlul Sunnah that the call to prayer was established by the Prophet – peace be upon him &#8211; , and it is false to add anything onto it. Many Shias will agree with this view, though they may expand it to include the Imams. However, they will be surprised that there are no narrations in which the Imams instructed the people to add the words “I testify that Ali is the Wali of Allah,” into the Azan.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2016\/11\/08\/shia-azan-examined\/minaret-cc-dbking-p\/\" rel=\"attachment wp-att-3496 external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3496 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2016\/11\/minaret-cc-dbking-p-150x150.jpg\" alt=\"minaret-cc-dbking-p\" width=\"150\" height=\"150\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/minaret-cc-dbking-p-150x150.jpg 150w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/minaret-cc-dbking-p-250x250.jpg 250w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/minaret-cc-dbking-p-62x62.jpg 62w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2016\/11\/minaret-cc-dbking-p-184x184.jpg 184w\" sizes=\"auto, (max-width: 150px) 100vw, 150px\" \/><\/a>Shias may argue that Ali truly is the Wali of Allah, and therefore, it is permissible to add his name into the Azan. Our response to that is that even though a matter is true, it does not make it permissible to add it to the Azan. If the Prophet – peace be upon him – and the Twelve Imams did not think of adding it, then why do modern Shias feel that they know better?<\/p>\n<p style=\"text-align: justify;\">Also, if the argument is as simple as: “One can add any true testimony into the azan”, then why not recite the following into the azan as well?<\/p>\n<h3 style=\"text-align: justify;\"><strong>Below, we propose a new Shia azan:<\/strong><\/h3>\n<ol style=\"text-align: justify;\">\n<li>I testify that Ali is the Wali of Allah. (twice)<\/li>\n<li>I testify that Al-Hasan bin Ali is the Wali of Allah. (twice)<\/li>\n<li>I testify that Al-Hussain bin Ali is the Wali of Allah. (twice)<\/li>\n<li>I testify that Ali bin Al-Hussain is the Wali of Allah. (twice)<\/li>\n<li>I testify that Mohammad bin Ali is the Wali of Allah. (twice).<\/li>\n<li>I testify that Ja’afar bin Mohammad is the Wali of Allah. (twice)<\/li>\n<li>I testify that Musa bin Ja’afar is the Wali of Allah. (twice)<\/li>\n<li>I testify that Ali bin Musa is the Wali of Allah. (twice)<\/li>\n<li>I testify that Mohammad bin Ali is the Wali of Allah. (twice)<\/li>\n<li>I testify that Ali bin Mohammad is the Wali of Allah. (twice)<\/li>\n<li>I testify that Al-Hasan bin Ali is the Wali of Allah. (twice)<\/li>\n<li>I testify that Mohammad bin Al-Hasan Al-Mahdi is the Wali of Allah. (twice)<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">Why stop there though? Why not also bare witness that Adam is a prophet of Allah? Let us not forget Nuh, Ibrahim, Musa, and Eisa. There are around twenty other prophets mentioned by name in the Qur’an, and they should be added to according to this flawed Shia logic.<\/p>\n<p style=\"text-align: justify;\">Inshallah we have made our point. The Azan is not the practice that should be changed by the whims of men and societies. It is legislated by Allah and should not be tampered with. Tampering with the call to prayer is a very obvious innovation.<\/p>\n<h2 style=\"text-align: justify;\">The Opinion of Al-Saduq regarding the Shia Azan<\/h2>\n<p style=\"text-align: justify;\">One of the most outspoken scholars against the Shia Azan was Ibn Babawayh Al-Saduq. He said in his Man La Yahtharhu Al-Faqeeh 1\/137, one of the main four Shia books, after quoting a hadith that <u>does not<\/u> include the addition of “I testify that Ali is the Wali of Allah”:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">This is the authentic azan. Nothing should be added or removed from it. <strong>As for the <em>mufawidha<\/em><\/strong>, may Allah curse them, they fabricated narrations and added to the Azan, “Mohammad and family of Mohammad are the best of creation,” twice. In some narrations, after “I testify that Mohammad is the messenger of Allah,” <strong>they added, “I testify that Ali is the Wali of Allah,” twice. <\/strong>Some also narrated, “I testify that Ali, truly the Commander of the Believers, is the Wali of Allah.,” twice. There is no doubt that Ali is the Wali of Allah, and that he is the Commander of the Believers truly, and that Mohammad and his family are the best of the creation, but this is not a part of the Azan.<\/p>\n<p style=\"text-align: justify;\"><strong>I mentioned this so that it would be known that this is the Azan of the <em>muwafidha<\/em>, those that have falsely made themselves appear to be from us.<\/strong><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h3 style=\"text-align: justify;\">Who are the <em>Mufawidha?<\/em><\/h3>\n<p style=\"text-align: justify;\">For the readers that are unaware, the <em>mufawidha<\/em> are an ancient group of Shias that believed that Allah gave His powers to the “infallibles” and gave them full control of the universe.<\/p>\n<p style=\"text-align: justify;\">Al-Nawbakhti in his Firaq Al-Shia (p. 61) states: “As for those that believe in <em>tafweedh<\/em>, they believed that the Eternal One gave one person, who is complete, without addition or subtraction, the control (of all things) and the ability to create. This person is Mohammad, Ali, Fatima, Al-Hasan, Al-Hussain, and the rest of the Imams.”<\/p>\n<p style=\"text-align: justify;\">He continues (p. 61): “(They believe that) Mohammad created the heavens, the earth, the mountains, man, <em>jinn<\/em>, and the whole world.”<\/p>\n<p style=\"text-align: justify;\">These people, O’ Shias, are the people that invented the addition of “I testify that Ali is the Wali of Allah,” so cease from imitating these polytheists, and turn their backs on this innovative Shia Azan.<\/p>\n<h2 style=\"text-align: justify;\">Tathweeb (Prayer is better than Sleep \/ Al-Salatu Khairun min Al-Nawm)<\/h2>\n<p style=\"text-align: justify;\">Even though the issue of Tathweeb has nothing to do with the Shia Azan, Shias often bring it up to suggest that Sunnis are innovators. Firstly, there is not a single authentic report in which Tathweeb was invented by Omar. Shiapen provided narrations from Tawus (106), Malik (179 AH), Omar bin Hafs (from the Atba’ Al-Tabi’een) to suggest that this invention occurred during the time of Omar. Without even looking into the chains of narrations to these men, we find that all of these reports are disconnected.<\/p>\n<p style=\"text-align: justify;\">Ironically, we find Tathweeb in Shia sources, like Al-Istibsaar 1\/228 and Wasa’il Al-Shia 5\/425, in multiple hadiths from the Imams. Even though Al-Tusi and Al-Hur Al-Amili suggested that these narrations are <em>taqiyyah<\/em>, we find that Tathweeb was accepted by Ibn Al-Junaid, who was one of the leading Shia early scholars of <em>fiqh<\/em>. See Al-Duroos Al-Shar’eeya by Al-Shaheed Al-Awal (p. 162). Ibn Al-Junaid clearly did not believe that this was an innovation of Omar. If he did, then he wouldn’t have deemed this addition to the call to prayer as permissible.<\/p>\n<p style=\"text-align: justify;\">It is very important to be aware of the distinction between both cases. Tathweeb is based upon narrations that have been attributed to the Prophet – peace be upon him – in works like Sunan Abi Dawud, Al-Tirmithi, Al-Nasa’ee, and Ibn Majah. The Shia Azan though, is based on a reaction against Sunnism, for Shias know that the Imams did not teach it.<\/p>\n<h2 style=\"text-align: justify;\">Hayya Ala Khair-il-Amal<\/h2>\n<p style=\"text-align: justify;\">Shias sometimes quote narrations from Sunni books in order to substantiate their claims to the addition of: Hayya ‘Ala Khair-il-‘amal. The narrations that are often quoted are from Ibn Abi Shaybah’s Musannaf 1\/195-196 from Ali bin Al-Hussain Zain Al-Abideen and Ibn Omar.<\/p>\n<p style=\"text-align: justify;\">The first narration from Ali Zain Al-Abideen shows him calling to prayer. Al-Baqir narrates, “During the call, after reaching: Hayya ‘ala Al-Falaah, he would say: Hayya ‘ala khair-il-amal. He’d say: This is the <strong>first Azan<\/strong>.”<\/p>\n<p style=\"text-align: justify;\">Shias, due to their preconceptions, assume that what is meant is that this was in the original Azan, but that it was removed by Sunnis, namely Omar. However, we do not believe that this is the case. The apparent meaning is that this is the first Azan of Fajr. The opinion of the existence of two Azans for Fajr is held by the majority of Ahlul Sunnah, and is held by Malik, Al-Shafi’ee, Al-Awza’ee, Ahmad, Ishaq, and Abu Thawr. See Al-Awsat by Ibn Al-Munthir 3\/162.<\/p>\n<p style=\"text-align: justify;\">This is supported by Ibn Omar’s narration in Mushkil Athar Al-Tahawi #5308, in which Nafi’ narrates that he used to say in the <strong>first Azan<\/strong>: Al-Salatu khairun min al-Nawm, after Al-Falaah.<\/p>\n<p style=\"text-align: justify;\">This is also supported by the narration that Shias often quote from Ibn Omar as well, from Ibn Abi Shaybah. Nafi’ narrated from Ibn Omar that he used to say in his prayer, “Al-Salatu khairun min al-nawm (prayer is better than sleep),” or maybe he would say, “Hayya ‘ala khair-il-‘amal.”<\/p>\n<p style=\"text-align: justify;\">This supporting narration by Ibn Omar clearly shows that he would interchange between the two wordings. The wording used here clearly supports the view that Ali Zain Al-Abideen used to say, “Hayya ‘ala khair-il-‘amal,” during the first Fajr Azan only, unlike the Shias who say it during all Azans.<\/p>\n<h2 style=\"text-align: justify;\">Conclusion<\/h2>\n<p style=\"text-align: justify;\">In the context of what we have established and with the last point in mind, Shias may ask: Why not add ““Hayya ‘ala khair-il-‘amal” to your Fajr Azan then? The answer is simple. The <em>shari’ah<\/em> to us is not based on the actions of Ibn Omar or Zain Al-Abideen. Rather, we are followers of Mohammad – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">Sunni practices are not based on their reactions to others sects. Their practices are not based upon what appeals to their biases. Unsurprisingly, Sunnis are following the Qur’an and Sunnah down to the letter.<\/p>\n<p style=\"text-align: justify;\">So, once again, we call our intelligent Shia readers to turn their backs on the Shia Azan and to accept the Azan of the Prophet – peace be upon him – , which can be found exclusively in the Sunni sources, from his <em>mu’azzins<\/em> Bilal and Abu Mahthoora, may Allah be pleased with them both.<\/p>\n<p>For more on prayers, refer to our article on<a href=\"http:\/\/www.twelvershia.net\/2017\/05\/30\/taraweeh-prayer-evil-bidah-blessed-sunnah\/\"> Taraweeh.<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In this article we examine the concept of the Shia Azan. Even though it is now a common practice in Shia mosques, there was once a time in which Shia Azan’s did not include, “I testify that Ali is the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2016\/11\/08\/shia-azan-examined\/\" title=\"Shia Azan Examined\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3495,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,12],"tags":[],"class_list":{"0":"post-3494","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3494","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3494"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3494\/revisions"}],"predecessor-version":[{"id":4192,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3494\/revisions\/4192"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3495"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3494"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3494"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3494"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}