{"id":3639,"date":"2017-01-19T19:35:49","date_gmt":"2017-01-19T19:35:49","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=3639"},"modified":"2017-01-27T20:59:19","modified_gmt":"2017-01-27T20:59:19","slug":"calamity-thursday-content-will","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/01\/19\/calamity-thursday-content-will\/","title":{"rendered":"Calamity of Thursday (Content of the Will)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3639\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: justify;\"><span style=\"color: #000000;\">Calamity of Thursday (Content of the Will)<\/span><\/h1>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">In this two part article, we will be taking a look at one of the most common allegations brought up by Shias in polemical discussions. The “Calamity of Thursday” (Raziyyat Al-Khamees), referred to by many as the Pen and Paper incident, has been abused as the bread and butter of such discussions for a long time. In this portion of the article, we will be examining the question of the content of the will. In the next section, we will be looking into the actions of the Companions on that day and what their actions entail. Even though the two arguments stem from one hadith, we have chosen to divide our response into two sections since these are two separate lines of argumentation.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>The text of the narration:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Ibn Abbas narrated:<\/span><\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">When Allah&#8217;s Messenger – peace be upon him &#8211; was on his death-bed and in the house there were some people among whom was `Umar bin Al-Khattab, the Prophet – peace be upon him &#8211; said, &#8220;Come, let me write for you a statement after which you will not go astray.&#8221; `Umar said, &#8220;The Prophet – peace be upon him &#8211; is seriously ill and you have the Qur&#8217;an; so the Book of Allah is enough for us.&#8221; The people present in the house differed and quarreled. Some said &#8220;Go near so that the Prophet – peace be upon him &#8211; may write for you a statement after which you will not go astray,&#8221; while the others said as `Umar said. When they caused a hue and cry before the Prophet, Allah&#8217;s Messenger – peace be upon him &#8211;  said, &#8220;Go away!&#8221; Narrated &#8216;Ubaidullah: Ibn `Abbas used to say, &#8220;It was very unfortunate that Allah&#8217;s Messenger – peace be upon him &#8211; was prevented from writing that statement for them because of their disagreement and noise.&#8221; (Saheeh Al-Bukhari #4432)<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">In this topic, we will be taking a deep look at the following aspects and sections of the “Calamity of Thursday”:<\/span><\/p>\n<ul>\n<li style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Assumptions Regarding the Will<\/strong><\/span><\/li>\n<\/ul>\n<ul>\n<li style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Were the Companions Aware of a Clear Appointment for Ali?<\/strong><\/span><\/li>\n<\/ul>\n<ul>\n<li style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Ibn Abbas’ Comments on the Appointment<\/strong><\/span><\/li>\n<\/ul>\n<ul>\n<li style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>The Sunni Perspective of the Will’s Content<\/strong><\/span><\/li>\n<\/ul>\n<ul>\n<li style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Conclusion<\/strong><\/span><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Assumptions Regarding the Will<\/strong><\/span><\/h2>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">The main issue with the Shia perspective of the Calamity of Thursday hadith is the sheer amount of baseless speculation. According to the Shia narrative, two main unfounded assumptions are made. The first is that the Prophet – peace be upon him – wanted to appoint Ali as his successor. The second is that the Companions knew of the Prophet’s – peace be upon him – intentions. However, nowhere in the narration do we find clear cut evidences that this was the case. The assumptions are based on Shia preconceptions and the hesitation of the Companions in writing the will.<\/span><\/p>\n<h2 style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Were the Companions Aware of a Clear Appointment for Ali?<\/strong><\/span><\/h2>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Ironically, Hadith Al-Ghadeer is perhaps the greatest evidence that both assumptions are flawed. Firstly, if Hadith Al-Ghadeer was indeed an appointment of Ali, then there is no reason to even write a will. <strong>Surely, a statement of appointment by the Prophet – peace be upon him – in front of over ten thousand of his Companions, has much more weight than a written document.<\/strong> As we all know, documents can be forged, while the testimony of ten thousand eye-witnesses cannot be rejected under any circumstances. It makes absolutely no sense to put it in writing when such an appointment has already been established. It makes even less sense to assume that the Companions assumed that the will was about the appointment of Ali, since such an appointment was allegedly already made publicly, as per the Shia claim.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">The only way to even argue that the Calamity of Thursday was about the appointment of Ali is by suggesting that the Companions did not understand the event at Al-Ghadeer to be an appointment, which is the Sunni point of view.<\/span><\/p>\n<h2 style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Ibn Abbas’ Comments on the Appointment<\/strong><\/span><\/h2>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">It is furthermore ironic that the very person that has narrated this narration is completely oblivious to the preconceptions and claims of the Shias. As it is historically recorded, Ibn Abbas was one of Ali’s closest allies. Not only did Ali have him lead battalions during wars, but he also had him in charge of Basra and the pilgrimage in the year 37 AH. (See Tareekh Khalifa bin Khayyat for example) <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Ibn Abbas, in the very narration that is quoted above, is describing the misfortune of the “Calamity of Thursday” since he does not know what the Prophet – peace be upon him – wanted to dictate.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Ibn Abbas does narrate some of the other orders that the Prophet – peace be upon him – made before his death (Saheeh Muslim #1637). These do not include anything about an appointment of Ali. It is also clear from Ibn Abbas’ reactions that what the Prophet – peace be upon him &#8211; wanted to be written down was different from the other orders that Ibn Abbas narrated:<\/span><\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">He said, &#8220;Turn the pagans out of the &#8216;Arabian Peninsula; respect and give gifts to the foreign delegations as you have seen me dealing with them.&#8221;<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">If Ibn Abbas knew of the Prophet’s – peace be upon him &#8211; intentions he would not have been saddened, nor would he have continuously display his allegiance to Abu Bakr and Omar who allegedly robbed Ali of his position.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">He also narrates as we find in Saheeh Al-Bukhari (#4447):<\/span><\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">`Ali bin Abi Talib came out of the house of Allah&#8217;s Messenger – peace be upon him –  during his fatal illness. The people asked, &#8220;O Abu Hasan (i.e. `Ali)! How is the health of Allah&#8217;s Messenger – peace be upon him –  this morning?&#8221; `Ali replied, <strong>&#8220;He has recovered with the Grace of Allah.&#8221;<\/strong> `Abbas bin `Abdul Muttalib held him by the hand and said to him, &#8220;In three days you, by Allah, will be ruled (by somebody else ), And by Allah, I feel that Allah&#8217;s Apostle will die from this ailment of his, for I know how the faces of the offspring of `Abdul Muttalib look at the time of their death. So let us go to Allah&#8217;s Messenger – peace be upon him – and ask him who will take over the Caliphate. If it is given to us we will know as to it, and if it is given to somebody else, we will inform him so that he may tell the new ruler to take care of us.&#8221; `Ali said, &#8220;By Allah, if we asked Allah&#8217;s Apostle for it (i.e. the Caliphate) and he denied it us, the people will never give it to us after that. And by Allah, I will not ask Allah&#8217;s Messenger – peace be upon him – for it.&#8221;<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">The above narration does not only display that Ibn Abbas was oblivious to what the Prophet – peace be upon him – intended in his will, but that Ali and Al-Abbas were also oblivious.<\/span><\/p>\n<h2 style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>The Sunni Perspective of the Will’s Content<\/strong><\/span><\/h2>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Sunnis do not hold the position that the writing of the will was an obligation upon the Prophet – peace be upon him &#8211; . If it were an obligation, the Prophet – peace be upon him – would have written the will whether the Companions liked it or not. He wouldn’t have punished the whole Ummah for the mistakes of a few men. Even in the hadith of Ibn Abbas, only a group of the Companions acted in this manner, while the rest wanted the will to be written down immediately.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Moreover, the Prophet – peace be upon him – told the Companions to leave on Thursday, but passed away four days later on Monday (Al-Bukhari #1205). He had ample time to write the will. In that time, he instead told the Muslims to give gifts to foreign delegations and to remove the pagans from the peninsula, as per the hadith of Ibn Abbas that we have previously quoted. In another hadith, as per the narration of Abdullah bin Abi Awfa, he orders the Muslims to hold onto the book of Allah (Saheeh Al-Bukhari #2740). <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">Even though we are certain that no will was written, we do find in Saheeh Muslim #2387 a narration that gives us an idea of what he – peace be upon him – intended to write:<\/span><\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">A&#8217;isha reported that Allah&#8217;s Messenger – peace be upon him &#8211; in his (last) illness asked me to call Abu Bakr, her father, and her brother too, so that he might write a document, for he feared that someone else might be desirous (of succeeding him) and that some claimant may say:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&#8220;I have better claim to it, whereas Allah and the Faithful do not substantiate the claim of anyone but that of Abu Bakr.&#8221;<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">In response to the likely Shia argument that A’isha fabricated this report, we can only appeal to those of sound minds by pointing out that A’isha denied that the Prophet – peace be upon him – didn’t appoint anyone in the end (Saheeh Al-Bukhari #2741). She did not believe that he &#8211; peace be upon him &#8211; appointed Ali or Abu Bakr.<\/span><\/p>\n<h2 style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Conclusion<\/strong><\/span><\/h2>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">We would like readers to also be aware that the <strong>Calamity of Thursday event is <span style=\"text-decoration: underline;\">not authentic<\/span> in Shia sources<\/strong>, however, Shias accept it simply because it supports their views. <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">The average Shias will of course reject our evidences and narrations as Sunni propaganda. However, we would like to remind them that we are bound by our sources in the same way that they are bound by their sources. Sunnis cannot simply accept portions of narrations while ignoring the complete historical context through other narrations. Remember, the Sunni view is based on an understanding of the complete picture through the authentic sources. <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">For those curious as to why the Sunnis don’t reject their own hadith compilations in their first place and adhere to the Shia narrative, we would like to redirect readers to <a style=\"color: #000000;\" href=\"http:\/\/www.twelvershia.net\/2014\/06\/02\/shia-hadith-vs-sunni-hadith\/\">our articles on the subject.<\/a><\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Calamity of Thursday (Content of the Will) In this two part article, we will be taking a look at one of the most common allegations brought up by Shias in polemical discussions. The “Calamity of Thursday” (Raziyyat Al-Khamees), referred to <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/01\/19\/calamity-thursday-content-will\/\" title=\"Calamity of Thursday (Content of the Will)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3849,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5,14],"tags":[48],"class_list":{"0":"post-3639","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah","8":"category-popular-topics","9":"tag-imamate"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3639","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3639"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3639\/revisions"}],"predecessor-version":[{"id":3688,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3639\/revisions\/3688"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3849"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3639"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3639"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3639"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}