{"id":3859,"date":"2017-02-17T03:44:20","date_gmt":"2017-02-17T03:44:20","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=3859"},"modified":"2018-02-19T06:04:39","modified_gmt":"2018-02-19T06:04:39","slug":"book-saqifah-shura","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/02\/17\/book-saqifah-shura\/","title":{"rendered":"Book: Saqifah &#038; Shura"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3859\" alt=\"\" \/><\/p>\n<h1 style=\"text-align: center;\"><strong>Kitab-ul-Saqifah wal-Shura by Hani al-Tarabulsi<\/strong><\/h1>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_2.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-3861\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_2.jpg\" alt=\"\" width=\"660\" height=\"424\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_2.jpg 660w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_2-300x193.jpg 300w\" sizes=\"auto, (max-width: 660px) 100vw, 660px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>NOTE:<\/strong> We have done extensive reviews for this book and we will be making it available at online e-book stores starting June 2017.<\/span><\/p>\n<p style=\"text-align: justify;\"><em>(Scroll to the bottom of this page to download this document which combines two books &#8220;Kitab-ul-Saqifah&#8221; and &#8220;Kitab-ul-Shura&#8221;.)<\/em><\/p>\n<p style=\"text-align: justify;\">Humanity strived throughout the ages to develop an ideal way of selecting leaders to govern its affairs. A number of modern nations decided that every citizen can cast his vote in a box thus producing a leader selected by the majority in a democratic process. Some thinkers found that the rule of the elites or philosophers was best, because the fate of the nation cannot be entrusted to commoners and laymen. Others believed that certain higher races or designated bloodlines may rule over all others to avoid future chaos or bloody power struggles. However, we came to learn from humanity’s experience that all methods and systems developed by man are flawed and imperfect. Indeed, the most perfect form of government we ever reached is one where a divinely chosen individual guided by God rules over the subjects and decides for them, this system is recognized by humanity as “The Prophethood”.<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #008000;\">{Muhammad is naught but a Messenger; Messengers have passed away before him. Why, if he should die or is slain, will you turn about on your heels? If any man should turn about on his heels, he will not harm God in any way; and God will recompense the thankful} [3:144]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">God decreed that prophethood must end with the passing of the seal of prophets, Muhammad son of `Abdullah peace be upon him, in the 11th year of Hijrah (632 AD). It is commonly believed by researchers and followers of Muslim faith that God chose no other divine individual after Muhammad (saw) nor was a specific system of government enforced upon mankind by the good Lord. The last Prophet (saw) left his disciples and followers with the clear message and broad guidelines of the Holy Book in addition to much advice and wisdom from his Sunnah. Thus, humanity would strive once again, based on the teachings of their holy Book and the instructions and guidance of their Prophet (saw) to establish a strong and prosperous state of justice that pleases both mankind and their Almighty Creator.<\/p>\n<p style=\"text-align: justify;\">Abu Bakr bin abi Quhafah, also known as al-Siddiq, was the first Muslim leader to assume authority after prophethood concluded and the first to be referred to as “Khalifah” or “Successor” by the Muslims of the Arabian Peninsula. This book we present to you dear reader is a detailed account of this man’s story and how he came to be the head of the earliest Islamic government, what were the obstacles to his ascension and the consequences it created.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_1.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-3860\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_1.jpg\" alt=\"\" width=\"660\" height=\"480\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_1.jpg 660w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa_1-300x218.jpg 300w\" sizes=\"auto, (max-width: 660px) 100vw, 660px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">The historical event in which Abu Bakr acquired the Bay`ah (pledge of allegiance) is known as “al-Saqifah” in reference to a location called “Saqifat bani Sa`idah”. A Saqifah is a wide structure with a roof and closed walls from three sides. The fourth side (often northern) is open with some pillars while the roofing is made from tree branches and palm leaves then covered with clay. The function of this structure is to serve as a gathering place for tribesmen, where they can discuss matters of concern or just to socialize and bond. The famous Saqifah we speak of is located in Madinah, on the north-western side of the prophetic mosque between the gardens and houses of the children of Sa`idah, a Khazraji tribe.<\/p>\n<p style=\"text-align: justify;\">Even though this may be just another history book, know that I have placed great efforts to compile a unique and solid piece, filled with benefits and knowledge that the average English reader cannot acquire from any other contemporary books that touch on this subject. We’ve been blessed in modern times with unlimited access to digital and traditional libraries so praise be to God who made our job easier than that of our ancestors. Through this blessing, we have been able to review some of the major historical works -In the English tongue- covering this period by contemporary Sunni scholars (e.g `Ali Muhammad al-Sallabi) or contemporary Shia scholars (e.g Rasul Ja`fariyan). Unfortunately, what we found in these English books concerning the story of successorship was rather disappointing and this was either due to sectarian biases, a twisted methodology or simply lack of research. The reader can easily get a hold of such books in our days, then compare our material to theirs in order to see a vast difference in details, explanations and the richness of historical texts included therein.<\/p>\n<p style=\"text-align: justify;\">This book contains a story, told by the people who witnessed certain events and recorded them, using their own words and expressions. I merely collected their words and narrations then stitched them together; It was more of a collage in this sense where parts of people’s narrations and accounts are combined and merged into one full story that is easy to read and understand. This means that none of the material below is written by the pen of the author rather they are texts that are gathered and arranged in chronological order for the benefit of the reader. The original Arabic wording as well as all resources have been provided to make the job of the researchers easier in case they wish to return to the original books or study the chains. Returning to the ancient Arabic books is recommended for all those who can, since after reading them the researcher will almost certainly reach the same conclusions we listed at the end of our book.<\/p>\n<p style=\"text-align: justify;\">What prompted me to write a book on the subject was the common person’s ignorance concerning the matter, generally whether Sunni or Shia. I’ve seen laypeople from both groups come up with fascinating tales and unrealistic stories that have no historical basis whatsoever. Although I knew that this was mainly due to the fact that people today decided to abandon books and literature in order to provide for their families or simply to indulge themselves in worldly pleasures, yet the biggest shock came from people who did in fact read but were still unfamiliar with the real events that took place in those days.<\/p>\n<p style=\"text-align: justify;\">The simplistic stories propagated by both teams often miss their marks and below I briefly provide the most common narratives so that readers may later reflect on how wrong both versions are and how far Muslims have strayed from the original narrative of the ancient books.<\/p>\n<p style=\"text-align: justify;\">The typical Sunni story goes like this: The Companions planned a gathering where they all discussed and unanimously agreed on Abu Bakr as the best and worthiest leader among them without objections.<\/p>\n<p style=\"text-align: justify;\">On the other hand, the typical Shia story goes the opposite direction: The Companions were evil scoundrels who rushed to conspire and usurp `Ali’s divine right, robbing him of his inheritance then tying him up and murdering his wife and kid.<\/p>\n<p style=\"text-align: justify;\">Our methodology was to return to the majority of available early history books. We chose the most popular and widespread books written by major historians and scholars of Hadith taking into special account the earliest of sources. Secondly, we collected all accounts related to the event of Saqifah from all scholars and historians and went through all of it numerous times in order to familiarize ourselves with the variations and differences. Thirdly, we organized various chapters for our story and placed each historical text in its rightful chapter so that we have a chronological flow of events. Fourthly, we researched the main authentic chains and narrations for this event since doing so was critical for the following reason: If we do not rely on the authentic narrations to construct a skeleton for our story, then we will cause ourselves great confusion due to many conflicts in events and contradicting accounts. Let’s offer some examples to clarify:<\/p>\n<p style=\"text-align: justify;\">In all authentic and most numerous historical accounts we find `Ali praising Abu Bakr and adhering to his command. Therefore, we cannot include as part of our story some odd tale about how Abu Bakr ordered `Ali’s house to be burned to the ground and that his family be put to death then at the same time include `Ali’s praise for Abu Bakr two paragraphs below it unless A- `Ali has a split personality disorder or B- `Ali is lying to save his life. We do not have any evidence the man was mentally ill and we have mass-transmitted and authentic texts proving his courage and fearlessness especially in the face of rulers and opponents, so the only logical conclusion is that the story is a lie. The narration of the house burning (also referred to as “the broken rib”) in the form that is propagated by Shia today conflicts with most events in all major historical sources as well as the authentic reports so it is dismissed as a fabrication by `Ali’s Shia.<\/p>\n<p style=\"text-align: justify;\">Another example is a narration stating that `Ali, upon hearing that Abu Bakr is receiving allegiance in the mosque, hurries outside of his house that he forgets to button his shirt in order to not miss giving Abu Bakr a pledge. This report also conflicts with the authentic narrations and the majority of historical accounts that clearly state `Ali did not attend the gathering at the mosque and was upset at Abu Bakr for not informing Banu Hashim of this matter. This type of story is dismissed as a fabrication by Abu Bakr’s Shia or those of Banu Umayyah or Banu `Abbas. In brief, the expertise of a compiler enables him to distinguish between sectarian fabrications by extremists with political motives and what is a legitimate and reasonable report without even scrutinizing the chains. This is a skill only attainable after much reading and research into the books of various Islamic sects.<\/p>\n<p style=\"text-align: justify;\">Another example is, the narratives recorded by the popular historian Sayf bin `Umar al-Tamimi who writes that al-`Abbas was the first man informed of the Ansar’s meeting at Saqifah and so he ordered Abu Bakr to go there and resolve the situation. This cannot be included in our story as it conflicts with plenty of reports that declare that `Umar was the first man to hear; `Umar then only informed Abu Bakr so the Hashemites were upset for not being consulted according to authentic traditions. All in all, a study of all the main historical sources and connected narrations helps in detecting odd stories and lies added by storytellers throughout the ages.<\/p>\n<p style=\"text-align: justify;\">After gathering all texts, arranging them in chapters and eliminating any anomalous fabrications and repetitions, the next step was to connect as many texts as possible to create one contiguous story instead of separated narrations with many chains as that will make the events harder to follow and turn this into a traditional book of Hadith instead. With God’s help, we managed to piece all of the narrations together in a unique way that we hope pleases God and our readers.<\/p>\n<p style=\"text-align: justify;\">The book will contain the Arabic texts extracted from the various reports, sometimes even the names of the main narrators to help understand who is narrating the story. All the texts below are simply merged narrations and rarely do we find words from the original historians or by the author of this piece. Adding my own explanations and commentary was unavoidable even though the reader is free to dismiss them; Whatever clarification or comments I make will be minimal and preceded with the words “I say”.<\/p>\n<p style=\"text-align: justify;\">Click this link to purchase our book:<\/p>\n<p style=\"text-align: justify;\"><strong><a href=\"https:\/\/www.amazon.com\/dp\/B071XDHSWG\/\" rel=\"external nofollow\">Islamic leadership after Muhammad (peace be upon him) Amazon Kindle Edition<\/a> [Simple text document, best viewed by Kindle devices &#8211; English Only] (price $4.99)<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong><a href=\"https:\/\/www.smashwords.com\/books\/view\/730541\" rel=\"external nofollow\">Islamic leadership after Muhammad (peace be upon him) Smashwords Edition<\/a> [PDF version, organized and accessible &#8211; contains English &amp; Arabic texts] (price $5.99)<\/strong><\/p>\n<p>Or download free from<a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2018\/02\/Kitab-ul-Saqifah-wal-Shura-Hani.pdf\"> (HERE)<\/a>.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4076\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa.jpg\" alt=\"Saqifah\" width=\"334\" height=\"500\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa.jpg 334w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/02\/Saqifa-200x300.jpg 200w\" sizes=\"auto, (max-width: 334px) 100vw, 334px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The book of Saqifah and Shura or Kitab-ul-Saqifah wal-Shura. What prompted me to write this book was the common person’s ignorance concerning the matter, generally whether Sunni or Shia. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/02\/17\/book-saqifah-shura\/\" title=\"Book: Saqifah &#038; Shura\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3923,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10,5],"tags":[],"class_list":{"0":"post-3859","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-books","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3859","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3859"}],"version-history":[{"count":15,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3859\/revisions"}],"predecessor-version":[{"id":4323,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3859\/revisions\/4323"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3923"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3859"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3859"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3859"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}