{"id":3924,"date":"2017-02-27T21:12:00","date_gmt":"2017-02-27T21:12:00","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=3924"},"modified":"2017-02-28T22:12:10","modified_gmt":"2017-02-28T22:12:10","slug":"al-husayn-confronts-ruler-reclaim-property","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/02\/27\/al-husayn-confronts-ruler-reclaim-property\/","title":{"rendered":"Al-Husayn confronts the ruler to reclaim his property"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3924\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Peace be up our dear readers, in this article we have a very important story to share that touches on several sensitive topics such as Taqiyyah, Fadak and Imamah.<\/p>\n<p style=\"text-align: justify;\">Twelvers claim the Caliphs usurped the rights of Ahlul-Bayt and stole the lands of Fadak and more importantly the divine leadership. Thus they accuse every Caliph after the Prophet (saw) of being an evil thief who oppressed Ahlul-Bayt.<\/p>\n<p style=\"text-align: justify;\">Ahlul-Sunnah say, if these evil Imams stole the rights of Ahlul-Bayt then why didn&#8217;t the heads of Ahlul-Bayt retrieve these stolen properties when they themselves became Imams? It is commonly known historically that neither `Ali nor al-Hasan or any of the others reversed the judgement of the &#8220;oppressors&#8221; and reclaimed Fadak.<\/p>\n<p style=\"text-align: justify;\">To counter this obvious contradiction, the Shia invented a narration and placed it in their books. The authentic Shia tradition states that: &#8220;We Ahlul-Bayt do not take back anything which was taken away from us unjustly or through oppression.&#8221; [`Ilal al-Shara&#8217;i` by al-Saduq]<\/p>\n<p style=\"text-align: justify;\">Now if this sounds fishy or nonsensical to you, then you have every right to feel this way since the only reason they fabricated this is to be the excuse for why the Hashemites never reclaimed their &#8220;stolen properties.&#8221;<\/p>\n<p style=\"text-align: justify;\">This however, is a lie because the fabricators were not familiar with Islamic history nor the stories and character of the heads of the Hashemite household. Below, we will quote a Sahih Hadith from one of the earliest Islamic sources and prophetic-biography the Seerah of Ibn Ishaq.<\/p>\n<p style=\"text-align: justify;\">There was an alliance between certain clans in Makkah called &#8220;Al-Fudul&#8221;. Those who formed this alliance are Banu Hashim, Banu al-Muttalib, Taym bin Murrah, Asad and Zuhrah who all gathered in the house of Ibn Jud`an. They agreed to stand up and support any resident or guest in their city if he faces oppression until they get their rights back. The Qurashi tribe called their alliance Hilf-ul-Fudul.<\/p>\n<p style=\"text-align: right;\">قال ابن إسحاق : وحدثني يزيد بن عبد الله بن أسامة بن الهادي الليثي أن محمد بن إبراهيم بن الحارث التيمي حدثه : أنه كان بين الحسين بن علي بن أبي طالب رضي الله عنهما ، وبين الوليد بن عتبة بن أبي سفيان والوليد يومئذ أمير على المدينة أمره عليها عمه معاوية  بن أبي سفيان رضي الله عنه منازعة في مال كان بينهما بذي المروة . فكان الوليد تحامل على الحسين رضي الله عنه في حقه لسلطانه ، فقال له الحسين : أحلف بالله لتنصفني من حقي أو لآخذن سيفي ، ثم لأقومن في مسجد رسول الله صلى الله عليه وسلم ، ثم لأدعون بحلف الفضول . قال : فقال عبد الله بن الزبير ، وهو عند الوليد حين قال الحسين رضي الله عنه ما قال : وأنا أحلف بالله لئن دعا به لآخذن سيفي ، ثم لأقومن معه حتى ينصف من حقه أو نموت جميعا . قال : فبلغت المسور بن مخرمة بن نوفل الزهري ، فقال مثل ذلك وبلغت عبد الرحمن بن عثمان بن عبيد الله التيمي فقال مثل ذلك . فلما بلغ ذلك الوليد بن عتبة أنصف الحسين من حقه حتى رضي<\/p>\n<p style=\"text-align: justify;\">[Ibn Ishaq said: I was told by Yazid bin `Abdullah bin Usamah bin al-Hadi al-Laythi that Muhammad bin Ibrahim bin al-Harith al-Taymi told him: After Mu`awiyah appointed his nephew al-Walid bin `Utbah as governor of al-Madinah, there was a dispute between al-Walid and al-Husayn bin `Ali concerning some property in Dhi-Marwah. Al-Walid had abused his authority to push al-Husayn away from his right so al-Husayn told him: &#8220;By God, either you rule with justice or I shall carry my sword to the Prophet&#8217;s (saw) Masjid and call on the alliance of al-Fudul!&#8221; `Abdullah bin al-Zubayr who was also present said: &#8220;I too swear, that if al-Husayn calls on us then I shall raise my sword until he gets justice or we all die.&#8221; The news reached al-Miswar bin Makhramah and `Abdul-Rahman bin `Uthman bin `Ubaydullah al-Taymi so they both said the same. Upon this, al-Walid bin `Utbah backed-away then gave al-Husayn his property.]<\/p>\n<p style=\"text-align: justify;\">Basically, al-Husayn&#8217;s right was usurped by the governor al-Walid during Mu`awiyah&#8217;s reign. Instead of acting like a weirdo such as in Shia narrations, we find al-Husayn acting the way anybody who read his biography expects. He called on his allies and threatened to bring back his stolen land even if by force so the governor returned it.<\/p>\n<p style=\"text-align: justify;\">The reason we bring this up, is because Sunni and Shia historians all agree that Fadak was not in possession of Banu Hashim at the time. Shia claim it was stolen property, so why didn&#8217;t al-Husayn rebel with the sword and reclaim Fadak for himself and his relatives? Was that random property in Dhul-Marwah more valuable than Fadak that he wished to die in its defense? In the same context, why not raise the sword to return the Khilafah to banu Hashim?<\/p>\n<p style=\"text-align: justify;\">The answer is, Husayn viewed al-Walid&#8217;s action as an act of transgression so he stood up for truth. On the other hand, Husayn and his family respected the Ijtihad of the first three Caliphs when it comes to Fadak and accepted their final verdict.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Peace be up our dear readers, in this article we have a very important story to share that touches on several sensitive topics such as Taqiyyah, Fadak and Imamah. Twelvers claim the Caliphs usurped the rights of Ahlul-Bayt and stole <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/02\/27\/al-husayn-confronts-ruler-reclaim-property\/\" title=\"Al-Husayn confronts the ruler to reclaim his property\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12,1],"tags":[],"class_list":{"0":"post-3924","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3924","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3924"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3924\/revisions"}],"predecessor-version":[{"id":3931,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3924\/revisions\/3931"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3924"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3924"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3924"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}