{"id":3935,"date":"2017-03-07T22:48:30","date_gmt":"2017-03-07T22:48:30","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=3935"},"modified":"2017-03-08T20:28:13","modified_gmt":"2017-03-08T20:28:13","slug":"signs-prophethood-shiasm","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/03\/07\/signs-prophethood-shiasm\/","title":{"rendered":"Signs of Prophethood in Shiasm"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3935\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<p style=\"text-align: justify;\">It is often noticed that most converts to Islam end up as Sunnis by default. It is very rare for a convert to embrace Shiasm directly due to several reasons. The most obvious, is that those that come from a Christian background find the strict monotheism of Sunnism as the greatest appeal. They convert to Islam to escape polytheism. Shias, in many cases, display forms of polytheism in the way that they venerate Ahlulbayt. This can be found in variant forms and levels, from the calling of a dead Imam for sustenance, to the belief that the Imams have the ability to control all the atoms in the universe (<em>à la<\/em> <a href=\"twelvershia.net\/2016\/01\/23\/evidence-that-kamal-al-haydari-is-a-mushrik\/\">Kamal Al-Haydari).<\/a><\/p>\n<p style=\"text-align: justify;\">Another key aspect that is often neglected is the lack of focus by Shiasm in the field of providing evidences for the prophethood of Mohammad – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">The Sunni books that have focused on this obligation are plenty and are well known. Various early Sunni scholars have written books with the name Dala’il Al-Nubuwwa (Evidences of Prophethood), including Abu Nu’aym Al-Asbahani, Al-Mustaghfiri, Al-Bayhaqi, Qawwam Al-Sunnah, and Ibn Taymiyyah. Meanwhile, Shias are not known for their efforts in the field. Rather, their focus was on the call to the Imamate of Ali and his progeny instead. Off the top of my head, the works of Ali ibn Babawayh, Al-Karajiki, Al-Khazzaz Al-Qummi, and Hashim Al-Bahrani come to mind. I struggle to recall any works by Twelvers in which the focus was to provide evidence of the prophethood of Mohammad – peace be upon him &#8211; . Knowledgeable Shias reading this know that I am telling the truth and will probably start googling for books on this subject after reading this article.<\/p>\n<p style=\"text-align: justify;\">A question that comes to mind is: Why haven’t the Shias focused on the evidence of prophethood?<\/p>\n<p style=\"text-align: justify;\">The answer is simple. Shiasm does not have anything going for it when it comes to the call to Mohammad  &#8211; peace be upon him &#8211; . In fact, Shia beliefs about the Prophet – peace be upon him – often contradict the very matters that appeal to non-Muslims. Below, we shall include a shortlist of these beliefs:<\/p>\n<ul>\n<li style=\"text-align: justify;\">Shia Belief #1: The Prophet – peace be upon him – could Read and Write<\/li>\n<li style=\"text-align: justify;\">Shia Belief #2: The Prophet – peace be upon him – Spoke all Languages<\/li>\n<li style=\"text-align: justify;\">Shia Belief #3: The Rights of Ahlulbayt in Leadership.<\/li>\n<li style=\"text-align: justify;\">Shia Belief #4: The Rights of Ahlulbayt in Wealth.<\/li>\n<li style=\"text-align: justify;\">Shia Belief #5: The Apostasy of the Closest Companions of the Prophet – peace be upon him –<\/li>\n<li style=\"text-align: justify;\">Shia Belief #6: The Signs of Prophethood come Exclusively from Ahlulbayt<\/li>\n<li style=\"text-align: justify;\">Conclusion<\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>Shia Belief #1: The Prophet – peace be upon him – could Read<\/strong><\/h2>\n<p style=\"text-align: justify;\">It is very common for Sunnis that do da’awah to non-Muslims to emphasize that the Prophet – peace be upon him – brought forth the majestic Qur’an without the ability to read or write. There is no doubt the dictation, organization, and distribution of the text, without the ability to read or write is within itself a sign that he – peace be upon him &#8211; was indeed a prophet from Allah.<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Say, [O Muhammad], &#8220;O mankind, indeed I am the Messenger of Allah to you all, [from Him] to whom belongs the dominion of the heavens and the earth. There is no deity except Him; He gives life and causes death.&#8221; So believe in Allah and His Messenger, the unlettered prophet, who believes in Allah and His words, and follow him that you may be guided. (Al-A’araf: 158)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">However, Shias propagate that this is untrue.<\/p>\n<p style=\"text-align: justify;\">Al-Saduq, in his Ilal Al-Shara’i’ Chapter 105 Hadith #6 quotes Ja’afar Al-Sadiq with an authentic chain, according to Shia standards, that the Prophet – peace be upon him – knew how to read.<\/p>\n<p style=\"text-align: justify;\">The ability to read actually puts the Prophet – peace be upon him &#8211; in a superior position to the rest of the illiterate Arabs. A non-Muslim is left concerned that the Prophet – peace be upon him – may have used his knowledge to trick the ignorant Arabs into falling for his call.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Shia Belief #2: The Prophet – peace be upon him – Spoke all Languages<\/strong><\/h2>\n<p style=\"text-align: justify;\">This belief is perhaps even more problematic that the previous belief since one of the clear evidences of the prophethood of Mohammad – peace be upon him &#8211;  is that he would provide accurate descriptions of the history of the previous prophets without having access to their language or scripture.<\/p>\n<p style=\"text-align: justify;\">We find in Surat Al-Nahl 106 Allah saying:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“And We certainly know that they say, ‘It is only a human being who teaches the Prophet.’ The tongue of the one they refer to is foreign, and this Qur&#8217;an is [in] a clear Arabic language.”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">This is evidence that the pagans accused the Prophet – peace be upon him – of having access through a foreigner taught him the ancient texts. However, according to Shiasm, the Prophet – peace be upon him – had knowledge of Hebrew, Syriac, Aramaic, and all ancient tongues. This too causes non-Muslims to have doubts about the prophethood of Mohammed – peace be upon him – since it could be argued that he used his knowledge of these tongues to gain access to the ancient texts which he built Islam upon.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Image-6.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-thumbnail wp-image-3937\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Image-6-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Image-11.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignright size-thumbnail wp-image-3938\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Image-11-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>Al-Kulayni narrates in an authentic chain according to Al-Majlisi in Mir’aat Al-Uqool in the Chapter of the Birth of Al-Hasan bin Ali that the Imams speak seventy million languages. This of course includes the Prophet – peace be upon him – in Shia belief.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ffffff;\">&#8211;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ffffff;\">&#8211;<\/span><\/p>\n<h2 style=\"text-align: justify;\"><\/h2>\n<h2 style=\"text-align: justify;\">Shia Belief #3: The Rights of Ahlulbayt in Leadership<\/h2>\n<p style=\"text-align: justify;\">Sunnis believe the Prophet – peace be upon him – left the people to choose freely and select those most suited for position of leadership. However, Shia beliefs completely contradict the above. Shias believe that the Prophet – peace be upon him – legislated that <u>only<\/u> his progeny may rule the Muslims, thus establishing a monarchy until the end of time. They narrate many reports in their books affirming `Ali&#8217;s designation as political successor.<\/p>\n<p style=\"text-align: justify;\">The Prophet – peace be upon him – was not a king nor did he claim to be one. He was a spiritual guide and the sole leader of the Muslim community, yet we do not believe that he chose his daughter&#8217;s husband who also happens to be his cousin as leader of all humanity. Restricting the leadership to his own progeny is a major turn-off and an act that would be viewed with suspicion by many non-Muslims.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\">Shia Belief #4: The Rights of Ahlulbayt in Wealth<\/h2>\n<p style=\"text-align: justify;\">There is no doubt that the Prophet – peace be upon him – lived an ascetic life. All Muslims hold the belief that the Prophet – peace be upon him – blocked any chance of accusations by non-Muslims that would inevitably accuse him of fabricating this message for monetary gain by living a simple lifestyle. In the process, he put his own family through the same modest and un-materialistic lifestyle he adopted.<\/p>\n<p style=\"text-align: justify;\">This was done when he legislated that the charity is forbidden upon his family and progeny. He also gave up all his possessions in charity before he died depriving his family and leaving them in the care of the Muslim community. With this in mind, it is impossible for any non-Muslim to say that the Prophet – peace be upon him – fabricated his call for the financial betterment of his family.<\/p>\n<p style=\"text-align: justify;\">The Shia on the other hand believe that the Messenger – peace be upon him – gave vast and rich lands to his family as inheritance before his passing. They also believe that it is mandatory for Muslims to give the progeny of the Prophet – peace be upon him – a fifth of their total income.<\/p>\n<p style=\"text-align: justify;\">These beliefs are extremely unappealing to non-Muslims since it suggests that Islam is a cult in which the family members of the originator swindle the followers into vast amount of money.<\/p>\n<h2 style=\"text-align: justify;\">Shia Belief #5: The Apostasy of the Closest Companions of the Prophet – peace be upon him –<\/h2>\n<p style=\"text-align: justify;\">This one is a no-brainer. The strongest evidence against any false religion, whether it may be Scientology or Mormonism, is the apostasy of the closest companions of the originator of the religion. There is no doubt that those that were closest to him are the ones that knew him the best and their apostasy is indefinite proof of the falsehood of the religion.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Image-12.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-thumbnail wp-image-3939\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Image-12-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>Some narrations from Kitab Sulaym bin Qays and Al-Ikhtisas which has been attributed to Al-Mufeed describe that only three or four of the Prophet’s – peace be upon him – companions stayed Muslims after he passed away, while the rest apostated.<\/p>\n<p style=\"text-align: justify;\">Some Shias regard these reports as authentic while other do not. Though, all Shias agree that the closest people to the Prophet – peace be upon him – from the beginning of his call in Makkah, like Abu Bakr, Omar, and Uthman, apostated after the Prophet – peace be upon him – passed away.<\/p>\n<h2 style=\"text-align: justify;\"><\/h2>\n<h2 style=\"text-align: justify;\">Shia Belief #6: The Signs of Prophethood come Exclusively from Ahlulbayt<\/h2>\n<p style=\"text-align: justify;\">This point is interconnected with the previous one. Since the Shias do not regard the Companions of the Prophet – peace be upon him – to be reliable sources of his biography, Shias only have narrations that come from the path of Ahlulbayt.<\/p>\n<p style=\"text-align: justify;\">In other words, all the narrations that Shias find acceptable that are in praise of the Prophet – peace be upon him &#8211; , his actions, and describe his miracles, come from the path of his direct progeny.<\/p>\n<p style=\"text-align: justify;\">Non-Muslims do not find this appealing, since the testimony of one’s family does not really do one any favors, especially if that person is calling people to a new religion.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/david-whitmer.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-3936 alignright\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/david-whitmer-150x150.png\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>A comparison could be made with the Smiths and the Whitmers, the founders of the Mormon faith. The “eight witnesses” from these two families testified that they saw Joseph Smith’s golden plates which were given to him by an angel. The Smiths and the Whitmers were related by marriage, which is why Mark Twain joked, “I could not feel more satisfied and at rest if the entire Whitmer family had testified.”<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">With the above in mind, it becomes clear as to why it has always been a blessing that Islam has been spread by Sunnism and not by Shiasm. It would not be a stretch to declare that if Sunnism didn’t exist, Islam wouldn’t have spread past the peninsula and would have probably died out early.<\/p>\n<p style=\"text-align: justify;\">The only success Shias can have is with those that already accept Mohammad – peace be upon him – as a messenger of Allah.<\/p>\n<p style=\"text-align: justify;\">This is proof that Shias are only callers to: Aliyun Waliyyu Allah , while Sunnis are callers to: Mohammadun Rasoolu Allah.<\/p>\n<p style=\"text-align: justify;\">…and praise be to Allah the Most Gracious and Most Merciful.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>It is often noticed that most converts to Islam end up as Sunnis by default. It is very rare for a convert to embrace Shiasm directly due to several reasons. The most obvious, is that those that come from a <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/03\/07\/signs-prophethood-shiasm\/\" title=\"Signs of Prophethood in Shiasm\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-3935","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3935","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3935"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3935\/revisions"}],"predecessor-version":[{"id":3944,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3935\/revisions\/3944"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3935"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3935"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3935"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}