{"id":394,"date":"2013-05-16T20:44:57","date_gmt":"2013-05-16T20:44:57","guid":{"rendered":"http:\/\/twelvershia.net\/?p=394"},"modified":"2015-08-06T21:29:16","modified_gmt":"2015-08-06T21:29:16","slug":"the-prophet-saws-only-gets-angry-for-fatima-ra","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/05\/16\/the-prophet-saws-only-gets-angry-for-fatima-ra\/","title":{"rendered":"The Prophet (SAWS) only gets angry for Fatima (ra)?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=394\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The Rawafidh hold onto a Hadith in the Sahihayn, in brief this Hadith says that the Prophet (SAWS) is harmed if his daughter Fatima (ra) is harmed, and he (SAWS) is sad if she is sad and so on&#8230;<\/p>\n<p style=\"text-align: justify;\">Narrated Al-Miswar bin Makhrama: I heard Allah&#8217;s Apostle who was on the pulpit, saying, &#8220;Banu Hisham bin Al-Mughira have requested me to allow them to marry their daughter to Ali bin Abu Talib, but I don&#8217;t give permission, and will not give permission unless &#8216;Ali bin Abi Talib divorces my daughter in order to marry their daughter, because<strong> fatima is a part of my body, and I hate what she hates to see, and what hurts her, hurts me<\/strong>.&#8221;<br \/>\n(Sahih Bukhari and Sahih Muslim)<\/p>\n<p style=\"text-align: justify;\">This Hadith is of the highest of levels of authenticity. And this comes as a result of `Ali&#8217;s (ra) second marriage, and it is because the Prophet (SAWS) feared that his daughter may have a Fitnah in her religion or a trial in her religion. Because if the marriage is going to block the wife from doing her job and duty towards her husband than divorce is better, and this is a wide topic.<\/p>\n<p style=\"text-align: justify;\">Other texts:<\/p>\n<p style=\"text-align: justify;\">(Imam Zain-ul-&#8216;Abidin) &#8216;Ali b. Husain reported that when they came to Medina from Yazid b. Mu&#8217;awiya after the martyrdom of Husain b. &#8216;Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him: Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah&#8217;s Messenger (may peace be upon him) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily &#8216;Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) fatima (had been living in his house). Thereupon I heard Allah&#8217;s Messenger (may peace be upon him) say while addressing the people on the pulpit. I was adolescing in those days. He said:<strong>fatima is a part of me and I fear that she may be put to trial in regard to religion.<\/strong> He then made a mention of his son-in law who had been from the tribe of &#8216;Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah&#8217;s Messenger and the daughter of the enemy of Allah can never be combined at one place. (Sahih Muslim)<\/p>\n<p style=\"text-align: justify;\">And in another Lafdh:<\/p>\n<p style=\"text-align: justify;\">&#8216;Ali b. Husain reported that Miswar b. Makhramah informed him that &#8216;Ali b. Abi Talib sent the proposal of marriage to the daughter of Abu Jahl as he had fatima, the daughter of Allah&#8217;s Messenger (may peace be upon him), (as his wife). When fatima heard about it, she came to Allah&#8217;s Apostle (may peace be upon him) and said: The people say that you never feel angry on account of your daughters and now &#8216;Ali is going to marry the daughter of Abu Jahl. Makhramah said: Thereupon Allah&#8217;s Messenger (may peace be upon him) rose up and I heard him reciting Tashahhud and say: Now to the point. I gave a daughter of mine (Zainab) to Abu&#8217;l-&#8216;As b. Rabi, and he spoke to me and spoke the truth.<strong> Verily fatima, the daughter of Muhammad, is a part of me and I do not approve that she may be put to any trial, by Allah the daughter of Allah&#8217;s Messenger cannot be combined with the daughter of God&#8217;s enemy (as the co-wives) of one person<\/strong>. Thereupon &#8216;Ali gave up (the idea of his intended) marriage. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters. (Sahih Muslim).<\/p>\n<p style=\"text-align: justify;\">Through this exp<b><\/b>ression, those of weak minds and intellect try to make Takfeer on the best of this nation after its Prophets, Abu Bakr al-Siddeeq (ra).<\/p>\n<p style=\"text-align: justify;\">EVEN THOUGH THE HADITH IS ABOUT SOMEONE ELSE.<\/p>\n<p style=\"text-align: justify;\">Question:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Is Fatima (ra) the only person whose anger angers Allah&#8217;s messenger PBUH, and whose hurting hurts Allah&#8217;s messenger PBUH???<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">MEANING, doesn&#8217;t the Prophet (SAWS) get angry if someone angers his other family members and companions? Doesn&#8217;t he also feel hurt if someone hurts his other family members and close friends? or does he not care if they get hurt?<\/p>\n<p style=\"text-align: justify;\">The answer is clear to those who are rational and to those with healthy hearts.<\/p>\n<p style=\"text-align: justify;\">Would the Shia stop us from saying that the Prophet (SAWS) gets angry if someone angered or hurt his cousin &#8216;Ali (ra) or his grandson Hussein (ra) for example?<\/p>\n<p style=\"text-align: justify;\">I doubt it, so does this mean it isn&#8217;t exclusive for Fatima (ra)?<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s find out&#8230;<\/p>\n<p style=\"text-align: justify;\">In al-Bukhari we read:<\/p>\n<p style=\"text-align: justify;\">Narrated abu Ad-Darda: While I was sitting with the Prophet (PBUH), abu bakr came, lifting up one corner of his garment uncovering his knee. The Prophet said, &#8220;Your companion has had a quarrel.&#8221; abu bakr greeted (the Prophet ) and said, &#8220;O Allah&#8217;s Apostle! There was something (i.e. quarrel) between me and the Son of Al-khattab. I talked to him harshly and then regretted that, and requested him to forgive me, but he refused. This is why I have come to you.&#8221; The Prophet said thrice, &#8220;O abu bakr! May Allah forgive you.&#8221; In the meanwhile, &#8216;Umar regretted (his refusal of abu bakr&#8217;s excuse) and went to abu bakr&#8217;s house and asked if abu bakr was there. They replied in the negative. <strong>So he came to the Prophet (PBUH) and greeted him, but signs of displeasure appeared on the face of the Prophet till Abu Bakr pitied (&#8216;Umar)<\/strong>, so he knelt and said twice, &#8220;O Allah&#8217;s Apostle! By Allah! I was more unjust to him (than he to me).&#8221; The Prophet said, &#8220;Allah sent me (as a Prophet) to you (people) but you said (to me), &#8216;You are telling a lie,&#8217; while abu bakr said, &#8216;He has said the truth,&#8217; and consoled me with himself and his money.&#8221; He then said twice,<strong>&#8220;Won&#8217;t you then give up harming my companion?&#8221; After that nobody harmed Abu Bakr.<\/strong><\/p>\n<p style=\"text-align: justify;\">And<\/p>\n<p style=\"text-align: justify;\">Narrated Abu Ad-Darda: There was a dispute between Abu Bakr and `Umar, and Abu Bakr made `Umar angry. So `Umar left angrily. Abu Bakr followed him, requesting him to ask forgiveness (of Allah) for him, but `Umar refused to do so and closed his door in Abu Bakr&#8217;s face. So Abu Bakr went to Allah&#8217;s Apostle while we were with him. Allah&#8217;s Apostle (SAWS) said, &#8220;This friend of yours must have quarrelled (with somebody).&#8221; In the meantime `Umar repented and felt sorry for what he had done, so he came, greeted (those who were present) and sat with the Prophet (SAWS) and related the story to him. <strong>Allah&#8217;s Apostle became angry <\/strong>and Abu Bakr started saying, &#8220;O Allah&#8217;s Apostle! By Allah, I was more at fault (than `Umar).&#8221; Allah&#8217;s Apostle said, &#8220;Are you (people) leaving for me my companion? (Abu Bakr), Are you (people) leaving for me my companion? When I said, &#8216;O people I am sent to you all as the Apostle of Allah,&#8217; you said, &#8216;You tell a lie.&#8217; while Abu Bakr said, &#8216;You have spoken the truth .&#8221;<\/p>\n<p style=\"text-align: justify;\">Comment: Above we see that the Prophet (SAWS) became angry NOT for the anger of Abu Bakr (ra) but for something much much less than the anger of Abu Bakr (ra).<\/p>\n<p style=\"text-align: justify;\">Question:<\/p>\n<p style=\"text-align: justify;\">Do the Shia accept that Allah became angry for the anger of Abu Bakr (ra)?<\/p>\n<p style=\"text-align: justify;\">Not only that, the Prophet (SAWS) also becomes extremely angry for the weak and the elderly&#8230; we read in al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">Narrated Abu Mas&#8217;ud: A man came and said, &#8220;O Allah&#8217;s Apostle! I keep away from the morning prayer because so-and-so (Imam) prolongs it too much.&#8221; <strong>Allah&#8217;s Apostle became furious and I had never seen him more furious than he was on that day<\/strong>. The Prophet said, &#8220;O people! Some of you make others dislike the prayer, so whoever becomes an Imam he should shorten the prayer, as behind him are the weak, the old and the needy.&#8221;<\/p>\n<p style=\"text-align: justify;\">and also in Bukhari:<\/p>\n<p style=\"text-align: justify;\">Narrated Zaid bin Khalid Al-Juhani: A man asked Allah&#8217;s Apostle about the Luqata. He said, &#8220;Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.&#8221; The people asked, &#8220;O Allah&#8217;s Apostle! What about a lost sheep?&#8221; Allah&#8217;s Apostle said, &#8220;Take it, for it is for you, for your brother, or for the wolf.&#8221; The man asked, &#8220;O Allah&#8217;s Apostle! What about a lost camel?&#8221; <strong>Allah&#8217;s Apostle got angry and his cheeks or face became red<\/strong>, and said, &#8220;You have no concern with it as it has its feet, and its water-container, till its owner finds it.&#8221;<\/p>\n<p style=\"text-align: justify;\">and in Muslim:<\/p>\n<p style=\"text-align: justify;\">my slave with a whip when I heard a voice behind me which said: &#8220;Abu Mas`ud! Bear in mind&#8230;&#8221; <strong>I did not understand the voice because of the anger<\/strong>. Abu Mas`ud added: As he came near me, I found that he was the Messenger of Allah (PBUH) who was saying, &#8220;Abu Mas`ud! Bear in mind that Allah has more dominance upon you than you have upon your slave.&#8221; Then I said: &#8220;I will never beat any slave in future.&#8221;<br \/>\nAnother narration is: The whip dropped from my hand in awe of the Prophet (PBUH).<\/p>\n<p style=\"text-align: justify;\">Would the Rafidhah understand this the same way they understood his anger for Fatima (ra)?<\/p>\n<p style=\"text-align: justify;\">In conclusion, the Prophet (SAWS) gets angry for the anger and hurting of many people, this is not restricted to his daughter (ra).<\/p>\n<p style=\"text-align: justify;\">I add another question, what if an infallible became angry at another infallible? such as here:<\/p>\n<p style=\"text-align: justify;\">Sahih Muslim Bk 39, Number 5162:<b> <\/b><\/p>\n<p style=\"text-align: justify;\"><b>`<\/b>Ali b. Abu Talib reported that Allah’s Messenger (may peace be upon him) gave me to wear a garment in the form of silk cloak. I went out wearing it, <strong>but saw signs of anger on his face<\/strong>, so I tore it and distributed it amongst my women.<\/p>\n<p style=\"text-align: justify;\">What will the Shia say here? we give another Qur&#8217;anic example for the benefit:<\/p>\n<p style=\"text-align: justify;\">And when Moses returned to his people, <strong>angry and grieved<\/strong>, he said, &#8220;How wretched is that by which you have replaced me after [my departure]. Were you impatient over the matter of your Lord?&#8221; <strong>And he threw down the tablets and seized his brother by [the hair of] his head, pulling him toward him<\/strong>. [Aaron] said, &#8220;O son of my mother, indeed the people oppressed me and were about to kill me, so let not the enemies rejoice over me and do not place me among the wrongdoing people.&#8221; [7:150]<\/p>\n<p style=\"text-align: justify;\">[Moses] said, &#8220;O Aaron, what prevented you, when you saw them going astray, (92) From following me? <strong>Then have you disobeyed my order?<\/strong>&#8221; (93) [Aaron] said, &#8220;<strong>O son of my mother, do not seize [me] by my beard or by my head<\/strong>. Indeed, I feared that you would say, &#8216;You caused division among the Children of Israel, and you did not observe [or await] my word.&#8217; &#8221; (94) [7:92-93-94]<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-TabaTabaei said in his Tafseer:<\/p>\n<div style=\"text-align: justify;\">وظاهر سياق الآية وكذا ما في سورة طه من آيات القصة أن موسى غضب على هارون<\/div>\n<p style=\"text-align: justify;\">&#8220;And the apparent context of the verse and what is in Surat &#8220;TaHa&#8221; from verses of this story show that Musa was angry with Haroun.&#8221;<\/p>\n<p style=\"text-align: justify;\">and he said:<\/p>\n<div style=\"text-align: justify;\">أنه أخذ بلحيته ورأسه غضباً ليضربه<\/div>\n<p style=\"text-align: justify;\">&#8220;He seized him by the beard and the head out of anger in order to beat him up.&#8221;<\/p>\n<p style=\"text-align: justify;\">So we see the two infallibles fighting and quarreling,<\/p>\n<p style=\"text-align: justify;\">and finally TabaTabaei said:<\/p>\n<div style=\"text-align: justify;\">وإن كان الحق في ذلك مع هارون<\/div>\n<p style=\"text-align: justify;\">&#8220;Although Haroun was the one upon truth.&#8221;<\/p>\n<p style=\"text-align: justify;\">So according to TabaTabaei, the infallible who receives Wahy fought with the other infallible who receives Wahy, but the one upon truth was the infallible who earned the anger Not the infallible who was angry.<\/p>\n<p style=\"text-align: justify;\"> In addition to all the above, according to Sunni and Shia narrations, this is not a special treatment for Fatimah (as), rather this applies to all believers, in al-Kafi 2\/350:<\/p>\n<p style=\"text-align: justify;\">هِشَامِ بْنِ سَالِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ اللَّهُ عَزَّ وَ جَلَّ لِيَأْذَنْ بِحَرْبٍ مِنِّي مَنْ آذَى عَبْدِيَ الْمُؤْمِنَ وَ لْيَأْمَنْ غَضَبِي مَنْ أَكْرَمَ عَبْدِيَ الْمُؤْمِنَ<\/p>\n<p style=\"text-align: justify;\">Hisham bin Salim said: I heard abu `Abdillah (as) saying: Allah most high said: &#8220;He who hurts my believing slaves then I have declared war on him, but he who treats my believing slaves with kindness then he has saved himself from my anger.&#8221;<\/p>\n<p style=\"text-align: justify;\">al-Majlisi said &#8220;Sahih&#8221; 10\/377.<\/p>\n<p style=\"text-align: justify;\">Not only does this person anger Allah, but he incurs his wrath and becomes in a state of war against Allah which is much more terrible.<\/p>\n<p style=\"text-align: justify;\">Also it is not from the morals of Fatimah (as) to remain angry at anyone if he wronged her, we read in al-Kafi 2\/107:<\/p>\n<p style=\"text-align: justify;\">عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي خُطْبَتِهِ أَ لَا أُخْبِرُكُمْ بِخَيْرِ خَلَائِقِ الدُّنْيَا وَ الْآخِرَةِ الْعَفْوُ عَمَّنْ ظَلَمَكَ وَ تَصِلُ مَنْ قَطَعَكَ وَ الْإِحْسَانُ إِلَى مَنْ أَسَاءَ إِلَيْكَ وَ إِعْطَاءُ مَنْ حَرَمَكَ<\/p>\n<p style=\"text-align: justify;\">`Abdullah bin Sinan from abu `Abdillah (as): The messenger (saw) said in his sermon: &#8220;Should I tell you about the best of creation in this life and the next? The one who forgives the person who oppresses him, and the one who visits the one who abandons him, and treats well any person who wrongs him, and to give to the one who takes his share.&#8221;<\/p>\n<p style=\"text-align: justify;\">Majlisi said &#8220;Hasan kal-Sahih&#8221; 8\/192.<\/p>\n<p style=\"text-align: justify;\">This is why in the authentic narration to `Amir al-Sha`bi in the books of Ahlul-Sunnah, we read that Abu Bakr went to Fatimah&#8217;s house and tried to please her until she was pleased with him.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Rawafidh hold onto a Hadith in the Sahihayn, in brief this Hadith says that the Prophet (SAWS) is harmed if his daughter Fatima (ra) is harmed, and he (SAWS) is sad if she is sad and so on&#8230; Narrated <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/05\/16\/the-prophet-saws-only-gets-angry-for-fatima-ra\/\" title=\"The Prophet (SAWS) only gets angry for Fatima (ra)?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[17],"class_list":{"0":"post-394","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"tag-abu-bakr"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/394","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=394"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/394\/revisions"}],"predecessor-version":[{"id":1137,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/394\/revisions\/1137"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=394"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=394"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=394"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}