{"id":3954,"date":"2017-03-19T16:57:10","date_gmt":"2017-03-19T16:57:10","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=3954"},"modified":"2017-03-19T21:53:34","modified_gmt":"2017-03-19T21:53:34","slug":"imam-mahdi","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/03\/19\/imam-mahdi\/","title":{"rendered":"The authentic belief concerning Imam Mahdi"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=3954\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Mahdi-title.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-3986 size-large\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Mahdi-title-1024x435.jpg\" alt=\"Imam Mahdi\" width=\"1024\" height=\"435\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Mahdi-title-1024x435.jpg 1024w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Mahdi-title-300x128.jpg 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Mahdi-title-768x327.jpg 768w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/03\/Mahdi-title.jpg 1030w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">In this article we will give a simple summary of all the correct beliefs that have reached us authentically regarding Imam Mahdi based on the well-researched work of the scholar Dr. `Abdul-`Alim `Abdul-`Adhim al-Bistawi.<\/p>\n<p style=\"text-align: justify;\">The topic of Imam Mahdi although not mentioned in God&#8217;s Book is a topic that the commoners love to speak of. Story-tellers found it really easy to narrate wonderful tales and weird stories in order to appeal to the masses. The stories were later attributed to God&#8217;s Messenger (saw), the noble Companions, the pious followers and even to the people of the Book.<\/p>\n<p style=\"text-align: justify;\">In this study, we will rely on the popular books of the scholars of Islam. We will dismiss all reports that do not contain a chain of transmission, such as those that begin with &#8220;It has been narrated that&#8230;&#8221; or &#8220;We were told that&#8230;&#8221; because relying on hear-say has no place in a respectable academic study.<\/p>\n<p style=\"text-align: justify;\">We will also ignore the books of the Shia sects who are obsessed with the &#8220;Awaited Imam Mahdi&#8221; or &#8220;12th Imam&#8221; as they call him. This is because they claim to have received special knowledge from certain descendants of `Ali bin abi Talib which they have collected in secret documents. This claim is very dubious and highly un-academic, what makes this more suspicious is the vast amount of self-contradicting stories and unbelievable tales contained in their printed books that cannot be found anywhere else nor does it have a basis.<\/p>\n<p style=\"text-align: justify;\">The author of this book went through hundreds of narrations in the main books of the Muslims while looking into the authenticity and weakness for each and every report. The result as one can read in his book and as you can see below is that out of the hundreds of narrations, only a handful are authentic and they are very subtle without much detail. This shows that the majority of what&#8217;s spread among laypeople are fantasies and myths without much truth to them.<\/p>\n<h2 style=\"text-align: justify;\">I- Meaning of &#8220;Mahdi&#8221;<\/h2>\n<p style=\"text-align: justify;\">The Arabic word Mahdi comes from the root &#8220;Huda&#8221; which means guidance and thus al-Mahdi simply means &#8220;The guided one&#8221;. The belief in the Mahdi or the concept of a Mahdi is referred to as &#8220;al-Mahdawiyyah&#8221; and it is a technical scholarly term.<\/p>\n<p style=\"text-align: justify;\">The word was used in many narrations and reports, in an authentic report `Isa (as) is described as being &#8220;Imaman Mahdiyyan&#8221; or a &#8220;guided leader&#8221;. In another, the righteous Caliphs are described by the Messenger (saw) as &#8220;Rashidin Mahdiyyin&#8221; or &#8220;The rightly guided successors after me.&#8221; In some authentic narrations the Prophet (saw) supplicates God to make his Companion abi Salamah from the same status as &#8220;al-Mahdiyyin&#8221; or &#8220;The guided ones&#8221;. In other authentic report, he (saw) supplicates for his Companion Jarir bin `Abdullah that &#8220;O Lord make him steady and turn him to a guided guide&#8221; or &#8220;Hadiyan Mahdiyya&#8221; a very similar supplication was made for Mu`awiyah bin abi Sufiyan. In another authentic narration the Prophet (saw) made supplication for himself and the entire nation: &#8220;O Lord, bestow upon us the beauty of faith and make us all guided guides.&#8221; among many other locations in prophetic-narrations and poetry.<\/p>\n<p style=\"text-align: justify;\">In this sense, the prophetic prophesy is simply stating that at the end of times, there will emerge &#8220;al-Mahdi&#8221; or a &#8220;Guided leader.&#8221; This is not his name, rather it is his title and a description of his conduct and actions.<\/p>\n<h2 style=\"text-align: justify;\">II- Different positions regarding Imam Mahdi in this nation<\/h2>\n<p style=\"text-align: justify;\">There are four groups and we list them from majority to minority:<\/p>\n<p style=\"text-align: justify;\">A- Those who believe in the coming of a guided leader who precedes `Isa (as) and leads the nation before his advent.  He shall be born at the end of times and is called &#8220;Muhammad bin `Abdullah&#8221;. This group is the vast majority of Muslims and their evidence is a large amount of prophetic narrations a few of which are authentic.<\/p>\n<p style=\"text-align: justify;\">B- Those who believe the guided leader is already born and call him &#8220;Muhammad bin al-Hasan&#8221;, they attribute to him miraculous powers, divine knowledge and infallibility. They believe he has been walking among us for more than a thousand years in disguise so no one may recognize him. This group is the Twelver Shia sect who claims to possess secret knowledge from the prophetic-household.<\/p>\n<p style=\"text-align: justify;\">C- Those who believe that the guided leader at the end of times is none other than `Isa (as) himself. They weaken the narrations that state otherwise and rely on an authentic report declaring that `Isa (as) will be a guided (Mahdi) leader at the end of times. This is supported by some reports attributed to a few of the early followers.<\/p>\n<p style=\"text-align: justify;\">D- Those who disbelieve in the awaited guided leader and the second coming of `Isa (as) and view these as foreign beliefs that are harmful to Islam as it causes laziness and places false hopes in a mythical character that will never show up. This view has not much support and is adopted by a small minority most of which are Qur&#8217;anists.<\/p>\n<h2 style=\"text-align: justify;\">III- The beliefs Muslims must hold concerning Imam Mahdi<\/h2>\n<h3 style=\"text-align: justify;\">A-Beliefs we learned through authentic explicit narrations that clearly speak of Imam Mahdi:<\/h3>\n<ol style=\"text-align: justify;\">\n<li>He is from the Prophet&#8217;s (saw) household, from Fatimah&#8217;s progeny.<\/li>\n<li>His name will be Muhammad bin `Abdillah.<\/li>\n<li>He has a high forehead and a distinctively thin and slightly curved nose.<\/li>\n<li>God will prepare and rectify him in one night.<\/li>\n<li>A person will be killed if he even mentions the name of God before his time.<\/li>\n<li>He will fill the earth with justice as it was filled with oppression.<\/li>\n<li>When three leaders fight for a treasure his army will appear from the east.<\/li>\n<li>He shall come from the direction of Khurasan with black flags.<\/li>\n<li>Many Arabs will be killed in these wars unlike ever before.<\/li>\n<li>He shall appear at the end of times.<\/li>\n<li>He will be blessed with rain so the earth will bear fruits and cattle will increase.<\/li>\n<li>He shall distribute money generously and fairly.<\/li>\n<li>The number of his supporters at the beginning will be around 306 like in Badr.<\/li>\n<li>His supporters will be from the most pious of people.<\/li>\n<li>He shall first emerge in the city of Makkah after a pure soul is killed.<\/li>\n<li>People will celebrate around him when he emerges.<\/li>\n<li>He shall reward the righteous and forgive the wrong-doers.<\/li>\n<li>He will be strict on his governors.<\/li>\n<li>He will be fifty one or fifty two at the time he reaches authority.<\/li>\n<li>He shall lead the nation for seven years until `Isa (as) descends.<\/li>\n<li>`Isa (as) refuses to lead the nation in prayer to honor them.<\/li>\n<li>`Isa (as) defeats the Dajjal and remains among them for forty years.<\/li>\n<\/ol>\n<h3 style=\"text-align: justify;\">B-Beliefs we learned through authentic but vague reports that seem to be referring to Imam Mahdi:<\/h3>\n<ol style=\"text-align: justify;\">\n<li>There will be a sign in sunrise.<\/li>\n<li>He may receive the pledge between al-Rukn wal-Maqam.<\/li>\n<li>He may be one of the twelve Caliphs that succeed the Prophet (saw).<\/li>\n<li>He may be the one to seek refuge in the Ka`bah while his opponents will be swallowed by the earth.<\/li>\n<li>A Syrian army that opposes him will be weakened by severe weather.<\/li>\n<li>He fights a Syrian army with an army of his own composed of three groups.<\/li>\n<li>His army&#8217;s slogan will be &#8220;death, death&#8221; and they number between twelve and fifteen thousand.<\/li>\n<li>When God honors him with guidance, he will still be young.<\/li>\n<li>He shall easily become a leader.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><em>NOTE: If you read anything other than the above concerning &#8220;Imam Mahdi&#8221;, know that it is taken from unreliable weak reports or fabricated stories. Only the above details are what we know through the popular authentic narrations.<\/em><\/p>\n<h2 style=\"text-align: justify;\">IV- Reliable prophetic-narrations explicitly mentioning Imam Mahdi<\/h2>\n<p style=\"text-align: justify;\">1- `Ali narrates: The Prophet (saw) said: &#8220;The guided one is from my household, God will rectify him in one night.&#8221;<\/p>\n<p style=\"text-align: justify;\">2- `Abdullah narrates: The Prophet (saw) said: &#8220;When you see the black flags emerging from the land of Khurasan, go and seek them for among them is God&#8217;s successor, the guided one.&#8221;<\/p>\n<p style=\"text-align: justify;\">3- Aba Sa`id narrates: The Prophet (saw) said: &#8220;Towards the end of my nation shall emerge the guided one. God will bless him with rain so that the earth will bring forth its fruits; he will divide money justly and cattle will increase. He shall live around seven or eight years.&#8221;<\/p>\n<p style=\"text-align: justify;\">4- Aba Sa`id narrates: The Prophet (saw) said: &#8220;The guided one is of my lineage. He has a high forehead and a distinctively thin and slightly curved nose. He will fill the earth with fairness and justice as it was filled with tyranny and oppression, and he will rule for seven years.&#8221;<\/p>\n<p style=\"text-align: justify;\">5- Aba Sa`id narrates: The Prophet (saw) said: &#8220;In my nation shall be a guided man. No matter how long he lives he shall spend seven, eight or nine years filling the earth with justice and equity. The earth will bring forth its plants and the sky will send down its rain.&#8221; In some narrations we read an addition: &#8220;At that time, my nation will live a life unlike anything before it.&#8221;<\/p>\n<p style=\"text-align: justify;\">6- Jabir narrates: The Prophet (saw) said: &#8220;`Isa bin Mariyam (as) will descend so their guided leader will say: &#8216;Come lead us in prayer!&#8217; However, `Isa (as) replies: &#8216;No, this nation will be led (in prayer) by one of their own. This is how God honors them.'&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: This shows how `Isa (as) declines the offer of our guided leader to be the leader of prayer and informs them that only people from Muhammad&#8217;s (saw) nation may lead each other.<\/em><\/p>\n<p style=\"text-align: justify;\">7- Thawban narrates: The Prophet (saw) said: &#8220;Near this treasure of yours, three will engage one another in combat. Each of them the son of a successor (leader). But it will not reach any of them. Then the black flags will come from the East, and they will kill you in a way unlike any nation before.&#8221; And he (saw) mentioned something I couldn&#8217;t memorize, then said: &#8220;If you ever hear of him then seek him, even if you have to crawl on snow, for verily he is God&#8217;s successor, the guided one.&#8221;<\/p>\n<p style=\"text-align: justify;\">8- Umm Salamah narrates: The Prophet (saw) said: &#8220;The guided one is from my progeny; from Fatimah&#8217;s children.&#8221;<\/p>\n<h2 style=\"text-align: justify;\">V- Reliable reports from the Companions and Followers explicitly mentioning Imam Mahdi<\/h2>\n<p style=\"text-align: justify;\">1- Ibn al-Hanafiyyah narrates: We were with `Ali when a man asked him about the guided one. So, `Ali replied while signaling with seven fingers: &#8220;This is way far! That one will come out at the End of Time. (At that time) if a man said, &#8216;Allah! Allah!&#8217; he will be killed. Then, God the Most High will gather together a group around him, just as the separate pieces of cloud are joined together. God will unite their hearts. They do not need anyone nor will they rejoice if one joins them. Their number matches that of the people at Badr. The past Generations will not surpass them and the latter generations will not reach up to them. Their number will also be that of the companions of Talut who crossed the river with him.&#8221; Ibn al-Hanafiyyah asked Abu al-Tufay (the narrator): &#8220;Do you seek him?&#8221; He replied: &#8220;Yes.&#8221; Ibn al-Hanafiyyah said: &#8220;He emerges from between these two mountains (meaning Makkah).&#8221; Abu al-Tufayl replied: &#8220;I shall not leave it (Makkah) till I die.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: The beginning of the report portrays the state of corruption the world has reached, that even saying God&#8217;s name can get you killed. Then it describes the followers of the guided leader, they shall be around three hundred men just like the army of Badr. The last part discusses where this leader originates from.<\/em><\/p>\n<p style=\"text-align: justify;\">2- Sa`id bin Jubayr narrates: Ibn `Abbas said: &#8220;Three men come from our household: The blood shedder (al-Saffah), the triumphant (al-Mansur) and the guided (al-Mahdi).&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: Ibn `Abbas is talking about the children of Hashim but this narration can also be understood that Imam Mahdi is from al-`Abbas&#8217;s progeny. This is most likely why one of the `Abbasid Caliphs adopted the title &#8220;Mahdi&#8221; to boost his claim to the throne.<\/em><\/p>\n<p style=\"text-align: justify;\">3- Mujahid narrates: A man from the Prophet&#8217;s (saw) Companions said: &#8220;The guided one shall not emerge before the pure soul (Nafs-ul-Zakiyyah) is killed. When the pure soul is killed, they shall incur the wrath of he who is in the sky and in the earth shall. The guided shall emerge and they (believers) will celebrate around him just like a bride&#8217;s family celebrates on her wedding night; he will fill the earth with justice and equity; earth will bring forth its plants; the sky will send down its rain and my nation will be blessed during his reign like never before.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: The pure soul is also the title of a revolutionary from al-Hasan bin `Ali&#8217;s progeny. Be warned however, many political leaders and personalities intentionally adopt titles like these to enforce their political position and claim that they are prophesied.<\/em><\/p>\n<p style=\"text-align: justify;\">4- Salim bin abi al-Ja`d narrates: `Abdullah bin `Amr said: &#8220;O people of Kufah, you will be the happiest with regards to the guided one.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: Most likely because he is from Hashim&#8217;s progeny and Kufah was politically aligned with Hashemites so `Abdullah assumed they&#8217;d be the happiest when Imam Mahdi appears.<\/em><\/p>\n<p style=\"text-align: justify;\">5- Hisham narrates: Muhammad bin Sirin said: &#8220;The guided one is from this nation and he is the one to lead `Isa bin Mariyam (i.e in prayer).&#8221;<\/p>\n<p style=\"text-align: justify;\">6- Ibn Tawus narrates: `Ali bin `Abdullah bin `Abbas said: &#8220;The guided one shall not emerge until the sun rises with a sign.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: A very vague report.<\/em><\/p>\n<p style=\"text-align: justify;\">7- Ibrahim narrates: I asked Tawus: &#8220;Is `Umar bin `Abdul-`Aziz the guided one?&#8221; He responded: &#8220;`Umar was guided but he is not that guided one (from the end of times). When he comes, the good-doer will be rewarded and the evil-doer will be forgiven. He spends the money, is strict on the governors and merciful towards the poor.&#8221;<\/p>\n<p style=\"text-align: justify;\">8- Qatadah narrates: I asked Sa`id bin al-Musayyib: &#8220;Is the guided one true?&#8221; He said: &#8220;He&#8217;s true.&#8221; I asked: &#8220;From whom?&#8221; He said: &#8220;Quraysh.&#8221; I said: &#8220;From which?&#8221; He said: &#8220;From Hashim&#8217;s children.&#8221; I said: &#8220;Which ones?&#8221; He said: &#8220;Children of `Abdul-Muttalib.&#8221; I asked further and he said: &#8220;From Fatimah&#8217;s progeny.&#8221;<\/p>\n<p style=\"text-align: justify;\">9- Ibn Shawdhab narrates: Matir said: We heard that the guided one will accomplish things greater even than `Umar bin `Abdul-`Aziz. A beggar comes and asks him so he says &#8220;Enter the treasury and take what you wish.&#8221; After doing so, as he exits, he sees all people are full and satisfied so he feels regret and proceeds to return the money but is told: &#8220;We give and never take.&#8221;<\/p>\n<p style=\"text-align: justify;\">10- `Imran narrates: al-Samit (or Shamit) said: &#8220;His name is that of a prophet; he will be fifty one or fifty two; he rules for seven or eight years.&#8221;<\/p>\n<h2 style=\"text-align: justify;\">VI- Reliable prophetic-narrations referring to Imam Mahdi vaguely<\/h2>\n<p style=\"text-align: justify;\">1- `Ali narrates: The Prophet (saw) said: &#8220;If only a single day&#8217;s worth remains of time (on this earth), God will send a man from my household who will fill it with justice as it was filled with oppression.&#8221;<\/p>\n<p style=\"text-align: justify;\">2- `Abdullah narrates: The Prophet (saw) said: &#8220;If only one day remains of this world, God will stretch that day until a man from my progeny whose name matches mine and his father&#8217;s name matches my father&#8217;s name is sent to you (i.e Arabs).&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: This means his name is Muhammad bin `Abdullah.<\/em><\/p>\n<p style=\"text-align: justify;\">3- Abu Hurayrah narrates: The Prophet (saw) said: &#8220;How will you (i.e Arabs) be if `Isa bin Mariyam (as) descends while your leader is one of you?&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: We know from other authentic reports that the leader at the time will be Imam Mahdi.<\/em><\/p>\n<p style=\"text-align: justify;\">4- Abu Hurayrah narrates: The Prophet (saw) said that if only one night remains of this world then a man from his household will assume authority.<\/p>\n<p style=\"text-align: justify;\">5- Abu Hurayrah narrates: The Prophet (saw) said: &#8220;A man will receive a pledge of allegiance between the corner of the black-stone and the station of Ibrahim (as). None shall degrade the sanctity of the House (i.e Ka`bah) except its own people; when they do so then doom shall befall the Arabs. The Abyssinians (i.e Africans) will then come and destroy it permanently, extract its treasure and it shall never be rebuilt.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: This is most likely not discussing Imam Mahdi as it is known that in his time there will be peace and prosperity.<\/em><\/p>\n<p style=\"text-align: justify;\">6- Abu Sa`id narrates: The Prophet (saw) said: &#8220;The hour shall not come to pass until the earth is filled with oppression and tyranny, then a man from my progeny shall rise and fill it with justice and equity.&#8221;<\/p>\n<p style=\"text-align: justify;\">7- Abu Sa`id narrates: The Prophet (saw) said: &#8220;The man whom `Isa bin Mariyam (as) prays behind is from my progeny.&#8221;<\/p>\n<p style=\"text-align: justify;\">8- Abu Sa`id narrates: The Prophet (saw) said: &#8220;From among the successors who will lead you is one who will distribute wealth generously without counting.&#8221;<\/p>\n<p style=\"text-align: justify;\">9- Jabir bin Samurah narrates: The Prophet (saw) said: &#8220;The people&#8217;s affairs will continue to be conducted well as long as they&#8217;re ruled by twelve chiefs.&#8221; Then he spoke a word I did not understand so I asked my father and he said: &#8220;All of them, from Quraysh.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: A lot of people associate this report with Imam Mahdi. However, there is no evidence whatsoever that this is referring to Imam Mahdi as can be reviewed in our article <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/12\/hadith-of-twelve-caliphs\/\">here<\/a>.<\/em><\/p>\n<p style=\"text-align: justify;\">10- Umm Salamah narrates: The Prophet (saw) said: &#8220;A man will seek refuge in the House (i.e Ka`bah) so they will send an expedition after him but when they reach a certain desert land, they shall be swallowed by the earth.&#8221; I asked: &#8220;O Prophet (saw), what about those who were forced to join?&#8221; He (saw) replied: &#8220;They will be swallowed but then each man is judged on his intentions.&#8221; The narrator said: &#8220;It is the desert of Madinah.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: The above text may or may not be referring to Imam Mahdi.<\/em><\/p>\n<p style=\"text-align: justify;\">11- Abu Hurayrah narrates: The Prophet (saw) said: &#8220;God&#8217;s spirit, `Isa bin Mariyam (as) shall descend so recognize him when you see him. He is a man of medium height, with a radiant complexion leaning towards white; he will be between (or dressed in) two slightly yellowish garments; His head looks as if it is dripping water even though it is not wet. He will break the Cross, kill the swine and abolish Jizyah (tax on Christians and Jews); he shall call them towards Islam and the Dajjal will perish in his time so peace will befall the people of earth. Lions will be with camels, tigers with cows, wolves with sheep and even children will play with snakes unharmed. He will stay in the World for forty years. Then, he will die and the Muslims will perform the funeral prayer for him.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: Imam Mahdi will rule them for seven years until `Isa (as) descends, then it seems authority will be transferred to `Isa (as) the prophet who rules for forty years and defeats Dajjal.<\/em><\/p>\n<h2 style=\"text-align: justify;\">VII- Reliable reports from the Companions and Followers vaguely referring to Imam Mahdi<\/h2>\n<p style=\"text-align: justify;\">1- Ibn Zurayr narrates: `Ali said: &#8220;There will be tribulations in which people will become as (few as) the gold in the minerals; so do not verbally abuse the people of al-Sham except their oppressors for among them are the substitutes (i.e Abdal). God will send down on them torment from the sky which will divide and weaken them to the extent that foxes could (easily) defeat them. At that point, God will send forth a man from the Messenger&#8217;s (saw) progeny alongside twelve thousand supporters at least or fifteen thousand at most. Their slogan will be &#8216;Death, death&#8217; and they shall be composed of three divisions. Facing them, will be seven divisions, each will be led by one who is desirous of authority yet they shall be defeated by the Hashemite and God will return for them peace and blessing until the appearance of the Dajjal.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: The &#8220;Abdal&#8221; are extremely pious people that are prophesied to appear in al-Sham one after the other, as if each is substituting the other. This appears to be a battle against an army during the reign of Imam Mahdi.<\/em><\/p>\n<p style=\"text-align: justify;\">2- Abu Ma`bad narrates: Ibn `Abbas said: &#8220;Days and nights shall not pass until a young one from our household attains authority; he will not be overcome by tribulations.&#8221; We asked: &#8220;O `Abbas, your elders were unable to achieve this (high status) yet your youngsters attain it?&#8221; He said: &#8220;It is God&#8217;s affair and decision. Just as He began it with us He shall end it with us.&#8221;<\/p>\n<p style=\"text-align: justify;\">3- `Awf narrates: Ibn Sirin said: &#8220;In our nation will be a successor who is even superior to Abu Bakr and `Umar.&#8221;<\/p>\n<p style=\"text-align: justify;\"><em>Note: This is the opinion of Muhammad bin Sirin and the scholars disagree with this odd opinion. Some give this statement the same interpretation as the narration which states that people will come after the Sahabah who are better since they believed without seeing the Prophet (saw).<\/em><\/p>\n<p style=\"text-align: justify;\">4- Ibn Sirin narrates: Abi al-Jald said: &#8220;He acquires authority easily from inside his house.&#8221;<\/p>\n<h2 style=\"text-align: justify;\">VIII- Conclusion to research<\/h2>\n<p style=\"text-align: justify;\">A- The guided leader, Imam Mahdi, is truth and should not be denied due to the presence of a number of Sahih and Hasan narrations as well as plenty of weak ones that support the existence of this character.<\/p>\n<p style=\"text-align: justify;\">B- The amount of weak and fabricated reports is astonishing. It seems plenty of folks decided to create stories concerning this prophesied figure and attribute them to the Prophet (saw) and his Companions.<\/p>\n<p style=\"text-align: justify;\">C- The belief in a guided leader that emerges at the end of times is simply a sign of the hour. No emphasis was given to this matter in Qur&#8217;an or Sunnah and thus it is not of much importance in the daily lives of Muslims.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In this article we will give a simple summary of all the correct beliefs that have reached us authentically regarding Imam Mahdi based on the well-researched work of the scholar Dr. `Abdul-`Alim `Abdul-`Adhim al-Bistawi. The topic of Imam Mahdi although <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/03\/19\/imam-mahdi\/\" title=\"The authentic belief concerning Imam Mahdi\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3986,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,1,5],"tags":[16],"class_list":{"0":"post-3954","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-featured-posts","8":"category-hadith","9":"category-imamah","10":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3954","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=3954"}],"version-history":[{"count":19,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3954\/revisions"}],"predecessor-version":[{"id":3992,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/3954\/revisions\/3992"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3986"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=3954"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=3954"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=3954"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}