{"id":4020,"date":"2017-04-09T00:04:54","date_gmt":"2017-04-09T00:04:54","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4020"},"modified":"2017-04-09T00:04:54","modified_gmt":"2017-04-09T00:04:54","slug":"hijr-ismail-shia-allegations","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/04\/09\/hijr-ismail-shia-allegations\/","title":{"rendered":"Hijr Ismail and Shia Allegations"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4020\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><em>Bismillah Wa Salaatu Wa Salaam A’laa Rasul’lillah,<\/em><\/p>\n<p style=\"text-align: justify;\"><em>Am’aa B’aad&#8230;<\/em><\/p>\n<p style=\"text-align: justify;\">Allah says: “And among men is he who disputes about Allah, without knowledge or guidance, or a Book giving light (from Allah)” (Al-Hajj: 8)<\/p>\n<p style=\"text-align: center;\">“ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير”<\/p>\n<p style=\"text-align: justify;\">The following article examines the definition, significance, and allegations that surround Hijr Ismail from a Sunni-Shia polemical standpoint.<\/p>\n<p style=\"text-align: justify;\">Shia claims regarding Hijr Ismail can be summarised as follows:<a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/04\/The-Hateem.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-4021 alignright\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/04\/The-Hateem-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">\n<ul style=\"text-align: justify;\">\n<li>Nabi Ismail (peace be upon him) is buried at the vicinity Ka’bah.<\/li>\n<li>Sunni regard anyone who prays near a grave as a grave worshiper.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Linguistically, a Hijr is anything that is built and erected from the ground. The name is commonly used to refer to what is today known as Hijr Ismail.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Is Hijr Ismail the Grave of Ismail?<\/strong><\/h2>\n<p style=\"text-align: justify;\">It is not proven in any prophetic hadeeth that Ismail (peace be upon him) was buried in Hijr Ismail, or that Haajar, his mother, was buried in it.  Such a suggestion needs proof, and no such thing has been proven.<\/p>\n<p style=\"text-align: justify;\">Many modern Shias state that we do not know where the grave of Fatima (may Allah’s blessings me upon her) is, and therefore, it is strange that they would suggest that we know for certain where Ismail is buried.<\/p>\n<p style=\"text-align: justify;\">The most obvious proof that Ismail was not buried at “Hijr Ismail” is that &#8216;Aa&#8217;ishah and ‘Abd-Allaah ibn ‘Abbaas (may Allaah be pleased with him) narrated: When the Messenger of Allaah (peace and blessings of Allaah be upon him) was dying, he drew the blanket over his face, then when the pains of death grew too intense, he uncovered his face and said: “May Allaah curse the Jews and the Christians<strong>; they took the graves of their Prophets as places of worship<\/strong>,” warning against doing what they had done.(Bukhari 436)<\/p>\n<p style=\"text-align: justify;\">Yet, we find the Prophet (peace and blessings of Allaah be upon him) praying in Hijr Ismail himself. (Bukhari 3856)<\/p>\n<p style=\"text-align: justify;\">This is sufficient evidence to those of cleansed hearts that Ismail was not buried in the Hijr.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\">Do Sunnis regard anyone praying near a grave to be a grave worshiper?<\/h2>\n<p style=\"text-align: justify;\">Firstly:<\/p>\n<p style=\"text-align: justify;\">One of the rulings of sharia which is aimed at cutting off all possible fitnah, blocking all means that may lead to shirk and closing the door to exaggeration is the prohibition on taking graves as places of worship.<\/p>\n<p style=\"text-align: justify;\">There is no differentiation in that between graves of Muslims or graves of mushrikeen; in fact with regard to the graves of Muslims and righteous people, it is more important to keep away from them, because shirk and fitnah are more likely concerning them.<\/p>\n<p style=\"text-align: justify;\">One Shia apologist wrote on his website:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><em>‘’<\/em><em>Salafis do not hesitate to call anyone who prays TO ALLAH but near a grave to be a grave worshipper. Of course, we cannot see the logical connection between praying BESIDE a thing and worshipping it. If we were to extend the logic further, then it is idolatry to pray in congregation! This is because you are praying BESIDE someone, and you are therefore worshipping him! If we go on and on with the apparently stupid Salafi logic, everyone, including all the prophets, become idolators’.’<\/em><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The stereotypes against Salafis seem to know no end.<\/p>\n<p style=\"text-align: justify;\">We all know that the grave of Prophet Muhammad (peace and blessings of Allah be upon him) lies in close vicinity of the prophetic Masjid, so does this individual think that Salafis declare the whole ummah of Islam to be grave worshipers? Seeing how almost every Muslim at least once in their life time will offer prayer there!<\/p>\n<p style=\"text-align: justify;\">Moreover, it is a part of the shari’ah to pray towards the Ka’aba with the deceased in between those praying and the Qibla, and yet, no Salafi has ever suggested that this is Shirk, but rather, that this is mandatory. It should be clear that this action is not Shirk because one is not performing this highest form of degradation and humbleness as in our relation to the deceased, but rather, we are in this state out of reverence to our Creator. Hence, the Creator is being worshipped, not the deceased.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">So to conclude, there is <strong>no authentic evidence to suggest that Prophet Ismail is buried at Hijr Ismail<\/strong> or that Sunnis declaring prayers there to be an act of shirk.<\/p>\n<p style=\"text-align: justify;\">Indeed praying deliberately towards a grave constitutes Major Shirk which would nullify once Islam.<\/p>\n<p style=\"text-align: justify;\">Worshiping graves was the first act of shirk which mankind introduced and it was first practiced by the people of Nuh (peace be upon him) as Allah (Azza wa jal) stated :<\/p>\n<p style=\"text-align: justify;\"> Nuh said: &#8220;My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but loss.&#8221; &#8220;And they have plotted a mighty plot. And they have said: `You shall not leave your gods, nor shall you leave Wadd, nor Siwa`, nor Yaghuth, and Ya`uq and And indeed they have led many astray. And (O Allah): `Grant no increase to the wrongdoers save error.&#8221;&#8217;)<\/p>\n<p style=\"text-align: justify;\">(71:23-24)<\/p>\n<p style=\"text-align: justify;\">Ibn Abbas and others from the Salaf said: <em>&#8220;These were righteous people amongst the people of Nuh (peace be upon him), when they died the people devoted themselves to their graves, then they made pictures of them, then they worshipped them.&#8221; (<\/em>Bukhari 4920)<\/p>\n<p style=\"text-align: justify;\">Sadly, gems like these ayat that carry not just guidance for all times but also injunctions and laws seems to have fallen on deaf ears with many people, even those who claim to be Muslims!<\/p>\n<p style=\"text-align: justify;\">The number one plot of Shaytan has always been to make mankind worship other deities besides Allah (azza wa jal) and sadly this is the trap that many Shias have fallen into unknowingly. Their exaggerated extremism in following the Ahlal bayt has made them completely oblivious of the fact about what Islam says about the issues of graves.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">We ask Allah (azza wa jal) to guide the Shias to the straight path and may the peace and blessings be upon his Messenger Muhammad and his household and his companions<\/p>\n<p style=\"text-align: justify;\">Ameen<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Bismillah Wa Salaatu Wa Salaam A’laa Rasul’lillah, Am’aa B’aad&#8230; Allah says: “And among men is he who disputes about Allah, without knowledge or guidance, or a Book giving light (from Allah)” (Al-Hajj: 8) “ومن الناس من يجادل في الله بغير <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/04\/09\/hijr-ismail-shia-allegations\/\" title=\"Hijr Ismail and Shia Allegations\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-4020","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4020","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4020"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4020\/revisions"}],"predecessor-version":[{"id":4022,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4020\/revisions\/4022"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4020"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4020"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4020"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}