{"id":4027,"date":"2017-04-29T21:58:00","date_gmt":"2017-04-29T21:58:00","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4027"},"modified":"2017-04-30T12:27:10","modified_gmt":"2017-04-30T12:27:10","slug":"who-holds-onto-thaqalayn","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/04\/29\/who-holds-onto-thaqalayn\/","title":{"rendered":"Who holds onto the Thaqalayn?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4027\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The question of who holds onto the Thaqalayn is a common one that is often brought up in Sunni-Shia polemics. Even though there is much to say about the <a href=\"http:\/\/www.twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\">exact wording<\/a> of the narration, this article sheds light on the fact that it is Ahl Al-Sunnah that hold onto the Thaqalayn, the Qur’an and Ahl Al-Bayt, and not the Shias.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Holding onto the Qur’an<\/strong><\/h2>\n<p style=\"text-align: justify;\">To the untrained eye, it may seem that both sects do in some manner or form hold onto the Qur’an. Shias, in order to suggest that Sunnis do not hold onto the Qur’an, attempt to provide specific verses, like the verse of ablution (which has been <a href=\"http:\/\/www.twelvershia.net\/2015\/10\/16\/washing-of-the-feet-in-wudu-answering-shii-contentions-part-1\/\">explained here<\/a>), to suggest that they are the orthodox “holders” of the Qur’an. However, this form of nit-picking does not suffice for one to make such a claim.<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/04\/القرآن.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-4029 alignleft\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/04\/القرآن-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>Shias cannot say that “the Sunnis do not hold onto the Qur’an at all,” because that statement would simply be untrue and unrealistic. However, the claim that Shias do not hold onto the Qur’an is <span style=\"text-decoration: underline;\">one that can be made and proven<\/span>.<\/p>\n<p style=\"text-align: justify;\">Today, the majority of the Muslim world recites the Qur’an in the recitation of Hafs from Asim. In Morocco and Mauritania, Muslims recite in the recitation of Nafi’, while Muslims in Sudan recite the Qur’an in the recitation of Abu Amr bin Al-&#8216;Alaa&#8217;. Sunnis believe that these recitations were all taught by the Prophet – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">Most Shias are simply not aware that these recitations of the Qur’an are not endorsed by their Imams. By returning to their authentic sayings, we find the Imam saying, “The Qur’an is one and it is from the One, and these difference are from the recitors.” 2\/348-349 In other words, these recitations, although permitted by the Imams, are <strong>not<\/strong> considered legitimate.<\/p>\n<p style=\"text-align: justify;\">Top Shia scholars, in the present and the past, have echoed these feelings, claiming that the current recitation that is adopted by all Shias today, the recitation of Hafs from Asim, is false. Al-Tusi in Tahtheeb Al-Ahkam 1\/53, for example, states that the common recitation of the verse of ablution is <strong>not permissible<\/strong>. <a href=\"http:\/\/www.twelvershia.net\/2015\/09\/19\/response-to-the-collection-and-preservation-of-the-quran\/\">Al-Khoei<\/a>, too, has severely criticized Hafs from Asim, the main recitors of the recitation relied upon by Shias. He also goes as far to say that one cannot take rulings from these recitations.<\/p>\n<p style=\"text-align: justify;\">With this in mind, it becomes undeniable that Shias do not hold onto the greater of the two-weighty things (Thaqalayn).<\/p>\n<h2 style=\"text-align: justify;\"><strong>Holding onto Ahl Al-Bayt<\/strong><\/h2>\n<p style=\"text-align: justify;\">The concept of holding onto Ahl Al-Bayt may seem synonymous with Shiasm, yet, the claim sometimes seems like nothing more than a marketing gimmick to reel Sunnis in. According to the Shia understanding of the narration, one is supposed to hold onto the Twelve Imams from Ahl Al-Bayt. However, there is nothing in the narration that limits it to those Twelve. If that was the intended purpose of the Prophet – peace be upon him &#8211; , he would have said, “Hold onto the Imams from Ahl Al-Albayt,” or perhaps, &#8220;hold onto the twelve from my Ahl Al-Bayt,&#8221; instead. Besides, it is not possible for one to follow the Twelve Imams due to their countless contradictions due to <em><a href=\"http:\/\/www.twelvershia.net\/2014\/05\/29\/taqiyya-the-other-face\/\">taqiyyah<\/a>. <\/em><\/p>\n<p style=\"text-align: justify;\">It should be known that Ahl Al-Sunnah do not believe that notable scholars like Al-Baqir and Al-Sadiq ever practiced <em>taqiyyah<\/em>, and that they were god-fearing men that would rather die before teaching their followers false rulings.<\/p>\n<p style=\"text-align: justify;\">Keep in mind that we are led to believe that the proper understanding of the narration is to hold onto Ahl Al-Bayt as a whole, instead of limiting Ahl Al-Bayt to a small group.<\/p>\n<p style=\"text-align: justify;\">It should come as no surprise that the Sunnis abide by this teaching.<\/p>\n<p style=\"text-align: justify;\">Not only do Sunnis take knowledge from Ali bin Abi Talib, Al-Hassan, Al-Hussain, Zain Al-Abideen, Al-Baqir, Al-Sadiq, Al-Kathim, etc, but they took knowledge from<strong> all the scholars of Ahl Al-Bayt.<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Hakim Al-Nisapuri (Ma’rifat Uloom Al-Hadith p. 221) said, “There are authentic narrations from the children of the Prophet – peace be upon him &#8211; , from Fatima, Al-Hassan, Al-Husain, Al-Hassan bin Al-Hassan bin Ali, Abdullah, Hassan, Ali, and Zayd bin Al-Hassan bin Al-Husain bin Ali, Amr bin Al-Hassan bin Ali, Muhammad bin Amr bin Hassan bin Ali, Al-Hassan bin Zayd bin Hassan bin Ali, Musa bin Abdullah bin Al-Hassan bin Al-Hassan, Muhammad bin Abdullah bin Al-Hassan bin Al-Hassan bin Ali, Ali bin al Husain bin Ali, Fatima bint Al-Husain bin Ali, Muhammad, Abdullah, Zayd, Omar, and Al-Husain bin Ali bin Al-Husain, Jafar bin Muhammad bin Ali, and Al-Hussein bin Zayd bin Ali are those that have authentic narrations, and we have over <strong>two hundred <\/strong>narrators from Ahl Al-Bayt both men and women.”<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/04\/اعلام.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"size-thumbnail wp-image-4028 alignleft\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/04\/اعلام-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>Sunnis were also known to have taken knowledge from the scholars of Ahl Al-Bayt that happened to be scholars from the <a href=\"http:\/\/www.twelvershia.net\/2013\/05\/02\/hanafi-scholars-from-ahlul-bayt\/\">Hanafi<\/a>  (108 scholars), Maliki (168 scholars), Shafi’ee (200 scholars), and Hanbali (143 scholars) schools of <em>fiqh<\/em>.<\/p>\n<p style=\"text-align: justify;\"><strong>Note: <\/strong>The full list and biographies of these scholars can be obtained in the following works: A’alam Al-Hanafiyyah min Ahl Al-Bayt by Wa’el bin Mohammad Al-Hanbali, A’alam Al-Malikiyya min Ahl Al-Bayt by Rizq Mohammad Abdul-Haleem, A’alam Al-Shafi’eeya min Ahl Al-Bayt by Bassam Abdul-Kareem Al-Hamzawi, and A’alam Al-Hanabila min Ahl Al-Bayt by Mohammad Yusuf Al-Muzaini.<\/p>\n<p style=\"text-align: justify;\">In total, Ahl Al-Sunnah took knowledge from over <strong>eight-hundred­<\/strong> members of Ahl Al-Bayt.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">There is no doubt in mind that Shias cannot claim to hold onto the Qur’an since the orthodox view is the rejection of the recitations. They have also misinterpreted the act of “holding onto Ahl Al-Bayt” as well by limiting the members of Ahl Al-Bayt to twelve.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The question of who holds onto the Thaqalayn is a common one that is often brought up in Sunni-Shia polemics. This article sheds light on the fact that&#8230; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/04\/29\/who-holds-onto-thaqalayn\/\" title=\"Who holds onto the Thaqalayn?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4029,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,14],"tags":[],"class_list":{"0":"post-4027","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-popular-topics"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4027","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4027"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4027\/revisions"}],"predecessor-version":[{"id":4037,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4027\/revisions\/4037"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4029"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4027"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4027"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4027"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}