{"id":4058,"date":"2017-05-30T01:49:17","date_gmt":"2017-05-30T01:49:17","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4058"},"modified":"2018-10-30T14:38:18","modified_gmt":"2018-10-30T14:38:18","slug":"taraweeh-prayer-evil-bidah-blessed-sunnah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/05\/30\/taraweeh-prayer-evil-bidah-blessed-sunnah\/","title":{"rendered":"Taraweeh prayer &#8211; An Evil Bid`ah OR Blessed Sunnah?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4058\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\">Read this article in <a href=\"http:\/\/www.shia-islam.se\/taraweeh-bonen-en-ond-innovation-eller-en-valsignad-sunnah\/\" rel=\"external nofollow\">Swedish<\/a><\/p>\n<p style=\"text-align: justify;\"><strong><br \/>\nPART-I: WHY ATTACK `UMAR FOR ESTABLISHING TARAWEEH?<\/strong><\/p>\n<p style=\"text-align: justify;\">Peace be upon our dear readers, this article shall briefly discuss the practice known today as &#8220;Taraweeh&#8221;.<\/p>\n<p style=\"text-align: justify;\">Taraweeh as you all know are voluntary night prayers performed in Ramadan after the obligatory `Isha&#8217; and before the Fajr of the next day.<\/p>\n<p style=\"text-align: justify;\">This prayer was not called &#8220;Tarweeh&#8221; at the time, it was later labeled by this name by Muslims and it became popular for it.<\/p>\n<p style=\"text-align: justify;\">The second Caliph of Islam, al-Farooq `Umar bin al-Khattab is accused by a group of deviants (the Shia) of having invented this horrible practice.<\/p>\n<p style=\"text-align: justify;\">`Umar may Allah be pleased with him is viewed by Shiites as an evil man whose main purpose is to break the pillars of Islam, weaken the faith and erase the true teachings of religion.<\/p>\n<p style=\"text-align: justify;\">However, `Umar is also viewed as a noble and pious believer with great achievements by the vast majority of Muslims throughout the ages, so how does that make sense? Well, Shiites explain that `Umar only presented outward Islam but internally was a selfish-hypocrite.<\/p>\n<p style=\"text-align: justify;\">The first issue we tackle in this article is this accusation of hypocrisy. We Ahlul-Sunnah argue: what sense does it make for this evil and selfish person, to go out of his way and encourage people to pray extra during the month of Ramadan?<\/p>\n<p style=\"text-align: justify;\">From what I understood, based on the Qur&#8217;an and the prophetic-teachings, a hypocrite is primarily a person who dislikes worshiping God and avoids it at all costs.<\/p>\n<p style=\"text-align: justify;\">{Indeed, the hypocrites [think to] deceive Allah, but He is deceiving them. And when they stand for prayer, they stand lazily} [4:142]<\/p>\n<p style=\"text-align: justify;\">If `Umar detested prayer and wished to enjoy his time, why force himself to stand up for long hours at night for Taraweeh? Why invent Taraweeh and inconvenience himself with such annoyance?<\/p>\n<p style=\"text-align: justify;\">{The hypocrite men and hypocrite women are of one another. They enjoin what is wrong and forbid what is right} [9:67]<\/p>\n<p style=\"text-align: justify;\">And here we ask, is encouraging people to pray during the nights of Ramadan right or wrong? Was `Umar enjoining what&#8217;s wrong by advising them to pray more?<\/p>\n<p style=\"text-align: justify;\">قال النبي: أثقل الصلاة على المنافقين صلاة العشاء وصلاة الفجر ولو يعلمون ما فيهما لأتوهما ولو حبوا<\/p>\n<p style=\"text-align: justify;\">[Aba Hurayrah reported: The Prophet (saw) said: &#8220;The most difficult prayers for hypocrites are the `Isha&#8217; and Fajr prayers. If only they knew the virtues of these two they would have crawled to attend them.&#8221; (Sahih al-Bukhari)]<\/p>\n<p style=\"text-align: justify;\">In the above prophetic-narration, we see that two prayers are much more annoying for hypocrites than others, `Isha&#8217; and Fajr. Why is this? Because one of them is at night after a long tiring day of work while the other is early at dawn when people are sleepy, this is why hypocrites often skip them.<\/p>\n<p style=\"text-align: justify;\">Yet, we notice that the prayer that `Umar upheld was AFTER `Isha&#8217;. Wouldn&#8217;t a hypocrite like to skip these long night prayers and rest at home? In fact, `Umar was assassinated while leading people during Fajr prayer.<\/p>\n<p style=\"text-align: justify;\">From the above, we conclude that the Shia are not reasonable in their claim that `Umar bin al-Khattab was an evil-hypocrite who wished to corrupt the religion.<\/p>\n<p style=\"text-align: justify;\"><strong>PART-II: THE ORIGIN OF THE &#8220;TARAWEEH&#8221; PRAYER<\/strong><\/p>\n<p style=\"text-align: justify;\">NEXT, we discuss the condition of the people before `Umar&#8217;s reign. What did the Prophet (saw) say about these extra night prayers?<\/p>\n<p style=\"text-align: justify;\">عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ ثُمَّ يَقُولُ‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ<\/p>\n<p style=\"text-align: justify;\">[Aba Hurayrah narrates: The Messenger of God (saw) used to commend prayer at night during Ramadan but did not command it as a duty. He (saw) used to say: &#8220;Whoever spends the nights of Ramadan in prayer, out of piety and to seek God&#8217;s reward, his previous sins will be forgiven for him.&#8221; (Sahih Muslim)]<\/p>\n<p style=\"text-align: justify;\">عن عبد الرحمن بن عوف أن النبي صلى الله عليه وسلم قال : إن الله عز وجل فرض صيام رمضان ، وسننت قيامه ، فمن صامه وقامه إيمانا واحتسابا ، خرج من ذنوبه كيوم ولدته أمه<\/p>\n<p style=\"text-align: justify;\">[`Abdul-Rahman bin `Awf narrates: The Prophet (saw) said: &#8220;God most glorious Has made Ramadan&#8217;s fast obligatory while I have made it my tradition to stay up in prayer during the nights. Whosoever shall fast and pray the nights in piety while seeking its rewards will be released from his sins as his mother released him at birth.&#8221; (Musnad Ahmad)]<\/p>\n<p style=\"text-align: justify;\">From this we learn:<\/p>\n<p style=\"text-align: justify;\">A- The Prophet (saw) encouraged them to spend the nights of Ramadan in prayer.<\/p>\n<p style=\"text-align: justify;\">B- The Prophet (saw) never declared that Taraweeh was obligatory.<\/p>\n<p style=\"text-align: justify;\">C- He (saw) described its great reward for the people.<\/p>\n<p style=\"text-align: justify;\">Alright, so we understand from the above that the people were praying during the nights in the mosques and the houses to seek this great bounty. The question now is, were they praying these prayers together in congregation or was it individual worship?<\/p>\n<p style=\"text-align: justify;\">عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ النَّاسُ يُصَلُّونَ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ بِاللَّيْلِ أَوْزَاعًا يَكُونُ مَعَ الرَّجُلِ الشَيْءُ مِنَ الْقُرْآنِ فَيَكُونُ مَعَهُ النَّفْرُ الْخَمْسَةُ أَوِ السِّتَّةُ وَأَقَلُّ مِنْ ذَلِكَ وَأَكْثَرُ , يُصَلُّونَ بِصَلَاتِهِ , قَالَتْ: فَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً مِنْ ذَاكَ أَنْ أَنْصِبَ لَهُ حَصِيرًا عَلَى بَابِ حُجْرَتِي , فَفَعَلْتُ , فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أَنْ صَلَّى الْعِشَاءَ الْآخِرَةَ فَاجْتَمَعَ إِلَيْهِ مَنْ فِي الْمَسْجِدِ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلًا طَوِيلًا<\/p>\n<p style=\"text-align: justify;\">[`A&#8217;ishah said: During Ramadan, the people used to pray at night inside the mosque of the Prophet (saw) and they&#8217;d be in random groups. If a man has memorized some Qur&#8217;an, he&#8217;d lead a party of five or six in these prayers. In one of these nights the Prophet (saw) ordered me to prepare for him a prayer mat outside my room and after he prayed the last `Isha&#8217; he left. Upon his arrival at the mosque, people gathered around him so he led them in long prayers during the night. (Nayl-ul-Awtar)]<\/p>\n<p style=\"text-align: justify;\">عَنْ أَبِي ذَرٍّ ، قَالَ : صُمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَضَانَ ، فَلَمْ يَقُمْ بِنَا شَيْئًا مِنَ الشَّهْرِ حَتَّى بَقِيَ سَبْعٌ ، فَقَامَ بِنَا حَتَّى ذَهَبَ ثُلُثُ اللَّيْلِ ، فَلَمَّا كَانَتِ السَّادِسَةُ لَمْ يَقُمْ بِنَا ، فَلَمَّا كَانَتِ الْخَامِسَةُ قَامَ بِنَا حَتَّى ذَهَبَ شَطْرُ اللَّيْلِ ، فَقُلْتُ : يَا رَسُولَ اللَّهِ ، لَوْ نَفَّلْتَنَا قِيَامَ هَذِهِ اللَّيْلَةِ ، قَالَ : فَقَالَ : إِنَّ الرَّجُلَ إِذَا صَلَّى مَعَ الْإِمَامِ حَتَّى يَنْصَرِفَ حُسِبَ لَهُ قِيَامُ لَيْلَةٍ ، قَالَ : فَلَمَّا كَانَتِ الرَّابِعَةُ لَمْ يَقُمْ ، فَلَمَّا كَانَتِ الثَّالِثَةُ جَمَعَ أَهْلَهُ وَنِسَاءَهُ وَالنَّاسَ ، فَقَامَ بِنَا حَتَّى خَشِينَا أَنْ يَفُوتَنَا الْفَلَاحُ ، قَالَ : قُلْتُ : وَمَا الْفَلَاحُ ؟ قَالَ : السُّحُورُ ، ثُمَّ لَمْ يَقُمْ بِقِيَّةَ الشَّهْرِ<\/p>\n<p style=\"text-align: justify;\">[Abu Dharr reported: We fasted Ramadan with the Messenger of Allah (saw) and he did not lead us in the night prayers (i.e Qiyam) until there were seven days left of the month, then he led us in night prayers until one-third of the night had passed. Then, when there were six days left, he did not lead us. When there were five days left, he led us in praying the night until half that night had passed. At that point, I requested: &#8220;O Messenger of Allah (saw), why don&#8217;t you lead us for the rest of this night?&#8221; He (saw) answered me: &#8220;Worry not, If a man prays with the leader until he leaves, it will be counted as if he spent the whole night in prayer.&#8221; Then, when there were four days left, he did not lead us in the night prayers. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying all throughout the night until we feared that we would miss &#8220;al-Falah&#8221;. He did not lead for the remainder of that month.&#8221; Dawud (one of the narrators) asked: &#8220;What is al-Falah?&#8221; I said: &#8220;The time of Suhur.&#8221; (Sunan al-Tirmidhi)]<\/p>\n<p style=\"text-align: justify;\">From this we learn:<\/p>\n<p style=\"text-align: justify;\">A- The Prophet (saw) did lead them in the long night prayers during Ramadan.<\/p>\n<p style=\"text-align: justify;\">B- He (saw) led them multiple times during the last third of Ramadan.<\/p>\n<p style=\"text-align: justify;\">So an Imam leading the people during the Qiyam of the evening does not seem to be an innovation or a new invention but the question now is why this peculiar pattern? Why did the Prophet (saw) do it on some days and drop it at other times randomly?<\/p>\n<p style=\"text-align: justify;\">عن عائشة &#8211; رضي الله عنها &#8211; : أن رسول الله &#8211; صلى الله عليه وسلم &#8211; صلى في المسجد ذات ليلة فصلى بصلاته ناس ، ثم صلى من القابلة فكثر الناس ، ثم اجتمعوا من الليلة الثالثة أو الرابعة ، فلم يخرج إليهم رسول الله &#8211; صلى الله عليه وسلم &#8211; فلما أصبح قال : &#8221; قد رأيت الذي صنعتم ، فلم يمنعني من الخروج إليكم إلا أني خشيت أن تفرض عليكم . قال : وذلك في رمضان<\/p>\n<p style=\"text-align: justify;\">[`A&#8217;ishah narrated: The Messenger (saw) prayed at the mosque one night and some people prayed behind him. Then he (saw) did similarly the next day and the number of people increased. On the third or fourth, people gathered but the Prophet (saw) never came out till morning, then he (saw) stood and addressed them saying: &#8220;I see what you&#8217;re doing and the only thing that prevented me from coming out to you was that I feared it may become a prescribed obligatory duty.&#8221; And that was in Ramadan. (Sunan al-Nasa&#8217;i al-Kubra)]<\/p>\n<p style=\"text-align: justify;\">From this we learn:<\/p>\n<p style=\"text-align: justify;\">A- The Prophet (saw) loved to pray Taraweeh in congregation alongside his Companions but he feared it would turn into an obligatory prayer so he avoided it.<\/p>\n<p style=\"text-align: justify;\">So what was the condition of the people when it comes to these night prayers during those times? To learn this, we quote the early renowned scholar Shihab-ul-Din al-Zuhri.<\/p>\n<p style=\"text-align: justify;\">قال ابن شهاب فتوفي رسول الله صلى الله عليه وسلم والأمر على ذلك ثم كان الأمر على ذلك في خلافة أبي بكر وصدرا من خلافة عمر بن الخطاب<\/p>\n<p style=\"text-align: justify;\">[Al-Zuhri said: So the Prophet (saw) passed away and the condition was as such during the Caliphate of Abi Bakr and the first part of `Umar bin al-Khattab&#8217;s Caliphate. (Muwatta&#8217; Malik)]<\/p>\n<p style=\"text-align: justify;\">Thus, people remained in that situation -some praying individually, others praying in congregation- inside the mosque until `Umar organized them in the Masjid. With this, we move to the main narration that gets the deviants riled up.<\/p>\n<p style=\"text-align: justify;\">عن عبد الرحمن بن عبد القاري أنه قال خرجت مع عمر بن الخطاب رضي الله عنه ليلة في رمضان إلى المسجد فإذا الناس أوزاع متفرقون يصلي الرجل لنفسه ويصلي الرجل فيصلي بصلاته الرهط فقال عمر إني أرى لو جمعت هؤلاء على قارئ واحد لكان أمثل ثم عزم فجمعهم على أبي بن كعب ثم خرجت معه ليلة أخرى والناس يصلون بصلاة قارئهم قال عمر نعم البدعة هذه والتي ينامون عنها أفضل من التي يقومون يريد آخر الليل وكان الناس يقومون أوله<\/p>\n<p style=\"text-align: justify;\">[Ibn `Abdul-Qari said: I went out to the mosque with `Umar bin al-Khattab on a night from the nights of Ramadan. As we entered, we saw that the people were divided, some praying individually and others forming groups and leading people. Upon this, `Umar said: &#8220;If I united these folks behind a single reciter that would be best.&#8221; After deciding on this, he gathered them behind Ubay bin Ka`b. The next night, I went out with him while the people stood behind their reciter (i.e Ubay) so `Umar said: &#8220;A blessed innovation this is. However, those who sleep during it have done even better than those who stay up.&#8221; He means those who stay up to pray at the end of the night as opposed to those who stay up to pray at the beginning of the night. (Sahih Bukhari)]<\/p>\n<p style=\"text-align: justify;\">From this we learn:<\/p>\n<p style=\"text-align: justify;\">A- People were still praying the nights of Ramadan as individuals and groups as the Messenger (saw) left them.<\/p>\n<p style=\"text-align: justify;\">B- Caliph `Umar decided to organize the Muslims behind one Imam in Taraweeh.<\/p>\n<p style=\"text-align: justify;\">C- Ubay bin Ka`b was the best Qur&#8217;anic reciter at that time.<\/p>\n<p style=\"text-align: justify;\">D- `Umar was satisfied with this decision and thinks it&#8217;s better.<\/p>\n<p style=\"text-align: justify;\">E- Praying the last part of the night is better than praying the first part of the night according to `Umar.<\/p>\n<p style=\"text-align: justify;\">F- People were free to join the congregation or pray the night prayers separately.<\/p>\n<p style=\"text-align: justify;\">The issue arises when people read the expression &#8220;A blessed innovation this is.&#8221; They think that `Umar has committed a sin by innovating. Truth of the matter, is that as you clearly saw from previous reports, `Umar never innovated a new thing in the religion.<\/p>\n<p style=\"text-align: justify;\">This is because the word &#8220;Bid`ah&#8221; can be used in its linguistic form or its technical scholarly form.<\/p>\n<p style=\"text-align: justify;\">An example is the word Sahabi (companion), in its linguistic form it simply means a person who accompanies you on a journey or a person who spends a lot of time with you. Whereas in its scholarly technical form it means: &#8220;Any person who saw the Prophet (saw), embraced Islam and died upon it.&#8221; A big difference.<\/p>\n<p style=\"text-align: justify;\">Another example is the word Hadith (narration), in its linguistic form it simply means any story you narrate about anything. Whereas in its scholarly technical form it means: &#8220;Any words, actions or confirmations by the Prophet (saw).&#8221;<\/p>\n<p style=\"text-align: justify;\">Likewise, the word Bid`ah (innovation), in its linguistic form means any change whether good or bad, such as the Qur&#8217;an being printed on paper instead of animal skin like in the past. This simply makes accessing it and preserving it more convenient, it does not change the Qur&#8217;an&#8217;s nature, text or status. Whereas the technical term is referred to as &#8220;Ihdaath&#8221; or &#8220;Adding new religious tenets without precedent or subtracting from the religious tenets without excuse.&#8221;<\/p>\n<p style=\"text-align: justify;\">When `Umar used it he simply meant &#8220;This is a blessed change&#8221; or &#8220;A change for the best&#8221; not that he added something to the religion or changed the tradition of night prayers that was previously established by Rasul-Allah (saw). Furthermore, `Umar is often praised for reviving this blessed tradition since after the seal of prophet-hood there was no chance of it becoming obligatory duty because revelation ended (which was the only reason the Messenger (saw) never did it regularly).<\/p>\n<p style=\"text-align: justify;\">It also seems from the narration, that `Umar believes it&#8217;s more rewarding to sleep after `Isha&#8217; and wake up to pray these same night prayers before Fajr. However, most people played it safe since there were no alarm clocks to wake you before Fajr Adhan so Taraweeh was most popular at this time.<\/p>\n<p style=\"text-align: justify;\"><strong>PART-III: WHAT DID `ALI BIN ABI TALIB THINK OF TARAWEEH?<\/strong><\/p>\n<p style=\"text-align: justify;\">LASTLY, what do we read concerning the opinion of `Ali bin abi Talib regarding the Taraweeh prayer?<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنِي مُحَمَّدُ بْنُ الْحَارِثِ الْخَرَّازُ ، قَالَ : ثنا سِنَانُ بْنُ حَاتِمٍ ، قثنا جَعْفَرُ بْنُ سُلَيْمَانَ ، قثنا حُبَابٌ الْقُطَعِيُّ ، عَنْ أَبِي إِسْحَاقَ الْهَمْدَانِيِّ ، قَالَ : خَرَجَ عَلِيُّ بْنُ أَبِي طَالِبٍ عَلَيْهِ السَّلامُ فِي أَوَّلِ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ وَالْقَنَادِيلُ تُزْهِرُ ، وَكِتَابُ اللَّهِ يُتْلَى فِي الْمَسَاجِدِ ، فَقَالَ : نَوَّرَ اللَّهُ لَكَ يَا عُمَرُ ابْنَ الْخَطَّابِ فِي قَبْرِكَ ، كَمَا نَوَّرْتَ مَسَاجِدَ اللَّهِ بِالْقُرْآنِ<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin al-Harith al-Kharraz told me: Sinan bin Hatim told us: Ja`far bin Sulayman told us: Hubab al-Quta`i told us: from abi Ishaq al-Hamdani, he said: `Ali bin abi Talib went out on the first night of Ramadan while lanterns were glowing and God&#8217;s Book was recited in the mosques (during Taraweeh). `Ali then supplicated: &#8220;May Allah fill your grave with light O `Umar bin al-Khattab as you&#8217;ve lit God&#8217;s houses with the Qur&#8217;an.&#8221; (Fada&#8217;il-Ramadan li Ibn abi al-Duniya)]<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا ابْنُ مَخْلَدٍ قَالَ : حَدَّثَنَا أَبُو الْعَبَّاسِ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يُونُسَ السَّرَّاجُ قَالَ : حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ يَعْنِي ابْنَ رَبِيعَةَ قَالَ : حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ , عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ , عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَ : أَمَّنَا عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ فِي قِيَامِ شَهْرِ رَمَضَانَ قَالَ : وَمَرَّ بِبَعْضِ مَسَاجِدِ أَهْلِ الْكُوفَةِ , وَهُمْ يُصَلُّونَ الْقِيَامَ فَقَالَ : نَوَّرَ اللَّهُ قَبْرَكَ يَا ابْنَ الْخَطَّابِ كَمَا نَوَّرْتَ مَسَاجِدَنَا<\/p>\n<p style=\"text-align: justify;\">[We were told by Ibn Makhlad: abu al-`Abbas Muhammad bin `Abdul-Rahman bin Yunus al-Sarraj told us: `Abdullah bin Muhammad ibn Rabi`ah told us: Khalid bin `Abdullah al-Wasiti told us: from Hosayn bin `Abdul-Rahman, from abi `Abdul-Rahman al-Sulami who said: We were led in prayer in one of the mosques of Kufah by `Ali bin abi Talib during the night prayers of Ramadan. As `Ali passed by some of the mosques of the people of Kufah as they performed their night prayers he said: &#8220;May Allah fill your grave with light O `Umar bin al-Khattab as you&#8217;ve lit our mosques.&#8221; (Shari`ah lil-Ajurri)]<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْحَارِثِ , بِبَابِ الشَّامِ قَالَ: حَدَّثَنَا عُبَيْدُ بْنُ إِسْحَاقَ قَالَ: حَدَّثَنَا سَيْفُ بْنُ عُمَرَ قَالَ: حَدَّثَنِي سَعْدُ بْنُ طَرِيفٍ , عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ: قَالَ عَلِيُّ رَضِيَ اللَّهُ عَنْهُ: &#8221; لَأَنَا حَرَّضْتُ عُمَرَ رَحِمَهُ اللَّهُ , وَرَضِيَ اللَّهُ عَنْهُ عَلَى قِيَامِ شَهْرِ رَمَضَانَ , أَخْبَرْتُهُ أَنَّ فَوْقَ السَّمَاءِ السَّابِعَةِ حَظِيرَةً؛ يُقَالُ لَهَا: حَظِيرَةُ الْقُدُسِ , فِيهَا قَوْمٌ يُقَالُ لَهُمُ: الرُّوحُ , فَإِذَا جَاءَتْ لَيْلَةُ الْقَدْرِ اسْتَأْذَنُوا رَبَّهُمْ عَزَّ وَجَلَّ فِي النُّزُولِ إِلَى الدُّنْيَا , فَلَا يَمُرُّونَ بِأَحَدٍ يُصَلِّي , أَوْ يَسْتَقْبِلُونَهُ فِي طَرِيقٍ إِلَّا أَصَابَهُ مِنْ ذَلِكَ بَرَكَةٌ قَالَ: فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ: إِذَنْ , وَاللَّهِ يَا أَبَا الْحَسَنِ , نَعْرِضُ النَّاسَ لِلْبَرَكَةِ , فَأَمَرَهُمْ بِالْقِيَامِ<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin abi Harith told us in Bab-ul-Sham: `Ubaydullah bin Ishaq told us: Sayf bin `Umar told us: Sa`d bin Tarif told us: from al-Asbagh bin Nubatah: `Ali bin abi Talib said: &#8220;I pushed `Umar may God have mercy on him to encourage the night prayers during the month of Ramadan, I told him that above the seventh sky is a garden called al-Quds and its dwellers are spirits; Whenever the night of Qadr came they take permission of their Lord to descend into the world. Every time they pass by a person praying he gets blessings.&#8221; `Umar responded: &#8220;If so, O aba al-Hasan, let us expose the people to these blessings.&#8221; He then told them to pray the night. (Al-Ibanah li Ibn Battah)]<\/p>\n<p style=\"text-align: justify;\">May God reward those who establish Taraweeh.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This article shall briefly discuss the practice known today as &#8220;Taraweeh&#8221; &#8211; a voluntary night prayer performed in Ramadan after the obligatory Isha prayer <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/05\/30\/taraweeh-prayer-evil-bidah-blessed-sunnah\/\" title=\"Taraweeh prayer &#8211; An Evil Bid`ah OR Blessed Sunnah?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4060,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,12],"tags":[],"class_list":{"0":"post-4058","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-featured-posts","8":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4058","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4058"}],"version-history":[{"count":13,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4058\/revisions"}],"predecessor-version":[{"id":4412,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4058\/revisions\/4412"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4060"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4058"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4058"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4058"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}