{"id":406,"date":"2013-05-30T19:40:02","date_gmt":"2013-05-30T19:40:02","guid":{"rendered":"http:\/\/twelvershia.net\/?p=406"},"modified":"2015-11-11T12:32:45","modified_gmt":"2015-11-11T12:32:45","slug":"ibn-saba-the-jew-the-spiritual-father-of-the-rafidha-an-unquestionable-truth","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/05\/30\/ibn-saba-the-jew-the-spiritual-father-of-the-rafidha-an-unquestionable-truth\/","title":{"rendered":"Ibn Saba’ The Jew, The Spiritual Father Of the Rafidha – An Unquestionable Truth"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=406\" alt=\"\" \/>Article written by one of the brothers at the famous &#8220;gift2shias.com&#8221; about the origins of the Imami Shi`ah movement, he asked us to post his article here.<\/p>\n<p>&nbsp;<\/p>\n<p>This is a lengthy article divided into three parts.<\/p>\n<p><em><strong>1.<\/strong> New phenomena: Outright rejection of the very existence of <a href=\"http:\/\/twelvershia.net\/2014\/09\/18\/abdullah-ibn-saba-the-book\/\" rel=\"external nofollow\">Ibn Saba<\/a>’ by contemporary Shia scholars and propagandists.<\/em><\/p>\n<p><em><strong>2.<\/strong> Ibn Saba’ the Jew in Shia books – an unknown reality to many Shias.<\/em><\/p>\n<p><em><strong>3.<\/strong> Shia Objection: Ibn Saba’ did exist, but Tashayyu’ (Shiism) and the Imamite sect are innocent of him.<\/em><\/p>\n<p>&nbsp;<\/p>\n<p>All Sunni and Shia authorities were agreed upon (the existence and reality of Abdullah bin Saba’ (although the Shia sect of course tries to deny that the foundation of Rafhd\/rejectionist was taken from a Jew) until the Orientalists such as Bernard Lewis, Julius Wellhausen, Friedlander, and Caetani Leone started to cast doubt about the existence of Abdullah bin Saba’, and they were followed in that by ignorants such as Taha Hussain, Muhammad Kaamil Hussain, Adnan Ibrahim and other pro-Shia Sunnis. Needless to say that the Rafidha scholars jumped on the wagon and (in contrary to their forefathers) suddenly claimed that Ibn Saba’ is actually a myth created by the evil Umayyads to tarnish the reputation of the Shias (a claim by the likes of Murtadha Al-’Askari, Muhammad Aal Kashif Al-Ghita etc.). Prior to 1300H (1900CE) there was no dispute about this matter at all. The contemporary Shia found in the writings of those Orientalists what was the delight of the eye and thus they began authoring in order to cast doubt about the existence of Abdullah bin Saba’, as this would allow them to dismiss a large part of the criticism against them and their sect.<\/p>\n<p>&nbsp;<\/p>\n<p>The contemporary Shia scholars  have written books in regards to this topic, the most famous (nearly on every Rafidhi propaganda website) one might be the apologetic work of ‘Ayatollah’ Murtadha Al-’Askari named:<\/p>\n<p>“ABDUL-AH IBN SABA AND OTHER MYTHS”.<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/abdullah-ibn-saba-other-myths.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-medium wp-image-407\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/abdullah-ibn-saba-other-myths-205x300.jpg\" alt=\"abdullah-ibn-saba-other-myths\" width=\"205\" height=\"300\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/05\/abdullah-ibn-saba-other-myths-205x300.jpg 205w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/05\/abdullah-ibn-saba-other-myths.jpg 405w\" sizes=\"auto, (max-width: 205px) 100vw, 205px\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Of course his book has been refuted (academically) by a number of scholars, such as:<\/p>\n<p><a href=\"http:\/\/www.saaid.net\/bahoth\/43.htm\" rel=\"external nofollow\">Dr. Sami Ataa’ Hassan – “‘Abdallah Ibn Saba the Yemenite Jew, between reality and imagination”<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>Sadly none of the books that refute the above Shia book were translated to other languages. However, we shall provide a sufficient refutation in this article inshaAllah.<\/p>\n<p>&nbsp;<\/p>\n<h2><span style=\"color: #800000;\">1. <em>New phenomena: Outright rejection of the very existence of Ibn Saba’ by a contemporary Shia scholars and propagandists. <\/em><\/span><\/h2>\n<p>&nbsp;<\/p>\n<p><strong>OBJECTION BY SHIAS:<\/strong> “Ibn Saba’ is a myth created by the Umayyads. The only person who narrated the story of Ibn Saba’ is Sayf Ibn Omar Al-Tamimi, a well known liar according to Sunni Hadithists themselves.<\/p>\n<p>&nbsp;<\/p>\n<h2>RESPONSE:<\/h2>\n<p>As a matter of fact – and we shall prove that, by the permission of Allah – Sunni narrations in regards to the existence of Ibn Saba’ have not been narrated through Sayf Ibn Omar Al-Tamimi only. In fact this is a myth (an actual myth) propagated by the contemporary Shias around the world. Let us take for example of the most infamous Shia propaganda websites on the net, namely &#8220;al-Islam.org&#8221; which says (in the online version of Murtadha Al-Askari’s “Ibn Saba’ and other myths”):<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The fabricated stories around the character of Abdullah Ibn Saba are the malicious production of one of the disciples of the devil, namely Sayf Ibn Umar al-Tamimi.<\/p>\n<p style=\"text-align: justify;\">Ibn Saba did not exist at that time, not even in the imagination of Saif Ibn Umar al-Tamimi who invented this character.<\/p>\n<p style=\"text-align: justify;\">As for those few traditions which have the chain of narrators (independent of Sayf), they provide a much different story which do not support any of the allegations of Sayf. These traditions picture an accursed man whom Ahlul-Bayt have declared their innocence from what he attributed to Imam Ali (declaring Ali as God). The Shia, their Imams and their scholars declare the curse of Allah to that man (if ever existed) he was lost, misguided and cursed. There is nothing in common between us [Shias] and his name except our curse on him and all other extremists who believed in deity of Ahlul-Bayt.<\/p>\n<\/blockquote>\n<p>Let us break down the major claims of those Shia who completely deny the existence of Ibn Saba’, as their ‘Ayatollah’ Al-’Askari did:<\/p>\n<p>A)<strong> As for those ‘few’ traditions which have the chain of narrators independent of Sayf, they do not support any of the allegations of Sayf, hence there is nothing in common between the Shia beliefs and the personality of Ibn Saba’<\/strong><\/p>\n<p>B) <strong>Sayf Ibn Umar al-Tamimi invented the character of Ibn Saba&#8217; (he has been weakened by Sunni Hadithists experts)<\/strong><\/p>\n<p>Let us analyse the so called ‘few’ narrations that according to Al-’Askari and other Shia propagandists do not support any of Sayf’s narrations and most importantly do not reflect any link between Shia beliefs and the beliefs that were propagated by the Jew Ibn Saba’.<\/p>\n<h2>Reports about Abdullah Ibn Saba which were NOT transmitted through Sayf Ibn Omar:<\/h2>\n<p><strong>Narration #1<\/strong><\/p>\n<blockquote><p>جاء في ( طوق الحمامة ) ليحيى بن حمزة الزبيدي عن سويد بن غفلة الجعفي الكوفي المتوفى عام (80هـ\/699م) أنه دخل على علي-رضي الله عنه- في إمارته، فقال: إني مررت بنفر يذكرون أبا بكر و عمر بسوء، ويروون أنك تضمر لهما مثل ذلك، منهم عبد الله بن سبأ، فقال علي: مالي ولهذا الخبيث الأسود، ثم قال : معاذ الله أن أضمر لهما إلا الحسن الجميل، ثم أرسل إلى ابن سبأ فسيره إلى المدائن، ونهض إلى المنبر، حتى اجتمع الناس أثنى عليهما خيرا، ثم قال : إذا بلغني عن أحد أنه يفضلني عليهما جلدته حد المفتري &#8211;<\/p>\n<p>الهي ظهير، إحسان، السنة والشيعة، نشر إدارة ترجمة السنة- الهور.<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p>In ‘Tuq Al-Hamamh’ by Yahya bin Hamzah Al-Zobaydi on the authority of bin Ghaflah Al-Jo’fi Al-Kufi (80H) who said that he entered upon Ali – may Allah be pleased with him and said: ‘I passed by some men. among them was Abdallah Ibn Saba’, who were talking negatively about Abu Bakr and Omar <strong>saying that <\/strong><strong>you [Ali] hold the same feelings towards them.’ Ali replied: ‘<\/strong>What does this wretched black man (Ibn Saba’s mother was Ethiopian) want from me?’ He then said: <strong>“I seek refuge in Allah in holding anything but beautiful respect for them both.”<\/strong> Then he sent after Ibn Saba and exiled him to Al-Mada’in (former capital of the Persian empire) and ascended the pulpit until the people were gathered, he then praised Abu Bakr and Omar, then he said: ‘<strong>If it reaches me that anyone prefers me over them then I shall lash them as they do with the slandering liar.’<\/strong><\/p>\n<p>NOTE: This very same narration has been narrated by through different channels with authentic chains such as in:<\/p>\n<p>‘Al-Seerah’ by Abu Ishaq al-Fizari who narrates almost the same narration above on the authority of Shu’ubah from Salamah bin Kaheel from abu Al-Za’araa from Zaid ibn Wahb. The grading: narrators are trustworthy.  Al-Khateeb made Takhreej for it in “al-Kifayah” p. 376 and said that Abu ‘Abdullah al-Boushanji graded it as Sahih, Abu Nasr Muhammad ibn ‘Abdullah al-Imam said in the commentary: It is narrated through other chains, it is Thabit. It’s last part i.e. Abu Bakr and Omar being the best of this Ummah as stated by Ali himself is Mutawatir.<\/p>\n<h2 id=\"post-8327\">Also note that all the major figures of the Ahl Al-Bayt throughout history reacted similar to Ali Ibn Abi Talib:<\/h2>\n<p>Zaid bin Ali bin Al-Hussein (Zayn Al-Abidin) bin Ali Ibn Abi Talib (RA) 80-122H. Leader of Alid revloution in Iraq against the Umayyads during the era of Ibn Abdil-Malik. He was betrayed by by the Kufan (Shias) when he refused to testify against Abu Bakr and Omar (RA). After he was betrayed he was compelled to fight the Umayyad army with only five hundred soldiers, where he died at that battle.<\/p>\n<blockquote><p>طلبة الرافضة من زيد ابن علي التبرؤ من أبو بكر و عمر فقال: إنهما وزيرا جدي, فقالوا له: إذا نرفضك, فقال لهم: إذهبوا فأنتم الرافضة.”<\/p>\n<p>&nbsp;<\/p><\/blockquote>\n<p>The Rafidha amongst the Shia told Zaid bin ‘Ali ibn Al-Hussein (RA) during his revolution that he has to abandon the love of Abu Bakr and Omar and he replied: “They are the companions of my grandfather”, they said to him: “Then we shall refuse you” so he said:”Go! for you are Al-Rafidah).”<\/p>\n<p>[Tu’oun Rafidat al-Yaman fi Sahabat al-Rassul, p17 by Abu Nasr Muhammad ibn ‘Abdullah al-Imam and he said: SAHIH]<\/p>\n<p>Similar report is present in Shia book:<\/p>\n<p>Zaid bin ‘Ali ibn Al-Hussein (RA) who holds an honor of very pious and respectable personality among the Shias was asked by his companions about Abu Bakar (RA) and Omar (RA),he replied: I always speak good of them and<strong> I have never heard any members of the family of the Prophe (SAWS) speak badly of them<\/strong>. They have never <strong>persecuted us nor did they maltreat any other citizen<\/strong>. Both of them strictly followed the Quran and Sunnah of the Prophet (SAWS). Hearing this they said you are not our companion , they separated from him. He said today they have left us , from today they will be called Rafidha<strong>. <\/strong><\/p>\n<p>(Nasikh al tawaarikh vol 2, page 590.(under the heading zain ul abedin’s saying) this book is popular and regarded as a reliable shiah document, see ayyan ush shiah (vol 2) page 132)<\/p>\n<p>Ja’far bin Muhammad (Al-Sadiq), from his Father Muhammad bin Ali (al Baqir), from Abdullah ibn Ja’far bin Abi Talib that he said: ” Abu Bakr Al-Siddeeq may Allah be pleased with him became our Caliph<strong> and he was the best of the Caliphs of Allah, he was most merciful and most caring towards us<\/strong>. “<\/p>\n<p><strong>sources:<\/strong><br \/>\n-Fadael al Sahaba by al Darqutni.<br \/>\n-al-Isabah by Ibn Hajar al Asqalani.<br \/>\n-al-Mustadraq ‘ala al-Sahihayn by al Hakim.<br \/>\n-Usool I’itiqad ahlulsunnah by al Lalikaee.<br \/>\n-al-Radd ‘ala al Rafidah by al Maqdisi.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Hadith grading:<\/strong> Al-Hakim said SAHIH and al-Dhahabi agreed with him, Ibn Hajar al Asqalani said the Hadith has a good chain of narrators.<\/p>\n<p>Abu Abdullah Ja’afar bin Muhammad (Al-Sadiq) said: “Allah has disassociated himsel<strong>f from those who have disassociated themselves from Abu Bakr and Omar<\/strong>.”<\/p>\n<blockquote><p>قال الذهبي : قلت: هذا القول متواتر عن جعفر الصادق، أشهد بالله إنه لبار في قوله غير منافق لأحد، فقبح الله الرافضة<\/p><\/blockquote>\n<p>Hadith Grading: Imam al Dhahabi (RH) said while commenting on the narration: “This saying is Mutawatir  from Ja’afar Al-Sadiq, I bear witness in front of Allah that he is honest in his saying and not lying in front of anyone (Taqiyah), may Allah increase the Rafidah in ugliness”.<\/p>\n<p><strong>source: <\/strong>Siyar A’alam al Nubalaa 6\/260.<\/p>\n<p><strong>Narration #2<\/strong><\/p>\n<blockquote><p>أخرج ابن عساكر عن زيد بن وهب الجهني الكوفي المتوفى عام (90هـ\/709م) قال: (قال علي بن أبي طالب: مالي ولهذا الخبيث الأسود-يعني عبد الله بن سبأ- و كان يقع في أبي بكر و عمر<\/p>\n<p>ابن عساكر، مختصر تاريخ دمشق، مرجع سابق، م 12، ص 222<\/p><\/blockquote>\n<p>Ibn ‘Asakir (Tarikh Dimashq) narrates on the authority of Zayd bin Wahb Al-Johayni Al-Kufi (90H) who said: ‘Ali said, “What do I have to do with this wicked black man?!’ He meant Abdallah bin Saba’ who used to attack Abu Bakr and Omar.<\/p>\n<p>NOTE: This narration can also be found in ‘Tarikh Ibn Abi Khaythama’ with trustworthy narrators.<\/p>\n<p><strong>Narration #3<\/strong><\/p>\n<blockquote><p>– أخبرنا أبو محمد بن طاوس وأبو يعلى حمزة بن الحسن بن المفرج ، قالا: أنا أبو القاسم بن أبي العلاء ، نا أبو محمد بن أبي نصر ، أنا خيثمة بن سليمان ، نا أحمد بن زهير بن حرب ، نا عمرو بن مرزوق أنا شعبة ، عن سلمة بن كهيل عن زيد قال : قال علي بن أبي طالب : مالي ولهذا الحميت الأسود ؟ يعني عبد الله ابن سبأ وكان يقع في أبي بكر وعمر.<\/p><\/blockquote>\n<p>On the authority of Abu Muhammad bin Tawoos and Abu Ya’la Hamza bin Al-Hassan bin Al-Faraq who said: ‘[&#8230;] on the authority of Salamah bin Kohayl who narrated from Zayd who said: ‘: ‘Ali said, “What do I have to do with this wicked black man?!’ He meant Abdallah bin Saba’ who used to attack Abu Bakr and Omar.<\/p>\n<p>Grading: Has a good Sanad of trustworthy narrators.<\/p>\n<p><strong>Narration #4<\/strong><\/p>\n<blockquote><p>6- أخبرنا أبو المظفر بن القشيرى ، أنا أبو سعد الجنزروذى ، أنا أبوعمرو ابن حمدان ، وأخبرنا أبو سهل محمد بن إبراهيم بن سعدويه ، أنا أبو يعلى الموصلي ، نا أبو كريب محمد بن العلاء الهمداني , نا محمد أبن الحسن الأسدى ، نا هارون بن صالح الهمداني ، عن الحارث أبن عبد الرحمن عن أبي الجلاس ، قال : سمعت عليا يقول لعبد الله السبئي : ويلك والله ما أفضي إلي بشيء كتمه أحداً من الناس ، ولقد سمعته يقول : أن بين يدي الساعة ثلاثين كذابا وإنك لا حدهم . قالا : وانا أبو يعلى ، نا أبو بكر بن أبي شيبة ، نا محمد أبن الحسن ، زاد أبن المقرىء الأسدي بإسناده مثله .<\/p><\/blockquote>\n<p>‘Ali tells ibn Saba’: ‘Woe to you! by Allah he (Prophet) did not tell me anything that he kept hidden from others, I heard him say that from now until the hour there will be thirty liars and you are one of them.”<\/p>\n<p>Grading: Some of the narrators have been criticized but it has been narrated through several other chains with better narrators.<\/p>\n<p><strong>Narration #5<\/strong><\/p>\n<blockquote><p>7- أخبرنا أبو بكر أحمد بن المظفر بن الحسين بن سوسن التمار في كتابة ، وأخبرني أبو طاهر محمد بن محمد بن عبد الله السبخي بمرو ، عنه ، أنا أبو علي بن شاذان ، نا أبو بكر محمد بن عبد الله بن يونس أبو الأحوص عن مغيرة عن سماك قال : بلغ عليا أن ابن السواد ينتقض أبا بكر وعمر ، فدعا به ودعا بالسيف أو قال فهم بقتله فكلم فيه فقال : لايساكني ببلد أنا فيه ، قال : فسير إلى المدائن .<\/p><\/blockquote>\n<p>Al-Sammak says: It had reached ‘Ali that Ibn Al-Sawda (nickname given to Ibn Saba’) was attacking Abu Bakr and ‘Omar so he called on him and he called for a sword but they talked him out of killing him so he said: “By Allah he will never live with me in the same city” and he was exiled to al-Madaen.<\/p>\n<p>Grading: Has trustworthy narrators but al-Sammak who is a follower in al-Kufa could not have heard it directly from ‘Ali.<\/p>\n<p><strong>Narration #6<\/strong><\/p>\n<blockquote><p>8 – أنبأنا أبو بكر محمد بن طرخان بن بلتكين بن يحكم ، أنا أبو الفضائل محمد أبن أحمد بن عبد الباقي بن طوق ، قال : قرىء على أبي القاسم عبيدالله ابن علي أبن عبيد الله الرقي ، نا أبو أحمد عبيد الله بن محمد أبن أبى مسلم ، أنا أبو عمر محمد بن عبد الواحد ، أخبرني الغطافي ، عن رجاله ، عن الصادق عن آبائه الطاهرين عن جابر قال : لما بويع علي خطب الناس فقام إليه عبد الله بن سبأ فقال له : أنت دابة الأرض ، قال فقال له : اتق الله ، فقال له : أنت الملك ، فقال له : اتق الله ، فقال له : أنت خلقت الخلق ، وبسطت الرزق ، فأمر بقتله ، فاجتمعت الرافضة فقالت : دعه وانفه إلى ساباط المدائن فإنك إن قتلته بالمدينة خرجت أصحابه علينا وشيعته ، فنفاه إلي ساباط المدائن فثم القرامطة والرافضة ، قال : ثم قامت إليه طائفة وهم السبئية وكانوا أحد عشر رجلا فقال أرجعوا فإني علي بن أبي طالب أبي مشهور وأمي مشهورة ، وانا أبن عم محمد صلي الله عليه وسلم فقالوا لا نرجع ، دع داعيك فأحرقهم بالنار ، وقبورهم في صحراء أحد عشر مشهورة فقال من بقي ممن لم يكشف رأسه منهم علينا : أنه إله ، واحتجوا بقول ابن عباس : ” لا يعذب بالنار إلا خالقها ” . قال ثعلب : وقد عذب بالنار قبل علي أبو بكر الصديق شيخ الإسلام رضي الله عنه وذاك أنه رفع إليه رجل يقال له : الفجأة وقالوا إنه شتم النبي صلي الله عليه وسلم بعد وفاته ، فأخرجه إلى الصحراء فأحرقه بالنار . قال فقال ابن عباس : قد عذب أبو بكر بالنار فاعبدوه أيضا.<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p>‘Ali stood as a Khateeb amongst the people after Bay’ah then Ibn Saba’ went to him and said: You are the beast of the earth, Ali said: fear Allah! so Ibn Saba said: You are Al-Malik, Ali said: Fear Allah! so Ibn Saba said:<strong> you created the creations and offered the bounties<\/strong>, So ‘Ali ordered that he be killed but the Rafidhah told ‘Ali: leave him be it is better if you exile him to al-Madaen in Yemen otherwise his Shias and followers will rebel against us…until the end of the narration.<\/p>\n<p>Grading: All narrators are trustworthy except for one unknown narrator called al-Ghattafi who has not been documented, could be a mistake in copying the name.<\/p>\n<p>&nbsp;<\/p>\n<p>These were  six reports in Sunni books alone about Abdullah Ibn Saba which were NOT transmitted through Sayf Ibn Omar. Sheikh Suleiman bin Hamad al-’Awdah graded these narrations in his book ”‘<em>Abdullah bin Saba’ wa Atharuhu fi Ahdath al-Fitnah fi Sadr al-Islam<\/em>“ ”عبد الله بن سبأ و أثره في أحداث الفتنة في صدر الإسلام ” in total he quotes eight narrations which in return all strenghten the narrations of Sayf Ibn Omar. There is no doubt that Sabaite beliefs have been ascribed to the Ahl Al-Bayt and the prove according to Sunni narrations are the facts stating in the narrations above, let us make a summary:<\/p>\n<p><span style=\"color: #ff0000;\"><strong>Sabaism:<\/strong><\/span> Ali held grudge against his fellow Sahaba, particularly Abu Bakr and Omar. He ascribed this belief of Ali and his excuse was that he is merely doing it out of ‘love for the Ahl Al-Bayt and hatred towards their enemies’ (Tawalli and Tabari).<\/p>\n<p><span style=\"color: #ff0000;\"><strong>Rafidhi Shiism:<\/strong><\/span> Rafdh (rejectionism) represented by countless sects (today’s mostly made up by Twelver Shias) is the only sect that propagates the very same Sabaite belief that Ali held grudge against Abu Bakr and Omar and the Sahaba, Ali hated them and they were the enemies of the Ahl Al-Bayt and it is a sign of love to hate them (Sahaba) since they were Ali’s enemies.<\/p>\n<p><strong><span style=\"color: #008000;\">Reality (Islam):<\/span> <\/strong>Ali did not just reject those beliefs attributed to him, he in fact seeked refuge in Allah and was about to execute Ibn Saba’ for propagating such beliefs in his (Ali’s name) and  under the excuse of ‘loving the Ahl Al-Bayt and hating their enemies’. He deported Ibn Saba’ and threatened everyone who prefers him (Ali) over Abu Bakr and Omar with lashes as they do with the slandering liar.<\/p>\n<p>As you can see, the claim that there is “nothing in common” between Shias (Rafidha who by defenition are REJECTORS of the absolute majority of the Sahaba) and the beliefs propagated by Ibn Saba’ and reported by Sayf Ibn Omar (AND others …) is plain and simply not true, in fact Rafdhi Shiism throughout history always propagated the Sabaite belief that Ali hated Abu Bakr and Omar and the Sahaba. So there is a link between Ibn Saba’s  lie and what the Rafidha have wrongly ascribed to the Ahl Al-Bayt. This is why Sunni scholars rightly state that:<\/p>\n<p>“<strong>The foundation of Al-Rafd is taken from the Jews<\/strong>.”<\/p>\n<p>We need to be precise about our words and thus we believe that slogans like “Shiism was created by a Jew” are not accurate (enough), for  there is no unified monolithic “Shiaism”, in fact Shiism (Tashayyu’) had different meanings throughout Islamic history:<\/p>\n<p>Al-Dhahabi says: “The Ghaali (extremist) Shiite in the time of the Salaf (first three Muslims generations) and according to them is those that speak against Othman, Al-Zubair, Talha, Mu’awiyah, and those that fought Ali (RA), and attacked them”. (Al-Mizan, 1\/118)<\/p>\n<p>Ibn Hajar in his Muqaddamah of “Al-Huda Al-Sari”:<\/p>\n<blockquote><p>والتشيع محبة علي وتقديمه على الصحابة فمن قدمه على أبي بكر وعمر فهو غال في تشيعه<\/p><\/blockquote>\n<p>“And Tashayyu’ (Shiism) means having love for Ali and PREFERRING him over the Sahabah [in general], as for those who preferred him (Ali) even over Abu Bakr and Omar then they were the EXTREMIST (Ghulat) Shia”.<\/p>\n<p>&nbsp;<\/p>\n<p>I would like to remind the readers that the Shia of the past were different than today&#8217;s Shia. al-Shaykh al-Muhadith Shuaib al-Arnawut talks about the Shia of the past, as was recorded by one of his students from Turkey, Anbiya Yildirim.<\/p>\n<p>It is taken from book of Anbiya Yildirim “Hadisler ve zihinlerdeki sorular” (p 269), printed by Ragbet in Turkey.<\/p>\n<p>Shaykh Shuaib (hafizahullah) said:<\/p>\n<blockquote><p>As for takfir from modern shias toward some (people from) Ashara al-Mubashara, (and they saying that) “Abu Bakr, Umar, Uthman, Sad were disbelievers. Only Ali, Fatima and their two sons saved from disbelief”, when modern shias didn’t exist, this hadith (about 10 which were gladden by heaven) was in our books.  When was written “Musnad” and “Saheeh al-Bukhari” shias were not like shias of our time.  In that time when (someone said that such and such person) was shia, that mean he loved Ali more than Abu Bakr. There is nothing in love; man can love someone more than other.  (In the past) there was no scientist (meaning) of tashayu like in this time.  There was no ghulat (extreme view between shias) in the time of the mutakadimin.  They (ghulat) emerged after the 4-th year of hijra. I can show you bios of shia narrators, there are shias of fist generation in Bukhari, Muslim, Musnad.  So, Ahmad ibn Hanbal died in 241 h, and this hadith (about Ashara al-Mubashara) was recorded long time before his death.<br \/>\nSo, before shias distinguished from ahlesunnah, (before) they made themselves as independent school, (before) they took idea that they believe in, as a (major) point of their movement, these ahadeth (about companions which were gladden by paradise) took their place in books.  Did in that time were shias like these, so (someone could claim) that this hadith (about Ashara al-Mubashara) was fabricated (in attempt) to  protect (companions) from their charges?  So issue of takfir of muteahirin shias didn’t present in the time of mutakadimin.<\/p><\/blockquote>\n<p>The Shia in the past were by no means like the Twelvers today, yet nevertheless they were considered extremists (so what would the likes of Ibn Hajar and Al-Dhahabi call the Rafidha of today?!) for simply propagating and holding the belief that Ali is superior to Abu Bakr and Omar (a nonsense belief, for Mutawatir narrations prove without a shadow of a doubt that Ali believed in the superiority of Abu Bakr and Omar over himself). Shiism in its evolution reached the peak and propagated what Shias propagate to this very day namely that it was part of Ali’s belief that Abu Bakr and Omar are his enemies, so were the Sahaba and everyone else who rejected Ali as their so called him. Shiism today is propagated what Ibn Saba’ claimed and what Ali rejected, and based on that Ibn Saba’ is the spiritual father of Rafidhism and not that he literally created each and every aspect of the Shia sect.<\/p>\n<p>&nbsp;<\/p>\n<p>Rhetorical slips and a tendency not to be exact in our words is something that the enemies of the Ahl Al-Sunnah do take advantage of but every sane person should understand what is meant with the statement above and the message of this article which is that the foundation of Shiism (like Takfeer of the Sahaba, particularly Abu Bakr and Omar) is not a belief of the Ahl Al-Bayt, rather a Jewish belief that has been ascribed to the Ahl Al-Bayt by a Yemenite Jew.<\/p>\n<p>Now that the Shia MYTH has been debunked, namely that the personality of Ibn Saba’ was invented by the Umayyad Sayf Ibn Omar and narrated by him only, let us also provide you with some additional information, InshaAllah.<\/p>\n<p>&nbsp;<\/p>\n<p>al-islam org (citing Al-’Askari’s) book claim:<\/p>\n<blockquote><p>It appears that al-Tabari was the first who reported the story of Ibn Saba from Sayf, and then other historians quoted al-Tabari in this regard.<\/p><\/blockquote>\n<p>Al-’Askari and Shia propagandists are wrong (again) for over fifty years before Al-Tabari, namely by Al-Thakafi who wrote the book “Al Gharat”, Ibn Saba’ was also mentioned:<\/p>\n<blockquote><p>دخل عمرو بن الحمد وحجر بن عدي وحبة العوفي والحارث الاعور<strong> وعبد الله بن سبأ<\/strong> على أمير المؤمنين… –  الغارات ص302<\/p>\n<p>&nbsp;<\/p><\/blockquote>\n<p>“Amro bin Al-amd, Hajar bin Uday, Habbah Al-Awfy, Al-Harith Al-A’awar and <strong>Abdullah Ibn Saba’<\/strong> all entered on the Chief of the Believers (Ali) …” (Al-Gharat 302).<\/p>\n<p>Besides, <strong>the oldest<\/strong> reference to the term “Sabaite” is Diwan Ashi Hamdan , p. 147. A`sha Hamdan died in 83 H. Imam Tabari died 310 H. i.e. over 120 years after him. He says about Mukhtar Al-Thaqafi (the Kafir Shia saint) and his companions:<\/p>\n<div>شهدت عليكم أنكم سبئية وأني بكم يا شرطة الكفر عارف<\/div>\n<p>“I give testimony that you are<strong> Sabaites<\/strong>. O soldiers of kufr, I know you very well.”<\/p>\n<p>As for Sayf Ibn Omar having been declared a liar and a weak narrator by Sunni Hadithists themselves, al-islam org says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Here, later on, I give the sayings of several leading Sunni scholars, who all confirmed that Sayf Ibn Umar was an untrustworthy person and his stories are void….<\/p>\n<p style=\"text-align: justify;\">It is interesting to see that although al-Dhahabi (d. 748 AH) has quoted<br \/>\nfrom the book of Sayf in his History, he has mentioned in his other book<br \/>\nthat Sayf as a weak narrator. In “al-Mughni fi al-Dhu’afa’” al-Dhahabi<br \/>\nwrote:<\/p>\n<p style=\"text-align: justify;\">“Sayf has two books which have been unanimously abandoned by the<br \/>\nscholars.” (al-Mughni fi al-Dhu’afa’, by al-Dhahabi, p292)<\/p>\n<\/blockquote>\n<p>&nbsp;<\/p>\n<p>It’s not that he is a liar some of his narrations in History (hence Al-Dhahabi narrated from him history reports ONLY) are true but he is more of a story-teller as in he narrates the event without regard<strong> to accuracy of words<\/strong> but in the form of a fun story which is why as a narrator of<strong> Prophetic Hadith<\/strong> his narrations are rejected by consensus, here are some examples:<\/p>\n<p>&#8211; Al-Nasa’i (d. 303 AH) wrote: “Sayf’s narrations are weak and they should be disregarded because he was unreliable and untrustworthy.”<\/p>\n<p>&#8211; Yahya Ibn Mueen (d. 233 AH) wrote: “Sayf’s narrations are weak and useless.”<\/p>\n<p>&#8211; Abu Hatam (d. 277 AH) wrote: “Sayf’s Hadith is rejected.”<\/p>\n<p>These are just few exampled Shias like Al-’Askari love to quote, yet he hid other crucial sayings of the very same Sunni Hadithists in his books such as:<\/p>\n<p>&#8211; Ibn Abi Hatam (d. 327 AH) wrote: “Scholars have abandoned Sayf’s narrations.” al-Suyuti (d. 900 AH) wrote: “Sayf’s Hadith is weak.” <strong>But when it comes to Historical narrations what he says is taken into consideration<\/strong> unlike what the Shia claimed.<\/p>\n<p>Ibn Hajar al-’Asqalani says about him in Taqreeb al-Tahtheeb 1\/344: ابن حجر في تقريب التهذيب ( 1\/344 ): (عمدة في التاريخ)<strong>“Relied upon in history<\/strong>.”<\/p>\n<p>Al-Dhahabi says about him in Meezan al-I’itidal 2\/255: الذهبي في ميزان الاعتدال (2\/255): (كان إخباريا عارفا).”He was<strong> a knowledgeable historian<\/strong>.”<\/p>\n<p>For this reason the scholars (Very famous Islamic historians such as Muhammad Sobhi Hassan Hallaq, Muhammad ibn Tahir al-Barazanji, Sheikh Yahya Ibrahim al-Yahya, Dr.Khalid al-Ghayb in the university of Umm al-Qura.You can review books such as:<\/p>\n<p>-Istishhad `Uthman wa Waq`at al-Jamal fi Marwiyat Sayf ibn `Umar.<\/p>\n<p>-Sahih wa Da`eef Tareekh al-Tabari.<\/p>\n<p>&nbsp;<\/p>\n<p>They have placed certain rules to accepting any narration from Sayf Ibn Omar:<\/p>\n<p>1- What he says needs to have a Sahih foundation in the books of Hadith(i.e Sahih al-Bukhari) and it has to be taken from the reliable historical sources(i.e Tareekh Al-Tabari).<\/p>\n<p>2- His narrations must not have anything related to ‘Aqeedah and matters of Halal and Haram.<\/p>\n<p>3- His narrations must be free from any attacks on any of the companions.<\/p>\n<p>4- His narration must not be biased towards certain well known political positions during the rightly-guided caliphate.<\/p>\n<p>&nbsp;<\/p>\n<p>As you can see Al-’Askari and other Shia propagandists play a dirty game by showing the opinion of Hadithists in regards to Sayf Ibn Omar as a narrator of PROPHETIC AHADITH. No doubt, he is an untrustworthy person in regards to that, but as for history (according to Shias and Sunnis) narrations can be easier accepted, especially if there are supportive narrations, and in the case of Sayf Ibn Omar there are more than eight narrations we have provided which were NOT transmitted through Sayf Ibn Omar, so the exuse of him being a liar or being the only one who narrated about Ibn Saba’ and his connection to extremist Shiism (Rafidhism) is the actualy myth.<\/p>\n<blockquote><p>(إن أخبار الفتنة وصلتنا عن طرق أخرىغير طرق سيف بن عمر التيمي، وهذه الروايات بعمومها لا تخالف رواية سيف ، و إنما تؤكد صحتها و تضيف إليها بعض التفاصيل، و إذا كان المؤرخون يأخذون برواية سيف ، فلأنهم وجدوا فيها كشفا لليد الخفية التي كانت وراء تنظيم المعارضة على عثمان .. إلى إن يقول: لهذا لا يمكن إنكار وجود السبئية في أحداث ذكرها قدامى المؤرخين للملل و النحل، و مع وضوح حقيقة وجود السبئية يجب أن لا تخفى عن أعيننا الحقيقة الأخرى ، و هي : أنه لولا وجود المعارضة لما تمكن عبد الله بن سبأ من الوصول إلى أهدافه) (12)<\/p>\n<p>&nbsp;<\/p><\/blockquote>\n<h2><span style=\"color: #800000;\"><strong>2. Ibn Saba’ the Jew in Shia books (refutation of the saying that he is a myth!)<\/strong><\/span><\/h2>\n<p><strong> <\/strong><\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/nobakh2.gif\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-411\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/nobakh2.gif\" alt=\"nobakh2\" width=\"479\" height=\"481\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<blockquote><p>Translation:<\/p>\n<p>Abu Muhammad Al-Hasan bin Musa <strong>Al-Naubakhti<\/strong> (3rd Century Hijrah Shia Scholars, died 310H) on Abdullah bin Saba’<\/p>\n<p>This is a book authored by  <b>Abu Muhammad al-Hasan bin Moosaa al-Naubakhti<\/b> (d. before 300H). He is a third century Shi’i authorities and wrote on the sects and viewpoints of the Shia. On page 31 of this work (1st edition, 1412, Dar al-Rashaad) we see the following entry (see scan above) within which there occurs:<\/p>\n<p>“And a sect (from amongst them) which said: Ali was not killed and nor did he die, and he will not die until he drives the Arabs forth with his staff and fills the earth with justice and equity just as it had been filled with oppression and tyranny. This was the first sect of this Ummah that spoke of (the position of) al-waqf (withholding) after the Prophet (sallallaahu alayhi wasallam),<strong> and the first of them that spoke with exaggeration (al-ghuluww)<\/strong>, and<strong> this sect is called the Sab’iyyah, the associates of Abdullah bin Saba’, and he used to display revilement of Abu Bakr, Omar, Othmaan and the Companions and would free himself from them.<\/strong> And<strong> he said<\/strong> that Ali (alayhis-salaam) commanded him to do so. Ali took hold of him and asked him about this saying of his and he affirmed it, <strong>so he ordered that he be killed<\/strong>, but then the people protested, “O Amir al-Mu’mineen! Will you kill a man <strong>who calls to love of the Ahl al-Bayt, to your loyalty and disassociation from your enemies?<\/strong>” So instead, he exiled him to al-Madaa’in. <strong>A group from the people of knowledge<\/strong><strong>from the associates of Ali (alayhis-salaam)<\/strong> judged that Abdullah bin Saba’ was a Jew who then became Muslim and showed loyalty to Ali (alayhis salaam) and whilst he was a Jew he used to say the same of Joshua bin Nun after Moses (alayhis salaam) [as he said about Ali], and in his Islam, he (Ibn Saba’) would say the same of Ali (alayhis salaam) after the death of the Prophet (sallallaahu alayhi wasallam), with what is similar to that (what he used to say as a Jew).<strong> He was also the first to witness with the saying of the obligation of the leadership (imaamah) of Ali (alayhis salaam)<\/strong>, and he openly announced his disavowal of his enemies and declared them disbelievers. It is from here that whoever opposed the Shia said, “<strong>The foundation of al-Rafd is taken from the Jews<\/strong>.” When Abdullah bin Saba and his companions heard the announcement of Ali’s death whilst they were in al-Madaa’in, he said to the one who announced it, “You have lied O enemy of Allaah. Even if you came with Ali’s brain in seventy bundles, and you tasked seventy just men to kill him, we would not believe you due to our knowledge that he has not died and was not killed and that he will not die unti he drives the Arabs forth with his staff and dominates the earth.” From that day, he and his associates travelled until they came to the door (of the house of) Ali. They sought permission to enter from the one entrusted to look after him during his lifetime, hoping that they would reach him. Those who were present from his (Ali’s) family and associates and children said to them, “Glorified by Allaah! Do you know that Amir al-Mu’mineen has been martyred?” They said, “We know that he was not killed and will not die until he drives the Arabs forth with his sword and staff, just as he ruled them with his proof and evidence, and indeed he hears the secret-conversations and he glitters in the darknesses, just as the polished sword-edge.”<\/p><\/blockquote>\n<p>Now this is a clear-cut admission and this quote alone by their classical scholars themselves is enough to debunk all their (vain) efforts i.e. the REAL propaganda, namely that Ibn Saba’ is a myth invented by the Umayyads.<\/p>\n<h2>Al-Kashi (Abu ‘Amru Muhammad bin ‘Omar died 340H) in this ‘Ma’rifah Akhbar Al-Rijal’ (معرفة اخبار الرجال)<\/h2>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/kishi2.gif\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-409\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/kishi2.gif\" alt=\"kishi2\" width=\"479\" height=\"476\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<blockquote><p>Translation:<\/p>\n<p>“<strong>A group from the people of knowledge<\/strong><strong> <\/strong>mentioned that Abdullah bin Saba’ was a Jew who then became Muslim and showed loyalty to Ali (alayhis salaam) and whilst he was a Jew he used to say the same of Joshua bin Nun after Moses (alayhis salaam) [as he said about Ali], and in his Islam, he (Ibn Saba’) would say the same of Ali (alayhis salaam) after the death of the Prophet (sallallaahu alayhi wasallam), with what is similar to that (what he used to say as a Jew).<strong> He was also the first to witness with the saying of the obligation of the leadership (imaamah) of Ali (alayhis salaam)<\/strong>, and he openly announced his disavowal of his enemies and declared them disbelievers. It is from here that whoever opposed the Shia said, “<strong>The foundation of al-Rafd is taken from the Jews<\/strong>.”<\/p><\/blockquote>\n<p>Let us list what Al-Naubakhti and Al-Kashi have stated in a nutshell:<\/p>\n<p>1) <strong> The first sec<\/strong>t (lead by Ibn Saba’) that<strong> exaggerated (Al-Ghuluww) with the Ahl Al-Bayt\/Ali was the Sabaite (<\/strong><strong>Sab’iyyah) sect. Ali wanted to burn Ibn Saba’ alive for that, but expelled him, nevertheless once the Kufr was repeated by his followers (the Sabaites) he burned them alive (the later i.e. the burning is proven in Sunni and Shia narrations).<\/strong><\/p>\n<p>2) He was the first to<strong> display revilement of Abu Bakr, Omar, Othman and the Companions and would free himself from them (just as the Rafidha today, the only sect that does so!).<\/strong> And<strong> he said<\/strong> that Ali (alayhis-salaam) commanded him to do so (just as the Rafidha today claim). Ali wanted to KILL him for that (!) only due to the protest of the people he expelled him instead (punished him nevertheless).<\/p>\n<p>3) Al-Naubakhti says that ‘<strong>A group from the people of knowledge<\/strong><strong> from the associates of Ali (alayhis-salaam)<\/strong> judged that Abdullah bin Saba’ was a Jew who then became Muslim and showed loyalty to Ali (alayhis salaam).’<\/p>\n<p>The last part i.e. number three is essential (we will analyse number one and two later, Insha’Allah) for it is not just an admission that Ibn Saba’ did exist, rathe<strong>r he was the first who propagated the foundations<\/strong> (obviously not the whole Shia corpus which evolved during centuries) of Tashayyu’ which is <em>Al-Rafdh<\/em> (rejection the absolute majority of the Sahaba, especially Abu Bakr and Omar) and<em> Al-Ghuluw<\/em> (exaggeration) with the Ahl Al-Bayt\/Ali, two distinctive features that only the Rafidhi sect (in it’s different offshoots such as the Twelvers) holds, until this very day. For now, what is most important to is is the following admission:<\/p>\n<blockquote><p>وحكى جماعة من أهل العلم من أصحاب علي عليه السلام أن عبد الله بن سبأ كان يهوديا<\/p>\n<p>Al-Naubakhti and Al-Kashi say that ‘<strong>A group from the people of knowledge<\/strong><strong> (from the associates of Ali in Al-Naubakhti’s quote)<\/strong> judged that Abdullah bin Saba’ was a Jew …<\/p>\n<p>&nbsp;<\/p><\/blockquote>\n<p>As you can see – unlike some Rafidhi propagandists claim – the Shia scholars are not quoting Sunni sources or rumours about the Shia, rather they admit that a group <strong>from the people of knowledge from the associates of Ali<\/strong> (i.e. those who claimed to follow him) themselves admitted that a Ibn Saba’ the Jew existed and stated what we have listed above. We promised you before that it will take less then few minutes to debunk every Rafidhis speech or book when it comes to their desperate denial of the existence of Ibn Saba’.<\/p>\n<p>Know, that the above admission is so explosive that later Rafidha scholars  have resorted to omit the most crucial part of the admission (to make it look as if some nobodies have admitted that Ibn Saba’ existed and not Ahl Al-’Ilm\/People of Knowledge and followers of Ali). Here an exampled of their academical fraud to hide the truth about their spiritual forefather, Abu Al-Rafidha Ibn Saba’:<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/nd8ol2.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-medium wp-image-410\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/05\/nd8ol2-200x300.jpg\" alt=\"nd8ol2\" width=\"200\" height=\"300\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/05\/nd8ol2-200x300.jpg 200w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/05\/nd8ol2-683x1024.jpg 683w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/05\/nd8ol2.jpg 999w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>معجم رجال الحديث – السيد الخوئي – ج 11 – ص 206 – 207<\/h2>\n<p>Book: ‘Mo’jam Rijal Al-Hadeeth by Ayatollah Abul-Qasim Al-Khoie, vol. 11, p. 206-207<\/p>\n<p>The crime of the renowned Shia leader Al-Khoie who tried to hide the truth:<\/p>\n<p><b>وقال الكشي : ” ذكر بعض أن عبد الله بن سبأ كان يهوديا ـ<\/b><\/p>\n<p>Translation:<\/p>\n<blockquote><p>[Al-Khoie quotes Al-Kashi from Al-Sadooq&#8217;s &#8216;Ikhtiyar Ma&#8217;rifah Al-Rija;&#8217;]“<strong>Al-Kash<\/strong>i said: ‘that <strong>SOME <\/strong>mentioned that Abdullah bin Saba’ was a Jew …”<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>This is the wording he omitted from the original source he quoted:<em>  ”<strong>A group from the people of knowledge<\/strong><strong>“<\/strong><\/em><\/p>\n<p>And this is the wording he replaced the above with: <strong><em>“Some”<\/em><\/strong><\/p>\n<p>You see what difference it makes? The later suggests that it is some rumour by some unknown people. The former (the original that Al-Khoie tampered with) says that nobody less than<em><strong> the people of knowledge<\/strong> <\/em>confirmed the existence of a personality called Ibn Saba’ the Jew. In fact, they also confirmed that he was the very first who manifested revilement upon Abu Bakr, Omar, Othmaan and the Companions. And he is the first one who spoke of the Imaamah (leadership) of Amir al-Mu’mineen (alayhis salaam), and he is the one who said that Ali is the wasiyy of the Prophet (sallallaahu alayhi wa aalihi) (i.e. the one with whom the people were advised as a legacy) and (he claimed) he never said this except out of love for Ahl al-Bayt (exactly as the Rafidha do today), and calling to their allegiance and disavowing from their enemies, and they are the Companions and whoever allied with him upon his claim.<\/p>\n<p>So far we have gathered the admission of two Rafidha scholars: Al-Kashi and Al-Naubakhti and there are lots more, such as:<\/p>\n<p><strong>Al-Maamqaani<\/strong> (another Shia scholar, the Kafir who admitted that according to the consensus of the Rafidhi sect, all Sahaba apostated except three!) from his work <i>Tanqih al-Maqaal Fi Ilm al-Rijaal<\/i> (2\/183-184):<\/p>\n<blockquote><p>عبد الله بن سبأ الذي رجع إلى الكفر وأظهر الغلو … غال ملعون، حرقه أمير المؤمنين عليه السلام بالنار، وكان يزعم أن علياً إله، وأنه نبي<br \/>\nAbdullah bin Saba’ who returned to kufr (disbelief) and manifested Ehuluww (exaggeration)… Exaggerator, cursed one, Amir al-Mu’mineen burned him with the fire, and he used to claim that Ali is a deity and that he (Abdullah bin Saba’) is a prophet.<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p><strong>Sa’ad bin Abdullah al-Ash’ari al-Qummi<\/strong> who was speaking of the Sab’iyyah (in <i>al-Maqaalaat wal-Firaq<\/i> p. 20):<\/p>\n<blockquote><p>السبئية أصحاب عبد الله بن سبأ، وهو عبد الله بن وهب الراسبي الهمداني، وساعده على ذلك عبد الله بن خرسي وابن اسود وهما من أجل أصحابه، وكان أول من أظهر الطعن على أبي بكر وعمر وعثمان والصحابة وتبرأ منهم<br \/>\nAl-Sab’iyyah are the associates of Abdullah bin Saba’ and he is Abdullah bin Wahb al-Raasibee al-Hamdaani, and he was supported in that by Abullah bin Khurasi and Ibn Aswad and they are the loftiest of his companions, and the first of what he manifested was revilement upon Abu Bakr, Omar, Othmaan and the Companions and he freed himself from them.<\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<p><strong>Ni’matullat Al-Jaza’r<\/strong>i:<\/p>\n<blockquote><p>قال عبد الله بن سبأ لعلي عليه السلام: أنت الإله حقاً، فنفاه علي عليه السلام إلى المدائن، وقيل أنه كان يهودياً فأسلم، وكان في اليهودية يقول في يوشع بن نون وفي موسى مثل ما قال في علي<\/p>\n<p>Abdullah bin Saba’ said to Ali (alayhis salaam), “You are the deity in truth.” So Ali (alayhis-salaam) banished him to Al-Madaa’in, and it is said that he was a Jew who accepted Islam and whilst upon his Judaism he used to say about Joshua bin Noon and about Moses the likes of what he said about Ali.<\/p>\n<p>All the Shiah scholars have given an account of Ibn Saba, his views and beliefs and his party ;<br \/>\nSayyid Qummi [who died in 301H.], Sheykh Ta’ifah Tusi, Tastri in Qamus al-Rijal, Abbas Qummi in Tuhfat al-Ahbab, Khu Ansari in Raudhat al-Jannat, Sabhani in Nasikh al-Tawarikh and the author of Rawdhat al-Safa, have all mentioned him and his party”.<\/p><\/blockquote>\n<p>From all of the above, we have corroboration of the existence of the personality of Abdullah bin Saba’ the Jew and the existence of a faction who aided him and pronounced his call and they are known as Al-Sab’iyyah. Some Shia scholars are well aware of that fact, hence they do not reject all the evidence (there are also Sahih narrations by the Imams in Al-Kashi’s ‘Rijal’ cursing Ibn Saba’, did the Imams cursed mythtical figures?!) we have cited. As for those who reject the existence of Ibn Saba’ (such as Yasser Al-Khabith, Al-’Askari, Al-Wa’eli and many other Shia scholars and Shia preachers in the west such as Nakhjavani) then they have no leg to stand on as you can see.<\/p>\n<p>&nbsp;<\/p>\n<h2><span style=\"color: #800000;\">3. Shia Objection: Ibn Saba’ did existed, but Tashayyu’ (Shiism) and the Imamite sect are innocent of him.<\/span><\/h2>\n<p>&nbsp;<\/p>\n<p>As for those who do admit that the he existed, then of course they do not admit that Ibn Saba’ laid down the foundation of Tashayyu’ (Shiism), and with foundation we (and Sunni scholars throughout history) certainly do not mean the creed of loving the Ahl Al-Bayt, rather heretical beliefs propagated by the Rafidhi sect.  such as declaring the likes of Abu Bakr and Omar Kuffar, the belief in Raj’ah (return of the Imams before Judgement day), Wilayah Al-Takwiniyyah (Imams having absolute control over the creation\/atoms) etc.<\/p>\n<p>hat in regards to this group you have to obviously do more than just to prove the existence of Ibn Saba’.<\/p>\n<p>This group has at least the decency and academical level of not rejecting gospel truths in their own books i.e. the existence of Ibn Saba’ the Jew, yet they will reject <strong>any connection<\/strong>between Tashayyu’ (Shiism) and Sabaite propagated beliefs. They will refer you to the likes of Muhammad Ibn Al-Hassan Al-Tusi (major Rafidhi Shi’i scholar, died 460H) who cursed Ibn Saba’ himself and made Takfeer (declared him a Kafir) on him:<\/p>\n<p>&nbsp;<\/p>\n<p>(Al-Toosi, Rijaal, pg. 75, person # 718)<\/p>\n<p>TRANSLATION:<\/p>\n<p>“`Abd Allaah bin Saba – returned to kufr (disbelief) and it showed that he was a ghullah (exagerrator)”<\/p>\n<p>These Rawafidh will also refer to the Sahih narrations in Al-Kashi’s ‘Rijal’ where the Imams cursed Ibn Saba’ and based on that they will claim that although Ibn Saba’ existed, he certainly has no connection to the Shia Madhab. According to these apologetics Ibn Saba is a guy who has been cursed, by the Imams, merely because he tried to preach to the people the divinity of Ali, and not the Imamah of Ali.<\/p>\n<p>What these people overlook or try to blur out is the fact that Shia scholars did not only confirm that Ibn Saba’ teached to the people the divinity of Ali, rather<strong> he was also the first to preach two essential basics<\/strong> which are only to be found in the creed of the Rafidha:<\/p>\n<p>1) <strong>Ibn Saba was the first to display revilement of Abu Bakr, Omar, Othman and the Companions and would free himself from them.<\/strong> And<strong> he said<\/strong> that Ali (alayhis-salaam) commanded him to do so (just as the Rafidha today claim). Ali wanted to KILL him for that (!) only due to the protests of the people he expelled him instead i.e.(punished him nevertheless). This has been confirmed by Al-Naubakhti, Al-Kashi and (Saad Ibn Abdallah) Al-Qummi.<\/p>\n<p>2) <strong>Ibn Saba’ was also the first to witness with the saying of the obligation of the leadership (imaamah) of Ali<\/strong>, and he openly announced his disavowal of his enemies and declared them disbelievers (Takfeer Al-Sahaba). This is another admission by Shia scholars (not ‘Umayyads’) that cannot be dismissed that easily.<\/p>\n<p>It is from here that whoever opposed the Shia said, “<strong>The foundation of Al-Rafd is taken from the Jews<\/strong>.” and this is what the Muslims believe and the Ahl Al-Sunnah declare and within this precise slogan lies the answer to the sheer stupidty of Rafidhi propagators who ask questions such as:<\/p>\n<p><em>“What  Shia Usool can be traced back to Ibn Saba’?”<\/em><\/p>\n<p><em>“What Fiqh ruling?”<\/em><\/p>\n<p><em>“Which of our Imams praised Ibn Saba’”<\/em><\/p>\n<p><em>“How many Ahadith did we take from Ibn Saba’”<\/em><\/p>\n<p><em>“Are the Shia so stupid and ignorant that after 1400 years, they<\/em><br \/>\n<em>have never figured out that their belief and faith are based on fabricated<\/em><br \/>\n<em>traditions and tales going back to Abdullah Ibn Saba?”<\/em><\/p>\n<p><em>“If Abdullah Ibn Saba is such an influential and important figure for the<\/em><br \/>\n<em>Shia, how come they NEVER quote him like they do with the Imams of Ahlul<\/em><br \/>\n<em>Bayt? Surely, if Abdullah Ibn Saba was their Master Teacher, they must<\/em><br \/>\n<em>quote him and be proud to do so?”<\/em><\/p>\n<p>These questioned are seriously being asked by the likes of Al-’Askari, Allahyari (a Rabid Rafidhi pracher), Yasser Al-Khabeeth, Ammar Nakhjavani, Al-Wa’eli etc. and the answer is simple:<\/p>\n<p>Nobody, not a single Muslim-Sunnah scholar throughout history has ever claimed that Ibn Saba’ was the ‘Marja’-e-Taqlid’ of the Rafidha in the sense of them realising that they are in fact following his Jewish ideas. Heck, the Christ-Worshippers to this very day don’t realise or won’t accept the founder of their sect was Saulus the pagan and not Jesus (peace be upon him), they really think they are Shias (followers\/believers in) of Jesus. So what is meant by ‘Shiism was created by a Jew’ is that Shiism (not in the political sense, for many Sahaba where followers of Ali but certainly not Rafidha in creed) as a creed, particularly in regards to the Takfeer of the Sahaba (especially Shaykhayn i.e. Abu Bakr and Omar) and the claim of the obligation of the leadership (Imamat) of Ali (and the Ghuluw with him) is not the Madhab of the Ahl Al-Bayt, rather the Madhab of Ibn Saba’ the Jew who laid down these very foundations, he was the first  to propagate those beliefs, hence it has been said and will be always said that:<\/p>\n<p><em><strong>Ibn Saba’ is the spiritual father of the Rafidha, for he laid down foundations that can be found in no sect, except the Rafidhi sect (in his many offshoots such as the Twelvers today).<\/strong><\/em><\/p>\n<p>Many of those that have said that he is the created of Shiasm are referring to his views on Takfeer of the Sahaba, R<em>aja’ah <\/em>and his G<em>huluw (extremism) <\/em>for Ali, and that he was famous for holding these views. Perhaps to the extent that one would have a hard time finding someone who shared such views before him.However, if one is going to argue that Ibn Saba’a literally “created” Shiasm with all its foundations including Imamah and what not, then no, there is no such thing and nobody made that claim amongst the scholars, the whole point is that Ibn Saba’ laid down the foundations of Rafidhism which had been ascribed to the Ahl Al-Bayt, to this very day by the Twelver sects (foundations such as Takfeer of the Sahaba, Abu Bakr and Omar etc).<\/p>\n<p>&nbsp;<\/p>\n<div>\n<h2><span style=\"color: #800000;\"><strong>CONCLUSION:<\/strong><\/span><\/h2>\n<p>&nbsp;<\/p>\n<div><span style=\"color: #000000;\">Muslim scholars actually believe that his ideas are responsible<strong> for the evolution of Shiism<\/strong>, but not that he was Shiism actual founder (for Rafidi Shi’ism changed during centuries). You will find in Tareekh Dimashq a few more reports on Ibn Saba’ glorifying Ali and referring to him as a creator. Al-Jawzajani (d. 259 AH) in his book of <em>rijal<\/em> also refers to Ibn Saba’ and states that he said that we only have 1\/9 of the Qur’an, and the rest is with Ali… and over time, that perhaps turned into the view of T<em>ahreef<\/em>. The bottom line is we do see some of what Ibn Saba’ propagate in the name of the Ahl Al-Bayt come in the same form under what we know today as Shiism and is been proagated by Shiism in the name of the Ahl Al-Bayt.<\/span><\/div>\n<p>&nbsp;<\/p>\n<\/div>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Article written by one of the brothers at the famous &#8220;gift2shias.com&#8221; about the origins of the Imami Shi`ah movement, he asked us to post his article here. &nbsp; This is a lengthy article divided into three parts. 1. New phenomena: Outright rejection <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/05\/30\/ibn-saba-the-jew-the-spiritual-father-of-the-rafidha-an-unquestionable-truth\/\" title=\"Ibn Saba’ The Jew, The Spiritual Father Of the Rafidha – An Unquestionable Truth\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3845,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,8],"tags":[],"class_list":{"0":"post-406","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-taqiyyah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/406","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=406"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/406\/revisions"}],"predecessor-version":[{"id":2762,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/406\/revisions\/2762"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3845"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=406"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=406"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=406"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}