{"id":4157,"date":"2017-09-03T17:17:24","date_gmt":"2017-09-03T17:17:24","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4157"},"modified":"2018-06-09T07:00:31","modified_gmt":"2018-06-09T07:00:31","slug":"are-sunnis-going-to-hell","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/09\/03\/are-sunnis-going-to-hell\/","title":{"rendered":"Are Sunnis going to Hell?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4157\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/09\/Hassan-Rohani-and-Ayatollah-Ali-Khameni-e1504459373684.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-4159 size-medium alignleft\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/09\/Hassan-Rohani-and-Ayatollah-Ali-Khameni-e1504459373684-300x215.jpg\" alt=\"\" width=\"300\" height=\"215\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/09\/Hassan-Rohani-and-Ayatollah-Ali-Khameni-e1504459373684-300x215.jpg 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/09\/Hassan-Rohani-and-Ayatollah-Ali-Khameni-e1504459373684.jpg 584w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" \/><\/a>In modern times, the world has become one due to the forces of globalization. The printing press, radio, television, and perhaps, most importantly, the internet, have brought forth knowledge that was once completely hidden. For the first time ever, the smallest Sunni student of knowledge has access to the most dangerous secrets of the Shia sect.<\/p>\n<p style=\"text-align: justify;\">One of the common discussions held by Sunni students of knowledge today revolves around the question of: Why didn’t Ibn Taymiyyah quote Al-Kafi when refuting Shiasm?<\/p>\n<p style=\"text-align: justify;\">Some speculate that Al-Kafi didn’t exist in the time of Ibn Taymiyyah, but was produced after his time. This view has little weight among Sunnis that are well-versed in Shia texts. Perhaps the most correct answer is that Ibn Taymiyyah had no access to the book in the first place.<\/p>\n<p style=\"text-align: justify;\">Due to this, modern Sunni works by specialists like Abdulmalik Al-Shafi’ee in his “Al-Fikr Al-Takfeeri ind Al-Shia” and Abdulrahman Al-Saqqaf in his “Khafafeesh Al-Thalam” profoundly expose Shiasm in a way that Sunni scholars of old were never able to.<\/p>\n<p style=\"text-align: justify;\">Today, Sunnism is no longer primarily defensive in nature. Today, Sunnis, for the first time, are able to use Shia texts to refute and expose Shiasm.<\/p>\n<p style=\"text-align: justify;\">With the above in mind, we are finally able to realize the truth about the orthodox Shia opinion about the status of Sunni Muslims. The intention is to answer the question of: Are Sunnis going to Hell according to Shias?<\/p>\n<p style=\"text-align: justify;\">In order to do this, we delved into the most authoritative Shia texts and the statements of their biggest scholars of all time, and we produced our results below for readers to see.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Not knowing the Shia Imams is Kufur<\/strong><\/h2>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<ul style=\"text-align: justify;\">\n<li>In Al-Kafi, in the third hadith in the Chapter of Those that Die without an Imam of Guidance, we find Ja’afar Al-Sadiq being asked about the hadith of the Prophet – peace be upon him – “He who dies without <strong>knowing <\/strong>his Imam dies a death of <em>jahiliyyah<\/em>.” His companion asked about the type of <em>jahiliyyah<\/em> this falls under. Ja’afar then responded, “It is a <em>jahiliyyah<\/em> of disbelief, hypocrisy, and misguidance.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Al-Majlisi graded the hadith as authentic in Mir’aat Al-Uqool 4\/221.<\/p>\n<p style=\"text-align: justify;\">According to the consensus of Twelver Shias, the Imam of our times is Mohammad bin Al-Hasan Al-Askari, who has disappeared in the middle of the third century after Hijra. It goes without saying that Sunnis do not accept him, nor know of him, as the Imam of their time.<\/p>\n<ul style=\"text-align: justify;\">\n<li>We also find in Al-Kafi, in the eighth hadith under the Chapter of Knowing the Imam, that Al-Baqir said, “All those put effort into worship <strong>without having an Imam<\/strong> that was placed by Allah, won’t have his efforts accepted. He is lost and confused, and his deeds are hated by Allah… Those who do not have a just and clear Imam from Allah from within this nation, will be lost and misguided, and if he died upon that, he <strong>would die a death of disbelief and hypocrisy<\/strong>.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Al-Majlisi authenticates the narration in Mir’aat Al-Uqool.<\/p>\n<p style=\"text-align: justify;\">The narration is clear that those that don’t follow the Imam will not have any of their good deeds accepted by Allah and that they will die as disbelievers.<\/p>\n<ul style=\"text-align: justify;\">\n<li>We also find in Rawdhat Al-Kafi, in narration #399, that Al-Sadiq said, “If Iblees prostrated down to Allah after his disobedience and arrogance for as long as the <em>dunya<\/em>, Allah would still not accept it from him if he did not prostrate to Adam in the way that Allah ordered him to. Similarly is this sinful and swayed nation after their Prophet – peace be upon him and his progeny – and the Imam that was left appointed by their Prophet – peace be upon him and his progeny &#8211; , for Allah will not accept their actions, nor will he raise their good deeds, until their come to Allah in the way that He ordered them to and ally with the Imam that they were ordered to ally with, and enter the door that was opened by Allah and His messenger for them. O’ Abu Mohammad, Allah has made upon the nation of Mohammad – peace be upon him and his progeny – five obligations: Prayer, the alms, fasting, the pilgrimage, and our <em>wilaya<\/em>. He then included pardons for four of those obligations, but he did not include a pardon for a Muslim that leaves our <em>wilaya<\/em>. By Allah there is no pardon in it.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The narration is graded as authentic by Al-Majlisi and it is explicit that Sunnis will not be pardoned for not accepting all twelve Imams.<\/p>\n<ul style=\"text-align: justify;\">\n<li>In another tradition, in Ikmal Al-Deen by Al-Saduq p. 412, we find the following tradition attributed to the Prophet – peace be upon him &#8211; , “Whoever rejects my descendant, the <em>qa’im<\/em> (the Mahdi), rejects me.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The narration is authentic according to Shia hadith standards and all the narrators are reliable.<\/p>\n<p style=\"text-align: justify;\">Again, all Sunnis today reject Mohammad bin Al-Hasan Al-Askari as an Imam, which makes them on the same level as one who rejects the Prophet – peace be upon him &#8211; .<\/p>\n<h2 style=\"text-align: justify;\"><strong>Opinions of the Top Early Shia Scholars<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">The greatest hadith scholar in the history of Qum, Ibn Babawaih Al-Saduq says in Al-Hidaya p. 27:<\/p>\n<p style=\"text-align: justify;\">“It is obligatory to believe that rejecting the Imamate is like rejecting prophethood, and rejecting prophethood is like rejecting monotheism. It is obligatory to believe that Allah the Almighty will not accept the deeds of one, except if he accepted the prophets, messengers, and books in general, and our prophet Mohammad – peace be upon him and his progeny – and the Imams – peace be onto them – in specific. It is obligatory for us to know the Prophet and the Imams that come after him by their names and identity, and that is mandatory and obligatory upon us, <strong>and Allah will not accept the excuses of one who was ignorant <\/strong>or negligent.”<\/p>\n<p style=\"text-align: justify;\">Al-Saduq also says in Al-I&#8217;itiqaad p. 305 that, &#8220;<strong>Whoever does not believe that they are infallible is a disbeliever<\/strong>.&#8221; However, this statement was removed from certain prints of Kitab Al-I&#8217;itiqad, and was included in the footnotes. See the Dar Al-Jawadain edition.<\/p>\n<p style=\"text-align: justify;\">The greatest Shia theologian, Al-Mufeed, said in Awa’il Al-Maqalaat p. 44, “The Imamis are in agreement that <strong>whoever rejects an Imam<\/strong> and denied their right of obedience that has been bestowed upon them by Allah <strong>is a misguided <em>kafir<\/em> that is deserving of eternal hellfire<\/strong>.”<\/p>\n<p style=\"text-align: justify;\">Al-Mufeed also states in Al-Muqni’a p. 32, “Knowing them and allying with them allows deeds to be accepted (on the day of Judgment), and rivaling them <strong>and being ignorant of them<\/strong> is deserving of hellfire.”<\/p>\n<p style=\"text-align: justify;\">He also says in Al-Ifsaah p.28 after commenting on the hadith about the death of Jahiliyyah in the previous section, he said, “This is explicit that one who is <strong>ignorant of the Imam<\/strong> is taken out of the fold of Islam.”<\/p>\n<p style=\"text-align: justify;\">The great Shaikh Al-Ta’ifah, Al-Tusi, said in Al-Rasa’il Al-Ashra p. 103, “It (<em>iman<\/em>) is based on five foundations, whoever knew them is a believer, and <strong>whoever was ignorant of them is a disbeliever<\/strong>. They are: <em>Tawheed <\/em>(monotheism), <em>adala <\/em>(the justice of the Creator)<em>, nubuwa <\/em>(prophethood)<em>, imamah, <\/em>and<em> ma’ad <\/em>(the afterlife).”<\/p>\n<p style=\"text-align: justify;\">He also said p. 317, “Being ignorant of the Imam is disbelief.”<\/p>\n<p>Al-Shareef al-Murtada says in Rasa&#8217;il al-Murtada 1\/225, &#8220;It is not allowed to offer obligatory charity (Zakat) except to a poor person who acknowledges the authority of the chief of believers (as). If it is offered to others then it must be returned, this is because of the oft-repeated <strong>consensus that whoever is ignorant of the authority of the chief of believers (as) and his leadership is considered an apostate<\/strong> according to Imami Shia&#8221;<\/p>\n<h2 style=\"text-align: justify;\"><strong>Is there an Exception to the Rule?<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Modern Shias often try to sugar-coat the blatant <em>takfeer<\/em> that we find in their old texts by appealing to the <em>mustadh’af<\/em> exception. A <em>mustadh’af<\/em>, in language, can refer to one who is perceived as weak, or one who was made weak by another. Modern Shias suggest that those that did not have the evidence placed upon them are the <em>mustadh’afeen<\/em>. By doing this, they attempt to exempt the majority of the Sunnis out of the circle of disbelief, and limit it to only those that knowingly reject the Imamate of the Twelve. However, this is not the orthodox Shia belief, and they are not being true to Shiasm.<\/p>\n<p style=\"text-align: justify;\">An alternative meaning that can be found in Shia hadiths. In reference to verses 98-99 from Surat Al-Nisa’, we find in Al-Kafi, in the Chapter of Al-Mustadh’af, hadith #2, that Al-Baqir is asked about them, and he answers, “They are those that do not have the ability to believe or disbelieve. They are children and those with intellects of children from (adult) men and women.”<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi authenticates the narration in Mir’aat Al-Uqool 11\/209.<\/p>\n<p style=\"text-align: justify;\">In other words, only the mentally challenged and children are exempt from knowing the Imams.<\/p>\n<h3 style=\"text-align: justify;\"><strong>Is an Ignorant Person a Mustadh’af?<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Modern Shias will suggest that an ignorant Sunni Muslim is a <em>mustadh’af<\/em>, even though there are no authentic Shia narrations that explicitly state this.<\/p>\n<p style=\"text-align: justify;\">They will make use of a narration that says, “Those that are aware of the differences of the people are not <em>mustadh’af<\/em>,” to mean that those that are not aware are <em>mustadh’af<\/em>.<\/p>\n<p style=\"text-align: justify;\">The narration is accurate and does not contradict the previous narrations and statements of the scholars above. However, the conclusion that modern Shias draw from the narration conflicts with the clear narrations that we have produced above and the explicit statements of scholars.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Popular Shia speakers today are becoming less vocal about this opinion and are often caught sugar-coating when asked about the status of Sunnis in the hereafter. However, in light of the above narrations and statements of the scholars, we come to the conclusion that according to the orthodox Shia opinion, all non-Twelvers, Sunnis included, are going to hell, except for their children and the mentally challenged.<\/p>\n<p style=\"text-align: justify;\">This, of course, is extremely problematic when the Twelver sect is based upon secrecy and the Imam himself would deny that he was an Imam. It was so secretive that even members of Ahlulbayt were not aware of the Imamate. Refer to this article on <a href=\"http:\/\/www.twelvershia.net\/2017\/02\/11\/understanding-imamate-early-shia-society\/\">Imamate in early Shia society<\/a> for more.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Are Sunnis going to Hell according to Shias? In order to know this, we delved into the most authoritative Shia texts and the statements of their scholars&#8230; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/09\/03\/are-sunnis-going-to-hell\/\" title=\"Are Sunnis going to Hell?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3937,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-4157","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4157","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4157"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4157\/revisions"}],"predecessor-version":[{"id":4373,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4157\/revisions\/4373"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3937"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4157"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4157"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4157"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}