{"id":4171,"date":"2017-09-15T17:26:12","date_gmt":"2017-09-15T17:26:12","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4171"},"modified":"2018-01-04T17:09:48","modified_gmt":"2018-01-04T17:09:48","slug":"lanat","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/09\/15\/lanat\/","title":{"rendered":"Lanat"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4171\" alt=\"\" \/><\/p>\n<h2 style=\"text-align: justify;\"><strong>What is Lanat?<\/strong><\/h2>\n<p style=\"text-align: justify;\">The linguistic meaning of <em>lanat<\/em> is to cuss out, however, in Islamic terminology; <em>lanat<\/em> is mainly used to describe an invocation that Allah banishes one from His mercy.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Ethics of the Prophet – peace be upon him &#8211; <\/strong><\/h2>\n<p style=\"text-align: justify;\">The act of <em>lanat<\/em> is disliked in general.<\/p>\n<p style=\"text-align: justify;\">We find in Saheeh Al-Adab Al-Mufrad by Al-Bukhari #309 that Salim said, “I never heard Abdullah (bin Omar) make <em>lanat<\/em> upon a human ever,” Ibn Omar said: The Prophet – peace be upon him – said, “A believer should not be a <em>la’aan<\/em> (one who makes <em>lanat<\/em>).”<\/p>\n<p style=\"text-align: justify;\">The Prophet – peace be upon him – also said #316, “<em>La’aaneen<\/em> (those that make <em>lanat<\/em>) will not be witnesses or intermediaries on the day of Judgment.”<\/p>\n<p style=\"text-align: justify;\">Abu Huraira narrated that the Prophet – peace be upon him &#8211; says #317, “A <em>siddeeq<\/em> should not be a <em>la’aan<\/em>.”<\/p>\n<p style=\"text-align: justify;\"><strong>He – peace be upon him – also said #321 when asked to invoke the curse of Allah upon the disbelievers, “I was not sent as a <em>la’aan<\/em>, but I was sent as a mercy!”<\/strong><\/p>\n<p style=\"text-align: justify;\">In hadith #430, Anas says, “The Prophet – peace be upon him – was not vile, nor a <em>la’aan<\/em>, nor a curses, and all he would say in condemnation was, ‘Why have you brought dirt onto your head?’”<\/p>\n<h2 style=\"text-align: justify;\"><strong>Sunni View of Lanat<\/strong><\/h2>\n<p style=\"text-align: justify;\">There is an agreement among Sunni scholars that one may invoke the <em>lanat<\/em> of Allah upon disbelievers and evil-doers. However, the majority state that it is not permissible to make <em>lanat<\/em> on specific individuals since there is always a chance that they could repent.<\/p>\n<p style=\"text-align: justify;\">The agreed upon exception to this is a specific individual that is damned to hell in the Qur’an or Sunnah (i.e. Iblees, Abu Jahal, Abu Lahab, etc.)<\/p>\n<p style=\"text-align: justify;\">There is also a difference of opinion in regards to other specific individuals, like Yazeed bin Mu’awiyah for example, since some Sunni scholars believe that it is permissible to curse him specifically.<\/p>\n<p>Imam Ahmad, when asked about this, as we find in Muntakhab Ilal Al-Khalaal p. 239, he said:<\/p>\n<p>&#8220;I prefer not to say anything.&#8221;<\/p>\n<p style=\"text-align: justify;\">When asked about cursing Al-Hajjaj in specific, and he said, &#8220;I prefer not to, and it is best to keep it general, by saying: O&#8217; Allah curse the transgressors.&#8221;<\/p>\n<p style=\"text-align: justify;\">As we can see, Imam Ahmad was influenced by the ethics displayed by the Prophet &#8211; peace be upon him &#8211; and was not someone that made <em>lanat<\/em> a common practice. Today, we find the majority of Ahl Al-Sunnah upon the same path. Cautious in their supplications against the transgressors.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Shia View of Lanat<\/strong><\/h2>\n<p style=\"text-align: justify;\">Unlike the Sunni view, <em>lanat<\/em> has become much more integrated into culture. For example, it is common for Arab Shias to say with a drink of water, “<em>Ishrab wa zeed, wal’an Yazeed,”<\/em> which translates to, “Keep drinking and cursing Yazeed.” Iranians too have a saying that is equivalent in the Persian tongue.<\/p>\n<p>We also find Shias attributing false reports to Fatima that she used to curse Abu Bakr after every prayer due to their disagreement over <a href=\"http:\/\/www.twelvershia.net\/2014\/05\/08\/fadak-prophetic-inheritance-qa\/\">Fadak<\/a>.<\/p>\n<p style=\"text-align: justify;\">According to a moderate Shia <em><a href=\"http:\/\/www.aqaed.com\/faq\/2277\/\" rel=\"external nofollow\">fatwa site Aqaed.com<\/a><\/em>, this action leads to gaining a hundred thousand good deeds (<em>hasanaat<\/em>), the expiation of a hundred thousand sins, the elevation of a hundred thousand levels in heaven, and is as if one freed a hundred thousand slaves.<\/p>\n<h2><\/h2>\n<p style=\"text-align: justify;\">We also find major scholars like Ayatollah Mohammad Jameel Al-Amili supporting this culture of <em>lanat<\/em>. He said in his <em><a href=\"http:\/\/www.aletra.org\/subject.php?id=749\" rel=\"external nofollow\">fatwa<\/a><\/em>:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/09\/Lanat-1.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft size-thumbnail wp-image-4177\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/09\/Lanat-1-150x150.jpg\" alt=\"lanat\" width=\"150\" height=\"150\" \/><\/a>&#8220;It is liked for one to curse the two idols of Quraish (Abu Bakr and Omar may Allah curse them) at every hour and minute, during <em>qunoot<\/em> prayers, after bowing, after prostration, after finishing the prayer, and before any action, for it is something that brings one closer to Allah. Evidence of this can be found in the actions of the Head of the Women of Paradise that she used to curse Abu Bakr and Omar at every prayer. The same was done by the Commander of the Faithful Ali peace be onto him, who was known for his supplications against the two idols of Quraish, and used to perform this in his prayers. May Allah aid you in this <em>lanat<\/em>, which is a part of the <em>bara’a<\/em> from these two idols, those that love them from the <em>Nawasib<\/em> today, as well as Bakris and Omaris. This ruling is agreed upon as permissible, and is liked by the majority of the Imami jurists, and whoever has an issue with this is a Bakri Omar, may Allah, His angels, messengers, <em>awliyaa’<\/em>, and good servants curse them until the day of Judgment.&#8221;<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Another interesting quote is provided by Al-Tusirkani, who states in his La&#8217;ali&#8217; Al-Akhbar 4\/92 that the best place to curse is after urination while in the toilet. One should say:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">&#8220;O&#8217; Allah make <em>lanat<\/em> upon Omar, then Abu Bakr and Omar, then Uthman and Omar, then Mu&#8217;awiyah and Omar, then Yazeed and Omar, then Ibn Ziyad and Omar, then Ibn Sa&#8217;ad and Omar, then Shimr and Omar, then their armies and Omar. O&#8217; Allah make <em>lanat<\/em> upon Aisha, Hafsa, Hind, Umm al-Hakam, and upon the ones who are pleased with their actions until the day of Judgment.”<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">It is important to keep in mind that this culture did not come out of thin air, but is the product of Shia narrations that have influenced the minds of the scholars and the masses through the centuries. One such narration is the hadith of Al-Baqir in Mukhtasar Al-Basa’ir p. 73:<\/p>\n<p style=\"text-align: justify;\">“Behind this sun are forty suns, and between each sun is a distance of forty years, within them are creations that are not aware whether Allah created Adam or not. Behind this moon are forty moons, and between each is a distance of forty years, and within them are creations that are not aware whether Allah created Adam or not. They were inspired to make <em>lanat<\/em> in the same way the bees make <em>lanat<\/em> of the first and the second (Abu Bakr and Omar) at all times. Overseeing them are angels that would punish them if they did not make <em>lanat<\/em> of them.”<\/p>\n<p style=\"text-align: justify;\">The editor graded the narration as authentic.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">Ahl Al-Sunnah and Shias are very different in the way that they view <em>lanat<\/em>. Sunnis have it as an exception for specific cases, while Shiasm has it as a cultural practice. Of course, our best advice is to hold onto the Prophet – peace be upon him – and take after his example.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>What is Lanat? The linguistic meaning of lanat is to cuss out, however, in Islamic terminology; lanat is mainly used to describe an invocation that Allah banishes one from His mercy. The Ethics of the Prophet – peace be upon <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/09\/15\/lanat\/\" title=\"Lanat\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-4171","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4171","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4171"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4171\/revisions"}],"predecessor-version":[{"id":4268,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4171\/revisions\/4268"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}