{"id":4193,"date":"2017-10-08T17:29:55","date_gmt":"2017-10-08T17:29:55","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4193"},"modified":"2017-10-09T16:01:02","modified_gmt":"2017-10-09T16:01:02","slug":"narrations-names-twelve-imams","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/10\/08\/narrations-names-twelve-imams\/","title":{"rendered":"Narrations with Names of the Twelve Imams"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4193\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is an in-depth research into the narrations that list out the names of the Twelve Imams.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Background<\/strong><\/h2>\n<p style=\"text-align: justify;\">It is commonly believed by Shias that the names of all Twelve Imams were always known by the Shia community. Even though we have debunked this myth previously <a href=\"http:\/\/www.twelvershia.net\/2017\/02\/11\/understanding-imamate-early-shia-society\/\">in another article<\/a>, in this article, we will take a look at the strongest proofs for this claim. The proofs, obviously, are the narrations that include these lists of Imams.<\/p>\n<p style=\"text-align: justify;\">It should come as no surprise to those that have read our article that was referred to above that the concept of <strong>a full<\/strong> <strong>list<\/strong> of Imams was foreign to the early Shia society. The most obvious evidence for this is that the Shia kept splitting into different groups every time an Imam died, since they had no idea who the next Imam was. However, it was after the occultation of the twelfth Imam, that Shias had their full list, and it was only then when they had the freedom to fabricate these narrations without fear of falling into error.<\/p>\n<h2 style=\"text-align: justify;\"><strong>General Information about the Sources of these Reports<\/strong><\/h2>\n<p style=\"text-align: justify;\">Even though Shias have the assumption that these reports are plentiful and undeniable, below, we will make readers aware of the origins of these reports.<\/p>\n<p style=\"text-align: justify;\">One of the most problematic issues with the acceptance of these narrations is that none of them were documented until after the time of the Imams.<\/p>\n<p style=\"text-align: justify;\">The earliest of these sources is Al-Kulayni’s Al-Kafi who passed away in the fourth century in the year 329 AH. Al-Kafi, the single most important Shia book of hadith, only includes two narrations in which all the Imams are named, and we shall be examining them further into the article.<\/p>\n<p style=\"text-align: justify;\">The second source for these reports is Ibn Babwaih, who is also known as Al-Saduq, whose narrations also deserve to be looked into, due to the man’s weight in Shiasm, and due to the obvious manipulation of hadiths as we shall see below.<\/p>\n<p style=\"text-align: justify;\">The third and most important source for the narrations of the names of the Twelve Imams is Kifayat Al-Athar by Al-Khazzaz Al-Qummi, a student of Al-Saduq, who narrates almost thirty narrations!<\/p>\n<p style=\"text-align: justify;\">Be sure to also check out our small section on the narrations of Al-Fadhl bin Shathaan below as well.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Narrations in Al-Kafi<\/strong><\/h2>\n<p style=\"text-align: justify;\">Both narrations are from the Chapter of the Appointment of the Twelve in Al-Kafi.<\/p>\n<ul style=\"text-align: justify;\">\n<li>The first narration is the infamous narration of Ahmad bin Mohammad bin Khalid Al-Barqi from Abi Hashim Al-Ja’afari from Al-Jawad. Luckily for us, Al-Mahasin 2\/333, by Al-Barqi has survived, and the same narration can be found within the book, with some variants. It does not include the names of all the Imams. It only includes the names of Ali, Al-Hasan, and Al-Hussain, and this is evidence of foul play from the narrators that came after Al-Barqi. The narration can also be found in Tafseer Surat Al-Zumar within Tafseer Al-Barqi, and it too doesn’t contain the names of the Imams. Refer to this <a href=\"http:\/\/www.tashayyu.org\/ithna-ashariyya\/alteration-and-reorientation-of-text-in-twelver-shiism---ii\" rel=\"external nofollow\">great article<\/a> by ex-Shia Macisaac for more on this hadith.<\/li>\n<li>The second narration is the hadith of Bakr bin Salih from Abdul Rahman bin Salim from Abi Baseer that Al-Sadiq told him that Jabir saw the names of the Twelve Imams on a tablet, then he listed the names of the Imams and some descriptions about them.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The narration is problematic due to the narration of Bakr bin Salih who was weakened by Al-Najashi. He is the only narrator who narrated this hadith from Abdul Rahman bin Salim, who was the only person that narrated from Abu Baseer.<\/p>\n<p style=\"text-align: justify;\">Another problematic issue in the narration is that Abu Baseer was someone that did not know the Imams, as we find in other reports.<\/p>\n<ol style=\"text-align: justify;\">\n<li>He assumes in the Chapter of Imamate being a Covenant from Allah (hadith #1) that Isma’eel bin Ja’afar is the Imam after Ja’afar.<\/li>\n<li>In the Chapter of the Imams are in the Descendants (hadith #7) he asks Musa Al-Kathim, “What are the signs of the Imam?” Of course, if he knew their names, then he wouldn’t ask.<\/li>\n<li>In the Chapter 33 of Ikmal Al-Deen, he is shocked when Mohammad bin Imran tells him that he heard Ja’afar Al-Sadiq say that there will be Twelve Mahdis (meaning Imams). He forces him to swear by Allah twice that he heard this. Then, Abu Baseer says that he heard this from Al-Baqir, which is evidence that he never heard such a thing from Ja’afar Al-Sadiq. The narration is authentic and shows that Abu Baseer only knew of the number of Imams and not their names.<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">Note: The narration in Al-Kafi names the last Imam as MHMD, while other reports from Bakr bin Salih do not include this. This shows that some narrators added the name of the Mahdi into the report, even though it wasn’t originally narrated by Bakr bin Salih.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Narrations of Al-Saduq<\/strong><\/h2>\n<p style=\"text-align: justify;\">Even though there was only a generation between Al-Saduq and Al-Kulayni, we do find him having access to many more narrations than Al-Kulayni ever did. It is not reasonable to assume that Al-Kulayni simply overlooked them due to their significance, but rather, it is clear that they were not available to Al-Kulayni in the first place.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Al-Saduq narrates in Al-Faqeeh a supplication during the prostrations of thanks from Musa bin Ja’afar in which all the names of the Imams are mentioned. The same narration can be found in Al-Kafi 3\/325 without the inclusion of the names of the Imams. Again, we are seeing a trend. Late works force the names of the Imams into hadiths that were previously circulated without the names of the Imams.<\/li>\n<li>The narration in Ikmal Al-Deen and Tamam Al-Ni’ma p. 253 contains several issues.<\/li>\n<\/ul>\n<ol style=\"text-align: justify;\">\n<li>The first is that the narrator Ja’afar bin Mohammad bin Malik Al-Fazzari was weakened by Ibn Nuh, Ibn Al-Waleed, Al-Saduq himself, and Al-Najashi. Ibn Al-Ghadha’iri accused him of fabricating reports.<\/li>\n<li>The second issue is that the hadith comes through the path of Al-Hasan bin Mohammad bin Sama’a, who is a staunch Waqifi that did not believe in Twelve Imams. He only believed in seven! So how is it possible that he would narrate such a hadith?<\/li>\n<li>In the hadith, Jabir Al-Ju’fi narrates from Jabir bin Abdullah. Anyone familiar with these narrators will know that Jabir Al-Ju’fi was never a student of the great Sahabi, and this is evidence that the fabricator of the hadith made a silly mistake.<\/li>\n<li>The narration explicitly states that Jabir <strong>saw <\/strong>Al-Baqir, which is a foolish mistake, since Jabir was blind at the time.<\/li>\n<\/ol>\n<ul style=\"text-align: justify;\">\n<li>Al-Saduq, after quoting the hadith of Bakr bin Salih above, in Uyoon Akhbar Al-Redha 1\/50, provides it from an alternative path that include Ja’afar bin Mohammad bin Malik, the fabricator of the previous hadith.<\/li>\n<li>Al-Saduq narrates a hadith in Uyoon Akhbar Al-Redha 1\/50 through the path of Abdul Hussain Al-Hasani, however, it comes through unknown narrators like Abu Turab Al-Ruyani, his student, and his student’s student.<\/li>\n<li>Al-Saduq narrates a hadith in Uyoon Akhbar Al-Redha 1\/57 through the path of Abdullah bin Abi Al-Huthail which lists the Imams. However, all the narrators in the hadith are anonymous, including Abdullah bin Abi Al-Huthail. It is important to be aware that the narration is not from an infallible Imam, but it is by Ibn Abi Al-Huthail.<\/li>\n<li>Al-Saduq also narrates a hadith in Uyoon Akhbar Al-Redha 2\/129 through the path of Al-Fadhl bin Shathaan, however, Al-Fadhl, who died in the year 260 AH, never met Al-Redha. Al-Tusi mentions him as a companions of Al-Hadi, while Al-Najashi says that he narrated from Al-Jawad. Mohammad Redha Al-Sistani points out in his Qabasat 2\/194 that Al-Fadhl was a child during the time of Ibn Fadhal, who died in the year 221 AH or 224 AH, which is evidence that he did not hear from Al-Redha who died in the year 203 AH.<\/li>\n<li>Al-Saduq mentions a report in his Ikmal Al-Deen p. 253 in which the Twelve Imams are named. However, it comes through the path of Ahmad bin Bundar, who is anonymous in status. Ibn Bundar’s shaikh, Ahmad bin Hilal is even more problematic, who falsely claimed to be the representative of the Mahdi. The third representative, Al-Hussain bin Rawh, then brought forth a letter from the Mahdi condemning and cursing him.<\/li>\n<li>Al-Saduq’s last narration is also in Uyoon Akhbar Al-Redha 1\/62 and comes through the path of Mohammad bin Ali bin Abdul Samad and Mohammad bin Al-Fadhl Al-Nahawi, both of whom are anonymous in status. One can argue the same about Al-Saduq’s teacher Ali bin Thabit as well.<\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>The Narrations of Al-Khazzaz<\/strong><\/h2>\n<p style=\"text-align: justify;\">Perhaps the most fascinating, and yet, least credible collection of narrations come through the path of A-Khazzaz Al-Qummi, who was a student of Ibn Babawaih. These narrations were obviously not present among the earlier generations and seem to be mostly have been concocted by a couple of fabricators.<\/p>\n<p style=\"text-align: justify;\">The first culprit is Abu Al-Mufadhal Mohammad bin Abdullah Al-Shaybani. He alone narrates ten narrations in which the Imams are named, which can be found on the following pages: 11-14, 40-42, 56-60, 74-75, 105-106, 136-138, 166-168, 175-176, 248-250, 266-267. Abu Al-Mufadhal was weakened by Al-Najashi and most of the Shia scholars of his time. Ibn Al-Ghadha’iri accused him of fabricating hadiths.<\/p>\n<p style=\"text-align: justify;\">The second culprit is Ali bin Al-Hasan bin Mohammed bin Mandah who narrates eleven hadiths that can be found on the following pages: 16-19, 61-62, 69-73, 146-150, 155-156, 162-165, 166-167, 177, 195-196, 232-234, 255-259, 260-263. Ali bin Al-Hasan is unknown in status.<\/p>\n<p style=\"text-align: justify;\">Al-Khazzaz has some other narrations in which he quotes anonymous sources. These include the hadith of Al-Hasan bin Ali Al-Razi p. 114-118, Mohammad bin Ja’afar bin Mohammed Al-Tameemi p. 304, Al-Mu’afa bin Zakariyyah pgs. 114-118, 244-245, Ahmad bin Isma’eel Al-Sulaymani p. 264-266, Ahmad bin Mohammad bin Abdullah Al-Ayyashi p. 185-186, and Mohammad bin Sa’eed Al-Sayrafi p. 169-170.<\/p>\n<p style=\"text-align: justify;\">Al-Khazzaz also quote Ahmad bin Mohammad Al-Jawhari, the author of Muqtadhab Al-Athar. Al-Jawhari himself was weakened by Al-Najahi and his teachers, and is therefore, not relied upon by Shias themselves. Al-Jawhari himself has a couple of narrations in the book of Al-Khazzaz Al-Qummi in which he includes the names of the Twelve. Refer to pgs 40-42 and 146-150.<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Narrations of Al-Tusi<\/strong><\/h2>\n<p style=\"text-align: justify;\">Unlike the previous sources Abu Ja’afar Al-Tusi, also known as Shaikh Al-Ta’ifah, was not as significant in influencing the Shia view of the narrations of Twelve Imams.<\/p>\n<ul style=\"text-align: justify;\">\n<li>The first narration of Al-Tusi (in Al-Amali p. 291-292) contains anonymous narrators like Amr bin Yahya, Abdul Rahman bin Abdullah Al-Omari, and Yahya bin Al-Mugheera.<\/li>\n<li>Two narrations can be found in Kitab Al-Ghaybah (p. 147-148 and p. 150) through the path of Ali bin Sinan Al-Mawsili who is anonymous in status.<\/li>\n<li>The narration can be found in Al-Ghaybah p. 136 as well. The narration comes through the path of Mohammad bin Ahmad bin Abdullah Al-Hashimi and Eisa bin Ahmad bin Eisa bin Al-Mansour, both of whom are anonymous in status.<\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>The Narrations that have been attributed to Al-Fadhl bin Shathaan<\/strong><\/h2>\n<p style=\"text-align: justify;\">In the 11<sup>th<\/sup> century, a book was uncovered after being lost for centuries upon centuries. That book is called Ithbat Al-Raj’a by Al-Fadhl bin Shathaan. The book contains very clean narrations from Al-Fadhl (d. 260) from his teachers, from the Imams, and they list out the names of the Twelve Imams. This book was only known to have been quoted by Al-Hurr Al-Amili in his Ithbat Al-Hudaat and has not been quoted by anyone that came before him. None of the early sources above quote these clean chains when they were much needed and there is little doubt that this dubious work has been falsely attributed to Al-Fadhl. It is also important to make note that there is no manuscript for this work apart from one that was written in the year 1350 AH, under a hundred years ago, and it was supervised by Al-Hurr Al-Amili himself. (See the printed Mukhtasar p. 68)<\/p>\n<p style=\"text-align: justify;\">Another issue with the book is that it has arrived Al-Hur Al-Amili through <em>wijada<\/em>. In other words, he stumbled upon it without knowing its origin. (See the Mukhtasar p. 68)<\/p>\n<p style=\"text-align: justify;\"> A more important reason to question the contents of the work is due to the attributions of those that are not aware of who the Twelve Imams were according to authentic hadiths.<\/p>\n<ul style=\"text-align: justify;\">\n<li>For example, hadith #5 comes through the path of Mohammad bin Muslim, who in a Saheeh narration in Al-Imamah wal Tabsirah (p. 225) approaches Ja’afar Al-Sadiq when he was sick. He asks him who the Imams is, but Ja’afar never tells him. Instead, he says, that it is someone that can be known from his calmness and serenity. It makes no sense for him to ask Al-Sadiq such questions when Al-Baqir already gave him an answer of who the Twelve Imams were. Furthermore, his student in the narration, Aban bin Uthman was a Nawoosi, who only believes in six Imams, according to Ibn Fadhal in Rijal Al-Kashshi.<\/li>\n<li>Hadith #1 is a narration from the book of Sulaym bin Qais and it adds the names of all Twelve Imams. If we return to other sources, like Kamal Al-Deen p. 284, Al-Ghaybah by Ibn Abi Zainah p. 80, and the book of Sulaym himself p. 184, we only find the names of the Imams until the fifth Imam.<\/li>\n<li>Hadith #4 has the exact same chain as a narration that can be found in Kamal Al-Deen p. 319 (also quoted on Ithbaat Al-Raja’a #8). Interestingly, the narration does not contain the names of all the Imams, but rather, only the first six, while the narration in Ithbaat Al-Raja’a includes the names of all twelve.<\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">There are no authentic narrations with the names of the Twelve Imams in a single hadith. This is a major misconception held by Shias and it is based on a shallow understanding of the history of Shiasm.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is an in-depth research into the narrations that list out the names of the Twelve Imams. Background It is commonly believed by Shias that the names of all Twelve Imams were always known by the Shia community. Even <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/10\/08\/narrations-names-twelve-imams\/\" title=\"Narrations with Names of the Twelve Imams\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[],"class_list":{"0":"post-4193","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4193","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4193"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4193\/revisions"}],"predecessor-version":[{"id":4197,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4193\/revisions\/4197"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4193"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4193"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4193"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}