{"id":4200,"date":"2017-10-11T19:06:13","date_gmt":"2017-10-11T19:06:13","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4200"},"modified":"2017-10-11T23:23:21","modified_gmt":"2017-10-11T23:23:21","slug":"did-al-hussain-willingly-sacrifice-himself","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/10\/11\/did-al-hussain-willingly-sacrifice-himself\/","title":{"rendered":"Did Al-Hussain willingly sacrifice himself?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4200\" alt=\"\" \/><\/p>\n<h2 style=\"text-align: justify;\">Background<\/h2>\n<p style=\"text-align: justify;\">It is a common misconception held by Shias today that Al-Hussain willingly sacrificed himself to save Islam. This view, which is very much romanticized, does not conform to the events that surrounded his <a href=\"http:\/\/www.twelvershia.net\/2016\/01\/29\/karbala-the-facts-and-the-fairytales\/\">martyrdom<\/a>. Our statement is not based on a Sunni rendition of events alone, but rather, this is the conclusion that one would come to by studying the original Shia source.<\/p>\n<p style=\"text-align: justify;\">As we have previously expressed in our article on the <a href=\"http:\/\/www.twelvershia.net\/2016\/10\/24\/history-karbala-study-sources\/\">History of Karbala<\/a>, the <strong>most correct<\/strong> rendition of the events that surround the death of Al-Hussain can be found in the work of Abi Mikhnaf. In this short article, we take a look at the evidences that show that Al-Hussain did not know of his impending martyrdom nor did he wish to be sacrificed.<\/p>\n<h2 style=\"text-align: justify;\">Evidences<\/h2>\n<ul style=\"text-align: justify;\">\n<li>When Abdullah bin Mutee’ asks Al-Hussain about his destination when he fled Madinah, he responded, “For now, I am planning to go to Makkah, as for later, I will make <em>istikhara<\/em>.” (p. 51)<\/li>\n<li>Before making his journey Al-Hussain speaks about his thoughts about going to Kufa. (p. 49) He says, “I have thought to myself about going to Kufa, for my Shia are there, and the nobles from among them wrote to me to come to them, and I will make <em>istikhara<\/em>.“<\/li>\n<li>When approached by Ibn Abbas who told him to not leave to Kufa. Al-Hussain responds by saying, “I will make <em>istikhara<\/em> and then will see what happens next.” (p. 82)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment: If Al-Hussain, the infallible Imam with knowledge of the future, had knowledge of what was to occur in Karbala, why would he even revise himself and make <em>istikhara<\/em>?<\/p>\n<ul style=\"text-align: justify;\">\n<li>Upon receiving the letters from the Kufans, he wrote back, “I will send to you my brother and cousin, who is the most trustworthy from my Ahlulbayt (Muslim bin Aqeel), and I ordered him to write to me about your status, matters, and opinions, and if he writes to me that the lot of you and the notable from among you are upon what was written to me in your letters which I have read, then I will come to you soon<em> insha’ Allah<\/em>.” (p. 53)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment:  Al-Hussain would not be making a false promise if he knew that he would never be getting into Kufa. Furthermore, he would not have sent his closest and most trusted family if he knew that Muslim bin Aqeel would be let down by the Kufans and eventually killed. This is proof upon proof that Al-Hussain had no idea of this alleged sacrifice.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Al-Hussain left for Makkah right after the death of Mu’awiyah in Rajab, which means that he spent the months of Sha’ban, Ramadhan, Shawwal, Thu Al-Qi’da, and most of Thu Al-Hijjah in Makkah. This is proof that he considered his actions instead of heading immediately to Kufa. His hesitation is evidence that he was not aware of his death.<\/li>\n<li>Al-Hussain writes to the Kufans (p. 87), “I ask Allah to reward you greatly and I have left Makkah on Tuesday on the eighth of Thu Al-Hijjah on the day of Tarwiyah. If my messenger reaches you then hasten yourself and get your act together, for I am arriving to you in these days <em>insha’ Allah<\/em>.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment: These statements from Al-Hussain are clear that he is satisfied with the Kufans and expects to arrive at Kufa soon.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Al-Hussain asks some Kufans, after he makes contact with the troops that were led by Al-Hurr bin Yazeed, about his messenger Qais bin Mus-hir Al-Saydawi. (p. 95) The Kufans tell him that he was killed. Al-Hussain suddenly starts to cry.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment: Al-Hussain’s question about his messenger and his reaction are the reactions of one that was surprised by the turn of events.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Al-Hussain attempts to leave Karbala by telling Omar bin Sa’ad and his men to give him three options (p. 102), “Allow me to return from where I came, or to put my hand in the hand of Yazeed and to let him judge what has happened between us, or send me to a Muslim borderline town.” Abu Mikhnaf states that this is according to the majority of the hadithists of his time. The three options that Al-Hussain gives is alluded to later on in a conversion with Al-Hurr bin Yazeed later on as well. (p. 118)<\/li>\n<li>Abu Mikhnaf reports on the same page, from a single chain, that a companion of Al-Hussain denied the above three options, but instead said, “Allow me to leave into this wide land and to see what happens with the people.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment: In both scenarios, Al-Hussain is not keen on fighting and is attempting to pull away from the massacre that may soon occur.<\/p>\n<ul style=\"text-align: justify;\">\n<li>On the 9<sup>th<\/sup> of Muharram, Al-Hussain sees a dream in which he sees his grandfather – peace be upon him – saying, “You are coming to us.” He tells this to Zainab. (p. 105)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment: This is evidence that Al-Hussain had no idea that he was going to get martyred until he saw the dream on the 9<sup>th<\/sup> of Muharram.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Upon his realization of a likely massacre (p. 108), he tells his companions to take his relatives away, pointing out that the army of Ubaidullah bin Ziyad only wants him. However, his brothers, nephews, children of Abdullah bin Ja’afar, and children of Aqeel insist to stay with him.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">We comment: This contradicts the commonly held Shia view that he took his family with him with the intention of having them sacrificed along with him.<\/p>\n<h2 style=\"text-align: justify;\">Conclusion<\/h2>\n<p style=\"text-align: justify;\">As we can see from the above, there are several obvious points in the story of the martyrdom of Al-Hussain and what led to it that clearly shows that Al-Hussain did not intend to get killed nor get sacrificed. However, stubborn Shias will attempt to twist each of these points and explain them away in a manner to fit their preconceptions.<\/p>\n<p style=\"text-align: justify;\">On the other hand, the objective Shias will realize that there are too many evidences to ignore and that Al-Hussain did not know what was going to happen to him, for they have realized that it is simply not possible to judge all these events as tests, and that the apparent actions of Al-Hussain are to be taken at face value, for history itself has no weight if it is going to be warped by biased minds at every turn.<\/p>\n<p>The tragedy of Al-Hussain&#8217;s martyrdom does not requires exaggerations for it to be considered a tragedy.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Background It is a common misconception held by Shias today that Al-Hussain willingly sacrificed himself to save Islam. This view, which is very much romanticized, does not conform to the events that surrounded his martyrdom. Our statement is not based <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/10\/11\/did-al-hussain-willingly-sacrifice-himself\/\" title=\"Did Al-Hussain willingly sacrifice himself?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[],"class_list":{"0":"post-4200","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4200","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4200"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4200\/revisions"}],"predecessor-version":[{"id":4204,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4200\/revisions\/4204"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4200"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4200"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4200"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}