{"id":4213,"date":"2017-12-02T23:40:06","date_gmt":"2017-12-02T23:40:06","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4213"},"modified":"2017-12-30T15:31:44","modified_gmt":"2017-12-30T15:31:44","slug":"historica-development-imamah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/12\/02\/historica-development-imamah\/","title":{"rendered":"Historical Development of Imamah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4213\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Examining Shiite theology seems complex at face value, yet when we dive further into the historical development of the Twelver Shiite tradition we begin to face a multitude of historical and theological issues primarily inconsistencies, reinterpretations, polemics, and numerous hadith traditions that of which may or may not be considered authentic or contain reliable chains of transmission. The notion of twelve infallible hereditary Imams stemming from the lineage of Prophet Muhammad can and has always been contested by the Sunni majority, early Mu’tazilite scholars as well as internally within various Shiite theological and intellectual circles. Yet Shiite scholars throughout the course of Islamic history had to articulate themselves in such a manner that the idea of an Imamate lineage would have to be accepted upon some basis of religious authority of theologians and scriptural authenticity. A literary analysis of the historical accounts of the way in which Twelver Shiite creed formulated can be seen in the works of Etan Kohlberg, W. Montgomery Watt, Marshall G.S. Hodgson, and Wilfred Madelung.<\/p>\n<p style=\"text-align: justify;\">                When we analyze the historical development of Twelver theology, we must acknowledge the starting point from which everything initiated. Etan Kohlberg highlights in his article, <em>From Imamiyya to Ithna ‘Ashariyya<\/em>, the prototype variation of what would later on come to be known as the Twelver Shiite sect. Kohlberg argues the concept of Imamate existed in the the seventh century, and was later given a definitive shape by classical Shiite scholar Hisham bin al-Hakam in the middle of the eighth century<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a>.  Hodgson, however, argues that early Shiism cannot be defined based on the standards of what would eventually evolve into later Twelver Shiite Islam as the creed could not have been fully defined as it was still in its earliest stages. The concealment of the hidden Imam is what would cultivate the Twelver theology in the tenth century, yet we see earlier evidence in favor of the doctrine. Both Kohlberg and Watt mention that the earliest evidence in favor of such a belief can be found in the <em>Kitab Firaq al-Shi’a<\/em> produced by al-Hassan bin Musa al-Nawbakhti as well as in the <em>Kitab al-Malaqat wa’l-firaq<\/em> of Sa’d bin Abdallah al-Qummi, both of which would have been completed around 900 AD<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a>. However, Hodgson insists that the notion of twelve hereditary imams was not even conceivable as a concept as the earliest group among the Shiites were Zayidis and therefore could not have possibly split off from the Twelver sect as there was no concrete list of twelve infallible individuals said to have succeeded the Prophet Muhammad yet<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a>.<\/p>\n<p style=\"text-align: justify;\">                Concentrating heavily on the justifications and proofs of the Imamite belief, Kohlberg discusses the arguments put forth by early Ithna ‘Ashariyya scholars, or Twelvers, who he calls the Imamiyya. He begins to notice that although the Twelver doctrine began to become heavily shaped in the tenth century, we see numerous theological inconsistencies and gaps early on in the same time period. Kohlberg highlights that there was an absence of the <em>ghayba<\/em>, or occultation, tradition in early Imamiyya texts such as <em>Basa’ir al-Darajat<\/em> written by early Twelver scholar Muhammad bin al-Hasan al-Saffar al-Qummi (d. 903) although he writes extensively about the virtues of the twelve Imams without explicitly mentioning their names. The same issue occurs again regarding the lack of traditions of the two occultation periods in other texts such as <em>Kitab al-Mahasin<\/em> written by Abu Ja’far Ahmad bin Muhammad bin Khalid al-Barqi (d. 893)<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a>. It was not until Muhammad bin Ali bin Babawayhi (d. 991) who began to expand upon the concept of prolonged concealment beyond the ordinary human life span do we see no clear statements in relation to the details of how the occultation periods would take place<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a>.Hodgson does add on an interesting point in which he discusses the <em>Ghulat<\/em>, or exaggerators, from among the early Shiites. They would place a great deal of emphasis on different concepts that, as Hodgson suggests, would give birth to themes which would be integrated into Twelver Shiism, concepts such as <em>raj’a<\/em>, or return, and <em>ghayba,<\/em> occultation. These ideas proposed by earlier Ghulat were not regarded as unsophisticated among the elite Arab ruling class but could contribute to the broader context of the elite’s aspirations<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a>. Hodgson states “nor is there anything more extreme in expecting a man to return whom others regard as dead – assome of the early Ghulat did – than in the expectation of the so-called moderate Sh’ia that a man will return whom others doubt was ever born”<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a>.<\/p>\n<p style=\"text-align: justify;\">Interestingly enough, concrete evidence of twelve hereditary Imams isalso not present or seem to be incomplete in their orchestration inearly Shiite Imamiyya works. Kohlberg mentions the significance of the number twelve being ambiguous although a mixture of the earliest Imams are in fact mentioned and in some cases up until the tenth Imam. In the work of Abu Ja’far Ahmad bin Muhammad bin Khalid al-Barqi know as <em>Kitab al-Ashkal wa’l-Qara’in<\/em>, he references different hadith traditions dealing with the significance of different numbers. Kohlberg analyzes his ambiguity on the number twelve by stating “yet he is content with citing traditions on the numbers 3 to 10, and does not deemit necessary to proceed up to the number 12”<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a>. Soon thereafter Kohlberg briefly discusses contrasting evidence derived from the work of Ibn Babawayhi in which the number twelve is expanded upon and defined yet the names of the Imams are still not explicitly mentioned. The two texts of both of these tenth century Imamiyya Shiite scholars were presumably written either right before or shortly after the initial ghayba period, <em>al ghayba al-sughra<\/em>. Kohlberg concludes in this part of his article that “the absence of specifically Twelver Shi’i beliefs from these works probably means that belief in 12 Imams had not yet been formulated as an Imami tenet”<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a>. It is noted, however, that the theorization of the official Twelver Shi’i tenet of twelve Imams is shaped by the Tafsir, or commentary, of Shiite scholar Ali bin Ibrahim al-Qummi (d. 919) when a narration regarding Khidr, a figure appearing in the Quranic narrative of the story of Moses, speaking to Ali and his son Hassan and reveals the names of each of the twelve Imams. Kohlberg highlights “the culmination of this process is reached with the Usul al-Kafi” of Shiite hadith scholar Abu Ja’far Muhammad ibn Ya’quibi al Kulaini (d. 941)<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a>.<\/p>\n<p style=\"text-align: justify;\">Yet even afterwards, much was contested internally among intellectual and theological circles of Shiite scholarship and there had to be a way to clearly explain the Twelver doctrine in a way that would be rational enough to comprehend and prove the validity of such a claim. Kohlberg introduces to us to a set of principles that would define the methodology of how the Twelver creed would be revealed and elucidated by Ibn Babawayhi.The first component of proving the Imamate stems from various arguments derived from the Quran. Different Quranic passages with the number 12 are seen occasionally and serve as a sign for early Twelver Imamites and thus became of deep interest and intrigue for Shiite scholars. Verses of the Quran with the number twelve explicitly mentioned were to have been interpreted by both Imam Muhammad Baqir, the fifth Imam and Imam Ja’far As-Sadiq, the sixth Imam, as being a reference to the twelve Imams. The second method in which the Twelver doctrine was extrapolated from are the arguments stemming from Shi’i traditions. Kohlberg explains that the relevant hadith narrations are broadly divided into two main categories;<\/p>\n<p style=\"text-align: justify;\">“first, traditions according to which there existed already during the Prophet’s lifetime several documents in which the names of the 12 Imams were detailed. One of these documents is the tablet (lawh) which the Companion Jabir bin Abdallah allegedly saw at Fatima’s house. Another is a scroll (sahifa) given to Ali by the Prophet, which is said to have consisted of 12 sections, each sealed by a separate seal. The Prophet instructed Ali to break open the first seal and act in accordance with the instructions in the underlying section; then the process would be repeated with each succeeding Imam”<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a><\/p>\n<p style=\"text-align: justify;\">Kohlberg then briefly mentions a third scroll allegedly written two thousand years prior to the creation of Adam which later on was retrieved by Imam Ja’far As-Sadiq. The second category where Kohlberg highlights to us is the different Shiite hadith traditions consisting of narrations where the Prophet speaks of twelve consecutive Imams who would succeed him. Hodgson intriguingly focuses more on three groups within early Shiism that would ultimately shape Twelver doctrine later on. Hodgson mentions the three separate groups contesting among themselves and states “But the conventional approach to the Ghulat – they were the left wing of the Shi’a, a posited Twelver “moderation” being its center and the mild Zaydis its right wing – is hardly acceptable, certainly for the earlier period which is most fully described by the heresiographers”<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a>.  At the same time Hodgson also suggests that the Imamate of Ja’far As-Sadiq was somewhat reactionary to the Ghulat and other such groups and really defined how the Imamate would be designated and would essentially provide a structure for how the canonization of the twelve Imams would occur.<\/p>\n<p style=\"text-align: justify;\">Montgomery Watt looks at the construction of early Imamate doctrine through different approaches in his article entitled “Sidelights on Early Imamite Doctrine”. Initially heexplores the Imamite creed and how it remained contested and inconsistent until the tenth century after the alleged disappearance of the twelfth Imam during the beginning of the ghayba, occultation, period in 874 A.D. to 941 A.D. Only then do early Shiites begin to refer to themselves as Imamites although the concept had already existed prior to the minor and major occultation periods.He then explores the early interactions and debates that took place between Imamate Shiite scholars and early Mu’tazilites during the reign of the Abbasid Caliph, Harun Al Rashid. This reflects one of many things, mainly that the prototype-Shiite groups of the tenth century were in fact not as marginalized as much as we may have initially thought but rather actively engaged in a wide range of discussions, exchanging of ideas, polemic debates, and theological complexities. Neither were they diametrically opposed schools of theological thought but instead displayed a sense of tolerance for one another which allowed for such fruitful discussions to take place. Such scholars consisted of people like Ali ibn Mitham (ibn At-Tammar) and al Fadhl ibn Shadhan (d. 874). What is also intriguing, is how Watts mentions early Shiite scholar Shaykh Abu Ja’far Muhammad At-Tusi (d. 1067) and his compilation of early Shiite texts. These texts, however, do not focus on the concept of Imamate, but rather focus on matters of “law or liturgical observance such as divorce, temporary marriage, (mut’a), prayer, the pilgrimage” and were somewhat similar to that of Sunni books of jurisprudence<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a>. This exemplifies the notion that Twelver Imamate doctrine was not heavily written about or crystalized early on which coincides with Hodgson’s proposal in which codified Twelver Imamism cannot be discussed in the context of the seventh century as it did not exist yet.<\/p>\n<p style=\"text-align: justify;\">Additionally, Watt continues to discuss the early orchestration of the major contested Imamate question in the tenth century; what was the process in which Imamate was designated and who would inherit the prestigious position? An early Imamate group known as the Fut’hiyya, or Aftahiyya, were beginning to raise the questions of hereditary lineage and designation. Watt examines their theories during the time between the seventh Imam, Ja’far As-Sadiq (d. 765) and his son Musa Al Kadhim. According to Watt, Imam Ja’afar As Sadiq’s first born son, Al Aftah, passed away a short time after being designated as the heir to the Imamate, thus Musa Al Kadhim inevitably inherited the position and becomes the eighth Imam. This would then invalidate the claim that the Imamatehas to be passed down to the first-born son of the previous Imam. Watt emphasizes this group and its role in early Shiite history as they contribute to the orchestration of the theological argumentation concerning one of the most central components of the evolution from Imamate to Ithna ‘Ashariyyah, or Twelver, creed specifically. What is also very compelling is the notion of designating the Imamate from one brother to another rather than to the first-born son. As the Imamate was passed down from Hassan ibn Ali to his brother, Hussain ibn Ali, so to could other Imams also designate their Imamate to their brothers. This is where Watt notices an unusual, yet familiar, result later on in the canonization of the twelve Imams. As Imam Ja’far As-Sadiq appoints his successor to be his son Abdallah al-Aftah, Musa Al Kadhim is then declared the eighth Imam soon after Abdallah’s demise. Watt later poses the same question around the theory of the hidden Imam and whether or not the eleventh Imam, Hassan Al ‘Askari could have potentially declared his brother, Ja’far, as his successor and ultimately the Mahdi himself.<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a> The issue for Shiite theologians, Watt argues, was how to reconcile the succession of Imam Ja’afar As-Sadiq with the Imamate of Musa Al Kadhim. If the Imamate is meant to be hereditary, then this would pose a difficult challenge for Shiite Imamate scholars in terms of crystalizing what would later come to be Twelver Shiite theology. Having to recognize Musa Al Kadhim as the rightful heir to his father would then require early Imamites to formulate an explanation as to how the process of designation in this particular case was settled.<\/p>\n<p style=\"text-align: justify;\">Where Watt’s article states the two theological doctrines differ, Madelung, however, initially insists otherwise saying that some historians of Islam have thought of Twelver Shiites and Mu’atazilites to be so closely associated throughout the historical development of both doctrines that they were somehow intertwined. Yet when one examines both traditions more closely, we come to the realization that there were in fact major differences in the fundamental components of each sets of theology mainly revolving around the concept of God’s names and attributes as well as human free will and predestination in addition to the Imamate<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a>. Madelung then immediately distinguishes the two groups even more and explores the critiques of al-Khayyat, an early Mu’tazilite scholar of the late ninth century, towards the early Imamite Shiites. Madelung states in al-Khayyat’s book, Kitab al-intisar, the Shiites, or Rafidha as al-Khayyat refers to them as, believe<\/p>\n<p style=\"text-align: justify;\">“that God has corporal limits and shape, that he moves and rests, that his knowledge is produced in time, that he may change his announced decision in accordance with changing circumstances (bada’). They believe that the infidels are compelled to their unbelief by a cause which God creates, that God wills every act of sin and disobedience to his commands. They assert that the dead will be returned to life before the day of resurrection (raj’a), that part of the Koran has been changed, added to and suppressed. They maintain that the Prophet has appointed a certain man as his successor and that the whole community except for a few individuals disobeyed his order. Even a small part of this, al-Khayyat sums up polemically, would exceed the gross infidelity of the materialists (dahriyya) and dualists. Al-Khayyat, writing probably not long after the year 269\/882, explains that this has been and is the doctrine of the bulk of the Rafida and their prominent scholars”<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a>.<\/p>\n<p style=\"text-align: justify;\">Furthermore, unlike Watt, what Madelung succeeds to do is emphasize the nuances between the Imamiyya and Mu’tazilite intellectual groupsand shows how some of the Mu’tazilite scholars adopted the belief of twelve Imams yet retained their theological doctrine intact. Madelung discusses Al Ash’ari’s account of the combining of two doctrines, Imamiyya and I’tizal, which occurred in the earlier part of the tenth century displaying the exchanging of ideas among theologians which allowed for the cultivation of different creeds, in this case the Twelver creed. A specific example of this that Madelung provides is the tribe which hails from Baghdad of Banu Nawbakht. These were a people who adopted Mu’tazilite creed concerning the attributes and justice of God and human free will yet at the same time rejected any conception of anthropomorphism<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a>.Although under the influence of Mu’tazilite doctrine to an extent, the Nawbakhti tribe remained adamant in their Imamite belief. They adhered to the notion of twelve infallible individuals succeeding the Prophet Muhammad. Madelung states “in their doctrine of Imamate they remained, of course, essentially opposed to Mu’tazilism, although they denied, perhaps under Mu’tazilite influence, the possibility of miracles of the Imams, while at the same time endeavoring to prove rationally their sinlessness, infallibility and perfect knowledge of all arts and all languages”<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a>. On the contrary, what Madelung fails to do, however, is rigorously define the evolution of Twelver belief in hereditary lineage of Imams. His article primarily consisted on the belief in the names and attributes of God, the concept of predestination and free will and the complex relations that the early Imamiyya and Mu’tazilites shared and differed upon. Only towards the end of his article do we see him mention the Zayidi sect of Shiism in which he discusses the framework for which both Shiite schools of thought, Imamiyya and Zayidi, utilized Mu’tazilite kalam, or Islamic scholasticism and philosophy, as a methodology to orchestrate their respective doctrines.<\/p>\n<p style=\"text-align: justify;\">                Ultimately, each of the four authors demonstrate the process of how the designation of the Imamate came to be canonized and how those various processes were at times both definitive and obscure to an extent. Hodgson highlights that a lineage of twelve hereditary imams could not have existed early on as the full lineage of Imams were not alive. He also emphasizes Imam Ja’far As-Sadiq’s reactions to the Ghulat as a means of crystalizing what would evolve into the Twelver creed and how his Imamate and his lineage produced a disciplined process of designation that provided an “ultimate preeminence as the line of imams par excellence”<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a>. Watt concludes, like Hodgson, that although the notion of Imamate did exist as early as the Abbasid period during Harun al-Rashid’s reign, a definitive form of Twelver doctrine could not have been held until the later part of the ninth century after the death of the eleventh Imam and after the alleged disappearance of the twelfth. Only then, Watt’s states, after Abu-Sahl and al-Hasan ibn Musa of the Nawbakhti tribe had written extensively about the formulation of Imamate in the tenth century, can we finally see an official form of Twelver theology and scholasticism fully come into fruition. What Kohlberg does is draw the distinction between Imamiyya and Itna ‘Ashariyyah (Twelver) yet provides an argument of the smooth transition between the two which allowed for the former to evolve into the latter. He suggests that literature which provided the foundational roots of Twelver doctrine had already existed prior tothe lesser occultation period in the tenth century and had to be brought in line with Imamite dogmatic tendencies through a process of reinterpretation of literature which hinted at the concept of twelve rulers drawn from early Shiite sources and in some cases, Sunni sources. Finally, Madelung emphasizes the process of orchestrating Twelver doctrine was only done through the influence of Mu’tazilite theology and polemics. Through these interactions, different intellectual and theological circles of both Imamaiyya and Mu’tazilite scholars were able to exchange ideas and influence one another yet restricted how much of each other’s doctrines would be adopted.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 521.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 521<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Marshall Hodgson, <em>&#8220;How did the early Shi‘a become Sectarian?,&#8221;<\/em> Journal of the American Oriental Society 75 (1955). P. 1.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 523.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 522.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Marshall Hodgson, <em>&#8220;How did the early Shi‘a become Sectarian?,&#8221;<\/em> Journal of the American Oriental Society 75 (1955). P. 5.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Marshall Hodgson, <em>&#8220;How did the early Shi‘a become Sectarian?,&#8221;<\/em> Journal of the American Oriental Society 75 (1955). P. 5.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 523.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 523.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 523.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a>Kohlberg, Etan. <em>&#8220;From Imāmiyya to Ithnā-ashariyya.&#8221;<\/em> Cambridge University Press on behalf of Bulletin of the School of Oriental and African Studies 39, no. 03 (1976): P. 525.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Marshall Hodgson, <em>&#8220;How did the early Shi‘a become Sectarian?,&#8221;<\/em> Journal of the American Oriental Society 75 (1955). P. 4.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> W. Montgomery Watt, <em>&#8220;Side Lights on Early Imamite Doctrine,&#8221;<\/em> Studia Islamica 30 (1970). Pp. 291-292.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> W. Montgomery Watt, <em>&#8220;Side Lights on Early Imamite Doctrine,&#8221;<\/em> Studia Islamica 30 (1970). P. 294.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Wilferd Madelung, <em>&#8220;Imama,&#8221;<\/em> Encylopaedia of Islam, 2nd ed. P. 13.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> Wilferd Madelung, <em>&#8220;Imama,&#8221;<\/em> Encylopaedia of Islam, 2nd ed. P. 14.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> Wilferd Madelung, <em>&#8220;Imama,&#8221;<\/em> Encylopaedia of Islam, 2nd ed. P. 16.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> Wilferd Madelung, <em>&#8220;Imama,&#8221;<\/em> Encylopaedia of Islam, 2nd ed. P. 14.<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a>Marshall Hodgson, <em>&#8220;How did the early Shi‘a become Sectarian?,&#8221;<\/em> Journal of the American Oriental Society 75 (1955). P. 13.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Examining Shiite theology seems complex at face value, yet when we dive further into the historical development of the Twelver Shiite tradition we begin to face a multitude of historical and theological issues primarily inconsistencies, reinterpretations, polemics, and numerous hadith <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/12\/02\/historica-development-imamah\/\" title=\"Historical Development of Imamah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"class_list":{"0":"post-4213","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4213","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4213"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4213\/revisions"}],"predecessor-version":[{"id":4233,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4213\/revisions\/4233"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4213"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4213"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}