{"id":4220,"date":"2017-12-25T16:29:01","date_gmt":"2017-12-25T16:29:01","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4220"},"modified":"2017-12-25T16:29:01","modified_gmt":"2017-12-25T16:29:01","slug":"infallibility-imams","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/12\/25\/infallibility-imams\/","title":{"rendered":"Infallibility of the Imams and its Evolution"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4220\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Apart from the actual identities of the Imams, there is no specific aspect of Imamate that is as important as the concept of infallibility. Infallibility is the line between a religious opinion and a divine regulation. If it were not for the concept of infallibility, the lines between Sunnis and Shias would perhaps cease to exist, since both parties would rely on the Prophet – peace be upon him – for their guidance alone, and not thirteen other infallibles.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">This article will take a brief look at the stages of evolution in Shiasm:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Heretical Sects<\/li>\n<li>Early Companions of the Imams<\/li>\n<li>Hisham bin Al-Hakam and Infallibility<\/li>\n<li>The Fourth Century<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Heretical Sects<\/strong><\/h2>\n<p style=\"text-align: justify;\">It goes without saying that some early heretical sects believed that certain Imams were infallible. However, their belief in infallibility was not a separate belief on its own; rather, it came with the belief in the divinity of certain Imams.<\/p>\n<p style=\"text-align: justify;\">It is historically agreed upon that some early fanatics believed that Ali was God. Naturally, infallibility came with these claims of divinity.<\/p>\n<p style=\"text-align: justify;\">Examples of this include some of the Kaysaniyyah, who believed that the soul of Allah was manifested into the Prophet – peace be upon him &#8211; , then Ali, then Al-Hasan, then Al-Hussain, then Mohammad bin Al-Hanafiyyah, and so on. (Firaq Al-Shia p. 40)<\/p>\n<p style=\"text-align: justify;\">Another example is some of the Khattabiyyah who believed that Ja’afar Al-Sadiq was Allah and that Abu Al-Khattab was a prophet. (Firaq Al-Shia p. 53)<\/p>\n<p style=\"text-align: justify;\">The earliest example of such an extreme belief comes in the form of the Saba’iyyah who would claimed that Ali was God during his caliphate. (Rijal Al-Kashshi p. 84-85)<\/p>\n<p style=\"text-align: justify;\">It is important to keep in mind that these Shias do not represent what we know today as Twelver Shiasm.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Early Companions of the Imams<\/strong><\/h2>\n<p style=\"text-align: justify;\">In the following decades, it did not seem that “mainstream” Imami Shias adopted this view.<\/p>\n<p style=\"text-align: justify;\">Al-Shaheed Al-Thani, in Haqa’iq Al-Eman (p. 151) points out his observations on early Imami society by saying, “Many of them (companions of the Imams) did not believe in their (the Imam’s) infallibility, because it wasn’t clear to them, but rather, many just believed that they were pious scholars, and this is known to those that read their biographies and narrations, and in the book of Abu Amr Al-Kashshi some (examples) of these.”<\/p>\n<p style=\"text-align: justify;\">This is very apparent, especially in the narrations of some of the closest companions of Al-Baqir and Al-Sadiq. Like always, we will be providing examples through narrations that are authentic according to Shia standards. Below, we list these companions, along with narrations that clearly show that they did not believe in the infallibility of the Imams.<\/p>\n<h3><\/h3>\n<h3>Zurarah bin A’ayan (d. 150 AH)<\/h3>\n<p style=\"text-align: justify;\">He was the closest companion of Al-Baqir and Al-Sadiq. Al-Kashshi mentioned that he is one of the six closest companions and that the Shias are in agreement in believing him. He said: They (the Shias) said: “The most knowledgeable from among them is Zurarah.” (Al-Kashshi p. 174) By returning to books of hadith, we find that there is no companion, from the companions of the Imams that narrated as many narrations as Zurarah.<\/p>\n<p style=\"text-align: justify;\">Al-Kashshi (p. 119) then narrated, from Mohammad bin Mas’oud, that Al-Fadhl bin Shathan wrote to him, from Ibn Abi Umair from Ibrahim bin Abdul Hamid, from Eisa bin Abi Mansour, Abu Usama Al-Shahham, and Ya’qoub Al-Ahmar that they said, “We were sitting with Abu Abdullah – peace be onto him – when Zurarah came in and said, “Al-Hakam bin Uyayna (Utayba) narrates from your father (Al-Baqir) that he said, “Pray Maghrib before arriving at Muzdalifa.” Abu Abdullah – peace be onto him said – : “I contemplated, my father never said such a thing, and Al-Hakam lies upon my father.” Zurarah then left while saying, “<strong>I do not believe that Al-Hakam lied upon his father<\/strong>.<\/p>\n<p>&nbsp;<\/p>\n<h3>Abu Baseer Yahya bin Al-Qasim (d. 150 AH)<\/h3>\n<p style=\"text-align: justify;\">Like Zurarah, Abu Baseer was also included in the list of six closest companions of Al-Baqir and Al-Sadiq. By returning to hadith books, we find that along with Zurarah, he is one of the top narrators of Shia hadith. (Al-Kashshi p. 174)<\/p>\n<p style=\"text-align: justify;\">Al-Kashshi (p. 129) said: From Hamdan, he said: Mu’awiyah narrated to us, from Shu’ayb Al-Aqarqufi, from Abi Baseer: I asked Abu Abdullah – peace be onto him – about a married woman that got married (to another) and was caught. He (Abu Abdullah) said, “She is to be stoned and the man is to be whipped a hundred times for not asking.” Shu’ayb said: I went to Abu Al-Hasan – peace be onto him – and said, “A married woman that gets married (to another)?” He said, “She is to be stoned, while nothing happens to the man.” (Shu’ayb said:) I then met Abu Baseer and told him that I asked Abu Al-Hasan – peace be onto him – about a married woman that gets married (to another) and he said that she is stoned and  he is not punished. Abu Baseer then wiped his chest and said, “<strong>I do not believe that our friend’s wisdom is at its peak yet.<\/strong>”<\/p>\n<p style=\"text-align: justify;\">\n<h3>Aban bin Taghlib (d. 140 AH)<\/h3>\n<p style=\"text-align: justify;\">Aban was a close companion of Zain Al-Abideen, Al-Baqir, and Al-Sadiq. He was appointed by Al-Baqir and Al-Sadiq in the mosque of the Prophet – peace be upon him – to teach the people. (Rija Al-Najashi p. 10 and Rijal Al-Kashshi p. 235)<\/p>\n<p style=\"text-align: justify;\">Ibn Babawaih narrated in Man la Yahduruhu Al-Faqeeh 4\/842:  Abdulrahman bin Al-Hajjaj narrated from Aban bin Taghlib that he said: I told Abi Abdullah – peace be onto him &#8211; : “What do you say about a man that cuts off the finger of a woman?” He said, “Ten camels.” I said, “What about two?” He said, “Twenty.” I said, “Three.” He said, “Thirty.” I said, “Four.” He said, “Twenty.” I said, “Praise be to Allah! If he cuts thirty, then he pays thirty, but if he cuts four then he pays twenty?! <strong>We heard of this while we were in Iraq and we’d disavow ourselves from who says this! We said: This is the view of Satan!<\/strong>” He said, “Calm down Aban, this is the view of the Messenger of Allah – peace be upon him &#8211; …”<\/p>\n<p>&nbsp;<\/p>\n<h3>Abu Al-Abbas Al-Fadhl bin Abdul-Malik Al-Baqbaq<\/h3>\n<p style=\"text-align: justify;\">Abu Al-Fadhl was a reliable companion of Ja’afar Al-Sadiq. (Al-Najashi p. 308)<\/p>\n<p style=\"text-align: justify;\">Al-Kashshi (p. 239) from Hamdooyah and Mohammad, from Mohammad bin Eisa, from Safwan, from Abdulrahman bin Al-Hajjaj, that Abu Al-Abbas Fadhl Al-Baqbaq asked Abu Abdullah – peace be onto him – to allow entry for Hareez, but he didn’t allow him in. He then tried again and he was rejected. Then he (Fadhl) said, “How far can a man go in punishing his young boy?” He (Abu Abdullah) said, “As far as his crimes.” He (Al-Fadhl) said, “<strong>By Allah you have punished Hareez in a way greater than he deserves<\/strong>.” He said, “I have not, for Hareez unsheathed his sword,” He continued, “If it was Huthaifa bin Mansour, he wouldn’t have repeated it once I said no.”<\/p>\n<p>&nbsp;<\/p>\n<h3>Hareez Al-Sijistani<\/h3>\n<p style=\"text-align: justify;\">A reliable companion of Ja’afar Al-Sadiq and one of the biggest hadith narrators. See the above narration.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">The above examples indicate that some of the closest companions of the early Imams did not hold the view that the Imams were infallible. If they did, they would not dispute their judgment in the way that they did.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Hisham bin Al-Hakam and Infallibility<br \/>\n<\/strong><\/h2>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p style=\"text-align: justify;\">After the time of the major students of Al-Baqir and Al-Sadiq, Hisham bin Al-Hakam (d. 199 AH), a companion of Al-Sadiq and Al-Kathim, made the concept of infallibility a mainstream belief. Hisham was a very significant Shi’ee and information about him and his followers can be found in most, if not all books that detail Islamic sects. Ibn Al-Nadeem, in his biography of Hisham in his Fihrist, states that Hisham was the first to expound on the concept of Imamah.<\/p>\n<p style=\"text-align: justify;\">As for his influence in the making the concept of infallibility mainstream, the following can be found in the works of early scholars:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Abu Hasan Al-Ash’ari (d. 324 AH) in his Maqalaat (p. 56) said, “The <em>rawafidh<\/em> differed as to whether it is possible for the Messenger – peace be upon him – to sin. One group said that it is possible for him to sin against Allah, which is what he did with the prisoners of war at Badr, while it is not possible for the Imams to sin, since the <em>wahee<\/em>, which came from Allah would come to the Messenger if he sinned, while the Imams do not have <em>wahee<\/em>, nor do they receive angels, so they are infallible and do not make mistakes, even though it is possible for the Messenger to sin. This is the view of Hisham bin Al-Hakam.”<\/li>\n<li>Al-Malti (d. 377 AH), an Athari scholar said, “He (Hisham) said that it is impossible for him (Ali) to make a mistake, or be ignorant, or to be incapable, and that he is infallible.”<\/li>\n<li>Al-Qadhi Abdul Jabbar Al-Mu’tazili (d. 415 AH) adds in his Tathbeet Dala’il Al-Nubuwwa 2\/528 that early Shias did not believe in the infallibility of Ali, and that the first to have held this view is Hisham bin Al-Hakam.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The three statements come from three early scholars that come from different ideologies, but were close enough to the time of Hisham to be aware of his views and influence. Even though there are differences in the above three statements, we find three different scholars attributing the concept to Hisham bin Al-Hakam specifically, instead of attributing it to Shiasm in general.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">These statements are supported by a section in Ibn Babawayh’s Ma’ani Al-Akhbar (p. 117-118), where he provides three narrations under the heading: Meaning of the Ismah (infallibility) of the Imam. In the section, he provides two narrations that are directly from Hisham bin Al-Hakam.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Hussain Al-Ashqar said: I asked Hisham bin Al-Hakam, “What is the meaning of your view that the Imam is infallible?” He (Hisham) said, “I asked Abu Abdullah – peace be onto him – and he said, ‘An infallible is one that is prevented by Allah from his prohibitions for Allah said: ‘And whoever holds fast to Allah, he indeed is guided to the right path. (3:101)’’”<\/li>\n<li>Ibn Abi Umair said, “I did not hear or gain from Hisham bin Al-Hakam in my lengthy time with him something better than what he spoke of about the infallibility of the Imam. One day, I asked him, ‘Is the Imam infallible?’ He said, ‘Yes’. I said, ‘Then how is he infallible and how is this known?’”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The statement above shows that Ibn Abi Umair, who was one of the six most reliable students of Al-Kathim (Al-Kashshi p. 394), who was more knowledgeable that Yunus bin Abdul-Rahman, the most knowledgeable Shia scholar of his time (Al-Kashshi p. 416), only learned about infallibility from Hisham bin Al-Hakam, not from the Imams themselves.<\/p>\n<p style=\"text-align: justify;\">Of course, it would be false to claim that Hisham created the concept, since it did exist among early heretical sects, however, we can conclude from the above that Hisham made it a mainstream opinion. Another possible conclusion is that he was the first Shia scholar to hold the belief while rejecting the divinity of the Imams.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Infallibility in the Fourth Century<\/strong><\/h2>\n<p style=\"text-align: justify;\">Twelver Shiasm, as one can find in our articles on the ideology was an evolving ideology. The plethora of narrations that were left behind by the companions of the Imams were finally used to canonize a complete ideology, and this was seen in action through the works of classical scholars like Ibn Babawayh, Al-Mufeed, and Al-Tusi.<\/p>\n<p style=\"text-align: justify;\">Ibn Babawayh (d. 381 AH) in his I’itiqadaat (Musanafaat Al-Mufeed 5\/96) said the following in his chapter on infallibility:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Our belief in the prophets, messengers, Imams, and angels, is that they are infallible and cleansed from all impurity, that they do not commit major or minor sins, nor do they go against Allah in what He has ordered them, and they do as they are told by Him. Whoever rejects their infallibility in any of their states is ignorant of them. We believe that they are perfect and complete, knowledgeable in all matters from beginning to end, and that incompletion, sin, or ignorance, cannot be ascribed to them.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The editor adds that in several manuscripts of the work, there is an addition which states that “whoever rejects their infallibility, in any of their states is ignorant of them, and whoever is ignorant of them, is a disbeliever.”<\/p>\n<p style=\"text-align: justify;\">Al-Mufeed (d. 413 AH), who is known for refuting Ibn Babawayh, affirms his beliefs in infallibility, and thus, this ideology remains a part of Twelver Shiasm to our times.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">The belief in infallibility was not always a mainstream belief that was adopted by all Shias, rather, it was a heretical belief at first, but only became a mainstream view due to Hisham bin Al-Hakam (d. 199 AH), before finally being canonized when books of ideology were compiled.<\/p>\n<p style=\"text-align: justify;\">Shias may argue that the infallibility of the Imams was never a matter of dispute and that it is clear in the Qur’an in verse 33:33. However, the Imams did not say that this is evidence of their infallibility, but rather, provided a completely different interpretation. Refer to our article on the meaning of <a href=\"http:\/\/www.twelvershia.net\/2017\/01\/17\/meaning-rijs-3333\/\">Rijs<\/a> for more.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Apart from the actual identities of the Imams, there is no specific aspect of Imamate that is as important as the concept of infallibility. Infallibility is the line between a religious opinion and a divine regulation. If it were not <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/12\/25\/infallibility-imams\/\" title=\"Infallibility of the Imams and its Evolution\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"class_list":{"0":"post-4220","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4220","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4220"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4220\/revisions"}],"predecessor-version":[{"id":4222,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4220\/revisions\/4222"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4220"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4220"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4220"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}