{"id":4223,"date":"2017-12-31T07:12:39","date_gmt":"2017-12-31T07:12:39","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4223"},"modified":"2017-12-31T07:12:39","modified_gmt":"2017-12-31T07:12:39","slug":"yazeed-war-people-madinah-makkah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2017\/12\/31\/yazeed-war-people-madinah-makkah\/","title":{"rendered":"Yazeed and his War on the People of Madinah &#038; Makkah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4223\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify; padding-left: 30px;\">The following is a translation of the events that transpired in the year 63-64 AH in the reign of Yazeed bin Mu’awiyah. The source used for the events was Tareekh Khalifa bin Khayyat (d. 240 AH) (p. 147-159) who quotes the most relatively authentic material in the subject. We have included chapter headings for the sake of order and clarity. Chapters have also been reordered for the sake of clarity as well. This article includes some of Yazeed’s crimes which led some Sunni scholars to permitting the cursing of Yazeed. However, cursing is generally frowned upon, and we refer readers to our article on the subject of <a href=\"http:\/\/www.twelvershia.net\/2017\/09\/15\/lanat\/\"><em>lanat<\/em><\/a>.<\/p>\n<p>&nbsp;<\/p>\n<ul>\n<li><strong>The People of Madinah relinquish their Pledge to Yazeed<\/strong>\n<ul>\n<li><strong>Yazeed prepares the Troops<\/strong><\/li>\n<\/ul>\n<\/li>\n<li><strong>The Battle<\/strong>\n<ul>\n<li><strong>The Death of the sons of Zaynab bint Ali<\/strong><\/li>\n<li><strong>Abu Sa’eed Al-Khudri avoids Bloodshed<\/strong><\/li>\n<li><strong>Number of those Killed<\/strong><\/li>\n<\/ul>\n<\/li>\n<li><strong>Ibn Al-Zubair refuses to pledge to Yazeed<\/strong>\n<ul>\n<li><strong>Makkah is Surrounded<\/strong><\/li>\n<li><strong> The Burning of the Ka’aba<\/strong><\/li>\n<\/ul>\n<\/li>\n<li><strong>The Death of Yazeed and his Successor<\/strong><\/li>\n<\/ul>\n<h2 style=\"text-align: justify;\"><strong>The People of Madinah relinquish their Pledge to Yazeed<\/strong><\/h2>\n<p style=\"text-align: justify;\"><strong><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/12\/Extremely-rare-view-of-Masjid-an-Nabawi-Medina-1850.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-4225 size-thumbnail\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/12\/Extremely-rare-view-of-Masjid-an-Nabawi-Medina-1850-150x150.jpg\" alt=\"madinah vs yazeed\" width=\"150\" height=\"150\" \/><\/a><\/strong>Khalifa said: Abu Yaqthan (a reliable genealogist) said: Uthman bin Mohammad (bin Abi Sufyan) led the pilgrimage in the year 62, then came to Madinah and spent a month. Then he sent a delegation to Yazeed bin Mu’awiyah, which included: Abdullah bin Abi Amr bin Hafs bin Al-Mugheera Al-Makhzoomi, Mohammad bin Amr bin Hazm Al-Ansari, a man from sons of Suraqa from the sons of Adi bin Ka’ab, and a group of men from Quraish. When they got to Madinah, they cursed Yazeed, disavowed themselves from him, and relinquished their pledge to him.<\/p>\n<p style=\"text-align: justify;\">Khalifa said: Wahb bin Jareer said to us: Juwairiya bin Asma’ said to me: I heard some sheikhs from Madinah said that from among the delegation to Yazeed bin Mu’awiyah was Abdullah bin Hanthala, and he had eight of his sons with him. He (Yazeed) gifted him a hundred thousand and gifted each of the men ten thousand dirhams, as well as some clothes and goods. When Abdullah bin Hanthala arrived at Madinah, some men came to him and said, “What happened?” He said, “I come to you from a man that I would fight, by Allah, even if I had nobody with me other than my sons.” They said, “We were told that he gave you gifts and treated you well.” He said: “He did, and I wouldn’t have accepted, but I wanted to use it to gain strength against him.” He then encouraged the people, and they pledged their allegiance to him.<\/p>\n<p style=\"text-align: justify;\">Khalifa said: Abu Yaqthan said: They called to an agreement and a consultation and placed Abdullah bin Mutee’ Al-Adawi as the head of Quraish, Abdullah bin Hanthala Al-Ghaseel upon the Ansar, and Ma’qil bin Sinan Al-Ashja’ee as the head of the tribes of the Muhajireen. They then drove out Uthman bin Mohammad bin Abi Sufyan from Madinah, and he was placed in charge by Bani Umayyah.<\/p>\n<p style=\"text-align: justify;\">Khalifa said: Wahb narrated to me, he said: My father narrated to me from Ayoub, that Ibn Abbas asked about them while he was in Al-Ta’if, so he was told, “Abdullah bin Mutee’ was made the head of Quraish and Abdullah bin Hanthala upon the Ansar.” He said, “Two leaders? These people will meet their demise.”<\/p>\n<p style=\"text-align: justify;\">He (Wahb) said: Juwairiyah bin Asma’ narrated to me: I heard sheikhs from the people of Madinah say that when Mu’awiyah was dying, he called onto Yazeed and said, “If you face a day (of tribulations) from the people of Madinah, then face them with Muslim bin Uqba, for he is a man of good advice.”<\/p>\n<h3 style=\"text-align: justify;\"><strong>Yazeed prepares the Troops<\/strong><\/h3>\n<p style=\"text-align: justify;\">Khalifa said: Wahb said: My father narrated to me, he said: When the people of Madinah drove Bani Umayyah and Marwan, they stayed in Jafeel. Marwan wrote to Yazeed about what the people had arrived to. He (Yazeed) pitched a tent outside his place and sent messengers with Muslim bin Uqba Al-Marri. By the third day he had the battalions gathered in front of him.<\/p>\n<p style=\"text-align: justify;\">Yazeed then recited:<\/p>\n<p style=\"text-align: justify;\">Tell Abu Bakr (Ibn Al-Zubair) when the army rallies<\/p>\n<p style=\"text-align: justify;\">When the army comes forth to Al-Qura valley<\/p>\n<p style=\"text-align: justify;\">Gather the women to come and observe<\/p>\n<p style=\"text-align: justify;\">Khalifa said: Abu Al-Yathan and others said: Yazeed sent Muslim bin Uqba, who was sick during travel, and told him, “If anything happened, then appoint Husain bin Numair.”<\/p>\n<p style=\"text-align: justify;\">(Continuation of the narration of Juwairiyah…)<\/p>\n<p style=\"text-align: justify;\">When the people of Madinah did what they did, he (Yazeed) sent Muslim bin Uqba. The people of Madinah then headed to the waters between them and the people of Al-Sham, then poured into them liquid copper and contaminated them.  Allah then sent away the clouds and they (the people of Al-Sham) were not able to drink from their buckets until they entered Madinah.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>The Battle<\/strong><\/h2>\n<p style=\"text-align: justify;\">Khalifa said: Wahb said in his narration from Juwairiyah, he said: The people of Madinah came out in large numbers and in a way that was never seen before. When the people of Al-Sham saw them, they felt awe and hated to fight them. Muslim then had a bed placed between both armies, then ordered his crier to say: “Fight them off me or push them back fiercely.” The men engaged in battle and heard a <em>takbeer<\/em> from within Madinah, for Banu Haritha aided the people of Al-Sham in breaking through and were on the ground. The men (of Madinah) were defeated while Abdullah bin Hanthala was lying down asleep onto his son. His son then woke him up. When he opened his eyes and noticed what has happened, he sent his eldest son to fight, who did until he was killed, and they kept on fighting one after the other until all his sons were killed. He (Abdullah) then broke his sword holster and fought until he was killed. Muslim bin Uqba then entered Madinah and called the people to pledge allegiance as slaves of Yazeed bin Mu’awiyah, and that he is to decide the fate of their family, blood, and wealth. Abdullah bin Zam’a, who was a close friend of Yazeed bin Mu’awiyah, was brought forward. He (Muslim) said, “Pledge that you are a slave of the Commander of the Believers and that he is to decide the fate of your family, blood, and wealth.” He said, “I pledge to you that I am the cousin of the Commander of the Believers and that he is to decide the fate of my blood, family, and wealth.” He (Muslim) said, “Kill him.” Mawran then leaped, hugged him, and said, “He will pledge in whichever way you want!” He (Muslim) said, “By Allah, I will never let him take it back,” and then said, “He will move away, or else, kill them both.” Marwan then let him go and Ibn Zam’a was killed.<\/p>\n<p style=\"text-align: justify;\">Khalifa said: Abu Al-Hasan said: Awana said: When Yazeed bin Abdullah bin Zam’a was brought to Muslim, he said, “Pledge your allegiance.” He said, “I pledge to you on the book of Allah and the <em>sunnah<\/em> of His prophet.” He (Muslim) ordered that he (Yazeed bin Abdullah) was to be killed.<\/p>\n<h3 style=\"text-align: justify;\"><strong>The Death of the sons of Zaynab bint Ali<\/strong><\/h3>\n<p style=\"text-align: justify;\">Khalifa said: Wahb narrated to us: My father narrated to me: Al-Hasan narrated to us: When the sons of Zaynab were killed on the day of Al-Harrah, they were brought to her. She said, “We belong to Allah, and to Him we return! What happened to them is such a tragedy for me, and what happened to him (a son) is a greater tragedy than what happened to him (the other son). He (a son) stuck his hand out, fought and was killed, and I fear for him, while he (the other son), kept his hand in place and was killed, and I hope well for him.<\/p>\n<h3 style=\"text-align: justify;\"><strong>Abu Sa’eed Al-Khudri avoids Bloodshed<\/strong><\/h3>\n<p style=\"text-align: justify;\">Khalifa said: Wahb bin Jareer narrated to us: Abu Aqeel Al-Dawraqi said: I heard Abu Nadhra say: On the day of Al-Harrah, Abu Sa’eed Al-Khudri entered a cave, then a man came into it and left, who then went to a man from the people of Al-Sham and said, “Shall I show you where a man is so that you may kill him?” When the man from Al-Sham reached the cave, he said to the armed Abu Sa’eed, “Come out to me.” He said, “No, and if you enter, I will kill you.” The man from Al-Sham came in. Abu Sa’eed dropped his sword and said, “I want you to bear my sin and bear yours, to be one of the people of hellfire, and that is the penalty of the oppressors.” He said, “Are you Abu Sa’eed?” He said, “Yes.” He said, “Ask that I may be forgiven.” He said, “May Allah forgive you.”<\/p>\n<h3 style=\"text-align: justify;\"><strong>Number of those Killed<\/strong><\/h3>\n<p style=\"text-align: justify;\">Khalifa said: Those that were killed from the Ansar were one hundred and seventy three men, while those that were killed from Quraish and the Ansar were three hundred and six men.<\/p>\n<p style=\"text-align: justify;\">(Khalifa includes a lengthy list of all those that were killed, including sons and grandsons of notable companions, like the sons of Asim bin Omar bin Al-Khattab, Zaid bin Abdulrahman bin Awf, and the sons of Zaid bin Thabit.)<\/p>\n<h2 style=\"text-align: justify;\"><strong>Ibn Al-Zubair refuses to pledge to Yazeed<\/strong><\/h2>\n<p style=\"text-align: justify;\"><strong><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/12\/Photos-of-Mecca-Makkah-–-Extremely-old-and-rare-photo-of-Kaaba-Mecca-–-Photos-pictures-images-of-Mecca.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignleft wp-image-4224 size-thumbnail\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2017\/12\/Photos-of-Mecca-Makkah-–-Extremely-old-and-rare-photo-of-Kaaba-Mecca-–-Photos-pictures-images-of-Mecca-150x150.jpg\" alt=\"makkah vs yazeed\" width=\"150\" height=\"150\" \/><\/a><\/strong>Khalifa said: Abu Al-Hasan narrated to us, from Baqiyyah bin Abdulrahman, from his father, who said: When Yazeed bin Mu’awiyah learned that the people of Makkah wanted Ibn Al-Zubair to pledge and that he refused, he sent Al-Nu’man bin Basheer Al-Ansari and Hammam bin Qabeesa Al-Numairi to Ibn Al-Zubair to make him pledge allegiance to Yazeed, and that he would receive authority over Al-Hijaz, whatever he wanted, and authority to any of his relatives. When they came to Ibn Al-Zubair and offered him what Yazeed ordered, Ibn Al-Zubair said, “Do you order me to pledge to a man who drinks alcohol and avoids prayer while going out on hunting trips?” Hammam said, “That description fits you more closely.” A man from Quraish then punched him (Hammam). They returned to Yazeed, who was angered, and swore to never accept his pledge except with shackles on his hand.<\/p>\n<p style=\"text-align: justify;\">Khalifa said: Abu Al-Hasan said: From a man from the people of Makkah, from Salih bin Kaysan, from Abdulaziz bin Marwan, he said: Yazeed sent Ibn Udhaah Al-Ash’ari to Ibn Al-Zubair, asking him to pledge his allegiance, and with him were silver shackles and a silk robe. He came to Ibn Al-Zubair who was sitting at Al-Abtah with Ayoub bin Abdullah bin Zuhair bin Abi Umayyah Al-Makhzoomi during the reign of Al-Harith bin Khalid bin Al-Aas bin Hashim bin Al-Mugheera over Makkah. Ibn Udhaah spoke to him as Ibn Al-Zubair poked the ground. Ayoub said, “You don’t seem to be worried about them O’ Abu Bakr.” Ibn Al-Zubair raised his head and said, “He swore that he would not accept my pledge except if I came in shackles, may Allah not fulfill what he swore.”<\/p>\n<p style=\"text-align: justify;\">Ibn Al-Zubair then recited:<\/p>\n<p style=\"text-align: justify;\">I will not become soft for other than truth,<\/p>\n<p style=\"text-align: justify;\">Until rocks become soft for a chewing tooth.<\/p>\n<p style=\"text-align: justify;\">He then said, “By Allah, I will not pledge to Yazeed nor will I obey him.”<\/p>\n<h3 style=\"text-align: justify;\"><strong>Makkah is Surrounded<\/strong><\/h3>\n<p style=\"text-align: justify;\">Khalifa said: In this year (64 AH), Muslim bin Uqba Al-Marri died, may Allah curse him and not be merciful with him. He marched the people, while nearing death, to Makkah, until he arrived at Al-Abwa’a he became more sick. When he saw that death was close, he called onto Husain bin Numair Al-Kindi and said, “I have called for you and I do not know, should I put you in charge of the army or if I should have your head cut off.” He said, “May Allah make you well, I am your arrow, so shoot me wherever you want.” He (Muslim) said, “You are a dry Bedouin, and these Qurashis will win over the opinion of whomever lends them an ear, so take this army, and if you meet them (the Qurashis), do not lend them you ear, but stand still, fight, then leave.”<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h3 style=\"text-align: justify;\"><strong>The Burning of the Ka’aba<\/strong><\/h3>\n<p style=\"text-align: justify;\">Khalifa said: Al-Ansari and Ghundar narrated to us: Ibn Juraij said: Ibn Al-Zubair took the mosque as a fort, and within it the tents were placed. A man from the people of Al-Sham burned down the door of Bani Jumah, which caused the fire to spread until it reached the door of the Ka’aba and burned it.<\/p>\n<p style=\"text-align: justify;\">Ibn Juraij said: I heard Ibn Abi Ammar say: A man from the people of Al-Sham was at the edge of Zamzam said, “By He who holds the soul of Mohammad in his hand, the <em>furqaan<\/em> (what separates truth and falsehood) or <em>fareeqaan<\/em> (the two groups) are doomed.”<\/p>\n<p style=\"text-align: justify;\">Ibn Juraij said: Ibn Abi Mulaika said: Ibn Al-Zubair isolated himself towards Dar Al-Nadwa in that area, then he said, “O’ Lord O’ Lord! If I knew this would happen! O’ Lord O’ Lord! The fillings of the Ka’aba have become fragile and it has weakened to the point that a bird would cause its stones to break off.”<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Death of Yazeed and his Successor<\/strong><\/h2>\n<p style=\"text-align: justify;\">Khalifa said: His (Husain bin Numair’s) army surrounded the people of Makkah until the death of Yazeed. When Ibn Al-Zubair heard of his death, he said, “Why do you fight when your companion is dead?” They said, “We fight for his successor.” He said, “His successor is dead.” They said, “We fight for his successor.” He (Al-Zubair) said, “He did not appoint anyone.” Al-Husain said, “Surely news travels fast if what you say is true.”<\/p>\n<p style=\"text-align: justify;\">(The army of Al-Sham then withdrew.)<\/p>\n<p style=\"text-align: justify;\">Khalifa said: In this year (64 AH), Yazeed bin Mua’wiyah passed away in Huwwareen in Hims, and his son Mu’awiyah bin Yazeed bin Mu’awiyah led his funeral in the night of a full moon in the month of Rabee’ Al-Awal. His mother was Maysoon bint Bahdal Al-Kalbiyyah, and he died at the age of thirty eight, and some said he was forty something. He reigned for three years, nine months, and twenty two days, and appointed his son Mu’awiyah bin Yazeed bin Mu’awiyah, who kept his father’s representatives and did not appoint anyone. He remained sick until he died at the age of twenty one years, and it is said: Twenty years. Al-Waleed bin Utba bin Abi Sufyan led his funeral. His (Mu’awiyah’s) reign lasted around a month and a half, and it is said: Mu’awiyah died after his father Yazeed by forty days and he was only eighteen years old.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a translation of the events that transpired in the year 63-64 AH in the reign of Yazeed bin Mu’awiyah. The source used for the events was Tareekh Khalifa bin Khayyat (d. 240 AH) (p. 147-159) who quotes <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2017\/12\/31\/yazeed-war-people-madinah-makkah\/\" title=\"Yazeed and his War on the People of Madinah &#038; Makkah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4225,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-4223","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4223","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4223"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4223\/revisions"}],"predecessor-version":[{"id":4237,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4223\/revisions\/4237"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4225"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}