{"id":4240,"date":"2018-01-01T09:31:15","date_gmt":"2018-01-01T09:31:15","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4240"},"modified":"2018-01-01T10:23:24","modified_gmt":"2018-01-01T10:23:24","slug":"infallible-handwriting-mahdi","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/01\/01\/infallible-handwriting-mahdi\/","title":{"rendered":"The infallible handwriting of their &#8220;Mahdi&#8221;"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4240\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">No doubt, the four emissaries (Sufara&#8217;) of the Twelver Shia&#8217;s 12th Imam or &#8220;Mahdi&#8221; as they call him are some of the most suspicious characters in classical Islamic history. Below, we will translate a piece of the research one of our brothers conducted in Arabic may Allah benefit us all through it.<\/p>\n<p style=\"text-align: justify;\">We begin with the death of the 11th Imam, al-Hasan al-`Askari in 260 AH. The Imami Shia who claimed the birth of a son, viewed it necessary to follow an emissary in the absence of their hidden leader. A person who acts as his representative when it comes to collecting money and answering questions. The Shia scholars agreed that one of the conditions of recognizing the authentic emissaries from among the frauds is that they will produce letters with the noble handwriting of the Imam.<\/p>\n<p style=\"text-align: justify;\">It is to be noted, that those emissaries concentrated a lot more on collecting Khums money than on answering religious questions.<\/p>\n<p style=\"text-align: justify;\">In fact, the four emissaries seemed so ignorant that they could not answer more than a hundred questions of Islamic jurisprudence within the entire period of seventy years. Refer back to their narrations to see the small amount of religious matters they dealt with. Of course, this is confirmed by the Shia scholar Muhammad Sanad al-Bahrani who says:<\/p>\n<p style=\"text-align: justify;\">هو أنه كان نصب النواب الأربعة من الناحية المقدسة في الأمور التنفيذية من قبض مال الصاحب ورفع الأسئلة<\/p>\n<p style=\"text-align: justify;\">[The four emissaries were appointed by the holy seat (12th Imam) to take care of <strong>executive matters<\/strong> such as collecting his money and transmitting the questions to him]<\/p>\n<p style=\"text-align: justify;\">They were unqualified that major Imami scholars like al-Kulayni himself who lived in their time completely ignored them probably due to distrust. They failed to answer many of the questions so they&#8217;d shamelessly ask people to do their own research instead. Muhammad Sanad states:<\/p>\n<p style=\"text-align: justify;\">حتى إن في كثير من الاسئلة الموجهة للناحية المقدسة يجيبهم عجل الله فرجه بالرجوع الى كتب الروايات<\/p>\n<p style=\"text-align: justify;\">[In a lot of the questions transmitted to the holy seat, he (as) responds by telling them to <strong>refer back to the books<\/strong> of the narrations for answers.]<\/p>\n<p style=\"text-align: justify;\">Source: Buhuth fi Mabani `Ilm-ul-Rijal pg.47-48<\/p>\n<p style=\"text-align: justify;\">It actually seems those emissaries themselves could not benefit from the presence of the absent Imam. Shia leader al-Tusi says that the third emissary, Husayn bin Rawh authored a book in which he compiled the narrations of the narrators from the previous Imams then presented it to the scholars and jurists of Qum so they may authenticate it for him. The Qummies did so, except the matter concerning the allotted amount for Zakat-ul-Fitr as that was in conflict with the sect&#8217;s consensus.<\/p>\n<p style=\"text-align: justify;\">Source: Ghaybat-ul-Tusi pg.390<\/p>\n<p style=\"text-align: justify;\">Similarly, the first and second emissaries had to write a book on what they heard from the two `Askari Imams as well as the reports of the narrators from previous Imams. This book was inherited by a woman from their progeny and the sect of Shia accepted it as one of their books of Hadith.<\/p>\n<p style=\"text-align: justify;\">Source: Ghaybat-ul-Tusi pg.363<\/p>\n<p style=\"text-align: justify;\">These emissaries announced that they are in direct contact with the hidden leader, the secret son of al-Hasan al-`Askari who had just died. In order to fool the Shia community, they began producing letters called Tawqee`at (rescripts) which they claimed were written by the concealed Imam in his own handwriting and noble seal.<\/p>\n<p style=\"text-align: justify;\">This is how the matter of these writings progressed:<\/p>\n<p style=\"text-align: justify;\">Time of Imam al-Hasan al-`Askari (died 260 AH): Letters were being issued in his name with the infallible handwriting via his representatives `Uthman bin Sa`id and his son Muhammad bin `Uthman.<\/p>\n<p style=\"text-align: justify;\">Time of `Uthman bin Sa`id al-`Amri (died 265 AH): The first emissary and perfect man for the job, an oil merchant! letters continued being issued in the same infallible handwriting as before until his death.<\/p>\n<p style=\"text-align: justify;\">Time of Muhammad bin `Uthman al-`Amri (died 304 AH): The son of the first emissary, letters continued being issued in the same infallible handwriting until Muhammad was on his death-bed.<\/p>\n<p style=\"text-align: justify;\">Time of Husayn bin Rawh al-Nawbakhti (died 326 AH): Letters were no longer being issued in infallible handwriting and the mentioning of the holy seal ceased. The third emissary and his companion wrote in their own handwriting.<\/p>\n<p style=\"text-align: justify;\">In brief, the same handwriting was being produced during the time of Imam al-Hasan al-`Askari, during the time of the first emissary `Uthman bin Sa`id and after they both died, it continued during the time of the second emissary Muhammad bin `Uthman but stopped while he was on his deathbed. This leads us to believe that the person who was forging these rescripts in the name of al-`Askari as well as after his death and kept producing the same handwriting was none other than the first emissary&#8217;s son Muhammad bin `Uthman.<\/p>\n<p style=\"text-align: justify;\">وذكر أبو نصر هبة الله [ بن ] محمد بن أحمد أن أبا جعفر العمري رحمه الله مات في سنة أربع وثلاثمائة ، وأنه كان يتولى هذا الامر نحوا من خمسين سنة يحمل الناس إليه أموالهم ، ويخرج إليهم التوقيعات بالخط الذي كان يخرج في حياة الحسن عليه السلام<\/p>\n<p style=\"text-align: justify;\">Shia leader al-Tusi says:<\/p>\n<p style=\"text-align: justify;\">[Abu Nasr Hibatullah bin Muhammad bin Ahmad mentioned that aba Ja`far al-`Amri (second emissary) may God have mercy on him died in the year 304. He used to be in charge of this matter for around fifty years, the people were giving him their money while he kept producing the rescripts in <strong>the same handwriting as those produced during the life of al-Hasan<\/strong> (as).]<\/p>\n<p style=\"text-align: justify;\">Source: Ghaybat-ul-Tusi pg.366<\/p>\n<p style=\"text-align: justify;\">Shia leader al-Majlisi writes:<\/p>\n<p style=\"text-align: justify;\">وكانت توقيعات صاحب الامر عليه السلام تخرج على يدي عثمان بن سعيد (السفير الأول) وابنه أبي جعفر محمد بن عثمان (السفير الثاني) إلى شيعته وخواص أبيه أبي محمد عليه السلام &#8211; بالأمر والنهي والأجوبة عما تسأل الشيعة عنه إذا احتاجت إلى السؤال فيه &#8211; بالخط الذي كان يخرج في حياة الحسن عليه السلام<\/p>\n<p style=\"text-align: justify;\">[The rescripts of the master of the age (as) continued to be issued by the hands of `Uthman bin Sa`id (first emissary) and his son abi Ja`far Muhammad bin `Uthman (second emissary). These writings would reach his (as) Shia as well as his father&#8217;s (as) closest companions -containing orders, prohibitions &amp; answers to the Shia&#8217;s questions- in <strong>the same handwriting that used to emerge in the life of al-Hasan<\/strong> (as).]<\/p>\n<p style=\"text-align: justify;\">Source: Bihar al-Anwar 51\/346<\/p>\n<p style=\"text-align: justify;\">In the time of Muhammad bin `Uthman and his father, the same handwriting continued.<\/p>\n<p style=\"text-align: justify;\">أبو العباس : وأخبرني هبة الله بن محمد ابن بنت أم كلثوم بنت أبي جعفر العمري رضي الله عنه ، عن شيوخه قالوا : لم تزل الشيعة مقيمة على عدالة عثمان بن سعيد رحمه الله (السفير الأول) وغسله ابنه أبو جعفر محمد بن عثمان (السفير الثاني) وتولى القيام به وجعل الامر كله مردودا إليه ، والشيعة مجمعة على عدالته وثقته وأمانته ، لما تقدم له من النص عليه بالأمانة والعدالة ، والامر بالرجوع إليه في حياة الحسن عليه السلام وبعد موته في حياة أبيه عثمان بن سعيد ، لا يختلف في عدالته ، ولا يرتاب بأمانته ، و التوقيعات يخرج على يده إلى الشيعة في المهمات طول حياته بالخط الذي كانت تخرج في حياة أبيه عثمان<\/p>\n<p style=\"text-align: justify;\">[Abu al-`Abbas said: I was told by Hibatullah bin Muhammad ibn bint Umm Kulthum the daughter of abi Ja`far al-`Amri (ra), that his teachers told him: The Shia continued to agree on the uprightness of `Uthman bin Sa`id (first emissary), he was washed by his son abu Ja`far Muhammad bin `Uthman (second emissary) who took charge of all his affairs while the Shia agreed on his uprightness, reliability and trust. This is due to the aforementioned statements declaring his trustworthiness and reliability by al-Hasan (as) during his life as well as during the life of his father `Uthman bin Sa`id, none questioned his integrity and the rescripts emerged through him to the Shia during the entirety of his life in <strong>the same handwriting as that during his father `Uthman&#8217;s life<\/strong>.]<\/p>\n<p style=\"text-align: justify;\">Source: Ghaybat-ul-Tusi pg.220<\/p>\n<p style=\"text-align: justify;\">However, when the second emissary became terribly ill, right before his death he announced his will that he is to be succeeded by Ibn Rawh verbally without any written document with infallible handwriting or noble seal.<\/p>\n<p style=\"text-align: justify;\">Al-Tusi says:<\/p>\n<p style=\"text-align: justify;\">وأخبرنا ( جماعة ) عن أبي محمد هارون بن موسى ، قال : أخبرني أبو علي محمد بن همام رضي الله عنه وأرضاه أن أبا جعفر محمد بن عثمان العمري قدس الله روحه جمعنا قبل موته وكنا وجوه الشيعة وشيوخها . فقال لنا : إن حدث علي حدث الموت فالامر إلى أبي القاسم الحسين بن روح النوبختي فقد أمرت أن أجعله في موضعي بعدي فارجعوا إليه وعولوا في أموركم عليه<\/p>\n<p style=\"text-align: justify;\">[We were told by a group, from abu Muhammad Harun bin Musa that he said: I was told by abu `Ali Muhammad bin Hammam (ra) that abu Ja`far Muhammad bin `Uthman al-`Amri (second emissary) gathered the heads and leaders of the Shia right before his death. <strong>He told us<\/strong>: &#8220;If I die, then the affair belongs to abu al-Qasim bin Rawh. <strong>I was ordered<\/strong> to place him in my position so seek him and rely on him.&#8221;]<\/p>\n<p style=\"text-align: justify;\">وأخبرني الحسين بن إبراهيم عن ابن نوح ، عن أبي نصر هبة الله بن محمد قال : حدثني خالي أبو إبراهيم جعفر بن أحمد النوبختي قال : قال لي أبي أحمد بن إبراهيم وعمي أبو جعفر عبد الله بن إبراهيم وجماعة من أهلنا يعني بني نوبخت : أن أبا جعفر العمري لما اشتدت حاله اجتمع جماعة من وجوه الشيعة ، منهم أبو علي بن همام وأبو عبد الله بن محمد الكاتب وأبو عبد الله الباقطاني وأبو سهل إسماعيل بن علي النوبختي وأبو عبد الله بن الوجناء وغيرهم من الوجوه ( و ) الأكابر ، فدخلوا على أبي جعفر ( رض ) فقالوا له : إن حدث أمر فمن يكون مكانك ؟ فقال لهم : هذا أبو القاسم الحسين بن روح بن أبي بحر النوبختي القائم مقامي والسفير بينكم وبين صاحب الامر عليه السلام والوكيل [ له ] والثقة الأمين ، فارجعوا إليه في أموركم وعولوا عليه  في مهماتكم فبذلك أمرت وقد بلغت<\/p>\n<p style=\"text-align: justify;\">[I was told by al-Husayn bin Ibrahim from Ibn Nuh, from Nasr bin Hibatullah bin Muhammad: I was told by my uncle abu Ibrahim Ja`far bin Ahmad al-Nawbakhti: I was told by my father Ahmad bin Ibrahim and uncle abu Ja`far `Abdullah bin Ibrahim and a group of our family (banu Nawbakht) that: When aba Ja`far al-`Amri&#8217;s (second emissary) illness intensified, a group of Shia leaders gathered (&#8230;until he said&#8230;) He told them: &#8220;This is abu al-Qasim al-Husayn bin Rawh bin abi Bahr al-Nawbakhti, he shall take my place and be the emissary between you and the possessor of authority (as), he shall be his trusted representative so seek him and rely on him in your duties <strong>for I was ordered to tell you this<\/strong>.]<\/p>\n<p style=\"text-align: justify;\">Source: Ghaybat-ul-Tusi pg.371-372<\/p>\n<p style=\"text-align: justify;\">Obviously, he never produced any letters here because he was dying and therefore couldn&#8217;t forge one with the same perfected handwriting and noble infallible seal.<\/p>\n<p style=\"text-align: justify;\">As for the third emissary, all rescripts and letters in his time were either his own handwriting or that of a friend, no mention of any infallible handwriting or noble seals.<\/p>\n<p style=\"text-align: justify;\">Tusi says:<\/p>\n<p style=\"text-align: justify;\">أخبرنا جماعة ، عن أبي الحسن محمد بن أحمد بن داود القمي قال : وجدت بخط أحمد بن إبراهيم النوبختي وإملاء أبي القاسم الحسين بن روح (السفير الثالث) رضي الله عنه على ظهر كتاب فيه جوابات ومسائل أنفذت من قم<\/p>\n<p style=\"text-align: justify;\">[I was told by a group, from abi al-Hasan Muhammad bin Ahmad bin Dawud al-Qummi, he said: I found in the handwriting of Ahmad bin Ibrahim al-Nawbakhti, as was <strong>written by<\/strong> <strong>abu al-Qasim al-Husayn bin Rawh<\/strong> (third emissary) on the back of a book containing answers and questions from the city of Qum.]<\/p>\n<p style=\"text-align: justify;\">وأخبرني جماعة ، عن أبي العباس بن نوح قال : وجدت بخط محمد بن نفيس فيما كتبه بالأهواز أول كتاب ورد من أبي القاسم رضي الله عنه<\/p>\n<p style=\"text-align: justify;\">[I was told by a group, from abu al-`Abbas bin Nuh, he said: I found the first book that came from abu al-Qasim (third emissary) which was <strong>in the handwriting of Muhammad bin Nafis<\/strong> who wrote it in al-Ahwaz]<\/p>\n<p style=\"text-align: justify;\">وقال ابن نوح : أول من حدثنا بهذا التوقيع أبو الحسين محمد بن علي بن تمام ، ( و ) ذكر أنه كتبه من ظهر الدرج الذي عند أبي الحسن بن داود ، فلما قدم أبو الحسن بن داود وقرأته عليه ، ذكر أن هذا الدرج بعينه كتب به أهل قم إلى الشيخ أبي القاسم وفيه مسائل ، فأجابهم على ظهره بخط أحمد بن إبراهيم النوبختي وحصل الدرج عند أبي الحسن بن داود . نسخة الدرج مسائل محمد بن عبد الله بن جعفر الحميري : &#8221; بسم الله الرحمن الرحيم أطال الله بقاءك ، وأدام عزك<\/p>\n<p style=\"text-align: justify;\">الدرج بمعنى الكتاب تُدرج فيها الكتابة على رقٍ أو صحيفةٍ بطريقةٍ متعارفة &#8211; أي نسخة الکتاب المدرج المطوي، کتبه أهل قم و سألوا عن بيان صحته<\/p>\n<p style=\"text-align: justify;\">[And Ibn Nuh said: the first who told us about the rescript was abu al-Husayn (&#8230;until he said&#8230;) he mentioned that this specific book was from the people of Qum who addressed it to abu al-Qasim (third emissary) and it contained questions so he (third emissary) wrote them back the answers on the back of that book <strong>with the handwriting of Ahmad bin Ibrahim al-Nawbakhti<\/strong> (&#8230;etc)]<\/p>\n<p style=\"text-align: justify;\">وأخبرني أبو محمد المحمدي رضي الله عنه ، عن أبي الحسين محمد بن الفضل بن تمام رحمه الله قال : سمعت أبا جعفر بن محمد بن أحمد ( بن ) الزكوزكي رحمه الله &#8211; وقد ذكرنا كتاب التكليف ، وكان عندنا أنه لا يكون إلا مع غال ، وذلك أنه أول ما كتبنا الحديث &#8211; فسمعناه يقول : وأيش كان لابن أبي العزاقر في كتاب التكليف إنما كان يصلح الباب ويدخله إلى الشيخ أبي القاسم الحسين بن روح رضي الله عنه ، فيعرضه عليه ويحككه فإذا صح الباب خرج فنقله وأمرنا بنسخه ، يعني أن الذي أمرهم به الحسين بن روح رضي الله عنه<\/p>\n<p style=\"text-align: justify;\">[I was told by abu Muhammad al-Muhammadi (ra), from abi al-Husayn Muhammad bin al-Fadl bin Tammam (ra), he said: I heard aba Ja`far bin Muhammad bin Ahmad al-Zakzuki (ra) say when the book &#8220;al-Taklif&#8221; was mentioned to him -We believed this book can only be found with extremists- when we first began to write narrations, we heard him say: &#8220;What did Ibn al-`Azaqir al-Shalmaghani do concerning his book &#8220;al-Taklif&#8221;? He used to only edit the chapters and present them to abi al-Qasim al-Husayn bin Rawh (third emissary) who reviewed it. Then <strong>he would copy it and order us to write it down<\/strong> if he deemed it correct.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Source: Ghaybat-ul-Tusi pg.372, 373, 374, 389<\/p>\n<p style=\"text-align: justify;\">In conclusion, the third emissary Ibn Rawh realized that the noble infallible handwriting perished the moment the second emissary Muhammad bin `Uthman died, so he began writing himself and ordering his followers to write whatever verbal orders he claimed to recieve.<\/p>\n<p style=\"text-align: justify;\">Finally, `Ali bin Muhammad al-Samari (died 329 AH) was the fourth and last emissary. He barely ruled three years before he died without an heir and accomplished absolutely nothing. This was most likely due to the emergence of  the Buwayhid Shia dynasty. <strong>The station of emissaries ended around the same time the Buwayhid Shia reached power<\/strong> and established their own state. The Buwayhids were now the representatives of the Shia community and their protectors. They will not share their authority with any Imam or representative since only one party can be in control. The heads of the Shia rejoiced when the Buwayhids ascended to authority and decided that the so called 12th Imam must disappear from our lives to please their new masters and thus began the &#8220;greater occultation&#8221;.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>No doubt, the four emissaries (Sufara&#8217;) of the Twelver Shia&#8217;s 12th Imam or &#8220;Mahdi&#8221; as they call him are some of the most suspicious characters in classical Islamic history. Below, we will translate a piece of the research one of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/01\/01\/infallible-handwriting-mahdi\/\" title=\"The infallible handwriting of their &#8220;Mahdi&#8221;\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"class_list":{"0":"post-4240","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4240","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4240"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4240\/revisions"}],"predecessor-version":[{"id":4245,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4240\/revisions\/4245"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4240"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4240"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4240"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}