{"id":4280,"date":"2018-01-24T13:17:52","date_gmt":"2018-01-24T13:17:52","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4280"},"modified":"2018-01-24T13:17:52","modified_gmt":"2018-01-24T13:17:52","slug":"refutation-abu-bakr-really-lead-salat","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/01\/24\/refutation-abu-bakr-really-lead-salat\/","title":{"rendered":"Refutation of: Did Abu Bakr Really Lead the Salat?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4280\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><em>Bismillah Al-Rahman Al-Raheem,<\/em><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">The following is a refutation to the main arguments produced by Olawuyi in his book “Did Abu Bakr really Lead the Salat?” The author’s main aim is to prove that all the narrations that suggest such are fabricated, that Abu Bakr was unqualified, and that even if he did lead it, it wouldn’t be a major merit.<\/p>\n<p style=\"text-align: justify;\">In this article, we have decided to specifically refute his main argument, which is that all the narrations that state that Abu Bakr was appointed to lead the prayer during the Prophet’s – peace be upon him – final illness are fabricated. The author’s main proof for this is that these narrations include contradictions in the details.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Are Contradictions between Narrations Proof that they are all fabricated?<\/strong><\/h2>\n<p style=\"text-align: justify;\">The simple answer is no.<\/p>\n<p style=\"text-align: justify;\">Shia scholar Ayatollah Mohammad Taqi Al-Tusturi states in his Risala fi Sahw Al-Nabi (p. 9), in response to one that made such claims, “This is an astounding claim for him to make, for the weakness of the report is proven by contradictions in the report itself, not from other reports.”<\/p>\n<p style=\"text-align: justify;\">Al-Tusturi is correct. Contradicting reports are often due to the memories of narrators. In some cases, a contradiction between two reports may prove that one out of the two is a fabrication. However, to say that both reports are to be rejected and both are fabrications is not an academic approach.<\/p>\n<p style=\"text-align: justify;\">Al-Tusturi goes on, “If it is such as he claims, then Al-Salat Al-Wusta (2:238) should be attacked since the Ummah (nation) has disagreed on it, even though it is in the book (of Allah). Furthermore, there is not a single foundation (in religion) that does not include disagreement in its branches.”<\/p>\n<p style=\"text-align: justify;\">Take for example the following scenario:<\/p>\n<p style=\"text-align: justify;\">A robbery occurs in a nearby bank. A married couple witnesses the event from the street. The husband reports hearing two shots of gunfire as three men in black run out of the bank and get into their vehicle before escaping. The wife reports that she heard one shot and four men in navy blue ran out of the bank.<\/p>\n<p style=\"text-align: justify;\">Does the judge take both their accounts into consideration, while weighing them out, or does he toss out the case and accuse them both of fabricating their own respective accounts?<\/p>\n<p style=\"text-align: justify;\">It is needless to say that hadith traditions works in a way that is similar to the real world, for inconsistencies between reports does not mean that they are manufactured.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>The Appointment of Abu Bakr in Prayer is Mutawatir<\/strong><\/h2>\n<p style=\"text-align: justify;\">Before dealing with the alleged contradictions, our first goal is to establish that the appointment of Abi Bakr in prayer is <em>mutawatir<\/em>.<\/p>\n<p style=\"text-align: justify;\">The appointment can be found in Saheeh Al-Bukhari through the hadith of A’isha and A’isha (664), Abu Musa Al-Ash’ari (678), and Abdullah bin Omar (682). It was also narrated in Saheeh Muslim through the hadith of Anas (419), and Ibn Abbas (418). This excludes other sources outside the Saheehain.<\/p>\n<p style=\"text-align: justify;\">It is also important to keep in mind that there are no narrations that contradict the actual appointment of Abi Bakr as an Imam for prayer, but rather, the contradictions revolve around the final prayer of the Prophet &#8211; peace be upon him &#8211; , in regards to which day did it occur, whether he led it or was led by Abi Bakr, and whether he prayed in those days or not.<\/p>\n<p style=\"text-align: justify;\">Of course, none of those details take anything away from what is agreed upon, which is that he appointed Abu Bakr as the Imam while he was sick.<\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: justify;\"><strong>The Final Prayer of the Prophet – peace be upon him &#8211; <\/strong><\/h2>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Below is a summary of the major details of the prayer:<\/p>\n<p style=\"text-align: justify;\">\n<ul style=\"text-align: justify;\">\n<li>Narrations of Anas<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The narration of Abdul Aziz bin Suhaib from Anas &gt; The Prophet – peace be upon him – didn’t pray in public for the last three days. (Saheeh Muslim)<\/p>\n<p style=\"text-align: justify;\">The narration of Al-Zuhri from Anas &gt; The Prophet – peace be upon him &#8211; didn’t pray, while Abu Bakr led while he was sick. (Muslim)<\/p>\n<p style=\"text-align: justify;\">The narration of Humaid from Anas &gt; The Prophet – peace be upon him – prayed behind Abi Bakr. (Musnad Ahmad) This narration is weak, for Musnad Ahmad also included another narration that states that Humaid got this report from Thabit Al-Bunani, who said that he was told of this report, and he did not mention Anas. Al-Daraqutni in Al-Ilal also argues that Thabit did not get this narration from Anas.<\/p>\n<p style=\"text-align: justify;\">\n<ul style=\"text-align: justify;\">\n<li>Narrations of A’isha<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The narration of Ubaidullah from A’isha &gt; The Prophet – peace be upon him – had Abu Bakr lead the prayers, except for one prayer where he led, and it was during Thuhur. (Bukhari and Muslim – This narration is corroborated by Ibn Abbas.)<\/p>\n<p style=\"text-align: justify;\">The narration of Al-Aswad from A’isha &gt; The Prophet – peace be upon him – appointed Abu Bakr to lead the prayer, however, he led himself during one prayer. (Muslim)<\/p>\n<p style=\"text-align: justify;\">The narration of ‘Asim from Abi Wa’il from Masrooq from A’isha &gt; The Prophet – peace be upon him – led one prayer, and Abu Bakr prayed behind him. (Saheeh Ibn Hibban)<\/p>\n<p style=\"text-align: justify;\">The narration of Nu’aym from Abi Wa’il from Masrooq from A’isha &gt; The Prophet – peace be upon him – prayed behind Abi Bakr. (Saheeh Ibn Hibban)<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">From the above, we can come to the conclusion that there are no authentic narrations that state that the Prophet – peace be upon him – prayed behind Abi Bakr, except for the narration of Nu’aym, however, Asim narrates the same hadith and says the opposite. This is the correct opinion since it is supported by the narrations of Ubaidullah and Al-Aswad from A’isha.<\/p>\n<p style=\"text-align: justify;\">With this in mind, we come to the conclusion that the correct narrations of A’isha and Ibn Abbas affirm that Abu Bakr prayed one prayer behind the Prophet – peace be upon him – during the duration that he was sick.<\/p>\n<p style=\"text-align: justify;\">We also find that one authentic narrations of Anas states that the Prophet – peace be upon him – didn’t pray any of the three days that he was sick. However, this was rejected by Al-Bayhaqi in Dala’il Al-Nubuwwa 7\/195, who affirms that the prayer occurred on either a Saturday or a Sunday. This is rational conclusion, since the narration of A’isha mentions that this was during Thuhur, and Friday’s prayer is not referred to as the Thuhur prayer. The Prophet – peace be upon him – became sick on Thursday night and passed away before the Thuhur on Monday.<\/p>\n<p style=\"text-align: justify;\">This can be reconciled if we held the view that Anas was not present during Thuhur prayer on that day. A likelier possibility is that Abdulaziz bin Suhaib made a mistake since it contradicts all the other reports. Furthermore, the narration of Al-Zuhri from Anas makes no mention that the Prophet – peace be upon him – was absent during all three days.<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>Responses to Alleged Contradictions<\/strong><\/h2>\n<p style=\"text-align: justify;\">Before providing our responses to these alleged contradictions, it is important to be aware that much of these allegations are not actually contradictions, but rather, some narrations include more details than others, which the author has labeled as contradictions in order to tarnish the whole event.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #1<\/strong>: The author said (p. 8), “One glaring omission from Anas’ reports is that of any explicit order from the Prophet concerning Abū Bakr’s leadership of ṣalāt. As such, we do not know – from Anas’ narrations – whether he led the Ṣaḥābah in ṣalāt from Thursday till Monday on the order of the Messenger of Allāh or not.”<\/p>\n<p style=\"text-align: justify;\">He goes on to add that the best that can be said is that there was a silent approval and no objection.<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong>: The author quoted Anas on (p. 5) that: “The Prophet of Allāh, peace be upon him, gestured to Abū Bakr with his hand to lead.”<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #2<\/strong>: The author argues that Anas said that the Prophet – peace be upon him – in a report said that he didn’t pray in his last four days. (p. 5)<\/p>\n<p style=\"text-align: justify;\"><strong>Response:<\/strong> Refer to the previous section above about his last prayer – peace be upon him &#8211; .<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradictions #3<\/strong>: The author lists a group of contradictions between Exhibit C and D (p. 13-14). However, the majority of these are not contradictions.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Response:<\/strong> Contradictions by definition are statements that oppose one another. The author, instead, provides examples of details that are found in one narration and not in the other and portrays them as contradictions. Take for example, one tradition states that the Prophet – peace be upon him – fainted, while the second doesn’t. This doesn’t mean that the narrators of the second report deny that he fainted, but rather, that the first narration shared more details.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #4:<\/strong> The author argues that Exhibit D shows that the Prophet – peace be upon him – did not let Abu Bakr pray and that he interrupted him as soon as he prayed.<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong>: Ibn Hajar comments on the report that says, “The narration appears to be referring to that very prayer, and it may be that this occurred later on, and that this information was dropped… and this is made clear by the narration of Musa bin Abi A’isha that is mentioned that Abu Bakr prayed those days.” In other words, the statement can be interpreted to reconcile this apparent contradiction.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #5:<\/strong> The author said, “According to Exhibit C, the Messenger – on his order &#8211; was taken by two men to the side of Abū Bakr. But, in Exhibit D, the Prophet went to the left side of Abū Bakr by himself, with no support.“ (p. 14)<\/p>\n<p style=\"text-align: justify;\"><strong>Response:<\/strong> Exhibit D is clear that the feet of the Prophet – peace be upon him – are dragging across the ground and that he was not able to walk. The author’s biased understanding of the narration led him to the conclusion that the Prophet – peace be upon him – came to Abu Bakr on his own without support.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #6<\/strong>: The author provides the hadith of Abdullah bin Zam’a as Exhibit E and the narration of A’isha as Exhibit F and attempts to show contradictions between the two.<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong>:  The narration of Ibn Zam’a was graded as weak by Sh. Shoaib Al-Arna’ut in his grading of the same hadith in Musnad Ahmad #18906. The narration is problematic due to it being narrated by Ibn Ishaaq who is a well-known <em>mudallis<\/em>. Sh. Shoaib argues that even though the hadith in Sunan Abi Dawud includes Ibn Ishaaq claiming that he heard the narration, the majority of the narrations from Ibn Ishaaq from reliable narrators are without this claim. Moreover, even if we were to accept that Ibn Ishaaq did hear the hadith, the narration would still only be of the <em>hasan<\/em> degree, for Ibn Ishaaq is not considered to be a “trustworthy”, but rather, an “acceptable” narrator.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #7<\/strong>: The author, in order to provide weight to contradictions, quotes the following: “Al-Zuhrī (narrating from ‘Ubayd Allāh from ‘Āishah<u>)<\/u> reported: The Prophet, peace be upon him, said while he was (still) in the house of Maymūnah to ‘Abd Allāh b. Zam’a, “Tell THE PEOPLE to perform the ṣalāt .” So, he met ‘Umar b. al-Khaṭṭāb and said, “O ‘Umar! Lead the people in ṣalāt.” Therefore, he led them in ṣalāt. Then, the Messenger of Allāh, peace be upon him, heard his voice and recognized him, as he was someone with a loud voice. The Messenger of Allāh, peace be upon him, said, “Is that not the voice of ‘Umar?” They said, “Yes, it is.” He said, “Allāh the Almighty and the believers forbid that. Tell Abū Bakr to lead the people in ṣalāt.”<\/p>\n<p style=\"text-align: justify;\"><strong>Response<\/strong>: The author is mistaken for including the name of Ubaidullah and A’isha between parentheses. The report is a disconnected report by Al-Zuhri. The author attempted to fill in the blanks by providing the previous chain. This was due to his ignorance in hadith sciences.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Contradiction #8: <\/strong>The author attempted to prove from pages 23-29 that there is a contradiction as to whether the Prophet – peace be upon him – or Abu Bakr led in his last prayer.<\/p>\n<p style=\"text-align: justify;\"><strong>Response: <\/strong>Refer to the previous section above.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Closing Comments<\/strong><\/h2>\n<p style=\"text-align: justify;\">The author spent the rest of the book suggesting that Abu Bakr was not qualified to lead the prayer and that he was in the <a href=\"http:\/\/www.twelvershia.net\/2013\/11\/03\/response-to-the-oppression-of-sayeda-faatima-s-a-part-iii\/\">army of Usama<\/a> and was not supposed to be in Madinah, while also downplaying the importance of the spiritual role of leading the prayer.<\/p>\n<p style=\"text-align: justify;\">All of these points are simply refuting by the mere fact that the report that Abu Bakr was appointed to lead the prayer and that this is <em>mutawatir<\/em>, as proven in one of the earlier sections, so there is no need for a lengthy rebuttal.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">May Allah &#8211; subhanahu wa ta’ala – have mercy on Abu Bakr Al-Sadeeq and may He turn his grave into a small piece of paradise.<\/p>\n<p style=\"text-align: justify;\">…<em>wal hamdu lillahi rabi al-aalameen.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Bismillah Al-Rahman Al-Raheem, The following is a refutation to the main arguments produced by Olawuyi in his book “Did Abu Bakr really Lead the Salat?” The author’s main aim is to prove that all the narrations that suggest such are <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/01\/24\/refutation-abu-bakr-really-lead-salat\/\" title=\"Refutation of: Did Abu Bakr Really Lead the Salat?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6],"tags":[],"class_list":{"0":"post-4280","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4280","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4280"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4280\/revisions"}],"predecessor-version":[{"id":4282,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4280\/revisions\/4282"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4280"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4280"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4280"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}