{"id":4287,"date":"2018-02-06T22:04:39","date_gmt":"2018-02-06T22:04:39","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4287"},"modified":"2018-02-07T05:42:06","modified_gmt":"2018-02-07T05:42:06","slug":"mirza-al-nuri-tahreef","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/02\/06\/mirza-al-nuri-tahreef\/","title":{"rendered":"Mirza al-Nuri and Tahreef"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4287\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">In this article we shall look into the belief of the Shia leader and author of one of the fundamental eight Shia books Mirza Husayn al-Nuri al-Tabrasi (author of Mustadrak-ul-Wasa&#8217;il) who died in 1320 AH.<\/p>\n<p style=\"text-align: justify;\">Shia often deny the fact that this scholar of Hadith believes in the corruption of the Qur&#8217;an, some even say &#8220;He actually wrote a book to refute Tahreef&#8221; While others say &#8220;He later repented and changed his view after he was refuted.&#8221; In this article we will try to be precise and go straight to the point by proving without the shadow of a doubt that he believed in corruption and insisted on it without any repentance.<\/p>\n<p style=\"text-align: justify;\">Since this man&#8217;s stance is common and known even to laypeople, we will mainly base this piece on the research already put together by the team at the old &#8220;sunnidefense.com&#8221; (which has been down for a long time).<\/p>\n<p style=\"text-align: justify;\"><strong>A- The title of  his famous book.<\/strong><\/p>\n<p style=\"text-align: justify;\">The book in question is of course his famous work called &#8220;Fasl-ul-Khitab fi Ithbat Tahrif Kitabi Rabb-il-Arbab&#8221; or in English &#8220;The Decisive Speech in Proving the Distortion of the Book of the Lord of lords.&#8221; This title is quite apparent and clearly shows the intention behind the book.<\/p>\n<p style=\"text-align: justify;\"><strong>B- His belief concerning the Qur&#8217;an&#8217;s preservation from his own writings.<\/strong><\/p>\n<p style=\"text-align: justify;\">Shia often do a good job of hiding some of their beliefs, you will find them quoting statements by al-Nuri al-Tabrasi such as this one:<\/p>\n<p style=\"text-align: justify;\">[In this book (i.e Fasl al-Khitab) I prove that what is available and collected between the two covers has remained identical to when it was first compiled during the era of `Uthman; And that it never underwent any change or alteration like previous heavenly books.]<\/p>\n<p style=\"text-align: justify;\">Source: Al-Thari`ah ila Tasanif al-Shi`ah 16\/232<\/p>\n<p style=\"text-align: justify;\">A layperson may read this and assume that the man believes the Qur&#8217;an is intact and preserved. However, the expert will notice that the author simply stated that no further change took place after `Uthman collected the Book. This means that change may have taken place before `Uthman compiled it OR that `Uthman didn&#8217;t even compile it correctly to begin with. This will be made clear by his following statements below.<\/p>\n<p style=\"text-align: justify;\">He declares the reason for authoring his book in its introduction by saying:<\/p>\n<p style=\"text-align: justify;\">هذا كتاب لطيف وسفر شريف عملته في إثبات تحريف القرآن وفضائح أهل الجور والعدوان<\/p>\n<p style=\"text-align: justify;\">[This is a subtle book, a noble compilation, that I have written to prove the distortion of the Qur&#8217;an and the disgraces of the people of tyranny and oppression. I have called it &#8220;The decisive speech in proving the distortion of the Book of the Lord of lords.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Source: Fasl-ul-Khitab pg.2<\/p>\n<p style=\"text-align: justify;\">In another book he declares that `Ali was the first man to compile the Qur&#8217;an then comments by saying:<\/p>\n<p style=\"text-align: justify;\">[What&#8217;s apparent is that the compilation of the chief of believers (as) is what is protected and preserved by the infallible household. It is saved until the newer truth (i.e 12th Imam) emerges with a knowledge that does not expire. Unlike the one (i.e today&#8217;s Qur&#8217;an) that is found in people&#8217;s hands; Although it was compiled by (`Uthman) Ibn `Affan as the reports say yet there&#8217;s confusion and shakiness in the way that it (i.e `Uthmani codex) was compiled.]<\/p>\n<p style=\"text-align: justify;\">Source: Nafs-ul-Rahman fi Fada&#8217;il Salman pg.233-234<\/p>\n<p style=\"text-align: justify;\">From the above, it is clear that he believes the Qur&#8217;an is distorted literally, the crime was done by &#8220;oppressors and tyrants&#8221; meaning the Companions (ra) who compiled Allah&#8217;s Book. He believes `Ali&#8217;s Qur&#8217;an is protected from any change, yet it is preserved with the household until the 12th Imam emerges with the truth.<\/p>\n<p style=\"text-align: justify;\"><strong>C- His rank and status among the Shia.<\/strong><\/p>\n<p style=\"text-align: justify;\">Shia scholar `Abbas al-Qummi praises him by saying:<\/p>\n<p style=\"text-align: justify;\">[The chief of Islam and the Muslims, the promoter of the knowledge of Prophets and Messengers (as), the trustworthy, the venerable, the perfected, righteous, profound and well-informed scholar, the critical and insightful expert in the field of narrations; disseminator of traditions, compiler of composite reports, author of many famous works, a man of overabundant knowledge; the brilliant authority in both narrating and deriving knowledge and the conveyor of the five excellent traits [i.e. patience, faith, obedience, nobility and generosity]; greatest of the symbolic figures. He is more famous than one can mention and above what can be described about him by expression.]<\/p>\n<p style=\"text-align: justify;\">Source: Al-Kuna wal-Alqab 2\/445<\/p>\n<p style=\"text-align: justify;\">Shia scholar Muhammad `Ali al-Mudarris al-Tabrizi says:<\/p>\n<p style=\"text-align: justify;\">[Al-Haj Mirza Husayn bin Muhammad Taqi bin Mirza Muhammad `Ali al-Nuri al-Tabrasi: He was among the most trustworthy eminent individuals and greatest scholars of the Imami Twelver Shia in the early fourteenth Islamic century; a jurisprudent, scholar of narrations, mentor, commentator, expert in the field of narrator-criticism, devoted worshipper, ascetic, scrupulous and godwary individual; known for his sacred status, scrupulosity, godwariness, worship, and spiritual perfections. He has no match in the science of narrations, commentary (of the Qur&#8217;an) and knowledge of the conditions and layers of scholars of narrations and narrators, and the conditions of the scholars of Islam.]<\/p>\n<p style=\"text-align: justify;\">Source: Al-Najm-ul-Thaqib (Introduction of researcher Sayyid Yasin al-Musawi) 1\/85<\/p>\n<p style=\"text-align: justify;\">From the above we conclude that he is of very high status among his peers and an author of the sect&#8217;s fundamental book.<\/p>\n<p style=\"text-align: justify;\"><strong>D- Shia scholars admitting al-Nuri believed in corruption.<\/strong><\/p>\n<p style=\"text-align: justify;\">We begin with his student al-`Allamah Aqa Buzurg al-Tihrani who describes his teacher&#8217;s book:<\/p>\n<p style=\"text-align: justify;\">[(912: Fasl-ul-Khitab fi Tahrif-il-Kitab) By our teacher al-Haj Mirza Husayn al-Nuri al-Tabrastani (&#8230;) He proved therein that there is no corruption in terms of: Addition, alteration, change or anything that afflicted heavenly books other than the Qur&#8217;an; not even by a unspecified single word. As for verses not containing rulings, he was of the opinion that deletion did take place by the hands of those who compiled. This happened in a way that we are ignorant of what exactly is missing although they are still preserved with the rightful ones (i.e Imams). Rather, one can generally learn from the detailed narrations he wrote in his book that only deletion is confirmed.]<\/p>\n<p style=\"text-align: justify;\">Source: Al-Thari`ah ila Tasanif al-Shi`ah 16\/231-232<\/p>\n<p style=\"text-align: justify;\">The student is telling us his teacher didn&#8217;t believe the Qur&#8217;an has any additional verses or that verses were changed such as what happened to the Bible and Torah. However, there are missing verses which we do not know but they do not contain religious rulings. The impression he is trying to give here is that the damage is minimal and what he hopes to achieve are two things: A- Give an excuse as to why Ahlul-Bayt are not mentioned in the Qur&#8217;an. B- Vilify the noble Companions (ra) who compiled God&#8217;s Holy Book.<\/p>\n<p style=\"text-align: justify;\">Shia polemicist `Ali Aal-Muhsin tries to excuse his leader by saying:<\/p>\n<p style=\"text-align: justify;\">[Al-Mirza Husayn al-Nuri —May Allah’s mercy be upon him—has many grateful efforts and well-known impacts in regard to the assistance of Islam. And contesting him, and his slip in this book (i.e. Fasl al-Khitab), will neither make us ignore all his efforts nor take away anything from his credibility, for every pious man has a slight fault; for every man of knowledge has a slip. This, is along with the fact that he did not say: &#8220;The Qur’an present in our hands is distorted in terms of addition and deletion,&#8221; rather what he said is: &#8220;Indeed, some words or verses of the Qur’an were omitted from the Qur’an present in our hands.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Source: Lillah Thumma li al-Haqiqah, pg.542<\/p>\n<p style=\"text-align: justify;\">Again, he belittles the man&#8217;s sin and describes it as a &#8220;slight fault&#8221;.<\/p>\n<p style=\"text-align: justify;\">Their scholar Muhammad al-Husayn al-Husayni al-Tihrani writes:<\/p>\n<p style=\"text-align: justify;\">[The traditionalist al-Nuri authored his book on the corruption of the Qur&#8217;an and intended to only prove distortion through deletion as opposed to change and addition (&#8230;) He -mercy be upon him- wished to affirm deletions in God&#8217;s revealed Book through six arguments.]<\/p>\n<p style=\"text-align: justify;\">Source: Ma`rifat-ul-Imam 14\/118-119<\/p>\n<p style=\"text-align: justify;\">Their scholar al-Hasan bin `Abdullah al-Tabari al-Amuli says:<\/p>\n<p style=\"text-align: justify;\">[Some folks turned those reports into evidence for the Qur&#8217;an&#8217;s distortion and they judged by their apparent texts that some content was missing. The traditionalist al-Nuri collected them in Fasl-ul-Khitab and considered them proof for the Book&#8217;s corruption and others followed suite.]<\/p>\n<p style=\"text-align: justify;\">Source: Minhaj-ul-Bara`ah 16\/287<\/p>\n<p style=\"text-align: justify;\">Their big scholar Fadil al-Lankarani criticizes by saying:<\/p>\n<p style=\"text-align: justify;\">[As we can see, the traditionalist al-Nuri in-spite of his great status and high rank mentions the verse of preservation in Fasl-ul-Khitab but in the following form &#8220;انا انزلنا الذكر وانا له لحافظون&#8221; To be fair, the fact that he did this —nay, the fact that he originally authored the aforementioned book has broken the back of the Shia.]<\/p>\n<p style=\"text-align: justify;\">Source: Tafsil al-Shari`ah Sharh al-Tahrir pg.295<\/p>\n<p style=\"text-align: justify;\">If you go to the Arabic text of the verse above [Al-Hijr:09] you will see it written differently in Arabic &#8220;إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ&#8221; which shows that he couldn&#8217;t even get a basic Qur&#8217;anic verse properly memorized. Ayatullah al-Lankarani complained of the burden al-Nuri placed on the backs of the Shia by openly authoring such a book yet Taqiyyah wasn&#8217;t practiced as much during the rule of the Safavids.<\/p>\n<p style=\"text-align: justify;\"><strong>E- Opponents of Islam utilizing al-Nuri&#8217;s book.<\/strong><\/p>\n<p style=\"text-align: justify;\">Al-Hujjah Muhammad Hirz-ul-Din writes:<\/p>\n<p style=\"text-align: justify;\">[And his book of &#8220;Fasl-ul-Khitab fi Tahrif Kitab Rabb al-Arbab&#8221; which I hoped he would&#8217;ve never wrote, because of this book, the tongues of the Jews and atheists grew longer.]<\/p>\n<p style=\"text-align: justify;\">Source: Ma`arif al-Rijal 1\/272<\/p>\n<p style=\"text-align: justify;\">Meaning Jews and atheists used it to verbally attack Islam&#8217;s Holy Book.<\/p>\n<p style=\"text-align: justify;\">Ayatullah Muhammad Mahdi al-Musawi al-Isfahani al-Kazimi writes:<\/p>\n<p style=\"text-align: justify;\">[I wish he had never authored it even though a certain scholar wrote a noble treatise to refute him and clarify the truth. Al-Nuri was thus reviled by the scholars of his time, I was also told by some trusted ones that the Christians translated this book in their languages and published it.]<\/p>\n<p style=\"text-align: justify;\">Source: Ahsan-ul-Wadi`ah 1\/72-73<\/p>\n<p style=\"text-align: justify;\"><strong>F- Did al-Nuri repent after being refuted?<\/strong><\/p>\n<p style=\"text-align: justify;\">A contemporary of al-Nuri, called Shaykh Mahmud bin abi al-Qasim al-Tihrani wrote a treatise to refute him called &#8220;Kashf-ul-Irtiyab `an Tahrif al-Kitab&#8221; or in English &#8220;Lifting the uneasiness concerning the distortion of the Book.&#8221;<\/p>\n<p style=\"text-align: justify;\">Shia scholars such as Ja`far al-Subhani in Mawsu`at-ul-Tabaqat 1\/77 and Al-Hasan bin `Abdullah al-Amuli in Minhaj-ul-Bara`ah 16\/266 claimed that al-Nuri changed his opinion after being greatly affected by this astounding refutation.<\/p>\n<p style=\"text-align: justify;\">This of course is a lie, al-Nuri stuck to his opinion and used lame excuses as was transmitted by his student Aqa Buzurg after he received that criticism:<\/p>\n<p style=\"text-align: justify;\">[I should have called it &#8220;The decisive speech in proving the Non-distortion of the Book&#8221;, calling it by that other name which is used by people was a mistake and it goes against my intention. I only intended to say that some of the Godly revelation was omitted; if you wish, call it &#8220;The decisive statement about the omission of some of the revelation.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Source: Al-Thari`ah 16\/232<\/p>\n<p style=\"text-align: justify;\">[What is intended by the term &#8220;distortion&#8221; is not what is apparent from this term; distortion means changes, additions and deletions such as what we find in the books of the Jews and others. What I intended by the term &#8220;distortion&#8221; was specifically deletions which have certainly taken place in verses not pertaining to rulings.]<\/p>\n<p style=\"text-align: justify;\">Source: Al-Thari`ah 10\/221<\/p>\n<p style=\"text-align: justify;\">As you can see, the man plays dumb by saying that he doesn&#8217;t mean the Qur&#8217;an is distorted like other heavenly books but only that it&#8217;s missing some verses!<\/p>\n<p style=\"text-align: justify;\">The reality is, the above quotes are taken from a treatise written by al-Nuri al-Tabrasi to respond to his critics, as you can see he insists on his position and claims that it&#8217;s only a difference in semantics and terminology.<\/p>\n<p style=\"text-align: justify;\">His treatise was called &#8220;جواب ايرادات ميرزاي شيرازي بر فصل الخطاب&#8221; Wherein a Shaykh from Shiraz asks him to respond to criticisms against Fasl-ul-Khitab. This was obviously published sometime after his original book as mentioned by Aqa Buzurg.<\/p>\n<p style=\"text-align: justify;\">Even though this document is written in Persian and abandoned on the bookshelf of ancient libraries yet we know of some of its content because Aqa Buzurg quoted his teacher&#8217;s rebuttals against Shaykh Mahmud who authored Kashf-ul-Irtiyab.<\/p>\n<p style=\"text-align: justify;\">Aqa Buzurg mentions Mahmud&#8217;s first argument that Jews can claim our Book is as corrupt as theirs and deny our superiority:<\/p>\n<p style=\"text-align: justify;\">[Our teacher al-Nuri responded to him: This is a verbal fallacy, what I intended by the word &#8220;distortion&#8221; in my book is other than the literal meaning of that word. Distortion encompasses alteration, change, addition and subtraction, all of which have taken place in the Jewish books. On the other hand, what I intended by distortion, is specifically general deletions of verses that certainly do not contain rulings. As for additions, all Muslim groups have consensus that nothing was added to what is between the two covers, not even  a verse with the shortest eloquent words. Rather, there is an agreement between the people of Qiblah that not a word was added whose location we do not know. So how then can you compare the general deletions we talked about with the apparent meaning of the term? Is this anything other than a verbal fallacy?]<\/p>\n<p style=\"text-align: justify;\">Source: al-Thari`ah 10\/221<\/p>\n<p style=\"text-align: justify;\"><strong>G- Al-Nuri actually did not retract.<\/strong><\/p>\n<p style=\"text-align: justify;\">Shia scholar Muhammad Hadi Ma`rifat comments on what actually took place:<\/p>\n<p style=\"text-align: justify;\">[I&#8217;ve heard that Shaykh al-Nuri has retracted his opinion on distortion, claiming that he attempted to prove the non-distortion of the Book found in the hands of Muslims today ever since it was first compiled. Even though, there was change in the original Book revealed to the Messenger (saw) since the compilers lost parts of it (according to al-Nuri).<\/p>\n<p style=\"text-align: justify;\">These are his words in his treatise which he wrote as rebuttal to &#8220;Kashf-ul-Irtiyab&#8221; which was a refutation of &#8220;Fasl-ul-Khitab&#8221; (&#8230;) With this crooked methodology he tried to create a diversion for his opponents (&#8230;) This is a clear contradiction, with crooked words and exposed deception.]<\/p>\n<p style=\"text-align: justify;\">Source: Siyanat-ul-Qur&#8217;an pg.105<\/p>\n<p style=\"text-align: justify;\">In brief, the man did not retract or repent. If anything he tried to play around with wordings while holding on to his belief in Tahrif. This story does not end here, to learn more about how al-Nuri&#8217;s student Aqa Buzurg dealt with this calamity please click <a href=\"http:\/\/www.twelvershia.net\/aqa-buzurg-al-tihrani-tahreef\/\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In this article we shall look into the belief of the Shia leader and author of one of the fundamental eight Shia books Mirza Husayn al-Nuri al-Tabrasi (author of Mustadrak-ul-Wasa&#8217;il) who died in 1320 AH. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/02\/06\/mirza-al-nuri-tahreef\/\" title=\"Mirza al-Nuri and Tahreef\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[4],"tags":[],"class_list":{"0":"post-4287","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4287","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4287"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4287\/revisions"}],"predecessor-version":[{"id":4291,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4287\/revisions\/4291"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4287"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4287"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4287"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}