{"id":4335,"date":"2018-03-10T15:20:00","date_gmt":"2018-03-10T15:20:00","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4335"},"modified":"2018-03-10T15:20:00","modified_gmt":"2018-03-10T15:20:00","slug":"shiite-appeal-alleged-prophetic-interpretation-ayat-al-mawadda","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/03\/10\/shiite-appeal-alleged-prophetic-interpretation-ayat-al-mawadda\/","title":{"rendered":"Shi’ite Appeal to Alleged Prophetic Interpretation of Ayat Al-Mawadda"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4335\" alt=\"\" \/><\/p>\n<h2 style=\"text-align: justify;\"><strong>Introduction<\/strong><\/h2>\n<p style=\"text-align: justify;\">The report we shall study in this article is an alleged prophetic explanation of a verse in the Qur’an, that has been appealed to by some Shi’a. In this article, I will be applying the method of early hadith critics in analyzing both the chain and text of this report.<\/p>\n<p style=\"text-align: justify;\"> The study will be divided into three parts:<\/p>\n<ul style=\"text-align: justify;\">\n<li>A presentation of the report in question<\/li>\n<li>A study of its chain<\/li>\n<li>A study of its text<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: justify;\"><strong>Presentation of Report<\/strong><\/h2>\n<p style=\"text-align: justify;\">The report in question was recorded by Ahmed in” Fadha’il Al-Sahabah,” Ibn Abi Hatim in his Tafsir, Al-Wahidi in his “Al-Wasit,” and Al-Tabarani in his “Al-Mu’jam Al-Kabir,” all of whom transmit it via Husayn Al-Ashqar, from Qays, from Al-A’mash, from Sa’id bin Jubayr, from Ibn ‘Abbas, who said:<\/p>\n<p style=\"text-align: justify;\">When the verse “I ask of you no reward (payment), except <em>mawaddah<\/em> (love\/kindness) for kinship,” was revealed, the companions asked, “Who are these kin whom we are obligated to love?” The Prophet replied, “‘Ali, Fatimah, and their two sons.”<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>Chain Analysis<\/strong><\/h2>\n<p style=\"text-align: justify;\">As preceded, the report originates from Husayn Al-Ashqar, from Qays, from Al-A’mash, from Sa’id bin Jubayr, from Ibn ‘Abbas.<\/p>\n<p style=\"text-align: justify;\">To begin, Husyan Al-Ashqar isn’t considered reliable.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Abu Hatim Al-Razi says, “He isn’t strong in hadith.”<\/li>\n<li>Abu Zur’ah says, “He is an objectionable transmitter.”<\/li>\n<li>Al-Nassa’i says, “He isn’t strong.”<\/li>\n<li>Al-Daraqutni says, “He wasn’t strong.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">It appears as though some accused him of intentional hadith fabrication, but this doesn’t seem to be the case. In fact, Ahmed bin Hanbal said, “In my opinion, he didn’t used to fabricate hadith.” In conclusion, though he isn’t reliable, he didn’t forge hadith.  It should also be noted that Ibn Hajar counted Husayn as an extreme Shi’i.<\/p>\n<p style=\"text-align: justify;\">Qays, in the report, is Qays bin Rabi’ Al-Asadi. Even though he was an honest and trustworthy transmitter, he too isn’t reliable.<\/p>\n<ul style=\"text-align: justify;\">\n<li>Abu Zur’ah said, “Weak.”<\/li>\n<li>Abu Hatim, “His reports are written, but not relied upon.”<\/li>\n<li>Al-Nassa’i said, “He isn’t reliable.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Others, like Ibn ‘Adiyy have a better opinion of him, but the majority of hadith critics agree that Qays isn’t reliable, as preceded.<\/p>\n<p style=\"text-align: justify;\">Al-A’mash, of course, is a Hafiz, and all agree upon his reliability and accuracy. He is known as a prolific transmitter, transmitting a large number of reports, and was “lucky” enough to have many regular students transmitting from him.<\/p>\n<p style=\"text-align: justify;\">Sa’id bin Jubayr, the famous student of Ibn ‘Abbas is also reliable.<\/p>\n<p style=\"text-align: justify;\">The hadith critics apply a principle in certain scenarios that potentially indicate that a serious mistake occurred in transmission. In essence, not all reliable hadith transmitters are of the same level. Variation occurs in both, the quantity of transmission, as well as the number of students they have.<\/p>\n<p style=\"text-align: justify;\">Furthermore, it becomes problematic when an average transmitter exclusively narrates from a reliable transmitter who is known for their great quantity or sheer number of transmitted reports, especially when the latter would have a considerable number of students who regularly attend his sessions. That problem is compounded when the transmitter is considered unreliable. A Muhaddith would become skeptical of the situation and ask themselves, “Why didn’t the other students transmit the same report? Where are the reliable transmitters who habitually attended his sessions for years?”<\/p>\n<p style=\"text-align: justify;\">In our situation, Husayn bin Al-Ashqar, an unreliable transmitter, transmits from Qays bin Al-Rabi’, another unreliable transmitter, who then exclusively transmits from Al-A’mash, a report that isn’t found amongst any of the reliable or even <em>unreliable <\/em>students of Al-A’mash. There is no other way to explain this, other than a serious error has occurred in the transmission of this hadith.<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Textual Analysis<\/strong><\/h2>\n<p style=\"text-align: justify;\">The problems with this report don’t end with the issues found in the chain of transmission. Indeed, there are problems in the content that further indicate the occurrence of an error.<\/p>\n<p style=\"text-align: justify;\"><strong>Firstly<\/strong>, it is authentically established from Ibn ‘Abbas that he explained the verse in question, in a different manner. Had he really transmitted the alleged prophetic interpretation of the verse, how would he allow himself to give a contradictory interpretation?<\/p>\n<p style=\"text-align: justify;\">Tawus reported that Sa’id ibn Jubayr explained the verse to refer to the household of the Prophet. Ibn ‘Abbas corrected him saying, “You have been hasty. There is no branch of Quraysh, except that the Prophet had relatives from.” He went to interpret the verse as, “Except for you to keep the ties due to what is between us of kinship.”<\/p>\n<p style=\"text-align: justify;\">This is recorded by Al-Bukhari in his “Sahih,” Al-Tirmidhi in his “Jami’,” Ibn Hibban in his “Sahih,” Ibn Jarir in his tafsir, Al-Hakim his “Al-Mustadrak,” Al-Wahidi in his “Al-Wasit,” as well as others, all of whom transmit via Shu’bah bin Al-Hajjaj, from Abdul-Malik bin Maysarah, from Tawus, from Ibn ‘Abbas.<\/p>\n<p style=\"text-align: justify;\">There is another authentic and independent chain from Ibn ‘Abbas that came as a result of Al-Sha’bi’s question to him about the verse.<\/p>\n<p style=\"text-align: justify;\">It is recorded by Ibn Sa’d in his “Al-Tabaqat,” Ibn Jarir in his Tafsir, Al-Bayhaqi in his “Al-Dala’il,” all of whom transmit from Dawud bin Abi Hind, from Al-Sha’bi, from Ibn ‘Abbas.<\/p>\n<p style=\"text-align: justify;\">Both of these chains are obviously authentic.<\/p>\n<p style=\"text-align: justify;\">It is further transmitted via the famous tafsir chains from Ibn ‘Abbas that are mentioned by Ibn Jarir, and others in their Tafasir. And though the reliability of these famous tafsir chains are usually debated, the fact that we have the two independently authentic chains lends credence to their veracity.<\/p>\n<p style=\"text-align: justify;\"><strong>Secondly<\/strong>, it is authentically established from some of Ibn ‘Abbas’s own students that they gave interpretations of the verse, contradictory to the alleged prophetic interpretation.<\/p>\n<p style=\"text-align: justify;\">For example, ‘Ikrimah, as recorded by Ibn Sa’d in his “Al-Tabaqat,” interprets it in a similar way that Ibn ‘Abbas did. After explaining that there wasn’t a branch of Quraysh that the Prophet wasn’t related to, he explains the verse as meaning, “If you don’t protect me by virtue of what I was sent with, at least protect me by virtue of the kinship that exists between us.”<\/p>\n<p style=\"text-align: justify;\">It is further transmitted from Mujahid, another student of Ibn ‘Abbas, though the chain to him, may be problematic.<\/p>\n<p style=\"text-align: justify;\"><strong>Thirdly<\/strong>, the very occasion for Ibn ‘Abbas’ interpretation was to clear up the misconception that would later be propagated by the hadith in question.  This is indicated by Al-Sha’bi’s transmission from Ibn ‘Abbas which preceded. Al-Sha’bi wrote to Ibn ‘Abbas after a controversy on the meaning of the verse ensued. Furthermore, Sa’id bin Jubayr seems to have fallen for the misconception and Ibn ‘Abbas had to clear it up for him as well, telling him, “You have been hasty.” Since he is clearing up what he considered to be a misconception, he couldn’t have possible transmitted the very report which would lend credence to the very misconception he is refuting!<\/p>\n<p style=\"text-align: justify;\"><strong>Fourthly<\/strong>, the context of the verses in the Qur’an, as well as its historical context support Ibn ‘Abbas’ explanation. The context of the verse suggests an exchange between the Prophet and the Mushrikin, wherein he would plead with them, for their own sake, to keep the ties of kinship between them and him. It doesn’t seem likely that the Prophet would be telling the mushrikin to show love and kindness, specifically to the family of his daughter, which had yet to exist. Ibn Kathir comments, “It [the surah] is Makki, and at that time Fatimah had no children, as she did not marry ‘Ali until after the battle of badr, in the second year after hijrah.”<\/p>\n<p style=\"text-align: justify;\">\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">If we take in all the factors mentioned about both, the chain, and its text, it becomes clear that this hadith is baseless. The question that asks itself is, “What, then, is the origin of this hadith? Where did the error come from?” After all, the report has to have come from somewhere.<\/p>\n<p style=\"text-align: justify;\">If we don’t assume malicious intent in the forging of the hadith, I think it is safe to say that it probably started as an opinion of Sa’id bin Jubayr, and as it was passed down, it eventually was attributed to the Prophet, and since Sa’id was a well-known student of Ibn ‘Abbas, it was attributed to the Prophet through him.<\/p>\n<p style=\"text-align: justify;\">Someone may say, “Well, this sounds like a fancy theory, but what evidence supports it?”<\/p>\n<p style=\"text-align: justify;\">For one, we know that Sa’id bin Jubayr held the opinion that they verse was referring to the household of the Prophet. It is reported as such in the Sahih Al-Bukhari account that preceded, wherein Ibn ‘Abbas corrected him. It is also reported through another chain of transmission from him in Al-Tabari’s Tafsir. This shows that there is basis for Sa’id’s presence in the chain.<\/p>\n<p style=\"text-align: justify;\">Sa’id’s never stated that they household of the Prophet that he was referring to were only Fatimah, ‘Ali, and their two sons. How did, “household of the Prophet,” change to “Fatimah, ‘Ali, and their two sons?” I theorize that when Qays passed down the report (already incorrectly attributed to the Prophet) to Husayn Al-Ashqar, Husayn felt the liberty to paraphrase the hadith, as some transmitters do. Being the Shi’I that he was, he paraphrased, “household of the Prophet,” in a way that a Shi’i would understand it: Fatimah, ‘Ali, and her two sons. In essence, it was a rephrasing of the report, in an explanatory manner, as understood by the Shi’i transmitter.<\/p>\n<p>&nbsp;<\/p>\n<p>Written by Abdullah Moataz<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Introduction The report we shall study in this article is an alleged prophetic explanation of a verse in the Qur’an, that has been appealed to by some Shi’a. In this article, I will be applying the method of early hadith <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/03\/10\/shiite-appeal-alleged-prophetic-interpretation-ayat-al-mawadda\/\" title=\"Shi’ite Appeal to Alleged Prophetic Interpretation of Ayat Al-Mawadda\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,6],"tags":[],"class_list":{"0":"post-4335","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4335","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4335"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4335\/revisions"}],"predecessor-version":[{"id":4336,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4335\/revisions\/4336"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4335"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4335"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4335"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}