{"id":4357,"date":"2018-04-22T14:30:12","date_gmt":"2018-04-22T14:30:12","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4357"},"modified":"2018-04-22T14:30:12","modified_gmt":"2018-04-22T14:30:12","slug":"sunni-critics-vs-shia-critics","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/04\/22\/sunni-critics-vs-shia-critics\/","title":{"rendered":"Sunni Critics vs Shia Critics"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4357\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">When analyzing hadiths and historical reports, one cannot overlook the discipline of <em>‘ilmur-Rijaal.<\/em> This science is a compilation of the hadith critics’ conclusions regarding the reliability of the numerous hadith transmitters that took part in the transmission of hadith. In this context, a transmitter could be defined as reliable (<em>thiqah), <\/em>weak (<em>da’if)<\/em><em>, <\/em>or truthful (<em>saduq)…<\/em> Similarly, defects in the transmitters’ transmission are also noted, such as a lack of retention of reports, loss of memory, lack of honesty, <em>tadlis<\/em> etc.<\/p>\n<p style=\"text-align: justify;\">The implications of this science are grave since <em>‘ilmur-Rijaal<\/em> is one of the fields where Sunnis and Shi’as often disagree. Many key transmitters of Shi’i hadith literature are deemed weak and unreliable by Sunni critics, yet they are considered reliable according to Shi’i scholars of <em>Rijaal. <\/em>Thus, a keen observer may ask: Whose opinion is more authoritative, the Sunni or Shi’i critics?<\/p>\n<p style=\"text-align: justify;\">Before the answer to that question is provided, a brief background of Sunni\/Shi’i <em>‘ilmur-Rijaal <\/em>shall be presented.<\/p>\n<p style=\"text-align: justify;\">Sunni criticism of <em>rijaal <\/em>goes all the way back to the first century AH. As the renowned <em>tabi’i, <\/em>Ibn Sirin (d. 110 AH) <em>,<\/em> said :<\/p>\n<p style=\"text-align: justify;\">They [the muhaddiths] used to not ask about the isnad [when transmitting reports]; however, once the fitnah occurred, they would demand: “list your transmitters.”<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p>\n<p style=\"text-align: justify;\">Thus, it is apparent that Sunni hadith criticism goes back to the first century of Islam, where the muhaddiths deemed it necessary to ask for the <em>isnad <\/em>of a hadith for due scrutiny.<\/p>\n<p style=\"text-align: justify;\">Eventually, many other <em>tabi’in<\/em> took part in the process, and <em>rijaal <\/em>eventually developed into a whole discipline. By the 3<sup>rd<\/sup> century, separate books were authored in this field, where the biographies of hadith transmitters were compiled and scrutinized. Many authors and historians, such as: Ibn Sa’d (d. 230 AH), Yahya b. Ma’in (d. 233 AH), Ali b. al-Madini (d. 234 AH), Bukhari (d. 256 AH),  Al-Jawzajani (d. 259 AH) , al-Nasa’i (d. 303 AH), al-‘Uqaili (d. 322 AH), Ibn Hibban (d. 354 AH), Ibn ‘Adi (d.365 AH) etc., took part in this process.<\/p>\n<p style=\"text-align: justify;\">These books generally elaborate on the statuses of these transmitters, while often presenting other key biographical information that pertains to their role in transmitting hadith.<\/p>\n<p style=\"text-align: justify;\">Shi’i <em>rijaal<\/em>, however, primarily revolves around four books: <em>Rijaal al-Najashi <\/em>by Najashi (d. 450), <em>Rijaal al-Tusi <\/em>by Tusi (d. 460 AH), <em>Al-Fahrast <\/em>also by Tusi, and <em>Rijaal Al-Kashi<\/em>, originally by Al-Kashi (d. 350 AH) but exclusively preserved through Tusi.<\/p>\n<p style=\"text-align: justify;\">A thorough analysis of the Sunni-Shi’I <em>rijaali <\/em>literature will clearly show that the Sunni hadith critics are more authoritative and reliable than the Shi’i critics for several reasons:<\/p>\n<h2 style=\"text-align: justify;\"><strong>Chronological Context <\/strong><\/h2>\n<p style=\"text-align: justify;\">A simple skim of the death dates of Sunni\/Shi’i critics will show the first disparity among both schools: <u>the time gap<\/u>. Sunni criticism of <em>rijaal <\/em>took place much earlier than Shi’i <em>rijaal<\/em>. In fact, authors like Ibn Sa’d (d. 230 AH), Yahya b. Ma’in (d. 233 AH), Ali b. al-Madini (d. 234 AH), Bukhari (d. 256 AH) preceded the Shi’i authors, Tusi (d. 460 AH) and Najashi (d. 450 AH), by over two centuries!<\/p>\n<p style=\"text-align: justify;\"><u>This means Sunni critics had a chance to actually meet many of the (Sunni and Shi’i) transmitters of hadith, while the Shi’i critics did not have the chance to meet any of the transmitters that lived prior to the 4<sup>th<\/sup>century.<\/u> Thus, Sunni hadith critics were able to make judgements based on empirical evidence and personal experience with many of these transmitters, while Shi’i scholars, on the other hand, exclusively relied on later reports when scrutinizing these transmitters.<\/p>\n<p style=\"text-align: justify;\">In fact, Shi’i scholar of hadith, Asef Mohseni, acknowledged this dilemma, and in his book <em>Buhuth fi ‘Ilm al-Rijaal, <\/em>where he says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Regarding the claim that a consensus (<em>ijmaa’) <\/em>exists among later scholars that Tusi, Kashi and Najashi’s approvals of a transmitter are reliable, that is simply not true. Their consensus (<em>ijmaa’<\/em>) is not a devotional consensus that entails the opinion of an infallible imam.<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">He later says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The problem is that their [Najashi and Tusi’s] approvals and condemnations of a transmitter, along with anything else they mention about the transmitters, come with a gap in time. However, they do not list the transmitters between them [up till that period] for us to analyze whether they were reliable, weak or unknown transmitters.Accepting such time-lapsed approvals of transmitters is not justified unless we were to give them the benefit of the doubt and assume that they [Najashi and Tusi] only transmitted from reliable transmitters without listing them. In that case, how can we accept their statements? Why don’t we ask about whom they transmitted [these approvals] from?<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">When talking about this dilemma, he says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">If anyone were to find me a solution to this dilemma, I would offer him a sum of money and I would be very thankful, for this dilemma makes <em>ilmur-Rijaal <\/em>an unreliable discipline from a logical and religious standpoint.<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">As clearly stated by Mohseni, this dilemma challenges the fundamental core of the Shi’i <em>ilmur-Rijaal <\/em>discipline. If no evidence is provided to show that Tusi and Najashi had relied on authentic chains that go all the way back to the transmitters in the 1<sup>st<\/sup>, 2<sup>nd<\/sup>, 3<sup>rd<\/sup> and 4<sup>th<\/sup> centuries when issuing their verdicts, then most (if not all) of their opinions on transmitters from these periods are quite arbitrary. When going through Tusi and Najashi’s works, one recognizes that their books are merely a compilation of their opinions on certain transmitters, along with bits of biographical data, without any evidence provided.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Methodologies<\/strong><\/h2>\n<p style=\"text-align: justify;\">Another major disparity between Sunni and Shi’i <em>rijaal <\/em>is the disparity in methodology. In a special category of books, known as <em>su’alaat<\/em>, many of the Sunni hadith critics lay out their principles and methodologies showing how (and why) they would approve of or condemn certain transmitters. This is also exemplified in the books of <em>‘ilal<\/em>, where Sunni hadith critics implemented and practiced hadith textual criticism with actual examples from hadith.<\/p>\n<p style=\"text-align: justify;\">In books such as Ibn ‘Adiyy’s <em>al-Kamil fi Du’afaa’ al-Rijal <\/em>and Al-‘Uqaili’s <em>al-Do’afaa al-Kabir<\/em>, the authors actually make it a point to show the errors made by transmitters in hadith; thus, providing actual evidence to show why transmitters were deemed unreliable.<\/p>\n<p style=\"text-align: justify;\">However, little (if any) is known about the methodology behind Najashi and Tusi’s approach to <em>rijaal. <\/em><u>Rather, the researcher finds himself stuck with Tusi and Najashi’s mere opinions without any understanding of their methodologies<\/u>. These two authors have not published works where they explain their methodologies behind their analysis of transmitters, nor do they give reasons\/examples to justify their conclusions. Thus, we cannot deem their conclusions reliable. In fact, we do not even know if they espoused a methodology in the first place due to the obscure nature of their works.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Corroborations<\/strong><\/h2>\n<p style=\"text-align: justify;\">Another major disparity between Sunni and Shi’i scrutiny of transmitters is the lack of corroborations among the latter. <u>When analyzing a transmitter according to Sunni critics, one will often find tens of corroborations from other critics enforcing the same opinion. <\/u><\/p>\n<p style=\"text-align: justify;\"><u>However, readers of Shi’i texts are mostly limited to Tusi and Najashi’s opinions, with very little corroborations from contemporary\/earlier sources.<\/u><\/p>\n<p style=\"text-align: justify;\">A great example is the famous pillar of Shi’i hadith transmission, Abu Hamza al-Thumaali (d. 148 AH). When analyzing this transmitter in early Shi’i <em>rijaali <\/em>sources, one only finds that Tusi<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a>, Najashi<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a>, and Ibn Babawayh<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a> and Hamdawayh b. Nasir<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a>declared him to be a <em>thiqah <\/em>(reliable). As usual, little context is provided to justify these claims.<\/p>\n<p style=\"text-align: justify;\">However, when analyzing Sunni sources’ take on this transmitter, we find over 18 different Sunni hadith critics condemning him (or his transmission), and all were much closer in time to Abu Hamzah than the Shi’i critics.<\/p>\n<p style=\"text-align: justify;\">Al-Jawzajani, Ibn Adiyy, Al-Dulaabi, Al-Uqaili, Abu Hatem Al-Razi, Ibn Hibban, Abu Zur’ah, al-Tirmidhi, Ahmed b. Hanbal, al-Nasa’i, al-Sulaymani, Ibn Al-Jarud, al-Daraqutni, Hafs b. Ghiyaath, Ibn Sa’d, Yahya b. Ma’in, Yazid b. Harun and Ya’qub b. Sufyan (etc.) all condemned Abu Hamzah Al-Thumaali.<\/p>\n<p style=\"text-align: justify;\">In fact, Sunni critics, such as Ibn Hibban, even provide further detail as to why they deemed him weak. Ibn Hibbam, in <em>Kitaab al-Majruhin,<\/em> says:<\/p>\n<p style=\"text-align: justify;\">He was very delusional in his transmission of hadith to the extent that he could not be relied upon if he exclusively transmits a report.<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p>\n<p style=\"text-align: justify;\">Considering that all these critics were much closer in time to Abu Hamzah, along with the fact that their statements are heavily corroborated, there are good grounds to assert that their conclusions are more reliable and representative of reality. This is the general case for most transmitters that Sunni and Shi’ite scholarship disagree on.<\/p>\n<p style=\"text-align: justify;\">Another great example is the pillar of Shi’i hadith: Jaber b. Yazid Al-Jo’fi. Al-Khoei, in <em>Mu’jam Rijaal Al-Hadith<\/em>, says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“What must be said is that this man [Jaber] must be considered from among the revered <em>thiqaat, <\/em>due to the testimony of ‘Ali b. Ibrahim, al-Shaykh al-Mufid in his <em>al-Risalah al-‘Adadiyyah, <\/em>and the testimony of Ibn al-Ghada’eri reported by <em>al-‘Allamah<\/em>.”<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Thus, we can see that Al-Khoei relied upon three early Shi’i critics in determining Jaber’s reliability; however, when looking at the statements of Sunni critics, one recognizes that over 29 Sunni hadith critics condemned him!<\/p>\n<p style=\"text-align: justify;\">Al-Jawzajani, Abu Ahmed Al-Hakim, Ibn ‘Adiyy, al-Bayhaqi, al-‘Uqaili, Abu Hatem al-Razi, Ibn Hibban, ‘Umar b. Shahin, Abu Hanifah, Abu Dawud, Abu Zur’ah, Abu ‘Abdillah al-Hakim, Ahmed b. Hanbal, al-Nasa’i, al-‘Ijli, Ayyub al-Sakhtiyani, al-Bukhari, al-Daraqutni, Jarir al-Dhabbi, Za’idah b. Qudamah, Sa’id b. Jubayr, Sufyan b. ‘Uyaynah, Abdurrahman b. Mahdi, Layth b. Abi Sulaym, Ibn Sa’d, Muslim b. al-Hajjaj, Yahya b. Sa’id al-Qattan, Yahya b. Ma’in and Ya’qub b. Sufyan al-Fasawi all condemned Jabir b. Yazid al-Jo’fi.<\/p>\n<p style=\"text-align: justify;\">In fact, some of these critics, such as: Sa’id b. Jubayr, Abu Hanifah, Ayyub al-Sakhtiyani, and Layth b. Abi Sulaym (etc.) were contemporaries of Jabir, and most (if not all) of the 29 critics listed above were closer in time to Jabir b. Yazid than the three Shi’i critics listed by Al-Khoei.<\/p>\n<p style=\"text-align: justify;\">Thus, it is evident that this heavily corroborated stance regarding this transmitter from earlier critics is a significant factor that must be taken into consideration when analyzing this transmitter’s reliability.<\/p>\n<p style=\"text-align: justify;\">Another great example is another major Shi’i transmitter of hadith, al-Asbagh b. Nubatah. Al-Khoei cites his reliability by appealing to Ali b. Ibrahim’s inclusion of al-Asbagh in his tafsir and by quoting Najashi who said: “He was one of our righteous predecessors”<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a> and Tusi, who said: “He was one of the main companions of ‘Ali b. Abi Taleb.”<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p>\n<p style=\"text-align: justify;\">Thus, it is apparent that Al-Khoei relies upon the statements of only three Shi’i critics to determine his reliability. However, when observing the statements of the earlier Sunni critics, one recognizes the vast disparity: over 21 different Sunni hadith critics condemned al-Asbagh b. Nubatah.<\/p>\n<p style=\"text-align: justify;\">Yahya b. Ma’in, al-Jawzajani, Abu Ahmed al-Hakim, al-Bazzar, Abu Bakr b. Ayyash, Abu Hatem al-Razi, Ibn Hibban, Abu Dawud, Abu Nu’aym, al-Nasa’i, Ibn Taher, al-Daraqutni, al-Mughirah b. Miqsam al-Dhabbi, Zakariyyah b. Yahya al-Saji, Abdurrahman b. Mahdi, Yahya b. Sa’id al-Qattan, Ibn Sa’d. Muhammad b. ‘Abdillah al-Mowseli, and Ya’qub b. Sufyan al-Fasawi all condemned al-Asbagh b. Nubatah.<\/p>\n<p style=\"text-align: justify;\">Most of these critics were closer in time to al-Asbagh b. Nubatah than the three Shi’i critics that praised and approved of him.<\/p>\n<p style=\"text-align: justify;\">There are many more examples that can be presented, but these three fundamental Shi’i transmitters should be more than enough to exemplify this disparity between Sunni and Shi’i <em>Rijaal.<\/em><\/p>\n<h2 style=\"text-align: justify;\"><strong>Objectivity<\/strong><\/h2>\n<p style=\"text-align: justify;\">An observer may ask: “How can we rely upon Sunni hadith critics when analyzing Shi’i transmitters?”<\/p>\n<p style=\"text-align: justify;\">The answer to that question is very simple: <u>Across the books of <em>Rijaal, <\/em>Sunni hadith critics have displayed their clear and objective impartiality when judging transmitters of hadith. This could be exemplified in the many “non-Sunni” transmitters they deemed reliable<\/u>. Going through Sunni books of hadith, one comes across tens (if not hundreds) of Shi’i, Qadari, Kharijite, Murji’, Rafidhi and Mo’tazilite transmitters that were all deemed reliable in hadith.<\/p>\n<p style=\"text-align: justify;\">This can be summarized in a brief exchange documented in <em>Su’alaat Ibn al-Junaid<\/em>, where Yahya was asked about Sa’id b. Khaytham al-Hilali. Yahya responds saying:<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">He is a Kufan sheikh. There is nothing is wrong in his transmission, and he is a <em>thiqah <\/em>(reliable).<\/p>\n<p style=\"text-align: justify;\">Then, a man interjected asking: “A Shi’ite ? “<\/p>\n<p style=\"text-align: justify;\">Yahya b. Ma’in responds saying: “<u>A Shi’ite <em>thiqah, <\/em>and a Qadari <em>thiqah<\/em><\/u>” <a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p>\n<p style=\"text-align: justify;\">This could also be seen in Ibn ‘Adiyy’s description of the famous Shi’i transmitter, Abaan b. Taghlub:<\/p>\n<p style=\"text-align: justify;\">He has numerous hadiths and transcriptions (<em>nusakh<\/em>), and most of them are upright as long as he transmits from a reliable transmitter. <u>He was a trustworthy individual in his transmission, even though he was a Shi’ite<\/u>. <a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a><\/p>\n<p style=\"text-align: justify;\">Another example can be found in Sahih Ibn Khuzaymah, where Ibn Khuzaymah transmits a hadith from the extreme Shi’i transmitter, ‘Abbad b. Yaqub. Ibn Khuzaymah says:<\/p>\n<p style=\"text-align: justify;\">“We were informed by ‘Abbad b. Ya’qub, <u>who is suspect in his faith, yet reliable in his transmission<\/u> ….”<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a><\/p>\n<p style=\"text-align: justify;\">Similarly, there are tens of examples that can be presented in this context, all of which display the impartiality and objectivity of Sunni critics when analyzing the transmitters of hadith. Taking all previous arguments into account, the objectivity of the Sunni critics adds to their credibility when analyzing transmitters of hadith.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">Taking all of these factors into account, we have good grounds to assert that the verdicts of the Sunni hadith critics regarding the reliability of hadith transmitters are more reliable and authoritative than those of the Shi’i critics.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Sahih Muslim 2\/15<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a>Buhuth fi ‘Ilm Al-Rijaal p. 58<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a>Buhuth fi ‘Ilm Al-Rijaal p. 58<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a>Buhuth fi ‘Ilm Al-Rijaal p. 58<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a>Al-Firhist p. 90<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a>FihristAsmaa’ Musannifi Al-Shi’a p. 115<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a>Man La Yahdhuruhuul-Faqih 4\/444<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a>Ikhtiyar Ma’rifat Al-Rijaal 2\/707<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Al-Majruhin 1\/206<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a>Mo’jam Rijaal al-Hadith 4\/344<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a>Mo’jam Rijaal al-Hadith 4\/118<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a>Mo’jam Rijaal al-Hadith 4\/119<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a>Su’alaat Ibn Al-Junaid p. 421<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Al-Kamil fi Du’afaa al-Rijal 2\/70<\/p>\n<p style=\"text-align: justify;\"><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> Sahih Ibn Khuzaymah 2\/376<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>When analyzing hadiths and historical reports, one cannot overlook the discipline of ‘ilmur-Rijaal. This science is a compilation of the hadith critics’ conclusions regarding the reliability of the numerous hadith transmitters that took part in the transmission of hadith. In <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/04\/22\/sunni-critics-vs-shia-critics\/\" title=\"Sunni Critics vs Shia Critics\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-4357","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4357","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4357"}],"version-history":[{"count":1,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4357\/revisions"}],"predecessor-version":[{"id":4358,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4357\/revisions\/4358"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4357"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4357"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}