{"id":4361,"date":"2018-05-13T23:07:07","date_gmt":"2018-05-13T23:07:07","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4361"},"modified":"2018-05-13T23:07:07","modified_gmt":"2018-05-13T23:07:07","slug":"analysis-hadith-none-shall-love-except-believer","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/05\/13\/analysis-hadith-none-shall-love-except-believer\/","title":{"rendered":"Analysis of the Hadith “None Shall Love Me Except a Believer”"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4361\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\">by Abdullah Moataz<\/h3>\n<p style=\"text-align: justify;\">\n<p id=\"h.p_upC2hPFIV261\" class=\"zfr3Q\" style=\"text-align: justify;\">One of the more profound hadiths regarding the superiority of ‘Ali b. Abi Talib and his virtues, is a hadith found in Sahih Muslim. Shi’ite polemicists constantly use the hadith in their proselytizing efforts with Sunnis. The hadith in Muslim is worded as follows:<\/p>\n<p id=\"h.p_lWTs_sszV262\" class=\"zfr3Q\" style=\"text-align: justify;\">‘Ali b. Abi Talib said, “I swear by Him who split the seed and created people, it is the illiterate Prophet’s promise to me that none shall love me except a believer, and none shall hate me except a hypocrite.”<\/p>\n<p id=\"h.p_kMEPkXbuV262\" class=\"zfr3Q\" style=\"text-align: justify;\">Before going directly into the issue, I will give two introductions that, by the permission of Allah, will facilitate a better understanding of the issue at hand. The first issue is directly related to Sahih Muslim as a book, and the second issue relates to Al-Daraqutni’s criticism of the hadith.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"h.p_ToRmzUtMV263\" class=\"zfr3Q\" style=\"text-align: justify;\"><strong>Muslim’s Methodology in his <em>Sahih<\/em><\/strong><\/h2>\n<p id=\"h.p_LEO0QVfMV263\" class=\"zfr3Q\" style=\"text-align: justify;\">Unlike many other compilers of hadith, Muslim b. Al-Hajjaj wrote an introduction to his Sahih. Besides the historical value of it, as well the wealth of information contained in it regarding hadith method, Muslim also details his methodology in compiling his Sahih. One of the important aspects of Muslim’s Sahih is his inclusion of defective reports in their relevant chapter.<\/p>\n<p id=\"h.p_Pw-UTpKxV264\" class=\"zfr3Q\" style=\"text-align: justify;\">Essentially, and without going in too much detail on the topic, Muslim typically begins the chapter by mentioning the most authentic reports on the issue and following it up by mentioning reports of lesser transmitters, and then ending occasionally with a defective hadith. A more detailed study of this aspect of Muslim’s Sahih can be found in Hamzah Al-Malibari’s “<em>’Abqariyyat Al-Imam Muslim fi Tartib Ahadith Musnadihi Al-Sahih.” <\/em><\/p>\n<p id=\"h.p_ydzNHFczV264\" class=\"zfr3Q\" style=\"text-align: justify;\">All that needs to be understood from this is that, not only is it possible that an inauthentic hadith appears in Sahih Muslim, but that it is likely that Muslim included it in his Sahih simply to demonstrate its inauthenticity.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"h.p_4Ao0KVw-V265\" class=\"zfr3Q\" style=\"text-align: justify;\"><strong>Al-Daraqutni’s Criticism<\/strong><\/h2>\n<p id=\"h.p_G8p7haJOV265\" class=\"zfr3Q\" style=\"text-align: justify;\">In <em>Al-Tatabbu’<\/em>, where Al-Daraqutni compiled a selection of ahadith he considered to be weak in the two Sahihs, he includes the hadith in question. Al-Daraqutni, however, didn’t expressly state what he found problematic about the hadith. This left the door wide open for academics and researchers to determine what exactly Al-Daraqutni’s issue was.<\/p>\n<p id=\"h.p_xK8YjkMxV266\" class=\"zfr3Q\" style=\"text-align: justify;\">Rabi’ b. Hadi Al-Madkhali, in his master’s thesis “Bayn Al-Imamayn,” deals specifically with the portion of criticized ahadith found in Sahih Muslim. When analyzing the hadith, he understands, that the presence of ‘Adiyy b. Thabit, a reliable yet Shi’ite transmitter, is the cause of Al-Daraqutni’s concern and criticism (Al-Madkhali 39).<\/p>\n<p id=\"h.p_gxIgfcZwV266\" class=\"zfr3Q\" style=\"text-align: justify;\">If Al-Madkhali is correct in his assumption, the crux of the issue would be concerning a heretic’s transmission in support of their heresy, a detailed and controversial issue found in the books of <em>Mustalah<\/em>.<\/p>\n<p id=\"h.p_qPv6jt2iV267\" class=\"zfr3Q\" style=\"text-align: justify;\">Our friend Farid, challenged this assumption, and pointed out the existence of an actual hadith defect. After reflection, it appears that Farid’s hypothesis is more likely. If there is an actual hadith defect, there would be no reason to explain the criticism with a more elaborate and controversial explanation.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"h.p_E3-uG-C5V267\" class=\"zfr3Q\" style=\"text-align: justify;\"><em><strong>Isnad<\/strong><\/em><strong> Analysis <\/strong><\/h2>\n<p id=\"h.p_HYFxk6nEV267\" class=\"zfr3Q\" style=\"text-align: justify;\">The hadith originates from Al-A’mash, from ‘Adiyy b. Thabit, from Zirr b. Hubaysh, from ‘Ali b. Abi Talib.<\/p>\n<p id=\"h.p_i_zKCAszV269\" class=\"zfr3Q\" style=\"text-align: justify;\">Al-A’mash is a famous <em>Hafiz<\/em>, and reliable transmitter, though occasionally practices <em>tadlis<\/em>. He needs no introduction.<\/p>\n<p id=\"h.p_n-azpgMFV269\" class=\"zfr3Q\" style=\"text-align: justify;\">‘Adiyy b. Thabit is also a reliable transmitter despite his Shi’ite leanings.<\/p>\n<p id=\"h.p_VyD4HQyIV269\" class=\"zfr3Q\" style=\"text-align: justify;\">§ Abu Hatim Al-Razi said, “Trustworthy, and he was the Imam of the Shi’ite masjid, and their speaker” (Al-Razi 2)<\/p>\n<p id=\"h.p_RQHv4tJcV26-\" class=\"zfr3Q\" style=\"text-align: justify;\">§ Ahmed b. Hanbal said, “‘Adiyy b. Thabit is reliable, though he used to be a Shi’ite” (B. Hanbal 490).<\/p>\n<p id=\"h.p_fg3UFDVEV26-\" class=\"zfr3Q\" style=\"text-align: justify;\">§ Al-Daraqutni said, “Reliable, though he was a Rafidi, very extreme in it” (Al-Sulami 210)<\/p>\n<p id=\"h.p_mp4gOThbV26-\" class=\"zfr3Q\" style=\"text-align: justify;\">Zirr b. Hubaysh is another reliable transmitter without controversy, though he is said to have anti-‘Ali leanings.<\/p>\n<p id=\"h.p_MyVXJdDYV26_\" class=\"zfr3Q\" style=\"text-align: justify;\">In reality, the only defect in the chain would be the possibility of Al-A’mash’s <em>tadlis<\/em> here, which is unaccounted for. <em>Tadlis<\/em> is a way of transmitting hadith, wherein the “student” drops the intermediary, his source of transmission, and ambiguously transmits it from their mutual “teacher.” It is not a form of lying, as the “student” never expressly states they directly acquired the hadith from the “teacher.” Typically, transmitters guilty of this practice are scrutinized more, and their transmission isn’t accepted unless it is expressly stated how they acquired the report.<\/p>\n<p id=\"h.p_xNEDQRCjV26_\" class=\"zfr3Q\" style=\"text-align: justify;\">After a thorough search, I was unable to find any report where he expressly transmits it from ‘Adiyy b. Thabit.<\/p>\n<p id=\"h.p_gHxdkTGeV26_\" class=\"zfr3Q\" style=\"text-align: justify;\">Besides this glaring defect, we have another indicator that suggests this report was never actually transmitted by ‘Adiyy b. Thabit from Zirr b. Hubaysh.<\/p>\n<p id=\"h.p_Oc0dnLnhV27A\" class=\"zfr3Q\" style=\"text-align: justify;\">As previously mentioned, Zirr b. Hubaysh was thought to have anti-‘Ali leanings. If this was the case, why would he be transmitted a hadith about the virtues of ‘Ali? Mind you, the hadith is not simply about the virtues of ‘Ali, but it is a highly exaggerated praise as well. While this point isn’t strong enough to stand alone, it is a factor that must be considered seriously, especially when there is an actual hadith defect present in the chain as well. The existence of <em>tadlis<\/em> in the chain, as well as this factor together, make a strong argument for the hadith’s inauthenticity.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"h.p_v0ssMqY0V27B\" class=\"zfr3Q\" style=\"text-align: justify;\"><strong>Muslim’s Placement<\/strong><\/h2>\n<p id=\"h.p_gLUra_9FV27C\" class=\"zfr3Q\" style=\"text-align: justify;\">Muslim’s placement of the hadith is most interesting. In terms of topical placement, the hadith doesn’t seem to fit in its place. Muslim’s places it after five other hadith reports mentioning the virtues of the Ansar. Obviously, the hadith isn’t in the relevant chapter.<\/p>\n<p id=\"h.p_yuHY_7d1V27D\" class=\"zfr3Q\" style=\"text-align: justify;\">In terms of ordering, it is the last hadith placed in the chapter.<\/p>\n<p id=\"h.p_SCQG61f7V27D\" class=\"zfr3Q\" style=\"text-align: justify;\">Why does Muslim do this? I would argue that Muslim’s actions may only be understood as an implicit criticism of the hadith. Consider the following point:<\/p>\n<p id=\"h.p_aJCuJ9TtV27E\" class=\"zfr3Q\" style=\"text-align: justify;\">In the same chapter, Muslim records another hadith, originating from Shu’bah, who transmits it from ‘Adiyy b. Thabit. The premise of this hadith is similar to the one in question, with one major difference. Instead of it referring to ‘Ali, a lone individual, it refers to the Ansar, a group of people.<\/p>\n<p id=\"h.p_pm_yRBhtV27E\" class=\"zfr3Q\" style=\"text-align: justify;\">What’s the issue? A critic would be very suspicious when seeing this. It is strange to find two independent reports, that supposedly have the same origin and source, both of which share in the major premise, yet differ in one part. For the critic, the more likely explanation, especially considering the other two factors previously mentioned, is that an error occurred in the transmission of the hadith.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"h.p_NUs0r264V27E\" class=\"zfr3Q\" style=\"text-align: justify;\"><strong>Matn Analysis <\/strong><\/h2>\n<p id=\"h.p_PtMu6N2uV27F\" class=\"zfr3Q\" style=\"text-align: justify;\">The first clause of the report reads, “<strong>By Him who split the seed, and created people<\/strong>”<\/p>\n<p id=\"h.p_V9FC15D_V27G\" class=\"zfr3Q\" style=\"text-align: justify;\">This phrase was actually used by ‘Ali at least once, as found in a hadith in Sahih Al-Bukhari.<\/p>\n<p id=\"h.p_Er76rpzsV27G\" class=\"zfr3Q\" style=\"text-align: justify;\">The second clause of the report reads, “<strong>It is the illiterate Prophet’s promise to me that<\/strong>…”<\/p>\n<p id=\"h.p_QYEAsC_CV27G\" class=\"zfr3Q\" style=\"text-align: justify;\">As a phrase “The illiterate Prophet – Al-Nabi Al-Ummi,” is found in the Qur’an, as well as supplications, and others, as can be found in hadith literature. I was not able to find a single instance, authentically transmitted, where a Companion used this phrase in reference to the Prophet.<\/p>\n<p id=\"h.p_ho6PxikWV27H\" class=\"zfr3Q\" style=\"text-align: justify;\">The third clause of the report reads, “<strong>None shall love me except a believer, and none shall hate me except a hypocrite.”<\/strong><\/p>\n<p id=\"h.p_wrzqr-y2V27I\" class=\"zfr3Q\" style=\"text-align: justify;\">I find this clause to be problematic.<\/p>\n<p id=\"h.p_zXDRsI2HV27I\" class=\"zfr3Q\" style=\"text-align: justify;\">Hatred of an individual, with the exception of a Prophet, is never an act of disbelief or hypocrisy, unless the hatred directed to them is theological. This is perfectly demonstrated by an incident that happened during the Prophet’s life, as can be found in Sahih Al-Bukhari.<\/p>\n<p id=\"h.p_U2-6CvVfV27I\" class=\"zfr3Q\" style=\"text-align: justify;\">An incident regarding the spoils of war occurred between Buraydah, and ‘Ali, which caused animosity between them from Buraydah’s side. He relates that he informed the Prophet of the incident, to which the Prophet asked him, “Do you hate ‘Ali?” Buraydah responded, “Yes.” The Prophet then said, “Don’t hate him, as his share in the Khums (fifth) is more than that.”<\/p>\n<p id=\"h.p_FI_VuO08V27I\" class=\"zfr3Q\" style=\"text-align: justify;\">Based on this account, the Prophet only told Buraydah to not hate ‘Ali. He didn’t add that was disbelief or that Buraydah was now a hypocrite due to his personal issues with ‘Ali. It makes complete sense that hatred of an individual would not be disbelief, since it is possible that a person could hate another based on a personal problem, as Buraydah did, and not due to disbelief. On the other hand, hatred of a certain group of people is liable to be a sign of disbelief, since a person cannot have a personal problem with a whole group of people. For example, hatred of the Ansar as a whole cannot be except due to disbelief, since the only common link between all of them is their Islam and status, therefore, hatred of them must be because of that. Whereas, if a person were to hate one individual from the Ansar, the same ruling wouldn’t apply, as it is very likely that the hatred could simply be as a result of a personal issue between the two.<\/p>\n<p>&nbsp;<\/p>\n<h2 id=\"h.p_VfpxYmfqV27K\" class=\"zfr3Q\" style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p id=\"h.p_D71WYRIsV27L\" class=\"zfr3Q\" style=\"text-align: justify;\">Though this hadith was included by Muslim in his <em>Sahih<\/em>, it isn’t authentic. It appears as though Muslim himself also believed this, and only reproduced the report in his <em>Sahih<\/em> to demonstrate its weakness in accordance with his methodology. Unlike some have suggested, the defect of the hadith is not ‘Adiyy b. Thabit or his Shi’ite leanings, but the <em>tadlis<\/em> of Al-A’mash. Furthermore, the implications of the report, if understood in its general or absolute sense, are false.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"h.p_fxaw9P4HV27M\" class=\"zfr3Q\" style=\"text-align: justify;\">Sources:<\/h3>\n<ul>\n<li id=\"h.p_O1MV5fvXV27N\" class=\"zfr3Q\" style=\"text-align: justify;\">Al-Madkhali, Rabi&#8217; b. Hadi. <em>Bayn Al-Imamayn: Muslim Wa Al-Daraqutni <\/em>. Maktabat Al-Rushd.<\/li>\n<li id=\"h.p_mGLPgNLHV27O\" class=\"zfr3Q\" style=\"text-align: justify;\">Al-Razi, Abd Al-Rahman b. Abi Hatim. <em>Al-Jarh Wa Al-Ta&#8217;dil <\/em>. Vol. 7, Majlis Da&#8217;irat Al-Ma&#8217;arif Al-&#8216;Uthmaniyyah, 1952.<\/li>\n<li id=\"h.p_vonj7uAdV27O\" class=\"zfr3Q\" style=\"text-align: justify;\">Al-Sulami, Muhammad b. Al-Husayn. <em>Su&#8217;alat Al-Sulami Li Al-Daraqutni <\/em>. Khalid Al-Juraysi, 2006.<\/li>\n<li id=\"h.p_tzhmFjI0V27S\" class=\"zfr3Q\" style=\"text-align: justify;\">B. Hanbal, Ahmed b. Muhammad. <em>Al-&#8216;Ilal Wa Ma&#8217;rifat Al-Rijal <\/em>. 2nd ed., vol. 3 3, Dar Al-Khani, 1422.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>by Abdullah Moataz One of the more profound hadiths regarding the superiority of ‘Ali b. Abi Talib and his virtues, is a hadith found in Sahih Muslim. Shi’ite polemicists constantly use the hadith in their proselytizing efforts with Sunnis. The <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/05\/13\/analysis-hadith-none-shall-love-except-believer\/\" title=\"Analysis of the Hadith “None Shall Love Me Except a Believer”\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,6],"tags":[],"class_list":{"0":"post-4361","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fadhail"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4361","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4361"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4361\/revisions"}],"predecessor-version":[{"id":4530,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4361\/revisions\/4530"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}