{"id":4363,"date":"2018-05-16T03:15:58","date_gmt":"2018-05-16T03:15:58","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4363"},"modified":"2018-06-09T06:37:09","modified_gmt":"2018-06-09T06:37:09","slug":"shia-maghrib-prayer-timing","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/05\/16\/shia-maghrib-prayer-timing\/","title":{"rendered":"Shia Maghrib Prayer Timing"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4363\" alt=\"\" \/><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Y2W_S0-MCIY\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen><\/iframe><\/p>\n<h2 style=\"text-align: justify;\"><strong>Background<\/strong><\/h2>\n<p style=\"text-align: justify;\">It is commonly accepted among the Shias today that Sunnis are praying the Maghrib prayers before the time that has been stipulated by the Shari’ah.<\/p>\n<p style=\"text-align: justify;\">According to Sunnis, as long as the actual sun&#8217;s disc disappears, the time is  Maghrib. As for Shias, they maintain that the time of Maghrib is when the redness of the East is no longer visible, which occurs around ten to fifteen minutes after the actual sun disappears (and perhaps even longer depending on the region). This is especially significant in Ramadan, since Shias argue that Sunnis are breaking their fast before Maghrib time, and thus, their fasting is not accepted. To support this belief, Shias often bring forth multiple narrations to support this position.<\/p>\n<p style=\"text-align: justify;\">However, the Imams, in many occasions, also stated that Maghrib occurs when the sun&#8217;s disc disappears.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Narrations<\/strong><\/h2>\n<p style=\"text-align: justify;\">Wasa’el Al-Shia 4\/177-183 provides a large list of the narrations that support the view that Maghrib starts when the sun&#8217;s disc disappears:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Al-Tahtheeb: Al-Jarud said: Abu Abdullah (as) said, “I now pray it (Maghrib) when sun’s disc has fallen.”<\/li>\n<li>Al-Kafi\/Al-Tahtheeb: Abdullah bin Sinan said: I heard Abu Abdullah (as) say, “The time of Maghrib is when the sun sets and the disc disappears.”<\/li>\n<li>Al-Kafi\/Al-Tahtheeb: Zurarah said: I heard Abu Ja’afar (as) say, “Maghrib is when the disc disappears.”<\/li>\n<li>Man La Yahtharhu Al-Faqeeh: Abu Ja’afar (as) said, “Maghrib is when the disc disappears.”<\/li>\n<li>Man La Yahtharhu Al-Faqeeh: Al-Sadiq (as) said, “If the sun disappears, then it is time to break the fast and prayer becomes obligatory.”<\/li>\n<li>Man La Yahtharhu Al-Faqeeh: Jabir (Al-Ju’fi) narrated from Abu Ja’afar (as) that he said, “The Prophet (peace be upon him and his household) said: If the disc disappears, he who fasts eats, and the time of prayer has begun.”<\/li>\n<li>Amali Al-Saduq: Dawud bin Abi Yazeed said: Ja’afar Al-Sadiq (as) said, “If the sun disappears, the time of Maghrib has occurred.”<\/li>\n<li>Amali Al-Saduq: Al-Rabee’ bin Sulaiman, Aban bin Arqam, and others narrated that Ja’afar Al-Sadiq (as) prayed while sunlight was noticeable. When asked, he said, “If the sun sets, the time of prayer has occurred.”<\/li>\n<li>Al-Tahtheeb\/Amali Al-Saduq\/Ilal Al-Shara’i’: Ja’afar Al-Sadiq (as) was asked about the time of Maghrib. He said, “When the <em>kursi <\/em>disappears.” He was asked, “What is its <em>kursi<\/em>?” He replied, “Its disc.” He asked, “When does the disc disappear?” He said, “If you look at it and cannot see it.”<\/li>\n<li>Al-Tahtheeb: Isma’eel bin Al-Fadhl Al-Hashimi narrated from Ja’afar Al-Sadiq (as), who said, “The Prophet (peace be upon him and his household) prayed Maghrib when the sun sets, when the edge disappears.”<\/li>\n<li>Al-Tahtheeb: Abu Baseer said that Ja’afar Al-Sadiq (as) said, “The time of Maghrib is when the sun disappears.”<\/li>\n<li>Al-Tahtheeb: Amr bin Abi Nasr said that he heard Ja’afar Al-Sadiq (as) say about Maghrib, “When the disc disappears, it is time for prayer, and (time to) eat.”<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<h2 style=\"text-align: justify;\"><strong>Shia Explanation<\/strong><\/h2>\n<p style=\"text-align: justify;\">Arguing against the authenticity of these reports does not occur since the above reports are plenty in number. Furthermore, some of them are indeed authentic according to Shia hadith standards, like the hadiths of Abdullah bin Sinan, Zurarah, and Dawud bin Abi Yazeed. Due to this, Shias focus on reconciling these reports with others that speak of Maghrib occurring when the redness of the East disappears.<\/p>\n<p style=\"text-align: justify;\"><em>Note: It is important to be aware that there are more authentic reports the support the view that Maghrib starts when the disc disappears than the reports that supports the view that it starts after the redness of the East disappears.<\/em><\/p>\n<h3 style=\"text-align: justify;\">Excuse #1: Reconciliation<\/h3>\n<p style=\"text-align: justify;\">The argument is that these reports speak of one of the two conditions of Maghrib, which is the disappearance of the disc of the sun. The other condition is the disappearance of the redness of the East. In other words, the claim is that the followers of the Imam need to place these narrations together and to hold the view that Maghrib occurs after both these conditions are met.<\/p>\n<p style=\"text-align: justify;\">This argument is very flawed, since it means that the reports provided above are incomplete in nature, and result to a false understanding of the time of Maghrib. Take the following scenario as an example:<\/p>\n<p style=\"text-align: justify;\">If we had two reports, one saying that the Imam stated that the time of Maghrib is <strong>after 6pm<\/strong> and the other saying that it is <strong>at 6:15pm<\/strong>, then according to this rationale, breaking the fast at 6:15pm is the correct view since 6:15pm occurs after 6pm. Obviously, our response is that everyone that follows the first hadith and breaks the fast from 6:01-6:14pm has invalidated their fast due to the incomplete information provided by the Imam.<\/p>\n<h3 style=\"text-align: justify;\">Excuse #2: Taqiyyah<\/h3>\n<p style=\"text-align: justify;\">The go-to excuse that is provided by every Shia scholar in cases of contradictions is the handy <em>taqiyyah <\/em>card. The argument is: Since Sunnis break the fast upon the disappearance of the disc, it is only natural to assume that the Imams they practiced <em>taqiyyah<\/em> to appeal to Sunnis.<\/p>\n<p style=\"text-align: justify;\">The dangers of this belief are devastating. It suggests that the Imams, that were sent as guides for humanity, falsely taught people to break their fast at an invalid time. This disastrous belief goes against the very reason for the existence of the Imam: Guidance.<\/p>\n<h2 style=\"text-align: justify;\"><strong>Conclusion<\/strong><\/h2>\n<p style=\"text-align: justify;\">The explanations that are provided to solve the issue of the contradicting reports fall short. It becomes obvious that the Imams either truly contradicted themselves or that these are false attributions to them by their companions or by Shia narrators in general.<\/p>\n<p style=\"text-align: justify;\">Objective Shias are perhaps left without a resolution to this contradiction, since there are no external evidences to support either position. However, this dilemma isn’t restricted to this <em>fiqhi<\/em> topic alone, but can be found in all sections of Shia Shari’ah, which is one of the major issues with Shia hadith and the failure of their hadith grading system.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Background It is commonly accepted among the Shias today that Sunnis are praying the Maghrib prayers before the time that has been stipulated by the Shari’ah. According to Sunnis, as long as the actual sun&#8217;s disc disappears, the time is  <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/05\/16\/shia-maghrib-prayer-timing\/\" title=\"Shia Maghrib Prayer Timing\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,12],"tags":[],"class_list":{"0":"post-4363","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4363","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4363"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4363\/revisions"}],"predecessor-version":[{"id":4372,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4363\/revisions\/4372"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4363"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4363"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4363"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}