{"id":4374,"date":"2018-06-15T01:34:59","date_gmt":"2018-06-15T01:34:59","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4374"},"modified":"2018-06-16T10:28:55","modified_gmt":"2018-06-16T10:28:55","slug":"authentic-virtues-of-ali-b-abi-taleb","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2018\/06\/15\/authentic-virtues-of-ali-b-abi-taleb\/","title":{"rendered":"Authentic Virtues of ‘Ali b. Abi Taleb"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4374\" alt=\"\" \/><\/p>\n<h2><strong><u>Background<\/u><br \/>\n<\/strong><\/h2>\n<p>One of the major disputes in Sunni-Shia polemics is the nature and role of ‘Ali b. Abi Taleb.  The origin of this dispute stems from the presence of a wide variety of reports and traditions that depict ‘Ali in varying manners. There are a few reasons as to why such a shockingly large number of (often contradicting) reports regarding the virtues of ‘Ali exist. Most significant of them is the widespread circulation of numerous fabricated reports and forgeries that attempt to display and exaggerate the virtues of ‘Ali b. Abi Taleb.<\/p>\n<p>In fact, this confusion in the nature of ‘Ali seems to have started at the end of his life. A report in Sahih al-Bukhari alludes to this, as the renowned <em>tabi’i<\/em>, Al-Sha’bi, reports:<\/p>\n<p>I once saw Abu Juhaifah approach ‘Ali b. Abi Taleb and ask him: “Do you have any knowledge that is not in the Quran or dispersed among the masses?”<\/p>\n<p>Ali responds saying: “By the one who split the grain and created the soul, we have nothing except what is in the Quran and the understanding of the Quran endowed to a man by Allah; and what is in this document.”<\/p>\n<p>I asked: “What is in this document?”<\/p>\n<p>‘Ali responds: “Regulations pertaining to blood money, the ransom of the captive and that a believer must not be killed for killing a disbeliever.”<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p>\n<p>As evident in this report, the questioner, Abu Juhaifah, approaches ‘Ali asking him about the nature of his own knowledge. In this context, such bizarre questions and doubts should not come as a surprise to the reader. They often arose as a result of fabricated reports that were widely circulated in the city of Kufah, where ‘Ali and the later Shi’a were based. Numerous hadith critics took note of this bizarre and widespread circulation of fabricated reports regarding the virtues of ‘Ali.<\/p>\n<p>The notable hadith critic, Abu Ya’la al-Khalili (died 446 AH), quotes a hadith critic saying:<\/p>\n<p>“I have observed the reports that were fabricated by the Kufans regarding the virtues of ‘Ali and Ahlulbait, and I saw that they were more than 300,000 fabricated reports.”<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p>Ibn al-Jawzi said:<\/p>\n<p>“The Rafida’s extreme love of Ali led them to fabricate many reports demonstrating his virtues. Most of these reports actually ended up harming him and depicting him in a negative manner. I have listed some of those reports in my book, <em>al-Mawdu’aat.<\/em>”<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<p>Yahya b. Ma’in quotes the forger, Mu’alla b. Abdurrahman al-Wasiti (on his deathbed), saying: “I have fabricated 90 hadiths in the virtues of ‘Ali b. Abi Taleb.” <a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p>\n<p>Ibn Hibban describes the forger, Abu al-Jarud al-Thaqafi, saying:<\/p>\n<p>“He was a Rafidi who used to fabricate baseless reports regarding the blunders of the Sahabah and the virtues of Ahlulbait. His hadiths should not be written.” <a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/p>\n<p>The Kufan forger and transmitter, Matar b. Maymun, was described in al-Majruhin with the following:<\/p>\n<p>“He used to transmit fabrications through reliable transmitters. He transmitted baseless reports from Anas b. Malik in the virtues of ‘Ali b. Abi Taleb.”<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/p>\n<p>These are a few examples that demonstrate the prevalence of this historical phenomenon where forgers took advantage of the Shi’i zeal for ‘Ali and Ahlulbait by fabricating reports that displayed and exaggerated their virtues.<\/p>\n<p>Thus, Imam al-Bukhari concludes the chapter in his Sahih on the virtues of ‘Ali with the following report:<\/p>\n<p>“Ibn Sirin considered most reports transmitted about ‘Ali to be fabricated.”<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/p>\n<p>After observing this reality, one may ask: where are the <u>authentic<\/u> reports to the Prophet that display the virtues of ‘Ali b. Abi Taleb?<\/p>\n<p>The answer to that question is very simple: <u>there are several authentic hadiths on the virtues of ‘Ali; however, they are not as exaggerated and plentiful as the Shi’a make them seem<\/u>. Numerous Sunni <em>Muhaddithin<\/em>, such as the authors of the six books, transmitted reports that demonstrated the Prophet’s praise of ‘Ali b. Abi Taleb.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong><u>Authentic Reports:<\/u><\/strong><\/h2>\n<p>Before listing all hadiths that demonstrated the virtues of ‘Ali b. Abi Taleb, it is important to note that all reports containing praise of the companions of the Prophet ﷺ or Ahlulbait span ‘Ali b. Abi Taleb as well. In this context, however, we will only list authentic hadiths that explicitly mention ‘Ali b. Abi Taleb:<\/p>\n<ol>\n<li>Al-Bukhari, Muslim, Ahmed b. Hanbal and others reported that Sahl b. Sa’d said:<\/li>\n<\/ol>\n<blockquote><p>During the Battle of Khaybar, the Messenger of Allah ﷺ said: &#8220;Tomorrow, I shall grant the banner to a man through whom Allah shall grant victory; he loves Allah and His messenger, and he is beloved to them both.&#8221;<\/p>\n<p>Everyone spent the night thinking about who would be given the banner. On the next morning, they all went to the Prophet, each hoping that he would be given the banner. The Prophet said: &#8220;Where is `Ali bin Abi Talib?&#8221;<\/p>\n<p>They replied: &#8220;He is suffering from trouble in his eyes, O Messenger of Allah.”<\/p>\n<p>The Prophet said: &#8220;Send for him and bring him here.&#8221;<\/p>\n<p>When `Ali arrived, the Prophet spat in his eyes and made du’aa for him, and ‘Ali was immediately cured as though he had not been previously afflicted with any illness.<\/p>\n<p>The Prophet then gave him the banner, and `Ali asked: &#8220;O Messenger of Allah, shall I fight them until they become like us?&#8221;<\/p>\n<p>The Prophet ﷺ said: &#8220;Approach them steadily until you are in their field. Then, invite them to Islam and inform them of their obligations. For by Allah, if Allah is to guide a single man through you, then that shall be better for you than the possession of red camels.&#8221;<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<ol start=\"2\">\n<li>Al-Bukhari, Muslim, al-Tirmidhi, Ahmed b. Hanbal and others reported that Sa’d b. Abi Waqqas said:<\/li>\n<\/ol>\n<blockquote><p>The Messenger of Allah ﷺ set out for Tabuk [on a military expedition], and he left ‘Ali behind. Ali said: “Do you leave me behind with the women and children?”<\/p>\n<p>The Prophet ﷺ said: &#8220;Are you not be pleased that you shall be to me as Harun was to Musa? Except that there shall be no prophet after me.&#8221;<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<ol start=\"3\">\n<li>Ibn Hibban, Ahmed b. Hanbal, al-Hakim and others reported that Wathilah b. al-Asqa’ said:<\/li>\n<\/ol>\n<blockquote><p>I was once looking for ‘Ali b. Abi Taleb, and I was told that he went to bring the Messenger of Allah. He then came, and the Messenger of Allah entered, and I entered as well. The Messenger of Allah sat on the mattress. He then placed Fatimah on his right side, ‘Ali on his left side, and al-Hasan and al-Husain on his lap. Then he recited: “Allah only desires to take away any <em>rijs<\/em> from you, O people of the household, and purify you.”<\/p>\n<p>Then he said: “O Allah these individuals are my family.”<\/p>\n<p>Wathilah said: “I, standing at the side of the house, asked: what about me O Messenger of Allah, am I from your family too?”<\/p>\n<p>The Prophet ﷺ said: “You are from my family as well.” <a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<ol start=\"4\">\n<li>Al-Bukhari, Ahmed b. Hanbal and others reported that al-Baraa’ b. ‘Aazeb said – as part of a longer report:<\/li>\n<\/ol>\n<blockquote><p>The Messenger of Allah departed from Mecca, and the daughter of Hamzah followed him shouting: “O Uncle! O Uncle!”<\/p>\n<p>Ali then took her by her hand, and he told Fatima: “Take your cousin.”; thus, she road with her.<\/p>\n<p>‘Ali, Zaid, and Ja’far then disputed with each other regarding her guardianship.<\/p>\n<p>‘Ali said: “I took her, and she is my uncle’s daughter!”<\/p>\n<p>Ja’far said: “She is my uncle’s daughter too, and her maternal aunt is my wife!”<\/p>\n<p>Zaid said: “She is my brother’s daughter!”<\/p>\n<p>The Prophet ruled that she be with her maternal aunt, and he said: “The maternal aunt (khaalah) is just like the mother.”<\/p>\n<p>He (the Prophet) then told Ali: “You are from me and I am from you.”<\/p>\n<p>Then, he told Ja’far: “You have resembled me in appearance and in character.”<\/p>\n<p>Then, he told Zaid: “You are our brother and our freed slave.”<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<ol start=\"5\">\n<li>Al-Tirmidhi and Ahmed b. Hanbal reported that Zaid b. Arqam said:<\/li>\n<\/ol>\n<blockquote><p>The Messenger of Allah said: “For whomever I am his <em>mawla<\/em>, then ‘Ali is his <em>mawla <\/em>as well.” <a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p><\/blockquote>\n<p>&nbsp;<\/p>\n<ol start=\"6\">\n<li>Al-Bukhari, Muslim and others reported that Abu Hazem said:<\/li>\n<\/ol>\n<blockquote><p>A man from the family of Marwan [b. al-Hakam] was appointed as governor of Madinah, and he called Sahl b. Sa’d and commanded him to curse ‘Ali b. Abi Taleb. Sahl refused to do so; thus, the governor said: “If you are to object to that, then at least say: May Allah curse Abu Turab.”<\/p>\n<p>Sahl responded: “There was no name dearer to `Ali than Abu Turab. He used to rejoice when he was called by that name.”<\/p>\n<p>The governor then said: “Narrate to us this story. Why was he called Abu Turab?”<\/p>\n<p>Sahl said: The Messenger of Allah once came to the house of Fatima, and he did not find `Ali in the house. He asked Fatimah: “Where is your cousin?”<\/p>\n<p>She said: “We had a dispute, and he left disappointed, and he did not sleep here.”<\/p>\n<p>The Messenger of Allah told someone: “Find out where he is.”<\/p>\n<p>The man eventually came back and said: “O Messenger of Allah, he is sleeping in the mosque.”<\/p>\n<p>The Prophet came to him and found him lying in the mosque. He saw that his sheet had slipped from his side and his body was thus covered with dust. The Prophet began to wipe it off his body saying: “Get up Abu Turab (dust) ! Get up Abu Turab!” <a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a><\/p><\/blockquote>\n<p><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> Sahih al-Bukhari 5\/69<\/p>\n<p><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> Al-Irshaad fi Ma’rifati ‘Ulamaa’ al-Hadith 1\/419<\/p>\n<p><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> Talbis Iblis p. 89<\/p>\n<p><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> Al-Do’afaa’ al-Kabir by al-‘Uqaili 4\/215<\/p>\n<p><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> Al-Majruhin 1\/306<\/p>\n<p><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> Al-Majruhin 3\/5<\/p>\n<p><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> Sahih al-Bukhari 6\/19<\/p>\n<p><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> Sahih al-Bukhari 5\/60, Sahih Muslim 5\/871, Musnad Ahmed 38\/477<\/p>\n<p><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> Sahih al-Bukhari 7\/3, Sahih Muslim 5\/870, Jami’ al-Tirmidhi 5\/641, Musnad Ahmed 4\/66<\/p>\n<p><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> Sahih Ibn Hibban16\/433, al-Mustadrak 4\/159, Musnad Ahmed 29\/195<\/p>\n<p><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> Sahih al-Bukhari 4\/184, Musnad Ahmed 3\/249<\/p>\n<p><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> Jami’ al-Tirmidhi 5\/635, Musnad Ahmed 39\/219<\/p>\n<p><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> Sahih al-Bukhari2\/96, Sahih Muslim 5\/874<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Background One of the major disputes in Sunni-Shia polemics is the nature and role of ‘Ali b. Abi Taleb.  The origin of this dispute stems from the presence of a wide variety of reports and traditions that depict ‘Ali in <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2018\/06\/15\/authentic-virtues-of-ali-b-abi-taleb\/\" title=\"Authentic Virtues of ‘Ali b. Abi Taleb\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4374","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4374","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4374"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4374\/revisions"}],"predecessor-version":[{"id":4377,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4374\/revisions\/4377"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}