{"id":448,"date":"2013-06-06T12:40:01","date_gmt":"2013-06-06T12:40:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=448"},"modified":"2015-08-06T22:09:52","modified_gmt":"2015-08-06T22:09:52","slug":"response-to-muawiyahs-testimony-on-the-khalifahs","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/06\/06\/response-to-muawiyahs-testimony-on-the-khalifahs\/","title":{"rendered":"Response to: Mu’awiyahs Testimony on the Khalifahs"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=448\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on Revisitingthesalaf.org entitled: Mu’awiyahs Testimony on the Khalifahs, which was published on the 6<sup>th<\/sup> of January, 2013, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2013\/01\/muawiya-testimony-on-khalifahs.html\" rel=\"nofollow external\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">RTS starts off this article by quoting the following narration from Saheeh Al-Bukhari:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Ikrima bin Khalid: Ibn Umar said, &#8220;I went to Hafsa while water was dribbling from her twined braids. I said, &#8216;The condition of the people is as you see, and no authority has been given to me.&#8217; Hafsa said, (to me), &#8216;Go to them, and as they (i.e. the people) are waiting for you, and I am afraid your absence from them will produce division amongst them.&#8217; &#8221; So Hafsa did not leave Ibn Umar till we went to them. When the people differed <strong>Mu&#8217;awiyah addressed the people saying, &#8216;If anybody wants to say anything in this matter of the Caliphate, he should show up and not conceal himself, for we are more rightful to be a Caliph than he and his father.&#8221;<\/strong> On that, Habib bin Masalama said (to Ibn Umar), &#8220;Why don&#8217;t you reply to him (i.e. Mu&#8217;awiyah)?&#8221; <strong>`Abdullah bin `Umar said,<\/strong> &#8220;I untied my garment that was going round my back and legs while I was sitting and was about to say, <strong>&#8216;He who fought against you and against your father for the sake of Islam, is more rightful to be a Caliph.&#8217; But I was afraid that my statement might produce differences amongst the people and cause bloodshed, and my statement might be interpreted not as I intended. (So I kept quiet) remembering what Allah has prepared in the Gardens of Paradise (for those who are patient and prefer the Hereafter to this worldly life).&#8221; Habib said, &#8220;You did what kept you safe and secure (i.e. you were wise in doing so).<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">RTS then asks a flurry of questions in an attempt to cast doubt upon the intentions of Ibn Umar (ra) and Mu`awiyah (ra). The most important of which is that RTS understands from the narration that it implies that Mu`awiyah (ra) sees himself in a better light than Ibn Umar (ra) and his father. However, this is far from true, for there is no indication from what is narrated that Mu’awiyah (ra) was even aware of the presence of Ibn `Umar (ra). The only words that may indicate that he was aware of Ibn Umar (ra) being there are the words “more rightful in this matter than him and his father.” However, such a phrase is common in traditional Arabic when one challenges or dares, for the challenger would say, “I am a better poet than you and your father,” or “I am a better knight than you and your father.”<\/p>\n<p style=\"text-align: justify;\">Ibn `Umar did not agree with this statement, for he is aware of there being others who were greater than Mu`awiyah, who have accepted Islam before him and have fought the Makkans while he was from among them. This is indicated in the text itself.<\/p>\n<p style=\"text-align: justify;\">One of the important questions that RTS also asks is:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Does this narration not prove in itself that Mu&#8217;awiyah did not fight Imam Alee (a.s) to avenge the blood of Uthman ibn Affan but for the seat of leadership?<\/span><\/p>\n<p style=\"text-align: justify;\">The answer to that question is: No. If Mu`awiyah’s (ra) goal was leadership, he would have joined forces with the armies of Al-Jamal in order to reach his objective. However, he did not pick a fight with `Ali (ra), but rather, stood his ground, and was challenged by `Ali (ra) in Siffeen for refusing to pledge allegiance to him.<\/p>\n<p style=\"text-align: justify;\">It is also worth mentioning that RTS also quoted Ibn `Umar a few times, in an attempt to justify the concept of Taqiyyah. RTS asked:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Why was ibn Umar afraid to speak his mind?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">What was ibn Umar practicing when he concealed this matter?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Why did ibn Umar choose to remain silent on the issue and why isn&#8217;t the same rule applied for Alee (a.s) who did not oppose the usurpers? Was ibn Umar a coward?<\/span><\/p>\n<p style=\"text-align: justify;\">Ibn `Umar (ra), as the narration indicated, kept quiet to prevent causing a division, notice that Hafsa (ra) herself wished that he would head towards the gathering in order to prevent division. It would be counter-productive for him to cause what he initially set out to prevent. Furthermore, likening his situation to that of `Ali (ra) is an unfair comparison, for `Ali (ra), according to the Shias, is a divinely appointed Imam, who has no choice but to claim his right to rule. On the other hand, the ruling of Ibn `Umar (ra), even though it would have been preferred, since he was superior to Mu`awiyah (ra), is not obligatory, but simply preferred.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on Revisitingthesalaf.org entitled: Mu’awiyahs Testimony on the Khalifahs, which was published on the 6th of January, 2013, and can be found here. RTS starts off this article by quoting the following narration from Saheeh <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/06\/06\/response-to-muawiyahs-testimony-on-the-khalifahs\/\" title=\"Response to: Mu’awiyahs Testimony on the Khalifahs\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[20],"class_list":{"0":"post-448","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-muawiyah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/448","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=448"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/448\/revisions"}],"predecessor-version":[{"id":459,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/448\/revisions\/459"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=448"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=448"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=448"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}