{"id":4481,"date":"2019-01-20T23:44:05","date_gmt":"2019-01-20T23:44:05","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4481"},"modified":"2019-01-21T00:06:56","modified_gmt":"2019-01-21T00:06:56","slug":"10-reasons-why-you-should-not-trust-shia-hadith-sources","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/01\/20\/10-reasons-why-you-should-not-trust-shia-hadith-sources\/","title":{"rendered":"10 Reasons Why You Should Not Trust Shia Hadith Sources"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4481\" alt=\"\" \/><em>by Abu Al-Abbas Al-Shami<\/em><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">After engaging in Sunni-Shia polemics for a while, one eventually recognizes that most of the disagreement ultimately stems from one main factor: the relative independence of Sunni and Shi’ite primary historical sources. These independent primary sources present conflicting alternative narratives about various pivotal Islamic events, teachings and figures, ultimately leading to the rise of two drastically opposed Islamic traditions.<\/p>\n<p style=\"text-align: justify;\">Though much is to be said in this context, one thing must be made clear: <span style=\"text-decoration: underline;\"><em>ad hoc<\/em> dismissals of primary historical sources simply due to sectarian reasons is not an objective nor a sound approach to history.<\/span> This point applies to both Sunni and Shi’ite polemicists alike, who often dismiss each other’s sources simply due to the fact their authors come from an opposing school. Instead, a keen observer will recognize that both narratives cannot be valid at once and will thus search for various textual indicators to evaluate which tradition is historically superior to the other.<\/p>\n<p style=\"text-align: justify;\">Here are several reasons why we believe Sunni sources are historically superior to Shi’ite sources, and why Sunni sources are more authoritative primary sources when it comes to presenting and relaying the Prophet’s biography and teachings:<\/p>\n<h2 style=\"text-align: justify;\">1. Sunni Sources Predate Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">When evaluating primary historical sources, historians employ a rule known as the &#8220;Time and Place Rule”. This rule entails that historical sources that are closer in time and place to the event(s) they address are generally given precedence over later and more distant sources.<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“The closer a source is to the event which it purports to describe, the more one can trust it to give an accurate historical description of what really happened.” (Faye 121)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The reasoning behind this is self-evident: later sources and accounts suffer from an increased risk of corruption in their respective content. This corruption may simply be the result of unintended errors that occurred during the process of transmission, and it may be the result of malicious tampering with the reports.<\/p>\n<p style=\"text-align: justify;\">Sunni sources, in this aspect, are superior to Shi’i sources, since they are all much closer in time to the Prophet.<\/p>\n<p style=\"text-align: justify;\">Some of the earliest Sunni authors with <span style=\"text-decoration: underline;\">extant works<\/span>:<\/p>\n<ol>\n<li style=\"text-align: justify;\">Ma’mar b. Rashed (d. 153)<\/li>\n<li style=\"text-align: justify;\">Muhammad b. Ishaq (d. 151)<\/li>\n<li style=\"text-align: justify;\">Malek b. Anas (d. 179)<\/li>\n<li>Isma&#8217;il b. Ja&#8217;far Al-Ansari (d. 180)<\/li>\n<li>&#8216;Abdullah b. Al-Mubarak (d. 181)<\/li>\n<li style=\"text-align: justify;\">‘Abdurrazzaq Al-San’ani (d. 211)<\/li>\n<li>&#8216;Abdullah b. Al-Zubayr Al-Humaydi (d. 219)<\/li>\n<li style=\"text-align: justify;\">Sa’id b. Mansur (d. 227)<\/li>\n<li style=\"text-align: justify;\">Ali b. Al-Ja’d (d. 230)<\/li>\n<li style=\"text-align: justify;\">Muhammad b. Sa’d (d. 230)<\/li>\n<li style=\"text-align: justify;\">Abu Bakr b. Abi Shaybah (d. 235)<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">The earliest Shi’i authors with <span style=\"text-decoration: underline;\">extant works<\/span>:<\/p>\n<ol>\n<li style=\"text-align: justify;\">Ahmad b. Muhammad Al-Barqi (d. 274)<\/li>\n<li style=\"text-align: justify;\">Muhammad b. Al-Hassan Al-Saffar (d. 290)<\/li>\n<li style=\"text-align: justify;\">Muhammad b. Ya&#8217;qub Al-Kulayni (d. 329)<\/li>\n<li style=\"text-align: justify;\">Muhammad b. Ali, Ibn Babawayh Al-Qommi (d. 381)<\/li>\n<li style=\"text-align: justify;\">Muhammad b. Al-Hasan Al-Tusi (d. 460)<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">As evident, Shi’i sources tend to come much later than most Sunni sources. In fact, the earliest extant Sunni source, the Jami’ of Ma’mar, precedes the earliest major Shi’i collection by around 100 years. The time gap between the latest Sunni source listed and the latest Shi’i source listed is over 200 years!<\/p>\n<p style=\"text-align: justify;\">Later Sunni hadith collections, such as the Musnad of Ahmed (d. 241), Musnad of Al-Darimi (d. 255), Sahih of Al-Bukhari (d. 256), Sahih of Muslim (d. 261), and Al-Sunan by Abu Dawud (d. 275) predate most of the earlier Shi’i collections.<\/p>\n<p style=\"text-align: justify;\">Some Shi’ite polemicists attempt to appeal to some supposedly earlier Shi’ite hadith collections, known as the 400 Usul; however, there is no way to verify the veracity of these claims since most of these supposed sources are extinct. Similarly, the very few Usul that have survived till this day suffer from a <a href=\"http:\/\/www.twelvershia.net\/2015\/11\/28\/the-400-usool-in-shia-hadith\/\">variety of defects<\/a>, which severely undermine and diminish their historical value.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Note<\/span>: The first two Shi’ite authors mentioned authored relatively small works that mostly consist of traditions from the Imams related to their virtues and their opinions. They do not contain much from the Prophet nor do they really present anything from the Prophet’s biography. Thus, they are somewhat irrelevant. However, we decided to list them here for the sake of fairness. Otherwise, the list should actually start with Muhammad b. Ya&#8217;qub Al-Kulayni (d. 329), author of Al-Kafi.<\/p>\n<h2 style=\"text-align: justify;\">2. The Circular Reasoning Behind the Appeal to Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">Shi’ite apologists and polemicists often justify their primary sources by stating that they simply are obeying the supposed prophetic command to follow Ahlulbait. This appeal, however, is based on circular reasoning. This is because the “command to exclusively follow Ahlulbait” is a conclusion that is reached through Shi’ite primary sources themselves! Shi’ite polemicists end up citing this very same conclusion as a premise to their appeal to their sources.<\/p>\n<p style=\"text-align: justify;\">Their argument, when outlined in the form of a syllogism, is as follows:<\/p>\n<ul style=\"list-style-type: disc;\">\n<li style=\"text-align: justify;\">We are commanded to exclusively take our religion from Ahlulbait as per Shi’ite sources<\/li>\n<li style=\"text-align: justify;\">Shi’ite sources are based on transmission from Ahlulbait<\/li>\n<li style=\"text-align: justify;\">Therefore, Shi’ite sources are superior and more reliable sources on Islam<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The circular reasoning stems from the first premise, as it embodies the very same conclusion the polemicist is attempting to establish. The first premise, “We are commanded to exclusively take our religion from Ahlulbait,” is a conclusion that is reached through Shi’ite sources. Thus, the polemicist is already assuming the validity of Shi’ite sources, from which he derives this premise. As seen, the entire argument is based on its very same conclusion, which is evidently problematic.<\/p>\n<p style=\"text-align: justify;\">When faced with this reality, Shi’ite polemicists often attempt to appeal to reports in Sunni sources that supposedly support the first premise. These appeals are problematic for several reasons.<\/p>\n<ol>\n<li style=\"text-align: justify;\">They are usually based on extremely weak reports in Sunni sources. (e.g <a href=\"http:\/\/ghadirkhumm.com\/thaqalayn-critical-study\/\" rel=\"external nofollow\">Hadith Al-Thaqalayn<\/a>)<\/li>\n<li style=\"text-align: justify;\">These vague (and often weak) reports on the virtues of Ahlulbait do not substantiate the validity of Shi’ite primary sources, since Sunni sources also contain a vast array of reports from Ahlulbait. The claim that Shi’ite collections are the only historical sources that transmit from Ahlulbait is a flat-out lie.<\/li>\n<li style=\"text-align: justify;\">These appeals are based on a selective reading of Sunni texts, since a multitude of authentic reports in the Sunni corpus negate various elements of Shi’ite theology. Thus, Shi’ite polemicists will selectively read and cite Sunni sources while disregarding a plethora of other relevant reports.<\/li>\n<\/ol>\n<h2 style=\"text-align: justify;\">3. The False Dichotomy of “Ahlulbait vs. Sahabah”<\/h2>\n<p style=\"text-align: justify;\">When appealing to their primary sources, Shi’ite polemicists and scholars often appeal to the false dichotomy of &#8220;the Prophet’s Family vs. the Prophet’s Companions.” In this fallacious appeal, the disagreement between Sunnis and Shias is simply reduced to the supposed notion that Sunnis chose the Sahabah as the transmitters of the Prophet’s legacy while the Shia chose Ahlulbait.<\/p>\n<p style=\"text-align: justify;\">Aside from the fact that this notion is blatantly false, this dichotomy has no historical basis. The reality of the matter is that the companions of the Prophet ALONG with his family were key eye-witnesses to various events in the Prophet’s life, hence why the Sunni tradition does not draw this distinction in the first place.<\/p>\n<p style=\"text-align: justify;\">Sunni sources draw their material from all major eyewitnesses during the Prophet’s life, whether they be from his wives, relatives, neighbors, congregants, friends, and companions.<br \/>\nHere is an example of this false dichotomy being employed by Shi’ite polemicist and apologist, <a href=\"https:\/\/www.youtube.com\/watch?v=s7rr_krAdEY\" rel=\"external nofollow\">Ammar Nakshawani<\/a>:<br \/>\n<em>Timestamp: 6:01 – 6:28.<\/em><\/p>\n<p style=\"text-align: justify;\">This faulty approach to history leads to a new problem that faces Shi’ite sources&#8230;<\/p>\n<h2 style=\"text-align: justify;\">4. The Lack of Eyewitness Testimonies in Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">Eyewitness accounts are crucial when evaluating and studying the lives and teachings of historical figures. Historians, in fact, give precedence to eye-witness accounts over second-hand testimonies.<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">“An eyewitness is more reliable than testimony at second hand, which is more reliable than hearsay at further remove, and so on.” (Thurén)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Since Shi’ite scholarship dismisses the reliability of the Sahabah as transmitters of hadith (and thus, most eyewitness testimonies pertaining to the Prophet’s life), the Shi’ite tradition is primarily based on the sayings of the Imams. Out of the Twelve Imams, only three could be considered eye-witnesses to certain events from the Seerah; however, those three imams are rarely quoted in Shi’ite collections when compared to other imams.<\/p>\n<p style=\"text-align: justify;\">Rather, most Shi’ite traditions are ascribed to the 6th Shi’ite Imam, Ja’far Al-Sadeq (d. 148) and then the 5th Imam, Muhammad Al-Baqir (d. 118). These traditions mostly span their legal opinions, theological positions, behaviors, promises of reward\/punishment and virtues.<\/p>\n<p style=\"text-align: justify;\">To a historian, this is a problem. Ja’far Al-Sadeq was but a later historical figure that lived around a hundred years after the Prophet’s death. His opinions and sayings are definitely not equal in weight to those of primary eye-witnesses who saw and experienced many of the major events from the Prophet’s life. This problem directly leads to another problem that faces Shi’ite sources&#8230;<\/p>\n<h2 style=\"text-align: justify;\">5. The Shi’ite Tradition’s Inability to Present a Thorough Narrative on the Prophet’s Life<\/h2>\n<p style=\"text-align: justify;\">Since Shi’ite scholarship dismisses most eyewitness accounts pertaining to the Prophet’s life, Shi’ite sources simply are incapable of presenting a thorough and comprehensive narrative pertaining to the Prophet’s life. This is because Shi’ite sources are limited to only a handful of eyewitnesses, most importantly, the first three Imams. These three Imams, however, did not witness many of the key events alongside the Prophet.<\/p>\n<p style=\"text-align: justify;\">The first imam, Ali b. Abi Taleb, was but a 9-year old child when the Prophet began preaching Islam in Mecca. The second and third imams, Al-Hasan and Al-Husain, were only born in Medina after the Prophet’s immigration from Mecca, and they were both less than ten years-old when the Prophet died. Evidently, the first three imams of the Shia did not witness many of the major events in the Meccan period of Islam prior to the Prophet’s immigration from Mecca. Similarly, they did not witness ALL prophetic events from the Medinite period of Islam.<\/p>\n<p style=\"text-align: justify;\">This reality manifests in the lack of classical Shi’ite works on the Prophet’s biography, which are based on eye-witness accounts. Rather, contemporary Shi’ite works on the Seerah are primarily based on Sunni and other non-Shi’ite classical sources.<\/p>\n<p style=\"text-align: justify;\">This reality also manifests in a <a href=\"http:\/\/www.twelvershia.net\/2014\/06\/02\/prophetic-narrations-numbers-and-authenticity\/\">study<\/a> published by our friend, Hani Al-Tarabulsi, where he comprehensively went through Al-Kafi in search of Prophetic traditions. He concluded that only 14.86% of the book consists of Prophetic traditions. However, only around a third of those reports actually were authentic according to Shi’ite standards. Thus, only around 4.75% of Al-Kafi consists of reliable Prophetic traditions according to the Shia. This relatively minute number of Prophetic traditions is but an example of Twelver sources’ lack of material pertaining to the Prophet and his biography.<\/p>\n<h2 style=\"text-align: justify;\">6. The Lack of a Transparently Objective Methodology Behind the Evaluation of Transmitters in Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">When evaluating the reliability of transmitters in Twelver literature, Twelver scholarship primarily relies on the endorsements and verdicts of Al-Tusi (d. 460) and Al-Najashi (d. 450). Other authorities are occasionally relied upon in this context, such as Al-Mufid (d. 413) , ‘Ali b. Ibrahim Al-Qummi (d. 329), and Al-Kashi (d.350) etc.<\/p>\n<p style=\"text-align: justify;\">Little (if any) is known about the methodology behind their verdicts on the reliability of transmitters. These authors have not published works where they explain their methodologies behind their verdicts, nor do they ever provide their reasoning behind their individual conclusions. Thus, we cannot deem their conclusions reliable. In fact, we do not even know if the Shi’ite rijalists espoused a methodology in the first place due to the relative obscurity of their works. The implication of this issue is that the authentication of reports in Twelver sources may be totally arbitrary, and that the Shi’ite scholarship cannot objectively discern the authentic from the inauthentic in their sources.<\/p>\n<p style=\"text-align: justify;\">The Sunni muhaddithin, on the other hand, have done a great job in transparently outlining their methodology when evaluating the reliability of transmitters. On page 8 of “<a href=\"http:\/\/www.islamicdiscourseinitiative.com\/canon\/hadith\/in-defense-of-the-hadith-methodebook\/\" rel=\"external nofollow\">In Defense of the Hadith Method<\/a>”, our great friend, Abdullah Moataz presents a great example of a few of the transparently objective methods employed by the Sunni muhaddithin when evaluating the reliability of transmitters. This lack of a transparently objective methodology in Shi’ite sources manifests as another problem&#8230;<\/p>\n<h2 style=\"text-align: justify;\">7. The Inability to Dispel Bias from the Process of Authentication in Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">Due to the lack of a transparently objective methodology in Shi’ite biographical sources, it is not a surprise that the entire methodology may, in fact, be based on arbitrary theological biases upheld by Shi’ite authorities.<\/p>\n<p style=\"text-align: justify;\">Shi’ite Scholar of Hadith, Sayed Hossein Qazwini in his book, <em>Durus fi ‘Ilm Al-Rijal<\/em>, states that Al-Tusi and Al-Najashi often endorsed transmitters on a purely theological basis. He says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">They (Al-Tusi and Al-Najashi) would most often transmit the reports of a transmitter and then evaluate them based on their contents. If their contents were aligned with their theological positions, they (Al-Tusi &amp; Al-Najashi) would not weaken the transmitter. Otherwise, they would accuse him of weakness, deceit and<em> ghuluww<\/em>. (Qazwini 32)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">This is a catastrophe: the implications of Sayyed Hossein’s words are that Shi’ite authorities often weakened and dismissed transmitters simply because they transmitted reports that were not in-line with Shi’ite theology! However, the fact that a transmitter may have transmitted “non-Twelver” hadiths, has no actual implications on his honesty or reliability as a transmitter of historical reports. It has no actual implications on his memory or his retention. How can such a defective, openly biased and non-objective methodology be used to come to impartial historical conclusions?!<\/p>\n<h2 style=\"text-align: justify;\">8. The Significant Time-Gap Between Shi’ite Rijalists and Most Transmitters in Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">The two main Shi’ite authorities on <em>Rijal<\/em>, Al-Tusi (d. 460) and Al-Najashi (d. 450), did not witness or encounter most of the transmitters they endorsed\/condemned. The gap between them and the transmitters they often mentioned was often more than two centuries long. Shi’ite muhaddith, Grand Ayatollah Al-Khoei, thus held the position that Al-Tusi and Najashi did not issue verdicts based on their own judgement. Rather, he believed that they simply transmitted the endorsements\/condemnations from earlier sources that actually witnessed these transmitters.<\/p>\n<p style=\"text-align: justify;\">This appeal opens the door to a whole new problem: Al-Tusi and Al-Najashi did not list these hypothetical sources that relayed to them these verdicts on the reliability of transmitters. The historian is thus incapable of verifying the authenticity of these claims and verdicts.<\/p>\n<p style=\"text-align: justify;\">Shi’ite scholar of hadith, Asif Mohseni, presents this dilemma in his book, <em>Buhuth fi ‘Ilm Al-Rijal<\/em>. In it, he says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The problem is that their endorsements and condemnations of a transmitter, along with anything else they mention about the transmitters, come with a gap in time. However, they do not list the transmitters between them [till that period] for us to analyze whether they were reliable, weak or unknown transmitters. Accepting such time-lapsed approvals of transmitters is unjustified unless we are to give them the benefit of the doubt and assume that they [Najashi and Tusi] only transmitted from reliable transmitters without listing them. In that case, how can we accept their statements? Why don’t we ask about whom they transmitted [these endorsements] from? (Mohseni 58)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">When describing this problem, he says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">If anyone were to find me a solution to this dilemma, I would offer him a sum of money and I would be very thankful, for this dilemma makes <em>ilmur-Rijaal<\/em> an unreliable discipline from a logical and religious standpoint. (Mohseni 58)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">As clearly stated by Mohseni, this dilemma fundamentally undermines the core of Shi’ite Ilm Al-Rijaal. If no evidence is provided to show that Al-Tusi and Al-Najashi had relied on authentic chains that go all the way back to the transmitters in the 1st, 2nd, 3rd and 4th centuries when issuing their verdicts, then most (if not all) of their opinions on transmitters from these periods are quite unreliable. The entire process of authentication in Twelver hadith sources is potentially jeopardized as a result of this dilemma.<\/p>\n<h2 style=\"text-align: justify;\">9. The Arbitrary Endorsement of Forgers and Weak Transmitters in Shi’ite Sources<\/h2>\n<p style=\"text-align: justify;\">Points #6-8 ultimately manifest in this interesting phenomenon. With such a defective approach to <em>‘Ilm Al-Rijal<\/em> espoused by the Shia, it is not a surprise that Shi’ite biographical sources ended up endorsing a variety of forgers, liars and weak transmitters.<\/p>\n<p style=\"text-align: justify;\">Here are a few examples (out of 80 other examples I had found), where Shi’ite authorities declared known forgers, liars and weak transmitters to be reliable. Many of these transmitters are openly declared to be <em>‘Ammi<\/em> (Sunni) by Shi’ite authorities; thus, it cannot be said that Sunni sources simply weakened them due to a supposed sectarian bias.<\/p>\n<p style=\"text-align: justify;\">I shall list the name of the transmitter in question, and I shall then list the verdicts of the Sunni critics followed by the verdicts of the Shi’ite critics:<\/p>\n<h3 style=\"text-align: justify;\">1. Asram b. Hawshab<\/h3>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Sunni Authorities:<\/span><\/p>\n<ul>\n<li style=\"text-align: justify;\">Yahya b. Ma’in (d. 233) said: “He was a vile liar.” (Ibn Hajar 1\/461)<\/li>\n<li style=\"text-align: justify;\">Al-Bukhari (d. 256), Muslim (d. 261), Abu Hatem Al-Razi (d. 277) and Al-Nasa’i (d. 303) said: “He is abandoned (<em>matruk<\/em>) in hadith.” (Ibn Hajar 461-462)<\/li>\n<li style=\"text-align: justify;\">Al-Jawzajani (d. 259) said: “I transcribed hadith from him in Hamadan in 202, and he was weak.” (Ibn Hajar 1\/461)<\/li>\n<li style=\"text-align: justify;\">Ibn Hibban (d. 354) said: “He used to fabricate hadiths and ascribe them to reliable transmitters.” (Ibn Hajar 1\/461)<\/li>\n<li style=\"text-align: justify;\">Al-Daraqutni (d. 385) said: “He is disapproved (<em>munkar<\/em>) in his hadith.” (Ibn Hajar 1\/461)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Shia Authorities:<\/span><\/p>\n<ul>\n<li style=\"text-align: justify;\">Al-Najashi (d. 450) said: “He was a reliable <em>‘Ammi<\/em> (Sunni) who transmitted a transcript from Abu ‘Abdillah.” (Al-Khoei 4\/136)<\/li>\n<\/ul>\n<h3 style=\"text-align: justify;\">2. Isma’il b. Abi Ziyad Al-Sukuni<\/h3>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Sunni Authorities:<\/span><\/p>\n<ul>\n<li style=\"text-align: justify;\">Al-Daraqutni (d. 385) said: “He is abandoned (<em>matruk<\/em>) in hadith.” (Ibn Hajar 1\/406)<\/li>\n<li style=\"text-align: justify;\">Al-Khalili said (d. 446): “He is a weak sheikh who is not well-known.” (Ibn Hajar 1\/406)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Shi’ite Authorities:<\/span><\/p>\n<ul>\n<li style=\"text-align: justify;\">Al-Tusi (d. 460) said: “The sect has acted upon the reports transmitted by Hafs b. Ghiyath, Nuh b. Darraj, Ghiyath b. Kalub, and <span style=\"text-decoration: underline;\">Al-Sukuni.<\/span>” (Al-Tusi 1\/149)<\/li>\n<li style=\"text-align: justify;\">Al-Jawaheri said: “He was from the transmitters of the <em>‘Ammah<\/em> (Ahlussunnah). He transmitted 61 reports, all from Abu ‘Abdillah, asides from one instance. He was reliable (<em>thiqah<\/em>).” (Al-Jawaheri 63)<\/li>\n<\/ul>\n<h3 style=\"text-align: justify;\">3. Al-Harith b. ‘Imran Al-Ja’fari<\/h3>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Sunni Authorities:<\/span><\/p>\n<ul>\n<li style=\"text-align: justify;\">Abu Zur’ah Al-Razi (d.) said: “He is weak in hadith, extremely weak (<em>wahi<\/em>)” (Ibn Abi Hatem 3\/79)<\/li>\n<li style=\"text-align: justify;\">Abu Hatem Al-Razi (d. 277) said: “He is weak in hadith.” (Ibn Abi Hatem 3\/79)<\/li>\n<li style=\"text-align: justify;\">Ibn Hibban (d. 354) said: “He used to fabricate hadiths and ascribe them to reliable transmitters.” (Ibn Hibban 1\/225)<\/li>\n<li style=\"text-align: justify;\">Al-Daraqutni said: “He is an abandoned Kufan.” (Al-Burqani 24)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">Shi’ite Authorities:<\/p>\n<ul>\n<li style=\"text-align: justify;\">Al-Najashi said: “He is a reliable Kufan. He transmitted from Ja’far b. Muhammad [Al-Sadeq]” (Al-Khoei 5\/176)<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">In these few examples, we get a glimpse of the dire state of Shi’te biographical sources. Many similar forgers and weak transmitters were declared to be reliable by Shi’ite authorities. The reader, however, may ask: How do we know that the Sunni critics’ verdicts are more accurate and reliable than the Shi’ite verdicts?<\/p>\n<p style=\"text-align: justify;\">The answer to that question lies in several points:<\/p>\n<ol>\n<li style=\"text-align: justify;\">The Sunni critics’ verdicts predate the Shi’ite verdicts, which means that the Sunni critics had greater proximity and access to these transmitters than the later Shi’ite authorities. This reality can be demonstrated in the first example given: Al-Jawzajani stated that he met Asram b. Hawshab and transcribed hadiths from him, yet he concluded that he was weak. Al-Najashi, the Shi’ite, who came two centuries later, never met him, however, randomly declared him to be reliable. (The year of death of each critic was added to his name to specifically demonstrate this point.)<\/li>\n<li style=\"text-align: justify;\">The Sunni critics’ verdicts are corroborated. As seen, multiple independent Sunni authorities are often in agreement regarding the status of the transmitter reinforcing that opinion, while Shi’ite sources are often limited to the individual endorsements of Al-Tusi and\/or Al-Najashi. When a Sunni authority errs in his judgement, we can identify that mistake due to the abundance of other verdicts from other authorities. The same, however, often cannot be said about Shi’ite verdicts for the reason mentioned above.<\/li>\n<li style=\"text-align: justify;\">The methodology of the Sunni hadith critics is known, while the methodology behind Al-Tusi&#8217;s and Al-Najashi’s conclusions is obscure and unknown.<\/li>\n<li style=\"text-align: justify;\">Shi’ite polemicists cannot claim that the Sunni critics weakened these transmitters on a sectarian basis, since two-thirds of the transmitters I have listed were declared to be Sunnis in Shi’ite sources. In fact, some of these transmitters listed above transmitted reports that support Sunni theology in Sunni sources! Asram b. Hawshab, for example, transmits a report demonstrating the virtues of Abu Bakr, ‘Umar and ‘Ali (Al-Tabarani 37), yet he was still declared to be a forger by Sunni scholarship!<\/li>\n<\/ol>\n<p style=\"text-align: justify;\">These arguments apply to almost every single instance where Shi’ite authorities endorsed transmitters that were criticized and condemned by the Sunni hadith critics. Nevertheless, this phenomenon merely demonstrates the arbitrary nature of authentication in Shi’ite sources along with the disastrous conclusions that result from this methodology.<\/p>\n<h2 style=\"text-align: justify;\">10. The Substantive Evidence That Major Shi’ite Authorities in Hadith Tampered with Reports<\/h2>\n<p style=\"text-align: justify;\">Substantive evidence exists to suggest (and even prove) that several major Shi’ite hadith authorities tampered with reports. The reliability of their works is thus immediately dismissed and put into question.<\/p>\n<p style=\"text-align: justify;\">Our friend, Farid Al-Bahraini, has published a <a href=\"http:\/\/www.twelvershia.net\/sdm_downloads\/the-distortions-of-al-saduq\/\">study<\/a> where he outlines around forty examples where the grand Shi’ite muhaddith, Al-Shaykh Al-Saduq (d. 381), was caught tampering with reports due to various reasons. The implications of this study are grave: Al-Saduq authored many books, and tens of different hadith compilations. His book, <em>Man La Yahdhuruhu Al-Faqih<\/em>, is one of the four major hadith collections (<em>Al-Kutub Al-Arba’ah<\/em>). Thus, the indictment of this author would result in a loss of thousands of reports, upon which many elements of Shi’ite theology and jurisprudence are based.<\/p>\n<p style=\"text-align: justify;\">We have also identified an instance where Al-Kulayni, author of Al-Kafi, <a href=\"http:\/\/www.twelvershia.net\/2017\/11\/29\/al-kulayni-tampers-narration\/\">distorted and tampered<\/a> with a report in his book. There are other instances where Al-Kulayni was caught tampering with reports, and we shall share them in the near future; God willing.<\/p>\n<h2 style=\"text-align: justify;\">Conclusion<\/h2>\n<p style=\"text-align: justify;\">Some of these arguments, alone, are enough to question the reliability of a variety of Twelver sources. However, if we were to combine all these points into a single argument, we would have a powerful cumulative case to question, dismiss and reject the reliability of the Twelver hadith tradition. Thus, we shall conclude this paper by reminding you, O reader, of what the great tabi’i, Ibn Sirin, once said:<\/p>\n<p style=\"text-align: justify;\">“Indeed, this knowledge is religion, so be careful from whom you take your religion.”<\/p>\n<h3 style=\"text-align: center;\">Sources<\/h3>\n<p style=\"text-align: justify;\">Al-Burqani, Ahmed. <em>Su&#8217;alat Al-Burqani Lil-Daraqutni<\/em>. Edited by Abdulraheem Al-Qashqari, 1st ed., Kutub Khaneh Jamili, 1404.<br \/>\nAl-Jawaheri, Muhammad. <em>Al-Mufid Min Mo&#8217;jam Rijal Al-Hadith<\/em>. 2nd ed., vol. 1 1, Al-&#8216;Ilmiyyah, 1424.<br \/>\nAl-Khoei, Abu Al-Qasem. <em>Mo&#8217;jam Rijal Al-Hadith.<\/em> 5th ed., Markaz Nashr Al-Thaqafah Al-Islamiyyah, 1992.<br \/>\nAl-Tabarani, Sulayman. <em>Al-Mo&#8217;jam Al-Awsat.<\/em> Edited by Tareq Awadallah, vol. 8, Dar Al-Haramayn, 1995.<br \/>\nAl-Tusi, Muhammad. &#8216;<em>Uddat Al-Usul<\/em>. Edited by Muhammad Reza Al-Ansari , 1st ed., vol. 1 2, Sitarah, 1417.<br \/>\nFaye, Jan. <em>After Postmodernism, A Natural Reconstruction of the Humanities<\/em>. Vol. 1, Palgrave Macmillan, 2012.<br \/>\nIbn Abi Hatem, &#8216;<em>Abdurrahman. Al-Jarh Wal-Ta&#8217;dil.<\/em> 1st ed., vol. 3 9, Dar Ihyaa&#8217; Al-Turath Al-&#8216;Arabi, 1952.<br \/>\nIbn Hajar, Ahmed. <em>Lisan Al-Mizan<\/em>. 2nd ed., vol. 1 7, Dar Al-Ma&#8217;arif Al-Nizamiyyah, 1971.<br \/>\nIbn Hibban, Muhammad. <em>Al-Majruhin.<\/em> Edited by Mahmud Ibrahim Zayed, 1st ed., vol. 1 3, Dar Al-Wayy, 1396.<br \/>\nMohseni, Asif. <em>Buhuth Fi &#8216;Ilm Al-Rijal.<\/em> 5th ed., vol. 1 1, Markaz Al-Mustafa, 2010.<br \/>\nQazwini, Hossein. <em>Durus Fi &#8216;Ilm Al-Rijal<\/em>. 1st ed., vol. 1 1, &#8216;Alaa&#8217; Sa&#8217;id Al-Asadi, 2018.<br \/>\nThurén, Torsten. <em>Källkritik<\/em>. Vol. 1, Stockholm : Almqvist &amp; Wiksell, 1997.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>by Abu Al-Abbas Al-Shami &nbsp; After engaging in Sunni-Shia polemics for a while, one eventually recognizes that most of the disagreement ultimately stems from one main factor: the relative independence of Sunni and Shi’ite primary historical sources. These independent primary <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/01\/20\/10-reasons-why-you-should-not-trust-shia-hadith-sources\/\" title=\"10 Reasons Why You Should Not Trust Shia Hadith Sources\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-4481","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4481","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4481"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4481\/revisions"}],"predecessor-version":[{"id":4491,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4481\/revisions\/4491"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}