{"id":4503,"date":"2019-03-03T18:20:22","date_gmt":"2019-03-03T18:20:22","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4503"},"modified":"2019-03-03T18:58:16","modified_gmt":"2019-03-03T18:58:16","slug":"how-a-shiite-forger-was-caught-red-handed","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/03\/how-a-shiite-forger-was-caught-red-handed\/","title":{"rendered":"How a Shi&#8217;ite Forger Was Caught Red-Handed"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4503\" alt=\"\" \/>Evaluating examples of instances where forgers were identified and caught red-handed indeed is a very interesting endeavor. In such examples, one is exposed to the epitome of textual criticism and the meticulousness of Sunni scholarship with regards to the transmission of hadith. The examples become even more fascinating when the hadith critics provide a story and\/or the context behind their verdicts, which allows us to fully grasp their reasoning.<\/p>\n<p>Around a year ago, I came across a very interesting example of this phenomenon. It involved a 4th century Shi&#8217;ite transmitter known as Muhammad b. Muhammad b. Al-Ash&#8217;ath. Muhammad was a Kufan transmitter who eventually settled in Egypt in the vicinity known as <em>Saqifat Jawad<\/em>. The hadith critic, Al-Daraqutni (d. 385) described him saying: &#8220;He was a wonder among Allah’s wonders. He fabricated that book, <em>Al-‘Alawiyyat.<\/em>&#8221; (Al-Sahmi 101)<\/p>\n<p>Though Al-Daraqutni&#8217;s statement is sufficient and insightful, it does not provide much context behind his verdict. Fortunately, however, another notable hadith critic witnessed and documented the entire story behind Muhammad&#8217;s exposé. This critic, in fact, was a direct student of Muhammad b. Muhammad b. Al-Ash&#8217;ath.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>How the Forger was Identified<\/strong><\/span><\/p>\n<p>In his book, <em>Al-Kamil fi Du&#8217;afaa&#8217; Al-Rijal<\/em>, the 4th century hadith critic, Ibn &#8216;Adiyy (d. 365) relayed his own account regarding the forger in question today. He said:<\/p>\n<blockquote><p>I transcribed hadith from him. His staunchness in Shi’ism led him to disseminate a transcription that consisted of around 1000 reports transmitted from Musa b. Isma’il b. Musa b. Ja’far, from his father, from his grandfather, from his fathers, with a soft handwriting and new parchment. Most of it consisted of disapproved reports (مناكير).<\/p>\n<p>We then brought this up to Al-Husain b. ‘Ali b. Al-Husain b. ‘Umar b. ‘Ali b. Al-Husain Al-‘Alawi, the <em>sheikh<\/em> of Ahlulbait in Egypt. He stated that Musa was his neighbor in the city for 40 years and that he never mentioned that he had transmission from his father or anyone else. (Ibn &#8216;Adiyy 7\/565)<\/p><\/blockquote>\n<p>Ibn &#8216;Adiyy then concluded his entry saying:<\/p>\n<blockquote><p>I have copied this book from him, and it consists of around 1000 hadiths written in soft handwriting. I have copied most of it from him  along with these hadiths and other disapproved reports in this book. It contains some reports that match the contents of the reports of truthful transmitters, and he was suspected of fabricating this book. I did not find an <em>Asl<\/em> for him in this book. He used to simply present it to us in soft handwriting and new parchment. (Ibn &#8216;Adiyy 7\/567)<\/p><\/blockquote>\n<p>In Muhammad&#8217;s biographical entry, Ibn &#8216;Adiyy listed some of the preposterous forgeries he observed in the book, which clearly are fabricated Prophetic traditions.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>What Happened?<\/strong><\/span><\/p>\n<p>I&#8217;d like to take this opportunity to dissect Ibn &#8216;Adiyy&#8217;s account and direct the reader to the subtle and explicit indicators this hadith critic appealed to when issuing his verdict.<\/p>\n<p>Ibn &#8216;Adiyy began his account by stating that he had actually transcribed hadith from Muhammad b. Muhammad b. Al-Ash&#8217;ath. This is a valuable piece of data, as we now know that Ibn &#8216;Adiyy knew him on a personal level and that he was acquainted with his practices in transmission. Ibn &#8216;Adiyy is not simply criticizing someone he knows nothing about. As a student and acquaintance of Muhammad, Ibn &#8216;Adiyy then made note of his staunch Shi&#8217;ite leanings. This too is a valuable bit of information, since it informs us of a motive and a bias this transmitter may have possessed in the context of hadith transmission.<\/p>\n<p>Ibn &#8216;Adiyy then mentioned that Muhammad&#8217;s staunch Shi&#8217;ite leanings led him to disseminate an entire book of 1000 hadiths he had allegedly transmitted from Musa b. Isma&#8217;il b. Musa b. Ja&#8217;far. Perhaps some context is needed to clarify this point: Musa b. Isma&#8217;il is an absolutely unknown and obscure transmitter in both the Sunni and Shi&#8217;ite traditions (Al-Jawaheri 624). It is indeed very bizarre that such an absolutely unknown figure would be a prolific transmitter of reports, since frequent transmission usually granted transmitters exposure to various authorities who would be able to identify them. The fact that Muhammad exclusively transmitted 1000 reports from this obscure and allegedly prolific transmitter is a major red flag.<\/p>\n<p>Another notable point is that the obscure Musa b. Isma&#8217;il was the grandson of the 7th Shi&#8217;ite imam, Musa b. Ja&#8217;far, and the great-great-grandson of the 6th imam, Ja&#8217;far Al-Sadeq. Muhammad b. Muhammad b. Al-Ash&#8217;ath ascribed the reports in his book to Musa b. Isma&#8217;il → Isma&#8217;il b. Musa → Musa b. Ja&#8217;far → Ja&#8217;far Al-Sadeq. We are aware of Muhammad&#8217;s theological leanings, which would entice him to ascribe reports to the following figures. We can thus conclude that Muhammad&#8217;s transmission in his book is in-line with any theological motive he may have possessed in that context.<\/p>\n<p>More than once, Ibn &#8216;Adiyy made note of the fact that Muhammad&#8217;s book was written on new parchment. This, in light of the other indicators, is another red flag. It means that the text was only recently written, and that the transcription was not an aged document which had been preserved by Muhamamd years after his transmission from Musa b. Isma&#8217;il. Ibn &#8216;Adiyy similarly made note of the fact that the reports in the book are bizarre and disapproved traditions (مناكير).<\/p>\n<p>These major red-flags (rightfully) were enough of a reason to arouse suspicion in Ibn &#8216;Adiyy. Since Muhammad had exclusively ascribed ~1000 reports to Isma&#8217;il b. Musa, Ibn &#8216;Adiyy consulted a member of Isma&#8217;il b. Musa&#8217;s household: Al-Husain b. ‘Ali Al-‘Alawi, the <em>sheikh<\/em> of Ahlulbait in Egypt at the time. Al-Husain b. &#8216;Ali confirmed Ibn &#8216;Adiyy&#8217;s suspicions: he was Musa b. Isma&#8217;il&#8217;s neighbor for over 40 years, yet he never heard him transmitting anything from his father or anyone else!<\/p>\n<p>At that stage, it became apparent that Muhammad b. Muhammad b. Al-Ash&#8217;ath was a forger who had fabricated the entire book and ascribed its contents to Isma&#8217;il b. Musa. It probably was easier for him to ascribe the book to an obscure figure, like Isma&#8217;il, since ascribing it to a more eminent figure of many students would have probably lead to his immediate exposé.<\/p>\n<p>Note: Ibn &#8216;Adiyy importantly noted that some of the contents in the book were taken from the reports of truthful transmitters and then arbitrarily ascribed to Muhammad&#8217;s chain of transmission. Thus, the fact that some of the reports in Muhammad&#8217;s book may be found in other sources does not absolve him from the forgery of this book.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>The Blunder of Shi&#8217;ite Biographical Sources<\/strong><\/span><\/p>\n<p>Muhammad&#8217;s own student, Ibn &#8216;Adiyy (d. 365), assessed a variety of significant textual indicators  and thus accused Muhammad of forging the book. The great hadith critic, Al-Daraqutni (d. 385), similarly concluded that he was behind its forgery. What is surprising, however, is that later Shi&#8217;ite biographical sources ended up endorsing the reliability of Muhammad b. Muhammad b. Al-Ash&#8217;ath!<\/p>\n<p>Al-Najashi (d. 450) described him saying:<\/p>\n<blockquote><p>He is reliable and among our companions in Egypt. He authored <em>Kitab Al-Hajj<\/em>. In it, he mentioned the reports the <em>&#8216;Ammah<\/em> (Sunnis) transmitted from Ja&#8217;far b. Muhammad regarding Hajj. (Al-Khoei 18\/200)<\/p><\/blockquote>\n<p>Al-Tusi (d. 460) described him saying:<\/p>\n<blockquote><p>He is nicknamed Abu &#8216;Ali, and his residence was in Egypt in <em>Saqifat Jawad. <\/em><span style=\"text-decoration: underline;\">He transmitted a transcription from Musa b. Isma&#8217;il b. Musa b. Ja&#8217;far, from his father: Isma&#8217;il b. Musa b. Ja&#8217;far, from his father: Musa b. Ja&#8217;far (as). <\/span>(Al-Khoei 18\/200)<\/p><\/blockquote>\n<p><span style=\"font-size: 18pt;\"><strong>Conclusion<\/strong><\/span><\/p>\n<p>In conclusion, we have Muhammad&#8217;s own contemporaries meticulously evaluating his transmission and concluding that he cannot be relied upon. More than one hundred years later, Shi&#8217;ite authorities who never met Muhammad mysteriously (and ambiguously) concluded that he was a reliable transmitter! It is evident, however, that Muhammad is a problematic transmitter (to say the least). Ibn &#8216;Adiyy&#8217;s account gives the reader a brief glimpse into the critical methods espoused by the competent hadith critics of the past.<\/p>\n<p>Indeed this example is but another reason to cast doubts upon the reliability of Shi&#8217;ite biographical (<em>rijali<\/em>) sources and their respective verdicts. What is further damning is that this forged waste of paper has survived till this day, and it has been printed and circulated in some Shi&#8217;ite circles as a valid primary source. The book is now referred to as الأشعثيات or الجعفريات.<\/p>\n<p><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ashath.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4528\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ashath.jpg\" alt=\"\" width=\"400\" height=\"600\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ashath.jpg 400w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ashath-200x300.jpg 200w\" sizes=\"auto, (max-width: 400px) 100vw, 400px\" \/><\/a><\/p>\n<p>I have amassed a list of analogous instances where Shi&#8217;ite sources have endorsed known liars, forgers, and weak transmitters, and perhaps I shall publish it here soon, God willing.<\/p>\n<p>And Allah is the best of witnesses.<\/p>\n<p style=\"text-align: center;\"><span style=\"font-size: 14pt;\"><strong><span style=\"text-decoration: underline;\">Sources<\/span><\/strong><\/span><\/p>\n<p>Al-Jawaheri, Muhammad. <em>Al-Mufid Min Mo’jam Rijal Al-Hadith<\/em>. 2nd ed., vol. 1 1, Al-‘Ilmiyyah, 1424.<\/p>\n<p>Al-Khoei, Abu Al-Qasem. <em>Mo’jam Rijal Al-Hadith<\/em>. 5th ed., Markaz Nashr Al-Thaqafah Al-Islamiyyah, 1992.<\/p>\n<p>Al-Sahmi, Hamza. <em>Su&#8217;alat Hamzah lil-Daraqutni<\/em>. Edited by Muwaffaq Abdulqader, 1st ed., Maktabat Al-Ma&#8217;arif, 1984.<\/p>\n<p>Ibn &#8216;Adiyy, Abu Ahmed. <em>Al-Kamil fi Du&#8217;afaa Al-Rijal<\/em>. Edited by Adel Ahmed Abdulmawjud et <em>al<\/em>., 1st ed., Dar Al-Kutub Al-&#8216;Ilmiyyah, 1997.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Evaluating examples of instances where forgers were identified and caught red-handed indeed is a very interesting endeavor. In such examples, one is exposed to the epitome of textual criticism and the meticulousness of Sunni scholarship with regards to the transmission <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/03\/how-a-shiite-forger-was-caught-red-handed\/\" title=\"How a Shi&#8217;ite Forger Was Caught Red-Handed\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[65,66],"class_list":{"0":"post-4503","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-hadith","9":"tag-rijal"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4503","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4503"}],"version-history":[{"count":25,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4503\/revisions"}],"predecessor-version":[{"id":4529,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4503\/revisions\/4529"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4503"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4503"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4503"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}