{"id":453,"date":"2013-06-07T21:55:06","date_gmt":"2013-06-07T21:55:06","guid":{"rendered":"http:\/\/twelvershia.net\/?p=453"},"modified":"2015-10-19T19:59:14","modified_gmt":"2015-10-19T19:59:14","slug":"response-to-rafidi-companion-of-the-prophet-saw","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/06\/07\/response-to-rafidi-companion-of-the-prophet-saw\/","title":{"rendered":"Response to: Rafidi Companion Of The Prophet (saw)."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=453\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><b>The following is a response to the article on Revisitingthesalaf.org entitled: Rafidi Companion Of The Prophet (saw), which was published on the 15th of August, 2012, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/08\/the-rawafid-companion-of-prophet-saw.html\" rel=\"external nofollow\">here.<\/a><\/b><\/p>\n<p style=\"text-align: justify;\">RTS starts off by telling us that Abu al-Tufayl (ra) was an eight year old kid when the Prophet (SAWS) died, he lived eight years during the life of the Prophet (SAWS) and died in 100 or 107 AH in Makkah.<\/p>\n<p style=\"text-align: justify;\">This would make him a companion because he saw the Prophet (SAWS), believed in him, and died upon Islam.<\/p>\n<p style=\"text-align: justify;\">RTS intends to prove that this companion is an Imami Rafidhi Shia like the ones in our days, and that he believes in al-Raj`ah or the return of `Ali (ra) after his death.<\/p>\n<p style=\"text-align: justify;\">We can give this a quick short answer or a long one, we will begin with the short answer:<\/p>\n<p style=\"text-align: justify;\">-Abu al-Tufayl is not a major Companion and he was a small kid at the time and he himself says he only saw the messenger (saw) but never spoke to him in his life as is recorded in Mawsu`at Aqwal al-Imam Ahmad:<\/p>\n<p style=\"text-align: justify;\">وقال عبد الله: حدثني أبي. قال: حدثنا أبو سعيد مولى بني هاشم. قال: حدثني مهدي بن عمران المازني. قال: سمعت أبا الطفيل، وسئل هل رأيت رسول الله &#8211; صلى الله عليه وسلم -؟ قال: نعم، قيل: فهل كلمته؟ قال: لا<\/p>\n<p style=\"text-align: justify;\">-It is correctly narrated from abu al-Tufayl such as in al-Adab al-Mufrad that he did not believe that the Prophet (saw) gave `Ali ibn abi Talib any special or secret knowledge and that `Ali knows what everyone else knows:<\/p>\n<p style=\"text-align: justify;\">عن أبي الطفيل قال: سئل علي: هل خصكم النبي صلى الله عليه وسلم بشيء لم يخص به الناس كافة؟ قال: ما خصنا رسول الله صلى الله عليه وسلم بشيء لم يخص به الناس<\/p>\n<p style=\"text-align: justify;\">-Abu al-Tufayl although he was from `Ali&#8217;s companions yet he never believed that knowledge can only be attained through him, he has narrated much from other Companions such as Mu`adh, Hudhayfah, Ibn Mas`oud and the rest, refer to Tahdheeb al-Kamal for a list.<\/p>\n<p style=\"text-align: justify;\">-He narrated the virtues of the ten promised heaven and he started it with Abu Bakr and `Umar as recorded in al-Tabarani&#8217;s Mu`jam al-Awsat and al-Kabir, he even narrates abu Hurayrah&#8217;s virtue in Musnad abi Ya`la:<\/p>\n<p style=\"text-align: justify;\">حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْخُزَاعِيُّ الأَصْبَهَانِيُّ، قَالَ: نا مُحَمَّدُ بْنُ بُكَيْرٍ الْحَضْرَمِيُّ، قَالَ: نا ثَابِتُ بْنُ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ بْنِ جُمَيْعٍ الْقُرَشِيُّ، قَالَ: حَدَّثَنِي أَبِي، عَنْ أَبِي الطُّفَيْلِ، عَنْ سَعِيدِ بْنِ زَيْدٍ وَكَانَ بَدْرِيًّا، أَنَّهُ كَانَ جَالِسًا مَعَ الْمُغِيرَةِ بْنِ شُعْبَةَ، فَجَاءَ رَجُلٌ فَتَنَاوَلَ عَلِيًّا، فَغَضِبَ سَعِيدٌ، وَقَالَ: يُتَنَاوَلُ أَصْحَابُ رَسُولِ اللَّهِ عِنْدِكَ؟ فَأَشْهَدُ أَنَّ أَبَا بَكْرٍ فِي الْجَنَّةِ، وَأَنَّ عُمَرَ فِي الْجَنَّةِ، وَأَنَّ عُثْمَانَ فِي الْجَنَّةِ، وَأَنَّ عَلِيًّا فِي الْجَنَّةِ، وَأَنَّ طَلْحَةَ فِي الْجَنَّةِ، وَأَنَّ الزُّبَيْرَ فِي الْجَنَّةِ، وَأَنَّ سَعْدًا فِي الْجَنَّةِ، وَأَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فِي الْجَنَّةِ، وَلَوْ شِئْتَ أَنْ أُسَمِّيَ التَّاسِعَ لَسَمَّيْتُهُ<\/p>\n<p style=\"text-align: justify;\">-The classical Shia scholars themselves believe he was misguided since they labeled him as a Kaysani and the Kaysaniyyah are a sect who believed that the Imams were only four and the fourth is Muhammad ibn al-Hanafiyyah and he was the Mahdi according to them and he was in Ghaybah. Al-Majlisi said that al-Kashshi narrated with an authentic Shia chain that abu al-Tufayl was from the Kaysaniyyah in Mir&#8217;at ul `Uqoul vol.6 pg.217-218:<\/p>\n<p style=\"text-align: justify;\">وروى الكشي بسند صحيح أنه كان كيسانيا وأبوالطفيل‏ اسمه عامر بن واثلة، قال الشيخ في الرجال: أدرك ثمان سنين من حياة النبي صلى الله عليه و آله ولد عام أحد، و أدرك علي بن الحسين أيضا، و قال الكشي: كان عامر بن واثلة كيسانيا ممن يقول بحياة محمد بن الحنفية<\/p>\n<p style=\"text-align: justify;\">In Summary, the Shiites wanted us to believe that there was a Companion of Rasul-Allah (saw) who shared the same beliefs they did. What we concluded from the few paragraphs above is:<\/p>\n<p style=\"text-align: justify;\">Abu al-Tufayl was not a major Companion nor did he have a special rank among the Companions, he never even spoke to the Messenger (saw). He does not believe `Ali had any secret or special knowledge as opposed to the Shia of our days who believe this, he regularly went and sought knowledge from other Companions and narrated it during `Ali&#8217;s life without paying any attention to the Shiite belief in `Ali&#8217;s infallibility, he narrated virtues for Abu Bakr, `Umar, `Uthman and the rest of the ten promised heaven as well as virtues for other Companions such as abu Hurayrah, in other words he was not a Rafidi as that would mean that he hates Abu Bakr and `Umar, he even narrated and took knowledge from `Umar ibn al-Khattab something the Rafidah would never do.<\/p>\n<p style=\"text-align: justify;\">What is more ridiculous, is that bringing this topic up will show that the Twelver sect of the Shia is misguided, for they narrate that the man was a Kaysani, meaning he lived for about 85 years alongside `Ali, Hasan and Husayn yet he never heard them mention anything about twelve Imams nor the names of these Imams, which is why according to them he believed that Muhammad ibn al-Hanafiyyah was the Mahdi and he is in Ghaybah, he ignored the children of al-Husayn completely.<\/p>\n<p style=\"text-align: justify;\">Now for a longer answer:<\/p>\n<p style=\"text-align: justify;\">RTS quotes a narration which took place during the Fitnah in the Khilafah of `Ali ibn abi Talib (ra), `Ali (ra) stands in al-Rahbah (in Kufa) on the Mimbar and repeats the narration of Ghadeer, he reminds the people of his virtue by saying:<\/p>\n<blockquote><p>&#8220;I adjure in the name of Allah every Muslim who heard what the Messenger of Allah (saw) had said on the Day of Ghadeer Khum to state his testimony.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Twelve companions who are said to be from the people of Badr testified that they heard the messenger (SAWS) say on the day of Ghadeer:<\/p>\n<blockquote><p>&#8220;Am I not more worthy than the believers than themselves and my wives are their mothers? Then I am the Mawla of whosoever `Ali is his Mawla, may Allah befriend those who befriend him and be hostile to his enemies.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This narration is no different than the average narration of Ghadeer Khum which we discussed countless times with the Shia as the dear readers know. RTS and the Shia insist on translating the word &#8220;Mawla&#8221; as political leader, while Ahlul-Sunnah and `Ali (ra) and the companions (ra) all understood Muwalat as friendship and support and love, and this is the correct and popular meaning of Muwalat.<\/p>\n<p style=\"text-align: justify;\">This is why Allah says in the Qur&#8217;an:<\/p>\n<blockquote><p>{No Mawla will benefit his Malwa on the Day of Judgment.}<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Does this mean that “no leader will benefit his leader on the Day of Judgment”? Surely this makes no sense. Rather, we see in this verse of the Qur&#8217;an that Allah refers to two people and calls both to be Mawla; if Mawla were to mean leader, then only one of them could be the leader of the other. But if Mawla means beloved friend, then indeed they could be Awliya&#8217; of each other and it would be linguistically correct to refer to both of them as Mawla as Allah does in the Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">The next thing RTS does is that he quotes this same event that took place in al-Rahbah from the narration of the young companion abu al-Tufayl (ra):<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated by Al-Buzar and Ahmad, and his narrators are authentic, other than in the case of Fitar son of Khaleefa, who is considered reliable, from Aboo Al-Tufayl’s testimony: &#8220;Alee gathered the people and said to them: &#8220;I call to all the Muslims to bear witness that they heard the Messenger of Allah (saw) saying on the day of Ghadeer Khumm what he (is said to have) said.&#8221; When he stood up, 30 men from among the people came to him (in affirmation of his claim) Aboo Na&#8217;eem said: &#8216;A lot of people stood up and looked on when he raised his hand&#8217;. &#8220;Do you know that I am the first and foremost over the believers than themselves?&#8221; They said: &#8220;Yes! O Messenger of Allah! (saw).” He continued: &#8220;If I were to be your Master, then he is your Master; O Allah befriend whoever befriends him, and be an enemy to who seeks enmity against him.&#8221; He (Aboo Tufayl) said: I went out as if there was something inside me,  until I encountered Zaid son of Arqam and said to him: &#8220;I heard Alee (r.a) saying so and so, he said to me: &#8220;Don&#8217;t refuse it! For I (too) heard the Messenger of Allah (swt) saying that.&#8221;<\/span><\/p>\n<p><span style=\"color: #ff0000;\">Source: Majma&#8217; Al-Zawa&#8217;id Wa Manba&#8217; Al-Fawa&#8217;id. Vol. 9, H # 14612, Pg. # 129 &#8211; 130.<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">Notice in the tail of that narration, abu al-Tufayl says:<\/p>\n<blockquote><p>&#8220;I went out as if there was something inside me.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Meaning he was thinking, he had heard something new, now RTS tries to imply by this that abu al-Tufayl learned the hidden truth of `Ali&#8217;s (ra) Imamah. This however is not stated in the narration, it&#8217;s just what RTS understood from it, RTS claims:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">That moment engendered a realisation in Aboo Tufayl (r.a) of such a profound nature that it might be called an epiphany and yet be much more than the word implies. In fact, that very moment was pivotal in his immediate and unhesitating transition to becoming a Shi&#8217;ee of Alee ibn Abi Taalib (a.s). It was at that moment that the truth of the status of Alee (a.s) dawned upon him without any doubt, and he resolved to make his allegiance to Alee (a.s) clear.<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">What abu al-Tufayl (ra) was most probably thinking of is:<\/p>\n<p style=\"text-align: justify;\">&#8220;If the Prophet (SAWS) ordered us to love and support `Ali (ra), then how come a team of the Muslims is fighting against him?&#8221;<\/p>\n<p style=\"text-align: justify;\">So abu al-Tufayl (ra) tried to verify this from one of the older senior companions Zayd ibn Arqam (ra), and Zayd said:<\/p>\n<blockquote><p>فما تنكر<\/p><\/blockquote>\n<p style=\"text-align: justify;\">And RTS translated it as:<\/p>\n<blockquote><p><span style=\"color: #ff0000;\">&#8220;Don&#8217;t refuse it!&#8221;<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">Although in Arabic this expression means:<\/p>\n<blockquote><p>&#8220;Do you find anything wrong in this?&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Then Zayd (ra) reassures him that it is true by saying:<\/p>\n<blockquote><p>&#8220;I heard the messenger of Allah (SAWS) say it to him.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">In other words he&#8217;s asking him why he&#8217;s surprised to hear this, because it&#8217;s a known and popular event, there&#8217;s nothing wrong with this statement that he should be surprised.<\/p>\n<p style=\"text-align: justify;\">So it is exactly as Zayd (ra) said, all of Ahlul-Sunnah accept it, none of them reject it.<\/p>\n<p style=\"text-align: justify;\">It&#8217;s like RTS wants us to believe that Zayd (ra) was a Twelver Shia although in reality he isn&#8217;t, when Zayd (ra) narrated the Hadith of the two weighty things in Sahih Muslim he described the mothers of believers (ra) as being from Ahlul-Bayt, but then he said that the Ahlul-Bayt intended in the narration are:<\/p>\n<p style=\"text-align: justify;\"> -The family of `Abbas.<\/p>\n<p style=\"text-align: justify;\">-The family of `Ali.<\/p>\n<p style=\"text-align: justify;\">-The family of `Aqeel.<\/p>\n<p style=\"text-align: justify;\">-The family of Ja`far.<\/p>\n<p style=\"text-align: justify;\">We all know that this is not the understanding of the Twelver Rafidhi Shia nor is this their definition of  &#8220;Ahlul-Bayt&#8221; especially when it comes to the narration of the Thaqayalyn. Ahlul-Bayt for them are only the people of the cloak and the nine descendants of al-Husayn (ra).<\/p>\n<p style=\"text-align: justify;\">Also RTS says this narration was the reason for abu al-Tufayl becoming a Shia. This is not accurate as abu al-Tufayl (ra) was on the side of `Ali (ra) since the beginning, and every Muslim alive at the time who was on `Ali&#8217;s (ra) side was called &#8220;Shia of `Ali&#8221;, this does not mean &#8220;Twelver Shia&#8221;, it simply means any average regular Muslim who followed and supported `Ali (ra).<\/p>\n<p style=\"text-align: justify;\">Which is why RTS quotes al-Dhahabi&#8217;s words in abu al-Tufayl&#8217;s biography:<\/p>\n<blockquote><p><span style=\"color: #ff0000;\">&#8220;He was from the Shia of Imam `Ali.&#8221; Taken from Siyar al-A`lam al-Nubala&#8217;.<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">But if you check in al-Siyar vol.4 pg.120 you read:<\/p>\n<blockquote><p>ثم جئت شيعة بني أمية، فكلمتهم<\/p>\n<p>&#8220;Then I came to the Shia of bani Umayyah and I talked to them&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">And on vol.16 pg.125 of al-Siyar:<\/p>\n<blockquote><p>فقلت: لا تقل هذا فإن فيهم متفقهة وفضلاء ومتشيعة، فقال: شيعة معاوية ؟ قلت: لا والله، بل شيعة علي<\/p>\n<p>&#8220;I said: Do not say this, among them are jurists and virtuous men and Shia. He said: Shia of Mu`awiyah? I said: No by Allah, Shia of `Ali&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">As the reader knows, there is no religion called &#8220;Shia of Mu`awiyah&#8221; but they were only those who sided with him politically and supported his cause.<\/p>\n<p style=\"text-align: justify;\">I add that in al-Siyar 5\/374 al-Dhahabi states:<\/p>\n<blockquote><p>وكان الناس في الصدر الاول بعد وقعة صفين على أقسام: أهل سنة، وهم أولو العلم، وهم محبون للصحابة كافون عن الخوض فيما شجر بينهم، كسعد وابن عمر ومحمد بن مسلمة وأمم، ثم شيعة يتوالون وينالون ممن حاربوا عليا ويقولون: إنهم مسلمون بغاة ظلمة، ثم نواصب: وهم الذين حاربوا عليا يوم صفين، ويقرون بإسلام علي وسابقيه، ويقولون: خذل الخليفة عثمان.<\/p>\n<p>فما علمت في ذلك الزمان شيعيا كفر معاوية وحزبه، ولا ناصبيا كفر عليا وحزبه، بل دخلوا في سب وبغض، ثم صار اليوم شيعة زماننا يكفرون الصحابة، ويبرؤون منهم جهلا وعدوانا، ويتعدون إلى الصديق، قاتلهم الله.<\/p>\n<p>وأما نواصب وقتنا فقليل، وما علمت فيهم من يكفر عليا ولا صحابيا.<\/p>\n<p style=\"text-align: justify;\">[The people of the early times after the events of Siffeen were several groups: Ahlul-Sunnah, the people of knowledge, they love the companions and do not like to discuss the events that took place between them, like Sa`d and Ibn `Umar and Muhammad bin Maslamah and many others. Then Shi`ah, who abuse those who fought against `Ali and say: &#8220;They are Muslims and oppressors.&#8221; Then the Nawasib, they are those who fought `Ali at Siffeen, they believe in `Ali&#8217;s Islam and admit to his virtues, but they say: &#8220;He let-down Caliph `Uthman.&#8221;<\/p>\n<p style=\"text-align: justify;\">I do not know in that time of a Shi`ah who made Takfeer on Mu`awiyah and his party, nor a Nasibi who made Takfeer on `Ali and his party, they only held grudges against each other and abused one another. Today the Shi`ah of our time began making Takfeer on the companions out of ignorance and hatred, and they disowned them, they even exceeded this to al-Siddeeq, may Allah fight them.<\/p>\n<p>As for the Nawasib of our time, they aren&#8217;t many, I do not know that any of them who makes Takfeer on `Ali or any companion.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">RTS then quotes a narration from abu al-Tufayl (ra) against his own understanding of the Hadith, it shows that `Ali (ra) did not understand the term &#8220;Mawla&#8221; as political leader, he says:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Note, for example, the following narration once again on the authority of the Prophets (saw) companion Aboo Tufayl (r.a):<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Aboo Tufayl narrated: “A group of Al-Ansar including Aboo Ayoob Al Ansari passed by Imam Alee and said “Salam Alaikum our Mawla.” Then the Imam asked, “How can I be your Master when you are Arabs (Free not Slaves)?” They replied, “Because we heard the Prophet (saw) say on the day of Ghadeer, for whoever I am his Master then Alee is his Master.”<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">This narration above shows that if `Ali (ra) understood the term Mawla as political leader and acknowledged it as such, he would not have been surprised as to why the Ansar would call him their Mawla. `Ali (ra) understood the Muwalat as that of the ownership of slaves because it is one of the many meanings of the word &#8220;Mawla&#8221;, it also shows that `Ali (ra) wasn&#8217;t even used to someone calling him a Mawla. We seriously doubt that if the Prophet (saw) appointed him as leader that he&#8217;d forget it so easily or mis-understand what &#8220;Mawla&#8221; means, this narration only solidifies the interpretation of Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">RTS then quotes this narration from abu al-Tufayl (ra) and al-Hasan (ra):<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">14798 &#8211; Narrated Abil-Tufayl, who said [as follows]: ‘Hassan bin Alee bin Abi Taalib gave a sermon, he praised Allah (swt), and he mentioned the Commander of the faithful, Alee (r.a), the seal of the awsiyah, and the successor of the Prophets, and the [most] honest of the truthful and the martyrs.<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">This narration is weak as it was only narrated through Ma`rouf bin Khurboudh and Ibn Ma`een weakened him. It also has Salim ibn abi `Imarah in it, he is one of the writers of the Shia Usoul and is weak according to ibn Ma`een in Tahdheeb al-Kamal.<\/p>\n<p style=\"text-align: justify;\">Next, RTS quotes a Hadith in which `Ali (ra) says:<\/p>\n<blockquote><p> &#8220;Ask me before you lose me.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This narration shows that `Ali (ra) was knowledgeable, he would tell the people of Kufa to come and ask him since he was one of the few knowledgeable people left alive at the time, but while we&#8217;re on this topic we have a question for the extremist Shia who claim that the Imams inherit the knowledge from the Prophet (SAWS):<\/p>\n<p style=\"text-align: justify;\">Why did `Ali (ra) insist that people should ask him questions before they lose him, if after him were two other Imams which inherited knowledge from him and could answer these same questions of the people?<\/p>\n<p style=\"text-align: justify;\">All the people of knowledge would tell the Muslims to go and ask them questions and benefit from their knowledge, `Urwah ibn al-Zubayr (rah) would tell them:<\/p>\n<blockquote><p>حدثنا سفيان بن عيينة عن عمرو، قال: قال لنا عروة: إيتوني، فتلقوا مني<\/p>\n<p>[Suffiyan ibn `Uyaynah from `Amro, `Urwah would tell us: &#8220;Come to me, and take knowledge from me.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Source: Tareekh Yahya bin Ma&#8217;een 1\/103.<\/p>\n<p style=\"text-align: justify;\">Suffiyan al-Thawri used to say:<\/p>\n<blockquote><p>حدثنا عبد الرحمن نا أبو عبد الله الطهراني نا عبد الرزاق قال كان الثوري يقول: سلوني عن المناسك والقرآن فاني بهما عالم<\/p>\n<p>[`Abdul-Rahman, from abu `Abdullah al-Tahrani, from `Abdul-Razaq, that al-Thawri used to say: &#8220;Ask me about the rites and the Qur&#8217;an for I am knowledgeable about them.&#8221;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Source: al-Jarh wal-Ta`deel 1\/117.<\/p>\n<p style=\"text-align: justify;\">`Abdullah ibn al-Zubayr (ra) would say:<\/p>\n<blockquote><p>أخبرنا أبو بكر محمد بن عبد الباقي أنا أبو محمد الجوهري أنا أبو عمر بن حيوية أنا أحمد بن معروف أنا الحسين بن الفهم نا محمد بن سعد أنا الفضل بن دكين نا أبو سعيد بن عوذ البراد المكي نا محمد بن المرتفع قال سمعت ابن الزبير يقول يا معشر الحاج سلوني فعلينا كان التنزيل ونحن حضرنا التأويل<\/p>\n<p>[&#8230; Muhammad bin al-Murtafi` said: I heard ibn al-Zubayr say: &#8220;Ask me O pilgrims, because the revelation descended on us and we witnessed the interpretation.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Source: Tareekh Dimashq 28\/168.<\/p>\n<p style=\"text-align: justify;\">By &#8220;revelation used to descend on us&#8221; he means that they were from the early Muslims who were present when the revelation used to descend, not that he himself received revelation.<\/p>\n<p style=\"text-align: justify;\">Other such examples can be found all over the books of Hadith and history&#8230;<\/p>\n<p style=\"text-align: justify;\">And when `Ali (ra) says:<\/p>\n<blockquote><p>&#8220;Ask me for I swear by Allah (swt) there is not a single thing that you can ask me about until the day of Judgement except that I can tell you about it.&#8221;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This in no way means that he knows the unseen, because not even the Prophet (SAWS) knew the unseen, as the book of Allah states:<\/p>\n<blockquote><p>{Say (O Muhammad (SAW) &#8220;I don&#8217;t tell you that with me are the treasures of Allah, nor (that) I know the Unseen; …}[6:50].<\/p><\/blockquote>\n<p style=\"text-align: justify;\">And<\/p>\n<blockquote><p>{Say (O Muhammad (SAW) “I have no power over any good or any harm to myself except as Allah wills. If I had knowledge of the unseen, I should have multiplied all good and no evil should have touched me} [7:188].<\/p><\/blockquote>\n<p style=\"text-align: justify;\">What is meant is that `Ali (ra) just like many of the companions of the Prophet (SAWS) knew of future events and prophecies and from the signs of the last day and the events of the end more than any average Muslim in Kufa who has never met the Prophet (SAWS). During the Khilafah of `Ali (ra) in Kufa, most of the knowledgeable companions had already died, so he wanted them to ask him before they also lose him.<\/p>\n<p style=\"text-align: justify;\">The Prophet (SAWS) used to inform his companions of such matters like we read in Sahih Muslim:<\/p>\n<blockquote><p>صلى بنا رسول الله صلى الله عليه وسلم الفجر وصعد المنبر فخطبنا حتى حضرت الظهر فنزل فصلى ثم صعد المنبر فخطبنا حتى حضرت العصر ثم نزل فصلى ثم صعد المنبر فخطبنا حتى غربت الشمس فأخبرنا بما كان وبما هو كائن فأعلمنا أحفظنا<\/p>\n<p style=\"text-align: justify;\">[abu Zayd `Amro bin Akhtab said: The Prophet (SAWS) led us in the Fajr prayer, then he climbed the Mimbar and gave a sermon until Zuhr, he climbed down and prayed then climbed back up again and continued his sermon until `Asr, then he prayed and climbed up and continued until the sun set, so he told us of what was and what is to be, the most knowledgeable of us is the one who could best memorize.]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Also another example from al-Mustadrak `ala al-Sahihayn and al-Sunan al-Waridah fil-Fitan we read:<\/p>\n<blockquote><p>عَنْ حُذَيْفَةَ ، أَنَّهُ قَالَ : &#8221; أَخْبَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا هُوَ كَائِنٌ إِلَى أَنْ تَقُومَ السَّاعَةُ , فَمَا مِنْهُ شَيْءٌ إِلا قَدْ سَأَلْتُهُ , إِلا أَنِّي لَمْ أَسْأَلْهُ : مَا يَخْرُجُ أَهْلَ الْمَدِينَةِ مِنَ الْمَدِينَةِ ؟ &#8221;<\/p>\n<p>[Hudhayfah ibn al-Yaman said: &#8220;The messenger (SAWS) told me of what will be until the day of judgment. I did not leave anything unless I asked except: What causes the people of Madinah to leave it?&#8221;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Any man of knowledge knows that what is meant by &#8220;What was, and what is to be.&#8221; is not every single detail, it simply means that he told them stories of past prophets and nations, and then told them of future prophecies and major battles and Fitan and signs, and they memorized what they could from it, and a lot of this information is found in the books of Hadith and Sunan.<\/p>\n<p style=\"text-align: justify;\">We go back to the topic of abu al-Tufayl (ra), RTS claims three matters regarding this man:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">1- Is a Rafidhi.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">2- Believes in Raj`ah.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">3- Was the standard bearer for al-Mukhtar.<\/span><\/p>\n<p style=\"text-align: justify;\">We will review these three claims one by one.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000; text-decoration: underline;\"><b>1- The first claim: abu al-Tufayl (ra) is a Rafidhi.<\/b><\/span><\/span><\/p>\n<p style=\"text-align: justify;\">al-Dhahabi after researching the man&#8217;s biography concluded that the man is not a Rafidhi, he is a Shia, this is why he refer o him in Siyar A`lam al-Nubala&#8217; as:<\/p>\n<blockquote><p>عامر بن واثلة بن عبد الله بن عمرو الليثي الكناني الحجازي الشيعي<\/p>\n<p>[`Amir bin Wathilah bin `Abdullah bin `Amro al-Laythi al-Kanani al-Hijazi al-Shi`ee.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">So he was not referred to as Rafidhi, simply because there is absolutely no proof that he was a Rafidhi, but there are proofs that he wasn&#8217;t a Rafidhi.<\/p>\n<p style=\"text-align: justify;\">The difference between a Rafidhi and a Shi`ee according to al-Dhahabi is as follows, he says in al-Siyar:<\/p>\n<blockquote><p>من سكت عن ترحم مثل الشهيد أمير المؤمنين عثمان، فإن فيه شيئا من تشيع، فمن نطق فيه بغض وتنقص وهو شيعي جلد يؤدب، وإن ترقي إلى الشيخين بذم، فهو رافضي خبيث، وكذا من تعرض للامام علي بذم، فهو ناصبي يعزر، فإن كفره، فهو خارجي مارق، بل سبيلنا أن نستغفر للكل ونحبهم، ونكف عما شجر بينهم<\/p>\n<p style=\"text-align: justify;\">[He who does not make Tarahhum (ask Allah to have mercy on) the martyr Ameer al-Mu&#8217;mineen `Uthman, then he has some Shiasm inside him, he who speaks ill of him and hates him is a strict\/extreme Shia and must be punished until he behaves, and if he exceeds this to insulting the two Shaykhs (Abu Bakr and `Umar), then he is a sly Rafidhi, the one who does the same to `Ali is a Nasibi and must be punished until he behaves, if he makes Takfeer of him then he becomes a Mariq and a Khariji. Our way is to ask Allah to forgive them all and we love them all and do not speak of what took place between them.]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">In another location in the same book he says:<\/p>\n<blockquote><p>ذكره أبو القاسم بن عساكر في ترجمة معاوية، فقال: كان أبو عروبة غاليا في التشيع، شديد الميل على بني أمية.<\/p>\n<p>قلت: كل من أحب الشيخين فليس بغال، بلى من تعرض لهما بشئ من تنقص، فإنه رافضي غال، فإن سب، فهو من شرار الرافضة، فإن كفر، فقد باء بالكفر، واستحق الخزي<\/p>\n<p style=\"text-align: justify;\">[Ibn `Asakir mentioned him in the biography of Mu`awiyah and said: &#8220;Abu `Urubah was a Ghali(extreme) in Tashayyu`, and had extreme enmity towards bani Umayyah.&#8221;<\/p>\n<p style=\"text-align: justify;\">I say: Everyone who loves the two Shaykhs (Abu Bakr and `Umar) cannot be a Ghali, but if one criticizes them then he is a Rafidhi Ghali, if he abuses them then he is from the most evil of Rafidhah, and if he goes as far as to make Takfeer on them then he has deserved Kufr and disgrace himself.]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">So there are levels and not all Shia are the same, as for abu al-Tufayl (ra) he was referred to as Shia only in the political sense, since he supported `Ali (ra) in his wars.<\/p>\n<p style=\"text-align: justify;\">The same is in Tahdheeb al-Tahdheeb by Ibn Hajar who refers to him as a Shia:<\/p>\n<blockquote><p>وكان متشيعا<\/p><\/blockquote>\n<p style=\"text-align: justify;\">He does not consider him a Rafidhi. He even went through all of the man&#8217;s narrations and said:<\/p>\n<blockquote><p>وليس في رواياته بأس<\/p>\n<p>[There is nothing wrong with his narrations.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">He was also not the last companion to die, the author of Ikmal al-Tahdheeb, Ibn Mughlatay comments by saying that:<\/p>\n<blockquote><p>شهد عكراش بن ذؤيب بن جرفوض يعني التميمي الصحابي الجمل مع عائشة؛ فقال الأحنف بن قيس: كأنكم به قد أتي به قتيلا أو به جراحة لا تفارقه حتى يموت فضرب عكراش ضربة على أنفه فعاش بعدها مائة سنة وأثر الضربة به<\/p><\/blockquote>\n<p style=\"text-align: justify;\">He says that `Ikrash bin Dhu&#8217;ayb (ra) who was a companion who fought alongside `Aisha (ra) in al-Jamal was actually the last companion to die in around 135 Hijri.<\/p>\n<p style=\"text-align: justify;\">If we check abu al-Tufayl&#8217;s (ra) biography in &#8220;Tahdheeb al-Tahdheeb&#8221; by al-Hafiz ibn Hajar al-`Asqalani, we read:<\/p>\n<blockquote><p>روى عن النبي صلى الله عليه وسلم وعن أبي بكر وعمر وعلي ومعاذ ابن جبل وحذيفة وابن مسعود وابن عباس وأبي سريحة ونافع بن عبد الحارث وزيد ابن ارقم وغيرهم<\/p>\n<p>[He narrated from the Prophet (SAWS) and Abu Bakr, and `Umar, and `Ali, and Mu`adh ibn Jabal amd Hudhayfah and ibn Mas`oud and Ibn `Abbas &#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">We read in Sunan al-Bayhaqi:<\/p>\n<blockquote><p>أَخْبَرَنَا أَبُو بَكْرٍ أَحْمَدُ بْنُ الْحَسَنِ الْقَاضِي ، ثنا أَبُو الْعَبَّاسِ مُحَمَّدُ بْنُ يَعْقُوبَ ، ثنا الْحَسَنُ بْنُ عَلِيِّ بْنِ عَفَّانَ ، ثنا ابْنُ نُمَيْرٍ ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ ، عَنْ عَمْرِو بْنِ دِينَارٍ ، عَنْ أَبِي الطُّفَيْلِ ، أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ &#8221; سُئِلَ عَنْ مَيْتَةِ الْبَحْرِ ، فَقَالَ : هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ &#8221;<\/p>\n<p>[&#8230; from abu al-Tufayl that Abu Bakr may Allah be pleased with him was asked about the dead animal of the sea so he replied: &#8220;Its water is purifying and its dead is permissible.&#8221;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">al-Dhahabi commented on this narration in al-Muhadhab 1\/8 and said that its chain is authentic.<\/p>\n<p style=\"text-align: justify;\">In other words this man is taking religion from Abu Bakr (ra) and `Umar (ra) and this is the last thing the Rafidhah would do. Instead the Rafidhah of today would curse them and accuse them in their religion.<\/p>\n<p style=\"text-align: justify;\">This is why we read in his biography in &#8220;Ikmal Tahdheeb al-Kamal&#8221; by al-Hanafi:<\/p>\n<blockquote><p>وقال أبو عمر: كان محبا في علي يعترف بفضل الشيخين إلا أنه كان يقدم عليا وكان ثقة مأمونا<\/p>\n<p>[And abu `Umar said: &#8220;He (Abu al-Tufayl) was a lover of `Ali, he admits to the virtues of the Shaykhayn (Abu Bakr &amp; `Umar) however he used to place `Ali before them and he was Thiqah and reliable.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This is not surprising because even the biggest of the Shia scholars admit that the first Shia or supporters of `Ali (ra) used to think very highly of Abu Bakr (ra) and `Umar (ra). The classical Shia scholar al-Shareef al-Murtada (d.436 AH) says in his book &#8220;al-Shafi fil-Imamah&#8221; 3\/113:<\/p>\n<blockquote><p>ومعلوم أن جمهور أصحابه وجلهم كانوا ممن يعتقد إمامة من تقدم عليه ع وفيهم من يفضلهم على جميع الأمة<\/p>\n<p>[And it is known that the vast majority of his (`Ali&#8217;s) companions used to believe in the Imamah of those who preceded him (meaning the first three), and among them were those who favored them over the entire nation.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Ibn Taymiyyah reports in Minhaj al-Sunnah al-Nabawiyyah 1\/13:<\/p>\n<blockquote><p>أبو القاسم البلخي قال سأل سائل شريك بن عبد الله بن أبي نمر فقال له : أيهما أفضل أبو بكر أو علي ؟ فقال له : أبو بكر ، فقال له السائل : أتقول هذا وأنت من الشيعة ؟ فقال : نعم إنما الشيعي من قال مثل هذا ، والله لقد رقى علي هذه الأعواد . فقال : &#8220;ألا إن خير هذه الأمة بعد نبيها أبو بكر ثم عمر &#8221; ، أفكنا نرد قوله؟ أكنا نكذبه؟ والله ما كان كذاباً<\/p>\n<p style=\"text-align: justify;\">[Abu al-Qassim al-Balkhi said: A questioner asked Shareek bin `Abdullah bin abi Nimr: &#8221; Who is best, Abu Bakr or `Ali?&#8221; he replied: &#8220;Abu Bakr.&#8221; The questioner asked: &#8220;You say this and you&#8217;re from the Shia!?&#8221; He said: &#8220;Yes, a (true) Shia would only say this. By Allah `Ali said: The best of this nation after its Prophet is Abu Bakr then `Umar. Do you expect us to accuse him of lying? By Allah he was no liar!&#8221;]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">I add that abu al-Tufayl (ra) although he had extreme love for `Ali (ra) and his family, yet he didn&#8217;t have any extreme misguidance, he would narrate narrations that prove that `Ali (ra) had no secret divine knowledge nor did the Prophet (SAWS) tell him any holy secrets like the Shia of today claim, we read in Musnad abi Ya`la al-Mousili:<\/p>\n<blockquote><p>قال أبو خيثمة حدثنا مروان بن معاوية الفزاري حدثنا منصور بن حيان قال : حدثنا أبو الطفيل عامر بن واثلة قال : كنت عن علي بن أبي طالب فأتاه رجل فقال : ما كان النبي صلى الله عليه و سلم يسر إليك ؟ فغضب وقال : ما كان النبي صلى الله عليه و سلم يسر إلي شيئا كتمه الناس غير أنه قد حدثني بكلمات أربع : قال : فقال : ما هن يا أمير المؤمنين ؟ قال : قال : لعن الله من لعن والديه ولعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من غير منار الأرض<\/p>\n<p>قال حسين سليم أسد : إسناده صحيح<\/p>\n<p style=\"text-align: justify;\">[&#8230; abu al-Tufayl `Amir bin Wathilah said: I was with `Ali bin abi Talib when a man came to him and said: &#8220;What secrets did the messenger (SAWS) tell you?&#8221; So `Ali got angry and said: &#8220;The Prophet (SAWS) would not tell him anything that he would keep hidden from the rest of the people! However, he did tell me these four words: Allah curses he who curses his parents, Allah curses he who sacrifices for other than Allah, Allah curses he&#8230;<\/p>\n<p>Husayn Salim Asad said: Isnad Sahih.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Also another example from &#8220;Ithaf al-Khayarah al-Maharah&#8221; by al-Bouwaysiri who reports in an authentic narration by pure Shia narrators:<\/p>\n<blockquote><p>وَقَالَ أَبُو يَعْلَى الْمُوصِلِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ صَالِحٍ ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ ، عَنِ الْوَلِيدِ بْنِ جُمَيْعٍ ، عَنْ أَبِي الطُّفَيْلِ ، قَالَ : جَاءَتْ فَاطِمَةُ إِلَى أَبِي بَكْرٍ ، فَقَالَتْ : يَا خَلِيفَةَ رَسُولِ الله صَلَّى الله عَلَيه وسَلَّم ، أَنْتَ وَرِثت رَسُولِ الله أَمْ أَهْلُهُ ؟ قَالَ : بَلْ أَهْلُهُ قَالَتْ : فَمَا بَالُ سَهْمِ رَسُولِ الله صَلَّى الله عَلَيه وسَلَّم ؟ قَالَ : إِنِّي سَمِعْتُ رَسُولَ الله صَلَّى الله عَلَيه وسَلَّم ، يَقُولُ : إِذَا أَطْعَمَ الله , عَزَّ وَجَلَّ , نَبِيًّا طُعْمَةً ، ثُمَّ قَبَضَهُ جَعَلَهُ لِلَّذِي يَقُومُ بَعْدَهُ فَرَأَيْتُ أَنْ أَرُدَّهُ عَلَى الْمِسْلِمِينَ ، فَقَالَتْ : أَنْتَ وَرَسُولُ الله أَعْلَمُ.<\/p>\n<p style=\"text-align: justify;\">[Abu Ya`la al-Mousili said: `Abdul-Rahman bin Salih said: Muhammad bin Fudayl said, from al-Walid bin Jumay` (bin `Abdullah), from abi al-Tufayl that he said: Fatima came to Abu Bakr and said: &#8220;O successor of Rassul-Allah (SAWS), did you inherit the messenger of Allah or his family?&#8221; He said: &#8220;His family.&#8221; She asked: &#8220;Then what of the share of the messenger (SAWS)?&#8221; He replied: &#8220;I heard the messenger of Allah (SAWS) say: &#8220;If Allah the majestic and great gave a prophet a blessing then took his soul, it becomes for the one who took his place after him.&#8221; So I decided that I should distribute it among the Muslims.&#8221; Fatima told him: &#8220;You and the messenger of Allah know best.&#8221;]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">We hope the Shia will not accuse abu al-Tufayl (ra) of being a Nasibi Wahhabi after these narrations.<\/p>\n<p style=\"text-align: justify;\">So if he simply prefers `Ali over `Uthman or even over Abu Bakr and `Umar, then he cannot be counted as Rafidhi, as Rafidhah are rejecters of the two first Caliphs, they do not love them or praise them, in fact most curse them. How then can Abu al-Tufayl be a Rafidhi?<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar explains in Tahdheeb al-Tahdheeb 1\/94:<\/p>\n<p style=\"text-align: justify;\">[Tashayyu` according to the understanding of the early ones, is to prefer `Ali over `Uthman, and that `Ali was right in his war and those who opposed him were wrong, while preferring the Shaykhayn (Abu Bakr &amp; `Umar), and maybe some of them would believe that `Ali was the best of creation after the Prophet (saw), if the one who believes this has devout faith, and are truthful and diligent, reaching this through his own deduction, then there is no disallowing his narrations, especially if he is not calling to his belief. As for the Tashayyu` that is known to the later scholars, it is the pure Rafdh (rejection), and it is not permissible to accept narrations from a Rafidhi, or an extremist nor to honor them by this.]<\/p>\n<p style=\"text-align: justify;\">Meaning, the Shia of the past even if they were to prefer `Ali over the Shaykhayn, yet if they&#8217;re pious Muslims who only have this one innovation, it wouldn&#8217;t harm them in any way, but if they were Rafidhah who reject the Shaykhayn such as today&#8217;s Shia, then they are themselves rejected.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000; text-decoration: underline;\"><b>2- The second claim: abu al-Tufayl (ra) believes in al-Raj`ah.<\/b><\/span><\/span><\/p>\n<p style=\"text-align: justify;\">Regarding the belief in al-Raj`ah (The Return), RTS explains it as this:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The followers of the true Islam (those who adhere to the Ahlulbayt (a.s)  i.e. The &#8216;Tashayyu,&#8217; are accused of having deviated from the path of the companions of the Prophet (saw) in having invented the concept of &#8216;Raj&#8217;ah.&#8217; That is that after the reappearance of the Imam Mahdi (ajf), each of the remaining 11 of the 12 Imams shall be brought back opposite to the order of their deaths, ending with Imam Ali (a.s) who shall be the Imam of Qayama itself.<\/span><\/p>\n<p style=\"text-align: justify;\">We do not believe that such a belief entails Kufr, although it is a deviant un-Islamic belief, and a lie according to al-Hasan (ra):<\/p>\n<p>we believe it is a lie just like al-Hasan bin `Ali (ra) said in the authentic narration:<\/p>\n<blockquote><p>قلت للحسن بن علي : إن الشيعة يزعمون أن عليا رضي الله عنه يرجع قال : كذب أولئك الكذابون لوعلمنا ذاك ما تزوج نساؤه ولا قسمنا ميراثه<br \/>\nالراوي: عاصم بن ضمرة المحدث: أحمد شاكر &#8211; المصدر: مسند أحمد &#8211; الصفحة أو الرقم: 2\/312<br \/>\nخلاصة حكم المحدث: إسناده صحيح<\/p>\n<p style=\"text-align: justify;\">[`Asim bin Dumrah said: I told al-Hasan bin `Ali: &#8220;The Shia claim that `Ali may Allah be pleased with him will return&#8221;, He said: &#8220;Those Liars! They have lied because if we knew this then his wives wouldn&#8217;t remarry and we wouldn&#8217;t have divided his inheritance.&#8221;]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Source: Musnad Ahmad 2\/312 Ahmad Shakir said &#8220;Sahih&#8221;, and Majma` al Zawaidd by al-Haythami.<\/p>\n<p style=\"text-align: justify;\">This is an accusation aimed at abu al-Tufayl (ra) because of two reasons:<\/p>\n<p style=\"text-align: justify;\">-The first reason is that he was from the Shia of `Ali (ra) and it is known that at the time some of the Sabaites (followers of ibn Saba&#8217;) spread some corrupt beliefs among the Shia, that `Ali (ra) did not die, and that he will return to rule in the future.<\/p>\n<p style=\"text-align: justify;\">-The second reason is one narration attributed to abu al-Tufayl (ra) that some understood as Raj`ah.<\/p>\n<p style=\"text-align: justify;\">The narration is as follows from the Musannaf of ibn abi Shaybah:<\/p>\n<blockquote><p>حَدَّثَنَا وَكِيعٌ ، عَنْ بَسَّامٍ ، عَنْ أَبِي الطُّفَيْلِ ، عَنْ عَلِيٍّ ، قَالَ : كَانَ رَجُلاً صَالِحًا , نَاصَحَ اللَّهَ فَنَصَحَهُ فَضُرِبَ عَلَى قَرْنِهِ الأَيْمَنِ فَمَاتَ فَأَحْيَاهُ اللَّهُ ، ثُمَّ ضُرِبَ عَلَى قَرْنِهِ الأَيْسَرِ فَمَاتَ فَأَحْيَاهُ اللَّهُ ، وَفِيكُمْ مِثْلُهُ.<\/p>\n<p>[Waki` told us, from Bassam, from abu al-Tufayl, from `Ali may Allah be pleased with him: He was a righteous man. He was sincere to Allah, and Allah was sincere to him. He was then hit on his right horn and died, then Allah brought him back to life. Then he was hit on his left horn and died, then Allah brought him back to life. And there is (someone) like him amongst you.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This last part: &#8220;And there is (someone) like him amongst you.&#8221; Some understood from this that abu al-Tufayl (ra) believed in Raj`ah like some extremists at the time, they believed that abu al-Tufayl (ra) meant that `Ali (ra) was saying that he shall be killed and revived like Dhu al-Qarnayn. We will soon discuss the proper interpretation of this narration below.<\/p>\n<p style=\"text-align: justify;\">The man narrating from abu al-Tufayl (ra) is Bassam bin `Abdullah al-Sayrafi, and Ibn Hajar summed up his condition in &#8220;Taqreeb al-Tahdheeb&#8221;:<\/p>\n<blockquote><p>بسام بن عبد الله الصيرفي الكوفي أبو الحسن صدوق من الخامسة<\/p>\n<p>[Bassam bin `Abdullah al-Sayrafi, Kufi, abu al-Hasan, Saduq from the fifth.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">In other words this Hadith would be graded as &#8220;Hasan&#8221;.<\/p>\n<p style=\"text-align: justify;\">And there is another narration also from abu al-Tufayl (ra) in ibn abi Shaybah&#8217;s Musannaf:<\/p>\n<blockquote><p>حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ، عَنْ سُفْيَانَ ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ ، عَنْ أَبِي الطُّفَيْلِ ، قَالَ : سُئِلَ عَلِيٌّ عَنْ ذِي الْقَرْنَيْنِ ؟ فَقَالَ : لَمْ يَكُنْ نَبِيًّا ، وَلاَ مَلِكًا , وَلَكِنَّهُ كَانَ عَابِدًا نَاصَحَ اللَّهَ فَنَصَحَهُ ، فَدَعَا قَوْمَهُ إلَى اللهِ فَضُرِبَ عَلَى قَرْنِهِ الأَيْمَنِ فَمَاتَ فَأَحْيَاهُ اللَّهُ ، ثُمَّ دَعَا قَوْمَهُ إلَى اللهِ فَضُرِبَ عَلَى قَرْنِهِ الأَيْسَرِ فَمَاتَ فَأَحْيَاهُ اللَّهُ فَسُمِّيَ ذَا الْقَرْنَيْنِ.<\/p>\n<p style=\"text-align: justify;\">[Yahya bin Sa`eed told us, from Suffiyan, from Habib bin abi Thabit, from abu al-Tufayl that he said: `Ali was asked about Dhu-al-Qarnayn so he said: &#8220;He was neither a Prophet or a king, but he was a slave who believed in Allah and he rewarded him, so he called his folks to Islam and was hit on his right horn and died, then Allah revived him, and then he called his folks to Islam again so he was hit on his left horn and died, then Allah revived him, so he was called Dhu-al-Qarnayn.&#8221;]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">And all the narrators are trustworthy but it does not contain the part &#8220;And there is (someone) like him amongst you.&#8221;<\/p>\n<p style=\"text-align: justify;\">Here the scholars of Islam said that `Ali (ra) meant himself when he said: &#8220;And there is (someone) like him amongst you.&#8221; And they gave two explanations:<\/p>\n<p style=\"text-align: justify;\">The first explanation is that `Ali (ra) is like Dhu-al-Qarnayn in the sense that `Ali (ra) was calling to Allah and to Islam and he received two hits on his head just like Dhu al-Qarnayn was calling to Allah and to Islam and he received two hits on his head. `Ali (ra) got hit once by `Amr bin Wid in al-Khandaq and once by Ibn Muljam on his way to prayer.<\/p>\n<p style=\"text-align: justify;\">Now a Shia will say: &#8220;No this means that he will return and be revived.&#8221;<\/p>\n<p style=\"text-align: justify;\">This Shia interpretation is not accurate because of the following reasons:<\/p>\n<p style=\"text-align: justify;\">&#8211; `Ali (ra) did not disappear between the two hits he received on his head nor was he revived from death.<\/p>\n<p style=\"text-align: justify;\">-Because `Ali (ra) received both hits on the same place not one hit on his left and the other on his right just like the Shia scholar `Ali al-Kourani al-`Amili said in &#8220;al-Seerah al-Nabawiyyah `ind Ahlil-Bayt.&#8221; vol.2:<\/p>\n<blockquote><p>لأن ضربة ابن ملجم كانت على ضربة ابن ود ، وليست على قرنه الآخر<\/p><\/blockquote>\n<p style=\"text-align: justify;\">That is also mentioned in &#8220;Manaqib Aal Abi Talib&#8221; vol.2 pg.327.<\/p>\n<p style=\"text-align: justify;\">-Finally because according to the Shia, when `Ali (ra) returns he shall not be hit on his second horn and then die again, but he shall be &#8220;The Imam of Qyamat&#8221; as RTS said.<\/p>\n<p style=\"text-align: justify;\">As for the second explanation given by the scholars, it is that `Ali (ra) was described to be like Dhu al-Qarnayn in heaven because of the following narration, in Bahr al-Fawa&#8217;id by al-Kalabadhi:<\/p>\n<blockquote><p>أَبُو بَكْرٍ مُحَمَّدُ بْنُ عِيسَى الطَّرَسُوسِيُّ ، قَالَ . ح عُبَيْدُ اللَّهِ بْنُ مُحَمَّدٍ ، قَالَ . ح حَمَّادٌ ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ ، عَنْ سَلَمَةَ بْنِ أَبِي الطُّفَيْلِ ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : &#8221; يَا عَلِيُّ ، إِنَّ لَكَ كَنْزًا فِي الْجَنَّةِ ، وَإِنَّكَ ذُو قَرْنَيْهَا ، فَلا تُتْبِعِ النَّظْرَةَ النَّظْرَةَ ، فَإِنَّمَا الأُولَى لَكَ وَلَيْسَ لَكَ الثَّانِيَةُ &#8221;<\/p>\n<p>[&#8230;from Salamah bin abi al-Tufayl (The son of abi al-Tufayl), from `Ali bin abi Talib may Allah be pleased with him that the Prophet (SAWS) said: &#8220;O `Ali, you have a treasure in Jannah, and you will be its Dhu al-Qarnayn&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This narration was graded as &#8220;Hasan li Ghayrihi&#8221; by al-Albani in Sahih al-Targheeb #1902.<\/p>\n<p style=\"text-align: justify;\">In this narration we see the son of abu al-Tufayl narrate that `Ali (ra) will receive a great blessing and treasure in Jannah just like Dhu al-Qarnayn received a great blessing and treasure on this earth.<\/p>\n<p style=\"text-align: justify;\">This is why abu al-Tufayl (ra) said in his narration: &#8220;And there is (someone) like him amongst you.&#8221;<\/p>\n<p style=\"text-align: justify;\">So accusing abu al-Tufayl (ra) of believing in the Shia Raj`ah is not accurate or honest, this is why when Imam ibn Hazm mentioned this in al-Muhalla 3\/174, he said:<\/p>\n<blockquote><p>وذكر أنه كان يقول بالرجعة<\/p>\n<p>[And  it has been said that he believed in Raj`ah.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">The use of &#8220;It has been said&#8221; means that this information does not come from any reliable source or narration, it is just a saying.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000; text-decoration: underline;\"><b>3-The third claim: abu al-Tufayl (ra) was the standard bearer for al-Mukhtar.<\/b><\/span><\/span><\/p>\n<p style=\"text-align: justify;\">In Siyar A`lam al-Nubala&#8217; by al-Imam al-Dhahabi 3\/467 we read:<\/p>\n<blockquote><p>وقيل: إن أبا الطفيل كان حامل راية المختار لما ظهر بالعراق<\/p>\n<p>[And it is said: &#8220;That abu al-Tufayl was the standard bearer for al-Mukhtar when he appeared in `Iraq.&#8221;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">al-Dhahabi used the expression &#8220;It is said&#8221; because it is no more than a saying whose authenticity cannot be verified because there are no narrations stating that he did so.<\/p>\n<p style=\"text-align: justify;\">Secondly, it is known that al-Mukhtar tricked many noble people, he lured them in with slogans like &#8220;The love of Ahlul-Bayt&#8221; and &#8220;Revenge for al-Husayn&#8221; then later when they discovered his lies and started claiming prophet-hood they left him.<\/p>\n<p style=\"text-align: justify;\">As for fighting the killers of Husayn (ra), this is a good praiseworthy act.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000; text-decoration: underline;\"><b>Refuting some extra points:<\/b><\/span><\/span><\/p>\n<p style=\"text-align: justify;\">Before we conclude our response, we need to correct a certain mis-translation by RTS, he quoted this sentence from al-Kamil fil-Du`afa&#8217; and translated it as:<\/p>\n<blockquote><p>وكان الخوارج يذمونه باتصاله بعلي بْن أبي طالب وقوله بفضله وفضل أهله<\/p>\n<p><span style=\"color: #ff0000;\">&#8220;The Khawarij used to rebuke him because of his connection to Alee Ibn Abi Talib and because he believed in Alee&#8217;s superiority and superiority of his family&#8221;<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">The correct translation is with the word &#8220;virtue&#8221; not the word &#8220;superiority&#8221;:<\/p>\n<blockquote><p>[And the Khawarij used to rebuke him because of his connection to Ali ibn abi Talib and because he believed in the virtue of `Ali and the virtue of his family]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">After this RTS quotes the following from al-Khatib al-Baghdadi:<\/p>\n<blockquote><p><span style=\"color: #ff0000;\">&#8220;Al-Akharam who was asked as to why Bukhari abandoned the narration of Aboo Al-Tufayl Amir bin Wathla?&#8221; He replied: &#8220;Because he was excessive in Tashayyu!&#8221; &#8220;<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">This is not accurate and the author of &#8220;al-Ikmal fi Tahdheeb al-Kamal&#8221; 7\/153 commented on it by saying:<\/p>\n<blockquote><p>وفيه نظر لأن البخاري قد خرج حديثه على ذلك اتفق جماعة المؤرخين<\/p>\n<p>[This needs to be looked into because al-Bukhari has narrated his narrations as is the agreement between the historians]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">In Sahih al-Bukhari 1\/217 we read:<\/p>\n<blockquote><p>حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ مَعْرُوفِ بْنِ خَرَّبُوذٍ عَنْ أَبِي الطُّفَيْلِ عَنْ عَلِيٍّ بِذَلِكَ<\/p>\n<p>[`Ubaydullah bin Musa told us, from Ma`rouf bin Kharaboudh, from abi al-Tufayl, from `Ali with it&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">And he refers to him in al-Tareekh al-Kabeer 6\/446 as:<\/p>\n<blockquote><p>2947 &#8211; عامر بن واثلة أبو الطفيل المكى رضى الله عنه<\/p>\n<p>[2947- `Amir bin Wathilah, abu al-Tufayl al-Makki may Allah be pleased with him]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">He doesn&#8217;t mention anything about him being a &#8220;Rafidhi&#8221; in his biography. On top of that he also narrates from him in al-Adab al-Mufrad 1\/20:<\/p>\n<blockquote><p>حدثنا عمرو بن مرزوق قال أخبرنا شعبة عن القاسم بن أبى بزة عن أبى الطفيل قال : سئل على هل خصكم النبي صلى الله عليه و سلم بشيء<\/p>\n<p>[`Amro bin Marzouq told us, Shu`bah told us, from al-Qassim bin abi Bazzah, from abu al-Tufayl: `Ali was asked&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">So al-Bukhari is narrating from him in his main famous books and is praising him.<\/p>\n<p style=\"text-align: justify;\">Finally, We would like to invite the present so called &#8216;Shia&#8217; back to the path of those Salaf As-Salih, the true early Shia who they claim to adhere to, as they have no justification for denying the virtues of Abu Bakr (ra) and `Umar (ra) when it is something testified to by a `Ali bin abi Talib (ra) himself.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000;\"><b>SHORT SUMMARY OF THE ABOVE:<\/b><\/span><\/span><\/p>\n<p style=\"text-align: justify;\">1- RTS simply quotes the narration of Ghadeer from the words of `Ali (ra) and there is nothing new in it. The Shia will insist on translating Mawla as political leader or Khalifah even though that translation is not accurate or correct. Instead it comes in the meaning of beloved friend, supporter, ally ect..<\/p>\n<p style=\"text-align: justify;\">2- RTS says that abu al-Tufayl (ra) believed in Imamah after narrating this Hadith and became a Twelver Shia. There is absolutely nothing in the narration that states that the man believed in Imamah, understood Mawla as the Shia of today do, or became a Shia at that specific point.<\/p>\n<p style=\"text-align: justify;\">3- When people are referred to as &#8220;Shia of `Ali&#8221; in the books of Rijal, this does not mean they are Twelver Shia or religious Shia, it simply means they were average Muslims with no special beliefs who were in `Ali&#8217;s (ra) army. Just like those who sided with `Uthman (ra) were called &#8220;Shi`at `Uthman&#8221;.<\/p>\n<p style=\"text-align: justify;\">4- RTS quotes a narration in which `Ali (ra) misunderstood the meaning of the word &#8220;Mawla&#8221;, I say if `Ali (ra) himself did not understand it as &#8220;Khalifah&#8221; or &#8220;Imam&#8221; then how can the average Muslim be blamed for this? This is because none of the companions understood &#8220;Mawla&#8221; to mean political leader.<\/p>\n<p style=\"text-align: justify;\">5- When `Ali (ra) says &#8220;Ask me about the Qur&#8217;an and the events of the past and the future&#8221; this just shows that he knew a lot of the narrations and stories about the past nations and future prophecies, Just like many other companions knew about these matters. However, in `Ali&#8217;s (ra) days in Kufa many of these knowledgeable companions had passed away, and the people of Kufa were not deeply rooted in knowledge and `Ali (ra) complained about them many times, this is why `Ali (ra) would tell them &#8220;Ask me before you lose me.&#8221;<\/p>\n<p style=\"text-align: justify;\">6- The man was not a Rafidhi, he was described by the expert researchers as a follower of `Ali (ra), he believed in the virtues of Abu Bakr (ra) and `Umar (ra), he praised them and narrated from them religious rulings.<\/p>\n<p style=\"text-align: justify;\">7- To claim that the man believed in the Shia Raj`ah is farfetched, it is only an unverifiable saying, instead that narration was interpreted by the scholars as either:<\/p>\n<p style=\"text-align: justify;\">`Ali (ra) is like Dhu al-Qarnayn in that he was calling his folks to Allah and was hit twice on his head while doing so.<\/p>\n<p style=\"text-align: justify;\">Or<\/p>\n<p style=\"text-align: justify;\">According to the narration of the son of abu al-Tufayl, `Ali (ra) was promised a great reward and blessing in the afterlife just like Dhu al-Qarnayn had it on this earth.<\/p>\n<p style=\"text-align: justify;\">8- Shia understanding of Raj`ah cannot be applied to this narration because `Ali (ra) did not die and get revived the first time he was hit on his head, and `Ali (ra) will not die from a second hit on his head after he comes back to life according to Shia narrations. Also because al-Hasan bin `Ali (ra) himself said they were liars.<\/p>\n<p style=\"text-align: justify;\">9- The saying that abu al-Tufayl (ra) was the standard bearer for al-Mukhtar is only an unverifiable tale that cannot be proven.<\/p>\n<p style=\"text-align: justify;\">10- al-Bukhari praised abu al-Tufayl (ra) greatly and narrated from him in his books.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on Revisitingthesalaf.org entitled: Rafidi Companion Of The Prophet (saw), which was published on the 15th of August, 2012, and can be found here. RTS starts off by telling us that Abu al-Tufayl <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/06\/07\/response-to-rafidi-companion-of-the-prophet-saw\/\" title=\"Response to: Rafidi Companion Of The Prophet (saw).\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-453","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/453","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=453"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/453\/revisions"}],"predecessor-version":[{"id":2580,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/453\/revisions\/2580"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=453"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=453"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=453"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}