{"id":4558,"date":"2019-03-05T13:23:47","date_gmt":"2019-03-05T13:23:47","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4558"},"modified":"2019-03-05T14:04:06","modified_gmt":"2019-03-05T14:04:06","slug":"the-mohseni-dilemma","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/05\/the-mohseni-dilemma\/","title":{"rendered":"The Mohseni Dilemma"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4558\" alt=\"\" \/><em>‘Ilm Al-Rijal<\/em> is the discipline where the reliability and status of hadith transmitters is discerned and evaluated. It is the backbone of the hadith sciences, since the acceptance and rejection of historical reports hinges upon the reliability of their respective transmitters. The Shi’ite <em>Rijal <\/em>discipline is primarily based in the works of Al-Najashi (d. 450) and Al-Tusi (d.460). Other notable Shi&#8217;ite authorities, such as Al-Kashi (d. 350), Al-Mufid (d. 413) and Ibn Al-Ghada&#8217;iri etc., are occasionally cited as well.<\/p>\n<p>The appeal to these sources, however, has posed a problem to Shi&#8217;ite theologians: the aforementioned authorities lived much later in history and never encountered most of the transmitters discussed in their works. If that is the case, then why are their verdicts authoritative and binding? Several Shi’ite theologians from the past century have thus attempted to address this question.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>Al-Khoei&#8217;s Appeal<\/strong><\/span><\/p>\n<p>Prominent twentieth century Shi&#8217;ite cleric and hadithist, Grand Ayatollah Al-Khoei, attempted to address this issue in his magnum opus, <em>Mo&#8217;jam Rijal Al-Hadith<\/em>. Al-Khoei essentially argued that the verdicts of Shi&#8217;ite rijalists actually were the opinions of previous authorities (who encountered the earlier transmitters) which were relayed to later biographers, such as Al-Tusi, Al-Najashi and others. Since these later biographers were trustworthy and reliable informants, Al-Khoei argued that the verdicts they had listed in their works may be relied upon. (Al-Khoei 1:41).<\/p>\n<p>Al-Khoei&#8217;s entire appeal, however, is based on the assumption that that the verdicts in Al-Tusi and Al-Najashi&#8217;s works were not their own opinions. He thus assumed that Al-Tusi and Al-Najashi had simply relayed those verdicts from past authorities. (Al-Khoei 1:41)<\/p>\n<p>Since he arguably was the most eminent Shi&#8217;ite religious figure of the late 20th century, Al-Khoei&#8217;s reasoning has prevailed in various Shi&#8217;ite scholarly circles,. Widespread acceptance of his biographical encyclopedia, <em>Mo&#8217;jam Rijal Al-Hadith<\/em>,  similarly allowed for the dissemination of his rhetoric. Al-Khoei&#8217;s rhetoric, however, did not really provide a solution to the problem he attempted to address. Rather, it simply opened the door to a new problem which I like to call &#8220;The Mohseni Dilemma.&#8221;<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>The Mohseni Dilemma<\/strong><\/span><\/p>\n<p>Contemporary Shi&#8217;ite theologian and hadithist, Grand Ayatollah Asif Mohseni, recognized the flaws in Al-Khoei&#8217;s appeal. In his book, <em>Buhuth fi &#8216;Ilm Al-Rijal<\/em>, he took Al-Khoei&#8217;s assertion to its logical conclusion. When addressing the reliability of Al-Tusi and Al-Najashi&#8217;s verdicts, he said:<\/p>\n<blockquote><p>The problem is that their endorsements and condemnations of a transmitter, along with anything else they mention about the transmitters, come with a gap in time. However, they do not list the intermediaries between them [till that period] for us to analyze whether they were reliable, weak or unknown transmitters. Accepting such time-lapsed approvals of transmitters is unjustified unless we are to give them the benefit of the doubt and assume that they [Najashi and Tusi] only transmitted from reliable transmitters without mentioning them. In that case, how can we accept their statements? Why don’t we ask about whom they transmitted [these endorsements] from? (Mohseni 58)<\/p><\/blockquote>\n<p>Mohseni rightfully objects to Al-Khoei&#8217;s attempt to address the problem mentioned at the beginning of this article.  In reality, Al-Khoei simply deflected the problem by claiming that Al-Tusi and Al-Najashi&#8217;s verdicts were merely transmitted from earlier authorities that encountered earlier transmitters . This appeal, however, does not really solve the problem, since the intermediaries between Al-Tusi\/Al-Najashi and those alleged earlier authorities are unknown. The appeal is entirely based on wishful thinking and giving Al-Tusi and Al-Najashi &#8220;the benefit of the doubt&#8221;, as stated by Mohseni.<\/p>\n<p>The implications of this dilemma are not minute. Rather, they may fundamentally undermine the entire basis of the Shi&#8217;ite hadith tradition, as the reliability of its biographical sources is put to to question. If the sources which provide the transmitters&#8217; gradings are unreliable, then the entire process of authentication in the Shi&#8217;ite tradition, as a result, becomes arbitrary.  Mohseni thus said<\/p>\n<blockquote><p>If anyone were to find me a solution to this dilemma, I would offer him a sum of money and I would be very thankful, for this dilemma makes <em>Ilm Al-Rijal<\/em> an unreliable discipline from a logical and religious perspective. (Mohseni 58)<\/p><\/blockquote>\n<p>Mohseni&#8217;s contention is further validated when one evaluates the Shi&#8217;ite biographical source known as <em>Rijal Al-Kashi. <\/em>Though we do not possess the entire book, a significant portion of it has been preserved by Al-Tusi, and it is known as <em>Ikhtiyar Ma&#8217;rifat Al-Rijal<\/em>. What makes this work unique when compared to other Shi&#8217;ite biographical sources is that Al-Kashi actually transmitted the endorsements\/condemnations of transmitters while outlining the intermediaries between him and earlier authorities he quoted.<\/p>\n<p>A careful analysis of <em>Rijal Al-Kashi<\/em> will allow us to discern the reliability of the sources early Shi&#8217;ite rijalists relied upon when transmitting biographical data. Unfortunately, it seems as though later Shi&#8217;ite rijalists relied on a plethora of unreliable sources when transmitting biographical information related to transmitters. Shi&#8217;ite hadithist, Al-Behbudi, commented on the unreliability of Al-Kashi&#8217;s sources in his book <em>Ma&#8217;rifat Al-Hadith<\/em>.  He stated that out of  the 1150 reports that have survived from <em>Rijal Al-Kashi<\/em>, not more than 300 are authentic (Behbudi 103). This conclusion is of grave implications: it means that only 26% of Al-Kashi&#8217;s transmission in <em>Ikhtiyar Ma&#8217;rifat Al-Rijal <\/em>is through reliable sources.<\/p>\n<p>It is thus apparent that early Shi&#8217;ite rijalists relied on questionable information that is transmitted through dubious sources to evaluate earlier transmitters. This reality can, for example, be observed in Al-Tusi&#8217;s dependence on the forger, Abu Al-Mufaddal, for the transmission of key biographical data, as outlined in this <a href=\"http:\/\/www.twelvershia.net\/2019\/02\/05\/shiite-scholarships-dependence-on-a-notorious-liar\/\">article<\/a>.<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>Discussion<\/strong><\/span><\/p>\n<p>This entire debate in the Shi&#8217;ite tradition actually stems from a more significant problem which the aforementioned figures attempted to bypass: the lack of transparency in Shi&#8217;ite biographical sources. Since not much is known about the methodologies espoused by Shi&#8217;ite rijalists nor their respective sources, Twelvers simply <span style=\"text-decoration: underline;\">have<\/span> to depend on them. This typically results in the fallacious appeals to authority like that of Al-Khoei.<\/p>\n<p>The same, unfortunately, can be said about Mohseni, whom I greatly respect. Mohseni was critical and open enough to recognize the presence of this defect in the Twelver rijalist tradition, yet he still opted to abide by it hoping that someone will approach him with a &#8220;solution&#8221; one day. The reality of the matter, however, is that there is no solution to this historical dilemma. Early Shi&#8217;ite biographers simply did a bad job transparently outlining their sources and methodologies in their works, and the Shi&#8217;ite tradition now suffers as a result of that.<\/p>\n<p>Theological &#8220;cop-outs&#8221; cannot bypass this historical dilemma either, as such appeals are often based in attempts to deflect the problem using &#8220;theological back-doors&#8221;, which often are based on simple appeals to authority.<\/p>\n<p>On the other hand, this dilemma does not exist in the Sunni tradition for several reasons:<\/p>\n<ol>\n<li>The methodology espoused by the Sunni hadith critics has been transparently outlined in their works.<\/li>\n<li>Sunni biographical sources predate Shi&#8217;ite biographical sources by several centuries.<\/li>\n<\/ol>\n<p>The first point is fundamental to this entire discussion. When evaluating transmitters of hadith along with their reports, early Sunni hadithists were able to outline their methodologies behind their verdicts. Let us take the 3rd century hadith critic, Al-Tirmidhi (d. 289), as an example. In his <em>Jami&#8217;<\/em>, Al-Tirmidhi described a transmitter named &#8216;Amr b. Dinar saying:<\/p>\n<blockquote><p>He is a Basran sheikh, and he is not strong in hadith. He has exclusively transmitted several hadiths from Salem b. &#8216;Abdillah b. &#8216;Umar (Al-Tirmidhi 5:370)<\/p><\/blockquote>\n<p>This statement from Al-Tirmidhi is insightful. We now know that, according to Al-Tirmidhi, exclusive transmission may be indicative of the weakness of a transmitter. Similarly, the regular corroboration of a transmitter&#8217;s transmission would be indicative of his reliability. This is an objective parameter that can be empirically evaluated independently of Al-Tirmidhi&#8217;s verdict. In other words, we can cross-reference this transmitter&#8217;s reports in search of corroborations and exclusive transmission, and we can come to our own independent conclusion regarding his status.<\/p>\n<p>In fact, a friend of ours has precisely demonstrated this reality in this great video: &#8220;<a href=\"https:\/\/www.youtube.com\/watch?v=mZPw5TEEq-k\" rel=\"external nofollow\">How do We Know if a Hadith Transmitter is Reliable<\/a>?&#8221;<\/p>\n<p>For other examples regarding the transparently objective methodologies espoused by the early Sunni hadith critics, refer to AM&#8217;s book, <a href=\"https:\/\/www.islamicdiscourseinitiative.com\/canon\/hadith\/in-defense-of-the-hadith-methodebook\/\" rel=\"external nofollow\">In Defense of the Hadith Method<\/a>.<\/p>\n<p>The second point is important as well. Sunni biographers and hadith critics, such as Ibn Sa’d (d. 230), Yahya b. Ma’in (d. 233), Ali b. al-Madini (d. 234), and Ahmed b. Hanbal (d. 241) etc., predated their Shi&#8217;ite counterparts, Al-Tusi (d. 460) and Al-Najashi (d. 450), by over two centuries. This historical precedence gave Sunni critics more access and exposure to early transmitters of hadith from the first three centuries. Some of the documented criticism of transmitters can even be authentically dated to several <em>Tabi&#8217;in <\/em>from the first century. (Al-Tirmidhi 6:233)<\/p>\n<p><span style=\"font-size: 18pt;\"><strong>Conclusion<\/strong><\/span><\/p>\n<p>The significant gap in time between 5th century Shi&#8217;ite biographers, such as Al-Tusi (d. 460) and Al-Najashi (d. 450), and the earlier hadith transmitters mentioned in their works is a subject that continues to grab the attention of Twelver theologians today. Various evidences demonstrate that early Shi&#8217;ite <em>rijali <\/em>sources relied upon questionable sources when drawing biographical data, and the reliability of their conclusions is thus put to question. The potential implications of this dilemma are devastating, as they may render the entire process of authentication in Twelver sources totally worthless, as stated by Mohseni.<\/p>\n<p>It is quite ironic that the solution to this dilemma is only found in the Sunni <em>Rijali<\/em> tradition, where we can openly demonstrate the objective reasoning behind our appeal to early <em>rijali <\/em>sources authored by the Sunni critics. It is unfortunate that many will still opt to cling onto problematic Shi&#8217;ite biographical sources after being made aware of their defective nature.<\/p>\n<blockquote><p>They have no knowledge therein. They follow nothing but conjecture; and conjecture avails nothing against the Truth. [Quran 53:28]<\/p><\/blockquote>\n<p>And Allah is the best of witnesses.<\/p>\n<p style=\"text-align: center;\"><span style=\"text-decoration: underline;\"><span style=\"font-size: 18pt;\"><strong>Sources<\/strong><\/span><\/span><\/p>\n<p>Al-Behbudi, Muhammad Baqir. <em>Ma&#8217;rifat Al-Hadith<\/em>. 1st ed., Dar Al-Hadi, 2006.<\/p>\n<p>Al-Khoei, Abu Al-Qasem. <em>Mo’jam Rijal Al-Hadith<\/em>. 5th ed., Markaz Nashr Al-Thaqafah Al-Islamiyyah, 1992.<\/p>\n<p>Al-Tirmidhi, Muhammad b. &#8216;Isa. <em>Al-Jami&#8217; Al-Kabir<\/em>. Edited by Bashar Awwad Marouf, Dar Al-Gharb Al-Islami, 1998.<\/p>\n<p>Mohseni, Asif. <em>Buhuth Fi ‘Ilm Al-Rijal.<\/em> 5th ed., Markaz Al-Mustafa, 2010.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>‘Ilm Al-Rijal is the discipline where the reliability and status of hadith transmitters is discerned and evaluated. It is the backbone of the hadith sciences, since the acceptance and rejection of historical reports hinges upon the reliability of their respective <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/05\/the-mohseni-dilemma\/\" title=\"The Mohseni Dilemma\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4558","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4558","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4558"}],"version-history":[{"count":14,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4558\/revisions"}],"predecessor-version":[{"id":4577,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4558\/revisions\/4577"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4558"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4558"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4558"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}