{"id":4589,"date":"2019-03-05T21:23:23","date_gmt":"2019-03-05T21:23:23","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4589"},"modified":"2019-03-05T21:23:53","modified_gmt":"2019-03-05T21:23:53","slug":"abu-hurayrah-the-mirage-of-lies","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/05\/abu-hurayrah-the-mirage-of-lies\/","title":{"rendered":"Abu Hurayrah &#038; The Mirage of Lies"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4589\" alt=\"\" \/>This article partially is a response to the extended rant by Yasin T. al-Jibouri on Al-Islam.org: <a href=\"https:\/\/www.al-islam.org\/articles\/abu-hurayra-and-falsification-traditions-yasin-al-jibouri#f_64ffabe3_1\" rel=\"external nofollow\">Abu Hurayrah and The Falsification of Traditions<\/a><\/p>\n<p>For over a millennium , Shi&#8217;ite scholarship has felt the need to attack and vilify various companions of the Prophet. These attacks usually are accompanied with accusations of forgery, falsification and even hypocrisy. Early hadith critics made note of this phenomenon. The Persian critic, Abu Zur&#8217;ah Al-Razi (d. 264), is authentically quoted saying:<\/p>\n<blockquote><p>If you observe a man criticizing the companions of the Prophet, then know that he is a heretic. That is because the Messenger of Allah is Truth to us, and the Quran is Truth to us as well. The Quran and Sunan of the Prophet were only transmitted to us through his companions. They only wish to criticize our primary witnesses to abolish the Quran and the Sunnah, and they are more worthy of criticism, and they are heretics. (Al-Baghdadi, <em>Al-Kifayah<\/em> 49)<\/p><\/blockquote>\n<p>In the past excerpt, Abu Zur&#8217;ah made note of the primary motive behind Shi&#8217;ite criticism of various companions of the Prophet: to undermine the reliability of the hadith corpus which has been solely transmitted through them. This is why companions,  like Abu Hurayrah, are continuously placed under the spotlight by Shi&#8217;ite polemicists. A brief analysis of Abu Hurayrah&#8217;s biography, however, will demonstrate that Abu Hurayrah never participated in a single battle against &#8216;Ali.  Rather, Abu Hurayrah, abandoned the entire <em>fitnah<\/em> that took place between the Muslims after the death of &#8216;Uthman. Thus, why is Abu Hurayrah hated by many Shi&#8217;ites today?<\/p>\n<p>The reality of the matter is that  his only &#8220;sin&#8221; is that he was a prolific transmitter of Prophetic traditions. In this article, we shall evaluate the Prophet&#8217;s companion, Abu Hurayrah, in light of the slander that is directed against him by Shi&#8217;ite polemicists and other skeptics.<\/p>\n<h2>The Irony: Where are the Lies?<\/h2>\n<p>It is quite ironic that slanderers of Abu Hurayrah who accuse him of being a prolific forger of reports cannot produce a single authentic example that displays Abu Hurayrah fabricating pro-Umayyad or anti-Alid hadiths. The author of the article we are responding to lists only two supposed examples of Abu Hurayrah&#8217;s forgeries. Let us evaluate these examples.<\/p>\n<p>The first report he cites in this context is the following tradition where Abu Hurayrah is quoted saying:<\/p>\n<blockquote><p>&#8220;Allāh‎ has trusted three persons for His revelation: Myself, Gabriel and Mu&#8217;awiyah.&#8221;<\/p><\/blockquote>\n<p>The polemicist then says: &#8220;This quotation is cited by Ibn Asakir, Ibn &#8216;Uday, Muhammed ibn Aa’ith, Muhammed ibn Abd al-Samarqandi, Muhammed ibn Mubarak al-Suri and al-Khateeb al-Baghdadi.&#8221;<\/p>\n<p>The irony in this example is shocking. Our friend, who wrote an entire paper ranting about forgeries and fabrications, has no problem citing inauthentic forgeries to slander Abu Hurayrah. He cites a few authors, yet it seems like he did not have enough energy to see what those authors actually said about that report..<\/p>\n<p>He quoted Ibn &#8216;Adiyy (which he misspells as Ibn &#8216;Uday) citing the report, yet if he were to actually refer to Ibn &#8216;Adiyy&#8217;s work, he would find him describing the hadith saying: &#8220;This is false with this isnad&#8221; (Ibn &#8216;Adiyy 7:557). What is further damning is that Ibn &#8216;Adiyy&#8217;s report is not transmitted from Abu Hurayrah, but it is transmitted by Anas b. Malik! Thus, not only has the author of this article, Yasin T. al-Jibouri, demonstrated his incompetence as a researcher, but he has demonstrated his dishonesty as well.<\/p>\n<p>Here is the excerpt from Ibn &#8216;Adiyy&#8217;s book, <em>Al-Kamil<\/em>:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><em>حَدَّثَنَا مُحَمد بْنُ أحمد بْنِ يَزِيدَ، قَال: حَدَّثَنا عَبد الأعلى بن حماد، قَال: حَدَّثَنا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٌ الْبُنَانِيُّ، عَن <span style=\"text-decoration: underline; color: #ff0000;\">أَنَس بْنِ مَالِكٍ<\/span>، قَال: قَال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْتَمَنَ اللَّهُ عَلَى وَحْيِهِ ثَلاثَةً جِبْرِيلَ عليه السلام في السماء، وَمُحمد صَلَّى اللَّهُ عَلَيهِ وَسلَّمَ فِي الأَرْضِ وَمُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ<\/em><\/p>\n<p style=\"text-align: right;\"><span style=\"text-decoration: underline;\">قَالَ الشيخ: وهذا باطل بِهَذَا الإِسْنَادِ<\/span><\/p>\n<\/blockquote>\n<p>He similarly quotes Al-Khatib Al-Baghdadi citing the report, yet if he had a bit of academic honesty, he would have also noted that Al-Khatib Al-Baghdadi described the report saying: &#8220;This hadith is false with this isnad. Its transmitters are all reliable, and Al-Burdani is suspect in it.&#8221; (Al-Baghadadi, <em>Tarikh Baghdad<\/em> 13:449) Al-Khatib then stated that Al-Burdani was a worthless transmitter (Al-Baghadadi. <em>Tarikh Baghdad<\/em> 13:449)<\/p>\n<p>The reality of this matter is that this entire report is a forgery that is not authentic to Abu Hurayrah. Al-Suyuti, in his collection of fabricated reports, listed the blunderous isnads for this tradition. (Al-Suyuti 1:381)<\/p>\n<p>After all these dishonest and misleading appeals, the author of the article, Yasin T. Al-Jibouri, has the audacity to self-righteously rant saying: &#8220;Imagine! He even puts his name before that of archangel Gabriel! <em>Astaghfirullāh!&#8221;<\/em><\/p>\n<p>Let us see what mysteries are to be found in the second report cited by this dishonest polemicist.<\/p>\n<p>The second hadith cited by the author is a report found in <em>Tarikh Baghdad<\/em>:<\/p>\n<blockquote><p>According to al-Khateeb al-Baghdadi, Abū Hurayra claimed,<\/p>\n<p>&#8220;The Prophet (ﺹ) gave Mu&#8217;awiyah an arrow then said to him, &#8220;Take this arrow until we meet in Paradise.&#8221;<\/p><\/blockquote>\n<p>This example is even more ironic than the previous example. Let us list out the isnad Al-Khatib Al-Baghdadi mentioned for this hadith.<\/p>\n<p>Ahmed b. Muhammad b. Hammad (truthful) → Hamzah b. Al-Qasim Al-Hashimi (reliable) →Muhammad b. Khalil Al-Makhrami (reliable) → <span style=\"color: #ff0000;\">Waddah b. Hassan<\/span> (forger) → <span style=\"color: #ff0000;\">Wazir b. &#8216;Abdullah<\/span> (weak) → <span style=\"color: #ff0000;\">Ghalib b. &#8216;Ubaydullah<\/span> (abandoned) → &#8216;Ataa&#8217; b. Abi Rabah → Abu Hurayrah (Al-Baghdadi, <em>Tarikh Baghdad<\/em> 15: 646)<\/p>\n<p>Had this sly Shi&#8217;ite polemicist been an academically honest individual, he would have noted that Al-Khatib then proceeded to weaken the report in his book. After transmitting it, Al-Khatib said: &#8220;Ghaleb exclusively transmitted it from &#8216;Ataa&#8217;, and he was weak.&#8221; (Al-Baghdadi, <em>Tarikh Baghdad<\/em> 15: 646)<\/p>\n<p>Ibn &#8216;Adiyy quoted the hadith critic, Yahya b. Ma&#8217;in, saying: &#8220;Wazir, the transmitter who transmits the report about the Prophet giving Mu&#8217;awiyah an arrow, is worthless.&#8221; (Ibn &#8216;Adiyy 8:375)<\/p>\n<p>Ibn Al-Jawzi described this report saying: &#8220;This is hadith is fabricated, and it has no basis.&#8221; He then proceeded to tear apart its chains of transmission (Ibn Al-Jawzi 2:21). Al-Suyuti, Al-Shawkani, and Ibn &#8216;Araq similarly listed it as a forgery.<\/p>\n<p>The Shi&#8217;ite polemicist has thus demonstrated that he will desperately grasp onto straws to vilify the companions of the Prophet, even if that entails appealing to inauthentic  fabrications in later sources. It is quite unfortunate that the quality of the discourse has sunken to such a level. Nevertheless, these examples merely demonstrate the academic dishonesty of our opponents.<\/p>\n<h2>Was Abu Hurayrah a Government Stooge?<\/h2>\n<p>Shi&#8217;ite polemicists often predicate their slander of Abu Hurayrah by implying that he was a government stooge who disseminated forged reports to bolster government interests. The Shi&#8217;ite polemicist says:<\/p>\n<blockquote><p>In order to sustain his campaign and raise the status of his likes, Mu&#8217;awiyah had to attract the remnant of some companions of the Prophet (ﺹ) whose characters were known to be weak and who had a genuine interest in the material things of this world, in its vanishing riches. He employed them to fabricate traditions custom-designed to his own tailoring.<\/p><\/blockquote>\n<p>The reality of the matter, however, is that this entire appeal is nothing but a conspiracy theory. As demonstrated in the past section, our friend was not able to present a single authentic example where Abu Hurayrah fabricated a Prophetic tradition that was in-line with Umayyad interests. The entire narrative is based on a series of unverified and fallacious premises.<\/p>\n<p>A careful analysis of Abu Hurayrah&#8217;s biography is enough to dispel this entire narrative. Various authentic examples present Abu Hurayrah openly confronting and  clashing with Umayyad authorities.<\/p>\n<p>In his <em>Sahih<\/em>, Muslim authentically quoted the <em>tabi&#8217;i<\/em>, Haram b. &#8216;Amr, describing an encounter that occurred between Abu Hurayrah and the Umayyad governor, Marwan b. Al-Hakam:<\/p>\n<blockquote><p>I once entered Marwan&#8217;s house in the company of Abu Hurayrah, and he noted the presence of statues in it. Abu Hurayrah thereupon said: I heard the Messenger of Allah say: &#8220;Allah, the Glorious and Exalted, said: Who is more of a wrongdoer than one who tries to create creation like My creation?! Let him then create a grain of wheat or that of barley!&#8221; (Muslim 3:671)<\/p><\/blockquote>\n<p>Had Abu Hurayrah been a government stooge, then he wouldn&#8217;t have openly criticized Marwan b. Al-Hakam for including statues in his house. Rather, one would have expected him to fabricate reports that justified Marwan&#8217;s practice.<\/p>\n<p>Al-Bukhari and others authentically quoted Sa&#8217;id b. &#8216;Amr saying:<\/p>\n<blockquote><p>I was once sitting down with Abu Hurayrah in the Prophet&#8217;s mosque in Medina, and Marwan was with us as well. Abu Hurayrah thus said: I heard the truthful and trusted one say: &#8220;The destruction of my <em>Ummah<\/em> will be at the hands of young men from Quraish.&#8221;<\/p>\n<p>Marwan thus said: &#8220;May Allah curse those young men.&#8221;<\/p>\n<p>Abu Hurayrah then told him: &#8220;If you wish, I can inform you of their identity, the sons of <em>fulan <\/em>and <em>fulan<\/em>.&#8221;<\/p>\n<p>Sa&#8217;id b. &#8216;Amr then said: &#8220;I later used to travel to Al-Sham with Abu Hurayrah when the descendants of Marwan ruled Al-Sham. Whenever he would see them as young and youthful men, he would say: &#8220;Perhaps they are among them?&#8221;<\/p>\n<p>I would tell him: &#8220;You are more knowledgeable in this regard.&#8221; (Bukhari 9:47)<\/p><\/blockquote>\n<p>This hadith is a very interesting tradition. Near the end of the hadith, Abu Hurayrah hints that the individuals the Prophet referred to were the descendants of Marwan himself. Had he been an Umayyad client, then it would be counterproductive for him to disseminate such traditions.<\/p>\n<p>Various other traditions present Abu Hurayrah at odds with Umayyad rulers.<\/p>\n<p>Abu Hurayrah similarly refrained from participating in the Battle of Al-Jamal and Siffin, and any other conflict between Mu&#8217;awiayah and &#8216;Ali. Thus, it is inaccurate and unfair to portray him as an Umayyad stooge whose ultimate goal was to serve Umayyad interests. Various instances from Abu Hurayrah&#8217;s life serve to dispel this false narrative.<\/p>\n<h2>Abu Hurayrah &amp; The Prophet&#8217;s Family<\/h2>\n<p>What is further indicative of the inaccuracy of this Shi&#8217;ite conspiracy theory is the fact that Abu Hurayrah himself disseminated Prophetic traditions regarding the virtues of &#8216;Ali and the Prophet&#8217;s family! Had Abu Hurayrah been a Nasibi or an Umayyad puppet, then it would have been counterproductive for him to transmit such hadiths.<\/p>\n<p>Al-Bukhari and Muslim authentically reported that Abu Hurayrah once said<\/p>\n<blockquote><p>I was with the Messenger of Allah in a market of Medina. He then left, so I left with him. He then said thrice: &#8220;Where is the young child?&#8221; He then said: &#8220;Call Al-Hasan b. &#8216;Ali.&#8221;<\/p>\n<p>Al-Hasan b. &#8216;Ali thus got up and walked with a necklace around his neck. The Prophet thus extended his hand, and Al-Hasan did the same. He then embraced him and said: &#8220;O Allah, I love him, so love him as well; and love those who love him.&#8221;<\/p>\n<p>Abu Hurayrah said: &#8220;There was not a single individual more beloved to me after that than Al-Hasan b. &#8216;Ali.&#8221; (Al-Bukhari 7:159)<\/p><\/blockquote>\n<p>Abu Hurayrah similarly was a transmitter of the renowned virtue of &#8216;Ali b. Abi Taleb during the Battle of Khaybar.<\/p>\n<p>Muslim and others authentically reported that Abu Hurayrah said:<\/p>\n<blockquote><p>During the Battle of Khaybar, the Messenger of Allah ﷺ said: “I shall grant the banner to a man through whom Allah shall grant victory; he loves Allah and His messenger&#8221;<\/p>\n<p>&#8216;Umar b. Al-Khattab thus said: &#8220;That was the only day when I loved leadership, so I sought it hoping I would be granted it.&#8221;<\/p>\n<p>The Prophet then called &#8216;Ali, granted him the banner, and said:  “Proceed and do not turn back, and Allah shall grant victory at your hands.&#8221;<\/p>\n<p>They replied: “He is suffering from trouble in his eyes, O Messenger of Allah.<\/p>\n<p>&#8216;Ali took a few steps, and he then paused and did not turn back. He yelled: “O Messenger of Allah, what shall I fight them upon?!”<\/p>\n<p>The Prophet ﷺ said: “Fight them until they bear witness that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they attest to that, then they have prevented you from their blood and their wealth, except what is justified by the right of Allah; and their judgement is upon Allah.&#8221;  (Muslim 4:871)<\/p><\/blockquote>\n<p>If Abu Hurayrah was a Nasibi forger employed by Mu&#8217;awiyah to fabricate reports that promoted his interests, then it would have been counterproductive for him to transmit reports in the virtues of Mu&#8217;awiyah&#8217;s political opponent. It would have similarly been counterproductive for him to transmit hadiths in the virtues of Al-Hasan, the son of Mu&#8217;awiyah&#8217;s political opponent. What is the explanation of this phenomenon?<\/p>\n<p>There is no explanation needed. The Shi&#8217;ite narrative simply is a baseless conspiracy theory that attempts to vilify Abu Hurayrah by presenting him as a Nasibi forger who fabricated reports to serve Umayyad anti-Alid interests. The actual data on paper dispels this fallacious narrative, and the only &#8220;evidence&#8221; the Shi&#8217;ite polemicists have presented in this context are fabricated reports that are not even authentic to Abu Hurayrah.<\/p>\n<h2>5374 Traditions?!<\/h2>\n<p>When attempting to implicate Abu Hurayrah, Shi&#8217;ite polemicists will often cite an astronomical number of traditions allegedly transmitted by Abu Hurayrah. The implication of this appeal is that Abu Hurayrah fabricated those reports, which explains his prolific transmission. The Shi&#8217;ite polemicist, Al-Jibouri, says:<\/p>\n<blockquote><p>It is of utmost importance to expose the facts relevant to Abu Hurayra so that Muslims may be cautious whenever they come across a tradition narrated by him or attributed to him which, all in all, reached the astronomical figure of 5,374 “traditions,” that is, more “traditions” than anyone else in history&#8230;<\/p><\/blockquote>\n<p>The reality of  the matter that this entire appeal stems from the ignorance of Abu Hurayrah&#8217;s detractors. This figure is taken from the Musnad of Baqiyy b. Mikhlad, a later collection of hadith that is lost. What these polemicists fail to take into account is the fact that this large figure spans:<\/p>\n<ul>\n<li>Repetitions of individual reports with multiple isnads<\/li>\n<li>Weak reports that are not authentic to Abu Hurayrah<\/li>\n<\/ul>\n<p>If we were to refine this pool of transmission and exclude weak reports and repetitions, we&#8217;d come out with a much smaller figure. Dr. Muhammad Al-Yamani <a href=\"http:\/\/dryamani.com\/ar\/News.aspx?NID=105#.XH7IoohKhPY\" rel=\"external nofollow\">evaluated <\/a>this figure and realized that the exclusion of repeated reports would drop it to around 1300 reports! This new figure spans weak and authentic reports ascribed to Abu Hurayrah. Sheikh Muhammad Al-Amin, in his analysis, concluded that the number of authentic reports exclusively transmitted by Abu Hurayrah in the 9 books amounted to only 8 traditions! Sh. Muhammad listed those traditions in his <a href=\"http:\/\/www.ibnamin.com\/num_hadith.htm\" rel=\"external nofollow\">article<\/a>, and they were all disinterested accounts related to jurisprudence.<\/p>\n<p>What are the implications of these findings?<\/p>\n<p>The implications are that almost all of Abu Hurayrah&#8217;s transmission from the Prophet has been corroborated and attested to by other companions of the Prophet. His exclusive transmission is very rare, and the few reports he exclusively transmitted are disinterested accounts, meaning: they do not particularly serve anyone&#8217;s political\/religious interests. Dr. Muhammad Diya Al-Azami, in his book أبو هريرة في ضوء مروياته بشواهدها وحال انفرادها, performs a comprehensive analysis of Abu Hurayrah&#8217;s pool of transmission demonstrating its independent corroboration from other companions of the Prophet.<\/p>\n<h2>Why was He a Prolific Transmitter?<\/h2>\n<p>Perhaps we can now elaborate on the reasons behind Abu Hurayrah&#8217;s prolific (corroborated) transmission from the Prophet.<\/p>\n<p>The Shi&#8217;ite polemicist said:<\/p>\n<blockquote><p>The reader can easily conclude that this figure of 5,374 “traditions” is quite unrealistic when he comes to know that Abu Bakr, friend of the Prophet (ﺹ) and one of the earliest converts to Islam, narrated no more than 142 traditions. ‘Umar ibn al-Khattab narrated no more than 537 traditions. ‘Othman ibn ‘Affan narrated no more than 146 traditions.<\/p>\n<p>And ‘Ali (ع), the man who was raised by the Prophet (ﺹ) and who was always with him, following him like his shadow for 32 years, and whose memory and integrity nobody at all can question, narrated no more than 586 traditions.<\/p><\/blockquote>\n<p>The 5374 figure is a vast exaggeration, as noted earlier. Nevertheless, an observer may understandably find himself asking: &#8220;Why weren&#8217;t other senior companions of the Prophet similarly prolific transmitters of hadith?&#8221;<\/p>\n<p>The reality of the matter is that this phenomenon ultimately comes down to a few historical factors. Let us list the death dates of the companions mentioned in the aforementioned excerpt to get a better understanding:<\/p>\n<table style=\"width: 351.067px; height: 223px;\">\n<tbody>\n<tr>\n<td style=\"width: 345.067px;\">\n<ul>\n<li>Abu Bakr (d. 13)<\/li>\n<li>&#8216;Umar b. Al-Khattab (d. 23)<\/li>\n<li>&#8216;Uthman b. &#8216;Affan (d. 35)<\/li>\n<li>&#8216;Ali b. Abi Taleb (d. 40)<\/li>\n<\/ul>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"width: 345.067px;\">\n<ul>\n<li><span style=\"color: #000000;\">Abu Hurayrah (d. 57)<\/span><\/li>\n<\/ul>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>As seen, the senior companions of the Prophet listed above died decades before Abu Hurayrah. This naturally gave Abu Hurayrah a greater opportunity to disseminate Prophetic traditions, and it granted him more exposure to later <em>tabi&#8217;in<\/em> who could transmit his reports. The senior companions in the list were also preoccupied with other political affairs as caliphs of the Ummah at various points in history, and they thus did not have as much of an opportunity to disseminate Prophetic traditions. Thus, their contexts as transmitters is not analogous to that of Abu Hurayrah.<\/p>\n<p>This phenomenon is not exclusive to Abu Hurayrah. Other companions of the Prophet who died much later in history were also known to be prolific transmitters of hadith. This list spans companions like:<\/p>\n<ul>\n<li>&#8216;Abdullah b. &#8216;Amr (d. 63)<\/li>\n<li>&#8216;Abdullah b. &#8216;Abbas (d. 68)<\/li>\n<li>&#8216;Abdullah b. &#8216;Umar (d. 73)<\/li>\n<li>Anas b. Malik (d. 93)<\/li>\n<\/ul>\n<p>and others.<\/p>\n<p>Another noteworthy point, in this context, is the fact that Abu Hurayrah transmitted hadith from other companions of the Prophet as well. Thus, the fact that he spent less time with the Prophet when compared to other companions of the Prophet does not necessarily have any implications on the validity of his transmission. He heard many hadiths from other <em>Sahabis<\/em> after the death of the Prophet. Let us take a look at this example in <em>Sahih Al-Bukhari<\/em>:<\/p>\n<p style=\"text-align: right;\">قال البخاري: حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ: حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّ عُمَرَ رَضِيَ اللَّهُ عَنْهُ بَيْنَمَا هُوَ يَخْطُبُ يَوْمَ الْجُمُعَةِ، إِذْ دَخَلَ رَجُلٌ فَقَالَ عُمَرُ: لِمَ تَحْتَبِسُونَ عَنِ الصَّلَاةِ، فَقَالَ الرَّجُلُ: مَا هُوَ إِلَّا أَنْ سَمِعْتُ النِّدَاءَ تَوَضَّأْتُ، فَقَالَ: أَلَمْ تَسْمَعُوا النَّبِيَّ ﷺ قَالَ: &#8221; إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ &#8220;<\/p>\n<p>In this report, we find Abu Hurayrah saying:<\/p>\n<blockquote><p>As &#8216;Umar was one day giving a sermon on Friday, a man walked in. &#8216;Umar said: &#8220;Why do you come late to prayer?&#8221; The man responded: &#8220;I heard the first call to prayer, so I performed wudu&#8217;. &#8216;Umar thus said: &#8220;Did you not hear the Messenger of Allah say: &#8216;If one of you departs on Friday, then let him perform ghusl&#8217; ?&#8221;<\/p><\/blockquote>\n<p>In this example, we find Abu Hurayrah transmitting a Prophetic tradition from &#8216;Umar. We also know that this event took place after the Prophet&#8217;s death since &#8216;Umar was giving the Friday sermon. Abu Hurayrah eventually transmitted this tradition to his student, Abu Salamah, and the hadith was eventually documented in later hadith collections. What is also noteworthy is that Abu Hurayrah was corroborated in this hadith by &#8216;Umar&#8217;s son and other transmitters.<\/p>\n<p>As seen, Abu Hurayrah&#8217;s quest for Prophetic traditions persisted after the Prophet&#8217;s death, as he sought hadiths from other notable companions of the Prophet. The fact that he only came to Medina later in the Prophet&#8217;s life has no necessary implications on the veracity of his transmission. In light of these points (and others) Abu Hurayrah&#8217;s prolific transmission from the Prophet is, in no way, problematic or alarming.<\/p>\n<h2>Conclusion<\/h2>\n<p>It has been continuously demonstrated that this Shi&#8217;ite conspiracy theory that attempts to vilify Abu Hurayrah and other companions of the Messenger of Allah is based on a variety of fallacious presuppositions and unreliable\/dishonest appeals. Abu Hurayrah&#8217;s reliability, in light of Shi&#8217;ite slander, can be  demonstrated in several aspects:<\/p>\n<ol>\n<li>The lack of actual authentic examples that demonstrate Abu Hurayrah fabricating interested reports which serve Umayyad interests.<\/li>\n<li>Abu Hurayrah&#8217;s confrontation of various Umayyad authorities throughout his life.<\/li>\n<li>Abu Hurayrah&#8217;s dissemination of hadiths in the virtues of &#8216;Ali b. Abi Taleb and <em>Ahlulbait, <\/em>and opponents of the Umayyads.<\/li>\n<li>The vast corroboration of Abu Hurayrah&#8217;s transmission from the Messenger of Allah by other companions of the Prophet.<\/li>\n<\/ol>\n<p>Similarly, we are able to observe Al-Islam.org&#8217;s academic dishonesty as they published Yasin T. al-Jibouri &#8216;s rant against Abu Hurayrah, which embodied various misleading and dishonest appeals.  Such instances only remind us of Abu Zur&#8217;ah Al-Razi&#8217;s statement around 1200 years ago regarding slanderers of the <em>Sahabah<\/em>: &#8220;They are more worthy of criticism.&#8221;<\/p>\n<p>The slander will not be left without consequences, and on the Day of Judgement,  the Prophet&#8217;s companion, Abu Hurayrah, will stand before Allah and seek justice from those who have slandered him in this life.<\/p>\n<blockquote><p>On the Day, every soul shall come to plead for itself, and every soul will be fully recompensed for all its actions and none will be unjustly dealt with. [Quran 16:111]<\/p><\/blockquote>\n<p>And Allah is the best of witnesses.<\/p>\n<p style=\"text-align: center;\"><span style=\"text-decoration: underline; font-size: 18pt;\"><strong>Sources<\/strong><\/span><\/p>\n<p>Al-Baghdadi, Ahmed b. &#8216;Ali. <em>Al-Kifayah fi &#8216;Ilm Al-Riwayah<\/em>. Edited by Abu Abdullah Al-Surqi and Ibrahim Al-Madani, Al-Maktabah Al-&#8216;Ilmiyyah.<\/p>\n<p>—. <em>Tarikh Baghdad<\/em>. Edited by Bashar Awwad Marouf, 1st ed., 10 16, Dar Al-Gharb Al-Islami, 2002.<\/p>\n<p>Al-Bukhari, Muhammad b. Isma’il. <em>Sahih Al-Bukhari<\/em>. Edited by Muhammad Al-Nasser, 1st ed., Dar Tawq Al-Najah, 1422.<\/p>\n<p>Al-Naysaburi, Muslim. <em>Sahih Muslim<\/em>. Edited by Muhammad Fouad Abdulbaqi, vol 4 5, Dar Ihyaa Al-Turath Al-Arabi, 1954.<\/p>\n<p>Al-Suyuti, &#8216;Abdurrahman. <em>Al-La&#8217;ali&#8217; Al-Masnu&#8217;ah fi Al-Ahadith Al-Masnu&#8217;ah. <\/em>Edited by Salah Awidah, 1st ed., Dar Al-Kutub Al-&#8216;Ilmiyyah, 1996.<\/p>\n<p>Ibn ‘Adiyy, Abu Ahmed. <em>Al-Kamil fi Du’afaa Al-Rijal<\/em>. Edited by Adel Ahmed Abdulmawjud et <em>al<\/em>., 1st ed., Dar Al-Kutub Al-‘Ilmiyyah, 1997.<\/p>\n<p>Ibn Al-Jawzi, &#8216;Abdurrahman. <em>Al-Mawdu&#8217;at<\/em>. Edited by &#8216;Abdurrahman Uthman, 1st ed., Al-Maktabah Al-Salafiyyah, 1966.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This article partially is a response to the extended rant by Yasin T. al-Jibouri on Al-Islam.org: Abu Hurayrah and The Falsification of Traditions For over a millennium , Shi&#8217;ite scholarship has felt the need to attack and vilify various companions of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/05\/abu-hurayrah-the-mirage-of-lies\/\" title=\"Abu Hurayrah &#038; The Mirage of Lies\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4589","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4589","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4589"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4589\/revisions"}],"predecessor-version":[{"id":4595,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4589\/revisions\/4595"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4589"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4589"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4589"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}