{"id":462,"date":"2013-06-10T18:30:01","date_gmt":"2013-06-10T18:30:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=462"},"modified":"2013-06-10T18:30:54","modified_gmt":"2013-06-10T18:30:54","slug":"response-to-coming-soon-our-belief-concerning-the-evil-doers","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/06\/10\/response-to-coming-soon-our-belief-concerning-the-evil-doers\/","title":{"rendered":"Response to: Coming Soon&#8230;Our Belief Concerning The Evil-Doers"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=462\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on Revisitingthesalaf.org entitled: Coming Soon&#8230;Our Belief Concerning The Evil-Doers, published on the 30<sup>th<\/sup> of October 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/10\/coming-soon-our-belief-concerning-evil.html\" rel=\"nofollow external\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">This article is a quotation from the book I’itiqadat Al-Imamiyah (The Shi’ite Creed), in which Al-Saduq lists his beliefs regarding the “evil-doers”. In this article, we will be examining the evidence that Al-Saduq lays out for his stance against these “evil-doers”.<\/p>\n<p style=\"text-align: justify;\">He says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Allah (swt), Exalted is He says: &#8220;Who doeth greater wrong than he who inventeth a lie concerning Allah? Such will be brought before their Lord and witnesses will say: These are they who lied concerning their Lord. Behold! The curse of Allah is upon the wrong-doers, who debar (men) from the way of Allah, and would have it crooked, and who are disbelievers in the Hereafter&#8221; [11:18-19].<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Ibn &#8216;Abbas in explaining this verse says: &#8216;Verily, in this context, by &#8220;the way of Allah&#8221; is meant &#8216;Alee b. Abi Talib and the Imams, on whom be peace.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">This is a lie upon Ibn Abbas (ra). He did not say such a thing in Sunni or Shia hadith, which is why even the commentators (Muhaqqiqeen) of this work were not able to provide a reference. The way of Allah, as indicated by the verse, is the religion of Allah, and there is no evidence of a layered interpretation, nor does it imply it. Be aware that none of the first three Caliphs or the companions disbelieved in the Hereafter, which is why it is not reasonable to link these verses to them. In other words, it is clear that the verse is talking about actual disbelievers that disbelieve in the Hereafter, and not Muslims who were “oppressors”.<\/p>\n<p style=\"text-align: justify;\">He goes on to say:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Now when the following verse was revealed: &#8220;And guard yourselves against a chastisement which cannot fall exclusively on those of you who are wrong-doers&#8221; [8:25], the Prophet (saw) said: &#8216;He who will wrong &#8216;Alee as regards my successor after my death, it is as though he has denied my apostleship and the apostleship of all the Prophets before me. And he who befriends the wrong-doer is himself a wrong-doer.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">This narration is taken from Shawahid Al-Tanzeel by Al-Hasakani, and is narrated from an anonymous narrator, to another anonymous narrator, to another anonymous narrator, from Ibn Abi Hatim the author of the famous book of Qur’anic exegesis, then a chain from him to Ibn Abbas. The chain is weak due to the anonymous narrators and the narration itself does not exist in Ibn Abi Hatim’s book, which makes the narration unreliable. We do find in his book vol.4 pg.293 that he quotes a passage from Ibn Abbas that says about the verse: Allah ordered the believers to not accept what is frowned upon if it was in front of them, for Allah will envelop them with punishment (if they did).<\/p>\n<p style=\"text-align: justify;\">Even though this narration is weak according to the definitions of Hadith scholars, BUT it is still stronger and more reasonable than the narration provided by Al-Hasakani which is falsely attributed to Ibn Abi Hatim.<\/p>\n<p style=\"text-align: justify;\">He then said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And the Prophet (saw) said: &#8216;He, who denies &#8216;Alee his leadership after me, verily denies my apostleship. And he who denies my apostleship has denied Allah His divinity.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">This is a fabrication upon the Prophet (<em>salalahu alaihi wa salam<\/em>), and this narration in this form cannot be found in Sunni or Shia books. However, the editors of the book have provided a similar narration from the same author that can be found in Ma`ani Al-Akhbar (the Meaning of Narrations). However, that narration is weak according to even the Shia hadith standards, for there are narrators within this chain that haven’t been proven to be trustworthy according to the early Shia scholars, like Abu Al-Rabee` Al-Zahrani, Mujahid, Laith bin Abi Saleem, and Mohamad bin `Ali Al-Qurashi. Some though have been referred to as trustworthy for narrating in Tafsir Al-Qumi, but there is major doubt regarding the reliability of the book and the introduction and its attribution to `Ali bin Ibrahim, so such claims are to be rejected.<\/p>\n<p style=\"text-align: justify;\">Al-Saduq then says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And the Prophet (saw), on whom be the Blessings and Mercy of Allah, said: &#8216;O &#8216;Alee, you will be the wronged one after me; and he who wrongs you has verily wronged me; and he who acts justly towards you has verily acted justly towards me; and he who denies your (claims) has verily denied mine; and he who befriends you has verily befriended me; and he who treats you as an enemy has verily treated me as an enemy and he who obeys you has verily obeyed me; and he who disobeys you has verily disobeyed me.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">This, like the first narration, cannot be found in any of the books of Hadith in both the Sunni and Shia sects. One cannot accept this as evidence due to the lack of a source. The editor too failed to provide a reference to this narration.<\/p>\n<p style=\"text-align: justify;\">He then said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And Imam Ja&#8217;far As-Sadiq (a.s) said: &#8216;He who denies the least among us is like him who denies (the claims of) the first among us.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">This is a fabrication upon the tongue of Ja`far Al-Sadiq. Al-Saduq narrated this in Kamal Al-Din 2\/376 from the path of Musa bin Ja`far bin Wahb Al-Baghdadi, who is an anonymous narrator. See Al-Mufid min Mu`jam Rijal Al-Hadith (p.625).<\/p>\n<p style=\"text-align: justify;\">He then said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And the Prophet said: &#8216;The Imams after me are twelve, the first of them is the Prince of Believers &#8216;Alee b. Abi Talib, and the last of them is the Qa&#8217;im (the upholder of the true religion); obedience to them is obedience to me and disobedience to them is disobedience to me; and he who denies one of them has verily denied me.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak due to the lack of evidence of the reliability of several narrators, including Mohammad bin Ibrahim bin Ishaq and `Ali bin Hasan Al-Sa’ih who are both anonymous.<\/p>\n<p style=\"text-align: justify;\">He then said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And Imam Ja&#8217;far As-Sadiq (a.s) said: &#8216;He who doubts in the infidelity of our enemies who have wronged us is himself an infidel.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, Allah is more just and fair than to punish the followers of his religion for having doubts about the wrongdoing of others. How is it possible for Allah to punish a person who has practiced Islam as a monotheist, worshiped Allah his whole life without intermediaries, and avoided innovations, and yet, be an infidel for not believing that certain people are corrupt? What if this person did not know about the wrongdoing or evilness of those people? What if this person was not exposed to views other than that of the Sunnah? What if this person didn&#8217;t see evidence in the narrations of the Shias that show these people in such a negative light? Allah knows that even Al-Saduq had such a hard time in proving these things, since all the narrations that he has quoted so far are weak.<\/p>\n<p style=\"text-align: justify;\">Furthermore, this narration is weak and does not have any chains, which is why even the editor couldn&#8217;t include a reference for it.<\/p>\n<p style=\"text-align: justify;\">He said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And the Prince of Believers said: &#8216;Ever since I was born I have always been wronged. When &#8216;Aqil used to suffer from ophthalmia, he used to say: &#8216;Do not sprinkle eye-powder into my eyes, until you sprinkle it into &#8216;Alee&#8217;s, and they would do so although I had no ophthalmia.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">The narration can be found in `Ilal Al-Sharai’i` by Al-Saduq 1\/41, but the narration is filled with anonymous narrators, like `Ubaidullah bin Hamdoon and Al-Hussain bin Naseer.<\/p>\n<p style=\"text-align: justify;\">He then attributed to the Prophet (<em>salalahu alaihi wa salam<\/em>):<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;He, who fought Alee (a.s), fought me; and he, who waged war on &#8216;Alee, waged war on me; and he, who waged war on me, did so against Allah (swt).<\/span><\/p>\n<p style=\"text-align: justify;\">Once again, Al-Saduq attributes a narration to the Prophet (salalahu alaihi wa salam) when the Hadith cannot be found in any Sunni or Shia book, and once again, the editor was not able to provide a reference for it.<\/p>\n<p style=\"text-align: justify;\">He then quoted:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;Alee, Fatima (a.s), Hassan (a.s) and Hussain (a.s): I am the enemy of those who wage war against you, and at peace with those who are at peace with you.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\">The narration above is a Sunni narration that includes Sunni narrators, which makes it unacceptable for Shias since the narrators are not reliable according to Shia standards. The Sunnis themselves though do not accept it as reliable due to the anonymity of Subaih. Al-Tirmithi, in his Sunan (p. 873) said that he is not someone that is known.<\/p>\n<p style=\"text-align: justify;\">Then he quoted:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And as for Faatima (s.a), the Blessings of Allah (swt) and His Peace be on her, our belief is that she is the leader of the women of the world, both the earlier and the later ones. And verily Allah the Mighty and Glorious is wroth with him who evokes her anger, and is well-pleased with him who pleases her, for He has weaned her and those who revere her from the Fire. And she left the world displeased with those who had wronged her and usurped her rights, and denied her the inheritance left by her father. The Prophet said: &#8220;Verily, Faatima is a part of myself; he who angers her has angered me, and he who gladdens her has gladdened me.&#8221; And the Prophet said: &#8220;Verily Faatima is a part of myself, and she is my spirit which is between my two flanks. What displeases her displeases me, and what gladdens her gladdens me.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">The denial of her so-called inheritance is a topic for another matter, and we will show inshallah that it was `Ali (ra) that was the cause of her initial anger which caused the Prophet (<em>salalahu alaihi wa salam<\/em>) to say such things.<\/p>\n<p style=\"text-align: justify;\">Al-Saduq, went on to state how he disassociates from the evildoers and that they are infidels and that they are the worst of the creation. He then said that anyone that disagrees with what he has included above doesn&#8217;t have a concern with the religion of Allah. Unfortunately for him, as we can see above, his position lacks evidence since he has only relied on fabrications (according to both the Sunni and Shia hadith systems).<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on Revisitingthesalaf.org entitled: Coming Soon&#8230;Our Belief Concerning The Evil-Doers, published on the 30th of October 2012, and can be found here. This article is a quotation from the book I’itiqadat Al-Imamiyah (The Shi’ite Creed), <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/06\/10\/response-to-coming-soon-our-belief-concerning-the-evil-doers\/\" title=\"Response to: Coming Soon&#8230;Our Belief Concerning The Evil-Doers\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,5],"tags":[],"class_list":{"0":"post-462","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/462","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=462"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/462\/revisions"}],"predecessor-version":[{"id":465,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/462\/revisions\/465"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=462"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=462"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=462"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}