{"id":4633,"date":"2019-03-08T16:17:19","date_gmt":"2019-03-08T16:17:19","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4633"},"modified":"2019-03-07T23:04:21","modified_gmt":"2019-03-07T23:04:21","slug":"fake-students-of-the-imams","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/08\/fake-students-of-the-imams\/","title":{"rendered":"Fake Students of the Imams"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4633\" alt=\"\" \/>In Shi&#8217;ite biographical <em>Rijal<\/em> sources, various transmitters are often identified as companions and students of the Imams.  Multiple Twelver hadith compilers were thus said to be the students of several Imams. After a careful analysis, however, it became apparent that these claims of companionship are very arbitrary and often inaccurate. In this article we shall explore this phenomenon in light of some notable transmitters and authors of early Shi&#8217;ite hadith collections.<\/p>\n<p>It seems as though Twelver biographers and <em>Rijalists<\/em> arbitrarily claimed transmitters as companions of the <em>Imams<\/em> to simply inflate their status due to their alleged connections with the Imams.<\/p>\n<h2>Fake Students of the Imams<\/h2>\n<p>I initially identified this problem after observing a recurring theme in Shi&#8217;ite biographical sources: Shi&#8217;ite rijalists will often label transmitters as companions of the Imams, yet many of those transmitters had never transmitted a single report directly from any of the imams. Indeed one would expect companions of the Imams to directly transmit reports from them instead of transmitting falsifiable isnads through fallible transmitters who quote earlier Imams. I later discovered that Al-Khoei voiced similar objections to earlier Shi&#8217;ite authorities.<\/p>\n<p>We shall now list a few examples of this phenomenon:<\/p>\n<p><strong><span style=\"font-size: 14pt;\">1. Ibrahim b. Hashem Al-Qommi<\/span><\/strong><\/p>\n<p>Al-Tusi and Al-Kashi claimed that he was a companion of the 8th Imam, &#8216;Ali b. Musa Al-Rida. (Al-Khoei 1:290)<\/p>\n<p>Al-Khoei, however, objected to this and said:<\/p>\n<blockquote><p>It is not far-fetched for one to definitively conclude that what Al-Sheikh [Al-Tusi] and Al-Kashi claimed is incorrect. The reasoning behind this is that Ibrahim b. Hashem, as much of a prolific transmitter as he is such that no transmitter is equivalent to him, transmitted from many teachers, and they amount to around 160 men. However, there is not a single report he transmitted from Al-Rida (as) without any intermediaries between them or Yunus.<\/p>\n<p>How could Ibrahim b. Hashem be a companion of Al-Rida and Yunus, yet he does not transmit anything from them? (Al-Khoei 1:290)<\/p><\/blockquote>\n<p><strong><span style=\"font-size: 14pt;\">2. Ahmed b. Muhammad b. Khaled Al-Barqi<\/span><\/strong><\/p>\n<p>Al-Tusi listed him among the companions of the 9th Imam, Al-Jawad, and the 10th Imam, Al-Hadi (Al-Khoei 3:52). Al-Barqi, himself, also claimed to be their companion (Al-Khoei 3:53).<\/p>\n<p>This transmitter had actually compiled a hadith collection that has survived till this day, known as <em>Al-Mahasin<\/em>. What is bizarre, however, is that he did not directly transmit from any of these imams in his book. Rather, he actually transmitted reprots from them through intermediaries. This can be seen in the report Al-Barqi transmitted from &#8220;a man who witnessed Imam Al-Jawad.&#8221; (Al-Barqi 2:426).<\/p>\n<p>Surely if he were an actual companion of Al-Jawad and Al-Hadi, one would expect to observe direct transmission from them in his works.<\/p>\n<p><strong><span style=\"font-size: 14pt;\">3. Muhammad b. Al-Hassan Al-Saffar<\/span><\/strong><\/p>\n<p>Al-Tusi claimed that he was a companion of the 11th Imam, Al-Hasan Al-&#8216;Askari. (Al-Khoei 16:264).<\/p>\n<p>Al-Saffar is the author of an extant hadith collection called <em>Basa&#8217;ir Al-Darajat<\/em>. However, Al-Saffar does not transmit a single report directly from Al-Hasan Al-&#8216;Askari throughout the entire book. Surely, if he were his companion and student, he would have directly transmitted hadith from him in his book. Al-Saffar, however, opted to transmit reports from earlier imams with weak and authentic isnads.<\/p>\n<p><span style=\"font-size: 14pt;\"><strong>4. &#8216;Abdullah b. Ja&#8217;far Al-Himyari<\/strong><\/span><\/p>\n<p>Al-Tusi and Al-Barqi claimed that he was a companion of the 10th and 11th Imams, Al-Hadi and Al-&#8216;Askari. (Al-Khoei 11: 149-150)<\/p>\n<p>Al-Himyari is the author of an extant hadith collection called <em>Qurb Al-Isnad<\/em>. Throughout the book, the author does not transmit anything directly from these 2 Imams. The entire point of the book was to demonstrate the author&#8217;s relatively short chains of transmission back to the Imams; thus, this would be the most suitable place for him to directly transmit from Al-Hadi and Al-&#8216;Askari. However, there is not a single instance of direct transmission from them.<\/p>\n<p>It is claimed that Al-Himyari had authored books that contain the answers of these Imams to questions pertaining to several topics; however, these alleged books are extinct. We have no way to verify whether his transmission from them was direct or through intermediaries.<\/p>\n<h2>Conclusion<\/h2>\n<p>Indeed, these few examples attest to a significant problem in Twelver biographical sources: the tendency of Twelver authorities to arbitrarily label various transmitters as companions of the Imams in a desperate attempt to inflate their status. After evaluating the transmission of many of these alleged students of the Imams, we find not a single instance where they directly transmitted from those respective Imams, which would be expected if they were their actual students.<\/p>\n<p>The authors of early hadith collections were arbitrarily labeled as companions of the Imams even though there is no objective reason to believe that. The works of these supposed companions of the Imams similarly demonstrate that the only connection these men had with the Imams was through various intermediaries that relayed their alleged hadiths to them. This phenomenon may explain how the 2nd century Medinite, Imam Ja&#8217;far Al-Sadiq, according to Shi&#8217;ite sources, ended up having around 4000 alleged students, most of whom (surprisingly) were from the distant land of Iraq.<\/p>\n<h2 style=\"text-align: center;\"><span style=\"text-decoration: underline; font-size: 14pt;\"><strong>Sources<\/strong><\/span><\/h2>\n<p>Al-Barqi, Ahmed b. Muhammad. <em>Al-Mahasin<\/em>. Edited by Mahdi Al-Raja&#8217;i, 3rd ed., Al-Majma&#8217; Al-&#8216;Alami li Ahl Al-Bait, 2011.<\/p>\n<p>Al-Khoei, Abu Al-Qasem. <em>Mo’jam Rijal Al-Hadith<\/em>. 5th ed., Markaz Nashr Al-Thaqafah Al-Islamiyyah, 1992.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In Shi&#8217;ite biographical Rijal sources, various transmitters are often identified as companions and students of the Imams.  Multiple Twelver hadith compilers were thus said to be the students of several Imams. After a careful analysis, however, it became apparent that these <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/08\/fake-students-of-the-imams\/\" title=\"Fake Students of the Imams\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4633","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4633","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4633"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4633\/revisions"}],"predecessor-version":[{"id":4635,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4633\/revisions\/4635"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4633"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4633"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4633"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}