{"id":4639,"date":"2019-03-09T21:44:48","date_gmt":"2019-03-09T21:44:48","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4639"},"modified":"2019-03-09T21:44:48","modified_gmt":"2019-03-09T21:44:48","slug":"shia-double-standards-on-adalah-al-sahabah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/09\/shia-double-standards-on-adalah-al-sahabah\/","title":{"rendered":"Shia Double Standards on &#8216;Adalah Al-Sahabah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4639\" alt=\"\" \/>The concept of &#8216;Adalah (integrity) of the Sahabah often is a matter of controversy in Sunni-Shia polemics. Many Shi&#8217;ite polemicists, as demonstrated in this <a href=\"http:\/\/www.twelvershia.net\/2016\/06\/02\/adalat-al-sahaba\/?preview_id=3250&amp;preview_nonce=a281e6c291&amp;post_format=standard&amp;_thumbnail_id=3894&amp;preview=true\">article<\/a>, often misunderstand and distort the concept. Asides from the prevalent misrepresentation and strawmanning of the Sunni position, it is quite ironic that Twelver theology, in reality, upholds a double standard with regards to <em>&#8216;Adalah <\/em>Al-Sahabah.<\/p>\n<p>When objecting to the general trustworthiness of the Sahabah as transmitters of hadith, Twelvers will often cite a few alleged exceptions in an attempt to negate the general notion of &#8216;<em>Adalah <\/em>Al-Sahabah. We find various Twelver authorities, however, using similar reasoning to Sunni scholarship when explaining such exceptions and their implications on the transmission of Shi&#8217;ite transmitters.<\/p>\n<h2><strong>Claims of General Trustworthiness vs. Specific Claims of Weakness<\/strong><\/h2>\n<p>An interesting example of this in the Shi&#8217;ite tradition is the phenomenon known as <em>Mashayikh Al-Thiqaat <\/em>(the Teachers of the Three Reliable Narrators). This theory is based upon what is said in <em>Uddat Al-Usool<\/em> by Al-Tusi where he mentioned that Mohammad b. Abi Umayr, Safwan b. Yahya, and Ahmad b. Abi Nasr were known to only transmit from reliable transmitters. (Al-Tusi 1:154)<\/p>\n<p>After a careful analysis of their transmission, it is needless to say that they did, in fact, transmit from explicitly weak transmitters.<\/p>\n<p>Mirza Ghulam Ridha, who had authored a book on this theory, stated that when a transmitter spanned by the general endorsement is specifically criticized by an authority, then both claims of reliability and weakness are dropped. (Ridha 43)<\/p>\n<p>He then proceeds to state that the transmission of those men (i.e the three above mentioned) from those that are evidently weak, or those that are under the suspicion of being weak, <strong>does not nullify the general rule of the reliability of their teachers themselves. <\/strong>He simply asserted that the presence of a few outliers\/exceptions to the rule does not necessarily negate the generality.<\/p>\n<p>Another ironic example of this phenomenon can be found in the hadith theories of Al-Mufid where he claimed that the Companions of Ja’afar Al-Sadiq were all reliable. Even though this concept may sound foreign to the average Shi&#8217;te today, a variety of renowned classical Twelver authorities upheld a concept with their own transmitters of hadith which was similar to <em>Adalah Al-Sahabah <\/em>in some regards. Al-Hurr Al-Ameli, in <em>Amal Al-Aamil<\/em>,  described Khulayd b. Awfa saying:<\/p>\n<blockquote><p>“<strong>It would not be far-fetched to say that he is reliable because he is a companion of Al-Sadiq (as), with the exception of those that have been weakened<\/strong>, for Al-Mufeed in Al-Irshad, Ibn Shahr Ashoub in Ma’alim Al-‘Ulama’, and Al-Tabrasi in I’lam Al-Wara, upheld the reliability of four thousand of the companions of Al-Sadiq <em>(as). However, <\/em>we find in the books of <em>rijal<\/em> and hadith that they do not reach three thousand, and the Allamah and others said that Ibn Uqdah collected the names of four thousand [transmitters] that are mentioned in books of <em>rijal<\/em>, and some stated that Abu Al-Rabi’ is one of them.” (Al-Ameli 1\/83)<\/p><\/blockquote>\n<p>The Twelver scholar, Abdulhadi Al-Fadhli comments saying:<\/p>\n<blockquote><p>And some of them (the scholars) have arrived at the conclusion that all of the companions of Al-Sadiq (as)  mentioned by Al-Tusi were reliable. (Al-Fadhli 196)<\/p><\/blockquote>\n<p>He later quotes Al-Khoei who said: “this is similar to those who have considered the companions of the Prophet – peace be upon him and his progeny – reliable.”<\/p>\n<p>Al-Fadhli later states that he believes that Al-Mufeed may have been led to this conclusion based on the theory that all Muslims are inherently <em>adl<\/em>. (Al-Fadhli 198)<\/p>\n<p>The above two examples are clear indications of Twelver authorities, at various points in history, upholding generalities even though they may find exceptions to those generalizations. They firmly asserted that the presence of exceptions does not negate the generalities.  Rather exceptions are simply to be treated as outliers and nothing more. It must be said, however, that contemporary Twelver Usuli scholarship does not hold the position that all of of Ja&#8217;far&#8217;s companions are reliable.<\/p>\n<h2><strong>General Shia Claims of Trustworthiness vs. &#8216;<em>Adalah<\/em> Al-Sahabah<\/strong><\/h2>\n<p>In continuation of the previous sections, we find the need to make the reader aware of the irony in the two aforementioned claims of general trustworthiness (<em>Tawtheeqat `Aamah<\/em>) in the Shi&#8217;ite tradition. The concept of <em>Adalah <\/em>Al-Sahabah is not analogous to the general endorsement of groups of transmitters by Shi&#8217;ite authorities. These Shia hadith principles erected by Al-Mufeed and Al-Tusi were based upon nothing but their whims, for there is not a shred of proof of the reliability of all the companions of Ja’afar Al-Sadiq or <em>Mashayikh Al-Thiqaat <\/em>asides from appeals to authority and blind following.<\/p>\n<p>There is no way to prove the claim regarding <em>Mashayikh Al-Thiqat<\/em>. The opinion of the reliability of all of the three transmitters&#8217; informants is based on a statement of a fifth century scholar who was two centuries late to have met any of  these three transmitters. Unsurprisingly, he does not list a single hint of evidence to back his claim that they exclusively transmitted from reliable narrators. What is further disturbing is the fact that several top Shi&#8217;ite hadith authorities fully accepted this proposition without questioning it. Ayatollah Ja’afar Al-Subhani lists names, such as: Ibn Tawus, Al-Muhaqqiq Al-Hilli, Al-Aabi, Al-Allama Al-Hilli, Amir Al-Deen Al-Hilli, Al-Shaheed Al-Awal, Ibn Fahad Al-Hilli, Al-Muhaqqiq Al-Thaani, Al-Shaheed Al-Thani, Al-Astaraabadi, Al-Baha’i, Al-Hurr Al-Ameli, Al-Bahbahani, and Abdalnabi b. Ali b. Ahmad b. Al-Jawad, who all upheld this proposition.(Al-Subhani 209-212)<\/p>\n<p>Similarly, it is impossible for one to argue that the companions of Ja’afar Al-Sadiq were all reliable. Not only is this opinion based upon the opinion of a 4th century scholar who never met the companions of Ja’afar, but the only significant matter about Ja&#8217;far’s students was that they merely were his students. They were not known for their <em>jihad<\/em>, sacrifices for Islam, or anything of the merits that made the companions of the Prophet – peace be upon him – so special, nor are there any specific textual indicators in their transmission that would indicate their universal reliability.<\/p>\n<h2>Conclusion<\/h2>\n<p>We have already outlined the reasoning and rationale behind the notion of <em>&#8216;Adalah <\/em>Al-Sahabah in the following <a href=\"http:\/\/www.twelvershia.net\/2016\/06\/02\/adalat-al-sahaba\/?preview_id=3250&amp;preview_nonce=a281e6c291&amp;post_format=standard&amp;_thumbnail_id=3894&amp;preview=true\">article<\/a>. The point of this article, however, is to demonstrate the double standard that is upheld by many Twelver polemicists who attempt to object to the concept. Using their fallacious reasoning, Twelver polemicists do not seem to realize the the implications of some of their arguments may have drastic effects on their own hadith tradition, such as the concept of <em>Mashayikh Al-Thiqat<\/em> and other analogous propositions.<\/p>\n<p>And Allah is the best of witnesses.<\/p>\n<h2 style=\"text-align: center;\"><span style=\"text-decoration: underline;\">Sources<\/span><\/h2>\n<p>Al-&#8216;Ameli, Al-Hurr. <em>Amal Al-Aamel<\/em>. Maktabat Al-Andalus.<\/p>\n<p>Al-Fadhli, &#8216;Abdulhadi. <em>Usul &#8216;Ilm Al-Rijal<\/em>. 2nd ed., 1430.<\/p>\n<p>Al-Subhani, Ja&#8217;far. <em>Kulliyyat fi &#8216;Ilm Al-Rijal. <\/em>6th ed., Mu&#8217;assasat Al-Nashr Al-Islami, 1425.<\/p>\n<p>Al-Tusi, Muhammad b. Al-Hasan. <em>&#8216;Uddat Al-Usul<\/em>. Edited by Muhammad Rida Al-Ansari, 1st ed., Sitarah, 1417.<\/p>\n<p>Ridha, Mirza Ghulaam. <em>Mashayikh Al-Thiqaat<\/em>. 3rd ed., Markaz Al-Nashr, 1419.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The concept of &#8216;Adalah (integrity) of the Sahabah often is a matter of controversy in Sunni-Shia polemics. Many Shi&#8217;ite polemicists, as demonstrated in this article, often misunderstand and distort the concept. Asides from the prevalent misrepresentation and strawmanning of the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/09\/shia-double-standards-on-adalah-al-sahabah\/\" title=\"Shia Double Standards on &#8216;Adalah Al-Sahabah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4639","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4639","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4639"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4639\/revisions"}],"predecessor-version":[{"id":4644,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4639\/revisions\/4644"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4639"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4639"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4639"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}