{"id":4645,"date":"2019-03-10T04:44:10","date_gmt":"2019-03-10T04:44:10","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4645"},"modified":"2019-03-10T14:06:55","modified_gmt":"2019-03-10T14:06:55","slug":"murderous-sahabi-turns-out-to-be-a-truthful-transmitter-busr-bin-artaah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/10\/murderous-sahabi-turns-out-to-be-a-truthful-transmitter-busr-bin-artaah\/","title":{"rendered":"Murderous &#8220;Sahabi&#8221; Turns out to be a Truthful Transmitter (Busr bin Arta&#8217;ah)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4645\" alt=\"\" \/>Busr b. Arta&#8217;ah is a very controversial figure that is often cited in polemical discussions regarding <em>Adalah <\/em>Al-Sahabah. Though his companionship with the Prophet is contested, he is cited as a vicious and murderous Sahabi in in the context of politics. Shi&#8217;ite polemicists have thus milked this example to death, as it supposedly serves their narrative regarding the Sahabah. Nevertheless, the status of this man, in reality, is of no implications on the notion of <em>Adalah <\/em>Al-Sahabah, as demonstrated in this <a href=\"http:\/\/www.twelvershia.net\/2016\/06\/02\/adalat-al-sahaba\/\">article<\/a>.<\/p>\n<p>In this paper, we are interested in evaluating this man&#8217;s status as a transmitter of hadith by directly evaluating his transmission from the Prophet. Does his transmission sufficiently indicate that he was a forger and an untrustworthy transmitter of hadith? Or does it embody indications of his truthfulness as a transmitter? That is the question we intend to address in this article.<\/p>\n<p>Before delving into his status as a transmitter, it is important that we provide some context behind this man&#8217;s life:<\/p>\n<h2>Busr b. Arta&#8217;ah: A Brief Biography<\/h2>\n<p>Busr b. Arta&#8217;ah was an alleged companion of the Prophet from the tribe of Quraysh. His companionship with the Prophet was contested, as stated by Ibn Hajar (Ibn Hajar 1:220).  He died in 88 AH; thus, if he actually were a Sahabi, he would have been a smaller Sahabi.<\/p>\n<p>Ibn &#8216;Asaker described him saying:<\/p>\n<blockquote><p>He lived in Damascus and witnessed the battle of Siffin with Mu&#8217;awiyah, and he was in charge of the infantry. Mu&#8217;awiyah also appointed him as governor of Yemen, and he had unpraiseworthy actions over there. It is said that he became senile prior to his death. (Ibn Hajar 1:220)<\/p><\/blockquote>\n<p>Ibn Sa&#8217;d quoted the forger, Al-Waqidi, saying &#8220;The Prophet died when Busr was young. He did not hear anything from the Prophet ﷺ. (Ibn Hajar 1:220)<\/p>\n<p>Ibn Yunus said:<\/p>\n<blockquote><p>Busr was a companion of the Prophet. He witnessed the conquest of Egypt, and he drew out property in it. Mu&#8217;awiyah appointed him to Yemen and Hijaz in 40 AH, and he commanded him to seek the subjects of &#8216;Ali and victimize them. He thus committed atrocious acts in Mecca and Medina. He was also placed in charge of the navy for Mu&#8217;awiyah. He became senile in his last days.  (Ibn Hajar 1:221)<\/p><\/blockquote>\n<p>Ibn &#8216;Adiyy said: &#8220;His companionship is doubted, and I do not know of any hadiths for him asides from these two hadiths.&#8221; (Ibn Hajar 1:221)<\/p>\n<p>Al-Daraqutni said: &#8220;He has companionship, and he did not have steadfastness after the Messenger of Allah ﷺ. He was the one who killed the two children of  &#8216;Ubaydullah b. &#8216;Abbas b. &#8216;Abdulmuttalib in Yemen during the caliphate of Mu&#8217;awiyah &#8221; (Ibn &#8216;Abdilbarr 1:59)<\/p>\n<p>Al-Bukhari, in Al-Tarikh Al-Saghir, quoted Ibn Ishaq saying:<\/p>\n<blockquote><p>Mu&#8217;awiyah dispatched Busr in the year 39 AH, so he came to Medina and accepted pledges of allegiance. He then left for Mecca and Yemen, and he killed &#8216;Abdurrahman and Qatham, the sons of &#8216;Ubaydullah b. &#8216;Abbas. (Ibn Hajar 1:221)<\/p><\/blockquote>\n<p>Yahya b. Ma&#8217;in said:<\/p>\n<blockquote><p>The people of Medina deny that Busr heard anything from the Prophet ﷺ, and the people of Al-Sham transmit from him from the Messenger of Allah ﷺ.<\/p>\n<p>He also said: &#8220;Busr was a man of evil.&#8221; (Ibn Hajar 1:221)<\/p><\/blockquote>\n<p>Ibn &#8216;Abdilbarr commented on Yahya&#8217;s statement saying:<\/p>\n<blockquote><p>This was due to grave things he had committed in Islam which were transmitted by transmitters of reports and hadiths, such as his slaughtering of the two sons of &#8216;Ubaydullah b. &#8216;Abbas b. &#8216;Abdulmuttalib while they were young children in front of their mother. Mu&#8217;awiyah appointed him as governor of Yemen during Siffin, and &#8216;Ubaydullah was &#8216;Ali&#8217;s governor in Yemen at the time. He thus fled when he became aware of Busr&#8217;s approach to Yemen, and Busr settled in it. He then carried out these atrocious acts. (Ibn &#8216;Abdilbarr 1:59)<\/p><\/blockquote>\n<p>As seen in the aforementioned excerpts, there is disagreement regarding his status as a companion of the Prophet. Nevertheless, it is apparent that he committed atrocious acts when he was appointed as a governor. Ibn &#8216;Adiyy also indicated that Busr was not a prolific transmitter and that he only transmitted two reports.<\/p>\n<h2>Was he a Forger and an Untrustworthy Transmitter?<\/h2>\n<p>Shi&#8217;ite polemicists often cite this figure to undermine the general reliability of the Prophet&#8217;s companions as transmitters of hadith. Even though Busr&#8217;s companionship is contested, as demonstrated from the previous quotes, we will entertain this notion in this article and assume that he was a companion of the Prophet. If Busr b. Arta&#8217;ah actually was a forger and an untrustworthy transmitter, we would expect to observe certain trends in his transmission from the Prophet, most importantly:<\/p>\n<ul>\n<li>The transmission of interested reports that served his personal\/political interests, such as:\n<ul style=\"list-style-type: circle;\">\n<li>Reports in the virtues of his superiors, such as Mu&#8217;awiyah and the Umayyads etc.<\/li>\n<li>Reports in the condemnation of his political opponents, such as &#8216;Ali b. Abi Taleb etc.<\/li>\n<li>Reports that served his interests as a governor and bolstered his authority upon his subjects<\/li>\n<li>Reports that absolved him and his superiors from their responsibilities as rulers<\/li>\n<li>Reports in his own virtues<\/li>\n<li>Reports in the virtues of his tribe\/relatives\/homeland<\/li>\n<\/ul>\n<\/li>\n<li>Prolific transmission<\/li>\n<\/ul>\n<p>These expectations are self-evident: liars lie because they want their lies believed, and forgers usually have a motive behind their forgeries. A critic would thus expect a forger to transmit reports that served his interests in some shape or form. If we, however, note that a transmitter&#8217;s transmission primarily consists of disinterested accounts, then this would be an indicator that he was not a forger who had attempted to circulate lies that served his interests.<\/p>\n<p>After a thorough analysis of Busr&#8217;s transmission, it became apparent that he only transmitted two reports, as stated by Ibn &#8216;Adiyy. A third report is ascribed to him; however, its isnad is extremely weak and unreliable.<\/p>\n<p>Let us evaluate these two reports:<\/p>\n<h2>Report #1:<\/h2>\n<p><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr1.png\"><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4646\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr1.png\" alt=\"\" width=\"10208\" height=\"6920\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr1.png 10208w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr1-300x203.png 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr1-768x521.png 768w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr1-1024x694.png 1024w\" sizes=\"auto, (max-width: 10208px) 100vw, 10208px\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><strong>Figure 1.<\/strong> Busr b. Arta&#8217;ah&#8217;s first report<\/p>\n<p>This hadith is authentically ascribed to Busr b. Arta&#8217;ah where he quoted the Prophet saying: &#8220;The hands [of  thieves] should not be amputated during expeditions.&#8221; In some redations of the hadith, he is presented a man who stole something amidst an expedition. Busr thus said: &#8220;Had I not heard the Messenger of Allah prohibiting us from amputating hands during expeditions, then I would have severed your hand&#8221;, and he proceeded to lash him instead.<\/p>\n<p><strong>Sources<\/strong>: Musnad Al-Darimi #2534, Jami&#8217; Al-Tirmidhi #1450, Sunan Al-Nasa&#8217;i #4979, Sunan Abi Dawud #4408, Al-Ahad wal-Mathani #860, Mo&#8217;jam Al-Sahabah by Ibn Qani&#8217; 1\/84, Musnad Ahmed b. Hanbal #17626 &amp; 17627.<\/p>\n<h2>Report #2:<\/h2>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr2A.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4651\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr2A.png\" alt=\"\" width=\"10584\" height=\"6120\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr2A.png 10584w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr2A-300x173.png 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr2A-768x444.png 768w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Busr2A-1024x592.png 1024w\" sizes=\"auto, (max-width: 10584px) 100vw, 10584px\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><strong>Figure 2.<\/strong> Busr b. Arta&#8217;ah&#8217;s second report<\/p>\n<p>In this hadith, Busr quoted the Prophet saying in his du&#8217;a: &#8220;O Allah make well our endings in all affairs, and protect us from the disgrace of this world and the torment of the Hereafter.&#8221;<\/p>\n<p>In some redactions of the hadith, Busr is told: &#8220;You always repeat these prayers.&#8221; Busr thus replied: &#8220;I heard the Messenger of Allah make du&#8217;aa by them, and I shall never leave them until I die.&#8221;<\/p>\n<p>This report is ascribed to Busr b. Arta&#8217;ah primarily through two transmitters: Ayyub b. Maysarah and Busr&#8217;s client, Yazid.<\/p>\n<p>Ayyub was a decent transmitter who was a bit obscure, and Yazid was unknown. Their transmission, nevertheless, indicates that this report has a basis from Busr, since they both corroborated each other.<\/p>\n<p><strong>Sources<\/strong>: Musnad Ahmed #17628,  Al-Mustadrak #6508,  Sahih Ibn Hibban #949, Al-Mo&#8217;jam Al-Kabir #1196, Al-Tarikh Al-Kabir #42, Al-Jarh wal-Ta&#8217;dil by Ibn Abi Hatem 1\/288,  Al-Zuhd by Ibn Abi &#8216;Asem #260.<\/p>\n<h2>Discussion<\/h2>\n<p>A careful analysis of Busr&#8217;s transmission sufficiently demonstrates the lack of interested reports in his pool of transmission. Busr does not transmit a single report regarding any of his political and personal affairs outlined earlier in this article. His few reports are all disinterested. The first report simply pertains to a ruling in jurisprudence Busr claimed to have heard from the Messenger of Allah. The second report involves a du&#8217;a he simply claimed to have heard from the Messenger of Allah ﷺ. The du&#8217;a is not bizarre, and elements of it can be found in the Quran and Sunnah.<\/p>\n<p>As a notorious governor, Busr, in reality, had no deterrent that would have prevented him from forging reports. He simply could have claimed to have heard many reports from the Prophet, and no one one would have been able to object to his claims. After an examination of his transmission, one does not see any hints of that practice. Rather, he was quite a scarce transmitter of hadith, and this is demonstrated by the fact that he only has two documented reports. Busr clearly was not walking around arbitrarily ascribing reports to the Prophet in an attempt to bolster his own interests.<\/p>\n<p>Ironically, Shi&#8217;ite polemicists, in this context, slander Muslim hadith collections by claiming that they were all based on Umayyad influence and forgery. However, it is quite ironic that we rarely see any transmission from these pro-Umayyad hadith figures in the Sunni hadith corpus.  When these figures occasionally transmit a report in Sunni hadith collections, that report is almost always disinterested and of no political implications.<\/p>\n<h2>Conclusion<\/h2>\n<p>With various authorities making conflicting claims regarding his companionship, it is not clear whether Busr b. Arta&#8217;ah actually was a companion of the Prophet. It is evident, however, that he was a man who committed vile and atrocious acts, and the early Sunni hadith critics saw no problem in criticizing him and his actions. With that being said, his transmission does not indicate that he was a forger who fabricated reports that served his interests. Rather, his transmission is characteristic of the transmission of many small Sahabis: disinterested and scarce. It is not alarming, nor is it abnormal.<\/p>\n<p>Busr serves as a good example that demonstrates how Shi&#8217;ite polemicists misconstrue the notion of &#8216;<em>Adalah <\/em>Al-Sahabah for several reasons:<\/p>\n<ol>\n<li>His companionship is contested, yet Shi&#8217;ites desperately assert that he was a companion of the Prophet, bypassing various authorities.<\/li>\n<li>His transmission does not embody any indicators of forgery.<\/li>\n<\/ol>\n<p>Thus, his actions throughout his life have no necessary implications on the general reliability of the Sahabah as transmitters of hadith, nor do they seem to have any implications on his own status as a transmitter as well. Either way, Allah will justly judge him on the Day of Judgement for what he had done:<\/p>\n<blockquote><p>The Day they shall come forth, and nothing that concerns them will be concealed from Allah . To whom belongs [all] sovereignty this Day? To Allah, the One, the Prevailing! This Day every soul shall be recompensed for what it earned. There is no injustice today! Indeed, Allah is swift in account. [Quran 40:16-17]<\/p><\/blockquote>\n<p>And Allah is the best of witnesses.<\/p>\n<h2 style=\"text-align: center;\"><span style=\"text-decoration: underline;\">Sources<\/span><\/h2>\n<p>Ibn &#8216;Abdilbarr, Abu &#8216;Umar.  <em>Al-Isti&#8217;ab fi Ma&#8217;rifat Al-Ashab<\/em>. Edited by Ali Muhammad Al-Bajjawi, 1st ed., Dar Al-Jil, 1992.<\/p>\n<p>Ibn Hajar, Ahmed. <em>Tahdib Al-Tahdhib<\/em>. Edited by Ibrahim Al-Zibaq and Adel Murshed, 1st ed., Mu&#8217;assasat Al-Resalah, 2014.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Busr b. Arta&#8217;ah is a very controversial figure that is often cited in polemical discussions regarding Adalah Al-Sahabah. Though his companionship with the Prophet is contested, he is cited as a vicious and murderous Sahabi in in the context of politics. Shi&#8217;ite <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/10\/murderous-sahabi-turns-out-to-be-a-truthful-transmitter-busr-bin-artaah\/\" title=\"Murderous &#8220;Sahabi&#8221; Turns out to be a Truthful Transmitter (Busr bin Arta&#8217;ah)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4645","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4645","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4645"}],"version-history":[{"count":14,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4645\/revisions"}],"predecessor-version":[{"id":4665,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4645\/revisions\/4665"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4645"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4645"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4645"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}