{"id":4664,"date":"2019-03-10T23:00:08","date_gmt":"2019-03-10T23:00:08","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4664"},"modified":"2019-03-13T03:36:22","modified_gmt":"2019-03-13T03:36:22","slug":"analyzing-muawiyah-bin-abi-sufyans-reliability-as-a-transmitter-of-hadith","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/10\/analyzing-muawiyah-bin-abi-sufyans-reliability-as-a-transmitter-of-hadith\/","title":{"rendered":"Analyzing Mu&#8217;awiyah bin Abi Sufyan&#8217;s Reliability as a Transmitter of Hadith"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4664\" alt=\"\" \/>Mu&#8217;awiyah b. Abi Sufyan is a companion of the Prophet who is regularly slandered by the Shia due to his role as a political rival of &#8216;Ali b. Abi Taleb. Twelver hadith collections are saturated with reports that present him as a disbeliever, hypocrite and an enemy of God. Shi&#8217;ite authorities have similarly held the belief that Mu&#8217;awiyah was behind the alleged widespread fabrication of historical reports and Prophetic traditions in an attempt to propagate his own political interests.<\/p>\n<p>This article comes in light of various debates on <a href=\"http:\/\/www.twelvershia.net\/2016\/06\/02\/adalat-al-sahaba\/\"><em>&#8216;<\/em><em>Adalah<\/em> Al-Sahabah,<\/a> where Shi&#8217;ite polemicists have attempted to cast doubts on the entire concept. It is often claimed that Mu&#8217;awiyah himself fabricated reports and similarly enticed other companions of the Prophet to fabricate hadiths. We have thus decided to evaluate  Mu&#8217;awiyah&#8217;s status as a transmitter by directly analyzing his transmission from the Prophet. Does his transmission from the Prophet embody any indications of forgery? Or does his transmission indicate his reliability and truthfulness as a transmitter?<\/p>\n<h2>What We Would Expect to Observe if He Were a Liar:<\/h2>\n<p>As stated in the past,  liars lie because they want their lies believed, and forgers usually have a motive behind their forgeries. A critic would thus expect a forger to transmit reports that served his interests in some shape or form. If we, however, note that a transmitter’s transmission primarily consists of disinterested accounts, then this would serve to dispel the notion that he was a forger of reports.<\/p>\n<p>Since Mu&#8217;awiyah was an affluent political figure from a prominent family, one expect to observe certain trends in his transmission if he actually were a forger:<\/p>\n<ul>\n<li>The prolific and exclusive transmission of interested reports that served his personal\/political interests, such as:\n<ul style=\"list-style-type: circle;\">\n<li>Reports in his virtues and the virtues of his relatives (i.e his father, clan and tribe)<\/li>\n<li>Reports in the condemnation of his political opponents, such as ‘Ali b. Abi Taleb and his supporters<\/li>\n<li>Reports that served his interests as a governor and bolstered his authority upon his subjects<\/li>\n<li>Reports that absolved him his responsibility and accountability as a ruler<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>Since Mu&#8217;awiyah was a powerful ruler , no deterrent existed to prevent him from fabricating reports and ascribing them to the Prophet. Mu&#8217;awiyah could have disseminated fabricated traditions with minimal resistance, since he was a an established companion of the Prophet surrounded by his supporters.<\/p>\n<p>Now, we shall evaluate all of Mu&#8217;awiyah&#8217;s reports documented in the two Sahihs, and perhaps we shall expand the scope of this study in the future, God-willing. If Mu&#8217;awiyah was such a notorious forger as claimed by Twelvers, then surely we would expect to see some hints of these alleged political forgeries in the two most revered Sunni hadith collections.<\/p>\n<h2>Analysis<\/h2>\n<p>Mu&#8217;awiyah has 13 prophetic Traditions documented in the two Sahihs. Let us evaluate them in search of any indicators of forgery:<\/p>\n<h3>Report #1:<\/h3>\n<p>Multiple transmitters reported that they heard Mu&#8217;awiayh say while giving a sermon:<\/p>\n<blockquote><p>I heard the Messenger of Allah say: &#8221; When Allah wills good for a person, He causes him to understand the religion. I am but a distributor, and Allah is the bestower.&#8221; (Muslim #1037 &amp; Bukhari#3116)<\/p><\/blockquote>\n<p>The report is identically corroborated by Abu Hurayrah (<a href=\"https:\/\/al-maktaba.org\/book\/25794\/5703#p1\" rel=\"external nofollow\">Musnad Ahmed #7194<\/a>).<\/p>\n<p>The first clause of the report regarding the understanding of the religion is corroborated by Ibn &#8216;Abbas. (<a href=\"https:\/\/sunnah.com\/tirmidhi\/41\/1\" rel=\"external nofollow\">Jami&#8217; Al-Tirmidhi #2645<\/a>).<\/p>\n<p>The second clause about the Prophet being the distributer is corroborated by Jaber b. &#8216;Abdillah (<a href=\"https:\/\/sunnah.com\/bukhari\/78\/220\" rel=\"external nofollow\">Sahih Al-Bukhari #6196<\/a>).<\/p>\n<h3>Report #2:<\/h3>\n<p>&#8216;Isa b. Talha reported that Mu&#8217;awiyah once said:<\/p>\n<blockquote><p>Those who give adhan are of the longest necks among the people on the Day of Judgement. (Muslim #387)<\/p><\/blockquote>\n<p>This report is corroborated by Abu Hurayrah (<a href=\"https:\/\/al-maktaba.org\/book\/31691\/3374\" rel=\"external nofollow\">Sahih Ibn Hibban #1670<\/a>).<\/p>\n<p>What is interesting is that this report is also transmitted from &#8216;Ali b. Abi Taleb in the Zaidi hadith collection, Musnad Zaid (Musnad Zaid 68). We hold the position that this source is unreliable , but it is an interesting observation in light 0f Sunni-Shia polemics.<\/p>\n<p>The same account is reported in other sources from other companions, such as Anas b. Malik, Bilal b. Rabah, and Zaid b. Arqam, but they are all weak.<\/p>\n<h3>Report #3:<\/h3>\n<p>Humayd b. &#8216;Abdurrahman reported that Mu&#8217;awiyah once said:<\/p>\n<blockquote><p>O people of Medina, where are your scholars? I heard the Messenger of Allah say: &#8220;This is the day of &#8216;Ashura. Allah did not make fasting in it obligatory upon you, but I am fasting. Whoever wills to fast, then let him fast; and whoever does not, then let him break his fast. (Bukhari #2003 &amp; Muslim #1129)<\/p><\/blockquote>\n<p>This report is corroborated by &#8216;Abdullah b. &#8216;Umar. (<a href=\"https:\/\/sunnah.com\/muslim\/13\/150\" rel=\"external nofollow\">Sahih Muslim #1126<\/a>)<\/p>\n<h3>Report #4:<\/h3>\n<p>&#8216;Umayr b. Hani&#8217; reported that Mu&#8217;awiyah, while on the pulpit, one said:<\/p>\n<blockquote><p>I heard the Prophet : &#8220;There shall be a group from my Ummah that will continue to uphold the command of Allah, not harmed by those who let them down or oppose them until the Allah&#8217;s Order comes to them while they are in that state.&#8221; (Muslim #1037)<\/p><\/blockquote>\n<p>This hadith is authentically corroborated by over five companions of the Prophet: Jabir b. &#8216;Abdillah (<a href=\"https:\/\/sunnah.com\/muslim\/33\/249\" rel=\"external nofollow\">Sahih Muslim #1923<\/a>), Thawban b. Bajdad (<a href=\"https:\/\/sunnah.com\/tirmidhi\/33\/72\" rel=\"external nofollow\">Jami&#8217; Al-Tirmidhi #2229<\/a>), Qurrah b. Iyas (<a href=\"https:\/\/sunnah.com\/urn\/1300050\" rel=\"external nofollow\">Sunan Ibn Majah<\/a>), Al-Mughirah b. Sho&#8217;bah (<a href=\"https:\/\/al-maktaba.org\/book\/33769\/3291\" rel=\"external nofollow\">Sunan Al-Darimi #2476<\/a>),  Salamah b. Nufayl (<a href=\"https:\/\/al-maktaba.org\/book\/25794\/13470#p1\" rel=\"external nofollow\">Musnad Ahmed #16965<\/a>).<\/p>\n<h3>Report #5:<\/h3>\n<p>As&#8217;ad b. Sahl said:<\/p>\n<blockquote><p>I heard Mu&#8217;awiyah while he was sitting on the pulpit, and the mu&#8217;ezzin said: &#8220;Allahu Akbar, Allahu Akbar.&#8221; Mu&#8217;awiyah thus said: &#8220;Allahu Akbar, Allahu Akbar.&#8221; The mu&#8217;ezzin then said: &#8220;I bear witness that there is no deity worthy of worship except Allah.&#8221; Mu&#8217;awiyah thus said: &#8220;I do as well.&#8221; The mu&#8217;ezzin then said: &#8220;I bear witness that Muhammad is the Messenger of Allah.&#8221; Mu&#8217;aiyah thus said: &#8220;I do as well.&#8221;<\/p>\n<p>When the Adhan was over, Mu&#8217;aiyah said: &#8220;O people, I heard the Messenger of Allah while he was in my position say what you heard me say as the mu&#8217;ezzin called for prayer.&#8221; (Bukhari #914)<\/p><\/blockquote>\n<p>This hadith is authentically corroborated by Abu Sa&#8217;id Al-Khudri (<a href=\"https:\/\/sunnah.com\/muslim\/4\/12\" rel=\"external nofollow\">Sahih Muslim #383<\/a>), &#8216;Umar b. Al-Khattab (<a href=\"https:\/\/sunnah.com\/abudawud\/2\/137\" rel=\"external nofollow\">Sunan Abi Dawud #527<\/a>), &#8216;Abdullah b. &#8216;Amr (<a href=\"https:\/\/sunnah.com\/urn\/1106830\" rel=\"external nofollow\">Sunan Al-Nasa&#8217;i #679<\/a>) and others.<\/p>\n<h3>Report #6:<\/h3>\n<p>Ibn &#8216;Abbas reported that Mu&#8217;aiyah said:<\/p>\n<blockquote><p>&#8220;I clipped the Prophet&#8217;s hair with an arrowhead at Al-Marwah&#8221; or &#8220;I saw the Prophet&#8217;s hair being clipped with an arrowhead at Al-Marwah.&#8221; (Bukhari #1730 and Muslim #1246)<\/p><\/blockquote>\n<p>Mu&#8217;awiyah was the only companion to transmit this report.<\/p>\n<h3>Report #7:<\/h3>\n<p>Jarir b. &#8216;Abdillah reported that Mu&#8217;awiyah said:<\/p>\n<blockquote><p>The Messenger of Allah died when he was 63 years old. Abu Bakr died when he was 63 years old. &#8216;Umar was killed when he was 63 years old. (Muslim #2352)<\/p><\/blockquote>\n<p>The content of this report is authentically corroborated by Anas b. Malik (<a href=\"https:\/\/al-maktaba.org\/book\/31691\/12887\" rel=\"external nofollow\">Sahih Ibn Hibban #6389<\/a>).<\/p>\n<p>Part of this report is also corroborated by Ibn &#8216;Abbas (<a href=\"https:\/\/al-maktaba.org\/book\/25794\/1621\" rel=\"external nofollow\">Musnad Ahmed #2242<\/a>) and &#8216;A&#8217;isha (<a href=\"https:\/\/sunnah.com\/urn\/735250\" rel=\"external nofollow\">Jami&#8217; Al-Tirmidhi #3654<\/a>).<\/p>\n<h3>Report #8:<\/h3>\n<p>Sa&#8217;id b. Al-Musayyab said:<\/p>\n<blockquote><p>During Mu&#8217;awiyah&#8217;s final visit to Medina, he gave a sermon. He grabbed a hair extension and then said: &#8220;I didn&#8217;t think that anyone would use these asides from the Jews. The Prophet referred to this practice as cheating. (Bukhari #5938 &amp; Muslim #2127)<\/p><\/blockquote>\n<p>The prohibition of hair extensions is authentically corroborated by Ibn &#8216;Umar (<a href=\"https:\/\/sunnah.com\/urn\/730050\" rel=\"external nofollow\">Jami&#8217; Al-Tirmidhi #2783<\/a>), &#8216;A&#8217;isha (<a href=\"https:\/\/sunnah.com\/nasai\/48\/58\" rel=\"external nofollow\">Sunan Al-Nasa&#8217;i #5097<\/a>), and Ibn &#8216;Abbas (<a href=\"https:\/\/al-maktaba.org\/book\/33038\/28479\" rel=\"external nofollow\">Musannaf Ibn Abi Shaybah #25224<\/a>).<\/p>\n<h3>Report #9:<\/h3>\n<p>Muhammad b. Jubayr b. Mut&#8217;im reported:<\/p>\n<blockquote><p>While Mu&#8217;awiyah was in the presence of a delegation from Quraysh, and he was informed that &#8216;Abdullah b. &#8216;Amr was saying that there shall be a ruler from the tribe of Qahtan. Mu&#8217;awiyah thus became angry, ascended the pulpit, and praised Allah with praise of which He is worthy. He then said: &#8220;I was informed that some men among you have been relaying statements not found in the Book of Allah or transmitted from His Messenger. Those are the ignorant ones among you. So be ware of wishes that mislead their wishers. I have heard the Messenger of Allah say: &#8220;This matter [rulership] is in Quraysh. There is not a person who antagonizes them except that Allah shall shove him upon his face, as long as they are upholding the religion.&#8221; (Bukhari #3500)<\/p><\/blockquote>\n<p>The exclusivity of rulership among the tribe of Quraysh is corroborated by Anas b. Malik Al-Ansari (<a href=\"https:\/\/al-maktaba.org\/book\/1456\/2677\" rel=\"external nofollow\">Musnad Al-Tayalisi #2247<\/a>) and Ibn &#8216;Umar (<a href=\"https:\/\/al-maktaba.org\/book\/4407\/1899\" rel=\"external nofollow\">Musnad Ibn Al-Ja&#8217;d #2104<\/a>). &#8216;Ali b. Abi Taleb is also reported to have said this in Sunni sources; however the isnads to him are weak. He is, however, quoted saying this in <a href=\"http:\/\/shiaonlinelibrary.com\/%D8%A7%D9%84%D9%83%D8%AA%D8%A8\/1108_%D9%86%D9%87%D8%AC-%D8%A7%D9%84%D8%A8%D9%84%D8%A7%D8%BA%D8%A9-%D8%AE%D8%B7%D8%A8-%D8%A7%D9%84%D8%A5%D9%85%D8%A7%D9%85-%D8%B9%D9%84%D9%8A-%D8%B9-%D8%AC-%D9%A2\/%D8%A7%D9%84%D8%B5%D9%81%D8%AD%D8%A9_27\" rel=\"external nofollow\">Nahj Al-Balaghah #144<\/a>.<\/p>\n<h3>Report #10:<\/h3>\n<p>Abu Sa&#8217;id Al-Khudri reported that Mu&#8217;awiyah said:<\/p>\n<blockquote><p>The Messenger of Allah once approached a gathering of his companions, so he asked them: &#8220;What has you seated over here?&#8221; They said: &#8220;We sat hear remembering Allah and thanking Him for guiding us to Islam and His bounties upon us.&#8221; The Prophet thus asked: &#8220;By Allah, is that the only reason why you are seated here?&#8221; They said: &#8220;By Allah that is the only reason that has us seated.&#8221; The Prophet thus said: &#8220;I do not ask you out of suspicion. Rather, Jibril came to me and informed me that Allah boasts the angels with your gathering.&#8221; (Muslim #2701)<\/p><\/blockquote>\n<p>Mu&#8217;awiyah was the only companion of the Prophet to transmit this account.<\/p>\n<h3>Report #11:<\/h3>\n<p>Hammam b. Munabbih reported that Mu&#8217;awiyah said:<\/p>\n<blockquote><p>The Messenger of Allah said: &#8220;Do not press me when you ask for something. There is not a person who asks me for something, and I give it to him while I am in a state of disapproval, except that Allah does not place barakah in what I had given him.&#8221; (Muslim #1038)<\/p><\/blockquote>\n<p>This hadith is authentically corroborated by &#8216;Abdullah b. &#8216;Umar (<a href=\"https:\/\/al-maktaba.org\/book\/32852\/5648\" rel=\"external nofollow\">Musnad Abi Ya&#8217;la #5628<\/a>)<\/p>\n<h3>Report #12:<\/h3>\n<p>Al-Sa&#8217;ib b. Yazid  reported that Mu&#8217;awiyah told him:<\/p>\n<blockquote><p>If you pray Friday prayer, then do not follow it with another prayer until you speak or leave the premise, for the Messenger of Allah commanded us to not connect a prayer with another one until we talk or leave [in between both prayers.]&#8221; (Muslim #883)<\/p><\/blockquote>\n<p>Mu&#8217;awiyah was the only companion of the Prophet to transmit this report.<\/p>\n<h3>Report #13:<\/h3>\n<p>Humran b. Aban reported that Mu&#8217;awiyah said:<\/p>\n<blockquote><p>You pray a prayer, and we accompanied the Messenger of Allah, yet we did not see him pray it. He had prohibited it &#8211; referring to the two rak&#8217;as after Asr prayer. (Bukhari #587)<\/p><\/blockquote>\n<p>The prohibition of prayer after &#8216;Asr prayer is authentically corroborated by four companions of the Prophet:  &#8216;Amr b. &#8216;Abasah (<a href=\"https:\/\/al-maktaba.org\/book\/25794\/13534\" rel=\"external nofollow\">Musnad Ahmed #17014<\/a>), Abu Hurayrah (<a href=\"https:\/\/sunnah.com\/urn\/1313050\" rel=\"external nofollow\">Sunan Ibn Majah #1248),<\/a> Ibn &#8216;Abbas (<a href=\"https:\/\/al-maktaba.org\/book\/1446\/2043\" rel=\"external nofollow\">Sahih Ibn Khuzaymah #1272<\/a>), Abu Sa&#8217;id Al-Khudri (<a href=\"https:\/\/sunnah.com\/urn\/1105680\" rel=\"external nofollow\">Sunan Al-Nasa&#8217;i #567<\/a>) and others.<\/p>\n<h2>Discussion<\/h2>\n<p>Though the findings in this article are not surprising, they may be revolutionary.<\/p>\n<p>Let us first discuss the contents of Mu&#8217;awiyah&#8217;s transmission:<\/p>\n<p>Almost all of the reports Mu&#8217;awiyah transmitted have no relationship to politics whatsoever. The only report he transmitted that has political implications is report #9. He is, however, corroborated in the transmission of this report by Anas b. Malik, who was not from Quraysh. What is noteworthy is that the content of this report does not necessarily serve Mu&#8217;awiyah&#8217;s interests. It is too ambiguous for him to be able to thoroughly utilize it, which is why the same statement is found in Shi&#8217;ite sources ascribed to his main political opponent, &#8216;Ali b. Abi Taleb!<\/p>\n<p>Nevertheless, the rest of his transmission is disinterested and involves various miscellaneous matters. Mu&#8217;awiyah did not transmit Prophetic traditions where he claimed to have heard the Prophet praising his family or clan. He did not transmit interested political reports that bolstered his strength and power as a ruler. He did not transmit reports that condemned his political opponents. It is quite ironic how Twelvers accuse Mu&#8217;awiyah of being the head of Nasibi hadith fabrication, yet we do not find a single indicator of forgery in his actual transmission from the Prophet.<\/p>\n<p>Now that we have outlined the content of his reports, let us discuss another aspect of his transmission, corroboration and exclusivity:<\/p>\n<p>Out of the 13 hadiths he transmitted, Mu&#8217;awiyah was corroborated in 10 of them by various companions of the Prophet. This is a solid finding, as we can now be assured that the vast majority of Mu&#8217;awiyah&#8217;s transmission in the two Sahihs is directly  corroborated. The thee reports he exclusively transmitted (#6, #10 and #13) are not problematic in any shape or form: (1) They are not interested accounts and (2) It is understandable why Mu&#8217;awiyah would be the sole transmitter of those reports.<\/p>\n<p>The fact that we cannot find a single report exclusively transmitted by Mu&#8217;awiyah that would serve his political\/personal interests says a lot about his status as a transmitter. As a caliph who was an established companions of the Prophet, Mu&#8217;awiyah had the ability to fabricate Prophetic traditions and claim he had heard them from him. No one would have been able to object to him in this context. His transmission, however, has no indications of this practice. Rather, most of it is corroborated and not even related to politics!<\/p>\n<h2>Conclusion<\/h2>\n<p>A careful examination of Mu&#8217;awiyah&#8217;s transmission in the two Sahihs is sufficient to dispel the claim that Mu&#8217;awiyah was a notorious forger of reports who fabricated traditions to bolster his political interests. Asides from dispelling this baseless Shi&#8217;ite conspiracy theory, this study serves to demonstrate Mu&#8217;awiyah&#8217;s truthfulness and reliability as a transmitter of hadith for several reasons:<\/p>\n<ol>\n<li>His transmission is mostly corroborated by other companions of the Prophet.<\/li>\n<li>His transmission primarily consists of disinterested accounts.<\/li>\n<\/ol>\n<p>The Shi&#8217;ite polemicist, in this context, has only two options: (1) acknowledge the validity of these findings or (2) undermine the influence Mu&#8217;awiyah and his party actually had on the compilation two Sahihs. Either way, a baseless Twelver conspiracy theory is dispelled, and the Shi&#8217;ite polemicists cannot have his cake and eat it.<\/p>\n<p>Indeed, it is always a pleasant sight to observe baseless conspiracy theories being teared apart with live data. Nevertheless, it is unfortunate that some will opt to latch onto these problematic conspiracy theories after being made aware of their defects.<\/p>\n<blockquote><p>How many a sign is there in the heavens and on earth which they pass by [unthinkingly], and yet they turn away from them in indifference! [Quran 12:105]<\/p><\/blockquote>\n<p><span style=\"font-size: 12pt; font-family: georgia, palatino, serif;\">And Allah is the Witness of Abu Al-Abbas.<\/span><\/p>\n<h2 style=\"text-align: center;\"><span style=\"text-decoration: underline;\">Sources<\/span><\/h2>\n<p>Al-Bukhari, Muhammad b. Isma’il. <em>Sahih Al-Bukhari<\/em>. Edited by Muhammad Al-Nasser, 1st ed., Dar Tawq Al-Najah, 1422.<\/p>\n<p>Ibn Al-Hajjaj, Muslim. <em>Sahih Muslim<\/em>. Edited by  Muhammad Fuad Abdulbaqi, Dar Ihyaa Al-Turath Al-Arabi, 1954.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Mu&#8217;awiyah b. Abi Sufyan is a companion of the Prophet who is regularly slandered by the Shia due to his role as a political rival of &#8216;Ali b. Abi Taleb. Twelver hadith collections are saturated with reports that present him <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/10\/analyzing-muawiyah-bin-abi-sufyans-reliability-as-a-transmitter-of-hadith\/\" title=\"Analyzing Mu&#8217;awiyah bin Abi Sufyan&#8217;s Reliability as a Transmitter of Hadith\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4664","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4664","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4664"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4664\/revisions"}],"predecessor-version":[{"id":4679,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4664\/revisions\/4679"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4664"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4664"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4664"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}