{"id":467,"date":"2013-06-10T22:12:57","date_gmt":"2013-06-10T22:12:57","guid":{"rendered":"http:\/\/twelvershia.net\/?p=467"},"modified":"2017-02-21T12:27:36","modified_gmt":"2017-02-21T12:27:36","slug":"467","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/06\/10\/467\/","title":{"rendered":"Response to: Imam Mehdi (ajf) in Rabbinical Literature"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=467\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on Revisitingthesalaf.org entitled: &#8220;Imam Mehdi (ajf) in Rabbinical Literature&#8221;, published on the 4th of March 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/03\/imam-mehdi-ajf-in-bible.html\" rel=\"nofollow external\">here<\/a>.<a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/03\/imam-mehdi-ajf-in-bible.html\" rel=\"nofollow external\"><br \/>\n<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">This article on RTS is one of the most absurd; because <strong>RTS encourages and supports the Jews, who still await for their &#8220;coming&#8221; Messiah, whereas, in reality Jews had already rejected the Messiah (Jesus) when he was sent to them. Instead of spreading the guidance of Islam and informing the Jews that their Messiah whom God sent to them is Jesus son of Mary (as) the Shia of RTS agree with the Jews that the awaited Messiah is yet to come!! Maybe there’s a hidden agenda by RTS to please their Jewish Masters? Doesn&#8217;t RTS know that the Messiah whom the Jews are awaiting is `Isa (as), and they had rejected this Messiah a long time ago? Why play dumb and claim he&#8217;s their 12th hidden Imam?<\/strong><\/p>\n<p style=\"text-align: justify;\">In the article which is titled as “Imam Mehdi (ajf) in Rabbinical Literature”, RTS tried to show that their mythical hidden Imam, is the Messiah prophesized in Rabbinical literature. The word “Rabbinical” means: [Of or pertaining to Rabbis or their learning, writings, etc.] So this literature which RTS used to support their mythical belief isn&#8217;t from any heavenly book which was given to nations in past, rather this literature is the writing of Jewish Rabbis. It’s their views and understandings. And as Muslims, we know where the Rabbis stand when it comes to their understandings and their views, we know that they are rubbish in our sight to say the least.<\/p>\n<p style=\"text-align: justify;\">RTS tried to somehow fit their mythical Imam Mehdi to be the Messiah mentioned in the Rabbinical Literature. So let us analyze if their mythical Imam Mehdi, is the right candidate to be considered as Messiah from Rabbinical Literature, or it’s just another fraud and deceit from RTS; And is there any other candidate who fits as the Messiah mentioned in the Rabbinical Literature?<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000;\"><strong>WHO IS THE KNOWN MESSIAH FOR MUSLIMS AND CHRISTIANS?<\/strong><\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"><strong>Answer:<\/strong> Muslims and Christians agreed upon the fact that, Jesus son of Mary (peace be upon both) is the true Messiah. This fact can be proven from Muslim as well as Christian scriptures.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We read in Glorious Quran:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">When the angels said: O Marium, surely Allah gives you good news with a Word from Him (of one) whose name is the &#8216;. <span style=\"color: #000080;\"><strong>Messiah<\/strong><\/span>, Isa son of Marium, worthy of regard in this world and the hereafter and of those who are made near (to Allah). [Quran 3:45].<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We read in Bible:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">One of the two who heard John speak and followed Jesus was Andrew, Simon Peter&#8217;s brother. He first found his own brother Simon and said to him, “We have found the <strong><span style=\"color: #000080;\">Messiah<\/span>”<\/strong>. [John 1:40-41].<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000;\"><strong>CAN IMAM MAHDI BE CONSIDERED AS MESSIAH (MASIH)?<\/strong><\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><strong>Answer<\/strong>: Ahlesunnah do not consider Imam Mehdi(as) to be a Messiah, it’s the view of a deviant and heretic cult of Qadiyanis, who consider the Messiah and the Mehdi to be one and the same.  So it seems that RTS has followed the footsteps of their Qadiyani brethren and claimed that Messiah is Imam Mehdi.<\/p>\n<p style=\"text-align: justify;\">Al-Mahdi and Messiah are two different personalities. In fact, the equivalent word of &#8220;Messiah&#8221; in Islam is &#8220;al-Maseeh&#8221; from &#8220;Masaha&#8221; which means &#8220;Wiped&#8221; in Arabic. Because `Isa (as) used to wipe the sick with his hand, this word has been used in the Quran as the title of Prophet Jesus (AS). As such, the &#8220;Messiah&#8221; is the Prophet Jesus(AS) and not the Imam al-Mahdi (AS). <strong>However, the word &#8220;Messiah&#8221; in English has another meaning, that is &#8220;Savior&#8221;. As a result, there have been some English translators who used the word &#8220;Messiah&#8221; for Imam al-Mahdi (AS) with the meaning of &#8220;Savior&#8221; which does NOT have anything to do with Arabic word &#8220;al-Maseeh&#8221;.<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000;\"><strong>THE MESSIAH IN RABBINICAL LITERATURE, JESUS (PBUH) OR THE MYTHICAL MEHDI OF SHIAS?<\/strong><\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><strong>RTS says:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Rabbinical literature prophecized that the King Messiah (the Qaim) would go through a Ghayba (occultation) : <\/span><\/p>\n<\/blockquote>\n<div style=\"text-align: justify;\">\n<blockquote>\n<div><span style=\"color: #ff0000;\">Abarbanel; Yeshuot Moshicho 1:2:2 “The Moshiach will have to die in order to purify the generation and <strong>he will wait in a spiritual state in “heaven” <\/strong>until he rises from the dead, as it says in the Talmud Sanhedrin [98b].”<\/span><span style=\"color: #ff0000;\">Zohar; Parashat Balak 203b states that the Moshiach will have to “die,” which means go to a higher spiritual level, and return again with the new level he has attained.<\/span><span style=\"color: #ff0000;\">Rabbi Isaac Luria in his comment on Zohar, Parashat Shemot 8b says: “the man destined to be Moshiach births naturally in this world, and to him is given the [whole] spirit of Moshiach from Gan Eden, making him realize he’s the Moshiach, then <strong>he shall be hidden, risen to heaven, and then he shall be completely revealed<\/strong><strong> <\/strong>and Israel will recognize him as Moshiach” (Zohar Harakia).<\/span><\/div>\n<\/blockquote>\n<p>As we previously stated, the one who fits the description of Messiah is Prophet `Isa (as). The quote from rabbinical literature states that the Messiah will wait in a spiritual state in Heaven and will then return. This perfectly applies to Messiah Jesus(pbuh).<\/p>\n<p><strong>The below verses of Quran indicate, Messiah Jesus(pbuh) was taken and raised to heaven, which is the Ghayba(occultation) that RTS claims to be for their mythical Imam:<\/strong><\/p>\n<p>When God said, &#8216;Jesus, I will take you to Me and will raise you to Me, and I will purify you (of the falsehoods) of those who do not believe. &#8220;(Al-Imran 3: 55)<\/p>\n<p>God raised him(Jesus) up to Him; God is Almighty, Allwise. (An-Nissa 4:158).<\/p>\n<p>Allah&#8217;s Messenger Muhammad (SAW) said “What will be your condition when the son of Mary (i.e. Jesus) descends amongst you from<strong> <\/strong><strong>the heavens<\/strong>?” (Baihaqi&#8217;s Asmaa wal Sifaat 2\/432 Hadith 855)<\/p>\n<p>Prophet Muhammad(SAW)) said: “Then Jesus son of Mary will <strong>descend from the heavens<\/strong><strong> <\/strong>and lead the people.”” (Majma&#8217; Al-Zawaid 7\/349. Haithmi said, Bazzar has narrated it and all its narrators are those of the Sahih [i.e. Sahih Bukhari] except Ali bin Munzar and he is also trustworthy).<\/p>\n<p>So, as the rabbinical literature states that Messiah will be risen to Heaven and then will return, we find the same being affirmed for Messiah Jesus(pbuh) from Quran and Hadith.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Note:<\/strong><\/span> RTS might argue that the rabbinical literature says that Massiah will have a natural birth thus it doesn’t apply to Jesus(pbuh), However as we said in the beginning that the rabbinical literature is just the understandings of the Rabbis, and the Jews didn’t accept Messiah Jesus(pbuh), they accused Mary(pbuh) and rejected her claim and the claim of Jesus that He was born miraculously. Thus obvious to find these hateful Rabbis to preach that Messiah will be born naturally, so as to reject the claim of Messiah Jesus(pbuh) who was born miraculously.<\/p>\n<p><strong>RTS says:<\/strong><\/p>\n<div>\n<blockquote>\n<div><span style=\"color: #ff0000;\">The believers, including Israel, will not recognize him even though he will know them. The believers will not know he is there but he shall know who the believers are: <\/span><span style=\"color: #ff0000;\">&#8220;Yousf (as) recognized his brothers, but they did not recognize him. This is one of the traits of Yousf (as) not only in his own generation, but in every generation, that Moshiach ben Yousf recognizes his brothers, but they do not recognize him. This is the work of Satan, <strong>who hides the characteristics of Moshiach ben Yousf (as) so that the footsteps of the Moshiach are not recognized and are even belittled because of our many sins.<\/strong> Otherwise, our troubles would already have ended. Were Israel to recognize Yousf (as), that is, the footsteps of ben Yosef the Mashiach which is the ingathering of the exiles etc., then we would already have been redeemed with a complete redemption.&#8221;<\/span><span style=\"color: #ff0000;\">From &#8220;Kol Hator,&#8221; authored by Rabbi Hillel Shklover, grand-nephew and disciple of the Vilna Gaon.<\/span><\/div>\n<\/blockquote>\n<p>Even this befits Messiah Jesus(pbuh), because Jesus(pbuh) wasn&#8217;t recognized by his own people who knew him. This quote is talking about the way the Messiah will be treated before his occultation not after it, because after the occultation and on his return he will be accepted by Israel as the above quote which was provided by RTS states. Anyways we will use the rabbinical quote itself to see what is the most plausible deduction.<\/p>\n<p><strong>It is stated in Bible regarding Messiah Jesus(pbuh):<\/strong><\/p>\n<p>He came to his own, and his own people did not receive him. [John 1:11].<\/p>\n<p><strong>We read in the Glorious Quran:<\/strong><\/p>\n<p>And when Jesus came with clear arguments he said: I have come to you indeed with wisdom, and that I may make clear to you part of what you differ in; so be careful of (your duty to) Allah and obey me: Surely Allah is my Lord and your Lord, therefore serve Him; this is the right path: But parties from among them differed, so woe to those who were unjust because of the chastisement of a painful day. [Quran 44:63-65].<\/p>\n<p>The bold part from the rabbinical quote provided by RTS states, that Satan will hide the Characteristics of Messiah, So that the footsteps of Messiah are not recognized or belittled. This is what happened with Messiah Jesus(pbuh), His own people didn’t recognize his characteristics, His miracles which he performed by the will of Allah, his clear arguments which are of a true Prophet as stated in the Quranic verses. And even He was offended by Jews, He was belittled as its stated in the Bible.<\/p>\n<p>This rabbinical quote is not talking about Messiah being hidden, rather it talks about him being not recognized by his people, and that his Characteristics won’t be recognized by people. Thus, we find that even this rabbinical quote perfectly fits Messiah Jesus(pbuh).<\/p>\n<p><strong>RTS says:<\/strong><\/p>\n<blockquote><p><span style=\"color: #ff0000;\">Attachment to the King Messiah (Qaim) is what brings true faith. As the Prophet (saw) said &#8216;“He who does not know the Imam of his time will die a death of ignorance (Jahiliyyah)”:<\/span><\/p>\n<p><span style=\"color: #ff0000;\">One who attached himself to the true tzaddikim has true faith. Mashiach is the true tzaddik. One who accepts Mashiach will receive from him pure faith, and will not have misplaced his faith. &#8212; From &#8216;Mashiach &#8211; Who? What? Why? How? Where? When?&#8217; (an exposition of the teachings of Rabbi Nachman of Breslov), Chaim Kramer, Breslov Resarch Institute, Jerusalem, p. 86.<\/span><\/p><\/blockquote>\n<\/div>\n<\/div>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><span style=\"color: #000000;\"><span style=\"font-family: Arial;\">This rabbinical quote also fits Messiah Jesus(pbuh). It talks about those who accept and obey the Messiah, they shall attain true faith.<\/span><span style=\"font-family: Arial;\"><br \/>\n<\/span><\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><strong>We read in Quran:<\/strong><br \/>\nAnd when Jesus came with clear arguments he said: I have come to you indeed with wisdom, and that I may make clear to you part of what you differ in; so be careful of (your duty to) Allah and <strong>OBEY ME<\/strong>: Surely Allah is my Lord and your Lord, therefore serve Him; this is the right path [Quran 44:63-65].<\/p>\n<p style=\"text-align: justify;\">Also<\/p>\n<p style=\"text-align: justify;\"><strong>Lo! herein verily is a portent for you, if you are believers. <\/strong>And (I come) confirming that which was before me of the Torah, and to make lawful some of that which was forbidden unto you. I come unto you with a sign from your Lord, so keep your duty to Allah and <strong>OBEY ME<\/strong>. Lo! Allah is my Lord and your Lord, so worship Him. That is a straight path. [Quran  3:49-51].<\/p>\n<p style=\"text-align: justify;\">And if one were to search in the Bible, he can locate verses where, we find that Messiah Jesus(pbuh) says that, if one follows Messiah Jesus(pbuh), He shall attain salvation.  The Quranic verses we quoted are sufficient to prove our point.<\/p>\n<p style=\"text-align: justify;\"><strong>RTS says:<\/strong><\/p>\n<p style=\"text-align: justify;\">In the ghayba the King Messiah (Qaim) will have much suffering:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Pesikta Rabbati 146b<\/span><br \/>\n<span style=\"color: #ff0000;\">&#8220;Our Sages said, ‘King Messiah is subjected to sufferings in every generation according to the sins of that generation.’ The Holy One, blessed be He, said, ‘In that hour of the Redemption I shall resuscitate him &#8211; create him a new and he will no longer suffer.’&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Zohar; Parashat Exodus 212a<\/span><br \/>\n<span style=\"color: #ff0000;\">&#8220;In the Garden of Eden there is a hall that is called the &#8220;hall of the afflicted.&#8221; Now it is into this hall that the Messiah goes and summons all the afflictions and pains and sufferings of Israel to come upon him. And so they all come upon him. And had he not eased the children of Israel of their sorrows, and taken their burden upon himself, there would be none who could endure the suffering of Israel in the penalty of neglecting the Torah. Thus it is written: <strong>&#8220;Surely our diseases he did bear and our pains he carried.&#8221; (Isaiah. 53:5)<\/strong> As long as the children of Israel dwelt in the Holy Land, they averted all afflictions and sufferings from the world by the service of the sanctuary and by sacrifice. But now it is the Messiah who is averting them from the habitants of the world.&#8221;<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">From the first quote that was provided by RTS from Pesikta Rabbati, then this more befits Messiah Jesus(pbuh), because we know that Messiah Jesus(pbuh) suffered a lot, we can quote several verses from Bible which affirms this fact, but since this is something which is widely accepted by both Muslims and Christians, then we don’t  find it necessary to quote those verses proving the suffering of Jesus(pbuh).<\/p>\n<p style=\"text-align: justify;\">Coming to the second quote by RTS from Zohar;Parashat Exodus, then this Rabbinical view is an erroneous view and a misunderstanding of the Rabbis, that Messiah will take the pains and diseases of Israel upon himself in the garden of Eden. It’s their misunderstanding, moreover this doesn&#8217;t even fit the mythical Imam Mahdi of Shias, because He isn&#8217;t suffering during his occultation, neither is He taking the suffering of his Shias upon himself. In fact, their mythical Imam went into hiding into a cave in order to save himself from sufferings and danger, and his Shia are supposed to be trialed with his absence with suffering.<\/p>\n<p style=\"text-align: justify;\">In the quote from Zohar;Parashat Exodus, they based their view upon a verse of Isaiah( 53:5), and in accordance to Bible this befits Messiah Jesus(pbuh).<\/p>\n<p style=\"text-align: justify;\"><strong>We find in Bible :<\/strong><\/p>\n<p style=\"text-align: justify;\">When Jesus came into Peter’s house, he saw Peter’s mother-in-law lying in bed with a fever. He touched her hand and the fever left her, and she got up and began to wait on him.When evening came, many who were demon-possessed were brought to him, and he drove out the spirits with a word and healed all the sick.<strong> <\/strong><strong>This was to fulfill what was spoken through the <\/strong><strong>prophet Isaiah:“He took up our infirmities  and bore our diseases<\/strong>.”(Matthew 8:14-17).<\/p>\n<p style=\"text-align: justify;\">Thus we find that the verse from Isaiah(53:5) which was misinterpreted and misunderstood by the Rabbis This in fact, fits Messiah Jesus(pbuh). And we Muslims are well aware that, they misunderstood the prophesies and rejected the true Messiah Jesus(pbuh).<\/p>\n<p style=\"text-align: justify;\"><strong>RTS Says:<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">But it is precisely because the King Messiah (Qaim) endures the great trial of the Ghayba (Occultation) that he will be appointed as God&#8217;s supreme viceroy on Earth<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8220;Therefore, Messiah who has endured what He has endured ever since the creation of the world, and suffered what He had suffered, after all this, God will in the end say to Him: &#8216;You are My Son, I have birthed You this day&#8217; (Ps.2:7).&#8221; &#8211; (Rebbe Nachman, Likkutei Moharan 11:61:2)<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 11.818181991577148px; line-height: 17.27272605895996px; background-color: #f7f7f7; color: #ff0000;\"><span style=\"color: #000000;\">This prophecy also fits `Isa al-Maseeh (as)!<\/span><span style=\"background-color: #fff9ee;\"><br \/>\n<\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><strong>We read in Muslims texts that:<\/strong><br \/>\nProphet Muhammad (Saw) said, “The Hour will not be established until the son of Mary (i.e. Jesus) descends among you <span style=\"color: #000080;\"><strong>AS A JUST RULER<\/strong><\/span>, he will break the cross, kill the pigs, and abolish the jizya tax. Money will be in abundance so that nobody will accept it (as charitable gifts).<\/p>\n<p style=\"text-align: justify;\">Source: Sahih al-Bukhari, Volume 3, Book 43, Number 656 ).<\/p>\n<p style=\"text-align: justify;\">Abu Umamah Al-Bahili said, <em>&#8221; <\/em>Prophet Mohammad صلى الله عليه وسلم  delivered a speech to us, most of which dealt with the Dajjal (the Anti-Christ) and warned us against him. Umm Sharik bint Abi-&#8216;Akr said, ‘O Messenger of Allah, where will the Arabs be at that time?’. Prophet Mohammad صلى الله عليه وسلم  said, &#8220;At that time they will be few in number; most of them will be in the Bayt al-Maqdis (Jerusalem), and their Imam will be a righteous man. While their Imam is going forward to lead the people in the morning prayer, Isa (Jesus) son of Mary will descend. The Imam will step back, to let Jesus lead the people in prayer, but Jesus will place his hand between the man&#8217;s shoulders and say, &#8216;Go forward and lead the prayer, for the Iqamah was made for you.&#8217; So the Imam will lead the people in prayer… <span style=\"color: #000080;\"><strong>Jesus son of Mary will be a just ruler and leader of my Ummah (Nation).<\/strong><\/span> He will break the cross, kill the pigs (outlaw raising pigs), and abolish the Jizyah (tax on Christians &amp; Jews). He will not collect the Sadaqah (charity), so he will not collect sheep and camels. Mutual enmity and hatred will disappear. Every harmful animal will be made harmless, so that a small boy will be able to put his hand into a snake&#8217;s mouth without being harmed, a small girl will be able to make a lion run away from her, and a wolf will go among sheep as if he were a sheepdog. The Earth will be filled with peace as a container is filled with water. People will be in complete agreement, and only Allah will be worshipped. Wars will cease…”<\/p>\n<p style=\"text-align: justify;\">Source: Ibn Majah, Kitab al-Fitan, Tradition No. 4077, 2: 1363)<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) also said: The Prophets are like brothers from different mothers, their religion is one, I am the most worthy of `Isa ibn Mariam PBUH because there were no other prophets between us, <span style=\"color: #000080;\"><b>He is my Caliph (Successor) on my Ummah<\/b><\/span> and he will descend so when you see him then recognize him&#8230;&#8221;<\/p>\n<p style=\"text-align: justify;\">Source: Ibn Jariri al-Tabari said the Hadith is Mutawatir in his Tafseer.<\/p>\n<p style=\"text-align: justify;\">A Similar thing can be found in Christian records regarding Messiah Jesus(pbuh).<\/p>\n<p style=\"text-align: justify;\"><strong class=\"bbc\" style=\"color: #000000; font-family: tahoma, helvetica, arial, sans-serif; font-size: 11.818181991577148px; line-height: 17.27272605895996px; background-color: #fafcfe;\"><span style=\"font-family: Arial;\"><strong>We find in the Bible:<\/strong><\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">The days are coming,” declares the Lord,“when I will raise up for David a righteous Branch, <strong>A KING who will reign wisely and do what is just and right in the land.<\/strong>(Jeremiah 23:5).<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><span style=\"color: #800000;\"><strong>FINAL NAIL IN THE COFFIN:<\/strong><\/span><\/span><\/p>\n<p style=\"text-align: justify;\">The rabbinical records which RTS used to deceive people, mentions about  Messiah, i.e; Messiah ben Yosef(Joseph) or Messiah ben David(Dawood), Which means Messiah son of Yusuf or Messiah son of Dawood. We would like to present a Rabbinical quote for further clarification.<\/p>\n<p style=\"text-align: justify;\">Zohar; Balak 340. “And from the hills I behold him” In the Future to Come, when Messiah will come, that higher hill needs to take and bring him inside her wings in order to firm him up and place him in the higher life. From it will emerge on that day, Messiah ben David. 341. That is the secret of: &#8220;I will tell of the decree: HaShem has said to me, &#8216;You are My son; this day have I begotten you'&#8221; (Tehilim 2:7): I am destined to speak to this place that is called &#8216;decree&#8217;, and give the good tidings. &#8220;HaShem, &#8220;has said to me, &#8216;You are My son; this day have I begotten you'&#8221;, that very day, produces that decree, from under her wings, with much life, with many adornments and many blessings, as is proper. 342. That law, will not remain on its own. Because then, another Messiah [ben Yosef], will be also be included in it. There, he will be fortified, and at no other place, because this is a lower hill, that has no life of its own. That Messiah will die and be killed, and he will remain dead until this hill, will gather life from the higher hill, Then [ben Yosef] will rise.” Notice in Sukka 51a that Ben David sees in the future how ben Yosef dies, ask for him Life, and G-d gives Life to ben David. So this Midrash can be understood as Messiah ben Yosef coming back from death as ben David. Actually Rabbi Haim Vital said in his book: Sefer Chizyonot that <strong>Moshiach ben David and Moshiach ben Yosef are two titles of two different functions of the same person <\/strong>(Sefer Chizyonot page 106).<\/p>\n<p style=\"text-align: justify;\">Now the interesting point here is that Messiah Jesus(pbuh) traces back his ancestory or lineage to both Yusuf(as) and Dawood(as) and  they trace back their lineage to Ishaq son of Ibrahim(as).  But sadly(for RTS) the bad news is that, their mythical Imam Mehdi, doesn’t traces back his lineage to Dawood(as) or Yusuf(as), Al-Mehdi is to be from progeny of Prophet Muhammad(Saw), and his lineage is linked to Ismail son of Ibrahim(as) NOT Ishaq(as). <strong>Thus Imam Mehdi cannot be considered as Son of Yosef(as) or Son of David(as). However, as we have seen Messiah Jesus(pbuh) can be considered as Son of Yusuf(as) and Son of David(as), as His lineage traces back to these two Prophets. <\/strong>Genealogy of Jesus can be read in Bible, Matthew Chapter 1, The Genealogy of Jesus.<\/p>\n<p style=\"text-align: justify;\">Thus even this fact proves that the Messiah mentioned in Rabbinical Literature in NO WAY could be considered the Mahdi of Islam or that of Shiasm, Rather the only candidate who fits the description of Messiah, Is the Messiah Jesus son of Mary(pbuh).<span style=\"color: #000000; font-family: Arial; font-size: 11.818181991577148px; line-height: 17.27272605895996px; background-color: #f7f7f7;\"><span style=\"background-color: #fff9ee;\"><br \/>\n<\/span><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>SOME EXAMPLES OF HOW THE SHIA FORCE THEIR IMAMS INTO RELIGIOUS TEXTS:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"> The Twelver Shia just like most Batini esoteric sects will explain any religious text in a way that suits their agenda, we will show the reader some examples of Qur&#8217;anic verses and how they explained them and attributed this to Ahlul-Bayt:<\/p>\n<p style=\"text-align: justify;\"><strong>Verse 2:31<\/strong> {And He taught Adam all the names, then showed them to the angels, saying: Inform Me of the names of these, if ye are truthful.}<\/p>\n<p style=\"text-align: right;\">ثم قال: (وعلم آدم الأسماء كلها) أسماء أنبياء الله، وأسماء محمد صلى الله عليه وآله وعلي وفاطمة والحسن والحسين، والطيبين من آلهما وأسماء خيار شيعتهم وعتاة أعدائهم<\/p>\n<p style=\"text-align: justify;\">Tafseer al-Hasan al-`Askari pg.217: {And he taught Adam all the names} The names of the prophets of Allah, and the name of Muhammad (as) and `Ali and Fatima and Hasan and Husayn&#8230;<\/p>\n<p style=\"text-align: right;\">ورد في بعض الاخبار أنه رأى أشباح أهل البيت وأنوارهم حين علم الأسماء<\/p>\n<p style=\"text-align: justify;\">Tafseer al-Meezan 1\/149: It is mentioned in some of the narrations that he (Adam) saw ghosts of Ahlul-Bayt and their lights when he was taught the names&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Verse 40:7<\/strong> {Those who bear the Throne, and all who are round about it, hymn the praises of their Lord and believe in Him and ask forgiveness for those who believe (saying): Our Lord! Thou comprehendest all things in mercy and knowledge, therefor forgive those who repent and follow Thy way. Ward off from them the punishment of hell.}<\/p>\n<p style=\"text-align: right;\"> يعني رسول الله (صلى الله عليه وآله)، والأوصياء (عليهم السلام) من بعده يحملون علم الله، &#8221; ومن حوله &#8220;: يعني الملائكة &#8221; للذين آمنوا &#8220;: يعني شيعة آل محمد صلوات الله عليهم &#8221; للذين تابوا &#8220;: يعني من ولاية فلان وفلان وبني أمية<\/p>\n<p style=\"text-align: justify;\">Tafseer al-Qummi 2\/255: Meaning the messenger (as) and the trustees (Imams) (as) after him who carried the knowledge of Allah,  and all who are round about it, means the angels, for those who believe, means the Shia of the family of Muhammad (as), those who repent, meaning from following the Wilayah of so and so and Bani Umayyah&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Verse 55:19<\/strong> {He released the two seas, meeting [side by side]; &#8211; Between them is a barrier [so] neither of them transgresses. &#8211; So which of the favors of your Lord would you deny? &#8211; From both of them emerge pearl and coral.}<\/p>\n<p style=\"text-align: right;\">وقال علي بن إبراهيم في قوله: (مرج البحرين يلتقيان) أمير المؤمنين وفاطمة عليهما السلام (يخرج منهما اللؤلؤ والمرجان) الحسن والحسين عليهما السلام<\/p>\n<p style=\"text-align: justify;\">Tafseer al-Qummi 2\/344: {He released the two seas, meeting} Are Ameer al-Mu&#8217;mineen (`Ali) and Fatima (as), { From both of them emerge pearl and coral} are al-Hasan and al-Husayn (as)&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Verse 5:1<\/strong> {O you who have believed, fulfill [all] contracts. Lawful for you are the animals of grazing livestock except for that which is recited to you [in this Qur&#8217;an] &#8211; hunting not being permitted while you are in the state of ihram. Indeed, Allah ordains what He intends.}<\/p>\n<p style=\"text-align: right;\"> عن المفضل قال: سألت الصادق عليه السلام عن قول الله: &#8221; أحلت لكم بهيمة الأنعام &#8221; قال البهيمة هيهنا الولي والانعام المؤمنون<\/p>\n<p style=\"text-align: justify;\">Tafseer al-`Ayyashi 1\/290: I asked al-Sadiq (as) about the saying of Allah {Lawful for you are the animals of grazing livestock} He said: The animal is right here the Wali(Imam) and the grazing livestock are the believers&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Verse 19:1<\/strong> {Kaf, Ha, Ya, &#8216;Ayn, Sad.}<\/p>\n<p style=\"text-align: right;\">قلت : فأخبرني يا بن رسول الله عن تأويل كهيعص قال : هذه الحروف من أنباء الغيب اطلع الله عبد زكريا عليها ثم قصها على محمد صلى الله عليه وآله وذلك أن زكريا ع سأل ربه ان يعلمه أسماء الخمسة فأهبط الله عليه جبرائيل ع فعلمه إياها فكان زكريا إذا ذكر محمدا وعليا وفاطمة والحسن سرى عنه همه وانجلى كربه وإذا ذكر الحسين ع خنقته العبرة ووقعت عليه البهرة فقال ذات يوم : الهي ما بالى إذا ذكرت أربعا منهم ع تسليت بأسمائهم من همومي وإذا ذكرت الحسين ع تدمع عيني وتثور زفرتي ؟ فأنبأه تبارك و تعالى عن قصته فقال : &#8221; كهيعص &#8221; فالكاف اسم كربلاء والهاء هلاك العترة والياء يزيد لعنه الله وهو ظالم الحسين والعين عطشه والصاد صبره<\/p>\n<p style=\"text-align: justify;\">Tafseer Noor al-Thaqalayn 3\/319: I said: tell me O son of Rassul-Allah about the meaning of {Kaf, Ha, Ya, &#8216;Ayn, Sad.} He said: These are letters from al-Ghayb that Allah showed to his slave Zakariya, then he told them to Muhammad and his family (as), this is because Zakariya asked his Lord to teach him the name of the five (Ahlul-Kisa&#8217;) so Jibreel (as) descended and taught him: Muhammad, `Ali, Fatima, Hasan, Husayn&#8230;<\/p>\n<p style=\"text-align: justify;\"><strong>Verse 64:8<\/strong> {So believe in Allah and His messenger and the light which We have revealed. And Allah is Informed of what ye do.}<\/p>\n<p style=\"text-align: justify;\">سألت أبا جعفر عليه السلام عن قول الله عزوجل: &#8221; فآمنوا بالله ورسوله والنور الذي أنزلنا&#8221; فقال: يا أبا خالد النور والله الائمة من آل محمد صلى الله عليه وآله إلى يوم القيامة<\/p>\n<p style=\"text-align: justify;\">al-Kafi 1\/194: I asked abu Ja`far (as) about the saying of Allah: {So believe in Allah and His messenger and the light which We have revealed} so he said: &#8220;O abu Khalid, the light by Allah is the Imams from the progeny of Muhammad (as)&#8230;<\/p>\n<p style=\"text-align: justify;\">And many more that we cannot possibly include as it would take huge volumes to count them all.<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"text-decoration: underline;\"><span style=\"color: #800000;\">LESSON FOR OUR ESTEEMED READERS:<\/span><\/span><\/strong><\/p>\n<div style=\"text-align: justify;\">As we have seen, the true Messiah prophesized in Rabbinical Literature can only be Messiah Jesus(pbuh). Muslims(Ahlesunnah) believe in Jesus(pbuh) to be a mighty Prophet of Allah, We love Jesus(pbuh), We believe that he performed miracles by the will of Allah, We believe him to be the true Messiah. We believe in his second coming. But, we also believe that He was NOT God, neither son of God, rather He was a Prophet of Allah, like the ones before him. And it is incumbent upon the Christians to believe in the final Messenger and Prophet after him, i.e Prophet Muhammad(pbuh), who was also prophesized in Jewish as well as Christian scriptures.Praise be to Allah! In this article we have tried to present before the world the true nature of the Shiites, which is deception and ignorance. In fact, deception and lies are from the religious teachings of Shiasm, as can be seen in their traditions and scholarly verdicts. <strong>We have seen how they deceitfully and forcefully try to fit their Imamah anywhere they feel it would benefit their beliefs.<\/strong> <strong>They did the same with many verses of Quran, where even when Quran spoke about, Olive, fig or Mount Sinai, they tried to interpret these verses and said &#8220;What is meant here is our Imams&#8221;<\/strong>.<\/div>\n<div style=\"text-align: justify;\">After this exposition we expect that we would be labeled as haters of Ahlelbayt, by RTS, they might call us Nasibis, since we shattered their deception to label their Imam as Messiah, by the help of Allah. <strong>As, we rightfully defended the rights of the Messiah Jesus(pbuh), when RTS tried to snatch his virtue as Messiah and attributed it to their mythical Imam Mahdi. They did the same thing with the virtues that were stated regarding the companions of Prophet Muhammad(saw), they stole those and applied to their Imams<\/strong>, but when Ahlesunnah exposed their deceit they accused them of being Nasibis, even though Ahlesunnah affirm the true virtues of Ahlelbayt.Lastly, we request our esteemed readers, especially the Christian converts to Islam, to be aware of Shia deceptions. Since in the initially stages as new Muslims they aren’t much aware of Islamic texts and its principles, and they should take this article as an evidence and a lesson since, they have a background of Jesus(pbuh) and him being a Messiah, So they can easily understand the<strong> <\/strong>deceptive nature of Shiites.<\/div>\n<p><strong><br \/>\n“Truth has (now) arrived, and Falsehood perished: for Falsehood is (by its nature) bound to perish.” Quran (17:81).<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This article is  a response to the article on Revisitingthesalaf.org entitled: ”Imam Mehdi (ajf) in Rabbinical Literature” in which it tried to show that their mythical hidden Imam, is the Messiah prophesized in Rabbinical literature. <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/06\/10\/467\/\" title=\"Response to: Imam Mehdi (ajf) in Rabbinical Literature\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5,4],"tags":[16],"class_list":{"0":"post-467","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah","8":"category-quran","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/467","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=467"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/467\/revisions"}],"predecessor-version":[{"id":3904,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/467\/revisions\/3904"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=467"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=467"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=467"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}