{"id":4701,"date":"2019-03-25T13:46:05","date_gmt":"2019-03-25T13:46:05","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4701"},"modified":"2019-03-25T13:58:39","modified_gmt":"2019-03-25T13:58:39","slug":"taqiyyah-hadith-the-no-true-scotsman-fallacy","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/25\/taqiyyah-hadith-the-no-true-scotsman-fallacy\/","title":{"rendered":"Taqiyyah, Hadith &#038; The No True Scotsman Fallacy"},"content":{"rendered":"<img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4701\" alt=\"\" \/><p>The &#8220;No True Scotsman&#8221; fallacy is a logical fallacy where a claimant attempts to defend a universal generalization from counterexamples that undermine its veracity. Instead of qualifying his generalization or addressing the counterexample(s), the claimant rather dismisses the counterexample(s) by redefining the subject of assertion in an&nbsp;<em>ad hoc<\/em> manner. Usage of this fallacy often results in the dismissal of legitimate evidence that negates the universality of the generalization proposed by the claimant&#8230;. and ultimately, a fallacious narrative.<\/p>\n<p>Robert Benett provides an example of this fallacy on his <a href=\"https:\/\/www.logicallyfallacious.com\/tools\/lp\/Bo\/LogicalFallacies\/135\/No-True-Scotsman\" rel=\"external nofollow\">website<\/a>:<\/p>\n<blockquote>\n<p>John: Members of the UbaTuba White Men&#8217;s Club are upstanding citizens of the community.<\/p>\n<p class=\"uk-margin-remove uk-text-primary\">Marvin: Then why are there so many of these members in jail?<\/p>\n<p class=\"uk-margin-remove uk-text-primary\">John: They were never&nbsp;<i><span style=\"text-decoration: underline;\">true&nbsp;<\/span><\/i>UbaTuba White Men&#8217;s Club members.<\/p>\n<p class=\"uk-margin-remove uk-text-primary\">Marvin: What’s a true UbaTuba White Men&#8217;s Club member?<\/p>\n<p class=\"uk-margin-remove uk-text-primary\">John: Those who don&#8217;t go to jail.<\/p>\n<\/blockquote>\n<p>In the aforementioned example, John made a universal generalization regarding a certain group of individuals. When presented with counterexamples that negate the universality of that generalization, he proceeded to dismiss them by redefining his original claim.<\/p>\n<p>How does this fallacy relate to taqiyyah and hadith in Shi&#8217;ite sources? &#8216;Tis the question.<\/p>\n<p>Taqiyyah, also known as dissimulation, is a religious practice that is sanctioned and recommended in the Twelver school where a Shi&#8217;ite individual conceals and dissimulates his true beliefs for a greater interest. The nature of this interest will vary, ranging from one&#8217;s personal safety to more significant socio-political gains.<\/p>\n<p>The concept of taqiyyah has been transposed onto Twelver hadith sources. Thus, whenever a Shi&#8217;ite is presented with an authentic report to&nbsp; an Imam that explicitly contradicts certain aspects of Twelver theology, the Shi&#8217;ite will often dismiss the report on the basis that it was uttered out of Taqiyyah and that the Imam did not&nbsp;<span style=\"text-decoration: underline;\">truly&nbsp;<\/span>mean what he said. The end result is a convenient cop-out that is constantly used by Shi&#8217;ite polemicists. When presented with authentic evidence from their own sources that explicitly contradicts their preconceived universal generalizations regarding the Imams, they will simply dismiss those counterexamples on the basis of Taqiyyah. How convenient!<\/p>\n<p>This cop-out is is not solely used with reports pertaining to grave theological matters, but it is also employed in trivial matters of jurisprudence, such as <em>wudu&#8217;&nbsp;<\/em>etc.<\/p>\n<p>Let us evaluate some of these preposterous examples from several&nbsp; classical Shi&#8217;ite sources<\/p>\n<p><strong>1.<\/strong>In <em>Wasa&#8217;il Al-Shia<\/em>, Al-Hurr Al-Ameli quoted an authentic report from <em>Qurb Al-Isnad<\/em>, which its author transmitted from:<\/p>\n<blockquote>\n<p>Harun b. Muslim, from Mas&#8217;adah b. Ziyad, from Ja&#8217;far (as), from his father:<\/p>\n<p>Ali never used to ascribe any of his enemies to shirk or hypocrisy. Rather, he used to say: &#8220;They are our brothers who have transgressed against us.&#8221;&#8216;<\/p>\n<p>Al-Hurr Al-Ameli commented saying: &#8220;This is interpreted according to Taqiyyah.&#8221;<\/p>\n<p>(Al-Ameli 15\/83)<\/p>\n<\/blockquote>\n<p>Did Ja&#8217;far lie upon &#8216;Ali b. Abi Taleb for his personal safety or other socio-political interests?<\/p>\n<p><strong>2.<\/strong>In <em>Al-Istibsar<\/em>, Al-Tusi said:<\/p>\n<blockquote>\n<p>Regarding what has been transmitted by &#8216;Ali b. Ibrahim, from his father, from Muhammad b. Yahya, from Ghiyath b. Ibrahim, from Ja&#8217;far, from his father (as) that he said: &#8220;One must not prostrate on anything that is not touched by his entire body during sujud.&#8221;<\/p>\n<p>Al-Tusi commented: &#8220;It does not conflict with the two previous reports because this report is in-line with the position of the &#8216;Ammah (Sunnis); thus, its interpretation is that it was said as Taqiyyah&#8230;&#8221; (Al-Tusi 1:335)<\/p>\n<\/blockquote>\n<p><strong>3.<\/strong> In <em>Al-Istibsar<\/em>, Al-Tusi said:<\/p>\n<blockquote>\n<p>Al-Husayn b. Sa&#8217;id b. Fudalah, from Al-&#8216;Alaa, from Muhammad b. Muslim, from Abu Ja&#8217;far (as): &#8220;My father, at home, used to call for prayer saying: الصلاة خير من النوم. You should not have a problem if you repeat that.&#8221;<\/p>\n<p>Al-Tusi commented: &#8220;These reports are interpreted according to Taqiyyah, since the sect has unanimously agreed to neglect acting upon them.<\/p>\n<\/blockquote>\n\n\n<p><strong>4.<\/strong> In his <em>tafisr<\/em>, &#8216;Ali b. Ibrahim Al-Qommi transmitted a report that explicitly conflicts with contemporary Twelver theology. Here is an excerpt from that report:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>My father informed me, from Ibn Abi ‘Umayr, from Jamil, from Abu ‘Abdullah that he said:<\/p><p>…When the Messenger of Allah migrated to Medina, the Prophet betrothed Zaynab unto Zayd. One day, Zaid was late, so the Prophet visited his house to inquire about him. There, he saw Zaynab sitting in the middle of her house crushing fragrances. He looked at her, and she was beautiful and lovely, so he said: “Exalted is the Creator of light! And Exalted is Allah the best of creators!”<\/p><p>The Messenger of Allah then returned to his house, and his heart had an astounding attachment to Zaynab. Then, Zayd eventually returned to his house, and Zaynab informed him of what the Prophet had said.<\/p><p>Zayd then told her: “Shall I divorce you such that Messenger of Allah may marry you? Perhaps he has fallen in love with you?”<\/p><p>She said: “I fear that you may divorce me and then the Messenger of Allah ends up not marrying me.”<\/p><p>Zayd thus went to the Prophet and told him: “I spare you with my father and mother O’ Messenger of Allah. Zaynab informed me of such-and-such. Shall I divorce her such that you may marry her?”<\/p><p>The Messenger of Allah then responded: “No. Fear Allah and keep your wife.”<\/p><p>Then Allah revealed the verse: “[as you said]: ‘Keep your wife and fear Allah,’ while you concealed within yourself that which Allah is to disclose. And you feared the people, while Allah has more right that you fear Him. So when Zayd had no longer any need for her, We married her to you in order that there not be upon the believers any discomfort concerning the wives of their adopted sons when they no longer have need of them. And ever is the command of Allah accomplished.” [Al-Ahzaab: 37] <\/p><p><\/p><p> <br>The Twelver editor of <em>Tafsir Al-Qommi<\/em>, Sayyed Al-Tayyeb Al-Jaza&#8217;iri, commented saying: &#8220;This report is to be interpreted as <em>Taqiyyah<\/em> because it is aligned with the &#8216;<em>Ammah<\/em> (Sunnis)&#8221; <\/p><cite> <br>(Al-Qommi 2\/172-173)<\/cite><\/blockquote>\n\n\n\n<p>Asides from his dishonest appeal, the editor is literally claiming that Ja&#8217;far Al-Sadiq ascribed lies to the Prophet which he never said\/did. According to this individual (and many other Twelver theologians) , Ja&#8217;far Al-Sadiq was willing to distort the Prophet&#8217;s image and teachings just to ensure his own personal safety.<\/p>\n\n\n\n<p>Nevertheless, it cannot be said that this report is merely an instance of <em>Taqiyyah <\/em>for several reasons:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>This report is not authentic in a single Sunni source. Rather, its isnads are all fabricated in Sunni sources.<\/li><li>This Shi&#8217;ite rendition of the fabrication is much more embellished and detailed than all of the weak\/fabricated accounts listed in Sunni sources.<\/li><li>This fabricated story is only &#8220;authentically&#8221; transmitted in Shi&#8217;ite sources!<\/li><\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Discussion<\/h2>\n\n\n\n<p>This phenomenon, indeed, is a classical example of the &#8220;No True Scotsman Fallacy&#8221;. Twelver theologians have essentially claimed to formulate their theology based on reports authentically ascribed to the Imams.  However, when presented with various authentic reports that explicitly conflict with contemporary Twelver theology, they will gladly dismiss and deflect them on the basis of <em>Taqiyyah<\/em>. <\/p>\n\n\n\n<p>In reality, this is because Twelver theologians have made universal generalizations upon the Imams from a limited and incomprehensive pool of reports.  When such generalizations are based on limited sets of data, it is not a surprise that the generalizations will be fundamentally flawed, hence the various authentic reports that conflict with Twelver theology. The Twelvers, however, have devised a convenient cop-out to bypass this serious problem: <em>Taqiyyah<\/em>!<\/p>\n\n\n\n<p>The transposition of the concept of <em>Taqiyyah <\/em>onto hadith has effectively allowed Twelver polemicists to dismiss authentic reports that demonstrate the defectiveness of their theology. Little did they know, however, that they have been employing a logical fallacy all along.<\/p>\n\n\n\n<p>Similarly, it seems as though Twelver polemicists have not thought about the implications of their claims. In such instances, as seen in examples 1 and 4, the implication is that Ja&#8217;far Al-Sadiq ascribed lies to the Prophet and &#8216;Ali b. Abi Taleb out of <em>Taqiyyah<\/em>. Apparently, he was willing to publicly distort the Prophet and &#8216;Ali&#8217;s teachings for his own personal safety!<\/p>\n\n\n\n<p>Asides from the incrimination of Ja&#8217;far, these claims of <em>Taqiyyah<\/em> pose a serious problem to Twelver theology. Shi&#8217;ite theologians often argued for the necessity of an infallible guide to lead the masses. A fallible guide, according to them, may commit errors which would then be upheld by the masses. Twelver theologians thus argued that the masses would not be able to discern the right from wrong in a fallible guide&#8217;s actions, hence the need for an infallible guide.<\/p>\n\n\n\n<p>These claims of <em>Taqiyyah<\/em>, however, backfire on this entire argument. If the Imam openly disseminated distorted Prophetic teachings out of fear for his personal safety, what exactly is the point of infallibility? The end result is one: the imam publicly conveys erroneous teachings that eventually lead to confusion and distortion of the religion. The only difference is that the &#8220;infallible&#8221; imam does it out of fear for his safety, but the &#8220;fallible&#8221; leader does it out of error.<\/p>\n\n\n\n<p>The end result is one: Twelver theologians, centuries later, attempt to piece the puzzle together by meddling with the body of reports ascribed to the Imams. It is safe to say, however, that such attempts are futile, as their methodologies embodied various logical fallacies and misleading appeals.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion<\/h2>\n\n\n\n<p>There are hundreds of other examples of this phenomenon in classical Twelver hadith collections. The examples presented today, however, shall suffice to demonstrate the flawed framework espoused by Shi&#8217;ite authorities as they navigated through their tradition.<\/p>\n\n\n\n<p>Nevertheless, the Truth becomes clearer and more apparent by the day: Shi&#8217;ite polemicists are simply inviting Muslims to a self-contradicting tradition that is weaker than a spider&#8217;s web.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p> Who is better? Those who laid the foundations of their building on righteousness and the quest for Allah&#8217;s approval; or those who did so on the edge of a crumbling cliff that tumbled down with them into the fire of Hell? <\/p><p>And Allah does not guide the wrongdoing people.  <\/p><cite> <br>[Quran 9:109] <\/cite><\/blockquote>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-align:center\"><u class=\"remove-format\">Sources<\/u><\/h3>\n\n\n\n<p>Al-&#8216;Ameli, Al-Hurr. <em>Wasa&#8217;il Al-Shia ila Tahsil Masa&#8217;il Al-Shari&#8217;ah<\/em>. Edited by Mu&#8217;assasat Aal Al-Bayt li Ihyaa Al-Turath, 2nd ed., Mihr, 1372.<\/p>\n\n\n\n<p>Al-Qommi, &#8216;Ali b. Ibrahim. <em>Tafsir Al-Qommi<\/em>. Edited by Al-Sayyed AL-Tayyeb Al-Moussawi, 1387.<\/p>\n\n\n\n<p>Al-Tusi, Muhammad b. Al-Hasan. <em>Al-Istibsar fi ma Ikhtulifa min Al-Akhbar<\/em>. Edited by Al-Sayyed Hassan Al-Moussawi, 4th ed., 1363.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The &#8220;No True Scotsman&#8221; fallacy is a logical fallacy where a claimant attempts to defend a universal generalization from counterexamples that undermine its veracity. Instead of qualifying his generalization or addressing the counterexample(s), the claimant rather dismisses the counterexample(s) by <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/25\/taqiyyah-hadith-the-no-true-scotsman-fallacy\/\" title=\"Taqiyyah, Hadith &#038; The No True Scotsman Fallacy\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4701","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4701","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4701"}],"version-history":[{"count":11,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4701\/revisions"}],"predecessor-version":[{"id":4774,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4701\/revisions\/4774"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4701"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4701"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4701"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}