{"id":4709,"date":"2019-03-22T19:58:04","date_gmt":"2019-03-22T19:58:04","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4709"},"modified":"2019-03-22T20:01:32","modified_gmt":"2019-03-22T20:01:32","slug":"ali-al-baqir-and-al-sadiq-authentically-praise-umar","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/03\/22\/ali-al-baqir-and-al-sadiq-authentically-praise-umar\/","title":{"rendered":"Ali, Al-Baqir and Al-Sadiq AUTHENTICALLY Praise &#8216;Umar bin Al-Khattab"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4709\" alt=\"\" \/>It should not be a surprise for one to find the earliest historical sources replete with praise of the companions of the Prophet by the Imams of the Twelvers. Such reports demonstrate the defective nature of the Twelver historical narrative, which is fundamentally based on the notion that <em>Ahlulbait<\/em> and the Sahabah embodied nothing but hatred, animosity and contempt towards each other.  Rather, one finds a plethora of reports that authentically quote various members of the Prophet&#8217;s household praising and respecting the Sahabah. In this article, we shall evaluate an example of this phenomenon.<\/p>\n<p>We shall primarily address this report in two regards:<\/p>\n<ol>\n<li>The report&#8217;s definite authenticity<\/li>\n<li>Later Shi&#8217;ite attempts to bypass the report and deflect its implications<\/li>\n<\/ol>\n<p>With that being said, the report in question today is a hadith of &#8216;Ali b. Abi Taleb. In this hadith, &#8216;Ali enters upon &#8216;Umar as his body was wrapped and prepared prior to his burial, and he says: &#8220;I would not love to meet Allah with anyone&#8217;s record asides from this wrapped man&#8217;s record.&#8221;<\/p>\n<p>This report does not come from a vacuum:&#8217;Umar b. Al-Khattab&#8217;s accomplishments during has reign as caliph were impressive and crucial to the spread of Islam to various parts of the world. &#8216;Umar similarly laid the administrative foundations to various government institutions that would later prove to be central. His role with the Prophet since the earliest days of Islam is well-kbown, and so are his numerous sacrifices. Thus, it is not a surprise that other companions of the Prophet wished to possess such feats and deeds in their records on the Day of Judgement.<\/p>\n<p>Nevertheless, let us evaluate this report&#8217;s isnads, which were primarily transmitted by <em>Ahlulbait<\/em>, and then let us evaluate how the early Twelver community responded to this report.<\/p>\n<h2>Isnads to Ja&#8217;far Al-Sadeq → Al-Baqir → &#8216;Ali<\/h2>\n<p>Ironically, this report is transmitted by Ja&#8217;far Al-Sadiq himself. He transmitted it from his father, who quoted &#8216;Ali b. Abi Taleb. As seen in figure 1 below, this report is <em>mutawatir <\/em>(mass-transmitted) from Ja&#8217;far: over six of his companions transmitted it from him.<a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Sadiq.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4711\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Sadiq.png\" alt=\"\" width=\"13144\" height=\"6272\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Sadiq.png 13144w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Sadiq-300x143.png 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Sadiq-768x366.png 768w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Sadiq-1024x489.png 1024w\" sizes=\"auto, (max-width: 13144px) 100vw, 13144px\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><strong>Figure 1<\/strong>. Diagram  of isnads for this report from Ja&#8217;far Al-Sadeq, which he then transmitted from his father<\/p>\n<p>What is further noteworthy is that several transmitters from Ja&#8217;far in this diagram were even declared reliable in Shi&#8217;ite sources. Wahib b. Khaled. for example, was endorsed by Al-Najashi (Al-Jawahiri 778). Anas b. &#8216;Iyyadh was endorsed by both Al-Tusi and Al-Najashi (Al-Jawaheri 776). Either way, this report would still be authentic to Ja&#8217;far due to the shear amount of direct and indirect corroborations.<\/p>\n<p><strong>Sources<\/strong>: Fada&#8217;il Al-Sahabah (&#8216;Abdullah&#8217;s additions) #345, Fada&#8217;il Al-Sahabah (Al-Qati&#8217;i&#8217;s additions) #652, Al-Mutamannin by Ibn Abi Al-Dunya pg 58, Fada&#8217;il Al-Khulafaa&#8217; Al-Rashidin by Abu Nu&#8217;aym #206, Al-Du&#8217;afaa&#8217; Al-Kabir by Al-&#8216;Uqaili 2:179, Al-Mustadrak by Al-Hakem #4523,  Al-Ma&#8217;rifah wal-Tarikh by Al-Fasawi #2:745, Al-Tabaqat Al-Kubra 3:282, Ansab Al-Ashraf by Al-Baladhuri 10:444, Musannaf Ibn Abi Shaybah #32018<\/p>\n<h2>Other Isnads to Al-Baqir<\/h2>\n<p>Figure 1 presented the directly corroborated transmission from Ja&#8217;far Al-Sadeq, and it is indeed sufficient to demonstrate the report&#8217;s authenticity. Al-Sadiq, however, was not the only transmitter to transmit this report from his father. Rather, he was corroborated in his transmission by others as well. Figure 2, below, presents other authentic chains of transmission back to Al-Baqir:<\/p>\n<p style=\"text-align: center;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Baqir.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4714\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Baqir.png\" alt=\"\" width=\"7800\" height=\"4832\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Baqir.png 7800w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Baqir-300x186.png 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Baqir-768x476.png 768w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/Baqir-1024x634.png 1024w\" sizes=\"auto, (max-width: 7800px) 100vw, 7800px\" \/><\/a><\/p>\n<p><strong>Figure 2<\/strong>. Diagram of isnads that further corroborate Al-Sadiq&#8217;s transmission from Al-Baqir<\/p>\n<p><strong>Sources<\/strong>: Al-Tabaqat Al-Kubra 3:282, Al-Athar by Abu Yusuf #952, Tarikh Al-Madinah by Ibn Shabbah 3:942, Fada&#8217;il Al-Sahabah (&#8216;Abdullah&#8217;s additions) #346<\/p>\n<h2>Peripheral Isnads to Various Members of <em>Ahlulbait <\/em><\/h2>\n<p>Figure 3, below, presents a few other isnads to <em>Ahlulbait: <\/em>Zayd b. &#8216;Ali b. Al-Husaim and Ibn Al-Hanafiyyah, who transmitted this report from &#8216;Ali b. Abi Taleb.<\/p>\n<p style=\"text-align: center;\"><a href=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ali3.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-4723\" src=\"http:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ali3.png\" alt=\"\" width=\"4760\" height=\"6032\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ali3.png 4760w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ali3-237x300.png 237w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ali3-768x973.png 768w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2019\/03\/ali3-808x1024.png 808w\" sizes=\"auto, (max-width: 4760px) 100vw, 4760px\" \/><\/a><strong>Figure 3<\/strong>. Diagram of peripheral isnads to other individuals from <em>Ahlulbait<\/em><\/p>\n<p><strong>Source:<\/strong> Ansab Al-Ashraf by Al-Baladhuri 10:429, Al-Tabaqat Al-Kubra 3:283, Al-Shari&#8217;ah by Al-Ajurri #1206<\/p>\n<h2>Discussion<\/h2>\n<p>A careful analysis of this report is sufficient to demonstrate that Ja&#8217;far Al-Sadiq and his father, Al-Baqir, were its pivotal and most prolific transmitters. This is apparent from the fact that they are the only individuals from whom this report is mass-transmitted.  The report is also authentically ascribed to other individuals from <em>Ahlulbait<\/em>, such as Zayd b. &#8216;Ali and Ibn Al-Hanafiyyah, all of whom transmitted it from &#8216;Ali b. Abi Taleb.<\/p>\n<p>Nevertheless, it is apparent that this report posed a problem to Twelver theology. Early Shi&#8217;ite polemicists thus varied in their reaction to this report as they attempted to deflect its implications.<\/p>\n<p>Some early Shi&#8217;ites openly displayed their disapproval of this report as it was transmitted by Ja&#8217;far Al-Sadiq. In Sufyan b. &#8216;Uyaynah&#8217;s account, transmitted by Abu Nu&#8217;aym and Al-&#8216;Uqaili&#8217;, the early (weak) Rafidi figure, Sadir b. Hakim, is quoted objecting to the report. After hearing it from Ja&#8217;far, Sufyan said:<\/p>\n<blockquote><p>I then heard Sadir Al-Sayrafi say: &#8220;His [Ali&#8217;s] record is greater than his [&#8216;Umar&#8217;s] !&#8221; (Al-Asbahani 162)<\/p>\n<p>In Al-&#8216;Uqaili&#8217;s account, Sufyan further said: &#8220;I then raised my hand to smack his face, but Al-Hasan b. &#8216;Umarah prevented me and said: &#8216;leave him, for he is misguided.&#8217; &#8221; (Al-&#8216;Uqaili 2:179)<\/p><\/blockquote>\n<p>In this account,  Sadir clearly recognizes that the implications of this report fundamentally oppose his preconceptions regarding &#8216;Umar b. Al-Khattab; thus, he immaturely grunts out loud in objection to its content in a manner which (I suppose) resembled that of a disgruntled preschooler. No arguments were provided to address the actual content of the report; rather, it seems as though Sadir was satisfied with simply parroting the beliefs of the Rafidi community at the time in response to this hadith.<\/p>\n<p>Other Shi&#8217;ite polemicists attempted to provide a more nuanced response to this report. Twelver theologian, Al-Mufid (d. 413), more than 150 years after the compilation and mass-transmission of this report in classical Sunni works, attempted to address this hadith. In his book, <em>Al-Fusul Al-Mukhtarah<\/em>, he quoted Hisham b. Al-Hakam (d. 179) as he was asked about the hadith. It must be noted, however, that Al-Mufid did not list an isnad for his quote from Hisham; thus, there is a disconnection in its transmission that is more than two centuries long. Al-Mufid said:<\/p>\n<blockquote><p>Hisham was once asked about the report transmitted by the Sunnis where the commander of the faithful, during the processions after &#8216;Umar&#8217;s death, entered upon &#8216;Umar as he was wrapped and said: &#8220;Indeed, I wish to meet Allah with the record  of this man.&#8221;<\/p>\n<p>Hisham thus said: &#8220;This hadith is not authentic, and its isnad is unknown. It was merely transmitted through storytellers and men of the streets. Even if it were authentic, its meaning would be known. [It would be referring to] the instance when &#8216;Umar conspired with Abu Bakr, Al-Mughirah Salem, and Abu &#8216;Ubaydah to author a document among themselves in which they all agreed: if the Prophet were to die, they would not allow any of his family members to inherit him, nor would they allow anyone from his household to assume his position of leadership after him. This document was &#8216;Umar&#8217;s, since he was their backbone at the time. This is the document the commander of the faithful prayed to possess when he met Allah: it was so that he could confront &#8216;Umar and cite it as evidence against him in Allah&#8217;s presence.&#8221; (Al-Mufid 90)<\/p><\/blockquote>\n<p>Al-Mufid&#8217;s attempt to dismiss this report is futile for several reasons:<\/p>\n<ol>\n<li>He does not mention an isnad to this alleged response of Hisham. Thus, there is a ~200 year-long disconnection in its transmission, and this entire quote is worthless.<\/li>\n<li>The response provided demonstrates Hisham and Al-Mufid&#8217;s ignorance in hadith, as they claimed that the report was not authentic and that its isnads were unknown.<\/li>\n<li>Hisham is then quoted attempting to reconcile the report with Twelver theology by reinterpreting it and providing a counter-narrative.<\/li>\n<\/ol>\n<p>Point 1 should be self-evident. Regarding point 2, the report is mass-transmitted from Ja&#8217;far Al-Sadeq, and several of Ja&#8217;far&#8217;s students in the diagram were even declared reliable in Twelver sources! Thus, this dismissal of the report&#8217;s authenticity by Hisham simply is a dishonest <em>ad hoc <\/em>appeal  (assuming Hisham actually uttered this statement cited by Al-Mufid.)<\/p>\n<p>Hisham and Al-Mufid&#8217;s attempt to dismiss the report&#8217;s authenticity ironically backfires on them. This is because other Shi&#8217;ite polemicists fabricated reports that reexplained the hadith in question today according to the Hisham&#8217;s &#8220;alternative explanation.&#8221; In his book, <em>Ma&#8217;ani Al-Akhbar<\/em>, Al-Saduq said:<\/p>\n<blockquote><p><span style=\"color: #ff0000;\">Muhammad b. &#8216;Ali Majilawayh<\/span> informed us, from his uncle Muhammad b. Abi Al-Qasem, from Ahmed b. Abi &#8216;Abdillah Al-Barqi, from his <span style=\"color: #ff0000;\">father<\/span>, from <span style=\"color: #ff0000;\">Muhammad b. Sinan<\/span>, from Mufaddal b. &#8216;Umar; he said: I asked Abu &#8216;Abdillah (as) about the meaning of the commander of the faithful&#8217;s statement when he looked at the second one (&#8216;Umar) as he was wrapped and said: &#8220;I would not love to meet Allah with anyone&#8217;s record asides from this wrapped man&#8217;s record.&#8221;<\/p>\n<p>Abu &#8216;Abdillah said: &#8220;He was referring to the document that was authored inside the Ka&#8217;bah.&#8221; (Al-Saduq 412)<\/p><\/blockquote>\n<p>This cop-out is diametrically opposed to Hisham b. Al-Hakam&#8217;s cited claim that the report was not authentic. Rather, Al-Sadiq quoted Ja&#8217;far Al-Sadiq providing an explanation of this report that can be reconciled with Twelver theology. Ja&#8217;far, however, is not quoted dismissing the report&#8217;s authenticity. He is quoted claiming that &#8216;Ali was referring to the same document mentioned in Hisham b. Al-Hakam&#8217;s answer.<\/p>\n<p>Unsurprisingly, this alleged statement of Ja&#8217;far Al-Sadiq is a baseless fabrication:<\/p>\n<ul>\n<li>Muhammad b. &#8216;Ali Majilawayh is unknown. (Al-Jawaheri 559)<\/li>\n<li>Muhammad b. Khaled Al-Barqi actually is unknown. His presense in <em>Tafsir Al-Qommi<\/em> is not tantamount to an endorsement, due to the <a href=\"http:\/\/www.aqaed.com\/faq\/3149\/\" rel=\"external nofollow\">inauthenticity<\/a> of Al-Qommi&#8217;s preface to his <em>tafsir<\/em><\/li>\n<li>Muhammad b. Sinan is unreliable. (Al-Jawaheri 535)<\/li>\n<li>Al-Mufaddal b. &#8216;Umar was very weak.\n<ul style=\"list-style-type: circle;\">\n<li>Al-Najashi described him saying: &#8220;A Kufan who is corrupt in his madhab, distorted in his transmission. He should not be considered. It was said that he was a Khattabi. I have mentioned several works of his, none of which can be relied upon. (Al-Khoei 19:317)<\/li>\n<li>Ibn Al-Ghada&#8217;iri said: &#8220;He is weak and incoherent, elevated in his speech, and a Khattabi. A lot has been falsely ascribed to him, and the extremists have severely depended on his transmission. It is not permissible to write his hadith.&#8221; (Al-Khoei 19:318)<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>A similar report can be found in the alleged book of &#8216;Abbad b. Ya&#8217;qub, where he transmitted a similar report from Ja&#8217;far Al-Sadiq.<\/p>\n<p>In his book, &#8216;Abbad is quoted transmitting it from <span style=\"color: #ff0000;\">Al-Husain<\/span> and<span style=\"color: #ff0000;\"> Zaid b. &#8216;Ali<\/span>, from Yahya b. &#8216;Abdillah b. Al-Husayn, from Ja&#8217;far b. Muhammad (as). (<em>Al-Usul Al-Sittat &#8216;Ashar<\/em> 18)<\/p>\n<ul>\n<li>&#8216;Abbad&#8217;s book was exclusively transmitted by the notorious forger, Abu Saminah Muhammad b. &#8216;Ali b. Ibrahim Al-Sayrafi. (Al-Jawahiri 551)<\/li>\n<li>Zaid b. &#8216;Ali b. Al-Husayn b. Zaid is unknown (Al-Jawaheri 238)<\/li>\n<li>Al-Husain b. Zaid b. &#8216;Ali b. Al-Husain is unknown. (Al-Jawaheri 169)<\/li>\n<\/ul>\n<p>These two baseless reports present an early Shi&#8217;ite attempt to appropriate this statement of &#8216;Ali and transform it into a condemnation of &#8216;Umar. These later fabricated traditions ascribed to Ja&#8217;far further mischaracterize the report&#8217;s context, since &#8216;Ali is quoted further praying for &#8216;Umar in multiple authentic redactions of the hadith.<\/p>\n<h2>Conclusion<\/h2>\n<p>Al-Sadiq, Al-Baqir and other members of <em>Ahlulbait<\/em> authentically quoted &#8216;Ali b. Abi Taleb, as he was in the presence of &#8216;Umar&#8217;s body, saying: &#8220;I would not love to meet Allah with anyone&#8217;s record asides from this wrapped man&#8217;s record.&#8221; As evident, the apparent meaning of this report conflicts with Twelver theology. Early Shi&#8217;ite polemicists thus varied in their reaction to this report&#8217;s content. Some, such as Sadir Al-Sayrafi, simply objected to the report without responding to its content. Others, such as Al-Mufid and Hisham b. Al-Hakam, attempted to dismiss its authenticity. Other polemicists forged reports that quoted Ja&#8217;far Al-Sadiq appropriating the text and transforming its apparent meaning into a condemnation of &#8216;Umar!<\/p>\n<p>It is sufficient to say, however, that all of these attempts to bypass and deflect the report&#8217;s implications are futile. Similarly, these polemical cop-outs demonstrate how later Twelver Shi&#8217;ite transmitters and polemicists misquoted the imams and distorted their statements and beliefs in an attempt to bolster the Twelver narrative, which is fundamentally based on the presentation <em>Ahlulbait<\/em> and the majority of the Sahabah as vile enemies. Thus, when a mass-transmitted authentic report presents an Imam praising a Sahabi who is hated by the Shia, Twelver polemicists will (unsurprisingly) try to find a cop-out to bypass its implications.<\/p>\n<blockquote><p>Behold! how they invent lies against Allah! Sufficient of a blatant sin is that alone! [Quran 4:50]<\/p><\/blockquote>\n<p>And Allah is the Witness of Abu Al-&#8216;Abbas<\/p>\n<h2 style=\"text-align: center;\"><span style=\"text-decoration: underline;\">Sources<\/span><\/h2>\n<p>Al-Asbahani, Abu Nu&#8217;aym. <em>Fada&#8217;il Al-Khulafaa&#8217; Al-Rashidin<\/em>. Edited by Saleh Al-&#8216;Uqail, 1st ed., Dar Al-Bukhari, 1417.<\/p>\n<p>Al-Jawaheri, Muhammad. <em>Al-Mufid min Mo’jam Rijal Al-Hadith. <\/em>2nd ed., Al-‘Ilmiyyah Al-Fil, 1424.<\/p>\n<p>Al-Khoei, Abu Al-Qasem. <em>Mo’jam Rijal Al-Hadith<\/em>. 5th ed., Markaz Nashr Al-Thaqafah Al-Islamiyyah, 1992.<\/p>\n<p>Al-Mahmudi, Diya Al-Din. <em>Al-Usul Al-Sittah ‘Ashar min Al-Usul Al-Awwaliyyah<\/em>, ed. Neamatullah Al-Jalili and Mahdi Ghulam-Ali, 2nd ed., Dar Al-Shabstari, 1405.<\/p>\n<p>Al-Mufid, Muhammad. <em>Al-Fusul Al-Mukhtarah<\/em>. Edited by &#8216;Ali Mir Sharifi, 2nd ed., Dar Al-Mufid, 1993.<\/p>\n<p>Al-&#8216;Uqaili, Muhammad. <em>Al-Du&#8217;afaa&#8217; Al-Kabir<\/em>. Edited by AbdulMu&#8217;ti Qal&#8217;aji, 1st ed., Dar Al-Maktabah Al-&#8216;Ilmiyyah, 1984.<\/p>\n<p>Ibn Babawayh, Al-Saduq. <em>Ma&#8217;ani Al-Akhbar<\/em>. Edited by Akbar Al-Ghifari, Intisharat Islami, 1361.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>It should not be a surprise for one to find the earliest historical sources replete with praise of the companions of the Prophet by the Imams of the Twelvers. Such reports demonstrate the defective nature of the Twelver historical narrative, <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/03\/22\/ali-al-baqir-and-al-sadiq-authentically-praise-umar\/\" title=\"Ali, Al-Baqir and Al-Sadiq AUTHENTICALLY Praise &#8216;Umar bin Al-Khattab\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4709","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4709","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4709"}],"version-history":[{"count":12,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4709\/revisions"}],"predecessor-version":[{"id":4727,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4709\/revisions\/4727"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4709"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4709"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4709"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}