{"id":475,"date":"2013-06-12T20:56:01","date_gmt":"2013-06-12T20:56:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=475"},"modified":"2013-11-06T10:20:55","modified_gmt":"2013-11-06T10:20:55","slug":"475","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/06\/12\/475\/","title":{"rendered":"Response to: Proof of Leadership With Divine Authority in the Words of Allah (swt) and His Messenger (saw)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=475\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on Revisitingthesalaf.org, entitled: Proof of Leadership With Divine Authority in the Words of Allah (swt) and His Messenger (saw), published on the 2<sup>nd<\/sup> of November, 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/11\/proof-of-leadership-with-divine.html\" rel=\"nofollow external\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">RevisitingtheSalaf(RTS), in this article, quotes an awkward narration in an attempt to prove the Imamate of the Twelve. The narration from Al-Kafi is authentic to Shia standards; however, the text itself seems to contradict the purpose of the author. Here is the text in full:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Alee ibn Ibraheem has narrated from Muhammad ibn ‘Isa from Younis and Alee ibn Muhammad from Sahl ibn Ziyad, Abu Sa‘id from Muhammad ibn ‘Isa from Younis from ibn Muskan from Aboo Basir (r.a) who has said the following:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>يَـأَيُّهَا الَّذِينَ ءَامَنُواْ أَطِيعُواْ اللَّهَ وَأَطِيعُواْ الرَّسُولَ وَأُوْلِى الاٌّمْرِ مِنْكُمْ فَإِن تَنَازَعْتُمْ فِى شَىْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الاٌّخِرِ ذلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلاً<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>“I asked Abu ‘Abd Allah Imam Al-Sadiq, recipient of divine supreme covenant, about the words of Allah, the Most Holy, the Most High: ‘Believers, obey Allah, His Messenger, and your leaders (who possess Divine Authority).’<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Holy Qu&#8217;raan (4:59)<\/strong><\/span><br \/>\n<span style=\"color: #ff0000;\">The Imam (a.s) said, ‘This was sent from the heavens about Alee ibn Aboo Talib (a.s), Al-Hassan and Al-Hussain (peace be upon them both), recipients of divine supreme covenant.’ I then said, ‘People say, “Why did He not specify Alee (a.s) and his family by their names in the Book of Allah, the Most Holy, the Most High?’ “The Imam (a.s)  said, ‘Say to them, “The command for prayer came to the Messenger of Allah (saw) but he has not specified (the number of the Rak‘ats) for them as being three or four. It, in fact, was the Messenger of Allah (saw) who explained to them this matter. The command for Zakat (a form of income tax) came to the Messenger of Allah (saw) and there was no specific taxable number such as one Dirham on every forty Dirham. It was the Messenger of Allah (saw) who explained it for them. The command for Hajj came to the Messenger of Allah (saw) It did not say walk seven times around the Ka‘ba. It was the Messenger of Allah (saw) who explained it for them. The verse about obedience came, ‘Believers, obey Allah, His Messenger and your leaders (who possess Divine Authority). . . .’ (4:59) It came to declare that Alee, Al-Hassan and Al-Hussain, recipients of divine supreme covenant, were the Leaders who possessed Divine Authority. The Messenger of Allah (saw) then said about Alee, recipient of divine supreme covenant, ‘Over whomever I have Divine Authority, Alee (a.s), recipient of divine supreme covenant, also has Divine Authority over him.’ He also has said, ‘I enjoin you to follow the Book of Allah (swt) and my family (a.s). It is because I have prayed to Allah (swt), the Most Holy, the Most High, not to separate these two from each other until He will make them arrive at Al-Kawthar (the pond of paradise) to join me. He has granted my prayer as such.’ “The Holy Prophet (saw), recipient of divine supreme covenant, has said, ‘Do not try to teach them (‘A’immah); they are far more knowledgeable than you.’ The Holy Prophet (saw) has said, ‘‘A’immah, recipients of divine supreme covenant, will never take you out of the gate of guidance and they will never make you enter the gate of error.’ Had the Messenger of Allah (saw) remained silent and had not explained anything about his Ahlulbayt (the family) the family of so and so would have advanced their claim for Imamat (Leadership with Divine Authority).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">However, Allah (swt), the Most Holy, the Most High, has revealed it in His book to confirm the explanations of His Prophet about Ahl al-Bayt (in the following verse):<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>وَقَرْنَ فِى بُيُوتِكُنَّ وَلاَ تَبَرَّجْنَ تَبَرُّجَ الْجَـهِلِيَّةِ الاٍّولَى وَأَقِمْنَ الصَّلَوةَ وَءَاتِينَ الزَّكَـوةَ وَأَطِعْنَ اللَّهَ وَرَسُولَهُ إِنَّمَا يُرِيدُ اللَّهُ لِيُذْهِبَ عَنكُـمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيــراً<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>‘People of the house, Allah wants to remove all kinds of uncleanness from you and to purify you thoroughly.’<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Holy Qu&#8217;raan (33:33)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Alee, Faatimah, Al-Hassan and Al-Hussain (peace be upon them all), recipients of divine supreme covenant, were there and the Holy Prophet made them to enter under Al-Kisa’ (the Cloak) in the house of ’Umm Salama (r.a) and then said, ‘O Lord, every prophet had a family and a heaviness and credence, and these are my family, my heaviness and credence.’ ’Umm Salama (r.a) at this point said, ‘Am I not of your family?’ The Holy Prophet (saw) said, ‘You are in goodness but these are my family, my heaviness and credence.’<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">“When the Messenger of Allah (saw) passed away, Alee, recipient of divine supreme covenant, had the utmost priority and guardianship of the people because of what the Messenger of Allah (saw) had preached about him. It was because of raising him up for the people and holding his hand in his hand. When Alee (a.s), recipient of divine supreme covenant, (was about to) pass away he could not (and would not) enter Muhammad ibn Alee or Al- ‘Abbas ibn Alee or any one of his other sons in the position of Imamat (Leadership with Divine Authority). Otherwise, Al-Hassan and Al-Hussain (peace be upon them both), recipients of divine supreme covenant, would have said, ‘Allah, the Most Holy, the Most High, has revealed about us just as He has done so about you, and He has commanded people to obey us just as He has commanded people to obey you. The Messenger of Allah (saw) has preached to people about us just as he has done so about you. Allah (swt) has removed Al-Rijs (uncleanness) from us just as He has done so to you.’  “When Alee, recipient of divine supreme covenant, left this world, Al-Hassan (a.s) had the utmost priority for Imamat (Leadership with Divine Authority); he was the eldest. When he was about to die he could not, and would not, enter his sons in the position of Imamat. It is because Allah, the Most Holy, the Most High, says, ‘. . . <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>وَأَزْوَجُهُ أُمَّهَـتُهُمْ وَأُوْلُو الاٌّرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِى كِتَـبِ اللَّهِ مِنَ الْمُؤْمِنِينَ وَالْمُهَـجِرِينَ<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>The relatives are closer to each other, according to the Book of Allah, than the believers and the emigrants.’<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Holy Qu&#8217;raan (33:6)<\/strong><\/span><br \/>\n<span style=\"color: #ff0000;\">Had he then placed Imamat in his sons, Al-Hussain (a.s), recipient of divine supreme covenant, would have said, ‘Allah (swt) has commanded people to obey me just as He has commanded people to obey you and to obey your father. The Messenger of Allah (saw) has preached to people about me just as he has preached to people about you and your father. Allah (swt) has removed Al-Rijs (uncleanliness) from me just as He has removed it from you and your father.’  “When Imamat was in full force with Al-Hussain (a.s), recipient of divine supreme covenant, there was no one in his family who could claim against him as he could claim against his brother and father. He could do so in case they had (his father and brother) wanted to divert it from him but they did not and would not do so. After them it found its place with Al-Husayn, recipient of divine supreme covenant, and the interpretation of this verse continued to remain valid, ‘. . . The relatives are closer to each other, according to the Book of Allah, than the believers and the emigrants. . . .’ (33:6). “After Al-Hussain, recipient of divine supreme covenant, Imamat found its place with Alee ibn al-Hussain (a.s), recipient of divine supreme covenant. After Alee ibn al-Hussain (a.s), recipient of divine supreme covenant, it (Leadership with Divine Authority) found its place with Muhammad ibn Alee, recipient of divine supreme covenant. The Imam (a.s) said, ‘Al-Rijs means doubts. I swear by Allah that we never doubt in our Lord.’”<\/span><\/p>\n<p style=\"text-align: justify;\">The first issue with the narration is that the verse says: “Believers, obey Allah, His Messenger, and your leaders”. RTS saw it fit to add in “who possess divine authority” even though nothing in the verse implies it. The verse, when quoted in full though, seems to go against the concept of Imamate. The continuation says, “If ye differ in anything among yourselves, refer it to Allah and His Messenger, if ye do believe in Allah and the Last Day: That is best, and most suitable for final determination.” This implies that the Muslims are to only refer to Allah and His Messenger, and not to anyone else. If the Imamate was a matter of divine authority, then surely Allah would have told us to refer it to Allah, His Messenger, and our leaders (the Imams).<\/p>\n<p style=\"text-align: justify;\">All Muslims know that absolute obedience is for Allah and his Prophet (saws) as the Qur&#8217;an states over and over:<\/p>\n<p style=\"text-align: justify;\">[Say, &#8220;Obey Allah and the Messenger.&#8221; But if they turn away &#8211; then indeed, Allah does not like the disbelievers.] (3:32)<\/p>\n<p style=\"text-align: justify;\">[And obey Allah and the Messenger that you may obtain mercy.] (3:132)<\/p>\n<p style=\"text-align: justify;\">[And obey Allah and obey the Messenger and beware. And if you turn away &#8211; then know that upon Our Messenger is only [the responsibility for] clear notification.] (5:92)<\/p>\n<p style=\"text-align: justify;\">[So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.] (8:1)<\/p>\n<p style=\"text-align: justify;\">[O you who have believed, obey Allah and His Messenger and do not turn from him while you hear [his order].] (8:20)<\/p>\n<p style=\"text-align: justify;\">[And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient.] (8:46)<\/p>\n<p style=\"text-align: justify;\">[O you who have believed, obey Allah and obey the Messenger and do not invalidate your deeds.] (47:33)<\/p>\n<p style=\"text-align: justify;\">And others&#8230; As the reader notices, the absolute obedience is always for Allah and his messenger (saws). However, this verse is an exception as it adds a new element, it tells us to obey Allah and obey the messenger and those of us in authority, observe that the word &#8220;obey&#8221; is placed in front of the words Allah and messenger but not in front of the word &#8220;Those in authority&#8221; this is because their obedience is tied with the obedience of Allah and his messenger, if the leaders obey Allah then we obey the leaders and this is made clear in various prophetic narrations.<\/p>\n<p style=\"text-align: justify;\">Since this verse is an exception, it is also accompanied by a condition, and the condition is that if we differ with these leaders we should return the matter to Allah and his messenger (saws), WHY? Because they are divine and infallible and their obedience is absolute, we can differ with the leaders but we cannot differ with Allah and his messenger (saws).<\/p>\n<p style=\"text-align: justify;\">It was due to this that some of the early Shias fabricated evidence that the Qur&#8217;an has been manipulated. For example, in Tafseer Al-Qumi (p. 135), we read:<\/p>\n<p style=\"text-align: justify;\">فرض على الناس طاعتهم فقال: { يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم } يعني أمير المؤمنين عليه السلام حدثني أبي عن حماد عن حريز عن أبي عبدالله عليه السلام قال نزلت: { فإن تنازعتم في شيء فارجعوه إلى الله والرسول وأولي الأمر منكم }.<\/p>\n<p style=\"text-align: justify;\">[He made their obedience obligatory on the people, so he said: {Believers, obey Allah, His Messenger, and your leaders} meaning Ameer al-Mu&#8217;mineen peace be upon him. My father told me, from Hamad bin Hurayz, from abu `Abdillah (as) that he said: &#8220;It was revealed: {refer it to Allah, His Messenger, <strong>and the leaders among you.<\/strong>}&#8221;]<\/p>\n<p style=\"text-align: justify;\">A similar narration is present in Rawdat Al-Kafi #212 in which he recites the verse in that fashion, implying that the Qur&#8217;an is corrupted.<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ تَلَا أَبُو جَعْفَرٍ ( عليه السلام ) أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ فَإِنْ خِفْتُمْ تَنَازُعاً فِي الْأَمْرِ فَأَرْجِعُوهُ إِلَى اللَّهِ وَ إِلَى الرَّسُولِ وَ إِلَى أُولِي الْأَمْرِ مِنْكُمْ ثُمَّ قَالَ كَيْفَ يَأْمُرُ بِطَاعَتِهِمْ وَ يُرَخِّصُ فِي مُنَازَعَتِهِمْ إِنَّمَا قَالَ ذَلِكَ لِلْمَأْمُورِينَ الَّذِينَ قِيلَ لَهُمْ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ<\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim, from his father, from ibn abi `Umayr, from `Umar bin Udhaynah, from Burayd bin Mu`awiyah that abu Ja`far (as) recited: {Believers, obey Allah, His Messenger, and your leaders, if ye fear that you would differ among yourselves then refer it to Allah and the messenger <strong>and your leaders<\/strong>} Then he (as) said: &#8220;How can he order their obedience then allow you to differ with them? He only meant the ones who are under orders when he said {Obey Allah and obey the messenger}.]<\/p>\n<p style=\"text-align: justify;\">The narration was declared as &#8220;Hasan&#8221; by Al-Majlisi in his book &#8220;Mir&#8217;at al-`Uqoul&#8221; 26\/76.<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi adds:<\/p>\n<p style=\"text-align: justify;\">[It is apparent from many of the narrations that the term &#8220;and the leaders among you&#8221; was affirmed here, but was then removed.]<\/p>\n<p style=\"text-align: justify;\">So, al-Majlisi confirms that Tahreef has occurred in the Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">If this clear and obvious understanding was apparently to us writers at twelvershia.net, then it would be more likely so to Ja’far Al-Sadiq and the Imams that came before him, who were well versed with knowledge of the Qur’an.<\/p>\n<p style=\"text-align: justify;\">Now a Shia will say that the narration above is a mistake, How can `Ali bin Ibrahim and his father attribute such a narration of  Tahreef to al-Sadiq? Well at the end of this response, we will include a few examples of these same narrators attributing Tahreef to the Imams.<\/p>\n<p style=\"text-align: justify;\">Secondly, and perhaps even more importantly, Ja’far interprets the word Rijs to mean doubt, which conflicts with the Shia understanding of Imamate. He says at the end of the narration that RTS quoted:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Imam (a.s) said, ‘Al-Rijs means doubts. I swear by Allah that we never doubt in our Lord.’<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">If one attempts to include this interpretation into verse 33:33 we will find the following: “Allah’s wish is but to remove the doubts far from you, O Folk of the Household, and cleanse you with a thorough cleansing.” This means that the Imams themselves had doubts in Allah and that it was only with the supplication of the Prophet (pbuh) that these doubts were removed.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">In conclusion, the Twelvers are left with two options, either to reject this narration as proof from Imamate, since it contradicts their understanding of it, or to accept the narration and reject the concept of Imamate.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>SOME EXAMPLES OF `ALI BIN IBRAHIM AND HIS FATHER IBRAHIM BIN HASHIM ATTRIBUTING TAHREEF TO THE IMAMS:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">`Ali bin Ibrahim and his father Ibrahim bin Hashim are two narrators who are suspected of fabricating or inventing a huge part of the extreme and un-Islamic Shia narrations, sadly both are considered trustworthy by the Shia of today even though they know absolutely nothing about Ibrahim ibn Hashim. In addition to the narration you have read above, here are some more examples:<\/p>\n<p style=\"text-align: justify;\">1 &#8211; al-Kafi vol 8 pg 290, Authenticated by Majlisi 26\/316:<\/p>\n<p style=\"text-align: justify;\"><strong>عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ اتَّبَعُوا ما تَتْلُوا الشَّياطِينُ بِوَلَايَةِ الشَّيَاطِينِ عَلى مُلْكِ سُلَيْمانَ وَ يَقْرَأُ أَيْضاً سَلْ بَنِي إِسْرائِيلَ كَمْ آتَيْناهُمْ مِنْ آيَةٍ بَيِّنَةٍ فَمِنْهُمْ مَنْ آمَنَ وَ مِنْهُمْ  مَنْ جَحَدَ وَ مِنْهُمْ مَنْ أَقَرَّ وَ مِنْهُمْ مَنْ بَدَّلَ وَ مَنْ يُبَدِّلْ نِعْمَةَ اللَّهِ مِنْ بَعْدِ ما جاءَتْهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقابِ .<\/strong><\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from `Ali bin Asbat from `Ali bin abi Hamzah from abu Baseer from abu `Abdillah (as):<br \/>\n{And they followed [instead] what the devils had recited <strong>with the authority of the devils<\/strong> during the reign of Solomon.}<br \/>\nAnd he also recited:<br \/>\n{Ask the Children of Israel how many a sign of evidence We have given them. <strong>So from them is he who believed, and from them is he who rejected, and from them is he who affirmed, and from them is he who changed<\/strong>, And whoever exchanges the favor of Allah [for disbelief] after it has come to him &#8211; then indeed, Allah is severe in penalty.}]<\/p>\n<p>Correct verses are as follows:<br \/>\n{And they followed [instead] what the devils had recited during the reign of Solomon.} (Qur&#8217;an 2:102)<\/p>\n<p>and:<br \/>\n{Ask the Children of Israel how many a sign of evidence We have given them. And whoever exchanges the favor of Allah [for disbelief] after it has come to him &#8211; then indeed, Allah is severe in penalty.} (Qur&#8217;an 2:211)<\/p>\n<p style=\"text-align: justify;\">2- al-Kafi vol 8 pg 184, authenticated by Majlisi 26\/75:<\/p>\n<p style=\"text-align: justify;\"><strong>  عَنْهُ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ لَوْ أَنَّا كَتَبْنا عَلَيْهِمْ أَنِ اقْتُلُوا أَنْفُسَكُمْ وَ سَلِّمُوا لِلْإِمَامِ تَسْلِيماً أَوِ اخْرُجُوا مِنْ دِيارِكُمْ رِضًا لَهُ ما فَعَلُوهُ إِلَّا قَلِيلٌ مِنْهُمْ وَ لَوْ أَنَّ أَهْلَ الْخِلَافِ فَعَلُوا ما يُوعَظُونَ بِهِ لَكانَ خَيْراً لَهُمْ وَ أَشَدَّ تَثْبِيتاً وَ فِي هَذِهِ الْآيَةِ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ مِنْ أَمْرِ الْوَالِي وَ يُسَلِّمُوا لِلَّهِ الطَّاعَةَ تَسْلِيماً .<\/strong><\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from `Ali bin Asbat from `Ali bin abi Hamzah from abu Baseer from abu `Abdillah (as):<br \/>\n{And if We had decreed upon them, &#8220;Kill yourselves <strong>and submit to the Imam in (full, willing) submission<\/strong> or Leave your homes,&#8221; they would not have done it, except for a few of them. <strong>And if the opponents<\/strong> did what they were instructed to do, it would have been better for them and a firmer position [for them in faith].} and in this verse: {and then find within themselves no discomfort from what you have judged<strong> in the matter of the leadership<\/strong>, and submit to Allah their obedience in [full, willing] submission.}]<\/p>\n<p>Correct verses are as follows:<br \/>\n{And if We had decreed upon them, &#8220;Kill yourselves&#8221; or &#8220;Leave your homes,&#8221; they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith].}<br \/>\n(Qur&#8217;an 4:66)<\/p>\n<p>And:<br \/>\n{But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.}<br \/>\n(Qur&#8217;an 4:65)<\/p>\n<p style=\"text-align: justify;\">3- al-Kafi vol 8 pg 205, authenticated by Majlisi 26\/118:<\/p>\n<p style=\"text-align: justify;\"><strong>عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ تَلَوْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) ذَوا عَدْلٍ مِنْكُمْ فَقَالَ ذُو عَدْلٍ مِنْكُمْ هَذَا مِمَّا أَخْطَأَتْ فِيهِ الْكُتَّابُ .<\/strong><\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from ibn abi `Umayr from Hammad bin `Uthman that he said: I recited to abu `Abdullah (as) {Two just men from among you} he said it is {<strong>A just man<\/strong> among you}: &#8220;This is from the mistakes of the writers.&#8221;]<\/p>\n<p>Correct verse is as follows:<br \/>\n{O you who have believed, do not kill game while you are in the state of ihram. And whoever of you kills it intentionally &#8211; the penalty is an equivalent from sacrificial animals to what he killed, as judged by two just men among you as an offering [to Allah] delivered to the Ka&#8217;bah, or an expiation: the feeding of needy people or the equivalent of that in fasting, that he may taste the consequence of his deed. Allah has pardoned what is past; but whoever returns [to violation], then Allah will take retribution from him. And Allah is Exalted in Might and Owner of Retribution.} (Qur&#8217;an 5:95)<\/p>\n<p style=\"text-align: justify;\">4-al-Kafi vol 1 pg 391, authenticated by Majlisi 4\/283:<\/p>\n<p style=\"text-align: justify;\"><strong>عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ أَوْ بُرَيْدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لَقَدْ خَاطَبَ اللَّهُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فِي كِتَابِهِ قَالَ قُلْتُ فِي أَيِّ مَوْضِعٍ قَالَ فِي قَوْلِهِ وَ لَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ فَاسْتَغْفَرُوا اللَّهَ وَ اسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّاباً رَحِيماً. فَلا وَ رَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيما شَجَرَ بَيْنَهُمْ فِيمَا تَعَاقَدُوا عَلَيْهِ لَئِنْ أَمَاتَ اللَّهُ مُحَمَّداً أَلَّا يَرُدُّوا هَذَا الْأَمْرَ فِي بَنِي هَاشِمٍ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ عَلَيْهِمْ مِنَ الْقَتْلِ أَوِ الْعَفْوِ وَ يُسَلِّمُوا تَسْلِيماً .<\/strong><\/p>\n<p style=\"text-align: justify;\">[`Ali bin Ibrahim from his father from ibn abi `Umayr from ibn Uthaynah from Zurarah or Burayd from abi Ja`far (as) that he said: &#8220;Allah addressed Ameer-ul-Mu&#8217;mineen in his book.&#8221; I said: &#8220;Where?&#8221; he (as) said: &#8220;In his saying {And if, when they wronged themselves, they had come to you, and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful. But no, by your Lord, they will not [truly] believe until they make you, judge concerning <strong>that which they agreed on, that if Allah put Muhammad to death they shall never return this matter to bani Hashim<\/strong> and then find within themselves no discomfort from your <strong>judgement on them to either kill or forgive [them]<\/strong> and that they submit in [full, willing] submission.}&#8221;]<\/p>\n<p>Correct verse is as follows:<br \/>\n{And We did not send any messenger except to be obeyed by permission of Allah. And if, when they wronged themselves, they had come to you, [O Muhammad], and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful.} (Qur&#8217;an 4:64)<br \/>\n{But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} (Qur&#8217;an 4:65)<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on Revisitingthesalaf.org, entitled: Proof of Leadership With Divine Authority in the Words of Allah (swt) and His Messenger (saw), published on the 2nd of November, 2012, and can be found here. RevisitingtheSalaf(RTS), in this <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/06\/12\/475\/\" title=\"Response to: Proof of Leadership With Divine Authority in the Words of Allah (swt) and His Messenger (saw)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,5,4],"tags":[],"class_list":{"0":"post-475","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"category-imamah","9":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/475","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=475"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/475\/revisions"}],"predecessor-version":[{"id":717,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/475\/revisions\/717"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=475"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=475"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=475"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}