{"id":481,"date":"2013-06-14T20:18:43","date_gmt":"2013-06-14T20:18:43","guid":{"rendered":"http:\/\/twelvershia.net\/?p=481"},"modified":"2013-06-14T20:58:54","modified_gmt":"2013-06-14T20:58:54","slug":"response-to-they-punctured-the-ark","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/06\/14\/response-to-they-punctured-the-ark\/","title":{"rendered":"Response to: They Punctured the Ark"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=481\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on RevisitingtheSalaf entitled: They Punctured the Ark, which was published on the 11<sup>th<\/sup> of May, 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/05\/they-punctured-ark.html\" rel=\"nofollow external\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS’ focus in this article was to demonstrate how to refute a simple claim that was made by Ibn Taymiyyah, which was that the Imamis did not take their religion from Ahlulbayt and that it is actually the Sunnis who are their true followers.<\/p>\n<p style=\"text-align: justify;\">RTS to counter this statement, started going out of their way to find criticisms by Sunni scholars that were directed to the Twelve Imams, assuming that being successful in collecting these would lead to proving that Ibn Taymiyyah was wrong and it is the Shias that are the true followers of Ahlulbayt.<\/p>\n<p style=\"text-align: justify;\">However, something strange occurred along the way. RTS started to interpret the words of Ibn Taymiyyah by imposing Shia preconceptions, for Ibn Taymiyyah did not mean to say that the Sunnis are the followers of the Twelve Imams, but rather, said that they are the followers of the Imams of Ahlulbayt. The wording may seem similar, but remember, Ibn Taymiyyah doesn’t believe in the concept of Imamate in the first place, so it is natural for him to have a different understanding of the term “Ahlulbayt”. Anyone who has read &#8220;Minhaaj al-Sunnah&#8221; in the first place will be aware that Ibn Taymiyyah mocks the very concept of there being a hidden twelfth Imam. We also know that he doesn’t limit the Imams to the children of Al-Hussain (ra), but Ahlulbayt includes all the children of Ali and the children of Al-Abbas (ra) as well. RTS apparently has overlooked this fact even though it is very obvious from Ibn Taymiyyah’s words.<\/p>\n<p style=\"text-align: justify;\">Ibn Taymiyyah himself says on one occasion that the four Imams after Al-Redha were not known for knowledge. How is it possible that Ibn Taymiyyah meant that the Sunnis have taken knowledge from them when he says that they are not known for knowledge? Surely, such a thing is not logical, which leads us to the conclusion that Ibn Taymiyyah’s definition of Ahlulbayt is different from that which is adopted by Twelvers.<\/p>\n<p style=\"text-align: justify;\">Carrying on, RTS starts quoting several statements from scholars that imply that Ja’far Al-Sadiq made mistakes, or was not at the same level as some other scholars of his time. RTS also quotes other narrations that show that the Imams are seen as inferior to other scholars. Here are some quotes by RTS:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Ibn Taymiyyah Regarding The Ahlulbayt (a.s)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And likewise, most of the Imams of the people of Hadeeth like Malik, and Shi&#8217;ba, and Al-Thawri, and Ahmad bin Hanbal whoever knows their case knows a certain knowledge that they absolutely do not believe that any lie has occurred in the narration of the Prophet (saw) and they know that they (i.e. the narrators) do not commit mistakes except for one or two pronounciations. And from among them there are some who knows that he would commit mistakes in the Prophetic narration, for Ahmad bin Hanbal absolutely knew that he would commit mistakes in it, but neither Al-Thawri or Al-Zuhri did, and so did a lot of people other than them. <strong>And those who know that they would commit mistakes like Himad bin Salama and Ja&#8217;far bin Mohammad (Imam Saddiq)<\/strong> would know that their mistake would be something that would pass on and would be in occasions they would know.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Jawab Al-I&#8217;tiraadhat Al-Masriya &#8216;Alal-Futya Al-Hamawiya. Pg. # 42.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>&#8220;Verily Al-Zuhri is more knowledgeable about the Prophetic hadeeths, statements and actions than Aboo Ja&#8217;far Muhammad bin Alee and the scholars agreed on that,<\/strong> and (al-Zuhri) was a contemporary for the Prophet (saw).<\/span><\/p>\n<p style=\"text-align: justify;\">Note: Al-Zuhri was not a contemporary of the Prophet (pbuh). However, this is a misunderstanding by RTS. The Arabic text says that he was a contemporary to him, meaning Al-Zuhri was a contemporary to Al-Baqir.<\/p>\n<p style=\"text-align: justify;\">Carrying on, RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>However regarding Musa bin Ja&#8217;far, Alee bin Musa and Muhammad bin Alee, no one among those who possess knowledge doubt that Malik bin Anas, Hamaad bin Zaid, Hamaad bin Salama, Al-Laith bin Saad, Al-Awzaei, Yahya bin Saeed, W&#8217;akei bin Al-Jarah, Abdullah bin Al-Mubarak, Al-Shaf&#8217;i, Ahmad bin Hanbal, Ishaq bin Rahwei and others were more knowledgeable about the Prophetic hadeeth than them.&#8221;<\/strong><\/span><br \/>\n<span style=\"color: #ff0000;\"><strong>Source: Minhaj Al-Sunnah. Vol. 2, Pg. # 460 &#8211; 461 &#8211; 462.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>&#8220;Alee bin Al-Hussain, his son Aboo Ja&#8217;far and his son Ja&#8217;far bin Muhammad <\/strong>taught people what Allah (swt) taught them in the same manner that (Allah) taught the other scholars during their lives. <strong>Verily there were people during their lifetimes that were more knowledgeable and more useful for the nation than them.&#8221;<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Minhaj Al-Sunnah. Vol. 4, Pg. # 387.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">The response to these is simple. There is a consensus among Sunni scholars that what Ibn Taymiyyah has said above is true, and that these scholars from Ahlulbayt were inferior to some of the scholars of their time. However, such a thing does not mean that we do not take knowledge from them. Similarly, no Sunni will disagree that Abu Bakr was superior to Omar, however, we take knowledge from both. There is no reason why Sunnis cannot see certain scholars as superior to Ja’far Al-Sadiq while still choose to take knowledge from him.<br \/>\nRTS went on to quote various Sunni scholars casting doubt upon the reliability of Al-Redha, the eighth Shia Imam, and the Imams that came after him, then accuses Sunnis of not following Ahlulbayt. Again, we say that the Sunnis are the followers of Ali, Ibn Abbas, Ali bin Abdullah bin Al-Abbas, Mohammad bin Ali bin Abdullah bin Al-Abbas, Mohamad bin Al-Hanafiya, Zaid bin Al-Hasan, Ali bin Al-Hussain, Mohammad bin Ali, Ja’far bin Mohamad, and the list goes on and on. If RTS or any other Shias want to assert their definition on the term Ahlulbayt, then they are free to do so, given that they can provide proper evidence that it is a term that is exclusive to twelve people.<\/p>\n<p style=\"text-align: justify;\">\n<div style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Some important side-comments that do not revolve around the main topic:<\/strong><\/span><\/div>\n<div style=\"text-align: justify;\"><\/div>\n<div style=\"text-align: justify;\">&#8211; RTS has not provided sufficient evidence that Abu Hanifah said that, “Without the two years Al-Numan would have perished.&#8221;<br \/>\n&#8211; RTS criticizes Ibn Taymiyyah for saying that Ibn Abbas (ra) didn’t take knowledge of Tafseer from Ali (ra), yet, the case is similar in Shia books, for very little of the Tafseer is authentically attributed to Ali (ra). In any case, Ibn Abbas (ra) not taking Tafseer knowledge from Ali (ra) does not contradict that he was a major scholar in Tafseer.<br \/>\n&#8211; RTS states that Ali (ra) collected the Qur’an after the death of the Prophet (pbuh), but they provide no evidence or sources to prove this.<\/div>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf entitled: They Punctured the Ark, which was published on the 11th of May, 2012, and can be found here. RTS’ focus in this article was to demonstrate how to refute a simple <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/06\/14\/response-to-they-punctured-the-ark\/\" title=\"Response to: They Punctured the Ark\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-481","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/481","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=481"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/481\/revisions"}],"predecessor-version":[{"id":486,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/481\/revisions\/486"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}