{"id":4891,"date":"2019-04-25T20:33:16","date_gmt":"2019-04-25T20:33:16","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4891"},"modified":"2019-04-25T20:44:11","modified_gmt":"2019-04-25T20:44:11","slug":"shia-islam-in-the-eyes-of-a-non-muslim","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/04\/25\/shia-islam-in-the-eyes-of-a-non-muslim\/","title":{"rendered":"Shia Islam in the Eyes of a Non-Muslim"},"content":{"rendered":"<img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4891\" alt=\"\" \/>\n<p>In Sunni-Shia polemics, Sunnis and Shias often end up debating minute theological, historical and jurisprudential technicalities such that they often overlook the bigger picture. The implications of entire historical narratives are thus neglected as polemicists passionately debate specific details from those narratives. However, the question that must be asked is: how do such narratives, at the end of the day, depict the Prophet and Islam? In this article, we shall dissect Shia Islam from the neutral perspective of a non-Muslim bystander.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">In a Nutshell:<\/h3>\n\n\n\n<p>This article commences with a genuine inquiry from a non-Muslim bystander: &#8220;What is Shia Islam?&#8221;<\/p>\n\n\n\n<p>In response to this question, we shall fairly outline and present the <u class=\"remove-format\">Twelver Shi&#8217;ite narrative:<\/u><\/p>\n\n\n\n<p>In the 7th century, Allah sent a Messenger from the tribe of Quraish to the people of Mecca and surrounding Pagan Arabs. The purpose of this Prophet was to invite the idolaters to monotheism and the worship of Allah alone. Thus, the Prophet faced persecution and resistance from the Pagans who viewed his faith as a threat to their institutions. <\/p>\n\n\n\n<p>HOWEVER, this Prophet also preached that his family, out of all people, were superior to all of mankind.  He even claimed that his cousin, &#8216;Ali, was the best of all mankind after him. This Prophet even continuously asserted that only his cousin were to rule his subjects after his death, and on numerous occasions, he openly appointed his cousin, &#8216;Ali (out of all people), as a religious and political successor. <\/p>\n\n\n\n<p>This prophet also regularly claimed that only twelve members <u class=\"remove-format\">from his household <\/u>were to legitimately assume rulership of the community after him. Not only did this Prophet continuously assert that his household had exclusive rights to the political leadership of his subjects, but he also regularly asserted that his own family had exclusive religious authority over his religious community.<\/p>\n\n\n\n<p>This Prophet received a book from God called the Quran. This book, as reported in various Twelver sources, was revealed in fourths. One fourth of it was in the merits of his own family, one fourth was in the blunders of his family&#8217;s enemies,  one fourth was in stories and parables and the last fourth pertained to religious rulings.<\/p>\n\n\n\n<p>This Prophet even claimed that his daughter and her husband (his cousin) were infallible, and he similarly claimed that 11 of his descendants were infallible as well. He even ventured to claim that those individuals from his family had knowledge of the unseen, and control over the universe (a concept later coined as <em>Wilayah Takwiniyyah<\/em>). <\/p>\n\n\n\n<p>This Prophet even claimed that the followers and supporters of his family would rest in Heaven and that opponents of his family would dwell in Hell.<\/p>\n\n\n\n<p>After this Prophet&#8217;s death, his closest followers and disciples took part in a massive conspiracy that usurped rulership from his family, which they were expected to assume. Then, his disciples proceeded to murder his own daughter inside her house.  Then, this Prophet&#8217;s religion was hijacked (by his closest companions), and this hijacked\/distorted version of Islam has prevailed in the Muslim community since then.<\/p>\n\n\n\n<p>This is a brief summary of the Prophet&#8217;s life in light of Twelver theology. If someone were to claim that we have misrepresented Twelver theology in this article, then we challenge them to demonstrate how we have done so.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Discussion<\/h3>\n\n\n\n<p>It is evident that such a narrative, in reality, discredits the Prophet as a power-thirsty individual who ultimately sought power and status for his family. The fact that a fundamental tenant of his faith was <em>wilayah  <\/em>(loyalty) to his family merely demonstrates this reality. <\/p>\n\n\n\n<p>Critics of Islam have often made this point, and the best response to this claim is to demonstrate the impartiality of the Prophet with regards to political rulership and succession! However, a narrative that presents the Prophet as an individual who continuously aimed to establish his family members as his political and religious successors is a narrative that directly implicates the Prophet in this context!<\/p>\n\n\n\n<p>Thus, it would be understandable if a neutral non-Muslim bystander were to dismiss Islam and be repulsed by such a faith and historical figure. Perhaps this is why Twelver dawah efforts are mostly limited to Muslims, as the Twelver narrative is one that fundamentally discredits Islam in the eyes of a neutral bystander. The Twelver historical narrative can only be believed by someone who already has respect and reverence for the Prophet (i.e a Sunni Muslim or a non-Muslim who has interest in Islam&#8230;).  <\/p>\n\n\n\n<p>Rarely does one find Twelvers inviting non-Muslims to Islam. When they do, the non-Muslim is not exposed to the entire Twelver narrative. Rather, the non-Muslim is presented with a general Islamic narrative that resembles Sunni Islam. The Shi&#8217;ite narrative is then gradually presented and &#8220;trickled down&#8221; to the clueless inquirer. <\/p>\n\n\n\n<p><strong>Note<\/strong>: Our objections to the Twelver narrative are not limited to this particular appeal. Using the &#8220;hadith&#8221; tag on our website, one can evaluate a variety of our technical contentions to the defective historical narrative of the Shi&#8217;ite school.<\/p>\n\n\n\n<p> It is about time that the implications of this baseless historical narrative are publicly questioned and dissected such that no one can fall prey to the various efforts that seek to normalize this distorted theology in the Muslim community. <\/p>\n\n\n\n<p>And Allah is the Witness of Abu Al-Abbas.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>In Sunni-Shia polemics, Sunnis and Shias often end up debating minute theological, historical and jurisprudential technicalities such that they often overlook the bigger picture. The implications of entire historical narratives are thus neglected as polemicists passionately debate specific details from <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/04\/25\/shia-islam-in-the-eyes-of-a-non-muslim\/\" title=\"Shia Islam in the Eyes of a Non-Muslim\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4891","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4891","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4891"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4891\/revisions"}],"predecessor-version":[{"id":4893,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4891\/revisions\/4893"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4891"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}