{"id":4900,"date":"2019-07-13T17:58:19","date_gmt":"2019-07-13T17:58:19","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4900"},"modified":"2019-07-13T22:11:22","modified_gmt":"2019-07-13T22:11:22","slug":"response-to-sh-a%e1%b8%a5mad-salman-on-a-distortion-by-al-%e1%b9%a3aduq","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2019\/07\/13\/response-to-sh-a%e1%b8%a5mad-salman-on-a-distortion-by-al-%e1%b9%a3aduq\/","title":{"rendered":"Response to Sh. Aḥmad Salmān on a Distortion by al-Ṣadūq"},"content":{"rendered":"<img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4900\" alt=\"\" \/>\n<p class=\"has-drop-cap\">After publishing my work on the “Distortions of al-Ṣadūq”, I have received word of some responses that have been floating around the internet of partial refutations. After reading them, I only felt the urge to respond to one of the defenses of Ibn Bābawayh (or Ibn Bābūyah) aka al-Ṣadūq. The defense of this particular <em>ḥadīth<\/em> was written by Sh. Aḥmad Salmān, whom I consider an ideological opponent, but sincerely respect for his bright scholarly mind.<\/p>\n\n\n\n<p>Before providing the response, I’ve shared the <em>ḥadīth<\/em>\nin question, along with my argument, in order to provide the necessary\nbackground.<\/p>\n\n\n\n<p class=\"has-large-font-size\">The Ḥadīth<\/p>\n\n\n\n<p>Ibn Bābawayh reported: `Abdullah bin Jundub narrated<a href=\"#_ftn1\">[1]<\/a>\nfrom Mūsā bin Ja`far (peace be onto him), he said: “You say in the prostration\nof thankfulness: O’ Allah, I call you to witness and I call your angels,\nprophets, messengers and all creation, that you Allah are my Lord, that Islam\nis my religion, Muḥammad is my prophet, and that `Ali, al-Ḥasan, al-Ḥusayn, `Alī\nbin al-Ḥusayn, Muḥammad bin `Alī, Ja`far bin Muḥammad, Mūsā bin Ja`far, `Alī\nbin Mūsā, Muḥammad bin `Alī, `Alī bin Muḥammad, al-Ḥasan bin `Alī, and Allah’s\nproof, the son of al-Ḥasan bin `Alī, are my Imams; I show loyalty for them and\ndisavow their enemies&#8230;”<a href=\"#_ftn2\">[2]<\/a>\n<\/p>\n\n\n\n<p>I say: Al-Kulaynī narrates it from `Alī bin Ibrāhīm, from his father, from `Abdillāh bin Jundub without any mention of the names of the Imams except for `Alī: “Muḥammad is my prophet and that `Alī and so-and-so are my Imāms.”<a href=\"#_ftn3\">[3]<\/a><\/p>\n\n\n\n<p class=\"has-large-font-size\">The Significance of this Manipulation<\/p>\n\n\n\n<p>The difference between the two reports is clear. One report\nexplicitly mentions the names of all of the Imāms. The other report does not.\nThe argument I am making is that the original report has been tampered with in\norder to justify the Shīa belief in all Twelve Imams.<\/p>\n\n\n\n<p>Ibn Bābawayh’s version conflicts with what the Twelver Shīa\ndeem authentic as reported by Ibn Abī Ya`fūr<a href=\"#_ftn4\">[4]<\/a>\nas well as others, that the Imām of the age does not die before Allah reveals\nto him the identity of the executioner of his will (i.e succeeding Imām). The\nnames of all Imāms were never known to them. In another authentic report<a href=\"#_ftn5\">[5]<\/a>\nwe find the Imām abstaining from informing his close companion Ismā`īl bin\nMihrān about the successor’s identity until the moment before his death. This\nis another sign that the Shīa never knew the names of all Imāms, unlike what is\nfound in Ibn Bābawayh’s text. Furthermore, al-Kulaynī’s text is closer to the\nhistorical reality, since it is known that the followers of the heads of the\nprophetic household greatly differed in designating who their Imams were after\nMūsā al-Kāẓim.&nbsp; <\/p>\n\n\n\n<p class=\"has-large-font-size\">Response by Sh. Aḥmad Salmān<\/p>\n\n\n\n<p>Sh. Aḥmad Salmān, in response to the accusation, provides alternative possible explanations to deflect the accusation made against Ibn Bābawayh.<\/p>\n\n\n\n<p>These explanations are:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>Al-Kulaynī summarized the\nreport and there are no additions.<\/li><li>The addition exists, but it\nis acceptable since it came from a reliable transmitter.<\/li><li>The addition was actually a\ncommentary by Ibn Bābawayh.<\/li><li>There was a distortion, but\nit was from Muḥammad bin `Alī Mājilūyah.<\/li><\/ul>\n\n\n\n<p>The response provided by Sh. Aḥmad Salmān can be found on <a href=\"https:\/\/twitter.com\/PurifiedTruth\/status\/993453375822946305\" rel=\"external nofollow\">twitter<\/a>.<\/p>\n\n\n\n<p class=\"has-large-font-size\">Possibility #1<\/p>\n\n\n\n<p class=\"has-background has-cyan-bluish-gray-background-color\">“The most that can be said is that the narration that Saduq narrated had additional text which Kulayni summarized and shortened, and when Saduq narrated the hadith he included the full original narration.”<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Response<\/strong><\/p>\n\n\n\n<p>The claim mentioned is extremely unlikely, for two reasons:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>There are no motives for al-Kulaynī to shorten the report. Al-Kulaynī is very aware that the number of reports that list out all the Imāms are quite scarce, especially during his time. In the whole of Al-Kāfī, Al-Kulaynī only provides two reports that list all the names of the Imāms. Why would Al-Kulaynī sabotage this extremely important report that explicitly lists the names of all the Imams?<\/li><li>Ibn Bābawayh, on the other hand, had a very good reason to tamper with the report. The narration, in its original form, did not support Twelver doctrine more than it supported any of the tens of Shī’ī sects. However, after the alteration, it became one of the most explicit proofs for Twelverism. <\/li><\/ol>\n\n\n\n<p class=\"has-large-font-size\">Possibility #2<\/p>\n\n\n\n<p class=\"has-background has-cyan-bluish-gray-background-color\">“Differences regarding adding or leaving out text between narrations is well known and famous in the book [sic] of the sciences of hadith. It has been established by all scholars of this science that additional text that is narrated by trustworthy narrators, if the addition is not solitary (and out of place) or in opposition to other narrations, is accepted.”<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Response<\/strong><\/p>\n\n\n\n<p>We are in agreement that there are cases in which additions can\nbe accepted. However, the report does not meet the conditions that are\nrequired.<\/p>\n\n\n\n<p>The statement made by Sh. Aḥmad is accurate only in cases\nwhere the reliability of the narrator is a given. In other words, the analysis\ndone on the additions of a trustworthy narrator revolve around the report\nitself, and whether it should be accepted or rejected. It has no bearing on the\nactual transmitter, who remains reliable regardless of whether his addition is\naccepted or rejected. <\/p>\n\n\n\n<p>In this particular scenario, we are looking at a narrator that\nhas been accused of tampering with the text. In other words, this is not a case\nwhere the rules of <em>ziyādat al-thiqa<\/em> (the additions of trustworthy\nnarrators) come into play. <\/p>\n\n\n\n<p class=\"has-large-font-size\">Possibility #3<\/p>\n\n\n\n<p class=\"has-background has-cyan-bluish-gray-background-color\">“Even if we accept that this addition from Saduq is not\nfound in the original hadith, but rather, it is something he added, then this\nwould still be considered a non-issue, for it is an addition that is a tafseer\nfor the narration. We understand from the narration that it is recommended to\nsay the names of the Imams one by one during the supplication (dua). Saduq\nsimply made clear the narration and made clear what is to be said in the dua.”<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Response<\/strong><\/p>\n\n\n\n<p>It is not reasonable to assume that such a matter can be\nreferred to as a mere <em>tafsīr<\/em>. Rather, the words in the original <em>ḥadīth<\/em>\nwere taken out and others were added in.<\/p>\n\n\n\n<p>Note that the original <em>ḥadīth<\/em> states, “Muḥammad is my\nprophet and that `Alī and so-and-so are my Imāms…”<\/p>\n\n\n\n<p>If this were a mere <em>tafsīr<\/em>, Ibn Bābawayh would have reworded it as, “Muḥammad is my prophet and that `Alī <strong>and so-and-so are Imāms. Meaning:<\/strong> al-Ḥasan, al-Ḥusayn, `Alī bin al-Ḥusayn, Muḥammad bin `Alī, Ja`far bin Muḥammad, Mūsā bin Ja`far, `Alī bin Mūsā, Muḥammad bin `Alī, `Alī bin Muḥammad, al-Ḥasan bin `Alī, and Allah’s proof, the son of al-Ḥasan bin `Alī.”<\/p>\n\n\n\n<p>However, instead, Ibn Bābawayh, removes the words,\n“so-and-so,” and does not include the term, “meaning,” in order to express that\nthis is an interpretation. Commentaries do not require a replacement of text.<\/p>\n\n\n\n<p>Moreover, these\nactions by Ibn Bābawayh were not seen as a mere commentary by Shīa scholars. Rather, these words were taken as\nthe words of Mūsā bin Ja`far verbatim. One example of this is the Grand\nAyatollah Jawād Al-Tabrīzī, who in his treatise of authentic reports of the\nappointment of the Imāms, only found two examples of “authentic” narrations that\nlisted the names of the Imāms in full. One of these two reports was this\nnarration by Ibn Bābawayh.<a href=\"#_ftn6\">[6]<\/a> Al-Tabrīzī cannot be blamed for this\nmistake, for there is no indication in the report that this is a mere\ncommentary.<\/p>\n\n\n\n<p>As for Sh. Aḥmad’s\nexcuse that “Saduq simply made clear the narration and made clear what\nis to be said in the dua.” <\/p>\n\n\n\n<p>I say: Do the Twelvers not know who the Twelve Imams were?\nCouldn’t Ibn Bābawayh include their names after the narration instead of\nreplacing words within the narration? This action alone causes us to have\ndoubts in regards to the integrity of Ibn Bābawayh, and through his other seven\nmanipulations that have to do with naming the Imāms and specifying their\nnumber, we become certain that this action was indeed intentional.<\/p>\n\n\n\n<p>Sh. Aḥmad seems to be overlooking the fact that this\n“commentary” has severe ideological consequences. Perhaps he would have been\nmore aware of this if the commentator was an Ismā’īlī, Wāqifī, or Faṭḥī, who\ninstead substituted the ambiguous “so-and-so” with his own preferred list of\nImāms.<\/p>\n\n\n\n<p class=\"has-large-font-size\">Possibility #4<\/p>\n\n\n\n<p class=\"has-background has-cyan-bluish-gray-background-color\">“And if this person\nwho’s bringing the accusation rejects all this and still considers this\naddition a distortion, then his accusation against Saduq is nothing more but an\nassumption and conjecture, for it is very possible that the distorter (if for\nthe argument’s sake if we say there has taken place distortion [sic]) was other\nthan him. This is because Saduq did not take this hadith from Kulayni as the\naccuser falsely imagined, but rather, he took this narration from another\nperson (Muhammad Ibn Ali Majulwayh).”<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Response<\/strong><\/p>\n\n\n\n<p>This objection is the\nonly reasonable one that has been made and my answer is a simple one. There is\na pattern which leads us to dismissing the possibility that the manipulation\ncame from Muḥammad bin `Alī Mājilūyah.<\/p>\n\n\n\n<p>Out of the forty\nmanipulated narrations that I have stumbled upon, only five of them come\nthrough the path of Muḥammad bin `Alī Mājilūyah. These are reports #2, #11, #12, #25, #32. Even if we were to assume\nthat all of these five were manipulated by Muḥammad bin `Alī Mājilūyah, what are we going to do with the other reports?!<\/p>\n\n\n\n<p>It is known that the methodology\nof the scholars of <em>ḥadīth<\/em> is point to the biggest culprit in the chain.\nIf the chain consists of a liar, a weak narrator, and a reliable narrator, the ḥadīthist\nwill accuse the liar, even though it is possible that the weak narrator made a\nmistake. If the liar wasn’t present, the ḥadīthist would accuse the weak\nnarrator, even though it is entirely possible as well that the reliable\nnarrator made a mistake.<\/p>\n\n\n\n<p>With that being said, Ibn Bābawayh is the lowest common denominator who keeps ending up at the scene of the crime.  The only time that Muḥammad bin `Alī Mājilūyah is found at the scene is when Ibn Bābawayh is there with him. Therefore, it is likelier for Ibn Bābawayh to be the culprit in all of these cases than for there to be a different culprit in each case, while absolving Ibn Bābawayh. I have made this point very clear early on in “Distortions of al-Ṣadūq” (p. 15) and the chances of Ibn Bābawayh never manipulating a <em>ḥadīth<\/em> is astronomically low.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Distortions of al-Bukhārī?<\/strong><\/p>\n\n\n\n<p>In an attempt to\ndeflect the accusation against Ibn Bābawayh, Sh. Aḥmad included an example of\nan alternative wording found in Ṣaḥīḥ al-Bukhārī. By this, he is arguing that\nif Ibn Bābawayh manipulated a report, then you should say the same about al-Bukhārī.<\/p>\n\n\n\n<p>However, the accusation leveled against al-Bukhārī has no bearing on the accusation against Ibn Bābawayh. If al-Bukhārī was a dishonest manipulator of the narrations of the Prophet – peace be upon him &#8211; , then we would discard him in the same way we would discard any lying narrator.<\/p>\n\n\n\n<p>Unfortunately, I will\nnot be responding to this criticism in this article, but will have to leave it\nfor another article, in order to not detract from the original topic: the\nreliability of Ibn Bābawayh.<\/p>\n\n\n\n<p class=\"has-large-font-size\">Conclusion<\/p>\n\n\n\n<p>Sh. Aḥmad’s excuses\nfor Ibn Bābawayh are not reasonable. Had it not been for the ideological\nsignificance of these distortions or the sheer number of occurrences, it may\nhave been possible to dismiss these as innocent additions. Unfortunately for\nIbn Bābawayh, the sinister nature of this manipulation is obvious, even in this\nisolated case, let alone when going through his track record of other\nmanipulations that I have collected in the book. <\/p>\n\n\n\n<p>In the end, all we can do after presenting these proofs is to call onto Allah the Almighty, asking Him to guide Sh. Aḥmad towards His straight path.<\/p>\n\n\n\n<p><em>Wal hamdulillāh rab il-`ālamīn.<\/em><\/p>\n\n\n\n<p>by Farīd al-Baḥraīnī  <br><\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><a href=\"#_ftnref1\">[1]<\/a> The\nchain of Ibn Bābawayh to Ibn Jundub is as in Mashyakhat-ul-Faqīh pg.99-100:\n“Muhammad bin `Alī Mājilūyah (may Allah be pleased with him), from `Alī bin\nIbrāhīm bin Hāshim, from his father, from `Abdillāh bin Jundub.”<\/p>\n\n\n\n<p><a href=\"#_ftnref2\">[2]<\/a> Man\nlā Yahḍurhu al-Faqīh, ibn Bābawayh 1\/158<\/p>\n\n\n\n<p><a href=\"#_ftnref3\">[3]<\/a> Al-Kāfī,\nal-Kulaynī 3\/211<\/p>\n\n\n\n<p><a href=\"#_ftnref4\">[4]<\/a> Al-Kāfī,\nal-Kulaynī 1\/166<\/p>\n\n\n\n<p><a href=\"#_ftnref5\">[5]<\/a> Al-Kāfī,\nal-Kulaynī 1\/198<\/p>\n\n\n\n<p><a href=\"#_ftnref6\">[6]<\/a> Risāla Mukhtaṣara fī  al-Nuṣūs al-Ṣaḥīḥa ‘alā Imāmat al-Ithnay `Ashar p. 16 <\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>After publishing my work on the “Distortions of al-Ṣadūq”, I have received word of some responses that have been floating around the internet of partial refutations. After reading them, I only felt the urge to respond to one of the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2019\/07\/13\/response-to-sh-a%e1%b8%a5mad-salman-on-a-distortion-by-al-%e1%b9%a3aduq\/\" title=\"Response to Sh. Aḥmad Salmān on a Distortion by al-Ṣadūq\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-4900","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4900","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4900"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4900\/revisions"}],"predecessor-version":[{"id":4914,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4900\/revisions\/4914"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4900"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4900"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4900"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}