{"id":4970,"date":"2020-09-12T11:22:07","date_gmt":"2020-09-12T11:22:07","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4970"},"modified":"2020-09-15T19:34:47","modified_gmt":"2020-09-15T19:34:47","slug":"response-to-al-kurani-on-al-shafiis-views-on-al-qiraat","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2020\/09\/12\/response-to-al-kurani-on-al-shafiis-views-on-al-qiraat\/","title":{"rendered":"Response to Al-Kūrānī on Al-Shāfi’ī’s Views on Al-Qira’āt"},"content":{"rendered":"<img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4970\" alt=\"\" \/>\n<p><em><span style=\"color:#313131\" class=\"color\">by Farid al-Bahraini<\/span><\/em><\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Background<\/h1>\n\n\n\n<p>While `Alī Al-Kūrānī’s “Tadwīn Al-Qur`ān” is nothing more than a compilation of poor polemical points, one specific claim he makes is deserving of attention due to the ambiguity of the quoted phrase when taken out of context. Al-Kūrānī, due to his adherence to the Twelver school of thought, rejects the existence of the seven <em>aḥruf<\/em>. He refers to the concept as the “Theory of Expansion of the Qur`ānic Text.” Al-Kūrānī attempts to frame the seven <em>a<\/em><em>ḥruf<\/em> as a form of distortion.<\/p>\n\n\n\n<p>Al-Kūrānī,<a href=\"#_ftn1\">[1]<\/a> in an attempt to argue this position, presents quotations that liken the <em>tashahud<\/em> to the <em>Qira’āt<\/em>. He argues:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“Allāh the Most High preserved His book from the Caliph’s (`Omar) theory of expansion of His text. It only caused a disruption around the Qur`ānic text during his period. However, its remnants remained and bloomed in the school of jurisprudence of our Sunni brethren, which led their jurists to give religious edicts permitting changes in the Qur`ānic text, as well as the text of the <em>tashahud<\/em> in prayer, due to it being lesser in significance to the text of the Qur`ān!”<\/p><\/blockquote>\n\n\n\n<p>Al-Kūrānī’s theorizes that Al-Shāfi’ī held the view that one could recite the Qur`ān in a non-verbatim manner, as long as the meaning is not changed. In this article, Al-Shāfi’ī’s statements will be examined within their context, in order to prevent any misrepresentation of his views.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">How was the <em>Tashahud<\/em> Taught?<\/h1>\n\n\n\n<p>Before presenting the statements that Al-Kūrānī quotes from Al-Shāfi’ī it is important to be aware of the <em>tashahud<\/em> and its nature.<\/p>\n\n\n\n<p>Al-Shāfi’ī when discussing the topic of <em>tashahud<\/em> provides statements from Ibn Mas`ūd and Ibn `Abbās, both of whom explicitly state that the Prophet (peace be upon him) taught them the <em>tashahud<\/em> in the same way that he taught them the Qur`ān.<a href=\"#_ftn2\">[2]<\/a><\/p>\n\n\n\n<p>This method was also observed by Companions when teaching the <em>t<\/em><em>ābi’<\/em><em>īn<\/em>. We find identical statements to the above being uttered by Abū Abdulraḥmān Al-Sulamī and Ibrahim Al-Nakha’ī.<a href=\"#_ftn3\">[3]<\/a><\/p>\n\n\n\n<p>These statements suggest that the <em>tashahud<\/em> was learned verbatim. Al-Aswad elaborates by stating that Ibn Mas`ūd would teach them the <em>tashahud<\/em> in the same way that he taught the Qur`ān, correcting them if they changed something as small as an <em>alif<\/em> or a <em>w<\/em><em>āw<\/em>.<a href=\"#_ftn4\">[4]<\/a><\/p>\n\n\n\n<p>Ibrāhīm Al-Nakha’ī states that he was taught the <em>tashahud<\/em> in the same way.<a href=\"#_ftn5\">[5]<\/a><\/p>\n\n\n\n<p>Abū Sa’īd Al-Khudrī mentions that the companions didn’t write what they heard from the Prophet (peace be upon him) with the exception of the Qur`ān and the <em>tashahud<\/em>.<a href=\"#_ftn6\">[6]<\/a> This implies that the <em>tashahud<\/em> was to be memorized by the companions.<\/p>\n\n\n\n<p>These reports clearly show that the <em>tashahud<\/em> was not taught in the same manner that other <em>ḥ<\/em><em>ad<\/em><em>ī<\/em><em>ths<\/em> were taught.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Al-Kūrānī quotes Al-Shāfi’ī<\/h1>\n\n\n\n<p>Al-Kūrānī bases his arguments with on following quotations from Al-Shāfi’ī.<\/p>\n\n\n\n<p dir=\"rtl\"><br>وقد اختلف بعض أصحاب النبي في بعض لفظ القرآن عند رسول الله ولم يختلفوا في معناه فأقرهم وقال: هكذا أنزل إن هذا القرآن أنزل على سبعة أحرف فاقرؤوا ما &nbsp;تيسر منه. فما سوى القرآن من الذكر أولى أن يتسع، هذا فيه إذا لم يختلف المعنى!<\/p>\n\n\n\n<p dir=\"rtl\"><br>قال: وليس لأحد أن يعمد أن يكف عن قراءة حرف من القرآن إلا بنسيان، وهذا في التشهد وفي جميع الذكر أخف!!.<\/p>\n\n\n\n<p>The first, from “Ikhtilāf Al-Hadīth”:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“The companions of the Prophet differed in some of the words of the Qur`ān in front of the Messenger of Allāh, and they did not differ in meaning, and he acknowledged them. He said: ‘This is how the Qur`ān was revealed, in seven <em>aḥruf<\/em>, so recite in whichever way you find ease.’ So anything apart from the Qur`ān, that falls under the <em>ḏikr<\/em>, can also be expanded upon, if the meaning is one.<\/p><\/blockquote>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>He (Al-Shāfi’ī) said: ‘It is not for one to purposefully abstain from reciting a <em>ḥarf <\/em>except due to forgetfulness, while with the <em>tashahud<\/em> or the rest of the <em>ḏikr<\/em> it is lesser of an issue.’”<\/p><\/blockquote>\n\n\n\n<p>Al-Kūrānī then quotes Al-Shāfi’ī through Al-Bayhaqī’s Sunan:<\/p>\n\n\n\n<p dir=\"rtl\">فإذا كان الله برأفته بخلقه أنزل كتابه على سبعة أحرف معرفة منه بأن الحفظ قد نزر ليجعل لهم قراءته وإن اختلف لفظهم فيه، كان ما سوى كتاب الله أولى أن يجوز فيه اختلاف اللفظ ما لم يخل معناه!<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>&nbsp;“If Allāh, due to His mercy upon His creation, revealed His book in seven <em>aḥruf<\/em>, due to His awareness that memories have weakened, and allowed them to recite it even though their wordings differ, then anything other than the book of Allah is more permissible to have different wordings, as long as its meaning doesn’t change.”<a href=\"#_ftn7\">[7]<\/a><\/p><\/blockquote>\n\n\n\n<p>This quote is taken from Al-Shāfi’ī’s Al-Risāla.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Al-Shāfi’ī’s Views on the nature of the <em>Tashahud<\/em><\/h1>\n\n\n\n<p>Al-Shāfi’ī quotes the Companions saying that they were taught the <em>tashahud<\/em> in the same way they were taught the Qur`ān. This is significant because it suggests that the level of care that was placed into teaching the <em>tashahud<\/em> was greater than other <em>ḥad<\/em><em>īths <\/em>in general.<\/p>\n\n\n\n<p>Anas narrated that the Messenger of Allah (peace be upon him) would repeat a statement three times so that it could be understood.<a href=\"#_ftn8\">[8]<\/a><\/p>\n\n\n\n<p>If this was the care with his regular speech, then it can only be assumed that the Qur`ān and the <em>tashahud<\/em> were taught verbatim.<\/p>\n\n\n\n<p>Al-Shāfi’ī points out after speaking of variants between the <em>tashahud<\/em> of Ibn `Abbās, Jābir, Abū Mūsā, and Ibn Mas`ūd that “it is possible that they are all authentic and that the Messenger of Allāh taught groups and individuals the <em>tashahud<\/em>, and one would memorize one wording while another would memorize a different wording.”<a href=\"#_ftn9\">[9]<\/a><\/p>\n\n\n\n<p dir=\"rtl\">واحتمل أن تكون كلها ثابتة، وأن يكون رسول الله يعلم الجماعة والمنفردين التشهد، فيحفظ أحدهم على لفظ ويحفظ الآخر على لفظ يخالفه.<\/p>\n\n\n\n<p>He also says in Al-Risāla,<a href=\"#_ftn10\">[10]<\/a> “All of these are words that intend the glorification of Allah and so the Messenger of Allah taught them.”<\/p>\n\n\n\n<p dir=\"rtl\">كلٌ كلامٌ أريد به تعظيم الله، فعلمهم رسول الله.<\/p>\n\n\n\n<p>Furthermore, Al-Shāfi’ī likens the variations of the <em>tashahud<\/em> to <em>ṣalāt al-khawf <\/em>(prayers during times of danger). He explains: <\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“And what he says in the <em>tashahud<\/em> is but the glorification of Allah, and I hope that all of this is broadly acceptable, and that all the differences within are like what I’ve said, and this – as I’ve said – can occur with <em>ṣalāt al-khawf<\/em>, <strong>which is sufficient if performed fully in any of the methods that are narrated from the Prophet<\/strong>.”<a href=\"#_ftn11\">[11]<\/a><\/p><\/blockquote>\n\n\n\n<p dir=\"rtl\">فقال ما في التشهد إلا تعظيم الله، وأنّى لأرجو أن يكون كل هذا فيه واسعًا، وأن لا يكون الاختلاف فيه إلا من حيث ذكرت ومثل هذا – كما قلت – يمكن في صلاة الخوف، فيكون إذا جاء بكمال الصلاة على أي الوجوه روي عن النبي أجزأه.<\/p>\n\n\n\n<p>This statement by Al-Shāfi’ī confirms that the Prophet (peace be upon him) taught multiple ways of praying <em>ṣal<\/em><em>āt al-khawf<\/em>, and by extension, also taught multiple wordings for the <em>tashahud<\/em>.<\/p>\n\n\n\n<p>Furthermore, Al-Shāfi’ī affirms that these multiple wordings were heard by the Prophet (peace be upon him), who acknowledged their validity, and not that the Companions were given free rein to distort the <em>tashahud<\/em> as they see fit.<a href=\"#_ftn12\">[12]<\/a><\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Al-Shāfi’ī’s Views on the nature of Al-<em>Qira’āt<\/em><\/h1>\n\n\n\n<p>Before examining Al-Shāfi’ī’s views in detail, we can come to multiple conclusions in regards to Al-Shāfi’ī’s understanding of the nature of the <em>Qira’āt<\/em> from the passages that Al-Kūrānī quoted.<\/p>\n\n\n\n<p>Firstly, Al-Shāfi’ī states clearly that one cannot “abstain from reciting a <em>ḥarf <\/em>except due to forgetfulness”.<a href=\"#_ftn13\">[13]<\/a> In other words, one may not switch out a word with another, add to the Qur`ān, subtract from it, make changes in sentence structure, etc., intentionally.<\/p>\n\n\n\n<p>Furthermore, Al-Shāfi’ī’s view is that these recitations were revealed in “seven <em>aḥruf<\/em>” and that they were “revealed”.<a href=\"#_ftn14\">[14]<\/a>The apparent meaning of this is that these variants are from Allāh the Almighty. Any other reinterpretation of these clear words would require strong evidence.<\/p>\n\n\n\n<p>In regards to the final quotation by Al-Kūrānī, the passage is taken from Al-Risāla<a href=\"#_ftn15\">[15]<\/a> where Al-Shāfi’ī likens the <em>tashahud<\/em> to the <em>aḥruf<\/em>, while providing an example of “expansion”. He mentions the narration of Omar bin Al-Khaṭṭāb and Hishām bin Ḥakīm bin Ḥizām, where the Prophet (peace be upon him) affirms that both recitations were revealed by Allāh the Almighty.<\/p>\n\n\n\n<p>If Al-Shāfi’ī’s intention from providing this example was to demonstrate that variant recitations were intentional changes that were based on preferences, then he has chosen the absolute worst example possible.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Imām Aḥmad and the <em>Tashahud<\/em><\/h1>\n\n\n\n<p>Linking the <em>tashahud<\/em> with the <em>Qira’āt<\/em> was not exclusive to Al-Shāfi’ī, and we find an explicit statement by Imām Aḥmad that affirms the previous conclusions above. Ibn Qudāma quotes Imām Aḥmad in al-Mughnī: <\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“I prefer the <em>tashahud<\/em> of `Abdullāh (bin Mas`ūd), even though other forms are permissible, <strong>because the Prophet (peace be upon him) teaching the Companions different ways <\/strong>is proof that all are permissible, <strong>and it is like the different <em>Qira’āt<\/em><\/strong> that are included in the <em>muṣḥaf<\/em>.”<a href=\"#_ftn16\">[16]<\/a><\/p><\/blockquote>\n\n\n\n<p dir=\"rtl\">تشهد عبد الله أعجب إلي، وإن تشهد بغيره فهو جائز، لأن النبي – صلى الله عليه وسلم – لما علمه الصحابة مختلفًأ دل على جواز الجميع، كالقراءات المختلفة التي اشتمل عليها المصحف.<\/p>\n\n\n\n<p>Even though Imām Aḥmad is not quoting Al-Shāfi’ī, it is not far-fetched that this is a proper representation of the latter’s view, since they were peers, and it is unlikely that both provided the same example without influencing one another.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Comparing the <em>Tashahud<\/em> to the <em>Qira’āt<\/em><\/h1>\n\n\n\n<p>The previous sections in this article have already covered the fact that both the variants wordings of the <em>tashahud<\/em> and the multiple <em>Qira’āt<\/em> were taught by the Prophet (peace be upon him). If Al-Shāfi’ī’s intention from the comparison was to demonstrate the permissibility of recitation as per the meaning, then such a matter could have been explained using any other statement of the Prophet (peace be upon him). However, the <em>tashahud<\/em> is unlike most other religious rulings, since multiple variations of it have been taught by the Prophet (peace be upon him).<\/p>\n\n\n\n<p>&nbsp;Al-Shāfi’ī explains that the multiple <em>Qira’āt<\/em> are a mercy from Allah in order to facilitate its memorization. If the Qur`ān was limited to one form in recitation, it would be a struggle for a non-Qurashī to memorize it. Hence, the existence of <em>Qira’āt<\/em>, through the seven modes, which mainly include dialectal differences, provides ease.<\/p>\n\n\n\n<p>However, it should be noted that much of the <em>Qira’āt<\/em> have nothing to do with the dialects of the Arab tribes and are incompatible with Al-Shāfi’ī’s statements above. Some of these examples will be examined below.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Non-synonymous Recitations<\/h1>\n\n\n\n<p>Even though Al-Kūrānī’s quotations above are used in order to argue that Al-Shāfi’ī believed in interchangeable synonyms, this doesn’t explain the existence of variants with different meanings. Al-Shāfi’ī, aware of the recitation of <em>wa<\/em> <em>arjulikum<\/em> in Q 5:6, comments, “We read it as <em>arjulakum<\/em>, meaning: Wash your face, hands, and feet.”<a href=\"#_ftn17\">[17]<\/a><\/p>\n\n\n\n<p>Al-Shāfi’ī speaks of his preference without critiquing the other recitation as a false one, which demonstrates that he is aware of the validity of variances that do not have the same meaning. In other words, the seven <em>aḥruf<\/em> are not limited to synonyms as per the view of Al-Shāfi’ī. This conflicts directly with Al-Kūrānī’s understanding of the quotations that he provided.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\"><em>Taqdīm wa Ta’khīr<\/em><\/h1>\n\n\n\n<p>The nature of the <em>aḥruf<\/em> include additions, omissions, non-synonymous changes, as well as <em>taqd<\/em><em>ī<\/em><em>m wa ta’kh<\/em><em>ī<\/em><em>r <\/em>(anastrophe), in which a variant includes the same words of a verse but in a different order.<\/p>\n\n\n\n<p>For example, the Uthmanic recitation of Q 50:9: “And the stupor of death with bring truth,” was revealed in one <em>ḥ<\/em><em>arf<\/em> as “and the stupor of truth will bring death.” Of course, the latter was not accommodated into the Uthmanic <em>rasm<\/em> and is not read today.<\/p>\n\n\n\n<p>The example above is clear in the sense that the variant <em>aḥruf<\/em> are not necessarily synonymous. However, even when they are, word order is always significant.<\/p>\n\n\n\n<p>Al-Shāfi’ī points out that one should perform ablutions in the same order as it is mentioned in Q 5:6. Similarly, he argues that one should start the ritualistic rounds between the Al-Ṣafā and Al-Marwa starting with Al-Ṣafā as per the order in Q 2:158.<a href=\"#_ftn18\">[18]<\/a><\/p>\n\n\n\n<p>Thus, according to Al-Shāfi’ī, the replacement of the order of nouns within a verse itself will lead to changes in the way the rituals are practiced and the slightest change in the wording of any verse will have an impact on the meaning.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">An Explicit Statement<\/h1>\n\n\n\n<p>During Al-Shāfi’ī’s description of the obligations of prayer, he makes important statements about Al-Fātiḥa. He states: It is not sufficient to recite “<em>bismill<\/em><em>ā<\/em><em>h al-Ra<\/em><em>ḥ<\/em><em>m<\/em><em>ā<\/em><em>n al-Ra<\/em><em>ḥī<\/em><em>m<\/em>” after reciting “<em>al-<\/em><em>ḥ<\/em><em>amdulill<\/em><em>ā<\/em><em>hi rabbi al-`<\/em><em>ā<\/em><em>lam<\/em><em>ī<\/em><em>n<\/em>” nor within it, until he returns and recites “<em>bismill<\/em><em>ā<\/em><em>h al-Ra<\/em><em>ḥ<\/em><em>m<\/em><em>ā<\/em><em>n al-Ra<\/em><em>ḥī<\/em><em>m”<\/em> then starts Umm Al-Qur`ān (al-fātiha) while placing every letter in its position.<\/p>\n\n\n\n<p dir=\"rtl\">ولا يجزيه أن يقرأ (بسم الله الرحمن الرحيم) وقرأ من (الحمد لله رب العالمين)، ولا من بين ظهرانيها، حتى يعود فيقرأ (بسم الله الرحمن الرحيم) ثم يبتدئ أم القرآن فيكون قد وضع كل حرف منها في موضعه.<\/p>\n\n\n\n<p>He continues: If one forgets “<em>al-<\/em><em>ḥ<\/em><em>amd<\/em>” but said “<em>lill<\/em><em>ā<\/em><em>hi rabbi al-`<\/em><em>ā<\/em><em>lam<\/em><em>ī<\/em><em>n<\/em>”, then returned and recited “<em>al-<\/em><em>ḥ<\/em><em>amd<\/em>” and what comes after it, it wouldn’t be sufficient unless he says it in the same way it was revealed.<a href=\"#_ftn19\">[19]<\/a><\/p>\n\n\n\n<p dir=\"rtl\">وكذلك لو أغفل (الحمد)، فقال: (لله رب العالمين) عاد فقرأ (الحمد)، وما بعدها، لا يجزيه غيره حتى يأتي بها كما أنزلت.<\/p>\n\n\n\n<p>The above is explicit in that Al-Shāfi’ī does not allow one to recite according to their preferences, but rather, the order and the wording that was revealed by Allāh needs to be followed. Replacing words like “<em>al-shukr<\/em>” a synonym of “<em>al-<\/em><em>ḥ<\/em><em>amd<\/em>”, in its place, wouldn’t cut it, since “<em>al-shukr<\/em>” was not revealed. Saying “<em>al-Ra<\/em><em>ḥī<\/em><em>m al-Ra<\/em><em>ḥ<\/em><em>m<\/em><em>ā<\/em><em>n<\/em>” instead of “<em>al-Ra<\/em><em>ḥ<\/em><em>m<\/em><em>ā<\/em><em>n al-Ra<\/em><em>ḥī<\/em><em>m<\/em>” would also conflict with his earlier statement.<\/p>\n\n\n\n<p>The statements of Al-Shāfi’ī here are in contradiction with Al-Kūrānī’s understanding of the quotes provided at the beginning of the article. The only way of reconciliation is by holding the view that Al-Shāfi’ī does not believe in an “expansion of the text” as per the desires of the reciters. Rather, he holds the view that the variant recitations are only limited to what was revealed by Allāh the Almighty.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Al-Shāfi’ī’s Condition for non-Verbatim Renditions of <em>Ḥadīth<\/em><\/h1>\n\n\n\n<p>Al-Shāfi’ī in Al-Risāla prohibits one from narrating a <em>ḥadīth<\/em> according to the meaning unless he is aware of what the meaning can lead to, for “if one narrates it according to the meaning without knowing what the meaning can lead to, he may shift what is permissible into a prohibition.”<a href=\"#_ftn20\">[20]<\/a><\/p>\n\n\n\n<p dir=\"rtl\">إذا حدث به على المعنى وهو غير عالم بما يحيل معناه: لم يدر لعله يحيل الحلال إلى الحرام<\/p>\n\n\n\n<p>This simple statement refutes the claim that Al-Shāfi’ī allowed the recitation of Qur`ānic verses as per their meaning, since the <em>aḥruf<\/em> were revealed to facilitate ease in the first place. As per an authentic <em>ḥad<\/em><em>īth, <\/em>they were revealed for the “illiterate nation among whom are the elderly woman, the old man, the boy and the girl, and the man who cannot read a book at all.”<a href=\"#_ftn21\">[21]<\/a><\/p>\n\n\n\n<p>In short, most <em>Qira’āt <\/em>variations exist for the laymen, while narrating a <em>ḥadīth <\/em>in a non-verbatim manner exists for the educated. This can only make sense if one holds the view that variant recitations were literally revealed by Allāh and not that they were non-verbatim renditions by laymen.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Conclusion<\/h1>\n\n\n\n<p>The twisted understanding of Al-Shāfi’ī’s statements cannot be traced to anyone before the year 1997. Al-Kūrānī’s polemical points fall flat due to an intentional misreading of the text and an unfamiliarity of the nature of <em>tashahud<\/em>.<\/p>\n\n\n\n<p>Al-Shāfi’ī, like all scholars of Ahlul Sunnah, believes that the <em>Qira’āt<\/em> were taught by the Prophet (peace be upon him) and not some sort of heretical free rein “expansion of text” that Al-Kūrānī attempts to propagate. &nbsp;<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">References<\/h3>\n\n\n\n<p>Al-Bayhaqī, Abu Bakr. <em>A<\/em><em>ḥk<\/em><em>ām Al-Qur`ān lil Im<\/em><em>ām <\/em><em>Al-Shāfi’ī<\/em>. Beirut: Dār Iḥyā’ Al-`Ulūm, 1990.<\/p>\n\n\n\n<p>Al-Kūrānī’, `Alī. <em>Tadw<\/em><em>īn Al-Qur`ān,<\/em> Qum: Dār Al-Qur`ān Al-Karīm, 1997.<\/p>\n\n\n\n<p>Al-Shāfi’ī, Moḥammad bin Idrīs.<em>Al-Ris<\/em><em>āla.<\/em><em> <\/em>Cairo: Dār Al-Āthār, 2008.<\/p>\n\n\n\n<p>Al-Shāfi’ī, Moḥammad bin Idrīs.<em>Al-Umm.<\/em> Al-Manṣūra: Dār Al-Wafā’, 2001.<\/p>\n\n\n\n<p>Al-Shāfi’ī, Moḥammad bin Idrīs.<em>Ikhtil<\/em><em>āf Al-Had<\/em><em>īth. <\/em>Beirut: Mu`assasat al-Kutub al-Thaqāfiyyah, 1985.<\/p>\n\n\n\n<p>Al-Tirmiḏī, Moḥammad bin Īsa. <em>Sunan Al-Tirmi<\/em><em>ḏī. <\/em>Al-Jubail: Dār Al-Siddīq, 2012.<\/p>\n\n\n\n<p>Ibn Abī Shaybah, Abū Bakr. Muṣannaf Ibn Abī Shaybah. Beirut: Dār al-Kutub Al-`Ilmiyyah, 1426 AH.<\/p>\n\n\n\n<p>Ibn Qudāma, Muwaffaq Al-Dīn. <em>Al-Mughn<\/em><em>ī<\/em>. Al-Riyadh: Dār `Ālam Al-Kutub, 1997.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><a href=\"#_ftnref1\">[1]<\/a> Tadwīn Al-Qur`ān p. 189<\/p>\n\n\n\n<p><a href=\"#_ftnref2\">[2]<\/a> Ikhtilāf Al-Hadīth p. 70, Al-Risāla p. 283<\/p>\n\n\n\n<p><a href=\"#_ftnref3\">[3]<\/a> Muṣannaf Ibn Abī Shaybah 1\/262<\/p>\n\n\n\n<p><a href=\"#_ftnref4\">[4]<\/a> Ibid<\/p>\n\n\n\n<p><a href=\"#_ftnref5\">[5]<\/a> Ibid<\/p>\n\n\n\n<p><a href=\"#_ftnref6\">[6]<\/a> Ibid<\/p>\n\n\n\n<p><a href=\"#_ftnref7\">[7]<\/a> Tadwīn Al-Qur`ān p. 189<\/p>\n\n\n\n<p><a href=\"#_ftnref8\">[8]<\/a> Sunan Al-Tirmiḏī #3640<\/p>\n\n\n\n<p><a href=\"#_ftnref9\">[9]<\/a> Ikhtilāf al-ḥadīth p. 71<\/p>\n\n\n\n<p><a href=\"#_ftnref10\">[10]<\/a> Al-Risāla p. 286<\/p>\n\n\n\n<p><a href=\"#_ftnref11\">[11]<\/a> Al-Risāla p. 289<\/p>\n\n\n\n<p><a href=\"#_ftnref12\">[12]<\/a> Ikhtilāf Al-ḥadīth p. 71<\/p>\n\n\n\n<p><a href=\"#_ftnref13\">[13]<\/a> Ibid<\/p>\n\n\n\n<p><a href=\"#_ftnref14\">[14]<\/a> Ibid<\/p>\n\n\n\n<p><a href=\"#_ftnref15\">[15]<\/a> Al-Risāla p. 288<\/p>\n\n\n\n<p><a href=\"#_ftnref16\">[16]<\/a> Al-Mughnī 2\/222<\/p>\n\n\n\n<p><a href=\"#_ftnref17\">[17]<\/a> Aḥkām Al-Qur`ān p. 55<\/p>\n\n\n\n<p><a href=\"#_ftnref18\">[18]<\/a> Ibid<\/p>\n\n\n\n<p><a href=\"#_ftnref19\">[19]<\/a> Al-Umm 2\/247<\/p>\n\n\n\n<p><a href=\"#_ftnref20\">[20]<\/a> Al-Risāla p. 357<\/p>\n\n\n\n<p><a href=\"#_ftnref21\">[21]<\/a> Al-Tirmiḏī #2944<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>by Farid al-Bahraini Background While `Alī Al-Kūrānī’s “Tadwīn Al-Qur`ān” is nothing more than a compilation of poor polemical points, one specific claim he makes is deserving of attention due to the ambiguity of the quoted phrase when taken out of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2020\/09\/12\/response-to-al-kurani-on-al-shafiis-views-on-al-qiraat\/\" title=\"Response to Al-Kūrānī on Al-Shāfi’ī’s Views on Al-Qira’āt\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[4],"tags":[],"class_list":{"0":"post-4970","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4970","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4970"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4970\/revisions"}],"predecessor-version":[{"id":4981,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4970\/revisions\/4981"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4970"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4970"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4970"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}