{"id":4978,"date":"2020-09-15T19:32:59","date_gmt":"2020-09-15T19:32:59","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=4978"},"modified":"2020-09-15T19:33:11","modified_gmt":"2020-09-15T19:33:11","slug":"response-to-al-khoeis-claim-on-the-synonymous-recitation-%e1%b9%adaam-al-fajir","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2020\/09\/15\/response-to-al-khoeis-claim-on-the-synonymous-recitation-%e1%b9%adaam-al-fajir\/","title":{"rendered":"Response to Al-Khoei’s Claim on the Synonymous Recitation: Ṭa’ām Al-Fājir"},"content":{"rendered":"<img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=4978\" alt=\"\" \/>\n<h1 class=\"wp-block-heading\">Background<\/h1>\n\n\n\n<p>Al-Khoei’s “Al-Bayān fī Tafsīr Al-Qur`ān” is an important contemporary work that many modern Shī`a hold in high regard. However, Shī`ī works that comment on Quranic sciences are often heavily polemical. Al-Khoei’s work is not an exception. Like Al-Kūrānī’s argument that has been thoroughly refuted in a previous article, Al-Khoei presents a report with the intention of arguing that Ahlul Sunnah believe in the permissibility of replacing the words of the Quran with synonyms. In order to argue this, Al-Khoei mentions an event in which Abū Al-Dardā’ allows a man to recite a verse with a different wording.<\/p>\n\n\n\n<p>Al-Khoei then goes on to criticize this position:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“If what was intended with this form is that the Prophet (peace be upon him and his household) permitted the substitution of the words of the Qur`ān with other words that are similar in meaning, which is evidenced by the previous reports, then this possibility demolishes the foundations of the Quran, the everlasting miracle, the established proof upon all mankind, and leaves no doubt that this leads to neglecting the revealed Qur`ān and being careless towards it.”<a href=\"#_ftn1\">[1]<\/a><\/p><\/blockquote>\n\n\n\n<p>Of course, Al-Khoei is merely attacking a straw man since this has never been acknowledged as a valid Muslim position.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Abu Al-Dardā’ and the Alternative Recitation<\/h1>\n\n\n\n<p>The report has been documented through solid chains of narrations. However, some minor differences must not be overlooked.<\/p>\n\n\n\n<ol class=\"wp-block-list\" type=\"1\"><li>Ibrāhīm narrates: Abū Al-Dardā’ recited to a foreigner: “<em>Inna shajarat al-zaqūm ta’ām al-athīm<\/em> (the <em>zaqūm<\/em> tree is the food of the sinner).” The foreigner found difficulty saying: “<em>Athīm<\/em>,” so he would say, “<em>Ṭa’ām al-yatīm<\/em> (the food of orphans),” Abū Al-Dardā’ then said: “<em>Ṭa’ām al-fājir<\/em> (the food of the wicked.)”<a href=\"#_ftn2\">[2]<\/a><\/li><li>Hammām narrates: Abū Al-Dardā’ recited to a man: “<em>Inna shajarat al-zaqūm ta’ām al-athīm<\/em>,” but the man said: “<em>Ṭa’ām al-yatīm.” <\/em>So when Abū Al-Dardā’ realized that he doesn’t understand, he said, “<em>Inna shajarat al-zaqūm ta’ām al-fājir.”<a href=\"#_ftn3\"><strong>[3]<\/strong><\/a><\/em><\/li><li>Hammām also narrates: Abū Al-Dardā’ recited to a man: “<em>Inna shajarat al-zaqūm ṭa’ām al-athīm<\/em>,” but the man said: “<em>Ṭa’ām al-yatīm.” <\/em>So Abū Al-Dardā’ said: <strong>Say<\/strong>: “<em>Inna shajarat al-zaqūm ṭa’ām al-fājir.”<\/em><\/li><li>Hammām also narrates: A man recited to Abū Al-Dardā’: “<em>Inna shajarat al-zaqūm ta’ām al-athīm<\/em>.”  Abū Al-Dardā’ said: Say: “<em>Ṭa’ām al-athīm<\/em>.” The man said: “<em>Ṭa’ām al-yatīm.”<\/em> Abū Al-Dardā’ then said:<strong> Say:<\/strong> “<em>Ṭa’ām al-fājir.”<a href=\"#_ftn4\"><strong>[4]<\/strong><\/a><\/em><\/li><\/ol>\n\n\n\n<p>The first two reports and the last two have a significant difference. In the first set, Abū Al-Dardā’ is merely saying, “<em>Ṭa’ām al-f<\/em><em>ājir<\/em>.” This can be understood as his own explanation. In the second set, Abū Al-Dardā’ explicitly commands the man: “Say: <em>Ṭa’ām al-f<\/em><em>ājir<\/em>.” The first set of reports cannot be used to suggest that Abū Al-Dardā’ is teaching a different wording.<\/p>\n\n\n\n<p>In regards to the strength of the reports, they are all authentic, with the exception of the first narration by Ibrāhīm which includes two disconnections. Sa’īd bin Manṣūr reports the hadith from Al-Mughīra, who heard it from Ibrāhīm. However, Sa’īd never met Al-Mughīra, nor did Ibrāhīm hear this report from Abū Al-Dardā’, as the next three reports above indicate. The editors<a href=\"#_ftn5\">[5]<\/a> hold the view that both disconnections were caused by scribal errors.<a href=\"#_ftn6\">[6]<\/a> Either way, the report is not problematic since it is more or less identical with the second report mentioned by Sa’īd bin Manṣūr. More importantly, unlike the other reports, the first narration comes through the path of Al-Mughīra from Ibrāhīm, while all the other reports come from Al-A`amash from Ibrāhīm. Hence, it is a strong corroboration to the second report.<\/p>\n\n\n\n<p>With the above in mind, it is hard to say which of the two sets of reports has the correct wording.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">The Motive behind the Usage of the Synonym<\/h1>\n\n\n\n<p>Assuming that the second wording of the report is correct and that Abū Al-Dardā’ did indeed taught the foreigner to use a synonym, one will naturally wonder about Abū Al-Dardā’s motive.<\/p>\n\n\n\n<p>The second set of reports provide no reason, while the first set provides a context where the man was a non-Arab who was unable to pronounce “<em>ṭ<\/em><em>a’ām al-ath<\/em><em>ī<\/em><em>m” <\/em>due to his accent.<\/p>\n\n\n\n<p>Abū Bakr Al-Anbārī (d. 328) comments on an identical report that mentions `Abdullāh bin Mas`ūd<a href=\"#_ftn7\">[7]<\/a> instead of Abū Al-Dardā’: This is not proof for the ignoramuses from the people of deviation to substitute a word of the Qur`ān with another, for this was only done by `Abdullāh to bring the meaning closer to the student in a manner which prepares him to return to what is correct, to use the truth, and speak upon the word that was revealed by Allāh and what was spoken by the Messenger of Allāh (peace be upon him).<a href=\"#_ftn8\">[8]<\/a><\/p>\n\n\n\n<p dir=rtl>لَا حُجَّةَ فِي هَذَا لِلْجُهَّالِ مِنْ أَهْلِ الزَّيْغِ، أَنَّهُ يَجُوزُ إِبْدَالُ الْحَرْفِ مِنَ الْقُرْآنِ بِغَيْرِهِ، لِأَنَّ ذَلِكَ إِنَّمَا كَانَ مِنْ عَبْدِ اللَّهِ تَقْرِيبًا لِلْمُتَعَلِّمِ، وَتَوْطِئَةً مِنْهُ لَهُ لِلرُّجُوعِ إِلَى الصَّوَابِ، وَاسْتِعْمَالُ الْحَقِّ وَالتَّكَلُّمِ بِالْحَرْفِ عَلَى إِنْزَالِ اللَّهِ وَحِكَايَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.<\/p>\n\n\n\n<p>Another possibility is that Abū Al-Dardā’ chose to make the man recite “<em>ṭ<\/em><em>a’ām al-f<\/em><em>ā<\/em><em>jir”<\/em> since the man simply could not recite “<em>ṭ<\/em><em>a’ām al-ath<\/em><em>ī<\/em><em>m<\/em>,” and that his using the word “wicked” as a synonym for “sinner” would at least be more in line with the Qur`ān than man’s current recitation of “the <em>zaq<\/em><em>ū<\/em><em>m <\/em>tree is the food of the orphans,” suggesting that orphans are guaranteed hellfire.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Abū Al-Dardā’s Methodology<\/h1>\n\n\n\n<p>While building theories on a single isolated incident with variant wordings may seem foolish, it comes as a greater surprise that this is done with Abu Al-Dardā’.<\/p>\n\n\n\n<p>When he was in Al-Shām, the people of the city attempted to correct his recitation. They tried to make him recite “<em>wa m<\/em><em>ā<\/em><em> khalaqa al-<\/em><em>ḏ<\/em><em>akara wal unth<\/em><em>ā<\/em><em>,”<\/em> Q 92:3(and by He who created the male and female) instead of “<em>wal <\/em><em>ḏ<\/em><em>akari wal unth<\/em><em>ā<\/em><em>”<\/em> (and by the male and the female). Abū Al-Dardā’ did not give up on the recitation that he was familiar with, nor did he tell the people of Al-Shām that the gist of both recitations were similar. Instead, he maintained his position, saying, “This is how I heard it from the Prophet (peace be upon him),” while resisting those that tried to sway him.<a href=\"#_ftn9\">[9]<\/a> This is evidence that he only recited the Qur`ān in the one way that he knew how: verbatim.<\/p>\n\n\n\n<p>Abū Al-Dardā’ was someone who memorized the Qur`ān in full during the lifetime of the Prophet (peace be upon him).<a href=\"#_ftn10\">[10]<\/a> He taught a thousand and six hundred people to recite the Qur`ān in Dimashq alone. He had placed ten of his students to teach ten others and when one of those ten mastered the recitation, he would move up to take directly from Abū Al-Dardā’.<a href=\"#_ftn11\">[11]<\/a> We do not find a trend in Dimashq of students reciting the words “<em>ṭ<\/em><em>a’ām al-f<\/em><em>ā<\/em><em>jir<\/em>” instead of “<em>ṭ<\/em><em>a’<\/em><em>ā<\/em><em>m al-ath<\/em><em>ī<\/em><em>m”<\/em> either. All we have is an isolated report about a foreigner that couldn’t pronounce the Arabic.<\/p>\n\n\n\n<p>Abū Al-Dardā’ was so careful with the hadith of the Prophet (peace be upon him), that when unsure of the wording, he’d say: “Or something like it,” at the end of the narration, out of fear of attributing to the Prophet (peace be upon him) that which he did not say.<a href=\"#_ftn12\">[12]<\/a><\/p>\n\n\n\n<p>Is this who they accuse of teaching the Qur`ān using his own synonyms?!<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Conclusion<\/h1>\n\n\n\n<p>Al-Khoei’s hasty attempts to discredit the stance of Ahlul Sunnah, in regards to their view of the preservation of the Qur`ān, has led him to make several mistakes.<\/p>\n\n\n\n<p>He opted to abuse a report that appears controversial even with the existence of another wording. He ignored the fact that the report is speaking about a very specific case that includes someone that is unable to recite the words due to his accent. Finally, his ignorance in regards to Abū Al-Dardā’ the person and his methodology had led him to making a rash conclusion.<\/p>\n\n\n\n<p>To hold the view that Abu Al-Dardā’ held such a belief is unthinkable, especially with evidence as flimsy as that which Al-Khoei had presented.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">&nbsp;References<\/h1>\n\n\n\n<p>Al-Bukhārī, Muḥammad bin Isma`īl. <em>Ṣa<\/em><em>ḥīḥ<\/em><em> Al-Bukh<\/em><em>ār<\/em><em>ī. <\/em>Riyadh: Darussalam, 1999.<\/p>\n\n\n\n<p>Al-Khoei, Abu Al-Qāssim. Al-Bayān fī Tafsīr Al-Qur`ān. Beirut: Mu`asassat Al-A`alamī, 1974.<\/p>\n\n\n\n<p>Al-Nīsāpūrī, Abū `Abdullāh Al-Ḥākim. <em>Al-Mustadrak `al<\/em><em>ā al-<\/em><em>Ṣa<\/em><em>ḥīḥayn. <\/em>Beirut: Al-Maktaba Al-`Aṣriyyah, 2006.<\/p>\n\n\n\n<p>Al-Qurṭubī, Abū `Abdullāh. <em>A<\/em><em>ḥk<\/em><em>ām Al-Qur`<\/em><em>ān. <\/em>Cairo: Dār al-Kutub Al-Miṣriyyah, 1964.<\/p>\n\n\n\n<p>Al-Ṭabarī, Muḥammad bin Jarīr. <em>Tafs<\/em><em>īr Al-<\/em><em>Ṭabar<\/em><em>ī. <\/em>Beirut: Dār Al-Kutub Al-`Ilmiyyah, 1992.<\/p>\n\n\n\n<p>Ibn `Asākir, `Alī bin Al-Ḥasan. <em>Tar<\/em><em>īkh Dimashq. <\/em>Beirut: Dār Al-Kutub Al-`Ilmiyyah, 2012.<\/p>\n\n\n\n<p>Manṣūr, Said bin. <em>Sunan Sa’<\/em><em>īd bin Man<\/em><em>ṣūr. <\/em>Riyadh: Dār Al-Alūkah, 2012.<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p><a href=\"#_ftnref1\">[1]<\/a> Al-Bayān fī Tafsīr Al-Qur`ān p. 181<\/p>\n\n\n\n<p><a href=\"#_ftnref2\">[2]<\/a> Sunan Sa’īd bin Manṣūr 7\/326<\/p>\n\n\n\n<p><a href=\"#_ftnref3\">[3]<\/a> Ibid 7\/327, Tafsīr Al-Ṭabarī 11\/243<\/p>\n\n\n\n<p><a href=\"#_ftnref4\">[4]<\/a> Al-Mustadrak `alā al-Ṣaḥīḥayn #3684<\/p>\n\n\n\n<p><a href=\"#_ftnref5\">[5]<\/a> Under the supervision of Dr. Sa’d Al-Ḥumayyid and Dr. Khalid Al-Juraysī.<\/p>\n\n\n\n<p><a href=\"#_ftnref6\">[6]<\/a> Sunan Sa`īd bin Manṣūr 7\/326<\/p>\n\n\n\n<p><a href=\"#_ftnref7\">[7]<\/a> The report provided by Al-Anbārī is almost identical to the second wording of the report by Abū Al-Dardā above. However, the report is disconnected since the narrator, `Awn, did not hear from Ibn Mas`ūd. The similarities are so striking that it is likelier that both narrations are referring to a single event than for these being two separate incidents occurring to both Ibn Mas`ūd and Abū Al-Dardā’.<\/p>\n\n\n\n<p><a href=\"#_ftnref8\">[8]<\/a> Aḥkām Al-Qur`ān 16\/149<\/p>\n\n\n\n<p><a href=\"#_ftnref9\">[9]<\/a> Ṣaḥīḥ Al-Bukhārī #4944<\/p>\n\n\n\n<p><a href=\"#_ftnref10\">[10]<\/a> Ṣaḥīḥ Al-Bukhārī #5004<\/p>\n\n\n\n<p><a href=\"#_ftnref11\">[11]<\/a> Tarīkh Dimashq 25\/505-506<\/p>\n\n\n\n<p><a href=\"#_ftnref12\">[12]<\/a> Ibid 1\/223<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Background Al-Khoei’s “Al-Bayān fī Tafsīr Al-Qur`ān” is an important contemporary work that many modern Shī`a hold in high regard. However, Shī`ī works that comment on Quranic sciences are often heavily polemical. Al-Khoei’s work is not an exception. Like Al-Kūrānī’s argument <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2020\/09\/15\/response-to-al-khoeis-claim-on-the-synonymous-recitation-%e1%b9%adaam-al-fajir\/\" title=\"Response to Al-Khoei’s Claim on the Synonymous Recitation: Ṭa’ām Al-Fājir\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[4],"tags":[],"class_list":{"0":"post-4978","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4978","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=4978"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4978\/revisions"}],"predecessor-version":[{"id":4980,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/4978\/revisions\/4980"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=4978"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=4978"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=4978"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}