{"id":5017,"date":"2021-08-03T20:30:57","date_gmt":"2021-08-03T20:30:57","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=5017"},"modified":"2021-08-03T20:46:36","modified_gmt":"2021-08-03T20:46:36","slug":"the-narration-ali-is-siddiq-akbar","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2021\/08\/03\/the-narration-ali-is-siddiq-akbar\/","title":{"rendered":"The Narration “Ali is Siddiq Akbar”"},"content":{"rendered":"<img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=5017\" alt=\"\" \/>\n<h3 class=\"has-text-align-center wp-block-heading\"><strong>The Narration “Ali is Siddiq Akbar”<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>Analysis of the chain and text of the alleged statement of &#8216;Ali bin Abi Talib and refutation of the arguments made to authenticate it.<\/em><\/strong><\/p>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>By<\/em><\/strong><br><strong><em>Abu Sumayyah Moin<\/em><\/strong><\/p>\n\n\n\n<p class=\"has-text-align-center\"><strong>الحمد لله رب العالمين والصلاة والسلام علي رسوله الأمين<\/strong><\/p>\n\n\n\n<p class=\"has-text-align-left\">This article is to discuss the status of the narration which says that ‘Ali b. Abi Talib said, “I am <em>As-Siddiq al-Akbar<\/em> [the greatest Siddiq].”&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Was ‘Ali ever referred to as “<em>As-Siddiq al-Akbar”<\/em>?<\/strong><\/h4>\n\n\n\n<p class=\"has-text-align-left\">The simple answer is No. If ‘Ali had ever called himself a Siddiq then this would have been a famous title among his companions and early followers. However, this was not the case and it only came to screen after people started referring to Abu Bakr as a Siddiq.<\/p>\n\n\n\n<p class=\"has-text-align-left\">This narration with this wording comes as a statement of ‘Ali, which is more famous, and also as a saying of the Messenger of Allah (sallallahu ‘alaihi wa sallam). The Marfu’ version is different and it did not get enough fame.&nbsp; The Marfu’ version is only restricted to Hadith collections which are well known for including all kind of weak and fabricated narrations along with authentic ones. However, the Mawquf tradition, which is a statement of ‘Ali, made its way into the Sunan of Ibn Majah, which is sixth of the six major Hadith collection, and Fadail as-Sahaba of Imam Ahmad even though he excluded it from Musnad as he considered it a Munkar narration.&nbsp;<\/p>\n\n\n\n<p>In this article, I will only touch the alleged statement of ‘Ali as it is the most widely used on this topic. The Marfu’ narrations are not that famous and weaknesses in these narrations are very obvious to any person who has even slightly smelled the fragrance of this ‘Ilm.<\/p>\n\n\n\n<p>&nbsp;‘Ali b. Abi Talib (ra) allegedly uttered it on the pulpit in the Masjid of Basrah. It has been narrated through two different routes both of which are severely weak due to its chain and also text. This article is split into two sections:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Discussion on the Sanad of this narration<\/li><li>Discussion on its text (Matan).<\/li><\/ol>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Section-1: Analyzing the chains of the narration<\/strong><\/h4>\n\n\n\n<p>This narration has reached us with two different chains. Both are different chains but they are describing the same incident.<\/p>\n\n\n\n<p><strong>First Chain: ‘Abbad b. ‘Abdullah narrating from ‘Ali (ra)<\/strong><\/p>\n\n\n\n<p>It has been narrated through Minhal bin ‘Amr from ‘Abbad bin ‘Abdullah that ‘Ali bin Abi Talib said:<\/p>\n\n\n\n<p>أَنَا عَبْدُ اللَّهِ وَأَخُو رَسُولِهِ وَأَنَا الصِّدِّيقُ الْأَكْبَرُ , لَا يَقُولُهَا بَعْدِي إِلَّا كَذَّابٌ مُفْتَرٍ , وَلَقَدْ صَلَّيْتُ قَبْلَ النَّاسِ بِسَبْعِ سِنِينَ<\/p>\n\n\n\n<p>“I am servant of Allah and the brother of the Messenger of Allah. I am “As-Siddiq Al-Akbar”, no one will say it after me except a liar and a slanderer. I prayed seven years before people.” [Musannaf Ibn Abi Shaiba (32084), Fadail as-Sahaba by Ahmad (993), Sunan Ibn Majah (120), As-Sunah al-Kubra by Nasai (8338), As-Sunnah by Ibn Abi ‘Aasim (1324), Al-Mustadrak by Al-Hakim (4584)]<\/p>\n\n\n\n<p>This narration is Munkar and rejected due to its Sanad and Matan. The text of the narration will be discussed at the end along with the scholarly verdicts on this narration.<\/p>\n\n\n\n<p><strong><em>Narrator: ‘Abbad b. Abdullah al-Kufi<\/em><\/strong><\/p>\n\n\n\n<p>The problem in this chain is the narrator ‘Abbad bin ‘Abdullah al-Kufi. Imam ‘Ali b. Al-Madini said regarding him:<\/p>\n\n\n\n<p>“He is weak in narrations.” [Al-Mawdu’aat by Ibn al-Jawzi (1\/341), Meezan al-I’itidal (2\/368) Tahdhib at-Tahdhib (5\/98)]<\/p>\n\n\n\n<p>Al-Bukhari said regarding him:<\/p>\n\n\n\n<p>“There is problem in him [Feehi nazar].” [At-Tarikh al-Kabeer (6\/33), Meezan al-I’itidal]<\/p>\n\n\n\n<p>Ibn ‘Adi quoted the criticism of al-Bukhari with affirmation. [Al-Kamil (5\/553)]<\/p>\n\n\n\n<p>Similarly, al-‘Uqaili and Ibn Jarud included ‘Abbad among weak narrators. [Al-Du’afa (3\/137) by al-‘Uqaili, Ikmal Tahdhib al-Kamal (7\/177)]<\/p>\n\n\n\n<p>That is why Al-Dhahabi concluded and said, ‘They abandoned him’, and Ibn Hajar said that he was weak. [Al-Kashif (2569), Taqrib at-Tahdhib (no.3136)]<\/p>\n\n\n\n<p>This is besides the fact that Ibn Hibban and Al-‘Ijli included this narrator among the Thiqaat. But still Al-Dhahabi and Ibn Hajar did not give weight to their Tawthiq and declared ‘Abbad to be untrustworthy. [See Tawthiq of Ibn Hibban in Thiqat (5\/141) and that of al-‘Ijli in his Thiqaat (2\/17)]<\/p>\n\n\n\n<p>However, some people still managed declaring ‘Abbad to be Thiqah. The points made to defend this narrator are as follows:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>The statement of Bukhari is not a severe criticism.<\/li><li>Ibn Abi Hatim did not mention any praise or criticism against him therefore this necessitates Ta’deel.<\/li><li>Al-‘Ijli and Ibn Hibban both declared him Thiqah.<\/li><li>The criticism against him is unexplained therefore praise must be preferred.<\/li><\/ol>\n\n\n\n<p>Let us discuss all these arguments one by one.<\/p>\n\n\n\n<p><strong><em>The statement of Bukhari “Feehi nazar”<\/em><\/strong><\/p>\n\n\n\n<p>Imam Bukhari was well known for not using harsh words while criticizing a narrator. Hence, we see him often criticize a narrator with terms like “feehi nazar”, “Sakatu ‘anhu” [They stayed silent on him] and “Munkar al-Hadith”.&nbsp;<\/p>\n\n\n\n<p>The vast majority of scholars feel that the term “Feehi nazar” indicates severe criticism from the perspective of Imam Bukhari. These scholars include Hafiz Dhahabi, Al-‘Iraqi, As-Suyuti, Ibn Katheer and As-Sakhawi. On the other hand there are some contemporaries who held that it may or may not mean severe criticism but they all agree that this term is used for weak narrators.<\/p>\n\n\n\n<p>‘Abdul Hayy al-Lukhnawi says in “Ar-Rafa’ wa at-Takmil” (p.388):<\/p>\n\n\n\n<p>قوا البُخَارِيّ فِي حق اُحْدُ من الروَاة فِيهِ نظر يدل على انه مُتَّهم عِنْده وَلَا كَذَلِك عِنْد غَيره<\/p>\n\n\n\n<p>قَالَ الذَّهَبِيّ فِي مِيزَانه فِي تَرْجَمَة عبد الله بن دَاوُد الوَاسِطِيّ قَالَ البُخَارِيّ فِيهِ نظر وَلَا يَقُول هَذَا الا فِيمَن يتهمه غَالِبا<\/p>\n\n\n\n<p>“The statement of Bukhari “<em>Feehi Nazar<\/em>” regarding a narrator shows that he is an accused narrator according to him. But this is not with other scholars. Al-Dhahabi says in Meezan in the entry of ‘Abdullah bin Dawud al-Wasiti: Bukhari says “Feehi nazar” and he does not say this, most of the times, except with those narrators whom he accuses…”&nbsp;<\/p>\n\n\n\n<p>Hafiz al-Mizzi, in the entry of the narrator ‘Abdul Karim bin Abil Makhariq, quotes Hafiz Abu Muhammad Al-Ishbili who said:<\/p>\n\n\n\n<p>لأنه قد قال في &#8220;التاريخ&#8221;: كل من لم أبين فيه جرحه فهو على الاحتمال، وإذا قلت: فيه نظر، فلا يحتمل<\/p>\n\n\n\n<p>“Imam Bukhari said in “Tarikh”: All narrators regarding whom I did not mention any criticism then they have the possibilities (to be accepted for consideration), and when I say “Feehi nazar” then there is no possibility (for his narration to be accepted).” [Tahdheeb al-Kamal (18\/265)]<\/p>\n\n\n\n<p>This statement indicates that all such narrators were not acceptable according to Imam Bukhari. This is also evident when we see that Al-Bukhari have included many well known narrators who had some weakness but he did not criticize them in his Tarikh. See for example: Isma’eel bin Rafi’ al-Madani, Ayyub b. Jabir Al-Yamami, ‘Abdullah b. Muslim b. Hurmuz, ‘Ali b. Zaid b. Jud’aan and many others. So it suggests us that Al-Bukhari felt to use this criticism only when the weakness of the narrator was severe according to him. Allah knows best.&nbsp;<\/p>\n\n\n\n<p><strong><em>The “silence of Ibn Abi Hatim”<\/em><\/strong><\/p>\n\n\n\n<p>Some scholars of recent time have claimed that the silence of Ibn Abi Hatim in the book “al-Jarh wa at-Ta’deel” is equivalent to praise [تعديل]. It was claimed by Shaykh Abdul Fattah Abu Ghuddah where he was inspired by some Indian scholar. So according to these scholars if Ibn Abi Hatim listed a narrator in his book but did not mention Jarh then it would mean it is a “Ta’deel” from him. However, this is a very odd opinion and goes against vast majority of other scholars who were authority in this field. In fact this even goes against the apparent opinion of Ibn Abi Hatim himself. He says in Muqaddima of his book:&nbsp;<\/p>\n\n\n\n<p>على أنا قد ذكرنا أسامي كثيرة مهملة من الجرح والتعديل كتبناها ليشتمل الكتاب على كل من روى عنه العلم رجاء وجود الجرح والتعديل فيهم فنحن ملحقوها بهم من بعد إن شاء الله تعالى<\/p>\n\n\n\n<p>“And we have also mentioned narrators without any statement of criticism or praise so as to include everyone in this books from whom knowledge [Hadith] has been narrated while expecting the occurrence of praise or criticism [regarding them]. So we will add it later if Allah willed.”&nbsp;<\/p>\n\n\n\n<p>It is clear from this quote that Ibn Abi Hatim did not mention any ruling on some narrators only because he was not aware of their status. So they were more like “Mastur” or “Majhul” according to him. But if any criticism or praise found regarding such narrators from other scholars then his silence carry no weight as it was based merely on the lack of information.<\/p>\n\n\n\n<p>This was also the view of <em>Hafiz Ibn Hajar<\/em> with regards to the silence of Ibn Abi Hatim. In fact if we compare his methodology in this regard with different narrators we see the ruling of Hafiz changes as per his evaluation of such narrators from declaring the narrators Mastur to calling them Majhul. But he never considered such a narrator to be Thiqah only based on the silence of Ibn Abi Hatim. Hence he says in “Al-Nukat” (2\/769) regardin Ibn ‘Abdullah b. Mughaffal:<\/p>\n\n\n\n<p><strong>فقد ذكره البخاري في &#8220;تأريخه&#8221; فسماه: يزيد ولم يذكر فيه هو ولا ابن أبي حاتم جرحا، فهو مستور&nbsp;<\/strong><\/p>\n\n\n\n<p>“Bukhari has mentioned him in his Tareekh and named him Yazid. Neither he nor Ibn Abi Hatim mentioned any criticism against him. Therefore he is “Mastur”…”<\/p>\n\n\n\n<p>On the other hand, he declared the narrator Shaqiq Abu Laith to be Majhul even though Ibn Abi Hatim listed him in his book without any Jarh or Ta’deel, and no other scholars made criticism against him.&nbsp; [See his entry in “Taqrib at-Tahdhib]<\/p>\n\n\n\n<p>Some people claim that Ibn Hajar was of the opinion that silence of Ibn Abi Hatim in his book amounts to Ta’deel. Here are some of the examples which are generally brought to make this claim along with our response to it:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Hasan b. Mudrik al-As-Sadusi: Abu Dawud, in the report of Abu ‘Ubaid al-Aajurri, said that he was a liar. Hafiz Ibn Hajar responded by saying that Abu Hatim and Abu Zur’ah wrote narrations from him but did not point out any criticism against him. [Fath al-Bari (1\/397, Muqaddimah). So they say that since Ibn Hajar rejected Abu Dawud’s criticism based on the silence of Abu Zur’ah and Abu Hatim therefore he deemed their silence to be Ta’deel. However this is not the case. If we go back to the reference, we find that Ibn Hajar in fact refuted the Jarh by showing the cause of Jarh is not valid. Along with that he mentioned Nasai who said regarding Hasan that there is no problem in him (لا بأس به). Ibn ‘Adi said he was from the Huffaz of Basrah. Besides that he was from the Shuyukh of Abu Hatim and Abu Zur’ah and they were known for avoiding abandoned narrators. All these facts made Ibn Hajar to reject the criticism of Abu Dawud.<\/li><li>Iyas b. ‘Afeef: Bukhari said regarding him, “Feehi Nazar”. Hafiz Ibn Hajar added after the comment of Bukhari that Ibn Abi Hatim mentioned him in his book but did not mention any criticism. [Lisan (2\/232)]. So these people assumed that Ibn Hajar is rejecting the criticism of Bukhari by mentioning the silence of Ibn Abi Hatim. However, Ibn Hajar did not say any such thing. Through out of his book Lisan al-Meezan he has the habit of quoting Ibn Abi Hatim along with this comment if no Jarh or Ta’deel is found in his book. In fact after few pages (2\/234) of the same book Hafiz Ibn Hajar mentioned a narrator Ayman. He declared him Majhul even though he also mentioned the same thing regarding him that Ibn Abi Hatim did not mention any criticism regarding him. This makes his methodology even more clear.&nbsp;<\/li><\/ol>\n\n\n\n<p><em>Hafiz Ibn Katheer <\/em>also deemed such narrators to be Mastur. He said regarding a narrator Musa bin Jubair in his Tafseer [al-Baqarah 2:102]:<\/p>\n\n\n\n<p><strong>وَذَكَرَهُ ابْنُ أَبِي حَاتِمٍ فِي كِتَابِ الْجَرْحِ وَالتَّعْدِيلِ، وَلَمْ يحك فيه شيئًامِنْ هَذَا وَلَا هَذَا، فَهُوَ مَسْتُورُ الْحَالِ<\/strong><\/p>\n\n\n\n<p>“And Ibn Abi Hatim has mentioned him in his book ‘Al-Jarh wa al-Ta’deel’ and did not report either of the verdicts regarding him, therefore he is Mastur al-Haal…”<\/p>\n\n\n\n<p>Hafiz Dhahabi was even more to the point and he would call a narrator Majhul only based on the silence of Ibn Abi Hatim about the narrator as long as there is no other praise available in his favour. Same was the view of Hafiz Ibn Qattan. So we see there is hardly any Hadith specialist in past that held such views and even worse this view goes against Ibn Abi Hatim’s own comment.<\/p>\n\n\n\n<p><em>After all this it should also be clear that this debate is only about those narrators who were neither criticized nor praised by any other Imam of this field<\/em>. If there is any criticism or praise available on such narrators then the discussion of silence is not applicable in the first place like in the case of ‘Abbad bin ‘Abdullah. Therefore, those people who try to elevate ‘Abbad to the level of reliability are wrong in both of these conditions.<\/p>\n\n\n\n<p><strong><em>The praise from al-‘Ijli and Ibn Hibban<\/em><\/strong><\/p>\n\n\n\n<p>The dispute regarding the leniency of al-‘Ijli and Ibn Hibban are well known among scholars of Hadith. While the leniency of Ibn Hibban was well knows since he himself explained it, however this was not the case with Al-‘Ijli as he did not explained his methodology. Al-Mu’allimi was the one who argued first that al-‘Ijli was lenient in this regard. The leniency of al-‘Ijli has been claimed on the following issues:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>His Tawthiq of several narrators who were Majhul. In this he was said to have on the same methodology as of Ibn Hibban.<\/li><li>His Tawthiq of narrators who were widely criticized by other scholars.<\/li><\/ol>\n\n\n\n<p>Later shaykh Albani also held this view and people then widely followed their view as they found it closer to reality. Shaykh ‘Abdul ‘Aleem Bastawi, who edited and published the book of Al-‘Ijli, also concluded that he had methodology similar to Ibn Hibban in strengthening unknown and those narrators regarding whom they did not receive any criticism. Shaykh ‘Abdul ‘Aleem mentioned several examples of such narrators.<\/p>\n\n\n\n<p>In this case, the Tawthiq of Ibn Hibban and Al-‘Ijli for the narrator ‘Abbad bin ‘Abdullah is rejected not only because they were lenient in their methodology but also due to the fact that their views here contradict majority of experts of this field.&nbsp;<\/p>\n\n\n\n<p>‘Abbad basically is from the narrators who would generally be considered unknown. If we look at the entries of ‘Abbad in different books we can easily conclude:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Only Minhal bin ‘Amr narrate from him.<\/li><li>He has very few narrations.<\/li><li>Nothing is known about him except his name and where he lived.<\/li><\/ol>\n\n\n\n<p>So he was a real fit to be called a Majhul narrator, and hence they were acceptable as per the methodology of al-‘Ijli and Ibn Hibban since they did not come across criticism against him nor they saw a Munkar tradition of ‘Abbad. But this unknown narrator was further degraded to the level of unreliable narrators due to the comment of Imam Bukhari, Ibn al-Madini, Ibn ‘Adi and others. Therefore, it is illogical to rely on the views of these two instead of those who criticized ‘Abbad especially when we see most of ‘Abbad’s narrations are Munkar and not similar to the narrations of Thiqaat.<\/p>\n\n\n\n<p><strong><em>Comparison between praise and criticism<\/em><\/strong><\/p>\n\n\n\n<p>Those who criticized ‘Abbad b. Abdullah are: [1] ‘Ali b. Madini [2] Al-Bukhari [3] Abu Ja’far al-‘Uqaili [4] Ibn ‘Adi. Those who declared his to be Thiqah are: [1] Al-‘Ijli [2] Ibn Hibban.<\/p>\n\n\n\n<p>Since, we have already seen that the Tawthiq of Al-‘Ijli and Ibn Hibban are based on a methodology which was specific to these two scholars and not acceptable to other scholars of Hadith hence the principle of preferring praise over unexplained Jarh is not applicable in this case. Tawthiq is preferred when there are no other deciding factors and the reconciliation is difficult.&nbsp;<\/p>\n\n\n\n<p><strong>Second Chain: Sulaiman b. ‘Abdullah narrating from Mu’adha al-‘Adawiyyah<\/strong><\/p>\n\n\n\n<p>Another chain comes through Sulaiman bin ‘Abdullah from Mu’adhah Al-‘Adawiyyah that she heard ‘Ali bin Abi Talib stating on the pulpit of Basra:<\/p>\n\n\n\n<p>“I am Al-Siddiq al-Akbar. I believed before Abu Bakr believed and I accepted Islam before him.” [Al-Tarikh al-Kabir of Bukhari, Al-Aahaad wa al-Mathaani by Ibn Abi ‘Aasim (186-187), Al-Kuna by Al-Dulabi (1587), Al-Du’afa by al-‘Uqaili (2\/130)]<\/p>\n\n\n\n<p>Sulaiman bin ‘Abdullah in this chain is Majhool. Al-Bukhari states regarding this report of Sulaiman:<\/p>\n\n\n\n<p>لا يتابع عليه ولا يعرف سماغ سُلَيْمَان من معَاذة<\/p>\n\n\n\n<p>“No one supports him on this and hearing of Sulaiman from Mu’adhah is not known.”&nbsp; [At-Tarikh al-Kabir (4\/23)]<\/p>\n\n\n\n<p>Ibn ‘Adi agreed with Al-Bukhari and said:<\/p>\n\n\n\n<p>وسليمان يعرف بهذا الحديث، ولاَ أعرف له غيره ولم يتابع على هذه الرواية كما قاله البخاري<\/p>\n\n\n\n<p>“Sulaiman is known through this narration (only) and I do not know any of his hadith other than this. No one supports him on this as stated by Al-Bukhari.” [Al-Kamil (4\/268)]<\/p>\n\n\n\n<p>Al-Dhahabi said in “Meezan” (2\/212):<\/p>\n\n\n\n<p>قال البخاري: لا يتابع عليه وذكره ابن عدي في الضعفاء<\/p>\n\n\n\n<p>“Bukhari said, ‘No one backs his narration.’ Ibn ‘Adi mentioned him among weak narrators.”<\/p>\n\n\n\n<p>So an unknown narrator narrating his only narration, which is criticized by scholars, is nothing less than a severe criticism against him.<\/p>\n\n\n\n<p>Hence, Sulaiman b. ‘Abdullah was an unknown narrator. Still Ibn Hibban included him among Thiqaat due to his faulty methodology regarding such narrators.&nbsp;<\/p>\n\n\n\n<p><strong><em>What makes a narrator Majhul?<\/em><\/strong><\/p>\n\n\n\n<p><em>Before I discuss this, let me make it clear again that the narrator had criticism in his favor. He had only one narration and that too was criticized by experts like Bukhari and Ibn ‘Adi. Besides that al-‘Uqaili included this narrator in book on weak narrators “Ad-Du’afa”.<\/em><\/p>\n\n\n\n<p>A Majhul or unknown narrator is that who was not famous in field of knowledge. Later, scholars divided such narrators into different categories:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Majhul al-‘Ayn: The narrator through whom only one has person narrated and no one declared him reliable nor was he criticized.<\/li><li>Majhul al-Haal or Mastur: These are the narrators from whom more than one trustworthy people have taken Hadith but he was neither praised nor criticized.<\/li><\/ol>\n\n\n\n<p>There had been a dispute among scholars of Hadith regarding the acceptance of the hadith of a Majhul al-Haal narrator. It has been accepted by some scholars like Ibn Khuzaimah and his student Ibn Hibban. However, majority of scholars do not accept it except in cases where there are other factors which indicate towards the reliability of such narrators.&nbsp;<\/p>\n\n\n\n<p>However, the narrator we are discussing currently do not fit in any side of the disputed group. The narrator Sulaiman bin ‘Abdullah is Majhul al-‘Ayn not Mastur since only Nuh bin Qais narrates from him as pointed out by Imam Bukhari and affirmed by Ibn ‘Adi in “al-Kamil”.<\/p>\n\n\n\n<p>Al-Baladhuri brought another chain of this narration in his “Ansab al-Ashraf” (2\/147) where another narrator is narrating this from Sulaiman bin ‘Abdullah. Some of the innovators may use this to raise Sulaiman to the level of Mastur or Majhul al-Haal and hence making it acceptable based on the standard of some scholars. However, it is to be noted that Al-Baladhuri is a historian whose book was not served as other hadith works are served. Hence, we find several odd narrations in that book which were not known to specialists of Hadith. Even Al-Baladhuri himself was not analyzed as a narrator and hence it is hard to find any praise for him as a narrator. Since, several Hadith specialists did not acknowledge any such alternate chain for this narration or another student of Sulaiman bin ‘Abdullah therefore it is very much unlikely that Al-Baladhuri would have preserved it properly.&nbsp;<\/p>\n\n\n\n<p>Secondly, if we assume that the chain, which actually is a shaadh chain, has been preserved by Al-Baladhuri precisely then also it is not sufficient to raise Sulaiman to the level of Mastur. This is because the narrator here is Abu Hilal Ar-Rasibi who was a disputed narrator. While to raise a narrator from the status of Majhul al-‘Ayn at least two well known people famous for their knowledge must narrate from him. It is as described by Khateeb in “Al-Kifayah” [p.88]:<\/p>\n\n\n\n<p><strong>وَأَقَلُّ مَا تَرْتَفِعُ بِهِ الْجَهَالَةُ أَنْ يَرْوِيَ عَنِ الرَّجُلِ اثْنَانِ فَصَاعِدًا مِنَ الْمَشْهُورِينَ بِالْعِلْمِ كَذَلِكَ<\/strong><\/p>\n\n\n\n<p>“The least which raises a narrator from the level of Majhul [al-‘Ayn] is when two or more people who were well known for their knowledge narrate from him.”<\/p>\n\n\n\n<p><strong><em>Does this supports the earlier chain?<\/em><\/strong><\/p>\n\n\n\n<p>The simple answer to this question is No. This is because the Mutabi’ah or corroboration is only considered for those narrators whose weakness is due to their weak memory, Ikhtilat and others issues related to memory where chances of errors due to forgetfulness could be ignored if both the narrators testify the same thing. However, when a narrator’s weakness is due to his habit of lying or due to severe deterioration of the memory, or if there is lack of information about the narrator then such narrators cannot be aided by a weak narrator or another narrator of his kind. And if such narrators narrate something which has the text that is not supported by the narrations of other trustworthy narrators, then such narrations could be declared forged or falsehood as we shall see in next heading.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Section-2: Analyzing the text of the narration<\/strong><\/h4>\n\n\n\n<p><strong><em>The Narration is Munkar:<\/em><\/strong><\/p>\n\n\n\n<p>As we have seen defects in the chains of these narrations, let us have a look at the text of the narration. In the narration above we can see ‘Ali b. Abi Talib calling himself the Siddiq Akbar and accusing anyone of lying who would claim to be as such after him. In the other version we even see him comparing himself with Abu Bakr and preferring himself over him. All this is against the well known characteristics of ‘Ali (ra). In this section I will enlist reasons for the Nakarah in this narration:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>The first reason for the narration being Munkar is that it has been reported through chains which are not well-know chains of knowledge. In the first chain, the narrator ‘Abbad is not well known for being a companion of ‘Ali (ra). This whole chain is isolated. Similarly in the second chain an unknown person is claiming to have heard something from a Sahabiyyah which no one else ever claimed to have heard from her. The valid question here is where were all the well known Shuyukh and Rijal of Hadith when this statement was uttered on Minbar of Basra? Why this merit could not be reported by even reliable Shi’i narrators?<\/li><li>The second reason is the fact that the term “Siddiq Akbar” or even “Siddiq” was never known for ‘Ali. In history he was never known with this title. This is unlike Abu Bakr who was ofter referred to as a Siddiq in Hadith and History books. If there was an authentic origin of this and ‘Ali ever announced it on pulpit for himself then it would have been a common attribute of Ali and at least companions of ‘Ali would have referred him as such.&nbsp;<\/li><li>‘Ali was a humble person. He was never known for boasting about his own virtue unless if it was a necessity. He even never preferred himself over ‘Uthman. How come then he became so convinced of his loftiness that he started propagating his virtue through the Minbar denying it for anyone else, as if this attribute was revealed from Allah for him only.<\/li><li>In the first route of the narration ‘Ali reportedly said that he prayed seven years before anyone else had prayed. This is clearly a false statement. Ibn Katheer took it as evidence against the authenticity of the narration. [Al-Bidayah (4\/64)]<\/li><\/ol>\n\n\n\n<p>All these points prove that the narration is not reliable and that is why Imam Ahmad said about it:<\/p>\n\n\n\n<p>“Throw it away, for it is a Munkar narration.”<\/p>\n\n\n\n<p>[Al-Muntakhab min ‘Ilal al-Khallal (114) by Ibn Qudamah, Al-Mawdu’aat (1\/341) by Ibn al-Jawzi]<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong><em>Conclusion<\/em><\/strong><\/h4>\n\n\n\n<p>After looking at all these points it will be clear to anyone that this narration is not acceptable. Not just the narrators in its chains are unreliable even the content of the narration is problematic. This is the reason we see that several scholars, who came across it, rejected it. Scholars who declared this narration unreliable are:<\/p>\n\n\n\n<ol class=\"wp-block-list\"><li>Imam Ahmad said regarding this, “Throw it away for it is a Munkar Hadith.” [Al-Muntakhab min ‘Ilal al-Khallal (p.204), Al-Mawdu’aat (1\/341)]<\/li><li>Ibn al-Jawzi al-Hanbali declared it fabricated. [Al-Mawda’aat (1\/341)]<\/li><li>Ibn al-Jawraqani declared it falsehood (Baatil). [Al-Abateel wa al-Manakeer (1\/294)]<\/li><li>Ibn Taymiyyah declared it fabricated. [Minhaj as-Sunnah (7\/443)]<\/li><li>Al-Dhahabi said, “It is lie on ‘Ali.” [Meezan (2\/368)]<\/li><li>Ibn Katheer said, “This narration is Munkar…” [Al-Bidayah (4\/64)]<\/li><\/ol>\n\n\n\n<p>Finally, with all these scholarly opinions and by looking at all the evidences discussed in this article we can easily say that this narration is Munkar or falsehood with this text. If this had been a proven virtue of ‘Ali then this would have been famous in circles of ‘Ilm and ‘Ali would have been referred as a Siddiq by his companions and early followers before the origin of extremist sects of Imamiyyah. People would have rushed to such narrators only to hear this unique narration. The lack of all this factors proves the defects in this narration.<\/p>\n\n\n\n<p class=\"has-text-align-center\">وصلي الله علي نبينا محمد وعلي اله وصحبه وسلم<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Narration “Ali is Siddiq Akbar” Analysis of the chain and text of the alleged statement of &#8216;Ali bin Abi Talib and refutation of the arguments made to authenticate it. ByAbu Sumayyah Moin الحمد لله رب العالمين والصلاة والسلام علي <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2021\/08\/03\/the-narration-ali-is-siddiq-akbar\/\" title=\"The Narration “Ali is Siddiq Akbar”\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":5021,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-5017","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/5017","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=5017"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/5017\/revisions"}],"predecessor-version":[{"id":5026,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/5017\/revisions\/5026"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/5021"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=5017"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=5017"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=5017"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}