{"id":5039,"date":"2025-01-27T19:08:33","date_gmt":"2025-01-27T19:08:33","guid":{"rendered":"http:\/\/www.twelvershia.net\/?p=5039"},"modified":"2025-01-27T19:40:25","modified_gmt":"2025-01-27T19:40:25","slug":"11-shii-scholars-and-the-authenticity-of-their-texts-2","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2025\/01\/27\/11-shii-scholars-and-the-authenticity-of-their-texts-2\/","title":{"rendered":"11 &#8211; Shī`ī Scholars and the Authenticity of their Texts"},"content":{"rendered":"\n<p><a href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/\" rel=\"external nofollow\">Home<\/a><\/p>\n\n\n\n<p>Published by SunniDefense © on July 29th, 2009 in <a href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/expos%C3%A9\/blatant-lies.aspx\" rel=\"external nofollow\">Blatant Lies<\/a><\/p>\n\n\n\n<p>Answering-Ansar Article:<\/p>\n\n\n\n<p>Who believes the Quran has been a victim of Tahreef? (Revision: 1.0.0)<\/p>\n\n\n\n<p>Whenever someone raises a question about a narration promoting the belief in distortion of the Holy Qur’ān found in major <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> texts, their apologists immediately embrace deceptive methods&nbsp;to free themselves from all burden. One of these methods is to say that neither did any of their scholars ever compile a work of narrations that he himself considered entirely authentic nor did any of them ever claim such a thing about any of the texts.<\/p>\n\n\n\n<p>The Answering-Ansar team forwards these very same notions in the following words:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td>Quoting Answering-Ansar:<\/td><\/tr><tr><td><strong>First Point: No one amongst the Shia ulema claimed his hadith book as 100 % correct<\/strong><br>Those people who after reading some traditions in the hadith books written by Shia Ulema criticize Shia of Ali [as] are fact fanatics that have abandoned all aspects of justice since no Shia author ever claimed that all of the hadiths compiled in his book were correct and Sahih. Similarly none amongst the Shia Muhaditheen and jurists testified to any specific Shia book containing hadiths that were all acceptable and Sahih. Likewise Sheikh Muhammad Jawwad Ma`tiya states the hadith books of our school like Al Kafi, Istibsar, Al Tahdib, Man La Yuhizar al Faiqh contain both Sahih and weak hadiths. Similarly, the books on Fiqha written by our scholars contain material that have mistakes. It would therefore be correct to assert that according to the Shia of Ali [as] there is no book besides that Holy Quran which is flawless from its beginning till its end. One cannot therefore cite the tradition from the Shia hadith book against the Shia of Ali [as] as when the Shia reject the authenticity of such a hadith. In order to corroborate our stance, it would suffice to say that Shiekh Muhammad Yaqub Kuleini (d 329 H) recorded 16200 hadiths in his book ‘Al Kafi’. The scholars have categorized these hadiths in respect of Rijal under five different categories i.e Sahih, Mawthiq, Qawi, Hasan, Daeef [weak]. It is therefore evident that since scholars applied this division to our principle book Al Kafi, that is deemed as reliable and a source of Islamic instructions, the authority and authenticity of other books is self clarified.<a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/tahreef_alquran_4-5.gif\" rel=\"noreferrer noopener external nofollow\"><\/a><strong><\/strong><\/td><\/tr><tr><td><em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">Who believes the Quran has been a victim of Tahreef?<\/a><\/em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">, page 4-5<\/a><\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>Many unwary Muslims are deceived by these two expressions due to their lack of knowledge about <em><u>Sh<\/u>ī`ī<\/em> literature and scholars, but those who have spent years as <em><u>Sh<\/u>ī`īs<\/em> or studying them know very well that these are nothing but patent lies.<\/p>\n\n\n\n<p>The Answering-Ansar team has proposed two notions here:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>No <em><u>Sh<\/u>ī`ī<\/em> author ever claimed that all the narrations compiled in his book “were correct and Sahih.”<\/li>\n<\/ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li>None among the <em><u>Sh<\/u>ī`ī<\/em> scholars of narrations and jurisprudence testified that any specific <em><u>Sh<\/u>ī`ī<\/em> text containing narrations “were all acceptable and Sahih.”<\/li>\n<\/ul>\n\n\n\n<p>The following revealing set of facts will show the readers that both these claims are actually lies forwarded by the Answering-Ansar team to deceive Muslims.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Introduction of the Four Books<\/h2>\n\n\n\n<p>Before moving on with the facts, readers should know that the most authoritative compilations after the Qur’ān, according to <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī <u>Sh<\/u>ī`īs<\/em>, are what they call <em>al-Kutub al-Arba`a<\/em> [“The Four Books”]. These four compilations are:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Kāfī<\/em> <em>fī `Ilm al-Ĥadīth<\/em> of Abū Ja`far al-Kulaynī (d. 329)<\/li>\n<\/ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man lā Yaĥđuruh al-Faqīh<\/em> of Ibn Bābawayh al-Şadūq al-Qummī (d. 381)<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Tah<u>dh<\/u>īb al-Aĥkām fī <u>Sh<\/u>arĥ al-Muqni`a<\/em> of Abū Ja`far al-Ţūsī (d. 460)<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Istibşār fī mā I<u>kh<\/u>talaf min al-A<u>kh<\/u>bār<\/em> of Abū Ja`far al-Ţūsī (d. 460)<\/li>\n<\/ul>\n\n\n\n<p>Grand <em>Āyat Allāh<\/em> al-Sayyid Ĥusayn Baĥr al-`Ulūm (d. 1422) writes about these four books in his introduction to <em>Tal<u>kh<\/u>īs al-<u>Sh<\/u>āfī<\/em> of Abū Ja`far al-Ţūsī:<\/p>\n\n\n\n<p>إن الإجتهاد لدى الشيعة مرتكز على الكتب الأربعة الكافي للكليني ومن لا يحضره الفقيه للصدوق والتهذيب والاستبصار للطوسي وهي من الأصول المسلمة كالصحاح الستة لدى العامة<\/p>\n\n\n\n<p><strong>“Verily, scholarly endeavour, according to the <em><u>Sh<\/u>ī`a<\/em>, is dependant on the Four Books: <em>al-Kāfī<\/em> of al-Kulaynī, <em>Man lā Yaĥđuruh al-Faqīh<\/em> al-Şadūq, <em>al-Tah<u>dh<\/u>īb <\/em>and <em>al-Istibşār<\/em> of al-Ţūsī. These are from the accepted principle books that are as the Six <em>Şiĥāĥ<\/em> are according to the Commoners.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Tal<u>kh<\/u>īs al-<u>Sh<\/u>āfī {Introduction}<\/em>, of al-Sayyid Ĥusayn Baĥr al-`Ulūm (d. 1422), page 29 [Najaf]<\/li>\n<\/ul>\n\n\n\n<p>Let us now proceed:<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">al-Kulaynī (d. 329) and <em>al-Kāfī<\/em><\/h2>\n\n\n\n<p><em>al-Kāfī fī `Ilm al-Ĥadīth<\/em> of the major <em><u>Sh<\/u>ī`ī<\/em> scholar Abū Ja`far al-Kulaynī is the most authoritative and renowned compilation of the Four Books. The author of this work, al-Kulaynī, believed that all the narrations in his work are authentic and correct, and that is the reason why he actually compiled it.<\/p>\n\n\n\n<p>In the introduction of <em>al-Kāfī<\/em>, he explicitly said:<\/p>\n\n\n\n<p>وقلت إنك تحب أن يكون عندك كتاب كاف يجمع فيه من جميع فنون علم الدين ما يكتفي به المتعلم ويرجع إليه المسترشد ويأخذ منه من يريد علم الدين والعمل به بالآثار الصحيحة عن الصادقين عليهم السلام والسنن القائمة التي عليها العمل وبها يؤدي فرض الله عز وجل وسنة نبيه صلى الله عليه وآله وقلت لو كان ذلك رجوت أن يكون ذلك سببا يتدارك الله تعالى بمعونته وتوفيقه إخواننا وأهل ملتنا ويقبل بهم إلى مراشدهم<\/p>\n\n\n\n<p><strong>“Verily, you solemnly wished that you possess a book which is sufficient, brings together the entire Islamic sciences of the knowledge of religion within it, wholly satisfies the needs of the student, acts as a reference for the seekers of guidance, and would be used by those who want to attain the knowledge of religion and practice upon it by deriving <u>correct [<em>şaĥīĥ<\/em>] narrations of the truthful ones (as)<\/u> and the upright and acted upon traditions from it—through which the compulsory duties of Allāh, the Powerful and Exalted, and the tradition of His Prophet (saws) can be fulfilled.<\/strong><\/p>\n\n\n\n<p><strong>And you said: ‘If that happens, I can hope that (the book) would be a means through which Allāh will rectify our brothers and people of our religious community through his support and grace, and take them closer to their salvation.’”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Kāfī<\/em>, of Abū Ja`far al-Kulaynī (d. 329), volume 1, page 8 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>Following this, he said:<\/p>\n\n\n\n<p>وقد يسر الله وله الحمد تأليف ما سألت وأرجو أن يكون بحيث توخيت<\/p>\n\n\n\n<p><strong>“Allāh, all praise to him, has facilitated the compilation of what you requested. I hope that (this book) will be in accordance with the wishes you had in mind.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Kāfī<\/em>, of Abū Ja`far al-Kulaynī (d. 329), volume 1, page 9 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>This is an explicit confirmation from al-Kulaynī that the reason he compiled <em>al-Kāfī<\/em> was so he can provide <em><u>Sh<\/u>ī`īs<\/em> with a book of authentic narrations that is sufficient for them—i.e. his book only contained correct reports according to him.<\/p>\n\n\n\n<p>The contemporary <em><u>Sh<\/u>ī`ī<\/em> scholar <em>Āyat Allāh<\/em> Muĥammad Mahdī al-Āşifī writes about al-Kulaynī while discussing <em>al-Kāfī<\/em> in his epistle <em>Tarī<u>kh<\/u> Fiqh Ahl al-Bayt<\/em>:<\/p>\n\n\n\n<p>وقد جمع رحمه الله في موسوعته هذه ما صح لديه من أحاديث الأئمة الهداة عليهم السلام<\/p>\n\n\n\n<p><strong>“He—may Allāh have mercy on him—has collected what he found authentic from the narrations of the guiding <em>Imāms<\/em> (as) in this encyclopedia of his.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Riyāđ al-Masā’il fī Bayān Aĥkām al-Shar` wa al-Dalā’il<\/em>, of al-Sayyid `Alī al-Ţabāţabā’ī (d. 1231), volume 1, page 31 [Qum] – <em>Tarīkh Fiqh Ahl al-Bayt<\/em> included in the introduction.<\/li>\n<\/ul>\n\n\n\n<p>Furthermore, <em>Āyat Allāh<\/em> Abū Ţālib al-Tajlīl al-Tabrīzī, author of the famous booklet translated as <em>‘<\/em><em>Spurious Arguments about the Shia<\/em>,<em>’<\/em> confirms this declaration of al-Kulaynī in the introduction to his book known as <em>Mu`jam al-Maĥāsin wa al-Masāwī<\/em>.<\/p>\n\n\n\n<p>He writes about al-Kulaynī and his <em>al-Kāfī<\/em>:<\/p>\n\n\n\n<p>وقد صرح في مقدمته بصحة أحاديثه حيث قال وقلت تحب أن يكون عندك كتاب يأخذ منه من يريد علم الدين والعمل به بالآثار الصحيحة عن الصادقين عليهم السلام . . . . إلى أن قال وقد يسر الله وله الحمد تأليف ما سألت وأرجو أن يكون بحيث توخيت<\/p>\n\n\n\n<p><strong>“He has declared the authenticity of its narrations in his introduction, when he said: ‘<\/strong><strong>Verily, you solemnly wished that you possess a book would be used by those who want to attain the knowledge of religion and practice upon it by deriving correct [<em>şaĥīĥ<\/em>] narrations of the truthful ones (as)…’ to: ‘Allāh, all praise to him, has facilitated the compilation of what you requested. I hope that (this book) will be in accordance with the wishes you had in mind.’”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mu`jam al-Maĥāsin wa al-Masāmī<\/em>, of Abū Ţālib al-Tabrīzī, page 17 [Qum]<\/li>\n<\/ul>\n\n\n\n<p>This declaration of al-Kulaynī was so influential in history that it even led a group of <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> <em><u>Sh<\/u>ī`ī<\/em> scholars to use it as an argument for <em>their<\/em> belief in the immaculacy of the contents of <em>al-Kāfī<\/em>. Among them is al-Ĥurr al-`Āmilī (d. 1104), a major <em><u>Sh<\/u>ī`ī<\/em> scholar of that group and an expert in the field of narrations, who staunchly believed in the correctness of all the narrations in <em>al-Kāfī<\/em>.<\/p>\n\n\n\n<p>He states about the declaration of al-Kulaynī cited above:<\/p>\n\n\n\n<p>وهو صريح أيضا في الشهادة بصحة أحاديث كتابه لوجوه منها قوله بالآثار الصحيحة ومعلوم أنه لم يذكر فيه قاعدة يميز بها الصحيح عن غيره لو كان فيه غير صحيح ولا كان اصطلاح المتأخرين موجودا في زمانه قطعا كما يأتي فعلم أن كل ما فيه صحيح باصطلاح القدماء بمعنى الثابت عن المعصوم بالقرائن القطعية أو التواتر<\/p>\n\n\n\n<p><strong>“This is also an explicit declaration of authenticity of the narrations in his book due to various points.<\/strong><\/p>\n\n\n\n<p><strong>One of these points is: His statement: ‘Authentic narrations.’ It is well-known that neither did he mention a rule that distinguishes the rigorously authentic [<em>şaĥīĥ<\/em>] narration from the other categories in (the book), even if there is a non-<em>şaĥīĥ<\/em> narration in it, nor were the terminologies of the later scholars absolutely present during his time, as it will <\/strong><strong>be further explained.<\/strong><\/p>\n\n\n\n<p><strong>Thus, it is known that all the narrations in it are correct [<em>şaĥīĥ<\/em>] by the terminology of the early scholars, with the meaning of being proven from the infallible on the basis of categorical indications or consecutiveness.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em><u>Kh<\/u><\/em><em>ātimat Tafşīl Wasā’il al-<u>Sh<\/u>ī`a ilá Taĥşīl Masā’il al-<u>Sh<\/u>arī`a<\/em>, of al-Ĥurr al-`Āmilī (d. 1104), volume 30, page 196 [Qum]<\/li>\n<\/ul>\n\n\n\n<p><strong>Note:<\/strong> What al-Ĥurr means by “the terminology of later scholars” are the terminologies introduced with the categorization of narrations, in terms of their authenticity, that was not invented until the end of the 7<sup>th<\/sup> Islamic century. Before this categorization, the early <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars viewed the narrations to be either <em>şaĥīĥ<\/em> or not <em>şaĥīĥ<\/em>. This will be further elaborated in this writing.<\/p>\n\n\n\n<p>Opposing the view of this group of <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars, al-Sayyid Muĥammad al-Mujāhid al-Ţabāţabā’ī (d. 1242) replied to this argument in the following words:<\/p>\n\n\n\n<p>إن إخبار الكليني بصحة ما دونه في الكافي كما يمكن أن يكون باعتبار علمه بها وقطعه بصدورها عن الأئمة عليهم السلام فيجوز الاعتماد عليها والحال هذه كسائر أخبار العدول كذلك يمكن أن يكون باعتبار اجتهاده وظهورها عنده ولو بالدليل الظني فلا يجوز إذن الاعتماد عليه فإن ظن المجتهد لا يكون حجة على مثله كما هو الظاهر من الأصحاب بل ومن العقلاء وحيث لا ترجيح للاحتمال الأول وجب التوقف به لأن الشك في الشرط يوجب الشك في المشروط فيلزم التوقف<\/p>\n\n\n\n<p><strong>“Indeed<\/strong><strong>, the testimony of al-Kulaynī concerning the authenticity of (the narrations) he has recorded in <em>al-Kāfī<\/em>, just as it is possible that it is in consideration of his knowledge and certainty of their issuance from the <em>Imāms<\/em> (as), in which case it is permissible to depend upon them and its status will be the same as of all the reports of just individuals, it is (also) possible that it is in consideration of his independent judgment [<em>ijtihād<\/em>] and their appearance to him on the basis of conjectural proof. In this case it is impermissible to depend upon them, for the conjecture of a scholar capable of independent judgment [<em>mujtahid<\/em>] is not proof for those of the same stature, as it is obvious from other scholars, in fact, even from those with intellect.<\/strong><\/p>\n\n\n\n<p><strong>And when there is no preference for the first possibility, it is incumbent to desist from holding on it because doubt about the condition necessitates doubt about what the condition is applied upon. Therefore, desistance is incumbent.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mafātīĥ al-Uşūl<\/em>, of al-Sayyid Muĥammad al-Ţabāţabā’ī (d. 1242), page 332 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>Whereas Grand <em>Āyat Allāh<\/em> Ĥusayn `Alī al-Muntažarī leaves out al-Ţabāţabā’ī’s analogical justifications and puts it in simple words:<\/p>\n\n\n\n<p>واعتقاد الكليني بصحة الرواية ليس من الحجج الشرعية إذ ليس هو معصوما عندنا<\/p>\n\n\n\n<p><strong>“The belief of al-Kulaynī about the correctness of traditions is not a legal proof because he is not an infallible according to us!”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Dirāsāt fī al-Makāsib al-Muĥarrama<\/em>, of Ĥusayn `Alī al-Muntažarī, volume 3, page 123 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>So in a nutshell, between the occurrence of inter-<em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> disputes on whether <em>al-Kāfī<\/em> is entirely correct or not, the fact remains that al-Kulaynī himself declared, and thus believed in, the authenticity of the narrations found in his book.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Ibn Bābawayh (d.381) and <em>Man lā Yaĥđuruh al-Faqīh<\/em><\/h2>\n\n\n\n<p>Abū Ja`far ibn Bābawayh al-Qummī, the famous <em><u>Sh<\/u>ī`ī<\/em> scholar known as al-Shaykh al-Şadūq, also believed that all the narrations he has recorded in his compilation <em>Man lā Yaĥđuruh al-Faqīh<\/em> are all authentic and correct. In fact, just as al-Kulaynī, he has himself declared their authenticity while mentioning the reason why he compiled the work.<\/p>\n\n\n\n<p>Ibn Bābawayh explicitly mentions in the introduction to <em>Man lā Yaĥđuruh al-Faqīh<\/em> that he has compiled this work on narrations because another <em><u>Sh<\/u>ī`ī<\/em> scholar of his era, Sharaf al-Dīn Ni`ma, requested him to author a condensed work dealing with jurisprudence, Islamic laws and the permitted and prohibited.<\/p>\n\n\n\n<p>He writes:<\/p>\n\n\n\n<p>وصنفت له هذا الكتاب بحذف الأسانيد لئلا تكثر طرقه وإن كثرت فوائده ولم أقصد فيه قصد المصنفين في إيراد جميع ما رووه بل قصدت إلى إيراد ما أفتي به وأحكم بصحته وأعتقد فيه أنه حجة فيما بيني وبين ربي تقدس ذكره وتعالت قدرته<\/p>\n\n\n\n<p><strong>“<\/strong><strong>I have compiled this book for him without chains of transmission, so that its transmissions should not be too many while its benefits are abundant. I did not intend to present all of what they have narrated, as authors usually do; rather I intended to present that by which I give legal opinions and rule to be authentic [<em>aĥkum bi şiĥĥatih<\/em>], and believe that it is proof [<em>ĥujja<\/em>] between me and my Lord, exalted is His power.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man lā Yaĥđuruh al-Faqīh<\/em>, of Ibn Bābawayh al-Qummī (d. 381), volume 1, page 2-3 [Qum]<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/man_faqih_1_3.gif\" target=\"_blank\" rel=\"noreferrer noopener external nofollow\"><em>Man lā Yaĥđuruh al-Faqīh<\/em>, of Ibn Bābawayh al-Qummī (d. 381), volume 1, page 3 [Lucknow]<\/a><\/li>\n<\/ul>\n\n\n\n<p>These words of Ibn Bābawayh are extremely obvious and show that he believed that all the narrations in his book are authentic and correct.<\/p>\n\n\n\n<p>Contemporary <em><u>Sh<\/u>ī`ī<\/em> scholar and intellectual, Dr. `Abd al-Hādī al-Fađlī, writes after quoting these words of Ibn Bābawayh:<\/p>\n\n\n\n<p>ونصه هذا واضح وصريح في أنه يعتقد بصحة ما في كتابه ويراه حجة بينه وبين الله تعالى<\/p>\n\n\n\n<p><strong>“<\/strong><strong>This explicit statement of his is clear and unequivocal in showing that he believes in the authenticity of what is in his book, and views it to be proof between himself and Allāh the Exalted.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Uşūl al-Ĥadī<u>th<\/u><\/em>, of `Abd al-Hādī al-Fađlī, page 217 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>This is further confirmed by al-Tabrīzī, who states about Ibn Bābawayh and his book:<\/p>\n\n\n\n<p>وقد صرح لصحة أحاديثه بقوله في مقدمته قصدت إلى إيراد ما أفتي به وأحكم بصحته وأعتقد فيه أنه حجة فيما بيني وبين ربي<\/p>\n\n\n\n<p><strong>“He has declared the authenticity of its narrations in his introduction,<\/strong><strong> <\/strong><strong>with his statement: ‘I intended to present that by which I give legal opinions and rule to be authentic [<em>aĥkum bi şiĥĥatih<\/em>], and believe that it is a proof [<em>ĥujja<\/em>] between me and my Lord.’”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mu`jam al-Maĥāsin wa al-Masāmī<\/em>, of Abū Ţālib al-Tabrīzī, page 17 [Qum]<\/li>\n<\/ul>\n\n\n\n<p>Another thing worthy of mention here is what is mentioned in the transcribed lectures of the contemporary Grand <em>Āyat Allāh<\/em> `Alī al-Sīstānī about Ibn Bābawayh and his book:<\/p>\n\n\n\n<p>إنه قدس سره قد شهد في مقدمة كتابه بصحة جميع ما رواه فيه حيث قال ولم أقصد فيه قصد المصنفين في إيراد جميع ما رووه بل قصدت إلى إيراد ما أفتي به وأحكم بصحته وأعتقد فيه إنه حجة فيما بيني وبين ربي تقدس ذكره وتعالت قدرته<\/p>\n\n\n\n<p><strong>“<\/strong><strong>Verily, he—may Allāh sanctify his secret—has certified the authenticity of <em>all<\/em> that he has narrated in it, in the introduction, when he said: ‘I did not intend to present all of what they have narrated, as authors usually do; rather I intended to present that by which I give legal opinions and rule to be authentic [<em>aĥkum bi şiĥĥatih<\/em>], and believe that it is proof [<em>ĥujja<\/em>] between me and my Lord, sacred is His mention and exalted is His power.’”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Qā`ida lā Đarar wa lā Đirār<\/em>, of `Alī al-Sīstānī, page 87 [Qum]<\/li>\n<\/ul>\n\n\n\n<p>As it is obvious from Ibn Bābawayh’s own words, the reason why he removed the chains of transmission from <em>Man lā Yaĥđuruh al-Faqīh<\/em> is because he did not want to present any narration that was not authentic or proof [<em>ĥujja<\/em>] according to him, like other scholars usually did in their compilations. And since Ibn Bābawayh was one of the early <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars and there were no terminologies of the later scholars during his time, it can easily be understood from his authentication that he viewed the narrations to be <em>şaĥīĥ<\/em>.<\/p>\n\n\n\n<p>However, in case the Answering-Ansar team customarily rejects all manners taught by the <em>Ahl al-Bayt<\/em> (ra) to impolitely accuse other “cults” of misinterpreting Ibn Bābawayh’s words, let us cite a few more statements of <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars who have acknowledged his view.<\/p>\n\n\n\n<p>The major <em><u>Sh<\/u>ī`ī<\/em> scholar Bahā’ al-Dīn al-`Āmilī (d. 1034), who was admired as the “teacher of all” by even the top scholar-marionettes of the Safavids, states in his <em>Ma<u>sh<\/u>riq al-<u>Sh<\/u>amsayn<\/em>:<\/p>\n\n\n\n<p>وقد جرى رئيس المحدثين ثقة الإسلام محمد بن بابويه قدس الله روحه على متعارف المتقدمة في إطلاق الصحيح على ما يركن إليه ويعتمد عليه فحكم بصحة جميع ما أورده من الأحاديث في كتاب من لا يحضره الفقيه<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The head of the scholars of narrations [<em>muĥaddi<u>th<\/u>īn<\/em>], the trustworthy of Islam, Muĥammad ibn Bābawayh—may Allāh sanctify his soul—has taken the <u>traditional course of the early scholars in terming the relied and depended upon (narrations) as <em>‘<\/em><em>şaĥīĥ<\/em><\/u>.<em>’<\/em> Thus, he has ruled the correctness of all the narrations he has mentioned in the book <em>Man lā Yaĥđuruh al-Faqīh<\/em>.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Ma<u>sh<\/u>riq al-<u>Sh<\/u>amsayn wa Iksīr al-Sa`ādatayn<\/em>, of Bahā’ al-Dīn al-`Āmilī (d. 1034), page 269-270 [Qum]<\/li>\n<\/ul>\n\n\n\n<p>Another <em><u>Sh<\/u>ī`ī<\/em> scholar of high stature and author of over a hundred texts, Muĥammad Muĥsin al-Fayđ al-Kāshānī (d. 1091), also writes something fairly close in his voluminous <em>al-Wāfī<\/em>:<\/p>\n\n\n\n<p>وقد جرى صاحبا كتابي الكافي والفقيه على متعارف المتقدمين في اطلاق الصحيح على ما يركن اليه ويعتمد عليه فحكما بصحة جميع ما أورداه في كتابيهما من الأحاديث وإن لم يكن كثير منه صحيحا على مصطلح المتأخرين<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The authors of the two books, <em>al-Kāfī<\/em> and <em>al-Faqīh<\/em>, have taken the traditional course of the early scholars in terming the relied and depended upon (narrations) as <em>‘<\/em><em>şaĥīĥ<\/em>.<em>’<\/em> Thus, they have ruled the correctness of all the narrations they have mentioned in their books, even though many of them are not <em>şaĥīĥ<\/em> according to the terminology of the later scholars.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/alwafi_1_23.gif\" target=\"_blank\" rel=\"noreferrer noopener external nofollow\"><em>al-Wāfī<\/em>, of al-Fayđ al-Kā<u>sh<\/u>ānī (d. 1034), volume 1, page 23 [Esfahan]<\/a><\/li>\n<\/ul>\n\n\n\n<p>These quotes sufficiently demonstrate that like al-Kulaynī, Ibn Bābawayh too declared the authenticity of the narrations found in his book in the introduction, while being on the course of the early <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">al-Ţūsī (d. 460) and his <em>Ta<u>hd<\/u>hīb<\/em> and <em>al-Istibşār<\/em><\/h2>\n\n\n\n<p>This just leaves the last two of the Four Books. Our respected <em><u>Sh<\/u>ī`ī<\/em> brothers may find this hard to assimilate, but al-Ţūsī also confirmed the authenticity of these compilations of his.<\/p>\n\n\n\n<p>al-Fayđ al-Kāshānī states in <em>al-Wāfī<\/em>:<\/p>\n\n\n\n<p>أن مدار الأحكام الشرعية اليوم على هذه الأصول الأربعة وهي المشهود عليها بالصحة من مصنفها<\/p>\n\n\n\n<p><strong>“<\/strong><strong>These four key books are the pivot of legal rulings today, and they are testified as correct by their compilers.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/alwafi_1_24.gif\" target=\"_blank\" rel=\"noreferrer noopener external nofollow\"><em>al-Wāfī<\/em>, of al-Fayđ al-Kā<u>sh<\/u>ānī (d. 1034), volume 1, page 24 [Esfahan]<\/a><\/li>\n<\/ul>\n\n\n\n<p>Similarly, the famous <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholar Yūsuf al-Baĥrānī (d. 1186) also states while objecting about the opposing group of scholars from his own <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> school:<\/p>\n\n\n\n<p>أن التوثيق والجرح الذي بنوا عليه تنويع الأخبار إنما أخذوه من كلام القدماء وكذلك الأخبار التي رويت في أحوال الرواة من المدح والذم إنما أخذوها عنهم فإذا اعتمدوا عليهم في مثل ذلك فكيف لا يعتمدون عليهم في تصحيح ما صححوه من الأخبار واعتمدوه وضمنوا صحته كما صرح به جملة منهم كما لا يخفى على من لاحظ ديباجتي الكافي والفقيه وكلام الشيخ في العدة وكتابي الأخبار<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The narrator commendation and condemnation, on which the categorization of reports was based, is obtained from the statements of the early scholars. Similarly, the reports that are related concerning the conditions of narrators in terms of praise and dispraise are (also) obtained from them.<\/strong><\/p>\n\n\n\n<p><strong>If they have relied upon them [i.e. the early scholars] concerning a matter such as that, how is it that they do not rely upon them concerning the authenticity of the reports that they deemed correct, relied upon and ensured to be authentic as a score of them have (even) explicitly declared—something not hidden to he who has observed the introductions of <em>al-Kāfī<\/em> and <em>al-Faqīh<\/em>, <u>and the words of <em>al-Shaykh<\/em> [al-Ţūsī] in <em>al-`Udda<\/em> and the two books of reports [i.e. <em>Tahdhīb<\/em> and <em>al-Istibşār<\/em>]<\/u>.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Ĥadā’iq al-Nāđira fī Aĥkām al-`Itrat al-Ţāhira<\/em>, of Yūsuf al-Baĥrānī (d. 1186), volume 1, page 16 [Qum]<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/hadaiq_nadira_1_5.gif\" target=\"_blank\" rel=\"noreferrer noopener external nofollow\"><em>al-Ĥadā’iq al-Nāđira fī Aĥkām al-`Itrat al-Ţāhira<\/em>, of Yūsuf al-Baĥrānī (d. 1186), volume 1, page 5 [Iran]<\/a><\/li>\n<\/ul>\n\n\n\n<p>These strong words of <em><u>Sh<\/u>ī`ī<\/em> <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars, that were only uncovered due to the fiery disputes that occurred between them concerning the categorization of narrations in terms of their authenticity, make the stance of the author of the four most authoritative books of narrations very clear—i.e. they viewed the narrations in their works to be authentic and correct.<\/p>\n\n\n\n<p>However, it should be noted here that no one is arguing that what was considered a <em>şaĥīĥ<\/em> or correct narration among these four scholars is equivalent to what is defined as “<em>şaĥīĥ<\/em>” according to the <em><u>Sh<\/u>ī`ī<\/em> scholars today, for it is a known fact that the categorization of narrations followed by the majority of <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arīs<\/em> today was not introduced until long after these four individuals and thus, as quoted from al-Ĥurr al-`Āmilī and Bahā’ al-Dīn, they were on the traditional course of <em><u>Sh<\/u>ī`ī<\/em> scholars concerning the categorization of narrations—i.e. it is either <em>şaĥīĥ<\/em> and not <em>şaĥīĥ<\/em>.<\/p>\n\n\n\n<p>That being said, it has been evidently shown that these four scholars believed the narrations in their books to be correct or as they believed, “<em>şaĥīĥ<\/em>.” And what is being demonstrated here is their own view of the narrations in their books, not how <em><u>Sh<\/u>ī`ī<\/em> scholars, who took the other course, understand them.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The <em>A<u>kh<\/u>bārī<\/em> and <em>Uşūlī<\/em> Dispute<\/h2>\n\n\n\n<p>Interestingly, this very same dispute about the categorization of narrations in itself shows that the Answering-Ansar team has not been truthful in relaying information about <em><u>Sh<\/u>ī`ī<\/em> scholars.<\/p>\n\n\n\n<p>Answering-Ansar says:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td>Quoting Answering-Ansar:<\/td><\/tr><tr><td>Similarly none amongst the Shia Muhaditheen and jurists testified to any specific Shia book containing hadiths that were all acceptable and Sahih.<a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/tahreef_alquran_4.gif\" rel=\"noreferrer noopener external nofollow\"><\/a><strong><\/strong><\/td><\/tr><tr><td><em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">Who believes the Quran has been a victim of Tahreef?<\/a><\/em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">, page 4<\/a><\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>The abovementioned quotes are sufficient in showing that this statement is an obvious lie. Nonetheless, let us quote a few more <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars as an elaboration of this issue so this lie of Answering-Ansar becomes much more clear to the readers.<\/p>\n\n\n\n<p>Dr. `Abd al-Hādī al-Fađlī writes under the heading <em>‘<\/em><em>The Authentication of the Narrations in the Four Books<\/em><em>’<\/em> in his <em>Uşūl al-Ĥadī<u>th<\/u><\/em>:<\/p>\n\n\n\n<p>يراد بالتصحيح هنا اعتداد جميع ما في الكتب الأربعة من أحاديث رويت عن أهل البيت عليهم السلام معتبرة ومقطوعا بصدورها عن الأئمة والمسألة هذه وقعت موقع الخلاف بين علمائنا وطال البحث فيها وطال معه النقاش حولها<\/p>\n\n\n\n<p><strong>“What is meant by ‘authentication’ here is considering all the narrations that are related from the <em>Ahl al-Bayt<\/em> in the Four Books, to be reliable and certainly issued from the <em>Imāms<\/em>.<\/strong><\/p>\n\n\n\n<p><strong>There has occurred a dispute between our scholars concerning this issue. Discussions lengthened concerning it, and so did the argumentations.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Uşūl al-Ĥadī<u>th<\/u><\/em>, of `Abd al-Hādī al-Fađlī, page 210 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>This dispute about authentication and categorization of narrations has occurred between two groups of <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars. These two groups are known as:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>The <em>A<u>kh<\/u>bārīs<\/em><\/li>\n<\/ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The <em>Uşūlīs<\/em><\/li>\n<\/ul>\n\n\n\n<p>The late introduction of categorizing narrations with four different terminologies in terms of their authenticity and inauthenticity, led the <em>A<u>kh<\/u>bārī<\/em> group of <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars to continue following the course early <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars adhered to before its invention.<\/p>\n\n\n\n<p><em><u>Sh<\/u><\/em><em>ī`ī<\/em> scholar and researcher, al-Sayyid Muĥyī al-Dīn al-Mūsawī al-Ghurayfī (d. 1412) explains this in his work approved by Grand <em>Āyat Allāh<\/em> Abū al-Qāsim al-Khū’ī, <em>Qawā`id al-Ĥadīth<\/em>:<\/p>\n\n\n\n<p>وقد شجب الأخباريون تنويع الحديث وعدوه من البدع التي يحرم العمل بها وبسطوا البحث في إبطاله وإثبات صحة جميع أخبار كتبنا الأربعة بل جميع الأخبار التي نقلوها عن الكتب المعتبرة لأنها محفوفة بقرائن تفيد الوثوق بصدورها عن المعصوم عليه السلام<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The <em>A<u>kh<\/u>bārīs<\/em> have disapproved of the categorization of narrations, and counted it among innovations that are forbidden to be practiced! They elaborated the discussion in nullification of it and establishing the authenticity of all the reports in our Four Books, rather all the reports that were copied from authoritative books, for they are enclosed with evidences that assist the certainty of their issuance from the infallible (as).”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Qawā`id al-Ĥadī<u>th<\/u><\/em>, of al-Sayyid Muĥyī al-Dīn al-Ghurayfī, page 16-17 [Najaf]<\/li>\n<\/ul>\n\n\n\n<p>To sum up, the <em>A<u>kh<\/u>bārīs<\/em> reject the categorization, considering it unorthodox, and believe that all the narrations in the Four Books are correct and authentic. And as they remain on the course of the early <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars who believed a narration can either be <em>‘<\/em><em>şaĥīĥ<\/em><em>’<\/em> or not <em>şaĥīĥ<\/em>, their view of the authenticity of narrations is that they are all <em>şaĥīĥ<\/em>.<\/p>\n\n\n\n<p><em>Āyat Allāh<\/em> Murtađá Muţahharī (d. 1407) states about the <em>A<u>kh<\/u>bārī<\/em> group of scholars:<\/p>\n\n\n\n<p>أنهم يزعمون أن جميع الأخبار الواردة في الكتب الأربعة وهي الكافي ومن لا يحضره الفقيه والتهذيب والاستبصار أخبار صحيحة ومعتبرة بل وقطعية الصدور<\/p>\n\n\n\n<p><strong>“<\/strong><strong>They claim that all the reports in the Four Books—which are <em>al-Kāfī<\/em>, <em>Man lā Yaĥđuruh al-Faqīh<\/em>, <em>al-Tah<u>dh<\/u>īb<\/em> and <em>al-Istibşār<\/em>—are <em>şaĥīĥ<\/em> and reliable, in fact, certainly issued (from the infallibles).”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Tajdīd wa al-Ijtihād fī al-Islām<\/em>, of Murtađá Muţahharī (d. 1407), page 86 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>Similarly, Grand <em>Āyat Allāh<\/em> al-Sayyid Muĥsin al-Amīn al-`Āmilī (d. 1371) also writes in his magnum opus, <em>A`yān al-Shī`a<\/em>:<\/p>\n\n\n\n<p>فزعم الأخباريون أن اخبار الكتب الأربعة كلها صحيحة<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The <em>A<u>kh<\/u>bārīs<\/em> claimed that all of the reports in the Four Books are <em>şaĥīĥ<\/em>.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>A`yān al-<u>Sh<\/u>ī`a<\/em>, of al-Sayyid Muĥsin al-Amīn (d. 1371), volume 3, page 223 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>While the contemporary expert <em>Āyat Allāh<\/em> Muĥammad Bāqir al-Īrawānī even mentions this is as the actual reason behind their rejection of the categorization:<\/p>\n\n\n\n<p>وسبب إنكار الأخباريين لهذا التقسيم أن جميع اخبار الكتب الأربعة صحيحة ويجب العمل بها بنظرهم<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The reason behind the rejection of this categorization of narrations by the<em> A<u>kh<\/u>bārīs<\/em> is: According to their view, <u>all the reports in the Four Books are <em>şaĥīĥ<\/em> and it is necessary to practice upon them<\/u>.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Durūs Tamhīdiyya fī al-Qawā`id al-Rijāliyya<\/em>, of Muĥammad Bāqir al-Īrawānī, page 49 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>This group of <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars, that considers all the narrations in the Four Books to be <em>şaĥīĥ<\/em>, includes renowned figures who marked their names as major scholars of narrations [<em>muĥaddi<u>th<\/u>ūn<\/em>] and jurisprudence [<em>fuqahā’<\/em>] among them. In fact, their works are viewed to be a part of the most authoritative texts by <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars even today. To name a few:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Muĥammad Amīn al-Astarābādī (d. 1036): The foremost opponent of the categorization of narrations and author of an epistle upholding the belief in the correctness of all the narrations in the Four Books, <em>al-Fawā’id al-Madaniyya<\/em>. He was a scholar of narrations and a jurist, and authored several texts such as commentaries on <em>al-Istibşār<\/em> and <em>al-Tahdhīb<\/em>, and epistles on jurisprudence.<\/li>\n<\/ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li>al-Khalīl ibn al-Ghāzī al-Qazwīnī (d. 1089): A scholar of narrations and jurisprudence, and author of several texts such as a commentary on al-Ţusī’s <em>al-`Udda<\/em> and the most famous and great commentary of <em>al-Kāfī<\/em> ever written in the Persian language, <em>al-Şāfī<\/em>. <em><u>Sh<\/u>ī`ī<\/em> biographers mention that he was staunchly against the categorization of narrations, and believed all the narrations in <em>al-Kāfī<\/em> are authenticated by the last <em>Imām<\/em> himself and it is obligatory to practice upon them.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>al-Sayyid Hāshim al-Baĥrānī (d. 1107): He was an expert scholar of narrations, a jurist and a commentator of the Holy Qur’ān. He authored around forty texts, which include the voluminous <em><u>Gh<\/u>āyat al-Marām wa Ĥujjat al-<u>Kh<\/u>işām fī Ta`yīn al-Imām min Ţarīq al-<u>Kh<\/u>āss wa al-`Āmm<\/em> and a commentary entitled <em>al-Burhān fī Tafsīr al-Qur’ān<\/em>. His works have been revered by <em><u>Sh<\/u>ī`ī<\/em> scholars ever since they were compiled.<\/li>\n\n\n\n<li><\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">al-Ĥurr al-`Āmilī (d. 1104) and <em>Wasā’il al-<u>Sh<\/u>ī`a<\/em><\/h2>\n\n\n\n<p>One of these scholars, as mentioned earlier, is Muĥammad ibn al-Ĥasan al-Ĥurr al-`Āmilī.<\/p>\n\n\n\n<p><em>Āyat Allāh<\/em> `Abbās al-Qummī (d. 1359), who was a renowned <em><u>Sh<\/u>ī`ī<\/em> scholar and biographer, has written under the biography of al-Ĥurr:<\/p>\n\n\n\n<p>محمد بن الحسن بن علي المشغري شيخ المحدثين وأفضل المتبحرين العالم الفقيه النبيه المحدث المتبحر الورع الثقة الجليل أبو المكارم والفضائل صاحب المصنفات المفيدة منها الوسائل الذي من على المسلمين بتأليف هذا الجامع الذي هو كالبحر لا يساجل<\/p>\n\n\n\n<p><strong>“<\/strong><strong>Muĥammad ibn al-Ĥasan ibn `Alī al-Ma<u>shgh<\/u>arī, the master of the scholars of narrations [<em>muĥaddi<u>th<\/u>īn<\/em>], the best of the foremost experts in religion, the knowledgeable, the renowned jurist [<em>faqīh<\/em>], the profound scholar of narrations [<em>muĥaddi<u>th<\/u><\/em>], the pious, the trustworthy, the venerable, the father of noble traits and virtues, and author of several beneficial works; one of which is the <em>Wasā’il<\/em>, a work that he has compiled as a bestowment upon the Muslims, a compilation that is like the ocean that can not be contested.”<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Kuná wa al-Alqāb<\/em>, of `Abbās al-`Qummī (d. 1359), volume 2, page 176 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>This al-Ĥurr al-`Āmilī is one of those <em>A<u>kh<\/u>bārī<\/em> scholars who strictly opposed the categorization of narrations and believed in the authenticity of all the narrations found the Four Books of the <em><u>Sh<\/u>ī`a Imāmiyya I<u>th<\/u>nā’ `A<u>sh<\/u>ariyya<\/em>. He has extensively argued in favour of this position of his in the same compilation mentioned by `Abbās al-Qummī as “the ocean that can not be contested,” <em>Wasā’il al-<u>Sh<\/u>ī`a<\/em>.<\/p>\n\n\n\n<p>al-Īrawānī says:<\/p>\n\n\n\n<p>وقد قام الحر العاملي في وسائله بتجميع القرائن على ذلك أي صحة جميع ما في الكتب الأربعة فكانت ٢٢ قرينة<\/p>\n\n\n\n<p><strong>“<\/strong><strong>In his <em>Wasā’il<\/em>, al-Ĥurr al-`Āmilī has gathered the evidences indicating that—meaning, the authenticity of whatever is in the Four Books—and they are (a total of) twenty two evidences.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Durūs Tamhīdiyya fī al-Qawā`id al-Rijāliyya<\/em>, of Muĥammad Bāqir al-Īrawānī, page 49 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>As a matter of fact, he did not just stop at simply viewing other works of narrations to be entirely correct, but he also believed that his own compiled work, <em>Wasā’il al-<u>Sh<\/u>ī`a<\/em>, contained only authentic and correct narrations.<\/p>\n\n\n\n<p>al-Ghurayfī writes while mentioning how the <em>A<u>kh<\/u>bārīs<\/em> have argued against the categorization:<\/p>\n\n\n\n<p>استدل عليه الشيخ محمد بن الحسن الحر باثنين وعشرين وجها في الفائدة التاسعة التي عقدها لاثبات صحة أحاديث جميع الكتب التي جمع منها كتابه وسائل الشيعة وحكم بوجوب العمل بها أجمع<\/p>\n\n\n\n<p><strong>“<\/strong><strong><em><u>Sh<\/u><\/em><\/strong><strong><em>ay<u>kh<\/u><\/em><\/strong><strong> Muĥammad ibn al-Ĥasan al-Ĥurr deduced twenty two points, under the eighth useful lesson, for establishing the authenticity of the narrations found in all the books, that he collected in his book <em>Wasā’il al-<u>Sh<\/u>ī`a<\/em>, and he (also) ruled the obligation of practicing upon all of them.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Qawā`id al-Ĥadī<u>th<\/u><\/em>, of al-Sayyid Muĥyī al-Dīn al-Ghurayfī, page 17 [Najaf]<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><em>Uşūlīs<\/em> Who Counted the Four Books as Completely Authentic<\/h2>\n\n\n\n<p>Additionally, there have also been notable scholars from the <em>Uşūlī<\/em> group who believed that all the narrations found in the Four Books, and particularly <em>al-Kāfī<\/em>, are authentic and correct.<\/p>\n\n\n\n<p>This is why <em>Āyat Allāh<\/em> Bāqir al-Īrawānī is affected to state after mentioning the <em>A<u>kh<\/u>bārī<\/em> view on narrations:<\/p>\n\n\n\n<p>ولعل هذا الرأي هو المعروف بين الاخباريين بل ولربما يظهر اختياره من بعض الاصوليين<\/p>\n\n\n\n<p><strong>“This is perhaps the opinion which is known among the <em>A<u>kh<\/u>bārīs<\/em>, and it sometimes appears to be chosen by a few <em>Usūlīs<\/em> as well.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Durūs Tamhīdiyya fī al-Qawā`id al-Rijāliyya<\/em>, of Muĥammad Bāqir al-Īrawānī, page 100 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>Among contemporaries, are the late Grand <em>Āyat Allāh<\/em> al-Sayyid Muĥammad Şādiq al-Şadr (d. 1419), after whom the Sadr City suburb of Baghdad is named, and the renowned scholar and propagandist, author of <em>al-Murāja`āt<\/em>, <em>Āyat Allāh<\/em> al-Sayyid `Abd al-Ĥusayn al-Mūsawī (d. 1377).<\/p>\n\n\n\n<p>`Abd al-Ĥusayn al-Mūsawī writes while representing the <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> sect in his alleged dialogue with one of the Grand <em>Imāms<\/em> of al-Azhar, Salīm al-Bishrī (d. 1335):<\/p>\n\n\n\n<p>نبغ من أصحاب الصادق جم غفير وعدد كثير كانوا أئمة هدى ومصابيح دجى وبحار علم ونجوم هداية والذين دونت أسماؤهم وأحوالهم في كتب التراجم منهم أربعة آلاف رجل من العراق والحجاز وفارس وسوريا وهم أولو مصنفات مشهورة لدى علماء الإمامية ومن جملتها الأصول الأربعة مئة وهي كما ذكرناه سابقا أربع مئة مصنف لأربع مئة مصنف كتبت من فتاوى الصادق عليه السلام على عهده فكان عليها مدار العلم والعمل من بعده حتى لخصها جماعة من أعلام الأمة وسفراء الأئمة في كتب خاصة تسهيلا للطالب وتقريبا على المتناول وأحسن ما جمع منها الكتب الأربعة التي هي مرجع الإمامية في أصولهم وفروعهم من الصدر الأول إلى هذا الزمان وهي الكافي والتهذيب والاستبصار ومن لا يحضره الفقيه وهي متواترة ومضامينها مقطوع بصحتها والكافي أقدمها وأعظمها وأحسنها وأتقنها<\/p>\n\n\n\n<p><strong>“<\/strong><strong>A great portion and large number from the companions of al-Şādiq (as) achieved ultimate wisdom. They became leaders [<em>imāms<\/em>] of right path, lanterns in darkness, oceans of knowledge, and stars of guidance. Among those, who have their names and conditions recorded in biographical texts, are four thousand men from Iraq, the Ĥijāz, Persia, and Syria. They are authors of famous works, which include the four hundred <em>Uşūls<\/em> of the <em>Imāmīs<\/em>.<\/strong><\/p>\n\n\n\n<p><strong>These (<em>Uşūls<\/em>)—as we mentioned earlier—are four hundred compilations authored by four hundred authors, which were written during the time of al-Şādiq (as) and contained his verdicts. They were the axis of knowledge and practice after him, to such an extent that a group of eminent scholars of this nation and ambassadors of the <em>Imāms<\/em> rendered them into books as a facilitation and summarization for the seeker and deriver of knowledge.<\/strong><\/p>\n\n\n\n<p><strong>The best of what was compiled from the (<em>Uşūls<\/em>) are the Four Books, which are sources for the <em>Imāmīs<\/em> in referring to their roots and branches of religion, from their earliest period to this era.&nbsp; These are: <em>al-Kāfī<\/em>, <em>al-Ta<u>hd<\/u>hīb<\/em>, <em>al-Istibşār<\/em> and <em>Man lā Yaĥđuruh al-Faqīh<\/em>. They are transmitted consecutively and their <u>contents are undoubtedly authentic<\/u>, and <em>al-Kāfī<\/em> is the oldest, the greatest, the best and the most accurate among them.<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Murāja`āt<\/em>, of `Abd al-Ĥusayn al-Mūsawī (d. 1377), page 419 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>On the other hand, Grand <em>Āyat Allāh<\/em> Muĥammad Şādiq al-Şadr even went to the extent of explicitly stating in his book entitled <em>al-<u>Sh<\/u>ī`a<\/em>:<\/p>\n\n\n\n<p>أن الشيعة وإن كانت مجمعة على اعتبار الكتب الأربعة وقائلة بصحة كل ما فيها من روايات غير أنها لا تطلق عليها اسم الصحاح كما فعل ذلك إخوانهم أهل السنة<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The <em><u>Sh<\/u>ī`a<\/em>, even though they are unanimous upon the reliability of the Four Books and believe in the authenticity of all the narrations in them, do not name them<em> ‘<\/em><em>Şiĥāĥ<\/em><em>’<\/em> as their <em>Ahl al-Sunna<\/em> brothers did.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-<u>Sh<\/u>ī`a<\/em>, of Muĥammad Şādiq al-Şadr (d. 1419), page 127 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>And last but not least, a scholar before these two individuals who also held that all the narrations in <em>al-Kāfī<\/em> are correct, was one of the renowned <em><u>Sh<\/u>ī`ī<\/em> jurisprudents of his time, Grand <em>Āyat Allāh<\/em> al-Mīrzā Muĥammad Ĥusayn al-Nā’īnī (d. 1355). His belief in the correctness of the narrations in <em>al-Kāfī<\/em> reached such a degree that he declared checking their chains of transmission to be a waste of time.<\/p>\n\n\n\n<p>His student, Grand <em>Āyat Allāh<\/em> al-Sayyid Abū al-Qāsim al-Khū’ī (d. 1412) writes:<\/p>\n\n\n\n<p>وقد ذكر غير واحد من الاعلام أن روايات الكافي كلها صحيحة ولا مجال لرمي شئ منها بضعف سندها وسمعت شيخنا الأستاذ الشيخ محمد حسين النائيني قدس سره في مجلس بحثه يقول إن المناقشة في إسناد روايات الكافي حرفة العاجز<\/p>\n\n\n\n<p><strong>“<\/strong><strong><u>More than one of the eminent scholars have mentioned that all the narrations of <em>al-Kāfī<\/em> are <em>şaĥīĥ<\/em><\/u><\/strong><strong>, and there is no room for putting away anything from it due to its weak chain of transmission. I heard our master and teacher <em><u>Sh<\/u>ay<u>kh<\/u><\/em> Muĥammad Ĥusayn al-Nā’īnī—may Allāh sanctify his secret—say in one of his gatherings of discussion: ‘Verily, arguing about the chains of transmission of the narrations in <em>al-Kāfī<\/em> is the vocation of an incompetent!’”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mu`jam Rijāl al-Ĥadī<u>th<\/u> wa Tafşīl Ţabaqāt al-Ruwāt<\/em>, of Abū al-Qāsim al-Khū’ī (d. 1412), volume 1, page 81 [Qum]<\/li>\n<\/ul>\n\n\n\n<p>It becomes crystal clear from all the quotes cited above that a prominent amount of <em><u>Sh<\/u>ī`ī<\/em> scholars consider all the narrations in the Four Books authentic and <em>şaĥīĥ<\/em>. Specially the narrations found in the most authoritative of the four, <em>al-Kāfī<\/em>.<\/p>\n\n\n\n<p>Yet the Answering-Ansar team chose to deceptively say:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td>Quoting Answering-Ansar:<\/td><\/tr><tr><td>Similarly none amongst the Shia Muhaditheen and jurists testified to any specific Shia book containing hadiths that were all acceptable and Sahih.<a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/tahreef_alquran_4.gif\" rel=\"noreferrer noopener external nofollow\"><\/a><strong><\/strong><\/td><\/tr><tr><td><em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">Who believes the Quran has been a victim of Tahreef?<\/a><\/em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">, page 4<\/a><\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\">al-Qummī (d. 307) and his <em>Tafsīr<\/em><\/h2>\n\n\n\n<p>A celebrated <em><u>Sh<\/u>ī`ī<\/em> scholar of this era, <em>Āyat Allāh<\/em> al-Sayyid `Alī al-Shahrastānī, reveals in his book studying the recording of narrations:<\/p>\n\n\n\n<p><strong>“<\/strong><strong>`Ali ibn Ibrahim al-Qummiy, the compiler of the famous book of Tafsir that carries his name, <u>has confirmed the authenticity of the Hadiths that he recorded in his book<\/u> by bearing out that these Hadiths have been reported by trustworthy narrators from the Holy Imams.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man` Tadwīn al-Ĥadī<u>th<\/u> Asbāb wa Natā’ij<\/em>, of al-Sayyid `Alī al-Shahrastānī, page 546 [Qum]<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>The Prohibition of Recording the Hadith: Causes and Effects (English)<\/em>, of Sayyid Ali al-Shahristaniy, page 510 [Qum]<\/li>\n<\/ul>\n\n\n\n<p>As it is evident, `Alī ibn Ibrāhīm al-Qummī, who was a major scholar and teacher of al-Kulaynī, also confirmed that the narrations in his Commentary of the Holy Qur’ān are authentic. This, consequently, means that he himself also believed that the narrations in his work are authentic.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">al-Ĥillī (d. 726), al-Ĥasan al-`Āmilī (d. 1011) and Compilation of Authentic Narrations<\/h2>\n\n\n\n<p>Ibn Muţahhar al-Ĥillī, a major <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholar who is recognized as a reformer of his era among them, even compiled works of narrations in which he collected only authentic narrations. One in which he collected only rigorously authentic [<em>şaĥīĥ<\/em>] and fairly authentic [<em>ĥasan<\/em>] narrations, and another in which he collected only <em>şaĥīĥ<\/em> narrations.<\/p>\n\n\n\n<p>According to his own work <em><u>Kh<\/u>ulāsat al-Aqwāl<\/em>, he named these two compilations:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Durr wa al-Marjān fī al-Aĥādī<u>th<\/u> al-Şiĥāĥ wa al-Ĥisān<\/em> [“Pearls and Corals: <em>Şaĥīĥ<\/em> and <em>Ĥasan<\/em> Narrations”]<\/li>\n<\/ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Nahj al-Wađđāĥ fī al-Aĥādī<u>th<\/u> al-Şiĥāĥ<\/em> [“The Articulate Method: <em>Şaĥīĥ<\/em> Narrations”]<\/li>\n<\/ul>\n\n\n\n<p>These compilations of narrations are unanimously counted as al-Ĥillī’s books and as it is obvious from the titles, al-Ĥillī believed all the narrations in it are sound and acceptable.<\/p>\n\n\n\n<p>The compilations of al-Ĥillī influenced another famous <em><u>Sh<\/u>ī`ī<\/em> scholar, al-Ĥasan ibn Zayn al-Dīn al-`Āmilī, and lead him to also author a compilation of narrations from the Four Books that were authentic and acceptable. He titled this work <em>Muntaqá al-Jumān fī al-Aĥādī<u>th<\/u> al-Şiĥāĥ wa al-Ĥisān<\/em> [“Selected Pearls: <em>Şaĥīĥ<\/em> and <em>Ĥasan<\/em> Narrations”]<\/p>\n\n\n\n<p><em>Āyat Allāh<\/em> Āqā Buzurg al-Ţihrānī (d. 1389) writes about this when discussing the first work of al-Ĥillī in his biographical lexicon of <em><u>Sh<\/u>ī`ī<\/em> texts, <em>al-<u>Dh<\/u>arī`a<\/em>:<\/p>\n\n\n\n<p>وقد اقتفى اثره سميه الشيخ حسن بن زين الدين الشهيد صاحب المعالم المتوفى ١٠١١ وصنف كتابه منتقى الجمان في الأحاديث الصحاح والحسان وسيأتي في النون كتاب آخر للعلامة الحلي في هذا الموضوع اسمه النهج الوضاح في الأحاديث الصحاح<\/p>\n\n\n\n<p><strong>“The namesake <em><u>Sh<\/u>ay<u>kh<\/u><\/em> Ĥasan ibn Zayn al-Dīn al-<u>Sh<\/u>ahīd (d. 1011), the author of al-Ma`ālim, <\/strong><strong>has followed his [i.e. al-Ĥillī’s] track and authored his book <em>Muntaqá al-Jumān fī<\/em> <em>al-Aĥādī<u>th<\/u> al-Şiĥāĥ wa al-Ĥisān<\/em>.<\/strong><\/p>\n\n\n\n<p><strong>Soon, another book of al-`Allāma al-Ĥillī on this subject will be mentioned under the letter <em>‘<\/em><em>nūn<\/em>.<em>’<\/em> Its title is: <em>al-Nahj al-Wađđāĥ fī al-Aĥādī<u>th<\/u> al-Şiĥāĥ<\/em>.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-<u>Dh<\/u>arī`a ilá Taşānīf al-<u>Sh<\/u>ī`a<\/em>, of Āqā Buzurg al-Ţihrānī (d. 1389), volume 8, page 87 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>This work is retained by contemporary <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars, unlike the two works of al-Ĥillī, and used by them as an authoritative work of reference.<\/p>\n\n\n\n<p>Furthermore, not only did Ĥasan claim that the narrations in his compilation are authentic and acceptable; he also believed that the entire contents of the Four Books are authentic.<\/p>\n\n\n\n<p>al-Shahrastānī states:<\/p>\n\n\n\n<p><strong>“<\/strong><strong>Shaykh Hasan, in his books entitled Muntaqa al-Juman and al-Ma`alim, has stated that the Hadiths mentioned in the four most reliable Shi`ite reference books of Hadith (<em>al-Kutub al-Arba`ah<\/em>) and their likes are substantiated by proofs as they were, without any distortion, quoted from the al-Usul as well as the fundamental books the authenticity of which have been unanimously confirmed by the scholars.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man` Tadwīn al-Ĥadī<u>th<\/u> Asbāb wa Natā’ij<\/em>, of al-Sayyid `Alī al-Shahrastānī, page 545-546 [Qum]<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>The Prohibition of Recording the Hadith: Causes and Effects (English)<\/em>, of Sayyid Ali al-Shahristaniy, page 509-510 [Qum]<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">al-Kaf`amī (d. 905) and <em>al-Mişbāĥ<\/em><\/h2>\n\n\n\n<p>Texts on narrations and commentaries aside, even compilations of supplications have been confirmed to be entirely authentic by some <em><u>Sh<\/u>ī`ī<\/em> scholars. Taqī al-Dīn al-Kaf`amī, a well-known and respected <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholar, has compiled a book of narrated supplications that is famously known as <em>al-Mişbāĥ<\/em>.<\/p>\n\n\n\n<p><em>Āyat Allāh<\/em> al-Sayyid Ja`far Murtađá al-`Āmilī writes about it while citing it as a proof for his arguments:<\/p>\n\n\n\n<p>ما ذكره الشيخ الكفعمي المتوفي سنة ٩٠٥ ه‍ ق في كتابه المصباح الذي جمعه من حوالي مئتين وأربعين كتابا وقال إنه جمعه من كتب معتمد على صحتها مأمور بالتمسك بوثقى عروتها ولا يغيرها كر العصرين ولا مر الملوين كتب كمثل الشمس يكتب ضوؤها ومحلها فوق الرفيع الأرفع<\/p>\n\n\n\n<p><strong>“10: W<\/strong><strong>hat is mentioned by <em><u>Sh<\/u>ay<u>kh<\/u><\/em><\/strong><strong> al-Kaf`ami (d. 905) in his book titled <em>al-Mişbāĥ<\/em> which he compiled from about two hundred and forty books. He said that he compiled it ‘from books the authenticity of which is reliable and upholding them mandated, and this cannot be altered by the evil efforts of time or by the endeavour of those with twisted minds. Books, like the sun, whose light—is written above the most high of the height.’”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Ma’sāt al-Zahrā’ <u>Sh<\/u>ubhāt wa Rudūd<\/em>, of al-Sayyid Ja`far Murtađá al-`Āmilī, volume 2, page 44 [Beirut]<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><em>Şaĥīĥ al-Kāfī<\/em><\/h2>\n\n\n\n<p>The Answering-Ansar team has said:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td>Quoting Answering-Ansar:<\/td><\/tr><tr><td>No Shia author ever claimed that all of the hadiths compiled in his book were correct and Sahih.<a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/tahreef_alquran_4.gif\" rel=\"noreferrer noopener external nofollow\"><\/a><strong><\/strong><\/td><\/tr><tr><td><em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">Who believes the Quran has been a victim of Tahreef?<\/a><\/em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">, page 4<\/a><\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>Unfortunately, truth is at odds with Answering-Ansar today.<\/p>\n\n\n\n<p>Ibn Bābawayh, al-Ĥurr al-`Āmilī and other scholars’ claim that all the narrations compiled in their works are correct and <em>şaĥīĥ<\/em> is already showed above. But to cap it all off, let us share one last work of a recognized <em><u>Sh<\/u>ī`ī<\/em> scholar and author who “claimed that all of the hadiths compiled in his book were correct and Sahih.”<\/p>\n\n\n\n<p>The contemporary <em><u>Sh<\/u>ī`ī<\/em> scholar Muĥammad Bāqir al-Bahbūdī has compiled an entire work entitled <em>Şaĥīĥ al-Kāfī<\/em>. al-Bahbūdī has claimed to have collected <strong>only<\/strong> rigorously authentic [<em>şaĥīĥ<\/em>] narrations of <em>al-Kāfī<\/em> in this compilation, and accordingly, he has named it “<em>Şaĥīĥ<\/em>.”<\/p>\n\n\n\n<p>To begin with, it should be known that al-Bahbūdī is not a typical graduate of some <em><u>Sh<\/u>ī`ī<\/em> institution, rather he is a reputed and praised scholar of today.<\/p>\n\n\n\n<p>Grand <em>Āyat Allāh<\/em> al-Sayyid Shihāb al-Dīn al-Mar`ashī (d. 1411) attributes the following words to al-Bahbūdī in his introduction to a work revised and edited by the latter, <em>al-Şirāţ al-Mustaqīm<\/em> of `Alī ibn Yūnus al-Bayāđī (d. 877):<\/p>\n\n\n\n<p>وقام العالم الفاضل الموفق لإحياء الزبر الدينية الاقا محمد باقر البهبودي شكر الله مساعيه ووفر معاليه بتصحيحه وتنقيحه بالمراجعة إلى النسخ العديدة<\/p>\n\n\n\n<p><strong>“<\/strong><strong>The brilliant scholar, who was victorious in reviving the religious scriptures, Master Muĥammad Bāqir al-Bahbūdī—may Allāh appreciate his efforts and increase his loftiness—came forth with its correction and critical revision by referring to several manuscripts.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Şirāţ al-Mustaqīm ilá Mustaĥiqqī al-Taqdīm<\/em>, of `Alī ibn Yūnus al-Bayāđī (d. 877), volume 1, page 4 [Tehran]<\/li>\n<\/ul>\n\n\n\n<p>This al-Bahbūdī is the one mentioned by the <em>Āyat Allāh<\/em> al-Sayyid Murtađá al-`Askarī (d. 1428) in the following words:<\/p>\n\n\n\n<p>وقد ألف أحد الباحثين في عصرنا صحيح الكافي اعتبر من مجموع ١٦١٢١ حديثا من أحاديث الكافي ٣٣٢٨ حديثا صحيحا وترك ١١٦٩٣ حديثا منها لم يراها حسب اجتهاده صحيحة<\/p>\n\n\n\n<p><strong>“<\/strong><strong>One of the researchers of our time has compiled <em>‘<\/em><em>Şaĥīĥ al-Kāfī<\/em>.<em>’<\/em> He counted 3328 narrations from the 16121 narrations of <em>al-Kāfī<\/em> as <em>şāĥīĥ<\/em>, and left 11693 narrations that he did not view to be <em>şaĥīĥ<\/em> according to his judgement.”<\/strong><strong><\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Ma`ālim al-Madrasatayn<\/em>, of al-Sayyid Murtađá al-`Askarī (d. 1428), volume 3, page 282 [Beirut]<\/li>\n<\/ul>\n\n\n\n<p>The existence of this compilation not only exposes Answering-Ansar’s lie, but also shows the dubiousness of the argument reiterated by the <em><u>Sh<\/u>ī`ī<\/em> propagandists of today:<\/p>\n\n\n\n<p><strong>“According to us, only the Qur’ān is <em>şaĥīĥ<\/em>. We do not call any book <em>‘<\/em><em>şaĥīĥ<\/em><em>’<\/em> other than the Qur’ān as the <em>Sunnīs<\/em> do with <em>Şaĥīĥ al-Bu<u>kh<\/u>ārī<\/em>.”<\/strong><\/p>\n\n\n\n<p>Any unbiased individual can see that <em>Şaĥīĥ al-Kāfī<\/em> is not very different from <em>Şaĥīĥ al-Bukhārī<\/em>. The authors both compiled their respected works with the intention of solely collecting narrations that were rigorously authentic [<em>şaĥīĥ<\/em>] according to them. The only difference is that what <em><u>Sh<\/u>ī`ī<\/em> scholars are trying to do today, was done centuries ago by <em>Sunnīs<\/em>.<\/p>\n\n\n\n<p>Neither do <em>Sunnīs<\/em> believe that <em>Şaĥīĥ al-Bukhārī<\/em> is <em>şaĥīĥ<\/em> as the Qur’ān is, nor do they intent to raise the rank of <em>Şaĥīĥ al-Bu<u>kh<\/u>ārī<\/em> as high as the Qur’ān. Rather, what they mean by calling it “<em>Şaĥīĥ<\/em>” is exactly what al-Bahbūdī meant when calling his compilation “<em>Şaĥīĥ<\/em>.” So if the <em><u>Sh<\/u>ī`īs<\/em> are unable to unanimously agree upon a certain criterion of judging narrations, are the <em>Ahl al-Sunna wa al-Jamā`a<\/em> to be accused of elevating a book to the position of the Holy Qur’ān for simply agreeing upon the authenticity of the narrations in a book called “<em>Şaĥīĥ<\/em>”?<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion – Facts that Prove the Lies of Answering-Ansar<\/h2>\n\n\n\n<p>In conclusion, the abovementioned study of both early and contemporary <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> texts reveals the following facts about their scholars:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Abū Ja`far al-Kulaynī believed and confirmed that all the narrations in his compilation are correct.<\/li>\n<\/ol>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Ibn Bābawayh al-Qummī believed and confirmed that all the narrations in his compilation are correct.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Abū Ja`far al-Ţūsī confirmed in his works such as <em>al-`Udda<\/em>, as mentioned by al-Baĥrānī, that all the narrations in his two compilations are authentic and acceptable.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Many prominent and eminent <em><u>Sh<\/u>ī`ī<\/em> scholars claim that all the narrations in the Four Books, and particularly <em>al-Kāfī<\/em>, are <em>şaĥīĥ<\/em>.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>al-Ĥurr al-`Āmilī, a scholar of narrations [<em>muĥaddi<u>th<\/u><\/em>] and jurist [<em>faqīh<\/em>], claimed that all of the narrations compiled in his book are <em>şaĥīĥ<\/em> and thus it is obligatory to practice upon them.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>`Alī ibn Ibrāhīm al-Qummī confirmed the authenticity of all the narrations in his <em>Tafsīr<\/em>.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Ibn Muţahhar al-Ĥillī compiled two works in which he claimed to have collected only authentic narrations. One containing only <em>şaĥīĥ<\/em> narrations and another containing both <em>şaĥīĥ<\/em> and <em>ĥasan<\/em>.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>al-Ĥasan al-`Āmilī, the author of al-Ma`ālim, followed al-Ĥillī and also compiled a work in which he collected only authentic and acceptable narrations.<\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Taqī al-Dīn al-Kaf`amī testified to the authenticity of the entire contents of his book.<\/li>\n<\/ul>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Muĥammad Bāqir al-Bahbūdī claimed that all the narrations in his book <em>Şaĥīĥ al-Kāfī<\/em> are <em>şaĥīĥ<\/em>.<\/li>\n<\/ol>\n\n\n\n<p>In light of the facts above, we have the following statement of the Answering-Ansar team:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td>Quoting Answering-Ansar:<\/td><\/tr><tr><td><strong>First Point: No one amongst the Shia ulema claimed his hadith book as 100 % correct<\/strong><br>Those people who after reading some traditions in the hadith books written by Shia Ulema criticize Shia of Ali [as] are fact fanatics that have abandoned all aspects of justice since no Shia author ever claimed that all of the hadiths compiled in his book were correct and Sahih. Similarly none amongst the Shia Muhaditheen and jurists testified to any specific Shia book containing hadiths that were all acceptable and Sahih.<a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.sunnidefense.com\/exp\/sites\/default\/files\/tahreef_alquran_4.gif\" rel=\"noreferrer noopener external nofollow\"><\/a><strong><\/strong><\/td><\/tr><tr><td><em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">Who believes the Quran has been a victim of Tahreef?<\/a><\/em><a target=\"_blank\" href=\"https:\/\/web.archive.org\/web\/20120205035630\/http:\/\/www.answering-ansar.org\/answers\/tahreef\/en\/chap2.php\" rel=\"noreferrer noopener external nofollow\">, page 4<\/a><\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>Now, it is up to the readers to decide whether what Answering-Ansar has said is a lie or not.<\/p>\n\n\n\n<p>Readers should also know that this lengthy discussion could have been successfully dealt by proving the mere existence of <em>Şaĥīĥ al-Kāfī<\/em>. After all, al-Bahbūdī is a <em><u>Sh<\/u>ī`ī<\/em> scholar and author who compiled a book declaring that all the narrations in it are <em>şaĥīĥ<\/em>, while Answering-Ansar blatantly lies by saying “no one among the Shia ulema” did such a thing.<\/p>\n\n\n\n<p>However, several <em><u>Sh<\/u>ī`ī I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> texts have been cited for readers to realize that this not a simple a matter related to a single text, rather a prominent amount of <em><u>Sh<\/u>ī`ī<\/em> scholars have been believing and declaring the authenticity of all the narrations in particular texts, to the extent that a group of major <em>I<u>th<\/u>nā’ `A<u>sh<\/u>arī<\/em> scholars even denied the late categorization of narrations to uphold their belief that all the narrations in the “Four Books” are <em>şaĥīĥ<\/em>.<\/p>\n\n\n\n<p>Thus, it was not just shown that Answering-Ansar has simply lied because there are contemporary <em><u>Sh<\/u>ī`ī<\/em> scholars who have testified to the authenticity of the narrations in their books, but that the Answering-Ansar team is deceptively trying to keep people in the dark about how many <em><u>Sh<\/u>ī`ī<\/em> scholars have been viewing their texts throughout history, by lying.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">A Few Points to Note<\/h2>\n\n\n\n<p>Lastly, a few points about the quote of the Answering-Ansar team should also be noted here:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>They have mentioned a <em><u>Sh<\/u>ī`ī<\/em> scholar by the name of:<br>&nbsp;<\/li>\n<\/ul>\n\n\n\n<p>محمد جواد معتية<\/p>\n\n\n\n<p>“Muhammad Jawwad <strong>Ma`tiya<\/strong>.”<\/p>\n\n\n\n<p>Poor plagiarism. The late scholar’s actual name is:<\/p>\n\n\n\n<p>محمد جواد مغنية<\/p>\n\n\n\n<p>Muĥammad Jawād <strong>Mu<u>gh<\/u>niyya<\/strong>.<\/p>\n\n\n\n<p>Had the Answering-Ansar team known the scholar they are copying information about, they would not have confused the diacritical points and made this ignorant mistake.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>One of the categories of <em><u>Sh<\/u>ī`ī<\/em> narrations is mentioned as “Mawthiq,” whereas the actual word is “<em>muwa<u>thth<\/u>aq<\/em>” [authenticated]. <em>Mawthiq<\/em> refers to a covenant or a contract, not to mention that it is morphologically incorrect to use it for a narration. This clearly shows how much knowledge of the Arabic language and their own narrations is possessed by the pinnacles behind Answering-Ansar.<\/li>\n<\/ul>\n\n\n\n<p>Our advice to the Answering-Ansar team is that they should pick up a few Arabic text books for beginners before they discuss the sensitive issue of distortion of the Holy Qur’ān, a book of eloquent Arabic.<\/p>\n\n\n\n<p>It is only Allah (swt) who gives success, and blessings and peace be upon the Seal of the Prophets, his Pure Progeny and his Noble Companions<\/p>\n\n\n\n<p class=\"has-text-align-center\">♦&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ♦&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ♦<\/p>\n\n\n\n<p>_______________________________________________________________<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Works Cited<\/h2>\n\n\n\n<p><em><u>Sh<\/u>ī`ī<\/em> texts:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Kāfī<\/em><\/li>\n<\/ol>\n\n\n\n<p>Abu Ja`far al-Kulayni (d. 329)<\/p>\n\n\n\n<p>Dar al-Kutub al-Islamiyya<\/p>\n\n\n\n<p>Tehran, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Riyāđ al-Masā’il fī Bayān Aĥkām al-Shar` wa al-Dalā’il<\/em><\/li>\n<\/ul>\n\n\n\n<p>al-Sayyid `Alī al-Ţabāţabā’ī (d. 1231)<\/p>\n\n\n\n<p>Muassasat al-Nashr al-Islami<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mu`jam al-Maĥāsin wa al-Masāmī<\/em><\/li>\n<\/ul>\n\n\n\n<p>Abū Ţālib al-Tabrīzī<\/p>\n\n\n\n<p>Muassasat al-Nashr al-Islami<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em><u>Kh<\/u><\/em><em>ātimat Tafşīl Wasā’il al-<u>Sh<\/u>ī`a ilá Taĥşīl Masā’il al-<u>Sh<\/u>arī`a<\/em><\/li>\n<\/ul>\n\n\n\n<p>al-Ĥurr al-`Āmilī (d. 1104)<\/p>\n\n\n\n<p>Muassasat Al al-Bayt li Ihya al-Turath<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mafātīĥ al-Uşūl<\/em><\/li>\n<\/ul>\n\n\n\n<p>al-Sayyid Muĥammad al-Ţabāţabā’ī (d. 1242)<\/p>\n\n\n\n<p>Offset Lithograph<\/p>\n\n\n\n<p>Tehran, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Dirāsāt fī al-Makāsib al-Muĥarrama<\/em><\/li>\n<\/ul>\n\n\n\n<p>Ĥusayn `Alī al-Muntažarī<\/p>\n\n\n\n<p>Intisharat Siyayi<\/p>\n\n\n\n<p>Tehran, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man lā Yaĥđuruh al-Faqīh<\/em><\/li>\n<\/ul>\n\n\n\n<p>Ibn Bābawayh al-Qummī (d. 381)<\/p>\n\n\n\n<p>Muassasat al-Nashr al-Islami<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man lā Yaĥđuruh al-Faqīh<\/em><\/li>\n<\/ul>\n\n\n\n<p>Ibn Bābawayh al-Qummī (d. 381)<\/p>\n\n\n\n<p>al-Matba`at al-Ja`fariyya<\/p>\n\n\n\n<p>Lucknow, India<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Uşūl al-Ĥadī<u>th<\/u><\/em><\/li>\n<\/ul>\n\n\n\n<p>`Abd al-Hādī al-Fađlī<\/p>\n\n\n\n<p>Muassasat Umm al-Qura<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>Qā`ida lā Đarar wa lā Đirār<\/em><\/li>\n<\/ol>\n\n\n\n<p>`Alī al-Sīstānī<\/p>\n\n\n\n<p>Matba`at Mahr<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>Ma<u>sh<\/u>riq al-<u>Sh<\/u>amsayn wa Iksīr al-Sa`ādatayn<\/em><\/li>\n<\/ol>\n\n\n\n<p>Bahā’ al-Dīn al-`Āmilī (d. 1034)<\/p>\n\n\n\n<p>Maktabat Basirati<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Wāfī<\/em><\/li>\n<\/ol>\n\n\n\n<p>al-Fayđ al-Kāshānī (d. 1091)<\/p>\n\n\n\n<p>Maktabat al-Imam Amir al-Mu’minin Ali al-Amma<\/p>\n\n\n\n<p>Esfahan, Iran<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Ĥadā’iq al-Nāđira fī Aĥkām al-`Itrat al-Ţāhira<\/em><\/li>\n<\/ol>\n\n\n\n<p>Yūsuf al-Baĥrānī (d. 1186)<\/p>\n\n\n\n<p>Muassasat al-Nashr al-Islami<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Ĥadā’iq al-Nāđira fī Aĥkām al-`Itrat al-Ţāhira<\/em><\/li>\n<\/ol>\n\n\n\n<p>Yūsuf al-Baĥrānī (d. 1186)<\/p>\n\n\n\n<p>1315 Print<\/p>\n\n\n\n<p>Iran<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>Qawā`id al-Ĥadī<u>th<\/u><\/em><\/li>\n<\/ol>\n\n\n\n<p>al-Sayyid Muĥyī al-Dīn al-Ghurayfī<\/p>\n\n\n\n<p>Matba`at al-Adab<\/p>\n\n\n\n<p>Najaf, Iraq<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>Tal<u>kh<\/u>īs al-<u>Sh<\/u>āfī<\/em><\/li>\n<\/ol>\n\n\n\n<p>Abū Ja`far al-Ţūsī (d. 460)<\/p>\n\n\n\n<p>Matba`at al-Adab<\/p>\n\n\n\n<p>Najaf, Iraq<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>al-Tajdīd wa al-Ijtihād fī al-Islām<\/em><\/li>\n<\/ol>\n\n\n\n<p>Murtađá Muţahharī (d. 1407)<\/p>\n\n\n\n<p>Dar al-Adwa<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>A`yān al-<u>Sh<\/u>ī`a<\/em><\/li>\n<\/ol>\n\n\n\n<p>al-Sayyid Muĥsin al-Amīn (d. 1371)<\/p>\n\n\n\n<p>Dar al-Ta`aruf<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><em>Durūs Tamhīdiyya fī al-Qawā`id al-Rijāliyya<\/em><\/li>\n<\/ol>\n\n\n\n<p>Muĥammad Bāqir al-Īrawānī<\/p>\n\n\n\n<p>Dar al-Jawadayn<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Kuná wa al-Alqāb<\/em><\/li>\n<\/ul>\n\n\n\n<p>`Abbās al-`Qummī (d. 1359)<\/p>\n\n\n\n<p>Maktabat al-Sadr<\/p>\n\n\n\n<p>Tehran, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Murāja`āt<\/em><\/li>\n<\/ul>\n\n\n\n<p>`Abd al-Ĥusayn al-Mūsawī (d. 1377)<\/p>\n\n\n\n<p>al-Jam`iyyat al-Islamiyya<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-<u>Sh<\/u>ī`a<\/em><\/li>\n<\/ul>\n\n\n\n<p>Muĥammad Şādiq al-Şadr (d. 1419)<\/p>\n\n\n\n<p>Tehran, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Mu`jam Rijāl al-Ĥadī<u>th<\/u> wa Tafşīl Ţabaqāt al-Ruwāt<\/em><\/li>\n<\/ul>\n\n\n\n<p>Abū al-Qāsim al-Khū’ī (d. 1412)<\/p>\n\n\n\n<p>Markaz Nashr al-Thaqafat al-Islamiyya<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Man` Tadwīn al-Ĥadī<u>th<\/u> Asbāb wa Natā’ij<\/em><\/li>\n<\/ul>\n\n\n\n<p>al-Sayyid `Alī al-Shahrastānī<\/p>\n\n\n\n<p>Markaz al-Abhath al-Aqaidiyya<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>The Prohibition of Recording the Hadith: Causes and Effects (English)<\/em><\/li>\n<\/ul>\n\n\n\n<p>Sayyid Ali al-Shahristaniy<\/p>\n\n\n\n<p>Ansariyan Publications<\/p>\n\n\n\n<p>Qum, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-<u>Dh<\/u>arī`a ilá Taşānīf al-<u>Sh<\/u>ī`a<\/em><\/li>\n<\/ul>\n\n\n\n<p>Āqā Buzurg al-Ţihrānī (d. 1389)<\/p>\n\n\n\n<p>Dar al-Adwa<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Ma’sāt al-Zahrā’ <u>Sh<\/u>ubhāt wa Rudūd<\/em><\/li>\n<\/ul>\n\n\n\n<p>al-Sayyid Ja`far Murtađá al-`Āmilī<\/p>\n\n\n\n<p>Dar al-Sira<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>al-Şirāţ al-Mustaqīm ilá Mustaĥiqqī al-Taqdīm<\/em><\/li>\n<\/ul>\n\n\n\n<p>`Alī ibn Yūnus al-Bayāđī (d. 877)<\/p>\n\n\n\n<p>Matba`at al-Haydari<\/p>\n\n\n\n<p>Tehran, Iran<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><em>Ma`ālim al-Madrasatayn<\/em><\/li>\n<\/ul>\n\n\n\n<p>al-Sayyid Murtađá al-`Askarī (d. 1428)<\/p>\n\n\n\n<p>Muassasat al-Nu`man<\/p>\n\n\n\n<p>Beirut, Lebanon<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Home Published by SunniDefense © on July 29th, 2009 in Blatant Lies Answering-Ansar Article: Who believes the Quran has been a victim of Tahreef? (Revision: 1.0.0) Whenever someone raises a question about a narration promoting the belief in distortion of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2025\/01\/27\/11-shii-scholars-and-the-authenticity-of-their-texts-2\/\" title=\"11 &#8211; Shī`ī Scholars and the Authenticity of their Texts\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":4235,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[70,69,53],"class_list":{"0":"post-5039","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"tag-shia-books","9":"tag-shia-scholars","10":"tag-tahreef"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/5039","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=5039"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/5039\/revisions"}],"predecessor-version":[{"id":5052,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/5039\/revisions\/5052"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/4235"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=5039"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=5039"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=5039"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}