{"id":532,"date":"2013-07-14T07:42:09","date_gmt":"2013-07-14T07:42:09","guid":{"rendered":"http:\/\/twelvershia.net\/?p=532"},"modified":"2013-07-21T08:16:17","modified_gmt":"2013-07-21T08:16:17","slug":"response-to-ahl-nawasib-wal-jammah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/07\/14\/response-to-ahl-nawasib-wal-jammah\/","title":{"rendered":"Response to: Ahl Nawasib Wal-Jammah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=532\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on Revisitingthesalaf.org entitled: Ahl Nawasib Wal-Jammah, which was published on the 12<sup>th<\/sup> of July, 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/07\/ahl-nawasib-wal-jammah.html\" rel=\"nofollow external\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\"><em>Bismillah al-rahman al-raheem,<\/em><\/p>\n<p style=\"text-align: justify;\">Astonished and amazed is what I am at the efforts of the folks at Revisitingthesalaf.org. They have went through so much trouble writing this article, and gathering scans, and yet, come up with the most fragile arguments. It saddens me when I calculate the amount of time wasted on this article.<\/p>\n<p style=\"text-align: justify;\">In this article, RTS attempts to demonstrate that Ahlul Sunnah take our <em>deen<\/em> from the <em>nawasib<\/em> (those that hate Ahlulbayt). Together, we shall examine the affect that their narrations have had on the two groups, the Sunnis and the Shias.  First though, we examine RTS’ intro:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Even if one was to belong to any of these factions, it does not negate the fact that there is a possibility of them speaking the truth pertaining to a certain matter during their life. However, if they were to speak in favour of their ideology, in other words, having a bias view, we would need to consider whether their statement would be true or not. Consider the Kuffar who would refer to the Prophet (saw) as being, &#8216;Just and Truthful&#8217;, would their statement be rejected although they spoke the truth about the Prophet (saw)? Would a Muslim reject the fact that the Prophet (saw) is Just and Truthful? Clearly not! In contrary to this, if the Kuffar had accused the Prophet (saw) of having received satanic verses, would a sane Muslim believe it to be true? Clearly not! The so-called &#8216;Ahl ul Sunnah&#8217; have too adopted this latter approach.<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Indeed, this is a popular view among Sunni Hadith scholars. One can accept the narration of an innovator as long as it has nothing to do with his innovation. This, in reality, is the case with most of the narrations of the Nawasib, if not all.<\/p>\n<p style=\"text-align: justify;\">RTS then argues:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Consider the well known narration in which Imam Alee (a.s) was accused of drinking alcohol and thereafter leading prayer in an intoxicated state. Such a narration was considered to be reliable according to classical scholars such as Suyuti and even modern day scholars such as Albani. If we refer back to the original narration, we find a sub-narrator known as &#8216;Aboo Abdurrahman Sulami&#8217; also known as Abdullah ibn Hubayb ibn Rabea. According to &#8216;Tahdhib Al-Tahdhib&#8217; by ibn Hajar Asqalani. Vol.5, Pg. # 184, it is stated he was an Uthmani. We shall deal with the Uthmani faction later on in the article, but it is suffice to say that they were amongst those who cursed and opposed Imam Alee (a.s). Should such reports seriously be deemed reliable?<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Yes, it should be deemed reliable for multiple reasons.<\/p>\n<p style=\"text-align: justify;\">This is the narration that RTS is referring to. It seems as though RTS preferred to not provide the quote since it is clearly against his favour:<br \/>\nFrom Mustadrak Al-Hakim:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><strong>عن أبي عبد الرحمن السلمي ، عن علي ، رضي الله عنه قال : « دعانا رجل من الأنصار قبل أن تحرم الخمر فتقدم عبد الرحمن بن عوف وصلى بهم المغرب فقرأ : قل يا أيها الكافرون فالتبس عليه فيها » فنزلت : ( لا تقربوا الصلاة وأنتم سكارى<\/strong><\/p>\n<p style=\"text-align: justify;\">Rough translation: &#8220;From Abu Abdulrahman Al-Sulami from Ali bin Abi Talib: A man from the Ansar, before the prohibition of alcohol invited us, and we prayed behind Abdulrahman bin Awf the Maghrib prayer, so he prayed: O’ say ye disbelievers&#8230; and made mistakes. Then the verse of: Don’t approach prayers while being drunk, was revealed.&#8221;<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">First of all, there is nothing in the narration that implies ill-will towards Ali (ra), since the narrator clearly says that this was before the prohibition of alcohol, so Ali (ra) is not harmed by this narration.<\/p>\n<p style=\"text-align: justify;\">Secondly, if we assume that this is a condemnation against Ali (ra) then we have to assume that it is a greater condemnation towards Abdulrahman bin Awf (ra), and Abdulrahman, as anyone that is familiar with Islamic history is aware, was responsible for the caliphate of Uthman (ra) himself, so he is more of an Uthmani than Abu Abdulrahman Al-Sulami, who RTS is condemning.<\/p>\n<p style=\"text-align: justify;\">Thirdly, the very Qur’anic recitation of Ali (ra) that everyone reads today is the recitation of Abu Abdulrahman Al-Sulami, so if RTS does not want to accept his narration, then perhaps RTS should just look for an alternative Qur’an other than the one the Muslims read today.<\/p>\n<p style=\"text-align: justify;\">RTS continues by defining what a Nasibi is, and is usually correct, however, makes a major mistake when attributing this statement to Al-Thahabi:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8220;From Naasb, comes the term Nasibi and they are hypocrites, they have made the hate of Alee as their religion. This name was given to them because they have made the hate of Alee their aim of life and had enmity for him (may Allah be pleased with him).&#8221;<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Note: Al-Thahabi never said this. It is a comment from the editor as we can see clearly from the screenshot on the RTS website.<\/p>\n<p style=\"text-align: justify;\">RTS continues:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Now, we shall examine some of the narrators that are found in the books of Hadeeth within the so-called &#8216;Ahl ul Sunnah.&#8217;A point to note is that a Shi&#8217;ee will immediately criticize and reject narrations on the authority of such cursed individuals due to their belittlement of the Ahlulbayt (a.s). On the other hand, the &#8216;Ahl ul Sunnah&#8217; deem them to be reliable. One wonders how the so-called Sunni&#8217;s can maintain a consistent stance of love for the Ahlulbayt (a.s) and their enemies, given such a disposition.<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The list provided by RTS, even though it may be accurate, does not demonstrate the weight of the narrations of Nawasib upon Sunni Hadiths. In order to give readers a clearer picture, I’ve decided to include the number of narrations that each of these narrators have in the Saheehain (Sahih Bukhari &amp; Sahih Muslim) besides their name, as well as what they narrated.<\/p>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> Ibn Abi Dawood – <strong>None. <\/strong><br \/>\n<strong>2-<\/strong> Khaalid ibn Salama ibn Al-Aas – One narration in the chapter of Wudu’u (Saheeh Muslim), that the Prophet (salalahu alaihi wa salam) used to mention the name of Allah in all occasions.<br \/>\n<strong>3-<\/strong> Ibraheem ibn Ya`qoob – <strong>None.<\/strong><br \/>\n<strong>4-<\/strong> Maymoon ibn Mehran Al-Jezri – One narration in the chapter of Hunting (Saheeh Muslim), that the Prophet (salalahu alaihi wa salam) prohibited eating animals with fangs and birds that have talons.<br \/>\n<strong>5-<\/strong> Abdullah ibn Shaqiq Al-Aqeeli – He has multiple narrations in Saheeh Muslim, around eleven. The first is that the Prophet (salalahu alaihi wa salam) never saw Allah. The second is that the Prophet (salalahu alaihi wa salam) ordered the washing of the hands after waking up from sleep. The third is that the Prophet (salalahu alaihi wa salam) used to seek refuge through Allah from the grave, hellfire, and the <em>fitna<\/em> of Al-Dajjal. The fourth is that the Prophet (salalahu alaihi wa salam) used to combine some prayers. The fifth is that the Prophet (salalahu alaihi wa salam) used to pray the <em>duha<\/em> prayer whenever possible. The sixth is about the amount of <em>nawafil<\/em> prayers of the Prophet (salalahu alaihi wa salam). The seventh describes how he used to pray when he was sick. The eighth is that he (salalahu alaihi wa salam) used to push people to pray a single <em>raka’a<\/em> before morning prayers. The ninth describes how much he (salalahu alaihi wa salam) used to fast. The tenth narration shows the validity of the Muta’ah of Hajj (Which is against the view of `Uthman). The eleventh is the narration of Musa and the rock (which is also narrated by Hammam bin Al-Munabih). The twelfth is that the Prophet (salalahu alaihi wa salam) was sent amongst the best generation (the same chapter in Saheeh Muslim includes multiple narrations that support this). The thirteenth describes the soul of the Mu’min and how the angels lift it into the sky and the difference between it and the soul of the <em>kaffir<\/em>.<br \/>\n<strong>6-<\/strong> Ziyaad ibn Alaqah – He has multiple narrations in both Saheeh Al-Bukhari and Muslim. The first (in Al-Bukhari and Muslim) is the narration from Jabir that he was ordered by the Prophet (salalahu alaihi wa salam) to advise other Muslims. The second (in Al-Bukhari and Muslim), is the narration about the sun eclipse when Ibrahim the son of the Prophet (salalahu alaihi wa salam) died. The third, is that the Prophet’s (salalahu alaihi wa salam) feet used to increase in size due to excessive prayer. The fourth (from Saheeh Muslim) is that the Prophet (salalahu alaihi wa salam) used to pray while reciting Surat Qaaf. The fifth (from Saheeh Muslim), is that the Prophet (salalahu alaihi wa salam) used to kiss his wives in Ramadhan, while fasting, implying that it doesn’t break the fast. The sixth (from Saheeh Muslim), is that the Prophet (salalahu alaihi wa salam) prohibited breaking apart the <em>ummah<\/em> and causing division, and even suggested killing those who cause division (the narration is supported by another hadith in Saheeh Muslim).<br \/>\n<strong>7-<\/strong> Muhammad ibn Haaroon – <strong>None.<\/strong><br \/>\n<strong>8-<\/strong> Abd Allaah ibn Saalim – One narration in Saheeh Al-Bukhari in which the Prophet (salalahu alaihi wa salam) spoke negatively about a house that contained farming tools.<br \/>\nAhmad ibn `Abdah ibn Moosaa Al-Dabee – Muslim narrates from his <em>shaikh<\/em> multiple time in his Saheeh. All of which are supported by other <em>shaikhs<\/em>. The only exception is one narration in which he (salalahu alaihi wa salam) says that in the end of times, Allah will send a wind that takes the souls of the <em>mu’mins<\/em>.<br \/>\n<strong>9-<\/strong> Al-Haytham ibn Al-Aswad – <strong>None.<\/strong><br \/>\n<strong>10-<\/strong> Hussain ibn Numayr Al-Wasti – He has only one narration in Saheeh Al-Bukhari in which the Prophet (salalahu alaihi wa salam) describes that seventy thousand people will enter heaven from his <em>ummah<\/em> without judgement.<br \/>\n<strong>11-<\/strong> Limaazah ibn Zabar Al-Azdi – <strong>None.<\/strong><br \/>\n<strong>12-<\/strong> Na`eem bin Abee Hind – He has a narration in Al-Bukhari and a few in Muslim. The narration in Al-Bukhari and Muslim is about being easy going with loans. The second (in Muslim) is about how Allah saved the Prophet (salalahu alaihi wa salam) from Abu Jahl. The third is a narration from Huthaifa and Ibn Masu’d about the dangers of Al-Dajjal.<br \/>\n<strong>13-<\/strong> Amr bin Al-Huarith – His first narration (in Saheeh Al-Bukhari and Muslim) is in praise of a herb.  The second narration, he says that he hears the Prophet (salalahu alaihi wa salam) reading Surat Al-Takweer in Fajr prayer. The third is that the Prophet (salalahu alaihi wa salam) used to like to hear others read the Qur’an, and that he cried when he heard Ibn Mas’ud recite a verse from Al-Baqara. The fourth is that he saw the Prophet (salalahu alaihi wa salam) wearing a black turban.<br \/>\n<strong>14-<\/strong> Umaar bin Sa&#8217;ad – <strong>None.<\/strong><br \/>\n<strong>15-<\/strong> Ubayd-Allah ibn Ziyad – <strong>None.<\/strong><br \/>\n<strong>16-<\/strong> Shimr Ibn Thil-Jawshan Ibn Rabiah – <strong>None.<\/strong><br \/>\n<strong>17-<\/strong> Shureh ibn Al-Harith ibn Qays – <strong>None.<\/strong><br \/>\n<strong>18-<\/strong> Thawr bin Yazeed bin Ziyaad Al-Kalaa&#8217;ee – He has two narrations in Saheeh Al-Bukhari. The first is a narration in which the Prophet (salalahu alaihi wa salam) is praising those that will have conquests across the sea (and this has been narrated through multiple authentic chains in the Saheehain). The second narration is a <em>dua’a<\/em> of praise to Allah after meals.<br \/>\n<strong>19-<\/strong> Ishaq ibn Saw&#8217;aaid ibn Hubairah Al-Adwi – He has one narration in Saheeh Al-Bukhari in praise of Ramadhan and Thu Al-Hijjah (which is supported by other narrators).<br \/>\n<strong>20-<\/strong> Azhar bin Abdullah bin Jam&#8217;ee – <strong>None.<\/strong><br \/>\n<strong>21-<\/strong> Abdullah ibn Zaid bin Amroo – Abu Qilaba has been only described as someone who showed a small amount of Nasb, and most of his narrations in the Saheehain are about prayer, and have nothing to do with Ali or Ahlulbayt.<br \/>\n<strong>22-<\/strong> Khaalid ibn Abdullah ibn Yazid – <strong>None.<\/strong><br \/>\n<strong>23-<\/strong> Sulaiman ibn Abdul Hameed bin Raf&#8217;i – <strong>None.<\/strong><br \/>\n<strong>24-<\/strong> Ziyad ibn Jubair Al-Thaqafi – He has three narrations in Al-Bukhari and Muslim. One is about the description of how to slaughter animals. The second is about the prohibition of fasting on Eid.<br \/>\n<strong>25-<\/strong> Qais ibn Abi Hazim – There is not sufficient evidence that he was a Nasibi. The passage that RTS quoted implies that he preferred Uthman over Ali, not that he hated Ali.<br \/>\n<strong>26-<\/strong> Asad ibn Wada&#8217;a – <strong>None.<\/strong><br \/>\n<strong>27-<\/strong> Assad ibn Moosa – Al-Bukhari only included disconnected narrations from him in his Saheeh, which isn’t from his condition.<br \/>\n<strong>28-<\/strong> Muhammad ibn Ziyaad – The shaikh of Abdullah bin Salim. Only one narration in Saheeh Al-Bukhari, see above.<br \/>\n<strong>29-<\/strong> Assaib ibn Farukh Adbul Abbas – He has three narrations in the Saheehain. The first (from the Saheehain) is a narration in which the Prophet (salalahu alaihi wa salam) suggests not fasting every day in a row. The second narration (from the Saheehain) describes the circumstances of Al-Ta’if. The third (from the Saheehain) is one wherein the Prophet (salalahu alaihi wa salam) tells a man that caring for one’s parents is a form of <em>jihad<\/em>.<br \/>\n<strong>30-<\/strong> Al-Hajjaj bin Yousif – <strong>None.<\/strong><br \/>\n<strong>31-<\/strong> Bilal bin Aboo Huraira – <strong>None.<\/strong><br \/>\n<strong>32-<\/strong> Habis ibn Sa&#8217;ad – <strong>None.<\/strong><br \/>\n<strong>33-<\/strong> Busr ibn Irtat – <strong>None. <\/strong><br \/>\n<strong>34-<\/strong> Mughira ibn Shu&#8217;ba – He has several narrations in the Saheehain. They are mainly about advising, cleanliness, the <em>dajjal<\/em>, and other matters that have nothing to do with Ali or Ahlulbayt.<br \/>\n<strong>35-<\/strong> Hariz bin Uthman – He has two narrations in Saheeh Al-Bukhari. The first describes the white hairs of the Prophet (salalahu alaihi wa salam), and the second, describes the worst forms of lying.<br \/>\n<strong>36-<\/strong> Kathir bin Shahab – <strong>None.<\/strong><\/p>\n<p style=\"text-align: justify;\">As we can see through the list above, half of these narrators aren’t even narrators of the Saheehain, while most of the rest barely have any narrations. More importantly, none of their narrations have anything to do with their innovations, which is why the authors of the Saheehain had no problem documenting their hadiths. This is in line with what RTS said earlier on that one can accept the reports of innovators as long as their narrations have nothing to do with their innovation.<\/p>\n<p style=\"text-align: justify;\">Important note: Even though this view is what RTS seems as the correct one, it should be clear that some major contemporary Shia scholars, <a title=\"External link\" href=\"http:\/\/shiaonlinelibrary.com\/%D8%A7%D9%84%D9%83%D8%AA%D8%A8\/2994_%D9%85%D8%B9%D8%AC%D9%85-%D8%B1%D8%AC%D8%A7%D9%84-%D8%A7%D9%84%D8%AD%D8%AF%D9%8A%D8%AB-%D8%AC-%D9%A3\/%D8%A7%D9%84%D8%B5%D9%81%D8%AD%D8%A9_0?pageno=152\" rel=\"nofollow external\">like Al-Khoei<\/a>, accept the narrations of Nawasib if they are deemed as truthful.<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Saduq said in &#8220;Kamal-ul-Deen&#8221; pg.76:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><strong>ما رأينا ولا سمعنا بمتشيع رجع عن التشيع إلى النصب إلا أحمد بن هلال<\/strong><\/p>\n<p style=\"text-align: left;\">&#8220;We have not heard of anyone who converted to Tashayyu` and then converted to Nasb except Ahmad bin Hilal.&#8221;<\/p>\n<p style=\"text-align: left;\">\n<\/blockquote>\n<p style=\"text-align: justify;\">Al-Khoei says about him in &#8220;Mu`jam Rijal al-Hadith&#8221; 3\/149:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"><strong>أقول: لا ينبغي الاشكال في فساد الرجل من جهة عقيدته، بل لا يبعد استفادة أنه لم يكن يتدين بشئ، ومن ثم كان يظهر الغلو مرة، والنصب أخرى، ومع ذلك لا يهمنا إثبات ذلك، إذ لا أثر لفساد العقيدة، أو العمل، في سقوط الرواية عن الحجية، بعد وثاقة الراوي<\/strong><\/p>\n<p style=\"text-align: justify;\">Rough translation: &#8220;It shouldn&#8217;t be problematic that this man has a corrupt ideology, and it isn&#8217;t too preposterous to assume that he didn&#8217;t have a specific belief, and showed Ghulu once, and at times Nasb, and either way, and we don&#8217;t need to prove it, since his corrupted ideology or actions don&#8217;t affect his reliability after the declaration of his trustworthiness.&#8221;<\/p>\n<p style=\"text-align: justify;\">\n<\/blockquote>\n<p style=\"text-align: justify;\">And success is from Allah.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on Revisitingthesalaf.org entitled: Ahl Nawasib Wal-Jammah, which was published on the 12th of July, 2012, and can be found here. Bismillah al-rahman al-raheem, Astonished and amazed is what I am at the efforts of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/07\/14\/response-to-ahl-nawasib-wal-jammah\/\" title=\"Response to: Ahl Nawasib Wal-Jammah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-532","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/532","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=532"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/532\/revisions"}],"predecessor-version":[{"id":538,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/532\/revisions\/538"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=532"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=532"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=532"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}