{"id":546,"date":"2013-07-20T12:43:52","date_gmt":"2013-07-20T12:43:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=546"},"modified":"2015-08-06T22:14:31","modified_gmt":"2015-08-06T22:14:31","slug":"response-to-open-challenge-to-the-sons-of-aisha","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/07\/20\/response-to-open-challenge-to-the-sons-of-aisha\/","title":{"rendered":"Response to: Open Challenge to the Son’s of A’isha"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=546\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on RevisitingtheSalaf.org, entitled: Open Challenge to the Son’s of A’isha, which was published on the 3<sup id=\"yui_3_7_2_1_1374320200648_2156\">rd<\/sup> of August, 2012. It can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/08\/open-challenge-to-sons-of-aisha.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">First of all, the title should be &#8220;Sons of A’isha&#8221; Not &#8220;Son’s of A’isha&#8221;&#8230; But we&#8217;re used to this guy&#8217;s grammatical mistakes, he can&#8217;t even get the title right.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s begin,<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_1955\" style=\"text-align: justify;\">In this article, RTS attempts to defame his mother A’isha (ra) by quoting various narrations that have to do with her opinion towards breastfeeding adults. Before carrying on, we believe that it is wise to first produce the evidences that show the correct stance of A’isha (ra) towards the breastfeeding of adults and of those above the age of two in general.<\/p>\n<p style=\"text-align: justify;\">The first narration is from Musnad Ali bin Al-Ja’ad #152:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أنا شعبة ، عن الحكم قال : سمعت قيس بن أبي حازم ، وأبا الشعثاء ، عن عائشة قالت :  يحرم من الرضاع ما أنبت اللحم والدم<\/p>\n<p>Shu’ba told us, from Al-Hakam: I heard Qais bin Abi Haazim and Aba Al-Sha’thaa’, from A’isha (ra) say, “Only what causes the growth of the flesh and blood is what causes a foster-relationship through breastfeeding.”<\/p><\/blockquote>\n<p style=\"text-align: justify;\">This is a clear narration that A’isha (ra) does not believe that breastfeeding adults causes a foster-relationship with them.<\/p>\n<p style=\"text-align: justify;\">The second narration is from Musannaf Abdul-Razaaq #13928:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">أخبرنا ابن جريج قال : سمعت نافعا يحدث أن سالم بن عبد الله حدثه أن عائشة زوج النبي صلى الله عليه وسلم أرسلت به إلى أختها أم كلثوم ابنة أبي بكر ، لترضعه عشر رضعات ، ليلج عليها إذا كبر ، فأرضعته ثلاث مرات ، ثم مرضت ، فلم يكن سالم يلج عليها<\/p>\n<p style=\"text-align: justify;\">I was told by Ibn Juraij: I heard Nafi’ narrate that Salim bin Abdullah narrated that A’isha the wife of the Prophet (pbuh) sent him to her sister Umm Kalthum bint Abi Bakr, to breastfeed him ten times so he can enter on her when he becomes an adult, but she got sick, and Salim couldn&#8217;t enter upon her.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">We at twelvershia.net ask: If A’isha (ra) believed that Salim was allowed to enter upon her if one of her sisters breastfed him, then why would she not take advantage of this? Why did she not have him be breastfed after he became an adult and only focused on a small time window?<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2223\" style=\"text-align: justify;\">These two narrations are clear and authentic proofs that this is the position of A’isha (ra), which means that there are two possible alternatives to what is widely suggested about the narrations in which she says that adult breastfeeding leads to a foster-relationship.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2221\" style=\"text-align: justify;\">The first possibility is that these narrations indicate that A’isha (ra) had two views on the subject and that this is her later view, and this is the opinion of `Ala&#8217; Al-Deen Al-Kaasaani.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2219\" style=\"text-align: justify;\">The second possibility is that A’isha (ra) only has one view, which is that adults cannot be breastfed, and this is the opinion of Al-Jassas. However, this means that the narrations that state that she believed in the permissibility of adult breastfeeding are disconnected reports from late scholars. This is the point that Sheikh Abdullah Ramadan Moosa suggests in his book &#8220;Kashf Akadheeb Al-Qisees Hawla Ridhaa’ Al-Kabeer&#8221;. See pages 93 to 113.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2238\" style=\"text-align: justify;\">RTS starts off the attacks with the following narration, and then proceeds with an explanation:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2236\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2247\">Muslim ibn Hajjaj:<\/b><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2192\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Umm Salama said to A&#8217;isha: &#8220;A young boy who is at the threshold of puberty comes to you! I, however, do not like that he should come to me, whereupon A&#8217;isha (Allah be pleased with her) said: &#8216;Don&#8217;t you see in Allah&#8217;s Messenger (may peace be upon him) a model for you?&#8217; She also said: The wife of Aboo Hudhaifa said: &#8216;Messenger of Allah, Salim comes to me and now he is a (grown-up) person, and there is something that (rankles) in the mind of Aboo Hudhaifa about him,&#8217; whereupon Allah&#8217;s Messenger (may peace be upon him) said: &#8216;Suckle him (so that he may become your foster-child), and thus he may be able to come to you (freely).'&#8221;<\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2252\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2253\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Saheeh Muslim. Vol. 2, Pg. # 664, H # 29.<\/b><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2254\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2256\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Muslims believe a foster relationship can only be established through breast-feeding and that is only if the child is less than two (as mentioned in the Holy Qu&#8217;raan). But the narration of A&#8217;isha wherein she advised Umm Salama (r.a) and her nieces, to breast-feed any man on the grounds that the Prophet (saw) had advised Sahlah to do the same. Now, if Salim&#8217;s case had been an exception to the rule, why would A&#8217;isha (whose intelligence and knowledge of Qur&#8217;aan and Hadeeth is far more superior to any present day Sunni scholar) advance it as a precedent for Umm Salama (r.a) and her nieces to breast-feed men? <\/span><\/p>\n<\/blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2268\" style=\"text-align: justify;\">Nothing in the narration indicates that this boy was breastfed after the age of two. It is very much possible that this is a case in which A’isha (ra) has had this boy breastfed at a young age, with the intention of him being given permission to enter upon her in the future. She points out the situation of Salim in order to show Umm Salama that circumstances of necessity in which one is forced to breastfeed a child are not the only ones that are permissible.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2260\" style=\"text-align: justify;\">However, even if we assume that A’isha (ra) is telling Umm Salama (ra) that she should have adults breastfed, then it is still possible that this is her earlier opinion and that she later turned from this view in the future as we have indicated above.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2265\" style=\"text-align: justify;\">RTS then quotes:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2264\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2292\">Ahmad bin Hanbal:<\/b><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2261\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2263\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">A&#8217;isha took that as a precedent for whatever men she wanted to be able to come to see her. She ordered daughters of her sisters and brothers to give milk to whichever men she wanted to be able to come in to see her. The rest of the wives of the Prophet, may Allah bless him and grant him peace, refused to let anyone come in to them by such nursing. They said, &#8216;No! By Allah! We think that what the Messenger of Allah, may Allah bless him and grant him peace, ordered Sahla bint Suhayl to do was only an indulgence concerning the nursing of Salim alone. No! By Allah! No one will come in upon us by such nursing!&#8217;<\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2289\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: Hadeeh is <b id=\"yui_3_7_2_1_1374320200648_2295\">Saheeh (Authentic).<\/b><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2296\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2299\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2298\">Source: Musnad Ahmad bin Hanbal. Pg. # 192, H # 26208.<\/b><\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2306\" style=\"text-align: justify;\">There is some weakness in this narration, which is that it has arrived us through the path of the nephew of Al-Zuhri, Muhammad bin Abdullah. Even though he is not completely weak, he has been weakened by Yahya, Muhammad bin Yahya Al-Neesaboori, and Ibn Hibban.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2314\" style=\"text-align: justify;\">On the other hand, Ma’amar, a top-level student of Al-Zuhri, narrated a very similar narration in Musannaf `Abdul-Razzaq. However, the difference between the two narrations is clear.<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2311\" style=\"text-align: right;\">عن معمر عن الزهري عن عروة عن عائشة قالت : جاءت سهلة بنت سهيل بن عمرو إلى النبي صلى الله عليه وسلم فقالت : إن سالما كان يدعى لابي حذيفة ، وإن الله عزوجل قد أنزل في كتابه : (ادعوهم لابائهم) وكا يدخل علي وأنا فضل ، ونحن في منزل ضيق ، فقال النبي صلى الله عليه وسلم : أرضعي سالما تحرمي عليه ، قال الزهري : قالت  بعض أزواج النبي صلى الله عليه وسلم : لا ندري لعل هذه كانت رخصة لسالم خاصة ، قال الزهري : وكانت عائشة تفتي بأنه يحرم الرضاع بعد الفصال حتى ماتت.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2321\" style=\"text-align: justify;\"><b>Al-Zuhri<\/b> said: Some of the wives of the Prophet (pbuh) said: We don’t know, it is possible that this was a special permission. <b>Al-Zuhri<\/b> said: A’isha used to give religious rulings that the foster-relationship only occurs before the cutting off of breastfeeding (two years), until she died.<\/p>\n<\/blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2323\" style=\"text-align: justify;\">We say: This is a clear indication, from the narration, that these words were not those of Urwa, the nephew of A’isha, but rather, the words of Al-Zuhri, who only expressed what he has heard, from an unknown source.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2340\" style=\"text-align: justify;\">RTS attempts to argue:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2358\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Despite all these absurd narrations, a question which immediately comes to mind is whether Sahlah bint Suhayl who breast-fed Salim, had breast milk at the time? According to historical facts, Sahlah only had one child with Aboo Hudhayfah who was called Muhammad ibn Abi Hudayfah, born during their stay in Abyssinia. After migration in the 5 A.H. The couple later returned to Makkah around a month later, the same year they remained there until the Prophets (saw) emigration to Madinah eight years later. The occurrence of the breast-feeding event as reported, took place in Madinah, which means there was a gap of around 8-10 years between the birth of Sahlah&#8217;s child and her breast-feeding Salim. Normally a woman may continue to secrete milk for a few years after childbirth. This being so, it would be impossible for Sahlah to have been lactating at the time that she was supposed to have breast-fed Salim. <\/span><\/p>\n<\/blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2355\" style=\"text-align: justify;\">There is no evidence that Abu Hudhayfah had no children other than Muhammad. Furthermore, there is no reason to fabricate this incident, and A’isha (ra) is not the sole narrator of this event, but it was also narrated by Umm Salama (ra).<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2373\" style=\"text-align: justify;\">Additionally, RTS, in order to further criticize A’isha (ra), rejects the idea that breastfeeding can be done through pouring milk into a cup that was originally from the breast of a woman. RTS argues:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2391\"><span style=\"color: #ff0000;\">This is far-fetched idea and implausible because foster relationships are to be established through contact, is breast-feeding directly and not simply drinking breast milk from a place other than a woman&#8217;s breast.<\/span><\/p>\n<\/blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2398\" style=\"text-align: justify;\">Of course, nobody is interested in the opinion of the writers in the RTS website. It is sufficient that Imam Ibn Abdulbarr said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وقد أجمع فقهاء الأمصار على التحريم بما يشربه الغلام الرضيع من لبن المرأة وإن لم يمصه من ثديها<\/p>\n<p>“There is a consensus among the scholars of all areas that a foster relationship occurs when a baby drinks from the milk of a woman, even if it didn&#8217;t suckle from her breast.” Al-Tamheed 8\/257.<\/p><\/blockquote>\n<p style=\"text-align: justify;\">RTS then started to quote narrations from A’isha implying that the Qur’an has been tampered with:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2415\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2430\">Muslim ibn Hajjaj:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;A&#8217;isha (Allah be pleased with, her) reported that it had been revealed in the Holy Qur&#8217;aan that <b id=\"yui_3_7_2_1_1374320200648_2428\">ten clear sucklings make the marriage unlawful, <span id=\"yui_3_7_2_1_1374320200648_2427\" style=\"text-decoration: underline;\">then it was abrogated (and substituted) by five sucklings<\/span><\/b> and Allah&#8217;s Apostle (may peace be upon him) died and it was before that time (found) in the Holy Qur&#8217;an (and recited by the Muslims).<\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2426\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2417\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Al-Bayhaqi:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">This is how we got this narration, and this actually happened; she reported the incidence without giving any ruling; For sure, verse of Rajam &#8216;stoning&#8217; was known amongst companions, and they knew that its recitation and its existence in scriptures (Qur&#8217;aan) were abrogated, and only its ruling existed. And that was when the Prophet (saw) approached Umar and did not allow him to write it. <b id=\"yui_3_7_2_1_1374320200648_2419\"><span id=\"yui_3_7_2_1_1374320200648_2435\" style=\"text-decoration: underline;\">And as regards to breastfeeding adults, it was abrogated except according to A&#8217;isha&#8217;s opinion; or they said it was a permission for Salim only<\/span>, and because of that, they did not confirm it. As regards to breastfeeding adults ten times, it is reported through the narration of Amra from A&#8217;isha, that it was reduced to 5 sucklings, and the abrogation of its ruling and recitation was known amongst companions, and that is why they did not confirm it, not because the goat ate her scriptures, and that is clear by the grace of Allah (swt).<\/b><\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2441\" style=\"text-align: justify;\">The narration quoted by Al-Bayhaqi is not as strong as the one we find in Saheeh Muslim, since it includes Ibn Ishaaq. The Saheeh Muslim, which is from the narration of Malik, shows no indication of verses of the Qur’an being lost, and that a goat ate some scripture that was already abrogated in the past. The narration found in Muslim is supported by other narrations that include the same meaning about the abrogation of the verse about suckling ten times, and these have come through the paths of Sulayman bin Bilal (in Muslim) and Hamaad bin Salama (Sunan Ibn Majah). Each one of these three men are more trustworthy than Ibn Ishaaq if taken individually, and therefore, their narrations combined make it more certain for us to declare that Ibn Ishaaq erred in this narration.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2449\" style=\"text-align: justify;\">RTS continues by collecting more quotes, then mistranslating them:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2452\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2457\">Ibn Hazim:<\/b><\/span><br \/>\n<span style=\"color: #ff0000;\"><b><br \/>\n<\/b>Narrated A&#8217;isha: &#8220;The verse of stoning and of suckling an adult ten times was revealed, and they were (written) on a paper and kept under my pillow. When the Messenger of Allah (saw) passed away we were occupied by his death, a goat entered and ate away the paper.&#8221; <\/span><\/p>\n<p><span style=\"color: #ff0000;\">Footnote: Narration is <strong id=\"yui_3_7_2_1_1374320200648_2461\">Saheeh (Authentic).<\/strong><\/span><br \/>\n<span style=\"color: #ff0000;\"><b><br \/>\nSource: Al-Muhalla. Pg. # 2129.<\/b><\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2474\" style=\"text-align: justify;\">The text from the PDF file on RTS&#8217;s site does not include the term “adult”. This is an addition by RTS.<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2471\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2484\">Al-Albani:<\/b><\/span><\/p>\n<p><span style=\"color: #ff0000;\">Narrated A&#8217;isha: &#8220;The verse of stoning and of suckling an adult ten times was revealed, and they were (written) on a paper and kept under my pillow. When the Messenger of Allah (saw) passed away we were occupied by his death, a goat entered and ate away the paper.&#8221; <\/span><\/p>\n<p><span style=\"color: #ff0000;\">Footnote: Narration is <strong id=\"yui_3_7_2_1_1374320200648_2488\">Hasan (Reliable).<\/strong><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2469\"><span style=\"color: #ff0000;\"><strong> <\/strong><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2468\"><span style=\"color: #ff0000;\"><b>Ahmad Shakir:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated A&#8217;isha: &#8220;The verse of stoning and of suckling an adult ten times was revealed, and they were (written) on a paper and kept under my pillow. When the Messenger of Allah (saw) expired and we were occupied by his death, livestock entered and ate away the paper.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: Narrration is <strong>Saheeh (Authentic).<\/strong><\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><strong> <\/strong><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2508\" style=\"text-align: justify;\">Each of these narrations above is through the path of Ibn Ishaaq. Refer to the response above in regards to this.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2504\" style=\"text-align: justify;\">Continuing on, RTS goes on to show examples of modern Sunni scholars who have misunderstood this issue or have given religious rulings on this matter. We say that these opinions do not reflect the opinion of the majority of Ahl Al-Sunnah, and the evidences are clear from what we have included in this article that adult breastfeeding does not necessitate suckling directly, nor does it cause a foster-relationship.<\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2501\" style=\"text-align: justify;\">RTS ends off with the following argument:<\/p>\n<blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2495\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2515\">Shahin Lashin:<\/b><\/span><br \/>\n<span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2499\"><br \/>\n&#8220;A&#8217;isha opined that adult breast feeding makes an individual mahram,<\/b> <b>and she practically breast fed a young man,<\/b> <b id=\"yui_3_7_2_1_1374320200648_2496\">and he would enter upon her, but the remainder mothers of the believers denied it (adult breast feeding)&#8230;&#8221;<\/b><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2494\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2535\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b id=\"yui_3_7_2_1_1374320200648_2534\">Source: Fatah Ul-Mun&#8217;im Sharh Saheeh Muslim. Vol. 5, Pg. # 622.<\/b><\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2536\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2538\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Sheikh Shahin Lashin a much lauded scholar, hadeeth teacher and vice president at Al-Azhar University in Egypt. The said author is alleging that A&#8217;isha of her own volition breastfed a slave. Our readers should not forget that the tradition under discussion is that set out under the chapter of Saheeh Muslim titled, ‘Suckling a Young Lad,’ wherein we learn how Salim, a grown bearded man was suckled by Sahla the mother of the household upon the orders of the Prophet (saw), so that he could become her foster son and negotiate his way through her home without the need for the type of rigid rules of contact placed on a non mahram. During the course of commenting on this very tradition, the author argues that A&#8217;isha suckled a Ghulam (servant). Umm Salam (r.a) disliked this young boy entering upon the wives of the Prophet (saw). (Source: Saheeh Muslim. Vol. 2, Pg. # 664, H # 29.)<\/span><\/p>\n<p id=\"yui_3_7_2_1_1374320200648_2540\" style=\"text-align: justify;\"><span style=\"color: #ff0000;\">In order to breast-feed, A&#8217;isha would have had to expose her breast, in other words uncover her (Awrah), something which Allah (swt) has clearly made unlawful for the believers. Breast-feeding involves physical contact between two persons; the woman and the child. If the servant of A&#8217;isha had been breast-fed, physical contact would most certainly have taken place, breaking yet another Islam&#8217;s ruling.<\/span><\/p>\n<\/blockquote>\n<p id=\"yui_3_7_2_1_1374320200648_2548\" style=\"text-align: justify;\">We at twelvershia.net, like the rest of Ahl Al-Sunnah only accept reports that include evidence. The opinion of one of the early predecessors has no weight if it goes against the Qur’an and the established Sunnah. Similarly, a report indicating that A’isha (ra) would suggest such a thing, through a disconnected chain, is not sufficient for us. Now, if that is our position towards our predecessors, then one can only guess how little weight a contemporary opinion holds. With all due respect to Shahin Lashin, there is no evidence that A’isha (ra) suckled or had the ability to suckle an infant, and due to this we flat out reject it as evidence.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf.org, entitled: Open Challenge to the Son’s of A’isha, which was published on the 3rd of August, 2012. It can be found here. First of all, the title should be &#8220;Sons of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/07\/20\/response-to-open-challenge-to-the-sons-of-aisha\/\" title=\"Response to: Open Challenge to the Son’s of A’isha\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12,1],"tags":[21],"class_list":{"0":"post-546","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh","8":"category-hadith","9":"tag-aisha"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/546","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=546"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/546\/revisions"}],"predecessor-version":[{"id":2312,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/546\/revisions\/2312"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=546"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=546"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=546"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}