{"id":562,"date":"2013-07-21T08:13:31","date_gmt":"2013-07-21T08:13:31","guid":{"rendered":"http:\/\/twelvershia.net\/?p=562"},"modified":"2013-07-21T08:51:41","modified_gmt":"2013-07-21T08:51:41","slug":"response-to-the-evilest-of-generations","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/07\/21\/response-to-the-evilest-of-generations\/","title":{"rendered":"Response to: The Evilest Of Generations"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=562\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"> <strong>The following is a response to the article on Revisitingthesalaf.org entitled: The Evilest Of Generations, which was published on the 26th of August, 2012, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/08\/the-evilest-of-generations.html\" rel=\"external nofollow\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">RevisitingTheSalaf (RTS) begins his article with two narrations, through these two narrations he wishes to prove that the generation of the Companions and the followers are the &#8220;worst&#8221; of generations as opposed to what the Muslims believe, he quotes:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">قَالَ عَبْدُ اللَّهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ &#8220;‏ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو، كَيْفَ بِكَ إِذَا بَقِيتَ فِي حُثَالَةٍ مِنَ النَّاسِ بِهَذَا<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Abdullah said that  Allah&#8217;s Apostle (saw) said, &#8220;O `Abdullah bin `Amr! What will be your condition when you will be left with the sediments of (worst) people?&#8221; (They will be in conflict with each other).<\/span><br \/>\n<span style=\"color: #ff0000;\">Source: Saheeh Al-Bukhari. Chp. 88, H. # 480, Pg. # 128<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">عن حنظلة بن خويلد العنبري ، قال : بينما أنا عند معاوية ، إذ جاءه رجلان يختصمان في رأسه عمار -رضي الله عنه- فقال كل واحد منهما : أنا قتلته . فقال عبد الله بن عمرو : ليطب به أحدكما نفسا لصاحبه ، فإني سمعت رسول الله -صلى الله عليه وسلم- يقول : تقتله الفئة الباغية . فقال معاوية : يا عمرو ! ألا تغني عنا مجنونك ، فما بالك معنا ؟ قال : إن أبي شكاني إلى رسول الله -صلى الله عليه وسلم- فقال : أطع أباك ما دام حيا . فأنا معكم ، ولست أقاتل .<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Hunzila narrates that once I was sitting with Mu&#8217;awiyah when two men came fighting. Each of them said that he martyred Hazrat Ammar (r.a). Abdullah bin Amr said: &#8220;Each of you should congratulate each other because I had heard the Holy Prophet (saw) saying that &#8216;Ammar would be killed by rebel group.&#8217; Mu&#8217;awiyah said: &#8216;Why are you then with us? O Amr why do you not make us free of this mad person of yours?&#8217; Abdullah bin Amr replied: &#8216;Once my father complained to the Holy Prophet about me and he told me to obey my father for whole of my life, and not to disobey him, that is why I am with you, but I do not particpate in battle.&#8217;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Source: Siyar A&#8217;lam An-Nubala. Vol. 3, Pg. # 92<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">First of all, I&#8217;d like to say that the narration of Bukhari that he quoted is not correctly written, the part that says &#8220;They will be in conflict with each other&#8221; is nowhere to be found in the Arabic text.<\/p>\n<p style=\"text-align: justify;\">Regardless,<\/p>\n<p style=\"text-align: justify;\">Based on these two narrations, RTS conjectures that the worst sediment of people are Mu`awiyah, `Amr ibn al-`Aas and their supporters. This is an epic case of misinterpretation of narrations. For if `Amr ibn al-Aas and Mu`awiyah are the worst sediment of people, than how come the Prophet (peace be upon him) ordered `Abdullah or any person to obey them till the end of their lives? This doesn&#8217;t even make sense and is completely illogical.<\/p>\n<p style=\"text-align: justify;\">In fact we read in Tareekh Madinat Dimashq and Mustadrak al-Hakim and Siyar A`lam al-Nubala&#8217;:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">عن عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم: كيف بك إذا بقيت في حثالة من الناس قد مرجت عهودهم ومواثيقهم وكانوا هكذا؟ فخالف بين أصابعه، قال: فأمرني بأمر يا رسول الله؟ قال: فأخذ ما تعرب وتدع ما تنكر وتعمل بخاصة نفسك وتدع الناس وعوام أمرهم! فلما كان يوم صفين قال له أبوه عمرو: يا عبد الله! اخرج فقاتل! فقال: يا أبتاه! أتأمرني أن أخرج فأقاتل وقد سمعت ما سمعت يوم عهد إلي رسول الله صلى الله عليه وسلم ما عهد! فقال: أنشدك بالله! يا عبد الله ألم يكن آخر ما عهد إليك رسول الله صلى الله عليه وسلم أن أخذ بيدك فوضعها في يدي ثم قال: أطع أباك۔ قال: اللهم بلى<\/p>\n<p style=\"text-align: justify;\">It is narrated from `Abdullah ibn `Amr said that the Prophet (peace be upon him) said : What will be your condition when you will be left with the sediments of (worst) people? [&#8230;ect&#8230;] On the day of Siffin, `Amr&#8217;s father told him : O Abdullah, come out and fight (against the army of Ali). So he said : O Father, do you order me to come out and fight while I have heard from the Prophet (peace be upon him) what I have heard on the day when he took promise from me? He (i.e `Abdullah&#8217;s father) said : I ask you by Allah, O `Abdullah, wasn&#8217;t the last promise of the Prophet (peace be upon him) which he took from you was that he gave your hand in my hand and said: Obey your father? He said : By God, Indeed (that was the case).<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">So the first point that proves that RTS misunderstood the meaning, is that the Prophet (SAWS) ordered `Abdullah ibn`Amr bin al-`Aas (ra) to ALWAYS obey his father for the rest of his life. His father `Amr (ra) is Mu`awiya&#8217;s (ra) supporter and ally, this shows that the term &#8220;sediments of people&#8221; is not specific for him and Mu`awiyah (ra).<\/p>\n<p style=\"text-align: justify;\">The correct interpretation of the two narration is as following.<\/p>\n<p style=\"text-align: justify;\">The narration in which the Prophet (peace be upon him) ordered `Abdullah (ra) to obey his father clearly means that `Abdullah&#8217;s father `Amr ibn al-`Aas (ra) was a righteous person who could commit mistakes but who could never be a hypocrite or disbeliever. Because the Prophet (peace be upon him) can&#8217;t order a person to obey a hypocrite or disbeliever. Such an order can be given only regarding a righteous Muslim. The two persons who were quarreling regarding who killed `Ammar (ra) were silenced by Abdullah when he mentioned the words of the Prophet (peace be upon him) that the rebel group will kill `Ammar. This shows that `Abdullah, the son of `Amr ibn al-Aas, was a man of principles, who could tell the truth in front of anyone. He didn&#8217;t fear the criticism of anyone.<\/p>\n<p style=\"text-align: justify;\">In the authentic narration from `Abdullah ibn `Amr (ra) in al-Silsilah al-Sahihah 1\/415 we read that the Prophet (SAWS) told him, that in those times will be great tumult and conflict:<\/p>\n<blockquote><p>إذا بقيت في حثالة من الناس قد مرجت عهودهم وأماناتهم واختلفوا فصاروا هكذا؟ وشبك بين أصابعه<\/p>\n<p style=\"text-align: justify;\">What will be your condition when you will be left with the sediments of (worst) people? They will not keep their promises and they will not fulfill their pledges. They will disagree with one another hence they will become like this &#8211; he put his fingers in one another.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">In another version, in al-Albani&#8217;s &#8220;Sahih ibn Majah&#8221; #3211 we read:<\/p>\n<blockquote><p>كيف بكمْ وبزمانٍ يوشكُ أن يأتيَ يغربَلُ الناسُ فيه غربلةَ، وتبقى حثالةٌ منَ الناسِ قد مرجَتْ عهودُهُم وأماناتُهم , فاختلفوا وكانوا هكذا وشبَّكَ بينَ أصابعِهِ ,قالوا كيف بنا يا رسولَ اللهِ إذا كان ذلكَ ؟ قال تأخذونَ بما تعرفونَ، وتدَعونَ ما تُنكرونَ، وتُقبلونَ على خاصَّتِكم، وتذرونَ أمرَ عوامِّكم<\/p>\n<p style=\"text-align: justify;\">What will be your condition when you will be left with the sediments of (worst) people? They will not keep their promises and they will not fulfill their pledges. They will disagree with one another hence they will become like this &#8211; he put his fingers in one another. The people said : What shall we do O apostle of Allah if that were to happen? He said : Take hold of the good things you recognize and avoid the matters that appear wrong. Everyone of you should focus on his own self and ignore the matters of the people.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">al-Bayhaqi also narrated in Shu`ab al-Iman:<\/p>\n<blockquote><p>عن سهل بن سعد الساعدي أن رسول الله صلى الله عليه وسلم قال لا صحابه: كيف أنتم إذا بقيتم في حثالة من الناس مرجت أماناتهم وعهودهم وكانوا هكذا؟ ثم أدخل أصابعه بعضها في بعض، قالوا: فإذا كان كذلك كيف نفعل يا رسول الله؟ قال: خذوا ما تعرفون ودعوا ما تنكرون! ثم قال عبد الله بن عمرو بن العاص: ما تأمرني به يا رسول الله إذا كان ذلك؟ قال: آمرك بتقوى الله! وعليك بنفسك وإياك وعامة الأمور<\/p>\n<p style=\"text-align: justify;\">It is narrated from Sahl ibn Saad al-Saaidi that the Prophet (peace be upon him) said : What will be your condition when you will be left with the sediments of (worst) people? They will not keep their promises and they will not fulfill their pledges. They will disagree with one another hence they will become like this &#8211; he put his fingers in one another. The people said : What should we do in such condition, O Messenger of Allah? He said : Take the good things and avoid the wrong things. Then `Abdullah ibn `Amr said : What do you order me in such condition, O Messenger of Allah? He said : I order you to fear Allah, and focus on your self and ignore the matters of the general masses.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">The second point that proves that RTS misunderstood the narration, is that the Prophet (SAWS) was giving general instructions, if this were a  specific matter regarding Mu`awiyah (ra) and `Ali (ra), he (SAWS) would have given specific political instructions. However, we see the Prophet (SAWS) ordering them to stick to the good deeds that they learned from him, and to fear Allah and obey his instructions, and to focus on themselves and their faith and not to concern themselves with the decaying condition of the society which surrounds them.<\/p>\n<p style=\"text-align: justify;\">al-Munthiri narrated that the Prophet (SAWS) told ibn `Umar (ra):<\/p>\n<blockquote><p>كيف بك يا ابن عمر إذا عمرت  في حثالة من الناس؟ يخبأون رزق سنة ويضعف اليقين.<\/p>\n<p>What will be your condition, O Ibn Umar, when you will be the old one residing among the sediments of (worst) people? They will hide the sustenance of one year and their faith will be weak.<\/p><\/blockquote>\n<p style=\"text-align: justify;\">While we know that Ibn `Umar was much younger than Mu`awiyah and `Amr ibn al-`Aas. So how can the worst people mentioned in these narrations be considered Muawiyah and Amr ibn al-Aas? It is very clear that this Hadith refers to the era of Yazeed ibn Mu`awiyah, because `Abdullah ibn `Amr and Ibn` Umar lived in that era and Ibn `Umar was old at that time. Also this shows that the Prophet (SAWS) did not only tell this to Ibn `Amr (ra), he told it to Ibn `Umar (ra) as well and this latter one was not on the side of Mu`awiyah (ra).<\/p>\n<p style=\"text-align: justify;\">We add, that if the Prophet (SAWS) t0ld `Abdullah ibn `Amr (ra) that he shall remain in a time with the sediments of people, this does not mean that ALL the people of his time were like this, because the Prophet (SAWS) said: &#8220;The best of generations is this one, then the one after it, then the one after it.&#8221; So how can the second generation be less good than the first one? The answer is that it is because the number of good people is being reduced while the number of bad people is beginning to increase, also the knowledge was starting to disappear slowly.<\/p>\n<p style=\"text-align: justify;\">The point is, this entire argument from RTS  is useless, his argument is that Ahlul-Sunnah believe that they must follow the best of generations while the narrations he provided says that some elements were &#8220;Bad&#8221;. It is useless simply because Ahlul-Sunnah only imitate and take their religion from the best of the companions and the best of their followers and the most reliable and trustworthy scholars of that time by consensus of the nation, from the people who were famous for their nobleness and virtue and knowledge and loyalty to this religion.<\/p>\n<p style=\"text-align: justify;\">The Muslims, although they believe that those generations were virtuous and praised by Allah, yet they do not just take their religion from any random person who lived in those times.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p> The following is a response to the article on Revisitingthesalaf.org entitled: The Evilest Of Generations, which was published on the 26th of August, 2012, and can be found here. RevisitingTheSalaf (RTS) begins his article with two narrations, through these two narrations he <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/07\/21\/response-to-the-evilest-of-generations\/\" title=\"Response to: The Evilest Of Generations\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-562","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/562","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=562"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/562\/revisions"}],"predecessor-version":[{"id":704,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/562\/revisions\/704"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=562"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=562"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=562"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}