{"id":587,"date":"2013-08-15T20:11:00","date_gmt":"2013-08-15T20:11:00","guid":{"rendered":"http:\/\/twelvershia.net\/?p=587"},"modified":"2013-08-15T20:14:21","modified_gmt":"2013-08-15T20:14:21","slug":"verse-of-imamat-ibrahim-shia-understanding-of-oppressors-is-it-qati-or-dhanni","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/08\/15\/verse-of-imamat-ibrahim-shia-understanding-of-oppressors-is-it-qati-or-dhanni\/","title":{"rendered":"Verse of Imamat Ibrahim: Shia understanding of &#8220;Oppressors&#8221;, is it Qat`i or Dhanni?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=587\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">Praise be to Allah and his glory be to Him. I shall begin by explaining the title of this rather advanced topic Insha-Allah.<\/p>\n<p style=\"text-align: justify;\">First we present the following Qur&#8217;anic verse from Surat al-Baqarah:<\/p>\n<p style=\"text-align: justify;\"><strong>{And [mention, O Muhammad], when Abraham was tried by his Lord with commands and he fulfilled them. [Allah] said, &#8220;Indeed, I will make you a leader for the people.&#8221; [Abraham] said, &#8220;And of my descendants?&#8221; [Allah] said, &#8220;My covenant does not include the oppressors.&#8221;}<\/strong><b> <\/b><strong>[2:124]<\/strong><\/p>\n<p style=\"text-align: justify;\">Those who follow and observe Twelver Shia beliefs know that they use this verse as evidence that their Imams(Leaders) are protected from error, in other words infallible, unable to make mistakes or sins. They rely on the last part of this verse as evidence to prove this. They claim that the covenant of Allah is Imamah(Leadership) and  that it does not go to &#8220;The oppressors&#8221; from the progeny of Ibrahim (as).<\/p>\n<p style=\"text-align: justify;\">The Twelver Shia define the word &#8220;oppressors&#8221; as anyone who has ever done an act of oppression in his entire life, which means that Allah is announcing that he will not award leadership to anyone who makes such mistakes, thus in Twelver Shia faith leadership can only go to infallible individuals who are protected from ever committing sin.<\/p>\n<p style=\"text-align: justify;\">The point of this article is, can this verse be used as a Qat`i evidence to prove that the leader must be infallible OR is it a Dhanni evidence?<\/p>\n<p style=\"text-align: justify;\"><strong>Part -1:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Defining what is Qat`i evidence and what is Dhanni evidence<\/strong>, (The readers familiar with these terms may skip this part)<\/p>\n<p style=\"text-align: justify;\">Islam is a religion of evidence, the Muslims must not invent matters in their own religion, everything they do should be based on some sort of proof, the strongest of proofs are usually Qur&#8217;anic texts and authentic prophetic sayings (Hadith). The majority of Muslims otherwise known as Ahlul-Sunnah wal-Jama`ah always followed the strongest and most reliable of proofs, whereas deviant sects may cling to weak evidence such as twisting the meaning of a certain verse, or believing in unreliable narrations.<\/p>\n<p style=\"text-align: justify;\">Qat`i evidence is solid clear proof, when one sees it he shall acquire certainty, meaning the knowledge we gain from this piece of evidence is certain. Denying these types of evidence would take one out of Islam. For example the following verse is considered Qat`i evidence that Allah is &#8220;One&#8221;:<\/p>\n<p style=\"text-align: justify;\"><strong>{Say: He is Allah, the One!}<\/strong> <strong>[112:1]<\/strong><\/p>\n<p style=\"text-align: justify;\">If a Muslim were to say &#8220;No, Allah is Two!&#8221; he becomes a Kafir.<\/p>\n<p style=\"text-align: justify;\">Dhanni evidence is a weaker form of evidence, it means probable or speculative evidence, evidence that can accept more than one interpretation, it can be understood in more than one way. A practical example of this would be the following:<\/p>\n<p style=\"text-align: justify;\">If you spot a man standing next to the dead body of another person, and there are some blood stains on his clothes, you&#8217;d assume that he was the killer. However, it could be that he just came at the wrong time while the real killer had already made his escape, and that he got some blood on his clothes while trying to help the dying man, it does not necessarily mean that he killed him.<\/p>\n<p style=\"text-align: justify;\">Another example from a Fiqhi perspective is the following Hadith:<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) said: &#8220;No one touches the Qur&#8217;an except who is pure.&#8221;<\/p>\n<p style=\"text-align: justify;\">This narration is authentic, but how do we understand its implications?<\/p>\n<p style=\"text-align: justify;\">Some scholars used this as proof that the woman on her period cannot touch the Qur&#8217;an because she is in a state of impurity. However, this is only a speculative analogy and a speculative evidence, it could be that by &#8220;pure&#8221; Allah meant the believers, because the Prophet (saw) said in another narration &#8220;The (touch of a) believer does not cause impurity.&#8221; So it could simply mean that Allah is forbidding non-Muslims from touching the Qur&#8217;an and that this has nothing to do with Muslim women on period.<\/p>\n<p style=\"text-align: justify;\">This makes the narration above a Dhanni(speculative) evidence for forbidding women from touching the Qur&#8217;an while on period.<\/p>\n<p style=\"text-align: justify;\">IF that narration were to say: &#8220;No one touches the Qur&#8217;an while on their periods.&#8221; Then it would have been a Qat`i(Certain) evidence for forbidding the women from this.<\/p>\n<p style=\"text-align: justify;\">Of course the matter is much more complicated than this, there are many sub-sections and types but this general explanation is enough for our article Insha-Allah.<\/p>\n<p style=\"text-align: justify;\">In our case, we believe in the authority of the Qur&#8217;anic verse about the Imamah of Ibrahim (as), and we believe that none of the oppressors received the covenant of Allah exactly as the text says, BUT can this text be used as Solid Clear Qat`i evidence for the Shia belief in the infallibility of their leaders?<\/p>\n<p style=\"text-align: justify;\">Insha-Allah, we will be proving that this verse which they claim is a clear Qat`i proof that the Imams are infallible since childhood is no more than a weak Dhanni evidence.<\/p>\n<p style=\"text-align: justify;\"><strong>Part -2:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The Shia leader must be infallible from birth until death and protected from sin and error or committing an evil act or an act of oppression.<\/strong><\/p>\n<p style=\"text-align: justify;\">Shia leader Ibn al-Mutahhar al-Helli says in &#8220;Nahj al-Haqq&#8221; pg.164:<\/p>\n<p style=\"text-align: justify;\">ذهبت الإمامية إلى أن الأئمة كالأنبياء ، في وجوب عصمتهم عن جميع القبائح والفواحش ، من الصغر إلى الموت ، عمدا وسهوا ، لأنهم حفظة الشرع ، والقوامون به ، حالهم في ذلك كحال النبي<\/p>\n<p style=\"text-align: justify;\">[The Imami (Shia) decided that the Imams are like the prophets, in that it is obligatory for them to be protected from all ugly indecent acts, from childhood until death, whether intentionally or by forgetfulness, because they are the preservers of Islamic laws, and the ones who apply them, their condition in this is that of the Prophet.]<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-`Allamah Muhammad Baqir al-Majlisi says in his Risalah &#8220;`Aqa&#8217;id al-Islam&#8221; pg.55:<\/p>\n<p style=\"text-align: justify;\">ثم لا بد أن تعتقد في النبي ( ص ) والأئمة (ع) بأنهم معصومون من أول العمر إلى آخره من صغائر الذنوب وكبائرها<\/p>\n<p style=\"text-align: justify;\">[And you must believe that the prophet (saw) and the Imams (as) are infallible from the beginning of their lives until the end, from small and big sins.]<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-`Allamah Muhammad Rida al-Muzaffar says in &#8220;`Aqa&#8217;id al-Imamiyyah&#8221; pg.104:<\/p>\n<p style=\"text-align: justify;\">ونعتقد أن الإمام يجب أن يكون معصوماً من جميع الرذائل والفواحش ما ظهر منها وما بطن ، من سنّ الطفولة إلى الموت ، عمداً وسهواً ، كما يجب أن يكون معصوماً من السهو والخطأ والنسيان<\/p>\n<p style=\"text-align: justify;\">[And we (Shia) believe that the Imam needs to be protected from all vices, from all apparent and hidden defects, from age of childhood until death, intentionally or by mistake, he also has to be protected from forgetfulness and error.]<\/p>\n<p style=\"text-align: justify;\">The underlined part is the belief that the Shia try to prove from the verse of the Imamah of Ibrahim (as), they say that when Allah says &#8220;My covenant will not reach the oppressors.&#8221; He (swt) means that he will not grant Imamah to any person who committed any act of oppression even if in the past.<\/p>\n<p style=\"text-align: justify;\">Although the obvious meaning of the verse is that this station shall not be granted to the one who is doing oppression at the time. To over simplify it, it is as if Allah (swt) is saying: &#8220;Do not give your Zakat to the rich.&#8221; So when the time of Zakat comes, I seek the poor and needy to offer my Zakat, regardless if this poor or needy person was rich many years ago or not.<\/p>\n<p style=\"text-align: justify;\">On the other hand, the Shia scholars such as Grand Ayatullah Kazim al-Ha&#8217;iri, he concludes in his book &#8220;al-Imamah wa Qiyadat al-Mujtama`&#8221;:<\/p>\n<p style=\"text-align: justify;\">فالآية الشريفة &#8211; اذن &#8211; تدل بوضوح على عصمة كل من ينال مقام الإمامة منذ اليوم الأول ، ولا بدّ وأن يكون الإمام معصوماً من قَبل الإمامة وبعدها<\/p>\n<p style=\"text-align: justify;\">[The noble verse clearly shows the infallibility of everyone who receives the rank of Imamah from the first day, and the Imam must be infallible before Imamah and after it.]<\/p>\n<p style=\"text-align: justify;\">So if we manage to prove that it is only speculation, that it is only a guess, then it would be sufficient to disappoint their hopes in the mentioned verse.<\/p>\n<p style=\"text-align: justify;\"><strong>Part -3:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The Shia differed with regards to this verse, some of them concluded that the term &#8220;oppressors&#8221; is a general one, this means that the Imams were never oppressors at any point in their lives, while another group of their scholars didn&#8217;t understand the verse as such.<\/strong><\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Murtada `Alam al-Huda clearly states so in his book &#8220;al-Shafi fil-Imamah&#8221; 3\/139:<\/p>\n<p style=\"text-align: justify;\">قد اعتمد بهذه الآية التي ذكرتها قوم من أصحابنا والاستدلال بها مبني على القول بالعموم ، وأن له صيغة يقتضي ظاهرها الاستغراق ، فمن لا يذهب إلى ذلك من أصحابنا لا يصح له الاستدلال بهذه الآية في هذا الموضع ، ومن ذهب إلى العموم منهم صح له ذلك<\/p>\n<p style=\"text-align: justify;\">[&#8230;ect&#8230; Those from our companions who do not consider it general cannot use this verse as evidence for this point, but those who consider it to be general then their evidence is correct.]<\/p>\n<p style=\"text-align: justify;\">Notice how he says that a group of Imami Shia believe that &#8220;Oppressors&#8221; means those who committed oppression in the past, while another group of Imami Shia believed that it referred to the one who is committing oppression when Imamah is presented to him. Which means that there was a conflict among them concerning the basis of their evidence.<\/p>\n<p style=\"text-align: justify;\"><strong>Part -4:<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>The Mushtaqq is only attributed to the one who is doing the act.<\/strong><\/p>\n<p style=\"text-align: justify;\">Defining the Mushtaqq:<\/p>\n<p style=\"text-align: justify;\">This Arabic word simply means &#8220;Derived&#8221;. A Mushtaqq is a name that is taken from an action, for example:<\/p>\n<p style=\"text-align: justify;\">The action is &#8216;Reciting&#8217;, we derive from it the name &#8216;Reciter&#8217; and this last one points to the act and the one committing it.<\/p>\n<p style=\"text-align: justify;\">Another example,<\/p>\n<p style=\"text-align: justify;\">The action is &#8216;Guarding&#8217;, we derive from it the name &#8216;Guard&#8217; which points to the act and the one committing it.<\/p>\n<p style=\"text-align: justify;\">So as long as a certain man is guarding something, let&#8217;s say a gate or a castle, the Mushtaqq(derived) name &#8216;Guard&#8217; can be attributed to him. Let&#8217;s say for example this man quit his job as guard and became a farmer, would we still be able to attribute the derived name &#8216;Guard&#8217; to him? Or would he be now called &#8216;Farmer&#8217;?<\/p>\n<p style=\"text-align: justify;\">In our case the Mushtaqq name is &#8220;Oppressor&#8221; and the action is &#8220;Oppression&#8221;. If a man repented and walked the straight path, would we still refer to him as &#8220;Oppressor&#8221;?<\/p>\n<p style=\"text-align: justify;\">Below we give examples from Shia books, that names derived(Mushtaqq) from acts cannot be attributed to the one who abandoned these acts.<\/p>\n<p style=\"text-align: justify;\">First Case: You cannot call the one whose mother had committed adultery(Zinah) and then repented &#8220;O son of adulteress(Zaniyah)&#8221;.<\/p>\n<p style=\"text-align: justify;\">Shia Shaykh ibn Idris says in &#8220;al-Sara&#8217;ir&#8221; 3\/521:<\/p>\n<p style=\"text-align: justify;\">فإن قال له يا بن الزانية ، وكانت أمه قد تابت وأظهرت التوبة ، كان عليه الحد تاما ، لأنها بعد توبتها صارت محصنة عفيفة<\/p>\n<p style=\"text-align: justify;\">[If he called him &#8216;O son of adulteress&#8217;, and his mother had repented and showed repentance, then he must be fully punished(Hadd), because after her repentance she become a chaste married woman.]<\/p>\n<p style=\"text-align: justify;\">al-`Allamah ibn al-Mutahhar al-Helli says in &#8220;Qawa`id al-Ahkam&#8221; 3\/545:<\/p>\n<p style=\"text-align: justify;\">ولو قال لابن الملاعنة : يا ابن الزانية حد ، وكذا لابن الزانية بعد توبتها ، لا قبلها<\/p>\n<p style=\"text-align: justify;\">[If he said to the one whose father forsook him &#8216;O son of an adulteress&#8217;, he gets punished, and the same goes for the son of the adulteress after her repentance, not before it.]<\/p>\n<p style=\"text-align: justify;\">al-Shaheed al-Thani in &#8220;Masalik al-Afham&#8221; 14\/430:<\/p>\n<p style=\"text-align: justify;\">ولو قال لابن الملاعنة : يا ابن الزانية ، فعليه الحد . ولو قال لابن المحدودة قبل التوبة ، لم يجب به الحد ، وبعد التوبة يثبت الحد<\/p>\n<p style=\"text-align: justify;\">[If he said so to the son of the one who is to be punished for adultery before her repentance, he is not punished, but after her repentance he gets the punishment.]<\/p>\n<p style=\"text-align: justify;\">Ayatullah Muhammad Rida in &#8220;Dur al-Mandud&#8221; 2\/133:<\/p>\n<p style=\"text-align: justify;\">لكنها قد تابت من عملها الشنيع وصارت بذلك محصنة فيكون قذفها قذف المحصنات الموجب للحد<\/p>\n<p style=\"text-align: justify;\">[But she has repented from the horrible act, and by doing so she becomes a virtuous married woman, and insulting her is like insulting the virtuous married women which requires punishment.]<\/p>\n<p style=\"text-align: justify;\">Second Case: Their explanation of verse [49:9] and their disagreement with the Mu`tazillah who claim that the Mushtaqq can be attributed to the one who left the action.<\/p>\n<p style=\"text-align: justify;\">Ayatullah `Ali Kashif al-Ghata&#8217; in &#8220;al-Nour al-Sati` fil-Fiqh al-Nafi`&#8221; 2\/122:<\/p>\n<p style=\"text-align: justify;\">إن العمل بالأركان من فعل الواجبات وترك المحرمات داخل في الإيمان أم لا والحق عدم دخوله لقوله تعالى * ( طائِفَتانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُما ) * . فإنه أثبت الإيمان لمرتكب المعصية وهو القتل ودعوى أن تسميتهم بالمؤمنين باعتبار ما كانوا كما هو مذهب المعتزلة في المشتق ( فاسدة ) لأن المشتق ليس كذلك<\/p>\n<p style=\"text-align: justify;\">[Practicing according to the pillars (of Islam) such as doing the obligatory duties and avoiding what is forbidden is not included in Belief because of Allah&#8217;s saying {If two parties of the believers fight} So Allah has proven that the one who commits disobedience (in this case killing) is a believer. As for the claim that they were referred to as &#8216;believers&#8217; because they were believers in the past, as the Mu`tazillah think, then this is corrupt because the Mushtaqq does not work like this.]<\/p>\n<p style=\"text-align: justify;\">Ayatullah Ja`far al-Subhani said in &#8220;al-Iman wal-Kufr&#8221; pg.18<\/p>\n<p style=\"text-align: justify;\">وقال سبحانه : * ( وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيئ إلى أمر الله ) * ( الحجرات &#8211; 9 ) ترى أنه سبحانه أطلق المؤمن على الطائفة العاصية وقال ما هذا مثاله : فإن بغت إحدى الطائفتين من المؤمنين على الطائفة الأخرى منهم ، والظاهر أن الإطلاق بلحاظ كونهم مؤمنين حال البغي لا بلحاظ ما سبق وانقضى ، أي بمعنى أنهم كانوا مؤمنين<\/p>\n<p style=\"text-align: justify;\">[Allah (swt) said: {If two parties of the believers fight, put things right between them; then, if one of them is insolent against the other, fight the insolent one till it reverts to God&#8217;s commandment.} You see that Allah has called the transgressing team as believers &#8230;ect&#8230; and what is apparent is that Allah called them believers while they were transgressing, not because of past actions or because they were believers in the past.]<\/p>\n<p style=\"text-align: justify;\">al-Shaheed al-Thani says in &#8220;Haqa&#8217;iq al-Iman&#8221; 70-71:<\/p>\n<p style=\"text-align: justify;\">وكون تسميتهم بالمؤمنين باعتبار ما كانوا عليه وخصوصا على مذهب المعتزلة ، فإنهم لا يشترطون في صدق المشتق على شئ حقيقة بقاء المعنى المشتق منه .<br \/>\nويمكن دفعه بأن الشارع قد منع من جواز إطلاق المؤمن على من تحقق كفره وعكسه ، والكلام في خطاب الشارع ، فلا نسلم لهم الجواب<\/p>\n<p style=\"text-align: justify;\">[And since according to the Mu`tazillah they were called &#8216;believers&#8217; because they were in this state in the past, &#8230;ect&#8230; And we can refute them by saying that Allah (swt) prohibited from calling the Kouffar as believers if they went back to their Kufr, this is according to Allah (swt) so we do not agree with their answer.]<\/p>\n<p style=\"text-align: justify;\">Explanation: The Shia scholars are saying that the Mu`tazillah claim that the only reason they were referred to as &#8220;Believers&#8221; in this verse, is because they were believers in the past. However, the Shia scholars say NO, they were obviously referred to as &#8220;Believers&#8221; while in the state of transgression, and it is against the Shia beliefs to call the Kaffir as &#8220;believer&#8221;  because he believed in the past. If we want to derive benefit from this, we can turn the table on the Shia and say: Allah would not include the oppressors in his covenant while in a state of practicing oppression, but if they repented and abandoned their faulty ways and became from the pious, then they cannot be referred to as &#8220;oppressors&#8221;, meaning anyone who repented from the progeny of Ibrahim (as) can receive the covenant since he&#8217;s not included in the &#8220;oppressors&#8221;.<\/p>\n<p style=\"text-align: justify;\"><strong>Part -5<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Shia scholars admit when commenting on the verse of Imamah that the Mushtaqq can only be attributed to the one who is currently doing the act, not the one who abandoned it.<\/strong><\/p>\n<p style=\"text-align: justify;\">al-Tabrasi confirms in his book &#8220;Majma` al-Bayan&#8221; that if the oppressor has repented then he would no longer be called an oppressor:<\/p>\n<p style=\"text-align: justify;\">لأن الله سبحانه نفى أن ينال عهده الذي هو الإمامة ظالم ومن ليس بمعصوم فقد يكون ظالماً إمّا لنفسه وإما لغيره فإن قيل إنما نفى أن يناله ظالم في حال ظلمه فإذا تاب لا يسمى ظالماً فيصح أن يناله فالجواب أن الظالم وإن تاب فلا يخرج من أن تكون الآية قد تناولته في حال كونه ظالماً<\/p>\n<p style=\"text-align: justify;\">[Because Allah (swt) denied that an oppressor would get his covenant, and the non-infallible is either oppressing himself or others, if it were said: He denied that an oppressor would get it while in a state of committing oppression, so if he repented he is no longer called an oppressor, and it would be possible for him to receive it. The response is that the oppressor even if he repented but it could still be that the verse was aimed at him when he was still in the condition of oppression]<\/p>\n<p style=\"text-align: justify;\">Basically, he accepts that the one who repents is no longer an oppressor, his argument is that the verse may still include him before repentance and this is why he thinks that it&#8217;s more logical for him to be infallible.<\/p>\n<p style=\"text-align: justify;\">Ayatullah Muhammad Sadiq al-Roohani in &#8220;Zubdat al-Usoul&#8221; 1\/143-146:<\/p>\n<p style=\"text-align: justify;\">وفيه : ان الظاهر من اطلاق المشتق ان التلبس حاصل حال النسبة لا قبلها ، وبعبارة أخرى ان الظاهر اتحاد زماني التلبس والنسبة الحملية أو اسناد الحكم إليه فالظاهر من الآية عدم نيل الخلافة في حال الظلم<\/p>\n<p style=\"text-align: justify;\">[What is apparent from attributing the Mushtaqq (Oppressors) that the act is being committed during the attribution not before it. In other words, the time of attributing (Oppressors) and the act (Oppression) is one and the same, so the apparent meaning of the verse is that one cannot receive the Khilafah while in a state of oppression.]<\/p>\n<p style=\"text-align: justify;\">Not only do the Shia use a &#8216;Dhanni&#8217; speculative weak evidence to prove infallibility from this verse, it is even worse! Because their scholars are saying that the apparent meaning of the verse opposes their view as you just read above!<\/p>\n<p style=\"text-align: justify;\"><strong>Part -6<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Shia narrations mention nothing about infallibility when explaining the verses.<\/strong><\/p>\n<p style=\"text-align: justify;\">In addition to the above and just for added benefit, the Shia do have narrations in their books where their Imams talk about this verse, and even though we have not verified their authenticity yet we will present them to the readers simply because none of them state that the verse implies infallibility.<\/p>\n<p style=\"text-align: justify;\">340 &#8211; في عيون الأخبار بإسناده إلى الرضا عليه السلام حديث طويل يقول فيه عليه السلام: ان الامامة خص الله عز وجل بها إبراهيم الخليل صلوات الله عليه وآله بعد النبوة والخلة، مرتبة ثالثة وفضيلة شرفه بها واشار بها ذكره1 فقال عز وجل: (انى جاعلك للناس اماما) فقال الخليل عليه السلام سرورا بها ومن ذريتى ؟ قال الله عز وجل: لاينال عهدى الظالمين فأبطلت هذه الآية امامة كل ظالم إلى يوم القيامة، وصارت في الصفوة.<\/p>\n<p style=\"text-align: justify;\">[In `Uyoun Akhbar al-Rida with its Isnad to al-Rida (as) &#8230;ect&#8230; Allah most high said: &#8220;My covenant shall not reach the oppressors&#8221; so this verse cancelled the Imamah of every oppressor until the day of judgement and it went to the best (of men).]<\/p>\n<p style=\"text-align: justify;\">341 &#8211; في أصول الكافي محمد بن يحيى عن أحمد بن محمد عن أبى يحيى الواسطى عن هشام ابن سالم ودرست بن أبى منصور عنه قال: قال أبو عبد الله عليه السلام: وقد كان إبراهيم عليه السلام نبيا وليس بامام، حتى قال الله: (انى جاعلك للناس اماما قال ومن ذريتى) فقال الله: (لاينال عهدى الظالمين) من عبد صنما اووثنا لايكون اماما.<\/p>\n<p style=\"text-align: justify;\">[In Usoul al-Kafi from abu `Abdillah (as): &#8230;ect&#8230;So Allah said: &#8220;My covenant shall not reach the oppressors&#8221; It is he who worshiped an idol or statue he cannot be an Imam.]<\/p>\n<p style=\"text-align: justify;\">342 &#8211; محمد بن الحسن عمن ذكره عن محمد بن خالد عن محمد بن سنان عن زيد الشحام قال: سمعت أبا عبد الله عليه السلام يقول: ان الله تبارك وتعالى اتخذ إبراهيم عبدا قبل أن يتخذه نبيا، وان الله اتخذه نبيا قبل أن يتخذه رسولا، وان الله اتخذه رسولا قبل ان يتخذه خليلا، وان الله اتخذه خليلا قبل أن يجعله اماما، فلما جمع له الاشياء (قال انى جاعلك للناس اماما) قال: فمن عظمها في عين إبراهيم (قال ومن ذريتى قال لاينال عهدى الظالمين) قال: لايكون السفيه امام التقى.<\/p>\n<p style=\"text-align: justify;\">[In Usoul al-Kafi from abi `Abdillah (as): &#8230;ect&#8230; He said: And from my progeny? He said: My covenant does not include the oppressors. The foolish cannot be the Imam of the pious.]<\/p>\n<p style=\"text-align: justify;\">344 &#8211; في كتاب الاحتجاج للطبرسى (ره) عن أمير المؤمنين حديث طويل يقول فيه: قد خطر على من ماسه الكفر تقلد مافوضه إلى أنبيائه وأوليائه بقوله لإبراهيم: (لاينال عهدى الظالمين) اى المشركين لانه سمى الشرك ظلما بقوله (ان الشرك لظلم عظيم) فلما علم إبراهيم ان عهدالله تبارك اسمه بالامامة لاينال عبدة الاصنام، قال: واجنبنى وبنى أن نعبد الاصنام).<\/p>\n<p style=\"text-align: justify;\">[In al-Ihtijaj of al-Tabrasi (rah) from Ameer al-Mu&#8217;mineen (as) &#8230;ect&#8230; &#8220;My covenant does not include the oppressors&#8221; meaning the polytheists, because He called polytheism an oppression when he said: &#8220;Shirk is a great oppression.&#8221; So when Ibrahim (as) learned that that the Imamah will not reach the idol worshipers, he said to Allah most high: &#8220;My Lord, make this land secure, and turn me and my sons away from serving idols.&#8221;]<\/p>\n<p style=\"text-align: justify;\"><strong>Part -7<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Some of the prophets of Allah (as) still committed acts of oppression but repented and turned to Allah (swt) so he forgave them, included them in his covenant as prophets whose job is to deliver Shari`ah, it did not contradict their infallibility as prophets nor do we refer to them as oppressors.<\/strong><\/p>\n<p style=\"text-align: justify;\">Prophet Adam (as) and his wife Hawwa&#8217; (as):<\/p>\n<p style=\"text-align: justify;\">{They said, &#8220;Our Lord, we have <strong>oppressed<\/strong> ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.&#8221;} [7:23]<\/p>\n<p style=\"text-align: justify;\">Prophet Musa (as):<\/p>\n<p style=\"text-align: justify;\">{He (Musa) said, &#8220;My Lord, indeed I have <strong>oppressed<\/strong> myself, so forgive me,&#8221; and He forgave him. Indeed, He is the Forgiving, the Merciful.} [28:16]<\/p>\n<p style=\"text-align: justify;\">Prophet Yunus (as):<\/p>\n<p style=\"text-align: justify;\">{And [mention] the man of the fish, when he went off in anger and thought that We would not decree [anything] upon him. And he called out within the darknesses, &#8220;There is no deity except You; exalted are You. Indeed, I have been of the<b> <\/b><strong>oppressors<\/strong>.&#8221;} [21:87]<\/p>\n<p style=\"text-align: justify;\"><strong>Part -8<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Short research on the usage of the word &#8220;Oppressor\/Oppression&#8221; in the Qur&#8217;an and its relation to infallibility.<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>1-<\/strong> All of mankind without exception are bound to oppress:<\/p>\n<p style=\"text-align: justify;\">{And He gave you from all you asked of Him. And if you should count the favor of Allah, you could not enumerate them. Indeed, mankind is oppressive and ungrateful.} [14:34]<\/p>\n<p style=\"text-align: justify;\">{And if Allah were to impose blame on the people for their oppression, He would not have left upon the earth any creature, but He defers them for a specified term. And when their term has come, they will not remain behind an hour, nor will they precede [it].} [16:61]<\/p>\n<p style=\"text-align: justify;\"><strong>2-<\/strong> Allah destroyed nations and cities because they were oppressors, not because they were not infallible:<\/p>\n<p style=\"text-align: justify;\">{And thus is the seizure of your Lord when He seizes the cities while they are committing oppression. Indeed, His seizure is painful and severe.} [11:102]<\/p>\n<p style=\"text-align: justify;\">{And for how many a city did I prolong enjoyment while it was committing oppression. Then I seized it, and to Me is the [final] destination.} [22:48]<\/p>\n<p style=\"text-align: justify;\"><strong>3-<\/strong><b> <\/b>Allah would not destroy cities and nations if their people were reformers, their infallibility is not a condition:<\/p>\n<p style=\"text-align: justify;\">{And your Lord would not have destroyed the cities unjustly while their people were reformers.} [11:117]<\/p>\n<p style=\"text-align: justify;\"><strong>4-<\/strong> Allah forgives those who oppress because he is merciful while those who insist on their oppression are punished severely:<\/p>\n<p style=\"text-align: justify;\">{They impatiently urge you to bring about evil before good, while there has already occurred before them similar punishments [to what they demand]. And indeed, your Lord is full of forgiveness for the people despite their oppression, and indeed, your Lord is severe in penalty.} [13:6]<\/p>\n<p style=\"text-align: justify;\">{O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name of disobedience after [one&#8217;s] faith. And whoever does not repent &#8211; then it is those who are the oppressors.} [49:11]<\/p>\n<p style=\"text-align: justify;\">{And those who, when they commit an immorality or oppress themselves [by transgression], remember Allah and seek forgiveness for their sins &#8211; and who can forgive sins except Allah? &#8211; and [who] do not persist in what they have done while they know. () Those &#8211; their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers.} [3:135-136]<\/p>\n<p style=\"text-align: justify;\"><strong>5-<\/strong> The non-believers and polytheists are referred to as Oppressors:<\/p>\n<p style=\"text-align: justify;\">{Rather, the Qur&#8217;an is distinct verses [preserved] within the breasts of those who have been given knowledge. And none reject Our verses except the oppressors.} [29:49]<\/p>\n<p style=\"text-align: justify;\">{And [mention, O Muhammad], when Luqman said to his son while he was instructing him, &#8220;O my son, do not associate [anything] with Allah. Indeed, association [with him] is great oppression.&#8221;} [31:13]<\/p>\n<p style=\"text-align: justify;\">{So who is more oppressive than one who lies about Allah and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?} [39:32]<\/p>\n<p style=\"text-align: justify;\">{And Moses had certainly brought you clear proofs. Then you took the calf [in worship] after that, while you were oppressors.} [2:92]<\/p>\n<p style=\"text-align: justify;\"><strong>6-<\/strong> The oppressors are a group who opposes the believers:<\/p>\n<p style=\"text-align: justify;\">{O you who have believed, spend from that which We have provided for you before there comes a Day in which there is no exchange and no friendship and no intercession. And the disbelievers &#8211; they are the oppressors.} [2:254]<\/p>\n<p style=\"text-align: justify;\">{Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?&#8221; And the oppressors say, &#8220;You follow not but a man affected by magic.&#8221;} [25:8]<\/p>\n<p style=\"text-align: justify;\">{Except those [poets] who believe and do righteous deeds and remember Allah often and defend [the Muslims] after they were wronged. And those who have oppressed are going to know to what [kind of] return they will be returned.} [26:227]<\/p>\n<p style=\"text-align: justify;\">{And those who disbelieve say, &#8220;We will never believe in this Qur&#8217;an nor in that before it.&#8221; But if you could see when the oppressors are made to stand before their Lord, refuting each other&#8217;s words&#8230; Those who were oppressed will say to those who were arrogant, &#8220;If not for you, we would have been believers.&#8221;} [34:31]<\/p>\n<p style=\"text-align: justify;\">{You will see the oppressors fearful of what they have earned, and it will [certainly] befall them. And those who have believed and done righteous deeds will be in lush regions of the gardens [in Paradise] having whatever they will in the presence of their Lord. That is what is the great bounty.} [42:22]<\/p>\n<p style=\"text-align: justify;\"><strong>7-<\/strong> Believers are ordered to stay away from the oppressors:<\/p>\n<p style=\"text-align: justify;\">{And do not incline toward those who oppress, lest you be touched by the Fire, and you would not have other than Allah any protectors; then you would not be helped.} [11:13]<\/p>\n<p style=\"text-align: justify;\"><strong>8-<\/strong> If a messenger of God were to commit oppression and then repent, Allah would forgive him:<\/p>\n<p style=\"text-align: justify;\">{And throw down thy staff! But when he saw it writhing as it were a demon, he turned to flee headlong; (but it was said unto him): O Moses! Fear not! the messengers fear not in My presence, () Save him who hath done oppression and afterward hath changed evil for good. And lo! I am Forgiving, Merciful.} [27:10-11]<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion:<\/strong><\/p>\n<p style=\"text-align: justify;\">We have illustrated above from Shia sources and the Qur&#8217;an that the verse of Imamah of Ibrahim (as) has absolutely nothing to do with infallibility, at best it is speculation, merely a small probability, and religion is not built upon such weak evidence. As for those who claim that it implies infallibility they are two types of people:<\/p>\n<p style=\"text-align: justify;\">1- One who follows what he heard without research.<\/p>\n<p style=\"text-align: justify;\">2- A sly deviant who follows his desires.<\/p>\n<p style=\"text-align: justify;\">In the end I leave you with the verse I started with, so you can verify the truth of what we said:<\/p>\n<p style=\"text-align: justify;\"><strong>{And [mention, O Muhammad], when Abraham was tried by his Lord with commands and he fulfilled them. [Allah] said, &#8220;Indeed, I will make you a leader for the people.&#8221; [Abraham] said, &#8220;And of my descendants?&#8221; [Allah] said, &#8220;My covenant does not include the oppressors.&#8221;}<\/strong><b> <\/b><strong>[2:124]<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Praise be to Allah and his glory be to Him. I shall begin by explaining the title of this rather advanced topic Insha-Allah. First we present the following Qur&#8217;anic verse from Surat al-Baqarah: {And [mention, O Muhammad], when Abraham was <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/08\/15\/verse-of-imamat-ibrahim-shia-understanding-of-oppressors-is-it-qati-or-dhanni\/\" title=\"Verse of Imamat Ibrahim: Shia understanding of &#8220;Oppressors&#8221;, is it Qat`i or Dhanni?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[],"class_list":{"0":"post-587","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/587","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=587"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/587\/revisions"}],"predecessor-version":[{"id":590,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/587\/revisions\/590"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=587"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=587"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=587"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}