{"id":593,"date":"2013-08-16T23:52:52","date_gmt":"2013-08-16T23:52:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=593"},"modified":"2013-08-16T23:55:45","modified_gmt":"2013-08-16T23:55:45","slug":"response-to-imam-sadiq-a-s-on-ghadeer","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/08\/16\/response-to-imam-sadiq-a-s-on-ghadeer\/","title":{"rendered":"Response to: Imam Sadiq (a.s) On Ghadeer"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=593\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>This is a response to the article by RevisitingtheSalaf.org, written on the 3rd of November, 2012, entitled: Imam Sadiq (a.s) On Ghadeer, which can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/11\/eid-al-ghadeer-mubarak-to-all-believers.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS quoted this narration from his Shia book al-Kafi:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Mohammad ibn Yahya has narrated from Mohammad ibn Al-Hussain from Al-Hajjaal from Abdul Samad ibn Bashir from Hassan Al-Jamal who said: I took Aba Abdullah Imam Al-Sadiq (a.s), from Madinah to Makkah and we went to the Masjid of Al-Ghadeerr, then Imam (a.s), recipient of divine supreme covenant, looked to the left side of the Mosque and said: &#8220;That place is the footstep of the Messenger of Allah (saw), recipient of divine supreme covenant, when he said: &#8220;Of whomsoever I am master, Alee is his master!&#8221; Then Imam Al-Sadiq (a.s), turned to another direction and said: &#8220;That place is where pavilion of Abi Bakr and Umar and Salim Mawla Abi Hudhaifa and Abi Ubaida Al-Jarrah was located, when they saw the Messenger of Allah (saw), recipient of divine supreme covenant, took the hand of the Commander of Faithful Imam Alee (a.s), recipient of divine supreme covenant, and held it high. They said to one another: &#8216;Look his eyes how they turn (i.e. the eyes of the Messenger of Allah), as if they are the eyes of a madman.&#8217; Then Jibreel (a.s) came down and revealed the following verse:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<\/blockquote>\n<p style=\"text-align: justify;\">Through this Shia report he attempts to attack Abu Bakr (ra), `Umar (ra) and the other companions who were mentioned in the text above.<\/p>\n<p style=\"text-align: justify;\">We will analyze this text.<\/p>\n<p style=\"text-align: justify;\"><strong>Let us bring before the readers the testimony of Shia scholar in regards to the presence of reports from the Sabaite sect in Shia books, and that the Sabaities were filled with hatred towards Abu Bakr(ra) and `Umar(ra):<\/strong><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Esteemed Shia scholar Jafri in his book ‘The Origins and Early Development of Shi‘ah Islam’ (p. 300) states: There is another important point that must be discussed here briefly. <span style=\"text-decoration: underline;\">A considerable number of traditions are to be found, especially in the earliest Shi‘i collection of hadith, Al-Kafi<\/span>, which describe the Imams as supernatural human beings. <span style=\"text-decoration: underline;\">What was the origin of these traditions, and to what extent are the Imams themselves responsible for them<\/span>? These traditions are reported, as indeed are all Shi‘i traditions, on the authority of one of the Imams, in this case from Al-Baqir and Ja‘far. <span style=\"text-decoration: underline;\">But were these Imams really the authors of such traditions, which describe their supernatural character? The first thing which must be noted in this connection is that while Al-Baqir and Ja‘far themselves lived in Medina, most of their followers lived in Kufa. This fact brings us to a crucial problem. Kufa had long been a centre ofghulat speculations and activities<\/span>. Whether ‘Abd Allah bin Saba, to whom the history of theghulat is traced, was a real personality or not, the name as-Saba’iyya is often used to describe the ghulat in Kufa who believed in the supernatural character of Ali. According to the heresiographers, <span style=\"text-decoration: underline;\">Ibn Saba was the first to preach the doctrine of waqf (refusal to recognise the death of ‘Ali) and the first to condemn the first two caliphs in addition to ‘Uthman<\/span>.<\/p>\n<p style=\"text-align: justify;\">(Jafri, The Origins and Early Development of Shi‘a Islam, p. 300, Ansariyan Publications, Qum) .<\/p>\n<p>&nbsp;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">We find that the Shia scholars questions the reliability of some reports in Shia books, especially Al-Kafi (the book quoted by RTS), and this Shia scholar also throws light on the fact that, Imams lived in Medina, where as their followers lived in Kufa which was the center of extremists and exaggerators(Ghulat), also Shia scholar says that the first to condemn first two Caliphs (Abu Bakr and Umar) was Ibn Saba the Jew and his Sabaite Shia followers.<\/p>\n<p style=\"text-align: justify;\"><strong>Testimony of Shia scholar that the Sabaites attributed fabricated reports to Ahlelbayt, and those fabrications have authentic chains:<\/strong><\/p>\n<p style=\"text-align: justify;\">Esteemed Shia scholar of Hadith “Muhyee al-Deen al-Musawi al-Ghurayfi” “محي الدين الموسوي الغريفي” in his book “Qawa’ed al-Hadith” “قواعد الحديث” page 135 says:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كما وأن كثيراً من الأحاديث لم تصدر عن الأئمة (ع) ، وإنما وضعها رجال كّذابون ونسبوها اليهم ، إما بالدس في كتب أصحابهم أو بغيره (١). وبالطبع لا بد وأن يكونوا قد وضعوا لها أو لأكثرها أسناداً صحاحاً ، كي تقبل حسبما فرضته عملية الدس والتدليس. وحيث لا علم لنا بتلك المجموعة من الأخبار المؤلفة من ذينك الطائفتين أعني الموضوعة ، والصادرة تقية ، ولا طريق لنا الى تمييزها عن الأخبار المعتبرة فكيف يسوغ العمل بكل خبر سالم السند من الضعف ، مع احتمال أن يكون من تلك المجموعة التي لا يصح العمل بها؟. وترك العمل بجميع الأخبار المعتبرة سنداً المروية عن أهل البيت (ع) باطل قطعاً ، حيث لا طريق الى معرفة الأحكام الصادرة عنهم (ع) غالباً إلا تلك الأخبار ، فيتعين الرجوع الى فقهائنا الأقدمين في تمييز الحجة منها عن غيره لكثرة القرائن لديهم ، فيكشف عملهم بخبر عن عدم كونه من تلك المجموعة ، وقد فرضناه سالم السند من الضعف فيكون حجة ، كما يوجب إعراضهم عن خبر قوة احتمال كونه منها فيسقط عن الاعتبار.<\/p>\n<p style=\"text-align: justify;\">“And that many of the narrations were not told by the Imams (ra) but they were fabricated by liars who attributed them to the Imams by inserting them into the books of their companions or by other means . And of course they must have placed for these narrations or to most of them authentic chains of narrators so that they may be accepted. And as we cannot tell the difference between both groups of narrations, I mean the fabricated ones and the ones issued by Taqqiyah and we have no way of making a distinction so how can we still work with the narrations of authentic chains with the possibility of them being from that group? Abandoning the authentic narrations of Ahlul-Bayt (ra) is definitely wrong as we cannot know their rulings except through these narrations , which is why we must return to our early Fuqahaa (scholars) as they have lots of evidence to make the distinction between the narrations, their knowledge proves that a narration is not from that group and if the chain is good then we work with it as a Hujjah, while others could have strong chains but since it is suspected of being from that group then it is dropped and abandoned.”<\/p>\n<p style=\"text-align: justify;\">(Qawa`ed al-Hadith page 135)<\/p>\n<p style=\"text-align: left;\">\n<\/blockquote>\n<p style=\"text-align: justify;\">Now, after referring these two testimonies of esteemed Shia scholars , we came to know that, there existed Sabaites(Ghulat) in Kufa, They believed in supernatural character of Imams and they hated Abu Bakr(ra) and Umar(ra). And they fabricated reports with authentic chains and attributed them to Imams of Ahlelbayt. So we need to verify even the texts of narrations in accordance to rule taught by Ahlelbayt.<\/p>\n<p style=\"text-align: justify;\"><strong>How to verify the authenticity of Shia reports according to the rule taught by Ahlelbayt?<\/strong><\/p>\n<p style=\"text-align: justify;\">Imams from Ahlelbayt have taught a principle to judge narrations attributed to them, by comparing the text with the holy Quran. If the text agrees with Quran then it must be accepted, but if it goes against Quran then those are to be rejected.<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">`Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abdallah (a.s.) who has said the following.:&#8221;The holy Prophet (s.a.), &#8220;Over every truth there is a reality and above every valid issue there is light. Whatever agrees with the holy Quran you must follow it and whatever does not agree disregard it.&#8221;<\/p>\n<p style=\"text-align: justify;\">(Al kafi H 197, Ch. 22, h 1).<\/p>\n<p style=\"text-align: justify;\">Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from Ali ibn ‘Uqba from Ayyub ibn Rashid from abu ‘Abdallah (a.s.) who has said the following:&#8221;Of Hadith whatever does not agree with the holy Quran is a useless statement.&#8221;<\/p>\n<p style=\"text-align: justify;\">(Al kafi H 200, Ch. 22, h 4).<\/p>\n<p style=\"text-align: justify;\">Imam Baqir(ra) said: ” What ever reaches you, whether it is whatever we have said, or what others have said about us, you should reflect on it, accept it if it is in the line with quran and reject it if it violates the quran.<\/p>\n<p style=\"text-align: justify;\">(At –toose, Al amalee, vol 1, page 237).<\/p>\n<p style=\"text-align: justify;\">\n<\/blockquote>\n<p style=\"text-align: justify;\">Thus we find that, in order to check the text of a report, we need to verify it with Quran, if that reports DOES NOT AGREE with Quran then it must be rejected. So we will be using the same rule, to verify the Hadeeth used by RTS which attacks the personality of Imam Abu Bakr(ra) and Imam `Umar(ra) and some other Sahaba(ra) who took part in battle of Badr, and who accepted Islam, when accepting Islam was life threatening and very difficult.<\/p>\n<p style=\"text-align: justify;\"><strong>The narration used by RTS goes against Quran:<\/strong><\/p>\n<p style=\"text-align: justify;\">As we already know, the Imams from Ahlelbayt taught us the golden rule to verify the text of a Hadeeth using Qur&#8217;an, So let us verify this Hadeeth using the principle taught by these Imams of Ahlelbayt.<\/p>\n<p style=\"text-align: justify;\">The hadeeth quoted by RTS shows that, When Prophet Muhammad(Saw) declared Alee(ra) as Master, seeing this noble Sahaba(ra) of Prophet(Saw), said to each other that, “&#8217;<span style=\"text-decoration: underline;\">Look his eyes how they, as if they are the eyes of a madman<\/span>” (Ma’azAllah). Then Allah(swt) revealed this verse: When the disbelievers listen to you reciting the Quran they almost try to destroy you with their piercing eyes. <span style=\"text-decoration: underline;\">Then they say, &#8220;He is certainly insane&#8221;<\/span>.(Quran 68:51, Shia translator Muhammad Sarwar).<\/p>\n<p style=\"text-align: justify;\">Another Shia translation: Those who disbelieve would almost cause your death with their eyes w<span style=\"text-decoration: underline;\">hen they hear this Qur’an and they say: &#8220;He is insane<\/span>!&#8221;(Quran 68:51, The Light of The Holy Qur’an)<\/p>\n<p style=\"text-align: justify;\">One more translation: The disbelievers almost strike you down with their <span style=\"text-decoration: underline;\">looks when they hear the Quran. They say, ‘He must be mad<\/span>!’(68:51)[Translator Abdel Haleem]<\/p>\n<p style=\"text-align: justify;\">A proper reading of this verse is sufficient to realize that this report is actually a fabrication of Sabaites. Because in this verse, Allah(swt) says that, The ones who said those derogatory words for Prophet(Saw) did that listening to Quran. Those words were not said by people, out of envy due to a person being made master or being given a high rank, rather the Quranic verse clearly shows that those words were said by disbelievers of Makkah, due to their listening to Glorious Quran. That is why the next verse of Quran says: The Quran is nothing but a reminder from God to mankind.( Quran 68:52, Shia translator Muhammad Sarwar).<\/p>\n<p style=\"text-align: justify;\">But as we see, the narration used by RTS states, those derogatory words were said by people when Ali(ra) was made Master and when the Prophet(Saw) was turning his eyes. Whereas, the Quran states that the people said those words while listening to the Quran. The reason indicated by this Quranic verse for saying such derogatory words was that it was due to listening to the Quran, it has no similarity or resemblance or relation to the view that people said those derogatory words out of envy after seeing someone being made master. So the Quran contradicts the narration quoted by RTS which proves that it is not reliable. The ones mentioned are the disbelievers(Kuffar) of Makkah who would envy when they listened to the recitation, not the Muslims who increased in faith after listening.<\/p>\n<p style=\"text-align: justify;\">Let us present the readers some Scholarly Commentaries of this verse (68:51) from both Shia and Sunni commentators to strengthen our view that those abusive words were the outcome of listening to the Quran:<\/p>\n<p style=\"text-align: justify;\">1.Shia tafseer of Pooya Ali:<\/p>\n<p style=\"text-align: justify;\">When disbelievers found themselves helpless against the force of the Quran, in the intensity of their hatred, they looked at the Holy Prophet as if they would &#8220;eat him up&#8221; or trip him up, or disturb him from his position of stability. They used all sorts of terms of abuse in frustration-mad, possessed etcetera-but the true message of Allah prevailed, and it is made an eternal source of guidance to all mankind.(commentary for 68:51).<\/p>\n<p style=\"text-align: justify;\">2. Shia Tafseer The Light of The Holy Qur’an:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The closing Verses of the Chapter resumes the point mentioned in the opening of the Chapter regarding the false ascription of insanity to the Noble Prophet (SAW) by his enemies, saying the disbelievers would almost cause his death with their eyes upon hearing the Qur’anic Verses and falsely claim that he is insane. The last blessed Verse of the Chapter is saying that this Qur’an is but an awakening and a reminder to the worlds whose teachings and warnings are enlightening, its illustrations are meaningful, its encouragements and glad tidings are promising to the spirit and all in all it awakens the neglectful and reminds them of their obligations. How one may falsely claim that the Messenger of Allah is insane? The Arabic word dhikr denotes reminder as the Holy Qur’an serves as a Reminder to all. (The Light of The Holy Qur’an by Ayatullah Sayyid Kamal Faghih Imani and A Group of Muslim Scholars, under explanation of verse 68:51)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Some Sunni commentaries:<\/p>\n<p style=\"text-align: justify;\">1. Tafseer Jalayn:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">Indeed those who disbelieve would almost throw you down [to the ground] (read la-yuzliqūnaka or la-yazliqūnaka) with their looks, looking at you in a severe way, almost hurling you to the ground or making you fall from your place, when they hear the Reminder, the Qur’ān, and they say, out of envy: ‘He is truly a madman!’, on account of the Qur’ān that he has brought.(tafseer jalayn)<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">2. Tafseer Ibn Abbas:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">(And lo! those who disbelieve) the disbelievers of Mecca (would fain disconcert thee) would kill you (with their eyes) and it is said this means: they would give you the evil eye (when they hear the Reminder) when they hear you recite the Qur&#8217;an, (and they) i.e. the people of Mecca (say: Lo! he is) i.e. Muhammad (indeed mad) bewitched;( Tanwîr al-Miqbâs min Tafsîr Ibn ‘Abbâs).<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">3.Tafseer Ibn Katheer:<\/p>\n<blockquote><p>(and they say: &#8220;Verily, he is a madman!&#8221;) meaning, they cut at him with their eyes and attack him with their tongues saying, &#8220;Verily, he is a madman.&#8221; They say this because he came with the Qur&#8217;an.<\/p><\/blockquote>\n<p style=\"text-align: justify;\">So in the light of these commentaries for (68:51) by both Shia and Sunni commentators we find that, the disbelievers used such an abusive term for the Prophet (Saw) due to hearing the Quran, not due to anyone being made Master, as the fabricated narration of RTS states.<\/p>\n<p style=\"text-align: justify;\"><strong>Surah Qalam is Makkan Surah:<\/strong><\/p>\n<p style=\"text-align: justify;\">There is a consensus among the scholars that Surat al-Qalam was revealed in Makkah as stated by al-`Allamah al-Imam al-Suyuti in al-Itqaan (p.31-49)<\/p>\n<p style=\"text-align: justify;\">Shia tafseer, The Light of The Holy Qur’an states:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">The Chapter, revealed in Mecca, has 52 Verses. Some Qur’an exegetes have entertained doubts about the Revelation of all the blessed Verses of the Chapter in Mecca, though the Chapter stands in total harmony with Meccan Chapters in terms of tone and content, since above all, it treats of the Noble Prophet’s (SAW) Prophetic call and confrontation with the foes who regarded him as insane, call to patience and steadfastness, and warning the opponents against Divine torments. (The Light of The Holy Qur’an by Ayatullah Sayyid Kamal Faghih Imani and A Group of Muslim Scholars, introducation of Surah 68).<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Allama Mawdoodi states in his tahfeem ul Quran:<\/p>\n<blockquote><p>Period of Revelation:This too is one of the earliest surahs to be revealed at Makkah, but its subject matter shows that it was sent down at the time when opposition to the Holy Prophet (upon whom be peace) had grown very harsh and tyrannical.(Tahfeem ul Quran, , introduction of Surah 68).<\/p><\/blockquote>\n<p style=\"text-align: justify;\">Thus, we find that Surah Al Qalam(68) was revealed in Makkah, however the fabricated narration used by RTS, talks about incident of Ghadeer and verse being revealed at that time, the incident of Ghadeer occurred many years after Prophet(Saw) migrated from Makkah. In other words, Surah Al Qalam was revealed many years before the incident of Ghadeer took place, which proves that the report used by RTS is a fabrication of Sabaites.<\/p>\n<p style=\"text-align: justify;\"><strong>Asbaab Al-Nuzool:<\/strong><\/p>\n<p style=\"text-align: justify;\">Let us look at the &#8216;Sabab Al-Nuzool&#8217; (&#8220;occasion\/circumstance of revelation&#8221;) of the Ayah to further strengthen the fact that (68:51) was revealed in regards to Disbelievers not for any companion of Prophet Muhammad(Saw).<\/p>\n<p style=\"text-align: justify;\">Comment on verse 51 of Surah 68: Hence, [be patient] even though they who are bent on denying the truth would all but kill thee.<\/p>\n<blockquote>\n<p style=\"text-align: justify;\">This verse was revealed when the disbelievers wanted to give the evil eye to the Messenger of Allah, Allah bless him and give him peace. Some people from the Quraysh looked once at him and said: “We have never seen anyone like him or like his proofs”. The Banu Assad were renowned for their evil eye. A fat camel or cow would pass by one of them and, after giving it the evil eye, he would say to his slave-girl: “O girl, take a large basket and a silver coin and bring us some of the meat of this!” The camel or cow would fall dead straight after that and would then be hamstrung. Said al-Kalbi: “There was a man from the Arabs who used to abstain from food for two or three days and then raise part of his tent, upon the passing by of cattle, and say: ‘There are no grazing camels or sheep today better than these’, and the cattle would not proceed far before some of them would fall dead. The disbelievers requested this man to give the evil eye to the Messenger of Allah, Allah bless him and give him peace, but Allah, exalted is He, protected His Prophet and revealed this verse”.( Asbaab Al-Nuzool&#8217; by Abu Al-Hassan Ali Ibn Ahmad Ibn Muhammad Ibn Ali Al-Wahidi).<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">As we can see, the verse is clearly in regards to the Kuffar(disbelievers), it has no relation with the likes of Abu Bakr, Omar, Salim the Mawla of Abu Hudhayfa and Abu Ubaydah Ibn Al-Jarrah, all Badriyeen Sahaba (those who participated in the Badr battle). The whole verse has got nothing to do with the Badri Sahaba, let alone if we read it in the proper context.<\/p>\n<p style=\"text-align: justify;\"><strong>Narration used by RTS contradicts another authentic Shia narration:<\/strong><\/p>\n<p style=\"text-align: justify;\">The narration used by RTS not only goes against Quran, rather it even goes against a different narration present in the same book Al kafi.<\/p>\n<p style=\"text-align: justify;\">al-Kafi 2\/224:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنْ مَسْأَلَةٍ فَأَبَى وَ أَمْسَكَ ثُمَّ قَالَ لَوْ أَعْطَيْنَاكُمْ كُلَّمَا تُرِيدُونَ كَانَ شَرّاً لَكُمْ وَ أُخِذَ بِرَقَبَةِ صَاحِبِ هَذَا الْأَمْرِ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَلَايَةُ اللَّهِ أَسَرَّهَا إِلَى جَبْرَئِيلَ ( عليه السلام ) وَ أَسَرَّهَا جَبْرَئِيلُ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ أَسَرَّهَا مُحَمَّدٌ إِلَى عَلِيٍّ ( عليه السلام ) وَ أَسَرَّهَا عَلِيٌّ إِلَى مَنْ شَاءَ اللَّهُ ثُمَّ أَنْتُمْ تُذِيعُونَ ذَلِكَ &#8230; فاتقوا الله و لا تذيعوا حديثنا<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Yahya, from Ahmad bin Muhammad, from Ahmad bin Muhammad bin abi Nasr that he said: I asked abu al-Hassan al-Rida (as) about a matter but he refused to answer, then he said: If we were to give you all that you request, it would bring evil upon you, and the one responsible for this affair(infallible Imam) would lose his neck. abu Ja`far (as) said: The Wilayah of Allah, He told it to Jibreel (as) secretly, and Jibreel (as) told it to Muhammad (SAWS) secretly, and Muhammad (SAWS) told it to `Ali (as) secretly, and `Ali (as) told it secretly to whomever Allah wanted, but you(shia) announce it (&#8230;) so fear Allah and do not publicly announce our Hadiths &#8220;]<\/p>\n<p style=\"text-align: justify;\">Majlisi: Sahih &#8211; al-Mir&#8217;at 9\/192.<br \/>\nBehbudi: Sahih al-Kafi 1\/99.<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">According to this authentc Shia hadeeth, Prophet (SAWS) did not announce openly the Wilayah of `Ali (ra), it was told in SECRET to reliable people. Thus if this was the case then, there was no reason for any Sahabi of Prophet(Saw) to say or object, because when Mastership of Ali(ra) was not declared openly, then this itself shows that, nothing as mentioned in fabricated report would occur.<\/p>\n<p style=\"text-align: justify;\">However, if RTS tries to claim that even in Sunni books, there are ahadeeth present regarding Ali(ra) being called as Mawla, then we say that, it was not regarding Mastership rather it was regarding compassion or reverence. And Sheikhein accepted it whole heartedly. That is why Umar(ra) during his Caliphate(let alone when he was not in authority), called Ali(ra) as his Mawla, as found in both Shia and Sunni books.<\/p>\n<blockquote>\n<p style=\"text-align: right;\">عن سالم قال: قيل (للخليفة) عمر: نراك تصنع بعلي شيئاً لا تصنعه بأحد من أصحاب رسول الله صلى الله عليه وسلم؟ فقال: إنه مولاي.<br \/>\nوعن الباقر قال: جاء أعرابيان إلى (الخليفة) عمر يختصمان، فقال عمر: يا أبا الحسن، اقض بينهما. فقضى على أحدهما، فقال المقضي عليه: يا أمير المؤمنين، هذا يقضي بيننا؟ فوثب إليه عمر فأخذ بتلبيبه ولبّبه، ثم قال: ويحك ما تدري من هذا؟! هذا مولاي ومولى كل مؤمن، ومن لم يكن مولاه فليس بمؤمن<br \/>\nالمصدر:<br \/>\nالبحار: ص 124 ج 40<\/p>\n<p style=\"text-align: justify;\">Narrated Salem: they said to caliph Umar: we see you treating Ali like you treat no other of the Companions of the Prophet PBUH? he said: He is my Mawla(friend).<br \/>\nImam al Baqir said: Once two wondering Arabs came to the caliph Umar so that he may Judge between them, So umar said to Ali: O Abu al Hassan why don’t you Judge between them. So he made his ruling on one of the two, Then That wondering Arab said: o Ameer al mumineen(Umar) Do you let this(man) judge between us!? So Umar quickly stood up and shouted at the Man: How dare you, do you not know who this is? He is my Mawla(friend) and the Malwa of every believer and if he’s not your Malwa then you’re not a believer.<\/p>\n<p style=\"text-align: justify;\">[Shia Source: bihar al Anwar 40\/124.]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">Similar is reported in sunni books:<\/p>\n<p style=\"text-align: justify;\">Imam Ibn Hajar al-Makki in his al-Sawaiq al-Muhriqah (Musassat al-Risalat, Beirut, first print, 1997; annotators: Abdul-Rahman ibn Abdullah al-Turki and Kamil Muhammad al-Khurat) 1\/110 states about Umar:<\/p>\n<blockquote><p>الدارقطني و أخرج أيضا أنه قيل لعمر إنك تصنع بعلي شيئا لا تصنعه بأحد من أصحاب النبي فقال إنه مولاي<br \/>\nDarqutni has narrated that someone said to Umar: “Why do you treat Ali differently from the other Sahabah of the Prophet?”. He said: “Because Ali is my Mawla“.<\/p><\/blockquote>\n<p style=\"text-align: justify;\">We find in these reports that Umar(ra) EVEN during his caliphate called Ali(ra) as his mawla, in the same way as he did at the time of incident of Ghadeer. Wise and unbiased readers can realize that, here Umar(ra) didn’t mean to say that Ali(ra) was his Master\/Caliph, if someone tries to argue then it will be stupidity, because why would Umar do so during his Caliphate? Umar(ra) was actually rebuking the Arab by saying that, Ali was close friend[Mawla] of Umar, that is why he treats Ali in a special manner. Importantly, why would Umar(ra) during his Caliphate call Ali(ra) his Mawla, if he had a problem when Prophet(Saw) called Ali(ra) as Mawla ? This shows that the report used by RTS is nothing but a fabrication of Sabaites.<\/p>\n<p style=\"text-align: justify;\"><strong>The fabrication of Sabaites used by RTS is Irrational:<\/strong><\/p>\n<p style=\"text-align: justify;\">The matn (Text) is a scenario full of hatred where Abu Bakr(ra), Umar(ra), the trustworthy of this Ummah, Abu Ubaydah Ibn Al-Jarrah and even Salim the Mawla (SERVANT) of Abu Hudhayfah are presented as enemies of the Prophet(saw)! The same people who were from the first and foremost believers, they accepted Islam when accepting Islam would put a person in all sorts of worldly problems, from persecution to social boycott and from torture to death. Yet, these people didn&#8217;t care about their lives, wealth or anything and accepted Islam and stood firm upon it. That is why several verses of Quran were revealed which praised the acts and beliefs of people among whom these Sahaba(ra) were included, such as Quran:<\/p>\n<p style=\"text-align: justify;\">(8:72);(8:74);(48:29);(8:6263);(59:8);(9:20);(16:41);(48:29);(9:100);(4:115); (2:13);(48:18-19);(3:68);(9:88);(9:40), and many more.<\/p>\n<p style=\"text-align: justify;\">The same people, who risked their lives, their wealth, their property, suffered torture, boycott and left their land for Islam and Prophet Muhammad(saw), these people spoke such derogatory words for Prophet Muhammad(Saw) seeing Ali(ra) made a master, as the fabrication of Sabaites states, this is nonsensical, if one looks at it, from an unbiased and fair minded perspective. Importantly, Salim the servant of Abu Hudhayfah, who got freedom due to Islam and Prophet Muhammad(Saw) , who couldn&#8217;t even imagine of becoming a leader due to presence of some high ranking Muslims, why would He object Ali(ra) being made Master(if at all he was made) in such a derogatory manner? When we ponder over these facts in fair minded manner, we realize that, the report used by RTS is nothing but a fabrication of Sabaites, which is irrational and irrational.<\/p>\n<p style=\"text-align: justify;\"><strong>Conclusion:<\/strong><\/p>\n<p style=\"text-align: justify;\">The report used by RTS is a clear cut fabrication by the extremist Shia Sabaite sect which found its way to Shia books just like many others. When we apply the rule of analyzing the text of reports with Quran, we found that this report goes against the verse of Quran, which makes it useless. Also it goes against the apparent understanding of Quran, which we proved presenting commentaries of Shia and Sunni scholars. It even goes against the Asbaab Al Nuzool of the verse and the time period of revelation of the Surah Qalam. Moreover, it goes against another authentic hadeeth present in the same book Al Kafi. Last but not the least, it is irrational and non-sensical fabrication of Sabaites.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>This is a response to the article by RevisitingtheSalaf.org, written on the 3rd of November, 2012, entitled: Imam Sadiq (a.s) On Ghadeer, which can be found here. RTS quoted this narration from his Shia book al-Kafi: Mohammad ibn Yahya has <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/08\/16\/response-to-imam-sadiq-a-s-on-ghadeer\/\" title=\"Response to: Imam Sadiq (a.s) On Ghadeer\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,4],"tags":[],"class_list":{"0":"post-593","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/593","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=593"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/593\/revisions"}],"predecessor-version":[{"id":596,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/593\/revisions\/596"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=593"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=593"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=593"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}