{"id":616,"date":"2013-08-24T15:27:09","date_gmt":"2013-08-24T15:27:09","guid":{"rendered":"http:\/\/twelvershia.net\/?p=616"},"modified":"2013-08-28T18:43:32","modified_gmt":"2013-08-28T18:43:32","slug":"response-to-is-allah-swt-pleased-with-the-companions","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/08\/24\/response-to-is-allah-swt-pleased-with-the-companions\/","title":{"rendered":"Response to: Is Allah (swt) Pleased with the Companions?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=616\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on RevisitingtheSalaf entitled: Is Allah (swt) Pleased with the Companions? The article was published on the 7<sup>th<\/sup> of November, 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2012\/11\/allah-swt-pleased-with-companions-of.html\" rel=\"nofollow external\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">In this article, RTS attempts to prove that the companions broke their covenant with Allah (subhanahu wa ta&#8217;ala) and are doomed to hellfire due to this.<\/p>\n<p style=\"text-align: justify;\">RTS uses the following verse to prove a point:<\/p>\n<p style=\"text-align: justify;\"><strong>إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَى نَفْسِهِ وَمَنْ أَوْفَى بِمَا عَـهَدَ عَلَيْهِ اللَّهَ فَسَيُؤْتِيهِ أَجْراً عَظِيماً<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Verily, those who give pledge to you, they are giving <\/strong><br \/>\n<strong>pledge to Allah. The Hand of Allah is over their hands. Then whosoever breaks his pledge, breaks it only to his own harm; and whosoever fulfills what the covenants he makes with Allah, He will bestow on him a great reward.  (48.10)<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS suggests that this verse implies that anyone that breaks the covenant will receive great punishment, however, when we return to the Qur’an, we realize that this verse comes before the verse that says:<\/p>\n<p style=\"text-align: justify;\"><strong>{<\/strong><strong>لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا<\/strong><strong>}<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>{Indeed, Allah was pleased with the believers when they gave the Bay&#8217;ah (pledge) to you (O Muhammad) under the tree. He knew what was in their hearts, and He sent down As-Sakinah (calmness and tranquillity) upon them, and He rewarded them with a near victory.}<\/strong> <strong>(48:18)<\/strong><\/p>\n<p style=\"text-align: justify;\">Notice that Allah (subhanahu wa ta&#8217;ala) expresses satisfaction towards the believers, without the precondition set above. <strong>As the verse says, He knows what is in their hearts, which means that He allows them to receive his satisfaction in all cases.<\/strong> The condition of keeping the pledge, whether it is fighting to the death or to not flee, is irrelevant, for no battle took place either way according to the consensus of the historians. Meaning, the satisfaction of Allah (subhanahu wa ta&#8217;ala) was due to the faith in their hearts, which caused them to make their pledge, not due to the actions that came following their pledge.<\/p>\n<p style=\"text-align: justify;\">This explanation alone is sufficient to refute the general argument made by RTS. However, there are some specific points about some specific companions that need to be examined separately.<\/p>\n<p style=\"text-align: justify;\">RTS argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Umar ibn Al-Khattab was among those who fled, and his son Abdullah Ibn Umar sheds further light on this by stating that barely one hundred men remained on the battlefield of Hunayn. In other words, more than 1300 men had broken their pledge given at Hudaibiya.<\/span><\/p>\n<p style=\"text-align: justify;\">This is a rather awkward argument since the pledge was specific for Hudaibiya, since the Prophet (salalahu alaihi wa salam) asked for it on that occasion. Such a pledge wasn’t something common for the Prophet (salalahu alaihi wa salam) to take from his companions, and there is no evidence that suggests that this pledge is binding upon all battles. If we assume that this was the case, then why did Allah (subhanahu wa ta&#8217;ala) say that He is satisfied with them when He knows that they will be breaking this pledge?<\/p>\n<p style=\"text-align: justify;\">The proof is that when some did flee, Allah forgave them straight away and did not condemn them to hell like the Takfeeri writers of RTS:<\/p>\n<p style=\"text-align: justify;\">{And [He also forgave] the three who were left behind [and regretted their error] to the point that the earth closed in on them in spite of its vastness and their souls confined them and they were certain that there is no refuge from Allah except in Him. Then He turned to them so they could repent. Indeed, Allah is the Accepting of repentance, the Merciful.} [9:118]<\/p>\n<p style=\"text-align: justify;\">RTS then chose to attack Abu Al-Ghadiya Al-Juhani, the killer of Ammar. RTS quotes several statements from early scholars, trying to imply that Abu Al-Ghadiya is one of those that gave a pledge under the tree. Ironically, RTS starts off with Ibn Taymiyyah, who says, “It is said he was one of those” implying that there is doubt about this in the first place. This is since the attribution of Abu Al-Ghadiyah to being one of those that pledged under the tree was by a late fourth century Andalusian scholar (Ibn Hazm). His opinion has little to no weight since nobody before him has suggested the same. This is why Ibn Taymiyyah says, “We testify that Ammar is in heaven, and his killer, <strong>if<\/strong> he is from the people of <em>radhwan<\/em>(those that gave the pledge under the tree), is in heaven.”<\/p>\n<p style=\"text-align: justify;\">RTS, incorrectly attributed this statement to Ibn Hazm, and incorrectly translated it as:<\/p>\n<p style=\"text-align: justify;\">&#8220;We swear heaven for Ammar and as for his killers they believe that heaven is for him also&#8221;.<\/p>\n<p style=\"text-align: justify;\">However, as we can see from the words of Ibn Taymiyyah; he has doubt that Abu Al-Ghadiya is from the people of <em>radhwan<\/em>.<\/p>\n<p style=\"text-align: justify;\">RTS then quotes Ibn Atheer and Al-Thahabi, in an attempt to establish that Abu Al-Ghadiya was under the tree. However, all RTS did was quote that he gave a pledge to the Prophet (salalahu alaihi wa salam). RTS is either ignorant or deceptive about the fact that there were many pledges given to the Prophet (salalahu alaihi wa salam) throughout his prophet-hood, from the time of Makkah to the end of his days. The narrations that suggest that he pledged allegiance to the Prophet (salalahu alaihi wa salam) is clear that this was on the day of <em>`Aqabah<\/em> (see Musnad Ahmad 13\/123), while there is no evidence that he gave a pledge on another day. So, it is possible that Ibn Hazm made a mistake here and thought it was the pledge that was given under the tree.<\/p>\n<p style=\"text-align: justify;\">One example is that of Jareer bin Abdullah Al-Bajali. He said: I gave my allegiance to the Prophet (salalahu alaihi wa salam) to pray, fast, and advise the Muslims.(Saheeh Al-Bukhari, hadith #57) Jareer only became a Muslim in the last year or so of the life of the Prophet (salalahu alaihi wa salam). See Al-Isaba by Ibn Hajar 2\/266.<\/p>\n<p style=\"text-align: justify;\">So, there is no real evidence that Abu Al-Ghadiya was one of those that pledged under the tree.<\/p>\n<p style=\"text-align: justify;\">RTS though insists that this man is from the people of the fire by quoting the following narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated of Abi Ghadya, he said: I heard Ammar bin Yassir being insulted by Uthman in Madinah. He said: &#8220;So I promised that I would kill him, that if Allah would give me the possibility (to do so), then I would do it! And when the Day of Siffin occurred, he made Ammar come upon the people, then it was said that this was Ammar. Then I saw a gap between the two bellows and the two legs. Then I came upon him and stabbed him in his knee. Then he fell, then I killed him!&#8221; Then it was said: &#8220;You have killed Ammar bin Yassir!&#8221; And Amroo bin Al-Aas told, and he said: I heard the Messenger of Allah (saw) say: &#8220;The killer and the robber of Ammar shall be in Hell!&#8221; Then it was said to Amroo bin Al-Aas: &#8220;Indeed, you are the one who fights him!&#8221; Then he said: He (i.e. the Prophet) said: &#8220;His killer and his robber!&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: The chain of narration is Saheeh &#8216;Authentic&#8217;. <\/span><\/p>\n<p style=\"text-align: justify;\">First of all, this man&#8217;s translation is incorrect, the narration says &#8220;I heard `Ammar insult `Uthman&#8221; nor &#8220;I heard `Ammar being insulted by `Uthman.&#8221;<\/p>\n<p style=\"text-align: justify;\">Secondly, every narration stating that &#8220;The killer of `Ammar is in hell&#8221; is weak, not one is authentic and this one is no different.<\/p>\n<p style=\"text-align: justify;\">I say: The narration quoted above is not one narration as some have imagined, it is actually two narrations, the first one is correct while the second part is weak because the chain is disconnected. We have two narrations here; the first is Kulthoum from Abu Al-Ghadiya and it is a correct chain, while the second is Kulthoum from `Amr bin Al-Aas and this is disconnected as he never heard from him.<\/p>\n<p style=\"text-align: justify;\">If we were to dissect the narration above, it is as follows: Kulthoum bin Jabr narrated from abu al-Ghadiya: &#8220;I heard `Ammar insulting `Uthman in Madinah &#8230;(until he says)&#8230; Then it was said: You have killed `Ammar bin Yassir!&#8221; At this point the first narration ends and it is correct. The second narration begins with: `Amro bin al-`Aas was told, so he said: &#8220;I heard the messenger (saw) &#8230;(until he says)&#8230; His killer and his robber.&#8221; This second part is weak, it is disconnected.<\/p>\n<p style=\"text-align: justify;\">We explain below:<\/p>\n<p style=\"text-align: justify;\">Sh. Abdullah Al-Sa`d says in &#8220;Fath Al-Wahid Al-Ali fi Al-Difa` `an Sahabat Al-Nabi&#8221;, he says: “The words: &#8216;`Amro bin al-`Aas was told&#8217;, is this by Abu Al-Ghadiya from Amr or from the narration of Kulthoum bin Jabr from `Amr bin Al-`Aas? If it is the first, then it is authentic like the previous narration, but if it is the second, which seems more likely, since it says: &#8216;`Amro bin al-`Aas was told&#8217;, and it says: &#8216;It was told to Amr: You are fighting him&#8217;, which shows that Abu Al-Ghadiya isn&#8217;t narrating from `Amr, this is why al-Imam Al-Thahabi said in Al-Siyar 2\/544: The chain is broken.”<\/p>\n<p style=\"text-align: justify;\">RTS tries to quote another narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8220;The killer and the robber of Ammar shall be in Hell!&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: The chain of narrators is &#8216;sahib&#8217; (correct) and its narrators are &#8216;Thuqat&#8217; (truthful), from the narrators of Muslim.<\/span><\/p>\n<p style=\"text-align: justify;\">I say: RTS should quote more accurately. Al-Albani is quoting Al-Hakim who said, “The only person that narrated this is Abdulrahman bin Al-Mubarak, who is <em>thiqa ma’moon<\/em>, and if this is accurate, then the chain is authentic.” Al-Hakim shows doubt in this narration himself, and Al-Thahabi commented after saying that it is upon the conditions of the two Shaikhs, al-Albani continues saying: “The people though narrated it from Mu’tamir from Al-Laith from Mujahid.” He is implying here that there are doubts about the narration and Abdulrahman bin Al-Mubarak confused the names and included the name of the father of Mu’atamir instead of Al-Laith bin Abi Saleem.<\/p>\n<p style=\"text-align: justify;\">This is actually a very strong view since most of the narrators (like `Amr bin `Ali, Salih bin Hatim, and Al-`Abbas bin Al-Waleed, see Tareekh Dimashq by Ibn Asakir and Al-Ahaad wal Mathani by Ibn Abi `Asim) from Mu’atamir narrated it without mentioning the father of Mu’atamir. Laith bin Abi Saleem is weak of course, as indicated by Al-Albani (as the screenshot provided by RTS shows) and many of the early hadithists.<\/p>\n<p style=\"text-align: justify;\">So it is doubtful.<\/p>\n<p style=\"text-align: justify;\">After providing evidence, RTS provides defenses to possible arguments with the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is a well established fact that Aboo Al-Ghadiyah&#8217;s (la) was a companion of the Prophet (saw). Both classical and modern scholars have attested that he was from among those who gave the pledge to the Prophet (saw) at Hudaibiya. The narration taken from Saheeh Muslim was only applicable for those who kept to the conditions of the oath and not for those who broke it. The companions not only fled from battle, but from among those who gave the oath was the killer of Amar ibn Yassir (r.a). The holy Prophet prophesied that a rebel party would kill Ammar bin Yassir (r.a). The Prophet (saw) did not excuse this rebel party on the basis of Ijtihad but rather gave them the recompense of Hell. It is only permissible for a scholar to exercise Ijtihad when there can be found no clear solution. Now what form of Ijtihad was Aboo Al-Ghadiyah trying to exercise when the Prophet (saw) said, &#8220;The killer and the robber of Ammar shall be in Hell?!&#8221; The condemnation of these individuals and exclusion of the verse of the pledge is nothing but part of the Sunnah of the Prophet (saw).<\/span><\/p>\n<p style=\"text-align: justify;\">RTS then goes on to provide a second defense, which is the authentication of Sh. Shoaib Al-Arna’ut to the hadith in Musnad Ahmad. We have established that this narration is weak by quoting the opinion of Sh. Abdullah Al-Sa’ad though.<\/p>\n<p style=\"text-align: justify;\">As for the “first defense”, as demonstrated above, there is no solid evidence that Abu Al-Ghadiya was one of those that pledged under the tree.<\/p>\n<p style=\"text-align: justify;\">Secondly, there is a consensus among <em>Ahlul Sunnah<\/em> today that Mu’awiyah is from the <em>Baghi<\/em> group, however, there is no evidence that this group is doomed to hellfire. Allah (subhanahu wa ta’ala) says in His holy book:<\/p>\n<p style=\"text-align: justify;\"><strong>وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللَّهِ فَإِنْ فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ وَأَقْسِطُوا إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ<\/strong><br \/>\n<strong>إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ<\/strong><\/p>\n<p style=\"text-align: justify;\">{And if two parties of believers fall to fighting, then make peace between them. And if one party of them doeth wrong to the other, fight ye that which doeth wrong till it return unto the ordinance of Allah; then, if it return, make peace between them justly, and act equitably. Lo! Allah loveth the equitable. The believers are naught else than brothers. Therefore make peace between your brethren and observe your duty to Allah that haply ye may obtain mercy.} (49:9)<\/p>\n<p style=\"text-align: justify;\">Allah (subhanahu wa ta&#8217;ala) refers to the <em>Bughaat<\/em> as <em>Mu’mineen <\/em>(believers); then He refers to them as brothers. This is sufficient to prove that in-fighting between Muslims does not necessarily mean hellfire to either group.<\/p>\n<p style=\"text-align: justify;\">Carrying on, RTS moves on to the next specific example. RTS says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">&#8216;Abd Al-Rahman bin Udays&#8217;<\/span><br \/>\n<span style=\"color: #ff0000;\">Pledge broken by Killing Uthman Bin Affan!<\/span><br \/>\n<span style=\"color: #ff0000;\">Abd al-Barr:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Abd al-Rahman bin Udays Al-Balawi Al-Misri: He witnessed Al-Hudaibiya. Asad bin Musa mentioned from Ibn Lahi&#8217;ah, from Yazid bin Abi Habib, who said: &#8220;Abd Al-Rahman bin Udays Al-Balawi was one of those who gave bay&#8217;ah to the Messenger of Allah (saw), under the tree.&#8221; Aboo Umar said, &#8220;He was the commander of the army that came from Egypt to Madinah, the army that besieged Uthman and murdered him.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">RTS cleverly anticipates our argument:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The narration that sought to suggest Abd Al-Rahman bin Udays gave allegiance under the tree, was only reported through Ibn Luhai&#8217;a and is regarded as being weak.<\/span><\/p>\n<p style=\"text-align: justify;\">Then RTS responds:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">We challenge the opponents to present us one authentic narration of all those who gave their pledge to Prophet (saw) during the incident of Hudaibiya if they attempt to weaken ibn Luhai&#8217;a.<\/span><\/p>\n<p style=\"text-align: justify;\">We respond:<br \/>\nThe counter-argument above is ridiculous at best. Ibn Lahee’a himself does not give a complete list of those that pledged under the tree, nor does anyone else for that matter. It is not binding upon <em>Ahlul Sunnah<\/em> to list down, be aware, or memorize the names of all the companions of the Prophet (salalahu alaihi wa salam), or those that witnessed his battles with him, or those that pledged their allegiance to him. Such matters are established through individual authentic reports, some of which can be found many of the books of hadith, like the witnessing of the pledge by Jabir bin Abdullah, Mirdas Al-Aslami, Al-Musayab bin Huzn, Abdullah bin Abi Awfa, Salama bin Al-Akwa’a, Al-Bara’a bin Azib, Thabit bin Al-Dhahak, Zahir Al-Aslami, Suwayid bin Al-Nu’man, A’ith bin Amr, Abdullah bin Mughafal, and others, and these can be found in Saheeh Al-Bukhari alone. So, ignorance of the names of a few, some, many, or most, of those which participated in this pledge, does not mean that one is forced to accept evidences brought by weak and unreliable narrators.<\/p>\n<p style=\"text-align: justify;\">RTS then follows up by giving examples of companions committing illegal sexual intercourse. RTS provides two examples of companions that fell into this sin, the first being Amr bin Hamza and the second being Al-Mugheera bin Shu’ba.<\/p>\n<p style=\"text-align: justify;\">RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>&#8216;He (Umro ibn Hamzah bin Sinan Al-Aslami) attended Hudaibiya along with Allah’s Messenger (saw),<\/strong> then he migrated to Madinah, later he requested from the Prophet (saw) to go back to his homeland thus permission was granted to him. Then he returned, while he was on his way in an area called Sawa, he saw a beautiful Arabian slave girl, <strong>then Satan whispered to him till he had sexual intercourse with her.&#8217;<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Now, regardless of the weakness of the chain of narrators, since this narration is by Al-Waqidi, there are other problematic issues with this quote. Firstly, it is an incomplete quote. The scan that is taken by RTS includes that Amr bin Hamza feels guilt and confesses to his sin, and ultimately, received a flogging. It seems as though RTS saw this as evidence against themselves, which is why them stayed away from translating the whole section.<\/p>\n<p style=\"text-align: justify;\">Furthermore, there is nothing in the text of the pledge under the tree that suggests anything about fornication or adultery, so performing such an action does not break the pledge.<\/p>\n<p style=\"text-align: justify;\">Also, it is known that if one commits a sin like fornication or adultery and seeks repentance, one can have it erased. In this narration, we find that to be the case, since Amr bin Hamza admits his sin and asks for repentance. If Allah (subhanahu wa ta&#8217;ala) forgives average people for committing such a sin, then why wouldn&#8217;t He forgive one of those that pledged under the tree whom He is satisfied with?<\/p>\n<p style=\"text-align: justify;\">In fact Allah promises to forgive a much greater sin, the sin of being a believer, then  dis-believing in Allah, and then repenting and returning to Islam:<\/p>\n<p style=\"text-align: justify;\">Qur&#8217;an, chapter 3:<\/p>\n<p style=\"text-align: justify;\">{How shall Allah guide a people who disbelieved after their belief and had witnessed that the Messenger is true and clear signs had come to them? And Allah does not guide the wrongdoing people. (86) Those &#8211; their recompense will be that upon them is the curse of Allah and the angels and the people, all together, (87) Abiding eternally therein. The punishment will not be lightened for them, nor will they be reprieved. (88) Except for those who repent after that and correct themselves. For indeed, Allah is Forgiving and Merciful. (89)}<\/p>\n<p style=\"text-align: justify;\">The second example is Al-Mugheera bin Shu’ba. RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Qusama bin Zuhayr, who said when the case of Abi-Bakra and Al-Mughira took place. He mentioned the conversation and said: He invited the witnesses, and Aboo Bakra, and Shibl bin Mu&#8217;abbad, and Aboo Abdullah Nafi testified. Then Umar said when these three testified: &#8220;Umar has broken his case.&#8221; And when Ziyad stood up, he said: &#8220;You must testify, if Allah wills, only by the truth.&#8221; Ziyad said: &#8220;As for the adultery, then I do not testify for it. However I saw an ugly thing.&#8221; Umar said: &#8220;Allah is the Greatest! Their &#8216;hudud!&#8217; Flagellate them!&#8221; He (Qusama) said: Then Aboo Bakra said: &#8220;After he hit him, he testified that he was an adulterer. Then Umar  repeated the flagellation to him. Then Alee (a.s) prevented him from doing so to him, and he said: &#8216;If you would flagellate him, then stone your friend (Al-Mughira)&#8217;, so he left him and did not flagellate him.&#8221;<\/span><br \/>\n<span style=\"color: #ff0000;\">Footnote: Narrations is Saheeh (Authentic).<\/span><\/p>\n<p style=\"text-align: justify;\">I say: The narration is disconnected since Qasama Al-Basri is a late narrator; a student of Abu Musa Al-Ash’ari and Abu Huraira, which is clear in his biography of the books of <em>rijal<\/em>. The event that the narration describes, according to Al-Tabari, occurred in the year <em>17 <\/em>AH, so it is not likely that Qasama saw this event in Al-Madinah at the time. Furthermore, it is absurd for Ali to suggest a thing that goes against the <em>shari’ah, <\/em>or be unaware of the conditions for a stoning, for it is known even among the laypeople that three witnesses are not sufficient for a stoning.<\/p>\n<p style=\"text-align: justify;\">The event that RTS quotes is authentic though in other variations and chains, which basically states that Omar flogged three witnesses who couldn’t provide a fourth witness, and included the same names as the ones mentioned above. However, the author of the RTS article who hasn’t studied Shi’ee jurisprudence, for if he read the Chapter of What Deserves Stoning (Ma Yujab Al-Rajm) in Al-Kafi he would’ve found this:<\/p>\n<p style=\"text-align: justify;\">علي بن إبراهيم ، عن أبيه ، ومحمد بن يحيى ، عن أحمد بن محمد جميعا ، عن ابن أبي نجران ، عن عاصم بن حميد ، عن محمد بن قيس ، عن أبي جعفر عليه السلام قال : قال أمير المؤمنين<br \/>\nعليه السلام لا يرجم رجل ولا امرأة حتى يشهد عليه أربعة شهود على الايلاج والاخراج .<\/p>\n<p style=\"text-align: justify;\">Rough translation: Ameer Al-Mu’mineen said: No man or woman can be stoned to death until four witnesses witness an insertion and extraction (of the male sexual organ).<\/p>\n<p style=\"text-align: justify;\">Al-Majlisi grades this as authentic.<\/p>\n<p style=\"text-align: justify;\">In other words, if this is the Shi’ee stance, then RTS’ opinion is invalid, due to the lack of proof that Al-Mugheera committed adultery.<\/p>\n<p style=\"text-align: justify;\">RTS then carried on the assault on Al-Mugheera by quoting narrations where in which Al-Mugheera curses Ali, implying that doing such causes the breaking of his pledge on the day of the tree, for RTS believes that whoever curses Ali is in fact cursing the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">However, we reject both the idea that Al-Mugheera cursed Ali and that cursing him is like cursing the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">Even though we are open to the idea that Al-Mugheera may have done this, it is important to note that RTS has failed in providing evidence that this occurred. The first evidence is that RTS provides is a narration from Hisham bin Mohammad Al-Kalbi (a liar) from Abi Mukhnaf (a liar). See their biographies in books of <em>rijal<\/em> like Mizan Al-I’itidal. Both are seen as liars by several early hadith scholars.<\/p>\n<p style=\"text-align: justify;\">RTS is aware of this, and did not quote any authentication for the narration, nor did they try to strengthen this chain.<\/p>\n<p style=\"text-align: justify;\">The second narration is the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The uncle of Ziyad bin Alaqa narrated that <strong>Al-Mughira<\/strong> <strong>bin<\/strong> <strong>Shu&#8217;ba<\/strong> <strong>abused<\/strong> <strong>Alee,<\/strong> so Ziyad bin Arqam stood up and said: &#8220;You know that the Prophet (saw) forbade abusing the dead, then why are you abusing Alee when he is dead?&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Silsalat Al-Hadeeth As-Saheeha. Vol. 5, Pg. # 520.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Al-Albani authenticated this narration in his Silsila, but he is incorrect in doing so.<\/p>\n<p style=\"text-align: justify;\">Al-Albani outlines the narrations:<br \/>\nThe narration is by Sufyan, who narrates it from Ziyad bin Ilaqa from Al-Mugheera.<br \/>\nThe narration from Mis’ar is from Ziyad, from his uncle from Zaid bin Arqam, in which Al-Mugheera cursed. However, Mohammad bin Bishr narrated it through Mis’ar from Al-Hajjaj the <em>Mawla<\/em> of <em>bani <\/em>Tha’laba from the uncle of Ziyad bin Ilaqa. Wakee’ narration from Mis’ar is the same as the previous one.<\/p>\n<p style=\"text-align: justify;\">Al-Daraqutni in Al-Ilal (<em>#1249<\/em>) when asked about these differences said that the narration of Shu’ba bin Mis’ar is a mistake. In other words, the narrations of Sufyan and the narrations of Mis’ar that include the <em>mawla<\/em> of <em>bani<\/em> Tha’laba are the accurate versions of these narrations. With this in mind, we come to the conclusion that in the version by Sufyan, it is Al-Mugheera who is actually teaching people to not curse the dead, while the version of the M<em>awla<\/em> is weak since he is an anonymous (unknown) narrator.<\/p>\n<p style=\"text-align: justify;\">RTS then quoted a narration, from three different sources, that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Messenger of Allah (saw) said:&#8221;Whoever reviles\/curses Alee, has reviled\/cursed me.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Musnad Ahmad Ibn Hanbal. Vol. 44, H. # 26748, Pg. 328 &#8211; 329.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">We say: The hadith is weak since it is narrated by Abu Ishaaq Al-Sabee’ee, who is a <em>mudalis<\/em> (he narrates from his <em>shaikhs<\/em> what he didn’t hear) and he didn’t mention in this narration if he heard it or not. Ibn Hajar included him in the third level of <em>mudaliseen<\/em> which he refers to as “the group that made so much <em>tadlees<\/em> that they were seen as unreliable by the Imams except in which they were clear about hearing, while some left them completely and others accepted them.” Ibn Hajar went on to say that Al-Nasa’ee and other have mentioned that he is a <em>mudalis<\/em> and that he is known for this act. See Ta’reef Ahl Al-Taqdees p. <em>101. <\/em><\/p>\n<p style=\"text-align: justify;\">Moving on, RTS decided to take it up a notch by providing evidences that those that were at Badr were hypocrites. RTS focused on two Badris by the name of Tha’laba bin Hatib and Mu’atib bin Qushair.<\/p>\n<p style=\"text-align: justify;\">Tha’laba bin Hatib, according to RTS, received condemnation by Allah (subhanahu wa ta&#8217;ala) in the holy Qur’an with the following verse:<\/p>\n<p style=\"text-align: justify;\"><strong>وَمِنْهُمْ مَّنْ عَـهَدَ اللَّهَ لَئِنْ ءاتَـنَا مِن فَضْلِهِ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ الصَّـلِحِينَ &#8211; فَلَمَّآ ءَاتَاهُمْ مِّن فَضْلِهِ بَخِلُواْ بِهِ وَتَوَلَّواْ وَّهُمْ مُّعْرِضُونَ &#8211; فَأَعْقَبَهُمْ نِفَاقاً فِى قُلُوبِهِمْ إِلَى يَوْمِ يَلْقَوْنَهُ بِمَآ أَخْلَفُواْ اللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكْذِبُونَ &#8211; أَلَمْ يَعْلَمُواْ أَنَّ اللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَاهُمْ وَأَنَّ اللَّهَ عَلَّـمُ الْغُيُوبِ<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>And of them are some who made a covenant with Allah (saying): &#8220;If He bestowed on us of His bounty, we will verily, give Sadaqah and will be certainly among the righteous.&#8221;). Then when He gave them of His bounty, they became stingy, and turned away, averse. So He punished them by putting hypocrisy into their hearts till the Day whereon they shall meet Him, because they broke that (covenant) with Allah which they had promised to Him and because they used to tell lies Know they not that Allah knows their secret ideas, and their Najwa (secret counsels), and that Allah is the All-Knower of things unseen<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Holy Qur&#8217;aan (9.75-78)<\/strong><\/p>\n<p style=\"text-align: justify;\">However, RTS has provided no evidence to support this claim other than quotes from scholars, and without providing authentic narrations.<\/p>\n<p style=\"text-align: justify;\">RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Abd al-Barr:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Apostle of Allah established brotherhood between this <strong>Tha’labah bin Hatib<\/strong> and Mu’tab bin ‘Awf al-Humara. <strong>He (Tha’labah) witnessed Badr, and he was the one who refused to give Sadaqah<\/strong>.<\/span><\/p>\n<p style=\"text-align: justify;\">We ask: Is this truly the opinion of Ibn Abd Al-Barr or is he simply quoting the opinions of others? Adaab Al-Hamsh in his book &#8220;Tha’laba bin Hatim Al-Sahabi Al-Muftara `Alaih&#8221; argues: But he (Ibn Abd Al-Barr) said in Al-Durrar (71): And perhaps those that said about Th’alaba bin Hatib: that he didn’t give the alms, and hence received condemnation in the verse, is incorrect, and Allah knows best.<\/p>\n<p style=\"text-align: justify;\">Sh. Adaab (p.91) then quotes Ibn Hisham, Ibn Hazm, Al-Bayhaqi, Al-Thahabi, Al-Hafith Al-Iraqi, Al-Manawi, Ibn Hajar, Ahmad Shakir, and Al-Albani, who all weakened the narration that says that imply that Tha’alaba was a hypocrite. Due to the absence of any proof for the hypocrisy of this companion, we have no choice but to reject the opinion provided by RTS.<\/p>\n<p style=\"text-align: justify;\">As for Mu’atib bin Qushair, RTS quotes some scholars that have attributed a statement of hypocrisy to him. On the other hand, there are scholars that have denied that he is a hypocrite, like Ibn Hisham (in Al-Seerah), Ibn Hazm (in Jawami’ Al-Seerah), and Al-Suhaili (in Al-Rawdh Al-Unuf), and due to the absence of evidence, nobody can suggest that a Badri is in hellfire.<\/p>\n<p style=\"text-align: justify;\">RTS then said:<br \/>\n<span style=\"color: #ff0000;\">Mu’tab bin Qushayr made a promise with Allah (swt), and broke it. He also used to tell lies. So, Allah (swt) punished him by making him an eternal hypocrite. We must point out again that he was from the Ansar and was among the warriors of Badr and Uhud and therefore among the first set of Sabiqun. He fought for Islam at Badr (2 A.H) and Uhud (3 A.H) and was among those who received booty at Hunayn (8 A.H . Fighting in either of these battles is considered an automatic key to Paradise according to so called &#8216;Ahl al-Sunnah&#8217;. However Qushayr was a liar, turned into a direct enemy of Allah and His Messenger (saw), and therefore eventually earned the Wrath of Allah (after previously gaining His pleasure). Allah made him an eternal hypocrite! <\/span><\/p>\n<p style=\"text-align: justify;\">In the year 2 AH, Islam was at its weakest point. A thousand Makkans pagans were at war with an army that was less than a third of its size. It was then that the Prophet (salalahu alaihi wa salam) said, “Oh Allah, fulfil your promise to me! Oh Allah, grant what you promised me! Oh Allah, if this group from the people of Islam see their demise, then you will not be worshipped on this earth!” (Saheeh Muslim, Book of Jihad, #1763)<\/p>\n<p style=\"text-align: justify;\">It was at this point in time that the greatest Muslims that ever lived put their lives on the line to defend the religion of Allah (subhanahu wa ta&#8217;ala), against a foe that vastly outnumbers them.<\/p>\n<p style=\"text-align: justify;\">It is ridiculous to think that there were among those three hundred or so warriors some men whose intention was to destroy Islam. If that was the case, then surely they would have taken the opportunity, to either join the Makkah side, or to attack the Prophet (salalahu alaihi wa salam) himself. If it wasn’t for Allah (subhanahu wa ta&#8217;ala), then the actions of these men, we would be worshiping crosses, idols, or even cattle. But no, in the eyes of RTS, the vast majority of the people of Badr were actually hypocrites (since they didn’t pledge allegiance to Ali after the death of the Prophet), who played along and fought against the pagans, because they were looking for another opportunity to stab the Prophet (salalahu alaihi wa salam) in the back. How is that even logical in any way?<\/p>\n<p style=\"text-align: justify;\">Finally, RTS provides the last specific argument:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Did The Companions Believe They Will Be Saved?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Al Bukhari:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Al-Musaiyab: I met Al-Bara bin Azib and said (to him): &#8220;May you live prosperously! You enjoyed the company of the Prophet and gave him the Pledge of allegiance (of Al-Hudaibiya) under the tree.&#8221; On that, Al-Bara said, &#8220;O my nephew! You do not know what we have done after him (i.e. his death)&#8230;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Source: Saheeh Al-Bukhari. Pg. # 1025, H # 4170.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The companions themselves admitted to their wrong doings. This statement alone is suffice to prove the companions themselves did not believe that they had been guaranteed paradise. Al-Bara bin Azib did not happily agree with Al-Musaiyab in that he had given the pledge and was looking forward to Paradise which awaits him, but rather he replied back in the negative sense. It is most certain that all companions will be judged in accordance to their scale of good and bad deeds regardless of whether they had given the pledge or not unless they were the believers who Allah (subhanahu wa ta&#8217;ala) was referring to, who were those of which stuck to their pledge without going against the oaths taken. It is only these individuals who would undoubtedly be the successful ones. Whilst those who failed to stick to the oaths are evidently not guaranteed the same.<\/span><\/p>\n<p style=\"text-align: justify;\"><em>Subhanallah<\/em>. It is beyond me how RTS can use such a narration for support when it is clearly evidence for <em>Ahlul Sunnah!<\/em><\/p>\n<p style=\"text-align: justify;\">We ask: Does RTS believe in the authenticity of this narration or not? If the answer is yes, then it means that Al-Musayyab bin Rafi’, and the people of his generation (the <em>tabi’een<\/em>), were well aware of the significance of this merit, and that the Prophet (salalahu alaihi wa salam) promised them heaven. Thus, confirming the authenticity of the Hadith. Notice that Al-Bara’a does not reject the authenticity of the narration either. However, if the narration is not authentic, then RTS has no business bringing it up.<\/p>\n<p style=\"text-align: justify;\">As for the words of Al-Bara’a, then this can be explained as modesty. For Al-Bara’a wouldn’t dare negate what has been affirmed by the Prophet (salalahu alaihi wa salam) himself. Furthermore, as we have explained above earlier in our refutation that Allah (subhanahu wa ta&#8217;ala) is pleased with those that gave the pledge and did not demand anything from them, nor were there any clauses that were included that could have caused the breaking of the pledge.<\/p>\n<p style=\"text-align: justify;\">Now, after RTS has completed providing evidences that individuals that participated in Badr and Hudaibiya are in hellfire, RTS aims to attack the companions of the Prophet (salalahu alaihi wa salam) in general by interpreting the verses that were revealed in praise of them.<\/p>\n<p style=\"text-align: justify;\">RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>إِنَّ الَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَـهَدُواْ بِأَمْوَلِهِمْ وَأَنفُسِهِمْ فِى سَبِيلِ اللَّهِ وَالَّذِينَ ءَاوَواْ وَّنَصَرُواْ أُوْلَـئِكَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ وَالَّذِينَ ءَامَنُواْ وَلَمْ يُهَاجِرُواْ مَا لَكُم مِّن وَلـيَتِهِم مِّن شَىْءٍ حَتَّى يُهَاجِرُواْ وَإِنِ اسْتَنصَرُوكُمْ فِى الدِّينِ فَعَلَيْكُمُ النَّصْرُ إِلاَّ عَلَى قَوْمٍ بَيْنَكُمْ وَبَيْنَهُم مِّيثَاقٌ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Verily, those who believed, and emigrated and strove hard and fought with their property and their lives in the cause of Allah as well as those who gave (them) asylum and help, these are (all) allies to one another. And as to those who believed but did not emigrate, you owe no duty of protection to them until they emigrate, but if they seek your help in religion, it is your duty to help them except against a people with whom you have a treaty of mutual alliance; and Allah is the All-Seer of what you do<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Holy Qur&#8217;aan (8.72)<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The above verse is  Muhajirun and Ansar. It is noteworthy that both groups together were only a minority among the companions. Besides the verse is only about those of them who had genuine belief, and who fought in the cause of Allah (swt) with their lives. Not all the companions fulfilled these conditions. Many, if not most, of them used to run away from battles as we have shown earlier thus showing that they were not fighting with their lives. A fact needs to be stressed here. A believer sells his life to Allah (swt) entirely the moment belief enters his heart. The life no longer belongs to him. So, he has no business running away with from Jihad. This is why a believer never flees the battlefields. Whosoever flees has not yet sold his life to our Lord, and that is evidence that emaan has not entered his heart.<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>The verse is a clear merit for the Muhajiroon and Ansar. Allah (subhanahu wa ta&#8217;ala) describes them in their outward actions and what is in their hearts.<\/strong> He describes their actions as those that migrate for the sake of Allah, and make <em>jihad<\/em> with their money and their selves, and provide asylum to one another. Those are their outward actions. In their hearts, Allah (subhanahu wa ta&#8217;ala) describes them as believers. RTS is trying to argue that the Muhajiroon that migrated for the sake of Allah, who left their families and wealth with the Makkans, are not believers. RTS is trying to argue that the Ansar, that provided asylum; split their homes and wealth the Muhajiroon, did it for reasons other than Allah. What other reason did these people have to do such things, and put themselves into so much trouble, if it wasn’t for Allah (subhanahu wa ta&#8217;ala)?<\/p>\n<p style=\"text-align: justify;\">Furthermore, the verse is a general one, that encompasses all the Muhajiroon and Ansar. When Allah (subhanahu wa ta&#8217;ala) praises a group, it is understood that he is talking about all or at least the vast majority of them. RTS, on the other hand, would rather interpret the Muhajiroon and Ansar as the four to thirteen companions that are seen in a good light according to the Shia school of thought. We ask the readers: Which of the two interpretations is closer to the revealed meanings in the verse?<\/p>\n<p style=\"text-align: justify;\">RTS then quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلاً من اللّه ورضواناً وينصرون اللّه ورسوله أولئك هم الصادقون، والذين تبوؤا الدار والإيمان من قبلهم، يحبّون من هاجر إليهم ولايجدون في صدورهم حاجة ممّا أوتوا ويؤثرون علي أنفسهم ولو كان بهم خصاصة، ومن يوق شحّ نفسه فأولئك هم المفلحون &#8211; والذين جاؤا من بعدهم يقولون ربّنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان، ولا تجعل في قلوبنا غلاً للذين آمنوا ربّنا إنّك رؤوف رحيم<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>And there is also a share in this booty for the poor emigrants, who were expelled from their homes and their property, seeking bounties from Allah and (His) good pleasure, and helping Allah and His Messenger. Such are indeed the truthful. And (it is also for) those who, before them, had homes and had adopted the faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given, and give them preference over themselves even though they were in need of that. And whosoever is saved from his own greed, such are they who will be the successful. And those who came after them say: &#8220;Our Lord! Forgive us and our brethren who have preceded us in faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Holy Qur&#8217;aan (59.8-10)<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">This speaks about those of the Muhajirun who migrated seeking Allah’s (swt) bounties and to please Him and those of the Ansar who helped Allah and His Messenger. No doubt, only people with belief have these attributes. Hypocrites and evil doers do not really believe in Allah (swt) and His Messenger (saw). Therefore, they have no reason to seek to please or help our Lord. Since it is absolutely undeniable that there were hypocrites among the Muhajirun and Ansar, it follows logically that this verse applies only to the believers among them. A prerequisite for belief is selling one’s life to Allah (swt) and doing righteous good deeds (i.e. commanding and forbidding evil). Moreover, an absolute condition for sainthood or Paradise is belief. Allah (swt) hates hypocrites, disbelievers and evil doers.<\/span><\/p>\n<p style=\"text-align: justify;\">We are in agreement with everything that is said here.<\/p>\n<p style=\"text-align: justify;\">RTS goes on:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Therefore, whenever He (swt) praises or makes promises to any group of people, it is only to those with belief and righteous good deeds among them.<\/span><\/p>\n<p style=\"text-align: justify;\">Indeed, however, all the praise that we find in the Qur&#8217;an and the hadith, that is aimed towards the companions is a general one. Due to this, we hold the general view that all the companions are to be seen as good people. We are open to the possibility that specific companions will be punished for their sins in the hereafter, however, the burden of proof is upon RTS to prove who falls under this category. One simply cannot say that all the companions are going to hell when these verses are so clear in showing Allah&#8217;s satisfaction in them.<\/p>\n<p style=\"text-align: justify;\">Finally RTS argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Unless, of course, it can be proven that all 100.000 companions were infallible!  This sets the tone for any other verse or hadeeth that anyone may intend to use to prop up the so called Sunni Aqidah that all 100.000 companions were saints. Neither is their any direct proof from Qur&#8217;aan of Hadeeth to prove such a claim. <\/span><\/p>\n<p style=\"text-align: justify;\">RTS is attacking a strawman. Ahlul Sunnah have never made the claim that the companions are infallible, nor that there are any proofs of this from the Qur&#8217;an nor the Sunnah. <strong>Once again, the burden of proof is upon RTS to prove that specific companions will be in hellfire after these verses clearer point towards their good standing with Allah (subhanahu wa ta&#8217;ala).<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000; font-family: tahoma, helvetica, arial, sans-serif; font-size: 12px; background-color: #fafcfe;\"> <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf entitled: Is Allah (swt) Pleased with the Companions? The article was published on the 7th of November, 2012, and can be found here. In this article, RTS attempts to prove that the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/08\/24\/response-to-is-allah-swt-pleased-with-the-companions\/\" title=\"Response to: Is Allah (swt) Pleased with the Companions?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-616","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/616","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=616"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/616\/revisions"}],"predecessor-version":[{"id":644,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/616\/revisions\/644"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=616"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=616"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=616"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}