{"id":620,"date":"2013-08-24T18:13:40","date_gmt":"2013-08-24T18:13:40","guid":{"rendered":"http:\/\/twelvershia.net\/?p=620"},"modified":"2015-11-11T12:24:34","modified_gmt":"2015-11-11T12:24:34","slug":"response-to-prophet-saw-is-affected-by-black-magic","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/08\/24\/response-to-prophet-saw-is-affected-by-black-magic\/","title":{"rendered":"Response to: Prophet (saw) Is Affected By Black Magic!"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=620\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to the article on RevisitingtheSalaf entitled: Prophet (saw) Is Affected By Black Magic! The article was published on the 10th of February, 2012, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/02\/life-of-prophet-saw-from-wife-of_10.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">In this article RTS tries to prove two things:<\/p>\n<p style=\"text-align: justify;\">1-The narration of the prophet (saw) being bewitched contradicts the Qur&#8217;an and human intellect.<\/p>\n<p style=\"text-align: justify;\">2-The mother of believers `Aisha (ra) was the one who fabricated this narration because she is &#8220;evil&#8221;.<\/p>\n<p style=\"text-align: justify;\">We will disprove both quickly in this short response.<\/p>\n<p style=\"text-align: justify;\">He begins his article by quoting these verses:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Iblis said: “O my Lord! Because You misled me, I shall indeed adorn the path of error for them (mankind) on the earth, and I (Iblees) shall mislead them all except Your chosen (guided) servants among them.” (Allah) said: “This is the way which will lead straight to Me. “Certainly, you shall have no authority over My servants, except those of the astray who follow you. And surely, Hell is the place promised for them all. Holy Qur’aan (15.39-40)<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">“Verily, he (Iblees) has no power over those who believe and put their trust only in their Lord” Holy Qur’aan (16.99)<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">“Except to a Messenger whom He has chosen, and then He makes a band of watching guards to march before him and behind him.” Holy Qur’aan (72.27)<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">“Then I (Iblees) will come to them from before them and behind them, from their right and from their left, and You will not find most of them to be thankful.” Holy Qur’aan (17.16)<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is clear from the above conversation that Allah (swt) has promised that Satan has no means into His sincere Servants, and only wrong-doers will follow the Him. Thus the Sincere Servants of Allah (swt) are not wrong-doers and shall not be deceived. Also Allah (swt) confirms that the Path of His Sincere Servants is a path which leads straight to Him (swt). All these facts prove that the Sincere Servants of Allah(swt) never fall into the trap of Satan, and as such they are infallible, due to Allah’s (swt) Mercy. This is not just restricted to “Prophet” or “Messenger” alone it encompass all righteous servants till the day of Judgement!<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated ‘Aisha: Magic was worked on the Prophet so that he began to fancy that he was doing a thing which he was not actually doing. One day he invoked (Allah) for a long period and then said, “I feel that Allah has inspired me as how to cure myself. Two persons came to me (in my dream) and sat, one by my head and the other by my feet. One of them asked the other, “What is the ailment of this man?” The other replied, ‘He has been bewitched” The first asked, ‘Who has bewitched him?’ The other replied, ‘Lubaid bin Al-A’sam.’ The first one asked, ‘What material has he used?’ The other replied, ‘A comb, the hair gathered on it, and the outer skin of the pollen of the male date-palm.’ The first asked, ‘Where is that?’ The other replied, ‘It is in the well of Dharwan.’ ” So, the Prophet went out towards the well and then returned and said to me on his return, “Its date-palms (the date-palms near the well) are like the heads of the devils.” I asked, “Did you take out those things with which the magic was worked?” He said, “No, for I have been cured by Allah and I am afraid that this action may spread evil amongst the people.” Later on the well was filled up with earth.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Source: Sahih Bukhari Vol. 4, Book 54, # 490<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Lubaid bin Al-A’sam dumped a comb, the hair gathered on it, and the outer skin of the pollen of the male date-palm, as a mechanism for performing black magic on the Prophet (saw), that was effective that he would assume he was doing that which he had not done (Salat etc)<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Whilst offering prayers he inform Aisha (la) that he has been fully informed of the magic done on him, and the contents used to enable it, and the well wherein the items were placed.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">He visits the locality, and returns to Aisha (la) informing her of what he had observed<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Aisha (la) sought clarification as to whether the items had been disposed of, to which the Prophet (saw) said the matter was otiose he had been cured by Allah (swt) and he did not want the matter to be propagated, lest it create Fitnah amongst his subjects.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">We would like to pose some questions that remain unclear:-<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Prophet (saw) would assume that he had done that which he had not done, so when supplicating did he not already assumed he had done just that?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Then he informs Aisha, did he not already think that had informed her?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Before visit Dharwan, did he not assume that he had already gone?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Why did he (saw) choose to only disclose the entire matter to Aisha and not his other wives?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">What did the Prophet (saw) do to curtail the effects of the magic?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">He (saw) did not remove the offending items?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Were the effects of magic simply removed by his visiting Dharwan and then reporting back its description to Aisha?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Prophet (saw) did not want this matter to be disclosed to his subjects, so why did Aisha inform her nephew Urwah, who informed his Hisham about it?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">If they knew how many other people did they tell? Why were they propagating that which the Prophet (saw) wanted kept secret?<\/span><\/p>\n<p style=\"text-align: justify;\">First of all, his understanding of the verses is not accurate, here for instance Iblees affects Prophet Ayyub (as),<\/p>\n<p style=\"text-align: justify;\">{And remember Our servant Job, when he called to his Lord, “Indeed, Satan has touched me with hardship and torment.”} [38:41]<\/p>\n<p style=\"text-align: justify;\">We ask: Is Ayyub (as) an evil-doer? Obviously Not!<\/p>\n<p style=\"text-align: justify;\">Or this verse:<\/p>\n<p style=\"text-align: justify;\">{And if a whisper from the devil reach thee (O Muhammad) then seek refuge in Allah. Lo! He is the Hearer, the Knower.} [41:36]<\/p>\n<p style=\"text-align: justify;\">We ask: Is Muhammad (saw) an evil-doer? Certainly Not!<\/p>\n<p style=\"text-align: justify;\">The verses quoted by RTS, they do not mean that Iblees does not affect pious people at all, but they mean that if a believer is strong in his faith and he places his full trust in Allah, then Iblees would not be able to deceive them and take them out of the folds of the righteous and turn them unbelievers. In other words, the verses do not mean they are infallible, it simply means that Iblees would not be able to dominate them and turn them to disbelief.<\/p>\n<p style=\"text-align: justify;\">Regarding the questions of RTS, they&#8217;re stupid as the reader can see. When it is mentioned that the Prophet (saww) thought or assumed that he was doing a thing which he was actually not doing, it doesn&#8217;t mean that it happened every time, and this is a very simple thing to understand because if we knew that a person often forgets, this doesn&#8217;t mean that he forgets all the time.<\/p>\n<p style=\"text-align: justify;\">Secondly, if RTS has only read this Hadith from Ayesha, it doesn&#8217;t mean that the Prophet (peace be upon him) only mentioned this to Ayesha. We will give some examples of others who narrated this same Hadith:<\/p>\n<p style=\"text-align: justify;\">In Musnad Ahmad we read the following from Zayd ibn Arqam (ra):<\/p>\n<p style=\"text-align: justify;\">عن زيد بن أرقم قال سحر النبي صلى الله عليه وسلم رجل من اليهود قال فاشتكى لذلك أياما قال فجاءه جبريل عليه السلام فقال إن رجلا من اليهود سحرك عقد لك عقدا عقدا في بئر كذا وكذا فأرسل إليها من يجيء بها فبعث رسول الله صلى الله عليه وسلم عليا رضي الله تعالى عنه فاستخرجها فجاء بها فحللها قال فقام رسول الله صلى الله عليه وسلم كأنما نشط من عقال فما ذكر لذلك اليهودي ولا رآه في وجهه قط حتى مات<\/p>\n<p style=\"text-align: justify;\">[He said: The Prophet (saw) was bewitched by a man from the Jews, so he suffered from this a number of days then Jibreel (as) came and said: &#8220;A man from the Jews bewitched you, he tied a knot and it is in the well of so and so&#8221; so Muhammad (saw) sent `Ali (ra) to get it and then he brought it and the Prophet (saw) untied it ect&#8230;]<\/p>\n<p style=\"text-align: justify;\">In al-Tabaqat al-Kubra we read the narration of ibn `Abbas (ra):<\/p>\n<p style=\"text-align: justify;\">عن ابن عباس ، قال : &#8221; مرض رسول الله صلى الله عليه وسلم وأخذ عن النساء ، وعن الطعام والشراب ، فهبط عليه ملكان وهو بين النائم واليقظان ، فجلس أحدهما عند رأسه والآخر عند رجليه ، ثم قال أحدهما لصاحبه : ما شكوه ؟ قال : طب ، يعني سحر ، قال : ومن فعله ؟ قال : لبيد بن أعصم اليهودي ، قال : ففي أي شيء جعله ؟ ، قال : في طلعة ، قال : فأين وضعها ؟ قال : في بئر ذروان تحت صخرة ، قال : فما شفاؤه ؟ قال : تنزح البئر ، وترفع الصخرة ، وتستخرج الطلعة ، وارتفع الملكان ، فبعث نبي الله صلى الله عليه وسلم إلى علي رضي الله تعالى عنه وعمار فأمرهما أن يأتيا الركي فيفعلا الذي سمع ، فأتياه وماؤها كأنه قد خضب بالحناء ، فنزحاها ثم رفعا الصخرة فأخرجا طلعة ، فإذا بها إحدى عشرة عقدة ، ونزلت هاتان السورتان : قل أعوذ برب الفلق و قل أعوذ برب الناس ، فجعل رسول الله صلى الله عليه وسلم كلما قرأ آية انحلت عقدة ، حتى انحلت العقد وانتشر نبي الله صلى الله عليه وسلم للنساء والطعام والشراب<\/p>\n<p style=\"text-align: justify;\">[The Prophet (saw) got sick and he abandoned his wives and the food and the drinks, so two angels descended on him while he was in a state between consciousness and unconsciousness. One sat near his head and the other near his feet, then one said to his companion: &#8220;What is the matter with him?&#8221; He said: &#8220;Magic&#8221; He said: &#8220;And who did it?&#8221; He said: &#8220;Lubayd ibn A`sam the Jew.&#8221; &#8230;ect&#8230; then he (saw) ordered `Ali and `Ammar to get it &#8230;ect&#8230; then these two Qur&#8217;anic chapters were revealed:<\/p>\n<p style=\"text-align: justify;\">{Say: I seek refuge in the Lord of the Daybreak (1) From the evil of that which He created; (2) From the evil of the darkness when it is intense, (3) And from the evil of malignant witchcraft, (4) And from the evil of the envier when he envieth. (5)}<\/p>\n<p style=\"text-align: justify;\">And<\/p>\n<p style=\"text-align: justify;\">{Say: I seek refuge in the Lord of mankind, (1) The King of mankind, (2) The god of mankind, (3) From the evil of the sneaking whisperer, (4) Who whispereth in the hearts of mankind, (5) Of the jinn and of mankind. (6)}<\/p>\n<p style=\"text-align: justify;\">So the Prophet (saw) began reciting them and every time a knot would be undone until he was freed and went back to his wives and to the food and the drinks.]<\/p>\n<p style=\"text-align: justify;\">Just by presenting these two narrations we have proved that this was not a fabrication by `Aisha (ra), nor was she the only person who knew about it.<\/p>\n<p style=\"text-align: justify;\">So as we read, the Prophet (saww) untied the knots in the material and this untying was enough to remove the strength of magic. Hence there was no need to remove the object.<\/p>\n<p style=\"text-align: justify;\">As for &#8220;not disclosing the matter to his subjects&#8221;, the narration does not state this, otherwise the companions we mentioned above would not have heard of it and told it to their students. However, the Prophet (saw) did not wish to reveal the object that was used to cast the spell, this is because he feared it would get people&#8217;s attention and make some of them interested in learning magic, so he didn&#8217;t show it to save the nation from corruption.<\/p>\n<p style=\"text-align: justify;\">So far we have already refuted RTS&#8217;s entire article, but we will briefly comment on the rest, just for fun:<\/p>\n<p style=\"text-align: justify;\"><strong style=\"color: #ff0000;\">Source: Sahih Bukhari. Vol. 7, Book 71, H. # 658.<\/strong><\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated A’isha: A man called Labid bin Al-A’sam from the tribe of Bani Zaraiq worked magic on Allah’s Apostle till Allah’s Apostle started imagining that he had done a thing that he had not really done. One day or one night he was with us, he invoked Allah (swt) and invoked for a long period, and then said, “O A’isha! Do you know that Allah (swt) has instructed me concerning the matter I have asked him about? Two men came to me and one of them sat near my head and the other near my feet. One of them said to his companion, ‘What is the disease of this man?’ The other replied, ‘He is under the effect of magic.’ The first one asked, ‘Who has worked the magic on him?’ The other replied, “Labid bin Al-A’sam.’ The first one asked, ‘What material did he use?’ The other replied, ‘A comb and the hairs stuck to it and the skin of pollen of a male date palm.’ The first one asked, ‘Where is that?’ The other replied, ‘(That is) in the well of Dharwan.’ ” So Allah’s Apostle along with some of his companions went there and came back saying, “O A’isha, the colour of its water is like the infusion of Henna leaves. The tops of the date-palm trees near it are like the heads of the devils.” I asked, “O Allah’s Apostle? Why did you not show it (to the people)?” He said, “Since Allah (swt) cured me, I disliked to let evil spread among the people.” Then he ordered that the well be filled up with earth.This and the previous tradition are at variance with one another despite the narrator being A’isha.<\/span><\/div>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">In this tradition we are informed of the tribe of Labaid<\/span><\/li>\n<li><span style=\"color: #ff0000;\">In previous traditions there is no mention of the Prophet (saw) being accompanied by anyone when attending Dharwan, but here we are informed that companions were with him. A’isha does not elaborate on who these individuals were, one is therefore unsure whether this was due to extenuating circumstances or for her dislike of certain individuals.<\/span><\/li>\n<li><span style=\"color: #ff0000;\">In the previous Hadeeth, upon his return from Dharwan A’isha asks <strong>“<\/strong>Did you take out those things with which the magic was worked?”, buy here she seeks clarity to ascertain whether the products were made subject to a public display “Why did you not show it (to the people)?”  Our question is why was she keen to know whether the items in questions had been shown to the public?<\/span><\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is indeed unusual that Ai’sha wanted to know if the items used for the black magic has been displayed publicly, when the second man had already identified them to the Prophet (saw). A’isha knew the products that had been used, so why was she curious as to whether or not others had also seen them? Surely someone must have given these items to Lubaid  bin Al-A’sam, a comb used by the Prophet (saw) with his hair on it. One presumes Aisha was no doubt confused as to how this item reached the possession of Lubaid  bin Al-A’sam when she personally combed his hair.  There is no doubt that Aisha was favoured for this task, to the point that she even performed this task whilst the Prophet (saw) was in the mosque. Clearly this must have truly perplexed A’isha.<\/span><\/p>\n<p style=\"text-align: justify;\">Now this is called freestyle speculations, in which the Shias are masters. So the comb was provided to Lubaid by the wife of the Prophet (saww) to whom he revealed his dream. Perhaps the Prophet (saww) trusted his wife more than the Shias, and he was more aware of his wife than the Shias. In any case, just because Lubaid was not mentioned in the previous tradition, it doesn’t mean contradiction. For it would mean that many verses of Quran are also contradictory, because in some verses, one fact is not mentioned, while in another verse, it is mentioned. For example,<\/p>\n<p style=\"text-align: justify;\">We read in the Holy Quran [7:150] that Moses grabbed Aaron from his head on one occasion, and regarding the very same occasion, we read in Holy Quran [20:94] that Moses grabbed Aaron from his head as well as beard.<\/p>\n<p style=\"text-align: justify;\">[007:150]  When Moses came back to his people, angry and grieved, he said: “Evil it is that ye have done in my place in my absence: did ye make haste to bring on the judgment of your Lord?” He put down the tablets, seized his brother by (the hair of) his head, and dragged him to him. Aaron said: “Son of my mother! the people did indeed reckon me as naught, and went near to slaying me! Make not the enemies rejoice over my misfortune, nor count thou me amongst the people of sin.”<\/p>\n<p style=\"text-align: justify;\">[020:094]  (Aaron) replied: “O son of my mother! Seize (me) not by my beard nor by (the hair of) my head! Truly I feared lest thou shouldst say, ‘Thou has caused a division among the children of Israel, and thou didst not respect my word!’”<\/p>\n<p style=\"text-align: justify;\">So only an ignorant, like the writers at RTS, can consider this as contradiction. And just because Ayesha didn’t name few individuals doesn’t mean that this was due to her dislike for certain people. This especially can’t be accepted if we know that `Aisha narrated authentic virtues of this person whom the Shia claim she hated. The un-mentioning of their names in a far lesser incident like this one can not be considered dislike for them, by any sane person.<\/p>\n<p style=\"text-align: justify;\">As far as the question of Ayesha regarding why the Prophet (saww) didn&#8217;t take out that material is concerned, it is obvious that she wanted that the people realize that the Prophet (saww) was affected by this magic.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Sahih Bukhari. Vol. 7, Book 71, H. # 660<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated A’isha:  Then one day he said, “O Aisha do you know that Allah has instructed me concerning the matter I asked Him about? Two men came to me and one of them sat near my head and the other sat near my feet. The one near my head asked the other. What is wrong with this man?’ The latter replied the is under the effect of magic The first one asked, Who has worked magic on him?’ The other replied Labid bin Al-A’sam, a man from Bani Zuraiq who was an ally of the Jews and was a hypocrite.’ The first one asked, What material did he use)?’ The other replied, ‘A comb and the hair stuck to it.’ The first one asked, ‘Where (is that)?’ The other replied. ‘In a skin of pollen of a male date palm tree kept under a stone in the well of Dharwan’ ” So the Prophet went to that well and took out those things and said “That was the well which was shown to me (in a dream) Its water looked like the infusion of Henna leaves and its date-palm trees looked like the heads of devils.” The Prophet added, “Then that thing was taken out’ I said (to the Prophet ) “Why do you not treat yourself with Nashra?” He said, “Allah has cured me; I dislike to let evil spread among my people.”<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">This tradition conflicts with the previous two discussed. In those we are informed that the Prophet (saw) was unsure if he had done something, here Aisha elaborates what this meant at the ground level, providing an actual example that in many ways clarifies matters.  Clearly this black magic’s effect was linked to conjugal relations, and it must have reached the hand of  Lubaid  bin Al-A’sam from that individual that would have sought it useful that the Prophet (saw) assumed he had had conjugal relations with his wife when he had in fact not.  If it worked, it would have meant the Prophet (saw) not visiting some of his wives, as he would have assumed that he (saw) had spent the night with them when he had not.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Lubaid bin Al-A’sam is referred to as a hypocrite, ally of the Jews. If one analyses history it is not difficult to identify such a category of person. Aisha manages to identify Lubaid bin Al-A’sam, so which individuals did he frequent with? Did he survive the Prophet (saw) or not?  If he outlived him (saw) which group of Muslims did he attach himself with?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">In this tradition we are told that the used item were removed whilst in the other traditions we are told the well was filled with earth.  When the Prophet approaches Dharwan he states “That was the well which was shown to me (in a dream)…” but he does not state this in the other traditions. In this tradition the second man discloses the precise location wherein the materials can be located ‘In a skin of pollen of a male date palm tree kept under a stone in the well of Dharwan’ ” whilst in the others he simply states “It is in the well of Dharwan”. This tradition concludes with the Prophet refusing treatment with Nashra, no such reference is made of this offer by Aisha (la) in the other traditions.<\/span><\/p>\n<p style=\"text-align: justify;\">Again these are outright speculations to defame Ayesha [ra], which is why they don’t even make sense, for why would a wife of the Prophet [saww] want to cast a black magic upon her husband!? Especially if it could make him err regarding whether he had performed his conjugal rights or not. Secondly, there is no conflict, just few facts are elaborated more in this narration than in the previous narration. Elaboration or “extra detail” is never considered a contradiction by any knowledgeable person.<\/p>\n<p style=\"text-align: justify;\">As far as the identity of Lubaid al-Asam is concerned, the fact is that Shias don’t have the biography of a lot of companions of the Prophet [saww], perhaps RTS meant the Sunni books. The Sunni books have documented the biographies of much more people surrounding the Prophet [saww] than the Shias, rather even a big Shia narrator like Zurarah is also a very less documented person as far as his biography is concerned.<\/p>\n<p style=\"text-align: justify;\">Again, RTS is trying to disprove the Hadith only on the basis that it has a few more elaborations than the previous narrations, which as I mentioned is never considered a contradiction. But by using the same principle, I can prove multiple contradictions between (1) The identity of the mother of the 12th Imam (2) The Hadith of Ghadeer (3) The incident of the house burning of Fatima (4) The incident of <a href=\"http:\/\/twelvershia.net\/2014\/05\/08\/fadak-prophetic-inheritance-qa\/\" rel=\"external nofollow\">Fadak<\/a> (5) The Mushaf of Fatima, etc. But for the time being, we shall leave it aside for the convenience of the readers.<\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Sahih Bukhari. Vol. 7, Book 71, # 661.<\/strong>Narrated A’isha: Magic was worked on Allah’s Apostle so that he began to imagine that he had done something although he had not. One day while he was with me, he invoked Allah and invoked for a long period and then said, “O ‘Aisha! Do you know that Allah has instructed me regarding the matter I asked Him about?” I asked, “What is that, O Allah’s Apostle?” He said, “Two men came to me; one of them sat near my head and the other sat near my feet. One of them asked his companion, ‘What is the disease of this man?’ The other replied, ‘He is under the effect of magic.’ The first one asked, ‘Who has worked magic on him?” The other replied, ‘Labid bin A’sam, a Jew from the tribe of Bani Zuraiq.’ The (first one asked), ‘With what has it been done?’ The other replied, ‘With a comb and the hair stuck to it and a skin of the pollen of a male datepalm tree.’ The first one asked, ‘Where is it?’ The other replied, ‘In the well of Dharwan.’ Then the Prophet went along with some of his companions to that well and looked at that and there were date palms near to it. Then he returned to me and said, ‘By Allah the water of that well was (red) like the infusion of Henna leaves and its date-palms were like the heads of devils” I said, O Allah’s Apostle! Did you take those materials out of the pollen skin?” He said, ‘No! As for me Allah has healed me and cured me and I was afraid that (by Showing that to the people) I would spread evil among them when he ordered that the well be filled up with earth, and it was filled up with earth”<\/span><span style=\"color: #ff0000;\"> <\/span><span style=\"color: #ff0000;\">Further contradictions abound between traditions. In the second tradition Lubaid bin Al-A’sam is unknown, here we know his faith and his tribe. In the previous tradition Lubaid  bin Al-A’sam is referred to as a hypocrite ally of the Jews whilst here he is a Jew.  In this tradition he ventures to the well with companions whilst in two previous traditions no mention is made of him being accompanied by anyone.  In the previous traditions the Prophet (saw) asks a rhetorical question and expands on what has been disclosed to him, before A’isha answers.  But here A’isha is given the opportunity to respond and asks <strong>, <\/strong>“What is that, O Allah’s Apostle?”<\/span><\/div>\n<p style=\"text-align: justify;\"> His tribe has been mentioned in the previous narration as well, so that is a mis-statement by RTS itself. Secondly, as far as his religion is concerned, we know for sure that the hypocrites were not atheists, before apparently embracing Islam. They all had some religion, so Lubaid was a Jew, who apparently embraced Islam, and hence he was considered a hypocrite. As far as the other so called tradition is mentioned by RTS that in the two previous traditions, no mention is made of him being accompanied by anyone, then you can see in the tradition <strong>Book 71, H. # 658 <\/strong>which has been mentioned earlier, that there it was mentioned that the Prophet [saww] <span style=\"color: #ff0000;\">‘<em>along with some of his companions went there and came back<\/em><\/span>‘. Hence this is another mis-statement by RTS.<\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Source: Saheeh Bukhari. Vol. 8, Book 73, # 89.<\/strong>Narrated A’isha: The Prophet (saw) continued for such-and-such period imagining that he has slept (had sexual relations) with his wives, and in fact he did not. One day he said, to me, “O ‘Aisha! Allah has instructed me regarding a matter about which I had asked Him. There came to me two men, one of them sat near my feet and the other near my head. The one near my feet, asked the one near my head (pointing at me), ‘What is wrong with this man? The latter replied, ‘He is under the effect of magic.’ The first one asked, ‘Who had worked magic on him?’ The other replied, ‘Lubaid bin Asam.’ The first one asked, ‘What material (did he use)?’ The other replied, ‘The skin of the pollen of a male date tree with a comb and the hair stuck to it, kept under a stone in the well of Dharwan.”‘ Then the Prophet went to that well and said, “This is the same well which was shown to me in the dream. The tops of its date-palm trees look like the heads of the devils, and its water looks like the Henna infusion.” Then the Prophet ordered that those things be taken out. I said, “O Allah’s Apostle! Won’t you disclose (the magic object)?” The Prophet said, “Allah has cured me and I hate to circulate the evil among the people.” A’isha added, “(The magician) Lubaid bin Asam was a man from Bani Zuraiq, an ally of the Jews.”<\/span><span style=\"color: #ff0000;\">In this tradition (unlike the previous) the Prophet (saw) makes no form of supplication that enables the reality to be revealed to him. The tradition from Sahih Bukhari Volume 7, Book 71, Number 66 informs us ‘The one near my head asked the other. What is wrong with this man?’ The latter replied the is under the effect of magic whilst this tradition informs us The one near my feet, asked the one near my head (pointing at me), ‘What is wrong with this man?’.<\/span><\/div>\n<p style=\"text-align: justify;\">In fact this tradition is very similar to the tradition of <strong>Book 71, H. # 660.<\/strong> There is only the mentioning of invocation in the words <em><span style=\"color: #ff0000;\">‘about which I had asked Him’<\/span> <\/em>just like in this tradition. And everyone can understand that this means invocation. So it is clearly mentioned in this narration. As far as the second contradiction is concerned, that is a contradiction but a minor one, and the narrations in such cases are not rejected, neither in the Sunni science of hadith, nor in the Shia science of hadith, and plenty of examples can be given from the Shia books, and the one with the better chain of transmission is given superiority in such case. Such minor contradictions arise in the narrations often in the transmission of the narration, since the narrators are humans who can err in the details, even if they are truthful.<\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><strong>Sahih Bukhari. Volume 8, Book 75, Number 400.<\/strong>Narrated ‘Aisha: that Allah’s Apostle was affected by magic, so much that he used to think that he had done something which in fact, he did not do, and he invoked his Lord (for a remedy). Then (one day) he said, “O ‘Aisha!) Do you know that Allah has advised me as to the problem I consulted Him about?” ‘Aisha said, “O Allah’s Apostle! What’s that?” He said, “Two men came to me and one of them sat at my head and the other at my feet, and one of them asked his companion, ‘What is wrong with this man?’ The latter replied, ‘He is under the effect of magic.’ The former asked, ‘Who has worked magic on him?’ The latter replied, ‘Labid bin Al-A’sam.’ The former asked, ‘With what did he work the magic?’ The latter replied, ‘With a comb and the hair, which are stuck to the comb, and the skin of pollen of a date-palm tree.’ The former asked, ‘Where is that?’ The latter replied, ‘It is in Dharwan.’ Dharwan was a well in the dwelling place of the (tribe of) Bani Zuraiq. Allah’s Apostle went to that well and returned to ‘Aisha, saying, ‘By Allah, the water (of the well) was as red as the infusion of Hinna, and the date-palm trees look like the heads of devils.’ ‘Aisha added, Allah’s Apostle came to me and informed me about the well. I asked the Prophet, ‘O Allah’s Apostle, why didn’t you take out the skin of pollen?’ He said, ‘As for me, Allah has cured me and I hated to draw the attention of the people to such evil (which they might learn and harm others with)”<\/span><span style=\"color: #ff0000;\">Notice how in the very first tradition the Prophet (saw) keep all the items in the well, but here A’isha asks “<strong>Why didn’t you take out the skin of pollen?”<\/strong>That suggests he removed the comb and hair!  This question is not asked in the previous traditions.<\/span><\/div>\n<p style=\"text-align: justify;\">The exact translation in this case should be ‘Why didn’t you take it out?’ since in the original Arabic text, the exact word for the skin of pollen has not been used, the translator has mentioned the words ‘the skin of the pollen’ but they are not found in the Arabic text, and he might have considered it to be referring to the skin of pollen, but that can be his personal view. As far as the original text of the narration is concerned, we don’t find it.<\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The entire notion of the Prophet (saw) becoming a victim of witchcraft is indeed a deeply shameless one! It makes a mockery of the doctrine of Prophethood, wherein the appointed one of Allah (swt) loses his thinking capability blurred by witchcraft, and is of the actions that he has performed. The difficulty is when A’isha has narrated it, then there is some need for him to find an appropriate place to record it, but where? What is the precise nexus between these traditions and their being placed in a Chapter that deal with the creation and good manners?  What can one learn from good manners by reading a Hadeeth that discusses black magic being performed on the Prophet (saw)?<\/span><\/div>\n<p style=\"text-align: justify;\"> The Prophethood would suffer if the Prophets can commit mistakes in matters dealing with the preaching of religious rulings and beliefs, although since they are divinely corrected if they commit mistakes, this also doesn’t cause problem in the prophethood. But as far as matters apart from the religion is concerned, they can forget and they can commit mistakes as well. If this is indeed a disgusting opinion, than this was the view of heavyweight Shia scholars such as Shaikh Sadooq, Shaikh ibn al-Waleed and a number of other major Shia scholars. And this is also evidenced by authentic Shia narrations. But as far as witchcraft is concerned, we read in the Holy Quran [20:66] that the rods and the ropes which the magicians threw appeared to be moving to Moses. So it means that the spell worked on the Prophets as well. But since they are divinely protected, hence Allah protects them. And that is what Allah did when he protected Moses from the magicians and that is what Allah did when he protected the Prophet [saww] from the magic of Lubaid ibn al-Asam. Rather in this incident is a virtue of the Prophet [saww] that Allah protected him and showed him the truth in his dream. If he was not a divinely appointed Prophet, he would not have been informed with how the plot was made.<\/p>\n<p style=\"text-align: justify;\">RTS finally concludes:<\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #ff0000;\">From this, one can only conclude that according to the Nasibi Aqeeda based on the Qur’aanic passages above and their most authentic books of Hadeeth the Prophet (saw) was not righteous and Allah (swt) therefore decided to hand him over to the power and control of Satan by the effects of magic, or Allah (swt) wasn’t powerful enough to save his chosen Apostle (saw) from this.<\/span><br \/>\n<span style=\"color: #ff0000;\"><strong>أَوْ يُلْقَى إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا وَقَالَ الظَّـلِمُونَ إِن تَتَّبِعُونَ إِلاَّ رَجُلاً مَّسْحُوراً<\/strong><strong>“Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat” And the wrongdoers (disbelievers) say: “You follow none but a man bewitched” <\/strong><\/span><span style=\"color: #ff0000;\"> <\/span><span style=\"color: #ff0000;\"><strong>Holy Qur’aan <\/strong><strong>(25.8)<\/strong><\/span><br \/>\n<span style=\"color: #ff0000;\">A’isha took a stand with the oppressive polytheists that accused the messenger of Allah (swt) of been bewitched. This confirms that A’isha didn’t believe the Prophet (saw) was divinely appointed, as no true believer would ever accuse the Prophet (saw) of such nonsense. As a result of such narrations the enemies of Islam attack the seal of the Prophets (saw). A’isha opened a door for attacking the holy Prophet (saw).<\/span><\/div>\n<p style=\"text-align: justify;\">On the contrary I say: This proves even further that the Prophet [saww] was a truthful one, he was indeed saved by Allah. His Lord protected him from the evil and cured him by his grace and mercy, what more can one ask for?<\/p>\n<p style=\"text-align: justify;\">The verse he quoted, in which the disbelievers accused the believers of following a bewitched man, This doesn&#8217;t mean that those who say that the Prophet [saww] was bewitched are wrongdoers, and if that was the case, then does RTS believe that all the Shia scholars who agreed with the Sunnis are wrongdoers?<\/p>\n<p style=\"text-align: justify;\">When the disbelievers accused him (saw) of being bewitched, they intended to push his followers away from him, and they meant that every word of Qur&#8217;an he utters is nothing but magic and falsehood and evil. Whereas, in the narration above the Prophet (saw) was only affected when it comes to his wives and his food and drinks, he lost his appetite for sexual intercourse and food and drinks, then Allah cured him shortly thereafter, it did not affect his perfect message or the rulings of Islam because they are protected by Allah, and the almighty Lord would not allow his messenger (saw) to spread falsehood without correcting him.<\/p>\n<p style=\"text-align: justify;\">The most ironic part is that through such weakly written material, through such easily refutable un-intellectual texts, RTS wishes to convert people  to their misguided ways, so our response to them would be that of Musa (as):<\/p>\n<p style=\"text-align: justify;\"><strong>{I take refuge with God, lest I should be one of the ignorant} <\/strong>[Qur&#8217;an 2:67]<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf entitled: Prophet (saw) Is Affected By Black Magic! The article was published on the 10th of February, 2012, and can be found here. In this article RTS tries to prove two <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/08\/24\/response-to-prophet-saw-is-affected-by-black-magic\/\" title=\"Response to: Prophet (saw) Is Affected By Black Magic!\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,4],"tags":[21],"class_list":{"0":"post-620","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"category-quran","9":"tag-aisha"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/620","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=620"}],"version-history":[{"count":7,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/620\/revisions"}],"predecessor-version":[{"id":2757,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/620\/revisions\/2757"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=620"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=620"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}