{"id":629,"date":"2013-08-24T19:56:01","date_gmt":"2013-08-24T19:56:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=629"},"modified":"2015-08-06T22:20:43","modified_gmt":"2015-08-06T22:20:43","slug":"response-to-the-oppression-of-sayeda-faatima-s-a-i","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/08\/24\/response-to-the-oppression-of-sayeda-faatima-s-a-i\/","title":{"rendered":"Response to: The Oppression Of Sayeda Faatima (s.a) I"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=629\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\">The following is a response to the article on RevisitingtheSalaf entitled: The Oppression of Sayeda Faatima (s.a) I, which was published on the 21<sup>st<\/sup> of August, 2012, which can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/08\/the-oppression-of-syeda-faatima-sa-i_21.html\" target=\"_blank\" rel=\"nofollow external\">here<\/a>.<\/h3>\n<h3 style=\"text-align: justify;\"><\/h3>\n<p>RTS starts off with the following introduction:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">In this article we will be focusing on the life and martyrdom of the highest lady in the history of Islam, the daughter of the last and final Messenger of Allah (swt), &#8216;Sayeda Faatima Al-Zahra&#8217; (s.a). The Holy Prophet (saw) placed Bibi Faatima (s.a) in the highest grandeur, she (s.a) was undoubtedly an examplary woman for all nations. Upon the death of her father the Holy Prophet Muhammad (saw), Bibi Faatima (s.a) suffered severe distress and misfortunes. She (s.a) received much aversion and cruelty from those who usurped the Islamic leadership from Imam Alee (a.s) namely, Aboo Bakr and Umar. Some past and present historians and authors have concealed this matter intentionally. However, in this article we shall investigate circumstances that surrounded her (s.a) martyrdom.<\/span><\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<p>Even though this introduction gives off a controversial vibe, the vast majority of the article includes nothing more than quote and re-quotes of authentic merits of Fatima (raa).<\/p>\n<p>The first accusation from RTS is that Fatima’s (raa) name was substituted out of a narration and replaced with A’isha (raa).<\/p>\n<p>&nbsp;<\/p>\n<p>RTS says:<\/p>\n<h3 style=\"text-align: justify;\"><\/h3>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><a href=\"http:\/\/www.blogger.com\/blogger.g?blogID=8793765701491481906\" target=\"_blank\" rel=\"nofollow external\"><span style=\"color: #ff0000;\"><b>Tampering Of Hadeeth To Include A&#8217;isha<\/b><\/span><\/a><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Al-Bukhari:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Adam from Sho&#8217;ba and narrated Amr from Sho&#8217;ba from Amr ibn Morra from Morra from Abi Musa Al-Ash&#8217;ari who said: <b>The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except Bibi Maryam (s.a) daughter of Imran and Bibi (s.a) Aasia wife of Pharaoh<\/b> <b>and the superiority of A&#8217;isha to other women, is like the superiority of Tharid (meat and bread dish) to other meals.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Saheeh Al-Bukhari. Pg. # 924.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The above narration appears with exactly the same chain of transmission in Al-Tabari&#8217;s Tafsir, but with no mention of A&#8217;isha being from the chief women of paradise.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Al-Tabari:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Al-Mothanna from Adam Al-Asqalani from Sho&#8217;ba from Amr ibn Morra who said: I heard from Morra Al-Hamdani a narration from Abi Musa Al-Ash&#8217;ari who said: <b>The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except Bibi Maryam (s.a) and Bibi Aasia (s.a) wife of Pharaoh and Bibi Khadijah (s.a) daughter of Khuwaylid and Bibi Faatimah (s.a) daughter of Mohammad (saw).&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Tafsir Jamehul Bayan Al-Tabari. Vol. 5, Pg. # 395.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">As we have observed, the narration has been distorted in order to include A&#8217;isha, while excluding Bibi Khadijah (s.a) and Bibi Faatimah (s.a). We will present some more narrations before your very eyes to show you as to how they have cunningly distorted the Hadeeth.<\/span><\/p>\n<p style=\"text-align: justify;\">I say: The conclusion that RTS arrived at is faulty. Firstly, there is no reason to assume that the narration in Tafseer Al-Tabari is the correct alternative, for the narrator, Al-Muthanna, cannot be compared to Al-Bukhari. This narrator, Al-Muthana bin Ibrahim, the teacher of Al-Tabari, has received no praise or condemnation by any scholar. Furthermore, Muslim, in his Saheeh, narrates this narration through Abu Bakr bin Abi Shaybah and Abu Kuraib from Wakee’, then through Mohammad bin Al-Muthanna and Ibn Bashar from Ghandar, then through Ubaidullah bin Mu’ath from his father, all of these men from Shu’ba, with the same version included in Saheeh Al-Bukhari. Al-Tirmithi and Ibn Majah also quote the second of the chains of Muslim. Ahmad bin Hanbal also narrates this through Yahya bin Sa’eed and Ghandar from Shu’ba. So, there is no doubt that if there is an error in these narrations, then it is from the chain found in Tafseer Al-Tabari, due to his shaikh, and that this is not a fabrication by Al-Bukhari.<\/p>\n<p style=\"text-align: justify;\">RTS continues by providing another weak narration to prove their point:<\/p>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Al-Thahlabi:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Al Hassan ibn Mohammad from Abdullah ibn Mohammad ibn Shayba from Ubaidullah Ahmad Ibn Mansoor Al-Kesahi from Mohammad ibn Abdul Jabbar famous as Sandol Al-Hamdani from Aboo Usama from Sho&#8217;ba from Amr ibn Morra from Abi Musa Al-Ash&#8217;ari who said: <b>&#8220;The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except four, Bibi Aasia (s.a) daughter of Mozahim wife of Pharaoh, Bibi Maryam (s.a) daughter of Imran, Bibi Khadijah (s.a) daughter of Khuwaylid and Bibi Faatimah (s.a) daughter of Mohammad (saw), and the superiority of A&#8217;isha to other women, is like the superiority of Tharid (meat and bread dish) to other meals.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Tafsir Al-Kashf wal Bayan. Vol. 9, Pg. # 353.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">I say: The chain is not authentic due to the anonymity of Abdullah bin Mohammad bin Shaybah. The burden of proof is upon RTS to prove the reliability of this chain, then to prove that the addition is authentic. On the other hand, the same narration from Abu Usama can be found in Musnad Abi Ya’ala through Mujahid bin Musa, and the chain is authentic and does not include the name of Fatima or Khadija.<\/p>\n<p style=\"text-align: justify;\">RTS then continues the quest in search of distortions:<\/p>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Al-Zila’ei:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except four. Aasia (s.a) daughter of Mozahim wife of Pharaoh, Maryam (s.a) daughter of Imran and Khadijah (s.a) daughter of  Khuwaylid and Faatimah (s.a) daughter of Mohammad (saw), <b>and the superiority of A&#8217;isha to other women, is like the superiority of Tharid (meat and bread dish) to other meals.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Al-Zila&#8217;ei: This narration is narrated by Aboo Na&#8217;eem in Al-Helya in the biography of Amr ibn Morra and said: Narrated Sulaiman Ibn Ahmad from Yusuf Al Qazi from Amr ibn Marzooq from Sho&#8217;ba from Amr ibn Morra heard Morra narrating from Aboo Musa who said: <b>The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except four&#8230;&#8221;<\/b> and with this chain and content narrated also by Al-Thahlabi in his Tafsir. <\/span><\/p>\n<p style=\"text-align: justify;\">I say: There are problems with the above. The first quote isn’t by Al-Zayla’ee at all, but rather, it is by Al-Zamakhshari, who was a Mu’atazilite and does not represent Ahlul Sunnah. Secondly, the bottom quote, does not appear in this form in Hilyatul Awliya’a. Yes, it contains the same chain, but Al-Zayla’ee included the text mentioned by Al-Zamakhshari, without pointing out the differences.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Now we will present how the same narration has been distorted by ibn Kathir. He has taken the narration to complete the four women whilst juggling them around just so that A&#8217;isha is mentioned and hence not left out!<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Ibn Kathir:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated ibn Mardawaih through Sho’ba from Muawiya ibn Qorra from his father who said: <b>The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except three!!! Bibi Maryam (s.a) daughter of Imran and Aasia (s.a) daughter Mozahim wife of Pharaoh and Bibi Khadijah (s.a) daughter of  Khuwaylid, and the superiority of A&#8217;isha to other women, is like the superiority of Tharid (meat and bread dish) to other meals.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Tafsir ibn Kathir. Vol. 2, Pg. # 40.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">I say: The book of Ibn Mardawayh is lost and we have no way of knowing the chain to Sh’uba. However, we have already included previously several authentic chains to him, so it is sufficient to hold the opinion that the authentic chains provided previously are the correct ones. Speculating that lost chains are more reliable than the authentic ones that are currently available to us today is not worth much to the academic observer. Furthermore, this version is obviously unreliable since one of the narrators switched Amr bin Mura with Mu’awiyah bin Qura.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Ibn Jarir said: Narrated Al-Mothanna from Adam Al-Asqalani from Sho&#8217;ba from Amr Ibn Morra who said: I heard from Morra Al-Hamdani a narration from Abi Musa Al-Ash&#8217;ari who said:<b> The Messenger of Allah (saw) said: &#8220;Many men reached the level of perfection, but no woman reached such a level except Bibi Maryam (s.a) and Bibi Aasia (s.a) wife of Pharaoh.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Tafsir ibn Kathir. Vol. 2, Pg. # 41.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">I say: This is indeed a mistake by Ibn Katheer. However, there are no signs of foul play. Firstly, if this was due to some <i>nasibi<\/i> intent, then Ibn Katheer would have at least included the name of A’isha. Furthermore, when we go to Surat Al-Tahreem, we find that Ibn Katheer made another mistake in his attribution of the narration to the Saheehain. He included the name of Khadeejah in the narration of Abu Musa, which isn’t supposed to exist in that version. Perhaps RTS will soon suggest that Ibn Katheer was infatuated with Khadeejah, which is why he altered this narration to include her. Seriously though, instead of pointing fingers at scholars, one should be more open minded when dealing with narrations that are confusing in nature like this one.<\/p>\n<p style=\"text-align: justify;\">RTS continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">There is no ambiguity in that someone has distorted these narrations in order to include A&#8217;isha in the list. On some occasions, Bibi Faatima (s.a) has been removed, in others it may be that Bibi Khadijah (s.a) has been excluded or even both! Likewise, there are narrations which have mentioned all four women and A&#8217;isha has been mentioned as the fifth of them! It is obvious from the narration, particularly the part: <b>&#8220;The superiority of A&#8217;isha to other women, is like the superiority of Tharid (meat and bread dish) to other meals.&#8221;<\/b> is not part of the original matn &#8216;content&#8217; of the Hadeeth rather, it is an addition. It is also not in conjunction with other corroborating narrations where it specifically mentions Four women i.e. <b>&#8220;Four most superior women in paradise&#8230;&#8221; and &#8220;It suffices four women&#8230;&#8221;<\/b> <\/span><\/p>\n<p><span style=\"color: #ff0000;\">We shall let the readers decide as to what has happened with these narrations.<\/span><\/p>\n<p style=\"text-align: justify;\">Indeed, the objective reader will find the following:<\/p>\n<p style=\"text-align: justify;\">There are two authentic narrations that suggest that Fatima and Khadeejah are to be included in the narration; one from the path of Ibn Abbas and the other from Anas.<\/p>\n<p style=\"text-align: justify;\">In another narration of Anas, we find that A’isha is mentioned alone, as to being preferable over women like<i>thareed<\/i> over the rest of food. Similar terms are found in the narration by Abu Musa Al-Ash’ari, however, he does mention Aasiya and Maryam in the beginning of the narration.<\/p>\n<p style=\"text-align: justify;\">All of these narrations are authentic.<\/p>\n<p style=\"text-align: justify;\">One way of reconciling the narrations though is if we hold the opinion that Ibn Abbas and Anas were correct in their narrations. Abu Musa, or one of the narrators in the chain, like Murra, his son, or Shu’ba, had doubts, and did not mention the names of Fatima and Khadeeja.<\/p>\n<p style=\"text-align: justify;\">It is also possible that Abu Musa added the name of A’isha onto this hadith since he heard the Prophet (salalahu alaihi wa salam) say these words on another occasion. This is perhaps why Anas, in his second version, narrates this merit of A’isha without mentioning any of the other women.<\/p>\n<p style=\"text-align: justify;\">Either way, reconciliation is easy, and there are no evidences of foul play.<\/p>\n<p style=\"text-align: justify;\">RTS, carries on by quoting narrations in praise of Fatima, which are narrated by A’isha. This is a strange action by a Shi’ee. It only supports the popular view that A’isha and Fatima were indeed close.<\/p>\n<p style=\"text-align: justify;\">In the first narration, in a jealous fit, she cries, “I know for sure that you love Ali and Fatima more than me and my father!”<\/p>\n<p style=\"text-align: justify;\">(Note: RTS adds the term “Imam” before the name of Ali. The term does not exist in the narration.)<\/p>\n<p style=\"text-align: justify;\">In the second narration she speaks of Fatima and her resemblance to the Prophet (salalahu alaihi wa salam). The end of the narration includes his testimony that she will join him in paradise.<\/p>\n<p style=\"text-align: justify;\">The third narration is the narration of the cloak. A’isha narrates that the Prophet (salalahu alaihi wa salam) invokes Allah (subhanahu wa ta’ala) to cleanse Fatima, her two sons, and Ali.<\/p>\n<p style=\"text-align: justify;\">RTS then quotes other narrations in the merits of Ahlulbayt that are accepted by Sunnis, and we appreciate these efforts to make their merits be known.<\/p>\n<p style=\"text-align: justify;\">However, RTS did include one really weak narration at the end of the article that readers need to be aware of. RTS quotes:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Al Haithami:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Alee ibn Abi Talib who said: <b>&#8220;Every Dua will be accepted if you send blessings on Mohammad (saw) and household of Mohammad (saw).&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Al-Haithami: Narrated by Al-Tabarani in Al-Awsat, and it’s narrators are Trustworthy, and it was mentioned before in the beginning of the chapter through ibn Masoud and it is a good Hadeeth, and the Hadeeth of Jabir and Hadeeth of Fudhala ibn Ubaid.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Majmahul Zawahid Al-Haithami. Vol. 10, Pg. # 180.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak because of Al-Khazzaz. Al-Hafith Mughlatai in his Iktifa’a 2\/7 quotes the opinions of Al-Azdi, Abu Hatim, Ibn Abd Al-Barr, and Al-Saaji, who all weaken this narrator.<\/p>\n<p style=\"text-align: justify;\">In the end, all we can say is that we have only one problem with RTS, which is the word choice in the title of their article. Truly, Fatima (raa) was a person full of merits, and this has been made clear in the books of Ahlul Sunnah. How can a person be so oppressed and yet so celebrated at the same time by the so-called “oppressors”?!<\/p>\n<p style=\"text-align: justify;\">And Allah knows best.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf entitled: The Oppression of Sayeda Faatima (s.a) I, which was published on the 21st of August, 2012, which can be found here. RTS starts off with the following introduction: In this article <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/08\/24\/response-to-the-oppression-of-sayeda-faatima-s-a-i\/\" title=\"Response to: The Oppression Of Sayeda Faatima (s.a) I\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[21],"class_list":{"0":"post-629","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"tag-aisha"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/629","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=629"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/629\/revisions"}],"predecessor-version":[{"id":634,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/629\/revisions\/634"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=629"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=629"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=629"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}