{"id":652,"date":"2013-09-01T16:38:01","date_gmt":"2013-09-01T16:38:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=652"},"modified":"2013-09-01T16:38:01","modified_gmt":"2013-09-01T16:38:01","slug":"response-to-the-light-of-the-heavens-and-the-earth","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/09\/01\/response-to-the-light-of-the-heavens-and-the-earth\/","title":{"rendered":"Response to: The Light Of The Heavens And The Earth"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=652\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\">The following is a response to the article on RevisitingtheSalaf entitled:The Light Of The Heavens And The Earth, which was published on the 30th of August, 2013, which can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2013\/08\/the-light-of-heavens-and-earth.html\" rel=\"external nofollow\">here.<\/a><\/h3>\n<p style=\"text-align: justify;\">In this topic we really don&#8217;t wish to refute or give a response, we are just amazed at their beliefs because we thought the religion of Islam was a deep intellectual religion, not a man-made forgery that insults the human mind.<\/p>\n<p style=\"text-align: justify;\">We&#8217;re happy that RTS claimed the narration to be authentic according to his sect, maybe now the readers can see how extreme these folks are when it comes to inventing narrations in praise of their 12 saints.<\/p>\n<p style=\"text-align: justify;\">He quotes the following from al-Kafi:<\/p>\n<blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Alee ibn Muhammad and Muhammad ibn Al-Hassan have narrated from Sahl ibn Ziyad from Muhammad ibn Al-Hassan ibn Shammun from Abd Allah ibn Abd Al-Rahman Al-Asamm from Abd Allah ibn Al-Qasim from Salih ibn Sahl Al-Hamadani who has said the following: &#8220;Aboo Abd Allah (a.s) has said the following about the statement of Allah (swt), the Most High, &#8216;Allah (swt) is the light of the heavens and the earth. A metaphor for His light is a lantern in which there is a lamp placed in a glass. The glass is like a shining star, which is lit from a blessed olive tree that is neither eastern nor western. Its oil almost lights up even though the fire has not touched it. It is light upon light. Allah (swt) guides to His light whoever He wants. Allah (swt) uses various metaphors. He has the knowledge of all things.&#8217; [24:35] The Imam (a.s) said, &#8220;Lantern&#8221; metaphorically stands for the Holy lady, Faatimah (s.a), the &#8220;Lamp&#8221; stands for Imam Al-Hassan (a.s) and &#8220;the glass&#8221; stands for Imam Al-Hussain (a.s), &#8220;The shining star&#8221; stands for the Holy lady Fatimah (s.a), who shines among the ladies of the world. &#8220;The blessed olive tree&#8221; stands for Prophet Ibraheem (a.s). &#8220;Neither eastern nor western&#8221; means not Jewish nor Christian. The expression: &#8220;Its oil almost lights up&#8221; means that it almost bursts up with knowledge. &#8220;Light upon light&#8221; means that there will be one Imam (a.s) after the other Imam (a.s). &#8220;Allah (swt) guides to His light whoever He wants&#8221; means that Allah (swt) guides through the A&#8217;immah (plural of Imam) whoever He wants.&#8217; About the expression &#8220;Allaah (swt) uses various metaphors&#8221; I then recited the following verse of the Holy Qur&#8217;aan: &#8216;Or they (the deeds of the unbelievers) are like the darkness of a deep stormy sea with layers of giant waves, covered by dark clouds. It is darkness upon darkness whereby even if one stretches out his hands he cannot see them. One can have no light unless Allah (swt) gives him light.&#8217; {24:40}. The Imam (a.s) said, &#8220;The word &#8216;Darkness&#8217; refers to the first (i.e. Aboo Bakr) and his friend (i.e. Umar). The expression &#8216;With layers of giant waves&#8217; refers to the third (i.e. Uthman ibn Affan), and the expression &#8216;Covered with darkness&#8217; refers to the second (i.e. Umar). The words &#8216;It is darkness upon darkness&#8217; refer to Mu&#8217;awiyah (may Allah condemn him) and the disasters caused by the Umayyads. The phrase &#8216;Even if one stretches out his hands&#8217; means that even if a true believer stretches out his hands in such disastrous condition &#8216;he cannot see them.&#8217; The statement &#8216;One can have no light unless Allah (swt) gives him light&#8217; stands for the light from the children of the Holy lady, Fatimah (s.a). The phrase &#8216;Can have no light&#8217; means an Imam on the Day of Judgment. The Imam (a.s) said that, &#8220;On the Day of Judgment, you will see the believers with their light shining in front of them and to their right. They will be told, &#8216;Paradise wherein streams flow is the glad news for you today. You will live therein forever. This is the greatest triumph [57:12].'&#8221; The phrase &#8216;The shining light in front&#8230;&#8217; is a reference to the Imam (a.s), who will walk in front and on the right of the true believers until they all enter paradise.'&#8221;<br \/>\n<\/span><\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">First of all we begin by saying: Praise be to God that we are not among the confused or the innovators! Praise be to him that he has guided us to the correct path, to the path of  light by his grace and blessing. Praise be to him who protected us from the deviance and the darkness.<\/p>\n<p style=\"text-align: justify;\">As the readers can see, this Shia narration is ridiculous to the extent that we need not refute it, the Qur&#8217;an itself rejects it and the healthy mind rejects it. This is because the Imami Shia sect invented the belief of the divine leadership of `Ali (ra), and they placed so much emphasis on `Ali (ra) and his family, but at the same time the Qur&#8217;an mentions nothing about this, not even their names are mentioned, so the Shia scholars had to resort to these silly interpretations, it is as if the Qur&#8217;an is not a clear book but a coded one! By attributing these fabrications to Ahlul-Bayt, they managed to forcefully shove the names of the Imams in the Qur&#8217;an. On the other hand, a less intellectual group of Shia scholars claimed that the names of the Imams was present in the Qur&#8217;an but the companions removed it out of spite.<\/p>\n<p style=\"text-align: justify;\">In fact, should one look at the same scanned page of al-Kafi that RTS quoted the above narration from, on that same page you&#8217;ll find even more ridiculous narrations, for example, the narration above this one says:<\/p>\n<p style=\"text-align: justify;\">[abi Khalid al-Kabuli said: I asked abu Ja`far (as) about the saying of Allah <span style=\"color: #008000;\">{So believe in Allah and His Messenger and the Light which We have sent down.}<\/span> the Imam said: &#8220;O abu Khalid, by Allah, the Light here means the Imams!&#8221;]<\/p>\n<p style=\"text-align: justify;\">Although the light according to the Muslims is the guidance of Allah, the revelation of Allah, This is why Allah said {The light which we have SENT DOWN}<\/p>\n<p style=\"text-align: justify;\">As one can read in similar verses the guidance being referred to as a Light:<\/p>\n<p style=\"text-align: justify;\">{Say, &#8220;Who revealed the Scripture that Moses brought as light and guidance to the people?}<\/p>\n<p style=\"text-align: justify;\">or<\/p>\n<p style=\"text-align: justify;\">{And We gave him the Gospel, in which was guidance and light and confirming that which preceded it of the Torah as guidance and instruction for the righteous.}<\/p>\n<p style=\"text-align: justify;\">Now should you check the other narration under it, it says:<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin al-Fudayl: I asked abu al-Hasan (as) about the words of Allah <span style=\"color: #008000;\">{They want to extinguish the light of Allah with their mouths}<\/span> he (as) said: &#8220;They wish to extinguish the authority of the chief of believers (as) with their mouths.&#8221;]<\/p>\n<p style=\"text-align: justify;\">The Muslims explain it, as the Kouffar trying to speak falsehood and accuse the Prophet (saw) of corruption and magic so they can end his message. On the other hand, the readers can see that the Shia scholars as usual went and explained it as the Wilayah of `Ali (ra). We hope the readers notice a pattern here, that any verse with a slightly vague word will be interpreted by the Shia as &#8220;Imamah&#8221; or &#8220;Wilayah&#8221; that&#8217;s how weak their creed is. If they spot the word &#8220;Light&#8221; they&#8217;ll explain it as Imam, if they spot the word &#8220;Lamp&#8221; they&#8217;ll explain it as al-Hasan (ra), if they spot the word &#8220;Believers&#8221; they will say this refers to `Ali (ra) only, and so on&#8230;<\/p>\n<p style=\"text-align: justify;\">Now we go back to the Hadith quoted by RTS at the beginning, the original verses in the Qur&#8217;an are as follows, and the parts in <strong><span style=\"color: #ff0000;\">RED<\/span><\/strong> are the explanations of the Shia according to their authentic narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>FIRST VERSE:<\/strong><\/span><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">{And We have certainly sent down to you distinct verses and examples from those who passed on before you and an admonition for those who fear Allah. (34) Allah is the Light of the heavens and the earth. The example of His light is like a niche <span style=\"color: #ff0000;\">(Fatima) <\/span>within which is a lamp <span style=\"color: #ff0000;\">(Hasan)<\/span>, the lamp is within glass <span style=\"color: #ff0000;\">(Husayn)<\/span>, the glass as if it were a pearly [white] star <span style=\"color: #ff0000;\">(Fatima is a star among women)<\/span> lit from [the oil of] a blessed olive tree <span style=\"color: #ff0000;\">(Ibrahim)<\/span>, neither of the east nor of the west<span style=\"color: #ff0000;\"> (Not Jewish or Christian)<\/span>, whose oil would almost glow even if untouched by fire. Light upon light <span style=\"color: #ff0000;\">(Imam after Imam)<\/span>. Allah guides to His light whom He wills <span style=\"color: #ff0000;\">(He guides you to the Imams)<\/span>. And Allah presents examples for the people, and Allah is Knowing of all things. (35) [Such niches are] in mosques which Allah has ordered to be raised and that His name be mentioned therein; exalting Him within them in the morning and the evenings (36)}<\/p>\n<p style=\"text-align: justify;\">[Qur&#8217;an chapter:24 verses 34-36]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\">InshaAllah we will give a very brief explanation from the perspective of Ahlul-Sunnah and the reader can compare both and see which one agrees with the spirit of the Qur&#8217;an, the Sunni one and the Shia one:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Allah is the Light of the heavens and the earth}<\/span> The guide of those in the heavens and the earth, they are guided to the truth by his light, and with his guidance they are protected from the darkness of confusion.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{The example of His light is like a niche}<\/span> The example of what he has lit with his guidance is like that of a  niche.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Within which is a lamp, the lamp is within glass}<\/span> The Qur&#8217;an in the heart of the believer is like the lamp in the darkness. The heart is contained in a glass which is the chest or breast of the believer, it is a light brightly shining from within a clear glass.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{The glass as if it were a pearly [white] star}<\/span> Allah describes the entire phenomenon as a brightly shining pearl, a light so strong it shines on all surrounding darkness and thus the guidance spreads among the believers.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Lit from [the oil of] a blessed olive tree}<\/span> A blessed tree means it is full of benefits, and the Arabs used to benefit from every part of the olive tree. One of its many benefits is that it&#8217;s fat can be used as fuel for lamps and its oil is from among the brightest and purest. This also points to prophet Ibrahim (as), since the prophets are all from his progeny, they are a blessed tree of guidance to mankind.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Neither of the east nor of the west}<\/span> It is not in the eastern part of the land so that it does not get any sun in the first part of the day, nor is it in the western part of the land so that it is shaded from the sun before sunset, but it is in a central position where it gets sun from the beginning of the day until the end.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Whose oil would almost glow even if untouched by fire}<\/span> Because of its purity and clarity its oil would seem to shine brightly even before it is touched by fire. Meaning the purity of the prophets (as) before they receive the revelation, and they are chosen for prophet-hood because of their righteousness and good qualities.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Light upon light}<\/span> The fire and the oil. The light of the Qur&#8217;an added to the light of the Prophet (saw).<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Allah guides to His light whom He wills}<\/span> Allah shows the way to the ones whom He chooses.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>SECOND VERSE:<\/strong><\/span><\/p>\n<blockquote>\n<p style=\"text-align: justify;\">{But those who disbelieved &#8211; their deeds are like a mirage in a lowland which a thirsty one thinks is water until, when he comes to it, he finds it is nothing but finds Allah before Him, and He will pay him in full his due; and Allah is swift in account. (39) Or [they are] like darknesses <span style=\"color: #ff0000;\">(Abu Bakr and `Umar)<\/span> within an unfathomable sea which is covered by waves<span style=\"color: #ff0000;\"> (`Uthman)<\/span> , upon which are waves<span style=\"color: #ff0000;\"> (Darkness of `Umar)<\/span>, over which are clouds &#8211; darknesses, some of them upon others <span style=\"color: #ff0000;\">(Mu`awiyah and bani Umayyah)<\/span>. When one puts out his hand [therein] <span style=\"color: #ff0000;\">(A believer who lives in their darkness)<\/span>, he can hardly see it. And he to whom Allah has not granted light <span style=\"color: #ff0000;\">(An Imam from the children of Fatima)<\/span> &#8211; for him there is no light. <span style=\"color: #ff0000;\">(An Imam on the day of judgement)<\/span>(40)}<\/p>\n<p style=\"text-align: justify;\">[Qur&#8217;an chapter:24 verses 39-40]<\/p>\n<\/blockquote>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Or [they are] like darknesses}<\/span> The deeds of the disbeliever. He commits them in a state of misguidance and confusion.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Within an unfathomable sea}<\/span> Allah described their hearts and souls as the deep sea.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Which is covered by waves upon which are waves, over which are clouds}<\/span> This shows the chaotic state of the disbelievers, layers upon layers of waves and clouds surround their hearts.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{Darknesses, some of them upon others}<\/span> Means the darkness of the deep sea, then the darkness of the waves and the second layer of waves and on top of it the clouds, it is as if the hearts of the disbelievers are sealed with layers of doubt and confusion and darkness.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{When one puts out his hand [therein], he can hardly see it.}<\/span> Allah describes their misguidance and deviance, they live in such a darkness that if one were to look at his hand he would not see his palm. This means that the most obvious of matters, are hidden from them, they cannot grasp the truth nor will they be guided.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\">{And he to whom Allah has not granted light &#8211; for him there is no light.}<\/span> The guidance is from Allah, and if he decides to keep you away from the light, no one can guide you, not a scholar, not a prophet or an angel.<\/p>\n<p style=\"text-align: center;\"> &#8212;May Allah guide us all and show us the true path&#8212;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf entitled:The Light Of The Heavens And The Earth, which was published on the 30th of August, 2013, which can be found here. In this topic we really don&#8217;t wish to <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/09\/01\/response-to-the-light-of-the-heavens-and-the-earth\/\" title=\"Response to: The Light Of The Heavens And The Earth\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5,4],"tags":[],"class_list":{"0":"post-652","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/652","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=652"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/652\/revisions"}],"predecessor-version":[{"id":657,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/652\/revisions\/657"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=652"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=652"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=652"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}