{"id":660,"date":"2013-09-12T07:52:58","date_gmt":"2013-09-12T07:52:58","guid":{"rendered":"http:\/\/twelvershia.net\/?p=660"},"modified":"2014-01-06T14:32:52","modified_gmt":"2014-01-06T14:32:52","slug":"response-to-hadith-of-the-bird","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/09\/12\/response-to-hadith-of-the-bird\/","title":{"rendered":"Response to: Hadith of the Bird"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=660\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to article on Revisitingthesalaf.org, entitled: Hadith of the Bird, which was published on the 21<sup>st<\/sup> of May, 2013 and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2013\/05\/hadeeth-of-bird.html\" rel=\"nofollow external\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">Bismillah wal salatu walsalam ala rasoolillah,<\/p>\n<p style=\"text-align: justify;\">“<em>Hadith Al-Tayr<\/em>” or the “Hadith of the Bird” is not an unclear narration that needs to be studied. It is actually quite the opposite; it is an infamous fabrication according to the majority of the scholars of hadiths. However, due to the abundance of chains, some of thought that the narration has some weight, when in reality, the amount of chains do not have an effect on the narration as we will soon demonstrate.<br \/>\nRTS, in this article start off by attempting to enforce their own understanding of the term <em>mutawatir<\/em>, while not being aware that the term itself was not used by the earliest hadith scholars.<\/p>\n<p style=\"text-align: justify;\">RTS defines it as:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Mutawatir or a &#8216;successive&#8217; narration is one conveyed by so many narrators simultaneously that it would be inconceivable for them to have unanimously agreed on falsehood and hence, questioning the authenticity of a Mutawatir narration would be unreasonable. A hadeeth is said to be Mutawatir if it was reported by a significant (though unspecified) number of narrators at each level in the chain of narration, thus reaching the succeeding generation through multiple chains of narration leading back to its source. This provides confirmation that the hadeeth and incident is authentically attributed to its source at a level above reasonable doubt. <\/span><\/p>\n<p style=\"text-align: justify;\">RTS then provides quotes from late scholars that suggest that one doesn’t need to look into the chain.<\/p>\n<p style=\"text-align: justify;\">We ask: Does having a lot of narrators on each level make it impossible for them to have agreed upon a fabrication? The answer is an obvious: No.<\/p>\n<p style=\"text-align: justify;\">Here is the most obvious scenario: A liar fabricates a narration. The narration is stolen by other fabricators, or by a group of his peers, and each of them creates their own chain, attribute it to different teachers, all the way up to the Prophet (<em>sallalahu alaihi wa salam<\/em>).<\/p>\n<p style=\"text-align: justify;\">Due to this, when Sh. Sa’ad Al-Humayyid (Al-Fawa&#8217;id Al-Hadeethiyah, p.10) was asked about whether one needs to check the narrators if the hadith is <em>mutawatir<\/em> he said:<\/p>\n<p style=\"text-align: justify;\">Rough translation: Most of those that spoke about this issue said: One doesn’t need to check the men in the chains. It seems that they mean their <em>dhabt <\/em>(ability of preserve hadiths), not their <em>adala <\/em>(uprightness), for one must check that out&#8230; It is true that one must know the <em>adala<\/em> of the narrators that are narrating these chains, as for the <em>dhabt<\/em>, one can be lenient, for if a hadith comes from many chains, they begin to strengthen each other, and together we can confirm for a fact that this was narrated.<\/p>\n<p style=\"text-align: justify;\">More importantly, let us for a moment assume that these opinions that RTS wants to accept are the correct ones. Al-Suyuti, was one of the scholars that RTS quoted, and yet, Al-Suyuti himself didn’t include this hadith in his book Qatf Al-Azhar Al-Mutanathira fi Al-Akhbar Al-Mutawatira (a book that contains all the <em>mutawatir<\/em> hadiths). Perhaps RTS is going to argue that this is due to the <em>nasb<\/em> (hate for Ahlulbayt) that Al-Suyuti had. However, Al-Suyuti himself includes other narrations as <em>mutawatir<\/em>, like the hadith of <em>man kuntu mawlaah<\/em> and hadith <em>al-manzila<\/em>.<\/p>\n<p style=\"text-align: justify;\">RTS then quotes the narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">My father told us, Yahya ibn Hassan told us, narrating Sulaiman ibn Bilal, narrating Yahya ibn Saeed, narrating Anas ibn Malik, he said, &#8220;I used to serve the Messenger of Allah peace and prayers of Allah be upon him, and the Messenger of Allah peace and prayers of Allah be upon him was served a roasted bird. Then he (saw) said, &#8216;Oh Allah (swt), bring me the one whom you love the most among all your creatures to eat with me this bird.&#8217; Then I said, &#8216;Oh Allah (swt), let him be a man from Al-Ansaar (the supporters).&#8217; Then Alee may Allah be pleased with him came, then I (Anas) said, &#8216;The Messenger of Allah is busy (with something).&#8217; Then (he came) again and I said, &#8216;The Messenger of Allah peace and prayers of Allah be upon him is busy.&#8217; Then he came (third time) and the Messenger of Allah (saw) said, &#8216;Open! (to let him in).&#8217; Then he (Alee (a.s)) came in. Then the Messenger of Allah peace and prayers of Allah be upon him said, &#8216;What was holding you from coming to me?&#8217; Then he(Alee (a.s)) replied, &#8216;This is the third time Anas holds me back, claiming that you busy doing something?&#8217; Then he (saw) said, &#8216;What made you do what you did?&#8217; Then I (Anas) said, &#8216;O Messenger of Allah (saw)! I had heard your  supplication and I liked it to be one of my folk.&#8217; Then the Messenger of Allah (saw) said, &#8216;The man might love his folk (his own tribe).'&#8221; <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Footnote: This is an <strong>authentic narration based on the condition of the two Sheikh&#8217;s i.e. Bukhari and Muslim<\/strong> and they did not narrate it. And it has been <strong>narrated with reference to Anas by a group of his companions that count more than thirty people<\/strong> then the narration was judged correct narrated by Alee (a.s) and Aboo Sa&#8217;eed Al-Khudri and Safina and in the narration of Thabit Al-Banani narrating Anas there are more terms added.<\/span><\/p>\n<p style=\"text-align: justify;\">I say: All those chains are fabrications according to the majority of the scholars of hadith, and these chains were in most cases, if not all cases, fabricated by late narrators. If RTS has an issue with this, then surely we can look at each of these narrations separately, one at a time, in order to prove this beyond the shadow of a doubt. As the readers are aware, it only takes one authentic chain for Ahlulsunnah to accept a narration, but thirty chains with liars and anonymous narrators will simply not cut it for us.<\/p>\n<p style=\"text-align: justify;\">Furthermore, Al-Hakim himself had two views on this narration, and was not consistent. He was asked in a <em>majlis<\/em> regarding its authenticity and he rejected that it was authentic. (See his biography in Al-Siyar.)<\/p>\n<p style=\"text-align: justify;\">Strangely enough, RTS then quotes a passage from Mizan Al-I’itidal in which Al-Thahabi weakens the narration for the anonymity of Ahmad bin Iyadh.<\/p>\n<p style=\"text-align: justify;\">However, he carries on by quoting the following statement by Al-Thahabi:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">“Hadeeth Al-Ta&#8217;ir (of the bird) has so many chains of narration, I collected them in a separate book and the total of it proves that the hadeeth is genuine.”<\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, this is a mistranslation of the actual text. The text says that the narration has an <em>asl<\/em>, which roughly translates into “an origin”. Such a term doesn’t necessarily mean that a narration is authentic, for hadithists have used the term in several manners, like Ibn Hibban in Al-Majrooheen 1\/184 saying, “This narration has an origin, but the narrator mentioned things that aren’t within this hadith.” In other words, the origin may have come in different forms as Al-Albani has stated in Al-Silsila Al-Dha’eefa 14\/148, which include one that shows that the Prophet (<em>sallalahu alaihi wa salam<\/em>) asked Allah to bring someone “that loves Allah and His prophet,” in another version it shows that he asked Allah to bring someone that “Allah and he loves”.<\/p>\n<p style=\"text-align: justify;\">Ironically, the exaggerated love that RTS has for Ali causes them to choose the narration that was quoted in Al-Mustadrak instead of the latter versions. Notice how the version in Al-Mustadrak implies that Ali is the favourite creation of Allah, placing him above all the angels and prophets, including Mohammad (<em>sallalahu alaihi wa salam<\/em>). Surely, if RTS were more moderate then they would choose the latter version.<\/p>\n<p style=\"text-align: justify;\">It should also be noted that Ibn Katheer in Al-Bidaya 7\/377 quoted Al-Thahabi’s opinion of the narrations of the bird from his book. He said, “All of them are ninety something, the best are weak strange ones, and the worst are fabricated paths, and most of them are just soft.”<\/p>\n<p style=\"text-align: justify;\">RTS then ends off with the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The most beloved individual to the Prophet (saw) was no other than Imam Alee (a.s). The Hadeeth reflects the extraordinary relationship he (a.s) had with the Prophet (saw) and his God given high position.<\/span><\/p>\n<p style=\"text-align: justify;\">I say: Actually, the version that RTS quoted shows that Ali was even more superior to him. However, it doesn’t seem to be an issue to RTS.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">We find this incident has at least 20 different chain of narrations and is indeed authentic. As we have already shown, according to the principles of Science of Hadeeth, any narration that has 10 chains or more does not require its chain to be investigated. Despite this, we have also shown the numerous scholars who attested to this Hadeeth and there is no room for ambiguity. But the so-called, &#8216;Ahl ul Sunnah&#8217; do not stick to their own principles of Hadeeth. This just goes to show their double standards and inconsistency.<\/span><\/p>\n<p style=\"text-align: justify;\">If this is indeed the standard for grading a hadith, and that every narration that comes through many paths is to be considered authentic, then RTS should perhaps consider the narration in which Ali says that Abu Bakr and Omar are better than him. This too was narrated by many chains; <a title=\"External link\" href=\"http:\/\/gift2shias.files.wordpress.com\/2010\/09\/tafdil.doc\" rel=\"nofollow external\">seventeen chains<\/a> according to the study of brother Efendi (Gift2Shia), and this was only in a partial study of the narration. Plus, there is an agreement between all the scholars of Ahlulsunnah regarding the authenticity of this narration. So either RTS changes their definition of <em>mutawatir<\/em>, or just ignore this article and accept that inconsistency and having double standards are traits that best describes themselves.<\/p>\n<p style=\"text-align: justify;\"><em>Wal hamdulillahi rab al-aalameen<\/em>.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to article on Revisitingthesalaf.org, entitled: Hadith of the Bird, which was published on the 21st of May, 2013 and can be found here. Bismillah wal salatu walsalam ala rasoolillah, “Hadith Al-Tayr” or the “Hadith of the Bird” <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/09\/12\/response-to-hadith-of-the-bird\/\" title=\"Response to: Hadith of the Bird\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-660","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/660","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=660"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/660\/revisions"}],"predecessor-version":[{"id":865,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/660\/revisions\/865"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=660"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=660"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=660"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}