{"id":664,"date":"2013-09-22T09:03:46","date_gmt":"2013-09-22T09:03:46","guid":{"rendered":"http:\/\/twelvershia.net\/?p=664"},"modified":"2013-09-22T09:06:39","modified_gmt":"2013-09-22T09:06:39","slug":"response-to-who-killed-imam-hussain-a-s","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/09\/22\/response-to-who-killed-imam-hussain-a-s\/","title":{"rendered":"Response to: Who Killed Imam Hussain (a.s)?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=664\" alt=\"\" \/><\/p>\n<h3 style=\"text-align: justify;\">The following is a response to the article on RevisitingTheSalaf.org, entitled: Debate: Who Killed Imam Hussain (a.s)? The article was published on the 29<sup>th<\/sup> of April, 2013, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2013\/04\/debate-who-killed-imam-hussain-as_29.html\" rel=\"external nofollow\">here.<\/a><\/h3>\n<p style=\"text-align: justify;\">Unlike previous articles, RTS has based this one around an audio debate that occurred between them and Sh. Mumtaz Ul Haq. We at twelvershia.net are not associated with the shaikh, however, we have taken the responsibility of debunking the RTS site as a whole, and with this we proceed onwards.<\/p>\n<p style=\"text-align: justify;\">RTS said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Having conversed with the Sheikh, we have opined that it would be a waste of time to engage with a man with such an ornerier disposition. But we would be more than happy to do so via a debate on Paltalk (pursuant to rules that would be agreed upon by both parties). The Sheikh is more than welcome to post his challenge in the comments section found at the bottom of this article, or alternatively respond to the following questions below.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Firstly, we would like to outline what is clearly apparent in relation to Abdullah ibn Umar.  <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Clear Facts On Abdullah ibn Umar:<\/b> <\/span><\/p>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">He was advising people not to break their pledge with Yazid.<\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">It was at a time when the people of Madinah had a plan to overthrow Yazid.<\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">He relied upon a Hadeeth of the Prophet (saw) that any individual that breaks the pledge will be raised as a betrayer on the Day of Judgment.<\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">In his own words, he most certainly underlined that the pledge to Yazid was pursuant to the conditions enjoined by Allah (swt) and His Apostle (saw). <\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">He said that anyone that opposes Yazid having previously given him (Yazid) a pledge is devoid of faith.<\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">He would distance himself from anyone that broke the pledge to Yazid.<\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">He visited the home of an acquaintance wherein he declared his backing of Yazid.<\/span><\/li>\n<\/ul>\n<ul style=\"text-align: justify;\">\n<li><span style=\"color: #ff0000;\">He said that those who broke the pledge to Yazid and those who did not give a pledge to a Amir (Yazid) shall die the death of Jahilliyah (non Muslim) i.e. All their deeds would be nullified and thus die as non Muslims (apostates).  <\/span><\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Now, Sheikh Mumtaz vouched on his life that narrations in reference to Umar deeming the opponents of Yazid as apostates as being non-existent. Let us see whether these narrations exist or not, or is it true that the Shi&#8217;a lie as the Sheikh suggested? (Please refer to the scans provided below).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Questions For Mumtaz Ul Haq: <\/b><\/span><\/p>\n<ol style=\"text-align: justify;\" start=\"1\">\n<li><span style=\"color: #ff0000;\">Do you accept that a companion by definition is an individual who dies on Iman?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Do you believe all the companions are stars of guidance and that they shall be raised on the Day of Judgement in a good successful state?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Do you believe that those companions who did not give ba&#8217;yah to Yazid and died in such a state (whether that be naturally or during the battle of Karbala) died the death of apostates?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Do you believe that those Sahaba who broke their ba&#8217;yah to Yazid and were then slaughtered in Harra, died as apostates and shall face the humiliation of being raised as rebels on the Day of Judgement?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Do your answers to questions 1-4 above concur with the two fatwas of Abdullah ibn Umar?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">If not, why not? Do you know more about your religion than Abdullah ibn Umar?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Will an apostate be raised in a humiliating or successful state on the Day of Judgement?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Does a person that dies the death of an apostate enter Jannah?<\/span><\/li>\n<li><span style=\"color: #ff0000;\">How do the two fatwas of Abdullah ibn Umar concur with your belief that all the companions are in Paradise?<\/span><\/li>\n<\/ol>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> If ANYONE can satisfactorily answer the above questions we pledge to: REMOVE this video and shut down the channel and site, seek repentance for the error of our ways and publicly covert to Sunnism on the hands of Sheikh Mumtaz.<\/span><\/p>\n<p style=\"text-align: justify;\">In section 6 of the article, RTS included the scans that suggest that Ibn Umar saw those that opponents of Yazeed were apostates.<\/p>\n<p style=\"text-align: justify;\">RTS argued:<\/p>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">And last but not least, we arrive at Abdullah ibn Umar who supported the Caliphate of the drunkard, monkey loving man Yazid. Sheikh Mumtaz did not and would not accept the fact that Abdullah ibn Umar spoke in favour of Yazid and that he claimed the oath of allegiance to him was in accordance to the conditions enjoined by Allah (swt) and his Apostle (saw). We would like to ask what Abdullah ibn Umar meant by this. Was he implying Allah (swt) and our beloved Prophet (saw) would accept a man like Yazid to be a ruler of the Muslims?  Abdullah ibn Umar made a very bold claim directed at those who went against Yazid as being faithless and ignorant. According to this theory, what would that make Imam Hussain (a.s) who went out to defend the pure religion of Islam against this rapist? Astaghfirullah! Why do we find Sunnis often rejecting such hadith when they are clear as crystal in their own books. It may be that Sheikh Mumtaz was unaware of the existence of these hadith in the Sihah as Sittah and so claimed whatever was being narrated as, &#8220;Bogus, Da&#8217;if and Fabricated&#8221; and thus vouched his life against it. It is often said that wise men think before they speak whereas fools speak before they think, this saying would come in handy at this point since a wise man would not allow themselves to be put in such a destructive position, especially when evidence can be given and will be given below.<\/span><\/p>\n<p style=\"text-align: justify;\">By returning to the audio debate to the 15<sup>th<\/sup> minute, we hear the following from RTS:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Abdullah bin Umar had the belief that all those that refuse to give their oath of allegiance to Yazeed ibn Mu’awiya, they are going to be raised as apostates on the day of judgement.<\/span><\/p>\n<p style=\"text-align: justify;\">Sh. Mumtaz responded:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">No, he did not. I can vouch my life on that.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS then started to quote Al-Bukhari and Muslim. The following are the translations from the scans provided on the RTS website:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Nafi&#8217;: When the people of Madinah dethroned Yazeed bin Mu&#8217;awiyah, ibn Umar gathered his special friends and children and said, &#8220;I heard the Prophet (saw) saying, ‘A flag will be fixed for every betrayer on the Day of Resurrection,&#8217; and <b>we have given the oath of allegiance to this person (Yazeed) in accordance with the conditions enjoined by Allah (swt) and His Apostle (saw) and I do not know of anything more faithless than fighting a person who has been given the oath of allegiance in accordance with the conditions enjoined by Allah (swt) and His Apostle (saw), and if ever I learn that any person among you has agreed to dethrone Yazeed, by giving the oath of allegiance (to somebody else) then there will be separation between him and me.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Saheeh Al-Bukhari (Arabic Only). Pg. # 1759, H. # 71.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p style=\"text-align: justify;\">In this narration, we find Ibn Umar quoting the hadith of the Prophet (salalahu alaihi wa salam) about the betrayers. However, there is no indication that these betrayers are to be raised as apostates. All that the narration says is that a flag will be raised for them. An apostate, on the other hand, is one that is taken out of the fold of Islam and into the hellfire. Nothing in the narration of the Prophet (salalahu alaihi wa salam), nor the words of Ibn Umar, indicate that those that rebelled against Yazeed are apostates.<\/p>\n<p style=\"text-align: justify;\">The next narration, from Saheeh Muslim, is the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It has been reported on the authority of Nafi, that Abdullah b. Umar paid a visit to Abdullah b. Muti&#8217; in the days (when atrocities were perpetrated on the People Of Madinah) at Harra in the time of Yazeed b. Mu&#8217;awiyah. Ibn Muti&#8217; said: &#8220;Place a pillow for Abu Abd al-Rahman (family name of Abdullah b. Umar).&#8221; But the latter said: &#8220;I have not come to sit with you. I have come to you to tell you a tradition I heard from the Messenger of Allah (may peace be upon him). I heard him say: &#8216;One who withdraws his band from obedience (to the Amir) will find no argument (in his defence) when he stands before Allah (swt) on the Day of Judgment, <b>and one who dies without having bound himself by an oath of allegiance (to an Amir) will die the death of one belonging to the days of Jahiliyyah.'&#8221;<\/b> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Saheeh Muslim (Arabic Version). Pg. # 898, H. # 1851.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">Sh. Mumtaz commented:<\/p>\n<p style=\"text-align: justify;\">That is not what that hadith is saying. That is the conclusion that you want to draw.<\/p>\n<p style=\"text-align: justify;\">Other scholars have expanded, like Ibn Hajar who commented in Fath Al-Bari:<\/p>\n<p style=\"text-align: justify;\"><b>حالة الموت كموت أهل الجاهلية على ضلال وليس له إمام مطاع ، لأنهم كانوا لا يعرفون ذلك ، وليس المراد أنه يموت كافرا بل يموت عاصي<\/b><\/p>\n<p style=\"text-align: justify;\">Rough translation:  The type of death is like that of the people of Jahilliya, lost and without a leader, because they didn’t know any of that, and it doesn’t mean that he dies as an unbeliever, but as a sinner.<\/p>\n<p style=\"text-align: justify;\">Al-Nawawi commented on this hadith in his commentary of Saheeh Muslim by saying:<\/p>\n<p style=\"text-align: justify;\">أي : على صفة موتهم من حيث هم فوضى لا إمام لهم .<\/p>\n<p style=\"text-align: justify;\">Rough translation: They will die in a fashion similar to theirs (the people of Jahiliyyah) since they were in chaos and had no leader.<\/p>\n<p style=\"text-align: justify;\">Al-Suyuti commented on this hadith in his explanation of Sunan Al-Nasa’ee:<\/p>\n<p style=\"text-align: justify;\">أي كما يموت أهل الجاهلية من الضلال والفرقة<\/p>\n<p style=\"text-align: justify;\">Rough translation:  They die like the people of Jahilliyah, lost and divided.<\/p>\n<p style=\"text-align: justify;\">In light of the above explanations provided by the scholars, it is clear that the hadith does not mean that those that do not pledge allegiance to the leaders of their times are unbelievers, nor is this the view of Ibn Omar. Therefore, Sh. Mumtaz Al-Haqq is correct in denying that these words are in Al-Bukhari. Not only because these words literally are not there, but even because the explanation provided by RTS is faulty. Furthermore, all the questions posed above provided by RTS are no longer problematic with the correct interpretation provided by the scholars above.<\/p>\n<p style=\"text-align: justify;\">We hope that RTS will keep their promise to take down the video, apologize publicly, and convert to Ahlul Sunnah now on the hands of the good shaikh since the answers have been satisfactorily been answered.<\/p>\n<p style=\"text-align: justify;\">RTS continues:<br \/>\n<span style=\"color: #ff0000;\">We will now take a closer look at some individuals, rather some sahaba, who took part in the mistreatment and killing of Muslim ibn Aqeel (a.s), Imam Hussain (a.s) and his companions in Karbala and how the scholars accept these very individuals as being reliable and trustworthy for their sources&#8230;<\/span><\/p>\n<p style=\"text-align: justify;\">Even if we assume that RTS is correct in accusing the Sahaba of killing Al-Hussain, which is completely false, we respond to RTS by quoting their own words in the video (see 5<sup>th<\/sup> minute):<\/p>\n<p style=\"text-align: justify;\">“You know as well as I do that we (both Sunnis and Shias) can take narrations from the people of innovation as long as what they say does not favour their belief.”<\/p>\n<p style=\"text-align: justify;\">However, RTS is missing the big picture, which is that Sh. Mumtaz is arguing that the Sahaba are more trustworthy than the people of Al-Kufa, which is unanimously agreed upon by Ahlulsunnah. So, even if one argued that a couple of people were responsible for these crimes, it would not affect the status of the Sahaba in general, but would only be a blight on that specific Sahabis reputation.<\/p>\n<p style=\"text-align: justify;\">RTS’ goal, in the following section of the article is to prove the following:<br \/>\n<span style=\"color: #ff0000;\">As is evidenced, the killers of Imam Hussain (a.s) were actually the forefathers of the so-called &#8216;Ahl Sunnah Wal Jammah.&#8217; From those that have been discussed included companions of the Prophet (saw) and Tab&#8217;iee who have narrated throughout the Sahih Sittah. These are just some of the many so-called &#8216;Rightly guided Salaf&#8217; whom the present day so-called &#8216;Ahl ul Sunnah&#8217; consider a pillar of their religion.<\/span><\/p>\n<p style=\"text-align: justify;\">Together, we shall examine this claim is true.<\/p>\n<p style=\"text-align: justify;\">RTS starts:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>PERSON #  1<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Amr bin Al-Hurayth<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Muhammad ibn Jarir:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">When Muslim ibn Aqeel saw that he had been left alone, he began to wander through the streets. He came to a door and stopped. A woman came out to him. He asked her to give him a drink. She gave him a drink and then returned inside her house. She delayed for as long as God decreed and then came back out to find him still at the door. She said, &#8220;Servant of God, your staying here is suspicious, Go Away!&#8221; He replied, &#8220;I am Muslim b. Aqeel, will you shelter me?&#8221; She told him to enter. Her son was a mawla of Muhammad Al-Ash&#8217;tah. When the boy recognized him, he went to Muhammad and told him. Muhammad went to Ubaydullah and told him. <b>Ubaydullah sent Amr b. Hurayth the commander of his police to get him. With him went Abd Al-Rahman b. Muhammad b. Ash&#8217;tah.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: The History of Al-Tabari. Vol. 19, Pg. # 21.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">We respond by quoting the complete narration:<\/p>\n<p style=\"text-align: justify;\"><b>فلم يعلم مسلم حتى أحيط بالدار فلما رأى ذلك مسلم خرج إليهم بسيفه فقاتلهم فأعطاه عبد الرحمن الامان فأمكن من يده فجاء به إلى عبيدالله فأمر به<\/b><b><\/b><\/p>\n<p style=\"text-align: justify;\">Rough translation: Muslim was not aware until he was surrounded, and when he realized, he came out to them with his sword, and fought them, so Abdulrahman promised him peace, and was able to get a hold of him. He was taken to Ubaidullah, who ordered him to be killed.<\/p>\n<p style=\"text-align: justify;\">As we can see in the narration, the duty given to Amr bin Huraith was only to bring Muslim bin Aqeel in. Muslim obliged and came in peacefully. Amr bin Huraith is no to be held accountable for the actions of his Waali (Ubaidullah). Furthermore, there is no evidence that Amr bin Huraith took part in the battle of Karbala.<\/p>\n<p style=\"text-align: justify;\">RTS also provides a quote from Al-Bidaya wal Nihaya, which is based on the narration of Abu Mikhnaf from Tareekh Al-Tabari. Abu Mikhnaf is a known hadith fabricator, so this narration is rejected (see his biography Mizan Al-I’itidal).<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>PERSON #  2<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Umar ibn Sa&#8217;ad <\/b><\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, it should be mentioned that Omar bin Sa’ad is not a companion of the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">RTS tried to argue that Omar bin Sa’ad is relied upon by Ahlulsunnah as a narrator. RTS did this by quoting opinions of Sunni scholars that suggest that he was truthful. When Yahya bin Ma’een was asked if he was trustworthy, he replied, “How can the killer of Al-Hussain be trustworthy?!” Even though there seems to be a contradiction between the two views, we can reconcile these by stating that the term “trustworthy” cannot be used for someone who is seen as a <i>fasiq<\/i> (immoral\/unjust). However, there is no evidence that Omar bin Sa’ad ever lied in a narration, which is why some scholars have regarded him as truthful in his narration. This can be seen when we examine the narration that RTS quoted from Musnad Ahmad that Omar bin Sa’ad narrated from his father that the Prophet (salalahu alaihi wa salam) said, “I am amazed by the judgement of Allah upon the believer: If good happened to him, he would thank his Lord, and if evil occurred, he would thank his Lord and be patience, and the believer is always rewarded, even when he raises the food for his wife to eat.”<\/p>\n<p style=\"text-align: justify;\">The first portion of the hadith is the famous hadith of Suhaib Al-Rumi, which can be found in Saheeh Muslim. As for the second part of the hadith about received rewards for feeding one’s wife can be found in the narration of Amir bin Sa’ad from his father in the Saheehain.<\/p>\n<p style=\"text-align: justify;\">Furthermore, Omar bin Sa’ad barely has any narrations. In fact, his only narration in the six books is in Sunan Al-Nasa’ee, which is weak, but is supported by other narrations in the very same chapter.<\/p>\n<p style=\"text-align: justify;\">Note: RTS mistranslated Al-Thahabi’s statement. He said, as we find in the scan:<\/p>\n<p style=\"text-align: justify;\">هو في نفسه غير متهم<\/p>\n<p style=\"text-align: justify;\">Rough translation: He is not accused (of lying).<\/p>\n<p style=\"text-align: justify;\">RTS falsely translated this as: He is a person not to be criticized.<\/p>\n<p style=\"text-align: justify;\">Note #2: RTS mistranslated Ibn Hajar’s statement. He said, as we find in the scan:<\/p>\n<p style=\"text-align: justify;\">صدوق<\/p>\n<p style=\"text-align: justify;\">Rough translation: Truthful.<\/p>\n<p style=\"text-align: justify;\">RTS falsely translated this as: Trustworthy. There is a major difference between these two words.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>PERSON #  3<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Ubaydullah ibn Ziyad <\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Ibn Hajar:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">He is Ubayd-Allah ibn Ziyad, the prince of Kufa for Mu&#8217;awiyah and his son Yazeed, and <b>he is the one who prepared the armies from Al-Kufa to fight Al-Hussain (r.a)<\/b> until he was killed in Karbala. He was known as ibn Marjana and she is his mother (Marjana). Ibn Asakir has mentioned his biography in Tarikh Dimashq <b>and he was mentioned in Sunan Aboo Dawood. And he narrated from Sa&#8217;ad bin Abi Waqqas and Mu&#8217;awiyah and Ma&#8217;qel bin Yasir and ibn Umayyah the brother of Bani Ja&#8217;dah. And from those who narrated from him are Al-Hasan Al-Basri and Aboo Al-Malih bin Usama.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Tajeel Al-Munfa Bazawayd Rijal Al-Aimaah Al-Arbah. Vol. 1, Pg.  # 840.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, Ubaidullah bin Ziyad is not a companion of the Prophet (salalahu alaihi wa salam), nor is he considered as trustworthy.<\/p>\n<p style=\"text-align: justify;\">Furthermore, he does not have any narrations in any of the books of the Sunnah, nor did Al-Hasan or Abu Maleeh narrated from him. Both of these narrators mentioned him in narrations that he was a part of, not that he was the actual narrator. This is why Ibn Hajar said, “Al-Mizzi did not write a biography for him.” RTS did not translate this, but it is available in the scan provided. Al-Mizzi’s book was created for narrators of the six books, which means that he did not consider Ubaidullah bin Ziyad a narrator. Furthermore, the same narrations, in which Ubaidullah bin Ziyad was quoted in can be found in Musnad Ahmad, but Ibn Hajar assrts, “Ubaidullah has no narration in the Musnad.” This too was not translated by RTS but can be found in the scan provided on the RTS website.<\/p>\n<p style=\"text-align: justify;\">Ironically, RTS then attempted to quote the following as evidence:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Ubayd Allah ibn Ziyad ibn Amroo, or Amir, Al-Jarmi, Aboo Qelaba Al-Basri: <b>Trustworthy and has many transmitters,<\/b> <b>Al-Ijlli said: He has a little Nasb, from the third generation.<\/b> He died in The middle eastern part of the Mediterranean and was escaping from judiciary in the year 400 A.H and also been said it might be after that. <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Kashaf Al-Dhahabi: <b>His Hadeeth are from Umar, Aboo Huraira, A&#8217;isha, Mu&#8217;awiyah, and Samurah in Sunan Al-Nasa&#8217;i and those are transmitters. Also from Thabet ibn Al-Dhahak, Malik ibn Al-Huwayreth, Anas and those are in the Saheeh. Also from Qutadah and Yahya ibn Abi Kathir and Ay&#8217;oob and Khalq. <\/b>He escaped judiciary and lived in Darayya. Died in 104 A.H or 107 A.H. <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Taqreeb Al-Tahdeeb. Pg. # 318, Person # 3333.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">We at twelvershia.net are aware that the RTS team is ignorant in Arabic, however, we suggest that the find new support. The narrator described above is Abdullah bin Zaid, not Ubaidullah bin Ziyad.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>PERSON #  4<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Shimr ibn Thil Jawshan <\/b><\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, Shimr is not a companion of the Prophet (salalahu alaihi wa salam), nor is he considered as trustworthy. Secondly, he has not narrated anything in any of the books of hadith. However, the view that he has narrated is due to a statement from Shaqeeq in Tareekh Dimashq, where in which he says that he believes that one of the narrations of Abu Ishaaq from Thu Al-Jawshan (Shimr’s father) is most likely from his son, since Shimr was a neighbour of Abu Ishaaq.<\/p>\n<p style=\"text-align: justify;\">In any case, even if this was considered as proof, it does not mean that Shimr is reliable, or has any weight as a narrator. As we can see from the narration provided by RTS, even the supposed sole narrator from Shimr believed that he is destined for hellfire.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>PERSON #  5<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b> Qadi Shureh ibn Al-Harith<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Ibn Kathir:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Ubaydullah ibn Ziyad said to Hani bin Urwah Muradi: &#8220;Allah has made your blood Halal for me because you are Haroori.&#8221; Thus according to his orders he was locked up next to a house and his tribe Banu Mazhaj came and stood at the door of the palace along with Umro bin Al-Hajjaj. They thought that Hani had been killed. When ibn Ziyad heard their noise he asked <b>Qadi Shureh who was near him to go to the people and tell them that the Ameer has detained him so that he could question him about Muslim bin Aqeel. Therefore Qadi told them: &#8220;Your master is alive and our king has beaten him up to a extent where there was no danger to his life.&#8221;<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Al-Bidayah Wa&#8217;an-Nihayah. Vol. 11, Pg. # 484 &#8211; 485.<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">Shuraih, the judge, was not a companion of the Prophet (salalahu alaihi wa salam). The narration does not imply anything about his support or the mistreatment towards those that stood with Al-Hussain. The narration is without a chain and cannot be accepted as evidence.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>PERSON #  6<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Muhammad ibn. Al-Ashath<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Muhammad ibn Jarir:<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Kathir met a man from Kalb called Abd al-Ala ibn Yazid. He was carrying arms with the intention of joining Muslim bin Aq&#8217;eel with his fellow youths. He seized him (Abd al-Ala) and took him to Ibn Ziyad. Kathir told Ibn Ziyad about the man, but the man told Ibn Ziyad that he had been intending to come to him. Ibn Ziyad retorted “Sure, sure! I remember that you promised me that!” Ibn Ziyad ordered the man to be imprisoned.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> Muhammad ibn. Al-Ashath went out until he reached the houses of the Banu Umarah. Umarah. Salkhan Al-Azdi came to him he was on his way to Muslim Ibn Aq&#8217;eel and was carrying arms. <b>Muhammad ibn al-Ashath seized him and sent him to Ibn Ziyad who imprisoned him<\/b>.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b> <\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Tarikh Al-Tabbari, Vol. 5, 369 &#8211; 370.<\/b><\/span><b><\/b><\/p>\n<p style=\"text-align: justify;\">The narration is weak since it is narrated by Abi Mikhnaf, who is an infamous liar (see Mizan Al-I’itidal for his biography).<\/p>\n<p style=\"text-align: justify;\">Note: RTS mistranslated the following quote from Ibn Hajar:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Muhammad b. Al-Ash`ath b. qays Al-Kindi, Abu &#8216;l-Qasim Al-Kufi, from the second generation and is mentioned by the Companions that died in the year 67 A.H <\/span><\/p>\n<p style=\"text-align: justify;\">The actual quote says:<\/p>\n<p style=\"text-align: justify;\">محمد بن الأشعث بن قيس الكندي، أبو قاسم الكوفي: مقبول، من الثانية، ووهم من ذكره في الصحابة، مات سنة سبع وستين.<\/p>\n<p style=\"text-align: justify;\">Rough translation: Mohammad bin Al-Ash’ath bin Qais Al-Kindi, Abu Qasim Al-Kufi, <i>maqbool <\/i>(according to Ibn Hajar, the narrators that are considered <i>maqbool <\/i>are those that are accepted in their narrations only in the case that they have a supporting narrator with them) from the second level, and those that mentioned him in the Sahaba were mistaken. He died in the year 67.<\/p>\n<p style=\"text-align: justify;\">RTS then went on the quote narrations from Al-Nasa’ee to show that Ahlulsunnah relied upon this narrator.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Muhammad bin al-Ash&#8217;ath bin Qais, of Aisha, she said: &#8220;The Prophet (saw) did not keep away from anything of my face when he was fasting.&#8221; And in it, he said: I was told by my father, he said: We were told by Yahya bin Zakariyya bin Abi-Za&#8217;ida, he said: I was told by my father, of Saleh al-Asadi, of Al-Shu&#8217;bi, of Muhammad bin al-Ash&#8217;ath bin Qais, of Aisha &#8211; the same narration.<\/span><\/p>\n<p style=\"text-align: justify;\">The same narration though is narrated by Al-Aswad from A’isha in Sunan Al-Nasa’ee #1634 and by Masrooq from A’isha in Musnad Ahmad #25068, which means that Ahlulsunnah did not rely upon Mohammad bin Al-Ash’ath on this narration, but it has arrived us through other authentic chains.<\/p>\n<p style=\"text-align: justify;\">RTS then boasts that Al-Albani authentic the following narration, implying that Ahlulsunnah rely on this narrator:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Narrated Abdullah ibn Mas&#8217;ud: <b>Muhammad ibn al-Ash&#8217;ath<\/b> said: Al-Ash&#8217;ath bought slaves of booty from Abdullah ibn Mas&#8217;ud for twenty thousand (dirhams. Abdullah asked him for payment of their price. He said: I bought them for ten thousand (dirhams). Abdullah said: Appoint a man who may adjudicate between me and you. Al-Ash&#8217;ath said: (I appoint) you between me and yourself. Abdullah said: I heard the Apostle of Allah (saw) say: If both parties in a business transaction differ (on the price of an article), and they have witness between them, the statement of the owner of the article will be accepted (as correct) or they may annul the transaction<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Source: Saheeh Sunnan Abu Dawood, Pg. 630, Pg. # 3511<\/b><\/span><\/p>\n<p style=\"text-align: justify;\">Al-Albani actually weakens the chain in question in Al-Silsila Al-Saheeha #798. However, he authenticates this narration only due to the supporting chains. Therefore, the argument brought forth by RTS is flawed.<\/p>\n<p style=\"text-align: justify;\">To conclude this point, we can see quite clearly that the killers of Al-Hussain, or those that played a part in his death had little to no weight when it comes to the foundations of the religion as narrators of the prophetic sunnah.<\/p>\n<p style=\"text-align: justify;\">Unaware of their failure, RTS chooses to advertise:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">From more Nasbi and Kharji narrators in the Saheeh Sittah please refer to our two articles:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/07\/ahl-nawasib-wal-jammah.html\" rel=\"external nofollow\"><span style=\"color: #ff0000;\"><b>http:\/\/www.revisitingthesalaf.org\/2012\/07\/ahl-nawasib-wal-jammah.html<\/b><\/span><\/a><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><a href=\"http:\/\/www.revisitingthesalaf.org\/2012\/04\/khawarij-wal-jammah.html\" rel=\"external nofollow\"><span style=\"color: #ff0000;\"><b>http:\/\/www.revisitingthesalaf.org\/2012\/04\/khawarij-wal-jammah.html<\/b><\/span><\/a><\/span><\/p>\n<p style=\"text-align: justify;\">Due to the grace of Allah alone, rebuttals to those articles can be found on the twelvershia.net website as well:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/2013\/07\/14\/response-to-ahl-nawasib-wal-jammah\/\">http:\/\/www.twelvershia.net\/2013\/07\/14\/response-to-ahl-nawasib-wal-jammah\/<\/a><\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/www.twelvershia.net\/2013\/05\/02\/response-to-khawarij-wal-jammah\/\">http:\/\/www.twelvershia.net\/2013\/05\/02\/response-to-khawarij-wal-jammah\/<\/a><\/p>\n<p style=\"text-align: justify;\">RTS ends off this section of the article by stating:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">It is also worth pointing out that at the beginning of the discussion, Sheikh Mumtaz said Yazid was not the one who gave direct orders to kill Imam Hussain (a.s) and hence the matter should be left to Allah (swt). This is rather a bizarre comment since Al-Suyuti says Yazid wrote to Ubaydullah ibn Ziyad to murder Imam Hussain (a.s) which was further confirmed by Ubaydullah himself who said Yazeed was responsible for the killing. Sheikh Mumtaz may admit to Yazeed having &#8216;certain elements of responsibility&#8217; but in reality, the drunkard was completely and utterly responsible for the killing of Imam Hussain (a.s) and not a single excuse should be of acceptance!<\/span><\/p>\n<p style=\"text-align: justify;\">As much as we admire the zeal demonstrated by RTS, we must admit that we do not find evidence in the claims of a ninth century scholar. However, we will choose a middle path and say: If Yazeed did indeed order the killing of Al-Hussain, then we wish that he is among those that enter the hellfire.<\/p>\n<p style=\"text-align: justify;\">RTS moves on to section two of the article:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Section 2<\/b><\/span><br \/>\n<span style=\"color: #ff0000;\"> Sheikh Mumtaz opposed the fact that there were two types of Shi&#8217;a in the time of Imam Alee (a.s), and claimed the Shi&#8217;a were only those who supported Imam Alee (a.s). It is a well known and established fact that the earlier Sunnis were known as Shi&#8217;as and later adopted the name, &#8216;Ahl ul Sunnah Wal Jamaah.&#8217; According to the Sheikh, this is not the case. Let us now prove otherwise as was done in the discussion.<\/span><\/p>\n<p style=\"text-align: justify;\">We are in agreement with RTS here that the early Shias were mostly members of Ahlulsunnah. There were other groups that fell under the vast umbrella of <i>tashayyu<\/i>, however, those were a minority. In fact, if RTS wanted to argue that no Twelver Al-Hussain then RTS would be correct, since the Twelver faith was not established until the middle of the third century after the death of Al-Hasan Al-Askari.<\/p>\n<p style=\"text-align: justify;\">However, what Sh. Mumtaz seemed to be implying is that there were those from the Kufans who were “extreme” in their <i>tashayyu¸<\/i> who held practices that are similar to those that are held by contemporary Shias today, like <i>taqiyyah<\/i>, the ascription of divine attributes for the Imams, and <i>raj’ah<\/i>. People with such beliefs did exist in Kufa. However, as we have said, they were a minority, and shouldn’t hold the full blame for the death of Al-Hussain.<\/p>\n<p style=\"text-align: justify;\">RTS continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Section 3<\/b><\/span><br \/>\n<span style=\"color: #ff0000;\"> We will now show you the references quoted in the discussion pertaining to ibn Abbas advising Imam Hussain (a.s) not to go to Kufa since his (a.s) followers were but few and that this move from Makkah to Kufa was not at all politically motivated.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS is not clear about the significance of this opinion. There is no denial that the intention of receiving support from the people of Kufa implies some sort of political intent though.<\/p>\n<p style=\"text-align: justify;\">In the next section of the article, RTS tries something creative:<\/p>\n<p style=\"text-align: justify;\"><b> <\/b><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Section 4<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">  <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">Now we come to the issue of the letters received by Imam Hussain (a.s) and whether the letters received were from the Shi&#8217;a of Imam Hussain (a.s) or those who had no regard for the Imam (a.s). While Sheikh Mumtaz denies letters and says they can easily be forged, we shall now see what we have in the books of history and what the scholars have narrated. We find that some of these very letters were written by single individuals, others contained two, three or four signatures, all requesting Imam Hussain (a.s) to go to Kufa because they did not have an Imam. Many letters were delivered to him (a.s), so much so that he (a.s) received a total of as many as twelve thousand letters. He (a.s) did not answer any of them. The last letter he received was sent by Shabath ibn Rab&#8217;i, Ijar ibn Abjar, Yazid ibn Al-Harith, Izrah ibn Qays, Amr ibn Al-Hajjaj, and Muhammad ibn Ummayr ibn Utarid.<\/span><\/p>\n<p style=\"text-align: justify;\">As objective academics, we do not hold the view that those that invited Al-Hussain are his killers. However, we do believe that they let him down. This view is conforms with the Shari’ah as well, since one cannot be put to death for letting someone down, nor is such an action equivalent to murder.<\/p>\n<p style=\"text-align: justify;\">Shabath bin Rib’ee is the focus of this section of the article. RTS quotes several statements from the scholars of hadith, in an attempt to show that he was an important hadith narrator. However, RTS has failed to provide any statements from the scholars regarding his reliability. Furthermore, there is only one narration from him in the six books, which can be found in Sunan Abi Dawud in which the Prophet (salalahu alaihi wa salam) teaches Ali about a method of <i>tasbeeh<\/i>. The narration itself, from the path of Shabath is weak, since he is not considered reliable, and the narrator from him, Mohammad bin Ka’ab did not hear from him (Al-Bukhari said: We do not know that Mohammad bin Ka’ab heard from Shabath. See Tahtheeb Al-Tahtheeb). Furthermore, the narration is authentic through other paths, like through Ibn Abi Layla in the Saheehain, and it also narrated by Abu Dawud through Ibn A’abad. So, either way, Ahlulsunnah did not rely on Shabath for his narrations.<\/p>\n<p style=\"text-align: justify;\">Finally, RTS’ final argument:<\/p>\n<p style=\"text-align: justify;\"><b><br \/>\n<span style=\"color: #ff0000;\">Section 5<\/span><\/b><br \/>\n<span style=\"color: #ff0000;\"> We will now highlight that Sulayman bin Surad was infact a Sahabi who, along with his Shi&#8217;a, failed to aid Imam Hussain (a.s) after sending him letters and inviting him (a.s) to Kufa. Sheikh Mumtaz was very adamant in his claim that the people of Kufa were the Shi&#8217;a of Alee (a.s). Why is it that we find the Sahabi of the Prophet (saw), who is understood to be a star of guidance deceiving the grandson of the Prophet (saw) and the son of Imam Alee (a.s)?<\/span><\/p>\n<p style=\"text-align: justify;\">RTS proceeds by provide praise for Sulaiman bin Sard. RTS unfortunately does not seem to be aware that Sulaiman bin Sard is seen in a positive light in the eyes of Shia scholars as well.<\/p>\n<p style=\"text-align: justify;\">Al-Khoei, in the biography of Sulaiman states:<\/p>\n<p style=\"text-align: justify;\">لا ينبغي الاشكال في جلالة سليمان بن صرد ، وعظمته ، لشهادة<\/p>\n<p style=\"text-align: justify;\">الفضل بن شاذان بذلك<\/p>\n<p style=\"text-align: justify;\">Rough translation: There should be no issues about the high status and greatness of Sulaiman bin Sard since Al-Fadhl bin Shathaan has testified thus.<\/p>\n<p style=\"text-align: justify;\">RTS goes on to the next section:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"><b>Section 7<\/b><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\"> <\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #ff0000;\">The claim was made in that there is not a single Rafidi narrator in the Saheeh as Sittah. We shall present at least two to counter this claim. <\/span><\/p>\n<p style=\"text-align: justify;\">We are in agreement with RTS that the authors of the six books did include narrators that are Rafidhi. Even though Sh. Mumtaz did utter these words, then we stand against him if this was his intention. However, if he intended that the six authors never relied on Rafidhi narrators, then we are in agreement with him.<\/p>\n<p style=\"text-align: justify;\"><i>Wal hamdulillah<\/i> <i>rabbi al-alameen.<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingTheSalaf.org, entitled: Debate: Who Killed Imam Hussain (a.s)? The article was published on the 29th of April, 2013, and can be found here. Unlike previous articles, RTS has based this one <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/09\/22\/response-to-who-killed-imam-hussain-a-s\/\" title=\"Response to: Who Killed Imam Hussain (a.s)?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-664","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/664","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=664"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/664\/revisions"}],"predecessor-version":[{"id":668,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/664\/revisions\/668"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=664"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=664"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=664"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}