{"id":673,"date":"2013-10-26T10:13:11","date_gmt":"2013-10-26T10:13:11","guid":{"rendered":"http:\/\/twelvershia.net\/?p=673"},"modified":"2018-01-04T16:44:49","modified_gmt":"2018-01-04T16:44:49","slug":"hadith-of-thaqalayn","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/","title":{"rendered":"An In-Depth Study of Hadithul Thaqalayn"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=673\" alt=\"\" \/><img loading=\"lazy\" decoding=\"async\" class=\"alignnone aligncenter\" src=\"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/2\/27\/Basmala.svg\/608px-Basmala.svg.png\" alt=\"thaqalayn\" width=\"608\" height=\"122\" \/><\/p>\n<h1 style=\"text-align: justify;\">What is Hadithul Thaqalayn About?<\/h1>\n<p style=\"text-align: justify;\">Hadithul Thaqalayn speaks of two heavy matters the messenger (saw) left us, it speaks of two big responsibilities he asked us to carry, one of them much bigger and much more important than the other; the book of Allah most high, which he (saw) often instructed his nation to hold on to it, as they will never go astray if they do.<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) reminded us of the book of Allah in the sermon of farewell, we read in the narration of Ja`far bin Muhammad from his father from Jabir bin `Abdullah (ra) in the long Hadith of Hajj and the sermon of farewell in Sahih Muslim, that he (saw) said:<\/p>\n<p style=\"text-align: right;\"><strong>فَاتَّقُوا اللَّهَ فِي النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ وَلَكُمْ عَلَيْهِنَّ أَنْ لاَ يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ ‏.‏ فَإِنْ فَعَلْنَ ذَلِكَ فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَقَدْ تَرَكْتُ فِيكُمْ مَا لَنْ تَضِلُّوا بَعْدَهُ إِنِ اعْتَصَمْتُمْ بِهِ كِتَابَ اللَّهِ ‏.‏ وَأَنْتُمْ تُسْأَلُونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ ‏&#8221;‏ ‏.‏ قَالُوا نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ ‏.‏ فَقَالَ بِإِصْبَعِهِ السَّبَّابَةِ يَرْفَعُهَا إِلَى السَّمَاءِ وَيَنْكُتُهَا إِلَى النَّاسِ ‏&#8221;‏ اللَّهُمَّ اشْهَدِ اللَّهُمَّ اشْهَدْ ‏&#8221;‏ ‏.‏ ثَلاَثَ مَرَّاتٍ<\/strong><\/p>\n<p style=\"text-align: justify;\">[&#8230;Fear Allah concerning women! Verily you have taken them on the security of Allah, and intercourse with them has been made lawful unto you by words of Allah. You too have right over them, and that they should not allow anyone to sit on your bed whom you do not like. But if they do that, you can chastise them but not severely. Their rights upon you are that you should provide them with food and clothing in a fitting manner. I have left among you the Book of Allah, and if you hold fast to it, you would never go astray. And you would be asked about me (on the Day of Resurrection), (now tell me) what would you say? They (the audience) said: We will bear witness that you have conveyed (the message), discharged (the ministry of Prophethood) and given wise (sincere) counsel. He (the narrator) said: He (the Holy Prophet) then raised his forefinger towards the sky and pointing it at the people (said):&#8221; O Allah, be witness. O Allah, be witness,&#8221; saying it thrice&#8230;]<\/p>\n<p style=\"text-align: justify;\">Even before the last pilgrimage, The Prophet (saw) always reminded his companions, of the importance of Allah&#8217;s book, and that it saves from misguidance, we read in the Sahih Hadith of Musannaf ibn abi Shaybah, Sa`eed al-Maqburi narrates from abu Shurayh al-Khuza`ee (ra) that:<\/p>\n<p style=\"text-align: right;\"><strong>حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ فَقَالَ: &#8221; أَبْشِرُوا وَأَبْشِرُوا، أَلَيْسَ تَشْهَدُونَ أَنْ لا إِلَهَ إِلا اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ؟ &#8221; قَالُوا: نَعَمْ، قَالَ: &#8221; فَإِنَّ هَذَا الْقُرْآنَ سَبَبٌ طَرَفُهُ بِيَدِ اللَّهِ، وَطَرَفُهُ بِأَيْدِيكُمْ، فَتَمَسَّكُوا بِهِ، فَإِنَّكُمْ لَنْ تَضِلُّوا، وَلَنْ تَهْلِكُوا بَعْدَهُ أَبَدًا<\/strong><\/p>\n<p style=\"text-align: justify;\">[The messenger (saw) came out towards us saying: &#8220;I give you glad tidings, I give you glad tidings! Do you not testify that Allah is the only God and that I am his messenger?&#8221; They said: &#8220;Yes&#8221; He said: &#8220;This Qur&#8217;an is a means of salvation, a part of it is in your hands and another is in the hand of God, so hold on to it, you will never go astray nor perish after doing so.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Even in Nahj-ul-Balaghah, `Ali says in the first Sermon, that the Prophet (saw) passed away but did not leave his nation without means of guidance, he left them what all prophets left their nations, the book of Allah:<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"line-height: 1.5;\">ثُمَّ اخْتَارَ سُبْحَانَهُ لُِمحَمَّد صلى الله عليه لِقَاءَهُ، وَرَضِيَ لَهُ مَا عِنْدَهُ، فَأَكْرَمَهُ عَنْ دَارِالدُّنْيَا، وَرَغِبَ بِهَ عَنْ مُقَارَنَةِ البَلْوَى، فَقَبَضَهُ إِلَيْهِ كَرِيماً، وَخَلَّفَ فِيكُمْ مَا خَلَّفَتِ الاَْنْبيَاءُ في أُمَمِها، إذْ لَم يَتْرُكُوهُمْ هَمَلاً، بِغَيْر طَريق واضِح، ولاَعَلَم(5) قَائِم. كِتَابَ رَبِّكُمْ [فِيكُمْ:] مُبَيِّناً حَلاَلَهُ وَحَرامَهُ، وَفَرَائِضَهُ وَفَضَائِلَهُ، وَنَاسِخَهُ وَمَنْسُوخَهُ(1)، وَرُخَصَهُ وَعَزَائِمَهُ(2)، وَخَاصَّهُ وَعَامَّهُ، وَعِبَرَهُ وَأَمْثَالَهُ، وَمُرْسَلَهُ وَمَحْدُودَهُ(3)، وَمُحْكَمَهُ وَمُتَشَابِهَهُ(4)، مُفَسِّراً جُمَلَهُ، وَمُبَيِّناً غَوَامِضَهُ.<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"line-height: 1.5;\">[&#8230;Then Allah chose for Muhammad (saw) to meet Him, selected him for His own nearness, regarded him too dignified to remain in this world and decided to remove him from this place of trial. So He drew him towards Himself with honor. He (saw) left among you the same thing other Prophets left among their peoples, because Prophets do not leave them untended without a clear path and a standing ensign, namely the Book of your Creator clarifying its permission and prohibitions, its obligations and discretion&#8230;]<\/span><\/p>\n<p style=\"text-align: justify;\">The second important responsibility is towards his Ahlul-Bayt, he reminded the Muslims of his family&#8217;s rights and entrusted them to his nation. However, a sect from the Muslims called the Shia claims that the Prophet (saw) told us at the event of Ghadeer, in his narration famously known as &#8220;Thaqalayn&#8221; that holding on to his household would save us from going astray, so is their understanding correct? Did the Prophet (saw) really say such a thing even after he said what he said in the narrations above? Or is it all a misunderstanding and misinterpretation of his words peace be upon him.<\/p>\n<h2 style=\"text-align: justify;\">List of Texts and Chains of Thaqalayn<\/h2>\n<p><strong>Purpose of Thaqalayn Research<\/strong><\/p>\n<p style=\"text-align: justify;\">This research is not aimed to prove whether the narration of al-Thaqalayn is authentic or not, because all Muslims agree on its authenticity. The purpose of this research is to identify the most authentic texts of this narration and the most reliable and accurate of wordings which c ould later help us greatly in understanding the true meaning of the narration. Muslim sects such as the Shia have often differed with the rest of the Islamic nation about the interpretations of narrations such as Hadith al-Ghadeer, <a href=\"http:\/\/www.twelvershia.net\/2014\/05\/08\/fadak-prophetic-inheritance-qa\/\">Fadak<\/a>, Hadith al-Kisa’ and the popular Hadith of Thaqalayn, each side claiming to understand the true meaning intended behind those religious texts. The biggest of problems when it comes to explaining such narrations, is that every team picks and chooses from the various forms and versions of these texts, each group selecting the wordings that suit them the most and dismissing the wordings that do not serve their purpose.For instance:When the Imami Shia wish to quote the narration of Thaqalayn, they would quote the following version:“I am leaving among you two weighty things that if you adhere to them you will never go astray, the Qur’an and my household.” Whereas Ahlul-Sunnah, when they wish to quote it, they would select this one: “I am leaving you two weighty things, the first being the book of Allah, in it is guidance and light, and my household, by Allah I remind you of my household, by Allah I remind you of my household.” It is no secret that each of the two texts quoted above leans towards the beliefs of one of the two groups, the first text which the Shia prefer equates between the Qur’an and Ahlul-Bayt, giving them the same importance and value, and this is a Shia belief, in fact the Shia would claim Ahlul-Bayt to be more important as they are not “Silent” like the book of Allah. It also shows according to them that obeying Ahlul-Bayt is an absolute order and that they are infallible. While all of this is still debatable even when using the first text, yet it surely is more suitable than the second text which implies that the guidance is only from the Qur’ an. In order to better understand the Hadith and the meaning behind it, we wish to collect all of its texts and chains from the authentic reliable books, grade all of them in a professional way and collect the authentic expressions then translate them and comment on them one by one.<\/p>\n<div style=\"text-align: justify;\" data-canvas-width=\"339.97499999999997\">\n<p><strong>Methodology for the Thaqalayn List<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">For this list we decided to trace the texts of this narration from its earliest roots, starting with books from the second century Hijri and ending with books from the seventh century Hijri. The most value and importance is given to the earliest and most authentic of sources, and we have gone through every single chain for this Hadith in the early reliable books. Below we start by listing all sources from the earliest to the latest, we begin by mentioning the name of the source in bold letters, next to it are the dates of birth and death of the author according to Hijri calendar, then the number of narrations included in that source. The second step is to include the full chain and text in original Arabic as it is initially found in the source, it was not possible to translate every single text because of their big numbers so we decided to translate only those who turn out to be reliable (Sahih or Hasan) after grading. We translated the full chain of narrators for every narration in red font, with the name of the companion on the far right. Below this in black font is the grading of the narration and the main reason for weakening or strengthening it. We have only used the most reliable books of Rijal to judge each of the narrators and we decided to not be very harsh or too lenient in our judgment as it would greatly reduce the value and reliability of our research and our hard work would be lost and therefore the truth.<\/p>\n<p style=\"text-align: justify;\">Click on the titles to download related (PDF) files and find out:<\/p>\n<\/div>\n<div style=\"text-align: justify;\" data-canvas-width=\"339.97499999999997\"><\/div>\n<div style=\"text-align: justify;\" data-canvas-width=\"339.97499999999997\"><\/div>\n<ol>\n<li><strong><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/10\/List-of-Texts-and-Chains-of-Thaqalayn.pdf\" rel=\"external nofollow\">List of Texts and Chains of Thaqalayn<\/a><\/strong><\/li>\n<li><strong><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/10\/Tree-of-Thaqalayn-Chains.pdf\" rel=\"external nofollow\">Tree of Thaqalayn Chains<\/a><\/strong><\/li>\n<li><strong><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/10\/Authentic-Expressions-of-Thaqalayn.pdf\" rel=\"external nofollow\">Authentic Expressions of Thaqalayn<\/a><\/strong><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Also, do check out our <strong><a href=\"http:\/\/twelvershia.net\/2015\/04\/18\/murajaat-thaqalayn\/\" rel=\"external nofollow\">Muraja&#8217;aat Audio Clip About Hadithul Thaqalayn. <\/a><\/strong><\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-2610 size-full\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg\" alt=\"thaqalayn\" width=\"426\" height=\"179\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah.jpg 426w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2015\/01\/alhamdulillah-300x126.jpg 300w\" sizes=\"auto, (max-width: 426px) 100vw, 426px\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>What is Hadithul Thaqalayn About? Hadithul Thaqalayn speaks of two heavy matters the messenger (saw) left us, it speaks of two big responsibilities he asked us to carry, one of them much bigger and much more important than the other; <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\" title=\"An In-Depth Study of Hadithul Thaqalayn\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11],"tags":[],"class_list":{"0":"post-673","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/673","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=673"}],"version-history":[{"count":18,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/673\/revisions"}],"predecessor-version":[{"id":4262,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/673\/revisions\/4262"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}