{"id":678,"date":"2013-10-28T09:35:52","date_gmt":"2013-10-28T09:35:52","guid":{"rendered":"http:\/\/twelvershia.net\/?p=678"},"modified":"2015-03-20T01:57:20","modified_gmt":"2015-03-20T01:57:20","slug":"why-would-some-of-the-muslims-be-driven-away-at-the-fount","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/10\/28\/why-would-some-of-the-muslims-be-driven-away-at-the-fount\/","title":{"rendered":"Why would a part of the nation be driven away by the Prophet (saws) at the fount?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=678\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The Shia would usually quote a narration from the books of Ahlul-Sunnah and they would claim that the close companions of the Prophet (saws) changed their religion after his death, we tell the Shia that these narrations are not talking about his close companions who sacrificed their lives for him, but they are talking about those people who refused to pay Zakat and those who rejected Islam after his departure (saws). It was the close companions of the Prophet (saws) such as Abu Bakr (ra) and `Ali (ra) and Bilal (ra) who fought these deserters who changed their faith, which makes it really silly for some modern day Shia to come and claim that it was those close companions who changed and were rejected at the fount.<\/p>\n<p style=\"text-align: justify;\">From <a title=\"External link\" href=\"http:\/\/sunnah.com\/muslim\/2\" rel=\"nofollow external\">Saheeh Muslim<\/a> we find the Hadiths of Abu Huraira (ra) and Hudhaifa (ra). Both are similar in meaning, but here they are for the benefit of all:<\/p>\n<p style=\"text-align: justify;\">1- The Messenger of Allah (salalahu alaihi wa salam) said: My people would come to me on the fount and I would drive away persons (from it) just as a person drives away other people&#8217;s camels from his camels. <strong>They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yeah, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution.<\/strong> A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: <strong>Do you know what these people did after you.<\/strong><\/p>\n<p style=\"text-align: justify;\">2- The Messenger of Allah (salalahu alihi wa salam) came to the graveyard and said: Peace be upon you! the abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers. They (the hearers) said: Aren&#8217;t we your brothers-Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. <strong>They said: Messenger of Allah, how would you recognize those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on fore- heads and legs among horses which were all black, tell me, would he not recognize his own horses? They said: Certainly. Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the fount before them.<\/strong> <strong>Some people would be driven away from my fount as the stray camel is driven away.<\/strong> I would call out. Come. come. Then it would be said (to me): <strong>These people changed after you<\/strong>, and I would say: Be off, be off.<\/p>\n<p style=\"text-align: justify;\">3- The Messenger of Allah (salalahu alaihi wa salam) said: My fount is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his fount. <strong>They (the companions) said: Messenger of Allah, would you recognize us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Allegation by Shias:<\/span><\/p>\n<p style=\"text-align: justify;\">Those that are turned away from the Prophet (salalahu alaihi wa salam) are those that have turned their backs from `Ali (ra) by not pledging allegiance to him after the death of the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\">Response:<\/span><\/p>\n<p style=\"text-align: justify;\">The narrations seem to revolve around Muslims that the Prophet (salalahu alaihi wa salam) does not know. If he knew who they were, he wouldn&#8217;t need the indicator of their Islam (i.e. the markings from their ablution). Secondly, it is obvious that this narration is talking about people who left Islam as they would no longer pray and do ablution, so this purity and whiteness that comes from ablution and prayer would disappear from them. There is no mention of `Ali&#8217;s (ra) leadership being the cause as he (salalahu alaihi wa salam) would have said something like: &#8220;I would recognize you by your love for `Ali&#8221; or &#8220;Your faces would shine from your deep love and loyalty to `Ali&#8221; or something of this nature.<\/p>\n<p style=\"text-align: justify;\">I add: This narration shows that the Prophet (saws) does not know what the people of this earth are doing nor does he know their condition, this is why he asks his Lord what they did and the angel replies &#8220;They changed after you&#8221;. It is by consensus of Muslim scholars that any person living in those times who had changed his religion or rejected a fundamental part of Islam like Salat or Zakat has indeed left the folds of Islam.<\/p>\n<p style=\"text-align: justify;\">For more on this, refer to: <a href=\"http:\/\/twelvershia.net\/2014\/02\/14\/response-to-hadeeth-of-lake-fountain\/\" rel=\"external nofollow\">Response to Hadeeth of Lake-Fountain<\/a><\/p>\n<p style=\"text-align: justify;\">Also what confirms that this matter has nothing to do with `Ali&#8217;s Imamah or even the accusation that a certain someone beat-up Fatimah (as), we refer to this clear narration:<\/p>\n<p style=\"text-align: justify;\">Musnad `Umar by abu Yusuf Ya`qoub al-Hafiz (d. 262h), with an authentic chain from the path of Umm Salamah:<\/p>\n<p style=\"text-align: justify;\">\nفَحَدَّثَنَاهُ الأَسْوَدُ بْنُ عَامِرٍ، قَالَ: ثَنَا شَرِيكٌ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: قَالَ رَسُولُ اللَّهِ : &#8221; مِنْ أَصْحَابِي مَنْ لا يَرَانِي وَلا أُرَاهُ بَعْدَ أَنْ أَمُوتَ أَبَدًا &#8221; قَالَ: فَأَتَاهَا عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَقَالَ: نَشَدْتُكَ بِاللَّهِ أَنَا مِنْهُمُ؟ قَالَ: فَقُلْتُ: لا وَلَنْ أُبَرِّئُ أَحَدًا بَعْدَكَ أَبَدًا<\/p>\n<p style=\"text-align: justify;\">\n[We were told by al-Asawad bin `Amir, he said: Shareek told us, from `Asim, from abi Wa&#8217;il, from Masrouq, from Umm Salamah, she said: The messenger (saw) said: &#8220;From my companions are people I will not meet nor shall they meet me after death.&#8221; So `Umar may Allah be pleased with him came to her and said: &#8220;By Allah I ask of you, am I one of them?&#8221; She said: &#8220;No, and I shall not clear anyone after you.&#8221;]<\/p>\n<p style=\"text-align: justify;\">The Hadith is authentic, graded as &#8220;Hasan&#8221; because of Shareek and `Asim, the narration is connected, the only matter one might argue is that Shareek is a Mudallis. However, Shareek&#8217;s Tadlees is light and very rare, this is why Ibn Hajar places him in the second level in the book &#8220;Tabaqat al-Mudalliseen&#8221; whose narrations are accepted even if they did not declare hearing, also Sabt ibn al-`Ajami included him in the third category in his book &#8220;Nihayat al-Soul&#8221; among those whose Hadith is accepted even without a declaration of hearing.<\/p>\n<p style=\"text-align: justify;\">It is also backed by another chain from Musnad Ahmad which qualifies as Sahih Muttasil:<\/p>\n<p style=\"text-align: justify;\">\nحَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ: حَدَّثَنَا الْأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ: دَخَلَ عَلَيْهَا عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ، قَالَ: فَقَالَ: يَا أُمَّهْ، قَدْ خِفْتُ أَنْ يُهْلِكَنِي كَثْرَةُ مَالِي، أَنَا أَكْثَرُ قُرَيْشٍ مَالًا، قَالَتْ: يَا بُنَيَّ، فَأَنْفِقْ، فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ يَقُولُ: &#8221; إِنَّ مِنْ أَصْحَابِي مَنْ لَا يَرَانِي بَعْدَ أَنْ أُفَارِقَهُ &#8220;، فَخَرَجَ، فَلَقِيَ عُمَرَ، فَأَخْبَرَهُ، فَجَاءَ عُمَرُ، فَدَخَلَ عَلَيْهَا، فَقَالَ لَهَا: بِاللَّهِ مِنْهُمْ أَنَا؟ فَقَالَتْ: لَا، وَلَنْ أُبْلِيَ أَحَدًا بَعْدَكَ<\/p>\n<p style=\"text-align: justify;\">[Abu Mu`awiyah told us, al-A`mash told us, from Shaqeeq, from Umm Salamah, that she said: `Abdul-Rahman bin `Awf entered on her saying: &#8220;O mother, I fear that my money will cause me to perish, I have the biggest wealth in Quraysh.&#8221; She said: &#8220;O son, spend from it, for I have heard the messenger (saw) say: Some of my companions shall not meet me nor will I meet them after I depart.&#8221; So he went out and met `Umar, and told him what he heard. `Umar came and entered on her and said: &#8220;By Allah am I one of them?&#8221; She said: &#8220;No, and I won&#8217;t tell anyone else after you.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Which means simply, that what the Prophet (saw) intended by his narration above regarding the lake-fount, has nothing to do with `Ali&#8217;s Imamah, because the Shia claim that `Umar usurped it, nor does it have anything to do with killing Fatimah (as), since the Shia also claim that `Umar beat her. In other words, either changing the divine laws and usurping Imamah and killing the Prophet&#8217;s (saw) daughter are not sufficient sins on `Umar&#8217;s part to lead him to the hell-fire, OR no divine law was broken, nor did `Umar usurp anything or murder anyone, and all of us would agree on this I am sure.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Shia would usually quote a narration from the books of Ahlul-Sunnah and they would claim that the close companions of the Prophet (saws) changed their religion after his death, we tell the Shia that these narrations are not talking <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/10\/28\/why-would-some-of-the-muslims-be-driven-away-at-the-fount\/\" title=\"Why would a part of the nation be driven away by the Prophet (saws) at the fount?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-678","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/678","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=678"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/678\/revisions"}],"predecessor-version":[{"id":1825,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/678\/revisions\/1825"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=678"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=678"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=678"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}