{"id":702,"date":"2013-11-03T16:10:54","date_gmt":"2013-11-03T16:10:54","guid":{"rendered":"http:\/\/twelvershia.net\/?p=702"},"modified":"2015-08-06T21:42:25","modified_gmt":"2015-08-06T21:42:25","slug":"response-to-the-oppression-of-sayeda-faatima-s-a-part-iii","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/03\/response-to-the-oppression-of-sayeda-faatima-s-a-part-iii\/","title":{"rendered":"Response to: The Oppression of Sayeda Faatima (s.a) Part III"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=702\" alt=\"\" \/><strong>The following is a response to the article on RevisitingtheSalaf.org entitled: The Oppression Of Sayeda Faatima (s.a) Part III, which was published on the 14<sup>th<\/sup> of February, 2012, and can be found <a title=\"External link\" href=\"http:\/\/www.revisitingthesalaf.org\/2013\/02\/the-oppression-of-sayeda-faatima-sa.html\" rel=\"nofollow external\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">RTS, in this article, starts off by quoting irrelevant matters, like the supposed assassination attempt on the Prophet (salalahu alaihi wa salam), Ali being the master of the believers, and that some of the companions were rafidha. Each of these has already been dealt with in other articles to be found on the RTS Refutations page.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">In this article though, RTS focuses on a single narration in which we find that Abu Bakr and Omar were present in the army of Usama, which the Prophet (salalahu alaihi wa salam) organized. RTS quotes this narration in order to show that they were in direct violation of the Prophet’s (salalahu alaihi wa salam) commands, and left the army, in order to take control after the death of the Prophet (salalahu alaihi wa salam).<\/p>\n<p style=\"text-align: justify;\">\n<p>RTS quotes Ibn Taymiyyah, who said:<\/p>\n<p><span style=\"color: #ff0000;\"> <strong>The Rafidi (i.e. Allama Al-Hilli) says: ‘The Messenger of Allah (saw) said in his last illness, time after time, repeatedly, the following: &#8220;Equip and send the army of Usama, may Allah (swt) curse those who disobey and do not join the army of Usama.” And the three (Aboo Bakr, Umar and Uthman) were among those people, but Aboo Bakr prevented Umar from that.’  I said ( ibn Taymiyyah:): &#8216;This is a lie! and all scholars say that it is a lie before everyone who knows ‘the Sirah’ (the battles history), and no one of the scholars has said that the Prophet (saw) sent Aboo Bakr and Uthman with the army of Usama. This is only narrated about Umar. How can Aboo Bakr be in the army of Usama, while he (i.e. the Prophet) ordered Aboo Bakr to lead the prayers throughout his illness?! The beginning of his illness was from Thursday to Thursday until Monday, about 12 days. Then it is narrated through frequent narrations that in these days Aboo Bakr led the prayers. And Aboo Bakr did not lead the prayers for Muslims once or twice, not one or two days, so that one may not think what the Rafidhi says deceitfully is true, that A&#8217;isha told her father to lead the prayers because Aboo Bakr led the prayers throughout the Prophets (saw) illness. And people are in agreement that during the illness of the Prophet (saw) no one else except Aboo Bakr led the prayers, and he prayed a number of days. And the least to say is that he (i.e. the Prophet (saw) led 12 prayers and the last prayer was the evening prayer of Friday night and in the Friday he gave a sermon.<\/strong><\/span><\/p>\n<p>Source: Minhaj Al-Sunnah. Vol. 5, Pg. # 485 &#8211; 486.<\/p>\n<p><strong>RTS, later in the article, quotes the narration in order to refute Ibn Taymiyyah:<\/strong><\/p>\n<p><span style=\"color: #ff0000;\">Ibn Asakir:<\/span><\/p>\n<p><span style=\"color: #ff0000;\">Narrated Aboo Bakr Wajih ibn Tahir from Aboo Hamed Al-Az’hari from Aboo Muhammad Al-Mukhlidi from Al-Mo’ammal ibn Al-Hasan from Ahmad ibn Mansoor from Aboo Nadhr Hashim ibn Al-Qasim from A’seem ibn Muhammad from Ubaidallah ibn Umar from Nafi’ from ibn Umar who said: &#8216;The Prophet (saw) appointed Usama ibn Zayd as the commander of an army that Aboo Bakr and Umar were in. Then people criticized him for this action, so the Prophet (saw) gave a sermon and said: &#8220;I was informed that you have criticized that I have appointed Usama over the army, as you criticized his father&#8217;s leadership in the past. His father was worthy of leadership and he is also worthy for it, i.e. Usama, and he is of the dearest people to me, I recommend you to be good to him.”<\/span><br \/>\n<span style=\"color: #ff0000;\">Source: Tarikh Madinatul Damishq. Vol. 8, Pg. # 60.<\/span><\/p>\n<p>&nbsp;<\/p>\n<div>RTS then goes through each of the narrators in the chain, providing evidences that each and every one of them is reliable. RTS is successful in this, however, we hold the opinion that the problem lies elsewhere.<\/p>\n<p style=\"text-align: justify;\">First of all, the narration includes an addition that is not present in other narrations from Ibn Omar, which is the inclusion of Abu Bakr and Omar in the hadith. This addition cannot be found in the narration of Abdullah bin Dinar from Ibn Omar (see Saheeh Al-Bukhari, hadith #6137), nor can it be found in the narration of Salim from Ibn Omar (see Musnad Ahmad #5372 and #5584).<\/p>\n<p style=\"text-align: justify;\">Even if one accepts this addition though, since there is an opinion among late hadith scholars that the additions of reliable narrators are all acceptable, we are still forced to reject this narration due to a hidden defect. In this case, the hidden defect is that the narrator from Ubaidullah Al-Omari is not Asim bin Mohammad, but rather, Asim bin Omar. This opinion is supported by what we find in Musnad Al-Bazzar under hadith #5754, he said, after attributing this narration to Asim bin Omar:<\/p>\n<p style=\"text-align: justify;\">وهذا الحديث لا نعلَمُ رواه عَن عُبَيد الله بن عُمَر إلاَّ عَاصِم بن عُمَر ، وَإنَّما يعرف من حديث موسى بن عقبة ، عَن سالم ، عَن أَبِيه.<\/p>\n<p style=\"text-align: justify;\">Al-Bazzar said, “We are not aware of this narration being narrated from Ubaidullah bin Omar, except from the path of Asim bin Omar, and rather, this narration is known as the narration of Musa bin Uqba from Salim from his father.”<\/p>\n<p style=\"text-align: justify;\">Al-Bazzar here is not only rejecting the attribution of this narration to Asim bin Mohammad, but is also rejecting the path through Ubaidullah from Nafi’ that we find in Tareekh Dimashq. This makes sense when we look up the biography of Asim bin Omar in books of <em>rijal<\/em>, since there is a consensus among the scholars of hadith, like Yahya bin Ma’een, Ahmad bin Hanbal, Al-Bukhari, Abu Hatim Al-Razi, Al-Nasa’ee, Ibn Hibban, Ibn Sa’ad, Al-Daraqutni and others, that the man is simply weak (see Tahtheeb Al-Tahtheeb). So, it is obvious as to why Al-Bazzar rejected this tradition and favoured the path of Salim, since it is authentic by all standards.<\/p>\n<p style=\"text-align: justify;\">Similarly, another scholar, Abu Hatim Al-Razi, arrived at the exact same conclusion. He said in Al-Ilal, hadith #961, “This narration is <em>munkar<\/em>, and it is not narrated by anyone other than Asim bin Omar, and Asim bin Omar is not strong.”<\/p>\n<p style=\"text-align: justify;\">In conclusion, the narration with the addition of Abu Bakr and Omar is weak, and hence, Ibn Taymiyyah is correct in rejecting this tradition for two reasons, the first is the weakness of the narration since it is an addition by a weak narrator, and secondly, because it contradicts several authentic reports that the Prophet (salalahu alaihi wa salam) ordered Abu Bakr to lead the prayers, and Abu Bakr cannot be ordered to be in two places at once.<\/p>\n<p style=\"text-align: justify;\">RTS goes on to quote several sources that have quoted the exact same tradition. However, none of them lead to the strengthening of the narration since it the original source of the narration is the same.<\/p>\n<p style=\"text-align: justify;\">In the end, RTS quotes the same narration that Ibn Taymiyyah quotes, about the damnation of those that leave the army of Usama, but this time attributing it to Al-Shahristani. No chain is included though, and thus, this narration is rejected once again.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on RevisitingtheSalaf.org entitled: The Oppression Of Sayeda Faatima (s.a) Part III, which was published on the 14th of February, 2012, and can be found here. RTS, in this article, starts off by quoting irrelevant <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/03\/response-to-the-oppression-of-sayeda-faatima-s-a-part-iii\/\" title=\"Response to: The Oppression of Sayeda Faatima (s.a) Part III\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[17,18],"class_list":{"0":"post-702","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-abu-bakr","9":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/702","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=702"}],"version-history":[{"count":3,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/702\/revisions"}],"predecessor-version":[{"id":706,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/702\/revisions\/706"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=702"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=702"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=702"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}