{"id":735,"date":"2013-11-13T12:22:29","date_gmt":"2013-11-13T12:22:29","guid":{"rendered":"http:\/\/twelvershia.net\/?p=735"},"modified":"2013-11-13T12:31:41","modified_gmt":"2013-11-13T12:31:41","slug":"response-to-shiapens-article-is-eating-flesh-of-domestic-donkey-allowed-or-prohibited","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/13\/response-to-shiapens-article-is-eating-flesh-of-domestic-donkey-allowed-or-prohibited\/","title":{"rendered":"Response to ShiaPen’s Article: Is Eating Flesh of Domestic Donkey Allowed or Prohibited?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=735\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to ShiaPen’s article: <strong>Is Eating Flesh of Domestic Donkey Allowed or Prohibited? The original article can be found <a href=\"http:\/\/www.shiapen.com\/concise\/is-eating-flesh-of-domestic-donkey-allowed-or-prohibited.html\" rel=\"external nofollow\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">ShiaPen, in this article, quotes a narration in which they attempt to justify the eating of domestic donkeys. They quote the narration in Al-Kafi:<\/p>\n<p dir=\"RTL\" style=\"text-align: justify;\"><span style=\"color: #800000;\">ابن مسلم، وزرارة، عن أبي جعفر عليه السلام أنهما سألاه عنأكل لحوم الحمر الأهلية؟ قال: نهى رسول الله صلى الله عليه وآله عنها وعن أكلها يوم خيبروإنما نهى عن أكلها في ذلك الوقت لأنها كانت حمولة الناس وإنما الحرام ما حرم الله عز وجل في القرآن.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Ibn Muslim and Zurara asked Abu Jaffar about eating domestic donkeys? He replied: Allah’s Apostle banned eating it on day of Khaybar temporary only for that period because the people needed them for the purpose of transportation, verily Haram is what has been made Haram by Allah (swt) in Quran.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen continued by quoting authentic opinions from Sunni scholars regarding the prohibition of eating certain animals that are considered disgusting (i.e. snakes, frogs, turtles, etc.) ShiaPen argues that Sunnis should not attack Shias or mock them for making certain foods permissible when they have done the same.<\/p>\n<p style=\"text-align: justify;\">The twelvershia.net team agrees with ShiaPen in the meaning of the second part of this Hadith, which states that foods that are Haram are only defined by the religion, and not personal tastes. It was in this light that Sunni scholars have referred to certain foods as Halal, which is because they did not find evidence for their prohibition.<\/p>\n<p style=\"text-align: justify;\">However, it is authentic in both sects that Ali (ra) has narrated the prohibition of eating domestic donkeys.<\/p>\n<p style=\"text-align: justify;\">We find in the Saheehain the narration of Ali bin Abi Talib from Ibn Al-Hanafiyah in which he reports from the Prophet (salalahu alaihi wa salam) that domestic donkeys are Haram.<\/p>\n<p style=\"text-align: justify;\">Similarly, we find in Tahtheeb Al-Ahkam, under the chapter of Tafseel Ahkaam Al-Nikah, in the tenth hadith:<\/p>\n<p style=\"text-align: justify;\">محمد بن يحيى عن أبي جعفر عن أبي الجوزاعن الحسين بن علوان عن عمرو بن خالد عن زيد بن علي عن آبائه عن علي عليهم السلام قال : حرم رسول الله صلى الله عليه وآله يوم خيبر لحوم الحمر الأهلية ونكاح المتعة .<\/p>\n<p style=\"text-align: justify;\">“Mohammad bin Yahya from Abi Ja’afar from Abi Al-Jawza’a from Al-Hussain bin Alwan from Amr bin Khalid from Zaid bin Ali from his fathers from Ali (as) that he said: The Messenger (salalahu alaihi wa aalihi wa salam) made the meat of the domestic donkey and Muta’ah marriage Haram on the day of Khaibar.”<\/p>\n<p style=\"text-align: justify;\">The chain is authentic according to Shia standards.<\/p>\n<p style=\"text-align: justify;\">Secondly, this narration, contradicts the narration provided by ShiaPen in Al-Kafi which was provided above. We ask: is the infallible contradicting himself?<\/p>\n<p style=\"text-align: justify;\">As for ShiaPen’s narration that they quoted from al-Kafi and used it as an argument against us, we say that it is also weak according to the standards of ShiaPen, here is its chain from al-Kafi<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ<\/p>\n<p style=\"text-align: justify;\">[`Ali ibn Ibrahim, from his <strong>father<\/strong>, from <strong>Ibn abi Umair<\/strong>, from `Umar bin Udhaynah, from Muhammad bin Muslim and Zurarah, from abi Ja`far (as)&#8230;]<\/p>\n<p style=\"text-align: justify;\">The narration is weak according to them, since Ibn Abi Umair, the narrator of the narration, is weak according to them. Please see the article by ShiaPen entitled: Episode by Al-Majlisi, which can be found <a href=\"http:\/\/www.shiapen.com\/concise\/episode-recorded-by-shaykh-majlisi-regarding-prophets-advice-to-ali-as-fatima-as-just-after-their-marriage.html\" rel=\"external nofollow\">here.<\/a><\/p>\n<p style=\"text-align: justify;\">ShiaPen said and we quote:<\/p>\n<p style=\"text-align: justify;\">[We shall point out that one of the narrators of the chain of the Biharal-Anwar tradition is Ibn Abi Umair whose level authenticity is very low]<\/p>\n<p style=\"text-align: justify;\">We add, that the narration is also weak due to the anonymity of Ibrahim bin Hashim (the father of `Ali bin Ibrahim), who did not receive any praise from early scholars as any educated Shia can check and see for himself, we do not know if this man is reliable in narrating Hadith.<\/p>\n<p style=\"text-align: justify;\">In addition, this narration from al-Kafi 6\/246 #13:<\/p>\n<p style=\"text-align: justify;\">أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ لُحُومِ الْحَمِيرِ فَقَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ أَكْلِهَا يَوْمَ خَيْبَرَ قَالَ وَ سَأَلْتُهُ عَنْ أَكْلِ الْخَيْلِ وَ الْبِغَالِ فَقَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْهَا فَلَا تَأْكُلُوهَا إِلَّا أَنْ تُضْطَرُّوا إِلَيْهَا<\/p>\n<p style=\"text-align: justify;\">[Abu `Ali al-Ash`ari, from Muhammad ibn `Abdul-Jabbar, from Safwan ibn Muskan, he said: I asked abu `Abdillah (as) about the meat of the donkeys, he replied: &#8220;The Prophet (saw) forbade us from eating it in Khaybar&#8221;&#8230;]<\/p>\n<p style=\"text-align: justify;\">al-Majlisi graded this narration as &#8220;SAHIH&#8221; in Mir&#8217;aat al-`Uqoul 22\/34.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to ShiaPen’s article: Is Eating Flesh of Domestic Donkey Allowed or Prohibited? The original article can be found here. ShiaPen, in this article, quotes a narration in which they attempt to justify the eating of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/13\/response-to-shiapens-article-is-eating-flesh-of-domestic-donkey-allowed-or-prohibited\/\" title=\"Response to ShiaPen’s Article: Is Eating Flesh of Domestic Donkey Allowed or Prohibited?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-735","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/735","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=735"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/735\/revisions"}],"predecessor-version":[{"id":742,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/735\/revisions\/742"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=735"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=735"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=735"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}