{"id":754,"date":"2013-11-14T19:07:23","date_gmt":"2013-11-14T19:07:23","guid":{"rendered":"http:\/\/twelvershia.net\/?p=754"},"modified":"2015-11-11T12:23:40","modified_gmt":"2015-11-11T12:23:40","slug":"response-to-maula-ali-as-considered-abu-bakr-and-umar-to-be-the-accursed-ones","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/14\/response-to-maula-ali-as-considered-abu-bakr-and-umar-to-be-the-accursed-ones\/","title":{"rendered":"Response to: Maula Ali (as) Considered Abu Bakr and Umar to be the Accursed Ones"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=754\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to the article on ShiaPen entitled: <strong>Response to: Maula Ali (as) Considered Abu Bakr and Umar to be the Accursed Ones, which can be found <a href=\"http:\/\/www.shiapen.com\/concise\/maula-ali-considered-abu-bakr-and-umar-to-be-the-accursed-ones.html\" rel=\"external nofollow\">here.<\/a><\/strong><\/p>\n<p style=\"text-align: justify;\">ShiaPen stated:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">When it comes to the issue of the relationship between Maula Ali (as) and the Sheikhain those that try their utmost to convince their followers that the three had warm cordial relations with one another, experience a major difficulty they come across this narration from Sahih Muslim Book 019, Number 4349 wherein Caliph Umar acknowledged the following to Imam ‘Ali (as):<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>“When the Messenger of Allah (may peace be upon him) passed away, Abu Bakr said:” I am the successor of the Messenger of Allah (may peace be upon him).” Both of you came to demand your shares from the property (left behind by the Messenger of Allah). (Referring to Hadhrat ‘Abbas), he said: You demanded your share from the property of your nephew, and he (referring to ‘Ali) demanded a share on behalf of his wife from the property of her father. Abu Bakr (Allah be pleased with him) said: The Messenger of Allah (may peace be upon him) had said:” We do not have any heirs; what we leave behind is (to be given in) charity.” So both of<span style=\"text-decoration: underline;\"> you thought him to be a liar, sinful, treacherous and dishonest<\/span>.  And Allah knows that he was true, virtuous, well-guided and a follower of truth. When Abu Bakr passed away and (I have become) the successor of the Messenger of Allah (may peace be upon him) and Abu Bakr (Allah be pleased with him),<span style=\"text-decoration: underline;\"> you thought me to be a liar, sinful, treacherous and dishonest<\/span>”.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">So serious were these words that Bukhari chose to delete reference to it in his Sahih, using his legendary censorship substituting the words <strong>liar, sinful, treacherous and dishonest<\/strong> with “such and such”.  Whilst such an approach was influenced by a desire to hide these words from his readership, if ponder over the words themselves, namely the terms <strong>“liar, sinful, treacherous and dishonest”<\/strong> we will see that Imam Ali (as), the fourth caliph of Ahle Sunnah, consciously used terms that bear significance in terms of how such characteristics are viewed by Allah (swt). <\/span><\/p>\n<p style=\"text-align: justify;\">In response, we say:<\/p>\n<p style=\"text-align: justify;\">Firstly, the narration needs to be quoted in full for it to be understood:<\/p>\n<p style=\"text-align: justify;\">[It is reported by Zuhri that this tradition was narrated to him by Malik b. Aus who said: Umar b. al-Khattab sent for me and I came to him when the day had advanced. I found him in his house sitting on his bare bed-stead, reclining on a leather pillow. He said (to me): Malik, some people of your tribe have hastened to me (with a request for help). I have ordered a little money for them. Take it and distribute it among them. I said: I wish you had ordered somebody else to do this job. He said: Malik, take it (and do what you have been told). At this moment (his man-servant) Yarfa&#8217; came in and said: Commander of the Faithful, what do you say about Uthman, Abd al-Rabman b. &#8216;Auf, Zubair and Sa&#8217;d (who have come to seek an audience with you)? He said: Yes, and permitted them. so they entered. Then he (Yarfa&#8217;) came again and said: What do you say about &#8216;ali and abbas (who are present at the door)? He said: Yes, and permitted them to enter. <strong>`Abbas said: Commander of the Faithful, decide (the dispute) between me and this sinful, treacherous, dishonest liar (meaning `Ali).<\/strong> The people (who were present) also said: Yes. Commander of the Faithful, do decide (the dispute) and have mercy on them. Malik b. Aus said: I could well imagine that they had sent them in advance for this purpose (by &#8216;ali and abbas). &#8216;Umar said: Wait and be patient. I adjure you by Allah by Whose order the heavens and the earth are sustained, don&#8217;t you know that the messenger of Allah (may peace be upon him) said:&#8221; We (prophets) do not have any heirs; what we leave behind is (to be given in) charity&#8221;? They said: Yes. Then he turned to abbas and &#8216;ali and said: I adjure you both by Allah by Whose order the heavens and earth are sustained, don&#8217;t you know that the messenger of Allah (may peace be upon him) said:&#8221; We do not have any heirs; what we leave behind is (to be given in) charity&#8221;? They (too) said: Yes. (Then) Umar said: Allah, the Glorious and Exalted, had done to His messenger (may peace be upon him) a special favour that He has not done to anyone else except him. He quoted the Qur&#8217;anic verse:&#8221; What Allah has bestowed upon His Apostle from (the properties) of the people of township is for Allah and His messenger&#8221;. The narrator said: I do not know whether he also recited the previous verse or not. Umar continued: The messenger of Allah (may peace be upon him) distrbuted among you the properties abandoned by Banu Nadir. By Allah, he never preferred himself over you and never appropriated anything to your exclusion. (After a fair distribution in this way) this property was left over. The messenger of Allah (may peace be upon him) would meet from its income his annual expenditure, and what remained would be deposited in the Bait-ul-Mal. (Continuing further) he said: I adjure you by Allah by Whose order the heavens and the earth are sustained. Do you know this? They said: Yes. Then he adjured abbas and &#8216;Ali as he had adjured the other persons and asked: Do you both know this? They said: Yes. He said: When the messenger of Allah (may peace be upon him) passed away, <a href=\"http:\/\/twelvershia.net\/2015\/01\/27\/book-virtues-hazrat-abu-bakr\/\" rel=\"external nofollow\">Abu Bakr<\/a> said:&#8221; I am the successor of the messenger of Allah (may peace be upon him).&#8221; Both of you came to demand your shares from the property (left behind by the messenger of Allah). (Referring to Hadrat &#8216;abbas), he said: You demanded your share from the property of your nephew, and he (referring to &#8216;ali) demanded a share on behalf of his wife from the property of her father. Abu Bakr (Allah be pleased with him) said: The messenger of Allah (may peace be upon him) had said:&#8221; We do not have any heirs; what we leave behind is (to be given in) charity.&#8221; So both of you <strong>thought him to be a liar, sinful, treacherous and dishonest.<\/strong> And Allah knows that he was true, virtuous, well-guided and a follower of truth. When Abu Bakr passed away and (I have become) the successor of the messenger of Allah (may peace be upon him) and Abu Bakr (Allah be pleased with him), you <strong>thought me to be a liar, sinful, treacherous and dishonest.<\/strong> And Allah knows that I am true, virtuous, well-guided and a follower of truth. I became the guardian of this property. Then you as well as he came to me. Both of you have come and your purpose is identical. You said: Entrust the property to us. I said: If you wish that I should entrust it to you, it will be on the condition that both of you will undertake to abide by a pledge made with Allah that you will use it in the same way as the messenger of Allah (may peace be upon him) used it. So both of you got it. He said: Wasn&#8217;t it like this? They said: Yes. He said: Then you have (again) come to me with the request that I should adjudge between you. No, by Allah. I will not give any other judgment except this until the arrival of the Doomsday. If you are unable to hold the property on this condition, return it to me.]<\/p>\n<p style=\"text-align: justify;\">As we can see, the terms used by Omar, in his description of Abu Bakr, as he has attributed to Ali and Al-Abbas, are the same terms that are used by Al-Abbas in the beginning of the narration. Al-Abbas, starts off by using those words to describe Ali, since they are in a disagreement in how the Sadaqat are to be distributed. In response, Omar is implying that if Al-Abbas’s descriptions of Ali are correct, then Abu Bakr and himself are to be described as such, since they both oppose the views of Al-Abbas and Ali. Abu Bakr opposed them when they asked for inheritance and `Umar now opposes them concerning dividing the land.<\/p>\n<p style=\"text-align: justify;\">Secondly, it is unthinkable that either Al-Abbas or Ali thought of neither Abu Bakr nor Omar in this light. This is because both caliphs were approached by both men, who were seeking justice. It is not logical for someone to seek justice from someone that they saw as a liar, sinful, treacherous, and dishonest.<\/p>\n<p style=\"text-align: justify;\">I add another explanation just to enrich the mind: It is as if a kid was advised by his parents to study well before an exam, but the kid refused and told his father “Don’t worry I’ll be okay, don’t waste your time.” The next day the kid returns from school with a very bad grade, so the father reproaches him and says: “I told you to study but you thought your dad was dumb and stupid and never listened, look at you now!” This does not mean that the kid told his dad such bad words, but because the father was angry and he tried to prove a point.<\/p>\n<p style=\"text-align: justify;\">What further proves our point is that `Ali&#8217;s words to Abu Bakr are documented after the incident of <a href=\"http:\/\/twelvershia.net\/2014\/05\/08\/fadak-prophetic-inheritance-qa\/\" rel=\"external nofollow\">Fadak<\/a> in Sahih al-Bukhari:<\/p>\n<p style=\"text-align: justify;\">إِنَّا قَدْ عَرَفْنَا فَضْلَكَ، وَمَا أَعْطَاكَ، اللَّهُ وَلَمْ نَنْفَسْ عَلَيْكَ خَيْرًا سَاقَهُ اللَّهُ إِلَيْكَ، وَلَكِنَّكَ اسْتَبْدَدْتَ عَلَيْنَا بِالأَمْرِ<\/p>\n<p style=\"text-align: justify;\">[O Abu Bakr, we know well your superiority and what Allah has given you, and we are not jealous of the goodness that Allah has bestowed upon you, but you did not consult us.]<\/p>\n<p style=\"text-align: justify;\">Finally, there are is no reason to accuse Al-Bukhari of tampering with the text. The wordings in both narrations are different and there are no evidences of fabrication, but mere speculation. It is possible that the differences in the narration are due to the different narrators. The narration also exists in Sunan Abi Dawud and Musnad Abi Ya’ala, without the inclusion of the harsh words, which means that this version of the narration existed before Al-Bukhari. More importantly, the second version of the narration, which can be found in Al-Bukhari didn’t include the harsher words of Al-Abbas towards Ali either, which shows that the version wasn’t influenced by hatred towards Ali, which is what ShiaPen is trying to imply.<\/p>\n<p style=\"text-align: justify;\">I would like to note that `Umar ibn al-Khattab whom the Shia are attacking, did give `Ali and al-`Abbas the land as mentioned in our old article and he even added more lands to it:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2013\/06\/02\/umar-ra-returned-to-ali-ra-the-lands-and-gave-him-new-ones\/\" rel=\"external nofollow\"><strong>`Umar (ra) gave the property to `Ali (ra) along with new lands<\/strong><\/a><\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on ShiaPen entitled: Response to: Maula Ali (as) Considered Abu Bakr and Umar to be the Accursed Ones, which can be found here. ShiaPen stated: When it comes to the issue of <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/14\/response-to-maula-ali-as-considered-abu-bakr-and-umar-to-be-the-accursed-ones\/\" title=\"Response to: Maula Ali (as) Considered Abu Bakr and Umar to be the Accursed Ones\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[17,18],"class_list":{"0":"post-754","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"tag-abu-bakr","9":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/754","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=754"}],"version-history":[{"count":10,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/754\/revisions"}],"predecessor-version":[{"id":2754,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/754\/revisions\/2754"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=754"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=754"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=754"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}