{"id":775,"date":"2013-11-23T23:02:37","date_gmt":"2013-11-23T23:02:37","guid":{"rendered":"http:\/\/twelvershia.net\/?p=775"},"modified":"2018-10-30T14:33:09","modified_gmt":"2018-10-30T14:33:09","slug":"issues-of-ghaybah-part-1","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/23\/issues-of-ghaybah-part-1\/","title":{"rendered":"Issues of Ghaybah [Part-1] &#8211; The hidden Imam and the need of an apparent Imam"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=775\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<br \/>\nRead this article in <a href=\"http:\/\/www.shia-islam.se\/problem-med-ghaybah-del-1\/\" rel=\"external nofollow\">Swedish<\/a><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and our prophet,<\/p>\n<p style=\"text-align: justify;\">I have recently began reading about the topic of &#8220;Occultation&#8221; or Ghaybah, I assume all our readers know that the Twelver Shia sect believe in a hidden 12th Imam, this man was born in the year 255 hijri or so they say, they also believe his birth was secret and that no one witnessed it from the commoners, they also believe he is their leader today and that he was in hiding for the past 1200 years out of fear from the tyrant rulers. I don&#8217;t want to go on about this because as I said I assume the reader has some knowledge of  it, I began with the book of al-Shareef al-Murtada, he wrote a book called &#8220;al-Muqni` fil-Ghaybah&#8221; in which he tries to explain to his followers and opponents that this Shia belief is valid and that we all must believe in this mysterious hidden character.<\/p>\n<p style=\"text-align: justify;\">I thought, why not write some of my comments and opinions on his writings and the writings of his companions, such as al-Tusi and al-Nu`mani who wrote similar books. With that I decided to open this topic, hoping that I could InshaAllah follow it with others like it.<\/p>\n<p style=\"text-align: justify;\">To get to the meat of today&#8217;s issue, I begin by saying: All of us know that the belief of the early Imami Shia was that Allah (swt) has to appoint an infallible leader to lead this nation, they say it is incumbent upon Allah to provide such a guide. Yet, we see their condition today and it is sad and depressing, they have no Imam to guide them, the man they believe to be their divinely appointed leader is nowhere to be found! What a calamity!<\/p>\n<p style=\"text-align: justify;\">al-Murtada being from the Imami Shia, has to defend this concept, he has to explain to us that the disappearance of the leader does not contradict the early Shia beliefs. While trying to defend his fearful savior and refute the opponents, a sentence caught my attention, he asked the following question in his book:<\/p>\n<p style=\"text-align: justify;\">&#8220;Would you accept that the disappearance (Of the Imam) is permitted (In Islam and intellect) ?&#8221;<\/p>\n<p style=\"text-align: justify;\">I knew he would answer positively, not because the words that followed this were:<\/p>\n<p style=\"text-align: justify;\">أنا لذلك مجوز<\/p>\n<p style=\"text-align: justify;\">&#8220;I permit it.&#8221;<\/p>\n<p style=\"text-align: justify;\">But because this is the belief of the Shia and no way would he say anything that contradicts his sect. Of course he tries to give the excuses as to why this disappearance is not  big deal, but regardless of those philosophical arguments I still wasn&#8217;t convinced, WHY YOU ASK?<\/p>\n<p style=\"text-align: justify;\">Because I know without the shadow of a doubt that the early Shia based their entire religion on ALWAYS and I mean ALWAYS having an infallible Imam to lead the nation and to guide the believers, and since I know based on my research that this deviant sect fabricates narrations, I was sure that they had narrations that would conflict with the concept of having a hidden &#8220;un-available&#8221; Imam.<\/p>\n<p style=\"text-align: justify;\">Imamah for the early Imami Shia was too important, they are the ones who said that it is a grace from Allah, a Lutf, and they are the ones who would say that it is a part of God&#8217;s justice.  They even said that without an Imam, the world would collapse on itself, and the earth would shake and so on and so forth&#8230;<\/p>\n<p style=\"text-align: justify;\">My best bet was al-Kafi and I was not disappointed, I found narrations talking about the need of Imams and they are all pretty similar. I begin by posting two AUTHENTIC narrations from al-Kafi by al-Kulayni:<\/p>\n<p style=\"text-align: justify;\">عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ وَ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الْأَرْضَ لَا تَخْلُو إِلَّا وَ فِيهَا إِمَامٌ كَيْمَا إِنْ زَادَ الْمُؤْمِنُونَ شَيْئاً رَدَّهُمْ وَ إِنْ نَقَصُوا شَيْئاً أَتَمَّهُ لَهُمْ<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230;from Ishaq bin `Ammar from abi `Abdillah (as): I heard him say: &#8220;The earth will not be without an Imam, so that he may correct the believers if they add (to the religion) and if they miss something he would complete it for them.]<\/strong><\/p>\n<p style=\"text-align: justify;\">مُحَمَّدُ بْنُ يَحْيَى الْعَطَّارُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنِ الْعَبْدِ الصَّالِحِ ( عليه السلام ) قَالَ إِنَّ الْحُجَّةَ لَا تَقُومُ لِلَّهِ عَلَى خَلْقِهِ إِلَّا بِإِمَامٍ حَتَّى يُعْرَفَ<\/p>\n<p style=\"text-align: justify;\"><strong>[&#8230; from Dawud al-Raqqi from al-`Abd al-Salih (as): He said: &#8220;The Hujjah(proof) of Allah upon his creation shall not be established except with an Imam so that he may be known.]<\/strong><\/p>\n<p style=\"text-align: justify;\">Based on the two texts it is clear that having a hidden Imam is not an option, how would he be able to explain the divine arguments of God so that the proof of Allah and his Hujjah be established on all creation? How can we be religiously accountable without this? Also the narrations state that the need of an Imam is for a main purpose, it is so that he can guide the believers to their religion and correct any mistakes they have committed in following the godly path, yet this is not being done by the hidden &#8220;Imam&#8221; nor is a hidden leader able to achieve it. This means the 12th leader loses the initial reason for his existence.<\/p>\n<p style=\"text-align: justify;\">I follow these two narrations with two other AUTHENTIC ones from the book Basa&#8217;ir al-Darajat by their scholar al-Saffar:<\/p>\n<p style=\"text-align: justify;\">حدثنا محمد بن عيسى وأحمد بن محمد عن الحسن بن محبوب عن يعقوب السراج قال<br \/>\nقلت لأبي عبد الله عليه السلام تخلوا الأرض من عالم منكم حي ظاهر تفزع إليه الناس في حلالهم وحرامهم فقال يا أبا يوسف لا ان ذلك لبين في كتاب الله تعالى فقال يا أيها الذين آمنوا اصبروا وصابروا عدوكم ممن يخالفكم &#8211; ورابطوا –امامكم- واتقوا الله &#8211; فيما يأمركم وفرض عليكم &#8211;<\/p>\n<p style=\"text-align: justify;\"><strong>[Muhammad bin `Isa and Ahmad bin Muhammad both told us, from al-Hasan bin Mahboub, from Ya`qoub al-Sarraj that he said: I said to abu `Abdillah (as): &#8220;Would the earth be devoid from an apparent man of knowledge from among you, so that the people may seek him in their issues of Halal and Haram?&#8221; He (as) replied: &#8220;O abu Yusuf, NO. This is clear in the book of Allah: {O you who have believed, persevere and endure} against your enemies who oppose you {and remain stationed} with your Imam {and fear Allah} with what he orders you to do.&#8221;]<\/strong><\/p>\n<p style=\"text-align: justify;\">حدثنا محمد بن عيسى عن الحسن بن محبوب والحجال عن العلا عن محمد بن مسلم عن أبي جعفر عليه السلام قال لا تبقى الأرض بغير امام ظاهر<\/p>\n<p style=\"text-align: justify;\"><strong>[Muhammad bin `Isa told us, from al-Hasan bin Mahboub and al-Hajjal, from al-`Ala, from Muhammad bin Muslim, from abu Ja`far (as) that he said: &#8220;The earth shall not remain without an apparent Imam.&#8221;]<\/strong><\/p>\n<p style=\"text-align: justify;\">Notice the questioner using the word &#8220;Apparent&#8221; not a hidden one, or one who is in occultation! This is because if he was hidden, then how can the believers seek his counsel and ask him in matters of Halal and Haram? How can we remain stationed with our Imam and stand by him if he is not present? The intellect rejects the occultation as well as the texts!<\/p>\n<p style=\"text-align: justify;\">wal-Salamu `Aleykum wa Rahmatullah,<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series Read this article in Swedish &nbsp; Peace be upon our nation and our prophet, I have recently began reading about the topic of &#8220;Occultation&#8221; or Ghaybah, I assume all <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/23\/issues-of-ghaybah-part-1\/\" title=\"Issues of Ghaybah [Part-1] &#8211; The hidden Imam and the need of an apparent Imam\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-775","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/775","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=775"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/775\/revisions"}],"predecessor-version":[{"id":4421,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/775\/revisions\/4421"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=775"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=775"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=775"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}