{"id":779,"date":"2013-11-24T19:03:11","date_gmt":"2013-11-24T19:03:11","guid":{"rendered":"http:\/\/twelvershia.net\/?p=779"},"modified":"2018-10-30T14:33:53","modified_gmt":"2018-10-30T14:33:53","slug":"issues-of-ghaybah-part-2","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/24\/issues-of-ghaybah-part-2\/","title":{"rendered":"Issues of Ghaybah [Part-2] &#8211; Imamah and the Iranian regime"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=779\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and prophet.<\/p>\n<p style=\"text-align: justify;\">This is the second article in this series and in it we&#8217;ll be talking about the Iranian regime. We all know that this regime is the head of Tashayyu` in our days, they are the representatives of the Shia in our days, they control the majority of Shia scholars all over the world and fund most of the Shia organisations, but how faithful are they to the religion of Imami Shiasm? How much do they stick to its teachings and laws and philosophy?<\/p>\n<p style=\"text-align: justify;\">To find this out, we open our copies of the Iranian constitution which I&#8217;m sure we all have at home&#8230; or we just google them in case we don&#8217;t happen to have a version of the Iranian constitution.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s randomly browse through this elaborate thing they call constitution and see what&#8217;s inside:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #003300;\"><strong>Article 5:<\/strong><\/span><br \/>\n<strong>[<\/strong>During the Occultation of the Wali al-Asr (may God hasten his reappearance), the wilayah and leadership of the Ummah devolve upon the just [&#8216;adil] and pious [muttaqi] faqih [jurist], who is fully aware of the circumstances of his age; courageous, resourceful, and possessed of administrative ability, will assume the responsibilities of this office in accordance <span style=\"color: #008000;\">with Article 107.<strong><span style=\"color: #000000;\">]<\/span><\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Ah, This reminds me of what Ahlul-Sunnah did 1400 years ago when they gave Bay`ah to Abu Bakr (ra) who they believe is the most knowledgeable and senior and resourceful and God fearing, right after the Prophet (saw) passed away. So while the 12th leader of this sect is un-available, the position of leadership &#8220;Wilayah&#8221; goes to a jurist, a scholar, who is known for being pious, knowledgeable, courageous, and possesses administrative abilities. This happens according to article 107, so let&#8217;s check this one out.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #003300;\"><strong>Article 107:<\/strong><\/span><br \/>\n<strong>[<\/strong>After the demise of the eminent marji&#8217; al-taqlid and great leader of the universal Islamic revolution, and founder of the Islamic Republic of Iran, Ayatullah al-&#8216;Uzma Imam Khumayni &#8211; quddisa sirruh al-sharif &#8211; <span style=\"color: #008000;\">who was recognized and accepted<\/span> as marji&#8217; and Leader <span style=\"color: #008000;\">by a decisive majority of the people<\/span>, the task of appointing the Leader shall be vested with the experts elected by the people. <span style=\"color: #008000;\">The experts will review and consult among themselves <\/span>concerning all the fuqaha&#8217; possessing the qualifications specified in Articles 5 and 109. In the event they find one of them better versed in Islamic regulations, the subjects of the fiqh, or in political and social Issues, or possessing general popularity or special prominence for any of the qualifications mentioned in Article 109, they shall elect him as the Leader. Otherwise, in the absence of such a superiority, they shall elect and declare one of them as the Leader. The Leader thus elected by the Assembly of Experts <span style=\"color: #008000;\">shall assume all the powers of the wilayat al-amr <\/span>and all the responsibilities arising therefrom. The Leader is equal with the rest of the people of the country in the eyes of law.<strong>]<\/strong><\/p>\n<p style=\"text-align: justify;\">Oh, so the people agree upon an elite group of experts, these experts then consult among themselves and elect the next Caliph..err I mean the next Wali al-Faqih of the Shia. It also kinda reminds me of Abu Bakr (ra) who was accepted by a decisive majority of people after being accepted by a group of elites from the Mouhajirun and the Ansar. `Umar bin al-Khattab (ra) also selected a group of six elite companions to elect a leader from among themselves.<\/p>\n<p style=\"text-align: justify;\">On a side note, it&#8217;s interesting that Khamina&#8217;i assumes all powers of Wilayat al-Amr, because I remember when asking the Shia: &#8220;How come you guys elected Khamina&#8217;i as your leader?&#8221; they reply: &#8220;No, no, he&#8217;s not our leader, he&#8217;s just temporarily in place of the Mahdi.&#8221; YET this constitution announces that the man has absolute authority.<\/p>\n<p style=\"text-align: justify;\">Something to notice, that they tend to not translate the word &#8220;leader&#8221; to its Arabic meaning, for example they wrote above: &#8220;who was recognized and accepted as marji` and leader by a decisive majority&#8221;, well they wrote the word &#8220;marji`&#8221; in Arabic, why not write the word &#8220;leader&#8221; in Arabic then? Or maybe they don&#8217;t wish to emphasize much about the fact that leader means &#8220;IMAM&#8221; in Arabic, now why could that be???<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #003300;\"><strong>Article 6:<\/strong><\/span><br \/>\n<strong>[<\/strong>In the Islamic Republic of Iran,<span style=\"color: #008000;\"> the affairs of the country must be administered on the basis of public opinion<\/span> expressed by the means of elections, including the election of the President, the representatives of the Islamic Consultative Assembly, and the members of councils, <span style=\"color: #008000;\">or by means of referenda<\/span> in matters specified in other articles of this Constitution.<strong>]<\/strong><\/p>\n<p style=\"text-align: justify;\">Well that&#8217;s strange, I always thought that we had no choice in the matter of politics, I always thought that the infallible Imam has to lead us and make all the decisions, not public opinion.<\/p>\n<p style=\"text-align: justify;\">Okay, so what is your PROOF that human beings can come together and select their own leaders? Because the impression I got when talking to Shia is that the matter of leadership is left to Allah, we can&#8217;t pick a leader.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #003300;\"><strong>Article 7:<\/strong><\/span><br \/>\n<span style=\"color: #008000;\"><strong><span style=\"color: #000000;\">[<\/span><\/strong>In accordance with the command of the Qur&#8217;an contained in the verse (&#8220;Their affairs are by consultations among them&#8221; [42:38]) and (&#8220;Consult them in affairs&#8221; [3:159])<\/span>,  consultative bodies &#8211; such as the Islamic Consultative Assembly, the Provincial Councils, and the City, Region, District, and Village Councils and the likes of them &#8211; are the decision-making and administrative organs of the country. The nature of each of these councils, together with the manner of their formation, their jurisdiction, and scope of their duties and functions, is determined by the Constitution and laws derived from it.<strong>]<\/strong><\/p>\n<p style=\"text-align: justify;\">SubhanAllah! What a wonderful surprise this has turned out to be! Apparently the Shia use the exact same Qur&#8217;anic proof as Ahlul-Sunnah to prove that leaders must be chosen by consultation, except we reached this conclusion 1400 years ago, whereas it took the Imami Shia more than 1200 years to figure it out.<\/p>\n<p style=\"text-align: justify;\">Well I don&#8217;t know about the readers, but I feel this Iranian constitution is a copy\/paste job from Sunni books of leadership and Imamah. Let&#8217;s compare it to what the Shia try to preach to their new converts on their famous website &#8220;al-islam&#8221;. We&#8217;ll be comparing it to the book they uploaded called &#8220;Imamate: The Vicegerency of the Prophet (s) by Sayyid Sa&#8217;eed Akhtar Rizvi&#8221;, let&#8217;s read what they wrote in their books:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">[When Allah orders that man to do something yet is aware that man cannot do it or that it is very difficult without His assistance, then if Allah does not provide this assistance, He would be contradicting His own aim. Obviously, such negligence is evil according to reason. Therefore lutf is incumbent on Allah.]<\/span><\/p>\n<p style=\"text-align: justify;\">Excuse me, hasn&#8217;t God according to the Shia books ordered us to follow the Imams of Ahlul-Bayt? Well they&#8217;re nowhere to be found, so according to this introduction god has contradicted his own aim Astaghfirullah. I ask every Shia today, is acquiring guidance easy? The obvious answer is NO. I follow this with another question, does God need to appoint an assistant, an Imam maybe, to help us acquire this guidance? The Shia answer is YES. Where is this guide today? He is hiding and un-available, meaning God has not provided us the assistance necessary to fulfill what he ordered us, this is considered evil negligence based on the above SO PONDER!<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">[The Shi&#8217;ahs believe that, like the Prophet, an Imam should excel the ummah in all virtues, such as knowledge, bravery, piety and charity, and should possess complete knowledge of the Divine Law. If he does not, and this high post is entrusted to a less perfect person when a more perfect one is available, the inferior will have been given preference over the superior, which is wrong in reason and against Divine Justice. Therefore, no inferior person may receive Imamate from Allah when there exists a person superior to him.]<\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, I ask WHY should the Imam excel the whole Ummah in everything? What if we choose an Imam yet there is another man living somewhere else, and let&#8217;s say he&#8217;s pious and god fearing so he doesn&#8217;t want to boast about his knowledge and bravery? He is superior to the man we picked, but we didn&#8217;t know this as we don&#8217;t have a record of the knowledge and piety and bravery of every man in this nation, especially in the past years when the Islamic caliphate was huge, from India to Spain to Syria to Somalia ect&#8230; I don&#8217;t think back then they had account of every single person&#8217;s qualities. I say for us Ahlul-Sunnah it is enough that we pick the man with the desirable qualifications from piety and knowledge and bravery and political skills ect&#8230; no need to place such an extreme effort circling all the lands and testing all the slaves, no two people are alike, one man can excel another in one matter, Abu Bakr (ra) could be more knowledgeable than `Umar (ra) but `Umar (ra) is stronger and healthier than Abu Bakr (ra). In some situations the two men could be very similar in that one cannot distinguish which of the two is exactly best. To prove our point, the Shia themselves couldn&#8217;t apply their rules, they picked Khamina&#8217;i as their leader yet they all agree Sistani is much more qualified and much more deeply rooted in religion. Either way, let&#8217;s not waste more time with this unrealistic condition that the Shia placed for picking a leader.<\/p>\n<p style=\"text-align: justify;\">Moreover, does the Mahdi exist today or not? If your answer is YES then why does the &#8220;inferior person&#8221; Khamina&#8217;i rule the lands when the superior person exists?<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">[Fourthly, the Imam is the defender of the Divine Law and this work cannot be entrusted to fallible hands nor can any such person maintain it properly. For this very reason, infallibility has been admitted to be an indispensable condition to prophethood; and the considerations which make it essential in the case of a prophet make it so in the case of an Imam and caliph as well.]<\/span><\/p>\n<p style=\"text-align: justify;\">They say the Imam protects the religion and this cannot be entrusted to fallible hands, I say: NO, a pious god fearing fallible leader will defend the religion and spread the books and protect the scholars and the followers throughout the lands, no need for infallibility here my friend. As for prophet-hood, infallibility is necessary mainly when the Prophet (as) is delivering the message of his Lord, so that he may not err in delivering it, nothing else. Allah will protect his religion and his slaves as long as they obey and worship sincerely.<\/p>\n<p style=\"text-align: justify;\">Do the Shia think Khamina&#8217;i today is not protecting them and preserving their religion? Or is he doing such a horrible job since he&#8217;s fallible?<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">[It is for this reason that the Shi&#8217;ah Ithna &#8216;Asharis (The Twelvers) believe that only Allah can appoint a successor to the Prophet; that the ummah has no choice in this matter-its only duty is to follow such a divinely-appointed Imam or caliph.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The Sunnis, on the other hand, believe that it is the duty of the ummah to appoint a caliph.]<\/span><\/p>\n<p style=\"text-align: justify;\">Good, so the fact that Allah is not appointing anyone for you, you yourselves realized this and went and elected your own leader, who now runs your country and armies and economy. This cancels out the &#8220;theory&#8221; which says that only Allah must appoint leaders, so either you say Leaders are necessary but it&#8217;s NOT incumbent on Allah to appoint a leader, this is why you had to choose Khamina&#8217;i OR that leaders are NOT always necessary and it is incumbent on Allah to appoint them, in this case remove Khamina&#8217;i from power because he was not chosen by Allah or the Mahdi and just wait for the appointed man to return.<\/p>\n<p style=\"text-align: justify;\">However, to keep saying that having leaders is necessary and that only God can appoint the leaders, then this is just stubbornness because you can see clearly that your leader is un-available  and God is not appointing anyone in his place.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">[The following verses of the Qur&#8217;an confirm the views held by the Shi&#8217;ahs:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">And thy Lord creates what He wills and chooses; they have no right to choose; glory be to Allah, and exalted be He above what they associate! (28:68).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">This clearly shows that man has no right to make any selection; it lies entirely in the hands of Allah.]<\/span><\/p>\n<p style=\"text-align: justify;\">How the Shia author reached such a conclusion from such a general verse is beyond me. This verse is technically saying that Allah (swt) controls every single detail of creation, he chooses the time of day and night, he chooses the weather and the color of the sky, he shapes you and forms you in the womb of your mother and you have no choice in the matter. This is why the verses after it are saying:<\/p>\n<p style=\"text-align: justify;\">{Say, &#8220;Have you considered: if Allah should make for you the night continuous until the Day of Resurrection, what deity other than Allah could bring you light? Then will you not hear?&#8221;} [28:71]<\/p>\n<p style=\"text-align: justify;\">{Say, &#8220;Have you considered: if Allah should make for you the day continuous until the Day of Resurrection, what deity other than Allah could bring you a night in which you may rest? Then will you not see?&#8221;} [28:72]<\/p>\n<p style=\"text-align: justify;\">It talks about Allah&#8217;s control of the universe and of the events that happen therein, but the author takes this verse and says: &#8220;This means we can&#8217;t pick our leaders, we need a text from the sky with the name of the appointed leader.&#8221;<\/p>\n<p style=\"text-align: justify;\">If this is the case, I can apply this verse to anything I want since it&#8217;s general, I can say: &#8220;Well I can&#8217;t pick the color of the wallpaper in my living room because only Allah chooses things, so I await a divine text to fall from the sky with the color of my walls written on it.&#8221;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">[If the ma&#8217;sum (infallible) angels were given no say in the appointment of a caliph, how can fallible humans expect to take the whole authority of such an appointment in their own hands?]<\/span><\/p>\n<p style=\"text-align: justify;\">We consult in the affair and use our God given intellect pick the best man for the best position as Allah says in his book and as is written in your constitution:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #008000;\"><strong>{Their affairs are by consultations among them}<\/strong> [42:38]<\/span><\/p>\n<p style=\"text-align: justify;\">wal-Salamu `Aleykum,<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series Peace be upon our nation and prophet. This is the second article in this series and in it we&#8217;ll be talking about the Iranian regime. We all know that <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/24\/issues-of-ghaybah-part-2\/\" title=\"Issues of Ghaybah [Part-2] &#8211; Imamah and the Iranian regime\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-779","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/779","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=779"}],"version-history":[{"count":9,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/779\/revisions"}],"predecessor-version":[{"id":4423,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/779\/revisions\/4423"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=779"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=779"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=779"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}