{"id":785,"date":"2013-11-24T23:12:08","date_gmt":"2013-11-24T23:12:08","guid":{"rendered":"http:\/\/twelvershia.net\/?p=785"},"modified":"2018-10-30T14:31:07","modified_gmt":"2018-10-30T14:31:07","slug":"issues-of-ghaybah-part-3","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/24\/issues-of-ghaybah-part-3\/","title":{"rendered":"Issues of Ghaybah [Part-3] &#8211; Believers avoid sins fearing the Imam’s punishment."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=785\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and prophet.<\/p>\n<p style=\"text-align: justify;\">This here is the third topic in this blessed series, and in this one our concentration is on the benefits that we as religiously accountable Muslims can derive from the hidden 12th leader of our nation.<\/p>\n<p style=\"text-align: justify;\">We&#8217;ve discussed this issue before and we may even discuss it again in the future, for benefit we ask our readers to check our article: &#8220;The Shia Mahdi &#8230; Useless?&#8221;<\/p>\n<p style=\"text-align: justify;\">As you read in that old article, one of the major Shia scholars of our time finally admits that the hidden Imam is useless, he even describes those who say otherwise as &#8220;Deprived of intellect.&#8221; It is obvious for all observers with healthy minds that the man is indeed of no benefit whatsoever to our nation, whether in politics or religion or economy&#8230; nothing.<\/p>\n<p style=\"text-align: justify;\">In the past, let&#8217;s say the 4th or 5th centuries, back when Shia still had hope of this guy emerging and leading them, back then when they were more stubborn, if you were to ask them about the benefit of the hidden Mahdi, they would bring up their popular philosophical arguments and confuse themselves and their opponents, they would not be successful to say the least in their attempt to prove that there is a benefit. The leader of their sect al-Murtada wanted to go one step beyond, he wouldn&#8217;t settle for the argument of: &#8220;The Mahdi is like the sun hidden behind the clouds.&#8221;<\/p>\n<p style=\"text-align: justify;\">This is what they narrated from their Mahdi in Bihar al-Anwar 53\/181:<\/p>\n<p style=\"text-align: justify;\">&#8220;And as for the way of benefiting from me during my occultation, it is the same as benefiting from the sun when it is beclouded; and I am a safeguard to the inhabitants of earth as the stars are safeguards to the inhabitants of heaven.&#8221;<\/p>\n<p style=\"text-align: justify;\">Which makes no sense, so al-Murtada would have none of it! He wanted to argue back and prove to us that the 12th Imam is indeed beneficial, so let me translate what it&#8217;s all about.<\/p>\n<p style=\"text-align: justify;\">al-Shareef al-Murtada in his book &#8220;al-Muqni` fil-Ghaybah&#8221; was asked: &#8220;What good is having a hidden leader? What benefit do we derive from his Occultation?&#8221;<\/p>\n<p style=\"text-align: justify;\">The reply was astounding, this man has surely invented something new! He says that his presence even when hidden scares his followers the Shia -which he describes as his &#8220;Awliya&#8221; since they are the most pious of Shia &#8211; it scares them from committing sins and disobedience, because they fear the punishment of the hidden Imam!!<\/p>\n<p style=\"text-align: justify;\">Check it out for yourselves:<\/p>\n<p style=\"text-align: justify;\">وجملته: أن أولياء إمام الزمان عليه السلام وشيعته ومعتقدي إمامته ينتفعون به في حال غيبته النفع الذي نقول إنه لا بد &#8211; في التكليف &#8211; منه، لأنهم مع علمهم بوجوده بينهم، وقطعهم على وجوب طاعته عليهم، ولزومها لهم، لا بد من أن يهابوه ويخافوه في ارتكاب القبائح، ويخشوا تأديبه وانتقامه ومؤاخذته وسطوته، فيكثر منهم فعل الواجب، ويقل ارتكاب القبيح، أو يكون ذلك أقرب وأليق، وهذه هي جهة الحاجة العقلية إلى الإمام<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">[The Awliya(pious followers) of Imam al-Zaman (as) and his Shia and those who believe in him benefit from him while he is in occultation, they benefit as those who are religiously accountable must benefit. They all believe that he must be obeyed at all times, so they have to fear him when committing sins, and they must fear his punishment and discipline and revenge, so they increase their good deeds and decrease from doing bad acts, this is concerning the intellectual need for an Imam.]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">They then ask him, &#8220;How will he punish them and discipline them if he himself is afraid and in hiding?&#8221;<\/p>\n<p style=\"text-align: justify;\">He replied that still the Imam can appear whenever he wishes and do miracles, and that they believe that he knows their secrets and all that they do:<\/p>\n<p style=\"text-align: justify;\">والجواب عن هذا: أن التعجب بغير حجة تظهر وبينة تذكر هو الذي يجب العجب منه وقد علمنا أن أولياء الإمام وإن لم يعرفوا شخصه ويميزوه بعينه، فإنهم يحققون وجوده، ويتيقنون أنه معهم بينهم، ولا يشكون في ذلك ولا يرتابون به:<br \/>\nلأنهم إن لم يكونوا على هذه الصفة لحقوا بالأعداء، وخرجوا عن منزلة الأولياء، وما فيهم إلا من يعتقد أن الإمام بحيث لا تخفي عليه أخباره، ولا تغيب عنه سرائره فضلا عن ظواهره، وأنه يجوز أن يعرف ما يقع منهم من قبيح وحسن، فلا يأمنون إن يقدموا على القبائح فيؤدبهم عليه<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">[The answer for this: &#8230; we know that the Awliya of the Imam even if they do not know the person of the Imam nor are they able to identify him, yet they are certain of his presence between them, they do not doubt this. If they were not such as I described then they would not be from his Awliya, rather from the enemies. They all believe that their news is not hidden from him, and he knows what they do in secret and in public, and that he may know any good or bad act that they commit, so they do not feel safe by committing the sin because they fear that he may discipline them for it.]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">Let&#8217;s stop here and quote two verses from the book of Allah:<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #003300;\">{Your Lord is most knowing of what is within yourselves. If you should be righteous [in intention] &#8211; then indeed He is ever, to the often returning [to Him], Forgiving.} [17:25]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #003300;\">{Indeed, Allah is Knower of the unseen [aspects] of the heavens and earth. Indeed, He is Knowing of that within the breasts.} [35:38]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">Apparently the 12th hidden leader of the Shia also knows what is within the breasts, I seek refuge in Allah from stupidity and ignorance!<\/p>\n<p style=\"text-align: justify;\">I add, How can he appear to them if they narrate from the 12th Imam himself that he says that anyone who claims seeing him is a liar:<\/p>\n<p style=\"text-align: justify;\">سيأتي إلى شيعتي من يدّعي المشاهدة.. ألا فمن ادعي المشاهدة قبلَ خروج السُّفياني والصيحة فهو كذابٌ مُفترٍ<\/p>\n<p style=\"text-align: justify;\">&#8220;There will come to my devotees those who will claim seeing (me). Verily, whosoever claims the seeing before the emergence of Sufyani and the Call then he is a lying impostor.&#8221;<\/p>\n<p style=\"text-align: justify;\">And they narrate:<\/p>\n<p style=\"text-align: justify;\">يفقد الناس إمامهم فيشهدهم الموسم فيراهم ولايرونه<\/p>\n<p style=\"text-align: justify;\">&#8220;The people lose their Imam, so he goes to Hajj and sees them but they do not see him.&#8221;<\/p>\n<p style=\"text-align: justify;\">I add, how does it even make sense for people to see him in his great Ghaybah? When their Mahdi was born in 255 hijri, no one saw him except the closest of  people to the Imam, even some of the relatives of the Imam claimed Imamah simply because no one knew the 12th Mahdi existed. From 260 hijri onward, it was the smaller Ghaybah, no one was able to see the 12th Imam except the four emissaries, then after the fourth one died it was time for the greater Ghaybah, the reason they called it &#8220;greater&#8221; is because absolutely none will be able to see him while recognizing his identity, only these four individuals communicated with him.<\/p>\n<p style=\"text-align: justify;\">In addition, I say that we&#8217;re not even sure if the emissaries saw his person, or if they just received letters and books from him and transmitted them to the Shia. Also, Shia leader al-Kulayni was born in this period, yet he himself was not able to see him or communicate with him.<\/p>\n<p style=\"text-align: justify;\">I&#8217;ll comment on the rest later, for now we continue with al-Murtada:<\/p>\n<p style=\"text-align: justify;\">وليس الحذر من السطوة والإشفاق من النقمة بموقوفين على معرفة العين، وتمييز الشخص، والقطع على مكانه بعينه، فإن كثيرا من رعية الإمام الظاهر لا يعرفون عينه ولا يميزون شخصه، وفي كثير من الأحوال لا يعرفون مكان حلوله، وهم خائفون متى فعلوا قبيحا أن يؤدبهم ويقومهم، وينتفعون بهذه الرهبة حتى يكفوا عن كثير من القبائح، أو يكونوا أقرب إلى الانكفاف<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">[Fear from punishment and anger are not tied to knowing the physical identity of the person, or knowing his location, for many of the subjects(civilians) of the apparent present Imam do not know his shape or identity, and in many cases do not know his location, but they are afraid that whenever they do harm he would punish them for it, they benefit from this fear in that it stops them from many bad habits and acts]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">I&#8217;ll inform al-Murtada of how the regular Sunni Muslims behave, they&#8217;re sitting at home, they know they can commit something evil when no one is looking, yet they&#8217;re afraid of doing the evil acts, and this is why:<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #003300;\">{They fear their Lord above them, and they do what they are commanded.} [16:50]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">As for those who only desist from doing sins because they&#8217;re afraid of the hidden leader or the rulers, we say to them what Allah (swt) says:<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #003300;\">{So fear them not, but fear Me, if you are [indeed] believers.} [3:175]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">May Allah increase the punishment for you O Murtada for these heresies that you invented! A bunch of mindless fools afraid of a hidden man that cannot benefit himself or harm others? Is this what keeps you away from sins you irreligious polytheists!!?<\/p>\n<p style=\"text-align: justify;\">We seek refuge in Allah from such beliefs&#8230;<\/p>\n<p style=\"text-align: justify;\">al-Murtada is then asked: &#8220;Can the Mahdi appoint a depute that punishes the people on behalf of him? If so, how do we know that anyone claiming to be a deputy is a liar or not?&#8221;<\/p>\n<p style=\"text-align: justify;\">He says:<\/p>\n<p style=\"text-align: justify;\">قلنا: بمعجز يظهره الله تعالى على يده، فالمعجزات على مذاهبنا تظهر على أيدي الصالحين فضلا عمن يستخلفه الإمام ويقيمه مقامه<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">[We say: With a miracles that he does by the will of Allah, in our Madhab miracles can be done by pious men let alone deputies appointed by the Imam]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">al-Murtada, whose brain seems to be in a great Ghaybah continues:<\/p>\n<p style=\"text-align: justify;\">وإذا كنا نقطع على وجود الإمام في الزمان ومراعاته لأمورنا، فحاله عندنا منقسمة إلى أمرين، لا ثالث لهما<br \/>\nأما أن يكون معنا في بلد واحد، فيراعي أمورنا بنفسه، ولا يحتاج إلى غيره<br \/>\nأو بعيدا عنا، فليس يجوز &#8211; مع حكمته &#8211; أن يبعد إلا بعد أن يستخلف من يقوم مقامه، كما يجب أن يفعل لو كان ظاهر العين متميز الشخص.<br \/>\nوهذه غاية لا شبهة بعدها<\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">[Since we are certain that the Imam is present at this time and he is taking care of our affairs, his condition is one of two:<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">Either he is with us in the same land, so he personally manages our affairs with no need for help.<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\"><strong><span style=\"color: #000080;\">Or he is in a far land, and it is not acceptable -with his wisdom- that he travels far without appointing one to take his place, just as he would do if he were apparent and identifiable, there is no doubt.]<\/span><\/strong><\/p>\n<p style=\"text-align: justify;\">I say: Is it really wise for the hidden man to appoint deputies who do miracles, in a way that people recognize them and their news spreads, they then get captured and arrested, which leads to exposing the whereabouts of the Imam?<\/p>\n<p style=\"text-align: justify;\">I also say: If benefiting from the 12th scared man was this easy and simple, why has he not benefited us in much more important matters, such as authenticating the narrations of his fathers and removing the conflicting ones in the past 1400 years!? Why does he only benefit the Shia in useless ways, such as cutting the hand of  a Shia thief, or helping a Shia who got lost in the desert? The Shia stories make him look like a charity organisation instead of a divine political and religious leader.<\/p>\n<p style=\"text-align: justify;\">Before this article ends, I&#8217;ll conclude with two Shia arguments as to WHY we do not have an infallible leader today.<\/p>\n<p style=\"text-align: justify;\">If the Shia were to say: &#8220;We are always supposed to have an Imam but Allah hid him from us because of our corruption and sins.&#8221; I say in response: What exactly happened in the life of the 11th Imam al-`Askari which made Allah suddenly decide to deprive us from Imamah? The Shia believe that the entire nation betrayed the Prophet (saw)  and turned against Ahlul-Bayt and `Ali (ra), then they elected Abu Bakr (ra) instead, wasn&#8217;t this enough for Allah to deprive us from Imams at that point? The Shia believe that the nation killed `Ali (ra) and killed Fatima (ra) and Muhasin (ra), then the nation elected their killer `Umar (ra) as leader, wasn&#8217;t this enough for Allah to deprive us from Imamah back then? The Shia believe that the nation abandoned al-Husayn ibn `Ali (ra), even his own Shia participated in killing him and his entire family, yet Allah didn&#8217;t end the Imamah at that point nor did `Ali bin al-Husayn go into Ghaybah.<\/p>\n<p style=\"text-align: justify;\">AND<\/p>\n<p style=\"text-align: justify;\">If the Shia are to say that: &#8220;If the Mahdi wanted to guide us he would guide us all, but Allah wants this to be a test for humanity, he wants us to struggle and find the truth on our own.&#8221; Then I say: We Ahlul-Sunnah believe the message ended with the Prophet (saw) and that humanity was then ready to face the test alone with no help of infallible leaders, but you O Shia are the ones who objected and said that: &#8220;NO, Humanity ALWAYS needs an infallible leader, we require a guide from Ahlul-Bayt at all times!&#8221; Also what is the proof that humanity was not ready back then but it suddenly became ready in the time of the 11th al-`Askari? What changed?<\/p>\n<p style=\"text-align: justify;\">May Allah save us from confusion and ignorance!<\/p>\n<p style=\"text-align: justify;\">wal-Salamu `Aleykum,<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series Peace be upon our nation and prophet. This here is the third topic in this blessed series, and in this one our concentration is on the benefits that we <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/24\/issues-of-ghaybah-part-3\/\" title=\"Issues of Ghaybah [Part-3] &#8211; Believers avoid sins fearing the Imam’s punishment.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-785","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/785","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=785"}],"version-history":[{"count":11,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/785\/revisions"}],"predecessor-version":[{"id":4418,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/785\/revisions\/4418"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=785"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=785"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=785"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}