{"id":802,"date":"2013-11-28T23:49:33","date_gmt":"2013-11-28T23:49:33","guid":{"rendered":"http:\/\/twelvershia.net\/?p=802"},"modified":"2015-08-06T21:39:00","modified_gmt":"2015-08-06T21:39:00","slug":"802","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/11\/28\/802\/","title":{"rendered":"Response to: Umar congratulated Ali at Ghadir-e-Khum."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=802\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to Umar-ibn-Khattab Blog’s article entitled: Umar congratulated Ali at Ghadir-e-Khum, which can be found <a href=\"http:\/\/umar-ibn-khattab.blogspot.de\/2011\/02\/umar-congratulated-ali-at-ghadir-e-khum.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">The Shia blogger starts off his article with the following:<\/p>\n<div style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>As the Sunnis cannot deny the authenticity of the hadith of Ghadir, they try to downplay its significance by saying that the word &#8220;mawla&#8221; in this hadith means &#8216;friend&#8217;, and that the Holy Prophet wanted to announce that: &#8220;Whoever whose friend I am, &#8216;Ali is his friend!&#8221;<\/strong><\/span><span style=\"color: #800000;\">The trouble is that not a single person who was present in Ghadir grasped this alleged meaning. Hassan ibn Thabit, the famous poet of the Holy Prophet, composed a poem and recited it before the audience, in which he said:<\/span><br \/>\n<span style=\"color: #800000;\">The Prophet then said to him: &#8220;Stand up, O Ali, As I am pleased to make you Imam and Guide after me.&#8221;<\/span><\/div>\n<p style=\"text-align: justify;\">We answer by saying: No one who heard the sermon of Ghadeer from among the companions understood that this was an appointment of a leader. The Shia&#8217;s understanding of this event has been refuted in detail on many websites and in many books, so no need to go through that again, but to simplify the matter more, we say that some companions complained to the prophet (saw) about `Ali&#8217;s (ra) actions and decisions during the expedition to Yemen, the Prophet (saw) got angry and delivered a sermon at Ghadeer telling them: That whoever loves, befriends, and supports him must also do the same for `Ali (ra). Then he says that he is leaving two weighty, heavy burdens, one being the Qur&#8217;an, the other are his family members. This is all there is to know about the sermon of Ghadeer Khum and it is very natural for a deviated sect of extremists such as the Imami Twelver Shia to sanctify this event and make it holy, they even have a yearly celebration called `Eid-e-Ghadeer.<\/p>\n<p style=\"text-align: justify;\">As for the word Mawla, anyone with the slightest understanding of Arabic knows that the Arabs at the time and at the head of them the prophet (saw) wouldn&#8217;t use the word &#8220;Mawla&#8221; to refer to leaders, instead if one were to gather ALL narrations in which the Prophet (saw) talks about political leaders, he refers to them as one of several terms: &#8220;Imam, Ameer, Khalifah, Ulil-Amr, Sultan.&#8221; These are VERY clear terms that no one can argue with and they are the ones mainly used to talk about leadership. As for those who are familiar with the language of the Arabs they know for a fact the the word Mawla and Muwalat are almost always used in two meanings: To talk about a person who is your servant OR to talk about an ally or beloved companion, close friend and supporter.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s leave all of this and return to the claim made by the Shia above. These words attributed to Hassaan ibn Thabit (ra) have no Sanad or chain of transmission in the Sunni books. There is one chain though in the book of Muhammad ibn Imran al-Mirzabani, but he is Mu`tazili, not Sunni.<\/p>\n<p style=\"text-align: justify;\">Sources:<\/p>\n<p style=\"text-align: justify;\">1. Siyyar Alam al-Nubala 16\/448<br \/>\n2. Al-Wafi bil-Wafiyat 2\/33<br \/>\n3. Mizan al-Aitdal 3\/672<\/p>\n<p style=\"text-align: justify;\">Secondly, this Sanad or chain has weak narrators. Abu Harun al-`Abdi is Matrook ul-Hadith, meaning he is so bad that the scholars abandoned narrating from him altogether.<\/p>\n<p style=\"text-align: justify;\">Thirdly, Hassaan ibn Thabit (ra) in the books of Ahlul-Sunnah praises Abu Bakr (ra) greatly, it even has a chain of narrators, in al-Mustadrak `ala al-Sahihayn by al-Hakim we read the poetry verses of Hassaan (ra):<\/p>\n<p style=\"text-align: justify;\">إذا تذكرت شجوا من أخي ثقة فاذكر أخاك أبا بكر بما فعلا<br \/>\nخير البرية أتقاها وأعدلها بعد النبي وأوفاها بما حملا<br \/>\nالثاني التالي المحمود مشهده وأول الناس منهم صدق الرسلا<\/p>\n<p style=\"text-align: justify;\">[If you want to remember a reliable brother, then remember what your brother Abu Bakr did. The reciter of Qur&#8217;an, the second of two, the praised one of good character. He was the best of creation, most pious, and faithful among the people after the Prophet (صلى الله عليه وآله وسلم). And he was the first person to testify the truthfulness of the Messenger (صلى الله عليه وآله وسلم).]<\/p>\n<p style=\"text-align: justify;\">Fourthly, Hassaan ibn Thabit (ra) rendered allegiance to Abu Bakr, and wasn&#8217;t among the few people who (according to Shia narrations) didn&#8217;t consider Abu Bakr (ra) to be eligible for caliphate.<\/p>\n<p style=\"text-align: justify;\">I add, the Shia blogger said that all the companions understood from Ghadeer that `Ali (ra) was the leader and successor, well this is not true and can be proven wrong even from Shia books.<\/p>\n<p style=\"text-align: justify;\">و ابن بابويه روايت كرده است كه عبد الله بن مسعود گفت: از رسول خدا (صلى الله عليه و آله و سلم) پرسيدم: كى تو را غسل خواهد داد چون وفات يابى؟ فرمود: هر پيغمبرى را وصى او غسل مى‏دهد؛ گفتم: وصى تو كيست يا رسول الله؟ فرمود: على بن ابى طالب<\/p>\n<p style=\"text-align: justify;\">[Ibn Babawayh has narrated that `Abdullah bin Masud said: I asked the Messenger of Allah (S): “Who will give you the funeral bath?” He replied: “Every prophet is given the funeral bath by his successor.” I asked: “Who is your successor, O Messenger of Allah (S).” He replied: “`Ali Ibn Abi Talib.”]<\/p>\n<p style=\"text-align: justify;\">Source: Hayat-ul-Quloub.<\/p>\n<p style=\"text-align: justify;\">As for ibn `Abbas (ra) they narrate from the Prophet (saw) that he entered upon him when he was in his last sickness and asked:<\/p>\n<p style=\"text-align: justify;\">إذا كان ما نعوذ بالله منه فإلى من؟ فأشار إلى علي، فقال: إلى هذا فإنه مع الحق والحق معه، ثم يكون من بعده أحد عشر إماماً<\/p>\n<p style=\"text-align: justify;\">[&#8220;If what we fear happens then who receives it (The leadership)?&#8221; So he pointed to `Ali and said: &#8220;To this one, he is with the truth and after him will be eleven leaders.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Source: I`lam al-Wara 36, Bihar al-Anwar 36\/300.<\/p>\n<p style=\"text-align: justify;\">There&#8217;s also other similar narrations, but the point is, that the companions never understood that `Ali (ra) was their leader from Ghadeer, otherwise they wouldn&#8217;t ask him about it over and over.<\/p>\n<p style=\"text-align: justify;\">I&#8217;d also like to mention that according to the Shia narrations, Imamate is a secret. Imam Jafar is reported to have said:<\/p>\n<p style=\"text-align: justify;\">ان امرنا سر في سر وسر مستسر وسر لا يفيد الا سر وسر على سر وسر مقنع بسر<\/p>\n<p style=\"text-align: justify;\">[Verily, our &#8216;amr&#8217; is a secret in a secret, and a concealed secret, and a secret that is only known as a secret, and a secret upon a secret and a secret veiled by a secret.]<\/p>\n<p style=\"text-align: justify;\">Source: Basair al-Darajat, p. 48<\/p>\n<p style=\"text-align: justify;\">And in al-Kafi 2\/224:<\/p>\n<p style=\"text-align: justify;\">مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنْ مَسْأَلَةٍ فَأَبَى وَ أَمْسَكَ ثُمَّ قَالَ لَوْ أَعْطَيْنَاكُمْ كُلَّمَا تُرِيدُونَ كَانَ شَرّاً لَكُمْ وَ أُخِذَ بِرَقَبَةِ صَاحِبِ هَذَا الْأَمْرِ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَلَايَةُ اللَّهِ أَسَرَّهَا إِلَى جَبْرَئِيلَ ( عليه السلام ) وَ أَسَرَّهَا جَبْرَئِيلُ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ أَسَرَّهَا مُحَمَّدٌ إِلَى عَلِيٍّ ( عليه السلام ) وَ أَسَرَّهَا عَلِيٌّ إِلَى مَنْ شَاءَ اللَّهُ ثُمَّ أَنْتُمْ تُذِيعُونَ ذَلِكَ &#8230; فاتقوا الله و لا تذيعوا حديثنا<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Yahya, from Ahmad bin Muhammad, from Ahmad bin Muhammad bin abi Nasr that he said: I asked abu al-Hassan al-Rida (as) about a matter but he refused to answer, then he said: If we were to give you all that you request, it would bring evil upon you, and the one responsible for this affair(infallible Imam) would lose his neck. abu Ja`far (as) said: The Wilayah of Allah, He told it to Jibreel (as) secretly, and Jibreel (as) told it to Muhammad (SAWS) secretly, and Muhammad (SAWS) told it to `Ali (as) secretly, and `Ali (as) told it secretly to whomever Allah wanted, but you(shia) announce it (&#8230;) so fear Allah and do not publicly announce our Hadiths &#8220;]<\/p>\n<p style=\"text-align: justify;\">Authentication: Majlisi: Sahih &#8211; al-Mir&#8217;at 9\/192 &amp; Behbudi: Sahih al-Kafi 1\/99.<\/p>\n<p style=\"text-align: justify;\">How can it be such a huge secret, if it was announced on the day of Ghadeer? It shows clearly that the incident of Ghadeer was not the announcement of divine Imamate of Ali.<\/p>\n<p style=\"text-align: justify;\">This is what deviants at the time were spreading, so when `Ali (ra) heard of this he completely denied it:<\/p>\n<p style=\"text-align: justify;\">Abu Tufail &#8216;Amir b. Withila reported: I was in the company of &#8216;Ali b. Abi Talib, when a man came to him, and said: What was it that Allah&#8217;s Apostle (may peace be upon him) told you in secret? Thereupon &#8216;Ali was enraged and said: Allah&#8217;s Apostle (may peace be upon him) did not tell me anything in secret that he hid from people, except that he told me four words. He asked: Commander of Faithful, what are these? He said: Allah cursed him who cursed his father; Allah cursed him who sacrificed for anyone besides Allah; and Allah cursed him who accommodates an innovator (in religion) ; and Allah cursed him who changed the minarets (the boundary lines) of the land.<\/p>\n<p style=\"text-align: justify;\">Source: Sahih Muslim.<\/p>\n<p style=\"text-align: justify;\">The Shia blogger continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">&#8216;Umar ibn al-Khattab congratulated  Ali these words:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>&#8220;Congratulations, O son of Abu Talib, this morning you became mawla of every believing man and woman.&#8221;<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>If mawla means &#8216;friend&#8217; then why the congratulations? And was &#8216;Ali &#8216;enemy&#8217; of all believing men and women before that time, so that &#8216;Umar said that &#8216;this morning&#8217; you became friend of them all?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">al-Imam &#8216;Ali (a. s.) himself wrote to Mu&#8217; awiyah: &#8220;And the Messenger of Allah granted to me his authority over you on the day of Ghadir Khumm. <strong>[1]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">And there are many other Companions of the Holy Prophet who used in their poems the word<\/span><br \/>\n<span style=\"color: #800000;\">&#8220;mawla&#8221; in connection with Ghadir Khumm in the sense of &#8220;master&#8221;.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>Countless scholars of the Qur&#8217;an, Arabic grammar and literature have interpreted the word &#8220;mawla &#8221; as &#8220;awla &#8221; which means &#8220;having more authority &#8221; .<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">The narration according to which `Umar (ra) congratulated `Ali (ra) on the event of Ghadeer is weak.<br \/>\nأخبرنا أبو الحسن بن قبيس ، نا ـ وأبو النجم بدر بن عبد الله ، أنا ـ بكر الخطيب ، نا عبد الله بن علي بن محمد بن بشران ، أنا علي بن عمر الحافظ ، أنا أبو نصر حبشون بن موسى بن أيوب الخلال ، نا علي بن سعيد الرملي ، نا ضمرة بن ربيعة القرشي ، عن ابن شوذب ، عن مطر الوراق ، عن شهر بن حوشب ، عن أبي هريرة ، قال : من صام يوم ثماني عشرة من ذي الحجة كتب له صيام ستين شهرا ، وهو يوم غدير خم لما أخذ النبي صلى الله عليه وسلم بيد علي بن أبي طالب ، فقال : &#8221; ألست أولى بالمؤمنين ؟ &#8221; قالوا : بلى يا رسول الله ، قال : &#8221; من كنت مولاه فعلي مولاه &#8221; ، فقال عمر بن الخطاب : بخ بخ لك يابن أبي طالب ، أصبحت مولاي ومولى كل مسلم ، فأنزل الله عز وجل : اليوم أكملت لكم دينكم سورة المائدة آية 3 ، ومن صام يوم سبعة وعشرين من رجب كتب له صيام ستين شهرا ، وهو أول يوم نزل جبريل عليه السلام بالرسالة<\/p>\n<p style=\"text-align: justify;\">It is narrated from Abu Hurairah that he said : whoever fasts the day of the eighteenths of dhil-hijjah it&#8217;s like he fasted sixty months, and this is the day of Ghadeer Khum when Rasool Allah(saw) took the hand of Ali and said : Haven&#8217;t I more right over the believers? They answered : Indeed, O Messenger of Allah. He said : whoever i&#8217;m his mawla, then Ali is his Mawla. Omar ibn khattab said: Congratulations, O son of Abu Talib, as you have become my Mawla and the Mawla of all Muslims. On this, Allah revealed, today i have completed for you your religion. And whoever fasts on the 27th of Rajab, fasts of sixty months is written for him. And this was the first day on which Jibrael (as) came with revelation.<\/p>\n<p style=\"text-align: justify;\">Tarikh Ibn `Asakir<\/p>\n<p style=\"text-align: justify;\">This narration is weak due to the Tafarrud and Tadlees of Shahr bin Hawshab.<\/p>\n<p style=\"text-align: justify;\">Actually there is not a single authentic narration from any companion who considered the incident of Ghadeer to be the proof of Imamate and leadership of `Ali (ra).<\/p>\n<p style=\"text-align: justify;\">There&#8217;s a narration that proves that `Ali (ra) himself never understood what is meant by &#8220;Mawla&#8221;:<\/p>\n<p style=\"text-align: justify;\">عن رياح بن الحارث قال جاء رهط إلى علي بالرحبة فقالوا السلام عليك يا مولانا قال كيف أكون مولاكم وأنتم قوم عرب قالوا سمعنا رسول الله صلى الله عليه وسلم يوم غدير خم يقول من كنت مولاه فإن هذا مولاه قال رياح فلما مضوا تبعتهم فسألت من هؤلاء قالوا نفر من الأنصار فيهم أبو أيوب الأنصاري<\/p>\n<p style=\"text-align: justify;\">[Riyah ibn al-Harith narrated: a group of the Ansar came to `Ali ibn abi Talib in al-Rahbah, they said: &#8220;al-Salamu `Aleykum our Mawla&#8221; `Ali replied: &#8220;How can I be your Mawla when you are all Arabs?&#8221; they said: &#8220;We heard the messenger of Allah (SAWS) say at Ghadeer Khum: I am the Mawla of whoever this man is his Mawla&#8221;, Riyah said: &#8220;When they left I followed and asked who they were, they said a group from the Ansar among them was abu Ayyub al-Ansari.&#8221;]<\/p>\n<p style=\"text-align: justify;\">source: Musnad Ahmad &#8211; SAHIH.<\/p>\n<p style=\"text-align: justify;\">In other words, when they called him &#8220;Mawlana&#8221; he understood that they meant slavery, so if `Ali (ra) himself got confused as to what they mean, then how can we be blamed? I add, if Ghadeer was such an important appointment then how come he forgot that he is our Mawla?<\/p>\n<p style=\"text-align: justify;\">There&#8217;s also narrations which prove he didn&#8217;t even believe himself to be an appointed leader, such as:<\/p>\n<p style=\"text-align: justify;\">قيل لعلي ألا تستخلف قال ما استخلف رسول الله صلى الله عليه وسلم فأستخلف عليكم وإن يرد الله تبارك وتعالى بالناس خيرا فسيجمعهم على خيرهم كما جمعهم بعد نبيهم على خيرهم<\/p>\n<p style=\"text-align: justify;\">[They said to `Ali: Will you not appoint a successor? He said: The Prophet PBUH did not appoint a successor so that I may do so, If Allah wishes that something good happens to you then he will make you all gather around the best (Man) among you just like he made them gather around the best Man (i.e Abu Bakr) after their prophet PBUH.]<\/p>\n<p style=\"text-align: justify;\">Source: Al Haythami in Mujama&#8217;a al Zawa&#8217;ed, he said: &#8220;All narrators are that of the SAHIH except Ismail bin Abi al Harith and he is Trustworthy.&#8221;<\/p>\n<p style=\"text-align: justify;\">We will also mention what the Shia scholar al-`Allamah al-Mutahhari said concerning the meaning of &#8220;Mawla&#8221;:<\/p>\n<p style=\"text-align: justify;\">[The words, Wala, Walayat, Wilayat, Waly, Mawla, Awla and the like have been derived from the same root, viz. Waly. The various forms of this root-word and its derivatives are the most oft-recurring words in the Holy Qur&#8217;an. It is said that they have been used 124 times in the form of a noun and 112 times in the form of a verb … The original meaning of this root-word as mentioned by Raghib in his lexicon &#8220;Mufradatul Qur&#8217;an&#8221; is one thing taking place by the side of another in such a way that there is no distance between them i.e. if two things are placed side by side in such a manner that there is no other thing between them the root-word &#8216;Waly&#8217; is used … That is why this root-word is naturally used for nearness and proximity also, both physical and figurative. And again for this very reason it has been used in the sense of friendship, love, patronage, guardianship, control etc., because all these conceptions involve some sort of contact and proximity … A number of meanings have been given for this root word and its derivatives. For example, some 27 meanings of the word Mawla have been given. It is obvious that originally it was not coined for all of them and could not have more than one original meaning. Other meanings are to be obtained from contextual indications.]<\/p>\n<p style=\"text-align: justify;\">Source: Master and Mastership, p. 1<\/p>\n<p style=\"text-align: justify;\">Now your scholar has clearly mentioned that basically, the word meant nearness, and the other meanings are to be obtained from contextual indications. Hence, if you want to prove that mawla here indicates that he is the Imam, then you have to prove from the contextual indications. And all the contextual indications prove that the Prophet (صلى الله عليه وآله وسلم) didn’t meant to declare Ali to be the Imam.<\/p>\n<p style=\"text-align: justify;\">1. All the people rendered allegiance to Abu Bakr without any use of force. You can&#8217;t expect the people to have forgotten it so easily.<\/p>\n<p style=\"text-align: justify;\">2. The best place to announce Imamate would have been the place of Arafa, and not Ghadeer Khum.<\/p>\n<p style=\"text-align: justify;\">(The place of Arafa was the location where the Prophet (صلى الله عليه وآله وسلم) made his speech to all the Muslims who had arrived for the last pilgrimage of the Prophet (صلى الله عليه وآله وسلم). At the place of Ghadeer Khum, all those Muslims were not present, but only the people of Madinah or the others who had to go in this direction. The people of Mecca and Yemen who didn&#8217;t go along the Prophet (صلى الله عليه وآله وسلم) after finishing the final pilgrimage were not present. This is a clear and conclusive proof that Ali was not being declared Imam at Ghadeer Khum.)<\/p>\n<p style=\"text-align: justify;\">3. The very word Mawla, the root word of which basically means nearness, shows that the Prophet (صلى الله عليه وآله وسلم) didn&#8217;t intend to declare Ali the Imam.<\/p>\n<p style=\"text-align: justify;\">4. The version &#8216;O Allah befriend him whoever befriends him (i.e Ali), and be his enemy whoever has enmity with him (i.e Ali)&#8217; shows that the Prophet (صلى الله عليه وآله وسلم) didn&#8217;t intend to declare Ali the Imam. Because the root word of (وال) which is always translated here as &#8216;to befriend&#8217; is the same as the root word of Mawla. And secondly, friendship is the opposite of enmity, not leadership. So the perfect translation of this complete tradition looks correct when we translate Mawla as friend.<\/p>\n<p style=\"text-align: justify;\">&#8220;Whosoever considers me his friend, he should consider Ali as his friend. O Allah, befriend him whoever befriends him (i.e Ali), and be enemy of anyone who has enmity to Ali.&#8221;<\/p>\n<p style=\"text-align: justify;\">5. We don&#8217;t find in the books of Ahlus Sunnah that Ali (ra) ever considered the incident of Ghadeer to be the proof of his Imamate. If this was indeed an announcement of the Imamate of Ali, then Ali (ra) would have mentioned it on many occasions.<\/p>\n<p style=\"text-align: justify;\">These realities makes us realize that the incident of Ghadeer Khum was not the announcement of the Imamate of Ali, but it was the announcement of the Wilayah of Ali (in the sense that Ali has a close relation to Allah and the Prophet (صلى الله عليه وآله وسلم), just like the Awliya of Allah. This made it clear that no one had the option to hate Ali or to show enmity towards him). It was not an announcement of divine Imamate concept of Shias, according to which the one who holds it is similar to a prophet in appointment, and has the same powers like prophets, so much so that the major Shia scholar, Mulla Baqir Majlisi gets confused on the differences between Imams and the Prophets, as he says in his book:<\/p>\n<p style=\"text-align: justify;\">ولا نعرف جهة لعدم اتصافهم بالنبوة إلا رعاية جلالة خاتم الانبياء ، ولا يصل عقولنا إلى فرق بين بين النبوة والامامة<\/p>\n<p style=\"text-align: justify;\">[To our knowledge there is no reason not to describe the Imams as Prophets except consideration to the status of the Final Prophet. Our intellect too, cannot perceive a distinction between Nabuwwah (prophethood) and Imamah.]<\/p>\n<p style=\"text-align: justify;\">Bihar Al-Anwar, Vol. 26, p.82<\/p>\n<p style=\"text-align: justify;\">We can conclude that biggest evidence of Shias regarding Imamate is extremely weak, which tells much about the Imamate theory of Shi&#8217;ism.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to Umar-ibn-Khattab Blog’s article entitled: Umar congratulated Ali at Ghadir-e-Khum, which can be found here. The Shia blogger starts off his article with the following: As the Sunnis cannot deny the authenticity of the hadith <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/11\/28\/802\/\" title=\"Response to: Umar congratulated Ali at Ghadir-e-Khum.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[18],"class_list":{"0":"post-802","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah","8":"tag-umar"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/802","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=802"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/802\/revisions"}],"predecessor-version":[{"id":809,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/802\/revisions\/809"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=802"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=802"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=802"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}