{"id":811,"date":"2013-12-04T22:03:22","date_gmt":"2013-12-04T22:03:22","guid":{"rendered":"http:\/\/twelvershia.net\/?p=811"},"modified":"2014-11-21T22:53:34","modified_gmt":"2014-11-21T22:53:34","slug":"quran-has-a-shia-chain-of-transmission","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/12\/04\/quran-has-a-shia-chain-of-transmission\/","title":{"rendered":"Qur&#8217;an has a Shia chain of transmission?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=811\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The Imami Shia of our time use many deceptive strategies in order to defend their beliefs, from these strategies is to accuse their opponents of defects that they themselves have. This tactic serves no purpose other than wasting time, it is an easy quick escape for them.<\/p>\n<p style=\"text-align: justify;\">Here&#8217;s some quick examples to illustrate what I meant:<\/p>\n<p style=\"text-align: justify;\">-The Shia are accused of adding an innovated expression to the text of the call to prayer &#8220;`Aliyyan Waliyullah&#8221;. They counter by saying that it is Ahlul-Sunnah who added the innovation of &#8220;al-Salat Khayrun min al-Nawm&#8221; to prayer, although we Ahlul-Sunnah can prove our case from authentic narrations and they cannot.<\/p>\n<p style=\"text-align: justify;\">-The Shia are accused of believing in the corruption of the Qur&#8217;an, their books are full of narrations accusing the companions of deleting verses in favor of `Ali (ra) or narrations accusing them of changing the position of verses to corrupt the general meaning of the Qur&#8217;an. They counter by finding Sunni narrations about abrogation or different recitations and accuse the Muslims of believing in Tahreef.<\/p>\n<p style=\"text-align: justify;\">-The Shia are accused of not placing any effort in preserving the Qur&#8217;an or its recitation or sciences. They counter by saying that it was they who preserved and collected the Qur&#8217;an, and that the most popular chain of transmission of Qur&#8217;an is a Shia one.<\/p>\n<p style=\"text-align: justify;\">We&#8217;ll stop at this last example because it is our subject for this article. As we all know, the Qur&#8217;an is Mutawatir, meaning mass transmitted, meaning there were thousands of companions reciting the Qur&#8217;an and thousands upon thousands of  followers learning it and teaching it to their children. At this point you might ask: &#8220;If so many people are reciting it, why then do we have a smaller number of chains for the Qur&#8217;an?&#8221; The answer is that these chains are documented by the specialists and the expert reciters, to preserve in a scientific and authentic way the exact recitation and pronunciation of the words, they&#8217;re not meant to preserve the text of the Qur&#8217;an but to preserve the way it was recited by our ancestors, and when we say &#8220;ancestors&#8221; we mean the best reciters of their time and not just any random Arab.<\/p>\n<p style=\"text-align: justify;\">It is a popular fact that the Qur&#8217;an is collected, preserved and spread by Ahlul-Sunnah, so what&#8217;s the problem then?<\/p>\n<p style=\"text-align: justify;\">The problem is that the Shia have a counter argument, whenever we tell them that we preserved the Qur&#8217;an, they say NO, it was us! The Qur&#8217;an which is being printed in Saudi is the recitation of Hafs, from`Asim, from al-Sulamy, from `Ali ibn abi Talib and they&#8217;re all Shia, not one of them is Sunni. Also Sunnies know that `Asim and Hafs are Shia which is why they accuse them of being liars! We challenge the Sunnies to provide us with one chain that they themselves preserved!<\/p>\n<p style=\"text-align: justify;\">This sort of thing has been posted on Shia forums and I&#8217;ve even seen one of their own moderators refute it as it made no sense to him, I&#8217;ll quote what he says:<\/p>\n<blockquote><p>[It sounds like you have no idea how the Qur&#8217;an was preserved according to the Sunnis. First of all, the 7 mutawatir Qiraa&#8217;aat, according to them, is not the Seven ahruf, but they are parts of different ahruf. Those narrations you quoted above are the different ahruf that no long exist and were destroyed after standardization of the Uthmanic codex &#8211; the 5 imam Qur&#8217;ans were distributed to their respective city-states\/regions (Medina, Makka, Shaam, Kufa and Basra). These imam Qur&#8217;ans differed with one another in terms of rasm &#8211; more or less letters\/different letters, in a few places. The Medani and Kufi codex have like 52 differences in rasm. These original manuscripts had no nuqaat or tashkeel. No hamzas either.<\/p>\n<p>Also, they do have sunni chains, seriously. I would suggest you open up al-Jazaris al-Nashr fee Qira&#8217;aat al-`Ashr and look up all the different Turuq for each of the different Qira&#8217;aat. Warsh alone has like 84 &#8211; not Shi&#8217;i at all, as far as I know. And it should be noted that these &#8220;Shi&#8217;a&#8221; in these chains and different Qiraa&#8217;aat cannot be proven to be Imami &#8211; as in believed in divine Imamah and `isma of those Imams etc etc. When classical Sunni literature just uses the word &#8220;Shi`ah&#8221; or &#8220;`Alawiy&#8221; by itself, it usually indicates what we&#8217;d call Zaydis or proto-Sunnis that were just politically Shi`ah or the like. Imami is shown more so when they use the word rafidhi or a &#8220;ghali&#8221; Shi`ah &#8211; someone with &#8220;extreme&#8221; Shi&#8217;ism. The only Rafidhi I know in the Qiraa&#8217;aat chains is Humran b. A`yun [ra], and they admit this and are okay with it cause transmitting Qur&#8217;an and transmitting hadith is different for them.<\/p>\n<p>If you want to be really nit-picky, Sayyid al-Khui [ra] in his book al-Bayan goes out of his way to weaken ALL of the Qurraa&#8217; and their reciters as problematic in some way.<\/p>\n<p>What&#8217;s really problematic, for us, is that there is no &#8220;Shi`ah&#8221; collective effort to preserve the Qur&#8217;an. No books about Qira&#8217;ah from the early Shi`ah (except al-Sayyari&#8217;s book&#8230;which is problematic &#8211; this is a severe understatement). We had part in it, don&#8217;t get me wrong, but the information about that is preserved by them, not us.]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">The above is accurate, and it is a good refutation of their comedic claim. However, we will go into some detail in refuting the above accusation that the Shia made.<\/p>\n<p style=\"text-align: justify;\">Allah has honored and blessed Ahlul-Sunnah by allowing them to collect his words in a book, preserve its chain and recitation for later generations, and he honored them with printing, publishing and spreading his message to the people of the world. It is thus the duty of every Muslim to defend this religion if he is capable and to refute the people of innovation and deviance, that is surely from the best of struggle in the cause of Allah.<\/p>\n<p style=\"text-align: justify;\">The Imami Shia sect known as the Ithna`Ashariyyah (Twelvers) have no chain of transmission to the Qur&#8217;an, not even a weak one, they only rely on Ahlul-Sunnah in this matter. We&#8217;ve seen lately some of their so called scholars (al-Khu&#8217;i) weakening the chains of the Qur&#8217;an in an attempt to lower its significance and value and the hard work the Muslims placed in preserving it, they will attack the reciter Hafs bin Sulayman al-Azdi in order to fulfill this evil goal. On the other hand, we see some Twelver Shia &#8220;scholars&#8221; praising Hafs bin Sulayman and adopting him as one of their own in an attempt to steal a solid Qur&#8217;anic chain that belongs to Ahlul-Sunnah.<\/p>\n<p style=\"text-align: justify;\">From here we begin,<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>1-How can Hafs and `Asim be from the Imams of recitation if they are weak?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, it is not acceptable for you Shia to quote the rules and laws found in the books of your opponent and explain them based on how you understand them. You must always explain their rules based on their own understanding of it, otherwise you are following your desires and wasting you time. When Ahlul-Sunnah transmit a weakness in Hafs or Sulayman, this weakness is in the transmission of narrations it is not a weakness in Qur&#8217;anic letters or recitation.<\/p>\n<p style=\"text-align: justify;\">Secondly, the terminology used by the early scholars and Imams of Hadith sciences must be understood the way they intended, it must be understood after a thorough study and a calm observation.<\/p>\n<p style=\"text-align: justify;\">-Here is what they say about the reciter`Asim ibn abi al-Nujoud al-Asadi:<\/p>\n<p style=\"text-align: justify;\">Imam ibn al-Jawzi said:<\/p>\n<p style=\"text-align: justify;\">وكان ثبتا في القراءة واهيا في الحديث لأنه كان لا يتقن الحديث ويتقن القرآن ويجوده وإلا فهو في نفسه صادق<\/p>\n<p style=\"text-align: justify;\">[He was precise and firm in his recitation, weak in narrating, because he did not perfect the art of narrating however he perfected the art of Qur&#8217;anic recitation, and he himself is honest.]<\/p>\n<p style=\"text-align: justify;\">Imam al-Dhahabi said about him:<\/p>\n<p style=\"text-align: justify;\">فأما في القراءة فثبتٌ إمام ، وأما في الحديث فحسن الحديث<\/p>\n<p style=\"text-align: justify;\">[As far as recitation he is a firm Imam, and as for narrating then he is good.]<\/p>\n<p style=\"text-align: justify;\">He also said:<\/p>\n<p style=\"text-align: justify;\">كان عاصم ثبتاً في القراءة ، صدوقاً في الحديث ، وقد وثقه أبو زرعة وجماعة ، وقال أبو حاتم : محله الصدق ، وقال الدارقطني : في حفظه شيء ، يعني : للحديث لا للحروف<\/p>\n<p style=\"text-align: justify;\">[`Asim was firm in recitation, trustworthy in narrating. He was declared reliable by abu Zur`ah and a group of scholars, abu Hatim said: &#8220;We place him among the trusted.&#8221; and al-Daraqutni said: &#8220;There is something (that bothers me) about his memorization.&#8221; meaning: Memorization of narrations not letters.]<\/p>\n<p style=\"text-align: justify;\">Imam abu Ja`far al-`Uqayli said about him:<\/p>\n<p style=\"text-align: justify;\">لم يكن فيه إلا سوء الحفظ<\/p>\n<p style=\"text-align: justify;\">[His only issue (in terms of narrating) was his bad memorization.]<\/p>\n<p style=\"text-align: justify;\">Imam al-Razi commented about him as a narrator of Hadith and said:<\/p>\n<p style=\"text-align: justify;\">صالح الحديث، ولم يكن بذاك الحافظ، ليس محله أن يقال ثقة<\/p>\n<p style=\"text-align: justify;\">[His narrating is satisfactory, but he was not much of a memorizer (Hafiz) of Hadih, thus we cannot describe him as being reliable (in narrating).]<\/p>\n<p style=\"text-align: justify;\">Imam ibn Hajar al-`Asqalani said about him:<\/p>\n<p style=\"text-align: justify;\">صدوق له أوهام حجة في القراءة، وحديثه في الصحيحين مقرون<\/p>\n<p style=\"text-align: justify;\">[Trustworthy but makes mistakes (when narrating), authoritative in recitation, and his narration in al-Sahihayn (Bukhari &amp; Muslim) is backed by support.]<\/p>\n<p style=\"text-align: justify;\">Conclusion of the condition of `Asim: The man is trustworthy and his narrations are accepted but do not reach the high level of authenticity (Sahih) because of his bad memory and his small mistakes. As a reciter of Qur&#8217;an, they agreed that he perfected the art of recitation and that he is an authority in this field.<\/p>\n<p style=\"text-align: justify;\">-Here is what they say about the reciter Hafs bin Sulayman al-Asadi:<\/p>\n<p style=\"text-align: justify;\">Imam ibn Hajar al-`Asqalani said:<\/p>\n<p style=\"text-align: justify;\">متروك الحديث مع إمامته في القراءة<\/p>\n<p style=\"text-align: justify;\">[They abandoned narrating from him, although he is a leader (in the field) of recitation.]<\/p>\n<p style=\"text-align: justify;\">al-Imam al-Haythami said about a narration which includes Hafs:<\/p>\n<p style=\"text-align: justify;\">وفيه حفص بن سليمان القاريء وثقه أحمد وضعفه الأئمة في الحديث<\/p>\n<p style=\"text-align: justify;\">[It contains Hafs bin Sulayman the reciter, he is declared as reliable by Ahmad but the (other) Imams have weakened him in narrations.]<\/p>\n<p style=\"text-align: justify;\">Imam ibn Hibban al-Bisti said:<\/p>\n<p style=\"text-align: justify;\">كان يقلب الأسانيد، ويرفع المراسيل ويروي من غير سماع<\/p>\n<p style=\"text-align: justify;\">[He used to flip the chains (when narrating), and connect that which is disconnected, and narrate (from someone) without even hearing from them.]<\/p>\n<p style=\"text-align: justify;\">Imam al-Dhahabi said about him:<\/p>\n<p style=\"text-align: justify;\">أما في القراءة فثقة ثبت ضابط لها بخلاف حاله في الحديث<\/p>\n<p style=\"text-align: justify;\">[As for his recitation it is reliable, firm and he does it with precision as opposed to his condition in narrating.]<\/p>\n<p style=\"text-align: justify;\">Conclusion of the condition of Hafs: He is bad when it comes to narrating, he takes it lightly and narrates without knowing the alphabets of the art of Hadith, he may change the chain of what he is narrating or mix up the names, he may narrate from a man something that he didn&#8217;t hear from him directly, he may alter the text of a narration if he doesn&#8217;t memorize it well and so on&#8230; As for his recitation, he excels in it, he learned it from a master such as `Asim and has proven himself worthy.<\/p>\n<p style=\"text-align: justify;\">Thirdly, not one scholar of Rijali sciences attacked or criticized the recitation of either men, they all agree on their Imamah in the field of recitation and praise them for it.<\/p>\n<p style=\"text-align: justify;\">Fourthly, there is a difference between authenticating a man&#8217;s narration and authenticating his recitation.<\/p>\n<p style=\"text-align: justify;\">An Imam or scholar may excel in one field, he may outshine others and prove himself in one domain, because he spent most of his life and all of his effort into perfecting it. He may fall short in some other fields as a result, because he never took care of it during his life.<\/p>\n<p style=\"text-align: justify;\">The rules of the Qur&#8217;anic chain are different than those of the Hadithi chain, you may often come across a man who memorized the entire Qur&#8217;an, he perfected its recitation, he memorized all grammatical laws and related poetry, yet you ask him to narrate just one Hadith with its chain, he will not be able to do it, and if he does, he will make huge mistakes.<\/p>\n<p style=\"text-align: justify;\">The conditions of a narrator of Hadith are mainly that he must be upright, must adhere to the moralistic decorum, must maintain proper social graces and he must have the necessary precision pertaining to the memorization and writing of Hadith. Hafs has the uprightness but lacks the precision so his narrations were abandoned, many scholars and Imams were also abandonned in Hadith because of their lack of precision but this in no way harms their `Adalah or uprightness.<\/p>\n<p style=\"text-align: justify;\">We give an example, from the famous reciters and popular narrators of the Qur&#8217;an is Abu Bakr bin `Ayyash al-Asadi, al-Imam al-Dhahabi said about him:<\/p>\n<p style=\"text-align: justify;\">صدوق ثبت في القراءة، لكنه في الحديث يغلط ويهم<\/p>\n<p style=\"text-align: justify;\">[Trustworthy and firm in recitation, but in narrations he makes mistakes and falls into error.]<\/p>\n<p style=\"text-align: justify;\">Another example is `Umar bin Haroun al-Thaqafi, al-Dhahabi said about him:<\/p>\n<p style=\"text-align: justify;\">ولا ريب في ضعفه ، وكان إماماً حافظاً في حروف القراءات<\/p>\n<p style=\"text-align: justify;\">[No doubt about his weakness (in narrations), and he was a leader and memorizer of Qur&#8217;anic letters.]<\/p>\n<p style=\"text-align: justify;\">Another example is al-Hasan bin `Ali bin Ibrahim al-Ahwazi, al-Dhahabi said about him:<\/p>\n<p style=\"text-align: justify;\">كان رأساً في القراءات معمرا بعيد الصيت صاحب حديث ورحلة وإكثار وليس بالمتقن له ولا المجود بل هو حاطب ليل<\/p>\n<p style=\"text-align: justify;\">[He was from the heads of recitations, he lived long and his reputation reach far and wide, he was a man of many narrations and many travels, but he did not perfect it nor was he good at it (narrating), but rather like a man cutting wood in the darkness of the night.]<\/p>\n<p style=\"text-align: justify;\">This applies to other fields as well, such as the field of Tafseer, the interpretation of the Qur&#8217;an, from the famous Mufassireen of the Qur&#8217;an is al-Dahhak bin Muzahim al-Hilali al-Khurasani, al-Dhahabi said about him:<\/p>\n<p style=\"text-align: justify;\">صاحب التفسير &#8230;. وليس بالمجود لحديثه<\/p>\n<p style=\"text-align: justify;\">[The author of the Tafseer (&#8230;) and he is not good in his narrations.]<\/p>\n<p style=\"text-align: justify;\">Imam ibn `Adi said:<\/p>\n<p style=\"text-align: justify;\">في رواياته كلها نظر إنما اشتهر بالتفسير<\/p>\n<p style=\"text-align: justify;\">[All his narrations are questionable, he was only famous for Qur&#8217;anic interpretation.]<\/p>\n<p style=\"text-align: justify;\">It could be the inverse, where a man is weak in recitation but strong in Hadith, such as Sulayman al-A`mash, al-Dhahabi describes him:<\/p>\n<p style=\"text-align: justify;\">كان ثبتاً في الحديث ، ليناً في الحروف<\/p>\n<p style=\"text-align: justify;\">[He was firm in narration, soft in letters of recitation.]<\/p>\n<p style=\"text-align: justify;\">He could be good in the history of military expeditions (Maghazee) and weak in Hadith, such as Salamah bin al-Fadl al-Razi, al-Dhahabi said:<\/p>\n<p style=\"text-align: justify;\">كان قوياً في المغازي &#8230; وقد سمع منه ابن المديني وتركه<\/p>\n<p style=\"text-align: justify;\">[He was strong in Maghazee (&#8230;) ibn al-Madeeni heard (his narrations) and abandoned them.]<\/p>\n<p style=\"text-align: justify;\">al-Waqidi is another example, al-Dhahabi said:<\/p>\n<p style=\"text-align: justify;\">لا يستغنى عنه في المغازي وأيام الصحابة وأخبارهم<\/p>\n<p style=\"text-align: justify;\">[He is valuable in Maghazee and history of the companions and their news.]<\/p>\n<p style=\"text-align: justify;\">But al-Nisa&#8217;ee said about him:<\/p>\n<p style=\"text-align: justify;\">ليس بثقة<\/p>\n<p style=\"text-align: justify;\">[Unreliable.]<\/p>\n<p style=\"text-align: justify;\">He could be strong in Hadith and weak in Fiqh like Sa`eed bin `Uthman, al-Dhahabi said:<\/p>\n<p style=\"text-align: justify;\">وكان ورعاً زاهداً حافظاً ، بصيراً بعلل الحديث ورجاله ، لا علم له بالفقه<\/p>\n<p style=\"text-align: justify;\">[He was pious, god-fearing, of strong memory, knowledgeable about the issues of narration and narrators, but he had no knowledge of jurisprudence.]<\/p>\n<p style=\"text-align: justify;\">A man could an expert linguist but a bad narrator, such as `Umar bin Hasan, al-Dhahabi said:<\/p>\n<p style=\"text-align: justify;\">كان الرجل صاحب فنون وتوسع ويد في اللغة ، وفي الحديث على ضعف فيه<\/p>\n<p style=\"text-align: justify;\">[He was a man knowledgeable in (many) arts with vast talent and an able linguist, but he had some weakness in narration.]<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>2-Are Hafs and `Asim Imami Shia narrators?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">First of all, the claim that the chain of reciters of `Asim are all Koufan Shia is nothing short of delirium, it is a baseless statement.<\/p>\n<p style=\"text-align: justify;\">Secondly, if the Twelver Shia want us to believe their claim about `Asim and Hafs being Rafidhi Imamis, they have to quote any of the Sunni books of Rijal and Tarajim to prove this.  If they can&#8217;t prove it from our books, they need to quote their own main books of Tarajim and Rijal such as al-Tusi or al-Kashshi or al-Najashi and prove that these two individuals were Imami Rafidhi Shia.<\/p>\n<p style=\"text-align: justify;\">Thirdly, Hafs was not mentioned in the main Shia books of Rijal, not in Kashshi, or Najashi, or ibn Dawud al-Helli, or Khaqani, or al-Barqi. All there is to it is that al-Tusi mentioned him in his Rijal as being from the &#8220;companions of al-Sadiq&#8221; and he never said a word about his reliability or about him being Shia.<\/p>\n<p style=\"text-align: justify;\">Now one will ask, &#8220;If a man was a companion of al-Sadiq, doesn&#8217;t this mean he is a reliable Twelver Shia?&#8221;<\/p>\n<p style=\"text-align: justify;\">We open the reliable book of Shia Rijal called &#8220;al-Mufeed min Mu`jam Rijal al-Hadith&#8221; by al-Jawahiri, in this book he summarizes the opinion of Ayatullah al-Khu&#8217;i on each narrator, we read the following:<\/p>\n<p style=\"text-align: justify;\">إبراهيم بن رجاء الشيباني: أبو إسحاق المعروف بابن هراسة كما قاله الشيخ &#8211; عامي مجهول &#8211; من أصحاب الصادق<\/p>\n<p style=\"text-align: justify;\">[Ibrahim bin Raja&#8217; al-Shaybani: abu Ishaq, known as ibn Hurasah as al-Shaykh said -`Aami Majhoul &#8211; from the companions of al-Sadiq]<\/p>\n<p style=\"text-align: justify;\">حاتم بن إسماعيل: المدني &#8211; من أصحاب الصادق (ع) &#8211; مجهول &#8211; عامي<\/p>\n<p style=\"text-align: justify;\">[Hatim bin Isma`eel: al-Madani &#8211; from the companions of al-Sadiq (as) &#8211; Majhoul &#8211; `Aami]<\/p>\n<p style=\"text-align: justify;\">حفص بن غياث: بن طلق بن معاوية، من أصحاب الصادق، والكاظم (ع) قاضي هارون ببغداد ثم في الكوفة، عامي المذهب &#8211; ثقة وعملت الطائفة برواياته<\/p>\n<p style=\"text-align: justify;\">[Hafs bin Ghayath: bin Talq bin Mu`awiyah. From the companions of al-Sadiq and al-Kadhim, the judge of Haroun in Baghdad then Kufa, his Madhab is `Aami &#8211; Thiqah, and the sect practiced based on his narrations]<\/p>\n<p style=\"text-align: justify;\">إبراهيم بن شيعب: واقفي من أصحاب الكاظم (ع) &#8211; مجهول<\/p>\n<p style=\"text-align: justify;\">[Ibrahim bin Shu`ayb: Waqifi, from the companions of al-Kadhim (as) -Majhoul]<\/p>\n<p style=\"text-align: justify;\">إبراهيم بن عبد الحميد: الأسدي واقفي &#8211; ثقة &#8211; له أصل &#8211; روى في كامل الزيارات &#8211; من أصحاب الصادق والكاظم والرضا<\/p>\n<p style=\"text-align: justify;\">[Ibrahim bin `Abdul-Hameed: al-Asadi, Waqifi -Wrote an Asl- narrated in Kamil al-Ziyarat &#8211; from the companions of al-Sadiq, al-Kadhim and al-Rida]<\/p>\n<p style=\"text-align: justify;\">زياد بن المنذر: أبو الجارود الهمداني &#8211; من أصحاب الصادق والباقر (ع) زيدي المذهب &#8211; ثقة<\/p>\n<p style=\"text-align: justify;\">[Ziyad bin al-Mundhir: abu al-Jaroud al-Hamdani &#8211; from the companions of al-Sadiq and al-Baqir, his Madhab is Zaydi &#8211; Thiqah]<\/p>\n<p style=\"text-align: justify;\">المرقع بن قمامة الأسدي: من أصحاب أمير المؤمنين (ع) &#8211; مجهول &#8211; روى عنه الكشي، رواية دالة على أنه كان كيسانيا<\/p>\n<p style=\"text-align: justify;\">[al-Muraqqa` bin Qimamah al-Asadi: From the companions of Ameer al-Mu&#8217;mineen (as) &#8211; Majhoul &#8211; al-Kashshi narrated from him a narration which proves that he was a Kaysani]<\/p>\n<p style=\"text-align: justify;\">Meaning these fellows were companions of al-Sadiq, yet they&#8217;re `Aami, meaning regular Sunni Muslims. We learn two things from this:<\/p>\n<p style=\"text-align: justify;\">1- That if a man is called a companion of an Imam, this doesn&#8217;t mean he is Shia.<\/p>\n<p style=\"text-align: justify;\">2- It doesn&#8217;t prove his reliability, as a companion of al-Sadiq can be Majhoul.<\/p>\n<p style=\"text-align: justify;\">3- Even if they prove he is Shia, they need to prove that he was an Imami Twelver Shia, not a Zaydi or Kaysani or Fatahi or Waqifi.<\/p>\n<p style=\"text-align: justify;\">Fourthly, not everyone who accompanied `Ali (ra) is a Shi`ee Rafidhi, it is clear from most historical texts that the supporters of `Ali (ra) most of them did not believe he was divinely appointed or infallible, and the majority of them believed in the superiority of the Shaykhayn as al-Shareef al-Murtada says in his book.<\/p>\n<p style=\"text-align: justify;\">Fifthly, this is what is mentioned about Hafs in the contemporary Shia books of Rijal, al-Jawahiri says:<\/p>\n<p style=\"text-align: justify;\">حفص بن سليمان أبو عمرو: الأسدي الغاضري &#8221; الفاخري &#8221; المقرئ، البزاز، الكوفي &#8211; من أصحاب الصادق (ع) أسند عنه <em id=\"__mceDel\">&#8211; مجهول -.<\/em><\/p>\n<p style=\"text-align: justify;\">[Hafs bin Sulayman abu `Amro: al-Asadi al-Ghadiri al-Fakhiri the reciter, al-Bazzaz, a Kufan &#8211; from the companions of al-Sadiq (as), Usnida `Anhu &#8211; Majhoul]<\/p>\n<p style=\"text-align: justify;\">As for `Asim, they said about him:<\/p>\n<p style=\"text-align: justify;\">عاصم بن أبي النجود الأسدي: مجهول &#8211; روى في التهذيبين &#8211; متحد مع لاحقه<\/p>\n<p style=\"text-align: justify;\">[`Asim bin abi al-Nujoud al-Asadi: Majhoul &#8211; Narrated in the Tahdheebayn -]<\/p>\n<p style=\"text-align: justify;\">As for the books of Ahlul-Sunnah, we read that Ahmad bin Salih al-Jeeli said regarding `Asim:<\/p>\n<p style=\"text-align: justify;\">كان ثقة في الحديث، ولكن يختلف عنه في حديث زر وأبي وائل، وكان عثمانيا<\/p>\n<p style=\"text-align: justify;\">[He was Thiqah in Hadith, they differed about his Hadith from Zirr and abu Wa&#8217;il, and he was a `Uthmani.]<\/p>\n<p style=\"text-align: justify;\">As you can see the man is a `Uthmani, and the scholars describe a man of being `Uthmani when he is a lover of `Uthman ibn `Affan (ra) and sometimes `Uthmanis hold grudges against `Ali ibn abi Talib (ra).<\/p>\n<p style=\"text-align: justify;\">How did the Twelver Shia reach the conclusion that these two men are Imami Rafidhah is beyond me, there is absolutely no indication of this. It is known that a large group of Koufans were called &#8220;Shia&#8221; but this does not refer to the Twelver Shia sect, it is just that they were sympathetic towards `Ali (ra), they politically sided with him and supported him. On the other hand, the people of Sham were sympathetic to `Uthman (ra) and Mu`awiyah (ra), this doesn&#8217;t mean they believed their leaders were divinely appointed.<\/p>\n<p style=\"text-align: justify;\">Sixthly, the fact that the Imami Shia went out of their way and try and steal a popular Sunni chain from our own books, this shows that they have nothing to offer, it shows that their books do not contain a chain of transmission to the Qur&#8217;an, it shows that they did not give proper care to the most important weighty thing, so how then can they claim that religion is only taken from the infallible when they can&#8217;t attribute their holy book to their own infallible?<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>3- Is Hafs bin Sulayman a liar according to Ahlul-Sunnah?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">1-Ibn Kharrash accused him, he said:<\/p>\n<p style=\"text-align: justify;\">كذاب متروك يضع الحديث<\/p>\n<p style=\"text-align: justify;\">[Liar, his narrations are abandoned, a fabricator.]<\/p>\n<p style=\"text-align: justify;\">Ibn Kharrash is `Abdul-Rahman bin Yusuf bin Kharrash, he is a Rafidhi. From his students is ibn `Uqdah who is also a Rafidhi.<\/p>\n<p style=\"text-align: justify;\">The author of Lisan al-Meezan says about him:<\/p>\n<p style=\"text-align: justify;\">بعد هذا فما انتفع بعلمه فلا عتب على حمير الرافضة<\/p>\n<p style=\"text-align: justify;\">[After this, he never benefited from his knowledge, but there is no reproach for the donkeys of the Rafidhah.]<\/p>\n<p style=\"text-align: justify;\">And this Rafidhi&#8217;s opinions are rejected as the Rafidhah themselves are liars, and this man weakened narrations such as &#8220;We do not give inheritance, all we leave behind is Sadaqah.&#8221;  Although it is authentic and with many chains, he accused one of the main reliable narrators (Malik bin Uways) of fabricating it, so he is a hypocrite.<\/p>\n<p style=\"text-align: justify;\">2- They reported from ibn Ma`een that he said:<\/p>\n<p style=\"text-align: justify;\">كان حفص بن سليمان وأبو بكر بن عياش من أعلم الناس بقراءة عاصم وكان حفص أقرأ من أبي بكر وكان أبو بكر صدوقا وكان حفص كذابا<\/p>\n<p style=\"text-align: justify;\">[Hafs bin Sulayman and Abu Bakr bin `Ayyash were the most knowledgeable of people in the recitation of `Asim, Hafs was better than Abu Bakr at it but Abu Bakr was trustworthy and Hafs was a liar.]<\/p>\n<p style=\"text-align: justify;\">The one who narrated the above is ibn Mihraz Ahmad bin Muhammad al-Baghdadi and he is from the weaker students, so what he reports is not acceptable if it conflicts with the major students of the man.<\/p>\n<p style=\"text-align: justify;\">As for the reliable and best students of ibn Ma`een such as `Uthman bin Sa`eed al-Darimy and abu Qudamah al-Sarkhasi, they reported from him that he said:<\/p>\n<p style=\"text-align: justify;\">ليس بثقة<\/p>\n<p style=\"text-align: justify;\">[Not relied upon.]<\/p>\n<p style=\"text-align: justify;\">In Tareekh Baghdad we read from the reliable narrators the following:<\/p>\n<p style=\"text-align: justify;\">علي بن الحسين بن حيان قال وجدت في كتاب أبي بخط يده قال أبو زكريا يعني يحيى بن معين زعم أيوب بن متوكل قال أبو عمر البزاز أصح قراءة من أبي بكر بن عياش وأبو بكر أوثق من أبي عمر<\/p>\n<p style=\"text-align: justify;\">[`Ali bin al-Husayn bin Hayyan said: I found in my father&#8217;s book, in his own handwriting that he said: abu Zakariyah Yahya bin Ma`een, Ayyub bin al-Mutawakkil stated, abu `Umar al-Bazzaz (Hafs) has better recitation than Abu Bakr bin `Ayyash, and Abu Bakr is more reliable than abu `Umar.]<\/p>\n<p style=\"text-align: justify;\">الليث بن عبيد أنه قال : سمعت يحيى بن معين يقول : أبو عمر البزاز صاحب القراءة ليس بثقة ، هو أصح قراءة من أبي بكر بن عياش ، وأبو بكر أوثق منه<\/p>\n<p style=\"text-align: justify;\">[al-Layth bin `Ubayd that he said: I heard Yahya bin Ma`een say: abu `Umar al-Bazzaz (Hafs) is a man of recitation, not reliable, his recitation is better than Abu Bakr bin `Ayyash, and Abu Bakr is more reliable.]<\/p>\n<p style=\"text-align: justify;\">So notice how there is no mention of him saying &#8220;Liar&#8221;.<\/p>\n<p style=\"text-align: justify;\">3- All the scholars and Imams of Rijal and Hadith, such as al-Hakim, ibn `Adi, ibn al-Jawzi, al-Bayhaqi, abu Hatim, abu Zur`ah, Ahmad bin Hanbal, al-Nasa&#8217;ee, al-Jawzajani, ibn Hajar, al-Dhahabi, al-Saji, ibn al-Madeeni, al-Bukhari ect&#8230;<\/p>\n<p style=\"text-align: justify;\">When they talked about Hafs&#8217;s narrations they said that he was either acceptable or weak or abandoned or unreliable or that they avoided writing what he narrates, not one of them said the man was a liar or fabricator.<\/p>\n<p style=\"text-align: justify;\">In conclusion it is established that he is weak in narration and this is agreed upon, as for him being a liar or fabricator, this is not accepted.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>4- Abu `Abdul-Rahman `Abdullah bin Habib al-Sulamy, what&#8217;s his condition?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Imam ibn `Abdul-Barr al-Andalusi says about him:<\/p>\n<p style=\"text-align: justify;\">عند جميعهم ثقة<\/p>\n<p style=\"text-align: justify;\">[According to all (scholars) he is reliable.]<\/p>\n<p style=\"text-align: justify;\">As for the Shia, in Rijal al-Barqi the author says that he is from Ali&#8217;s (ra) companions and that some narrators criticized him. Then again, we proved above that this in itself doesn&#8217;t make him an Imami Shia, at best it makes him a political Shia and we Ahul-Sunnah do not bother ourselves with this as we believe that political Shia are mainly Sunni. I add, his companions were by the thousands and if one were to open al-Barqi&#8217;s book we would read that some of his closest companions were the likes of:<\/p>\n<p style=\"text-align: justify;\">Jabir bin `Abdullah al-Ansari (ra), one of the main narrators in the books of Ahlul-Sunnah, he was not a Shia.<\/p>\n<p style=\"text-align: justify;\">Salamah bin Kuhayl, and our scholars describe him as &#8220;Having some Tashayyu` in him.&#8221; Meaning that he leaned towards `Ali (ra) and preferred him over `Uthman (ra), if he was an Imami, they would have described him as &#8220;Rafidhi&#8221; or &#8220;Ghalee fil-Tashayyu`&#8221;. Aside from this, he is from the most reliable of Sunni narrators, Shu`bah bin al-Hajjaj says about him:<\/p>\n<p style=\"text-align: justify;\">من ثقات أصحابي<\/p>\n<p style=\"text-align: justify;\">[From my most reliable companions.]<\/p>\n<p style=\"text-align: justify;\">Abu Juhayfah Wahb al-Khayr is also one of them and he is a big Sunni narrator, it is Mutawatir in our books that he narrated from `Ali (ra) that he said: &#8220;The best of this nation is Abu Bakr and `Umar.&#8221; They also list Suwayd ibn Ghaflah and he also narrates this same Hadith.<\/p>\n<p style=\"text-align: justify;\">I add that `Abdullah bin Habib narrates from `Uthman ibn `Affan (ra) and takes his religion from him, in Sahih al-Bukhari he narrates from `Uthman (ra) from the Prophet (saw) that he said: &#8220;The best of you are those who learn the Qur&#8217;an and teach it.&#8221;<\/p>\n<p style=\"text-align: justify;\">And in Jami` al-Tahseel it says:<\/p>\n<p style=\"text-align: justify;\">قال تعلم أبو عبد الرحمن القرآن من عثمان وعرض على علي رضي الله عنهما<\/p>\n<p style=\"text-align: justify;\">[Abu `Abdul-Rahman al-Sulamy learned the Qur&#8217;an from `Uthman and recited it in front of `Ali may Allah be pleased with both.]<\/p>\n<p style=\"text-align: justify;\">We do not know of any Imami Rafidhi Shia who narrates from `Uthman (ra) or takes his religion from him.<\/p>\n<p style=\"text-align: justify;\">In fact as stated in Tadheeb al-Kamal he narrated from Khalid bin al-Walid (ra) and Sa`d bin abi Waqqas (ra) and abu Hurayrah (ra) and ibn Mas`oud (ra) and others&#8230; As for the Imamiyyah they would never do this, their books are devoid of such content.<\/p>\n<p style=\"text-align: justify;\">In Siyar A`lam al-Nubala&#8217; it is narrated from Muhammad bin `Ubaydullah al-Thaqafi that he and al-Hasan bin `Ali (ra) used to learn Qur&#8217;an from `Abdullah bin Habib al-Sulamy. I&#8217;ve never come across a Twelver Shia that teaches his own infallible Imam how to recite Qur&#8217;an, have you?<\/p>\n<p style=\"text-align: justify;\">The students of al-Sulamy have also narrated from him:<\/p>\n<p style=\"text-align: justify;\">أنهم قرؤوا على أبي عبدالرحمن السلمي، وذكروا أنه أخبرهم أنه قرأ على عثمان عامة القرآن، وكان يسأله عن القرآن، فيقول: إنك تشغلني عن أمر الناس، فعليك بزيد بن ثابت، فإنه يجلس للناس، ويتفرغ لهم، ولست أخالفه في شئ من القرآن<\/p>\n<p style=\"text-align: justify;\">[(That he) recited the majority of Qur&#8217;an in front of `Uthman, and he used to ask him about the Qur&#8217;an (and its sciences), so `Uthman would reply: &#8220;You are keeping me from taking care of the people&#8217;s affairs, go seek Zayd ibn Thabit, he is free and is teaching, I do not differ with him in any of the Qur&#8217;an.]<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong> 5- Recitation of Hamzah al-Zayyat, is it from a Shia chain?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Some Shia claimed that the recitation of the second Imam of Kufa, Hamzah bin Habib bin `Amarah al-Zayyat, they claimed it is a Shia chain.<\/p>\n<p style=\"text-align: justify;\">First of all, let us see what the scholars of Ahlul-Sunnah say about him:<\/p>\n<p style=\"text-align: justify;\">Imam al-Dhahabi says:<\/p>\n<p style=\"text-align: justify;\">كان إماما حجة قيما بكتاب الله تعالى حافظا للحديث بصيرا بالفرائض والعربية عابدا خاشعا قانتا لله<\/p>\n<p style=\"text-align: justify;\">[He was an Imam a Hujjah, obedient to the book of Allah most high, a Hafiz of Hadith, knowledgeable about inheritance and Arabic, pious devout worshiper.]<\/p>\n<p style=\"text-align: justify;\">Imam abu Hanifa when talking to him told him:<\/p>\n<p style=\"text-align: justify;\">شيئان غلبتنا فيهما لا ننازعك في واحدٍ منها ، القرآن ، والفرائض<\/p>\n<p style=\"text-align: justify;\">[You beat us in two things that we would never dispute with you over them, the (recitation of) Qur&#8217;an, and the (science of) inheritance.]<\/p>\n<p style=\"text-align: justify;\">Yahya bin Ma`een heard Muhammad bin Fudayl say:<\/p>\n<p style=\"text-align: justify;\">ما أحسب أن الله تعالى يدفع البلاء عن أهل الكوفة إلا بحمزة<\/p>\n<p style=\"text-align: justify;\">[I do not see Allah pushing away the hardships from the people of Kufa except for the sake of Hamzah.]<\/p>\n<p style=\"text-align: justify;\">This is sufficient for our purpose and we learn that the man is reliable in Hadith, strong in recitation and language and praised by the scholars of his time. It is also important to note that there isn&#8217;t anything pointing to him being a Shia.<\/p>\n<p style=\"text-align: justify;\">Let&#8217;s check what the early Shia Rijali books say, maybe we&#8217;ll find something about him, al-Tusi never mentions him in his Fehrest, he does in his Rijal, he says:<\/p>\n<p style=\"text-align: justify;\">حمزة بن حبيب، أبو عمارة السلمي، مولاهم المقري الكوفي<\/p>\n<p style=\"text-align: justify;\">[Hamzah bin Habib, abu `Amarah al-Sulamy, Mawlahum, the reciter, the Kufan.]<\/p>\n<p style=\"text-align: justify;\">al-Najashi, never mentions him. al-Kashshi never mentions him. ibn Shahr Ashoub never mentions him. ibn al-Ghada&#8217;iri never mentions him. al-Barqi never mentions him.<\/p>\n<p style=\"text-align: justify;\">At this point I realized they must not have much on the man, which is why al-Jawahiri sums up Khu&#8217;i&#8217;s opinion by saying that Hamzah is &#8220;Majhoul&#8221;.<\/p>\n<p style=\"text-align: justify;\">Another point is, if Hamzah was an Imami Shia as they claim, can they explain to us why he took his Qur&#8217;anic recitation from other than Ja`far al-Sadiq? He took recitation from Sulayman bin Mihran al-A`mash, abu Hamzah Himran bin A`yyun, abu Ishaq al-Subay`ee, Muhammad bin `Abdul-Rahman ibn abi Layla and Talhah bin Musarrif. Wasn&#8217;t Ja`far&#8217;s recitation sufficient for him?<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>6- The terminology of the early scholars: &#8220;Shia&#8221; or &#8220;Rafidhah&#8221;?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">The matter has already been proven, this section is just an added benefit, when an early scholar of Ahlul-Sunnah describes a narrator as &#8220;Shia&#8221;, what would be his condition? What did being a &#8220;Shia&#8221; mean back then? Why were some called &#8220;Shia&#8221; and others &#8220;Rafidhah&#8221; or &#8220;Ghulat al-Tashayyu`&#8221;?<\/p>\n<p style=\"text-align: justify;\">This small brief collection of quotes may clarify the matter, and maybe InshaAllah we will translate many more quotes in a separate article.<\/p>\n<p style=\"text-align: justify;\">Shia scholar of Hadith, al-Tustari says in the introduction of his Qamous al-Rijal:<\/p>\n<p style=\"text-align: justify;\">إن قول العامة فرد شيعي أو يتشيع أعم من الإمامية وإنما المرادف له الرافضي أو الشيعي الغالي<\/p>\n<p style=\"text-align: justify;\">[When the `Aamah(Sunnies) describe the individual as Shi`ee or Yatashayya`, it is more general than the Imamiyyah which is referred to as Rafidhi or Shi`ee Ghalee.]<\/p>\n<p style=\"text-align: justify;\">He also says:<\/p>\n<p style=\"text-align: justify;\">وللشيعي أيضاً عندهم معنى آخر وهو أنه عباسي<\/p>\n<p style=\"text-align: justify;\">[And the description of Shi`ee for them contains another meaning, it refers to `Abbasi]<\/p>\n<p style=\"text-align: justify;\">Meaning, that the word Shia which is uttered by the early Sunni scholars does not mean the man is a Twelver or Waqifi or any type of Imami Shia, it mostly refers to those who support `Ali (ra) politically or favor him over `Uthman (ra), it also refers to the supporters of bani al-`Abbas who are as the reader is well aware, from Aalul-Bayt.<\/p>\n<p style=\"text-align: justify;\">al-Dhahabi says in Meezan al-I`tidal:<\/p>\n<p style=\"text-align: justify;\">فالشيعي الغالي في زمان السلف وعرفهم هو من تكلم في عثمان والزبير وطلحة ومعاوية وطائفة ممن حارب عليا رضي الله عنه، وتعرض لسبهم ، والغالي في زماننا وعرفناهو الذي يكفر هؤلاء السادة، ويتبرأ من الشيخين أيضاً، فهذا ضال معثر<\/p>\n<p style=\"text-align: justify;\">[The Ghalee(Extreme) Shi`ee in the days of the predecessors and according to their understanding at that time, are those who criticize `Uthman and al-Zubayr and Talhah and Mu`awiyah and a group from those who fought with `Ali, they may also  swear at them. The Ghalee Shi`ee in our time and understanding today, are those who make Takfeer on those masters and disowns the Shaykhayn as well, these are pathetic misguided ones.]<\/p>\n<p style=\"text-align: justify;\">al-Dhahabi when commenting on al-Hakim al-Naysapuri, said:<\/p>\n<p style=\"text-align: justify;\">إما انحرافه عن خصوم علي فظاهر ، وأما أمر الشيخين فمعظِّمٌ لهما بكل حال ، فهو شيعي لا رافضي<\/p>\n<p style=\"text-align: justify;\">[His dislike for the opponents of `Ali is apparent, but he speaks of the greatness of the Shaykhayn at all times, so he is a Shi`ee not a Rafidhi]<\/p>\n<p style=\"text-align: justify;\">al-Hamawi writes:<\/p>\n<p style=\"text-align: justify;\"> قال يحيى بن سعيد القطان كان محمد بن اسحاق والحسن بن ضمرة وابراهيم بن محمد كل هؤلاء يتشيعون ويقدمون عليا على عثمان<\/p>\n<p style=\"text-align: justify;\">[Yahya bin Sa`eed al-Qattan said: Muhammad bin Ishaq and al-Hasan bin Dumrah and Ibrahim bin Muhammad, they were all Shia, they placed `Ali over `Uthman.]<\/p>\n<p style=\"text-align: justify;\">Notice that the condition of the Shia back then was that they preferred `Ali (ra) over `Uthman (ra), unlike the Rafidhah who curse everything that moves and raise `Ali (ra) to an extreme level.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar al-`Asqalani says:<\/p>\n<p style=\"text-align: justify;\">والتشيع محبة علي وتقديمه على الصحابة فمن قدمه على أبي بكر وعمر فهو غال في تشيعه، ويطلق عليه رافضي، وإلا فشيعي فإن أضاف إلى ذلك السب، أو التصريح بالبغض فغال في الرفض. وإن اعتقد الرجعة إلى الدنيا فأشد في الغلو<\/p>\n<p style=\"text-align: justify;\">[Tashayyu` is loving `Ali and placing him over the companions, if one were to place him over Abu Bakr and `Umar, then he is described as Ghalee fil-Tashayyu` (Extreme Shia) and he is called Rafidhi, if he does not raise him over them then he is just a Shi`ee, if he swears against them and openly declares his hatred then he is Ghalee fil-Rafdh (Extreme Rafidhi). If he also believes in Raj`ah back to life on top of it, he becomes more extreme.]<\/p>\n<p style=\"text-align: justify;\">al-Dhahabi also says in his Siyar:<\/p>\n<p style=\"text-align: justify;\">ولكن من سكت عن ترحم مثل الشهيد أمير المؤمنين عثمان، فإن فيه شيئا من تشيع، فمن نطق فيه بغض وتنقص وهو شيعي جلد يؤدب، وإن ترقي إلى الشيخين بذم، فهو رافضي خبيث، وكذا من تعرض للامام علي بذم، فهو ناصبي يعزر، فإن كفره، فهو خارجي مارق، بل سبيلنا أن نستغفر للكل ونحبهم، ونكف عما شجر بينهم<\/p>\n<p style=\"text-align: justify;\">[If one remains silent and does not ask God to send his mercy on the martyr, Ameer al-Mu&#8217;mineen `Uthman ibn `Affan, then he has some Tashayyu` in him, if one were to disrespect him and spew hatred against him, then he is a strict Shi`ee and must be disciplined, if he goes further and criticizes the Shaykhayn then he is a sly Rafidhi, the same applies for he who insults `Ali, he is a Nasibi who must be disciplined, if he makes Takfeer on him then he is a Khariji Mariq. Our way (Ahlul-Sunnah) is to ask Allah to forgive them and to love all of them, and to cease from talking about their problems.]<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"><strong>7- CONCLUSION:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Praise be to God, there are several conclusions and we list them:<\/p>\n<p style=\"text-align: justify;\">a- By consensus `Asim and Hafs are two great Imams of Qira&#8217;at.<\/p>\n<p style=\"text-align: justify;\">b- The weakness attributed to Hafs is in regards to his skills as narrator, and the accusation of him being a liar is a baseless exaggeration.<\/p>\n<p style=\"text-align: justify;\">c- The rules for the authentication of a narrator in a Hadithi chain are different than the rules for the authentication of a Qur&#8217;ani recitation.<\/p>\n<p style=\"text-align: justify;\">d- `Asim bin abi al-Nujoud, Hafs bin Sulayman and Hamzah al-Zayyat are all great Imams of Ahlul-Sunnah, the Twelvers cannot prove that they were Rafidhi imami Shia neither through their books or ours.<\/p>\n<p style=\"text-align: justify;\">e- If they were to prove that they were Shia, the Shia of the time were Sunni in their worship, and even if they try their best to prove that they were Rafidhah, then even the Imamiyyah at the time had different sects all of them enemies who make Takfeer on each-other.<\/p>\n<p style=\"text-align: justify;\">f- The Shia in all their books do not have one solid Shia chain of Qur&#8217;an that reaches the Prophet (saw), as opposed to Ahlul-Sunnah who have many.<\/p>\n<p style=\"text-align: justify;\">g- Their attempt to steal the chains in the Sunni books and attribute them to themselves is pathetic and shows the weakness of their way.<\/p>\n<p style=\"text-align: justify;\">wal-Salamu `Aleykum,<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The Imami Shia of our time use many deceptive strategies in order to defend their beliefs, from these strategies is to accuse their opponents of defects that they themselves have. This tactic serves no purpose other than wasting time, it <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/12\/04\/quran-has-a-shia-chain-of-transmission\/\" title=\"Qur&#8217;an has a Shia chain of transmission?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,4],"tags":[],"class_list":{"0":"post-811","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-quran"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/811","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=811"}],"version-history":[{"count":12,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/811\/revisions"}],"predecessor-version":[{"id":1541,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/811\/revisions\/1541"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}