{"id":823,"date":"2013-12-07T02:24:20","date_gmt":"2013-12-07T02:24:20","guid":{"rendered":"http:\/\/twelvershia.net\/?p=823"},"modified":"2018-10-30T14:37:17","modified_gmt":"2018-10-30T14:37:17","slug":"issues-of-ghaybah-part-4","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/12\/07\/issues-of-ghaybah-part-4\/","title":{"rendered":"Issues of Ghaybah [Part-4] &#8211; Murtada’s philosophical excuses about the Imam’s birth"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=823\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and our prophet,<\/p>\n<p style=\"text-align: justify;\">In the name of the all powerful creator, this is the fourth part of this blessed series, may Allah increase these parts if he wills. Our topic this time is about the previous Shia sects who claimed their Imams to be the hidden Mahdi.<\/p>\n<p style=\"text-align: justify;\">Whenever an Imam would die, a big group of his followers would claim that he never actually died, he just went into hiding and is waiting for the right time to fill the earth with justice as it was filled with oppression.<\/p>\n<p style=\"text-align: justify;\">For example, we read in Tareekh al-Islam 9\/272:<\/p>\n<p style=\"text-align: justify;\">ذهبت طائفة من الجارودية وهم غلاة الرافضة إلى أن محمد بن عبد الله بن حسن القائم بالمدينة حي لم يقتل، وأنه لا يموت حتى تملأ الأرض عدلاً، يعني كما ملئت جوراً<\/p>\n<p style=\"text-align: justify;\">[A group from al-Jaroudiyyah, and they are extremist Rafidhah, then believed that Muhammad bin `Abdullah bin al-Hasan who rose in Madinah is alive and did not die, and that he does not die until he fills the earth with justice, meaning as it was filled with oppression.]<\/p>\n<p style=\"text-align: justify;\">Shia leader and philosopher al-Murtada in his book of Ghaybah wished to address this issue, so he tries to refute those who believe in the Ghaybah of ibn al-Hanafiyyah and Ja`far al-Sadiq and Musa al-Kadhim and the rest of the sects.<\/p>\n<p style=\"text-align: justify;\">He says in &#8220;al-Muqni`&#8221;:<\/p>\n<p style=\"text-align: justify;\">قلنا: كل من ذكرت لا يلتفت إلى قوله ولا يعبأ بخلافه، لأنه دفع ضرورة وكابر مشاهدة.<\/p>\n<p style=\"text-align: justify;\">لأن العلم بموت ابن الحنفية كالعلم بموت أبيه وإخوته صلوات الله عليهم.<\/p>\n<p style=\"text-align: justify;\">وكذلك العلم بوفاة الصادق عليه السلام كالعلم بوفاة أبيه محمد عليه السلام.<\/p>\n<p style=\"text-align: justify;\">والعلم بوفاة موسى عليه السلام كالعلم بوفاة كل متوفي من آبائه وأجداده وأبنائه عليهم السلام.<\/p>\n<p style=\"text-align: justify;\">فصارت موافقتهم في صفات الإمام غير نافعة مع دفعهم الضرورة وجحدهم العيان.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[We say: All those (sects) that you mentioned are to be ignored, because they opposed truth and stubbornly rejected what they witnessed.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>Because we know that ibn al-Hanafiyyah died just as we know his father and brothers died peace be upon them.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>Also we know of al-Sadiq&#8217;s (as) death just as we know of his father&#8217;s death.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>And we know of the death of Musa (as) as we know that of all his fathers and grandfathers and children (as).<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>So even if their descriptions fit those of the (12th) Imam, still it does not benefit them because they opposed clear truth and rejected what they themselves witnessed.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">al-Murtada&#8217;s argument as you can see, is that those other Mahdis are fake, because we know they died, and it was recorded in the books that they died or were killed.<\/p>\n<p style=\"text-align: justify;\">This is a weak argument, I say: First of all when the Shia are asked about the un-natural long life of their 12th Imam, they use as excuse the long life of `Isa (as) or the long life of al-Khidr (as). By the same token, I say it is also written in the Qur&#8217;an:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #003300;\"><strong>{And they did not kill him, nor did they crucify him; but [another] was made to resemble him to them. And indeed, those who differ over it are in doubt about it. They have no knowledge of it except the following of assumption. And they did not kill him, for certain.} [4:157]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">The comeback would be that what if they did not kill those Imams? What if Allah made it appear that Muhammad bin `Abdullah bin al-Hasan died to trick his enemies and grant him a safe escape?<\/p>\n<p style=\"text-align: justify;\">This is especially possible since the followers of those supposed Mahdis, they narrate from those same Imams narrations that support this, for example the Nawousiyyah, followers of Ja`far al-Sadiq, they  narrated from him that he said:<\/p>\n<p style=\"text-align: justify;\">إن رأيتم رأسي قد أهوى عليكم من جبل فلا تصدقوه<\/p>\n<p style=\"text-align: justify;\">[If you saw my head falling from a mountain then do not believe it.]<\/p>\n<p style=\"text-align: justify;\">And they narrated from him:<\/p>\n<p style=\"text-align: justify;\">إن جاءكم من يخبركم عني أنه مرضني وغسلني وكفنني فلا تصدقوه، فإني صاحبكم صاحب السيف<\/p>\n<p style=\"text-align: justify;\">[If one comes to you, telling you that he nursed me and washed me and shrouded me, do not believe him, I am your companion, the owner of the sword.]<\/p>\n<p style=\"text-align: justify;\">While the followers of Musa, the Waqifah, they narrated from his father al-Sadiq that he said:<\/p>\n<p style=\"text-align: justify;\">هو القائم المهدي، فإن هدهد رأسه عليكم من جبل فلا تصدقوا، فإنه القائم<\/p>\n<p style=\"text-align: justify;\">[He is al-Qa&#8217;im(the one who rises), so if his head tumbles down a mountain then do not believe it, for he is al-Qa&#8217;im.]<\/p>\n<p style=\"text-align: justify;\">These can be read in &#8220;Firaq al-Shia&#8221; which is a book written by al-Nawbakhti, one of the four emissaries of the Twelver Shia Mahdi.<\/p>\n<p style=\"text-align: justify;\">Now al-Murtada wants to address another issue, if the opponents want to accuse the Shia of also denying the truth, which is that the 11th Imam had no son, he argues back by saying:<\/p>\n<p style=\"text-align: justify;\">وإنما يرجع ذلك إلى الظن والإمارة، وأنه لو كان له ولد لظهر أمره وعرف خبره<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[It only goes back to speculation and guesswork, that if he had a son he should have appeared or heard from.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">al-Murtada means, that no one can deny the death of the previous Imams, as that is apparent and famous. Also no one can deny the birth of the 12th Imam, as there is no physical evidence that he was not born, denying his birth is only speculation, because he could have been born and then hidden. Whereas there is physical evidence of the death of previous Imams.<\/p>\n<p style=\"text-align: justify;\">I say: Back in the days when those people actually died, we know that some people rejected it, some claimed they weren&#8217;t dead and that they were all hidden Mahdies just like the Twelvers believe. For us and for al-Murtada, there is no physical evidence, since we only rely on the history books and narrations, and it is written in Tareekh al-Islam by al-Imam al-Dhahabi:<\/p>\n<p style=\"text-align: justify;\">فأما محمد بن الحسن هذا: فنقل أبو محمد بن حزم: أن الحسن مات عن غير عقب<\/p>\n<p style=\"text-align: justify;\">[As for this Muhammad ibn al-Hasan: al-Imam abu Muhammad ibn Hazm reported: That al-Hasan died with no progeny.]<\/p>\n<p style=\"text-align: justify;\">And<\/p>\n<p style=\"text-align: justify;\">وممن قال: إن الحسن العسكري لم يعقب: محمد بن جرير الطبري، ويحيى بن صاعد، وناهيك بهما معرفة وثقة<\/p>\n<p style=\"text-align: justify;\">[From those who said that al-Hasan al-`Askari did not have any offspring: Muhammad bin Jareer al-Tabari, and Yahya bin Sa`id (al-Hashimi), and they are sufficient for you in knowledge and reliability.]<\/p>\n<p style=\"text-align: justify;\">Based on this, I wish to say that the so called &#8220;Mahdies&#8221; that other Shia sects claimed before, at least we know for a fact that they were born, yet this 12th one is the only one whose birth is differed upon. For a person to be a &#8220;Mahdi&#8221; he needs to exist first, and all previous candidates have succeeded in this except this last one.<\/p>\n<p style=\"text-align: justify;\">What is even more ironic is what they reported in Tareekh al-Islam 20\/15:<\/p>\n<p style=\"text-align: justify;\">توفيّ فيها: أحمد بن منصور الرّماديّ، وإبراهيم بن الحارث البغداديّ، وإبراهيم بن هانيء النَّيسابوريّ، وسعدان بن نصر، وصالح بن أحمد بن حنبل، وعبد الله بن محمد بن أيوّب المُخرّميّ، وعلي بن حرب الطّائيّ، وأبو حفص النَّيسابوريّ الزاهد عمرو بن سلم، ومحمد بن الحسن العسكري من الإثني عشر، ومحمد بن هارون الفلاّس، وهارون بن سليمان الإصبهانيّ<\/p>\n<p style=\"text-align: justify;\">[Events of year 265:<\/p>\n<p style=\"text-align: justify;\">Those who died (this year) are: Ahamd bin Mansour al-Ramadi, and Ibrahim bin al-Harith al-Baghdadi, and Ibrahim ibn Hani&#8217; al-Naysaburi (&#8230;) and Muhammad bin al-Hasan al-`Askari from the Ithna-`Ashariyyah&#8230;]<\/p>\n<p style=\"text-align: justify;\">As for ibn Tayymiyah in his Minhaj al-Sunnah, he says:<\/p>\n<p style=\"text-align: justify;\">قد ذكر محمد بن جرير الطبري، وعبد الباقي بن قانع، وغيرهما من أهل العلم بالأنساب والتواريخ: أن الحسن بن علي العسكري لـم يكن له نسلٌ ولا عقب<\/p>\n<p style=\"text-align: justify;\">[Muhammad bin Jareer al-Tabari and `Abdul-Baqi ibn Qani` and others from the people of knowledge in genealogy and history stated: That al-Hasan bin `Ali al-`Askari, had no progeny or children.]<\/p>\n<p style=\"text-align: justify;\">Even his uncle Ja`far bin `Ali, whom the Shia called &#8220;Ja`far al-Kazzab&#8221;, he had a fight with the wife of al-Hasan al-`Askari after his death, this is because they wanted to divide the inheritance yet she claimed to be pregnant and that was a lie. This conflict lasted seven years until finally she was proven wrong and Ja`far took the inheritance with two brothers of his.<\/p>\n<p style=\"text-align: justify;\">Then for us and for al-Murtada, there is no physical evidence of the birth of the 12th Imam or the death of those who preceded him. How then can he claim with certainty the death of those who preceded their 12th when the majority of the Shia at one point were Waqifah who believed Musa never died? I go further to say, even if you saw him die, how can you be sure he died when you know that he is capable of miracles? If your refutation is that it defies nature for a human who died to come back to life, then our argument as well is that it defies human nature to live for more than 1,000 years.<\/p>\n<p style=\"text-align: justify;\">Then al-Murtada attack the Waqifah who were the majority of the Shia at one point and who were some of the most reliable of their scholars and narrators saying:<\/p>\n<p style=\"text-align: justify;\">وأما الواقفة فقد رأينا منهم نفرا شذاذا جهالا، لا يعد مثلهم خلافا، ثم انتهى الأمر في زماننا هذا وما يليه إلى الفقد الكلي، حتى لا يوجد هذا المذهب &#8211; إن وجد &#8211; إلا في اثنين أو ثلاثة على صفة من قلة الفطنة والغباوة يقطع بها على الخروج من التكليف<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[As for the Waqifah, we saw from them some odd ignorants, we cannot even consider them an opposition to us, and in this time they are almost non-existent -if they do- then only two or three dumb idiots who cannot be religiously accountable.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Then he goes on to describe the Twelvers as being by the thousands.<\/p>\n<p style=\"text-align: justify;\">I say: If the issue is about numbers then Ahlul-Sunnah outnumber the Twelvers by far and have always been majority. And if it is a matter of name calling, then you Twelvers are dumber than they are for believing in a kid that entered the cellar and disappeared for more than 1,200 years.<\/p>\n<p style=\"text-align: justify;\">Also just a while ago you were complaining and saying that we cannot deny the birth of the 12th Imam as this cannot be known for sure, so how can you deny the existence of the Waqifah and who knows maybe they outnumber you but are acting by Taqiyyah!?<\/p>\n<p style=\"text-align: justify;\">To sum this up, al-Murtada argues against his Shia opponents, that their Imams died as reported by some historians, this is why they cannot be the Mahdi. al-Murtada states that intellect proves that there must be an Imam at all times, thus 11th can&#8217;t have died without a son, and this son should have been dead by now. However Allah prolonged his life because there must always be an Imam, his example is that of `Isa (as) and Khidr (as) who are still alive.<\/p>\n<p style=\"text-align: justify;\">BUT<\/p>\n<p style=\"text-align: justify;\">How would this be any different if the opponent were to argue, that the dead Imam (ie Ja`far or Musa) were not actually dead? Because there is always need of an Imam so they can&#8217;t die, their example is that of `Isa (as), only made to appear dead to their enemies while they&#8217;re actually alive in Ghaybah?<\/p>\n<p style=\"text-align: justify;\">wal-Salam `Aleykum,<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon our nation and our prophet, In the name of the all powerful creator, this is the fourth part of this blessed series, may Allah increase <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/12\/07\/issues-of-ghaybah-part-4\/\" title=\"Issues of Ghaybah [Part-4] &#8211; Murtada’s philosophical excuses about the Imam’s birth\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-823","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/823","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=823"}],"version-history":[{"count":6,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/823\/revisions"}],"predecessor-version":[{"id":4426,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/823\/revisions\/4426"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=823"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=823"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=823"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}