{"id":830,"date":"2013-12-07T18:05:27","date_gmt":"2013-12-07T18:05:27","guid":{"rendered":"http:\/\/twelvershia.net\/?p=830"},"modified":"2018-10-30T14:37:38","modified_gmt":"2018-10-30T14:37:38","slug":"issues-of-ghaybah-part-5","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2013\/12\/07\/issues-of-ghaybah-part-5\/","title":{"rendered":"Issues of Ghaybah [Part-5] &#8211; Can the legitimacy of an Imam be proven in case of constant Taqiyyah?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=830\" alt=\"\" \/><\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Click<\/a> to see list of all articles from the <a href=\"http:\/\/www.twelvershia.net\/2015\/05\/10\/issues-of-ghaybah\/\">Ghaybah<\/a> series<\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: justify;\">Peace be upon our nation and Prophet,<\/p>\n<p style=\"text-align: justify;\">This article is extracted from a much bigger upcoming article on &#8220;Taqiyyah&#8221;, we found it relevant and important so we decided to make it a separate piece altogether.<\/p>\n<p style=\"text-align: justify;\">CAN THE LEGITIMACY OF AN IMAM BE PROVEN IN CASE OF CONSTANT TAQIYYAH?<\/p>\n<p style=\"text-align: justify;\">In the main Shia book al-Kafi, volume 1, page 284, we find a chapter called:<\/p>\n<p style=\"text-align: justify;\">“Affairs that necessitate the proof of the Imam (as)”<\/p>\n<p style=\"text-align: justify;\">By “proof” they mean how you prove that a certain person is a true Imam, because as you know anyone can claim to be an Imam and anyone can claim that anyone else is an Imam, and you can review our article called “Tree of men believed to be Imams by the Shia sects” in the respective section.<\/p>\n<p style=\"text-align: justify;\">So how do you truly prove the validity or legitimacy of an Imam?<\/p>\n<p style=\"text-align: justify;\">In this chapter I quote two authentic Shia narrations:<\/p>\n<p style=\"text-align: justify;\"><strong>[…`Abdul-A`la said: I told abu `Abdillah (as): “The one who rushes to claim Imamah for himself, how do we verify him?” He (as) replied: “He is asked about the lawful and the unlawful.” Then he turned to me and said: “There are three proofs that are not gathered in anyone unless he were the patron of this affair: he must be the closest of the people to the Imam before him; he must have possession of the weapon (of the prophet (saw)); and his Wasiyyah must be public and apparent – [so much so, that even] if one had entered Madinah and had asked the commoners and even the little boys, “Whom did fulan depute?”, they would say, “fulan the son of fulan”.]<\/strong><\/p>\n<p style=\"text-align: justify;\">The second authentic Shia narration:<\/p>\n<p style=\"text-align: justify;\"><strong>[…Ahmad bin `Umar from abi al-Hasan al-Rida (as) I asked him about the indicating signs of the patron of this affair. So he said: The indicating signs to him are: elderliness (i.e. the oldest living son), merit, and the testament – if men who traveled on horseback and came to Madinah and asked, “Whom did fulan depute?” it would be said “fulan the son of fulan”, and they follow wherever the armaments reside.]<\/strong><\/p>\n<p style=\"text-align: justify;\">Based on these narrations and other similar ones, the legitimacy of the Imamah of any person is proven if he gathered certain conditions, from them is that the people of Madinah, all of them, men women and children, must know that such and such is the Imam, and he deputed his son so and so after him and gave him the Wasiyyah.<\/p>\n<p style=\"text-align: justify;\">Question: We know that the main thing that pushes the Shia Imams to practice Taqiyyah is because they are afraid of the tyrant rulers, so they hide their Imamah and Wasiyyah out of fear. How then in this case, can the legitimacy of ANY of the Shia Imams be proven if they hide it from the people?<\/p>\n<p style=\"text-align: justify;\">In fact it is proven from many Shia texts and by confession of their scholars that the Imams would hide the matter of Imamah from their closest followers and this is why even their best companions would be confused as to who is the next Imam after the death of his father.<\/p>\n<p style=\"text-align: justify;\">If this is the case, then how can the little boys of Madinah have knowledge of this matter, so that when the riders come and ask them they say: “So and so is the Imam and he appointed his son so and so as his depute and successor”!?<\/p>\n<p style=\"text-align: justify;\">I add, if the Imams do not hide the matter of Imamah and Wasiyyah, then why do they hide smaller insignificant matters? The books of the Shia are full of contradicting Fiqhi narrations, and other narrations which differ with the beliefs of the Twelvers, their scholars explain all of this as “Taqiyyah”.<\/p>\n<p style=\"text-align: justify;\">If the Shia were to say that the Imams practice Taqiyyah in small Fiqhi matters so they can mingle with the commoners and laypeople of Ahlul-Sunnah, we reply by saying that Ahlul-Sunnah and their scholars had many differences of opinions in many matters of Fiqh. The biggest of the Sunni Imams differed, we take an extreme example, the marriage of Mut`ah: This was the opinion of `Abdullah ibn `Abbas (ra) and Imam ibn Jurayj (rah), yet no one harmed or killed them.<\/p>\n<p style=\"text-align: justify;\">What is known and popular is that the Imams of the Shia are loved by the Sunni laymen and their problem is not that of Fiqh, because they were not killed one after the other because of silly Fiqhi issues such as:<\/p>\n<p style=\"text-align: justify;\">Al-Sadiq was asked about the ruling of the urine of the wild cat, the dog, the donkey and the horse. He replied: “They are like the urine of humans.”<\/p>\n<p style=\"text-align: justify;\">Al-Tusi said in al-Istibsar 1\/180: “It’s also possible that these are a type of Taqiyyah.”<\/p>\n<p style=\"text-align: justify;\">Al-Baqir said: “There is no harm in the blood of the flea and the urine of the bat.”<\/p>\n<p style=\"text-align: justify;\">Al-Tusi said in al-Istibsar 1\/188: “We consider this narration as a kind of Taqiyyah as it conflicts with the foundations of (the Shia) Madhab.”<\/p>\n<p style=\"text-align: justify;\">Our point is that the Imams surely do not give precedence to silly matters such as “praying while wearing the skin of the fox” or “washing the clothes after touching the urine of bats” over a giant and dangerous matter such as Imamah, which means “Leadership” in Arabic.<\/p>\n<p style=\"text-align: justify;\">Rather the Shia Imams were killed mainly because of Imamah as the Shia claim, and they were killed by the oppressive rulers and regimes. This happened because they feared that these divinely appointed Imams would challenge them and overthrow them, not because of differences of opinion in jurisprudence, taking into consideration that the Shia accuse these rulers of being irreligious, and that they would drink wine openly.<\/p>\n<p style=\"text-align: justify;\">In addition, when the Shia leader al-Murtada was asked about the occultation of the Mahdi, in his book “al-Muqni` fil-Ghaybah” he said that the Mahdi hid himself out of fear from the rulers, so a man asked him:<\/p>\n<p style=\"text-align: justify;\">“If fear pushed him into hiding, then his fathers (previous Imams) were in a state of constant Taqiyyah and fear from the enemies, why didn’t they also hide!?”<\/p>\n<p style=\"text-align: justify;\">He replied:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\"><strong>[We say: His fathers peace be upon them had no fears from the enemy, because they practiced Taqiyyah, and did not act as if they were the Imams, and they denied that they were Imams.]<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #333333;\">Which is true, when we observe the confusion of their followers and companions at the time, and when we read their narrations about Imamah, such this narration from Basa’ir al-Darajat by al-Saffar pg.48:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #333333;\">[Verily, our &#8216;affair&#8217; is a secret in a secret, and a concealed secret, and a secret that is only known as a secret, and a secret upon a secret and a secret veiled by a secret.]<\/span><\/p>\n<p style=\"text-align: justify;\">Or such as when Musa al-Kadhim (rah) is talking to his companion, in the famous narration of Hisham ibn Salim, that describes the confusion of the Shia after the death of al-Sadiq (rah), he tells him:<\/p>\n<p style=\"text-align: justify;\">[‘Ask, you will have the answers but do not make them public. If you did so it would be slaughtering.’ I asked him and found him to be like an ocean of knowledge that does not diminish. I then said, ‘May Allah keep my soul in service for your cause, your Shi‘a, followers and the followers of your father are in loss due to false guidance. Thus, can I meet them and call them to you? I will keep it secret.’ He said, ‘If you can find intelligent people inform them but make them to promise secrecy. If they make it public it will be slaughter,’ he pointed with his hand to his throat.]<\/p>\n<p style=\"text-align: justify;\">Our question still remains, if Imamah and Wasiyyah is shrouded by so much secrecy, then how can the little boys and commoners of Madinah know about it? And how then would we be able to prove the legitimacy of their Imamah by their own standards?<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>Click to see list of all articles from the Ghaybah series &nbsp; Peace be upon our nation and Prophet, This article is extracted from a much bigger upcoming article on &#8220;Taqiyyah&#8221;, we found it relevant and important so we decided <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2013\/12\/07\/issues-of-ghaybah-part-5\/\" title=\"Issues of Ghaybah [Part-5] &#8211; Can the legitimacy of an Imam be proven in case of constant Taqiyyah?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3905,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,5],"tags":[16],"class_list":{"0":"post-830","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-imamah","9":"tag-mahdi"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/830","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=830"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/830\/revisions"}],"predecessor-version":[{"id":4427,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/830\/revisions\/4427"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3905"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=830"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=830"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}