{"id":857,"date":"2014-01-06T15:06:10","date_gmt":"2014-01-06T15:06:10","guid":{"rendered":"http:\/\/twelvershia.net\/?p=857"},"modified":"2017-02-21T12:05:38","modified_gmt":"2017-02-21T12:05:38","slug":"response-to-who-believes-the-quran-has-been-a-victim-of-tahreef-part-1","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/01\/06\/response-to-who-believes-the-quran-has-been-a-victim-of-tahreef-part-1\/","title":{"rendered":"Response to: Who Believes the Qur’an has been a Victim of Tahreef? Part 1."},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=857\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to the article on ShiaPen entitled: <strong>Who Believes the Qur’an has been a Victim of Tahreef? Part 1: The Shia Position, which can be found <a href=\"http:\/\/www.shiapen.com\/comprehensive\/tahreef.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">The lengthy article by ShiaPen, formerly known as Answering-Ansar, is one of the most comprehensive studies from a Shia perspective on the matter of Tahreef. For years, it has been quoted over and over again in other articles, forums, and social media. By the grace of Allah, this refutation to their article will respond to the points raised by ShiaPen, clear misconceptions, and answer the questions that have been asked by readers throughout the years. Due to the length of the article, we will be splitting it into two parts. The first will focus on the Shia position regarding the opinion of the fabrication that took place with the Qur’an, and the second will focus on defending the Sunni position, and that they did not hold this view.<br \/>\nIn the preface, ShiaPen bring up three points:<\/p>\n<blockquote><p><span style=\"color: #800000;\">1- First Point: No one amongst the Shia ulema claimed his hadith book as 100 % correct<\/span><br \/>\n<span style=\"color: #800000;\"> 2- Second Point: One cannot accuse an author of ascribing to Tahreef because he recorded such traditions in his book<\/span><br \/>\n<span style=\"color: #800000;\"> 3- Third Point: It is unjust to attribute the belief of an individual to that of an entire same sect<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">We are in agreement with ShiaPen on the second and third point since these points are fair. However, we have an issue with the first point. ShiaPen themselves are aware that there are Shia Ulema who have viewed their books as authentic. If we go to Chapter 5 of the article, we find ShiaPen quoting Al-Shaikh Al-Bahboodi, the author of Saheeh Al-Kafi. So, how is it that ShiaPen can claim that no scholar has written such a book when they themselves quote from one of the Saheeh Shia books?! Furthermore, the Twelver Shia Akhbari sect as a whole believes in the authenticity of everything in those early books like Al-Kafi and Al-Faqeeh. Al-Hurr Al-Amili aggressively argues that the narrations in those books are all authentic, and spends twenty six pages arguing for this opinion. In other words, such an opinion cannot be dismissed in its entirety. In other words, if one were to quote a narration from one of those books to the Akhbari, then it is binding upon them. As for the Usoolis, then they are obligated to look up the authenticity of that specific narration.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then outlined the reasons as to why a narration, even if authentic, is still to be rejected:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The scholars have mentioned the following arguments in order to support their stance:<\/span><br \/>\n<span style=\"color: #800000;\"> 1. It is proved from authentic and Mutawatir sources that Quran had already been complied during the time of Holy Prophet (s) and hadiths which shows distortion in Quran are in opposition to this fact. Such hadiths being in contradiction to the cited fact is itself a proof that such hadiths have been fabricated.<\/span><br \/>\n<span style=\"color: #800000;\"> 2. Such hadiths are in contradiction to the following verse of Holy Quran: “Certainly We revealed the Reminder and certainly We shall preserve it.” (The Holy Qur’an 15: 9) and the hadith which is in contradiction to Quran is to be thrown away.<\/span><br \/>\n<span style=\"color: #800000;\"> 3. These hadiths which show distortion in Quran are very less in number while the hadiths which shows Quran being protected from distortion are Mutawatur and prominent, moreover these hadiths are strong in respect of arguments and proof as compared to the former.<\/span><br \/>\n<span style=\"color: #800000;\"> 4. Hadiths which shows distortion in Quran are very scarce, whereas the verses of Quran being actually Quranic can be proved from authentic and confirmed hadiths. Therefore the verses which such hadiths claimed to be Quranic or being part of Quran in fact do not prove so. How can Shia Ulema rely on these doubtful hadiths while some of the Shia Ulema have advanced the view that reports narrated from single source do not have the capability of being proof and even if we uphold the their authority then singularly narrated report can be a proof in only such a situation where it is useful to be practiced at the required place\/time specially we cannot rely on singularly narrated reports in respect of ‘beliefs’ due to the fact the belief are maintained on the basis of knowledge and certainty.<\/span><\/p>\n<p style=\"text-align: justify;\">These opinions would be fine if the narrations were really as rare and few as ShiaPen make them out to be. Al-Majlisi, in his commentary on Al-Kafi’s hadith that the Qur’an was originally seventeen thousand verses, in Mir&#8217;aat al-`Uqoul comments:<\/p>\n<p style=\"text-align: justify;\">فالخبر صحيح ولا يخفى أن هذا الخبر وكثير من الأخبار الصحيحة صريحة في نقص القرآن وتغييره، وعندي أن الأخبار في هذا الباب متواتر المعنى<br \/>\n[The narration is authentic, and it is clear that this narration and many of the authentic narrations are clear that the Qur’an has been shortened and changed, and I hold that the narrations of this meaning are Mutawatir in meaning.]<\/p>\n<p style=\"text-align: justify;\">Al-Shaykh al-Mufid writes in Awa&#8217;il al-Maqalaat page 80:<\/p>\n<p style=\"text-align: justify;\">إن الأخبار قد جاءت مستفيضة عن أئمة الهدى من آل محمد (ص)، باختلاف القرآن وما أحدثه بعض الظالمين فيه من الحذف والنقصان<br \/>\n[A huge amount of narrations have reached us from the Imams of guidance from Aal-Muhammad (saws), about the difference in the Qur&#8217;an and what some of the oppressors did to it from deletions and additions.]<\/p>\n<p style=\"text-align: justify;\">This opinion is supported by Al-Nuri Al-Tabrasi’s compilation in which he collected over a thousand Shia reports that suggest that the Qur’an has been tampered with. So, the opinion by ShiaPen these narrations are few in number is a gross understatement.<\/p>\n<p style=\"text-align: justify;\">Note: The term Mutawatir means that the narrations are so major in number that they cannot be denied.<\/p>\n<p style=\"text-align: justify;\">As for the verse: {Certainly We revealed the Reminder and certainly We shall preserve it.} (The Holy Qur’an 15: 9)<\/p>\n<p style=\"text-align: justify;\">This can easily be interpreted by those Shia that believe in the corruption of the Qur’an to mean that it has been preserved in the hearts of the Imams, and is currently with the Mahdi, for the corruption of the book in the hands of some does not mean that the Qur’an is not preserved.<\/p>\n<p style=\"text-align: justify;\">As an example, the Shia leader and philosopher al-Shaykh al-Mufid (d.413 hijri) when asked about the Qur&#8217;an in al-Masa&#8217;il al-Sarawiyah page 78 &#8211; the ninth issue:<\/p>\n<p style=\"text-align: justify;\">[There is no doubt, that what is between the two covers of the Quran, its whole content is Allah’s words and revelation (1), there is nothing from the words of mankind in it and it is the majority of the revelation (2).<br \/>\nAnd the rest of what was revealed by Allah most high is with the guardian of Shari`ah, the preserver of Ahkaam, none of it was lost (3). Although the one who has gathered what is found between the two covers today (4), has not included it along with what he collected (5) for some reasons that caused him to do so, such as:<br \/>\nHis inability to know parts of it.<br \/>\nAnd: His doubt and uncertainty concerning it.<br \/>\nAnd: What he purposely kept out of it. (6)<br \/>\nAmeer al-Mu&#8217;mineen (as) had gathered the revealed Qur&#8217;an from beginning to end, and he compiled it the way it should have been, placing the Makki before the Madani, and the abrogated before the abrogation, and he placed everything in its correct location. (7)<br \/>\nThis is why Ja`far bin Muhammad al-Sadiq (as) said: &#8220;By Allah if the Qur&#8217;an was recited as it was revealed you would have found our names in it just as those before us were named.&#8221; (8)<br \/>\nAnd he (as) said: &#8220;The Qur&#8217;an was revealed four parts, a quarter about us, a quarter about our enemies, a quarter are Sunan and examples, and a quarter is obligatory duties and rulings, and for us Ahlul-Bayt are the best parts.&#8221; (9)<br \/>\nHowever, it was authentically narrated from our Imams (as) that they were ordered to recite what is in between the two covers, and to not exceed it by addition or subtraction, until al-Qa&#8217;im rises, then he will recite for the people the Qur&#8217;an as Allah revealed it and as was gathered by Ameer al-Mu&#8217;mineen (10).]<\/p>\n<p style=\"text-align: justify;\">If we were to add our own footnotes to further explain what al-Mufid meant:<\/p>\n<p style=\"text-align: justify;\">(1) He means all that is found in our present Qur&#8217;an are true words of Allah, obviously he doesn&#8217;t mean this is ALL the Qur&#8217;an. It means he doesn&#8217;t believe in additional Tahreef.<br \/>\n(2) Notice he says &#8220;Jumhour&#8221; meaning MOST of the revelation, not all of it.<br \/>\n(3) Meaning the rest of what was revealed is with the guardian, he most probably means the Mahdi.<br \/>\n(4) Meaning the first three Khulafa&#8217; that collected the Qur&#8217;an we have today.<br \/>\n(5) He claims these Caliphs never included the &#8220;rest of what was revealed&#8221; for their own personal\/political reasons.<br \/>\n(6) As you can see, he claims the Caliphs didn&#8217;t know parts of the Qur&#8217;an, so they missed them, they had doubts about other parts, so they skipped them, and finally they intentionally removed some parts.<br \/>\n(7) He&#8217;s telling us that the correct Qur&#8217;an that contains everything was only gathered by `Ali, and obviously we all know the story they narrate about the Caliphs rejecting his Qur&#8217;an.<br \/>\n(8) al-Mufid believes the names of the Imams are mentioned in the correct Qur&#8217;an.<br \/>\n(9) al-Mufid believes that half of the Qur&#8217;an talked about the Imams and their enemies, this part was omitted by the Caliphs.<br \/>\n(10) He believes the Mahdi will reveal the true Qur&#8217;an later.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We testify in the name of Allah (swt) that we believe in the present Quran being perfect; with neither anything missing from it nor any thing added to it. Right from “Bismillah” till “Walnaas”, we Shia also believe in the same Quran which Ahle Sunnah do and accusing us for having faith on the deletion or addition in Quran by the Sahaba worshippers is totally wrong and an out and out lie.<\/span><\/p>\n<p style=\"text-align: justify;\">There are no reasons to doubt the intentions of ShiaPen. They appear to be sincere in their words and have put a major effort into defending the Shia madhhab from such claims. It should be apparent to all that this is not their view. However, there is little doubt that many Shia scholars, early and late, did believe in this. Continue reading for the evidences of such.<\/p>\n<p style=\"text-align: justify;\">ShiaPen deviate slightly off-topic and argue the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Those accusing Shias of practicing Taqiyyah while they actually testify to the authenticity of Quran are Mushriks for two reasons<\/span><br \/>\n<span style=\"color: #800000;\"> Some Nasibi mullahs just feed their followers to use the card of Taqiyyah against Shias on their testimony about the authenticity of Holy Quran. What they do not tell their adherents is the actual meaning of Taqiyyah. Taqiyyah is to hide one’s belief when there is genuine fear of life like someone is physically and literally forcing you or putting sword on your neck to utter what you do not really believe else he could put your life to an end. The Nawasib who on the internet or in their books reject the testimony of Shias about the authenticity of Holy Quran by accusing them for practicing Taqiyyah and hiding their actual belief are in fact Mushriks (polytheist) because of the following two reasons:<\/span><br \/>\n<span style=\"color: #800000;\"> 1. They possess some self-proclaimed supernatural ability to enter computer or book from one side and come in and exit in a manner that enables them to literally force the Shia to bear testimony about the authenticity of Quran (whilst practicing Taqiyyah).<\/span><br \/>\n<span style=\"color: #800000;\"> 2. They are indirectly claiming to possess knowledge of unseen like Allah (swt), despite the distance of millions of miles through their x-ray vision that enables them to ascertain actual Shia beliefs by examining their hearts through from which they can confidently conclude that the Shias are practicing Taqiyyah and don’t actually believe in the completeness of the Quran.<\/span><br \/>\n<span style=\"color: #800000;\"> Had this been the era of the Imams of the Nawasib Muawyah or Yazeed wherein Shias were under oppression and aggression then methodology might have worked, fortunately we are living in an entirely new world today.<\/span><\/p>\n<p style=\"text-align: justify;\">Our response: We agree with ShiaPen that Sunnis should not hold the view that most Shias hold the view that the Qur’an is corrupted, but it seems that the majority of Shias today sincerely do not believe in this. However, ShiasPen has made an absurd claim that Taqiyyah is only limited to periods of fear and danger. This is not the case. This is off-topic, we find it sufficient to point readers to Faisal Noor’s Al-Taqiyyah wal Wajh Al-Aakhir, who has collected many quotes from scholars and evidences from authentic Shia hadiths that suggest that Taqiyyah can be practiced at all times, even when there aren&#8217;t any signs of danger around.<br \/>\nIf the authors of ShiaPen are not aware of this fact, then they should not be publishing articles on Tashayyu in the first place.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continue to quote a Sunni who has invited the Shias to make Takfeer upon those that held the belief that the Qur’an has been tampered with. ShiaPen responded:<\/p>\n<blockquote><p><span style=\"color: #800000;\">Invitation to Nawasib that Umar and Ayesha also believed in the distortion of Quran<\/span><br \/>\n<span style=\"color: #800000;\"> Had this alleged Maulana read the major Tafseers of Ahle Sunnah like Tafseer al Itqan, Tafseer Dur Manthoor, Tafseer Tabari without the shackles of Nasbism &amp; Yazeedism he would have known that amongst the claimants of distortion in Quran are Umar, Usman, their sons, Ayesha, other Sahaba, Tabayen and many Sunni ulema. If cursing and declaring those people who believed in the distortion of Quran as kaffirs makes one’s faith more strong and pure then Nawasib should initiate this noble cause, by issuing takfeer, cursing and publicly dissociating themselves from the above mentioned culprits.<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">We say: Sunnis will gladly make Takfeer on any individual that believes in the Tahreef of the Qur’an if such claims are correct. In the following chapters we shall examine whether these views that have been attributed to the noble Sahaba above are accurate or not.<br \/>\nUnfortunately, ShiaPen will not be so willing to follow in our footsteps since some of the major scholars of Tashayyu hold this opinion.<br \/>\nIn the next portion of the article ShiaPen several evidences for the authenticity of the Qur’an.<\/p>\n<p style=\"text-align: justify;\">list of evidences, goes as follows:<\/p>\n<blockquote><p><span style=\"color: #800000;\">Evidence one: Verses of the Holy Quran reject any possibility of distortion in it<\/span><br \/>\n<span style=\"color: #800000;\"> Evidence two: Hadiths from the Holy Prophet (s) and Imams (as)<\/span><br \/>\n<span style=\"color: #800000;\"> Type One: Hadiths that require the Quran to judge the Hadith itself<\/span><br \/>\n<span style=\"color: #800000;\"> Type Two: Hadith Thaqlain<\/span><br \/>\n<span style=\"color: #800000;\"> Type Three: Traditions about earning rewards for reciting the complete Surah in prayers<\/span><br \/>\n<span style=\"color: #800000;\"> Type Four: Hadith instructing us to refer to the Quran<\/span><br \/>\n<span style=\"color: #800000;\"> Type Five: Referring to different verses of the Holy Quran<\/span><br \/>\n<span style=\"color: #800000;\"> Type Six: Hadiths that conform that the present Quran is correct<\/span><br \/>\n<span style=\"color: #800000;\"> Type Seven: Hadiths demonstrating that the Quran was compiled during lifetime of the Prophet (s)<\/span><br \/>\n<span style=\"color: #800000;\"> Type Eight: Tradition “the Book of Allah is sufficient for us”<\/span><br \/>\n<span style=\"color: #800000;\"> Evidence Three: Ijma<\/span><br \/>\n<span style=\"color: #800000;\"> Evidence Four: The Salat (Prayer) of the Shia Ithna Ashari<\/span><br \/>\n<span style=\"color: #800000;\"> Evidence Five: The special treatment afforded to the Quran by the Prophet (s) and his companions<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">Many of these evidences prove the authenticity of the Qur’an, which is the correct opinion of course. However, some Shia scholars did not accept these evidences as sufficient. For example, they would argue that there is no Ijma’a (consensus) in the matter, and that the form of corruption that has occurred in the Qur’an has to do with the removal of verses, which means that it is fine to recite verses from the current Qur’an in prayer.<\/p>\n<p style=\"text-align: justify;\">We show an example again from the same scholar we quoted above, al-Mufid in Awa&#8217;il al-Maqalaat, when speaking about the belief in additions to the Qur&#8217;an says:<\/p>\n<p style=\"text-align: justify;\">فالوجه الذي أقطع على فساده أن يمكن لأحد من الخلق زيادة مقدار سورة فيه على حد يلتبس به عند أحد من الفصحاء، وألا الوجه المجوز فهو أن يزاد فيه الكلمة والكلمتان والحرف والحرفان وما أشبه ذلك مما لا يبلغ حد الإعجاز، و يكون ملتبسا عند أكثر الفصحاء بكلم القرآن، غير أنه لابد متى وقع ذلك من أن يدل الله عليه، ويوضح لعباده عن الحق فيه، ولست أقطع على كون ذلك بل أميل إلى عدمه وسلامة القرآن عنه، ومعي بذلك حديث عن الصادق جعفر بن محمد (ع)، وهذا المذهب بخلاف ما سمعناه عن بني نوبخت &#8211; رحمهم الله &#8211; من الزيادة في القرآن والنقصان فيه، وقد ذهب إليه جماعة من متكلمي الامامية و أهل الفقه منهم والاعتبار.<br \/>\n[The form (of Tahreef) that I consider to be false with certainty, is if one of the people was able to add (to the Qur&#8217;an) the amount of a chapter (Surah), in a way that even the Arab linguists would be fooled by it. As for the form that is possible, is if one or two words or letters were added in a way that it would not alter its miraculous nature, and it would fool most of the Arab linguists who specialize in the Qur&#8217;an. However, if this does happen then Allah has to point it out, and clarify its truth,  and I do not believe this with certainty but I only lean towards the safety of the Qur&#8217;an from such (additions). And I have to back this a Hadith from al-Sadiq Ja`far bin Muhammad (as), and this is in opposition to what we heard from (the people of) bani Nawbakht may Allah have mercy on them, who believed in the additions to the Qur&#8217;an as well as the deletion from it, A group of the speakers and the people of Fiqh and value from among the Imamiyyah believed this.]<\/p>\n<p style=\"text-align: justify;\">As the reader can see here, al-Mufid when talking about the issue of additions to the Qur&#8217;an, says that he doesn&#8217;t believe anyone can add a chapter, but he believes that words can be added to the Qur&#8217;an without anyone noticing as long as Allah points to it. The biggest issue here is that he says that he &#8220;leans towards it&#8221;, meaning that it can actually happen and it&#8217;s just some minor issue that you can lean towards without being certain. Another huge issue is that he says that a group of the big Shia scholars believed in additions to the Qur&#8217;an and to deletions, from them he mentions bani Nawbakht whom he sends mercy upon, and describes the others as the speakers and jurists and those of great value from among the Imamiyyah.<\/p>\n<p style=\"text-align: justify;\">As for those readers who do not know Bani Nawbakht, they are Persians whose grandfather is the famous Nawbakht, al-Sayyid Ibn Tawous the Shia said in his book Faraj al-Humoum pg.40:<\/p>\n<p style=\"text-align: justify;\">بنو نوبخت من أعيان هذه الطائفة المحقة المرضية ومنهم وكيل مولانا المهدي صلوات الله عليه أبوالقاسم الحسين بن روح رضوان الله جل جلاله عليه<br \/>\n[Banu Nawbakht are from the masters of this (Shia) righteous sect, and from them is the emissary of Mawlana the Mahdi (as), he is abu al-Qasim al-Husayn bin Rouh may God&#8217;s blessings be with him. ]<\/p>\n<p style=\"text-align: justify;\">And ibn Tawous also said:<\/p>\n<p style=\"text-align: justify;\">وهذا مذهب جمهور متكلمي أهل العدل واليه ذهب بنو نوبخت رحمهم الله من الامامية وأبو القاسم وأبو علي من المعتزلة كيف ذكر ان هذا مذهب جمهور متكلمي أهل العدل، فمن ذا يرغب بنفسه عن مذهب أهل العدل الا سقيم العقل بعيد من الفضل<br \/>\n[This is the way of the majority of the speakers from the people of justice (Shia), and it is the way of banu Nawbakht may Allah have mercy on them from the Imamiyyah, and abu al-Qasim, and abu `Ali from the Mu`tazillah. So whoever rejects the way of the people of justice is one of corrupt mind and no virtue.]<\/p>\n<p style=\"text-align: justify;\">We go back to what we were saying,<\/p>\n<p style=\"text-align: justify;\">It is not our intention to play the devil’s advocate, but we simply want readers to be aware that the view amongst Twelvers that the Qur’an has been corrupted does have weight and arguments. Refer to Fasl Al-Khitab by Al-Nuri Al-Tabrasi for further reading on the subject. We would also like to point out that we disagree with opinion that ShiaPen shared that Ali compiled the Qur’an during the life of the Prophet (salalahu alaihi wa salam), and we will show that even Shia scholars like Al-Faidh Al-Kashaani denied this.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continues by providing quotes from Shia scholars that support the opinion that the Qur’an is free from corruption.<br \/>\nWe agree with ShiaPen with some of the clear opinions that they have shared. However, there is doubt about some others.<br \/>\nShiaPen started off by quoting the opinions of four major early scholars, Al-Saduq, Al-Mufeed, Al-Tusi, and Al-Murtadha.<br \/>\nWe are in agreement with ShiaPen that three of those scholars did not hold the view that the Qur’an has been tampered with.<\/p>\n<p style=\"text-align: justify;\">Al-Nuri Al-Tabrasi, in Fasl Al-Khitab, when sharing the opinions of the scholars on the matter of Tahreef said:<br \/>\nالثاني: عدم وقوع النقص والتغيير فيه، وإن جميع ما نزل على رسول الله صلى الله عليه وآله هو الموجود بأيدي الناس فيما بين الدفتين، وإليه يذهب الصدوق في عقائده، والسيد المرتضى، وشيخ الطائفة في التبيان، ولم يعرف من القدماء موافق لهم.<\/p>\n<p style=\"text-align: justify;\">[Secondly: (The opinion that) the Qur’an is complete and free of change and that all that was revealed onto the Messenger of Allah (salalahu alaihi wa aalih) is in the hands of the people, between two covers. This is the opinion of Al-Saduq in his Aqa’id, Al-Sayid Al-Murtadha, the Shaikh of the Ta’ifah in Al-Tibyan, and nobody else from the early scholars agreed with them.]<\/p>\n<p style=\"text-align: justify;\">Sunni scholar and Imam and expert in Islamic sects Ibn Hazm (d. 456 AH) says something similar in al-Fasl fil-Milal wal-Nihal 4\/182:<\/p>\n<p style=\"text-align: justify;\">ومن قول الإمامية كلها قديماً وحديثاً أن القرآن مبدل زيد فيه ما ليس منه، ونقص منه كثير، وبدل منه كثير، حاشا علي بن الحسن (الحسين .ظ) بن موسى ابن محمد بن إبراهيم بن موسى بن جعفر بن محمد بن علي بن الحسن (الحسين .ظ) بن علي بن أبي طالب. وكان إمامياً يظاهر بالاعتزال مع ذلك. فإنه كان ينكر هذا القول، ويكفر من قاله. وكذلك صاحباه أبو يعلى ميلاد الطوسي، وأبو القاسم الرازي<br \/>\n[And from the saying of all the Imamiyyah recently and in the past, is that the Qur&#8217;an is changed, some additions were added to it that were not from it, and a lot of it is missing, except for `Ali bin al-Hasan bin Musa bin Muhammad bin Ibrahim bin Musa bin Ja`far bin Muhammad bin `Ali bin al-Husayn bin `Ali bin abi Talib (meaning al-Murtada). He was an Imami who is openly Mu`tazili but he denied this belief and accused those who hold it of Kufr, and so did his two companions abu Ya`la Milad al-Tusi and abu al-Qasim al-Razi.]<\/p>\n<p style=\"text-align: justify;\">It is good to note that Ibn Hazm was living in their period and debating them so he is very familiar with what they believed back then.<\/p>\n<p style=\"text-align: justify;\">As we can see, Al-Tabrasi did not include the name of Al-Mufid. ShiaPen though, wish to free Al-Mufid from this opinion. They quoted:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Sheikh al Mufid (rah) further says:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"> أن الذي بين الدفتين من القرآن جميعه كلام الله و تنزيله، و ليس فيه شي‏ء من كلام البشر و هو جمهور المنزل<\/span><br \/>\n<span style=\"color: #800000;\"> “Verily what is between the two covers of the Quran its whole content is Allah’s words and revelation, there is nothing from the words of mankind in it and its entirety is the revelation of Allah”<\/span><br \/>\n<span style=\"color: #800000;\"> 1. Mirat ul-Uqool, Volume 1, page 171.<\/span><br \/>\n<span style=\"color: #800000;\"> 2. al-Mesael al-Surweya, by Sheikh al Mufid, page 78<\/span><\/p>\n<p style=\"text-align: justify;\">This quote is not complete and there exists a mistranslation. The full quote can be read above as we already translated it in its entirety.<\/p>\n<p style=\"text-align: justify;\">Carrying on, ShiaPen quote the opinion of Ali bin Ahmad Al-Tabrasi:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The author of Tafseer-e-Majma’ ul-Bayan, Allamah Ali bin Ahmed Tabrisi says:<\/span><br \/>\n<span style=\"color: #800000;\"> “Anything about the alleged additions made to the Quran are wrong and void anyway. With regards to the reduction from the Quran, some people from the Hashwia sect have narrated that changes and lapses have occurred in the Holy Quran, but we the Shia are opposed to this belief, that is we believe that no reduction has been made to the Holy Quran, ‘Ilm ul-Huda Syed Murtadha has said the same too, and this is a simple and clear statement, hopefully you people have come to know that the Shia belief is against any reduction or addition to the Holy Quran.”<\/span><br \/>\n<span style=\"color: #800000;\"> 1. Tafseer Majma’ ul-Bayan, page 5.<\/span><br \/>\n<span style=\"color: #800000;\"> 2. Tafseer al-Safi, page 13.<\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen are correct that `Ali bin Ahmad Al-Tabrasi is also against the view of the corruption of the Qur’an. However, ShiaPen have tampered with his quote, but Allah decided expose them.<\/p>\n<p style=\"text-align: justify;\">The correct quote goes as follows:<br \/>\nوأما النقصان منه : فقد روى جماعة من أصحابنا ، وقوم من حشوية العامة ، أن في القرآن تغييرا أو نقصانا<br \/>\n[With regards to the reduction from the Qur’an, a group of our companions narrated, as well as some from the Hashawia of the `Aamah, that the Qur’an has been tampered with and shortened.]<\/p>\n<p style=\"text-align: justify;\">Why did ShiaPen remove the part about Shia scholars believing in this? How can someone know that he is a liar and still claim truth is beyond me.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continue by mentioning quotes from a few other scholars, one of whom is Al-Tuni:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In his book “Al Wafia fil Usool” page 148 states:<\/span><br \/>\n<span style=\"color: #800000;\"> “It is popular that the Quran is still protected as it was revealed and is still recited in the same manner. No changes have taken place to it. Allah (swt) protected it and revealed:<\/span><br \/>\n<span style=\"color: #800000;\"> “Surely We have revealed the Reminder and We will most surely be its guardian”<\/span><\/p>\n<p style=\"text-align: justify;\">This quote does not portray the opinion of Al-Tuni. Rather, his opinion is ambiguous. The full goes is as follows:<\/p>\n<p style=\"text-align: justify;\">وقد وقع الخلاف في تغييره : فقيل : إن فيه زيادة ونقصانا ، وبه روايات كثيرة ، رواها الكليني، وعلي بن إبراهيم في تفسيره. والمشهور : أنه محفوظ ومضبوط كما أنزل ، لم يتبدل ولم يتغير ، حفظه الحكيم الخبير ، قال الله تعالى : ( إنا نحن نزلنا الذكر وإنا له لحافظون . والحق : أنه لا أثر لهذا الاختلاف ، إذا الظاهر تحقق الاجماع على وجوب العمل بما في أيدينا ، سواء كان مغيرا أو لا ، وفي بعض الاخبار تصريح بوجوب العمل به إلى ظهور القائم من آل محمد عليهم السلام.<br \/>\n[There is a difference of opinion regarding the alterations: It is said: There is an addition and a subtraction (of content), and there are many narrations like that, which are narrated by Al-Kulaini and Ali bin Ibrahim in his Tafseer. The popular opinion is that it is still protected as it was revealed and is still recited in the same manner. No changes have taken place in it. Allah (swt) protected it and revealed:“Surely We have revealed the Reminder and We will most surely be its guardian.”<\/p>\n<p style=\"text-align: justify;\">In truth: The difference of opinion has no effect since it seems that there is a consensus that we are to practice (our religion) with that which we have, whether it is tampered with or not, and in some narrations, it is clear that we are to practice according to it until Al-Qa’im from the Aal of Mohammad appears.]<\/p>\n<p style=\"text-align: justify;\">Notice how ShiaPen does not share the full opinion of Al-Tuni and that he states that there is a difference of opinion and that some narrations state that we are to practice the Qur’an until the full Qur’an is revealed by the Mahdi.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then goes onto to share the opinion of Al-Faidh Al-Kashaani:<\/p>\n<blockquote><p><span style=\"color: #800000;\">Allamah Mohsin Faiz Kashani who according to the Akhbari scholar Yusuf Al-Bahrani was an Akhbari (Lu’lu’atul-Bahrain page 121). Our readers should be reminded that amongst the practices of the Akhbariyah is the duty to accept all hadiths which have been attributed to the Holy Prophet (s) and the Imams (s) irrespective of their credibility. Returning to the discussion Shaikh Faiz Kashani is the author of Tafseer al-Safi and al Waafi and recorded traditions about tahrif in his works from Muhaditheen like Shaykh Kauleni, Ayashi etc and wrote a paragraph which Nawasib happily quote:<\/span><br \/>\n<span style=\"color: #800000;\"> And as for the belief of our scholars in this matter, the apparent regarding Al-Kulayni is that he believed in tahreef and deletion of the Quran, as he has related narrations to this effect in his book Al-Kafi and did not disagree with such narrations, as he said at the beginning of his book that he believes in what he narrates therein.<\/span><br \/>\n<span style=\"color: #800000;\"> What Nawasib cunningly do not quote is the very next and important sentence of Shaykh Faiz Kashani:<\/span><br \/>\n<span style=\"color: #800000;\"> والصحيح من مذهب أصحابنا خلافه وهو الذي نصره المرتضى رضي الله عنه واستوفى الكلام فيه غاية الاستيفاء في جواب المسائل الطرابلسيات<\/span><br \/>\n<span style=\"color: #800000;\"> “The correct view of the people of our sect is against that and that is what Al-Murtadha (R.A) confirmed explicitly in its explanation in his answers to ‘Al-Mesael Al-Tarabulseat’.”<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">Ironically, this is not the opinion of Al-Faidh Al-Kashaani. He is quoting Al-Tabrasi, the author of Majma’a Al-Bayaan.<br \/>\nHe then quotes Al-Tabrasi’s view that the Qur’an was protected since there was a need by the people to protect it, but soon after, plays the devil’s advocate by suggesting that one can argue that those that tampered with it felt a need to do so as well. Furthermore, he adds:<\/p>\n<p style=\"text-align: justify;\">أما كونه مجموعا في عهد النبي ( صلى الله عليه وآله وسلم ) على ما هو عليه الآن فلم يثبت وكيف كان مجموعا وإنما كان ينزل نجوما وكان لا يتم الا بتمام عمره .<br \/>\n[There is no proof for the opinion that it was collected during the life of the Prophet (salalahu alaihi wa aalih) in its current state, and how is that possible when the it was revealed in periods and incomplete until the very end of his days?!]<br \/>\nHe also says shortly after:<\/p>\n<p style=\"text-align: justify;\">أقول : يكفي في وجوده في كل عصر وجوده جميعا كما أنزله الله محفوظا عند أهله ووجود ما احتجنا إليه منه عندنا وإن لم نقدر على الباقي كما أن الإمام ( عليه السلام ) كذلك فان الثقلين سيان في ذلك .<br \/>\n[I say: It is sufficient that it exists at all times, in full, in the form that it was revealed by Allah, preserved with its Ahl, and that we have access to what we need from it, even if we didn&#8217;t have access to the rest of it, similar to the Imam&#8217;s (as) condition, so the <a href=\"http:\/\/twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\" rel=\"external nofollow\">Thaqalayn<\/a> are alike in that sense.]<\/p>\n<p style=\"text-align: justify;\">In other words, Al-Faidh is admitting that the complete Qur&#8217;an is present at all times with it&#8217;s rightful owner, the Mahdi. As for us, we have what is sufficient from it for our needs, even if some of it is missing. The he compares the belief that some of the Qur&#8217;an is missing to the belief that the present Imam is also missing. This is a clear statement about the man&#8217;s beliefs concerning our Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">The clearest Al-Faidh has been was in this in the following paragraph:<\/p>\n<p style=\"text-align: justify;\">أقول : المستفاد من مجمع هذه الأخبار وغيرها من الروايات من طريق أهل البيت ( عليهم السلام ) إن القرآن الذي بين أظهرنا ليس بتمامه كما انزل على محمد ( صلى الله عليه وآله وسلم ) منه ما هو خلاف ما أنزل الله ومنه ما هو مغير ومحرف وإنه قد حذف عنه أشياء كثيرة منها اسم علي ( عليه السلام ) في كثير من المواضع ومنها غير ذلك وأنه ليس أيضا على الترتيب المرضي عند الله وعند رسوله صلى الله عليه وآله وسلم. وبه قال علي بن إبراهيم قال في تفسيره&#8230;<br \/>\n[I say (Al-Faidh): What is taken from these reports and others from the paths of Ahlulbayt (as) is that the Qur’an that is amongst us is not in its full form like the way it was revealed upon Muhammad (salalahu alaihi wa aalih), some of it is in contradiction with what was revealed by Allah, and some is changed and tampered with and much of it was deleted, like the name of Ali (as) in many parts, and other things, and that it is not in the correct order that Allah and His Prophet (salalahu alaihi wa aalih) are satisfied with, and this opinion is shared by Ali bin Ibrahim in his Tafseer…]<\/p>\n<p style=\"text-align: justify;\">ShiaPen attempt to argue this by quoting the following:<\/p>\n<blockquote><p><span style=\"color: #800000;\">He further says:<\/span><br \/>\n<span style=\"color: #800000;\"> “If the present Quran isn’t as much as it was when revealed, then nothing from the Quran remains Hujjah.”<\/span><br \/>\n<span style=\"color: #800000;\"> Tafseer al-Safi, volume 1 page 33.<\/span><br \/>\n<span style=\"color: #800000;\"> He goes on to further elaborate:<\/span><br \/>\n<span style=\"color: #800000;\"> “If the Quran is incomplete or has additions, then the order of obedience to the Quran, and the instruction to attach oneself to it becomes redundant.”<\/span><br \/>\n<span style=\"color: #800000;\"> He then affirmed his belief about the completeness of Quran by citing the Quran:<\/span><br \/>\n<span style=\"color: #800000;\"> In additional Allah (swt) said: ’Most surely it is a Mighty Book Falsehood shall not come to it from before it nor from behind it and said Surely We have revealed the Reminder and We will most surely be its guardian.’ So how can it be corrupted and changed?<\/span><br \/>\n<span style=\"color: #800000;\"> He further says:<\/span><br \/>\n<span style=\"color: #800000;\"> “When numerous Ahadith have been narrated from the Prophet (s) whereby the reliability of the narrations may be assessed against their conformance with the Quran, and their non-reliability can be ascertained from their opposition to the Quran. If the Quran is considered altered, then what would be the use in forwarding such narrations?”<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">What ShiaPen doesn’t realize, or rather, realizes but is trying to hide, is that Al-Faidh here is playing the devil’s advocate. He then says:<\/p>\n<p style=\"text-align: justify;\">ويخطر بالبال في دفع هذا الاشكال والعلم عند الله أن يقال : إن صحت هذه الأخبار فلعل التغيير إنما وقع فيما لا يخل بالمقصود كثير إخلال كحذف اسم علي وآل محمد ( صلى الله عليهم ) ، وحذف أسماء المنافقين عليهم لعائن الله فإن الانتفاع بعموم اللفظ باق وكحذف بعض الآيات وكتمانه فان الانتفاع بالباقي باق مع أن الأوصياء كانوا يتداركون ما فاتنا منه من هذا القبيل ويدل على هذا قوله ( عليه السلام ) في حديث طلحة : إن أخذتم بما فيه نجوتم من النار ودخلتم الجنة فإن فيه حجتنا وبيان حقنا وفرض طاعتنا .<br \/>\n[What comes to mind is an answer to respond to the problems (mentioned above), and knowledge is with Allah: If these reports of fabrication are authentic, then it means that the alteration occurs in places that do not change the meaning much, like the deletion of the name of Ali and Aal Mohammad (salalahu alaihim), and the removal of the names of the hypocrites, may Allah damn them, but the benefit from the general verses are still there.  Similarly, is the removal of some verses and hiding them, for we can still gain benefit with the rest,  although the Awsiya’a (Imams) used to have what we missed from it. This is supported by his statement (as) in the Hadith of Talha: If you adhere to what is found therein, then you are saved from Hell fire and you will enter heaven, for in it are our proofs and our rights and the obligation to follow us.]<\/p>\n<p style=\"text-align: justify;\">Al-Faidh also gives additional possibilities like that these narrations are referring to the removal of commentary and the Tahreef of meaning.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then demonstrates poor comprehension skills when attempting to defend Al-Majlisi. They argued:<\/p>\n<blockquote><p><span style=\"color: #800000;\">Shaykh Baqar Majlisi is also a prominent Shia scholar who Nawasib allege believe in Tahreef of the Quran and they base their proof on the statement of Shaykh Baqar Majlisi wherein he said that some of (Shia) traditions on Tahreef are Mutawatur (Mir’atul-Uqool, Vol 12 page 525). What these people deliberately avoid citing is the similar statement of Shaykh Majlisi written in Mir’atul-Uqool, Vol 3 page 31 wherein he says such traditions from both Shia and Sunni texts are Mutawatur .<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">As we can see from the text, Al-Majlisi clearly believes in Tahreef and that narrations that support this are Mutawatir.<br \/>\nThen ShiaPen attempted to explain it away with the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“If someone advance his doubts over present Quran being the actual book of Allah (swt) when there exist many traditions according to which the Imams (as) recited verses of the Quran in a manner that are different from the existing Quran for example “Ye are the best of Imams, evolved for mankind” , “Thus We have appointed you a middle Imams” and “They ask you the windfalls” &#8211; reply of such notion will be the same as already cited i.e these traditions that are counted amongst the ‘Akhbar Ahad’ and when they are (measured) against Quran then their authenticity is unsure therefore we do not rely on such traditions and haven’t abandoned whatever is found in the present Quran because we have been ordered to act upon it …”<\/span><br \/>\n<span style=\"color: #800000;\"> Bihar al Anwar, Volume 89 page 75<\/span><\/p>\n<p style=\"text-align: justify;\">The above is merely a quote by Al-Mufid. These are not the views of Al-Majlisi. Al-Mufid and his book are mentioned one page prior to this quote. He was simply answering the question if it was possible to replace the content of the Qur&#8217;an with what is found in some Shia narrations.<\/p>\n<p style=\"text-align: justify;\">The Rafidhi continues:<\/p>\n<blockquote><p><span style=\"color: #800000;\">At another place whilst explaining the verse 15:9, Shaykh Baqair Majlisi advanced his unequivocal belief in the authenticity of the Quran in the following manner:<\/span><br \/>\n<span style=\"color: #800000;\"> ” إنا نحن نزلنا الذكر ” أي القرآن ” وإنا له لحافظون ” عن الزيادة والنقصان والتغيير والتحريف<\/span><br \/>\n<span style=\"color: #800000;\"> “We have revealed the Reminder” means the Quran “and We will most surely be its guardian” from addition, loss, change and Tahreef.<\/span><br \/>\n<span style=\"color: #800000;\"> Bihar al-Anwar, Volume 9 page 113.<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">The Tafaseer found on these pages are not by Al-Majlisi, rather, these are taken from Majma’a Al-Bayan by Al-Tabrisi. This is obvious by comparing the contents of the chapters with what is in Majma’a Al-Bayan. See the commentary and comparisons of the editor to the book of Tafseer as well.<\/p>\n<p style=\"text-align: justify;\">ShiaPen also quote:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In his another book Mirat al-Uqool, Volume 2 page 273, Shaykh Baqar Majlisi stated:<\/span><br \/>\n<span style=\"color: #800000;\"> ليعلم أن للقرآن حملة يحفظونه عن التحريف في كل زمان<\/span><br \/>\n<span style=\"color: #800000;\"> “It must be known that in every era, there are people who protect Quran from Tahreef”<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #333300;\"> This is similar to the view shared by Al-Faidh Al-Kashaani above. The Imams preserved the Qur’an for all the ages and that it is with them. It is not necessary to infer from the statement above that the preserved Qur’an has reached the hands of the general populace.<\/span><\/p>\n<p style=\"text-align: justify;\">ShiaPen then move on towards the next scholar that they wish to defend, Al-Hurr Al-Amili:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The author of Al-Wasa’il, Shiekh Muhammad bin al-Hasan bin al-Hurr al-’Aamili believed:<\/span><br \/>\n<span style=\"color: #800000;\"> “One who ponders into the traditions and chapters of history will certainly know that the Quran is present at the highest stage of being Tawatur and there were plenty of Sahaba who were Hafid and Qaris of the Quran…”<\/span><br \/>\n<span style=\"color: #800000;\"> Al Fasul al Muhimmah fi Talif al Ummah, page 166.<\/span><\/p>\n<p style=\"text-align: justify;\">It is a pity that Al-Hurr Al-Amili doesn’t have a book by that name. ShiaPen are actually quoting Sharaf Al-Deen Al-Musawi’s book. Al-Hurr Al-Amili’s book is called Al-Fusool Al-Muhima fi Usool Al-A’ima, ignorance knows no bounds.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then continue with their shenanigans:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The belief of Allamah Abul-Qasim al-Qumi (d. 1231 H)<\/span><span style=\"color: #800000;\"> “Syed Murtadha, Sheikh Saduq, Allamah Tabrisi and the entire sect and the Mujtahideen believe that the Quran has not been distorted.”<\/span><span style=\"color: #800000;\"> Qawaneen al-Usool, page 315.<\/span><\/p>\n<p style=\"text-align: justify;\">The full quote is as follows:<\/p>\n<p style=\"text-align: justify;\">لأول انهم اختلفوا في وقوع التحريف والنقصان في القرآن وعدمه فعن أكثر الأخباريين أنه وقع فيه التحريف والزيادة والنقصان وهو الظاهر من الكليني رحمه الله وشيخه علي بن إبراهيم القمي رحمه الله والشيخ أحمد بن أبي طالب الطبرسي رحمه الله صاحب الاحتجاج وعن السيد والصدوق والمحقق الطبرسي وجمهور المجتهدين رحمهم الله تعالى و [sic]عدمه<br \/>\n[Firstly, there was a difference of opinion as to whether Tahreef and reduction in the Qur’an occurred or didn’t. Most of the Akhbariyeen held the view that there is Tahreef and addition and deletion, and that is apparent from Al-Kulayni (may Allah have mercy on them) and his shaikh Ali bin Ibrahim Al-Qummi (may Allah have mercy on them) and Al-Shaikh Ahmad bin Abi Talib Al-Tabrasi (may Allah have mercy on them) the author of Al-Ihtijaaj, and as for Al-Sayyed and Al-Saduq and Al-Muhaqiq Al-Tabrasi and most of the Mujtahideen (may Allah have mercy on them) didn’t believe it to be so.]<\/p>\n<p style=\"text-align: justify;\">Notice how he wishes mercy upon those who he believes held the opinion that the Qur’an has been tampered with. That&#8217;s a huge issue, as they don&#8217;t see it as much of a problem if one were to hold the belief that the Qur&#8217;an is corrupt, for them it is simply a legitimate point of view that has no effect on a man&#8217;s faith.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then point out that:<\/p>\n<blockquote>\n<p style=\"text-align: left;\"><span style=\"color: #800000;\">We have obviously left out the Akhbari scholars from the list and haven’t commented on their remarks and they include Al-Jazairi, Abu al-Hassan al-Amili, Syed Adnan al-Bahraini, Yusuf al-Bahraini etc.<\/span><\/p>\n<p>&nbsp;<\/p><\/blockquote>\n<p style=\"text-align: justify;\">They apparently did this because the quotes from these men about Tahreef were too clear to twist.<\/p>\n<p style=\"text-align: justify;\">As much as we at TwelverShia enjoy quoting texts from Shia scholars that indicate their view of Tahreef, we would like to point out that Shia scholars themselves have already done the job for us. We suggest for interested readers a valuable book, regardless of its small size, called: Who Accuses the Twelver Shia Scholars of Tahreef? In this book, the author, Abdulrahman bin Aadam, quotes late scholars who have attributed this view to the early scholars. The book includes a decent amount of scans as well.<\/p>\n<p style=\"text-align: justify;\">For example, the author quotes Al-Majlisi’s view in Mir’aat Al-Uqool 3\/30 that Al-Kulaini and Al-Mufeed believe that what we have in the Mushaf are only portions of the Qur’an.<\/p>\n<p style=\"text-align: justify;\">Another example includes a scan from Al-Durar Al-Najafiya 4\/65-66 in which he attributes these beliefs to Al-Kulaini, Ali bin Ibrahim, Al-Mufeed, Al-Tabrasi the author of Al-Ihtijaaj, and Abdullah bin Salih Al-Bahrani.<\/p>\n<p style=\"text-align: justify;\">Most importantly perhaps are the views of Al-Nuri Al-Tabrasi, who included a huge list of scholars that believed in Tahreef until the third introduction in his book (p. 26-32). The list includes: Mohammad bin Al-Hasan Al-Sairafi, Mohammad bin Khalid Al-Barqi, Al-Fadhl bin Shathaan, Ahmad bin Mohammad bin Khalid Al-Barqi, Ali bin Al-Hasan bin Fidhal, Mohammad bin Hasan Al-Saffar, Sa’ad bin Abdullah Al-Qummi, Isma’eel bin Nawbakht, Al-Hasan bin Musa Al-Nawbakhti, Ali bin Ibrahim Al-Qummi, Al-Ayyashi, Al-Kulaini, Abu Qasim Al-Nawbakhti, Ibn Al-Hajjam, Al-Nu’mani, Furat Al-Kufi, Ali bin Ahmad Al-Kufi, Al-Sayyari, Al-Mufeed, Ishaaq Al-Kaatib, Ibn Shahrashoub, Hasan bin Sulaiman Al-Hilli, Hajib bin Al-Laith, Ahmad bin Abi Talib Al-Tabrasi, Ali bin Tawuus, Mohammad bin Hasan Al-Shaybani, Mohammad Taqiuddin Al-Majlisi, Al-Mazindrani, Ali Khan, Mohammad Baqir Al-Majlisi, Al-Nabati Al-Amili, Mohammad bin Ali Al-Maqabi, Al-Bahbahani, Mohammad Mahdi bin Abi Dhar Al-Najafi, Muhsin Al-Kathimi, Jawad Ali Redha Al-Najafi, Ahmad bin Mohammad Mahdi Al-Naraqi, and Murtadha Mohammad Ameen Murtadha Al-Ansari.<\/p>\n<p style=\"text-align: justify;\">The book includes a list of forty six Shia scholars who have been accused of holding the opinion of Tahreef, and that they have been accused of this by Shia scholars themselves. So it is a must read for anyone interesting in the matter.<\/p>\n<p style=\"text-align: justify;\">Towards the end of the chapter, we find the following argument by ShiaPen:<\/p>\n<blockquote><p><span style=\"color: #800000;\">What about those who believed in Tahreef?<\/span><br \/>\n<span style=\"color: #800000;\"> Amongst the different objections that come from Nawasib and some contemporary Sunnies are two connected questions:<\/span><br \/>\n<span style=\"color: #800000;\"> 1. Why have the Shia Ulema never issued takfeer against that small number of scholars that ascribed to Tahreef<\/span><br \/>\n<span style=\"color: #800000;\"> 2. Why have later Ulema not only praised them but quoted their works.<\/span><br \/>\n<span style=\"color: #800000;\"> For such an objection we would like to ask a question:<\/span><br \/>\n<span style=\"color: #800000;\"> “Why do you not examine the contents in your own garden in the first instance? Who on earth has given you the right to point out fingers at others for a matter that grows abundantly in your own garden?”<\/span><br \/>\n<span style=\"color: #800000;\"> It is well known that Sahabah and Tabeeen used to deny and change some verses of the Quran (Majum’ Fatawa Vol 12 page 492-493), Ayesha used to recite some words in verse 2:238 which we can’t locate today and not only that, she insisted that the Prophet (s) used to recite it with those particular words (Sahih Muslim Book 004, Number 1316), Abi bin Kaab got furious at Umar who would recite verse 100 of Surah Taubah differently (Tafseer Dur e Manthur, Vol 3 page 269) etc. We have dedicated three chapters in this article for such Sunni references where you will find plenty of Sahabah that believed in the version of verses of Quran that differ from the present form.<\/span><br \/>\n<span style=\"color: #800000;\"> In accordance with the question thrown as us, have such inquisitors abandoned their relationship with all those Sahabah and issued takfeer against them? If they haven’t done it so to date, they should steer clear from posing such questions until they implement it in their own house.<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">Once again, we have no issue about making Takfeer upon anyone who holds such a belief, no matter who holds it. We only wish that ShiaPen would do the same. Soon, we shall examine the argument brought against the scholars of Ahlulsunnah to see how these accusations fall flat.<br \/>\nIn the next section of the article, ShiaPen list out the narrations that suggest Tahreef:<\/p>\n<blockquote><p><span style=\"color: #800000;\">Chapter Five: Analyzing some of the Shia reports about Tahreef<\/span><br \/>\n<span style=\"color: #800000;\"> In this chapter we shall examine those Shia traditions that infer tahreef. After citing such hadiths we will present the views of Shia scholars about them and shall evidence that they are insufficient to prove distortion of Quran. Having cited the interpretations, reasonings and rejections presented by Shia Ulema about some of the hadiths on the topic it will be very easy for a person to decide about other such traditions. There are different groups of hadiths which suggest a distortion in the Quran.<\/span><\/p><\/blockquote>\n<p style=\"text-align: justify;\">ShiaPen did a decent task of breaking down the weak traditions that suggest this. However, they have missed out on a good number of authentic traditions that are clear about Tahreef.<br \/>\nWe at TwelverShia have collected some of the most authentic narrations that suggest Tahreef and we would like to share them with ShiaPen, you can read some samples in the second part of our old article here:<\/p>\n<p style=\"text-align: justify;\"><a href=\" http:\/\/twelvershia.net\/2013\/06\/12\/475\/\"><strong>Response to: Proof of Leadership With Divine Authority in the Words of Allah (swt) and His Messenger (saw)<\/strong><\/a><\/p>\n<p style=\"text-align: justify;\">As for the rest, we will InshaAllah gather many in an upcoming article if Allah wills.<\/p>\n<p style=\"text-align: justify;\">In addition to these reports, there are hundreds of narrations that can only be found in the books of `Ali al-Qummi and the book of Al-Sayyari. However, as Al-Khoei has stated from what ShiaPen has quoted, there is a consensus among Rijal scholars that he is a weak narrator.<br \/>\nIronically, in this day and age, there are those that defend Al-Sayyari like Ayatollah Mohammad Al-Sanad who followed Al-Nuri Al-Tabrisi in his opinion. They both argued that Al-Sayyari was relied upon in his narrations by Al-Kulaini, Al-Barqi, Ibrahim bin Mohamad bin Abdullah, Al-Hasan bin Ali bin Ibrahim, Sa’ad bin Abdullah Al-Ash’ari, and many others, and therefore, should not be seen as a weak narrator. Al-Sanad also argued that Al-Sayyari was weakened because people didn’t like his narrations and could not grasp them. See p. 342-349 from Al-Ijtihad wal Taqleed fi Ilm Al-Rijal by Al-Sanad for details on why he believes that this man is reliable.<br \/>\nIn the next chapter, ShiaPen respond to points that are raised by their opponents. Hopefully they will attempt to respond to our points as well.<br \/>\nIn part two of our response, we will go through the arguments that ShiaPen uses to attempt to prove that Sunnis believe in Tahreef. The article can be found here.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to the article on ShiaPen entitled: Who Believes the Qur’an has been a Victim of Tahreef? Part 1: The Shia Position, which can be found here. The lengthy article by ShiaPen, formerly known as Answering-Ansar, is <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/01\/06\/response-to-who-believes-the-quran-has-been-a-victim-of-tahreef-part-1\/\" title=\"Response to: Who Believes the Qur’an has been a Victim of Tahreef? Part 1.\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3818,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[4],"tags":[53],"class_list":{"0":"post-857","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-quran","8":"tag-tahreef"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/857","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=857"}],"version-history":[{"count":13,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/857\/revisions"}],"predecessor-version":[{"id":2751,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/857\/revisions\/2751"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3818"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=857"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=857"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}