{"id":885,"date":"2014-01-28T18:40:18","date_gmt":"2014-01-28T18:40:18","guid":{"rendered":"http:\/\/twelvershia.net\/?p=885"},"modified":"2014-01-28T18:40:18","modified_gmt":"2014-01-28T18:40:18","slug":"a-chain-of-narrators-composed-solely-of-ahlul-bayt","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/01\/28\/a-chain-of-narrators-composed-solely-of-ahlul-bayt\/","title":{"rendered":"A chain of narrators composed solely of Ahlul-Bayt?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=885\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">A person may ask, is there a chain solely composed of members of Ahlul-Bayt? The Twelvers in al-Kafi for instance claim they have chains from Ahlul-Bayt. However, it is no secret that those who narrated these chains were not from Ahlul-bayt including the author Kulayni himself.<\/p>\n<p style=\"text-align: justify;\">\n&#8220;So is there such a chain?&#8221;<\/p>\n<p>The answer is YES.<\/p>\n<p style=\"text-align: justify;\">Kitab al-Ahkam fil-Halal wal-Haram, vol.1, pages: 454-455, by al-Imam al-Hadi al-Sayyid Yahya ibn al-Husayn al-Hasani (rah), it is a book of Islamic jurisprudence, so when commenting on the ruling of one who divorces thrice he says:<\/p>\n<p style=\"text-align: right;\"><strong>ولا أعلم أحدا خالف ما روي وقيل به من ذلك، غير هذا الحزب حزب الشيطان الخاسر الهالك عند الله الجاير المحل للشهوات المتبع اللذات المبيح للحرمات الآمر بالفاحشات، الواصف للعبد الذليل بصفة الواحد الجليل القائل على الله عزوجل بالمحال، المتكمه في الظلال، المنكر للتوحيد، المشبه لله المجيد، بالضعيف من العبيد، المبطل في ذلك لعدة الزوجات، الدافع لما أثبت الله عزوجل من الاسباب والوراثات، المخالف لكتاب الله عزوجل في كل الحالات، الذي عاند الحق واتبع المنكر والفسق، حزب الامامية الرافضة للحق والمحقين، الطاعنة على أولياء الله المجاهدين الذين أمروا بالمعروف الاكبر ونهوا عن التظالم والمنكر، وقول هؤلاء الامامية الذين عطلوا الجهاد وأظهروا المنكر في البلاد والعباد، وأمنوا الظالمين من التغيير عليهم، ومكنوهم من الحكم فيهم وصاروا لهم خولا وجعلوا أموال الله بينهم دولا، وكفروا من جاهدهم، وعلى ارتكاب المنكر ناصبهم، وقول هذا الحزب الضال، مما لا يلتفت إليه من المقال لما هم عليه من الكفر والايغال، والقول بالكذب والفسوق والمحال، فهم على الله ورسوله في كل أمر كاذبون ولهما في كل أفعالهم مخالفون، قد جاهروهما بالعصيان وتمردوا عليهما بالبغي والطغيان وأظهروا المنكر والفجور، وأباحوا علانية الفواحش والشرور، وناصبوا الآمرين بالحسنات المنكرين للمنكر والشرارات الائمة الهادين من أهل بيت الرسول المطهرين، وهتكوا يالهم الويل الحرمات وأماطوا الصالحات وحرضوا على امانة الحق وإظهار البغي والفسق، وضادوا الكتاب وجانبوا الصواب وأباحوا الفروج، وولدوا الكذب والهروج، وفيهم ما حدثني أبي وعماي محمد والحسن عن أبيهم القسم بن ابراهيم صلوات الله عليهم أجمعين عن أبيه عن جده ابراهيم بن الحسن عن أبيه عن جده الحسن بن علي بن أبي طالب عن أبيهم علي بن أبي طالب عليه وعليهم السلام عن النبي صلى الله عليه وعلى آله وسلم أنه قال: يا علي يكون في آخر الزمان قوم لهم نبز يعرفون به يقال: لهم الرافضة فإن أدركتهم فاقتلهم قتلهم الله فإنهم مشركون<\/strong><\/p>\n<p style=\"text-align: right;\">\n<p style=\"text-align: justify;\"><strong>[I do not know anyone who opposed what was narrated or said regarding the matter (of divorce), except this sect, the party of the devil, the losers who perished in the sight of Allah, the oppressive party who legalize and follow lustful desires, who permit what is forbidden by ordering adultery. The party who ascribes to the weak slave the qualities of the one great God, the party blinded by the shadows, the party denying monotheism, the party that likens Allah the glorious to the weak slaves, those who abolish the `Iddah of the wives, those who reject what Allah ordered from Asbab and Warithaat, those who oppose the book of Allah in all matters, those who stubbornly reject truth then follow sinfulness and wrong-doing, the party of the Imamiyyah the Rafidhah who reject the truth and its people, the sect that criticizes the friends of Allah the Mujahideen who enjoin what is good and forbid from evil and oppression. The opinion of those Imamiyyah who halted Jihad and spread corruption in the lands and between the slaves, and assured the oppressors of their safety and that they won&#8217;t be overthrown, and they allowed them to rule and became their support and obtained from their riches, at the same time declaring Kufr on those who rebelled against the rulers. The opinion of this deviant party is ignored, because of their blasphemy and extremism and their lying and sinfulness, they lie against Allah and his messenger (saw) in every matter and oppose them, they openly and loudly disobey them and rebel against them with audacity and tyranny and transgression. They openly allow wrong-doing and evil, they become enemies of those who order the good deeds and oppose the evils, enemies of the guided Imams of the purified Ahlul-Bayt of the messenger (saw). Woe to them! They violated what is sacred, concealed all goodness and incited against truth, then they opposed the book, avoided the truth and permitted the forbidden relations, causing chaos and deceit. Concerning them is what my father told me and my two uncles Muhammad and al-Hasan, from his father, from his grandfather, from Ibrahim bin al-Hasan, from his father, then from his grandfather al-Hasan bin `Ali, from his father `Ali ibn abi Talib, from the Prophet (saws) that he said: &#8220;O `Ali, there will be at the end of times people who hold the title &#8220;al-Rafidhah&#8221;, if you ever live to meet them then kill them -May Allah kill them- for they are polytheists.&#8221;]<\/strong><\/p>\n<p style=\"text-align: justify;\">The author of this early classical book of Fiqh is none other than al-Hadi Yahya bin al-Husayn bin al-Qasim al-Rassi ibn Ibrahim Tabataba ibn Isma`eel al-Hashimi ibn Ibrahim bin al-Hasan bin al-Hasan bin `Ali ibn abi Talib (rah).<\/p>\n<p style=\"text-align: justify;\">It was also quoted and authenticated in al-Masalik fi Dhikr al-Naji min al-Firaq wal-Halik, pg.397, by al-`Allamah Yahya bin al-Husayn bin al-Qasim bin Muhammad bin `Ali bin Muhammad bin `Ali bin al-Rasheed bin Ahmad bin al-Ameer Husayn bin `Ali bin Yahya bin Muhammad bin Yusuf al-Asghar bin al-Qasim bin Yusuf al-Akbar bin al-Mansour Yahya bin al-Nasir Ahmad bin al-Hadi Yahya bin al-Husayn bin al-Qasim al-Rassi ibn Ibrahim Tabataba ibn Isma`eel al-Hashimi ibn Ibrahim bin al-Hasan bin al-Hasan bin `Ali ibn abi Talib (rah).<\/p>\n<p style=\"text-align: justify;\">The Zaydi Shia `Allamah ibn al-Wazir in his book &#8220;Ithar al-Haqq `ala al-Khalq&#8221;, pg.382, said: &#8220;I do not know for the rulings (Ahkaam) a connected chain of Ahlul-Bayt (as) except this one, others are Mursal or Maqtou` or containing narrators not from Ahlul-Bayt (as). I decided to mention this honorable chain because of the greatness of its narrators, as for the other narrations I have summed up their chains.&#8221;<\/p>\n<p style=\"text-align: justify;\">As the reader can see, this is a chain composed of members of Ahlul-Bayt (as), the author who is al-Hadi Yahya bin al-Hasan was the ruler of Yemen at the time before he was ousted by the Qaramitah, al-Imam al-Dhahabi said in his Tareekh that he died in 298 AH and that he was a man of goodness.<\/p>\n<p style=\"text-align: justify;\">In the end, it is ironic that Ahlul-Bayt (as) are usually the ones who refute the Imami Rafidhah and expose their lies, so praise be to Allah for his infinite wisdom.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>A person may ask, is there a chain solely composed of members of Ahlul-Bayt? The Twelvers in al-Kafi for instance claim they have chains from Ahlul-Bayt. However, it is no secret that those who narrated these chains were not from <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/01\/28\/a-chain-of-narrators-composed-solely-of-ahlul-bayt\/\" title=\"A chain of narrators composed solely of Ahlul-Bayt?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1,5],"tags":[],"class_list":{"0":"post-885","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith","9":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/885","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=885"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/885\/revisions"}],"predecessor-version":[{"id":887,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/885\/revisions\/887"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=885"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}