{"id":908,"date":"2014-02-14T14:22:30","date_gmt":"2014-02-14T14:22:30","guid":{"rendered":"http:\/\/twelvershia.net\/?p=908"},"modified":"2014-02-14T14:22:30","modified_gmt":"2014-02-14T14:22:30","slug":"response-to-farid-and-hadith-al-wilayah","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/14\/response-to-farid-and-hadith-al-wilayah\/","title":{"rendered":"Response to: Farid and Hadith Al-Wilayah"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=908\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response by Farid to the article on the Ghadir786 website, which was entitled: Farid and the Hadith Al-Wilayah, which can be found <a href=\"http:\/\/www.ghadir786.com\/articles\/our-refutations\/farid-and-%E1%B8%A5ad%C4%ABth-al-wil%C4%81yah\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">Note: This refutation is a refutation of an earlier refutation, which can be found here:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/2013\/05\/02\/response-to-alee-a-s-the-master-of-every-believer\/\" rel=\"external nofollow\">http:\/\/twelvershia.net\/2013\/05\/02\/response-to-alee-a-s-the-master-of-every-believer\/<\/a><\/p>\n<p style=\"text-align: justify;\">It is highly recommended that the article is read in order to get a clearer picture of the discussion.<\/p>\n<p style=\"text-align: justify;\">Before even discussing the points raised by our dear friends in the Ghadir786 website, we would like to provide the explanation provided by some Sunni scholars regarding the meaning of the Hadith: `Ali is the Wali of every believer after me.<\/p>\n<p style=\"text-align: justify;\">فمن العجيب حقا أن يتجرأ شيخ الإسلام ابن تيمية على إنكار هذا الحديث و تكذيبه في &#8221; منهاج السنة &#8221; ( 4 \/ 104 ) كما فعل بالحديث المتقدم هناك ، مع تقريره رحمه الله أحسن تقرير أن الموالاة هنا ضد المعاداة و هو حكم ثابت لكل مؤمن ، و علي رضي الله عنه من كبارهم ، يتولاهم و يتولونه .<\/p>\n<p style=\"text-align: justify;\">Rough translation: It is truly surprising that Shaikh Al-Islam Ibn Taymiyyah would deny this hadith and call it a lie in Minhaj Al-Sunnah 4\/104, As he did in the previous hadith here, even though he was correct that Muwalaat(friendship) is the opposite of Mu`adaat(Enmity), and that this is firmly established for all Muslims, and `Ali is one of the biggest (Muslims), and they ally with him and he allies with them.<\/p>\n<p style=\"text-align: justify;\"><strong>1- Response to Farid and his Juzjani Inclinations:<\/strong><\/p>\n<p style=\"text-align: justify;\">The writer at Ghadir786 then proceeded by arguing that the view stating that:<\/p>\n<p style=\"text-align: justify;\">&#8220;The innovators narration is to be rejected if it supports his innovation.&#8221;<\/p>\n<p style=\"text-align: justify;\">He argued that it is a view that was created by a Nasibi (Hater of `Ali). Ghadir786 argues that the most common position is that scholars have accepted the narrations of innovators which are in support of their innovation. They then include a list of scholars that held this view. The list includes Imam Ahmad, Al-Bukhari, Muslim, Al-Tirmithi, Al-Nasa’ee, Ibn Majah, Al-Hakim, Al-Bayhaqi, and Al-Dhahabi.<\/p>\n<p style=\"text-align: justify;\">However, Ghadir786 did not provide any references that this is the opinion of these scholars.<\/p>\n<p style=\"text-align: justify;\">The best they could do is quote Al-Turaifi, which mentioned the names of those scholars, and more, and stated that they all quoted the Hadith of `Ali that “Nobody loves me except for a believer, and nobody hates me except for a disbeliever,” and that this narration only comes through the path of Adi bin Thabit (reliable narrator described as being Shia).<\/p>\n<p style=\"text-align: justify;\">Yet, this argument of his is still problematic since the scholars in that list, with the exception of Imam Muslim and Ibn Hibban, did not write their books with the intention of only quoting authentic Hadiths. So, it is quite possible that those same scholars recorded this Hadith while believing that it is weak.<\/p>\n<p style=\"text-align: justify;\">Moreover, there were those that have weakened this narration, like Al-Daraqutni in Al-Ilzamaat wal Tatabu`, apparently for the very fact that it is only narrated by a Shi`ee. So, no, we strongly disagree that this was only the opinion of Al-Jawzajani like the opponent argued.<\/p>\n<p style=\"text-align: justify;\">Ghadir786 continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Ḥāfiẓ tells us about Ja&#8217;far b. Sulaymān al-Ḍabī:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">قال ابن حبان كان جعفر من الثقات في الروايات غيرأنه ينتحل الميل إلى أهل البيت ولم يكن بداعية إلى مذهبه وليس بين أهل الحديث من أئمتنا خلاف أن الصدوق المتقن إذا كانت فيه بدعة ولم يكن يدعو إليها الاحتجاج بخبره جائز.<\/span><\/p>\n<p><span style=\"color: #800000;\">Ibn Ḥibbān said, &#8220;Ja&#8217;far was one of the trustworthy narrators in the reports, except that he was inclined towards the Ahl al-Bayt. HOWEVER, HE WAS NOT A CALLER TO HIS SECT, and there is no disagreement among the scholars of ḥadīth among our Imāms about the fact that a truthful, accurate narrator, if there is bid&#8217;ah in him but he does not call to it, relying upon his report as ḥujjah (proof) is permissible.<\/span><\/p>\n<p style=\"text-align: justify;\">This is used as proof by the Ghadir786 team to suggest that if one isn&#8217;t a caller, then he can narrate Hadiths that support his innovation. However, it is simply argued that narrating a Hadith that supports one’s innovation is in and of itself a method of calling to one’s own sect.<\/p>\n<p style=\"text-align: justify;\"><strong>2- Response to the Strengthening of Al-Ajlah:<\/strong><\/p>\n<p style=\"text-align: justify;\">Ghadir786 argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We say: people who are more knowledgeable in this matter (than Farid) have graded al-Ajlaḥ as &#8220;ṣadūq (very truthful&#8221;, meaning that his aḥādīth are ḥasan. For instance, al-Ḥāfiẓ states:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">أجلح عبدالله &#8230; الكندي يقال اسمه يحيى صدوق شيعي<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">Ajlaḥ&#8217;Abd Allāh &#8230; al-Kindī, it is said that his name was Yaḥyā: Ṣadūq (very truthful), a Shī&#8217;ī.<\/span><br \/>\n<span style=\"color: #800000;\">Shaykh al-Arnāūṭ also submits:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">الأجلح &#8211; وهو ابن عبد الله الكندي &#8211; فقد روى له البخاري في &#8221; الأدب &#8221; وأصحاب السنن وهو صدوق<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">Al-Ajlaḥ– and he is Ibn &#8216;Abd Allāh al-Kindī – al-Bukhārī has narrated from him in al-Adab, and the authors of the Sunan too (i.e. al-Tirmidhī, Abū Dāwud, Ibn Majah and al-Nasāī). And he is ṣadūq (very truthful).<\/span><br \/>\n<span style=\"color: #800000;\">&#8216;Allāmah al-Albānī too states about the chain of the version of Ḥadīth al-Wilāyah narrated by al-Ajlaḥ:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">&#8221; لا تقع في علي،فإنه مني وأنا منه وهو وليكم بعدي وإنه مني وأنا منه وهو وليكم بعدي &#8220;.<\/span><br \/>\n<span style=\"color: #800000;\">أخرجه أحمد (5 \/ 356) . قلت: وإسناده حسن<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">&#8220;Do not attack &#8216;Alī, for he is from me and I am from him, and he is your walī after me, and he is from me and I am from him, and he is your walī after me.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">Aḥmad (5\/356) recorded it. I say: and its chain is ḥasan. <\/span><br \/>\n<span style=\"color: #800000;\">We are aware that this is very unlikely to convince someone of Farid&#8217;s mindset.<\/span><\/p>\n<p style=\"text-align: justify;\">I say: Truly, such an argument is not convincing since these are three very late scholars. Ironically, when going back to Fath Al-Bari, in the chapter of &#8220;<strong>باب: أحل لكم الصيد الطيب<\/strong>&#8221; we find that al-Hafiz Ibn Hajar weakens Al-Ajlah.<\/p>\n<p style=\"text-align: justify;\">Similarly, Al-Albani mentions that al-Ajlah is one of the reasons that he weakened a Hadith in his book Al-Silsila Al-Dha`eefa #1570.<\/p>\n<p style=\"text-align: justify;\">As for mentioning al-Bukhari, he never narrated anything from al-Ajlah when it comes to virtues or rulings, he narrated from him a Hadith on &#8220;Adab&#8221; or good conduct.<\/p>\n<p style=\"text-align: justify;\">Eitherway, please refer to our original article to see the names of those that have weakened Al-Ajlah.<\/p>\n<p style=\"text-align: justify;\"><strong>3- Ja’afar bin Sulaiman’s Narration:<\/strong><\/p>\n<p style=\"text-align: justify;\">Ghadir786 continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">But, Farid has a small purpose for attacking al-Ajlaḥ first:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">Ja&#8217;afar bin Sulaiman, being a contemporary of Al-Ajlah, MAY HAVE heard this narration in this form, and narrated it in the same manner.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">This is perhaps the dumbest argument we have ever seen! First, it is a conjecture – which is why he has said &#8220;may&#8221; – with no evidence. Secondly, Ja&#8217;far b. Sulaymān made it abundantly clear that he was transmitting the ḥadīth as narrated to him by Yazīd al-Rishk:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">حدثنا أبو داود قال حدثنا جعفر بن سليمان الضبعي حدثنا يزيد الرشك<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">Abū Dāwud narrated to us: Ja&#8217;far b. Sulaymān al-Ḍab&#8217;ī narrated to us: Yazīd al-Rishk NARRATED to us.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">There is absolutely no evidence that Ja&#8217;far b. Sulaymān learnt his ḥadīth from al-Ajlaḥ, or that he was not accurately transmitting the words of Yazīd al-Rishk!<\/span><\/p>\n<p style=\"text-align: justify;\">I say: It seems as though there is a misunderstanding on the part of the Ghadir786 team. Firstly, we are in agreement that Ja’afar bin Sulaiman narrating from Yazeed. There is no accusation here that he didn’t. The argument is that Ja’afar bin Sulaiman did not literally narrate what he heard, but narrated the meaning of what he heard.<\/p>\n<p style=\"text-align: justify;\">For example:<\/p>\n<p style=\"text-align: justify;\">\nSome companions have narrated that the Prophet (salalahu alaihi wa salam) said that Islam is: “the five prayers, the zakat, the hajj, and the fasting of Ramadhan.”<\/p>\n<p style=\"text-align: justify;\">Others have narrated the same Hadith, but they said: “the five prayers, the zakat, the fasting of Ramadhan, and the hajj.”<\/p>\n<p style=\"text-align: justify;\">Due to the permissibility of narrating a Hadith according to the meaning, and not in literal form, or not &#8220;word for word&#8221;, we have ended up with two versions of the same Hadith being attributed to the Prophet (salalahu alaihi wa salam). Yet, both are referred to as “Hadith Jibreel,” and are therefore the same Hadith.<\/p>\n<p style=\"text-align: justify;\">In most cases, such a thing is harmless. However, it can be can in some cases be harmful, the understanding of individuals may change the meaning of a Hadith. In this case, Ja`afar bin Sulaiman heard from Yazeed the same popular narration, but heard him say, “`Ali is the Mawla of every believer.” Yet, due to the Tashayyu of Ja`afar bin Sulaiman, he understood that Mawla in this narration means master, and that it wouldn&#8217;t make sense that `Ali is the current master of the believers, since the Prophet (saw) was alive and there can&#8217;t be two leaders at the same time. So, he understood that the Prophet (salalahu alaihi wa salam) meant that this is the case after his death. Due to this, if one narrated the narration as “Mawla of every believer AFTER ME”, they would not be lying, but they are simply narrating the narration in the way that they understood it as Shia.<\/p>\n<p style=\"text-align: justify;\">Furthermore, there is no need for proof that Ja`afar bin Sulaiman heard this narration from Al-Ajlah, since Ja`afar bin Sulaiman’s narration is rejected either way due to his Tashayyu. The suggestion that he MAY have heard it from Al-Ajlah, or any Shi`ee, or simply related it from his understanding, are simply possibilities. This is a common practice that we find in the actions of Hadith scholars.<\/p>\n<p style=\"text-align: justify;\"><strong>4- Abu Balj’s Narration:<\/strong><\/p>\n<p style=\"text-align: justify;\">After providing opinions of early Hadith experts that the narration of Abu Balj is weak in our original article, Ghadir786 responds with the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">On what basis did Ahmad question the narration? There is none! &#8216;Abd al-Ghaniyy al-Ḥāfiẓ too who claimed that Abū Balj made a mistake, where is his evidence? Once more, there is none! We wonder how our brother, Farid, thinks such kinds of unsupported statements can constitute evidence in any circumstance!<\/span><\/p>\n<p style=\"text-align: justify;\">The early scholars of Hadith are like jewellers. One would go to a jeweller and present him with a jewel and he would say it is a fake. You too would not know how they have arrived at such a conclusion, but this was due to their experience and expertise in the field. Similarly, the early Hadithists spent their lives studying Hadith and have attained the levels that they rose to only after they have delved so deeply into the science.<\/p>\n<p style=\"text-align: justify;\">The Shia science of Hadith is loaded with vagueness, guesswork, conjecture and inaccuracies, we can easily turn the table on the Shia and say: I can ask our friends at Ghadir786, why do you accept that Muhammad bin Eisa’s narration from Yunus is weak, or that Muhammad bin Eisa Al-Ash`ari is reliable, or that Al-Hasan bin Mahboub never met Abu Hamza Al-Tham`ali, when all you have are those words and no explanation from your early scholars like Al-Tusi and Al-Najashi? If all you can provide are assumptions without proof, then we suggest that you either accept our reliance on our expert Sunni scholars, or simply switch to being Hadith-rejectors or become Akhbaris.<\/p>\n<p style=\"text-align: justify;\">The folks at Ghadir786 continue by providing narrations that Abu Balj narrated from Amr bin Maymoon in an attempt to show that this was not a mistake by him. However, anyone with experience in the field of Hadith sciences is aware that mistakes like these occur. One can even make a mistake when attributing a Hadith to two people with completely different names, let alone those with a similar one.<\/p>\n<p style=\"text-align: justify;\">Ghadir786 continues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Of course, there are many other similar examples. But, we are stopping here. It is strange. Isn&#8217;t it? Abū Balj was repeatedly stating the wrong name while narrating from &#8216;Amr b. Maymūn???!! Or, he only did that when he narrated about the merits of Amīr al-Mūminīn &#8216;Alī b. Abī Ṭālib. Right?!<\/span><\/p>\n<p style=\"text-align: justify;\">The statements of the big scholars have their weight and importance, on the other hand the doubts that are cast by a contemporary Shi’ee online have none.<\/p>\n<p style=\"text-align: justify;\">\nThe evidence that this narration is that of Maymoon Abu Abdullah is that he too is a narrator of this Hadith. (See Al-Kamil by Ibn `Adi). Furthermore, we have stated previously that `Amr bin Maymoon doesn&#8217;t narrate from Ibn `Abbas. Both of these are enough reason to raise suspicion, yet, as we said previously, these possibilities are not necessary for the statements of scholars were enough.<\/p>\n<p style=\"text-align: justify;\"><strong>5- The Probability Argument:<\/strong><\/p>\n<p style=\"text-align: justify;\">Ghadir786 finally comes up with a good argument. They suggest that since the version of “every believer AFTER ME” exists in the reports of three Sahabis, then it is more likely to be true:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">First, he heaps the blame of everything upon his scapegoat, al-Ajlaḥ. However, he seems to have forgotten that both Ja&#8217;far b. Sulaymān and Abū Balj have equally transmitted the same ḥadīth with the same addition through ṣaḥīḥ chains! Besides, the version without the addition is narrated by Buraydah only, while that with the addition is narrated by &#8216;Imrān b. Ḥaṣīn, Ibn &#8216;Abbās and Buraydah himself! Isn&#8217;t logical that the stronger version is that narrated by multiple Ṣaḥābah, through multiple reliable chains?<\/span><\/p>\n<p style=\"text-align: justify;\">Firstly, we have to remind the good people at Ghadir786 that this is not a case of the narration of Buraidah vs the narrations of Imran, Ibn Abbas, and Buraidah (3 versus 1), but rather, it is two versus one, since we have provided through multiple authentic chains that Buraidah did not include the addition. It is simply absurd to still suggest that Buraidah’s narration with the inclusion of “After Me” is the correct one when the evidence overwhelmingly suggests that it isn&#8217;t.<\/p>\n<p style=\"text-align: justify;\">Furthermore, one of the narrations of Buraidah, comes through the path of Ibn Abbas through an extremely authentic chain. The chain is much stronger than the narration of Abu Balj, since it is from the narration Abdulm`Alik bin Humayyid from Al-Hakam from Sa’eed bin Jubair from Ibn Abbas, and there is no doubt that this Saheeh chain is stronger than Abu Balj’s chain, which is weak. Moreover, even those that strengthened Abu Balj’s chain only called it “Hasan”, and a Saheeh Hadith is stronger than a “Hasan” one.<\/p>\n<p style=\"text-align: justify;\">I add, that the Hadith is also authentic from the Hadith of `Ali ibn abi Talib in Fadha’il Al-Sahaba #986, without the addition of “After Me.”<\/p>\n<p style=\"text-align: justify;\">Also, we have an authentic Hadith from Sunan Al-Tirmithi #3646 in which Abu Al-Tufail narrates this Hadith from Abu Sareeha or Zaid bin Arqam (Shu’ba was not sure which of the two) that the Prophet (salalahu alaihi wa salam) said the same thing, without the addition of “After Me”.<\/p>\n<p style=\"text-align: justify;\">In other words, this narration is authentic (Sahih) from the narration of `Ali, Buraidah, Zaid bin Arqam\/Abu Sareeha, and Ibn Abbas (four narrations), without the addition of “After Me”, versus the weak narration via Imran bin Husain (one narration). Praise be to God, &#8220;probability&#8221; is also on our side.<\/p>\n<p style=\"text-align: justify;\">Therefore, the addition of “After Me” is not acceptable.<\/p>\n<p style=\"text-align: justify;\">We Ahlul-Sunnah believe in the authentic and popular text of Hadith Ghadeer Khumm, The Hadith that says &#8220;Whoever considers me his Mawla, `Ali is also his Mawla&#8221;, as for altered and corrupted versions of this text, we reject them.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response by Farid to the article on the Ghadir786 website, which was entitled: Farid and the Hadith Al-Wilayah, which can be found here. Note: This refutation is a refutation of an earlier refutation, which can be <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/14\/response-to-farid-and-hadith-al-wilayah\/\" title=\"Response to: Farid and Hadith Al-Wilayah\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,5],"tags":[],"class_list":{"0":"post-908","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/908","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=908"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/908\/revisions"}],"predecessor-version":[{"id":911,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/908\/revisions\/911"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=908"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=908"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=908"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}