{"id":913,"date":"2014-02-14T16:14:49","date_gmt":"2014-02-14T16:14:49","guid":{"rendered":"http:\/\/twelvershia.net\/?p=913"},"modified":"2014-02-14T16:14:49","modified_gmt":"2014-02-14T16:14:49","slug":"response-to-hadeeth-of-lake-fountain","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/14\/response-to-hadeeth-of-lake-fountain\/","title":{"rendered":"Response to Hadeeth of Lake-Fountain"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=913\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a refutation to RevisitingtheSalaf.org’s “Hadeeth of Lake-Fountain” article, which was published on the 31<sup>st<\/sup> of January 2014, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2014\/01\/hadeeth-of-lake-fount.html\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">This article was written with the goal of forever ending the Shi`ee attachment to the narration of the &#8220;Hawdh&#8221; (fount) by proving that this Hadith cannot be used for their goals.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 1: Who are the Ones that are taken Away from the Hawdh?<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS start off the article with the following promise:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">A great wonder that any researcher of so-called Sunni Islam comes across is how they maintain that none of the companions were innovators despite all their innovations, that all of them were righteous guides and that all of them will enter Paradise. It is simply impossible to link their conclusions with the facts. Worse still, there are specific multiple hadeeth in their most authentic books, which absolutely prove that most of the companions will enter the Hellfire for their innovations!<\/span><\/p>\n<p style=\"text-align: justify;\">RTS then start quoting the Hadith in multiple forms and sources. For our purposes, we shall quote the first version for the readers, but those interested should return to the original article for more:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated ibn Abbas: The Prophet (saw) said, &#8220;You will be gathered (on the Day of Qiyamah), bare-footed, naked and not circumcised.&#8221; He then recited: &#8220;As We began the first creation, We, shall repeat it: A Promise We have undertaken: Truly we shall do it.&#8221; {21.104} He added, &#8220;The first to be dressed on the Day of Qiyamah, will be Ibraheem (a.s), and some of MY COMPANIONS will be taken towards the left side (i.e. to the Fire), and I will say: &#8216;MY COMPANIONS! MY COMPANIONS!&#8217; It will be said: &#8216;They renegade from Islam AFTER YOU LEFT THEM.&#8217; Then I will say as the pious slave (i.e. Isa (a.s)) said. &#8216;And I was a witness over them while I dwelt amongst them. When You took me up You were the Watcher over them, And You are a witness to all things. If You punish them. They are Your slaves And if You forgive them, Verily you, only You are the All-Mighty, the All-Wise.'&#8221; {5.120-121).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Saheeh Al-Bukhari. Pg. # 20, H. # 3349.<\/span><\/p>\n<p style=\"text-align: justify;\">We, at twelvershia.net, have studied these narrations and have come to the conclusion that these that are mentioned here are indeed people who may have accompanied the Prophet (salalahu alaihi wa salam) at some point. However, we hold the opinion that these were not the Muhajireen(emigrants) or Ansar(supporters), but they are the Arabs that have become apostates after the death of the Prophet (salalahu alaihi wa salam), most of which embraced Islam out of fear from its growing power, then they left it as soon as he (saw) died. As for the early forerunners and pious believers who accompanied the Prophet (saw) during his emigration and Jihad and Da`wah, these were greatly praised in the Qur&#8217;an and the Sunnah, they were promised rewards, castles and rivers in paradise, they were promised forgiveness for their small sins and the intercession of their Prophet (saw).<\/p>\n<p style=\"text-align: justify;\">RTS, of course, disagrees, and provides a few reasons:<\/p>\n<p style=\"text-align: justify;\">1- The most obvious reason is the usage of the term “sahabi”. Then, the usage of the term “from among you” or “some of you” as well as the fact that he recognized them.<\/p>\n<p style=\"text-align: justify;\">2- A more important argument is the insistence by the RTS team that the majority of the Sahaba are in the hellfire.<\/p>\n<p style=\"text-align: justify;\">3- Their mistranslation of the term &#8220;Ahdatha&#8221; in the narration to “innovated”.<\/p>\n<p style=\"text-align: justify;\"> We shall deal with these one by one, the first one being the simplest one to deal with. RTS has already said time and time again that these people were at one time good and that they were upon Islam:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">This hadeeth from Al-Bukhari illustrates that it is but only the companions whom match the description. It shows how they possessed good qu`Alities of a Muslim prior to the Prophet (saw) death, which is why Allah (swt) will deem them punishable for what they did after him (saw).<\/span><\/p>\n<p style=\"text-align: justify;\">We are in agreement with this, since the narration does imply that which RTS has made clear. However, RTS should also keep in mind that not every Muslim who enters hell shall abide in it, many will enter and be cleansed from what they did then ascend to heaven with the others except those whom Allah forgives.<\/p>\n<p style=\"text-align: justify;\">The Prophet (saw) said:<\/p>\n<p style=\"text-align: justify;\">يَخرُجُ مِنَ النَّارِ منْ قالَ لا إلهَ إلاَّ اللهُ وفي قَلبِهِ وزْنُ ذَرّةٍ مِنْ إيمانٍ<\/p>\n<p style=\"text-align: justify;\">[Those who say: &#8220;No God but Allah!&#8221; and in their hearts is a grain of mustard&#8217;s weight of (pure) faith, they shall (later) exit the hellfire.]<\/p>\n<p style=\"text-align: justify;\">The second argument is more problematic since we hold the view that only a small number of these Sahaba will enter hellfire. The evidence provided by RTS is the narration of Abu Huraira in Saheeh Al-Bukhari in which the term &#8220;Hamal al-Na`am&#8221; is used. The term implies a very large number will not reach the Hawdh. However, in the very same screenshot taken by RTS, we find Abu Huraira narrating the same tradition but instead, using the term &#8220;Raht&#8221;.<\/p>\n<p style=\"text-align: justify;\">The term &#8220;Raht&#8221; in Arabic means “from three to ten” according to linguists. See the dictionaries: Al-Bahr Al-Muheet (p. 668) and Tahtheeb Al-Lugha 2\/1488.<\/p>\n<p style=\"text-align: justify;\">It should be noted that the narration that uses the term &#8220;Raht&#8221; is much stronger than the one that uses &#8220;Hamal al-Na`am&#8221;, for the latter is from the narration of Fulayh bin Sulaiman, who has been weakened by most scholars.<\/p>\n<p style=\"text-align: justify;\">In another narration, also quoted by RTS under the biography of Anas bin Malik, we find the Prophet (salalahu alaihi wa salam) referring to them as &#8220;Usayhabi&#8221; instead of &#8220;Ashabi&#8221;. Also, this word was used by Ibn Abbas in one of the versions of the Hadith in Al-Bukhari. The addition of the letterي  (yaa’) in this word is used to refer to something in a small way, such as a small group or small quantity.<\/p>\n<p style=\"text-align: justify;\">Ibn Hajar in his Fath, quoted Al-Khattabi who said: This implies that the number of those that this happened to were small (since he used the word Usayhabi).<\/p>\n<p style=\"text-align: justify;\">Furthermore, in Saheeh Muslim #367 and #4247, we find both Abu Huraira and Umm Salamah referring to the companions that are taken away from the Hawdh as &#8220;al-Ba`eer al-Dhaal&#8221;. The terms translates to: The lost camels, or the ones that have gone astray from the pack, or the majority.<\/p>\n<p style=\"text-align: justify;\">This is true because the Prophet (saw) when advising his companion said:<\/p>\n<p style=\"text-align: justify;\">تلزم جماعة المسلمين و إمامهم<\/p>\n<p style=\"text-align: justify;\">[You stick to the majority of Muslims and their leader.]<\/p>\n<p style=\"text-align: justify;\">And in another Hadith he said that the heart of the Muslim will be pure if it sticks to three:<\/p>\n<p style=\"text-align: justify;\">إخلاص العمل و مناصحة ولاة الأمر و لزوم الجماعة<\/p>\n<p style=\"text-align: justify;\">[Being sincere in your actions (for the sake of Allah), advising those in authority from among the Muslims, and remaining with the majority.]<\/p>\n<p style=\"text-align: justify;\">In other words he&#8217;s telling his companions to stick to the majority and not to create deviant sects and join as they cause division. Otherwise they&#8217;ll become like camels who have strayed from the path, `Ali ibn abi Talib says similarly in Nahj al-Balagha:<\/p>\n<p style=\"text-align: justify;\">[With regard to me, two categories of people will be ruined, namely he who loves me too much and the love takes him away from rightfulness, and he who hates me too much and the hatred takes him away from rightfulness. The best man with regard to me is he who is on the middle course. So be with him and be with the great majority of Muslims because Allah’s hand of protection is on keeping unity. You should beware of division because the one isolated from the group is a prey to Satan just as the one isolated from the flock of sheep is a prey to the wolf. Beware! Whoever calls to this course [of sectarianism], kill him, even though he may be under this headband of mine.]<\/p>\n<p style=\"text-align: justify;\">In other words this also implies a small group will deviate off the correct path, while the majority shall carry-on in unity. So, In conclusion, we can see that most of the narrations are very clear when describing that the number of companions that are taken away from the Hawdh is a small one.<\/p>\n<p style=\"text-align: justify;\">Moving on, the last issue that causes RTS to hold the view that the companions of the Prophet (salalahu alaihi wa salam) are the ones meant by this verse, and not the apostates (Murtaddeen), is their mistranslation of the term &#8220;Ahdatha.&#8221;<\/p>\n<p style=\"text-align: justify;\">Firstly, the term &#8220;Ahdatha&#8221; is derived from &#8220;Hadath&#8221;, according to Ibn Al-Atheer in Al-Nihaya (p. 192) this word implies a frowned upon matter that is not common or known in the Sunnah.<\/p>\n<p style=\"text-align: justify;\">He explains that the famous narration:<\/p>\n<p style=\"text-align: justify;\">من أحدث فيها حدثا أو آوى محدثا<\/p>\n<p style=\"text-align: justify;\">[Madinah is sacred, what is between &#8216;Air to Thawr, so whoever commits in it any Hadath or shelters a Muhdith then upon him is the curse of Allah]<\/p>\n<p style=\"text-align: justify;\">He explains it as having two possible meanings. The first is that one commits a crime or defends a criminal, and the other is about one who commits an innovation or is satisfied with an innovator.<\/p>\n<p style=\"text-align: justify;\">However, Ibn Al-Atheer is clear that it all depends on how the last word is pronounced. If the term is pronounced as &#8220;Muhdithan&#8221;, then it is speaking about criminals. Yet, if it is pronounced as &#8220;Muhdathan&#8221;, then it is talking about innovators.<\/p>\n<p style=\"text-align: justify;\">RTS&#8217;s translation is as follows:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The Messenger of Allah (saw) said &#8220;Whosoever invents an innovation or helps an innovator, the Curse of Allah (swt) is upon him, and that of all the angels, and all mankind.&#8221;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Shuaib Al-Arna&#8217;ut: Its chain is Saheeh (Authentic) on the conditions of the two Sheikhs (Al-Bukhari and Muslim).<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Musnad Ahmad ibn Hanbal. Vol. 2, Pg. # 286, H. # 993.<\/span><\/p>\n<p style=\"text-align: justify;\">However, when we go back to the screenshot that is taken, we find the word written as &#8220;Muhdithan&#8221;, which means criminal. Ibn Al-Atheer (p. 170) expounds by saying that the term criminal or Jaani is: he who commits a crime that deserves a religious punishment or Qisas in this life and the hereafter.<\/p>\n<p style=\"text-align: justify;\">It should also be known that the word Ahdatha can also mean: to fornicate, according to Al-Fayruzabadi in Al-Qamoos (p. 167). It is possible to say that the word does refer to crimes in general, but that the crime of fornication is the one that it was associated with most. Anyhow, we can see clearly that the word has more than one interpretation.<\/p>\n<p style=\"text-align: justify;\">Not surprisingly though, all the translations provided by RTS for the narrations of the Hawdh all include the word innovation (or introduced) for the word Ahdatha. RTS were never clear why this word was chosen as the translated word, but the reasons are obvious.<\/p>\n<p style=\"text-align: justify;\">It is due to this that we have no choice but to return to the context of the Hadith in order to determine what is the correct meaning of the narration. RTS, coming in with the preconception that the Sahaba committed innovations, wished for that the Sahaba would fall into this Hadith. However, they have not provided any evidences from the context that suggest this.<\/p>\n<p style=\"text-align: justify;\">The best evidences can be found in the narrations in which the Prophet (salalahu alaihi wa salam) asks about what they did, like the first narration of Ibn Abbas, in which RTS translated as:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">They renegade from Islam AFTER YOU LEFT THEM.<\/span><\/p>\n<p style=\"text-align: justify;\">RTS tried to explain this as:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\"> Most of them will be in Hellfire for apostasy due to their blasphemous innovations after him.<\/span><\/p>\n<p style=\"text-align: justify;\">However, there are no evidences in the text that mentions innovations at all. They merely state apostasy as the cause, not innovation. This is because after Rasul-Allah (saw) passed away, some tribes decided to apostate and rejected the rule of Islam. Abu Bakr, `Umar, `Uthman and `Ali fought these apostates in the famous wars called &#8220;al-Riddah&#8221;.<\/p>\n<p style=\"text-align: justify;\"><strong>Note:<\/strong> For further reading, we suggest Ta`amulaat fi Ahadeeth Al-Hawdh by Abdullah Al-Ghamdi, for we have benefitted from his work greatly.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 2: “Innovations” of the Companions:<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS, in an attempt to link the narrations of Al-Hawdh with the companions of the Prophet (salalahu alaihi wa salam), then proceeded to collect narrations in which he believes they “innovated.”<\/p>\n<p style=\"text-align: justify;\">\nThis includes the following:<\/p>\n<p style=\"text-align: justify;\">\na) Abu Bakr’s distribution of khums<br \/>\nb) `Umar’s gathering of the people for taraweeh<br \/>\nc) `Umar’s prohibition of muta’a in hajj<br \/>\nd) `Umar’s opinion of prohibiting tayamum for those that have fallen into a state of janabah<br \/>\ne) `Umar’s opinions regarding divorce rulings<br \/>\nf) `Umar’s opinion on nawafil after Asr<br \/>\ng) `Uthman’s prayer of four raka’aat in Mina<br \/>\nh) `Uthman’s additional adhan for prayer<br \/>\ni) The Sahaba only being similar in prayer to the Prophet (salalahu alaihi wa salam)<br \/>\nj) Mu’awiyah’s adhan during Eid<br \/>\nk) A’isha’s “hostility” towards `Ali<\/p>\n<p style=\"text-align: justify;\">RTS then states that:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">It is crystal clear the phrase &#8220;All innovations&#8221; leaves no exceptions. Every Bid&#8217;ah, whatsoever its intention or purpose, attracts nothing but the Hellfire and there lies no exemption from it! <\/span><\/p>\n<p style=\"text-align: justify;\">Although we can refute each one separately in detail, yet wisdom ordains that we refute most of it with a couple of easy small and short refutations, let&#8217;s first define what constitutes an innovation according to some scholars.<\/p>\n<p style=\"text-align: justify;\">Al-Shatibi defines it as: A method in religion that is introduced that goes against the Shari`ah with the intention of excessively worshiping Allah.<\/p>\n<p style=\"text-align: justify;\">\nIbn Rajab defines it as: Something introduced that has no basis in the religion, and those things that have a basis in the Shari`ah is not a bida`a (innovation), even though it may be a bida`a linguistically.<\/p>\n<p style=\"text-align: justify;\">\nSee Mawqif Ahl Al-Sunnah min Ahl Al-Ahwa’a wal Bida`a by Al-Rahili 1\/91.<\/p>\n<p style=\"text-align: justify;\">\nJa`afar Al-Subhani, the Shi`ee scholar also has a similar view. He includes three conditions:<\/p>\n<p style=\"text-align: justify;\">1- That innovations have to do with the religion in ideology and jurisprudence through addition or subtraction.<br \/>\n2- It includes a calling to the innovation.<br \/>\n3- The innovation must not have any evidence from the Shari`ah that permits it, generally or specifically.<\/p>\n<p style=\"text-align: justify;\">See Al-Bida`a wa Mafhoomiha (p. 39).<\/p>\n<p style=\"text-align: justify;\">With these definitions in mind, we can easily get rid of most of the allegation that RTS has raised against the Sahaba. The simple reason being that much of what has been mentioned in this section are matters of Ijtihad that has a basis in the religion.<\/p>\n<p style=\"text-align: justify;\">We will be going through all of these accusations in future refutations, but for now, we urge readers to return to the books of explanation of Hadith, like Fath Al-Bari by Ibn Hajar, where one can find the evidences of the Sahaba for their Ijtihad.<\/p>\n<p style=\"text-align: justify;\">As for that last one about the wars between `Ali and the others, we say the Prophet (saw) and `Ali both considered the other side as being Muslims, The prophet (saw) described Mu`awiya&#8217;s team as &#8220;A great team of the Muslims&#8221; in the narration of al-Hasan bin `Ali. As for `Ali when he was asked about his opponents in those wars he said: &#8220;Our brothers who transgressed against us&#8221;, he denied any apostasy or hypocrisy.<\/p>\n<p style=\"text-align: justify;\">However, we would like to present one mistranslation for the readers to judge the biased nature of RTS. They quoted:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Al-Hakim:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Narrated Qays ibn Abi Hazim: A&#8217;isha, while speaking about her burial in her house with the Messenger of Allah (saw) and Aboo Bakr, said: &#8220;I invented an INNOVATION after the Messenger of Allah (saw). Bury me with his wives.&#8221; So, she was buried at Al-Baqi.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Both Al-Hakim and Al-Dhahabi declare the hadeeth to be Saheeh (Authentic) on the conditions of Al-Bukhari and Muslim.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Source: Al-Mustadrak Alaa Al-Sahihain. Vol. 4, Pg. # 7, H. # 2315 \/ 6717.<\/span><\/p>\n<p style=\"text-align: justify;\">Of course, when we return to the text, we find the words &#8220;Ahdathtu&#8221;, which is a word that holds many interpretations as demonstrated above. Furthermore, it is not linguistically acceptable for the meaning to be “innovated”, since the term “innovation”, according to the definitions above, do not suit what happened between her and `Ali. If we were to interpret what she meant by the battle of Al-Jamal, then we would have to interpret it as “I did something that was frowned upon” as the correct translation.<\/p>\n<p style=\"text-align: justify;\">If RTS still insist on his corrupt translation, then we&#8217;re forced to tell him that `Ali himself &#8220;innovated&#8221; according to RTS&#8217;s translations. In Musnad Ahmad we read in an authentic narration where `Ali is talking about the events that took place at the end of `Uthman&#8217;s rule and his own rule, he says:<\/p>\n<p style=\"text-align: justify;\">و أنا قد أحدثنا بعدهم أحداثا يقضى الله تعالى فيها ما شاء<\/p>\n<p style=\"text-align: justify;\">[And we have done Ahdaath after this that only Allah most high can judge as he pleases.]<\/p>\n<p style=\"text-align: justify;\">So here either RTS explains this as having done frowned upon things (ie. the Fitnah) or that `Ali and his followers have innovated and thus are to abide in hellfire according to him.<\/p>\n<p style=\"text-align: justify;\">wal-Salamu `Aleykum,<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a refutation to RevisitingtheSalaf.org’s “Hadeeth of Lake-Fountain” article, which was published on the 31st of January 2014, and can be found here. This article was written with the goal of forever ending the Shi`ee attachment to the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/14\/response-to-hadeeth-of-lake-fountain\/\" title=\"Response to Hadeeth of Lake-Fountain\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"class_list":{"0":"post-913","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/913","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=913"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/913\/revisions"}],"predecessor-version":[{"id":915,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/913\/revisions\/915"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=913"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=913"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=913"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}