{"id":922,"date":"2014-02-14T17:24:31","date_gmt":"2014-02-14T17:24:31","guid":{"rendered":"http:\/\/twelvershia.net\/?p=922"},"modified":"2014-02-14T17:24:31","modified_gmt":"2014-02-14T17:24:31","slug":"response-to-the-door-to-the-city-of-knowledge","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/14\/response-to-the-door-to-the-city-of-knowledge\/","title":{"rendered":"Response to: The Door to the City of Knowledge"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=922\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to RevisitingtheSalaf.org’s article “The Door to the City of Knowledge”. The article was published on the 25th of November, 2013, and can be found <a href=\"http:\/\/www.revisitingthesalaf.org\/2013\/11\/the-door-to-city-of-knowledge.html\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 1: Differences of Opinions between the Scholars Regarding the Authenticity of the Hadith.<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS, in this article, makes the following promise:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In this short article we shall investigate if it has any basis or is a mere fabrication made by the followers of the Ahlulbayt (a.s)<\/span><\/p>\n<p style=\"text-align: justify;\">I say: If it is fabricated, then it surely isn&#8217;t fabricated by the followers of Ahlul-Bayt (as), for their followers are the followers of Rasul-Allah (saw), they are Ahlul-Sunnah. As for those who fabricated it, they are the sectarian hooligans who are foreign to Islam and monotheism, they are that small minority that divided the religion and formed the sects may Allah never be pleased with them.<\/p>\n<p style=\"text-align: justify;\">As for their investigation, sadly RTS have failed to do even that. We are not insinuating that RTS failed in providing a basis for the narration, but rather, we are claiming that they have failed in even investigating the narration. We say this because the RTS team did not do more than simply quote the opinions of scholars that have strengthened the Hadith. Doing such does not constitute an investigation, for as we can see from the very introduction of the article that there exists a difference of opinion among the scholars of Ahl Al-Sunnah. So, by providing additional quotes, without providing evidences to back them up, we cannot call this an investigation.<\/p>\n<p style=\"text-align: justify;\">After Al-Hakim, who graded this hadith as authentic in Al-Mustadrak, we find the following quotes that RTS has provided:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">-Al-Suyuti: This Hadeeth is Hasan (Reliable) in the correct view. <\/span><br \/>\n<span style=\"color: #800000;\">-Al-Salihi: The correct opinion is that the hadeeth is Hasan (Reliable), as Al-Hafiz Al-Alai and Al-Hafiz ibn Hajar said.<\/span><br \/>\n<span style=\"color: #800000;\">-Al-Hindi: Ibn Jarir said: This Hadeeth is Saheeh (Authentic).<\/span><br \/>\n<span style=\"color: #800000;\">-Ibn Hajar: This hadeeth has a lot of chains in Mustadrak of Al-Hakim. Its lowest grading is that the hadeeth has a basis (i.e. is authentic). It is not correct to declare it a fabrication.<\/span><br \/>\n<span style=\"color: #800000;\">-Al-Zarkashi: The conclusion is that the hadeeth, through the combined effect of its two chains, the chains of Aboo Mu&#8217;awiyah and Sharik is that it is of the grading of Hasan (Reliable), and can be relied upon. It is not da&#8217;if (weak), much less being a fabrication.<\/span><br \/>\n<span style=\"color: #800000;\">-Al-Sakhawi: The best of them (i.e. its chains) is the hadeeth of ibn Abbas. Rather, it (the hadeeth) is Hasan (Reliable).<\/span><br \/>\n<span style=\"color: #800000;\">-Al-Khateeb Al-Baghdadi: Al-Qasim said, &#8220;I asked Yahya b. Mo&#8217;een concerning this hadeeth, and he said, &#8216;It is Saheeh (Authentic).'&#8221;<\/span><br \/>\n<span style=\"color: #800000;\">-Al-Saqqaf: It has been narrated in a Saheeh (Authentic) Hadeeth from him (i.e. the Prophet), peace be upon him and his family, that he said: &#8220;I am the city of knowledge and Alee (a.s) is its gate.&#8221; Al-Hafiz ibn Mo&#8217;een declared it authentic as in Tarikh Baghdad 11\/49, as well as Imam Al-Hafiz ibn Jarir Al-Tabari in Tahdhib Al-Athar, and Al-Hafiz Al-Alai in Al-Naqd Al-Sahih, and Al-Hafiz ibn Hajar and Al-Hafiz Al-Suyuti as in Al-Lali Al-Masnu&#8217;at 1\/334, and Al-Hafiz Al-Sakhawi as in Al-Maqasid Al-Hasanah.<\/span><\/p>\n<p style=\"text-align: justify;\">Those above are the names of those that have authenticated, or in most cases, declared the Hadith as Hasan.<\/p>\n<p style=\"text-align: justify;\">On the other hand, we quote <span style=\"text-decoration: underline;\">some<\/span> of the names of those that have weakened the Hadith or called it a fabrication:<\/p>\n<p style=\"text-align: justify;\">&#8211; Al-Imam Ahmad denied the hadith (Al-Ilal wa Ma’rifat Al-Rijal #308)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-Bukhari denied it as well and said: There are no correct routes for it. (Al-Ilal Al-Kabeer 2\/942)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Ibn Ma`een said: This narration is a lie; it has no basis. (Su’alaat Ibn Al-Junaid #51)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-Tirmithi said: The hadith is strange and munkar. (Al-Sunan 5\/596)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-`Uqaili said: There is nothing authentic with this narration. (Al-Dua’afaa’ 3\/150)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Ibn Hibban said: There is nothing of basis from the hadith of Ibn Abbas, or Mujahid, or Al-A`amash, nor did Abu Mu`awiyah narrate it, and anyone that narrated this stole it from Abi Al-Salt, even if he changed the chain. He also said: This narration has no basis from the Prophet (salalahu alaihi wa salam). (Al-Majrooheen 2\/94)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-Daraqutni said: This narration is mudhtarib; not authentic. (Al-Ilal 3\/248)<br \/>\n&#8211; Ibn Al-Jawzi claimed that it was a fabricated. (Al-Mawdhoo’aat 1\/533)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Ibn Taymiyah claimed it was a fabrication. (Minhaj Al-Sunnah 7\/515)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-Dhahabi claimed it was a fabrication. (Mizan Al-I’itidal 1\/415)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Najm Al-Deen Al-Ghazzi said: All the paths are weak. (Itqan ma Yuhsin 1\/126)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-Mu`allami claimed it was a fabrication. (Al-Fawa’id Al-Majmoo’a p. 349)<\/p>\n<p style=\"text-align: justify;\">\n&#8211; Al-Albani claimed it was a fabrication. (Dha’eef Al-Jami’ Al-Sagheer #1322)<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Section 2: Opinion of Yahya bin Ma’een.<\/strong><\/p>\n<p style=\"text-align: justify;\">As we can see from the sources above, there seems to be a contradiction. RTS has provided evidence that the narration is authentic according to Yahya, while we have provided evidence that it isn’t.<\/p>\n<p style=\"text-align: justify;\">\nAl-Khateeb Al-Baghdaadi also quotes more than once from Yahya in which he weakens or rejects the narration.<\/p>\n<p style=\"text-align: justify;\">\nRTS has provided the screenshot, but have failed to translate the explanation of Al-Khateeb.<\/p>\n<p style=\"text-align: justify;\">\nAl-Khateeb said: He (Yahya bin Ma’een) meant that it is correct from the narration of Abi Mu`awiyah and not false, for others have narrated it through him.<\/p>\n<p style=\"text-align: justify;\">\nWe agree with the opinion of Al-Khateeb, and it is a reasonable opinion and a good way of reconciling between these views since Yahya believed that this is the narration of Abi Mu`awiyah. However, if one were to say that these opinions cannot be reconciled, then we say that the correct view is the one which says that Yahya bin Ma`een weakened the hadith, since it is narrated by Ibn Al-Junaid (see his biography in Tareekh Baghdad), Ibn Ma’een’s close student, while Al-Qassim bin Abdulrahman was not a known student of Yahya, nor have we seen the scholars praise him.<\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>Section 3: The Evidences Provided by those that Strengthen the Hadith<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS failed to provide any evidences from themselves, but a couple of their quotes include evidences that suggest the authenticity of the hadith.<\/p>\n<p style=\"text-align: justify;\">\nThese are the opinions of Ibn Hajar and Al-Zarkashi. The former suggested that the inclusion of many chains in Mustadrak Al-Hakim suggests the authenticity of the Hadith, while the latter suggested that the narration is authentic since the narration of Abi Mu`awiyah can be strengthen with the narration of Shareek.<\/p>\n<p style=\"text-align: justify;\">Firstly, we look at the hadith in Al-Mustadrak 5\/1743-1744 and we find that it has come through Ibn Abbas and Jabir.<\/p>\n<p style=\"text-align: justify;\">\nThe narration of Jabir is not even strengthened by Al-Hakim, but Al-Dhahabi points out that the narrator Ahmad bin Abdullah bin Yazeed Al-Harrani is a lying Dajjal.<\/p>\n<p style=\"text-align: justify;\">As for the hadiths of Ibn Abbas, they all reach him through the narration of Abu Mu`awiyah from Al-A’amash from Mujahid from Ibn Abbas. We find two narrators narrating it from Abu Mu`awiyah, the first is Abu Al-Salt Al-Harawi, who Al-Hakim referred to as reliable. Al-Dhahabi, on the same page, pointed out that he is weak. See Mizan Al-I’itidal and Tahtheeb Al-Tahtheeb for the opinion of the majority of the scholars regarding the poor status of Abu Al-Salt. The second is Mohammad bin Ja`afar Al-Faydi, but he is of an anonymous status since no scholars have declared him as reliable.<\/p>\n<p style=\"text-align: justify;\">\nWe would like to remind readers that the correct opinion of the narration of Abu Mu`awiyah is that it was fabricated by Abu Al-Salt, but then stolen from him by other narrators, like Al-Faydi. Refer to the quote of Ibn Hibban above.<\/p>\n<p style=\"text-align: justify;\">There are the paths that Ibn Hajar referred to as “many” and he did not bring any more evidences.<\/p>\n<p style=\"text-align: justify;\">\nAs for Al-Zarkashi, he strengthened the narration of Shareek because it was narrated by Mohammad bin Omar Al-Rumi, and in the process ignored Al-Tirmithi who said, “This narration is not known to have been narrated by any reliable narrators from Shareek.” Al-Zarkashi said, “This Mohammad (Al-Rumi) was used by Al-Bukhari (in his Saheeh).”<\/p>\n<p style=\"text-align: justify;\">\nHowever, when returning to the Saheeh, and going through books that compiled the narrators of Saheeh Al-Bukhari, we find no trace of Mohammad bin Omar Al-Rumi.<\/p>\n<p style=\"text-align: justify;\">\nTherefore, we have no choice but to reject this hadith as a fabrication.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 3: Challenge to RevisitingTheSalaf.org<\/strong><\/p>\n<p style=\"text-align: justify;\">RTS said at the end of their article:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Imam Alee (a.s) was the transmitter of the Prophet&#8217;s (saw) correct Sunnah after him, and thereafter the other Imams (a.s) from the Ahlulbayt (a.s) only transmitted from him. Everything must pass through only Imam Alee (a.s), to ultimately reach the Messenger of the Lord of the worlds. We see that the Shi&#8217;a books fulfill this criterion and almost all Hadeeth go through Imam Alee (a.s) back to the Prophet (saw).<\/span><\/p>\n<p style=\"text-align: justify;\">We decided to this claim to the test and went through the first few chapters in Al-Kafi, up until Kitab Al-Hujjah, meaning the first four hundred and twenty-seven hadiths (427). At the end, we only found two narrations authentically attributed to Ali. The first is in the chapter of Sifat Al-Ulama’a and the second is in the chapter of Bida’. Based on this little study, less than one percent of the narrations have been authentically attributed to Ali.<\/p>\n<p style=\"text-align: justify;\">\nIt is due to this that we call out RevisitingtheSalaf.org and ask them to retract from this shameful lie, or to take us up on the challenge and prove that “almost all Hadeeth go through Imam Alee,” for less than one percent hardly qualifies as “almost all”.<\/p>\n<p style=\"text-align: justify;\">Secondly the text of this Hadith itself makes no sense, wasn&#8217;t Rasul-Allah (saw) sent for all mankind? If so then why must we go to his cousin only, and seek knowledge only from him?<\/p>\n<p style=\"text-align: justify;\">May Allah guide the Imami Rafidhah,<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to RevisitingtheSalaf.org’s article “The Door to the City of Knowledge”. The article was published on the 25th of November, 2013, and can be found here. Section 1: Differences of Opinions between the Scholars Regarding the <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/14\/response-to-the-door-to-the-city-of-knowledge\/\" title=\"Response to: The Door to the City of Knowledge\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[6,1],"tags":[],"class_list":{"0":"post-922","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fadhail","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/922","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=922"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/922\/revisions"}],"predecessor-version":[{"id":947,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/922\/revisions\/947"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=922"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=922"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=922"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}