{"id":925,"date":"2014-02-14T20:54:01","date_gmt":"2014-02-14T20:54:01","guid":{"rendered":"http:\/\/twelvershia.net\/?p=925"},"modified":"2015-01-11T07:55:40","modified_gmt":"2015-01-11T07:55:40","slug":"accuracy-in-judging-a-narrators-reliability-sunnah-vs-shia","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/14\/accuracy-in-judging-a-narrators-reliability-sunnah-vs-shia\/","title":{"rendered":"Accuracy in judging a narrator&#8217;s reliability &#8211; Sunnah vs Shia"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=925\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">al-Salamu `Aleykum wa Rahmatullah wa Barakatuhu,<\/p>\n<p style=\"text-align: justify;\">I stumbled upon this yesterday when reading one of Yahya bin Ma`een&#8217;s books.<\/p>\n<p style=\"text-align: justify;\">He said in his book when commenting on a narrator called Shu`bah:<\/p>\n<blockquote><p>[These are the names of those that Shu`ba heard from from the Kufis that Sufiyan didn&#8217;t hear from:<\/p>\n<p>Sayyar Abu Al-Hakam &#8211; Hajjaj bin Omar Al-Muharibi &#8211; Al-Waleed bin Al-Aizar &#8211; Abdullah bin Abi Al-Mujalid &#8211; Muhil bin Khalifa &#8211; Abu Bakr bin Hafs &#8211; Abdullah bin Jabr &#8211; Abu Ziyad Al-Tahhan &#8211; Al-Hakam bin Utaiba &#8211; Yahya bin Al-Husain &#8211; Nu&#8217;aim bin Abi Hind &#8211; Habeeb bin Al-Zubair &#8211; Ammar Al-Absi &#8211; Abu Ma&#8217;shar.&#8221;<\/p>\n<p>Al-Duri then asked Yahya: &#8220;How many narrations Shu`bah narrated from Abi Ma`shar?&#8221;<\/p>\n<p>Yahya said: &#8220;Two hadiths.&#8221;<\/p>\n<p>Yahya then continued: &#8220;A&#8217;ith bin Nusaib &#8211; Uqba bin Huraith &#8211; Abu Al-Mukhtar Hayyan Al-Bariqi &#8211; Za&#8217;idah bin Umair &#8211; Al-A&#8217;alaa&#8217; bin Badr &#8211; Abu Al-Safar Najia &#8211; Ali bin Mudrik &#8211; Talha bin Musrif &#8211; Al-Minhal bin Amr &#8211; Adi bin Thabit &#8211; Yahya Al-Bihrani &#8211; Simak Al-Hanafi &#8211; Sa&#8217;eed bin Abi Burda &#8211; Asim bin Amr Al-Ghanawi.&#8221;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">It is amazing that this amount of detailed information was gathered about the Sunni narrators of Hadith by their scholars, this pushed me to write this short piece that I am sharing with all our dear readers.<\/p>\n<p style=\"text-align: justify;\">The reliability or should I say quality of the narrator, reflects the quality and reliability of the report. The Muslims take their religion and their beliefs from the various books of Hadith which they deem reliable and popular and authoritative, these books contain many reports, some reports contradict other reports, some are un-Islamic beliefs, some are fabrications and lies, some are authentic and correct, others correct in meaning but not accurate in text and so on and so forth&#8230;<\/p>\n<p style=\"text-align: justify;\">The most reliable of texts reaches us through the most correct of chains in the utmost of accuracy. The text that reaches us through the clearest and purest chain is more worthy of being followed than the other texts.<\/p>\n<p style=\"text-align: justify;\">We take the example of three narrations that we made up, so we can better explain this:<\/p>\n<p><span style=\"text-decoration: underline;\">Narration #1:<\/span><br \/>\n<strong>`Amr <\/strong>(Great reliable scholar) from <strong>Zayd<\/strong> (Firm reliable and popular) from <strong>Qays<\/strong> (Reliable):<br \/>\n&#8220;The Muslims defeated the Persians after three days, then chanted: Truly victory is only from Allah.&#8221;<\/p>\n<p><span style=\"text-decoration: underline;\">Narration #2:<\/span><br \/>\n<strong>Wahb<\/strong> (Trusted) from <strong>`Ali<\/strong> (Honest makes mistakes) from <strong>Qays<\/strong> (Reliable):<br \/>\n&#8220;The Muslims chanted: Victory comes from Allah, After they defeated the Persians on the second day.&#8221;<\/p>\n<p><span style=\"text-decoration: underline;\">Narration #3:<\/span><br \/>\n<strong>Sa`eed<\/strong> (Trusted with bad memory) from <strong>Sahl<\/strong> (Reliable Mudallis) from <strong>`Umar<\/strong> (Acceptable):<br \/>\n&#8220;The Muslims defeated the Persians after three weeks of brutal fighting then chanted: Ya `Ali Madad.&#8221;<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Judging the Narrators and Narrations:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">#1 All three narrators are reliable, meaning &#8220;Thiqah&#8221; which is the highest form of praise for a narrator&#8217;s quality in Hadith. The text of this narration is of the utmost in reliability.<\/p>\n<p style=\"text-align: justify;\">#2 Wahb is Saduq, meaning trustworthy but does not excel in the art of narrating, `Ali is honest so he wouldn&#8217;t lie but he makes mistakes in narrating, the third narrator is Qays, the same man in the first narration and he is Thiqah reliable. The text of this narration is good, it is &#8220;Hasan&#8221;, and the only difference between it and the first is the number of days, the first narration gets priority as it is more reliable.<\/p>\n<p style=\"text-align: justify;\">#3 Sa`eed is trusted but has bad memory, this can affect his texts. Sahl is reliable in and of himself but may make Tadlees, meaning he may not have actually heard this narration from `Umar. `Umar as a narrator is barely acceptable, he doesn&#8217;t lie, but he isn&#8217;t reliable either. The text of the narration appears completely different, the period of 2-3 days is suddenly stretched to two weeks! and the Du`a or chant at the end is Munkar, it opposes the others and opposes Islamic creed, this text is completely un-acceptable although none of the narrators are &#8220;liars&#8221; or &#8220;unknown&#8221; or even &#8220;weak&#8221;.<\/p>\n<p style=\"text-align: justify;\">This is a very small and primitive example to show how the quality of narrators is reflected on the quality of texts, how judging each narrator&#8217;s reliability and firmness in Hadith is key when comparing different religious and historical reports to reach the final conclusion as to what exactly happened in the event we research.<\/p>\n<p style=\"text-align: justify;\">This science is applied by Ahlul-Sunnah with excellence as they perfected it, it is used to better understand the narrations and to extract the authentic religious rulings and historical information after filtering out all the lies, the mistakes, the fabrications, the exaggerations and the inaccuracies which distort the texts.<\/p>\n<p style=\"text-align: justify;\">The Shia on the other hand by trying to mimic Ahlul-Sunnah, they tried to do the same. However, due to their negligence and ignorance and extremism, they avoided these sciences and believed in whatever they wished, and now when faced with the criticism of the opponents, they try to shovel the calamities they recorded in their books, they try to bury the mistakes and reconcile the contradictions while failing to explain many of the major conflicts in their `Aqeedah. Success was not on their side and Success is only from Allah.<\/p>\n<p style=\"text-align: justify;\">There are plenty of ways to illustrate this deficiency in the Shia Madhab and prove academically the success and great victory for Ahlul-Sunnah. I&#8217;ve read more than one study on this subject by Arab students of knowledge, each more informative than the other, each illustrating with clear evidence the weakness of the <a href=\"http:\/\/youpuncturedtheark.wordpress.com\/2013\/06\/19\/why-islamic-teachings-should-never-be-taken-from-shia-sources\/\" rel=\"external nofollow\">Shia sources<\/a>, we even started a draft for a similar study comparing the main Hadithi sources the Shia Kafi vs the Sunni Bukhari, but we have no yet published it in its entirety. This day, I chose another way to do it, a way that I expect to be InshaAllah easy to accomplish but strong in its conclusions.<\/p>\n<p style=\"text-align: justify;\">The plan is to show how Ahlul-Sunnah took great care when it came to judging their narrators and recording everything to do with their ability to narrate as opposed to the Shia who either give the man a thumbs up or a thumbs down.<\/p>\n<p style=\"text-align: justify;\">In the science of Ahlul-Sunnah, a narrator could be weak in a way that his narrations are abandoned altogether, he could be weak but his narrations are written, he could be slightly weak but strengthened with follow-ups or Mutaba`at, he could be trustworthy but with a bad memory, or reliable but got confused at the end of his life, and we are able to distinguish who heard from him before or after his confusion, a narrator could be reliable when narrating from some men but weak when narrating from others, a narrator could be reliable when narrating from his own books but weak after he lost his books when narrating from memory, a narrator could be reliable and he could have lived in the time of another reliable narrator but we know that they never met so their narration from each-other is weak, a narrator could be reliable but attributes narrations to those whom he never met, a narrator could be an innovator so whatever he exclusively narrates to support his innovation is rejected, a narrator could be honest but not very reliable in narration, a narrator could be trustworthy but makes mistakes every now and then, a narrator could be knowledgeable about the narrations and narrators of Kufa more than those of al-Sham, a narrator could have lived in the time of another but was too young to narrate from him without a middle man, a narrator could be a liar or one who is accused of lies or fabrication and so on and so forth&#8230;<\/p>\n<p style=\"text-align: justify;\">In the science of the Imamiyyah, we observe that there is no attention whatsoever to all the above, the case is usually that either they consider a man Thiqah (reliable) or Majhoul (unknown), it&#8217;s as if they just have a stamp and they stamp it on the forehead of every man like robots. The dates of birth and death are not recorded for the vast majority of their narrators which is problematic for the connectivity of the narrators, there is no information on who a man&#8217;s teachers are, any narrator can attribute anything to any other man. In fact the huge number of unknown narrators makes it obvious that unlike Ahlul-Sunnah, the Imamiyyah took their narrations from random Koufans and Qummies, most of which aren&#8217;t Imams or scholars or Huffaz, just grocers and blacksmiths and merchants and other individuals from that society. Another issue is that they invented rules to make Tawtheeq or authenticate unknown individuals, such as authenticating anyone al-Saduq praised or anyone in the chains of Tafseer al-Qummi and so on and so forth&#8230;<\/p>\n<p style=\"text-align: justify;\">So how can we quickly compare? The books of Rijal are huge and complicated, especially those of Ahlul-Sunnah?<\/p>\n<p style=\"text-align: justify;\">The answer is simple, pick a reliable book from each school that summarizes the matter.<\/p>\n<p style=\"text-align: justify;\"><strong>1- Ahlul-Sunnah wal-Jama`ah:<\/strong><\/p>\n<p style=\"text-align: justify;\">Ibn Hajar al-`Asqalani al-Shafi`i has a good small Rijali summary called Taqreeb al-Tahdheeb, in this book he mainly sums up the condition of the narrators of al-Imam al-Mezzi&#8217;s book Tahdheeb al-Kamal. al-Mezzi&#8217;s book contains the names of all the narrators from the six Sunni main books plus a lot of others that al-Mezzi decided to include as well, sadly it doesn&#8217;t contain the names of many other Sunni narrators.<\/p>\n<p style=\"text-align: justify;\"><strong>2- Imamiyyah Ithna `Ashariyyah:<\/strong><\/p>\n<p style=\"text-align: justify;\">Shaykh al-Jawahiri wrote a summary called al-Mufeed min Mu`jam Rijal al-Hadith, this book sums up the opinions of al-Khu&#8217;i in his Mu`jam Rijal al-Hadith. al-Khu&#8217;i wrote his encyclopedia to collect all the Shia narrators and document what the early Shia Rijalists said concerning each man.<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>Method of this comparative study:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">The two books we mentioned, although they&#8217;re summaries, yet they&#8217;re still quite big and going through each book from beginning to end is very time consuming. I thought of the easiest and quickest way to reach the results without sacrificing much in the accuracy of the study and without ending up with a big error margin as that would be a waste of my time.<\/p>\n<p style=\"text-align: justify;\">What I decided in the end, was to use the computer and the software as this would make the search automated and thus much quicker. How would I do this? Well as the readers know, each of the authors lists a number, then lists the name of the narrator, and next to this he states whether the man was Thiqah or Hasan-ul-Hadith or Da`eef or Majhoul etc&#8230; So I would write the word &#8220;Thiqah&#8221; in the search engine and it would give me the number of times the author ruled on the Wathaqah of a narrator. Now you ask, well this isn&#8217;t very accurate, we know for example that the Shia usually praise some of their narrators by saying &#8220;Thiqah Thiqah&#8221;, this would be counted twice for one single man! I say, this is true, the goal was never to be 100% accurate, I believe the difference will be so huge between both, and the result will be so clear, that such small exceptional cases would not affect the study, the error margin wouldn&#8217;t be more than 3 to 6% per-my estimation, the proof is that those described as &#8220;Thiqah Thiqah&#8221; in al-Mufeed are only about 43 individuals out of around 15,678 narrators in the book, hardly 0.2%.<\/p>\n<p style=\"text-align: justify;\">The Sunni book is going to be much much harder, since there are many more terms, the author does not work in binary of Thiqah or Majhoul, so it&#8217;s tricky and I need to place much more of an effort to write its resulsts.<\/p>\n<p style=\"text-align: justify;\">With this said, InshaAllah and Bismillah we begin,<\/p>\n<p style=\"text-align: justify;\"><span style=\"text-decoration: underline;\"><strong>The Results:<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">NOTE: These are all not 100% accurate, so keep this in mind since I don&#8217;t want to keep repeating &#8220;around this or that much&#8221; I&#8217;ll abbreviate it with Tilde &#8220;~&#8221;.<\/p>\n<p style=\"text-align: justify;\"><strong>1- The Sunni book of Rijal, al-Taqreeb li-ibn Hajar:<\/strong><\/p>\n<p style=\"text-align: justify;\">Published by Dar al-Rasheed, Syria.<br \/>\nTotal number of Rijal: Around 8,826 men.<\/p>\n<p style=\"text-align: justify;\">There are many terms used to described narrators in the science of Ahlul-Sunnah, the matter isn&#8217;t restricted to Thiqah vs Majhoul like the Shia book, so I&#8217;ll just select a few common ones.<\/p>\n<p style=\"text-align: justify;\">Thiqah Thabt (ثقة ثبت) are ~ 137<br \/>\nThiqah (ثقة) are ~ 2,304<br \/>\nSaduq (صدوق) are ~ 1,833<br \/>\nMaqboul (مقبول) are ~ 1,522<br \/>\nLayyin (لين) are ~ 211<br \/>\nDa`eef (ضعيف) are ~ 423<br \/>\nMatrouk (متروك) are ~ 145<br \/>\nMastour (مستور) are ~ 157<br \/>\nLa Yu`raf (لا يعرف) are ~ 75<br \/>\nMajhoul (مجهول) are ~ 785<\/p>\n<p style=\"text-align: justify;\">There are many other terms which we did not write such as Thiqah Mutqin or Laysa bil-Qawi or Lahu Awham or Katheer al-Khata&#8217; etc&#8230; but these are enough to give us a clear image of what the situation is. Obviously the terms of praise range from Sahabi or Lahu Suhbah, to Imam Hafiz or Thiqah Jaleel, or Thabt and these indicate the highest forms of reliability, followed by Thiqah and it is for the reliable narrator, then Saduq or Hasan or Salih al-Hadith for the trusted narrators who aren&#8217;t renowned reliable Muhadditheen. Then terms of weakness such as &#8220;Maqboul&#8221; and he is the one whose narrations are barely acceptable, and the &#8220;Layyin&#8221; whose weakness isn&#8217;t much, and Shadeed al-Du`f or Munkar al-Hadith or Matrouk for those of extreme weakness, then after that come terms such as the &#8220;Mouttahameen&#8221; those accused of fabricating, then the Kazzab and Wadda` for fabricators and liars, and then the Mastour and Majhoul and La Yu`raf for those whose identities are not known or those whose condition is not known and so on&#8230;<\/p>\n<p style=\"text-align: justify;\">Based on the simplified list above, we see that the matter isn&#8217;t as black and white as we find in the Shia books, the author seems to have accurately placed each man in his rightful position, we find the weakness of narrators classed into several levels and so is their strength, making the process of grading Hadith deeper and richer.<\/p>\n<p style=\"text-align: justify;\"><strong>2- The Shia book of Rijal, al-Mufeed lil-Jawahiri:<\/strong><\/p>\n<p style=\"text-align: justify;\">Published by Mahillati, Iran.<br \/>\nTotal number of Rijal: Around 14,194 men. (After subtracting the term: Muttahid Ma` to reduce repetition)<\/p>\n<p style=\"text-align: justify;\">Thiqatun-Thiqah (ثقة ثقة) are ~ 40.<br \/>\nThiqah-`Ayn (ثقة عين) are ~ 43.<br \/>\nThiqah (ثقة) are ~ 1,346.<br \/>\nSaduq (صدوق) are ~ 12.<br \/>\nDa`eef (ضعيف) are ~ 234.<br \/>\nMajhoul (مجهول) are ~ 8,054.<br \/>\nMajhoulah (مجهولة) are ~ 87.<\/p>\n<p style=\"text-align: justify;\">The number of the above does not reach the total because many narrators were not judged, the author says that so and so met the Mahdi or was praised by so and so, but they don&#8217;t have a clear ruling on them, in this case they&#8217;d be Majaheel (unknowns), and many others are simply repetitions of the same person. There are also some other terms such as &#8220;Mamdouh&#8221; (praised) and Madhmoum (criticized) and Mal`oun (cursed) which are small in number so no use collecting them.<\/p>\n<p style=\"text-align: justify;\">Regarding the &#8220;Majhoul&#8221; or unknown Sunni &amp; Shia narrators, still Ahlul-Sunnah have a higher standard, because &#8220;Majhoul&#8221; according to Ahlul-Sunnah is not just one group of unknown people, they have levels and categories, from the most important are:<\/p>\n<p style=\"text-align: justify;\">1-Majhoul al-`Ayn: This is a narrator that we know nothing about except his name or age or place of residence.<\/p>\n<p style=\"text-align: justify;\">2-Majhoul al-Hal: This is a narrator whose identity is known, we know that he is a grand scholar or famous respectable historian. However, we do not know his condition when it comes to narrating.<\/p>\n<p style=\"text-align: justify;\">Most of those branded as &#8220;Majhoul&#8221; in the books of Ahlul-Sunnah are in fact famous scholars and historians, we know quite a lot about a good number of them, we just don&#8217;t know if they&#8217;re good or qualified narrators of Hadith. The Shia on the other hand have a huge group of unknown narrators, only Allah knows who they are, nothing is known about them except their names.<\/p>\n<p style=\"text-align: justify;\">As the reader can see, there is a great unbalance taking place on the Shia side, the vast majority are either Majhoul or Thiqah. Thiqatun Thiqah is the strongest praise but is very rare. Thiqah and Thiqah `Ayn are technically the same thing. Saduq or trustworthy is the rarest which exposes a deep problem in how they judge narrators and their Dhabt. There are a few weak narrators, but stumbling upon one would be unlikely. The Majaheel whether male or female are abundant, they make up the vast majority. There are about thirty or so narrators that are &#8220;praised&#8221; which is another form of Majhoul, another thirty or forty are criticized by the Imams or cursed.<\/p>\n<p>&#8211; end &#8211;<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>al-Salamu `Aleykum wa Rahmatullah wa Barakatuhu, I stumbled upon this yesterday when reading one of Yahya bin Ma`een&#8217;s books. He said in his book when commenting on a narrator called Shu`bah: [These are the names of those that Shu`ba heard <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/14\/accuracy-in-judging-a-narrators-reliability-sunnah-vs-shia\/\" title=\"Accuracy in judging a narrator&#8217;s reliability &#8211; Sunnah vs Shia\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[11,1],"tags":[],"class_list":{"0":"post-925","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-articles","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/925","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=925"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/925\/revisions"}],"predecessor-version":[{"id":1625,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/925\/revisions\/1625"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=925"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=925"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=925"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}