{"id":942,"date":"2014-02-19T13:58:42","date_gmt":"2014-02-19T13:58:42","guid":{"rendered":"http:\/\/twelvershia.net\/?p=942"},"modified":"2014-02-19T14:01:44","modified_gmt":"2014-02-19T14:01:44","slug":"response-to-shiapens-biography-of-mohammad-bin-omar-al-waqidi","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/19\/response-to-shiapens-biography-of-mohammad-bin-omar-al-waqidi\/","title":{"rendered":"Response to ShiaPen’s biography of Mohammad bin Omar Al-Waqidi"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=942\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response to ShiaPen’s biography on Mohammad bin Omar Al-Waqidi, which can be found<a href=\"http:\/\/www.shiapen.com\/biographies\/muhammad-al-waqidi.html\" rel=\"external nofollow\"> here<\/a>.<\/p>\n<p style=\"text-align: justify;\">Mohammad bin Omar bin Waqid Al-Waqidi Al-Aslami was an infamous historian from the second century AH. A large portion of the fabrications that we currently find in our history books today, whether it may be in the books of history or hadith come from his path alone. This is simply due to the fact that Al-Waqidi, unlike other liars of his time, was good at covering it up. Due to this, there was no consensus that the man fabricated traditions, even though this is the correct opinion since it is held by the major Rijali scholars that were his contemporaries.<\/p>\n<p style=\"text-align: justify;\">To get a better perspective of this, we shall quote the opinions of those that declared him a liar:<\/p>\n<p style=\"text-align: justify;\">-Ahmad bin Hanbal said: He is a liar.<\/p>\n<p style=\"text-align: justify;\">-Yahya bin Ma’een said: He used to take the hadith of Ma’amar and attribute it to Yunus; he is not trustworthy.<\/p>\n<p style=\"text-align: justify;\">-Ali bin Al-Madeeni said: Al-Haytham bin Adi is more reliable than Al-Waqidi, and I don’t take hadiths, genealogy, or anything from him.<\/p>\n<p style=\"text-align: justify;\">-Al-Shafi’ee said: All his books are lies.<\/p>\n<p style=\"text-align: justify;\">-Al-Nasa’ee included him as one of the four infamous liars.<\/p>\n<p style=\"text-align: justify;\">-Abu Dawud: I have no doubts that he fabricated hadiths.<\/p>\n<p style=\"text-align: justify;\">-Ishaq bin Rahawaih said: He is a fabricator of narrations.<\/p>\n<p style=\"text-align: justify;\">-Abu Hatim said: He fabricated.<\/p>\n<p style=\"text-align: justify;\">All of the above quotes can be found in the Tahdheebayn (Tahdheeb al-Kamal &amp; Tahdheb al-Tahdheeb). Moreover, these statements do not include other ambiguous statements of weakening, like, “We didn’t narrate from him,” or “he is weak,” even though such words fit in the realm of “liar”. However, we purposefully chose some of the harshest criticisms to not leave a fragment of doubt in the minds of the objective reader. Also, note that we didn’t quote the opinions of other scholars that are not experts in Rijal. For those quotes, refer to Mizan Al-I’itidal and the Tahdheebayn.<\/p>\n<p style=\"text-align: justify;\">To counter this, ShiaPen decided to quote the opinions of some other early hadithsts who were known to have praised Al-Waqidi. These include:<\/p>\n<p style=\"text-align: justify;\">Mohammad bin Sallam Al-Jumahi, Ibrahim Al-Harbi, Mujahid bin Musa, Mus’ab Al-Zubairi, and Ibn Sa’ad.<\/p>\n<p style=\"text-align: justify;\">Firstly, there is a difference of opinion as to whether Al-Jumahi is reliable in the first place. Abu Khaithama said that people shouldn’t narrate hadiths from him.<\/p>\n<p style=\"text-align: justify;\">Secondly, Mujahid bin Musa, we don’t find him commenting on Al-Waqidi’s trustworthiness, but rather, on his ability to memorize.<\/p>\n<p style=\"text-align: justify;\">He said:<\/p>\n<p style=\"text-align: justify;\">ما كتبنا عن أحد أحفظ من الواقدي<\/p>\n<p style=\"text-align: justify;\">[We never narrated from anyone who memorizes more than al-Waqidi.]<\/p>\n<p style=\"text-align: justify;\">And as you all know a Hafiz or when someone is described as Hafiz this doesn&#8217;t equate to Thiqah (reliable).<\/p>\n<p style=\"text-align: justify;\">As for Mus’ab, Al-Darawardi, Al-Harbi, Al-Saghani, and Ibn Sa’ad, then they are nowhere as close to their earlier Imams in their knowledge of Hadith or Rijal. With the exception of Ibn Sa’ad, none of them are famous for being Rijali scholars either.<\/p>\n<p style=\"text-align: justify;\">ShiaPen also collect statements from late scholars, in order to prove that Al-Waqidi is reliable, or rather, those that denied that Al-Waqidi is a liar. This is the opinion of Al-Khateeb, Al-Dhahabi, Ibn Katheer, and Ibn Hajar.<\/p>\n<p style=\"text-align: justify;\">Note: Ibn Hajar refers to Al-Waqidi as a liar in Lisan Al-Mizan 5\/83.<\/p>\n<p style=\"text-align: justify;\">However, we reject these opinions because they are overruled by eye-witness accounts and contemporaries of Al-Waqidi. Not only that, but those that called Al-Waqidi a liar are the main Imams of the field, and those that come after them have little choice but to rely on their predecessors when coming up with rulings regarding the status of narrators.<\/p>\n<p style=\"text-align: justify;\">One ironic matter in the response is the mistranslation in Al-Dhahabi’s biography for Al-Waqidi:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">الواقدي * حمد بن عمر بن واقد الاسلمي مولاهم الواقدي المديني القاضي، صاحب التصانيف والمغازي، العلامة الامام أبو عبد الله، أحد أوعية العلم على ضعفه المتفق عليه.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“Muhammad bin Umar bin Waqid al-Aslami al-Madini, the judge, an author of many books and Maghazi, the Allamah, the Imam, Abu Abdullah, one of the containers of knowledge despite his agreeing on weak reports.”<\/span><\/p>\n<p style=\"text-align: justify;\">The last line actually translates to: &#8220;He is one of the containers of knowledge, even though there is an agreement regarding his weakness (in narrations).&#8221;<\/p>\n<p style=\"text-align: justify;\">Ironically, ShiaPen also quote Ibn Al-Nadeem, who said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Great Sunni biographer Ibn Nadeem records about al-Waqidi:<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">عالما بالمغازي والسير والفتوح واختلاف الناس في الحديث والفقه والأحكام والأخبار<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“He was a savant in Maghazi, Futuh (conquers), Siyar and the disagreements between the people on Hadiths, Fiqh, Ahkam (rulings) and narrations” <\/span><br \/>\n<span style=\"color: #800000;\">Al-Fehrist, page 144<\/span><\/p>\n<p style=\"text-align: justify;\">However, when returning to Al-Fihrist, we find:<\/p>\n<p style=\"text-align: justify;\">“He had Tashayyu, and was from a good Madhhab, and acted out in Taqiyyah.”<\/p>\n<p style=\"text-align: justify;\">As we can see from the above, Ibn Al-Nadeem was a Shi’ee as well, for how can someone praise someone for acting like a Sunni and call that a “good Madhhab” if he was a Shi`ee? This is the conclusion of Ibn Hajar too in Lisan Al-Mizan 5\/83.<\/p>\n<p style=\"text-align: justify;\">ShiaPen have more up their sleeve though. They propagated a view that is held by some scholars by mentioning the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Our prudent readers, whether they are Sunni or Shia should understand the difference between various fields such as Hadith, Fiqh, Tafsir, Qirat, Lughat and History, and should not be trapped by the filthy propagandas of the present day Nawasib, since it is not necessary that a person who is deemed an authority in one of these fields shall be an authority in anothers also.<\/span><br \/>\n<span style=\"color: #800000;\">Waqidi may have been criticized for his work in the field of ‘hadith’ but as far as ‘history’ is concerned, scholars have graded Waqidi extremely Thiqa. The Ahle-Hadeeth in this regard deem him highly truthful, particularly in the light of the accreditation by his student Imam Ibn Sa’ad. Ahle-Hadeeth have called him weak in the field of ‘hadith’ but only those hadith pertaining to injunctions such as Halal and Haram (Ahkam). Those that have graded him weak in hadith, didn’t do so because of his narrations but due his mixing-up the chain of narrations.<\/span><\/p>\n<p style=\"text-align: justify;\">The above is wishful thinking. A person that has been branded as a liar will always be a liar, no matter what field they write or teach about. Someone who lies in hadith does not magically turn into saint when he narrates history.<\/p>\n<p style=\"text-align: justify;\">We find that the earlier scholars were aware of this, as we have quoted previous, Ali bin Al-Madeeni said that he wouldn’t accept genealogy from him, which is even less important than history. Al-Shafi’ee too referred to his books as lies, and Al-Waqidi has over twenty-five books, and none of them are hadith compilations, but are all books of history.<\/p>\n<p style=\"text-align: justify;\">Furthermore, those that held the view that Al-Waqidi is reliable in history only held this belief since they accepted him as truthful and denied that he is a liar. We do not find anyone admitting that he is a liar and then saying that his historical accounts are acceptable.<\/p>\n<p style=\"text-align: justify;\">In conclusion, al-Waqidi is an unreliable historian, whatever he narrates from history has to be double checked from other reliable sources, otherwise it is only a &#8220;story&#8221;.<\/p>\n<p style=\"text-align: justify;\">Note: ShiaPen also continued by quoting Hasan Farhan Al-Maliki. They refer to him as a Salafi\/Wahabi scholar. However, Al-Maliki has clearly said in a TV debate with Ibrahim Al-Faris that he was not a Sunni let alone &#8220;Wahhabi\/Salafi&#8221;.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to ShiaPen’s biography on Mohammad bin Omar Al-Waqidi, which can be found here. Mohammad bin Omar bin Waqid Al-Waqidi Al-Aslami was an infamous historian from the second century AH. A large portion of the fabrications <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/19\/response-to-shiapens-biography-of-mohammad-bin-omar-al-waqidi\/\" title=\"Response to ShiaPen’s biography of Mohammad bin Omar Al-Waqidi\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-942","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/942","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=942"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/942\/revisions"}],"predecessor-version":[{"id":945,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/942\/revisions\/945"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=942"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=942"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=942"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}