{"id":949,"date":"2014-02-24T21:27:25","date_gmt":"2014-02-24T21:27:25","guid":{"rendered":"http:\/\/twelvershia.net\/?p=949"},"modified":"2015-11-11T12:19:42","modified_gmt":"2015-11-11T12:19:42","slug":"response-to-why-didnt-the-prophet-of-allah-p-highlight-the-issue-of-complaints-against-imam-ali-as-at-arafat","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/24\/response-to-why-didnt-the-prophet-of-allah-p-highlight-the-issue-of-complaints-against-imam-ali-as-at-arafat\/","title":{"rendered":"Response to: WHY DIDN&#8217;T THE PROPHET OF ALLĀH (P) HIGHLIGHT THE ISSUE OF COMPLAINTS AGAINST IMĀM  &#8216;ALĪ (as) AT &#8216;ARAFĀT?"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=949\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a response by Ebn Hussein (edited by Hani al-Tarabulsi) to the article on the Ghadir786 website, which was entitled: WHY DIDN&#8217;T THE PROPHET OF ALLĀH (P) HIGHLIGHT THE ISSUE OF COMPLAINTS AGAINST IMĀM  &#8216;ALĪ (as) AT &#8216;ARAFĀT? which can be found <a href=\"http:\/\/www.ghadir786.com\/articles\/our-refutations\/why-didn-t-the-prophet-of-allah-p-highlight-the-issue-of-complaints-against-imam-ali-as-at-arafat\/\" rel=\"external nofollow\">here<\/a> &amp; <a href=\"http:\/\/www.ghadir786.com\/articles\/our-refutations\/response-to-haq-char-yaar-site-why-didn-t-the-prophet-of-allah-p-highlight-the-issue-of-complaints-against-imam-ali-as-at-arafat\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">We begin with their first blunder in their bad article, a blunder caused by their blind mimicking of their leaders such as this one:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/02\/Tafsir.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-953 alignleft\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/02\/Tafsir-1024x453.png\" alt=\"Tafsir\" width=\"1024\" height=\"453\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/Tafsir-1024x453.png 1024w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/Tafsir-300x132.png 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/Tafsir.png 1110w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">Their Ayatullah  Nasir Makarim al-Shirazi wrote in the fourth volume of his book &#8220;al-Amthal fi Tafsir Kitab Allah&#8221;:<\/p>\n<blockquote><p>This area (Ghadir) was in fact a gathering place that was located in between FOUR paths from where the PILGRIMS OF HAJJ departed from and headed towards their homelands. The northern path leads to Madinah, another one to Iraq and the <span style=\"color: #ff0000;\"><strong>western path leads to Egypt and the southern part leads to Yemen<\/strong><\/span>. There is no doubt that at this location (Ghadir) the most imporant of all important matters of this journey (of Hajj) must have occured and it was upon the Muslims to meet their final obligation or the last stage of the successful mission that the Prophet had undertaken (صل الله عليه و آله و سلم) [&#8230;]<\/p><\/blockquote>\n<p style=\"text-align: justify;\">The fallacy and\/or deception of this &#8216;Ayatullah&#8217;:<\/p>\n<p style=\"text-align: justify;\">Ghadir Khum was NOT a major gathering place for Hajj pilgrims and anyone who knows about the geography of the Arabian peninsula will acknowledge that, just take a look at the map to discover the truth without bias:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/02\/Ghadir.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-951\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/02\/Ghadir.png\" alt=\"Ghadir\" width=\"488\" height=\"548\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/Ghadir.png 488w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/Ghadir-267x300.png 267w\" sizes=\"auto, (max-width: 488px) 100vw, 488px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">Above you see the reality, the location of Ghadir Khum, despite that the Shias claim that this place was the major gathering place of the Muslims after Hajj! They seriously claim that the Muslims of Yemen and other southern parts of Arabia traveled over 170 km (in fact more, remember this is the straight-line distance!) from Makkah (where they performed the last Hajj with the Prophet) to a pond at Ghadir which was in the completely wrong direction, only then to travel back all the way to Yemen. Why didn&#8217;t the Prophet (saw) address them during his farewell speech at `Arafah in Makkah? What about the people of Makkah themselves? Will the Shia seriously claim that they left the city of Hajj (Makkah), just to travel back north to rest at a pond in Ghadir?<\/p>\n<p style=\"text-align: justify;\">Usually a resting place would be along the way, NOT IN THE OPPOSITE DIRECTION! But according to the Shia geniuses, they went all the way up north (at least 170 km) just to travel back (again 170 km i.e. altogether almost 400 km, that would take them WEEKS!) to Makkah?! Why didn’t the Prophet (saw) address the poor Makkan’s in MAKKAH, at Arafah during his last Hajj, during his Farewell sermon, they were all present there!<\/p>\n<p style=\"text-align: justify;\">What about the people of al-Ta&#8217;if? The big tribe of bani Thaqif, they live south-east of Makkah, what happened to them? They had no right to know of this secret successor-ship of `Ali (ra)? As some readers may be aware, when the Arabs surrounding Makkah and Madinah rejected Islam after the Prophet (saw) died, bani Thaqif were from the tribes that remained loyal to Islam and fought against the renegades.<\/p>\n<p style=\"text-align: justify;\">If the message of Ghadir (so called appointment of `Ali Ibn Abi Talib (ra) as the successor of the Prophet) was a message to ALL Muslims then the Prophet (saw) could have simply addressed everyone in Makkah, during his farewell!<\/p>\n<p style=\"text-align: justify;\">Maybe the Shia writers at Ghadir666 would not understand our argument since they brain-dead, so let us explain to them in their own language what sort of lunatic argument they&#8217;re presenting: It&#8217;s a if we&#8217;re saying that the polytheist Shia of Bahrain, when traveling or crawling to the land of Karbala in `Iraq, to eat from its soil and worship its graves, after finishing their loathsome rituals decide to head back home, so they travel all the way up  to some so called &#8220;major gathering place for all pilgrims&#8221; in Armenia, making their trip home twice as long, then travel south back home to Bahrain!<\/p>\n<p style=\"text-align: justify;\">Point is NO, this Ghadir was not in any way a &#8220;major gathering point&#8221;, it was simply a resting place, probably one out of many, for the people traveling north to Madinah.<\/p>\n<p style=\"text-align: justify;\">And when we say &#8220;probably one out of many&#8221; we really do mean this, for instance al-Zamakhshari in his geography book &#8220;al-Jibal wal-Amkinah wal-Miyah&#8221; states the number of &#8220;waters&#8221; or resting places having water, between Makkah and Yanbu`, check this map to see what we mean:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/06\/612px-Yanbu_Saudi_Arabia_locator_map.png\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-438\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2013\/06\/612px-Yanbu_Saudi_Arabia_locator_map.png\" alt=\"612px-Yanbu,_Saudi_Arabia_locator_map\" width=\"612\" height=\"600\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/06\/612px-Yanbu_Saudi_Arabia_locator_map.png 612w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/06\/612px-Yanbu_Saudi_Arabia_locator_map-300x294.png 300w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2013\/06\/612px-Yanbu_Saudi_Arabia_locator_map-62x62.png 62w\" sizes=\"auto, (max-width: 612px) 100vw, 612px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">He lists as resting places between the two:<\/p>\n<p style=\"text-align: justify;\">al-`Udhaybah, al-Usayfir, al-Tuwi, al-Buhayr, al-Ratqah, Qubab, al-Turayf, al-Nabi`, al-Shubaykah, al-Juhfah, Ghadir Khum, al-As`adanah, al-Turayfah etc&#8230;<\/p>\n<p style=\"text-align: justify;\">You get the idea, these were mainly resting places for travelers, they weren&#8217;t &#8220;major gathering points&#8221;, not at all.<\/p>\n<p style=\"text-align: justify;\">But if we were to speak of major gathering points, the Prophet (saw) already specified them, in Sahih al-Bukhari and Sahih Muslim we read:<\/p>\n<blockquote><p>Ibn &#8216;Abbas (ra) narrated that the Messenger of Allah (saw) specified for the people of Madinah, DhulHulaifah (a place 540 km to the north of Makkah) as miqat. For those coming from ash-Sham (including Syria, Jordan and Palestine), he specified al-Juhfah (a place 187 km to the north-west of Makkah and close to Rabigh, where they now perform their Ihram). For those coming from Najd, he specified Qran al-Manazil, (a mountain, 94 km to the east of Makkah, overlooking &#8216;Arafah. For those coming from Yemen, he specified Yalamlam (a mountain 54 km to the south of Makkah. These places are for the people (coming from the above specified countries) as well as for others, who pass by them on their way to perform Hajj or ’Umrah. Those living within those boundaries can assume Ihram from where they set out (for the journey), and even the residents of Makkah, their Miqat would be the place where they are staying in Makkah.’<\/p><\/blockquote>\n<p style=\"text-align: justify;\">I don&#8217;t see Ghadir Khum, being a major gathering point for anything.<\/p>\n<p style=\"text-align: justify;\">In fact, we read that it wasn&#8217;t very &#8220;major&#8221; in Bihar al-Anwar on the chapter of Hujjat-ul-Wada`, The narration says:<\/p>\n<p>وقفل إلى المدينة وهو معه والمسلمون حتى انتهى إلى الموضع المعروف بغدير خم وليس بموضع إذ ذاك يصلح للمنزل لعدم الماء فيه والمرعى<\/p>\n<p>[And he (saw) left to Madinah (after Hajj) and he (`Ali) was with him and the (rest of) the Muslims, until he reached a location known as Ghadeer Khum, and it wasn&#8217;t back in those times a suitable location for resting, as it had no water or grass (to feed the camels).]<\/p>\n<p style=\"text-align: justify;\">So if it weren&#8217;t such a great location for resting, then how can it be a &#8220;Major gathering point&#8221;?<\/p>\n<p style=\"text-align: justify;\">We go back to the saying of their Ayatullah Nasir al-Shirazi, he said that Ghadir Khum is a &#8220;Western path to Egypt and a southern path to Yemen.&#8221;<\/p>\n<p style=\"text-align: justify;\">This ignorant Shia scholar, he doesn&#8217;t know that Egypt in the days of the Prophet (saw) had no significant Muslim population if at all, so why did he claim it was a &#8220;major pathway to Egypt&#8221;?<\/p>\n<p style=\"text-align: justify;\">The answer is that he is fooling his readers, he&#8217;s trying to portray Ghadir Khum as being an important gathering point when it isn&#8217;t.<\/p>\n<p style=\"text-align: justify;\">Even one of the most known Egyptians in the Prophets time i.e. his CONCUBINE (note she was NEVER his wife), Mariyah Al-Qibtiyyah (ra) was a later convert to Islam. She (like ALL Egyptians) was an Egyptian Coptic Christian (a slave who was sent as a gift from Muqawqis, a Byzantine official to the Prophet). We aren&#8217;t saying that there weren&#8217;t any companions of Egyptian origins or any living near that land, what we are saying is that according to the consensus of historians, Egypt wasn&#8217;t opened yet to Muslims and had pretty much no Muslims population whatsoever. Egypt would later be opened during the time of Ameer al-Mu&#8217;mineen `Umar al-Farouq (ra), so saying that Khum was a major gathering point for Egyptians is nothing short of a lie.<\/p>\n<p style=\"text-align: justify;\">Now you might understand why the Rafidha try SO hard to prove that Ghadir was a MAJOR place of gathering for ALL Muslims after the Hajj! After all the Rafidha claim that the Prophet (saw) declared the most important tenant of belief i.e. the Wilayah of `Ali at Ghadir so of course it must have been an important place, THE most important gathering place!<\/p>\n<p style=\"text-align: justify;\">The problem for the Rafidha is that Ghadir according to reality and ANY sane human being observer (Muslims or non-Muslim) who knows about Arabia and is able to count two and two together is certainly NOT a major gathering point of ALL pilgrims, neither for the Yemenis who were certainly not as deprived of intellect as the Rafidha to travel approx. 200 km (!) up north after their Hajj in Makkah, just to head back south to Yemen, nor for the imaginary Egyptian Muslims who did not even exist back then! Ghadir at the Prophets time was only important for the people of MADINAH and among them were some who had issues with `Ali and this is why the Prophet delivered his speech about the virtues of `Ali (man kuntu mawla &#8230;) at GHADIR and NOT at the REAL MASSIVE gathering place of ALL Muslims (i.e. Makkah, Hajj). He did not delivered it at Hajj because it was NOT that important, certainly not for ALL the pilgrims at Hajj (because only some people of Madinah had issues with `Ali that is why only THEY were addressed with &#8216;man kuntu mawla &#8230;&#8217; at Ghadir). Imagine, at the farewal speech the Prophet (peace be upon him) talked about MANY issues, even in detail, he (saw) talked about<\/p>\n<p style=\"text-align: justify;\">-Usury (Interest).<\/p>\n<p style=\"text-align: justify;\">-The importance of worshiping Allah, saying your five daily prayers (Salah), fasting during the month of Ramadan, giving charity (Zakat) and performing pilgrimage.<\/p>\n<p style=\"text-align: justify;\">-The guidance of the Qur&#8217;an.<\/p>\n<p style=\"text-align: justify;\">-Treatment of women with kindness as they are under our protection.<\/p>\n<p style=\"text-align: justify;\">-Equality among all (blacks, white, Arabs, non-Arabs, etc.)<\/p>\n<p style=\"text-align: justify;\">Yet no word about the so called divine Imams who are superior to past messengers or that we must obey only `Ali&#8217;s (ra) descendants as they cannot err.<\/p>\n<p style=\"text-align: justify;\">In an desperate attempt to explain the disaster and earthquake that always shakes the foundation of their entire baseless belief they have written a &#8216;refutation&#8217; named:<\/p>\n<p style=\"text-align: justify;\">WHY DIDN&#8217;T THE PROPHET OF ALLĀH (P) HIGHLIGHT THE ISSUE OF COMPLAINTS AGAINST IMĀM &#8216;ALĪ (as) AT &#8216;ARAFĀT?<\/p>\n<p style=\"text-align: justify;\">This is not just a good question put forth by smart Muslims, but in fact it breaks the neck of every Rafidhi. So enjoy their desperate attempt to explain how the Prophet could have missed or chosen to miss the opportunity of declaring `Ali&#8217;s Wilayah at the Hajj.<\/p>\n<p style=\"text-align: justify;\">Ghadir666.com said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Think of it, how could the Prophet of Allāh (P) have avoided mentioning the matter of befriending or loving Imām &#8216;Alī (as) at &#8216;Arafāt <strong>but did so at Ghadīr al-Khum, a place some 250 km away from Makkah?<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">Because loving and befriending `Ali (ra) and supporting him was an issue raised by some of the soldiers under `Ali (ra), this topic was opened during the way back and the Prophet (saw) adressed them at Ghadir Khum.<\/p>\n<p style=\"text-align: justify;\"> Buraydah (ra) was one of those soldiers and after the Prophet (saw) said what he said, Buraydah stated:<\/p>\n<p style=\"text-align: justify;\">فما كان من الناس أحد بعد قول النبي صلى الله عليه وسلم أحبّ إليّ من عليٍّ<\/p>\n<p style=\"text-align: justify;\">[&#8220;After the messenger (saw) said this, none of the people were more beloved to me than `Ali.&#8221;]<\/p>\n<p style=\"text-align: justify;\">Even `Ali ibn abi Talib (ra) himself, when Abu Bakr (ra) received the Khilafah he didn&#8217;t go to him and tell him &#8220;The Prophet (saw) appointed me by saying Man Kuntu Mawlahu&#8221;.<\/p>\n<p style=\"text-align: justify;\">He gave him Bay`ah and gave Bay`ah to those after him, then when Mu`awiyah (ra) and the Khawarij fought against `Ali (ra), he reminded them that they must love him and be loyal to him, it is then that he mentioned it, it is narrated from him:<\/p>\n<p style=\"text-align: justify;\">سمعتُ عليَّ بنَ أبي طالبٍ يقولُ على منبرِ الكوفةِ إنِّي منشِدٌ اللَّهَ رجُلًا ولا أنشُدُ إلَّا أصحابَ محمَّدٍ صلَّى اللَّهُ عليهِ وسلَّمَ مَن سمِعَ رسولَ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ يقولُ يومَ غديرِ خُمٍّ من كنتُ مولاهُ فعليٌّ مولاهُ اللَّهمَّ والِ من والاهُ وعادِ من عاداهُ فقامَ ستَّةٌ من جانبِ المنبرِ , وستة من الجانِبِ الآخرِ , فشهِدوا أنَّهم سمِعوا رسولَ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ يقولُ ذلكَ<\/p>\n<p style=\"text-align: justify;\">[I heard `Ali ibn abi Talib say on the Mimbar of Kufa, By Allah I ask you, O companions of Muhammad (saw), whomever of you heard the messenger (saw) of Allah say on the day of Ghadir Khum &#8220;Man Kuntu Mawlahu `Aliyun Mawlahu etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">So twelve men stood and they affirmed this, the point was that his opponents have no right in fighting him or hating him, they are ordered to love and befriend him. On the other hand, `Ali (ra) didn&#8217;t face `Umar (ra) and say: &#8220;You&#8217;re an illegitimate leader, step down, the Prophet (saw) appointed me on the day of Ghadir by saying Man Kuntu Mawlahu&#8230;&#8221;<\/p>\n<p style=\"text-align: justify;\">Ghadir666 says about this:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">What a poor response! The Prophet of Allāh (P) could still have &#8220;PRIMARILY&#8221; addressed the group in question at &#8216;Arafāt while keeping in view the larger audience and not necessarily at Ghadīr al-Khum since the difference would only have been between the number of attendants at both locations and nothing more.<\/span><\/p>\n<p style=\"text-align: justify;\">It&#8217;s a neck-breaker and not a poor response. Why on earth shall the Prophet (saw) bother THOUSANDS of Muslims with `Ali ibn Abi Talib and his issue with the army?! In `Arafah he talked about the Qur&#8217;an and Hajj and Salat and the fundamentals, why open a topic that many may not understand? If he were to bring up such a topic at `Arafah with the thousands of companions being present, they would be confused, why suddenly bring up `Ali (ra) in the middle of the speech? Whereas the speech of Khum was specifically for `Ali (ra), it addressed his issue, then at the end of it we were reminded to take care of all his household, since <a href=\"http:\/\/twelvershia.net\/2013\/10\/26\/hadith-of-thaqalayn\/\" rel=\"external nofollow\">Thaqalayn<\/a> was also a part of the sermon of Ghadir.<\/p>\n<p style=\"text-align: justify;\">Rafidha should know that these desperate attempt won&#8217;t distract anyone from the disaster that their minds will never digest i.e. that the Prophet (saw) did NOT talk about `Ali and his Wilayah in particular at the Hajj!<\/p>\n<p style=\"text-align: justify;\">Ghadir666 says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">He (P) knew best how to deliver his messages and had always done so and since he SEPARATED the two SERMONS (&#8216;Arafāt and al-Ghadīr) in question, that implies he must have had a very good reason in doing so, which sides with our interpretation of leadership over friendship given the fact that the former view is refreshing to the mind and much plausible whereas the latter is absurd and unreasonable.<\/span><\/p>\n<p style=\"text-align: justify;\">They think it&#8217;s reasonable to believe that the Prophet (saw) mentioned woman rights, racism, usury and what not.. yet failed to mention the Wilayah of `Ali at the Hajj! &#8220;So that the matter of &#8220;Leadership&#8221; does not become lost among many other statements that were made at &#8216;Arafat!&#8221;<\/p>\n<p style=\"text-align: justify;\">Yes brothers and sisters, the Shia argument put forth by Ghadir786, is that if the Prophet (saw) mentioned who his appointed successor was in the farewell sermon, in front of the whole nation, in Makkah the heart of Islam, during his last pilgrimage, what would happen is that the people would&#8217;t pay attention and miss out on this appointment.<\/p>\n<p style=\"text-align: justify;\">Ghadir666 says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The truth is that the Prophet of Allāh (P) chose a different location <strong>so that the matter of &#8220;Leadership&#8221;does not become lost amongst many other statements that were made at &#8216;Arafāt.<\/strong><\/span><\/p>\n<p style=\"text-align: justify;\">This has got to be a joke!<\/p>\n<p style=\"text-align: justify;\">And because of this joke, most of the nation never heard this so called &#8220;appointment&#8221; of `Ali (ra), and the events of Ghadir took place 70 days before the Prophet&#8217;s (saw) death yet no one bothered to ask in these 70 days, then later the nation unanimously gave Bay`ah to Abu Bakr (ra) including `Ali (ra) himself. We challenge the author of that Shia website and all his sect, to provide one authentic event within these 70 days, in which someone asks about the appointment of `Ali (ra) or mentions it.<\/p>\n<p style=\"text-align: justify;\">Ghadir666 argues back:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">So the reason why Prophet of Allāh (P) chose a different location (to speak about loving\/befriending the Imām) was to avoid unnecessarily involving those people who were not from Madīnah right?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ok in that case, can our brothers inform us as to why did the Holy Prophet (P) involve the people of Syria ( As-Sūrīyah) Iraq (al-&#8216;Irāq) and Egypt (Miṣr al-ʿArabiyyah) etc., when it is known that they had no issues with the Imām since they were not from Madīnah?<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Does that not make the Prophet &#8220;unjust&#8221; towards these people?<\/span><\/p>\n<p style=\"text-align: justify;\">I&#8217;ll respond to this in the speed of light, the matter isn&#8217;t that of justice or injustice, the matter is that this topic was opened and addressed at Khum, since most un-involved people weren&#8217;t present, and probably since this topic was opened at that location, or that it was opened during Hajj but he (saw) decided to deal with it later.<\/p>\n<p style=\"text-align: justify;\">I mean a little common sense could be appreciated from our Shia friends, their questions and arguments are quite dumb.<\/p>\n<p style=\"text-align: justify;\">Now on to an Arabic geography lesson, it just bothered me that the Rafidhi refers to Sham as &#8220;al-Suriyah&#8221;&#8230; What in God&#8217;s name is &#8220;al-Suriyah&#8221;?<\/p>\n<p style=\"text-align: justify;\">Suriyah is the ANCIENT NON-ARABIC (Arabised though) name for Syria, hence you can&#8217;t write it in Ta`reef form with Alif and lam, just as we don&#8217;t write Iran as &#8216;Al-Iran&#8217;. The Islamic and classical term for Syria is AL-SHAAM (pronounced ASH-SHAAM) i.e. الشام.<\/p>\n<p style=\"text-align: justify;\">As for Egypt, then Egypt also used to be a (majority, except few Arab Beduin tribes) a non-Arab country, hence there is no such a thing as &#8216;Misr Al-Arabiyyah&#8217;, rather it is simply MISR as the Prophet (saw) and Sahabah called it.<\/p>\n<p style=\"text-align: justify;\">Then Ghadir666 went on to savage the Arabic language more:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ok in that case, can our brothers inform us as to why did the Holy Prophet (P) involve the people of Syria ( As-Sūrīyah) Iraq (al-&#8216;Irāq) and Egypt (Miṣr al-ʿArabiyyah) etc., when it is known that they had no issues with the Imām since they were not from Madīnah?<\/span><\/p>\n<p style=\"text-align: justify;\">&#8220;As-Suriyah&#8221;?  They&#8217;re called the people of al-Shaam, not &#8220;As-Suriyah&#8221;, that&#8217;s not even Arabic!<\/p>\n<p style=\"text-align: justify;\">The land of al-Shaam (Syria, Palestine, Jordan, Lebanon) was opened also during the era of `Umar ibn al-Khattab (ra), by armies headed by Khalid ibn al-Walid (ra) and abu `Ubaydah bin al-Jarrah (ra), all of which are cursed by the fake Shia of our days.<\/p>\n<p style=\"text-align: justify;\">In other words Ghadir Khum was no major gathering point for Syrians or Egyptians or `Iraqis since their numbers were very few, most inhabitants of those regions were not Muslim (later on, many of the Sahabah would go and live in these lands after the conquests), as for Ghadir786, they should frame the following picture in their Hussayniyyah and memorize it:<\/p>\n<p style=\"text-align: justify;\"><a href=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/02\/ConquestMap.jpg\" rel=\"external nofollow\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-950\" src=\"http:\/\/twelvershia.net\/wp-content\/uploads\/2014\/02\/ConquestMap.jpg\" alt=\"ConquestMap\" width=\"578\" height=\"327\" srcset=\"https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/ConquestMap.jpg 578w, https:\/\/www.twelvershia.net\/wp-content\/uploads\/2014\/02\/ConquestMap-300x169.jpg 300w\" sizes=\"auto, (max-width: 578px) 100vw, 578px\" \/><\/a><\/p>\n<p style=\"text-align: justify;\">Finally Ghadir666 says that the matter was already settled in person between Buraydah (ra) and the Prophet (saw), so the incident at Yemen is not connected with the incident of Ghadir, he says:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The only basis that the Sunnīs rely upon to combine the Yemen issue with the al-Ghadīr incident is the statement of the Messenger of Allāh (P): &#8221; Of whoever I am the &#8220;Mawlā&#8221; &#8216;Alī is his Mawlā&#8221; which was used at two separate locations but what they IGNORE is the fact that at first it was used for a specific case and as an indication of the &#8220;future&#8221; Leader but later at al-Ghadīr the declaration was made OFFICIAL by the command of Allāh in reference to the verse 5:67.<\/span><\/p>\n<p style=\"text-align: justify;\">We say: Buraydah raised the issue, he received the response, but Buraydah wasn&#8217;t the only one who felt jealousy towards `Ali (ra), many of the soldiers did based on the narrations, so then the Prophet (saw) stood up at Ghadir and made this statement openly, so that he may clear any ill-will some people had towards `Ali (ra).<\/p>\n<p style=\"text-align: justify;\">Until here ends the refutation of our brother Ebn Hussein, to which the author of Ghadir786 tried refuting, but sadly his refutation had nothing intelligent in it, and Ebn Hussein re-refuted the refutation of Ghadir786, but no need for it to be honest, as what we he wrote above is more than enough, Ghadir786 ended up wasting his and his readers time with that last one.<\/p>\n<p style=\"text-align: justify;\">He still insisted that the Prophet (saw) never announced the Wilayah of `Ali (ra) at `Arafah as the people needed &#8220;refreshment&#8221;, so he moved on to another location to announce it there&#8230;<\/p>\n<p style=\"text-align: justify;\">He said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Naturally by the end of the Hajj rites, people were drained out and needed refreshing.<\/span><\/p>\n<p style=\"text-align: justify;\">And he said:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">To give the matter of Leadership a fresh start, a fresh thought and a fresh end, he chose a different location for many reasons.<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">1) To give it a unique position in Islam&#8230;<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">2) A distinctive attention&#8230;<\/span><\/p>\n<p style=\"text-align: justify;\">I say, this contradicts even the Shia narrations, according to their authentic narrations the Prophet (saw) was afraid to announce the Wilayah at `Arafah as he feared the people would reject Islam, then Allah revealed verses warning him to not delay announcing the matter, so he announced it at Khum.<\/p>\n<p style=\"text-align: justify;\">I add to his two points a third point, that if he (saw) had announced this at Makkah, then foolish people like the author of Ghadir786 would mis-understand, so in order to avoid the confusion, and in order to not give the deviants an excuse for their deviancy, he went and announced it after Hajj, after the farewell sermon, in an un-important location, when most people weren&#8217;t present, AFTER the completion of the religion. The same thing happened when the Prophet (saw) appointed `Ali (ra) over the women and children in Madinah, and he left with his companions to Tabuk, he said: &#8220;Do not be sad, You are to me as Harun is to Musa, but there is no prophet-hood after me.&#8221; This last part was to refute those deviants like the author of Ghadir786 who may have understood that `Ali (ra) is a prophet, or that this is some type of divine appointment.<\/p>\n<p style=\"text-align: justify;\">May Allah save us from the ignorance and stubbornness, how these folks invent new unconvincing arguments is beyond me and both their new argument and their authentic narration make no sense. For why would people who sacrificed all for Islam, people who disowned their gods, fought their parents, abandoned their homes and wealth, for the sake of Allah and in order to please his messenger (saw), suddenly they&#8217;ll reject the entire religion simply because `Ali (ra) was mentioned!?<\/p>\n<p style=\"text-align: justify;\">Those who believe in this narration and those who come up with such arguments they themselves need &#8220;refreshment&#8221;, as we feel their brains are blocked.<\/p>\n<p style=\"text-align: justify;\">wal-Salamu `Aleykum,<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response by Ebn Hussein (edited by Hani al-Tarabulsi) to the article on the Ghadir786 website, which was entitled: WHY DIDN&#8217;T THE PROPHET OF ALLĀH (P) HIGHLIGHT THE ISSUE OF COMPLAINTS AGAINST IMĀM  &#8216;ALĪ (as) AT &#8216;ARAFĀT? which <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/24\/response-to-why-didnt-the-prophet-of-allah-p-highlight-the-issue-of-complaints-against-imam-ali-as-at-arafat\/\" title=\"Response to: WHY DIDN&#8217;T THE PROPHET OF ALLĀH (P) HIGHLIGHT THE ISSUE OF COMPLAINTS AGAINST IMĀM  &#8216;ALĪ (as) AT &#8216;ARAFĀT?\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":950,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[],"class_list":{"0":"post-949","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/949","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=949"}],"version-history":[{"count":8,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/949\/revisions"}],"predecessor-version":[{"id":2750,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/949\/revisions\/2750"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/950"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=949"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=949"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=949"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}