{"id":959,"date":"2014-02-26T19:20:27","date_gmt":"2014-02-26T19:20:27","guid":{"rendered":"http:\/\/twelvershia.net\/?p=959"},"modified":"2014-02-28T00:15:09","modified_gmt":"2014-02-28T00:15:09","slug":"response-to-farid-and-hadith-al-wilayah-part-2","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/26\/response-to-farid-and-hadith-al-wilayah-part-2\/","title":{"rendered":"Response to: Farid and Hadith Al-Wilayah (part 2)"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=959\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\">The following is a follow-up response by Farid to the Ghadir786 website, which can be found <a href=\"http:\/\/www.ghadir786.com\/articles\/our-refutations\/farid-s-reply-against-our-article-called-farid-and-%E1%B8%A5ad%C4%ABth-al-wil%C4%81yah\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">For the new readers, click <a href=\"http:\/\/twelvershia.net\/2014\/02\/14\/response-to-farid-and-hadith-al-wilayah\/\" rel=\"external nofollow\">here<\/a>, to see our previous refutation of him and understand what this is all about.<\/p>\n<p style=\"text-align: justify;\">For those who are familiar with the previous articles, please follow along InshaAllah.<\/p>\n<p style=\"text-align: justify;\">Ghadir786 have come up with some counter arguments that deserve a response.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 1: The Allegation that Sunni Scholars Rely on Assumption<\/strong><\/p>\n<p style=\"text-align: justify;\">We are in agreement with Ghadir786 that Sunni scholars rely on assumptions when grading Hadiths. Similarly, Shia scholars do the same. When receiving a chain with a weak narrator, both Sunni and Shia scholars assume that the narrator may have made a mistake. This assumption is based upon evidences, like the weakness of the narrator’s memory, or his going against other more reliable narrators, or due to him narrating the same event with different wordings each time. However, even though Hadith scholars from both schools grade this narration weak, there is a possibility that the narration is in fact authentic, and that this weak narrator actually got this Hadith right.<\/p>\n<p style=\"text-align: justify;\">However, it is due to the high likelihood that the narration is in fact incorrect that the scholars have decided not to authenticate it. The same applies to narrations that seem authentic. Scholars assume that it is authentic due to evidence. However, in many cases, their gradings are not made with complete and absolute certainty, but rather, the high likelihood.<\/p>\n<p style=\"text-align: justify;\">In other words, when Abdul Ghani bin Sa’eed weakened the narration of Abi Balj, it was due to evidences that led him to holding this view. It was not out of complete certainty, but it was an assumption based on critical thinking and evidence.<\/p>\n<p style=\"text-align: justify;\">Question,<\/p>\n<p style=\"text-align: justify;\">If we were to accept all weak narrations, not necessarily fabricated but simply the weak ones, if we accept them as authentic will there be contradictions? Will the Prophet (saw) be saying something in one narration and saying the opposite in another? The answer is YES. If we were to accept the narrations of the weak narrators we will have so many contradictions on our hands that would shake the foundations of the religion.<\/p>\n<p style=\"text-align: justify;\">If we understand this simple basic concept, that narrators with weakness do not narrate accurate narrations, nor do they know the ABCs of the art of narrating, we can then understand why the scholars don&#8217;t rely on them in religion.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 2: Ghadir786 Provide Evidence that Amr bin Maymoon Heard from Ibn Abbas<\/strong><\/p>\n<p style=\"text-align: justify;\">Ghadir786, in order to do this, included six narrations in which Abu Balj narrates from Amr bin Maymoon from Ibn Abbas. Upon closer inspection, we found that the Ghadir786 has in fact three narrations, but that they were repeated through different chains. The first two narrations show that Ali was the first to pray\/accept Islam after Khadija. The second narration is that the Prophet (salalahu alaihi wa salam) ordered closing all the doors except for the door of Ali. The third narration is that Ali slept in the Prophet’s (salalahu alaihi wa salam) bed.<\/p>\n<p style=\"text-align: justify;\">Even more ironic is that these three narrations are in fact one narration. When we return to Fadha’il Al-Sahaba by Imam Ahmad 2\/682, we actually find that Abu Balj narrated this from Amr bin Maymoon from Ibn Abbas in a single Hadith, and that it was later split into three different Hadiths.<\/p>\n<p style=\"text-align: justify;\">حدثنا عبد الله قال حدثني أبي قثنا يحيى بن حماد قثنا أبو عوانة قثنا أبو بلج قثا عمرو بن ميمون : قال اني لجالس الى بن عباس إذ أتاه تسعة رهط قالوا يا أبا عباس اما ان تقوم معنا واما ان تخلو بنا عن هؤلاء قال فقال بن عباس بل انا اقوم معكم قال وهو يومئذ صحيح قبل ان يعمى قال فابتدأوا فتحدثوا فلا ندري ما قالوا قال فجاء ينفض ثوبه ويقول اف وتف وقعوا في رجل له عشر وقعوا في رجل قال له النبي صلى الله عليه و سلم لابعثن رجلا لا يخزيه الله ابدا يحب الله ورسوله قال فاستشرف لها من استشرف قال أين علي قالوا هو في الرحى يطحن قال وما كان أحدكم يطحن قال فجاء وهو أرمد لا يكاد أن يبصر قال فنفث في عينه ثم هز الراية ثلاثا فأعطاها إياه فجاء بصفية بنت حيي قال ثم بعث فلانا بسورة التوبة فبعث عليا خلفه فاخذها منه وقال لا يذهب بها الا رجل مني وانا منه قال وقال لبني عمه أيكم يواليني في الدنيا والآخرة قال وعلي جالس معهم فقال علي انا اواليك في الدنيا والآخرة قال فبركه ثم اقبل على رجل رجل منهم فقال أيكم يواليني في الدنيا والآخرة فأبوا قال فقال أنت وليي في الدنيا والآخرة قال وكان أول من آمن من الناس بعد خديجة وأخذ رسول الله صلى الله عليه و سلم ثوبه فوضعه على علي وفاطمة وحسن وحسين فقال إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا قال وشرى علي بنفسه لبس ثوب النبي صلى الله عليه و سلم ثم نام مكانه قال وكان المشركون يرمون رسول الله صلى الله عليه و سلم فجاء أبو بكر وعلي نائم قال وأبو بكر يحسب انه نبي الله قال فقال يا نبي الله قال فقال علي ان نبي الله قد انطلق نحو بئر ميمون فأدركه قال فانطلق أبو بكر فدخل معه الغار قال وجعل علي يرمي بالحجارة كما كان يرمي نبي الله وهو يتضور قد لف رأسه في الثوب لا يخرجه حتى أصبح ثم كشف عن رأسه فقالوا انك للئيم كان صاحبك نرميه فلا يتضور وأنت تضور وقد استنكرنا ذلك قال وخرج بالناس في غزوة تبوك قال فقال له علي اخرج معك قال له نبي الله صلى الله عليه و سلم لا فبكى علي فقال له اما ترضى ان تكون مني بمنزلة هارون من موسى الا انك ليس نبي انه لا ينبغي ان اذهب الا وأنت خليفتي قال وقال له رسول الله صلى الله عليه و سلم أنت ولي كل مؤمن بعدي ومؤمنة قال وسد أبواب المسجد غير باب علي قال فيدخل المسجد جنبا وهو طريقه ليس له طريق غيره قال وقال من كنت مولاه فان مولاه علي قال وأخبرنا الله في القرآن انه قد رضي عنهم عن أصحاب الشجرة فعلم ما في قلوبهم هل حدثنا انه سخط عليهم بعد قال وقال نبي الله صلى الله عليه و سلم لعمر حين قال ائذن لي فاضرب عنقه قال وكنت فاعلا وما يدريك لعل الله عز و جل قد اطلع على أهل بدر فقال اعملوا ما شئتم<\/p>\n<p style=\"text-align: justify;\">This often happens, one giant Hadith can be split by different authors into different parts, so the reader would assume that they&#8217;re two or three narrations however the reality is that it&#8217;s just one single narration originally.<\/p>\n<p style=\"text-align: justify;\">In other words, there is no doubt that this is the only Hadith in which Amr bin Maymoon is said to have heard from Ibn Abbas.<\/p>\n<p style=\"text-align: justify;\">Ghadir786 also provided a weak narration in which Shu’ba narrates from Abi Balj from Amr bin Maymoon in order to establish that Abu Balj did hear from him. However, this point has never been raised since that was never an issue of contention.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 3: Does the Possibility of Meeting a Narrator Make a Hadith Authentic if their Meeting was not Established?<\/strong><\/p>\n<p style=\"text-align: justify;\">In short, the answer is yes. Imam Muslim stated that this is the case and that there is a consensus about this. Ghadir786 quoted this statement of Muslim in Arabic but did not choose to translate it. Imam Ahmad is included in that consensus and it has been established through numerous examples that he accepts such narrations. See Ijma’a Al-MuHaditheen by Hatim Al-Shareef (p. 136).<\/p>\n<p style=\"text-align: justify;\">However, why does he weaken this Hadith then since there is little doubt that these two men did meet? The possibilities are numerous. Other than the oddness of the chain, since this is the only narration that suggests this, is the fact that Amr bin Maymoon was very old. He witnessed the pre-Islamic days and even narrated from Sahaba as early as Mu’ath bin Jabal (d. 18 AH). Therefore, it is unlikely that he would continue to be narrating Hadiths from Sahaba as young as Ibn Abbas (d. 68 AH). The most obvious reason is that Abu Balj is weak in the eyes of Imam Ahmad, and therefore, he felt that it cannot be established that Amr bin Maymoon narrated from Ibn Abbas. See Al-Kuna by Ibn Abd Al-Barr 1\/471 (Mu’asasat Tabook edition).<\/p>\n<p style=\"text-align: justify;\"><strong>Section 4: On Different Wordings<\/strong><\/p>\n<p style=\"text-align: justify;\">Ghadir786 argues:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">If we were to abide by Farid&#8217;s comprehension then we would be forced to DENY the words: &#8220;WALĪ OF THE BELIEVERS&#8221; too because in some reports we do not have such words recorded\/narrated also:<\/span><\/p>\n<p><span style=\"color: #800000;\">Ṣaḥīḥ Bukhārī:<\/span><\/p>\n<p><span style=\"color: #800000;\">Narrated Buraida: The Prophet sent &#8216;Ali to KhAlid to bring the Khumus (of the booty) and I hated Ali, and &#8216;Ali had taken a bath (after a sexual act with a slave-girl from the Khumus). I said to KhAlid, &#8220;Don&#8217;t you see this (i.e. Ali)?&#8221; When we reached the Prophet I mentioned that to him. He said, &#8220;O buraida! Do you hate Ali?&#8221; I said, &#8220;Yes.&#8221; He said, &#8220;Do you hate him, for he deserves more than that from the Khumlus.&#8221; (Book #59, Hadith #637)<\/span><\/p>\n<p><span style=\"color: #800000;\">That&#8217;s just one example amongst many. Incidents and statements have been narrated in various forms.<\/span><\/p>\n<p style=\"text-align: justify;\">The fine people at Ghadir786 have made the mistake of assuming that I hold the view that all additions are to be rejected. This claim was never made by me, or more importantly any reputable Sunni scholar of Hadith. The correct view is that additions that lack evidence are to be rejected. It was already demonstrated in our last refutation that the statement “wali of the believers” has been established through multiple authentic chains. So, there is little doubt that it is indeed authentic.<\/p>\n<p style=\"text-align: justify;\">On the other hand, it has been demonstrated as well, in our previous rebuttal, that all the narrations that have the addition of “after me” are problematic. Moreover, they cannot be compared to in strength to the versions of the Hadith without the aforementioned addition.<\/p>\n<p style=\"text-align: justify;\">We conclude the same way we concluded our last article:<\/p>\n<p style=\"text-align: justify;\">Therefore, the addition of “After Me” is not acceptable.<\/p>\n<p style=\"text-align: justify;\">We Ahlul-Sunnah believe in the authentic and popular text of Hadith Ghadeer Khumm, The Hadith that says “Whoever considers me his Mawla, `Ali is also his Mawla”, as for altered and corrupted versions of this text, we reject them.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a follow-up response by Farid to the Ghadir786 website, which can be found here. For the new readers, click here, to see our previous refutation of him and understand what this is all about. For those who <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/26\/response-to-farid-and-hadith-al-wilayah-part-2\/\" title=\"Response to: Farid and Hadith Al-Wilayah (part 2)\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,5],"tags":[],"class_list":{"0":"post-959","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith","8":"category-imamah"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/959","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=959"}],"version-history":[{"count":5,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/959\/revisions"}],"predecessor-version":[{"id":970,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/959\/revisions\/970"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=959"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=959"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=959"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}