{"id":964,"date":"2014-02-26T21:20:21","date_gmt":"2014-02-26T21:20:21","guid":{"rendered":"http:\/\/twelvershia.net\/?p=964"},"modified":"2016-08-30T13:00:43","modified_gmt":"2016-08-30T13:00:43","slug":"response-to-khalid-bin-walid-portrait-of-a-war-criminal","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/02\/26\/response-to-khalid-bin-walid-portrait-of-a-war-criminal\/","title":{"rendered":"Response to Khalid bin Walid: Portrait of a War Criminal"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=964\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a refutation to the ShiaPen article entitled: Response to Khalid bin Walid: Portrait of a War Criminal, which can be found <a href=\"http:\/\/www.shiapen.com\/comprehensive\/khalid-bin-walid.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">Readers need to be aware that the ShiaPen article is actually a refutation to an earlier article written by the Ansar.org team.<\/p>\n<p style=\"text-align: justify;\">It is known, by all the Muslim laymen, let alone the scholars of Islam, that Khalid bin Al-Waleed was a primary cause in the victory of the Muslims upon the Romans in the battle of Mu’tah. The name Khalid bin Al-Waleed is also synonymous with the title the “Sword of Allah”. ShiaPen do not even attempt to provide any refutation to the fact that the Prophet (salalahu alaihi wa salam) gave this title to Khalid. Ignoring this aspect of his biography is perhaps the best they can do after all.<\/p>\n<p style=\"text-align: justify;\">There are no doubts that Khalid bin Al-Waleed was given such a title, and this was documented through authentic chains from Anas bin Malik in Al-Bukhari, Abdullah bin Ja’afar in Musnad Ahmad, and Abdullah bin Abi Awfa in Mustadrak Al-Hakim. The hadith was also narrated through Abu Bakr Al-Sideeq and Abu Huraira, as well as through other Tabi’een, but those are weak in strength, and the previous three authentic narrations are sufficient for all Sunnis with an objective heart to accept it.<\/p>\n<p style=\"text-align: justify;\">Carrying on, in the article published by ShiaPen, we find several accusations pointed towards Khalid bin Al-Waleed. These are accusations of rape, brutality, and general brutality. We have these accusations on one side, in the form of narrations, and on the other side, we have this authentic report from the Messenger (salalahu alaihi wa salam), giving Khalid a most grandiose title. This reason alone is sufficient to cast doubt upon the narrations that ShiaPen has provided. However, Ahl Al-Sunnah are proud of their objectivity, which is why we have taken the time to study these texts in order to come to a more complete conclusion of Khalid bin Al-Waleed’s character.<\/p>\n<p style=\"text-align: justify;\">Accusation #1 – The Killing of Malik bin Nuwaira<\/p>\n<p style=\"text-align: justify;\">ShiaPen state the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We know that the filthy Nawasib try their best to legitimize the brutal killing of people by their hero Khalid bin al-Walid on the premise that those killed were Murtad (apostates) and the legitimate Shari penalty was exercised on them. We will counter this particular ‘allegation’ later in the chapter but in case the Nawasib make any attempt to pollute the ‘past’ of Malik bin Nuwayrah and his brother Mutammim bin Nuwayrah and suggest they were mere common Muslims who (allegedly) became Murtad after the Prophet’s death, we deem it appropriate to shed some light on them. The reality is that both individuals were not common Muslims, but were like all other companions of Holy Prophet (s) who had entered the pale of Islam.<\/span><br \/>\n<span style=\"color: #800000;\">It would be relevant to mention the Shi’a view of Malik bin Nuwayrah, so that after reading the entire article, all knowledge seekers (amongst both Sunni and Shi’a) can make a more informed conclusion. Ibn Shazan records in Al-Fadael, page 75:<\/span><br \/>\n<span style=\"color: #800000;\">Al-Bara bin Azeb said: When we were sitting with Allah’s Messenger (s) a delegation from Bani Tammim (tribe) came to Him (s). Malik bin Nuwayra said: ‘Oh Allah’s Messenger, teach me faith (Iman). Allah’s Messenger said: ‘To testify that there is no god but Allah only, and I’m the messenger of Allah, pray the five prayers, fast during the month of Ramdhan, pay Zakat, perform pilgrimage to (Allah’s) house, and follow my Wasi after me, and he (prophet) pointed his hand to Ali. And don’t shed blood, don’t steal, don’t betray, don’t eat orphan’s money, don’t drink alcohol and follow my laws, permit what is lawful and forbid what is unlawful, give the rights from your own self to the poor and strong, to the old and young. Till (the prophet) mentioned to him the Islamic laws. (Malik) said: ‘Oh Allah’s messenger, I’m a man who quickly forgets, please repeat again’. Then He (s) repeated, then he (Malik) left pulling his cloth and saying: ‘By the God of the house, I learnt faith (Iman).’<\/span><br \/>\n<span style=\"color: #800000;\">When he (Malik) went far away from Allah’s messenger, He (s) said: ‘Who ever wants to see a man of heaven, he should look at this man.’ Abu Bakr and Umar said: ‘Oh Allah’s messenger, who are you referring to?’ He (s) looked down to the earth, then they (Abu Bakr &amp; Umar) followed him (Malik) and said to him: ‘Good news from Allah and His messenger to you to have been promised Paradise.’ He (Malik) replied: ‘May Allah bless you if you are testifying by what I testify, because you learnt what Prophet Muhammad taught me. But if you don’t, then may Allah not bless you.’ Abu Bakr said: ‘Don’t say that, I’m the father of Ayesha, the wife of the prophet.’ He (Malik) said: ‘What do you want ?’ They (Abu Bakr &amp; Umar) said: ‘You are from the people of Paradise, so ask for forgiveness for us’. He (Malik) said: ‘May Allah never forgive you, you leave the Messenger of Allah who owns intercession and ask me for forgiveness!’ Then they returned back and signs of sadness appeared on their faces, when Allah’s Messenger saw them, He smiled and said: ‘Is their sadness because of truth?’<\/span><br \/>\n<span style=\"color: #800000;\">When Allah’s Messenger died and Bani Tamim (tribe) returned to Madina with Malik bin Nuwaira being with them, he went to see as to who became the successor after Allah’s messenger, he entered the mosque on Friday and Abu Bakr was giving an address on the pulpit. He (Malik) looked at him and said: ‘Oh brother of Taim’. (Abu Bakr) said: ‘Yes’. He (Malik) said: ‘Where is the Wasi of Allah’s messenger, who ordered I was ordered to follow?’ They (people) said: ‘Oh you desert Arab, things have changed.’ (Malik) said: ‘By Allah, nothing has changed, but you betrayed Allah and His messenger.’ Then he (Malik) got closer to Abu Bakr and said: ‘Who allowed you to climb onto the pulpit while the Wasi of Allah’s Messenger is here?’. Abu Bakr said: ‘Throw out this desert Arabian who urinates on his heels from Allah’s Messenger mosque.’ Qunfud and Khalid bin al-Walid went to him and kept pushing him until they removed him from the mosque.<\/span><br \/>\n<span style=\"color: #800000;\">Then he (Malik) rode on his camel and said (poem): ‘We obeyed Allah’s messenger as long he was amongst us, Oh people, what I have to do with Abu Bakr….’ When every thing was under Abu Bakr’s control, he sent Khalid bin al-Walid and said to him: ‘You heard what Malik said in front of the people, I’m worried that he would cause a crack we wont be able to fix. Kill him.’ When Khalid arrived (to Malik’s land) he (Malik) rode on his horse and he was a knight equal to thousand knights, hence Khalid was scared of him, therefore he (Khalid) gave him oath, and then when (Malik) dropped his weapon, Khalid betrayed him he killed him, placed his head in a cooking pot, and married his wife the same night, raping her like a donkey.’<\/span><br \/>\n<span style=\"color: #800000;\">Also according to the Shia source al-Estighatha by Abu al-Qasim al-Kufi (d. 352 H), Volume 1 page 7, Malik’s tribe refused to submit Zakat to Abu Bakr because they believed that they were supposed to submit it to Ali bin Abi Talib (as).<\/span><\/p>\n<p style=\"text-align: justify;\">We respond to all of the above with this:<\/p>\n<p style=\"text-align: justify;\">Ahl Al-Sunnah do not take narrations from liars, let alone late Imami Rafidhi historians.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continue by providing a narration where in which Khalid purposefully kills Malik while knowing that he is a Muslim:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abdulrazaq – Mu’amar – al Zuhari –from- Aba Qutadah said: During Reda (days), we marched to Ahl Abyaat and reached there at sunset, then we raised our spears, hence they asked: ‘Who are you?’ We replied: ‘We are slaves of Allah.’ They said: ‘We are slaves of Allah too.’ Then Khalid arrested them and when it was morning he ordered their beheading. Then I said: ‘Oh Khalid! Fear Allah, this is not allowed for you.’ He (Khalid) replied: ‘Stay (back); this is not your business.’ Then Abu Qutadah swore by Allah never to march with Khalid for any war. Qutadah said:‘The desert Arabs encouraged him (Khalid) on killing them for the sake of booties and that was Malik bin Nuwayrah’s case.’<\/span><br \/>\n<span style=\"color: #800000;\">Al-Musanaf, Volume 10 page 174 Tradition 18721<\/span><\/p>\n<p style=\"text-align: justify;\">We respond:<br \/>\nThe narration is disconnected, since Al-Zuhri only heard narrations from the Sahabah that died very late, like Anas bin Malik. Abu Qatada however, died before that by decades, and this is common knowledge to all students of Hadith.<\/p>\n<p style=\"text-align: justify;\">ShiaPen also provide another Hadith in attempt to prove that Malik’s family received some blood money, implying that he is a Muslim:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ali bin Muhammad – Abi Daeb – al-Zuhari – Salim – his father that he said: Abu Qutada came to Abu Bakr and informed him of the murder of Malik and his companions, hence he (Abu Bakr) became extremely aggrieved. Abu Bakr then wrote (a message) to Khalid, and he (Khalid) came to him. Abu Bakr said: ‘Can it be more than Khalid interpreted and made a mistake? Then Abu Bakr sent Khalid back and paid blood money for Malik bin Nuwayrah and returned the booty.<\/span><br \/>\n<span style=\"color: #800000;\">Tarikh Ibn Asakir, Volume 16 page 254<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak since Ibn Abi Dhi’ib is weak in his narration from Al-Zuhri. This is the position stated by Ahmad bin Hanbal and Ali bin Al-Madeeni. See Mizan Al-I’itidal 6\/229.<br \/>\nShiaPen also make the argument that Abu Qatada and other witnessed Malik bin Nuwairah performing prayers, however, this too cannot be found in any authentic chains. See Tareekh Khalifa bin Khayyat p 53.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then argue that Malik bin Nuwairah made an oath, which implied that he was a Muslim:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Imam Tabarani records the following words of Mutammim in Muajam al-Kabeer, Volume 8 page 294:<\/span><br \/>\n<span style=\"color: #800000;\">Abu Khalifa al-Fadhl bin Habab narrated from Muhammad bin Salam al-Jumahi from Abu Ubaida, who said: Dharar bin al-Auwzor the one who killed Malik bin Nuwaira, therefore Mutammim bin Nuwaira said a (poem) in that case condemning Khalid bin al-Walid :… ‘you gave him an oath in the name of Allah and then you killed him? Surely if he (Malik) gave you an oath, he would never betray…’<\/span><br \/>\n<span style=\"color: #800000;\">Imam Abi Bakr al-Haythami also recorded this tradition from Tabarani and stated:<\/span><br \/>\n<span style=\"color: #800000;\">“The narrators are reliable”<\/span><br \/>\n<span style=\"color: #800000;\"> Majm’a al-Zawaed, Volume 6 page 222 Tradition 10391<\/span><br \/>\n<span style=\"color: #800000;\">These words of Mutammim clearly allude to the fact that prior to the murder of Malik, Khalid and Malik exchanged oaths and that too, in the name of Alah (swt). This proves that Mailk was a Muslim, not a Murtad. Moreover, the condemnation of Khalid by Mutammim also proves the same.<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak since Mohammad bin Salaam Al-Jumahi is from a very late level of narrators and his shaikh, Abu Ubaida, presumably Ma’amar bin Al-Muthana, died around the year 200 AH. So, between him and the events of the narration is a very wide gap, which makes the narration weak.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continue by providing a statement from Ibn Hajar, in an attempt to prove that Malik bin Nuwairah was a companion of the Prophet (salalahu alaihi wa salam):<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">It is indeed unfortunate that the shameless Nawasib try to excommunicate a Sahabi to cover up the heinous crime committed by their hero Khalid bin al-Walid, backed by the caliph of the time. Now, let us prove Malik bin Nuwayrah’s faith from a different angle and for this, allow us to introduce the father in law of Malik namely al-Minhal al-Tamimi. Imam Ibn Hajar Asqalani records in Al-Isaba, Volume 6 page 249:<\/span><br \/>\n<span style=\"color: #800000;\">المنهال التميمي: من رهط مالك بن نويرة. له إدراك ذكره الزبير بن بكار في الموفقيات عن حبيب بن زيد الطائي أو غيره. قال: مر المنهال على أشلاء مالك بن نويرة هو ورجل من قومه حين قتله خالد بن الوليد فأخرج من خريطة له ثوباً فكفنه فيه ودفنه<\/span><br \/>\n<span style=\"color: #800000;\">Al-Minhal al-Tamimi: Amongst Malik’s bin Nuwayrah’s relatives. He [Lahu Idraak] converted (during Prophet’s time), al-Zubair bin Bakr mentioned him in al-Muwafaqyat (book)…He said: ‘al-Minhal passed by Malik bin Nuwayrah’s body when Khalid killed him, then he brought a cloth from his bag and shrouded him (Malik) and then buried him.’<\/span><\/p>\n<p style=\"text-align: justify;\">We respond:<br \/>\nThe term “idraak” does not mean met. It means that one was a contemporary of the Prophet (salalahu alaihi wa salam). This is better illustrated with Ibn Hajar’s biography of another Muslim, Bajala bin Abda Al-Tameemi, in which he said:<br \/>\nأدرك النبي صلى الله عليه وسلم ولم يره<br \/>\n“Adraka Al-Nabi (salalahu alaihi wa salam) but did not see him.”<br \/>\nHe ironically titles this chapter: The names of those that adraka Al-Nabi (salalahu alaihi wa salam) but did not meet him.”<br \/>\nRegardless, even if one assumed that Malik bin Nuwairah was at one time a Sahabi, which is unproven, there correct view is that he died as a non-Muslim.<\/p>\n<p style=\"text-align: justify;\">ShiaPen seem to be unaware that even the top Shia historian Al Mufeed stated in his Al Ifsaah p. 41 that Malik bin Nuwaira was an apostate.<\/p>\n<p style=\"text-align: justify;\">ShiaPen continue by providing evidence that Omar condemned Khalid for his actions:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abu Ghalib al-Bana and Abu Abdillah al-Bana narrated from Abu Jaffar bin Maslama from Abu Tahir al-Mukhalis from Ahmad bin Sulaiman from al-Zubair bin Bakr from Mus’ab bin Abdullah, who said:….Umar said: ‘I admonished Khalid for breaking the orders and for what he did with the money., Khalid would distribute the booty amongst the soldiers without informing Abu Bakr. He made decisions that contravened those of Abu Bakr, he killed Malik bin Nuwayra and married his wife. He made peace with the people of Yamama and married the daughter of Maj’a bin Marara. These were met with disapproval by Abu Bakr and he issued Diyat (blood money) to Mutammim bin Nuwayrah and ordered Khalid to divorce Malik’s wife….’<\/span><br \/>\n<span style=\"color: #800000;\">Tarikh Ibn Asakir, Volume 16 page 274<\/span><\/p>\n<p style=\"text-align: justify;\">We respond:<br \/>\nMus’ab Al-Zubairi died in the year 236 AH, and was not an eye witness of the events, which makes the narration not acceptable.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then quote another similar narration:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abu Bakr al-Ansar from al-Hassan bin Ali from Abu Umar bin Haywiyah from Ahmad bin Maroof from al-Hussain bin al-Fehm from Muhammad bin Saad from Muhammad bin Umar from Muhammad bin Abdullah from al-Zuhari from Handala bin Ali al-Aslami who said: ‘…When Khalid arrived at Madina, he entered the mosque of Allah’s Messenger wearing rusty armor and with his sword. There were some arrows in his turban, he passed by Umar but didn’t talk to him, then he came to Abu Bakr, and he heard from Abu Bakr what pleased him, he then left happy. Umar therefore knew that Abu Bakr had pleased him, therefore he didn’t talk to him (Khalid). Umar was angry at him (Khalid) because of what he had done, by killing Malik bin Nuwayrah and marrying his wife and also for what was in his heart against him (Khalid) about Bani Jadhima case’ <\/span><br \/>\n<span style=\"color: #800000;\">Tarikh Ibn Asakir, Volume 16 page 258<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak because it is from the narration of Mohammad bin Omar Al-Waqidi, the infamous liar.<br \/>\nThen ShiaPen quote another. The follow it up with an accusation that Sunnis have distorted Al-Tabaqat Al-Kubra as well:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Imam of Ahle Sunna Mullah Muttaqi Hindi (d. 975 H) in his famed work Kanz ul Ummal quoted a tradition from the esteemed Sunni work ‘Tabaqat al Kubra’ by Imam Ibn Saad which was sufficient to unveil the actual role of Khalid in the case of Malik bin Nuwayrah but the Sahabah worshippers could not tolerate this and tampered with ‘Tabaqat al Kubra’ and removed it. But, the presence of this tradition in Kanz ul Ummal shall make our readers realize why it was essential that the children of Muawiyah delete the primary source. We read the following tradition in Kanz ul Ummal, Volume 5 page 619 Tradition 14091:<\/span><br \/>\n<span style=\"color: #800000;\">Ibn Abi Aun and others narrated that Khalid bin al-Walid claimed that Malik bin Nuwayrah had become Murtad according to the information that he (Khalid) had received. Malik denied this and said: ‘I am a Muslim, I never changed.’ Abu Qutada and Abdullah ibn Umar testified that (Malik is Muslim) but Khalid ordered Dharar bin Al-Auzwar to behead him (Malik). Then Khalid took his (Malik’s) wife. (Umar) said to Abu Bakr: ‘He (Khalid) has performed adultery, you have to stone him’. Abu Bakr said: ‘I can’t stone him; he interpreted hence made a mistake’. (Umar) said: ‘Then dismiss him’. He (Abu Bakr) said: ‘I cannot put the sword back in the sheath which Allah has pulled out on my opponents.’(Ibn Sa’ad).<\/span><\/p>\n<p style=\"text-align: justify;\">The narration exists in a separate work called Al-Juz’ Al-Mutamim li Tabaqat Ibn Sa’ad since the older published edition of the book was based on an incomplete manuscript. The narration is #231 and includes Al-Waqidi again, which makes the narration weak.<br \/>\nShiaPen then decide to list the opinions of scholars that supported some of the claims, like Ibn Abd Al-Barr, Al-Zamakhshari, Ibn Katheer, Mohammad bin Salaam Al-Jumahi, Ibn Al-A’atham, and Al-Diyarbakri.<br \/>\nIn response to this, we quote the original article by Ansar.org, who correctly argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000080;\">Shî‘î authors have the habit of supplying incidents like this with multiple references. In order to fully convince the uninformed Sunnî reader, they will quote not only at-Tabarî as the source for the incident, but also Ibn Kathîr’s al-Bidâyah wan-Nihâyah, Ibn al-Athîr’s al-Kâmil, etc. They conveniently forget that Ibn Kathîr and Ibn al-Athîr, and like them, most later historians, draw directly from at-Tabarî, and have stated as much in their respective introductions. It is thus of no benefit to quote them as separate references, since all they do is quote at-Tabarî. And as for at-Tabarî himself, he has never claimed all the material in his huge work to be the truth. On the contrary, he states very clearly in his introduction:<\/span><br \/>\n<span style=\"color: #000080;\">Whatever is to be found in this book of mine as quoted from some past source, which the reader finds unacceptable or the hearer deems repugnant for the reason that he does not see any authenticity in it or does not find real meaning in it, let it be known that we are not responsible for it. The one responsible for it would be one of those who transmitted it down to us. We for our part have only reproduced what has been transmitted to us.<\/span><\/p>\n<p style=\"text-align: justify;\">Finally, we provide our final verdict regarding this incident, and it is that there are no authentic reports on this matter. Most of the narrations regarding this matter are disconnected or come to us through the report of Al-Waqidi the liar. It is due to this that we find Khalid bin Al-Waleed innocent of the accusations regarding the killing of Malik bin Nuwairah. We furthermore add that we do not believe that Malik bin Nuwairah died as a Muslim, for if this was the case, then he would have been at least included in the earlier books that list the names of the companions. The main four books in the field are the ones that Ibn Al-Atheer based his book Usd Al-Ghaba upon, which are the works of Ibn Mandah, Abu Nu’aim, Ibn Abd Al-Barr, and Ibn Al-Madeeni, and yet, none of them mentioned him.<\/p>\n<p style=\"text-align: justify;\">Ibn Al-Atheer, was left confused by this (see 4\/178), he named him as one of the Arabs who renegated from Islam alongside Musaylamah al-Kazzab in the bio of Khalid, then mentioned that some people said that he died a Muslim after hinting towards the reports we dealt with above, he also does the same  in the bio of ibn Nuwayrah, but it is obvious, when studying the evidences, that there is no authentic proof that Malik bin Nuwairah died as a Muslim.<\/p>\n<p style=\"text-align: justify;\">Accusation #2: Khalid Legitimizes his Junior Officer’s Rape of a Woman Captured in War.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Imam Bayhaqi records the following incident involving the two best mates, Khalid bin Walid and Dharar bin al-Auwzwar:<\/span><br \/>\n<span style=\"color: #800000;\">Abu al-Hussain bin al-Fadhl al-Qatan narrated from Abdullah bin Jaffar bin Darestweh from Yaqub bin Sufyan from al-Hassab bin Rabee from Abdullah bin al-Mubarak from Kahmas from Harun bin Al-Asam who said: Umar bin al-Khatab may Allah be pleased with him sent Khalid bin al-Walid in an army, hence Khalid sent Dharar bin al-Auwzwar in a squadron and they invaded a district belonging to the tribe of Bani Asad. They then captured a pretty bride, Dharar liked her hence he asked his companions to grant her to him and they did so. He then had sexual intercourse with her, when he completed his mission he felt guilty, and went to Khalid and told him about what he did. Khalid said: ‘I permit you and made it lawful to you.’ He said: ‘No not until you write a message to Umar’. (Then they sent a message to Umar) and Umar answered that he (Dharar) should be stoned. By the time Umar’s message was delivered, Dharar was dead. (Khalid) said: ‘Allah didn’t want to disgrace Dharar’<\/span><br \/>\n<span style=\"color: #800000;\"> Sunan al-Bayhaqi, Volume 2 page 365 Tradition 18685<\/span><\/p>\n<p style=\"text-align: justify;\">Harun bin Al-Asam was only considered to be reliable only according to Ibn Hibban, and the scholars have clearly stated that Ibn Hibban is notorious for mentioning anonymous narrators in his book of trustworthy scholars.<br \/>\nFurthermore, Abu Hatim Al-Razi in Al-Jarh wal Ta’deel in the biography of Harun, mentioned that his narration from Omar bin Al-Khattab is disconnected.<br \/>\nIn both cases, the narration is weak and to be rejected.<\/p>\n<p style=\"text-align: justify;\">Accusation #3: Khalid Unjustly Fought Tulaiha bin Khalid.<br \/>\nShiaPen lay out the following argument:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Prior to the campaign that culminated in the murder of Malik bin Nuwayrah, Abu Bakr had launched a similar campaign against a person called Tulaiha, who (like Malik) rejected the illegitimate caliphate of Abu Bakr. Abu Bakr deemed it paramount that this opponent be silenced, he connoted a claim that Tulaiha had claimed Prophethood for himself, and should hence be killed. This task was also given to his loyal pet Khalid bin Walid. The present day Nawasib would no doubt make feeble attempts to support the allegation of Abu Bakr against Tulaiha with the help of some weak narrations, but for our open minded readers, let us cite the words of the reliable Sunni historian, Ibn Atham (d. 314 H), who in his book Al-Fatuh, page 14 records:<\/span><br \/>\n<span style=\"color: #800000;\">وجعلت بنو أسد وغطفان وفزارة يقاتلون بين يدي طليحة بن خويلد أشد القتال وهم ينادون لا نبايع أبا الفصيل يعنون أبا بكر الصديق رضي الله عنه<\/span><br \/>\n<span style=\"color: #800000;\">Bani Asad, Ghatfan and Faraza (tribe) fought sternly in Tulaiha bin Khawaild’s army and they stated: ‘We wont give baya to Abu al-Fasil that referred to Aba Bakr al-Sidiq (ra)’<\/span><\/p>\n<p style=\"text-align: justify;\">First of all, we reject the claim that Abu Bakr needs to provide an extravagant motive in order to enlist the Muhajireen and Ansar. It is common knowledge, amongst both Sunni and Shia schools of thought that several Arab tribes renounced Islam after the death of the Prophet (salalahu alaihi wa salam), and this very fact is supported by the words of Allah:<\/p>\n<p style=\"text-align: justify;\"><strong>يا أيها الذين آمنوا من يرتدّ منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه<\/strong><\/p>\n<p style=\"text-align: justify;\">{O ye who believe! Whoso of you becometh a renegade from his religion, (know that in his stead) Allah will bring a people whom He loveth and who love Him, humble toward believers, stern toward disbelievers, striving in the way of Allah, and fearing not the blame of any blamer.} [Al-Ma’idah 54]<\/p>\n<p style=\"text-align: justify;\">The scholars of the Tabi’een, like Al-Hasan, Al-Dhahhak, Qatada, and Ibn Juraij, all testified that this verse was intended for Abu Bakr, for he fought those that left Islam.<\/p>\n<p style=\"text-align: justify;\">The fact that the tribes have left Islam is sufficient for troops to be mobilized against them.<br \/>\nSecondly, Ibn A’atham is a weak Shi’ee according to Yaqoot Al-Hamawi, and this quote was accepted by Ibn Hajar Lisan Al-Mizan. Brocklemann also accepted that his rendition of history is a Shi’ee version. See Athar Al-Tashayyu ‘ala Al-Riwayaat Al-Tareekhiyah (bio of Ibn A’atham) for evidences of his Tashayyu’.<\/p>\n<p style=\"text-align: justify;\">Accusation #4: Khalid Kills a Woman on the Battlefield.<\/p>\n<p style=\"text-align: justify;\">ShiaPen argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Imam of Nawasib Ibn Kathir records in Sirah al-Nabawyiah, Volume 3 page 638:<\/span><br \/>\n<span style=\"color: #800000;\">Ibn Ishaq said: ‘Some of our companions narrated that Allah’s Messenger (s) passed by a woman who had been killed by Khalid bin al-Walid, the people were gathered around her, then He (s) said to some of his companions: ‘Go after Khalid and say to him: ‘Allah’s Messenger orders you not to kill a child, woman, or slave.’<\/span><br \/>\n<span style=\"color: #800000;\"> Sirah al-Nabayiah, Volume 3 page 638<\/span><br \/>\n<span style=\"color: #800000;\">Imam Ahmed records a tradition in his Musnad that has been declared as ‘Sahih’ according to Shaykh Shoib al-Arnaut in the margin of the book:<\/span><br \/>\n<span style=\"color: #800000;\">Rabah bin al-Rabee said: Handhala al-Katib marched with Allah’s messenger to a battle and Khalid bin al-Walid was at the front, then Rabah and the companions of Allah’s Messenger passed by and killed a woman, who had been killed by the front troops. They stopped and stared at her and wondering of her looks, until Allah’s Messenger (s) arrived, they then moved away (to let the Prophet pass) then Allah’s Messenger (s) stood next to her and said: ‘She wasn’t a warrior’. Then He (s) said to some one: ‘Go to Khalid and tell him to not to kill children or slaves’.<\/span><br \/>\n<span style=\"color: #800000;\"> Musnad Ahmad, Volume 3 page 488 Tradition 16035<\/span><\/p>\n<p style=\"text-align: justify;\">The second narration, which is authenticated by Sh. Shoaib, states that Khalid bin Al-Waleed was leading the army. It does not say that he killed the woman, unlike the first narration quoted from Ibn Ishaaq from his companions, which is weak and not reliable since we do not know who his companions were, nor have they witnessed the events.<\/p>\n<p style=\"text-align: justify;\">Accusation #5: Khalid bin Al-Waleed Kills Members of the Tribe of Bani Jatheema in Cold Blood.<\/p>\n<p style=\"text-align: justify;\">ShiaPen state:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">The following incident will also give a sketch to our readers about Khalid bin Walid inhumane characteristics. We read in Sahih al Bukhari Volume 5, Book 59, Number 628:<\/span><br \/>\n<span style=\"color: #800000;\">Narrated Salim’s father:<\/span><br \/>\n<span style=\"color: #800000;\">The Prophet sent Khalid bin Al-Walid to the tribe of Jadhima and Khalid invited them to Islam but they could not express themselves by saying, “Aslamna (i.e. we have embraced Islam),” but they started saying “Saba’na! Saba’na (i.e. we have come out of one religion to another).” Khalid kept on killing (some of) them and taking (some of) them as captives and gave every one of us his Captive. When there came the day then Khalid ordered that each man (i.e. Muslim soldier) should kill his captive, I said, “By Allah, I will not kill my captive, and none of my companions will kill his captive.” When we reached the Prophet, we mentioned to him the whole story. On that, the Prophet raised both his hands and said twice, “O Allah! I am free from what Khalid has done.”<\/span><br \/>\n<span style=\"color: #800000;\">It should be noted that Khlid was sent by the Prophet (s) to invite people to Islam not to kill them. Despite this Khalid personally killed those he was unable to convince to embrace the faith, and asked his collegues to likewise kill those that they had captured, and on what grounds? Just for fun! Thank god his colleagues adopted sense and opted to ustilise their humanity, and rejected these orders that later on turned out to be the correct decision as the Holy Prophet (s) in automatically distanced himself from the brutality committed by Khalid. Are these the types of acts these Nawasib evidence as the ‘bravery’ of Khalid? Ofcourse Ansar.Org put this tragedy down to a mere mistake, they state:<\/span><br \/>\n<span style=\"color: #800000;\">When the news of their execution reached Rasulullah r he lifted his hands and said, “O Allah, I dissociate myself from what Khalid has done.”8 Although Rasulullah r dissociated himself from the haste Khalid made himself guilty of, he did not punish him, since it was an error in judgement on his part. A very regrettable error it was, but it was still an error.<\/span><br \/>\n<span style=\"color: #800000;\">The reality is this was more than just an error of judgement, it was a calculated cold blooded murder of Muslims, merely to settle some old scores. We shall seek to evidence this through the testimony of the Sahaba themselves…<\/span><\/p>\n<p style=\"text-align: justify;\">By going through the narration, we find no evidences that suggest that his actions were a calculated murder. Not only that, but if these actions were calculated, then why did the Prophet (salalahu alaihi wa salam) let Khalid bin Al-Waleed continue to lead armies? This is common knowledge found in the books of Seerah and the Saheehain. More specifically, he sent Khalid to Yemen during his last years, way after the incident of Bani Jathima.<br \/>\nShiaPen though, provide the following narration in order to make their theories sound more reasonable:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">“Abu Bakr Muhammad bin Abdulbaqi from al-Hassan bin Ali from Abu Umar Muhammad bin Abbas from Abdulwahab bin Abi Haya from Muhammad bin Shuja from Muhammad bin Umar from- Abdullah bin Yazid from Eas bin Salamah narrated from his father that when Khalid bin al-Walid came to the Prophet (s) after what he had done to the tribe of Jadhima, Abdurrahman bin Auf discredited Khalid on his deed and said: ‘Oh Khalid, you adopted the manner of Jahiliyah and killed them to avenge your uncle al-Fakeh, may Allah curse you.’ Then Umar bin al-Khatab supported him against Khalid. Khalid said: ‘I avenged your father.’ Abdulrahman ibn Auf said: ‘By Allah, you have lied, I killed the killer of my father with my own hands and Uthman bin Affan is witness to that’. Then he (Abdulrahman) looked at Uthman and said to him: ‘I appeal to you by Allah, do you witness that I killed my father’s killer?’ Uthman said: ‘Yes.’ Then Abdulrahman said: ‘Oh Khalid, shame on you, even if I didn’t kill the killer of my father, would you kill Muslims to take avenge my father?’ Khalid said: ‘Who told you that they were Muslims!’ (Abdulrahman said): ‘All the soldiers testify that you saw them building mosques and testifying that they were Muslims, and then you struck them with the sword.’ (Khalid) said: ‘I had received a message from Allah’s messenger to invade them, therefore I attacked them on the orders of the Prophet (s)’. Abdulrahman said: ‘You have attributed a lie to Allah’s messenger.’ Then (Khalid) became rude with Abdulrahman and Allah’s Messenger became angry and turned his face from Khalid because of what he did to Abdurrahman…” <\/span><br \/>\n<span style=\"color: #800000;\"> Tarikh Ibn Asakir, Volume 16 page 234<\/span><\/p>\n<p style=\"text-align: justify;\">Once again though, ShiaPen have relied on Al-Waqidi the liar for information, which is why the narration goes against the authentic and logical position of the Prophet (salalahu alaihi wa salam) that we have provided above.<\/p>\n<p style=\"text-align: justify;\">Accusation #6: Khalid bin Al-Waleed Mulatilates Malik bin Nuwairah.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Previously we just shed light on the fact that Khalid bin Walid unjustly killed the Sahabi Malik bin Nuwayrah by alleging that he was a Murtad. He then slept with his wife. Let us now reveal the post murder activity done by Khalid to the severed head of this martyred Sahabi. Ibn Kathir records:<\/span><br \/>\n<span style=\"color: #800000;\">وأمر برأسه فجعل مع حجرين وطبخ على الثلاثة قدرا فأكل منها خالد تلك الليلة ليرهب بذلك الأعراب من المرتدة وغيرهم<\/span><br \/>\n<span style=\"color: #800000;\">He (Khalid) ordered that the head (of Malik) be placed with two stones and inserted into a cooking pot, he (Khalid) then ate from it that night in order scare the Arabs and others from being apostates.<\/span><br \/>\n<span style=\"color: #800000;\">al-Bidayah wa al-Nihaya, Volume 6 page 354<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is not included with a chain and is therefore rejected. ShiaPen should know better since we don’t accept narrations from people that barely died a century later, let alone from a book that was written in the eighth century.<\/p>\n<p style=\"text-align: justify;\">Accusation #7: Khalid Didn’t Know How to Pray.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Ibn Asakir records:<\/span><br \/>\n<span style=\"color: #800000;\">Abu Bakr Muhammad bin Abdulbaqi from al-Hassan bin Ali from Abu Umar Muhammad bin Abbas from Ahmad bin Maroof from al-Hussain bin al-Fahm from Muhammad bin Saad from al-Fadhl bin Dukain from Al-Waleed bin Abdullah bin Jamee said: ‘A man whom I trust told me that Khalid bin al-Waleed led the prayer in Hyra (city), hence he read verses from different chapters, then he looked at the people and said: ‘Jihad kept me busy from learning Quran’’. <\/span><br \/>\n<span style=\"color: #800000;\"> Tarikh Ibn Asakir, Volume 16 page 250<\/span><\/p>\n<p style=\"text-align: justify;\">We do not know who narrated this narration, nor do we know if that person was an eye witness to the events, and therefore, we cannot accept this narration as reliable.<\/p>\n<p style=\"text-align: justify;\">Accusation #8: Khalid’s Troops were Alcoholics.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">Abu Bakr Muhammad bin Abdulbaqi from al-Hassan bin Ali from Abu Umar Muhammad bin Abbas from Ahmad bin Maroof from al-Hussain bin al-Fahm from- Muhammad bin Saad from Ibrahim bin Abdullah bin Hatim al-Harawi from Hashem from Awam bin Hushab who said: ‘My people narrated from a man among them whose name is S’as’a: ‘Alcohol was being spread in Khalid bin Walid’s troop’<\/span><br \/>\n<span style=\"color: #800000;\"> Tarikh Ibn Asakir, Volume 16 page 252<\/span><\/p>\n<p style=\"text-align: justify;\">Notice how Awam bin Hawshab narrates from “his people” who narrated from “a man named Sa’sa’a”. All these are anonymous and therefore the Hadith is rejected. It boggles the mind that ShiaPen bothered to discuss the credibility of all the narrators in the chain, when the chain is obviously weak due to these clear flaws.<\/p>\n<p style=\"text-align: justify;\">Accusation #9: Khalid was a Nasibi.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">It should some as no surprise to learn that Khalid bin Walid was a Nasibi, since one possessing habits to commit Haram acts commonly has this Nasibi affliction. In Musnad Ahmad, Volume 5 page 358, we read the confession of Sahabi Abu Buraidah that he was a Nasibi as was Khalid bin Walid:<\/span><br \/>\n<span style=\"color: #800000;\">حدثنا عبد الله حدثني أبي ثنا وكيع ثنا الأعمش عن سعد بن عبيدة عن بن بريدة عن أبيه انه مر على مجلس وهم يتناولون من على فوقف عليهم فقال انه قد كان في نفسي على علي شيء وكان خالد بن الوليد كذلك<\/span><br \/>\n<span style=\"color: #800000;\">Buraida narrated from his father that he passed by a group of people abusing Ali, he stopped there and said: ‘There is something in myself against Ali as is the stance of Khalid bin al-Walid.’<\/span><br \/>\n<span style=\"color: #800000;\"> Musnad Ahmad, Volume 5 page 358 Tradition 23078<\/span><\/p>\n<p style=\"text-align: justify;\">This is from the event that took place in Yemen, when `Ali (ra) took some of the booty for himself (a female servant) and deprived the others, he did so as it was his right, his part of the Khums. So all the soldiers accompanying him held a grudge against him which includes Buraydah and Khalid.<\/p>\n<p style=\"text-align: justify;\">Then they complained to the Prophet (saw) upon their return, he (saw) got angry and said: &#8220;Man Kuntu Mawlahu fa `Aliyun Mawlahu&#8221;.<\/p>\n<p style=\"text-align: justify;\">Which resolved the issue and Buraydah said in a narration: &#8220;Then `Ali became the most beloved person to me after the messenger (saw).&#8221;<\/p>\n<p style=\"text-align: justify;\">This is why the narration quoted above by ShiaPen is not correctly translated, the correct translation is: &#8220;I have had something in my heart against `Ali, and Khalid bin al-Walid was like this too.&#8221;<\/p>\n<p style=\"text-align: justify;\">Then he himself narrates Hadith al-Ghadir which is the greatest of praise for `Ali (ra), what does this mean? It means that this thing they held against `Ali was replaced with loyalty and love after the messenger (saw) said what he said.<\/p>\n<p style=\"text-align: justify;\">Some might weaken this report because of the Tadlis of al-A`mash, however his Tadlis is not harmful in the view of  others.<\/p>\n<p style=\"text-align: justify;\">Accusation #10: Khalid bin Al-Waleed was from an Illegitimate Birth, and is Therefore Doomed to Hell-fire.<\/p>\n<p style=\"text-align: justify;\">ShiaPen disturbingly try to suggest the following:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We have already presented the testimony of the Sahabi Abu Buraidah that Khalid bin Walid had something against Ali bin Abi Talib (as) that made him a Nasibi that automatically renders him a hypocrite. Being a Nasibi is also dependent upon one being of illegitimate lineage. Imam of Ahle Sunnah, Fakhruddin al-Razi said correctly in Tafseer al-Kabeer, Volume 30 page 85:<\/span><br \/>\n<span style=\"color: #800000;\">ولأن الغالب أن النطفة إذا خبثت خبث الولد ولهذا قال عليه الصلاة والسلام لا يدخل الجنة ولد الزنا ولا ولده ولا ولد ولده<\/span><br \/>\n<span style=\"color: #800000;\">If the seed is evil then the progeny will also be evil, therefore the Prophet (s) said: ‘The son of adultery and his son and his grand son shall not enter heaven.’<\/span><\/p>\n<p style=\"text-align: justify;\">Such narrations have been declared as fabrications by Ibn Al-Jawzi and other Hadith scholars. Not only that, but these fabrications go against the Qur’an:<\/p>\n<p style=\"text-align: justify;\"><strong>وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى<\/strong><\/p>\n<p style=\"text-align: justify;\">{Each soul earneth only on its own account, nor doth any laden bear another&#8217;s load.} [Al-An’am: 164]<\/p>\n<p style=\"text-align: justify;\">In conclusion, the accusations by ShiaPen towards Khalid bin Al-Waleed all fall short, for they are all weak. All that stands is the authentic praise of the Prophet (salalahu alaihi wa salam) through several chains. Even though it would be great to add a section regarding the conquests of Khalid bin Al-Waleed (radhi Allah ‘anhu) and his great achievements in the name of Islam, we do believe that the very attempt of doing so in the form of an article would do him a great injustice, for such a work would require at least a volume.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a refutation to the ShiaPen article entitled: Response to Khalid bin Walid: Portrait of a War Criminal, which can be found here. Readers need to be aware that the ShiaPen article is actually a refutation to an <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/02\/26\/response-to-khalid-bin-walid-portrait-of-a-war-criminal\/\" title=\"Response to Khalid bin Walid: Portrait of a War Criminal\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-964","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/964","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=964"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/964\/revisions"}],"predecessor-version":[{"id":3418,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/964\/revisions\/3418"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=964"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=964"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=964"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}