{"id":971,"date":"2014-03-03T19:18:43","date_gmt":"2014-03-03T19:18:43","guid":{"rendered":"http:\/\/twelvershia.net\/?p=971"},"modified":"2014-03-03T19:20:20","modified_gmt":"2014-03-03T19:20:20","slug":"response-to-distortion-committed-by-bukhari-whilst-copying-down-a-tradition-in-his-sahih-pertaining-the-legitimacy-of-sodomy","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/03\/03\/response-to-distortion-committed-by-bukhari-whilst-copying-down-a-tradition-in-his-sahih-pertaining-the-legitimacy-of-sodomy\/","title":{"rendered":"Response to Distortion Committed by Bukhari Whilst Copying Down a Tradition in his ‘Sahih’ Pertaining the Legitimacy of Sodomy"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=971\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to ShiaPen’s article “Distortion Committed by Bukhari Whilst Copying down a Tradition in his ‘Sahih’ Pertaining the Legitimacy of Sodomy.” The article can be found <a href=\"http:\/\/www.shiapen.com\/deception\/bukhari-distortion-in-sodomy-tradition.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">In this article, ShiaPen briefly quote a narration where in which Al-Bukhari has documented a narration but has purposefully left out the last word. ShiaPen argue that this is a case of distortion and that Al-Bukhari wanted to hide the text from readers since it promoted sodomy.<\/p>\n<p style=\"text-align: justify;\">ShiaPen argue the following:<br \/>\n<span style=\"color: #800000;\">Imam Bukhari has recorded this tradition in his ‘Sahih’ with the following chain of narration:<\/span><br \/>\n<span style=\"color: #800000;\">Ishaq (bin Rehwiya) – Nadar – Ibn Aun – Nnaf’i<\/span><br \/>\n<span style=\"color: #800000;\">Now the most interesting part is that Bukhari actually copied down the above statement of Abdullah Ibn Umar from his Shaykh, namely Ishaq bin Rehwiya as mentioned by Ibn Hajar Asqalani:<\/span><br \/>\n<span style=\"color: #800000;\">فقد أخرجها إسحاق ابن راهويه في مسنده وفي تفسيره بالإسناد المذكور ، وقال بدل قوله حتى انتهى إلى مكان ” حتى انتهى إلى قوله نساؤكم حرث لكم فأتوا حرثكم أنى شئتم فقال : أتدرون فيما أنزلت هذه الآية ؟ قلت لا . قال : نزلت في إتيان النساء في أدبارهن<\/span><br \/>\n<span style=\"color: #800000;\"> Ishaq bin Raheweh recorded it in his Musnad and his Tafsir with the same chain, when it reached the part “your wives are tilth to you, so go to your tilth anyhow you will” he said: ‘Do you know what for this verse has been revealed about?’ They said: ‘No’. He replied: ‘It has been revealed in regards to approaching women in their anuses’ <\/span><br \/>\n<span style=\"color: #800000;\">Interestingly whilst citing the said tradition verbatim Bukhari committed deception and did not quote the words of his Shaykh opting to leave a blank, in the hope that the attention plan of his readers would be short enough to confuse them and direct them to the next narration.<\/span><\/p>\n<p style=\"text-align: justify;\">Before even explaining Al-Bukhari’s actions, we start by refuting the ludicrous claim that he attempted to deceive his readers.<br \/>\nThe first and most obvious piece of evidence is that Al-Bukhari chose to include the narration in his Saheeh book. If he wanted to hide away this narration, he could have just as easily not have narrated it, for there is nothing to be gained from his inclusion of the narration in this manner.<\/p>\n<p style=\"text-align: justify;\">Another obvious reason is the existence of this narration with the blank space provided instead of including the word &#8220;Farj&#8221; (vagina). If Al-Bukhari’s intention was to deceive he could have changed the word anus to Farj with ease.<\/p>\n<p style=\"text-align: justify;\">One more obvious reason is that Al-Bukhari included his sources for the narration, in this case, through the path of his shaikh Ishaaq bin Rahawaih, who authored one of the most famous works of his time “The Musnad”, and included this narration in that book. Al-Bukhari also cited his other source, who happened to be Mohammad bin Yahya bin Sa’eed. If it was Al-Bukhari’s intention to deceive, he wouldn’t have so freely referenced his sources when one of his two sources was a very well circulated work of his time.<\/p>\n<p style=\"text-align: justify;\">So, why did Al-Bukhari not include the narration in its complete form?<br \/>\nThe reason is because of Al-Bukhari’s doubt in the authenticity of these words to Ibn `Umar. When returning to Al-Sunan Al-Kubra by Al-Nasa’ee 2\/1418, we find two narrations that suggest that Ibn `Umar said no such thing.<br \/>\nThe first narration:<\/p>\n<p style=\"text-align: justify;\">أخبرنا علي بن عثمان بن محمد بن سعيد بن عبد الله بن نفيل، قال: حدثنا سعيد بن عيسى، قال: حدثنا المفضل، قال: حدثني عبد الله بن سليمان، عن كعب بن علقمة، عن أبي النضر، أنه أخبره أنه قال لنافع مولى عبد الله بن عمر: قد أكثر عليك القول أنك تقول عن بن عمر: أنه أفتى بأن يؤتى النساء في أدبارها؟ قال نافع: لقد كذبوا علي! ولكني سأخبرك كيف كان الأمر: إن ابن عمر عرض المصحف يومًا، وأنا عنده حتى بلغ * (نساؤكم حرث لكم فأتوا حرثكم أنى شئتم) * قال: يا نافع، هل تعلم ما أمر هذه الآية؟ إنا كنا معشر قريش نجبي النساء، فلما دخلنا المدينة، ونكحنا نساء الأنصار، أردنا منهن مثل ما كنا نريد من نسائنا، فإذا هن قد كرهن ذلك، وأعظمنه، وكانت نساء الأنصار إنما يؤتين على جنوبهن، فأنزل الله تعالى * (نساؤكم حرث لكم فأتوا حرثكم أنى شئتم) *<\/p>\n<p style=\"text-align: justify;\">[From abi al-Nadir that he told him that he told Nafi`the servant of  ibn `Umar: &#8220;The sayings has increased against you. They say that you said that ibn `Umar issued a Fatwah permitting anal intercourse?&#8221; Nafi` said: &#8220;They lied on me! But I shall tell you the exact incident. Once ibn `Umar recited the Qur&#8217;an while I was with him till he reached {Your wives are as a tilth unto you}, He said: &#8220;Do you know in what connection this Verse was revealed? We the people of Quraish used to mount women from their backs (in their vagina). So when we entered Medina and married the woman of Ansar, we wanted from them what we wanted from our woman, but they disliked it and thought it to be great (a thing). The women of Medina used to be mounted from front (only), so Allah revealed {Your wives are as a tilth unto you; so approach your tilth when or how ye will}]<\/p>\n<p style=\"text-align: justify;\">As we can see from this narration, Nafi’ rejects that he narrated that Ibn `Umar suggested that intercourse through the anus is Halal, but rather, said that he narrated that Ibn `Umar said that it was Halal to have intercourse from behind the woman, but into her vagina.<\/p>\n<p style=\"text-align: justify;\">In the other narration by Al-Nasa’ee we find the following:<\/p>\n<p style=\"text-align: justify;\">أخبرنا الربيع بن سليمان، قال: حدثنا أصبغ بن الفرج، قال: حدثنا عبد الرحمن بن القاسم، قال: قلت لمالك: إن عندنا بمصر الليث بن سعد يحدث، عن الحارث بن يعقوب، عن سعيد بن يسار، قال: قلت لابن عمر: إنا نشتري الجواري فنحمض لهن؟ قال: وما التحميض؟ قال: نأتيهن في أدبارهن، قال: أو! أويعمل هذا مسلم؟! فقال لي مالك: فأشهد على ربيعة لحدثني، عن سعيد بن يسار أنه سأل ابن عمر عنه؟ فقال: لا بأس به.<\/p>\n<p style=\"text-align: justify;\">[From `Abdul-Rahman bin al-Qasim, he said: I said to Malik: We in Egypt have al-Layth ibn Sa`d who narrates from al-Harith bin Ya`qoub, from Sa`eed bin Yasar, that he said to ibn `Umar: &#8220;We buy the female servants and make Tahmid with them.&#8221; He asked: &#8220;And what is Tahmid?&#8221; He answered: &#8220;We approach them from their anus.&#8221; He (ibn `Umar) said: &#8220;Oh dear! Do Muslims do such a thing!?&#8221; So Malik told me: &#8220;I bear witness that Rabee`ah told me, from Sa`eed ibn Yasar that he asked ibn `Umar about it and he replied: &#8220;No harm in doing so.&#8221;]<\/p>\n<p style=\"text-align: justify;\">In this narration we find the very same problem. Sa’eed bin Yasar narrates from Ibn `Umar both opinions, and like Nafi’s narrations, both of these opinions are narrated through a single student of Ibn `Umar.<\/p>\n<p style=\"text-align: justify;\">It was in light of this that Al-Bukhari could not be certain which of the two narrations is more authentic from the path of Nafi’, for the evidence that suggested that he narrated from Ibn `Umar that the latter permitted anal sex proved to be inconclusive. It was due to this that he left the last word in the narration as blank.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to ShiaPen’s article “Distortion Committed by Bukhari Whilst Copying down a Tradition in his ‘Sahih’ Pertaining the Legitimacy of Sodomy.” The article can be found here. In this article, ShiaPen briefly quote a narration where <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/03\/03\/response-to-distortion-committed-by-bukhari-whilst-copying-down-a-tradition-in-his-sahih-pertaining-the-legitimacy-of-sodomy\/\" title=\"Response to Distortion Committed by Bukhari Whilst Copying Down a Tradition in his ‘Sahih’ Pertaining the Legitimacy of Sodomy\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12,1],"tags":[],"class_list":{"0":"post-971","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-fiqh","8":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/971","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=971"}],"version-history":[{"count":2,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/971\/revisions"}],"predecessor-version":[{"id":974,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/971\/revisions\/974"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=971"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=971"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}